[{"rating": 5.0, "review": "I own three Chromecasts but decided to try one of these out. I'm hooked, its gui is great and streams start much quicker than the Chromecast. I like that I can select what I want to watch from the screen instead of using my phone. I don't have any proof but stream quality does seem better than the Chromecast. Overall, I would buy one of these again and if I didn't already have the Chromecasts I would buy a Fire Stick for the other TV's", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "This works just great.  Pretty simple to hook up and get going.  Highly pleasedd I ordered this", "verified": true, "helpfulness": "0/0", "author": "Stephen L. Disney"}, {"rating": 5.0, "review": "AMAZING.Simply superb for what it does, the Fire TV stick blew me away with the amount of functionality it offered for the price. I bought it for the $19 dollars it cost Prime Members when it was first announced, and I couldn't be happier. The UI is efficient and responsive, the remote works great (unfortunately it runs on AAA batteries), and the app selection is fantastic for a device that's just been released. This is mostly due to the fact that the Stick is essentially a pared down version of the Fire TV set top box, but props nonetheless.That said, it's important to understand that this is essentially a window into Amazon's ecosystem. Netflix, Pandora, and other media apps are there, but they all appear in the Apps section of the store, while Movies/Music/TV options in the menu only offer the option of buying from Amazon's catalogue, or viewing Prime content.Because of this, the Fire TV Stick becomes a lot less useful if you're not a Prime Member (and you don't want to pay every time you sit down to watch TV). Prime members get a great selection of TV shows, Movies, and Prime Music (which is fantastic in its own right), giving them utility across every item in the Fire TV Stick's menu. Non-Prime members, however, will only ever use the Games and Apps sections unless they want to buy a TV show, movie, or song.I haven't felt the need to sideload any apps onto the device just yet - if I ever get around to buying a Fire Game Controller I'll update this review with how games play on the device. Haven't tested the screencasting features either, as I don't have an Android or Fire device.TL;DR - Essential for Prime members with TVs, less great but still good value for those looking to stream video to their television. Good app selection, games pretty much require a controller (as the remote doesn't have buttons).", "verified": true, "helpfulness": "0/0", "author": "Martian"}, {"rating": 1.0, "review": "The interface for the Fire Stick is the worst of any streaming device I have used. The issue is its 95% focused on the movies and shows sold by Amazon. Want to watch Netflix or YouTube? You may have issues even finding them as they are stashed away in a sub menu for your apps. Thankfully if you use them frequently  they will show up in a recent apps menu but if you are pulling up an app you don't use often you will have to dig for it.  This is unacceptable for someone like me that uses a Roku 3. The Roku allows you to sort apps the way you want and its search feature includes multiple apps like Netflix. Amazon only searches through the content they want to sell you. At the end of the day this is a device designed to sell you Amazon content. It doesn't offer Vudu because Amazon wants you buying everything from them. App support overall is much less than Roku and Chromecast. This is a streamer for someone watching Prime or buying from Amazon only. Using it for Netflix can be done better by multiple devices. Even the Apple TV is a superior experience. Lastly, I was also surprised at the issues I had with streaming quality. I tested it on the same WiFi connection and same room as my Roku3 and Chromecast and had streaming hickups with Netflix, WWE and You Tube. I had none of these issues on the other two. I understand the Roku having stronger WiFi, but the Chromecast is a smaller device and still worked better. Consider the Fire only if you are heavily invested in Amazon content. For everyone else get a Roku.Update: Wifi issues continue. I am still having issues with this device streaming unless it is a few feet away from a router. Not sure if the stick is defective or has issues with Cisco routers. My others streaming devices work just fine in every room. At this point I have completely given up on the Fire TV stick. Thankfully it was only $19.", "verified": false, "helpfulness": "4/5", "author": "A. Gaston"}, {"rating": 5.0, "review": "Whoa... so much better than accessing Prime via my Sony system.... super easy plug and play... and it is literally instant access with no buffering/lag!!  What's not to like??", "verified": true, "helpfulness": "0/0", "author": "KP"}, {"rating": 5.0, "review": "Intuitive controls, very cool smartphone app.  Screen saver defaults to pictures on the cloud.  Very nice touch! Took a chance for $19 first day price, wish I bought two!", "verified": true, "helpfulness": "0/0", "author": "Skydog"}, {"rating": 5.0, "review": "Performed perfectly, as expected.  I also have the Fire TV on another TV upstairs and am very happy with it as well.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 3.0, "review": "Easy to use. Nice interface. Program content is a work in progress. Casting video from Android phone and tablet jerky and pixilated. I have a Roku but I thought for the intro price it was worth a try.", "verified": true, "helpfulness": "0/0", "author": "Jerry D."}, {"rating": 4.0, "review": "Having Amazon prime, it makes it must easier to navigate. The toughest part was putting the batteries in the remote.", "verified": true, "helpfulness": "0/0", "author": "Gerald Grewats"}, {"rating": 5.0, "review": "I love it!!! It's fast, efficient, and good quality HD.", "verified": true, "helpfulness": "0/0", "author": "empera13"}]