[{"rating": 1.0, "review": "Not totally satisfied - fireStick must be in the same room as the WiFi in order for it to transmit and connect to netflix", "verified": true, "helpfulness": "2/3", "author": "David Neild"}, {"rating": 4.0, "review": "Love it sometimes Internet disconnects but besides that perfect buy", "verified": true, "helpfulness": "0/0", "author": "Alicia D."}, {"rating": 5.0, "review": "Love it! Easy to use & responsive. Opened up lots more programming and apps than my previous wirelss Blu Ray player.", "verified": true, "helpfulness": "0/0", "author": "Chris Pruitt"}, {"rating": 4.0, "review": "I got the Firestick in December and was really excited when I learned I would be able to stream MLB with the MLB app.  So far I am very disappointed with the buffering that is going on when I try to watch the spring training games.  I have streamed with my iPhone and iPad and have had no buffering issues on my home network, but the Firestick MLB app has had real issues trying to stream the games so far the first week of spring training.  Has anyone else seen this buffering issue with the MLB app on Firestick?  Amazon Instant Video has worked great by the way and my network has average download speeds above 40Mbs.  I give the Firestick 4 stars but the MLB.TV app on the Firestick gets 1 star so far with these buffering issues.", "verified": true, "helpfulness": "2/2", "author": "Dwayne"}, {"rating": 5.0, "review": "Uber easy and fast to use. Love that I don't have to stream the content via my computer. Getting the remote open in order to add the batteries was a bitch - only gripe.", "verified": true, "helpfulness": "0/0", "author": "Susan Seybert"}, {"rating": 5.0, "review": "Exactly as advertised!!!!", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick works as advertised.  It was easy to install and works great. I'm happy I bought it and would recommend it to a friend.", "verified": true, "helpfulness": "0/0", "author": "Hipolito Hernandez"}, {"rating": 4.0, "review": "Looking forward to Windows 8.1 miracast - very affordable player and easy to use. I found that it did not get enough power from the USB slot and had to use the provided wall adapter. The 'hatch' for the remote was ridiculous to figure out. It should say 'push' on it. I gauged mine with my multitool trying to separate the plastic. (you need to push down hard and slide for it to release) Overall, the streaming quality is great and on par with the roku. I like the added benefit of being able to stream prime content.Once the Windows 8.1 miracast is available, I'll be excited to stream from my laptop. I'll update this review then. :)", "verified": true, "helpfulness": "0/0", "author": "S. ONeal"}, {"rating": 5.0, "review": "I was leary about ordering it.  I was very upset at the lag in delivery time.  Then I got it.  Set up right away.  So easy.  Works great.  Worth the wait and worth every penny if you have a Prime account, (which I originally got solely for the shipping).  Simple to use, better than Comcast Xfinity for watching TV shows by a mile.", "verified": true, "helpfulness": "0/0", "author": "Andy Anderson"}, {"rating": 4.0, "review": "Needs to  be  power cycled  occasionally.Needs a on  off switch.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Bryant"}]