[{"rating": 5.0, "review": "This is a great way to view on-line content.  It works very well and is much faster than getting content using my Sony Blu-ray player.  Only problem I've noted is that it does occasionally \"freeze\" or lock up on initial access and has to be \"re-booted\" (remove/restart power).  But once it is running there are no problems.  Uses RF remote instead of IR which is great because it will probably be hidden in an HDMI jack on the back of your TV.  But if you use a universal remote like the Logitech Harmony, as I do, you won't be able to control it.  However you can set it a source device on the Harmony remote to get everything up an running with one touch and then use the little RF remote to browse.", "verified": true, "helpfulness": "0/0", "author": "Grumpy \"net pro\""}, {"rating": 5.0, "review": "We love the Amazon fire stick! It has so many movies, TV shows you name it. We never say \" there's nothing to watch\" anymore", "verified": true, "helpfulness": "0/0", "author": "H Sent"}, {"rating": 5.0, "review": "GREAT !!!!!", "verified": true, "helpfulness": "0/0", "author": "Anthony R. Ptak \"ARPtak\""}, {"rating": 3.0, "review": "So far I've watched some Amazon Prime offerings and one on Netflix.  It opens readily, as do the various programs, but it the streaming is a little herky-jerky.  It's not the smooth streaming I've come to enjoy on my Chromecast device.  This is surprising considering Fire Stick's larger capacity and that it's used on a TV located next to the router (the Chromecast is used on a TV located on another floor).  At least I don't have to watch Amazon programming on my laptop anymore.", "verified": true, "helpfulness": "0/0", "author": "J. Arntz"}, {"rating": 5.0, "review": "It's working out great.", "verified": true, "helpfulness": "0/0", "author": "DENNIS  E  MARQUEZ"}, {"rating": 3.0, "review": "The first time I used my Fire Stick it worked beautifully. Unfortunately I have been unable to get it to work on the same TV again. It will not connect to my WiFi again. My Chromecast Stick and other devices work fine. It works on the bedroom TV which is closer to my modem. When it is working it looks great.", "verified": true, "helpfulness": "0/0", "author": "Lynn"}, {"rating": 5.0, "review": "Actually it is better then I expected", "verified": true, "helpfulness": "0/0", "author": "al sellitto"}, {"rating": 5.0, "review": "This thing is awesome", "verified": true, "helpfulness": "0/1", "author": "Keith stocker"}, {"rating": 4.0, "review": "There are still apps we can't get without having a service provider such as Disney XD and Watch ESPN.  The whole reason we got the fire stick is because we did away with a service provider.  I don't think that was explained as well as it should have been.", "verified": true, "helpfulness": "0/0", "author": "JBK"}, {"rating": 3.0, "review": "I think I like it, but unfortunately it would work on my TV.", "verified": true, "helpfulness": "0/1", "author": "GEORGE TEABO"}]