[{"rating": 3.0, "review": "Its ok easy to use. Disappointed  that the new releases  cost so much and I  still have to use redbox", "verified": true, "helpfulness": "0/0", "author": "Claudia Smith"}, {"rating": 2.0, "review": "As with many of Amazon's hardware offerings (I've got lots of them), the hardware design and particularly drivers for the hardware of substandard.Some of the major issues I've come across:- Remote control will suddenly start skipping choices and go into an almost uncontrolled \"runaway\" mode.  Great to have a non-line of site type remote, but it's makes the usability experience impossible.- Slows down considerably when multiple apps are running and/or it's been running for awhile (likely a memory leak)- Constantly pushed towards Amazon fee based items when free based items are available within the apps (e.g., Netflix).- Interface is not great.  No apparent way to create \"shortcuts\" - just defaults to last used items in highlight listingI've also got the box version of the Fire TV appliance.  It works considerably better, though also has the issue with remote control at times.", "verified": true, "helpfulness": "0/0", "author": "RPlanet \"Rich\""}, {"rating": 5.0, "review": "No more dragging my PC over to the TV and hooking it up via an HDMI cable. I've been using my Fire TV stick for just a week, but it was love at first use for me. The setup was quick and easy, and I had my account linked and was watching my Amazon Prime content within minutes of inserting the stick in my TV’s HDMI slot. It took a bit of effort to enter my Wi-Fi and account information because of needing to use the remote for text entry, but that was to be expected. The cute animation to help new users get started is engaging and gives the information needed to use the product without getting bogged down in details and delaying the time it takes to get to the content. The videos stream smoothly from both Amazon and my Netflix account (via a built in application). I’m looking forward to when I can also watch HBO GO using this handy little video streaming gizmo. It’s small, but it’s powerful.My only negative was getting the remote open for battery insertion. No joke, but it’s a major effort. I had to lay my remote flat down on the counter and push down pretty hard on the release area with a butter knife to get mine open. On the upside, I feel like I could probably drop the remote off my roof without the cover popping off. But, I honestly had a few moments where I thought that I would need to return the product because there was no way to get the blasted cover off the back of the remote. So, honestly this should probably get a 4 1/2 star review because of the obvious design flaw, but my satisfaction with the quality of the streaming has buffered my initial frustration with the remote.", "verified": true, "helpfulness": "0/0", "author": "Carel Miske \"Ashz\""}, {"rating": 5.0, "review": "Great item!  Keeps my 5 year old niece sitting still.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jersey Reader\""}, {"rating": 5.0, "review": "This item changes the whole way you watch T.V. I bought two so that TVs in the bedroom and living room are connected.  When you have amazon prime, you watch movies of your choice, on your time. You no longer have to wait for channels to view the movies you want to watch on their time. In addition, all other apps can also be viewed with this devise. You can also view programs on TV when you have the time to watch them. My husband and I love the freedom this devise gives us. I recommend Fire Stick to anyone I talk to, so buy it.", "verified": true, "helpfulness": "1/1", "author": "Phi"}, {"rating": 5.0, "review": "Look into Kodi. Great addition to the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Victoria Fischer \"student\""}, {"rating": 5.0, "review": "The Fire stick far exceeded my expectations.  It's a great device that I use every day to watch, play and exercise.", "verified": true, "helpfulness": "0/0", "author": "Mark Kalaris"}, {"rating": 5.0, "review": "Works great and perfect for getting rid of the dishes and wires.", "verified": true, "helpfulness": "0/0", "author": "Kapilialoha \"Kapilialoha\""}, {"rating": 5.0, "review": "Love my new Firestick.  And the added bonus is my Prime account free movies and tv!", "verified": true, "helpfulness": "0/0", "author": "Monique McKithen"}, {"rating": 5.0, "review": "A wonderful addition to any television", "verified": true, "helpfulness": "0/0", "author": "LJ"}]