[{"rating": 5.0, "review": "I've owned Rokus, Apple TVs, Chromeast and both the Fire Stick and full sized Fire TV and if I had to choose one of those if someone was going to own only one single device, this would be the single device I'd choose. It's a little bit tough to understand how to make your choice if this is not an area that you read up on frequently or if you've not had experience and learned the \"gotchas\".  There are some easy to understand tradeoffs beyond the Amazon comparison grid.Streamers are a lot like cars: different prices, different features, different ongoing costs, but all intend to get you from here to there. Amazon does a pretty good job in their comparison to show the differences between their products, Chromecast and Roku. They don't take on Apple in that comparison but you aren't missing much in the analysis unless you own a lot of iTunes movies or you don't have Prime video yearly subscription.  I'll explain that later.One thing to know right out the gate is that not all brands of streaming devices have access to everything you want. Amazon has certain things. Netflix has certain things (luckily, basically all streamers have Netflix), Apple has some things, Google has some things. Many are shared, and some things are exclusives.I personally keep around an Amazon streamer (fire TV full size) and an Apple TV.  Between those two my media needs are covered, though I do occasionally buy something from Google and then... watch it on my phone. Or mirror it to my Apple TV.This device is in stick form. It's small and intended for those who do not expect to want to play serious 3D games and other games that require a lot of computing power. Set up is easy, but it's important to keep in mind that it does not have an Ethernet jack, so if you don't have wireless, this one isn't for you.I got this one for my mom and set it up for her, as well as used it several days after setup and found that it is very functional, easy to navigate (menus are the same as the bigger brother, Fire TV) but I did occasionally find that it would lag a bit if I tried to quit an app quickly or navigate the menu too quickly. It wasn't frequent enough to call it problematic, but I can say the bigger size Fire TV never ever had any kind of lag whatsoever-- and it has a higher price tag, double the computing power and more memory.Point 1:  If you are absolutely critical of anything that has a lag or isn't super fast, get the Fire TV instead of the stick.One of the interesting things that came out when the larger Fire TV came out was that the remote control has a microphone in it and you can use it to speak your searches rather than type them in. After some use this becomes pretty convenient. this one doesn't come with that feature by default. If you want it, you can use some smart phones with the Fire TV app and their microphone, or you can buy the remote that has this feature (right now for around $30, price could change).Point 2:  If you *might* want the voice remote you're already in the price range of the bigger, more capable Fire TV. May as well just buy that one.Size matters, in terms of portability. The larger one takes an HDMI cable, is a box itself. the smaller one is a stick, of course.Point 3:  If you may want to take this with you to hotels, dorms, or other portable places, the Fire Stick will soon (if not already) support captive wireless login requirements. The smaller device could make sense for you if you want it to be portable.Point 4: All of the streamers being discussed get software updates and you will normally expect enhancements over timeWhat media you own can have an impact on what device is best for you-- this means: what digital movies and music have you bought and own permanently? This isn't Pandora or Spotify, but paying full price for a movie or album and being able to download it to your phone or PC.  Amazon does a great job of letting you import your music into the Amazon system if you have a prime subscription, but if you don't have a subscription, you can't stream it to your Fire TV. A limited number of songs can be stored/uploaded to Amazon from purchases at Google or Apple, but you have to pay more if you want to import it all, and you have to pay each year.Point 5: Be aware of what media you own, and if you want to re-use it. If you don't own any digital copy movies or music, then you have nothing to worry about. If you do, then keep in mind you may need to figure out where you bought things and determine if you can re-use it at Amazon.Subscription services are a big portion of how people use these streaming devices. Netflix. Hulu. Prime Movies that comes with your yearly prime subscription. If you want content from those things, you have to pay separately. There is some free content for this device available via apps, but it won't be the pay content providers.Point 6: Plan to have a Prime subscription, some other subscription, or realize that you may not know what you're going to watch on this until  you have it.One of the nice things about Fire TV compared to most competitors (somewhat not Roku) is that there are a LOT of apps available for this one-- exercise video apps, cooking apps, all things not yet on Apple TV or Chromecast (as the time of this writing) If you want to explore apps or use it more than just for TV and more like a TV computer, this one has a lot of nice features and options.So there you have it. A little bit about the Fire TV Stick, the Fire TV and the competitors. I hope this was helpful and a different take on how to discuss and review this and it's competitors. Feel free to ask questions above this review in the question & answer section!", "verified": true, "helpfulness": "1/1", "author": "RST_"}, {"rating": 5.0, "review": "I have a Smart TV but I could only get Netflix, with Fire TV Stick I can access so much more and the controller is much easier to manage.", "verified": true, "helpfulness": "0/0", "author": "Karen E Paquin"}, {"rating": 5.0, "review": "Fast processor. Much faster than whatever is built-in to Blu-Ray players and flat screen TVs.", "verified": true, "helpfulness": "0/0", "author": "Savviapple"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I'd give it 5 stars but the apps are all for android. Definately 5 stars once the apps cover iOs.I replaced a Chromecast with this Fire stick. This is much more user-friendlly. The remote is fast and awesome. I love that Netflix stays qued on the Fire stick so my phone doesn't need to be used.", "verified": true, "helpfulness": "0/0", "author": "dschr"}, {"rating": 3.0, "review": "really liked the apps but a bit disappointed that my kindle can't stream through my tv. Hopefully this can be added on and updated to do that. Movies that are included on Amazon prime are difficult to find but plenty of opportunities to buy movies off of amazon. Still wondering if Netflix and Hulu are worthwhile services to join.  Just what did I expect for only $39?", "verified": true, "helpfulness": "0/0", "author": "tracy"}, {"rating": 5.0, "review": "Worked like a charm right out of the box.", "verified": true, "helpfulness": "0/0", "author": "edward j. wegener"}, {"rating": 5.0, "review": "works like a charm! easy to use!", "verified": true, "helpfulness": "0/0", "author": "wolfspop"}, {"rating": 5.0, "review": "Got it plugged it in, signed in with my account info n started watching movies. We love it.", "verified": true, "helpfulness": "0/0", "author": "Jon Nelson"}, {"rating": 4.0, "review": "Decent for the money but not quite up to matching Roku yet. Got these on special at $20 each. At $20 they are a STEAL. At $40, better to go for Roku.Few apps, but they are 1080p which is great. Remote is also not IR, which makes it a lot more usable especially for a stick which is probably behind the TV.UI is more cluttered than Roku as well, but certainly usable.My only major gripe is the text size and it is NOT ADJUSTABLE. Usable on my 55\" Living room TV, but on my 32\" bedroom TV the text can't be read from the bed. Roku however is just fine on same 32\" TV with bigger text.For a 1.0 product, pretty good though.", "verified": true, "helpfulness": "0/0", "author": "Ziloni"}]