[{"rating": 5.0, "review": "Great device, gets me everything I need to turn my TV into a smart TV at a low cost and easy function. It was honestly plug in and its ready to go.", "verified": true, "helpfulness": "0/0", "author": "Zachary Zuzula"}, {"rating": 5.0, "review": "The Firestick outperforms my Chromecast and is easier to use. Outstanding product.", "verified": true, "helpfulness": "0/0", "author": "Duane S Borgeson"}, {"rating": 4.0, "review": "It will turn your regular TV into a smart TV which will save you money from buying an expensive smart TV. I love having access to all the apps but am a little disappointed that it doesn't have any movies or TV shows of its own that are free downloads. Other than that I love it.", "verified": true, "helpfulness": "0/0", "author": "NaNa"}, {"rating": 5.0, "review": "Easy to set up and use. I am loving it!", "verified": true, "helpfulness": "0/0", "author": "Deborah Termini"}, {"rating": 5.0, "review": "Love it. We now have three Fire TV devices.", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 5.0, "review": "Super functionality.  Heard it ws difficult to use the interface, but I had no problems at all, nor did my 6 year old granddaughter.", "verified": true, "helpfulness": "0/0", "author": "Dene Colwill"}, {"rating": 4.0, "review": "Very happy. All it said it would be", "verified": true, "helpfulness": "0/0", "author": "James Baumgardner"}, {"rating": 5.0, "review": "The Amazon Fire Stick exceeded my expectations! Very easy to use. I especially liked how my music preferences just popped onto the screen.", "verified": true, "helpfulness": "0/0", "author": "dmpobg"}, {"rating": 5.0, "review": "worked just like I hope it would  no problems yet", "verified": true, "helpfulness": "0/0", "author": "Michael W."}, {"rating": 5.0, "review": "I don't usually write product reviews but I've been telling all my friends to buy one of these. As an owner of a Apple TV 2, Chromecast, and OUYA, and previous owner of other cheap Android streaming devices, I can say that this little stick is well worth the money. It's fast and easy to use. The Fire TV Android app is well written and works with the Fire Stick very well. The keyboard function recognizes my input and displays to the TV fast (big plus over the competition).My only complaint is not allowing sideloaded apps to display in the main app tray. The device is written on Android, so why make us jump through hoops to use Android apps?", "verified": true, "helpfulness": "0/0", "author": "Josh Walker"}]