[{"rating": 5.0, "review": "Absolutely love it... easy to setup and it works awesome", "verified": true, "helpfulness": "0/0", "author": "Jonathan McCalip"}, {"rating": 5.0, "review": "Cool item", "verified": true, "helpfulness": "0/0", "author": "Patrick Nash"}, {"rating": 5.0, "review": "Love it! It came loaded with my Amazon account and we began watching where we left off. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Deborah D."}, {"rating": 5.0, "review": "I purchased this stick because I have the amazon fire tv box in my den and I absolutely love it, I am thinking about cancelling my cable tv because I never watch it anymore.  I wanted stick this for my bedroom, but ended up giving it to my daughter and she and her kids are very happy with it.", "verified": true, "helpfulness": "0/0", "author": "hihatt2"}, {"rating": 5.0, "review": "Best thing simce sliced bread kicks all the competition's ass Chromecast cant compete, this thing does it all and then some.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Great device, easy to use and setup. Much better than rookie, Apple TV or chromecast", "verified": true, "helpfulness": "0/0", "author": "J. Garritz"}, {"rating": 3.0, "review": "The only real issue I have had with the fire stick is the continual problem of getting the error message, \"HDCP Unauthorized Content Disabled\" every couple of days.  The only way I have found to get rid of it is by unplugging the TV and Fire Stick for 10 seconds then restarting.", "verified": true, "helpfulness": "0/0", "author": "JDR"}, {"rating": 5.0, "review": "Actually I hate the FireStick (Prime only works in the US and the remote screen does not work with Mac), then only good thing about it is the Android apps support. I sideloaded Kodi (XBMC) and now I enjoy movies and streaming without even turning on my PC. Best thing ever happened.Note that you have to update the settings for Kodi using the recommended settings for 1GB RAM devices (check their website). Before that Kodi was pretty much unusable, movies loaded very slow and were almost impossible to watch.", "verified": true, "helpfulness": "0/0", "author": "Jose V"}, {"rating": 5.0, "review": "Love this device!", "verified": true, "helpfulness": "0/0", "author": "LeeBetsy"}, {"rating": 5.0, "review": "The Fire TV Stick was so easy to set-up and start using.  It is compact and light weight for travel.  Super happy with this product!", "verified": true, "helpfulness": "0/0", "author": "MizGma"}]