[{"rating": 2.0, "review": "I was beyond excited for this to arrive, and considering I pre-ordered it, I felt like my wait was forever.  (The half off price I received as a Prime Member made me happy enough to wait it out).  As a matter of fact, I was so excited to get a Fire TV Stick, I ended ordering two!  I stream media basically 24/7 in my house, and my beloved PS2 had finally bit the dust, so this was my new adventure.  I won't even mention the shipping problems, since they as for that review separately, but lets just say, I didn't have a pleasant experience.  When I FINALLY was able to plug my Fire Stick in for the first time, my BRAND NEW, JUST REALEASED device had to update.  Wait, what?  Why is there an update already for something I pre-ordered and received upon it's debut?  The update felt miserably slow, then failed, and had to start all over again.  When it finally opened, I have to say that set up and use were quite easy.  As a matter of fact, even my 4 year old has gotten the hang of using this, and we have had it 5 days total.  But in these 5 days, the device buffers constantly.  And for those who want to say that it's my internet connection...wrong.  My former PS2, my Blu-ray players with wifi capability (in rooms much further from my router), my laptops, my cell phones, and my iPad do not have any problems with connectivity or speed.  The internet service I have is optimum for movie streaming, and has never caused a problem in the past.  The buffering on the Fire Stick is constant, and very annoying.  I have yet to make it through one movie or show without this constant loading, and have even had one movie stop playing all together.  I had read reviews about how fast this device was...well, that is not my experience.I give this device 2 stars for ease of use, how discrete it is behind my TV, and for the idea behind it all.  If it worked reliably, this would be an amazing media streaming device...but the truth is, it doesn't.  What a disappointment Amazon.", "verified": true, "helpfulness": "0/0", "author": "Kristen Nicole"}, {"rating": 5.0, "review": "Love it , but price is to high,  25 bucks would be a good price for this", "verified": true, "helpfulness": "0/0", "author": "Pachine"}, {"rating": 4.0, "review": "Not A review, I want to know if this will work without having my desktop up & running. I have WIFI with the modem & want to put this in my bedroom If it will pick up Netflix without my computer being necessary. Thank you very much, Robert", "verified": false, "helpfulness": "0/0", "author": "Robert W. Oliver Jr. \"MECHANIC\""}, {"rating": 5.0, "review": "Easy setup and navigation.  Great!!", "verified": true, "helpfulness": "0/0", "author": "Jacklyn V Hooper"}, {"rating": 5.0, "review": "Very Easy Set up. Streaming is fast. I love all of the options and the remote is a plus. Becoming Prime Member is a must if you want to take full advantage of all of its features", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Pretty cool device and works great", "verified": true, "helpfulness": "0/0", "author": "Sherri P."}, {"rating": 3.0, "review": "When it works it's great. But it doesn't work half the time, and when it's playing a show or movie it stops or cuts out.", "verified": true, "helpfulness": "0/0", "author": "sharon"}, {"rating": 5.0, "review": "We've had our Fire TV stick for about 3 hours so far, and love it :) Plugged it in, hooked it up to our wifi (WPA2-PSK) without any problems, and have been watching shows ever since. We haven't had any of the problems reported in the one-star reviews, but will update the review if we run into problems along the way.", "verified": true, "helpfulness": "0/0", "author": "Christopher M."}, {"rating": 5.0, "review": "For the price and size, this is a great product.  It's laggier than its big brother but that doesn't detract from the experience.  It handles Miracast very well and even some games.I also own the Chromecast, the most popular competitor, and I have to say I prefer the Fire TV - if nothing else, because it has a remote.  Chromecast hardly has an interface of it's own, you're basically using apps on your phone to control the same app on the chromecast. The FireTV has an interface and lets you navigate it and enjoy it - even if your phone is dead.", "verified": true, "helpfulness": "0/0", "author": "Nikodem Leszek Blach \"Nik\""}, {"rating": 1.0, "review": "Product does not update and therefore does not function correctly. I may have to send it back but still deserves 1 star for being broken.", "verified": true, "helpfulness": "0/0", "author": "Chase Akin"}]