[{"rating": 4.0, "review": "We bought the fire and loved it! Bought this for our other tv. Still good with great features, but not as good as the fire tv box, it's a bit slower. Easy to install, still with the cash.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "F", "verified": true, "helpfulness": "0/0", "author": "Vernon Kercher"}, {"rating": 4.0, "review": "Nice like a lot", "verified": true, "helpfulness": "0/0", "author": "David Parks"}, {"rating": 5.0, "review": "Okay: we had to study hard to hook this up! Until about a year ago we didn't even know what a streaming device was.  This was the bomb to add on to our Sony HD TV: easy, even for us.  Now we just have to rent something or pick something to watch.  We are on Prime, but we are still thinking we might have to join Netflix for some of the series we want to watch.  The \"stick\" itself is marvelous.  Jury still out on how much we'll use it.", "verified": true, "helpfulness": "0/0", "author": "angelamarie"}, {"rating": 5.0, "review": "Perfect.  Love it.  Easy to use and navigate.  Only wish the remote was a little bit bigger.  It's so easy to misplace. The remote is easy to use though.  Great product.", "verified": true, "helpfulness": "0/0", "author": "S.H."}, {"rating": 4.0, "review": "While the stick does everything the adds say it will it continues to drop  offline. I have to reset it 2 or 3 times a day by taking power off of it .I talked to the Amazon technical people about it but they don't seem to have a solution. They have offered to replace it but I am not sure that will solve my problem..", "verified": true, "helpfulness": "0/0", "author": "Nesbitt P Cumings"}, {"rating": 5.0, "review": "Made an awesome gift!!!", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "It is just perfect. The whole family can enjoy the shows from the T.V.no need of cables to connect the computer or the IPad anymore.", "verified": true, "helpfulness": "0/0", "author": "Spainforever"}, {"rating": 3.0, "review": "very good! but it should come with a working video player. the only one available at the app store wont play any kind of sound.", "verified": true, "helpfulness": "0/0", "author": "Carlos Machado"}, {"rating": 5.0, "review": "Nice and easy", "verified": true, "helpfulness": "0/0", "author": "Karen"}]