[{"rating": 5.0, "review": "This device is significantly better than I had expected. I have had it for 1 week, and I wish I had bought it when it first hit the market.", "verified": true, "helpfulness": "0/0", "author": "N8vTxn"}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "MsFroggy"}, {"rating": 5.0, "review": "Amazing easy to install and operate.  Much easier than my Roku.  Very nice product and wonderfully packaged.", "verified": true, "helpfulness": "0/0", "author": "Supreme Shopper"}, {"rating": 5.0, "review": "Excellent seller. Fast delivery. very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Rita Hakopian"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Dean L Davis"}, {"rating": 4.0, "review": "It's too early to give an informed evaluation. The only option I have explored so far is the movie section - pleased with that part. Still much to explore.", "verified": true, "helpfulness": "0/0", "author": "Nancy M. Williams"}, {"rating": 5.0, "review": "Worth every penny. I have been watching it for a month now and no glitches.", "verified": true, "helpfulness": "0/0", "author": "E. Seltzer \"tech junkie\""}, {"rating": 5.0, "review": "Super stick, perfect for me", "verified": true, "helpfulness": "0/0", "author": "Captian"}, {"rating": 4.0, "review": "I bought this to mirror my Kindle Fire to my TV set.  Turns out that with this you don't need the kindle Fire to watch Prime movies and TV series.  The picture is a little fuzzy some times, but that may be due to the fact that our internet is sometimes slow and we have to plug this into our receiver rather than directly into the TV. Bought this to replace a Belkin Miracast adapter.  The Fire Stick does more and is perfect for watching Amazon Prime Content.  My only beef is that when I was looking for something to mirror my Fire, nothing I read about the Fire Stick clearly indicated that it would do what I wanted to do.  So I wound up spending more money on the Belkin, which doesn't work very well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very happy with this product. So easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "grace mcdermott"}]