[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It meets all expections and for the price it is really good and my grandkids really enjoy it", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 3.0, "review": "This stick functions very similar to the box, which I love and will never be out again. The stick however fails to compare. The services are the same, however the stick its self often needs to be plugged and unplugged several times for reason before we can get it to work and its only a few weeks old.I'm not sure if this is a defective stick or an issue others have experienced. We use the box in the living room and thought the stick would be a good option for our bedroom but so far it has been frustrating to get to function.Once functioning its got everything I would expect from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Love ours! =)", "verified": true, "helpfulness": "0/0", "author": "Lisa Harrod"}, {"rating": 5.0, "review": "So good! I replaced my cable with all these lovely programming options- so far so good! So much easier to use than some of the things out there. Great remote, easy to set up, walks your through the process.", "verified": true, "helpfulness": "0/0", "author": "Jessica Leedy"}, {"rating": 5.0, "review": "Very satisfactory product. Works fast & just as we expected. Easy to install & operate", "verified": true, "helpfulness": "0/0", "author": "courtenay stringer"}, {"rating": 3.0, "review": "It is a great little gadget for the money but it gets warm and starts freezing up. You have to unplug it for a bit until it cools down. Very annoying but what do you expect for $40?", "verified": true, "helpfulness": "0/0", "author": "ddem"}, {"rating": 3.0, "review": "I subscribe to Comedy Central in my Verizon FIOS setup.  My Roku 3 gets FREE past episodes of Comedy Central, but my Amazon Fire Stick only gets pay-per-view Comedy Central past episodes. When I tuned to Comedy Central on the Roku, it went to a screen giving me a code number to put on the computer.  Then, it simply worked for free.  When I tuned to it on the Fire Stick, it just went to episodes for about $2.99 each, no code number.Does anyone have an answer?", "verified": true, "helpfulness": "0/0", "author": "Janie \"janie100\""}, {"rating": 3.0, "review": "At first I liked it but I noticed a possible bug. Video playback via a service like Netflix is sometimes just not right. The video feed will often freeze and then go into turbo speed mode. The issue is not with my FiOS bandwidth because I have their absolute fastest speed which surpasses many households. The issue is with the unit. I have tried troubleshooting the product and even reset the item to factory default. It helped a little but still experience problems. The item is a first generation and I think it is a known problem. Maybe the kinks will be worked out in generation 2.", "verified": true, "helpfulness": "0/0", "author": "straightforward"}, {"rating": 5.0, "review": "So simple to use and so much cheaper than its competitors. Highly recommend. I just got rid of Uverse because I just couldn't keep justifying spending $180 a month for only a few channels I watch regularly. I got a flat antenna for the basic channels and then the fire stick for my Netflix and Amazon Prime. There's a bunch of games apps you can get too that the kids love. You can play them with the provided remote or with a Bluetooth game controller.It's just a simple stick so I can move it from TV to TV if I want. I have a projector and I can just plug in the fire stick to the projectors hdmi port and play it on a large wall and it feels like we're watching a big screen movie!I got xfinity blast Internet (75 Mbps) for $40 a month and the antenna gets all the local channels in HD. This allows me to still watch all the major sporting events on the major networks. What a simple move that saves me $140 a month. Do the math and that's $1680 a year!!Of course, you can get the Apple TV, or roku, and etc but for $39.99, the Amazon Fire Stick does all that I need.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Z"}]