[{"rating": 3.0, "review": "nice but stick gets pretty hot", "verified": true, "helpfulness": "0/0", "author": "Miguel Ramirez"}, {"rating": 4.0, "review": "working out very well and will make for an easier transition when I cancel my u-verse. there is a bit of lag in some of the movies while watching ever with my high internet speed. does not cause a problem for me.", "verified": true, "helpfulness": "0/0", "author": "none"}, {"rating": 5.0, "review": "LOVE love love the Fire Stick. I got rid of cable and only have Internet, and I'm able to watch Netflix, Hulu, YouTube, Amazon Prime, and HBO Go in addition to others. You can use the remote or an app on the phone, and it's very easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "Autumn Eustis"}, {"rating": 5.0, "review": "Excellent. I use this product everyday. May purchase another one for my other TV.", "verified": true, "helpfulness": "0/0", "author": "Josh G"}, {"rating": 3.0, "review": "Pros:It works and the quality for the most part is goodI am curious to know if I can use two of these in two different locations (two houses)Cons:I have not found a way to search for content yet.There needs to be a ton of more movies availableI have a good ISP and I still have issues at times with Streaming content from the Fire TV Stick. I have not had an issue with Movies, but with TV Shows and Apps like YouTube.Suggestions: They should have a feature to show/hide content that cost $$$ or put a \"$\" overlay on the images so you know it will cost you money to view, this would save me so much time from drilling into the details just to find out it cost to watch.", "verified": true, "helpfulness": "0/0", "author": "S. Hunter"}, {"rating": 3.0, "review": "evidently you have to have high speed internet in order for it to work properly so that means if your paying for normal internet the only way for the movies to stream without buffering every 15 minutes is to pay more for internet not happy.", "verified": true, "helpfulness": "0/1", "author": "mark miller"}, {"rating": 1.0, "review": "I truly HATE this product.  The movies and shows freeze (ALOT!!!),  It. is the closest device to the main cable box and WiFi and works worse than my Roku, which is the furthest away.  Sometimes you can't even click on the show you want to view, because it is not visible on the TV even though you bought it.  It's crazy!!!  I would not recommend this product to anyone.", "verified": true, "helpfulness": "0/1", "author": "Simira Anderson-Davis"}, {"rating": 2.0, "review": "Will not stay connected to WiFi that is 10 ft away. Stops to buffer a lot. Netflix always gets stuck at 25%, and often times you will have to restart the unit completely to get it to work.", "verified": true, "helpfulness": "0/0", "author": "M Jonathan"}, {"rating": 5.0, "review": "LOVE IT.  Nuff said.", "verified": true, "helpfulness": "0/0", "author": "roweniii"}, {"rating": 5.0, "review": "Delivered as advertised", "verified": true, "helpfulness": "0/0", "author": "Roberto"}]