[{"rating": 5.0, "review": "Great!  Would buy it again.  I am considering purchasing another for my other TV.", "verified": true, "helpfulness": "0/0", "author": "Gail"}, {"rating": 4.0, "review": "The fire stick was easy to install. It confused me because it is hidden behind the TV and I thought it had to be out front for the remote to work. That's on me. What I do not understand why I have to have both an Apple and a Fire Stick. You both have net flicks but different shows.  Can't there be  universal plug in?", "verified": true, "helpfulness": "0/0", "author": "Joy Walker"}, {"rating": 4.0, "review": "Great product for reasonable price.  Able to watch MLB.tv and HBO with no problems.", "verified": true, "helpfulness": "0/0", "author": "Benjamin J Weigel"}, {"rating": 5.0, "review": "Love it! I can choose everything on my amazon account with ease. It's fast, reliable andeasy to use. The only 2 drawbacks are that  the info for your selection is too small to read even on my large flat screen tv. And most importantly, i bought mine locally from Bestbuy amd it wad the same price as on my amazon prime account and I got it same day. Other than that it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Saliba"}, {"rating": 5.0, "review": "Having a ball with this.", "verified": true, "helpfulness": "0/0", "author": "Roxanne R. Reynolds \"Rox\""}, {"rating": 1.0, "review": "Slow to process. I have wireless 5 feet away so it's not connection. Gets warm. Lags apps like YouTube. Oh, and now I get 20 emails asking me to rate \"dora\" because the kids watched it. A little disappointed on this one amazon.", "verified": true, "helpfulness": "0/0", "author": "seattle protection"}, {"rating": 5.0, "review": "I was a little concerned about buying this from reading the negative reviews, but I really love the firestick. I was sick of not being able to easily see my favorite tv shows or having to pay $2.99 to watch them, but with a prime membership I finally get to watch all those shows that are just not available on Netflix.  Keep in mind though, that this fire stick is ONLY worth it if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Andrew M. Nesbitt"}, {"rating": 5.0, "review": "Easy to install and works very well.", "verified": true, "helpfulness": "0/0", "author": "JJ Fountain Inn, SC"}, {"rating": 5.0, "review": "It is absolutely amazing and worth way more than it costs. We love it! The things you can do with it are so endless that I still haven't figured them all out. Love, love, love this product! We prefer using it over our smart tv!", "verified": true, "helpfulness": "0/0", "author": "Nikki W."}, {"rating": 2.0, "review": "I find that the Amazon Fire Stick is a very nice product for watching innumerable media, it has a bit of a learning curve.  My complaint is mostly that streams either get interrupted or stop sometimes, especially if you are not close within a couple of feet from your wireless access point.", "verified": true, "helpfulness": "0/0", "author": "Nicolas Estava"}]