[{"rating": 5.0, "review": "So much faster than the Chromecast!", "verified": true, "helpfulness": "1/1", "author": "Jeffrey Morrissey"}, {"rating": 4.0, "review": "Had issues in the beginning couple of days but now works just fine.", "verified": true, "helpfulness": "1/1", "author": "studygirl"}, {"rating": 1.0, "review": "Talk about controlled environment... no apps on the play store are allowed. Waste of 1 gb memory.", "verified": true, "helpfulness": "0/1", "author": "Oscar"}, {"rating": 2.0, "review": "The picture keeps freezing up and then the stick shuts down. I have to unplug it and then re-start it. Same thing happens when we use the game controller to play games.", "verified": true, "helpfulness": "1/2", "author": "Yvonne Tepper"}, {"rating": 1.0, "review": "I was able to buy this product at its promotion price. I was excited to get it because I was thinking it would work as good as my Apple TV, with a better smaller size.  I was VERY DISAPPOINTED  with its PERFORMANCE.  I definitely WOULD NOT BUY this PRODUCT again. No matter how fast my wifi service at home, the movie/show takes FOREVER to LOAD and sometimes it even goes to the screen saver because of the amount of time it takes to load the movies/show. When the movie/show finally starts, it LAGS & FREEZES all the time. It's cheap for a reason, I DO NOT RECOMMEND this PRODUCT. Waste if Money, Very Poor Performance!!!", "verified": true, "helpfulness": "2/3", "author": "Katherine B."}, {"rating": 5.0, "review": "So easy to use. Faster than our TV and Blue-ray apps. It can travel with us, which I love.", "verified": true, "helpfulness": "1/1", "author": "amy"}, {"rating": 5.0, "review": "I love the fact that this streaming device has a remote for it! It was easy to set up and use!", "verified": true, "helpfulness": "1/1", "author": "Lucy Seijas"}, {"rating": 5.0, "review": "If you want to watch amazon prime on your tv get the stick. Simple as that! I have the firetv box also but the stick is more than capable of replacing a firetv box. You do not need the voice search remote because the interface is layedout very well. I belive they are adding smartphone remote support aswell but dont quote me on that.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 2.0, "review": "I used the regular FireTv device before I bought the FireStick... Not happy. My device loses internet connection since I've gotten it. I thought I might've had a problem with my network but it's perfectly fine. Sometimes, even when I watch something it skips as if I was watching VHS, I never had this problem with the regular device. I'm returning the FireStick and going back to original device.", "verified": true, "helpfulness": "1/2", "author": "Kaci"}, {"rating": 5.0, "review": "The Amazon Fire Stick is awesome.  It is small with a very responsive remote.The set up was easy.  I am most pleased with the user interface either with the remote or the smartphone app.  My wifi blue ray player seems like an old clunky piece of technology compared to the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "shopgirl_nyc"}]