[{"rating": 5.0, "review": "FireTV stick is awesome, I have a ROKU, ROKU stick, as we as a SONY streaming device and so far the Fire stick beats them all, the speed at which the Fire stick operates puts the others to shame.  Most of the channels I want are on the Fire TV stick and I'm hoping the few that aren't soon will be.  The only problem I've encountered is that for some reason when using the HDMI extender and having it plugged into the HDMI port one I would get the message \"HDCP unauthorized, content disabled\" , but plugging into HDMI port two removed this issue.  Also removing the adapter allowed me to stay plugged in port one, thou it was a tight fit between the wall and TV.", "verified": true, "helpfulness": "1/1", "author": "Timmy D. Crain"}, {"rating": 5.0, "review": "Took some time to set up as the website was down when I 1st tried. When the updated software did down load took about 30 minutes. Once downloaded and installed it works great. Takes a little while to learn to navigate the screen but am totally satisfied with the system.", "verified": true, "helpfulness": "0/0", "author": "Robert Gray"}, {"rating": 5.0, "review": "I love the Fire TV Stick!  It was so easy to install and took just a few minutes for the software to update.  There are no streaming issues.  I have been binge-watching my FREE TV shows as an Amazon Prime member.  I also use it to stream ESPN college basketball games I would have normally watched on my computer.  I will probably be ordering another one of these for an additional TV in my home.", "verified": true, "helpfulness": "0/0", "author": "Rae A. Umlah"}, {"rating": 3.0, "review": "works fine just very disappointed with the amount of content available on Amazon Prime video", "verified": true, "helpfulness": "0/1", "author": "Robert R. Rooks"}, {"rating": 5.0, "review": "I love the Fire TV Stick. It worked right out of the box, and has access to everything at the touch of a button! The kids love it too, it's a great buy.", "verified": true, "helpfulness": "0/0", "author": "Queen Erzulie Dantor \"Light Love Life\""}, {"rating": 5.0, "review": "We're very happy with it and look forward to enjoying it for a long time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Welshcobdrivinggrams\""}, {"rating": 5.0, "review": "I got mine with the discount and works perfect especially if you have prime and Fire TV and a good internet connection with wifi like I do ! I'm happy , thank you", "verified": true, "helpfulness": "0/0", "author": "Teresa"}, {"rating": 2.0, "review": "I have had a couple of days and have mixed feelings....does not work with kindle tablet (purchased earlier this year)...charter cable does not support apps that are available and Google nexus 7 tablets cannot cast (all OS versions are latest).Prime works well, no issues streaming...just disappointing that I cannot use casting or other apps that are in store. (I called Amazon support and they claim the kindle purchased 2 months ago is too old to support cast functionality).  I did only pay 19, so may keep and hope that as time goes on these issues are worked out.", "verified": true, "helpfulness": "0/1", "author": "Darby Muia"}, {"rating": 3.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "M Donofrio"}, {"rating": 4.0, "review": "The stick is nice. With a lot of apps to choose from and a lot of things to offer. Im not sure if it's just me, but i have to keep it plugged in the wall for faster connection otherwise it will freeze a lot, which I'm not too fond of because I don't like seeing any cords visible from my tv. Also a lot of times when I'm watching something, it freezes a lot.. But that could just be me and my connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]