[{"rating": 5.0, "review": "Wow, even better WiFi reception than I expected.", "verified": true, "helpfulness": "0/0", "author": "Joshua Boehm"}, {"rating": 5.0, "review": "excellent! love it!", "verified": true, "helpfulness": "0/0", "author": "Tracy L LaClair"}, {"rating": 5.0, "review": "Love it!!!!!!", "verified": false, "helpfulness": "0/0", "author": "Heather Tafel"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Brandie Mills"}, {"rating": 5.0, "review": "This exceeded our expectation, it works outstandingly, none of our streaming movies needed to buffer even though we do not have fast internet and have had this problem with our xbox and smart blue ray player particularly on our tv that  is far from our wifi router.  I also love the selection from prime!", "verified": true, "helpfulness": "1/1", "author": "Dave Lado"}, {"rating": 5.0, "review": "Once set up and plugged in, there's no way to shut it off. Energy wise, the AC adapter still uses electricity, unless it is unplugged from the power source.The movies and TV shows are great! No advertising, either!", "verified": true, "helpfulness": "0/0", "author": "R.See"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Ben Reed"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Richard T. Wilke"}, {"rating": 3.0, "review": "Before buying the Fire TV Stick I used my game consoles to stream Hulu, Amazon, and Netflix content. My consoles don't support Sling TV quite yet so I decided to buck up to buy this outside of the promotion (free with 3 month prepaid subscription) since I was already a customer and not eligible.The Fire Stick has a lot of apps, some free some paid, that offer a lot more than what I had expected. There are kids apps to play games, teach reading and math, one app will turn your TV into a fish tank, TED talks app, etc.. Lots of options for apps.Set up is really easy. Take it out of the box, optional HDMI extender to make it easier to plug it in, USB cable, and power adapter to plug it into a wall or USB slot without the power adapter.The remote is small but simple. There aren't a ton of extra buttons on the controller making it very straight forward.As for the bad stuff...I didn't realize that the stick had to be plugged into a USB power source of some sort, I honestly assumed it was plug-and-play right out of the box. I had to plug it into the USB port on my TV; to which it told me that was not a supported USB power source but worked anyway. I ended up plugging it into the wall with the plug in they included in the box because I was having issues running some apps.The Fire TV Stick was plugged into my bedroom TV. When I would try to run apps (mostly at night) from the Fire Stick, they take a long time to load. Netflix sometimes won't even log in because it takes so long. One bonus to this is that occasionally Hulu ads wouldn't play but rather leave a blank screen with the \"ads\" logo in the upper left-hand corner because they didn't load in time. To watch a 45 minute episode of Agents of Shield it took closer to 2 hours because of ads and load time. Sling normally would load and/or buffer for about 5 - 10 minutes before deciding whether it wanted to let me watch something or error out. I have tried using my consoles when the Fire TV Stick would be at it's worst and most frustrating. I found that the same apps on my consoles, aside from Sling TV since not available, worked fine without issues. During the daytime, the Fire stick was better but not great.I started to wonder if it was the device's ability to connect to my wifi router. So I decided today to plug it into my TV in the living room since it wasn't doing me much good in my bedroom. So far it seems to be doing worlds better in the living room but I'll update this post in a few weeks to see if I run into the same issues.", "verified": true, "helpfulness": "1/1", "author": "Lani"}, {"rating": 5.0, "review": "Thank you Amazon for standing behind your products, my little remote wasn't working properly and you sent me a new Fire TV Stick. Boo hoo, now I have to reload everything.. oh, well... so much fun doing it... I'm just happy I have it working again.  U have me hooked on you!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth J Pierro"}]