[{"rating": 5.0, "review": "Heck I never even considered giving this a chance, but the thing does a great job.  No need for cable in my son's room when he just watches cartoons and Wild Kratts.  Perfect solution.  Fast, and plenty of streaming options.", "verified": true, "helpfulness": "0/1", "author": "Tootsie"}, {"rating": 5.0, "review": "I was so hesitant to order this \"New Technology\" gizmo because I am not tech savvy. Thank goodness I didn't let my fear stop me.  It was so easy to install and setup and start watching some new as well as old favorites. And Amazon is adding so much new content all the time! Love, love, love it!!", "verified": true, "helpfulness": "1/2", "author": "Ken Erdmann"}, {"rating": 5.0, "review": "Love this product.  It's great for bedroom TV's, that don't have cable hook-up.", "verified": true, "helpfulness": "0/1", "author": "Rats"}, {"rating": 3.0, "review": "I was fine with this for a while but now it is taking forever to stop pausing and loading.  It takes about 15 minutes to get Hulu watchable but it comes in fine on my Sony tablet via the app, with the tablet in the same room.Worse than just stopping, it will also start playing audio with a stuck video screen.  I hope it is just an update away for a fix, but it had better pick up its game or it will be removed.", "verified": true, "helpfulness": "0/1", "author": "Paul Neujahr \"pwndecaf\""}, {"rating": 5.0, "review": "the fire tv is the best stick", "verified": false, "helpfulness": "0/1", "author": "jamshid jahanara"}, {"rating": 5.0, "review": "Great tech. I turned my normal HDTV into a Smart TV.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wowzer, house on fire awesomeness.  Love this stick.  Easy to use, perfect connections, great programming. Thanks Amazon for Transparent!", "verified": true, "helpfulness": "0/1", "author": "PrimePrimeMember \"PrimePrimeMember\""}, {"rating": 5.0, "review": "Worth the price, nice product. Easy setup and simple controls.", "verified": true, "helpfulness": "0/1", "author": "john tucker"}, {"rating": 2.0, "review": "I like it's but I don't like that you have to connect a power cord into the stick", "verified": true, "helpfulness": "0/1", "author": "William Webb"}, {"rating": 5.0, "review": "very handy", "verified": true, "helpfulness": "0/1", "author": "virginia lyn"}]