[{"rating": 5.0, "review": "All that I hoped! And I hope for a great deal.", "verified": true, "helpfulness": "0/0", "author": "Jamal Mahone"}, {"rating": 5.0, "review": "Loved it, enough said", "verified": true, "helpfulness": "0/0", "author": "Jacquelyn sandoval"}, {"rating": 5.0, "review": "Exceeded my expectations. Very glad I got this device.", "verified": true, "helpfulness": "0/0", "author": "ReedO"}, {"rating": 5.0, "review": "Great, should've ordered this a long time ago", "verified": true, "helpfulness": "0/0", "author": "gmjones"}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Thomas Kim"}, {"rating": 5.0, "review": "I love my Fire Stick. Works great for what I need. The remote is small but feels good in the hand.", "verified": true, "helpfulness": "0/0", "author": "D M A"}, {"rating": 1.0, "review": "Unfortunately I will have to recommend to stay away from this product.  When it works it is as good as any others on the market.  However before each and every use it must be unplugged from the wall outlet, wait a couple of minutes, plugged back into wall outlet and then and only then will the Fire stick reconnect and function as expected.  To date I have also also had to reload any and all login ids and passwords twice, for every application that was downloaded. To trouble shoot I have tried all available HDMI ports on both TVs where it is being used. No difference.  Each TV is a different make, model and level. aka one smart TV one regular LED. The smart TV identifies the Fire Stick during port selection but the fire stick will not function until going through the steps.A second note for those who do purchase to download a application select the \"FREE\" button.  Really Stupid set up. Should be labeled download or free download not just FREE.  As for help if needing any... don't bother there isn't any.", "verified": true, "helpfulness": "0/1", "author": "user"}, {"rating": 5.0, "review": "Great purchase. Lots of movies and TV series. Works very well with the ipad app.", "verified": true, "helpfulness": "0/0", "author": "Elfen"}, {"rating": 1.0, "review": "I have spent the past 30 minutes trying to get it to connect to my wifi, which it has a very good connection to and it is literally less than 5 feet away from. Second day in a row it has done this. Before anyone mentions using the hdmi adapter cable, it's already plugged in. I have tried restarting it multiple times and it won't work. I am beyond frustrated and regretting my purchase. Amazon better fix this issue!Update: I am now going on day 2 of the fire stick refusing to connect to the internet. I do not recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Cortney"}, {"rating": 3.0, "review": "I received the stick a month ago. However I just now tried to use it only to find there is NO instruction manual . It will not fit into a USB port. It will fit into one called HDMI. I get the message no video input. The package came with charging cords and a electric plug, Does the stick need to be charged? If so how often? Can anyone help me?", "verified": true, "helpfulness": "0/0", "author": "Patricia Shippee"}]