[{"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "MamaO13"}, {"rating": 5.0, "review": "works well w/o buffer.", "verified": true, "helpfulness": "0/0", "author": "William H.Johnson"}, {"rating": 5.0, "review": "I love it. Its worth every penny, and very easy to setup, plus it really fast 👍👍👍👍👍👍", "verified": true, "helpfulness": "0/0", "author": "edna"}, {"rating": 5.0, "review": "Best advice for your buck", "verified": false, "helpfulness": "0/0", "author": "Tuan"}, {"rating": 5.0, "review": "This is great, I was able to get it for $19 when it first came out so the value equation would have been good even if the device was average.  Reality is I would happily have paid $40, it is fast, intuitive, and simple to use.  Not sure why I'd pay more for the Fire TV, but I haven't seen it so it may have a lot more functionality.  My only quibble is the search function only works with Amazon Prime, you have to open the Netflix app and search separately which is a little annoying.  In a perfect world we would be able to search once and have a movie/TV show appear regardless of who's streaming it.  Only loaded Netflix and Amazon Prime so can't speak to the other options but it's a nifty little device!", "verified": true, "helpfulness": "0/0", "author": "Daniel L. Fritts"}, {"rating": 5.0, "review": "Love the Amazon fire stick! The options of watching a movie, tv shows with no commercials, kids can play games, you can stream internet, YouTube, music live make this so convenient,  I don't have cable and have options of entertainment to last for days without rental fees or very little being a Prime member! This will come in handy on snow days here in the Midwest, family game night, or Movie night! I've already bought one for my mom and plan on buying another for another room!", "verified": true, "helpfulness": "0/0", "author": "Chyrstal Shiverdecker"}, {"rating": 3.0, "review": "The installation and set up was pretty simple. But the question was \"How did this item meet your expectations\" . I expected to be able to watch almost any video made, especially ones that are several years old. However, I did a search for 3 older movies and each of them had a cost to watch it. I am also a prime member. (Knockaround Guys and Cinderella Man were 2 that I remebered) Since then I have not even turned on the Fire Stick or used it, I went back to using NETFLIX on my computer. So the answer is NO it did not meet my expectations.  thanks", "verified": true, "helpfulness": "0/0", "author": "will g."}, {"rating": 4.0, "review": "This is a great little product. The interface is snappy, if not a little dull (my opinion), but it does suffer from the randon freezing requiring a reboot.  I had bought the Fire TV Stick to use with Netflix, Hulu Plus, Amazon Instant Video, Plex......plus side loading Kodi.  Seemed to be the perfect all in one device i was looking for, however, getting Plex to stream without buffering is hit or miss. This seems to be a common problem, so if Plex is a must you might want to look at another option.  I also have the Chromecast and I have no issues using Plex, it just doesn't have Amazon or Kodi ;)Also, getting the Fire TV Stick to use the 5ghz band was an issue at first, but once I changed the channel on my router from \"Auto\" to one of the lower numbers, the Fire TV Stick is now using the 5ghz band.", "verified": true, "helpfulness": "0/0", "author": "Rob Davis"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Brian A. Reynolds"}, {"rating": 5.0, "review": "Truly plug and play!  Works very well and we're hooked!", "verified": true, "helpfulness": "0/0", "author": "TRAINER"}]