[{"rating": 3.0, "review": "It's great, when it works properly. There is a constant buffer (from netflix) when I put it in my girls room, which is only 20 feet (or less) away from the Internet connection. However, I bought it for $25 on prime day so for the price I paid it was worth the buy. The saying is true \"you get what you pay for.\" I recommend if you have patience!", "verified": true, "helpfulness": "0/1", "author": "Jerica Russell"}, {"rating": 4.0, "review": "I LOVE my amazon fire tv stick. I had originally be looking to buy another ps3, but that was costly so a friend recommended I check out the amazon fire tv stick. I did and I am so happy! This not only saved me hundreds of dollars, but I get to use a real remote instead of a game controller. With decently small hands I love the little remote. \"It's the little things....\"  I will say that I have a problem with it cutting out for about 10 seconds every once in a while, but I attribute that to my router and modem as I've been meaning to upgrade them too due to issues with them", "verified": true, "helpfulness": "0/1", "author": "Chrissey"}, {"rating": 5.0, "review": "Fantastic ,no issues at all, right out of the box , hooked the stick right into an available HDMI slot, plugged it in and logged in to my wifi network , It even knew my name , watching prime in HD within 10 minutes", "verified": true, "helpfulness": "0/1", "author": "rick chavez"}, {"rating": 5.0, "review": "This is an awesome addition for a TV that is NOT a smart TV for Netflix, which was our sole reason for purchasing.  Price extremely reasonable, easy setup, and love that there's a remote.  Love it!!", "verified": true, "helpfulness": "1/2", "author": "amlpd03"}, {"rating": 5.0, "review": "Wonderful. Very easy to install and use.", "verified": false, "helpfulness": "0/1", "author": "Mont Six"}, {"rating": 4.0, "review": "Menus are a littler different and need to get used to. I downloaded the Netflix app specifically to use with this. I don't intend to be a Prime customer. Otherwise, the streaming id good, video quality is good, and setting it up was very easy.", "verified": true, "helpfulness": "0/1", "author": "Wheelgunner"}, {"rating": 5.0, "review": "Getting ready to set it up", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have Chromecast and Firestick is WAY better.  It basically turns your TV into a Smart TV, which Chromecast does not do (you need a phone or tablet).  It streams in HD over my Charter ISP very well.  I haven't experienced any downtime yet.  I love how it saves where your place in a show/season and automatically resumes.I am a prime member so I also get to stream all the Prime content.  I watch it at least an hour a day.", "verified": true, "helpfulness": "0/2", "author": "RateMaster \"Nate Andrews\""}, {"rating": 5.0, "review": "Awesome! I now have two Fire tv sticks and one regular Fire tv, one for each tv :). The stick is wonderful and they only thing it doesn't have that the regular fire tv has is voice command. Not too big of a loss since the voice command only works on amazon content.We love the Fire tv because it is so easy to use. We can access everything we have subscriptions too: Netflix, Amazon Prime, HBO, etc. My son also likes to play some of the games.Recently I lost the remote (they are very tiny). However, it wasn't a huge deal because I downloaded the remote app on my kindle fire and can now control it from there. Super cool!", "verified": true, "helpfulness": "0/1", "author": "Desiree"}, {"rating": 5.0, "review": "I'm very pleased with the Amazon Fire TV Stick. The TV I use this on is a fair distance away from my wifi, so I was worried that it might flake out due to low signal. On the contrary, it is functioning flawlessly. I just watched an entire season of American Horror Story without so much as a glitch. The streaming is great; the picture is great. I'm more than satisfied. Also, I'm pleased to see several other interesting apps are available. Access to my Prime Music is a bonus, too. Great product!", "verified": true, "helpfulness": "0/1", "author": "Bug"}]