[{"rating": 4.0, "review": "Does everything I thought it would.  I'm a little disappointed that the fire game controller is the only one that works with it but not terribly surprised.  Also the amount of free Amazon programming and movies is surprisingly light but that isn't the fire stick's fault", "verified": true, "helpfulness": "0/1", "author": "Kevin"}, {"rating": 3.0, "review": "The \"Fire Stick\" is a good product.  Needs a better way to sort music, and import music from amazon.com.", "verified": true, "helpfulness": "0/1", "author": "Kevin Bonner"}, {"rating": 2.0, "review": "Unless the Fire Stick is camped out next to your wifi router, good luck getting this thing to work.  Garbage!", "verified": true, "helpfulness": "0/1", "author": "Mark A. Massey \"Makis\""}, {"rating": 5.0, "review": "Amazing!  I live in a isolated area and I can view all my favorites, even more with Amazon Prime", "verified": true, "helpfulness": "0/1", "author": "BASIN GIRL"}, {"rating": 5.0, "review": "Bought this for my 14 year-old step son who has the only TV in the house that is not a Smart TV. We love amazon products and own many of them so we decided to chose this product just because of their proven reputation. Once again, this product is a really great product. It is very easy to set up right out of the box and we have not had any issues at all with it. My step-son taught himself how to navigate through it and he is an big Netflix fan so with that alone, we are thankful. Just wait until he becomes interested with all of the many other apps it comes with....he hasn't even touched the surface...LOL. But he is happy with what he likes so we are happy.", "verified": true, "helpfulness": "0/1", "author": "TiiWill"}, {"rating": 4.0, "review": "I debated for a long time ordering the Fire Stick. I compared it to the roku and chrome and ultimately decided on the stick. So far it's been working great. I love that it has tons of apps, as I don't watch too much of the prime TV and movies. A small downside for me, the shows and movies currently offered for prime wouldn't be my first choice but it updates often.", "verified": true, "helpfulness": "0/1", "author": "S. Avery"}, {"rating": 3.0, "review": "Checked the blogs and was excited about a low-cost streaming technology from a major player like Amazon.  But, the rumors are not true.  KODI 14.2 or 15.0 cannot be downloaded onto the TV Fire Stick according to Amazon customer service a moment ago.  Any downloadable apps must come from Amazon and they only have a decrepit old version of XBMC from 2012.  Shame that they want to prevent us all from the best Movie and TV streaming application in the world.  Better luck next time.... Amazon​ sells many devices for less than $100 which offer the ability to download KODI and Genesis and many other scrapers.", "verified": false, "helpfulness": "1/2", "author": "Scott L."}, {"rating": 5.0, "review": "I love it.  Easy to set up and easy to use.", "verified": true, "helpfulness": "0/1", "author": "CloneToTheBone"}, {"rating": 3.0, "review": "Wish there was just an off button instead of having to hold the button to sleep. Also wish the stick held some charge, I do not like that it constantly needs to be plugged in to the power source. The stick gets pretty hot to the touch. There is also room for improvements with the apps, more could be added that do not require a cable subscription or paid subscriptions, etc. Basically we just use it to stream Netflix", "verified": true, "helpfulness": "0/1", "author": "Rosa Hernandez"}, {"rating": 5.0, "review": "This was very easy to install and start using. Love the options we now have for TV and movies.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]