[{"rating": 5.0, "review": "It's great for my grandkids", "verified": true, "helpfulness": "0/0", "author": "Cassandra Lakey"}, {"rating": 4.0, "review": "Easy to set up, but it gets confusing distinguishing between the tv and firestick and which controls to use.  Took a while to figure out how  to search and find stuff.  Oh, and I thought that having Prime gave you access to all movies, but you have to rent them like any other service.  Other than that, nice remote and great idea for  alternate TV", "verified": true, "helpfulness": "0/0", "author": "Susishoot \"susishoot\""}, {"rating": 2.0, "review": "The way the fire stick is advertised doesn't tell you all the other sites you would have to get and what they cost per month!  You should be up front with people and tell them all the costs involved.  Now don't get me wrong it works and you can get quite a few different shows, my wife likes it better than me though", "verified": true, "helpfulness": "0/0", "author": "LawrenceMinichino"}, {"rating": 5.0, "review": "Was a bit hesitant about buying it at first but friends kept raving about so I did and I am so happy that I did. Cable is going out the door. And it was so easy to install. Definitely worth the 40 bucks.", "verified": true, "helpfulness": "0/0", "author": "Lena"}, {"rating": 5.0, "review": "Love this device.  I've been using this thing quite often but ever since the new update 54.1.2.2 it has been flickering every few minutes.  It will black out for about a sec and come back.  It doesn't matter what I'm doing whether it's in the home page or watching something on Netflix.  Help amazon!  Fix this update and will give it the 5 stars it deservesUpdate.  It's not the firmware update.  I had an epiphany and decided to remove the extension plug that came with the stick.  What do you know!  It fixed the flickering.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 4.0, "review": "The fire stick is super easy to get started with and has plenty of tutorials to answer any questions you may have. There is access to an abundant amount of entertainment and I love beieng able to pull up my favorite workout videos on You Tube. I have barely scratshed the surface and I am very excited to explore all I can do with the Fire Stick. Love not having to watch my favorites on Hulu on my Kindle Fire while I am relaxing in bed.There is a sleep feature as well.", "verified": true, "helpfulness": "0/0", "author": "Al Sirak"}, {"rating": 5.0, "review": "Love the convience of being able to take it with me on the go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Functionality is great. It has good apps.However, I gave it 3 stars because it does not advertise a power cable that is required to be plugged into the stick and then into the wall. Based on the device it looks as though it's a wireless stick that runs when u plug it in. However, you need to have a cable plugged into the stick, then running to the nearest outlet.", "verified": true, "helpfulness": "0/0", "author": "Tracy Lynn"}, {"rating": 5.0, "review": "I am really enjoying it!!", "verified": true, "helpfulness": "0/0", "author": "cl \"cl\""}, {"rating": 4.0, "review": "It works great, especially at hotels.  I wish the power cord was a bit longer.", "verified": true, "helpfulness": "0/0", "author": "Hazel Wassername"}]