[{"rating": 5.0, "review": "So far so good. The stick has a slight delay but not when watching a movie and the HD picture is very good.The remote is easy to us", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Very happy with this product! Works perfectly and is cheaper than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Dawn Vilbig \"rdawnv7\""}, {"rating": 3.0, "review": "Fire TV stick works fine. It's easy to setup. The reason I'm giving 3 stars is the delivery time. Prime members supposed to receive items in two days. I ordered it on Feb. 17th and got the stick on Feb 24th. It couldn't be the back order because it showed two days delivery before ordering. An explanation is needed.", "verified": true, "helpfulness": "0/0", "author": "Book reader"}, {"rating": 5.0, "review": "Does everything I need it to do!", "verified": true, "helpfulness": "0/0", "author": "Keith Menchaca"}, {"rating": 5.0, "review": "Simple to set up and easy to use! I added Huluplus and still saving lots over my cable bill. Good job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Robert Alexander"}, {"rating": 5.0, "review": "WORKS GREAT!", "verified": true, "helpfulness": "0/0", "author": "bob teague"}, {"rating": 3.0, "review": "I enjoy watching my favorite Amazon Prime shows on the big screen rather than my kindle or laptop. Navigating the programs can be time consuming by alphabet though there is an app that can be used once down loaded to your smart phone. It's voice activated. I have not used this app yet.  With that being said, I dislike having to unplug my cable to insert the fire stick. Then again remove the fire stick to insert my cable wire. Any suggestions would be appreciated.", "verified": true, "helpfulness": "0/0", "author": "Dawnbird"}, {"rating": 5.0, "review": "Love it! Much faster than I expected . Even with TWC $15 internet", "verified": true, "helpfulness": "0/0", "author": "mcsd"}, {"rating": 1.0, "review": "The stick worked fine for 2 days, and now I can't log in or use.  :(", "verified": true, "helpfulness": "0/0", "author": "T. jensen"}, {"rating": 5.0, "review": "Works great.  The family loves it.", "verified": true, "helpfulness": "0/0", "author": "Christopher"}]