[{"rating": 5.0, "review": "Is exactly what is advertised and is great for the price.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "Absolutely love it!  Will be ordering more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really enjoy the quantity and quality of movies and TV shows and the music is awesome.", "verified": true, "helpfulness": "0/0", "author": "William Vass"}, {"rating": 3.0, "review": "I love the idea. It is very easy to use and a great way to view web-based shows on a t.v. I would get the box - With the stick the show stops every few minutes. I understand that this is do to the internet speed, but I have good internet. Also, before we bought the stick I guess people at the store told my husband to get the box because of this.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 3.0, "review": "It's really slick for the price, but there's limit to what you can pack into that little stick, I guess, because while it has basically the same features as its slightly larger competitors, it's noticeably slower to respond and the video quality. On the other hand it's half the price, which may make up for it for some folks. I'm definitely not unhappy with mine, but I don't know how I'd feel if it was the only streaming device I had in the house.", "verified": true, "helpfulness": "0/0", "author": "Snipehunter"}, {"rating": 2.0, "review": "Has anyone else noticed that movies which can be watched for FREE on Netflix have to rented or purchased if you choose it with Firestick?  Case in point:  \"Altar\" which is a decent supernatural flick.  If we plug that heavy cable into the TV's USB and my computer, we can watch it free.  If we plug the Firestick into the TV (thus keeping my computer free for use), we have to pay $3.99.  WTF?!I'm sure there are plenty of other discrepancies between Amazon Prime Video, Netflix, and Firestix.  Thinking very hard about sending this back.", "verified": true, "helpfulness": "1/1", "author": "S. Hale"}, {"rating": 5.0, "review": "Absolutely love my Amazon fire stick! I would recommend it to anyone! It's VERY simple to install and came a week earlier then expected!", "verified": true, "helpfulness": "0/0", "author": "Danielle Peterson"}, {"rating": 4.0, "review": "Love It!  Sling TV works with ease. Wish I could access the HBO GO app.  Guess there is a contract issue with Comcast.", "verified": true, "helpfulness": "0/0", "author": "Charles Soules"}, {"rating": 2.0, "review": "While it was easy to set up and use the remote is over simplified. Amazon claims thousands of movies are available but only a few in each category show up. Then there are all of the fees. To beat all, when I tried to register it, it was already in someone else's name so it must have been returned by somebody else and in fact, wasn't new. Not a complete waste of money but not much for the money either.", "verified": true, "helpfulness": "1/1", "author": "D. H."}, {"rating": 5.0, "review": "Easy set up, works better than I expecter", "verified": true, "helpfulness": "0/0", "author": "Ken Conaway"}]