[{"rating": 5.0, "review": "Great product, not as snappy as my AppleTV", "verified": true, "helpfulness": "0/0", "author": "LB"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Joyce"}, {"rating": 5.0, "review": "This is our first Fire Stick, after using Roku for several years.  I found the Fire Stick to be a great value for the money.  Incredibly easy to set up (it does require an external power source, which is mildly inconvenient, but I don't think any of the other sticks on the market can go without one either) and very easy user interface.  We bought the stick because the interface and app performance on our Samsung smart TV were terrible.  After months of not being able to watch a full episode of anything on Hulu, we threw in the towel.  Particularly if you're already an Amazon Prime fan, this stick makes using every perk of the Prime membership incredibly easy.  It also integrates other apps (like Netflix and Hulu) seamlessly and they run as well as they do on a Roku or on their own websites.  For the price, ease of use and also the easy portability for travel, I'd buy another Fire Stick any day.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 4.0, "review": "I have to reboot it occasionally and if my internet is overloaded I have to shut off other devices or live with the \"buffering circle of hell\".", "verified": true, "helpfulness": "0/0", "author": "CS"}, {"rating": 5.0, "review": "Excellent.  More than expected....", "verified": true, "helpfulness": "0/0", "author": "ed fleming"}, {"rating": 5.0, "review": "This is AMAZING!!! Im so glad I ordered this! I use to love Chromecast but this Fire TV Stick has WAY more to offer! It's easy to install and perfect for my 5 year old to manuver through the many apps and channels available.  The picture on my flat screen seems to be clearer when watching anything on the Fire TV Stick.  No need for Cable anymore!!!  I truly recommend this to anyone!!!", "verified": true, "helpfulness": "0/0", "author": "tamaiden"}, {"rating": 3.0, "review": "It's not working as well as I expected.", "verified": true, "helpfulness": "0/0", "author": "momaplunk"}, {"rating": 4.0, "review": "The only thing that would make it better and possibly 5 star is voice search.  Otherwise works just as good as the Amazon Fire TV, which is great!!!", "verified": true, "helpfulness": "0/0", "author": "Roland P Michaud"}, {"rating": 4.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "Bruce Dehn"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "bradley everhart"}]