[{"rating": 5.0, "review": "This little device is amazing.  I also have the Amazon Fire TV box on a different TV but this little dongle gives me most of the function of that box for much less $$$.  No, it doesn't have voice search but I rarely use that.  I like how the remote buttons are otherwise the same.  Batteries last plenty long enough in these remotes too.I'd read that the Roku was a better choice, and I was also tempted by Apple TV, but I use mostly Netflix and the Amazon ecosystem so the Fire TV Stick was the right choice for me.", "verified": true, "helpfulness": "0/0", "author": "Eric D. Arnold \"Penforhire\""}, {"rating": 5.0, "review": "Works as well as apple tv for a third of the price.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 5.0, "review": "Wonderful!!!!!", "verified": true, "helpfulness": "0/0", "author": "AnnIam"}, {"rating": 5.0, "review": "I just got this Fire Stick but it has not rested much since it arrived. It was very easy to install and works way faster than my Apple Tv. I'm loving it! Also, I've been using it on my, get this, very old tv. I bought a neat converter here on Amazon and it allowed me to finally watch more than just dvd's (we don't have cable- lol). In case you're like me and have an old tv, the converter I bought is the enKo products Mini Composite HDMI To RCA CVBS AV Converter (Input: HDMI; Output: AV) For VCR DVD 720P 1080P With High-Speed HDMI Cable (6.5 Feet / 2 Meter). It worked great for me!", "verified": true, "helpfulness": "0/0", "author": "Maria Margarita Loyde"}, {"rating": 5.0, "review": "Our family's new favorite interface for accessing digital media.", "verified": true, "helpfulness": "0/0", "author": "Russ Turley"}, {"rating": 1.0, "review": "I received this, DOA.  Returned it and I am ordering another one to see if 2nd one will work.", "verified": true, "helpfulness": "0/1", "author": "Aaron White"}, {"rating": 3.0, "review": "Best about the stick is easy to plug and play, worth the price, easy installation.Why I gave only 3 stars because it switches off the connection frequently which is annoying sometimes.", "verified": true, "helpfulness": "0/0", "author": "Sachin"}, {"rating": 5.0, "review": "Great product!!!!  Makws watching tv shows so much more fn, and it works great!!!", "verified": true, "helpfulness": "0/0", "author": "Babes Mom"}, {"rating": 2.0, "review": "My expectations were that I would be able to go straight to Netflix instead I have to sign in on Amazon and then go to Netflix which means I have my credit Card up twice to watch a free TV show that I pay a monthly fee to watch. Every time you get on it seems as Amazon is pushing their products on you.", "verified": true, "helpfulness": "0/0", "author": "David Jackson"}, {"rating": 5.0, "review": "Is a excellent Product and funcionality.  Installation is very easy.  The best product.", "verified": true, "helpfulness": "0/0", "author": "J.Gutierrez"}]