[{"rating": 5.0, "review": "Amazing device for its price range", "verified": true, "helpfulness": "0/0", "author": "Mohan"}, {"rating": 5.0, "review": "Works great and the android remote app makes searching and navigation way easier", "verified": true, "helpfulness": "0/0", "author": "Andrew Lucchesi"}, {"rating": 5.0, "review": "Very good unit. Responsive no lag at all and plus be able to sideload xbmc make this unit worth every cents", "verified": true, "helpfulness": "0/0", "author": "Alain Kwee"}, {"rating": 5.0, "review": "Very easy to use.  Remote control makes navigating very simple.  Great Wifi connection.  Will likely buy another for second TV", "verified": true, "helpfulness": "0/0", "author": "Lawrence E. MacStravic"}, {"rating": 5.0, "review": "Enjoying the Fire TV Stick.  Was easy to install has more features then I thought.", "verified": true, "helpfulness": "0/0", "author": "Joan Clarke"}, {"rating": 4.0, "review": "Great addition to my game room TV.", "verified": true, "helpfulness": "0/0", "author": "Paul James Micklos"}, {"rating": 5.0, "review": "Works like a charm and much faster than any other steaming device out there today! Perfectly happy with this buy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fire TV Stick works great.  Remote works well and it was very easy to setup and connect to the home wireless.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "Remote isn't the highest quality. Everything else is A+", "verified": true, "helpfulness": "0/0", "author": "C. Toews"}, {"rating": 5.0, "review": "I purchased this on a whim since it was only 20 bucks with Prime.  I bought it hoping it would replace my aging Roku 2.  So far it has meet every expectation!Quick and simple set up.  Easy to navigate (although the home screen is a bit more cluttered than the Roku's).I am a heavy PLEX user and this device handles 1080p streams with no hiccups.  Netflix and Hulu work flawlessly as well.", "verified": true, "helpfulness": "9/9", "author": "Ollie"}]