[{"rating": 5.0, "review": "Very easy to set up.  I watched the help videos to set up the unit and to load pictures into the cloud and set up a slide shows, etc.  Easy access to TV videos and movies.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth H. Case"}, {"rating": 5.0, "review": "late", "verified": true, "helpfulness": "0/0", "author": "Christian Lenny Flores Sachez"}, {"rating": 3.0, "review": "I purchased Amazon Prime to take advantage of free(?) 2-day shipping. As an added benefit, thought I'd explore the other perks that came with it, such as movies, music and books. As I'm a young-senior citizen (and very tech savvy), I thought I might enjoy watching movies, although that is what a TV set is for, traditionally.So, to facilitate that, I purchased the Fire TV Stick (I have FIOS so streaming is high-speed).Install of the Fire TV Stick was quite simple. All pieces/parts were included and I got it up and running very quickly.The hardware and firmware of the Fire TV Stick is very good.BUT...my disappointment was in the media that was available to me. Amazon Prime promotes \"watch 100,000 movies...hear millions of songs...read thousands of books\"...sounds to good to be true...and it was!I had access to all of this media, but only a small fraction of it was \" Free (?)\". The marketing promo for Amazon Prime leads one to believe that ALL of the Amazon libraries media is free(?) - wooohooo.Granted...there is a small amount that is free(?), but most is pay-to-play.So beware. Read the fine print (which I did, but was still confused) and don't expect the Golden (FREE) Egg.Have fun...", "verified": true, "helpfulness": "0/1", "author": "John k. Del Rios"}, {"rating": 5.0, "review": "Easy to set up & use - yea!", "verified": true, "helpfulness": "0/0", "author": "sewsheri"}, {"rating": 5.0, "review": "Love this!!", "verified": true, "helpfulness": "0/0", "author": "TG"}, {"rating": 5.0, "review": "Amazing item! Yes, it works perfectly. Easy, easy setup. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "T. Johnson"}, {"rating": 5.0, "review": "I have only used it a couple of times so far but, it seems to be as advertised - We don't go out to the movies, so this is a great way to see what everyone is talking about. -love it", "verified": true, "helpfulness": "0/0", "author": "James T Roberts"}, {"rating": 5.0, "review": "It is an excellent streaming tool. Plenty of apps to choose from. It is a great alternative to additional cable boxes in bedrooms.", "verified": true, "helpfulness": "0/0", "author": "Todd Fairchild"}, {"rating": 5.0, "review": "Defer review for 30 days.", "verified": true, "helpfulness": "0/0", "author": "G. Williams \"gman\""}, {"rating": 2.0, "review": "Got this to see how it compares to Chromecast. I'm not impressed so far. Overall it feels like it's trying to sell you stuff more than it's trying to help you find stuff. The search really only works with Amazon prime, and will try to sell you the Amazon version even if the movie/show is available on Hulu or Netflix. It's slow and clunky, lags and crashes.Pros:-Standalone apps for everything, doesn't need to cast from another device.-Comes with a remote... (Though I don't really like the button selection/usability of the remote.)Cons:-Unlike the Chromecast which turns on when you turn the TV on, the Firestick seems to always be on and gets REALLY slow. Sometimes there's a multi-second delay just going to the main menu and moving between things.-It takes a lot of effort to get to things with the remote. Typing is a pain. The UI is slow and not at all ideal. I'd rather use a chromecast with my phone or tablet than Firestick most of the time.-Flickering. Sometimes the TV flickers with green lines. Doesn't happen with Chromecast.-Crashes. I've read this in other reviews, and I experience it myself. It will just crash while watching a show and doesn't recover. You have to go back into the app and start playing again. This sucks for Sling TV for channels like Cartoon Network which don't allow rewinding/pausing.", "verified": true, "helpfulness": "2/2", "author": "John Gibson"}]