[{"rating": 1.0, "review": "tl;dr:Don't purchase this if you are in a college that does not allow you to broadcast your own wifi network or if you plan to use in hotels while traveling. There is no support for Enterprise WPA2 protocols or web browser login.If you have your own router (i.e., a regular home wifi network), you should have no problems, whatsoever.Long Version:I purchased this device for no frills media access to my Prime account and Netflix.My college campus wifi policy prevents me from broadcasting my own network, but I figured this wouldn't be an issue, since my college broadcasts two separate networks: one using WPA2 Enterprise PEAP and one connecting by WPA2 PSK combined with a web browser login.On initial setup, I noticed that the main wireless network (WPA2 Enterprise) didn't show up at all. I then tried to connect to the normal WPA2 PSK network, but since there wasn't a web browser to enter my credentials, I didn't have access to the internet. I was stuck at the setup screen, since without an internet connection, the setup process wouldn't move forward.At this point I emailed Amazon support about web browser login and data usage. The numbered lines are my questions.== EMAIL ==Me: 1. Fire TV Stick doesn't see the network at allAmazon Rep: In this case, I'd like to know if its [sic] personal network. If you don’t see your network, I'd request you to follow the below steps :> From the Home screen, select Settings, select System, and then select Wi-Fi.> Select Available Networks, you’ll see a list of available wireless networks.> If you are not viewing any network, Select Join Other Network or Rescan.Me: 2. Unable to access a web browser.Amazon Rep: You cant [sic] connect to the WiFi since we don't have login for browser.Me: 3. How much data is transmitted during setup?Amazon Rep: Data transmission depend up on the speed and package, so we will not be able to predict the data usage.== END EMAIL ==The parental controls settings menu option actually says that it can be used to restrict purchases and web browser access. It's interesting that the web browser is missing, however.To anyone looking to tether to get past initial setup, the initial download uses 672MB to show an hd tutorial video that cannot be skipped. If you turn off your data immediately after it lets you through the wifi setup menu, you can probaby avoid most of the download, however. I didn't do this, and thus wasted about a fourth of my month's data.I spoke with customer support on the phone as well, and I got bounced around a few times by technicians reading scripts. They kept telling me to check for interference, make sure I've entered the passphrase correctly, and other general wifi troubleshooting tips. Even at the higher level support, I wasn't given any usable advice. They kept suggesting I contact my ISP to fix the issue, even though it's a network I have no control over.Because it's possible to enable developer options and adb over network, it's hypothetically possible to work around the connectivity issues. I successfully installed the lastest firefox on the Fire TV Stick over adb on a tethering network broadcasted by my phone. However, note that text entry support is pretty much nonexistent. Even if you install a third party keyboard (AOSP Keyboard from F-Droid), unless you also build the AOSP Settings app from source and install it, there's no way to enable the additional input method. You can send an input method switch command (`adb shell input keyevent 63`), but without activating the keyboard, you won't be able to use it. In any case, I couldn't authenticate, even with the web browser open at the correct page and adb sending a text stream. It kept glitching on me. (Keep in mind that this is only with firefox, an unapproved app for running on this device. Text entry was fine, although painfully slow, in the regular UI.)If you have a router lying around, it might be possible to use the remote control android app. Unfortunately, I was using my phone as the network, so the app wasn't able to see the Fire TV Stick. This might be a solution to the text entry difficulties, but I couldn't test it.I'm sure someone more experienced with android would be able to get these working (or somehow enable WPA2 Enterprise -- is there an app for that?), but at this point, it's more trouble than it's worth for me.I've always had good customer service from Amazon in regards to shipping and purchases, but it seems their technical support is lacking in cases beyond troublehooting simple user errors or faulty hardware.To think I purchased this so I could avoid having to set up silverlight through wine on my linux computer. That is much simpler than trying to work around the limitations of this device.", "verified": true, "helpfulness": "2/4", "author": "artifexia"}, {"rating": 5.0, "review": "I like this over my roku,chromecast and apple tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"brian m\""}, {"rating": 3.0, "review": "Pros:  can install extra apps, stream from many streaming content providers, and compliments an amazon Prime membership.  Nice physical design.  Small.Cons:  terribly cluttered difficult to navigate interface that is very locked down.  If you're used to android or ios, you'll find it very difficult to find the content you want in a short time.  The search function should be more intuitive, easier to access.  The amazon apps available are limited and not very useful.  NO ability to stream or use google content except for youtube.  The remote uses swipe functions only, and is a non standard android controller.  If you try to sideload a better launcher, well you won't be able to navigate it.  If you sideload apps, they don't show up unless you navigate through the settings and on to app manager and launch them that way.  It feels like you're being locked down like an Apple device with less to offer and less refinement.  Chromecast is much more useful, especially now that you can stream your own photos and videos from Google cloud, and there is so much more support and integration now.  I wish I would have just bought an android stick or the nexus player.", "verified": false, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "This tiny streaming stick is amazing, the WiFi reception and peformance are very good for a device of its kind.Happy about the price I get it, only for 19.99, a great deal from amazon.", "verified": true, "helpfulness": "0/0", "author": "Lisandro Duran \"Sephiroth02\""}, {"rating": 4.0, "review": "Nice product. The remote is a nice touch.  It has room for improvement. I like that we can tune and adjust the screen size.", "verified": true, "helpfulness": "0/0", "author": "N. Keith"}, {"rating": 4.0, "review": "Works flawlessly for me. I use mostly Netflix and Amazon Prime for movie and TV watching and those apps work great. The Fire Stick immediately recognized my wifi extender and connected without issue. The remote works very well and the whole interface is very intuitive once you have used it a few times.The one huge gripe I have (worth 1 star off at least) is that the Fire Stick has to be plugged into the wall in order to work! Now that I look back at the description, I can find the small print that says it needs wall power, but I do think Amazon should make that clearer in its pictures of the Fire Stick being used and in its commercials on TV. I have my TV mounted on my wall with no wires showing and now I have one wire hanging down whenever I hook up the Fire Stick. I suppose I could take my TV off the wall and try to see if I could plug the stick in behind there, but that will be a lot of work and I don't think it's worth it at this point. I just would like to have known this fact before buying this product.My conclusion is that this device functions exactly as it claims and I would recommend it to anyone that doesn't mind a power cable coming from their HDMI input.", "verified": true, "helpfulness": "0/0", "author": "Jeff D. Moehling"}, {"rating": 4.0, "review": "Love this device. Works best on my legacy TV(no smartness in my TV, i,e no apps). Fast, quick in downloading contents.Less usefulness for those who have smart TV,Does not have browserIf you have Amazon TV this works well, but again if you have apple device i,e ipad and apple TV. No need for this device.", "verified": true, "helpfulness": "0/0", "author": "Srinath B. Thimmasetty"}, {"rating": 1.0, "review": "If I can ever get the battery cover open on the remote, maybe I'll come back and write about the Fire TV Stick. For now, I need to let my thumb heal before trying to get the battery cover off again. Amazon should take a clue from the other guys; at least I can use an Android app to setup and configure theirs.", "verified": true, "helpfulness": "0/1", "author": "practical-me"}, {"rating": 1.0, "review": "The intro/setup process is terrible. I'm ready to return it and I haven't seen a single video yet other than the awful intro which you can skip and keeps crashing and starting over.", "verified": true, "helpfulness": "1/3", "author": "Olu M. Howard"}, {"rating": 3.0, "review": "We have an Apple TV that we use on a daily basis and love it. We wanted this device to stream Amazon prime video since Apple TV doesn't have an app for that and Amazon doesn't allow mirroring from our iPad or iPhones for prime videos. I'm on the fence. When the dang thing keeps a connection to our wifi, it's great and functions just as we hoped. However, about 50% of the time, it will lose connection to our network, make us retype the network password 5x, and then \"connected with problems\", disconnects, and the process takes about 10 minutes before we are set to use. This is a hassle altogether. We only paid $19 for it so we will keep it for the prime video usage, but won't utilize it for any other apps, as our Apple TV is much more dependable and versatile for us.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}]