[{"rating": 4.0, "review": "Only had it for a month, so time will tell on a lot of the variables--e.g., how long until I have to buy another one?--but it has been exactly what we needed. We were watching Netflix and listening to Pandora on a laptop previously, and this is just way better. Don't get this if you don't have Amazon Prime or Netflix. Obviously, a lot of smart TVs will phase this out of the market, but until we have one, we are very happy with this.", "verified": true, "helpfulness": "0/0", "author": "mcj333"}, {"rating": 5.0, "review": "It works great", "verified": true, "helpfulness": "0/0", "author": "Amjad Hamad"}, {"rating": 5.0, "review": "First I want to say I DO NOT work for Amazon and am under no obligation to write anything nice about this product. I do buy a lot of things from Amazon and this is absolutely one of the best. I have an Apple TV and a Fire Stick both hooked up to my TV. There is no comparison where the Stick does not out perform the Apple devise. The Stick is fast and accurate. I have NEVER experienced any buffering and that is huge for me. I hate when a stream is stuck and you sit and watch. Even Netflix, which is very twitchy, comes through fast and uninterrupted. I have to say that after spending thousands of dollars on products from Amazon, this is by far the best money I ever spent. Try it. It's worth it and it doesn't cost much.", "verified": true, "helpfulness": "0/0", "author": "Jack Schrumpf Jr."}, {"rating": 5.0, "review": "Easy to use, and an excellent value !", "verified": true, "helpfulness": "0/0", "author": "TK"}, {"rating": 5.0, "review": "provides seamless and commercial free viewing - bye, bye cable", "verified": true, "helpfulness": "0/0", "author": "balzout"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "gadgetgetter"}, {"rating": 4.0, "review": "When I first received this device I really loved it. But now that the Prime subscription and Hulu plus are gone I only use it for Youtube. I was hoping I could use it to watch week old episodes of public broadcast tv and to read my kindle books on the tv screen.", "verified": true, "helpfulness": "1/1", "author": "Priscilla"}, {"rating": 5.0, "review": "This stick is amazing. I can plug it in to any compatible TV in house and it comes right on. It plugs in easily and has so many different apps and games that you have the option to download. My daughter and I both love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I think the Fire TV stick itself is a great value and would have gotten 5 stars if it were not for frequent long interruptions in broadcast. My son tells me that it is not the Fire Stick's fault, it is the fault of Comcast. I actually don't know for sure. I do know that we have Comcast's fastest download speed. My son explains that Comcast limits bandwidth to Fire stick type products because they are a low cost direct competitor. In summary I would say the value is very high but so is the annoyance due to the frequent pauses. Why 3 stars? It would have gotten 5 stars if no interruptions and 1 star if the interruptions are the fault of the Fire Stick so 3 is a best compromise.", "verified": true, "helpfulness": "1/1", "author": "Greggy"}, {"rating": 5.0, "review": "Was a long time in coming but well worth the wait. A truly great invention.", "verified": true, "helpfulness": "0/0", "author": "Margaret Martin"}]