[{"rating": 5.0, "review": "I love it!  Has everything I need, and more!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not overly impressed. I've had serious issues streaming the Watch ESPN app. Very laggy and drops out. Also have trouble with the remote app not being able to sync up with the device (cannot find it wirelessly). I also have a Roku and find myself using that much more frequently. Glad I only paid $19 for this.", "verified": true, "helpfulness": "0/0", "author": "DJBodhisattva"}, {"rating": 5.0, "review": "Great little device.", "verified": true, "helpfulness": "0/0", "author": "C. Chase \"BajaMike\""}, {"rating": 5.0, "review": "I am such a fan of this item.  We used it several days a week, and are pleased with the product quality, as well as the available programming.", "verified": true, "helpfulness": "0/0", "author": "C. Parker"}, {"rating": 5.0, "review": "Pretty neat. Lots to check out.", "verified": true, "helpfulness": "0/0", "author": "Emma"}, {"rating": 5.0, "review": "One of the best purchases I've ever made especially since I also have prime membership", "verified": true, "helpfulness": "0/0", "author": "Brian Quinn \"briguy\""}, {"rating": 5.0, "review": "These are awsome.  I bought 2. Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Stephen N. Maglio"}, {"rating": 5.0, "review": "I love it!! The Fire TV Stick has turned me on to movies I wouldn't have access to.", "verified": true, "helpfulness": "0/0", "author": "cherie c. taylor"}, {"rating": 4.0, "review": "I originally purchased this because I am a Prime member and got this on the $19 special. I already own a Chromecast and I'll be honest I like this just as much as the Chromecast. We primarily use this with Plex, Youtube, and Prime. I like it because it feels more like a standalone product than does the Chromecast and the combo of my smartphone. The remote is super light and small and tends to get easily misplaced in our media room. If you have an Android OS phone I would download the Fire TV Stick App for the voice search. It works remarkably well and is very fluid.This is a five star product that I am giving four stars only because I wish Amazon would hurry and make it usable in hotels while traveling. Once that happens this would be a near perfect streamer.", "verified": true, "helpfulness": "0/0", "author": "C. Aaron"}, {"rating": 5.0, "review": "was very easy to get going", "verified": true, "helpfulness": "0/0", "author": "Danny P. Benton"}]