[{"rating": 5.0, "review": "I love the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Bcldawg"}, {"rating": 5.0, "review": "This is a great product. Sign up for prime and make your money back instantly with the included prime shows. Great picture and very easy set up.", "verified": true, "helpfulness": "0/0", "author": "kenneth Powell"}, {"rating": 4.0, "review": "So I really like this over the Roku although I would think there would be more apps and programs that it would offer to compete better in the marketplace. Overall I can get my Netflix and Amazon movies.", "verified": true, "helpfulness": "0/0", "author": "Tammy Wzorek"}, {"rating": 5.0, "review": "As soon as I get time to learn about it  I am going to enjoy it. Have not had a chance to use it much.  I am looking forward to the programing  and the ability to travel with it.", "verified": true, "helpfulness": "0/0", "author": "Larry M. Kuhn"}, {"rating": 3.0, "review": "Found Fire stick device to be very easy to stall. Far simplier than Chromecast which I sent back for lack of compatibilty with my Verizon tablet.  I dont have Prime yet.  BUT can't get signed into my Netflix acct. Tried some of the suggestions found on the device support link but so far no luck.  There's several complaints listed under the review section about the upgrade app not working. So maybe this is the problem?  Any suggestions Amazon?  before I go back to my blue ray player and return this thing? Whole reason for getting the Stick was to get away from clutter of more devices around the TV and have more viewing options &hopefully; less buffering. IF we get signed into Netflix and everything works okay, I would rate this 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Jeephers"}, {"rating": 5.0, "review": "Very easy and turns any TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amie Maza"}, {"rating": 2.0, "review": "I've had Amazon Fire TV for 4 days and its has frozen and glitched on me 8 times in less than a couple hours. At one point it completely froze and I couldn't use amazon until I unplugged everything and plugged it back in. Absolutely ridiculous. I'd rather pay over double the price for the Apple TV.If you want basics and don't mind low quality - by all means, this device is for you. If you like variety and good quality, don't bother. Pay more for a better experience.", "verified": true, "helpfulness": "0/0", "author": "Chloe Pasquini"}, {"rating": 1.0, "review": "The stick works great as far as function goes but very limited on movies and shows. Netflix has a lot more to offer on its own and you can get that on any smart tv or gaming console. I even have Amazon prime and what you can watch for free kinda sucks.", "verified": true, "helpfulness": "2/2", "author": "Travis Family"}, {"rating": 5.0, "review": "goodnight", "verified": false, "helpfulness": "0/0", "author": "Johan F."}, {"rating": 4.0, "review": "Haven't used yet. I think it's going to be just fine.", "verified": true, "helpfulness": "0/0", "author": "Roselena Maxson"}]