[{"rating": 5.0, "review": "It's wonderful!! We tried (and returned) other products. This one is by far the best!!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 3.0, "review": "The Fire TV stick is fine. The lack of an instruction sheet SUCKS!", "verified": true, "helpfulness": "0/0", "author": "W. Pack"}, {"rating": 1.0, "review": "At least once a day, sometimes twice, fire stick decides I am not allowed to stream TV anymore. Normally I wouldn't mind, but I have a fractured knee and now I have to crutch to the power strip and turn it off and back on. I was considering buying a second one, but I am seriously rethinking it. When it happens there is an internet connection, so it is the Fire TV Stick that stinks!", "verified": true, "helpfulness": "0/0", "author": "Deborah P. Rubino \"Dee.Ruby\""}, {"rating": 4.0, "review": "Works as expected.  Somewhat disappointed that at the amount of TV shows I still have to pay for even after being a prime member.", "verified": true, "helpfulness": "0/0", "author": "Richard Parian \"TobyBoy4\""}, {"rating": 5.0, "review": "much easier than using my phone because every time i or the grandchildren were watching a movie i would get a phone call. I would recommend this highly, which I have..Plus as a Prime member you get so much more offers.", "verified": true, "helpfulness": "0/0", "author": "Roseann B. Voigt"}, {"rating": 5.0, "review": "It's grest", "verified": true, "helpfulness": "0/0", "author": "Mollie"}, {"rating": 1.0, "review": "I was not satisfied with this at all. Everything it advertised to have you had to pay for it.", "verified": true, "helpfulness": "0/1", "author": "lori scherer"}, {"rating": 3.0, "review": "I like it a lot and it's easy to use. I think it could have newer movie's and more recent ones for less money. Because you can red box cheaper", "verified": true, "helpfulness": "0/0", "author": "sonia"}, {"rating": 5.0, "review": "Best money spent, complete home entertainment in a stick", "verified": true, "helpfulness": "0/0", "author": "Humberto Chavez"}, {"rating": 5.0, "review": "Yes very easy to set up find apps watched a movie sound and picture were very good quality", "verified": true, "helpfulness": "0/0", "author": "alice mangus"}]