[{"rating": 4.0, "review": "I bought the Fire TV Stick because I was tired of keeping my phone plugged in while binge watching The Sopranos, and Amazon is not available on Apple TV. The Stick was easy to install and \"fired\"up immediately. It took a couple of tries for it to connect to my wifi, but that was not really a big deal. The Fire Stick provides excellent picture and sound and I have not had an issue with buffering, something that did happen occasionally when streaming through my phone. The only thing I don't like about the Stick is that navigation is not as easy as I think it should be. Many times, what I want seems to be highlighted and I press the center of the circle to select it, then it jumps ahead to the next item instead. It's a bit annoying and I know someone with less patience than I would be very frustrated over that.", "verified": true, "helpfulness": "0/0", "author": "Else Karlsen"}, {"rating": 2.0, "review": "Would not work on my Samsung tv", "verified": true, "helpfulness": "0/0", "author": "Darrell Wicker"}, {"rating": 1.0, "review": "cant get it to work", "verified": true, "helpfulness": "0/0", "author": "james lakosky"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "marcos vargas"}, {"rating": 1.0, "review": "frustrating to set up, constant disconnects from wireless, no hbo go or twc access.  Once I finally got it working - there were some issues with it even powering up using the power plug and cord provided - and it still said no power was hooked up afterward - took far longer to update than I would have expected.  I guess I shouldn't expect much tho - it's basically worthless at this point tho. At least it was only 20 bucks.", "verified": true, "helpfulness": "0/0", "author": "jared Young"}, {"rating": 1.0, "review": "It's not possible to project your computer/tablet/phone screen to the TV. It seems this functionality is available from only Amazon Fire Tablet and Phone. I was hoping to replace my Chromecast with Fire TV stick because Chromecast doesn't come with a remote, but not able to project computer/tablet/phone screen on TV is a deal breaker for me.", "verified": true, "helpfulness": "1/1", "author": "M. Agarwal"}, {"rating": 4.0, "review": "Awesome so far preferable if not better than the chromecast only issue I had was with the setup had to try three times to get to set up but then it finally setup and works for me", "verified": true, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 5.0, "review": "This is an excellent little device. We use it almost every night.", "verified": true, "helpfulness": "0/0", "author": "Matthew R Weasel"}, {"rating": 5.0, "review": "Awesome.  Just awesome.", "verified": true, "helpfulness": "0/0", "author": "MightyH"}, {"rating": 5.0, "review": "After having 2 kindle Fire devices I already knew what I was in for with the Fire Stick. Small, easy to set up all the features of prime, what's to complain about. I guess the only flaw is there is no actual off button/switch. The control is small and there is enough room for an on control power button. You have to physically unplug the power cord to turn it off. Asaide from that I still give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "invictus syd"}]