[{"rating": 2.0, "review": "As far as the performance the Fire tv stick, it exceeded my expectation. It was compatible with the USB ports on my on my flat-screen tv. Set up was a breeze. The remote makes far better than other services for Internet TV and movies. However my problem with amazon movies.  all the free movies that  are available through amazon prime are old and there is a cost for renting current movies even with an amazon prime membership. .other than this the firestick is great!", "verified": true, "helpfulness": "0/0", "author": "bthomas2040"}, {"rating": 5.0, "review": "Exceeded expectations", "verified": true, "helpfulness": "0/0", "author": "david chromey"}, {"rating": 5.0, "review": "Thus far, it is performing beautifully.  Also, the remote is great.", "verified": true, "helpfulness": "0/0", "author": "wv3"}, {"rating": 5.0, "review": "Our kids love it. Its a great deal too!!", "verified": true, "helpfulness": "0/0", "author": "Michele Winning"}, {"rating": 4.0, "review": "Love the fire stick! Allows me to watch shows that I can not with Apple TV.", "verified": true, "helpfulness": "0/0", "author": "shelley"}, {"rating": 1.0, "review": "Expected more, terribly long shipping, laggy. When multicasting fire phone, huge delay. Impossible to stream anything smooth", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "Great device and inexpensive ... very happy I bought it!", "verified": true, "helpfulness": "0/0", "author": "LMC6882"}, {"rating": 5.0, "review": "Easy to connect and tons of viewing options! Very pleased.", "verified": true, "helpfulness": "0/0", "author": "JoAnn"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "johnny mcguire"}, {"rating": 4.0, "review": "This item works fine and is easy to install.  The only drawback is that an Amazon Prime membership is necessary to get the content without paying for each item.  It is great for a Neyflix account.  The shipping was S L O W.", "verified": true, "helpfulness": "0/0", "author": "Reginald Stanmar"}]