[{"rating": 5.0, "review": "Very easy. User friendly. Would buy again.", "verified": false, "helpfulness": "0/0", "author": "Nicole Day \"Nicolemaarie\""}, {"rating": 2.0, "review": "Not really that impressed..i have fast internet but this thing is constantly freezing and alot of times you have to pause it so a show can load how you would on YouTube.  Im going back to my roku.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Baroni"}, {"rating": 4.0, "review": "We have only had the fire stick for a week...so far so good...some buffering, but think we just need to up our internet speed.", "verified": true, "helpfulness": "0/0", "author": "Mary Wynne"}, {"rating": 1.0, "review": "Don't bother. Seemed nice at first, but buggy and Amazon support for this apparently ranks far below their dealing w/ non amazon products.  Advice is ... Don't bother.", "verified": true, "helpfulness": "0/0", "author": "blah"}, {"rating": 5.0, "review": "I had a chrome cast before, and the fire stock blows it out of the water.", "verified": true, "helpfulness": "0/0", "author": "Ryan Brown"}, {"rating": 5.0, "review": "I've had several different streaming devices.  Fire Stick is by far my fav!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Destroyed ROKU 3.  Had a R3 and every time there was an update it'd need at least 3 to 27 reboots.  Fire tv stick has been running for almost a month with no issues.  I just want to watch Netflix.  Roku is in the trash.", "verified": true, "helpfulness": "0/0", "author": "Shepherd"}, {"rating": 1.0, "review": "Been using the Fire TV Stick for nearly two months now and my opinion of it has totally changed since I first began using it. What at first seemed like the perfect solution to use for Netflix, Prime and Plex has turned into more frustration than it's worth. All three of the before mentioned apps stutter, buffer and crash constantly. I have a brand new Apple TimeCapsule that is less than two feet from the Stick in my TV stand and a 100Mbps Internet connection - absolutely no connectivity issues on any of our other numerous devices in the house. For whatever reason, the Stick just can't keep up. If I unplug it and plug it back in after a few seconds, it'll work okay for a little while, but soon starts losing connection and all the other little quirks and issues come right back again. I switched from using my PS4 for all my video streaming because I wanted something that worked with my Harmony remote (which is one positive thing I can say about the Stick, works great with Harmony). After trying everything I can find to improve the wifi performance of the Stick, I've gone right back to my PS4. It works flawlessly so having to use both my PS4 controller and Harmony to control everything is a more than acceptable, very minor drawback. Very disappointed that the Fire TV Stick didn't work out for us.", "verified": true, "helpfulness": "1/2", "author": "Ben Dalton"}, {"rating": 5.0, "review": "This thing is amazing!  I love it", "verified": true, "helpfulness": "0/0", "author": "Desertflamingo2"}, {"rating": 5.0, "review": "I have 100% replaced my google chrome cast with the Amazon Stick. Very easy too use.", "verified": true, "helpfulness": "0/0", "author": "TigerFan \"Cory\""}]