[{"rating": 5.0, "review": "Xbmc installed and watching pay per view and movies", "verified": true, "helpfulness": "0/0", "author": "Kanaka"}, {"rating": 5.0, "review": "Wow. Everything I expected and more.  So .such entertainment in a small thing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Be side the loading and upgrade the tv show are good and am a prime member is a plus.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 1.0, "review": "I felt disapointed in the fire stick. I have a t.v. that is five yrs old. The fire stick would not play because the t.v. dosent have a chip to prevent pirating.  I feel that I spent money for nothing and that I should have been told before it was purchased.  The tech told me I would have to upgrade my t.v. do we have to buy more and more just to satisfy needs. I feel it's ridiculous and this is why the U.S. is a throw away country.", "verified": true, "helpfulness": "0/0", "author": "Sheena VanHooser"}, {"rating": 4.0, "review": "Powerful little stick. Streams well over WiFi. While it accepted XBMC firmware makes it difficult to access sideloaded apps.", "verified": true, "helpfulness": "0/0", "author": "David Jeremy Schneid"}, {"rating": 5.0, "review": "Exceeded my expectations. Purchased for my father and he loves it!", "verified": true, "helpfulness": "0/0", "author": "Angela Metzger"}, {"rating": 2.0, "review": "My wife uses it and has not been happy with it. If we knew then, what we know now we would not have ordered it.", "verified": true, "helpfulness": "0/0", "author": "Dale Morsette"}, {"rating": 3.0, "review": "Very disappointed in the movies and shows that are loaded, most of them I have not heard or they are so old I've already seen them.", "verified": true, "helpfulness": "0/0", "author": "Robin M Brown"}, {"rating": 4.0, "review": "Easy to setup and easy to use. The remote is a bit small if you have big hands though. The whole family is thrilled that we have amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 5.0, "review": "everything I expected happy I bought it.", "verified": true, "helpfulness": "0/0", "author": "gene brandt"}]