[{"rating": 3.0, "review": "Disappointed to find out that most of the shows I want to watch are not free with Amazon Prime. Feel a little ripped off.", "verified": true, "helpfulness": "0/1", "author": "Brian Zaas"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "1/1", "author": "MichaelWhite"}, {"rating": 5.0, "review": "I got it during the half price sale! Works great. Very fast. If they added Internet surfing it would be the best!", "verified": true, "helpfulness": "1/1", "author": "Big D"}, {"rating": 5.0, "review": "Easy to install. It works very well. No complaints so far.", "verified": true, "helpfulness": "1/1", "author": "Joseph Lee"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "1/1", "author": "Luke A."}, {"rating": 5.0, "review": "Great streaming device. I have this and Chromecast and already prefer this. I think it is very helpful to have some user interface on these things. Also I can mirror my HTC M8 with no problem. For some reason that is still not available on Chromecast. All in all a worthy competitor from Amazon - just another reason I am glad to be a customer.", "verified": true, "helpfulness": "1/1", "author": "middlefizzle"}, {"rating": 5.0, "review": "Love it!!! Works perfectly. Such a great product for a great price!!", "verified": true, "helpfulness": "1/1", "author": "Erin Kramer"}, {"rating": 2.0, "review": "5 months into using this and I suddenly have pop jp ads in the yourtube app averaging only 3 minutes apart and always the same annoying commercial with the most annoying commentary I have ever heard. If I dont hit the skip button it plays for FIVE minutes. Amazon products are rapidly losing their appeal! When it works, it works great...then it overheats to the point of nearing burning me and I have to unplug it for a half hour until it is back to room temperature and it will work again for a couple more hours.", "verified": true, "helpfulness": "1/2", "author": "Elizabeth Odell"}, {"rating": 5.0, "review": "I love it. Well done.", "verified": true, "helpfulness": "1/1", "author": "Marc Soriano"}, {"rating": 4.0, "review": "It's good - it definitely needs some software improvements (Hulu plus is just sloooooooow in the navigation).I also realize that this is an Amazon Product, and they of course want their services featured, but it would be nice to re-arrange the app launching more/pin things permanently (I'm using it primarily as a Prime/Hulu/Netflix stick, not so much for buying additional content).I'm still trying to find a good DLNA player too, with all that (and the hefty prime discount) it's definitely a good product, but it needs some polishing before I'll trash my Roku's.", "verified": true, "helpfulness": "0/0", "author": "TEKNOFLUXX"}]