[{"rating": 1.0, "review": "Really upset with how PrimeDay handled the purchase of the Firestick. None available starting at 9AM. I  joined the wait list, which provided a half second flash of a dialog box that I could order, but then never provided an add to cart. This happened several times. I tried straight through 11 PM, which was like playing Whack the Mole for an entire day. I've been a loyal Prime customer since 2009 and am pretty disgusted.", "verified": false, "helpfulness": "2/2", "author": "Artsy Type"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Jeannie Culbertson"}, {"rating": 4.0, "review": "I'm very glad for purchasing this product, but I'm very dissapointed that in Argentina the services as Prime video doesn't work. Regards", "verified": true, "helpfulness": "0/0", "author": "nachojaure"}, {"rating": 4.0, "review": "easiest set-up of any electronic gear.  Haven't tried many aps yet but are skeptical of reviews of Netflix ap.  Controller is great.  Problem in figuring out what is free for prime and what has to be paid for.", "verified": true, "helpfulness": "0/0", "author": "Phillip N. Woods"}, {"rating": 5.0, "review": "Had Chromecast this is so much ch better!", "verified": true, "helpfulness": "0/0", "author": "Deborah W. Johnston"}, {"rating": 5.0, "review": "Excellent buy. Tons of games to preview for free.  Easy to use and small enough to travel with. Tv, music, games and much more.  Bought for someone else but ended up keeping for myself.", "verified": true, "helpfulness": "0/0", "author": "Nakia Bond"}, {"rating": 5.0, "review": "Easy set up and have been binge watching shows I had missed, and listening to my music playlist", "verified": true, "helpfulness": "0/0", "author": "Penny Durkes"}, {"rating": 2.0, "review": "It kept stopping in the middle of movies, if you turn it of at night may take some working to turn on later, not very good", "verified": true, "helpfulness": "0/0", "author": "Quiana Smith"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Israel"}, {"rating": 1.0, "review": "mlb.tv cuts out constantly only reason I got it", "verified": true, "helpfulness": "0/0", "author": "lukas hashbarger"}]