[{"rating": 5.0, "review": "We had a Roku previously for our bedroom TV.  We recently purchased the Fire TV stick to replace the Roku.  It is user friendly and has all the apps that we could want or need.  The nice features are the remote and the footprint of the unit.  The stick is plugged in behind our TV.... out of sight!  It is also cool that it is portable, so we can take it with us when we travel.", "verified": true, "helpfulness": "0/0", "author": "Contagioncat"}, {"rating": 1.0, "review": "This is a bad product, not ready for consumer use. It's performs way below it's specs and description.", "verified": true, "helpfulness": "0/0", "author": "Tomy"}, {"rating": 3.0, "review": "I liked it except that Fire TV Stick is clearly designed to incourage the purchase of Amazon products. It takes a number of steps to access other apps. Let me be clear that I like various Amazon products and buy them but I do not like to feel controlled and directed.", "verified": true, "helpfulness": "0/0", "author": "HAY 5"}, {"rating": 5.0, "review": "At first I was disappointed that the stick requires a power cord that has to be pluged in. However it was quickly forgotten once I started using the device. It is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Monica Carlson"}, {"rating": 5.0, "review": "Better than expected.  It's so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Myral85\""}, {"rating": 5.0, "review": "I love the firestick!!  No more fighting over who gets to watch the tv with the prime and Netflix app on it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow!. A super piece of electronic equipment made for TV viewing. Super simple to set up and use. Plenty of content available for your viewing pleasure. Highly recommended,", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 3.0, "review": "Works good set up is confusing", "verified": true, "helpfulness": "0/0", "author": "Joseph Pijan"}, {"rating": 4.0, "review": "the only thing I don't like is that it needs its own power supply.", "verified": true, "helpfulness": "0/0", "author": "Melanie"}, {"rating": 5.0, "review": "Works great, having a lot of fun downloading movies from Amazon etc.", "verified": true, "helpfulness": "0/0", "author": "Linda Schafer"}]