[{"rating": 1.0, "review": "Will not connect to my password protected wifi network. Since this device needs the internet to work it is completely worthless. I tried every thing they said to do to get it to work even with no luck. DO NOT BUY!", "verified": true, "helpfulness": "0/1", "author": "david saindon"}, {"rating": 5.0, "review": "Works great. I love the interface, and find it easier to use than the Amazon on app on my Smart TV. I fear the switcher may give out if I continue to use it for games though.", "verified": true, "helpfulness": "0/0", "author": "BookWorm620"}, {"rating": 5.0, "review": "It's fast and the video is better than my Roku 2 XS. The UI layout is a little strange and does take some getting used to but the over all experience is outstanding.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "Excellent product. Easy installation and comes with all the apps that I need. For the relatively low price it is a much better option than buying a smartTV.", "verified": true, "helpfulness": "0/0", "author": "Eldridge Powell"}, {"rating": 3.0, "review": "Having a wall amounted TV - please note:  there is a power supply cord that powers the unit.  The commercial fails to mention such......therefore you will have to manage the cord from being unsightly. I feel misinformed.", "verified": true, "helpfulness": "0/0", "author": "James R. Williams"}, {"rating": 2.0, "review": "Product quality is good but remote does not work correctly and specially in the games it fail to respond on time. Also some how it does not ask anything for configuration and it automatically detect your account but it also turned on 1-click option and that was disaster. My kid has order more 5 digital movies order worth more then 75$ :( though it is in refunding state but you have to go through all hassle.", "verified": true, "helpfulness": "0/0", "author": "joji"}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "C. Vance"}, {"rating": 4.0, "review": "Couldn't mirror my screen from my 10\" note . Get this working and it will be great.", "verified": true, "helpfulness": "0/0", "author": "Craig Baugh \"cbaugh\""}, {"rating": 1.0, "review": "New firmware bricks device if you are rooted.  Buyer beware.", "verified": false, "helpfulness": "0/1", "author": "<|®©|"}, {"rating": 1.0, "review": "I purchased 3 of these to replace the Roku's I have the hard wired Amazon Fire TV in the living room and it works great. However, all these sticks are horrible. All three freeze-up constantly and buffers like its 1999 - I've had the Roku boxes hooked up and running all together and never a issue. Unfortunately for me I gave my Roku's away when I purchased these because of how awesome the hard wired Amazon Fire TV is - now I'm looking at buying some new Roku's - Amazon has the right-idea but lacking the technology with these - also boxed remote has no talk and text feature like the hard-wired model.", "verified": true, "helpfulness": "0/0", "author": "Scarlette King"}]