[{"rating": 5.0, "review": "very fast and snappy.  Very little to no lag when inputting commands.  Setup takes a few minutes but once you're connected and updated its easy peezy.", "verified": true, "helpfulness": "0/0", "author": "Joe J."}, {"rating": 5.0, "review": "Excellent item with a very prompt delivery, thanks", "verified": true, "helpfulness": "0/0", "author": "Jayss"}, {"rating": 5.0, "review": "Very Impressed. Does so much more than it's competition. It's newly released and has room for improvement but when on sale it's definitely worth every penny and more.Some large factors for it being worth its price tag would be that:1. you can mirror whatever is on your tablet or phone for free onto the t.v.2. It streams netflix, prime, watchESPN, etc.3.Voice navigation is accurate4. The games on it are great especially fibbage. (controlled by phone/table/remote)The stick needs improvement in the following areas at first glance...1. Voice navigation is limited(does not navigate within netflix for example)2. Does not have a ton of apps currently.Summary: Best bang for your buck and works as it says it does. I will buy again when on sale. I'm sure Amazon will continue to update features and make this next to flawless. I love mine as does the 4 others I know who bought one.", "verified": true, "helpfulness": "8/8", "author": "dfunk"}, {"rating": 5.0, "review": "Easy to installGood designNice remoteNice HD pictureGood selection", "verified": false, "helpfulness": "0/0", "author": "kirby baloy"}, {"rating": 3.0, "review": "It's decent it just lacks some basic apps that I expect by now from the Fire TV ecosystem. Namely NHL Gamecenter, NBA League Pass, and HBO Go (supposed to be coming soon!). You're better off getting a Roku if you're interested in streaming sports. I do have to say though, the picture quality is ASTOUNDING. I used it to watch WatchESPN for a bit and I honestly forgot that I wasn't viewing an HD Cable TV channel. Both the Chromecast and my PC don't have as good of a picture quality on my HDTV.I only spent $20 on it so I'll probably end up keeping it. Not sure I would recommend this for the full $40 price point though. At least not yet. If you aren't a Prime Member, I also wouldn't bother.--Update 4/13/2015 ---Meant to do this sooner but it does now have both HBO and NBA League Pass support. (still no NHL or NBC Sports but that's not Amazon's fault!) My major issue with it after using it for 6 months is I can't get it to reliably stream media more than 10 feet from my router. I can use it in my living room which is next to the router but if I try it in my bedroom upstairs (I live in a small rowhouse) it just buffers repeatedly. I also can't get it to connect at all to the 5Ghz upstairs. I have tried watching Watch ESPN, NBA, MLB, Netflix, and Prime shows and I don't think I've ever gone more than 30 minutes without it buffering (and that's being generous). I know it's not my router because my Chromecast works perfectly in both the living room and bedroom as well as every other connected device in my house (numerous phones, a tablet, chromebook, 2 laptops, Amazon Echo, etc etc). I'm glad I only spent $20 on but it still bums me out that it doesn't work better. I might try moving my router to a different spot but I feel like I shouldn't have to do this because everything else works fine with the router in the location that it is in.As for some pros, I do like some of the games. The the Jackbox party pack is a lot of fun especially when you have people over for a party! And I do like Crossy Road on the big screen.Overall I still only would give it 3 stars and I would not recommend this to anyone who has a router that's far away from where they plan to use it. I would say get a Roku or a Chromecast first.", "verified": true, "helpfulness": "4/5", "author": "mdoublea \"mdoublea\""}, {"rating": 3.0, "review": "Day 1: Came up just fine.  Watched one Amazon Prime movie to see that it worked. Worked fine. It did complain that I was not using the supplied power supply but in fact I was. But as it worked I figured it was ok.Day 2: Decided to bring up Netflix. Downloaded fine. Tried to play a movie and got \"HDCP Unauthorized Content Disabled\".  Figured Netflix was not working.  Pulled up a Prime movie and got the same message. I get sound but no picture. I unplugged and replugged and no change.  I'll keep messing with it a little longer as others reported the same issue and worked it out. The android app was great once I figured it out.  Much better than the remote.Brilliant idea but execution is weak. Got it at the $19 price so I'm still hopeful.Update: 11/25So far, no joy.  I would think that the Fire Stick wasn't compatible with my Samsung LN-S3241D TV except that it worked fine on the first day. I factory reset the stick, moved it between the two HDMI ports, power cycled the TV including unplugging it, jiggled the stick in the HDMI port, used the HDMI extension cable that came with the stick, and of course Goggled the universe looking for ideas or solutions. Tried the stick on an Asus VS247 monitor (which is HDCP compatible) and it showed video fine. (Edited: VS247 was indeed HDCP)Update 12/1I figured the Fire Stick would be great because I could now get Prime Videos right on my TV. I might actually now watch Prime Videos!  This was to be great.  Instead, every few days I check my Fire Stick to see if I've gotten the promised update.  Still no joy.Update 12/12So far I've not seen evidence of the software upgrade the Amazon tech mentioned. I now see a lot more people reporting this error. For $19 I'll keep periodically trying by plugging and unplugging things. I haven't been able to convince my wife we need a new, bigger, TV and it should fix this error (that is not certain BTW). If this will convince her then it might have been worth the money if it ever works or not ;-).I might send it back but until then I am still hoping for an update that fixes the problem. Downgraded to one star.Update 1/11/2015I've been tweaking the Fire Stick and my Samsung TV for a month now.  I tried using a Gefen HDmi Detective Plus box to place between the TV and the Fire stick in hopes it would clean up the HDMI handshake: same problem, HDCP Unauthorized. I then reconfigured my HTPC (home built AMD A10-5800K CPU + MSI FM2-A75MA-E35 FM2 AMD A75 mobo) to use HDMI/HDCP and *oops* Windows 8 Media Center immediately rejected the Samsung TV as an HDCP device.  The fire stick and Media Center worked fine on the two different HDMI/HDCP monitors I have (Asus VS247 & Viewsonic VX2703).  My conclusion is that my 8 year old Samsung LN-S3241D TV, while prominently claiming to be HDCP, is not living up to the standard.  It did work for one day which was why I've persisted.  I've noticed that the message \"HDCP Unauthorized Content Disabled\" is consistent in other devices (e.g., Roku in Googling around for solutions) and tells me it was the TV that was refusing to go HDCP.  However, the Media Center also detected the substandard HDCP implementation and so I wonder why the Fire Stick couldn't do the same.  It could then still let us try and use it as clearly some TVs are intermittently HDCP compliant.Since it is not solely the Fire Stick's fault, I've upgrade my review to a 3 as the Fire Stick can still do a better job of telling us if the TV appears HDCP compliant (or give us an app we can run that will do it). I did buy it for the core purpose of getting Amazon Prime Videos onto our family TV so that is still a major disappointment as it initially appeared to work.Update 2/16/2015Based upon a hint in an HowToGeek article, I ordered an HDMI Splitter that ignores HDCP (model VHD-1X2MN3D, $23.95 from Amazon Market). I plugged the Fire Stick into the Splitter and plugged the HDMI output of the splitter into my TV.  Woo Hoo!  I can now play amazon prime videos on my HDCP-challenged Samsung TV.So, Fire Stick $19 plus said HDMI Splitter $23.95 plus one month of looking for solutions and I can now show, using the Fire Stick, Amazon prime movies on our family room TV. I just love being on the bleeding edge ;-). Can't wait to get my Amazon Echo.", "verified": true, "helpfulness": "190/218", "author": "Ecurb"}, {"rating": 5.0, "review": "Great little media player and couldn't beat the price! Will try games after i get game controller.Very pleased!", "verified": true, "helpfulness": "0/0", "author": "michael h."}, {"rating": 5.0, "review": "After some inital issues with it not updated, and not connecting to network---all is good with this! I bought two of these. They are simple to use. They automatically synced with my Kindle Fire HDX.", "verified": true, "helpfulness": "0/0", "author": "1234"}, {"rating": 5.0, "review": "Once the software updated I found the Fire TV Stick simple to use.  So far after 3 days I'm impressed with the amount of video available through my Amazon Prime subscription.", "verified": true, "helpfulness": "0/0", "author": "Dennis R. Mabon"}, {"rating": 5.0, "review": "From the price, to the quality and functionality, this streaming stick might be the best streamer for its price. I'm writing this as a previous owner of the Roku 1. When compared to the Roku 1, this device walks all over it. Its performance is absolutely amazing! It's super speedy and it has a great selection of content in its app store. I would easily say it's about 3-4 times faster than the Roku 1. The only downside to this product is that it doesn't have HBO Go in its app store, which is kind of a shame. But, for what you're paying, it's definitely worth it and I would recommend it to anyone who's thinking of buying a streaming device. Props to Amazon for a successful product launch, and keep it up!", "verified": true, "helpfulness": "1/1", "author": "Tuna"}]