[{"rating": 4.0, "review": "Unfortunately the first one delivered was faulty, and would not download.  I had done everything correctly, and followed the instructions to the letter, so I was more than a little upset when the first person I spoke to was rather condescending and had me go through the same steps again, and of course it didn't work, then she said lets try HDMI2 and I said lets not, I have already done that, she then put me on to a most helpful man, thank goodness, who tried everything to make it work including resetting to factory defaults.  I did not have a problem with him as he was polite and helpful, but in the end he had to send me a replacement, and label to send the faulty one back for free. The replacement downloaded without a problem and I have been watching Amazon Prime regularly. I prefer to sit and watch TV.  I would not recommend this to anyone who has Cable or Satellite TV,  but the TV I have it on, is not connected to either, and I can now watch movies on this TV as well as local channels, and go to the other TVs if I want Satellite.", "verified": true, "helpfulness": "0/1", "author": "Pat"}, {"rating": 5.0, "review": "Best Buy had a limited supply of Fire TV Sticks for $24.99, this weekend. I got one on Friday and plugged it in right when I got home. Just to clarify, you plug the stick into a HDMI port not a USB port. All you need is a TV with a HDMI port, WIFI, and an outlet within a few feet of the TV to charge the Stick.----- otherwise everything is included that you need. I got the Fire TV Stick mainly to watch Netflix. I loved how easy it was to setup and start browsing. I wish it would come with a year of PRIME not just a free month.", "verified": false, "helpfulness": "3/5", "author": "Estee"}, {"rating": 5.0, "review": "If you download the app for your smartphone you will enjoy this device a lot more. I had no trouble setting up but the included remote while serviceable has its limitations. The app so far has worked for voice command and gives you the ability to swipe around on the screen and control what's happening on the TV.", "verified": true, "helpfulness": "1/2", "author": "John Breitenbach"}, {"rating": 5.0, "review": "Let me preface my review by stating that I am a technological idiot with epically bad luck with anything requiring internet connectivity. Even with that background, I found the Fire TV stick incredibly easy to set up (plug it into the TV, plug it into the wall, you're done!), connect, and use. I have watched an embarrassing amount of programming since getting it, and have had absolutely no connection, streaming, or other problems. Long story short, I love it (and for $19, the special pre-order price, my expectations were low).Five stars all the way!P.S. to the people giving a bad review because the remote is hard to open: Press it with your thumb, boom, it's open. I have the relative strength of a fruit fly and thought it was a piece of cake.P.S. to the people giving a bad review because there's no way to fast forward through the instructional video: Relax, it's like 3 minutes long, and you only need to run it once. If you can't bear to sit through it, just get up and go brush your teeth or something. By the time you're done, the video is over (and you have minty fresh breath)!", "verified": true, "helpfulness": "250/277", "author": "Keldy23"}, {"rating": 5.0, "review": "So far so good. Bought my Fire Stick from Best Buy. Plugged it in and setup took about 10 minutes. Only drawback I have encountered is every time I connect to Watch ESPN I must verify my account via my phone or computer (annoying) but can live with it. Been worried after reading some of the reviews. I followed the simple instructions and haven't had any problems with the stick yet. Will update if I do. Where people have been having WiFi network issues I had just upgraded my router to a dual band router which might explain why I didn't have the same problems. I connected to the media higher speed network. Not sure if that makes a difference or not. I'm a prime member too and to me if you followed the instructions it seems to be working pretty good. Hope this helps not the greatest tech savvy guy but enough to get the job done.  Also make sure you have an outlet near by for powering the unit. I'm very Happy so far. Bought it because I'm a Prime member and for the Watch ESPN app so I could watch App State football on a 40 inch screen vs a 7 or 4 inch screen. Game today streamed no problems. If I encounter any issues I will keep you posted. 5 stars from me.", "verified": true, "helpfulness": "1/3", "author": "Lee Whitworth"}, {"rating": 5.0, "review": "Pros:+ A cheap an easy way to get Amazon Prime content, Netflix, Hulu Plus, and other internet content onto your TV.+ Very simple to set-up+ Comes with everything you need+ Affordable priced+ Intuitive to use+ Doesn't clutter your table, hangs right off the back of the TV+ Works very fast+ Has excellent sound and video quality+ Voice search through the Fire HDX works really well+ Integration with the Fire HDX is really good.Cons:- Is more than just a stick.  On our TV we had to use the included HDMI extender and the power cord.  Not nearly as neat and clean as they make it look in the product description.  This is true with the Chromecast too, but Chromecast you can power off your TV's USB plug.  This needs 1 amp of power, from its own plug.- Doesn't do anything more than Roku does (except the integration with the Fire)We recommend this stick.  We have it plugged into our bedroom TV along with an older TiVo HD.  It works much better than the TiVo HD at getting internet content from Amazon and Netflix.  In another room we have a Samsung smart TV with a new Tivo attached to it for cable television.  That Smart TV does the internet content just as well as this stick, but without the Kindle Fire HDX integration.  We also have a Roku (on another TV), and that is comparable to the Samsung Smart TV.  Both are as good as the Fire Stick in every area except integration with the Fire HDX.  We also have a Chromecast that sits in the same drawer, unused, since the day we got it.  Chromecast is great for doing MirrorCast with computers and tablets, but that is about it.Fire TV is about equal to a Samsung Smart TV or a Roku, and better than a Chromecast.  Tivo is obviously better at cable programing (which none of the others can do), but isn't as good at Netflix or Amazon Prime.", "verified": true, "helpfulness": "1/2", "author": "S. Power"}, {"rating": 4.0, "review": "Arrived today. It's fast, maybe faster than the Roku 3. Will be better when they get HBOGO and have a remote app for the iPad.", "verified": true, "helpfulness": "0/1", "author": "Ramdy"}, {"rating": 4.0, "review": "As a PLEX only user, I was surprised to find extreme stuttering when streaming to my TV.  I tried troubleshooting the app, changing settings, etc.  The stutter was still there.I later found that disabling the \"Auto Motion Plus\" on my Samsung TV fixed this issue.  For $20 you absolutely cannot go wrong.", "verified": true, "helpfulness": "1/2", "author": "Dylan Lemoine"}, {"rating": 3.0, "review": "The only reason I bought this was for Plex. It would have been better if they made it more clear that Plex is an additional $5 purchase and is not actually part of \"What's in the box\"", "verified": true, "helpfulness": "0/2", "author": "yhax"}, {"rating": 2.0, "review": "This device is useless to share your screen unless you own a fire phone or tablet. Do not be deceived by the description of this device that implies you can use this function from any Android device. As a streaming device I'm sure it is fine. I returned mine and ordered a Chromecast stick that works with regular Android devices. This is a blatant attempt to get you to buy another Fire device  where you are tied into Amazon's marketplace.", "verified": true, "helpfulness": "0/4", "author": "Amazon Customer"}]