[{"rating": 5.0, "review": "Love my fire TV stick.  Works great.  Doesn't have the voice search but since my son stole my Fire TV from the living room, I was happy to be able to replace it with the Fire TV stick and such a reasonable cost.", "verified": true, "helpfulness": "0/0", "author": "christine zurica"}, {"rating": 5.0, "review": "Fantastic! We have been using our Fire TV Stick so much since it arrived. Extremely easy to use and portable. Our favorite use for it is to hook it up to our projection screen and watch movies for free from Amazon Prime. It keeps track of movies we are watching if we need to stop for whatever reason. The kids love to listen to our music on it too because the lyrics appear on the screen and they have impromptu karaoke sing-alongs. So many other functions that we haven't even utilized yet. I highly recommended this device to relatives over the holidays!", "verified": true, "helpfulness": "1/1", "author": "Limes"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "Shelly Schrome"}, {"rating": 4.0, "review": "The Fire stick is fantastic for viewing anything you can imagine.  The apps are great (Netflix, Prime, Hulu, YouTube, etc.).  The connection is quick, haven't had any big lag issues where I've had a strong WiFi signal.The two issues I've had are somewhat minor, but I wanted to note them.  The remote, after only a month or so of use has become a bit \"glitchy\".  What I mean is, if I'm trying to type in a subject for YouTube or look up a movie on Prime, I'll click on each letter and it'll just keep scrolling through the letters and stop whenever it wants.  Or, I can click to select a letter, and it'll scroll a few letters away and select that one.  It can be VERY annoying.  I know I can use the android app, but you can't use the keyboard on YouTube thru the app.The other issue I've had is that, I normally keep the stick plugged into a surge protector, but if I unplug it while using the stick, it automatically cuts off.  It's like it doesn't have a the \"sense\" to know that it still has working power and doesn't need to be plugged in all the time.If it wasn't for those two issues I would give it 5 stars.  Great product, may end up getting another one later on.", "verified": true, "helpfulness": "1/1", "author": "Justin W."}, {"rating": 5.0, "review": "I am a lover of Chromecast because of the simplicity and the low cost, I have a bunch of them throughout the house.  I picked this Fire TV Stick up when it was on sale for $20, figured I had nothing to lose.  I must say, it is now the primary media player used on my living room TV.The remote is the main benefit over Chromecast.  Sometimes I would rather just browse on the TV screen than from my phone.  Another surprise is that I can \"Cast\" from my phone to the Fire TV Stick from Netflix and Pandora.Hopefully, the available apps will expand in the near future, there are a few that I use regularly that are not yet available.Overall, I like the product.  Even at full price, I think it is worth the extra $10 over Chromecast for the remote, at least for my living room TV.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 5.0, "review": "World great, easy to use, we love it!", "verified": true, "helpfulness": "1/1", "author": "cookie"}, {"rating": 5.0, "review": "Very easy to use - quite intuitive. Love being able to cast from my fire tablet to my HD TV. The installation/instruction video also gave a great overview of capabilities and I was able to start viewing videos within 5 minutes of installation. By the end of the day, I was watching videos from Amazon Prime, Netflix, and YouTube (ashens and markiplier.)Really, the only difficult part of this was figuring out how to get the batteries into the remote. I had to use a thin knife to gently pry open the sliding back where the batteries are placed. (Found that out by doing a search engine on \"fire remote how to install batteries.\") But that worked and I was able to easily get the batteries in after that.If you order this, just make sure you have a thin paring knife on hand that you can use to get the case off of the remote to install the batteries and you'll be set!", "verified": true, "helpfulness": "2/2", "author": "c10538"}, {"rating": 5.0, "review": "Honestly, when I purchased the FIRE TV Stick, I thought it really might not understand my voice & my husband's voice. Well, it does! Neither my husband nor I techie but we had the Fire TV Stick out of the box and installed in less than 10 minutes. It is so great to say an actor's name, or movie genre, etc., and have the list immediately appear on the screen. Absolutely great purchase. I would recommend it to anyone--young, old, or in between.", "verified": true, "helpfulness": "1/1", "author": "budgiebee"}, {"rating": 5.0, "review": "Enjoying greater access", "verified": true, "helpfulness": "1/1", "author": "Connie"}, {"rating": 5.0, "review": "Amazing! Much better than our Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Kristy Williamson"}]