[{"rating": 5.0, "review": "Price is awesome!  I gave two as thank you gifts.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far, so good. I got this free with the Sling promotion, and with my mildly low end internet speeds, the stick runs Sling far better than my desktop. People should definitely know to download the PBS application, as it has a ton of free content which has been my favorite part of the stick so far. It has hiccups, the menus seem as though they could be a little less clunky. While I probably wouldn't have bought this outright, I wouldn't be disappointed if I had.I'm sure other reviewers have noted, the stick actually needs to be plugged into an electrical outlet and it seems best to just leave it plugged in rather than charge it periodically. This was not something I realized just based on the product description, so if you're short on outlets, be aware!", "verified": true, "helpfulness": "0/0", "author": "autumn w."}, {"rating": 2.0, "review": "Easy to set up, discreet. Slow performance, kicks you out of your app during nearly every show to the home screen.", "verified": true, "helpfulness": "0/0", "author": "Lawrence"}, {"rating": 5.0, "review": "BEYOND EXPECTATIONS", "verified": true, "helpfulness": "0/0", "author": "ankarusskaya"}, {"rating": 5.0, "review": "Should have bought sooner.  Great purchase", "verified": false, "helpfulness": "0/0", "author": "D. Ciucki \"Dumbo131\""}, {"rating": 5.0, "review": "Perfect. A+++++", "verified": true, "helpfulness": "0/0", "author": "Michael B. Staley"}, {"rating": 5.0, "review": "I have an Raspberry Pi B+ and I think the Fire TV Stick is so much better", "verified": true, "helpfulness": "0/0", "author": "Joseph F. Edwards"}, {"rating": 1.0, "review": "Complete waste of time and money. Having bought it solely for the sling TV app. and the prospect of watching HBO, I'm sorry to say that sling just wouldn't work. After contacting sling, they couldn't even see my account because I'd signed up though amazon. After spending an hour on the phone with amazon tech. support, (rebooting and all the other typical stuff) they hung up on me and sent me an e-mail telling me to contact sling TV support.", "verified": true, "helpfulness": "0/0", "author": "David J. Richards \"mtn. man\""}, {"rating": 5.0, "review": "I LOVE THE AMAZON FIRE STICK! ESPECIALLY THAT IT ARRIVED WITH A REMOTE CONTROL!!!!! But purchasing shows & movies I find it a bit pricey. Other than that, love love love love it! My grandsons age 5 & 8 quickly learned to use it on there own. Keep up the great work Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "J. Luna"}]