[{"rating": 5.0, "review": "great product! Works well. I wish my smart tv had all of the feature fire stick does.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I use an Xbox, Apple TV and computer streaming. I thought the Fire Stick would be a good way to consolidate some of that streaming and be able to take it with me when I travel (which is frequent for work).  The Fire Stick has proven to be a simple, easy, fast way to stream. I couldn't be happier with it.It has a small form factor and the remote is small (er than the Roku), which I like.  Plugging it in and following the directions was incredible easy and took less than 4 minutes to log in, select settings and watch the tutorial.  It took a few minutes to put in my passwords for Hulu and Netflix etc. I used the iPhone app which made this process much easier, since I could type answers using the keyboard vs selecting single letters with the remote.Some people may not like that Amazon puts it's menu content front and center, but that seems a minor thing.  If you are a control freak and want to adjust every position of the menu, you may be disappointed. I found it cleanly laid out, intuitive and quick to navigate.Video quality is excellent. Shows start quickly (with Amazon content starting near instantaneous) and are clean, bright, crisp 1080p (depending on content of course).  The audio is equally excellent, streaming in 5.1 surround.Ease of use, speed, quality and function, this is an excellent product.  Why did I choose this over Roku? 1) I don't like the big, clunky outdated Roku remote. 2) Spec wise the Fire Stick has a more powerful processor, faster speed and more memory. While only a negligible difference now, as the 2 products update (and they do, my Fire Stick updated as soon as I plugged it in), the Roku will possible start to slow down. 3) I stream a lot of Amazon Prime and this is incredible fast/easy with the Fire Stick. 4) It came with an HDMI extender, Roku doesn't 5) I like the Amazon app better than Roku's. 6) I like then clean black form of the Fire Stick. Simple and it virtually disappears.[...]. Thanks for reading.", "verified": true, "helpfulness": "0/0", "author": "S Mack"}, {"rating": 5.0, "review": "Works great.  Turned out TV into a smart tv.  We love the Daily Burn, Sling, and Netflix apps.", "verified": true, "helpfulness": "0/0", "author": "Brittany Biaggio"}, {"rating": 5.0, "review": "Works great easy to set up", "verified": true, "helpfulness": "0/0", "author": "Ken W."}, {"rating": 5.0, "review": "I couldn't believe everything it can do. I think it is great and I also put the app on my phone.", "verified": true, "helpfulness": "0/0", "author": "Linda Norden-Urton"}, {"rating": 5.0, "review": "After reading great reviews about this product, I decided to purchase it myself. I am VERY happy with the Fire TV Stick and would recommend over the Chromecast. The remote is super helpful too!!", "verified": true, "helpfulness": "0/0", "author": "Dr. Holly"}, {"rating": 5.0, "review": "My second one.  I find it a little too Amazon centric, but I still prefer it over my Roku.  Menu's are fast and the remote works over wifi (point it anywhere).", "verified": true, "helpfulness": "0/0", "author": "Marc C. Dewalle \"mdewalle\""}, {"rating": 5.0, "review": "This item it is very helpful finding programs in the internet", "verified": true, "helpfulness": "0/0", "author": "Rafael"}, {"rating": 5.0, "review": "This little Stick is fabulous! Worth it's weight in gold. One of the best buys I've ever made.", "verified": true, "helpfulness": "0/0", "author": "Vamimi \"Mimi\""}, {"rating": 4.0, "review": "The physical device is amazing. We absolutely love the processor speed, RAM (memory) capacity, HD picture, and overall 'look-and-feel' of the device and remote, as well as features like the 'instant next' which loads the next episode while your still watching the current one.At first purchase, the software was... wonky. I would get occasional errors related to OS work which required restarts, and some apps would 'loose' login data, and needed to be closed (or forced to stop), which is complicated and not intuitive to find out how to do (it's in app settings).I really like the FireTV app for Droid/OSX that can completely replace the remote(!) and has added features like voice search, for no extra fee Or hardware.It would be better if it were more popular, and more networks would license their content to FireTV. It would be easier to use if every app was requires by Amazon to use the same keyboard layout (some are qwerty, some are abcde, some are, 5x6 squares, some are 1x26 in a line).I'm only withholding the 5th star due to the somewhat 'klunky' interface and desire for more content.", "verified": true, "helpfulness": "0/0", "author": "Joseph Clatterbuck"}]