[{"rating": 5.0, "review": "I love this fire stick", "verified": true, "helpfulness": "0/0", "author": "Mark Dennis"}, {"rating": 4.0, "review": "What great item. I love that I can watch an endless supply of movies, TV shoes and documentories. I also, added my flixster account and can now watch those movies. Thanks amazon for easy to use and timely product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Lanetia"}, {"rating": 5.0, "review": "This is the best thing since sliced bread.  It is so easy to setup and use.  Absolutely awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I had a small problem when I started, with Netfilx not being able to play. The first time I called the person, was not english, and thoguht it was a bigger problem then it was.I got an email that did not make any sense. How do you even find the old the Netfilx app, the red one, not the white one? Does not even make any sense?The second time I called, the day after I got it. I got in english person that helped me, to fix by just cleaning out the cache, and it was working again.Now a week later, I love it,", "verified": true, "helpfulness": "0/0", "author": "s.Shimkus"}, {"rating": 5.0, "review": "I picked this Amazon Fire Stick up at a really good price on Prime Day. I was shocked to see it arrived the next day, which happened to be my birthday too. We are enjoying the features of Hulu, Netflix, Prime movies and TV shows, along with games and other apps such as radio apps. I have an iPad Air 2, so I intend to take my Fire Stick with me when I travel too! It is great to watch movies on while at hospital or doctors office too! I look forward to many years of enjoyment out of my fire stick. I don't have a cell phone, but I added the fire stick app to my iPad Air 2 and can talk into mic to pick shows to watch by voice too. We just love this!", "verified": true, "helpfulness": "0/0", "author": "Terri Berg"}, {"rating": 5.0, "review": "Better than Dish!!! More with prime, plenty movies, I love the music! Very streamlined, and super fast!", "verified": true, "helpfulness": "0/0", "author": "Yvette Hall"}, {"rating": 5.0, "review": "Fantastic!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Loreda Ishmael"}, {"rating": 5.0, "review": "I just got my Fire TV stick in the mail today and already love it. It was so simple to set up and it has so much capability. The parental controls are great because it will mainly be used with my children. I love being about to stream all my Amazon prime shows and music. I can see all my pictures and videos from my Amazon cloud storage right on my tv for easy viewing. There is a great selection of apps such as Netflix, twitch and many games. Im really happy with this purchase and would highly recommend.", "verified": true, "helpfulness": "3/3", "author": "fireman9iner"}, {"rating": 5.0, "review": "Once my satellite cable special ended, I was paying double the amount- and I didn't have the Oprah channel! While seeking another special with a customer service representative via telephone, I was reading about the Fire TV Stick online to weigh my options. The satellite company did not present a new special; yet, I was paying for service wherein I had to watch what was offered during specific time slots. It doesn't take a genius to realize the advantages of Amazon's product, so without hesitation I cancelled my satellite service- and I am have a ball! Owning a portable device that allows me to watch what I want when AND where I want is a blessing! All I need is WiFi access, popcorn and water using the device. I plan to purchase one for my bedroom and a third one or my dad. THANK YOU, Amazon, for giving us the opportunity to finally stick it to cable and satellite companies!  :-)", "verified": true, "helpfulness": "0/0", "author": "Angela"}]