[{"rating": 5.0, "review": "Excellent!!", "verified": true, "helpfulness": "0/0", "author": "kevin hightower"}, {"rating": 5.0, "review": "I just bought this a couple days ago got it the next day with prime. We have issues with our internet and it has no problem streaming. Just like we were watching cable actually probably better. Love that having Prime we get a lot of movies and tv show to stream for free as well as music it means less money I have to pay it that is excellent for me.Installing: I got it connected to my TV in a matter of minutes started it up and the updating only took a couple minutes and it was good to go just like that.I would highly recommend this to anyone.There is one thing I would suggest. Either it is there and I just havent discovered it yet or its not capable of doing it. I would like to be able to search for shows rater than just browsing. Note I only got this a couple days ago still figuring out all the things it can do.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very good but i want the bundle when it comes back in stock", "verified": false, "helpfulness": "0/0", "author": "louay Jabbar"}, {"rating": 2.0, "review": "The device works well but the content available is too small and has little that i care to watch", "verified": true, "helpfulness": "0/0", "author": "Gwawrma Dawn"}, {"rating": 5.0, "review": "Great product - works just as advertised!", "verified": true, "helpfulness": "0/0", "author": "mphilb"}, {"rating": 4.0, "review": "Great purchase!  We love it!", "verified": true, "helpfulness": "0/0", "author": "artist739642"}, {"rating": 1.0, "review": "The video content did not meet my expectation. It stands not even close to what Netflix has. Amazon need to get more content online.", "verified": true, "helpfulness": "0/0", "author": "Puneet Agrawal"}, {"rating": 5.0, "review": "Simple, great product at the right price.  My only gripe is the motion picture library is not brilliant.  I'd be prepared to pay an annual premium on my Prime membership (Prime Plus?) to get access to more recent popular releases.", "verified": true, "helpfulness": "0/0", "author": "David P"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 5.0, "review": "Great product for mobile use.  I prefer the regular Fire TV for permanent installations such as home.  I prefer the Fire TV Stick when I'm traveling.", "verified": true, "helpfulness": "0/0", "author": "Bob"}]