[{"rating": 5.0, "review": "We have two of them and they work beautifully.  We watch Amazon,  Netflix as well as others.", "verified": true, "helpfulness": "0/0", "author": "Jeri Gannon"}, {"rating": 5.0, "review": "It was easy to install and easy to use", "verified": true, "helpfulness": "0/0", "author": "Jean L."}, {"rating": 5.0, "review": "I just love my Roku!", "verified": true, "helpfulness": "0/0", "author": "mo"}, {"rating": 3.0, "review": "Very user friendly unfortunately, when watching it pauses and buffers frequently, sometime so much so that I just give up and shut it off. Does this happen to anyone else?", "verified": true, "helpfulness": "0/0", "author": "Christine Ross"}, {"rating": 5.0, "review": "Well after i texted amazon they reply quickly and after that everything was easy to do i really liked the only think i dont like is that after i have finish watching a movie the others movies come out for rent they are not included in the prime account they are for rent if i want to watch more or that related titles.", "verified": true, "helpfulness": "0/0", "author": "luis gomez"}, {"rating": 5.0, "review": "A-1", "verified": true, "helpfulness": "0/0", "author": "Leroy Cain"}, {"rating": 4.0, "review": "Does everything wish it had a web browser .", "verified": true, "helpfulness": "0/0", "author": "Thomas Lind"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "vannessa"}, {"rating": 5.0, "review": "What a cool device and better than the chromecast. I like the remote and it is quick and easy to use. My 3 year old granddaughter uses it when my wife is baby sitting her and she maneuvers the Fire Stick with ease.Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Frank J. Shipkowski \"Healthy Bookman\""}, {"rating": 5.0, "review": "This thing is GREAT! Plug it in and it's running in a few seconds. Works perfectly and how do you get this much value for the next to nothing they charge? If you haven't bought one of these, do it today. And yes, we also have cable and all that, but now this is like having a second cable box in the house.", "verified": true, "helpfulness": "0/0", "author": "Paul"}]