[{"rating": 1.0, "review": "Find that available shows need to be purchased. Very limited selection of prime content.", "verified": true, "helpfulness": "0/2", "author": "Sandra"}, {"rating": 3.0, "review": "I have a Roku that I  can do more with than the Fire TV stick.  I would recommend looking and comparing the two before making a purchase.", "verified": true, "helpfulness": "0/0", "author": "Naomi J. Herr"}, {"rating": 5.0, "review": "I should have ordered a long time ago. I can watch the AMC channel without directv!  The only thing is you can't save it for later. You need to watch as the exact time or you miss It. But at least I save.", "verified": true, "helpfulness": "0/0", "author": "Karen Gordillo"}, {"rating": 3.0, "review": "not impressed..I have chrome and buffers all the time fire tv stick adds said buffering would be at a minimum ...well can't tell the difference.gave the chrome to my grand child. will give this to someone else..", "verified": true, "helpfulness": "0/0", "author": "william aiton"}, {"rating": 5.0, "review": "LOVE  LOVE LOVE IT!!  You will need a good wireless router.", "verified": true, "helpfulness": "1/1", "author": "LAURA D. KRUCZEK"}, {"rating": 5.0, "review": "The fire stick came in on time. The tutorial was automatic and useful.  Love love Amazon!", "verified": true, "helpfulness": "0/0", "author": "Cecilia Y Larsen"}, {"rating": 5.0, "review": "Great item no problems connecting to Internet.  Able to watch amazon or Netflix without any problems", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Totally dislike the stick,I wish I only paid 19 dollars like some of you,I have Direct TV and the stick is not giving my satellite to be a option and it freezes all the time,totally dissatisfied!", "verified": true, "helpfulness": "0/1", "author": "Laurie M. Furrer \"laurie f\""}, {"rating": 3.0, "review": "Thought that I would be able to get House of Card for this season (3).  Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Patricia Kirkpatrick"}, {"rating": 5.0, "review": "If you are a prime member and want to access online content quickly, this is the best option I have tried so far. When I think about why I like this over other options, I think it's how it reminds me of old TV that change channels instantly. No lag....", "verified": true, "helpfulness": "0/0", "author": "David M."}]