[{"rating": 5.0, "review": "a great piece of tech.", "verified": true, "helpfulness": "0/0", "author": "John C Manale"}, {"rating": 2.0, "review": "It worked great for about a week - then there was no sound.  I've checked everything on my receiver - all of the other devices work fine but not this.It was a gift and I can't return it.  Not a good enough experience to go and replace it on my own.", "verified": true, "helpfulness": "0/0", "author": "Raxcats"}, {"rating": 1.0, "review": "Ive been trying to register this thing all day and its not working. Not a fan of the fire stick, just a bunch of aggrevation.", "verified": false, "helpfulness": "0/0", "author": "irving"}, {"rating": 3.0, "review": "It works fine but does more buffering than other devices I have such as a smart TV or a Netgear", "verified": true, "helpfulness": "0/0", "author": "Cliente Kindle \"ElTonyo\""}, {"rating": 5.0, "review": "So far I have had no issues with it. It is so much easier to use than going through our DVD player to use Netflix and Prime.Even the kids can work it. They love the games. Guess I'll have to purchase a game control so they can play more of them.", "verified": true, "helpfulness": "1/1", "author": "Tres"}, {"rating": 4.0, "review": "Very easy to install; works great.  A couple of times I've had trouble streaming Hulu Plus, but more likely a problem at Hulu than with the Fire Stick; signal strength from my router is very good at the point of installation.", "verified": true, "helpfulness": "1/1", "author": "mathwiz"}, {"rating": 5.0, "review": "I absolutely love my new Fire Stick. So easy to set up and easy to use. I was able to get rid of my expensive satellite dish and still enjoy great tv", "verified": true, "helpfulness": "0/0", "author": "Cheryl Spalding"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Steve H"}, {"rating": 3.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "Melita Clark"}, {"rating": 5.0, "review": "I am very pleased with how easy the Firestick was to install and how easy it is to navigate.", "verified": true, "helpfulness": "0/0", "author": "Marci Lyon"}]