[{"rating": 5.0, "review": "I loved the fact that when I went to turn it on and set it up, it already had my Amazon information on it. It's super easy to use. It's a great buy for a great price", "verified": true, "helpfulness": "0/0", "author": "tiffany colestock"}, {"rating": 5.0, "review": "Very simple to use and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Vance Walberg"}, {"rating": 5.0, "review": "I am in love with this product!", "verified": true, "helpfulness": "0/0", "author": "Desiree Aurillo"}, {"rating": 5.0, "review": "Easy to use with prime. Haven't tried others as there is so much on Prime.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Awesome product. Quick to install and programs are easy to set up and view.", "verified": true, "helpfulness": "0/0", "author": "Russell Smith"}, {"rating": 3.0, "review": "Does not work with apple products as suggested on the package. I took a gamble on this over the chromecast because it had a remote ( I thought that would be a bonus over chromecast) However, I have since learned that it does not offer an app through your apple devices. It does work well... decent amount of apps (does not have crackle or disney movie digital copy). Occasionally freezes (not my internet because I have Netflix on my blue ray player and xbox 360 and they never freeze). I got it on sale for $25, so I can't complain... it makes a dumb tv smart for that little!", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 4.0, "review": "Great but you can't use it for YouTube. For watching a movie the remote is great. I hop they add YouTube.", "verified": true, "helpfulness": "0/0", "author": "arthur c porter"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Terri Sauvageau"}, {"rating": 5.0, "review": "This is a great deal. I already had Prime. Just take time to read about all you get with Fire TV Stick and Prime. Too much to list here. It works great with movies and tv shows and if you like you can download app for a tablet or phone to control the stick instead of using the remote that comes with it. Then you can use voice controls to find what you want.", "verified": true, "helpfulness": "0/0", "author": "Miguel"}]