[{"rating": 4.0, "review": "The Fire TV Stick is very easy to set up and use. With Prime membership there is a great deal of content available. I find myself using it for music and tv shows most of the time.I wish it had capability for bluetooth headphones though.", "verified": true, "helpfulness": "0/0", "author": "Joseph Knasinski"}, {"rating": 5.0, "review": "work terrific. Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "dawn"}, {"rating": 2.0, "review": "I have a google chromecast stick and I decided to buy Amazon Fire TV because of the remote control. The advertising is great, however it does not alert you for the region restrictions.Once I plugged the fire tv stick on my TV in Brazil I was surprised by the lack of apps. I knew that Prime content has region restrictions, but no excuses for applications. Any device today has the full set of apps regardless of your country, not even the simple youtube is available.The only useful app that was allowed to install is NetFlix, which does not make any difference since I have it on the samsung smartv where the stick is installed.If I had a chance I would return my order for sure, however it will cost more than the stick value for an international shipping.", "verified": true, "helpfulness": "1/1", "author": "Wagner"}, {"rating": 5.0, "review": "Love the Fire TV Stick. It is easy to install, easy to use, and the layout of the app is very easy to navigate. Works really well in conjunction with my Prime membership, I can even start watching something on my Kindle Fire and seamlessly transfer right to my television through the fire stick.", "verified": true, "helpfulness": "0/0", "author": "kmh518"}, {"rating": 4.0, "review": "This little stick is great. I love how easy it is to navigate with the remote on my phone. However I cannot connect to my local cable company Comcast so I cannot watch my premium channels or any TV channels.", "verified": true, "helpfulness": "0/0", "author": "Alyse Harris"}, {"rating": 5.0, "review": "EXCELLENT!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "avital Cohen"}, {"rating": 5.0, "review": "It's very handy.", "verified": true, "helpfulness": "0/0", "author": "LYDON FRANCIS"}, {"rating": 5.0, "review": "LOVE MY STICK . I take it everywhere I go, to the lake, on trips!", "verified": true, "helpfulness": "0/0", "author": "Lawrence W. Kaskuske"}, {"rating": 4.0, "review": "For home use this works great, simple to use and set up.  Do not buy this for college use or anywhere there is a two step authentication process - i.e., you have to log onto the internet.  The Fire Stick only allows for a password entry - not user name and password as Dorms and most hotels do.", "verified": true, "helpfulness": "0/0", "author": "VBS"}, {"rating": 4.0, "review": "The stick works fine but the selection sucks even with prime. Still gotta pay for most of the content", "verified": true, "helpfulness": "0/0", "author": "p1kA"}]