[{"rating": 3.0, "review": "Videos streamed better than chromecast but it was having a harder time with what I guess was a weak wifi signal (compared to both chromecast and the firetv box).  I was trying Sling on both and it would continuously freeze on the stick whereas the box had no issues. Had similar issues with Plex and Amazon Prime videos.Will likely use it for travel more so than at home use, much prefer the firetv box when portability is not an concern.", "verified": true, "helpfulness": "0/0", "author": "johny"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Kayla R."}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "jami burton"}, {"rating": 5.0, "review": "Put your Kindle Fire on your TV with ease. My only complaint is that it has less operational RAM than the Fire TV set-top box, meaning it can't play some games.", "verified": true, "helpfulness": "0/0", "author": "RBL \"RBL\""}, {"rating": 5.0, "review": "I have bought three of these for each room.  They work great watching hulu right now works better then the wii we was using.  Big plus it doesn't take up space. I would recommend this for everyone.", "verified": true, "helpfulness": "0/0", "author": "MH"}, {"rating": 4.0, "review": "I would give this product a 5. However, sometimes After it's been in for a bit the connection to the Internet gets messed up. There is no easy way to restart the fire stick. I have to unplug it from hdmi port and power and then ply it back in and restart the fire stick. If this wasn't an issue I would give this product a 5 star rating because for the price it delivers more than expected.", "verified": true, "helpfulness": "0/0", "author": "Jason Langowski"}, {"rating": 5.0, "review": "Bought as gift", "verified": true, "helpfulness": "0/0", "author": "Vince"}, {"rating": 5.0, "review": "Lots of fun old stuff to watch on TV with this firestick!  Most of the TV we had to watch before was insulting and gross.  Now we can find old series' and great old movies to watch!", "verified": true, "helpfulness": "0/0", "author": "Gregory J Gempler"}, {"rating": 3.0, "review": "The price is fair for the picture quality", "verified": true, "helpfulness": "0/0", "author": "Chauncey"}, {"rating": 5.0, "review": "Works as stated and very pleased with the service and selections", "verified": true, "helpfulness": "0/0", "author": "Joe Matsuki"}]