[{"rating": 2.0, "review": "I have both of the FireTV options.The FireTV (Box) is an item for lite gaming and TV viewing.The FireSTICK is not as good of an option, just as Amazon wanted.The FireTV Stick has some downfalls. After a few weeks of use (we have had a box for about a month), the stick has some downfalls. The remote absolutely SUCKS compared to the more expensive option. The remote feels absolute cheap compared to the more expensive option. The remote sometimes understands what you want, and sometimes not. It's fun - setting the remote down while you're in an App only to find that it backs up 20 minutes in your application then backs up to the main menu of the Amazon FireStick Application Menu - just from setting it down (multiple times here folks).Other times, it will not respond right way then ends up doing all your commands at once. This means you click \"fast forward\" three times over 5-8 seconds (you know - you click, then wait, then click again, etc) and you end up fast forwarding much more than you originally thought. The remote seems to respond when it wants, batteries being full or not.The FireTV (expensive version) remote feels MUCH better and doesn't seem to have these odd reactions to when you set the remote down in an odd way. That remote also fits better in your hand and seems to have better range than the cheaper version.I really do own both, and I even have the gaming remote. I still prefer the FireBox (ie: upgraded/expensive version) over the \"stick\"  option. The stick will probably be put into my guest room or such, since it's so cheap feeling.Edit: Some spelling fixed. I've swapped my primary TV and Master TV so that the FireTV (expensive option) is in the primary room we watch TV in. Things are much better. The FireStick is still used, but not nearly as much, and my frustration has gone down as such.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 3.0, "review": "I prefer the regular Fire TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Haven't to any great extent but when I do, it's easy review movies available", "verified": true, "helpfulness": "0/0", "author": "John E. Wright"}, {"rating": 5.0, "review": "Best interface to NETFLIX all the devices I have used, and I love AMAZON Prime Music, though I wish it was possible to add music through the Fire TV Stick.  Good purchase.", "verified": true, "helpfulness": "0/0", "author": "Ergo"}, {"rating": 5.0, "review": "Met all my expectations and more.Needs a bit more speed and a more user friendly UI for finding movies similar to the PC version of Prime Instant Video", "verified": true, "helpfulness": "0/0", "author": "Eric Balboa"}, {"rating": 1.0, "review": "So far it's a piece of junk....won't work (can't stream squat) and a replacement stick is even worst...Won't work on multiple sets including a relatively new Samsung SMART TV.  Still working with the technical group but it's been 2 weeks of multiple calls and re-boots, factory resets, calls to wireless provider, router changes, etc, etc., not working yet.....Getting \"LICENSE_ERROR\". Another technical  fix attempt tomorrow with an extended HDMI cable.  Extremely frustrating but I'm not giving up yet........", "verified": false, "helpfulness": "1/3", "author": "Bonnie M."}, {"rating": 5.0, "review": "Love it! Was afraid I wouldn't be able to enjoy this because I have really slow DSL internet but it works great!", "verified": true, "helpfulness": "0/0", "author": "peg"}, {"rating": 5.0, "review": "I got this for $19 and installed it on a basement TV that did not have a cable connection (used it to watch DVD's).  Installation was easy - thanks to the flexible HDMI connector that came with it (there was not enough room behind the TV for the stick if I had to insert it directly into the HDMI slot).  Start-up was very smooth - the directions were clear.  I have only used it to watch some Amazon Prime video but it worked great for that.Well worth $19 to get the extra connectivity to the TV.  At the $40 price, I would seriously look at the Chromecast and Roku competitors.  Some of the other reviewers have made very good arguments for those units.", "verified": true, "helpfulness": "0/0", "author": "Don65"}, {"rating": 5.0, "review": "excellent. Don't be fooled my imitations", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great add on to a tv just wish it had mirroring for iOS", "verified": true, "helpfulness": "0/0", "author": "DErry"}]