[{"rating": 5.0, "review": "This device delivers what is promised, and more. Its performance far outstrips the similar Chromecast device. Of course there are many differences. The Prime account connection makes a huge difference, with most content now available either on Amazon prime or Netflix which is also natively supported.A big plus for the Fire Stick is that it supports Miracast wireless linkage with smartphones and other devices that no longer have micro USB ports. Miracast works flawlessly, which was not true using two previous devices. This is the first good one. My only complaint is that Miracast must be enabled each time it is used, or at least that's the way it seems.", "verified": true, "helpfulness": "0/0", "author": "Spencer Day"}, {"rating": 3.0, "review": "Haven't used it often enough to fairly comment.", "verified": true, "helpfulness": "0/0", "author": "Cookie"}, {"rating": 5.0, "review": "fast delivery n works great", "verified": true, "helpfulness": "0/0", "author": "cindy"}, {"rating": 3.0, "review": "Works fine, especially the remote is easy to use. I've not found the program selection to be as good as itunes.", "verified": true, "helpfulness": "0/0", "author": "john guthrie"}, {"rating": 1.0, "review": "almost useless unless you pay 99. a year for prime", "verified": true, "helpfulness": "0/0", "author": "David Bogle"}, {"rating": 5.0, "review": "We got the Amazon Fire TV box as a Christmas gift and loved it, so we got the Fire TV stick for our bedroom TV.  It's so easy to use and so many great things to watch with Prime.  It came with everything we needed for installation.  We got rid of satellite TV and haven't missed it at all,  especially the big monthly bill.  Thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Teri L. Ast"}, {"rating": 4.0, "review": "After years of paying the cable companies hundreds of dollars a month we finally had enough. We purchased an antenna and the Amazon fire stick and never looked back! With Prime there are plenty of shows to watch. we couldn't he happier!", "verified": true, "helpfulness": "0/0", "author": "beardenmom3"}, {"rating": 5.0, "review": "I could not believe how easy it was to set up.", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 5.0, "review": "Amazing. Will probably drop satellite soon.", "verified": true, "helpfulness": "0/0", "author": "GB"}, {"rating": 5.0, "review": "Love it.  Easy installation works great", "verified": true, "helpfulness": "0/0", "author": "cludwig"}]