[{"rating": 2.0, "review": "Only good with prime", "verified": true, "helpfulness": "0/0", "author": "Daniela Riley"}, {"rating": 3.0, "review": "i wish you didn't have to sign in to an account for it to work.", "verified": true, "helpfulness": "0/0", "author": "luis a guirado jr"}, {"rating": 5.0, "review": "This was something new that I got as a Birthday gift and learning how it works and still learning. I think this will be great!", "verified": true, "helpfulness": "0/0", "author": "Tami L. Slape"}, {"rating": 5.0, "review": "Great device if you have Prime!  So easy to set up and easy to use to watch Prime movies!  We ordered two for different TV'sLove it!", "verified": true, "helpfulness": "0/0", "author": "German"}, {"rating": 5.0, "review": "the fact that I haven't had any troubles with fire TV stick is a great comfort to me", "verified": true, "helpfulness": "0/0", "author": "Judy Sunshine"}, {"rating": 5.0, "review": "Love the remote.", "verified": true, "helpfulness": "0/0", "author": "file1013"}, {"rating": 5.0, "review": "I enjoy my new fire stick!!", "verified": true, "helpfulness": "0/0", "author": "Evander Abraham"}, {"rating": 1.0, "review": "Constantly losing connection/connectivity.  I have one of the best wi-fi routers in market and all other equipment used wireless never had issues with connections....including my Roku.  Fire TV would run for a while than lose connection despite trying everything in the book.  Hope they resolve this issue. Had high hopes before receiving.", "verified": true, "helpfulness": "0/0", "author": "bluc2"}, {"rating": 4.0, "review": "It was easy to hook up and get started , but I have a couple issues.  The first one is the fact that when you turn on the parental controls, you must enter your pin EVERY time you watch something, even when it is included in Amazon Prime.  Second issue for me is I haven't figured out how to watch anything other than what is on Amazon.  Netflix etc... Show up on my home page but when you select it, it just describes the channel????  I am thinking of returning it, my Roku works fine.Update 6/09.I figured out how to watch Netflix... Just had to click on \"download\".  Now I am really liking this fire stick'", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well. Happy I chose this product.", "verified": true, "helpfulness": "0/0", "author": "Thomas Holzschuh"}]