[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tanya Ferguson"}, {"rating": 5.0, "review": "Fire stick is wonderful! This device met expectations and more!!!I can watch Justified over and over and over--and it kept grandkids entertained with Phinas and Ferb.Love it!", "verified": true, "helpfulness": "0/0", "author": "Rebecca C. Walker"}, {"rating": 5.0, "review": "Best of the best, does just what I needed to doI now get all the movies and shows I wanthip hip hooray for Amazon", "verified": true, "helpfulness": "0/0", "author": "Andycamps"}, {"rating": 5.0, "review": "An excellent addition to our video capabilities. I only wish we had purchased it sooner. Easy to install, easier to use.", "verified": true, "helpfulness": "0/0", "author": "Montana folks"}, {"rating": 4.0, "review": "I absolutely love my fire tv stick.  I can't rate it five stars only because I pay for amazon prime and my package arrived in three days , not two.", "verified": true, "helpfulness": "0/0", "author": "Stacy R."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "Really like this product. Picture quality is great and it's really easy to setup. It's even better if you have Amazon Prime to stream movies but you can still stream Netflix, Hulu, etc. I like it better than the Google Chromecast that we have on the other TV.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Martinez"}, {"rating": 1.0, "review": "After all the reviews that I had read of the Fire TV Stick, it was so disappointing. Perhaps it is me, but the reviews that I had read made this thing seem like it was going to be so easy to use. Just plug it in and you will have hundreds of viewing options. I plugged it in just as suggested, and two hours later, having watched nothing, I quietly turned my tv off. It was the hardest thing to navigate. Other than Amazon Prime videos, which were so confusing to navigate a week later, I haven't managed to watch anything with this thing. I have yet to find all of the other services that were offered. I did see something about Hulu, but could not manage to navigate to a place where I could find any listings of movies or programs to watch. Perhaps when I have had it for a few months and have managed to figure out one of the most confusing menu systems I have ever seen I may have better things to say about the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ycewogcg\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Daniel C."}, {"rating": 1.0, "review": "For some reason it doesn't work properly with sling tv.  Picture quality is poor & it freezes very often.  I don't know if has something to do with sling tv.", "verified": true, "helpfulness": "0/0", "author": "Izek Garcia"}]