[{"rating": 5.0, "review": "I pre-ordered the Fire TV Stick when it was being offered to Prime members at half price. Should have bought more as they were selling for over $100 on eBay just before Christmas. Anyways, the Fire Stick is pretty basic and very easy to use. Navigating through the GUI is also a breeze.The only hiccup I ran into was not being able to output sound through my HDTV's Toslink optical connector to my surround receiver. I could only get sound through the TV's speakers.The work around is that I connected the Fire Stick to one of the available HDMI ports on the back of the receiver instead of the TV and that worked out fine. Would like to know if anyone else has had that problem.To be honest the Fire TV Stick sat unopened for two weeks after it arrived until it became the hero on Christmas Eve. That's when Sony experienced the much publicized hack attack on the PlayStation Network which meant we could not log in to Netflix via our PS4. Then, a light bulb came on in the old cranium and it dawned on me that we had an alternate source to watch Netflix. (Duh!) So a big thanks to Amazon for the Fire TV Stick which is now our new primary source for streaming media content including Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Dano \"Daniel Contreras\""}, {"rating": 5.0, "review": "I love this easy way to watch Amazon tv hits, such as Transparent, and catch up on older series too.", "verified": true, "helpfulness": "0/0", "author": "Dr.Lynn"}, {"rating": 5.0, "review": "The \"stick\" was easy to hook up to tv and nice, simple remote. Have only used it a few times so far, but nice choice of movies and shows!", "verified": true, "helpfulness": "0/0", "author": "KC"}, {"rating": 4.0, "review": "good for the price", "verified": true, "helpfulness": "0/1", "author": "Cabes"}, {"rating": 1.0, "review": "it seems like it would be a very good thing but it will not stay connected to an Internet source I've tried everything restarted it twice and still wont work.", "verified": true, "helpfulness": "2/3", "author": "James Dunholter"}, {"rating": 2.0, "review": "Man, I want to like this thing, but its the best piece of tech that will soon soon be collecting dust with my stack of writable CDs.My issue is with connection. Granted, my router is in one room and may TV in another, but they are maybe 30' apart. The stick stays connected for brief spurts of time, and when it is connected, The picture is low quality. Meanwhile, my ipad can connect with prime at the same spot with better quality. Why bother with the stick at all?I've tried all the troubleshooting remedies, but it still sucks. If you have a TV right next to your router, knock yourself out. But if you have a tablet, stick with that.Thankfully, I got in on the $19 deal...", "verified": true, "helpfulness": "1/2", "author": "Lee Jones"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Art"}, {"rating": 5.0, "review": "We received our Fire TV Stick a week ago and have loved it from the start. It was SO easy to set up (most was already completed for us) and we watched that very night. This helps me use my Prime membership even more fully as it has synced my Amazon Prime Music also. You won't be disappointed!!!", "verified": true, "helpfulness": "0/0", "author": "Brette Hankin"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Makisha Tryon"}, {"rating": 5.0, "review": "Amazing. I use it so much my Daughter wondered if I still watch cable. Hmmm. Maybe it's time to cut the cable...", "verified": true, "helpfulness": "0/0", "author": "Thomas Agler \"Productive Polyspecialist\""}]