[{"rating": 1.0, "review": "No", "verified": true, "helpfulness": "0/0", "author": "MARY"}, {"rating": 5.0, "review": "Because I'm a prime member, the set up was extremely fast and easy.  I did have to purchase a repeater/extender for my WiFi the way my house is built but that was easy also.  I'm already binge watching programs on Netflix.  This is awesome - my only regret is I did not do this sooner!", "verified": true, "helpfulness": "0/0", "author": "D. M. Huhn \"Donia\""}, {"rating": 5.0, "review": "works better than my blue ray player and wifi tv they have to rebuffer all the time  but  I wish it had a headphone jack like my roku  so that my wife stops turning the sound down while I watch action movies", "verified": true, "helpfulness": "0/0", "author": "Henry T"}, {"rating": 5.0, "review": "Reliable, easy to use, and well thought out fu ctionality. I have not used the competitors devices but I have no idea how they could be simpler to use than this! Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "J. S. Alexander"}, {"rating": 5.0, "review": "Great brother .", "verified": true, "helpfulness": "0/0", "author": "Tatiana"}, {"rating": 5.0, "review": "Awesone.... Can't wait to get home at night just to see what else is in the que to watch.", "verified": true, "helpfulness": "0/0", "author": "Robert Grunden"}, {"rating": 1.0, "review": "I am in the process of sending back the Fire TV Stick.  It worked for about a half an hour then lost connection.  It keeps telling us it can't find our Wi Fi.  We have done everything to trouble shoot and nothing helps.  On the one hand it tells us we have a good signal on the other it says we don't.  Very Very disappointed.", "verified": true, "helpfulness": "1/1", "author": "Margaret M. Rowe"}, {"rating": 1.0, "review": "This thing sucks, netflix and hulu freezes with this fire stick.", "verified": true, "helpfulness": "1/1", "author": "viriel"}, {"rating": 3.0, "review": "I mainly got this for my travels.Works ok at home. The setup was easy but seems to require a stronger wifi signal than appletv or even Xbox. Had to reset the device all over again because it would not stay on the network, kept connecting then disconnecting.It's and android device so take that for what that's worth. I kind of expected a little more from it but overall for the price it's a good deal.* Update: After traveling with the item it appears that the WIFI hardware in this product is juts not very good. Unless the signal is SUPER string it just will not work. The AppleTv in the same locations works fine... just going to use AppleTv now for travels.", "verified": true, "helpfulness": "0/0", "author": "Daniel Presedo"}, {"rating": 5.0, "review": "Excellent so far", "verified": true, "helpfulness": "0/0", "author": "Ro of Bowie"}]