[{"rating": 5.0, "review": "WOW!  I received this as a Christmas present from my brother.  I did not think it would be so simple to gain access to lots of movies on my TV.  It simply was a matter of plugging in the \"Stick\", putting the batteries in the remote and turning the TV on.  The setup process was simple and I was watching a movie is no time.  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "BAS"}, {"rating": 5.0, "review": "Very nice. Turned a 2nd generation LCD into a Smart TV.  Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "J. Church"}, {"rating": 5.0, "review": "it works really good streaming HD videos fast I have no problem syncing my phone to it so I can use the keypad on that to type in and search what I look for small and compack so I can bring it other places too if I want to. Love it!", "verified": true, "helpfulness": "0/0", "author": "Berg"}, {"rating": 3.0, "review": "Disconnects from wireless router to often.", "verified": true, "helpfulness": "1/1", "author": "Nathan a Tirey"}, {"rating": 5.0, "review": "I like it there aren't as many free movies as I was told but I just got it so I just really need to see how a month goes.  thank you", "verified": true, "helpfulness": "0/0", "author": "karen s edwards"}, {"rating": 5.0, "review": "Had no idea I could watch so many free movies and shows and the picture quality is fabulous. HIGHLY RECOMMENDED!!!", "verified": true, "helpfulness": "0/0", "author": "Howard J. Zarring \"JZ\""}, {"rating": 4.0, "review": "IT CONTINUES TO LOOSE RECEPTION AND HAVE TO REINSTALL WI- FI CONNECTION", "verified": true, "helpfulness": "0/0", "author": "Thomas Wilhelm"}, {"rating": 5.0, "review": "WE LOVE IT AND ENJOYING NETFLIX", "verified": true, "helpfulness": "0/0", "author": "Gail LaVacca"}, {"rating": 5.0, "review": "We'd been accessing our prime account through a 3rd party system, it was really annoying.  This was reasonably priced, and lets us access all the videos and programming that have replaced our need for any cable or satellite tv.  There are plenty of things for the whole family, we love it.", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 4.0, "review": "Does as advertised. Print, of names of movies, could be larger.", "verified": true, "helpfulness": "0/0", "author": "anonymous"}]