[{"rating": 5.0, "review": "i love love love this thing!!! so easy to install, no more hooking my laptop up to the tv to watch netflix!", "verified": true, "helpfulness": "0/0", "author": "kimmy"}, {"rating": 5.0, "review": "Love FIRE TV!! Have the box in our bedroom and the stick in the living room. Amazing service, very intuitive and user friendly. Can't imagine life without it now!! Cancelled cable TV as a result!!", "verified": true, "helpfulness": "0/0", "author": "Todd Lavine"}, {"rating": 5.0, "review": "Great gift idea", "verified": true, "helpfulness": "0/0", "author": "Jt"}, {"rating": 5.0, "review": "We love the fire stick", "verified": true, "helpfulness": "0/0", "author": "cassie raymer"}, {"rating": 5.0, "review": "So far I love it.  The only downfall is that I am unable to stream from my apple device to it.", "verified": true, "helpfulness": "0/0", "author": "Jasmine Cuevas"}, {"rating": 3.0, "review": "We don't get high speed internet not available here so its a pain waiting to buffer", "verified": true, "helpfulness": "0/0", "author": "georgia dittemore"}, {"rating": 5.0, "review": "Love it. Great way to use my streaming plans. It was so simple to set up and I was enjoying it a few minutes later. My biggest gripe is the remote was so hard to open I think I almost lost a finger. I actually had to YouTube how to open it. Not going back to cable--yippee!! Get it you will love it.", "verified": true, "helpfulness": "0/0", "author": "A. Gill \"Tacoma Mom\""}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Steven W. Timm"}, {"rating": 5.0, "review": "I use it to straem Sling Tv and it is great. I love the portability of it. No issues", "verified": true, "helpfulness": "0/0", "author": "Nated14"}, {"rating": 5.0, "review": "This was very easy to use. I tried a Chrome Cast and returned it the next day. To hard to set up. Almost no energy to setting up Fire TV Stick.. I'm waiting for HBO GO to be part of the APPS. Tried get it but it apparently is not yet available for the Stick. ????? Even though it's advertised as coming soon. OH AND BUY THE WAY I'M GOING TO BUY ANOTHER SHORTLY", "verified": true, "helpfulness": "0/0", "author": "Jim"}]