[{"rating": 5.0, "review": "Love this! Wish I would have gotten it sooner!", "verified": true, "helpfulness": "1/1", "author": "Joyce Norris"}, {"rating": 5.0, "review": "I love love love the fire stick!", "verified": true, "helpfulness": "1/1", "author": "Elizabeth Duffus"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "stephanie hundley"}, {"rating": 4.0, "review": "Nice products, two complains: no hbo go and no amazon prime outside US", "verified": true, "helpfulness": "0/0", "author": "dario"}, {"rating": 4.0, "review": "At first it didn't connect, but i think it just had to download everything. Now it works great. Sometimes it lags, but i'm pretty sure that's our internet connection. I'll probably be buying another one if the price doesn't change.", "verified": true, "helpfulness": "0/0", "author": "Brett D Sullivan"}, {"rating": 5.0, "review": "Love this tech toy! Works great. Worth twice the price.", "verified": true, "helpfulness": "1/1", "author": "Teri from NY \"Wine Lover T\""}, {"rating": 5.0, "review": "The fire stick is working great for me .", "verified": true, "helpfulness": "0/0", "author": "Alice B Sims"}, {"rating": 5.0, "review": "Great product,  makes my no smart tv a smart tv...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What an easy to install piece of technology. I can't wait till Amazon starts streaming current shows!", "verified": true, "helpfulness": "0/0", "author": "Mary Ann Galvin"}, {"rating": 4.0, "review": "Overall this is a wonderful product that works as advertised straight from the box. Setup is easy. However, there are two big design flaws that require documenting.1. Terrible remote battery latch/slide.As a woman with a muscle disability, I couldn't pry the back of the remote off to get the batteries in - not even with a knife! In fact, I ended up having to wait 24 hours for someone to help me get it off with a tiny screwdriver. At first, I chalked this up to a personal problem but I googled and see that even physically healthy adults are reporting problems with this.2. Short power cable.The power cable from the stick to the outlet is only about two-three feet, which is troublesome on my wall mounted TV. If it was any higher I would have had to buy a replacement cord.Since setup, however, I have enjoyed watching a number of streaming services on the Fire Stick. It's still a wonderful product, it could just use some better physical design.", "verified": true, "helpfulness": "0/0", "author": "Tori Morris"}]