[{"rating": 1.0, "review": "Doesn't stream well. A lot of loading and freezing.", "verified": true, "helpfulness": "0/1", "author": "Brenton Powers"}, {"rating": 4.0, "review": "I was amazed at how easy it is to use.  I thought it had to be hooked into my computer or kindle to stream but when I set it up everything just came right onto the tv screen.  It really is a great item and I have been telling everyone that they should get one.", "verified": true, "helpfulness": "0/0", "author": "Raymond Richard"}, {"rating": 4.0, "review": "The only thing missing is voice search. Otherwise, it is the whole Amazon Fire experience in miniature.", "verified": true, "helpfulness": "0/0", "author": "Louise Richardson"}, {"rating": 5.0, "review": "Great product!  Love it, I was lucky to order it during the 2 day sale and it was worth waiting for. It is great,  works with my android phone as well as wits prime. I don't have Netflix but think I will soon.", "verified": true, "helpfulness": "0/0", "author": "Leah Cinman aka booklover \"Book Lover\""}, {"rating": 4.0, "review": "Works pretty well.The one app that doesn't work is flixster. I have 1,200 films in the account and I cannot get the app to work. It just keeps spinning, then times out for an error.I also would have liked more game controllers to be able to be used, but I suppose that is not Amazon's fault.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Hernandez \"Jon Birdman Attorney at DVD\""}, {"rating": 5.0, "review": "LOVE IT! I toyed with getting a Chromecast, but was put off by not being able to use Amazon Prime Instant Video (properly) on the device. I was also set out to replace my PS3 which I've been using to get media to my dumb tv across the house utilizing PS3 media server software on my home server.The Fire TV Stick first off is perfect if you are a Prime member. The seamless integration with the Prime services, Instant Video, Music, etc., makes this device the perfect media player. I had some issues with the PS3 Amazon Instant app when streaming movies and what not, and the FireTV one is flawless. I haven't had a hiccup yet and with the PS3 app i was lucky to get through an episode without some type of buffering action.The Fire TV Stick is also perfect as you can load a lot of different Apps to it as well. The big one for me was picking up the Plex app for free on the Fire Stick and on all my android devices during holidays sales. The Plex media server blows away the PS3 media server, and being able to use this on the Fire Stick makes all the difference.Overall, I am loving this device. I can watch ESPN on it, MLB.tv when the season rolls back around, plus the multitude of games, shows, music, that all perform flawlessly.Once they are back in stock I will be buying more and one will be on every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "DesertLew"}, {"rating": 5.0, "review": "Fantastic, so well worth the $39 for it! Picture is even better than on my computer!", "verified": true, "helpfulness": "0/0", "author": "Christy Hathaway"}, {"rating": 2.0, "review": "A LOT of problems with the fire stick. I have to reset continuously.", "verified": true, "helpfulness": "1/2", "author": "JD \"Book reading Mamma\""}, {"rating": 4.0, "review": "Exactly what I thought it would be", "verified": true, "helpfulness": "0/0", "author": "erin sebring"}, {"rating": 5.0, "review": "We got ours at the introductory price of $19.99.  It is really a great buy for that.  If you have Amazon Prime anyway then this is must have item.  Even at the regular price it is still competitive.  We are thinking of getting another one.", "verified": true, "helpfulness": "0/0", "author": "Michael"}]