[{"rating": 5.0, "review": "This is an amazing ROKU replacement.", "verified": true, "helpfulness": "0/0", "author": "Nicholas C. Dranias"}, {"rating": 4.0, "review": "Great product, easy to use, like the remote.", "verified": true, "helpfulness": "0/0", "author": "allen sims"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own an Apple TV, Chromecast, Roku(1st gen) and 2 Fire TV Sticks. I use the Fire TV Sticks the most. The picture is great. There is a wide variety of apps. Getting one free for a three month subscription to Sling TV was well worth the investment. We cut the cord and do not miss cable at all, between AmazonBasics Ultra-Thin Amplified Indoor HDTV Antenna - 50 Mile Range and the Fire TV Sticks, I am getting all the TV I need.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to connect and works great", "verified": true, "helpfulness": "0/0", "author": "satisfied customer"}, {"rating": 5.0, "review": "Have enjoyed this more than we thought we would.  Very slick packaging, easy to install, simple remote and great package of movies and TV shows on Prime.  Shows run smoothly over Wi-Fi to the TV.  Have also enjoyed several games.  If you already are a Prime member, I would highly recommend purchasing.", "verified": true, "helpfulness": "0/0", "author": "Paul Golden"}, {"rating": 5.0, "review": "awesome product for the price. everything i needed", "verified": true, "helpfulness": "0/0", "author": "morganne"}, {"rating": 3.0, "review": "it seems to take a long time to load movies,the movies cut in and out like its trying to reload.", "verified": true, "helpfulness": "0/0", "author": "john heinzerling"}, {"rating": 5.0, "review": "I have had to travel a lot, and this helps me  relax by seen my favorite shows", "verified": true, "helpfulness": "0/0", "author": "L. Cox"}, {"rating": 5.0, "review": "Works awesome! Wish everything I bought worked as it was intended like the fire stick does..", "verified": true, "helpfulness": "0/0", "author": "Brian"}]