[{"rating": 5.0, "review": "So easy to set up!  And great options for viewing movies, TV series, etc.  What I love the most are the shows/movies for Amazon Prime customers. Make the annual Prime fee well worth the money!!!", "verified": true, "helpfulness": "0/0", "author": "Jill Castille"}, {"rating": 5.0, "review": "Really amazing device!  Had to get Comcast to upgrade to a modem/router combo with dual bands. Then the \"stick worked perfectly.Despite the \"optional\" electrically fed booster, I needed it.John K", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "This is a terrific piece of technology.  I bought it primarily because it included the Slingbox app.  That enables me to watch cable TV when I'm out in the country at my cabin (yes, I have internet).  But the prime movies, the prime TV, the other apps and the remote control make it a very easy and convenient tool.  I can even mirror my phone or tablet on the TV using the Fire TV Stick.I would definitely buy this again.  I would definitely recommend it to anyone who has a TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy to use. Just love it!", "verified": true, "helpfulness": "0/0", "author": "C. Gowen \"Dr. G\""}, {"rating": 5.0, "review": "Met every expectation.  Easy to set up and simple to use.", "verified": true, "helpfulness": "0/0", "author": "D. D. Eplett \"mom2many\""}, {"rating": 3.0, "review": "I use my Fire TV Stick everyday. I like it - it's responsive. I also use a Roku Stick on the same TV almost everyday.  My Fire TV Stick loads from a cold start faster and loads screens faster than Roku Stick. Yet, I don't like the Fire interface as much as Roku interface. Fire is too busy, too cluttered. Press on a Fire selection (channel) and it jumps up, quadruples in size.  I prefer less in your face.For sure, I don't like the Fire remote as much as the Roku remote.  It's too small and flimsy.  I prefer a more solid, larger remote, with standard buttons.Fire TV Stick cannot stream my movies and TV shows from my 2 servers.  Admittedly, with Plex it can stream movies and TV shows stored on my home computer, but not from my servers, even the DLNA equipped server.  Roku can stream most saved movies residing on my DLNA server using its own Roku Media channel, no additional help needed.  Fire does not have a comparable channel selection, that I have found.If I didn't need the TV Stick for streaming from my home servers, I'd give it 4 or 5 stars because \"she is snappy.\"", "verified": true, "helpfulness": "0/0", "author": "Blueflippy \"blueflippy\""}, {"rating": 5.0, "review": "WISH I WOULD HAVE ORDERED THE LIMIT AT THAT PRICE!!", "verified": true, "helpfulness": "0/0", "author": "MONICA"}, {"rating": 5.0, "review": "Easy to install. Works as expected.", "verified": true, "helpfulness": "0/0", "author": "Mitzie Weiss"}, {"rating": 2.0, "review": "Doesn't work well and no instructions with remote on how to connect  the voice  Remote. No instruction on how to connect to your surround sound force to use you TV speakers. Poorly packaged ,Definitely not user friendly!", "verified": true, "helpfulness": "0/1", "author": "Matthew J. Ryan"}, {"rating": 4.0, "review": "I love my firestik need to buy one more", "verified": true, "helpfulness": "0/0", "author": "madmax"}]