[{"rating": 5.0, "review": "Fire TV Stick sure has a lot of options included with it.  I am still navigating around with it finding all the things it has to offer.  As the days go by, I might be able to give a more specific post, but as of now, I am pleased with it.  It was easy to set up and navigation is easy.  I did find that  my Wi-Fi goes in and out, especially on the day I set it up because of bad weather and I am located in the country .....I do not believe that is a problem  with the stick but my own connection.", "verified": true, "helpfulness": "0/0", "author": "Diane M. Morgan \"Avid Shopper\""}, {"rating": 1.0, "review": "Constantly freezes. Constantly buffering. Can't make it through one show. Pure frustration. Sending both sticks back. :( we have the Amazon Fire box and it works wonderful. Don't get it.", "verified": true, "helpfulness": "0/0", "author": "Andrea Roberts"}, {"rating": 5.0, "review": "Works great and easily hooked up to my wifi.  The only issue I had was when I tried to  putt the batteries in the remote.  What a pain.  I finally used a knife and was able to pop the cover off and put the batteries in.  Other than that all was good.", "verified": true, "helpfulness": "0/0", "author": "mjo"}, {"rating": 5.0, "review": "I really like this.  Super easy to setup and enjoy all the new programs.", "verified": true, "helpfulness": "0/0", "author": "adam"}, {"rating": 4.0, "review": "The reason for 4 (four) stars is the instant billing, if you're not clear for each contract per APP.  Hopefully most people are cautious!I like the ease of installation and the quality of this little device 5 (five) stars!!!I opted for the voice remote, it should be standard.", "verified": true, "helpfulness": "0/0", "author": "Brian Harris \"Kela\""}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Pedro Ferreira"}, {"rating": 5.0, "review": "great deal for the price. Since I have Prime I wanted to take full advantage of the service and this made it easy.", "verified": true, "helpfulness": "0/0", "author": "kacey"}, {"rating": 4.0, "review": "Works very well. Lacking in apps but what it has works without any problems. Would be nice if in the near future Vudu or another UltraViolet app would be made available so those of us with with movie collections in the Cloud could access them without having to have another device hooked up as well. Overall it is great. Does what it is supposed to do just needs a few tweaks to put it on the same level as Roku.", "verified": true, "helpfulness": "0/0", "author": "Forrest Gladden"}, {"rating": 5.0, "review": "It was easy to install, even for a non-techy like me", "verified": true, "helpfulness": "0/0", "author": "Karyn"}, {"rating": 1.0, "review": "Buffing is constantly interrupted. I continuously get a message stating no internet connection but when I go to set to settings it shows I'm connected. When buffing is not interrupted, it's great. The frustration is more often than the enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Rene` Reis"}]