[{"rating": 5.0, "review": "I use this product to watch movies - not a gamer or a user in need of the most powerful products. In an earlier review, I complained that the content repeatedly needed buffering, and I got a message on screen telling me my Wifi connection is too slow. I have since been able to make this work with no issues by ensuring I have all other wifi devices (computers, phone, etc) turned off. (The other choice obviously would be to order a more powerful connection from my broadband provider. Either way, the experience has been excellent.) I have watched a dozen or so movies in the comfort of my home using the Fire Stick. Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "fswan"}, {"rating": 5.0, "review": "I already own an Amazon Fire TV (love it!) and decided to get the Fire TV Stick for other rooms in the house. It was a breeze to install and just as easy to use as the Fire TV. I downloaded the remote control app which works very well with the system. I highly recommend the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Mama_Chula"}, {"rating": 5.0, "review": "Love love love it!!!! It does everything it says it will. Few lags here and there but nothing so detrimental as to downgrade a 5 star rating. Nicely done Amazon", "verified": true, "helpfulness": "0/0", "author": "Giles Anthony Bell"}, {"rating": 5.0, "review": "Love it and I got 2!", "verified": true, "helpfulness": "0/0", "author": "Nanalyn Nanalyn Nanalyn \"Analyn Dolopo\""}, {"rating": 5.0, "review": "Good Product! Very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Wisdom Seeker"}, {"rating": 5.0, "review": "Great source for TV movies and music", "verified": true, "helpfulness": "0/0", "author": "Candace hodge"}, {"rating": 3.0, "review": "Was a gift so I won't complain too much... Upset it does not have HBO go and the ridiculousness that is Prime Video takes over too much of the home screen... It serves its purpose of watching Netflix until I fall asleep", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 5.0, "review": "This is a FUN new toy.  I love my techie toys.  It really makes finding free Prime programming easy.  It's also a great way to find entire an season of a series.There are game apps available, too. I like being able to do the games and use internet sites on the large screen.  The stick is pretty much plug and play.  I used the short extension USB cable enclosed. Just be sure to follow the enclosed instructions.", "verified": true, "helpfulness": "0/0", "author": "S. J. Grider \"Audio Girl\""}, {"rating": 1.0, "review": "Highly disappointed, what had won me over the chromecast was its alleged ability to also mirror cast. This is a blatant lie as you come to find in the forums when searching why its not working.Hundreds of others duped like me. I just lost respect for Amazon, this was shady.", "verified": true, "helpfulness": "0/0", "author": "Richard Wainwright"}, {"rating": 5.0, "review": "I had a Roku 2 and bought this to replace it.....love the Fire TV Stick!!  It is so easy to set up and use...never any problems.Now I own three!!", "verified": true, "helpfulness": "0/0", "author": "deborah j jenkins"}]