[{"rating": 3.0, "review": "I wish I was able to mirror from my computer.", "verified": true, "helpfulness": "1/1", "author": "DAvid"}, {"rating": 2.0, "review": "Not sure what to think! Can't get it running yet as it just does not find my wireless. Not done yet but not a easy hook up!", "verified": true, "helpfulness": "1/2", "author": "kcrock"}, {"rating": 2.0, "review": "I have a very low speed internet connection and this will not allow me use a less than 720 resolution. Instant videos seemed to work just fine on the PS3 but not  with this.", "verified": true, "helpfulness": "1/3", "author": "Mark P. Stevens \"Utard\""}, {"rating": 5.0, "review": "Great  really like them lots", "verified": true, "helpfulness": "0/1", "author": "Frances"}, {"rating": 5.0, "review": "I have not yet fired up my new Fire TV Stick but it arrived before the expected due date, which changed a couple of times but I have it to use with my brand new 55\" and can't wait.  I gave 5 starts because I have confidence in Amazon that the product is fine.", "verified": true, "helpfulness": "0/1", "author": "Elle"}, {"rating": 5.0, "review": "I pre-ordered this for $15-20. Yes, I love this little device. Our main TV has apps built-in. The projection system in our basement has an HTPC already. So where do I use this? On my office TV, on a computer monitor... when we travel we bring it along. The size is just handy. Quick run-down:Pros:** Size / convenience.** Launch price of $15 / $20** Speed... the interface runs very fast for me.Cons:** Current price... you need a Prime Membership which means you are already shelling out $99/yr. Really, this should always be $20.** Like all apps / devices, it is still and issue finding what you want. The double-edged sword of having access to so much content!I have a Chromecast, and HTPC, a solid SmartTV, and a ROKU... I still like HTPCs better, but FireTV Stick is a complete no-brainer for Prime Members.", "verified": true, "helpfulness": "0/1", "author": "Doc1 \"doc\""}, {"rating": 4.0, "review": "For middle-aged non-techies like me who don't have a reference point like Chromecast or Roku to compare to (or even know what those are!), this little thing turns your dumb TV into a smart TV. It came more than a month earlier than expected, in a delightful tiny package. Set up took less than 5 minutes. I was a little surprised that it requires power from an electrical outlet - one thing to consider if you have a wall-mounted TV with all your cords tucked away. The remote is simple and intuitive to use and I was streaming both Netflix and Amazon Prime right away. Seems to be even faster streaming than my new Samsung Smart TV (I'm using the Fire TV Stick on an older Samsung) and certainly better than BluRay or Wii, which I had been using previously for streaming. Excellent HD picture. I'm considering ditching my cable service and going to all streaming now that I have a way to equip all of my TVs with amazing content. Highly recommended - just be aware of the power cable thing and plan accordingly.", "verified": true, "helpfulness": "0/0", "author": "Michelle Mader"}, {"rating": 3.0, "review": "It's a slick little device.  The interface is clean, but I found it hard to find apps that I was looking for.  Also, the lack of Vudu and PlayOn apps make this device pretty a second tier device for me.  I was hoping it would replace my older PS3 that has slow wifi, but the app support just isn't there yet to make it a viable alternative for me.", "verified": true, "helpfulness": "0/1", "author": "Bryan K. Gravely \"~~g\""}, {"rating": 4.0, "review": "Of the cheap streaming sticks out there I like this one the best. It brings \"smart\" features to cheap HDTVs that don't already have the functionality and is self-contained, not requiring a portable device to provide content for it (looking at you, Chromecast). The video selection is fantastic given that you have access to Prime (out of the box) and Netflix (with the Fire TV app). The game selection is good enough for a lazy post-dinner break in the evening.The controller is nicely built but feels cheap and plasticky, too lightweight in your hand. The round control \"wheel\" is a bit misleading as it is not a wheel but rather just four directional buttons - my internal ex-iPod user kept trying to turn the wheel to adjust volume, which sadly I could not. For what it's worth, though, the controller is very responsible and works when you want it to. The menus and interfaces on-screen compliment it nicely by being snappy and obedient.As for many of these these streaming sticks I really wish there was a way of adjusting volume directly from the stick without having to use a universal remote or my television remote. If someone can explain to me why this hasn't already been implemented please let me know, as it boggles my mind.For some reason, the Fire TV Stick is finicky when it comes to powering it. It would not accept the USB power draw from my HDTV itself, and rather needed to be plugged into a wall outlet separately. This is the biggest nuisance I have with the Fire TV Stick - you want to believe that it is just a little stick you plug into your TV's rear and forget about - but what ruins every portable is having to bring along a charger, and the same thing happens here. Obviously a minor complaint for a cheap device that works so well.Having experienced both Apple TV and Chromecast, I miss the ability to cast things to the Fire TV Stick. At the end of the day, this is less of a streaming stick for me than it is a \"Smart Hub\" equivalent for a cheap HDTV, and it does that job just fine. For the price, you can't really go that wrong.", "verified": true, "helpfulness": "0/1", "author": "$ecret@sianMan"}, {"rating": 4.0, "review": "For the price this is a catchy little device works very well and is very mobile.  Have a two year old and he loves it streams his favorite shows and he can even navigate the remote.  Only issue I have is with settings and setting up pin for purchases and prime video, but I'm sure if I play with settings I'll figure it out.", "verified": true, "helpfulness": "0/0", "author": "MosesV"}]