[{"rating": 5.0, "review": "awesome. Warning: you cannot use HBO go with this device if you have Comcast. They do not sponsor it through the fire stick. That is the only bad thing about it.", "verified": true, "helpfulness": "0/0", "author": "D C"}, {"rating": 5.0, "review": "We travel quite a bit for summer sports and this stick has been awesome.  We enjoy being able to see our favorite shows and movies by accessing prime or netflix. I think the price was fair for the flexibility we get with it.  LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "When it's working it's fine. But it constantly drops the wi-fi connection and buffers. PS4 and chromecast streamed fine on the same tv", "verified": true, "helpfulness": "1/1", "author": "Paul Kasparian"}, {"rating": 5.0, "review": "My magic stick!", "verified": true, "helpfulness": "0/0", "author": "Juds \"juds\""}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "S. Scanson"}, {"rating": 5.0, "review": "Thanks to PC Richards I got this working.  It works perfectly and I am now streaming Amazon Prime as well as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kat Pandora"}, {"rating": 5.0, "review": "Great devices .. I can buy it again", "verified": true, "helpfulness": "0/1", "author": "emmanuel  robles"}, {"rating": 3.0, "review": "I bought the box version of this when it first came out and we've had NO issues with it.  We love this option because we got rid of cable (best decision we ever made).  We got the Fire Stick for free when we signed up for Sling for a few months and we have a lot of issues with it.  I have to reset our Wi-Fi password at least once a week because it looses connection, and HULU constantly freezes up.  We don't have any of these issues with the box.  I would suggest going with the box and skipping the stick until they can work out some kinks.", "verified": true, "helpfulness": "1/1", "author": "Jody M. Taylor"}, {"rating": 5.0, "review": "I am not getting much done since I got my firestick!!! Love it!! Came the next day....couldn't ask for better service!!!", "verified": true, "helpfulness": "0/0", "author": "Kate Burke"}, {"rating": 5.0, "review": "LOVE It!!!!!", "verified": true, "helpfulness": "0/0", "author": "Pamkayks"}]