[{"rating": 3.0, "review": "I was torn between buying the Fire Stick or Roku. I bought the Fire Stick because I could get a free Roku Stick with my Sling TV subscription. I love Amazon products and their whole shebang but the Stick seems to be lacking. There should me more apps available than what they have. I know I have to mess around with it some more, but for 40 bucks I am not impressed.", "verified": true, "helpfulness": "0/1", "author": "Bryon"}, {"rating": 5.0, "review": "So easy to setup, the apps, games all seem pretty easy to use.  Its nice you can be on Amazon and also send apps to the device.", "verified": true, "helpfulness": "0/1", "author": "JoeSkate"}, {"rating": 5.0, "review": "Smartest media player purchase I've ever made.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I haven't been able to use the Stick fully yet because I bought it under the impression that it would work on a public WiFi network, aka a university connection.  Amazon doesn't provide enough documentation to accurately inform the buyer what type of networks it does and does not work on.  Bottom line, I am currently on a WPA2 - Enterprise network which is one which is public but requires a personal login and password and the Fire TV Stick is not compatable.  Although this is not the only reason I bought the device, its unfortunate and should be noted that sometimes you can't get the full benefit unless you are on your personal WiFi or on a truly public WiFi (no usernames required.)", "verified": true, "helpfulness": "0/1", "author": "Eric Sciorilli"}, {"rating": 5.0, "review": "I love my Amazon Fire TV Stick! This was my first experience streaming movies and TV shows (I know, I'm a little late to the game). It couldn't have been any easier or faster to set up and learn to use. Love it!", "verified": true, "helpfulness": "0/1", "author": "Krystle Owens"}, {"rating": 5.0, "review": "Works great.  Still getting the photos and video's into Cloud but think I am getting the hang of it.", "verified": true, "helpfulness": "0/0", "author": "PHILIP A MC GIBNEY"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "jose m garcia"}, {"rating": 5.0, "review": "Does exactly what it promises.  Probably will purchase one for each TV.", "verified": true, "helpfulness": "0/1", "author": "Patrick Duggan"}, {"rating": 4.0, "review": "Bought this for hotel rooms while traveling and our daughter's dorm.  Electrical plug is only a few feet long, so recommend bringing extension cord if you don't know where outlets will be. Useless for the dorm for this reason, since extension cords are prohibited.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great item", "verified": true, "helpfulness": "0/1", "author": "klaus"}]