[{"rating": 4.0, "review": "Received the device, took it out of the box, followed the simple instructions to get it connected and it works!It does everything I wanted and hoped it would do - except - I have Comcast cable and some of the networks don't accept Comcast feeds - so I don't have full access.  Note this is only for things like History and A&E; - all others work just fine.The reason for 4 stars?  I can't mirror from my Kindle HD.  You have to have the HDX model.", "verified": true, "helpfulness": "0/0", "author": "Rene A Martinez \"Rene\""}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Walter S Caylor"}, {"rating": 4.0, "review": "2015-05-16 update:Miracast no longer works with my laptop. I don' t know if a new update was pushed to the stick or what but it tries to connect, goes into la la land and stops.I have the same problem with my Fire TV too.Bummer - taking a star back.2015-04-22 editing reviewupgrading to 5 stars - Miracast seems to work perfectly now with recent upgrades pushed down from Amazon. Miracast is cool in that it doesn't require you to establish a local network - it somehow directly establishes a peer to peer wifi connection between my PC and the fire TV stick. Cool.I now also use AirBuddy app on this stick to act as an Apple iPad Airplay display. That works nice too but note that Apple Airplay requires both the Airplay receiver (the fire TV stick in this case) and the Airplay transmitter (my iPad, for example) to be on the same local network so if you use this for iPad display on business travel you must establish a network that does not block comms between ipad and fire stick. The same problem exists with Apple TV - it's an airplay issue. At least with the fire TV stick and remote you now have the ability to easily join a network.The travel features added (ability to log on hotel/public wifi) and ability to bring this for presentations make this a really nice, cheap, handy device for work or play.I'm really glad I got this and what a great deal.2015-01-30 editing review  >>>upgrading to 4 stars because I'm finding it more and more useful and because iPhone app provides voice search - for free!It should probably be 5 stars but I bought it for Miracast and that does not work.<<<Great for streaming of Amazon content - including Prime Music!I really bought this to use as wireless HDMI projection for presentations from a Windows 8 PC and it's claimed Miracast support fails miserably for that purpose.I'm keeping it because it's cheap and I'll try to find another use for it or give it to a family member or something because it's amazon content support is nice but I have a full Fire TV (which started supporting prime music a week ago too and therefore does everything this does just a little better [voice search, faster games, slightly faster menus, etc.]) so I don't really need the stick.", "verified": true, "helpfulness": "0/0", "author": "jtmoderate876"}, {"rating": 5.0, "review": "Would def buy again. Great quality. Fast HD.Details: Everything included even batteries. Set-up was simply only requiring one bit of information to get things rolling.Set-up: Very simple. You do need to have the password (or details) for you wifi. Enter that and you're about 95% there. You might need an extension cord because you'll need to plug in the little stick.Time: Six minutes to set-up and that it taking it out of the box to watching.Biggest Surprise: The HD was so clear and crisp I about did a jig.", "verified": true, "helpfulness": "0/0", "author": "J. Barton \"j Gregory\""}, {"rating": 5.0, "review": "Wish that I had purchased it sooner. Works great with no hassles", "verified": true, "helpfulness": "0/0", "author": "Barbara King"}, {"rating": 2.0, "review": "Cumbersome interface, lack of options, massively outdated apps.  I bought this primarily to watch Youtube videos so I set it up and installed the Youtube app.  The interface is terrible and it shows me exactly -3- videos to watch from my subscribed channels (I'm subbed to dozens and dozens of channels) and those videos are all a year old.  I dug around and determined this Youtube is ver. 1.0.7 on the Fire Stick.  By comparison, the version on my Galaxy S4 is 5.17.6.  Yes, the version can vary from device to device but there is no reason on any level for the version Amazon offers to be so old.  This is a clear dodge on their part to push their ecosystem and content.  \"Hey!  We offer Youtube!\" (we don't tell you its so old that it is beyond gimped.)Also, I own Plex through the Andoid store.  Can I get it on the Fire Stick?  Well... Yes, by turning on developer mode and side loading it.  Ok, I understand the difficulties in Amazon trying to work with Google's app store to smooth such issues out but why not let me access the app off the main menu.  To reach it you have to go through the settings menu and drill down several steps to get it via application manager.  It works but its far from an ideal situation, and Amazon can certainly do much better.The device is a little slow to boot up in my opinion, but I don't have much to compare it too so a minor point.  Also, the remote can be a little wonky in registering button presses.Bottom line:  If you are already tied into the Amazon app store and music/video content then the Fire Stick is probably going to appeal to you.  If you already have a foothold with Google's app store and ecosystem then I would advise looking at either a Chromecast or getting a dedicated set top box - the Roku 3 seems to be the clear choice atm.  Maybe if Amazon updates the firmware it might improve but as it sits I'm glad I only paid $19 for it.", "verified": true, "helpfulness": "1/1", "author": "Michael F. Duvall"}, {"rating": 3.0, "review": "It is a nice little gadget.  Nice sleek design.  It powers up like it should every time, and the remote control is super responsive, so that is a plus.There is a problem with Netflix and sometimes Hulu on the Fire TV stick.  When I try to watch Netflix, I always encounter an error, and every now and then, the same type of connection error with Hulu.  I know it is not my network, because my Roku works perfectly downstairs with both Netflix and Hulu.Maybe there is a firmware incompatibility? I am not really sure, but I find it rather disappointing so far.  It would be a 5 star rating if not for this error.", "verified": true, "helpfulness": "0/0", "author": "Kwik10z"}, {"rating": 4.0, "review": "I am very impressed with this device. I originally bought it because it was on sale, and didn't expect much. But after the quick setup I was delighted by the speed of the interface. I have a roku stick and expected something similar, but the fire stick is much quicker.My only issue is the amount of available apps. I'm sure this will increase, but for now its limited to the big names (Netflix, Hulu, etc.) and a few others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow! Connect the power supply, plug into my tv, load the batteries into the remote, and follow the simple online setup instructions. Amazon Prime on my tv! No more setting up my computer and plugging in an HDMI cable. Easy and convenient. And I love the screen saver.Thanks for the great product Amazon!", "verified": true, "helpfulness": "0/0", "author": "Pam Franchi"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "nazih"}]