[{"rating": 2.0, "review": "good value, remote is really CHEAP compared to ROKU, I own both ROKU 3 & FIRESTICK", "verified": true, "helpfulness": "0/1", "author": "John Perret"}, {"rating": 5.0, "review": "firestick is awesome.", "verified": true, "helpfulness": "0/1", "author": "Louis"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "EarthRain"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/1", "author": "Lt Rogers"}, {"rating": 1.0, "review": "Cannot synchronize with phone or tablet, whole reason i bought it", "verified": true, "helpfulness": "0/1", "author": "marlene zayas"}, {"rating": 3.0, "review": "Well it came...and I am Having no luck connecting and have had no time to call anyone for support......perhaps on a cold and snowy day there will be time!!!", "verified": true, "helpfulness": "0/1", "author": "jean lawrence"}, {"rating": 4.0, "review": "I would give it 5 stars if only I could get it to let me use the new Showtime streaming service on Hulu. We have cut the cord with the cable company and are happy streamers. I have really missed the Showtime series, though, and was beyond excited when Hulu started offering Showtime. However, because I get Hulu through Amazon (I guess because of the stick?) I can't get the Showtime stream. They say Amazon can't/won't bill it and no matter what I do, I am not able to get this service. Does anyone have any advice for me? I have Chromecast because I need it to get CBS All Access on my TV, but it needs another device to work and is more fragile than the much better Fire TV stick. I don't want to switch back! Please help!", "verified": true, "helpfulness": "1/2", "author": "Audrey H. Nelson-Sheil"}, {"rating": 3.0, "review": "Received yesterday, my son hooked it up while I was at work. It is super easy to navigate but I have some issues with the programming. I thought it would be better than having my Netflix membership but, I cancelled my Netflix membership when I purchased this. On this one I have to rent or purchase just about everything I used to watch on my Netflix membership. I am very limited to what I have to watch. I have a granddaughter who lives with me and she was upset because she can't watch a lot of the children's programming for free. I'm going to have to get my Netflix membership started back up again. The picture is great on my HDTV but I didn't know I was going to be so limited as to what I could watch for free. A lot of the movies you can't even watch you have to purchase not even the rent option. Older kids movies makes you rent or buy them. $5.99 to rent a movie, that's high for a family on a budget, the older movies should be included in the Prime membership. Just not what I was hoping for, very disappointed because I thought this would be better. Sorry Amazon but this is my honest opinion.", "verified": true, "helpfulness": "1/3", "author": "Valorie Hockman"}, {"rating": 5.0, "review": "Got this device on PrimeDay and it is the best investment that I had made so far this year.The dual core processor and the on board memory is best in class.Works seamlessly with the FireTv app on IOS and the remote works really well too.  They don't make RFremotes anymore except on higher end equipment which would have both RF and InfraRed.I highly recommend this for everyone.", "verified": true, "helpfulness": "1/2", "author": "Joe Vu"}, {"rating": 5.0, "review": "I have only been using this for a week or so but so far I love it. I also have the Google Chromecast, personally, I believe this product trumps the chromecast easily. The fact that I don't have to use a different device to stream to my TV for Netflix or HBO GO is awesome.Only downfall is that while streaming music from Amazon Prime Music it seems to be somewhat lagged. Which is probably my fault for not plugging the device directly to a power source (I am using the USB port on my TV to power the device). The directions do say that isn't recommended.Overall, great product and would definitely recommend it.", "verified": true, "helpfulness": "1/2", "author": "Robert Bateman"}]