[{"rating": 3.0, "review": "Had Roku for a number of years and use for streaming video from Netflix.  Bought the Firestick because it was cheaper.  Initial set up was more difficult than Roku as Firestick requires you to create an account and link a CC even when getting \"free\" apps. Once set up seems to work great.  My daughter loves the free games she can download.", "verified": true, "helpfulness": "0/0", "author": "Papichungo"}, {"rating": 5.0, "review": "Great bargain ... Easy installation ... Very pleased with purchase.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 1.0, "review": "This thing is a great disappointment !  I bought it so my husband who retired recently could have additional options to watch on TV this winter.Even though it says the WiFi signal is good this evening and I am on the computer so it does work, we couldn't get it to bring up the show he wanted to watch.  Kept getting a message to check your connection.  The last movie he watched kept buffing or whatever you call it and he final just turned it off.  Not sure if it is the Fire Stick or Amazon Prime; but, I have nothing good to say about this experience!  May try Netflix and see if it works any better!", "verified": true, "helpfulness": "1/1", "author": "Lynn Reener"}, {"rating": 5.0, "review": "User friendly.Need more time to watch", "verified": true, "helpfulness": "0/0", "author": "Brian Shannon"}, {"rating": 5.0, "review": "Best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Rachel Kelley"}, {"rating": 4.0, "review": "Works really well but could use a more friendly interface.  Not the easiest to navigate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast and easy works great!👍", "verified": true, "helpfulness": "0/0", "author": "Jamie sparks"}, {"rating": 5.0, "review": "I purchased the Fire TV stick as an alternative to a smart DVD player and the only complaint, and it's not really a complaint, is that my husband cannot access his HBOGo from it.", "verified": true, "helpfulness": "0/0", "author": "Hilary Anne Bird"}, {"rating": 1.0, "review": "Amazon lied it wont connect to my pc the only reason why i bought it .. I recommend the chrome cast", "verified": true, "helpfulness": "0/0", "author": "eman"}, {"rating": 3.0, "review": "Still trying to understand all I can do with it.  My time is limited to explore", "verified": true, "helpfulness": "0/1", "author": "M. Smith \"INdyserv\""}]