[{"rating": 5.0, "review": "works great just wish vuuduu was on it  and a couple of others I use ..", "verified": true, "helpfulness": "0/0", "author": "calvin w ninness \"Cal\""}, {"rating": 5.0, "review": "This connects easily to your TV and wireless, and works great.  I highly recommend this item!", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 4.0, "review": "so far I really really like it I just gotta figure out how to put a password on everything", "verified": true, "helpfulness": "0/0", "author": "val janas"}, {"rating": 4.0, "review": "Works very well and the clarity is as I expected.  Well done!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "Bought it, then Sold it on eBay. The content is far more limited that using my Roku devices. Quick and great hardware and user interface. With such limited content, it can't compare to Roku!", "verified": true, "helpfulness": "1/2", "author": "Primobase! \"Primobase!\""}, {"rating": 3.0, "review": "So far so good remote little difficult to navigate manipulate but it's it's okay every time I start with it it doesn't recognize the controller for some reason but in all the operations work", "verified": true, "helpfulness": "0/0", "author": "Sharm S. Stiltz"}, {"rating": 4.0, "review": "We received the Fire Stick a few weeks ago and I have delayed giving it a review to see if I could find anything negative to say, because I didn't want to be that guy who just runs on and on about how great this thing is.  Well, I think I am gonna be that guy.  I have played with this thing since we got it and I can find no fault in it so far.  I had it hooked up and running in less than five minutes and was watching a movie on Prime in about eight minutes.  We have also signed up for Netflix on it and, well, all I can say is the Fire Stick is AWESOME.  It picks up the signal form my wifi from the other side of the house with ease and the buffering is very fast.  I had thought about giving it five stars, but just couldn't bring myself to do it, in my opinion there is no such thing as a perfect device, however; I do have to say I have been unable to find anything wrong with the way it works, the choices, the quality of the device.  If I had to pick on something, it would be the remote is too small for me, I know people want smaller and smaller devices, but this just feels a little small for me.", "verified": true, "helpfulness": "0/0", "author": "MAC Harm"}, {"rating": 5.0, "review": "We now own 2, fantastic and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Gee J"}, {"rating": 3.0, "review": "It's ok like Netflix it's a pain to access the whole library and it seems like to rotation of movies and shows dosent change enough", "verified": true, "helpfulness": "1/1", "author": "Joseph Paccione"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Sohail Badruddin"}]