[{"rating": 5.0, "review": "I recommend you get this product.", "verified": true, "helpfulness": "0/0", "author": "Anna E. Maldonado"}, {"rating": 5.0, "review": "Any Amazon fan (and I sure am one!) who took advantage of the Fire TV Stick for about $19 a while ago is probably as impressed as I am with this device.  Even at its full price (and Amazon Prime) the entertainment available via the Fire Stick is endless.  One could spend days (maybe even years) watching all the variety of movies, TV programs, TV series, games, and downloading (and saving) photos from a smart phone for viewing on your smart TV is fantastic.  Soon an app will be available for the iPhone for remotely controlling the device but at the moment I'm happy with the one provided.  I can't imagine what adding the additional controls (for voice control or gaming) would do for the techie or gamer.  Oh, yes, we also have the Apple TV...which is great...but  can't compare to the Fire Stick.  And it costs so much more.  Thank you, Amazon.", "verified": true, "helpfulness": "0/0", "author": "PMRomano"}, {"rating": 5.0, "review": "Plugged this into a 19\" tv over a treadmill, perfect application for me, works great", "verified": true, "helpfulness": "0/0", "author": "M. D. W."}, {"rating": 1.0, "review": "First, I liked that I could plug this in to the back of my television out of sight. Except the fire stick won't work that close to the television, so Amazon included an extender, thus making it stick out from the television. Took 20 minutes to troubleshoot that. Then, it had trouble connecting to my internet and updating. I had to restart several times. The stick itself became too hot to touch. This took 40 minutes. The roku took 10 minutes to setup. Not impressed.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Thank you enough said", "verified": true, "helpfulness": "0/0", "author": "Brian Gallegos"}, {"rating": 3.0, "review": "So far so good. Getting used to the interface, looks nice but feels a little awkward to me. I do love how speedy this little thing is. I do with the power plug was a little smaller.One star off cause it took a while to get here.Update:Amazon content is fine but interface for the hbogo and showtimeanytime apps are both pretty sluggish. The streaming is fine once I select a show or movie but the interfaces are so sluggish and slow that is can be pretty frustrating. I have deleted cache and uninstalled and reinstalled the apps, and restarted the fire stick and there's been no improvement.", "verified": true, "helpfulness": "0/0", "author": "doodlebang"}, {"rating": 5.0, "review": "So far so good! Very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "J.E"}, {"rating": 1.0, "review": "The Kindle stick did not work.  I could see movie trailers but not the movies.  2 hours on the phone with customer service and tech support didn't help either.  They were supposed to call back two days later with a resolution.  A week later still waiting. ....", "verified": false, "helpfulness": "0/2", "author": "K Man"}, {"rating": 3.0, "review": "It was really hard to get the remote open to put the batteries in and it took awhile for it to connect to the Wi-fi. I had to do a lot of troubleshooting and unplug it, add the hdmi extender, reset my internet, etc. I contacts Amazon customer service and the reply I got had nothing to do with the fire stick, which was disappointing and I love Amazon and their products. I'll be keeping the fires stick, but I think Amazon has a lot of work to do in this product.", "verified": true, "helpfulness": "0/0", "author": "Cherith A. Chase \"C. Chase\""}, {"rating": 5.0, "review": "YES, you want this!!!!! With all the great offerings on Amazon and other streaming video, you don't need to pay cable bills and deal with the poor customer service offered by cable companies. I got so sick of cable companies not bringing specific equipment I requested, specifically a DVR that WORKED, that I stopped using cable and switched to streaming video several years ago. But once I bought a TV and tried to stream video on it, my \"high-speed\" Internet, which I was paying $90 a month for, caused very frequent pauses for buffering -- like 3 in half an hour! I ordered the Fire Stick as soon as it came out. It's FANTASTIC!!!!! It took less than 15 minutes to get it up and running. The video is sharper than it ever was; even my non-HD TV series look better than HD used to. No more problems with pauses for buffering -- not ONE in three weeks!!!! Amazon gives you access to lots of classic movies and TV you won't find on cable, and current series are generally available maybe one season behind. You never have to see another commercial, and with elections coming up, avoiding all those stupid political commercials is a real blessing. I was able to switch to a lower speed Internet service for half what I was paying and have better service with the Fire stick. It's one of the best purchases I've ever made. Now if Amazon could just get access to past seasons of all the soaps ABC canceled, I would be absolute heaven!!!!", "verified": true, "helpfulness": "0/0", "author": "Deborah M. Okey"}]