[{"rating": 5.0, "review": "Amazing! Wish I'd known flexible cable had been included with unit. Bought unneeded extension.", "verified": true, "helpfulness": "0/0", "author": "Allen H. Kelson"}, {"rating": 2.0, "review": "Very buggy, but on the rare occasions that it works, it's got a simple, intuitive interface. I have to reboot it (unplug it and plug it back in) frequently to get it to work, and some days it still doesn't want to work no matter what I do, and I end up going back to my Blu-ray player to stream, which always works well, even if it doesn't have as nice of an interface and has few options. I really, really wanted this stick to work, and I still want it to work, which is why I foolishly keep trying to get it to work. I thus spend a lot of time disappointed.", "verified": true, "helpfulness": "0/1", "author": "T. Spackman"}, {"rating": 3.0, "review": "gets very warm", "verified": true, "helpfulness": "0/0", "author": "David R. Kidwell \"davejeep\""}, {"rating": 5.0, "review": "Fast and efficient", "verified": true, "helpfulness": "0/0", "author": "Lindsay Sutton"}, {"rating": 5.0, "review": "So happy with this!  I purchased on special ($19).  Was pre-ordered and arrived early.  Easy to setup and use.  Absolutely love it.  Remote is much more intuitive than my Apple TV remote, which I loathe.", "verified": true, "helpfulness": "0/0", "author": "whatareyoulookinat"}, {"rating": 5.0, "review": "Like better than the Chromecast - in particular the Fire TV Stick accesses Amazon Prime Videos", "verified": true, "helpfulness": "0/0", "author": "Bev L"}, {"rating": 5.0, "review": "A super handy way to watch my extensive Amazon Watchlist on my tv instead of the computer/tablet.  Easy to use, and you don't need to make room for yet another box on your shelf.  I wish I would have noticed that you have to actually plug it into the wall as well as the tv as this was kind of annoying - but we got it all wired up and it works well.", "verified": true, "helpfulness": "0/0", "author": "Adam LeClair"}, {"rating": 3.0, "review": "I was greatly disappointed to the fact that the main reason i bought it was to Cast my samsung tab s screen to my tv with it and it is NOT compatible. It is ok and has good features but still disappointed.", "verified": true, "helpfulness": "0/0", "author": "F. Rubalcava \"EagleSoft\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rosalind Griffin"}, {"rating": 2.0, "review": "I like that it's small and I can plug it into my receiver.  It's great that it allows me access to my Amazon music lists, Amazon video,etc.  But it has some serious flaws.  Apple TV is way better so far.For starters, it's a little glitch.  Sometimes Amazon music just hangs and hangs and won't let me do anything.  Sometimes the video streaming also gets hung up.  And it is NOT my wifi network.  I have 3 networks in the house, and this one is running on a fast 5 ghz network, which is not competing with any other computers in the house, connected to a 50 gbps cable connection.When it does hang, there is no easy way to reboot it from a menu.  I have to unplug the power cord from the wall to do a reboot.The single most annoying thing though, is the parental controls.  With Apple TV, I can restrict content by rating, however if I want to watch something that's rated R, all I have to do is enter my code and it will play.  With the Fire TV stick (and I'm guessing with the regular Fire TV), if I have Amazon Video restricted (there's no option for restricting by content, it's either on or off) you have to back out into the settings and turn parental controls off, then go back into Amazon Video and find your video.  Why the hell can't I just enter the code to bypass the parental controls for that 1 video instead of having to turn parental controls off first?They seriously need to update the software.  Apple TV is way better at this point.  I have both, and really only got the Fire TV stick for Amazon Video and music, but at this point I'm better off just streaming from my ipad to the Apple TV over airplay.", "verified": true, "helpfulness": "0/0", "author": "M. Rogers \"Matt\""}]