[{"rating": 4.0, "review": "Good value for a Internet TV streaming device. I wish it had a web browser as most hotels require a sign in that is web page based so you could use this at a motel. Otherwise great for home use.", "verified": true, "helpfulness": "0/0", "author": "oldman"}, {"rating": 4.0, "review": "Works well.  Does everything the more expensive Fire TV does except the more intensive games.  If you're only interested in streaming media, you might as well save money and get this.  (Though, if you want to use the voice search, you need the add-on remote.)Down one star because they're still advertising the hotel support as \"Coming\".  Come on, Amazon, knock this out.  We need this for travel.", "verified": true, "helpfulness": "0/0", "author": "LazyBoy"}, {"rating": 1.0, "review": "Purchased two of these devices for family gifts, so disappointed. We could not use this device on any of our three TVs in the house because the dongle was too long to fit in the nested HDMI port area on the back of the TVs. One small consultation is that I know AMAZON will be great about the return.", "verified": true, "helpfulness": "0/0", "author": "Michelene Decrow"}, {"rating": 5.0, "review": "Like it and it work on any TVs at my home. I will recommend this item to any one that do not have any contract w/ any cable or cable provider.", "verified": true, "helpfulness": "0/0", "author": "Martin Ortiz-PAdilla"}, {"rating": 5.0, "review": "I love it! Easy to use, rewind and switch between items on which to play. Immediate recall.", "verified": true, "helpfulness": "0/0", "author": "Christy"}, {"rating": 1.0, "review": "Not Miracast certified.  Major buying decision based on this claim, but Miracast mirroring does not work with Windows 8 devices, e.g. my Dell Venue 8. Would give five stars otherwise.", "verified": true, "helpfulness": "0/0", "author": "Barbara H."}, {"rating": 5.0, "review": "Best streaming stick out there, very fast and powerful performance, tons of games and apps which makes it better than the other streaming sticks. Definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Nasser"}, {"rating": 1.0, "review": "I am starting to hate Amazon for their blatant lack at common sense. I purchased this as a gift, I was not aware it would mean that the person would have complete access to my account without my knowledge! You do NOT even want to know the headache I've had to endure. Had to cancel my credit cards. Amazon, you should make it CLEAR that the device will be registered YOUR account and the person receiving it will have complete access to everything in your account.", "verified": true, "helpfulness": "2/2", "author": "Naudia"}, {"rating": 4.0, "review": "My only complaint about this device is that the remote for it is very hard to open. But you can use your Fire Tablet as a remote so that is cool. Everything else about it is great, I've had no other troubles other than from opening the remote. The setup is very easy, it only took me a few minutes to setup. When I turned it on there was a short video explaining how to use the Fire Tv Stick. I would recommend this device to a friend. My only hope is that Amazon fixes the remote issue for future buyers.", "verified": true, "helpfulness": "0/0", "author": "Kathryn McGill"}, {"rating": 4.0, "review": "I like it .... but the problem is it needs electricity power to work good", "verified": true, "helpfulness": "0/0", "author": "IMAD AAD"}]