[{"rating": 1.0, "review": "Got my Firestick on Friday. On Sunday it goes back in the box and there it will probably remain until recycled.Terrible interface, hard to set up , remote works poorly (dup characters), and the app on a tablet is an aggravation.Whoever thought of using a QWERTY keyboard layout with the remote was not thinking.About ever fifth entry you had to go to back space to remove an extra character.Then if you were not VERY careful you lost it all trying to get to the password entry space.The tablet app was erratic. Selecting something was a hit or miss proposition. Not ready for prime time. or maybe just \"not ready\".", "verified": true, "helpfulness": "3/3", "author": "baomike"}, {"rating": 5.0, "review": "Amazon \"Amazingly\" great product... incredibly easy to install with great performance and quality.  It exceeded all my expectations... thanks for the thoroughness and customers' concern in this product design. Amazon hits another \"HOMERUN.\"", "verified": true, "helpfulness": "0/0", "author": "Rafael P."}, {"rating": 5.0, "review": "We love the fire stick. I would recommend it to anyone who has Amazon prime , my grandkids love that they can watch all of their shows on it now and I also love it because I can take it to a different room and watch tv . I will probably be getting another one in the future for my other room. This is definitely worth the money, so if your thinking about it buy it,we used to use the blue ray all the time to stream our shows, but I haven't used it since and I also don't have any interruption s with the fire stick. It's a great product.", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 5.0, "review": "The best Media Center , Better the Chromecast and Apple Tv  100% Recommended to All of you", "verified": true, "helpfulness": "0/0", "author": "Effrem Montanari \"Effrem M\""}, {"rating": 5.0, "review": "It can work as I expected. It can implement the function Google chromecast has. And it's convenient to watch instant video", "verified": true, "helpfulness": "0/0", "author": "DongZhou"}, {"rating": 5.0, "review": "I bought this when it was on sale for $19.  It's bar-none the best technology product I've ever purchased for $19.  I love how all our old photos and videos also appeared (those we already had stored in the Amazon cloud).  Pretty cool feature.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 2.0, "review": "Out of the box, installed, updated - every time it is used, it loses connection.I purchased it due to the great intro price, the fact I love Prime and the ability to watch Prime Videos without the PC/Laptop.However, I am unable to use it due to connection loss.Either that, or it states there is a slow internet connection.I have restarted the device, I have restarted the router (WRT54G2) despite successful connections with all over devices in my home, and have ensured the path is free and clear of anything (note: the router is less than 2 feet from the the TV), my download speeds are on par with my ISP and overall...well. I cannot use this stick.I have a feeling it will be finding it's way back to Amazon :(", "verified": true, "helpfulness": "0/0", "author": "Shelli S"}, {"rating": 1.0, "review": "You CAN NOT stream a browser tab to TV. You need a tablet or Windows 8 to mirror your desktop but for that you need to get into menus and select a menu item.If you have Windows 7, good luck with spending hours trying to figure out how to do it because it seems like the answer is no at this moment. You need to go thru menus in order to enable WIDI however after numerous trials, I was not able to get it connected to Fire Stick.I've added the picture for the screens below.  I am hoping that developers will turn this stick into something more \"useful\"", "verified": true, "helpfulness": "173/193", "author": "E.Riddle"}, {"rating": 5.0, "review": "easy upgrade to get Netflix, Amazon Prime movies on projector. love wireless remote, i think it is bluetooth.", "verified": true, "helpfulness": "0/0", "author": "lwin188"}, {"rating": 1.0, "review": "Owned multiple Chromecasts wanted to try something different.After plugging it in via TV USB port, informed me it was recommended to use the wall charger. Even with a 1amp micro USB cable.Plugged it in via wall charger, input Wi-Fi password, instant crash. Tried three more attempts, finally got it to connect, update. Crashed again.After moving it to a different TV literally two inches of my router it still had connection issues.Chromecast > Fire by a long mile.", "verified": true, "helpfulness": "1/1", "author": "Daniel Nghia-Ngo \"SmartedPanda\""}]