[{"rating": 5.0, "review": "Easiest thing I've ever \"installed\", and now I have access to a full library of shows, movies, music and games!  I probably need to buy another because the game access has caused the TV to be taken over by my grandsons!", "verified": true, "helpfulness": "0/0", "author": "Debbi Wynn"}, {"rating": 4.0, "review": "Very nice, really quick and easy to use streaming media stick,it relies heavily on amazon services, which are not required, but does make a great Netflix player, and it does work with some Bluetooth controllers for gameplay. Very much worth the money.", "verified": true, "helpfulness": "0/0", "author": "Taylor Lansaw"}, {"rating": 4.0, "review": "This is premature, as I've only had the device for a few days, but it was very easy to set up and has worked flawlessly without buffering or stalls off any kind. HOWEVER, I DID NOT MANAGE to make the connection with my HDX work in the time I've spent on the project so far, which has been limited, so I expect I'll stop back by when I've been able to watch what's on my HDX on the big screen; watch this space. I do believe the images cast up by the Fire Stick are superior to either the Roku (2 nd generation) or the Apple TV.I will say I've been quite exasperated with our Apple TV. I .can't seem to keep my iOS app talking to the TV.", "verified": true, "helpfulness": "0/0", "author": "Woesong"}, {"rating": 1.0, "review": "It produced chopped interrupted viewing.", "verified": true, "helpfulness": "0/0", "author": "A. Boniface"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "W"}, {"rating": 5.0, "review": "All good...", "verified": true, "helpfulness": "0/0", "author": "BOT addict"}, {"rating": 5.0, "review": "This is a great addition to the benefits of Prime membership", "verified": true, "helpfulness": "0/0", "author": "LTI"}, {"rating": 5.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "William Magner"}, {"rating": 5.0, "review": "This is an amazing item!  I plugged it in and with no installation issues whatsoever was watching classic movies and favorite tv series like Firefly.  How can one argue with the one time price of $39 for no commercial viewing?  I am thrilled with the performance of the Firestick.", "verified": true, "helpfulness": "0/0", "author": "L. James"}, {"rating": 5.0, "review": "LOVE, LOVE this product...", "verified": true, "helpfulness": "0/0", "author": "sue"}]