[{"rating": 5.0, "review": "I am so happy I bought this. It works perfectly, exactly as advertised. I do not have an HD tv, but there is an HDMI port. I used to plug the HDMI cable from my laptop to the tv, and have to use the mouse to navigate. Slow and not user friendly. This firestick is fast and all shows are easy to find, the remote is so nice to have. I do not subscribe to any tv cable service, so this is perfect for Netlix, Hulu, Amazon Prime etc subscribers who just want to watch random shows and movies.", "verified": true, "helpfulness": "0/0", "author": "laissez-faire"}, {"rating": 5.0, "review": "Better than the chromcast I like it", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 4.0, "review": "Great Item....Perfect for Hotel on Vacation.....", "verified": true, "helpfulness": "0/0", "author": "S.G."}, {"rating": 5.0, "review": "Way better than chromecast, cheaper, too.", "verified": true, "helpfulness": "0/0", "author": "Victor Mancini \"Vic\""}, {"rating": 4.0, "review": "I like it.  it was easy to install too.", "verified": true, "helpfulness": "0/0", "author": "Nancy E. Hamburger"}, {"rating": 5.0, "review": "LOVE OUR FIRE TV STICK!", "verified": true, "helpfulness": "0/0", "author": "Brandon L."}, {"rating": 5.0, "review": "At first I got a roku, then I got an Amazon Fire Stick.I love the firestick and would recommend over roku ONLY because Sling plays better on the FireStick", "verified": true, "helpfulness": "0/0", "author": "Halejn"}, {"rating": 5.0, "review": "Love it!! You guys have really done your homework. The app (in itself a great idea) is very quick and more responsive than I had imagined. The simplicity of the entire experience is impressive from plugging it in to downloading your first movie takes less than a minute. Recommending it to everyone who asks.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 5.0, "review": "Amazingly easy to use for this technophobe, and at such a low price.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The fire stick works great as far as programs and movies, but the internet connection isn't too stable. My TV is in the same room as the router and should keep a steady connection but it loses touch with the stick. Maybe wih that being improved it will be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Bryant D. \"Put in 100% always.\""}]