[{"rating": 2.0, "review": "It is slow and was very hard to set up and connected with the wireless. I tried for almost 4 hours before I could make it work. It doesn't have many options like the Amazon TV but still works for my second TV. If you want something more reliable and have the money, purchase the Amazon TV, for a second TV or room TV this stick could work.", "verified": true, "helpfulness": "0/0", "author": "America"}, {"rating": 3.0, "review": "I've really enjoyed using this device....I've only been able to use it a few times so far, but it works. and the Wifi is great.What's odd is that the included docs don't really say what WiFi it supports...just says dual band or something....but it works great with my 802.11G network so that's ok.Also noticed sometimes when using the Netflix app that it will suddenly stop responding to remote control clicks...just sits there..and you think it locked up...but if you wait a while it suddenly catches up.So I think the software still has a few bugs...I'm hoping they update it soon, and I have every confidence that they will.Being so incredibly new, its expected to see some hiccups at first.", "verified": true, "helpfulness": "0/0", "author": "Fremen \"O\""}, {"rating": 5.0, "review": "This little device met all my expectations, remote control has limited functions but does need any additional ones. Great product, already recommended to family & friends. Thank you!", "verified": true, "helpfulness": "0/0", "author": "RSB"}, {"rating": 5.0, "review": "It even improves the picture on my TV.  The choice of programs is excellent and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "J. Wiley"}, {"rating": 5.0, "review": "This is an amazing product, most user friendly system I've purchased.  Ensure that you download the app to your phone, makes it even better.  Everything works better than expected.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 1.0, "review": "Could not watch anything without it buffering every 20-30 minutes.  Currently have Apple TV and Chromecast, neither of those seem to buffer at all. Returned item.", "verified": true, "helpfulness": "1/1", "author": "Chrissy Wilson"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Isaac Klughaupt"}, {"rating": 1.0, "review": "Many functions still do not operate. No advantage over current software display. I do not use my cellphone however.", "verified": true, "helpfulness": "1/1", "author": "snowgirl"}, {"rating": 5.0, "review": "Fantastic!!!  It was sooo easy to use.  I am technically savvy enough to be very dangerous and the entire setup including logging into Amazon account.  The most complicated action is that you now have three remotes to use (if you have cable or direct tv), and you have to use the tv's remote to go to HDML 1 to HDML 2 , then hit the center of the firestorm.  Follow directions.  So easy.  Then when you use it you just go back and forth between  the HDML's.  Lots of free shows.  You do have to pay for quite a few.  Also you can easily use it to go to Netflicks and other streaming videos services.  I just love it.", "verified": true, "helpfulness": "0/0", "author": "Elmo san diego \"ElmoSanDiego\""}, {"rating": 5.0, "review": "I LOVE this!! Excellent for streaming Netflix and Prime... it is exactly what I needed :)", "verified": true, "helpfulness": "0/0", "author": "Michael"}]