[{"rating": 5.0, "review": "Amazing and very fast. It is a great choice if you want to make smart your TV.You can add aplications, thats very important for me.", "verified": true, "helpfulness": "0/0", "author": "Gerasense"}, {"rating": 5.0, "review": "I'm an average tech-level person on a good day! But, I had this up and running in less than 5 mins. Streams way better than the Roku. I ordered another for the guesteoom TV.", "verified": true, "helpfulness": "0/0", "author": "MJ Gillis \"Brown-eyed Girl\""}, {"rating": 3.0, "review": "Works fairly well, but it constantly refreshes itself, do not like that it does that.", "verified": true, "helpfulness": "1/1", "author": "T. Couture \"terrible terry\""}, {"rating": 3.0, "review": "I gave it a three star. I only had it for 2 weeks and so far it's ok. Will review again after 6 months.", "verified": true, "helpfulness": "0/0", "author": "sandra kamushadze"}, {"rating": 4.0, "review": "Good need more apps", "verified": true, "helpfulness": "0/0", "author": "Luis Encalada"}, {"rating": 5.0, "review": "Portable and versatile! I simply love it!", "verified": true, "helpfulness": "0/0", "author": "cK"}, {"rating": 5.0, "review": "We love the Fire TV Stick! We got rid of our TV provider and came across the Fire Stick. It is easy to use, easy to move from one TV to the next and is saving us so much money!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own a so called 'smart tv\" but when I try to use it for Netflix, Hulu etc, it has issues.  I was not going to buy a new TV, so a friend of mine gave me a Google Chrome \"chromecast\" as a surprise for Christmas.  I subscribe to Amazon Prime and cannot connect with it via  Chromecast.  Wish he would have know that (didn't ask).  So I purchased a Fire TV Stick.  Another reason I got the TV stick is that I travel and like to watch movies that may not be on the hotel or resorts' TVs.  I recently took it with us on a 2 week trip to Hawaii.  One week we rented a private house, which had WIFI and it worked perfectly.  I was able to connect with Amazon Prime and Netflix with absolutely no problem.  Setup was simple.  We then stayed at a time share and again, no problem and easy setup.  Now when I am at home I use it all the time.  I can even take it from a tv in one room and use it on a tv in another room.  I don't even use the Chromecast anymore.I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Mike Z"}, {"rating": 4.0, "review": "Easy to use out of box. Biggest issue is the sound on some things. Must have volume up to max to hear some of the programs", "verified": true, "helpfulness": "0/0", "author": "Jeffrey S McClelland"}, {"rating": 5.0, "review": "I absolutely love it, buying one for my mother also. thank you", "verified": true, "helpfulness": "0/0", "author": "Vanessa J. Jimenez"}]