[{"rating": 5.0, "review": "Great! I love it.", "verified": true, "helpfulness": "0/0", "author": "Vincent Ho"}, {"rating": 5.0, "review": "I love it!  Works great!", "verified": true, "helpfulness": "0/0", "author": "Tiosecoleo"}, {"rating": 5.0, "review": "So far so good.  But it does take a lot of bandwidth, so be prepared.  I am hoping the more I watch, the more things there are I want to watch.  But I am enjoying it a lot.", "verified": true, "helpfulness": "0/0", "author": "MaryB"}, {"rating": 3.0, "review": "It's ok but not what I expected,you have to pay to watch alot of shows that are free on cable good variety of old stuff if you're into that", "verified": true, "helpfulness": "0/0", "author": "Robert Patrick braud"}, {"rating": 4.0, "review": "I would like to be able to watch movies with my prime account but since i live in Bermuda I cann't.", "verified": true, "helpfulness": "0/0", "author": "George K. Stewart"}, {"rating": 4.0, "review": "Random buzzing in the TV speakers.  Not horrible but happens maybe 3 or 4 times in 10 minutes.  Otherwise a really solid experience.  Much better for video so far than Chromecast on the same TV/router combo.", "verified": true, "helpfulness": "0/0", "author": "kfractal \"kfractal\""}, {"rating": 5.0, "review": "we are very pleased. thankyou very much", "verified": true, "helpfulness": "0/0", "author": "mark cousineau"}, {"rating": 5.0, "review": "Very Very Happy with the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Kevin J Leal"}, {"rating": 1.0, "review": "Really disappointed. Can't ever get Netflix app to load or play, ever. Also I bought the fire stuck vs the chrome stick because I am a prime member and thought I would also be able to access HBO go. We'll that's a no go... got an email from customer service on that when I asked. Hey amazon, don't advertise something that you won't provide... and then I would add movies to my prime watch list just to find that the next time I logged in, they are now unavailable to watch instant. There's no queue that says how long the movie will be available for on the fire stick or on amazon account that I saw at a glance. Not impressed with this product....", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love that amazon fire TV has its own remote. It's simple, yet very effective and convenient. I started with Chromecast on 3 TVs and I will probably switch to Amazon Fire.  Here's why:1- The Remote. It's very convenient to not have to use your phone as a remote. The amazon remote is simple but it also offers a nice variety of programming.2- As a household that does not pay for cable TV service, The Amazon stick supports amazon TV (Chromecast does not) and also Hulu, Netflix, YouTube, PBS and many other paid or free apps.3- For us, it's been more reliable than Chromecast. In not sure if it's a problem with our phones, the Chromecast app, the Chromecast TV device, our wireless, or the internet gods, but I spotted using mine because it never worked and since I bought the fire TV stick, I've been so happy.4- The remote is small. Don't lose it.", "verified": true, "helpfulness": "0/0", "author": "MOM23 \"MOM23\""}]