[{"rating": 5.0, "review": "This is so passing my expectations.  Super easy to install, the choices that are already pre installed are great.I can play Pandora though my stereo system and such a plus.It also had a preinstalled app for photos through Amazon.  This was so easy to get going and within moments I uploaded 144 pictures.This will go down as best buy for 2015!", "verified": true, "helpfulness": "0/0", "author": "Teri Brown"}, {"rating": 4.0, "review": "Easy to set up and we use it every night!", "verified": true, "helpfulness": "0/0", "author": "fredrick j callander"}, {"rating": 5.0, "review": "Yes this is my 2nd one and it was for my dad and he just loves the Netflix ...well my account", "verified": true, "helpfulness": "0/0", "author": "Dunn Onsite"}, {"rating": 5.0, "review": "It's everything I needed for my not-so-smart older TV. So happy i bought one!", "verified": true, "helpfulness": "0/0", "author": "Marlene"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "keisha"}, {"rating": 2.0, "review": "The Fire TV Stick works great!! One of the main reasons I purchased this was the \"coming soon feature - —take Fire TV Stick with you to use with HDTVs in hotels, college dorms, or anywhere with captive portal Internet access that requires entering a password or a log-in.\"  I ordered this way back in November or 2014.  When I called customer service earlier this month they had no idea what I was talking about.  When the rep put me on hold and asked around no one else knew about this feature or when it would be released.  I will change my rating when this feature is available or at least a release date.", "verified": true, "helpfulness": "0/1", "author": "JeremyPDX"}, {"rating": 5.0, "review": "I am kicking myself that I didn't order more back in November!  This is by far the easiest streaming device on the market!  We have had google tv since the beginning and what a fiasco!  When it works it causes the cable to not work, this hooks up  and boom no problems!  We love it!  My husband hates TV, but I have him watching back episodes of the Blacklist and House of Cards!  Prime users need this!  It's awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Deborah A. Maki"}, {"rating": 5.0, "review": "slightly more usable than chrome.", "verified": true, "helpfulness": "0/0", "author": "Barnabas"}, {"rating": 1.0, "review": "The fire stick would not keep contact to the wifi", "verified": true, "helpfulness": "0/0", "author": "kenny schick"}, {"rating": 4.0, "review": "Works as advertised. Easy setup & very user friendly. Remote & phone app make navigating a snap. I just need to figure out how to make my Wi-Fi connection stronger. Overall a very pleasant experience so far. Keep up the good work AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Joecyber"}]