[{"rating": 5.0, "review": "I think it's the best thing yet", "verified": true, "helpfulness": "0/0", "author": "Ann Jones"}, {"rating": 5.0, "review": "awesome job !", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "We had issues with this, buffering and telling us to check out connection. After talking with some other family members about the issues, we learned that the \"extension\" that comes with the stick is what we needed. The stick was completely hidden from sight behind the TV, but when we plugged the extension in the wireless connection was able to read the stick. We haven't had a problem since. We love it and have watched all kinds of movies and TV series we missed. Highly recommend this if you're tired of running out to rental places all the time.", "verified": true, "helpfulness": "0/0", "author": "Joyce B. Trammel \"Joyce B\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "CLinde"}, {"rating": 5.0, "review": "I love my Fire TV Stick and Fire TV Box.  I travel for a living and it makes it so easy to take along.  Would buy many more if/when they put it on special again.", "verified": true, "helpfulness": "0/0", "author": "Mr Fix It"}, {"rating": 4.0, "review": "works pretty good, but netflix sometimes needs to buffer.i have a high end asus router, no issue in the rest of the house with buffering for netflix, something with the fire stick", "verified": true, "helpfulness": "0/0", "author": "sj"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Suzy"}, {"rating": 5.0, "review": "This is an amazing product. I am going to get one for every TV in the house. Goodbye cable!!!!!", "verified": true, "helpfulness": "0/0", "author": "TL"}, {"rating": 4.0, "review": "I like the performance of the Stick, but had difficulty with the remote being hyper-sensitive.  It was dealing me fits trying to log on originally.I also really like the unobtrusive nature of the Stick; it makes for a really clean install.", "verified": true, "helpfulness": "0/0", "author": "Chip"}, {"rating": 5.0, "review": "Easy to use! I love having the access to my video library. Prices are comparable to iTunes and sometimes cheaper, so it's nice to have the option to choose between the two.", "verified": true, "helpfulness": "0/0", "author": "Carilea Slote"}]