[{"rating": 5.0, "review": "I'll be honest with you... that's what you want anyways, right? Amazon's Fire TV Stick is my favorite add-on to my television since the blu ray player.Not only does this product let you take advantage of your Prime subscription content, it also let's you expand beyond with apps and screen mirroring functionalities. My favorite part about the Fire Stick is that I have had great streaming experiences with this product. I was streaming Amazon Prime through my Nintendo Wii, but the playback lagged at times and was grainy beyond a bad YouTube resolution. The Fire TV Stick seems to have figured out how to juice my slow network speed to deliver incredible content.A final word- I actually bought another one of these for another room in my house... that is how much I like this device.If you are one the fence, I say go for it. You will not be disappointed nor out of much money at all.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "snicklefritz"}, {"rating": 5.0, "review": "We are enjoying our 30 day free trial of amazon prime, the firestick is a wonderful experience. We will definately be ordering amazon prime. What a deal for a year for $100. Will be worth it. Don't miss cable at all!!", "verified": true, "helpfulness": "0/0", "author": "shirley kabalka"}, {"rating": 1.0, "review": "I have had nothing but problems since installing the Fire Stick!  It constantly freezes up or locks up and the only recourse is to reset the router.  I have a Roku on another TV and a Chromecast on my daughter's TV and both of these perform flawlessly.  I am really frustrated with this item as it's almost impossible to watch a complete show or movie without it locking up and having to reset the router in order to finish my show.  I would have returned it, but I kept thinking that it was just a glitch and that it would get better as it broke in.  If it continues, I will be looking at replacing it with another Roku that I know will work properly!  Totally regret this purchase.  I had high expectations only to be disillusioned by Amazon's colorful description.", "verified": true, "helpfulness": "2/2", "author": "D. Cherry \"nikonguy\""}, {"rating": 5.0, "review": "Very easy to use and I love the remote.", "verified": true, "helpfulness": "0/0", "author": "Chi Hoang"}, {"rating": 5.0, "review": "Great - was at the prime knock down price - really fab device!", "verified": true, "helpfulness": "0/0", "author": "tenezledroit"}, {"rating": 5.0, "review": "Easy to set up, menu easy to navigate. We were iced in for 3 days and this really came in handy to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple to use. Great quality picture and the popping has disappeared from my HDMI connection. Thought I was going to have to send it back after I got it, but they must have updated something on the Hulu+ App to fix the audio issue. Can't say enough good things about it now!I do wish they offered a 'PRIME ONLY' setting for finding content though. I hate scrolling through and finding a show to watch only to have it tell me it's $2.99 an episode!", "verified": true, "helpfulness": "0/0", "author": "Ron Lunsford"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Jonathan Newman"}, {"rating": 2.0, "review": "Meh.  It works, but I don't use it near as frequently as my Chromecast.  I bought it because Amazon had it on pre-order special for $15.  It's worth $15, but not much more.", "verified": true, "helpfulness": "1/3", "author": "Sean T Closson"}]