[{"rating": 4.0, "review": "Very easy set up - except for the remote control battery door.  I had to go online to figure it out and eventually use a knife to get it open.  Seems to be a design flaw as there are 100's of other reviewers/commenters stating a similar experience.", "verified": true, "helpfulness": "0/0", "author": "Preppymeetsredneck"}, {"rating": 5.0, "review": "I ordered this even tho we have Two Kindle fire HDX's in our home just to have a remote. Originally my wife gave me a hard time about getting another Amazon streaming device since we had the Kindles. The fire stick is soooo much easier to use. My kindle requires a cable to hook up & my wife's kindle has the wireless method. The fire stick with the remote is a much better way to stream and search.  We have been using it regularly with Amazon Prime & Netflix. I highly recommend getting one. I had the foresight to get the early offer to Prime members for $20 bucks but it is well worth the $40 reg price. Sometimes I wish the remote was a little larger since it is easy to lose in your furniture.  The wI-fi connection seems much better than the Kindle wireless as their are seldom any glitches .", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 5.0, "review": "We are very pleased with the Fire TV Stick! Thank you!", "verified": true, "helpfulness": "0/0", "author": "Rose Reasor"}, {"rating": 1.0, "review": "Will not stay connected with s***. Great stuff on the stick of only it would play more than half an episode at a time.", "verified": true, "helpfulness": "0/2", "author": "William Pecson"}, {"rating": 3.0, "review": "This device lets you easily put online content you pay for onto your TV. That makes it and extension of the stuff you buy, not a generalized tool. To do anything else, you have to work for it. Other than NetFlix and the like, you can use it to watch YouTube videos, but so far, that's the only \"free\" thing I've been able to do with it. What I really need is a device that would make my TV monitor display into a remote console. If I had that, I could plug this thing into any TV's HDMI input and mirror my \"desktop\" on the big screen.I like to give demos to groups for computer application use, music and images. This is limited to the number of people who can huddle around my laptop. You can get wifi products and software to do the remote console thing, but they are expensive. The \"Fire TV Stick\" has everything needed for that functionality, but it is being marketed as a captive tool for content providers. All it would take is a simple remote console app to make this product into the thing that EVERYONE would want and would consider to be standard equipment. But, no, we can't have that because the only thing the marketeers think we do with our devices is download old TV shows. We're striving to do more, so much more, and you can get rich by providing us that capability. If you don't, well, this will be just another cute gizmo that becomes obviated, then forgotten, in about a year. It's your choice, Amazon.", "verified": true, "helpfulness": "0/0", "author": "ALAN O. BALTUTH"}, {"rating": 4.0, "review": "Well satisfied with the $19.95 intro price. Not sure I would pay the current list, since I have an apple TV. But I like Amazon Prime video. The remote is cheap feeling, and the software menu is clunky, but so is Apple.", "verified": true, "helpfulness": "0/0", "author": "Paul Banbury"}, {"rating": 5.0, "review": "I used to connect my computer via HDMI cord to use Netflix, Hulu and such, and now it's instant access! The remote is very responsive, although sometimes a little sensitive, but for the price, this is a great product!!", "verified": true, "helpfulness": "0/0", "author": "Marie E Cross"}, {"rating": 5.0, "review": "It turned my my tv into a smart tv and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "terry teiman"}, {"rating": 4.0, "review": "I get it but, disappointed that the remote app is only available on android", "verified": true, "helpfulness": "0/0", "author": "clundy12"}, {"rating": 5.0, "review": "Really enjoying the Amazon Fire TV Stick so far. At this writing, I've had it a month.", "verified": true, "helpfulness": "0/0", "author": "Christi Crowder"}]