[{"rating": 5.0, "review": "This is the best electronic purchase", "verified": true, "helpfulness": "0/0", "author": "christine reedy"}, {"rating": 5.0, "review": "I love it, amazing... I was scared to buy this product because I just new it would not work some how because it works off of wifi but it does really good. Sometimes it does cut out and I have to wait not even a min. for it to come back but hey that's not the fire stick's fault it's my wifi. so I have to say I just love it.", "verified": true, "helpfulness": "2/2", "author": "April Woody"}, {"rating": 5.0, "review": "So far we love this product", "verified": true, "helpfulness": "0/0", "author": "abbie rose"}, {"rating": 5.0, "review": "It took me a few minutes to hook up but I love how clear and instant the movies are on our TV. I have already told others how much I like it.", "verified": true, "helpfulness": "0/0", "author": "kay"}, {"rating": 5.0, "review": "Its great and so easy to install.  I recomend this to all prime users...worth every penny.", "verified": true, "helpfulness": "0/0", "author": "keith m"}, {"rating": 1.0, "review": "I thought I would only pay for the Fire Stick. However!!!!!!!!! I've learned that I still have to pay for any movies I want to see, any second seasons I enjoy, and there is no such thing as Netflix. I have an account with Netflix and it is not accepted by Amazon. You want to be scammed??? Join Amazon............ Lying , Greedy, DIRT BAGS", "verified": true, "helpfulness": "0/5", "author": "Jack Smith"}, {"rating": 5.0, "review": "5 stars much better than the chrome cast highly recommended", "verified": true, "helpfulness": "0/0", "author": "Debra Salters"}, {"rating": 2.0, "review": "Does not Crunchyroll, which is a disappointment. However, the video is extremely laggy and jumpy. Videos also sometimes lag out and return to the menu screen unexpectedly. It definitely is the product and not my internet, either--I replaced the Fire Stick with an Apple TV and have had absolutely no problems since. Shame, since I was avoiding the Apple TV due to the cost and thought the Fire Stick would be a great deal but it ended up being a terrible product. I could never get through even a 30 minute show without it having some type of issue.", "verified": true, "helpfulness": "0/0", "author": "Xuan Do"}, {"rating": 5.0, "review": "This is a great streaming device!!!!  Very much easier to use than anything else we have used (Wii and computer).  Excellent selection of free content with Prime membership:) We really love Amazon products and service/support!", "verified": true, "helpfulness": "0/0", "author": "bgar"}, {"rating": 5.0, "review": "everything work well enjoying the fire stick", "verified": true, "helpfulness": "0/0", "author": "Richard Fee"}]