[{"rating": 5.0, "review": "Love the compatibility with our kindle fire HDX7s. Had a minor issue the first attempt we made trying to use the mirror cast function but restarted the kindle and all was well. No issues streaming anything and loads much faster than our chromecast. All in all a great purchase after cutting the cable chord.", "verified": true, "helpfulness": "0/0", "author": "Zachary R."}, {"rating": 2.0, "review": "Can only watch certain shows on Hulu plus on it can't turn it off with out unplugging it. Not what I was hoping for", "verified": true, "helpfulness": "0/1", "author": "Randall halbur"}, {"rating": 5.0, "review": "Absolutely,I've this little guy. Trying to convince my husband to finally get rid of that damn Apple tv.!", "verified": true, "helpfulness": "0/0", "author": "Meghan M. \"Meghan M.\""}, {"rating": 5.0, "review": "Works great!  Easy installation", "verified": false, "helpfulness": "0/0", "author": "Sue"}, {"rating": 4.0, "review": "It wouldn't reach my wifi from my room", "verified": true, "helpfulness": "0/0", "author": "eddie"}, {"rating": 5.0, "review": "This thing rocks.  Bought it at reduced price for a gift during the promotion and wish I purchased more.  Super easy to set up, fast and great quality.  Well done, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Tobymosey"}, {"rating": 5.0, "review": "Love this, loses Internet connection at times, but picks it back up! Love the music the best right now! Only had this a few days.", "verified": true, "helpfulness": "0/0", "author": "Linda Rumsey"}, {"rating": 5.0, "review": "Very easy to set up and to use.", "verified": true, "helpfulness": "0/0", "author": "CW"}, {"rating": 5.0, "review": "I am very pleased with the fire stick.  My husband and I are enjoying it tremendously.  It was easy to set up and I'm anxious to get another for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Marla \"coat lover\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jason"}]