[{"rating": 4.0, "review": "Easy setup. I loved it knew it who I was and connected to my account. Interface works wonderfully well, better than Roku I think. And it can access all my paid streaming accounts, plus lots of other freebies. Bonus for prime member is the ability to access Amazon cloud content, and see photos on the TV. The only downside for me, which knocked a star off, is that it requires extra USB power. A bigger TV might do it from onboard USB outlets but I had to use the included wall socket adapter. Another plug. Yuck! And not including much about this in the Amazon ads and product pictures was poor form. But I got the $20 deal, and even for current price would do it again.", "verified": true, "helpfulness": "0/1", "author": "Allen Blair"}, {"rating": 3.0, "review": "Too much buffering", "verified": true, "helpfulness": "1/1", "author": "Kutty"}, {"rating": 2.0, "review": "It's great after you are connected to your wifi and Fire Stick server. I've had same problems with 2 different fire sticks. Turns out you can't be more than 20' from router to maintain a reliable wifi connection and  when I loose connection with fire stick router, I resolve by removing power to fire stick for 10-15 seconds. I haven't had any problems with Google Chrome Cast. Amazon has some firmware improvements to make!", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Loving it...easy to install!", "verified": true, "helpfulness": "0/1", "author": "Ed Torres"}, {"rating": 5.0, "review": "After 3 days I haven't had an issue with the Amazon Fire TV Stick. It works better than other streaming devices that I have used. I was using my PS3 to stream Amazon, Netflix, and Pandora, but now I don't have to keep it powered on as this thing streams everything just as well.", "verified": true, "helpfulness": "0/1", "author": "Speedy"}, {"rating": 5.0, "review": "Absolutely Love it!!! I had one T.V left in the house that was not a smart TV and had a Roku hooked up to it. Decided to try this out and man is it great. Was going to toss the Roku in the trash, but ended up just \"donating\" it to a friend until their Fire Stick comes in.", "verified": true, "helpfulness": "0/1", "author": "Guitar Man"}, {"rating": 4.0, "review": "This thing is great!  I've been playing Amazon Prime videos from my phone, but they were often choppy.  Now they are nice and smooth, and I can do other things with my phone.However, I wish there was an iphone app for the remote, because I'm sure at some point I'll lose that tiny little remote.  And, I wish it didn't automatically start playing the next episode of a series when the first one ends.  But overall I'm very glad I have this!", "verified": true, "helpfulness": "0/0", "author": "Techie Mom"}, {"rating": 5.0, "review": "I like it. Great way to get Netflix and other stuff on the bedroom tv.", "verified": true, "helpfulness": "0/1", "author": "datdude"}, {"rating": 5.0, "review": "Great little device that works with most of the popular streaming services out there.  I use PLEX mostly since I have my own media library, but I like the suggested apps and extra content that is available.  I LOVE the remote as it makes the whole experience much better.", "verified": true, "helpfulness": "0/1", "author": "asendic"}, {"rating": 5.0, "review": "Works great, built solid, and fast. No issues as the product works as advertised and includes the major video distributors (Netflix, Hulu, etc.). The only gripe with this product is the extended set-up, but for folks who aren't tech savvy its helpful.", "verified": true, "helpfulness": "0/1", "author": "Hi-C"}]