[{"rating": 5.0, "review": "Good product, easy to connect.", "verified": true, "helpfulness": "0/0", "author": "carol sage"}, {"rating": 5.0, "review": "Yes its good and so simple to use exeded my expectative", "verified": true, "helpfulness": "0/0", "author": "enrique nieves"}, {"rating": 5.0, "review": "Love it. started out with a roku 1. Was going to upgrade to the 3 until a sales person at best buy recommended the fire stick. Saved $60 and went with the stick. It works 100x better than roku 1. Plan on buying one for each tv.", "verified": true, "helpfulness": "0/0", "author": "KristinaD21"}, {"rating": 5.0, "review": "So far I am really liking it. I had a Chromecast and I like this better because of the remote and I don't have to use my tablet to get contents on to TV.", "verified": true, "helpfulness": "0/0", "author": "Barbara Rasmussen"}, {"rating": 5.0, "review": "really freaking awesome", "verified": true, "helpfulness": "0/0", "author": "Bree"}, {"rating": 5.0, "review": "I liked this but returned it as my goal was to remove my cable bill. You still need cable to have show time channels on it.", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 3.0, "review": "Pros:- Inexpensive- PortableCons:- Content is not very good. I'm still not impressed with either Amazon Prime or Netflix selections.- The GUI is not very good, and using your phone doesn't help. The phone interface just gives you the same buttons as the remote, but it is worse to use because the phone does not have any tactile feedback.", "verified": true, "helpfulness": "0/0", "author": "Russell B Brinkmann"}, {"rating": 1.0, "review": "I purchased my 1st Fire Stick in Dec 2014. It stopped working 5 weeks later - 1 week after the warranty ended.  I complained to Amazon and they sent me a new replacement Fire Stick. That one lasted a bit longer, but once again, my Amazon Fire Stick quit working. Our other TV (both TV's are the same model) has a Roku 3 media player that constantly works. Yes. I am trashing the 2nd Amazon Fire Stick and buying another Roku.Don't waste your money on the Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Loves to Read"}, {"rating": 5.0, "review": "Works great! No other description necessary :)", "verified": true, "helpfulness": "0/0", "author": "Bruce Sweeney"}, {"rating": 5.0, "review": "We love it. Almost ready to get rid of cable.", "verified": true, "helpfulness": "0/0", "author": "yideaz"}]