[{"rating": 5.0, "review": "I am caring for a bed bound family member and this has saved my sanity by giving me something I really want to watch when I can watch", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I usually do not write reviews. but this product deserves the review and I just love it. I have Roku, Apple TV and Chromecast. I will say this is very close to apple tv and quality of the picture quality is great and very easy to use remote. After using Roku i was sold that it is the best and firetv stick just blew roku. I don't use lot of apps except most popular ones. Amazon did this one right and keep it up.", "verified": true, "helpfulness": "0/0", "author": "Bhavani Jayaprakash \"Bliss\""}, {"rating": 5.0, "review": "An Amazin' device! Easy to setup. Easy to use. Great picture quality. Only 1 problem with the insertion of batteries in the remote. There were no instructions that tells you to 'depress' the back of the remote and push down to open.", "verified": true, "helpfulness": "0/0", "author": "Spanky"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Patsy Jaco"}, {"rating": 4.0, "review": "The battery for the remote is difficult to get to. Had to use pocket knife to pry the cover off to get to the batteries. The hdmi connector to our stick was bent and therefore we cant plug it directly into the tv hdmi port; we plugged it in to the provided adaptor.Remote is easy to use and navigate (no backlight) so is the software.Kind of creepy how all of my amazon account information was instantly accessed.We bought it so we could get netflix in 2 rooms without having to move the xbox 360 all the time. Yes, expectations were met.", "verified": true, "helpfulness": "0/0", "author": "CSB001"}, {"rating": 4.0, "review": "Worked as expected.", "verified": true, "helpfulness": "0/0", "author": "ALM3"}, {"rating": 5.0, "review": "Very easy to install and put in place.", "verified": true, "helpfulness": "0/0", "author": "Vicky mannozzi"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Joel Noble"}, {"rating": 5.0, "review": "Woks great, easy set up.", "verified": true, "helpfulness": "0/0", "author": "RR"}, {"rating": 5.0, "review": "Excellent. If you happen to use a LCD that is not an Smart TV then this magic thing is a MUST.", "verified": true, "helpfulness": "0/0", "author": "Daniel Moses \"dfmoses\""}]