[{"rating": 5.0, "review": "SUPER GREAT!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Brendanielson"}, {"rating": 5.0, "review": "love it so far. I had a ruku but it kept losing connection. plus amazon knows how to pack their products cause the box it came in looks great. I couldnt throw it away. thanx amazon.", "verified": true, "helpfulness": "1/1", "author": "agent cooper"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Urious S."}, {"rating": 3.0, "review": "I thought there would be more recent movies available for free.  I was disappointed that they 2-3 year old movies had a \"purchase\" cost associated with them rather than the \"prime\" customer use for free as I was lead to believe when purchasing this device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like it, works very well and easy to set up", "verified": true, "helpfulness": "1/1", "author": "Ashley Wiggins"}, {"rating": 4.0, "review": "I have this. Ordered it before released so was a good price in advance (about $20.)Easy to use. Enjoy having choices of movies, series, tv shows.I got rid of cable tv and now use the fire stick.", "verified": true, "helpfulness": "1/1", "author": "NancyC \"Nanc\""}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Karen Kisgen"}, {"rating": 5.0, "review": "Great product just what we wanted", "verified": true, "helpfulness": "0/1", "author": "Bryan Peterson"}, {"rating": 5.0, "review": "Been using a jailbroke Apple TV 2 for past 4 years or so and this thing blows it out of the water in speed and functionality.  Load Kodi ( XBMC) on it and this thing is amazing. Using the  Slingplayer app is like having another DVR in the bedroom.", "verified": false, "helpfulness": "1/1", "author": "Elizabeth"}, {"rating": 5.0, "review": "Fantastic it's clearer than,Cox cable that I have contour on with 6 programs and the newest box by ushering this web tv,as I call it its great we have Googlec crome I wish a option was the talk to clicker but it's notv", "verified": true, "helpfulness": "1/1", "author": "Michael Kelleher"}]