[{"rating": 5.0, "review": "Was simple to set up and use.  Would recommend highly!!!", "verified": true, "helpfulness": "0/0", "author": "Fran Cohen"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Angela Grubb"}, {"rating": 5.0, "review": "It's as advertised well worth the minimal cost.", "verified": true, "helpfulness": "0/0", "author": "Brian P LaClair"}, {"rating": 5.0, "review": "I love this. You can connect to all your apps with this device. There are a bunch available. It's easy to use and I love it!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Marquez"}, {"rating": 5.0, "review": "Great little gadget that will help usher in the new world of TV. I had a Chrome dongle but prefer the greater access to good products offered by Amazon. Good buy!", "verified": true, "helpfulness": "0/0", "author": "Skip Brooks"}, {"rating": 5.0, "review": "I've had the Chromecast for quite a while and wasn't in a hurry to buy \"another stick\" just so I could stream Prime movies.  Putting the fire stick in the same category was a mistake and I'm kicking myself for not buying this sooner!Yeah it's great that I can stream the Amazon content and all of the other streaming video services that I want to use but I had no idea how awesome it would be to have the remote (vs using a laptop or phone to control the content).  The best thing is that this device just rock solid works the way it should work.Tired of unplugging and resetting the Chromecast?  Tired of resetting the wireless connection?  I took this for granted with Chromecast - haven't done either once with the fire stick.If you're on the fence, just buy it - you won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "Roger Glogowski"}, {"rating": 5.0, "review": "Love my new Amazon FireTV Stick!!!! 5 star all the way......", "verified": true, "helpfulness": "0/0", "author": "Allen Jackson"}, {"rating": 5.0, "review": "Great little device. This is the second one I've purchased that has worked flawlessly with a great selection of apps.", "verified": true, "helpfulness": "0/0", "author": "Dylan"}, {"rating": 5.0, "review": "Very easy to install and so far works great.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "The fire stick is great. Love the options of HBO and showtime, in addition to a,axon prime", "verified": true, "helpfulness": "0/0", "author": "Brad Harris"}]