[{"rating": 5.0, "review": "I have saved so much money with the fire Stick.  We go to the movies a lot plus purchase new releases.  No more!!!", "verified": true, "helpfulness": "0/0", "author": "Nancy Leduc"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "LOVE, LOVE, LOVE this product!!!!  Easy to use and AMAZING for those that are Amazon Prime members!!", "verified": true, "helpfulness": "0/0", "author": "jlr26"}, {"rating": 5.0, "review": "Easy to install, set up and operate. Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Donald A Rice"}, {"rating": 5.0, "review": "Love the Fire Stick. Purchased mainly to use for Netflix and the remote adds a simplicity to the system making it family user friendly. I liked the easy set up and have already used in separate rooms at home. Before we felt confined to one room having to use wii console or blue ray console to access Netflix since we don't own smart tv's.  I highly recommend buying a second remote as I am doing since it is small and easily lost in couch cushions or recliner.", "verified": true, "helpfulness": "0/0", "author": "S. Oldham"}, {"rating": 5.0, "review": "Amazing. So glad I bought this instead of roku.", "verified": true, "helpfulness": "0/0", "author": "Lilian"}, {"rating": 5.0, "review": "So much better than paying way too much for tv provider.", "verified": true, "helpfulness": "0/0", "author": "melanie"}, {"rating": 2.0, "review": "I bought this as an alternative to the chromecast and roku sticks, and I regret that decision. I wanted to use other apps on this stick like netflix, hulu and youtube as well as amazon video, but the external apps are glitchy and difficult to use.", "verified": true, "helpfulness": "0/0", "author": "Elia"}, {"rating": 5.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Beth H Emigh"}, {"rating": 4.0, "review": "I got the fire tv stick for my husband for Valentine Day.  He is enjoying it very much.  Had to get help from our Niece and Son-in-Law to get it started.He or I aren't Computer Smart.", "verified": true, "helpfulness": "0/0", "author": "Gerry"}]