[{"rating": 5.0, "review": "The remote control needs \"getting used to\" but works great, is simple with few but necessary options. FIRESTICK delivery and content are exactly what I wanted and am no longer married to cable tv companies.", "verified": true, "helpfulness": "0/0", "author": "Honest but private"}, {"rating": 5.0, "review": "I originally bought the Logitech Review worst investment ever! However the Amazon stick works and there is no bugs! Finally a system where it works simple, easy to connect and doesn't crash! we only use it for basic tv and Netflix and works great! if you need it for your basic tv needs and just want to connect it easy with no hassle this is the option for you!!", "verified": true, "helpfulness": "0/0", "author": "Mrs. Smith"}, {"rating": 2.0, "review": "Wish I could like it.. but streaming is extremely slow.. disconnects often from my wireless network.. my router is right next the stick.. for all the hype.. I really expected more.. but it is what it is.", "verified": true, "helpfulness": "0/0", "author": "Dinesh Bakiaraj"}, {"rating": 3.0, "review": "Works great except for the remote.  The remote feels and looks cheap compared to Apple tv's remote.  It broke first time I opened the back of the remote.  Plus opening the remote was a pain in the butt!", "verified": true, "helpfulness": "0/0", "author": "Marie Moore \"Marie\""}, {"rating": 3.0, "review": "Very easy to use, like it much better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Dean S."}, {"rating": 5.0, "review": "Such a great tool for mixing TV and the Internet in an entertaining way.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 4.0, "review": "works pretty well but most content is Amazon driven  which  makes  it a little limited.", "verified": true, "helpfulness": "0/0", "author": "R. Benjamin"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Christine Le"}, {"rating": 1.0, "review": "Do you need this if you have a smart TV", "verified": false, "helpfulness": "0/0", "author": "Carl Williams"}, {"rating": 5.0, "review": "Amazing! No need for cable anymore!! Greatest invention ever 😁", "verified": true, "helpfulness": "0/0", "author": "noelle harrison"}]