[{"rating": 5.0, "review": "I hate regular tv and cable is getting so expensive. This was a great alternative and I haven't run out of things to watch yet!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Hedgcock"}, {"rating": 4.0, "review": "A little slow but overall good", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 5.0, "review": "Very easy to install. We love the many features available with Amazon stick & Prime! We're planning in removing our cable tv plan.", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "Great!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Li-Li"}, {"rating": 3.0, "review": "Did not have the 5 stars because I have a plasma TV and had to disable the pixel orbiter.", "verified": true, "helpfulness": "1/1", "author": "Carlos \"Carlos\""}, {"rating": 5.0, "review": "I was hesitant on buying this but after reading the reviews and how simple it was to install I just had to try it. I was not disappointed. I am a prime member which makes installing and uploading your choices so much faster. Having a remote has made watching Prime TV an even more pleasurable experience. As one reviewer mentioned 'just 7 buttons to learn' how hard can it be? Its NOT! I use to hook my kindle up to the tv to watch prime tv that way. No remote so it wasnt the easiest to maneuver the kindle when i wanted to pause or go back, etc.  I enjoy just leaving the stick where it is and forgetting about it. I had to unplug the kindle every night to read, etc. I also enjoy listening to prime music more. With the Fire Stick it is easier and faster to find selections under Prime Music that I want to listen to. It was ok coming through the kindle but the Fire TV Stick loads everything up super fast. I would HIGHLY recommend investing in this item.", "verified": true, "helpfulness": "0/0", "author": "MAPA"}, {"rating": 5.0, "review": "very good, i love it", "verified": true, "helpfulness": "0/0", "author": "Aura Avila"}, {"rating": 5.0, "review": "Great productEasy to install", "verified": true, "helpfulness": "0/0", "author": "Mary N. Derose"}, {"rating": 4.0, "review": "the control is a bit touchy  and when returning to a show half finished after several hours seems to start the show at the beginning.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 4.0, "review": "Really simple to setup, takes less than 1 min to setup. I have been using fire stick for over  year now. Works great to stream Netflix, Hulu, etc but just does not work to stream You Tube. Amazon has nailed this, as soon as you start the setup, fire stick knows who you are, your account info, etc. etc.", "verified": true, "helpfulness": "0/0", "author": "Indy"}]