[{"rating": 3.0, "review": "Pros: good app offering, fast software response (menus and the like feel snappy), it's cheap.Cons: Drops the network, stutters (even with streaming content across your local network (plex)), some problems require a restart (this process involves getting behind your tv and unplugging the power connection to your fire tv stick, there is no \"restart\" menu option).I've spent a lot of time trying to troubleshoot my network, which performs very well with everything else, including devices much farther away, and behind many more obstructions. I'm now going to attempt a troubleshooting step that i found online, which is to put it in the hdmi extension provided (around 2 inch extension). If this does solve my problem, i'll provide an update, but this is not something that a device like this should have as a requirement to work.", "verified": true, "helpfulness": "1/1", "author": "M. Moats \"IT Professional, Musician.\""}, {"rating": 5.0, "review": "I love it! Saved me from having to buy a smart tv.", "verified": true, "helpfulness": "0/1", "author": "Julie hawkins"}, {"rating": 5.0, "review": "It's great!!! Did everything I expected and more", "verified": true, "helpfulness": "0/1", "author": "James Parker"}, {"rating": 5.0, "review": "I received this on Christmas. Best present ever. Easy to use and easy to hook up", "verified": true, "helpfulness": "0/1", "author": "Amanda"}, {"rating": 5.0, "review": "Easy setup, easy to use. Totally awesome.", "verified": true, "helpfulness": "0/1", "author": "Michael OGrady"}, {"rating": 5.0, "review": "Now I can get rid of Direct TV", "verified": true, "helpfulness": "0/1", "author": "Anima Katz"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/1", "author": "Steven Davis"}, {"rating": 1.0, "review": "Amazon...what is the problem w/connectivity? It worked okay at first but now will not connect w/my wi-fi. I get to first page then refuses to recognize my wi-fi.......Apparently this is a frequent problem. almost 1000 comments on it. I dont believe its the TV, I actually bought a new wifi system and still no good, its in the same room, and now Ive spent more time on this then I really wanted. But it haunts me, what is the problem? Is it me, is it the product, is it something that I can change about myself. Come on a trouble shooting help wouldnt kill you would it? How about an upgrade, or admission that maybe you have a problem. Then we can go from there. Pls fix this stix.......", "verified": true, "helpfulness": "2/2", "author": "M. Towne"}, {"rating": 5.0, "review": "its very good, like it better than roku", "verified": true, "helpfulness": "0/1", "author": "M.J.L \"mike\""}, {"rating": 3.0, "review": "I was told by the sales person that the Fire Stick included You Tube. I was not able to find it.", "verified": true, "helpfulness": "0/1", "author": "victor duran"}]