[{"rating": 5.0, "review": "Purchased this onsale and do not regret it one bit. I have the Chromecast and this device is just as good but with added capabilities chrome currently does not have. This device has access to many apps including netflix. They perform as expected. You can sort content easily with the remote and do not need an external device like phone or ipad to cast, everything is done through the home menu. Streaming is very quick and appears strong. Very happy with purchase. Turns any tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "Fast /Clear picture/No lag /runs warm", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I set up the Fire TV stick and have tried to watch two programs on it, one netflix and the other amazon prime.  In both cases, the picture was incredibly jerky---appeared to have too low of a framerate.  I switched to a different streaming device (chrome cast for netflix and roku for amazon prime) and the picture was much smoother.  There's no network difference here---they're all on the same wifi, so it's either the device itself or software that's delivering bad video quality.In terms of setup it wasn't horrible---the only odd thing was after it updated its firmware it first claims it needs the wifi password again, then about 15 seconds later remembered it and kept going even though I hadn't finished entering it.When you get the device it's attached to your amazon prime account, and I could immediately stream movies.  What was strange was that there was no way to view my watch list in the menu---I could only see a \"top movies and tv shows\" category.So the fire tv stick seems like a nice idea, but with poor video quality, I'd recommend a Roku instead, as it also streams amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Bruce L"}, {"rating": 5.0, "review": "If you have Amazon Prime, buy this. If you don't, buy a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Andy B"}, {"rating": 4.0, "review": "Once I finally got it to log on, it work like a charm. Great picture with the HDMI", "verified": true, "helpfulness": "0/0", "author": "martin blanchet"}, {"rating": 4.0, "review": "We're loving the Fire TV Stick. This is the first media streaming device I've owned so I have nothing to compare it to. Dinged it one star for the remote being insanely hard to open for the disabled. I finally had to resort to using a knife to pry open the battery compartment. Remote is a bit small to use with my big hands (disability doesn't help either) but I've switched to using the Android remote app on my Samsung tablet. The addition of voice searching from the table is awesome. Since receiving we have streamed several movies and numerous TV show episodes. No lag, stuttrring or loading pauses were evident at all. The only slowdown was doing the mandatory firmware update during setup and I think that was just because the server was swamped by new owners updating at the same time. I have no real complaints about my Fire TV Stick, paired with my Amazon Prime membership I have a nearly endless supply of free content to watch.", "verified": true, "helpfulness": "1/2", "author": "Keith Blodgett"}, {"rating": 3.0, "review": "Christmas gift", "verified": true, "helpfulness": "0/2", "author": "david lawrence"}, {"rating": 2.0, "review": "The Fire Stick was awesome....for the first week when it worked. Then it started lagging during playback, and now I can't get it to hold an Internet connection to stream anything. Completely useless.", "verified": true, "helpfulness": "0/0", "author": "Laura M \"standingsolo\""}, {"rating": 5.0, "review": "I own an Apple TV but I love my Fire TV Stick way more than the Apple TV! It's faster and has bigger internal memory and the best thing about it is that I can use my Prime account + the awesome free games that I get! I'm in total love with this product! Really recommend it!", "verified": true, "helpfulness": "0/0", "author": "Al-Raisi"}, {"rating": 5.0, "review": "awesomesauce! just wish it has a ios app right now and bluetooth connectivity for a mouse", "verified": true, "helpfulness": "0/0", "author": "Micah"}]