[{"rating": 5.0, "review": "Just got it but was easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "Live4Art"}, {"rating": 5.0, "review": "This little thing is quick and easy, my 4 year old loves using it to watch her nick jr shows", "verified": true, "helpfulness": "0/0", "author": "Nick S \"Nick S\""}, {"rating": 5.0, "review": "It look Good I hope it is  too the  Fire TV Stick  I hope it will do a good job for me and my HD TV", "verified": true, "helpfulness": "0/0", "author": "Shannon Little"}, {"rating": 3.0, "review": "Easy to set up.  After a few hours of watching one day, it froze, then sped up and unable to stop and connect with a tv show or movie.  Stopped for one day and it resolved itself.", "verified": true, "helpfulness": "0/0", "author": "mary e david"}, {"rating": 4.0, "review": "The Fire stick worked well and was easy to set up.  My problem was that I couldn't get a signal on the TV in my family room.  It was too weak.  I switched out my Roku to the TV in the family room out of the bedroom and placed the Fire stick in the bedroom and everything works.  If I hadn't been able to switch out my Roku, I would not have been as satisfied as it wouldn't have worked.", "verified": true, "helpfulness": "0/0", "author": "cpareviewlady"}, {"rating": 5.0, "review": "Wasn't sure about it but I thought I would give it a try with my Prime Membership. Love it! Performs as advertised and well worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Clint Harris"}, {"rating": 5.0, "review": "A simple way to watch HD movies via WiFi in a little HDMI stick.  It really, really works!  Picture quality is excellent and selections are very slick.  Yes I'm pleased in this purchase.  Already bought a movie, \"FURY\" and loved it!  Thanks Amazon for being innovative and putting it out there", "verified": true, "helpfulness": "1/1", "author": "A_ZonGeek \"Joxware\""}, {"rating": 2.0, "review": "As long time Roku users, we were pretty excited to get our Fire Stick.Pros:It is easy to set up and use.It has all the same channels that we were already using on the Roku.The picture quality is great.Cons:It freezes up at least once every time we use it.The remote is extremely sensitive, it will pause the show, go up several sections, etc., if you barely touch it.And...did I mention the freezing up? Because that's actually pretty annoying.We are going to be returning this product and going with something else.We might try again after Amazon gets a chance to work out some of the bugs as the concept is great, but it just doesn't work like it should.", "verified": true, "helpfulness": "0/1", "author": "Tamara Ockree \"Tam\""}, {"rating": 5.0, "review": "Awesome product! good job amazon.", "verified": true, "helpfulness": "0/0", "author": "PAguy"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "vernette"}]