[{"rating": 5.0, "review": "Simply amazing!", "verified": true, "helpfulness": "0/0", "author": "RaShad Adkison"}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Husain"}, {"rating": 5.0, "review": "Awesome!  No need for cable tv. All you need in one. Netflix, Hulu, You tube.  All the prime music, videos. My library etc.....", "verified": true, "helpfulness": "0/0", "author": "wayka"}, {"rating": 5.0, "review": "Great product for the price! Love the remote it came with as well.", "verified": true, "helpfulness": "0/0", "author": "fidlinfil"}, {"rating": 1.0, "review": "I though that there would be free mioves with amazon prime", "verified": true, "helpfulness": "0/2", "author": "kenneth oertel"}, {"rating": 1.0, "review": "where do i begin?  after a few months of having this, the power stick became a huge problem.  Yes, it has great quality, HOWEVER, that is IF you are able to get the power cable back into the stick TO watch your favorite programs.  It is better than watching on my xbox but that is only because I do not have to turn on the game controller to switch from different programs.  Sending it back ASAP.No real choice of game selection, no real programs to choose from (unless you are already subscribed in things like Netflix, hulu plus, etc.)  you can get a blu ray player/DVD player for about as much and still watch in high quality and guess what?  It has HD as well!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works GREAT!!! I absolutely LOVE mine. I was using my laptop connected to my tv and my mouse to watch netflix. Now I just use a remote control like a person is suppose to when they're watching TV. Works so well & I LOVED IT so much I bought a second one for my bedroom!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": ",!!!!  I love,  !!!  I love", "verified": true, "helpfulness": "0/0", "author": "domingo"}, {"rating": 1.0, "review": "Very poor. Connectivity issues and it it very slow when it does connect.", "verified": true, "helpfulness": "1/1", "author": "Eric"}, {"rating": 1.0, "review": "Couldn't get it to work out of the box. I was with customer support for an hour or so. Finally got it to work, but doesn't work anymore. Says that it's not connected to the interent and when I go into settings, it says that I am. Piece of crap. Good thing that I only paid $20 for this garbage.", "verified": true, "helpfulness": "0/1", "author": "Jacque Michael"}]