[{"rating": 2.0, "review": "no mic on the remote.", "verified": true, "helpfulness": "0/0", "author": "Aryn Nakaoka"}, {"rating": 5.0, "review": "Wow this thing is awesome", "verified": true, "helpfulness": "0/0", "author": "Pep"}, {"rating": 2.0, "review": "Couldn't use the remote.  The only way it would work was standing directly in front of the TV, then if you pushed a button it would skip about 4 spaces.  Very hard to control.  Couldn't go back or forward normally.  Called, got a replacement remote yesterday.  I can't get it to work, but hopefully my son will be able to get it to work over the weekend.  I really do hope it does work, it looks awesome.. I am afraid the remote needs some work though.  Even getting it open to put the batteries in is a challenge.", "verified": true, "helpfulness": "0/0", "author": "Cathy Vignali"}, {"rating": 5.0, "review": "After just a few days, Fire stick is all it was cracked up to be.  Check back in a couple of months for an updated review.", "verified": true, "helpfulness": "0/0", "author": "W. F. Brezette \"Yankee Fan\""}, {"rating": 5.0, "review": "Works great.  To get CATV I have to pay for a cable box; which I didn't want to do, not to mention the space a box takes up.  FireStick gives me movies, TV series and other viewing options.  Would definitely recommend this to others.", "verified": true, "helpfulness": "0/0", "author": "Michael Dopson"}, {"rating": 3.0, "review": "tends to freeze screen when watching HULU, but seems to be good product for the price", "verified": true, "helpfulness": "0/0", "author": "stacie cowden"}, {"rating": 5.0, "review": "Affordable and makes TV's lacking intelligence, smart. Great for Prime members. Netflix, YouTube and Amazon Prime movies, music and shows could replace cable/satellite for the thrifty folks.", "verified": true, "helpfulness": "0/0", "author": "D Bob"}, {"rating": 5.0, "review": "Worked perfectly with easy setup. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "MKFLA"}, {"rating": 5.0, "review": "East to set-up. A very cool piece of technology!", "verified": true, "helpfulness": "0/0", "author": "K. Miller"}, {"rating": 4.0, "review": "The Fire Stick was inexpensive and easy to set up.  I was able to set up ESPN and watch sports free of charge.  The receiver goes behind the TV and pickups up a strong signal from the remote.Watch out...though.  If you click on the \"30 day trial for Amazon Prime Membership\", they will charge your account for a membership with no email message or anything.  If a Prime member has added you as a sub-member, you are unable to watch Prime content.", "verified": true, "helpfulness": "0/0", "author": "Joan Mims"}]