[{"rating": 5.0, "review": "Overall really statisfied except for the fact they made me wait 2 months or so after I ordered it to finally receive it. What's 2 day shipping when it's on back order lol but ok I love it", "verified": true, "helpfulness": "0/0", "author": "rampaige"}, {"rating": 5.0, "review": "WHAT A GREAT LITTLE GADGET WORKS WELL I HAVE PRIME SO THERE'S THOUSANDS OF MOVIES TO WATCH...HAPPY WITH MY PURCHASE", "verified": true, "helpfulness": "0/0", "author": "gary gregorio"}, {"rating": 4.0, "review": "ok, needs more apps", "verified": true, "helpfulness": "0/1", "author": "beier&waldroop well serv angela m garner"}, {"rating": 1.0, "review": "Got real excited for this little streaming stick, but unfortunately I can't say that my experience has been all good.Problems:1. Sometimes Crackle app doesn't work.  Never had this problem with my Chromecast.2. Sometimes casting Netflix movies from phone doesn't work.3. In the Hulu app, sometimes the video freezes but the audio keeps playing.Chromecast would rarely have problems.  I won't say never but the Fire TV Stick definitely has more problems.  The only plus side was the Fire TV Stick was only $19.  I'll keep using it for now and hope Amazon keeps updating the software, and hopefully developers maintain their apps and make sure they work well with Amazon's OS.But, if the problems persists, I'll have to go back to my Chromecast.  Maybe I'll start buying my movies and TV shows through the Google Play store instead of amazon.  Hmmm... What do you think Amazon?* Update March 8th 2015 *I changed my rating from 2 stars to 1 star.  My FireTV stick has problems maintaining a WiFi connection.  I have a roku, tablet, my phone, laptop, and a Chromecast that are all in the same vicinity and they all have no problem keeping a connection with my wifi.  I also get errors in Netflix more frequently that day \"we can play this video at this time.\". If I go to my roku or chromecast, it plays just fine.  The amazon video just started do the same thing.  I think it has to do with not maintain ing a WiFi connection please it will have trouble loading the home page and the network set up will come up.  I don't think I should have to change anything on my part BC all my other devices work just fine.  FireTV is the only thing that is having trouble.  I would not recommend this to anyone for their streaming needs.  Get a roku or a Chromecast if amazon video isn't important to you.", "verified": true, "helpfulness": "0/0", "author": "swing?"}, {"rating": 3.0, "review": "I am very pleased with the functionality. I would enjoy it more current movies and TV shows had prime status. There are too many dated shows and movies in the prime status. Great device happy to have it, but it could be better", "verified": true, "helpfulness": "0/0", "author": "t j"}, {"rating": 3.0, "review": "loses signal but works fine when connected", "verified": true, "helpfulness": "0/0", "author": "Percy"}, {"rating": 5.0, "review": "Yes, it did meet my expectations.  From a quick review and comparison to a couple of other sticks, it allows you to do what they do, plus you can buy movies available on PRIME video, so it adds a whole new dimension in watching.  And it doesn't tie up your devices, phone, tablet ipad, because it's self contained.  I'm totally satisfied!", "verified": true, "helpfulness": "0/0", "author": "David Payton"}, {"rating": 5.0, "review": "Great Online Service From This Seller!Love These!  They arrived on time, as described and were packaged well. No Complaints!", "verified": true, "helpfulness": "0/0", "author": "Cameron Blackwell"}, {"rating": 5.0, "review": "The Fire Stick is amazing!  Very easy to install and use. The remote is uncomplicated with few buttons.  The price was fantastic.  I recommend the Fire Stick to everyone.", "verified": true, "helpfulness": "0/0", "author": "NANCY A DICKEY"}, {"rating": 4.0, "review": "Just got it so this is 'first impressions' feedback and will likely change as I use it more:Set up is super simple. Actually impressive how simple. Overall very usable and useful. If I could give 4.5 stars I would. But with children, parental controls are a bit too simple in that I have to constantly put in the PIN. Would rather be able to configure a child-safe mode and turn it on. Also, when I cleaned up the \"recommended movies\" and removed all the ridiculous titles (these don't seem to match the online recommended titles), they were back again the next day. Should be able to turn it off completely or save the changes made through Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas Byrnes"}]