[{"rating": 4.0, "review": "It will take some time for me to figure it out", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "it works great as long as you keep your modem for the Wi-Fi within good or \"not-so-far\" distance from it. for instance I had my computer in another room \"with the modem for my internet connection\" and the Fire Stick in the living room plugged into the TV and it would not connect correctly until I relocated the modem. But until I figured out what the problem was it just wouldn't work. I believe that should be noted when the Fire Stick is purchased to avoid a lot of problems as well as trouble for the customers that purchase it.", "verified": true, "helpfulness": "0/0", "author": "Hubert Maier II"}, {"rating": 5.0, "review": "LOVE LOVE LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "sb5308"}, {"rating": 5.0, "review": "Takes a few min. TO set up . Works great.", "verified": true, "helpfulness": "0/0", "author": "Steven Jacobs"}, {"rating": 5.0, "review": "I LOVE THIS... ORDERED ONE FOR EVERY TV IN MY HOUSE!!", "verified": true, "helpfulness": "0/0", "author": "karen j townsend"}, {"rating": 5.0, "review": "Easy to install, no issues, easy to navigate. Now I can watch Amazon or netflix in my bedroom instead of on my nook", "verified": true, "helpfulness": "0/0", "author": "Sandy H"}, {"rating": 4.0, "review": "Works great good pic good signal from a distanceI got for $19 but it's worth $39", "verified": true, "helpfulness": "0/0", "author": "Elements \"morbid\""}, {"rating": 5.0, "review": "Works very well and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Joseph Phelps"}, {"rating": 5.0, "review": "The fire stick is perfect for someone who wants to access other applications and doesn't want a blu ray wifi dvd player taking up space.  Great purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent. Same as the fire tv box I have except only $39.", "verified": true, "helpfulness": "0/0", "author": "Gerry Kulig"}]