[{"rating": 5.0, "review": "Works great and great price.", "verified": true, "helpfulness": "0/0", "author": "James Hopper \"jwh8000\""}, {"rating": 3.0, "review": "It has a very pretty interface, though I would prefer if Amazon Prime had its own app, instead of being all over the place.  Hopefully one day it will get more apps. And it's annoying to have to enter my pin to do screen mirroring.Overall I prefer the Roku. The fast forward thumbnail view on the Roku, the better 5G WiFi range. And it's just  And hopefully one day it will get more apps easier to use.", "verified": true, "helpfulness": "0/0", "author": "HeyRadar"}, {"rating": 5.0, "review": "I love the fire stick. Meet all our needs. Easy to set up. Would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Alice G."}, {"rating": 3.0, "review": "My wireless system is always buffering.  Makes watching any program impossible.  I wish there was a test that you could do BEFORE you bought this to see if it would work with the system you have in your home.", "verified": true, "helpfulness": "0/0", "author": "Gravman"}, {"rating": 5.0, "review": "", "verified": true, "helpfulness": "1/1", "author": "laura harris"}, {"rating": 3.0, "review": "It's nice.  Very convenient - but the capability of it receiving WIFI signals is questionable.  Placed it in the TV on the main level about 20 feet from he router - flawless.  Put it in the basement about 40 feet from the router - can't find a signal - I have WIFI on the phone so I know the router can reach- but the stick can't get anything.  Just be aware of where you might use it and how far from the router.", "verified": true, "helpfulness": "0/0", "author": "Michael E. Johnson"}, {"rating": 5.0, "review": "This works well. It is so portable!", "verified": true, "helpfulness": "0/0", "author": "Naomi Gardner \"Nbgardner\""}, {"rating": 4.0, "review": "Works well, easy setup, and easy to use.  Lots of apps available. Only concerning item is the stick gets really hot during use.", "verified": true, "helpfulness": "0/0", "author": "Laura K. Hall"}, {"rating": 5.0, "review": "It performed as advertised.", "verified": true, "helpfulness": "0/0", "author": "David M Abernethy"}, {"rating": 5.0, "review": "Love it, easy to use with lots of viewing options.", "verified": true, "helpfulness": "0/0", "author": "asusd98"}]