[{"rating": 5.0, "review": "Exactly what we needed. Has Netflix and prime. A remote app for my phone would be awesome. Maybe next year?", "verified": true, "helpfulness": "0/0", "author": "Matt Bunce"}, {"rating": 5.0, "review": "This is a great product. It was easy to set up and even easier to use. Works great with Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Kelly Miller"}, {"rating": 5.0, "review": "Works great easy to get started", "verified": true, "helpfulness": "0/0", "author": "Gale Fischer"}, {"rating": 5.0, "review": "Set-up was very easy even for an over 60 individual who is not very proficient with technology.  We are greatly enjoying the ease in which we can access Amazon Prime video and Netflix along with the improved quality of picture.  Wish I had purchased this device sooner!", "verified": true, "helpfulness": "0/0", "author": "Bren"}, {"rating": 5.0, "review": "All is good Fire Stick awesome", "verified": true, "helpfulness": "0/0", "author": "Linda N."}, {"rating": 5.0, "review": "Nice product. Very easy to set up. Nicely packaged. Very happy with the item.", "verified": true, "helpfulness": "0/0", "author": "Robin Sweet"}, {"rating": 4.0, "review": "Really good product.... if it had youtube would've been better..", "verified": true, "helpfulness": "0/0", "author": "Marcus momon"}, {"rating": 3.0, "review": "I received my Amazon Fire TV Stick about a week ago and it was easy to set up and relatively easy to use.  What is fairly disappointing was that some of apps such as CNN are available ONLY on the Fire TV but not on the stick.  If you are looking to purchase  streaming devices such as a Roku or a Fire TV stick,  be sure to check on the amazon app site to see if apps/programs that are important to you are supported on the Fire TV stick.  It might end up that other devices might be better suited for your needs.", "verified": true, "helpfulness": "0/1", "author": "Li Peng Yap"}, {"rating": 5.0, "review": "This is the best way to watch tv", "verified": true, "helpfulness": "0/0", "author": "Evelyn Padilla"}, {"rating": 4.0, "review": "I have net Flicks and Prime --the fire stick is easy to use --especially with the phone app--- and I do like it --  when doing searches everything and not just prime movies or net Flicks --that is my only complaint.  It works very well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]