[{"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "phillip robinson"}, {"rating": 5.0, "review": "You need to buy this - just dropped our cable bill by over $100 per month - $1200 savings I will take it", "verified": true, "helpfulness": "0/0", "author": "Jeff Peck"}, {"rating": 5.0, "review": "Works great!!! Exactly what I needed!!!", "verified": true, "helpfulness": "0/0", "author": "Brandon Razo"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "luis hernandez"}, {"rating": 5.0, "review": "I love everything about it!!! Sooo worth the money!", "verified": true, "helpfulness": "0/0", "author": "Aprile"}, {"rating": 5.0, "review": "The second was perfect and so easy to install.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Richardson"}, {"rating": 5.0, "review": "God device", "verified": true, "helpfulness": "0/0", "author": "Rodolfo"}, {"rating": 5.0, "review": "So easy to set up and works very well!", "verified": true, "helpfulness": "0/0", "author": "Nedra Greenwood"}, {"rating": 5.0, "review": "Perfect for my son's room.  My son decided to get rid of his XBOX which is how he was watching TV.  We bought Amazon Fire TV a few months ago and dropped cable-we have NEVER been happier.  We get our local channels using an antenna that we purchased here as well and haven't paid for cable since.  We got this Fire TV Stick so my son could have TV and watch Amazon Prime, Hulu, Netflix, etc on his TV in his room.  it's perfect, he loves it and we love how easy it was to set up!! Don't hesitate!!  You need this!", "verified": true, "helpfulness": "0/0", "author": "Jana Thomas"}, {"rating": 3.0, "review": "I like the concept and so far the actual stick seems like a pretty solid device. The fire stick is easy to use. The setup was brain dead simple which was nice. There are a lot of options with all the games, movies, tv shows, etc. The negatives are that a lot of the tv shows and movies are Pay Per View meaning we have to pay to watch. Also, there was so much buffering that we cancelled it during our free trial.", "verified": false, "helpfulness": "0/0", "author": "Joseph Davis"}]