[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "licensedbylaw@hotmail.com"}, {"rating": 4.0, "review": "Being an avid chromecast user, I was a bit skeptical about the Fire TV Stick. However, after a month of use, I have found myself pleasantly surprised. Watching Netflix and Prime Instant Video on this device are great. The remote is top notch and I find myself using it much more than I expected. The only reason I'm docking this product a star is I have had some issues with the youtube app apparently crashing and/or freezing up my Fire TV Stick, which I have never had happen on my Chromecast. This is definitely a worthwhile purchase if you're looking for a streaming stick and a must-have for watching Prime Instant Video, but if you prefer controlling a streaming stick with your phone I would probably go with the chromecast.", "verified": true, "helpfulness": "0/0", "author": "michael fochs"}, {"rating": 4.0, "review": "Had some difficulty setting it up and getting it to work...", "verified": true, "helpfulness": "0/0", "author": "W. Bjorklund \"wendall\""}, {"rating": 5.0, "review": "EASY TO USE LOVE THIS....", "verified": true, "helpfulness": "0/0", "author": "CLC"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Victoria"}, {"rating": 5.0, "review": "So far so good! Just be sure to get an unlocked Fire Stick with the Kodi app installed so you can watch anything you want. I'm catching up on cable and BBC shows, and I've cancelled Netflix. Looking forward to football season without having to pay for a big cable package!", "verified": true, "helpfulness": "0/0", "author": "Deb Hughes"}, {"rating": 1.0, "review": "Very Disappointing! I bought this to watch Amazon Prime videos. This is a bad product. Constantly stops while buffering and sometimes the picture freezes and you still hear the sound track. I would have thought it was the WiFi but I have other devices that work great with the same TV, WiFi connections and same movie.", "verified": true, "helpfulness": "0/1", "author": "Hawghauler"}, {"rating": 5.0, "review": "Omg talk about a life saver. ..my kids absolutely  love their firestick. Cable was out for 2 days...I thought  I would die. Amazon firestick was right on time. Easy setup, very kid friendly. ...they love the games and amazon app world. Not to mention. To tons of shows they can stream with prime video. Needless to say cable is back working...and they haven't even noticed that my husband and I took the box out of their room. Best 40 bucks or so I have ever spent", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love it and love the price.  Have been using it for around a month and the only issue I have is when my internet has a hiccup I have to unplug the fire stick to reboot and reconnect which in Florida with our summer storms it has been a few times.  But overall, we bought it for our bedroom and it is easy to use and is very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Hulings"}, {"rating": 5.0, "review": "I have been very happy with the purchase of the Amazon Fire TV stick.  It has met all my expectations! Would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "CustomerReview"}]