[{"rating": 5.0, "review": "I love the ease of everything at my fingertips", "verified": true, "helpfulness": "0/0", "author": "Sally L. McInnis"}, {"rating": 5.0, "review": "Got this as a gift.  What a great way to spend the time now that football season is about over and I wait for baseball to start.  (I HATE basketball!)The menu could stand a little adjusting...it needs a better search function.  But other than that, it is great.", "verified": true, "helpfulness": "0/2", "author": "Duncan Dashney"}, {"rating": 5.0, "review": "Kids love it!", "verified": true, "helpfulness": "0/0", "author": "Kevin L. Staggs"}, {"rating": 4.0, "review": "It does the job!", "verified": true, "helpfulness": "0/0", "author": "Robert P."}, {"rating": 1.0, "review": "Will not work, well it did the first couple of days but now it will not connect to the wifi. Unplugged it ,plugged it back in and it worked for a few minutes but went on the fritz again. Got this as a gift for Christmas so may be sending it back if I cannot get it to work.", "verified": true, "helpfulness": "1/2", "author": "Darwin J. Evans"}, {"rating": 2.0, "review": "I guess that I didn't know what exactly this did. So after figuring out how to get it going I realize that everything that comes up is an extra cost. I just didn't know that.", "verified": true, "helpfulness": "1/1", "author": "twyla"}, {"rating": 5.0, "review": "Performing as advertised! I now have a smart TV", "verified": true, "helpfulness": "0/0", "author": "Greg Westmoreland"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "serena sutton"}, {"rating": 5.0, "review": "Very cool device, before I had to set the laptop up and hook it in to the tv and the signal would be in and out trying to watch a movie. The Fire TV Stick works great and gets and never loses signal. I love it.", "verified": true, "helpfulness": "0/0", "author": "C Toller"}, {"rating": 5.0, "review": "All the apps I wanted. Works better than my Apple TV mainly because apples remote is horrendous. We use ours in the bedroom or when we travel.", "verified": true, "helpfulness": "0/0", "author": "JML"}]