[{"rating": 5.0, "review": "Absolutely obsessed with this.  We have one in each bedroom! We cancelled our movie channels from cable and just use our fire TV stick! It's very user friendly and so simple to install! If I could give it 10 stars I would!", "verified": true, "helpfulness": "0/1", "author": "Christen vogel"}, {"rating": 5.0, "review": "Great price, great device.", "verified": true, "helpfulness": "0/1", "author": "Aaron Keininger"}, {"rating": 5.0, "review": "Fantastic, easy to install and use.  Perfect for our needs.", "verified": true, "helpfulness": "0/1", "author": "Graydragonfly"}, {"rating": 3.0, "review": "Not what I expected.", "verified": true, "helpfulness": "0/1", "author": "Mom \"Mom\""}, {"rating": 5.0, "review": "Love it!  It's much more affordable than cable service and the selections are great.", "verified": true, "helpfulness": "0/1", "author": "Carrie Wollam"}, {"rating": 5.0, "review": "This was easy to set up, and now I can watch Prime TV and Netflix in my room.", "verified": true, "helpfulness": "0/1", "author": "Laura Egan-Frank"}, {"rating": 5.0, "review": "We love our Fire Stick.  We do not have cable run to all rooms in our house and this is a great way to be able to access quality programming without having the cable company install a box at added expense.  It is easy to install, set up is simple, and it can easily be moved to another TV.  It will be perfect for use when we travel.  You have acess not only to Amazon Prime movies to watch for free, rent, or purchase, but also NetFilx, Hulu and other programs, so options are endless.  I would highly recommend purchasing an Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/1", "author": "Brenda Jean Myers"}, {"rating": 5.0, "review": "This works great, looking to add another!", "verified": true, "helpfulness": "0/1", "author": "Greg"}, {"rating": 5.0, "review": "Quick set up - love Amazon prime TV and movie access.", "verified": true, "helpfulness": "0/1", "author": "E. Cabral"}, {"rating": 5.0, "review": "Great Product.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]