[{"rating": 4.0, "review": "As a prime member, I was able to purchase this at the rock bottom price and for that value I am happy.  Smooth interface but as an owner of Apple TV and Roku, I can honestly say I prefer Roku.  Not knocking the Fire Stick, it has great graphics and ease of use but there is not that much difference from the competitors.  I have yet to try out the gaming but am hopeful that will go smoothly.", "verified": true, "helpfulness": "0/0", "author": "Annlynnmarie"}, {"rating": 4.0, "review": "I have experience with a lot of streaming devices. I've used an HTPC, Rokus, Chromecast, and various other devices. The Amazon stick works very well and I would have a hard time not recommending it for most people looking for a main cord cutting device. I would still recommend a Roku for most people since it has the most comprehensive list of \"apps\" available. However, if you're budget conscious, then the Fire TV Stick will get the job done.", "verified": true, "helpfulness": "0/0", "author": "James V. Mudd"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Mark Wilson"}, {"rating": 4.0, "review": "It's good; but it doesn't support Miracast with Windows 8.1. Please add the support Amazon.", "verified": true, "helpfulness": "0/0", "author": "Sina Gholamnejad Davani"}, {"rating": 4.0, "review": "Great addition to home media setups. I have a Samsung Smart TV, but I prefer to use my Fire Stick. My only gripe is that it lacks screencast capabilities.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "It's almost a Roku, but it's much better than a Chromecast.  The interface is confusing at first.  It's obvious this is designed for Amazon Prime users, which isn't overly surprising.  My biggest gripe, and the reason for only four stars, is it may not work well if you use the USB port on your TV to power the device.  It gave me some cryptic warning when I did the initial setup.  I haven't noticed any issues, but you'd think the engineers could have designed it to work off of the power available in a TV's USB port.", "verified": true, "helpfulness": "0/0", "author": "Ernie Beckley \"Quality will be remembered long after price is forgotten.\""}, {"rating": 5.0, "review": "Great, as the other Kiindles I've had.", "verified": true, "helpfulness": "0/0", "author": "Linda C. Herrold"}, {"rating": 5.0, "review": "Easy setup. Menus look great! Teenage boys love it. If you are Prime, this is a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Icewater144"}, {"rating": 5.0, "review": "It Just Works! Exactly what we have come to expect from Amazon - quality. This was perhaps the easiest thing we did all year.", "verified": true, "helpfulness": "0/0", "author": "Roberta Cumberworth \"Bobbie\""}, {"rating": 5.0, "review": "We own an Apple TV and Xbox and I enjoy the fire stick the most.", "verified": true, "helpfulness": "0/0", "author": "Unknown"}]