[{"rating": 4.0, "review": "Full support for Miracast is not present yet, but does work with Kindle tablets and phones. If you plan to buy this solely for screen mirroring your phone or tablet to your big T.V, you may end up dissapointed like me.Do your own research first for compatibility support with your deviceOther than that it is a great product with no major issues so far, other than the lack of full miracast support even on the latest Samsung phones and tablets.", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 5.0, "review": "Easy to setup and Quick to watch movies.only bad thing is doesn't work on older tv.", "verified": true, "helpfulness": "0/1", "author": "Anon"}, {"rating": 2.0, "review": "The fire stick is a good idea. But not a good product. It was so hard to pick up my WiFi signal with the router being no more than 20 feet away. When I was able to get WiFi signal, the Netflix and prime movies lagged so much it drove me crazy. It took 5 minutes to watch 30 seconds of a movie. I found myself watching Netflix on my phone in the same room problem free. The firestick was quickly returned and I now have a Sony blu ray player that does everything a fire stick is supposed to, plus more.If you're trying to decide between the fire stick and a blu ray player for online movie streaming, pay a little more for the proven device.", "verified": true, "helpfulness": "0/0", "author": "Kelsey"}, {"rating": 5.0, "review": "The product work exactly as described .", "verified": true, "helpfulness": "0/0", "author": "William D. Tompkins"}, {"rating": 5.0, "review": "I love this.  It is cheaper than the appleTV by $60 and so much more user friendly.  Cool features include (if you also have amazon prime) access to 40,000 movies and tons of TV shows and amazing music!  Plus I buy all my music through Amazon mp3 and when you play your music on the screen (get this!) you get the lyrics too!!! Can't say enough, bought one for every TV in the house plus one to travel with.", "verified": true, "helpfulness": "0/0", "author": "Kuldeep S Tagore"}, {"rating": 1.0, "review": "When I first got the Fire TV stick, I loved it so much that I bought 3 others as Christmas presents.  However, following a couple months of use, it started having problems contacting my wireless router even though the signal was very strong.  It degraded over time to the point that I can't use it at all, even after multiple re-boots.  Finally, the remote control no longer works, even with two new batteries.  I've contacted Amazon support over this issue, so hopefully it's something minor.  I'm certainly going to monitor the 3 other sticks I got for my brothers!", "verified": true, "helpfulness": "1/1", "author": "Patrick S. Duffy"}, {"rating": 5.0, "review": "This works really well and a great price.  I actually bought it before it was released and didn't know what to expect but now I wouldn't be without it.", "verified": true, "helpfulness": "0/0", "author": "Lori Harris \"laurenh33\""}, {"rating": 5.0, "review": "How did I ever put up with dragging my laptop around for my chromecast?  Fire TV stick, prime, Netflix... perfect :)", "verified": true, "helpfulness": "0/0", "author": "Martin R."}, {"rating": 3.0, "review": "Needs more ram would work great if a SD Memory card could be used. locks up quite a bit after watching a full show. Picture quality is great but it's NO ROKU I'll try the box next and see how it stacks up.Knowing the memory issue I would try the box first  and I am on a T1 line which I can cable direct on the ROKU that makes all the difference. This is WIFI only.", "verified": true, "helpfulness": "0/0", "author": "Ben C."}, {"rating": 5.0, "review": "Best thing I've ever purchased! Can't wait to get another one", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]