[{"rating": 4.0, "review": "Setup is easy, navigation is quick and responsive, picture and sound are great, and streaming video starts VERY fast.  But a couple of issues keep this from being a great device:1) The interface is clunky.  The layout isn't very convenient; it seems like it takes too many clicks to get where you want, and there's no way to customize it so only your preferred apps/features are at the front.2) Wi-fi connection is problematic.  I have a dual-band router and I've tried connecting the Fire TV stick to both the 2.4 and the 5 ghz channel.  It will work fine with each one for a while, but then it will flake out and lose connection.  Network connection status will show \"Connected with problems.\"  None of my other wi-fi devices in the same room ever lose connection, so I know it's not my router or signal strength.  Telling the Stick to forget the connection and then re-connecting has always fixed the problem so far.My only other complaint is that the Amazon Music app is a little lacking.  There doesn't seem to be a way to browse Amazon stations or playlists.  It seems you have to add music to your playlists via the web before you can access them through the Stick app.  Otherwise your only options for music playback are albums you have purchased.Fortunately each of those problems can probably be addressed by a software update, so the Stick could get better over time.  I hope it gets more apps, too.  (I'd love to have another app for watching Ultraviolet movies because the Flixster app doesn't give you access to your entire Flixster collection.)", "verified": true, "helpfulness": "1/1", "author": "P. Higginbotham \"RedZeppelin\""}, {"rating": 5.0, "review": "The Fire TV Stick is a great, cheap alternative to the Chromecast. I got this for our spare bedroom for the kids and when family visits. Amazon needs to offer packages that include either the voice remote or game controller.", "verified": true, "helpfulness": "0/1", "author": "imfishnicked"}, {"rating": 5.0, "review": "This device integrates with Amazon Prime really well - both movies and the music sevice.  It also works great with Hulu and Netflix.  I'd recommend the Fire stick over the Roku stick if you use Prime.", "verified": true, "helpfulness": "0/0", "author": "D. Gudorf \"dave-o\""}, {"rating": 3.0, "review": "I can't get it to work.  Waiting for my grandsons to comehelp me.", "verified": true, "helpfulness": "0/0", "author": "Woody"}, {"rating": 5.0, "review": "I'm a devoted Apple customer but until AppleTV gets the Amazon app or fix the AirPlay issues with the 2nd generation model this is the way to go to enjoy your Amazon content.  Plex is also free in the app store so you can stay connected to your owned digital media without purchasing a season pass from Plex.  Especially fun are the games like Ski Safari, bowling and most of all Fibbage!  Me and my Thanksgiving guest had lots of fun playing Fibbage which allows everyone to play via their phone... the one time I don't mind my guest having their head in their apps.  I plan to take the Fire TV Stick on the road with me for Christmas travel.", "verified": true, "helpfulness": "0/0", "author": "Rusty \"Amazon Faithfull\""}, {"rating": 4.0, "review": "good seller. recommended", "verified": true, "helpfulness": "0/0", "author": "park hun young"}, {"rating": 2.0, "review": "I am very disappointed this fire stick has no vudu and no nhl game center which is why I bought it.", "verified": true, "helpfulness": "0/1", "author": "Aaron Cecemski"}, {"rating": 5.0, "review": "Perfect just perfect!", "verified": true, "helpfulness": "0/0", "author": "DON T."}, {"rating": 4.0, "review": "I would of given 5 stars but feel that it needs more apps.  Besides that it works well.  Very responsive.", "verified": true, "helpfulness": "0/0", "author": "M. Kramer"}, {"rating": 3.0, "review": "When it actually works, it's great. I've found after dozing off watching a tv series that when it's on for an extended time or after it downloads and installs a big update, it gets too warm and becomes useless. When I press the right button it will move once, completely freeze for ten to thirty seconds and then scroll through uncontrollably for thirty seconds. Then it won't recognize the select or back buttons. The only solution is to unplug it and wait for it to cool down. I only paid $20 for it when it was on sale, but I still expected more from a final release from a major company.", "verified": true, "helpfulness": "1/1", "author": "Justin Thell"}]