[{"rating": 5.0, "review": "The Amazon Fire TV Stick is awesome!!!  I owned about 4 Roku devices all ranging from different Roku models (Roku 3, Roku 2, Roku LT, Roku streaming stick and the Chromecast) and although I do like all the products Roku offers I was very surprised with the performance the Fire TV Stick offers.  In experience the Roku 2 and 3 are very responsive and that's due to the beefy internal hardware.  When I plugged the Amazon Fire TV Stick into my TV was incredibly surprise to how responsive and fast this little device is.  I subscribe to services like Hulu+, Netflix and Amazon Instant video and video(s) that I played on all three services are responsive and quick.  There is no lag, loading time is fast and stable.  The Remote control works very well and responds quite well with the Fire TV stick.  Amazon definitely did not cheap out on the internal hardware to this device.  I recommend this device to anyone looking for a online media streaming hardware at a affordable price.  Also I like to mention that the build quality to the device and the remote is excellent.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Its a great device and a great price. Got it for $20. Streams everything well, very fast with very little set up. Replacing my Apple tv and roku devices with this little stick.", "verified": true, "helpfulness": "0/0", "author": "D. Botros"}, {"rating": 5.0, "review": "Just as expected", "verified": true, "helpfulness": "0/0", "author": "dale"}, {"rating": 2.0, "review": "Set up was a breeze, the Fire TV Stick is so compact and sleek, plus the $19 price tag was nice, I wanted it to work out. We tried it on a brand new TV, and it was great for about an hour. Then, it kept picking up 'wifi issues'. I thought it was a glitch so I tried the next day- no more streaming: no Netflix, not even Amazon Prime.I connected my old Roku box, no 'wifi issues' whatsoever. I think that this will be a great product once they work the kinks out. In the meantime though, this one is going back to Amazon.", "verified": true, "helpfulness": "2/2", "author": "MamitaIve \"estrellita2000\""}, {"rating": 1.0, "review": "SLOOOOOOWW!  Apps take forever to run.  Waited 20-30 seconds for each command to process on Netflix.  Not my wifi setup, since it works fine on my Roku system.  Terrible.  I will go back to the Roku.", "verified": true, "helpfulness": "6/8", "author": "lucysally"}, {"rating": 2.0, "review": "We were very excited about this product. We already own a roku one and we're looking for a better option. However the Firestone was very disappointing. Out of the box it required an update to even use it. We live in a rural area and with our somewhat undependable internet it took over 2 hours. We purchased this so that we would get a better signal farther away from our router but it is way worse. My shows are constantly freezing the video while the audio keeps playing. That doesn't happen on our bottom of the line Roku. And another small complaint is the remote is very tiny and slippery. It doesn't sit comfortably in my hands and is forever lost by our boys. To be fair it has a pleasing picture and layout but functionally speaking I'll keep my Roku.", "verified": true, "helpfulness": "1/2", "author": "Kendra Martin-artz \"Kendra\""}, {"rating": 5.0, "review": "This exceeded my expectations! I'm replacing several older Roku units and I can't believe how fast the Fire TV Sticks are.  Movie start times, playback, navigation, app launching,etc. are all lighting fast.  Great product at such a low price!", "verified": true, "helpfulness": "0/0", "author": "N. Hickey"}, {"rating": 4.0, "review": "seems to work about as well as is expected. It won't replace my chromecast completely until it has better support for providers with Showtime Anytime, and ANY support for HBO Go. I also find the UI to be a little clumsy, but ultimately I like it.", "verified": true, "helpfulness": "0/1", "author": "Mark A Sherman"}, {"rating": 5.0, "review": "i am enjoying the fire stick...very easy to set up and streams nicely", "verified": true, "helpfulness": "0/0", "author": "Maura E Cronin"}, {"rating": 1.0, "review": "Chromecast: Plug-and-PlayRoku Stick:  Plug-and-PlayAmazon FireTV Stick: Plug-and-Restart-and-Fail-to-Update-and-Restart-and-Fail-to-Update-and-Finally-Connect-and-\"Connect-with-Problems\"-and-Restart-and-Never-Actually-Work.Love Amazon; worst consumer hardware abomination ever.  The Fire Phone launch seems like the iPhone 5 in the wake of this.", "verified": true, "helpfulness": "13/18", "author": "Tomorrow's Man \"Tomorrow's Man\""}]