[{"rating": 2.0, "review": "I was pretty excited to try this on our non-smart tv in our basement.  We just had TWC install a whole home wifi in our house a couple weeks ago. Our wifi router sits at the top of the basement stairs...direct line to the basement....Fire Stick is about 10 feet from the bottom of the stairs.  The setup process is very simple....scan for the wifi and type in the password.  It kept failing...signal not found even though it showed 2 bars.  I found that I had to unplug the xBox, which sits next to the tv, as well as turn off all wi-fi on all devices....iPhones, iPads, Macbook.  Once I did that it found the signal and it worked.  Since then I've tried unsuccessfully to go directly to the movies/shows without having to rescan or turn off all wi-fi on our devices.  Understanding that this device is mobil from tv to tv I took it to the second floor tv.  Once I plugged it in and turn it on it showed me the home menu right away....saw the movies listed, tv shows....looked ready to go.  However, when I clicked on a show/movie, it was never successful in \"loading...\" what I selected.  I went to the settings, found my wifi signal with 2 bars, did a rescan and it said \"Connected with problems\".  What's that?  I could not load anything.  No option to determine the problem, no troubleshooting.  I unplugged it and put it back downstairs because I knew it worked down there....if I turn off all the devices in the house.", "verified": true, "helpfulness": "0/0", "author": "BKBroiler \"Brian Kusserow\""}, {"rating": 3.0, "review": "Works good on Netflex and Prime but not so good on PLEX.  When running PLEX it will freeze and you have to re-start the movie.  Not good!", "verified": true, "helpfulness": "0/0", "author": "Robert W Comstock"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"book reader\""}, {"rating": 4.0, "review": "It's super convenient to have access to Netflix without having to go through the Game systems! I also like that I can access Pandora and several other web-based apps using my TV. The reason for 4 instead of 5 stars is because the little remote is a pain. There is no Text-like capabilities, so in searching you have to scroll though every letter. It's very basic. Otherwise, it works great and is well-worth the money!", "verified": true, "helpfulness": "0/0", "author": "J. Barber \"JBarber\""}, {"rating": 1.0, "review": "Connection to wifi is constantly dropping. I contacted customer support and I was told I will have a possible resolution within one day of contacting them. I has been more than a week and a half, and no response from them.", "verified": true, "helpfulness": "1/1", "author": "Kajur"}, {"rating": 3.0, "review": "Unlike the chromecast, this is a standalone product.  That means you have to manually input EVERYTHING.  There are some apps that can be \"casted\" but they have to be connected manually the first time around.  The response rate is also slow (albeit better than apps on Smart TV).  After using both the fire stick and the Chromecast, I'd recommend the latter.", "verified": true, "helpfulness": "0/0", "author": "Tra Vu"}, {"rating": 5.0, "review": "A must have for anyone who is a prime member.  So much free stuff!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was so excited to get this to replace my Roku (that I have a lot of streaming problems with).  Unfortunately, this has even more problems than my Roku.  I plan on trying it on a tv that's closer to the router to see if that helps.  Its not as easy to navigate either unless you're primarily using Amazon to stream with.  Netflix, Hulu and others are not as easily accessible as Amazon options.  The Roku set up is easy enough for my 2 year old to use so that is why I didn't want to switch which tv I use it on.  I don't think its a terrible product if its going to be right next to your router and you don't stream with anything but Amazon.UPDATE:  I moved this within 2 ft of my router and it STILL is having a load of issues.  The screen freezes but the audio will still play.  It takes forever for a video to load, and will randomly just go to a black screen in the middle of playing.  I am so disappointed with this purchase...which is a shame since I was so excited about it when I ordered it.", "verified": true, "helpfulness": "0/0", "author": "lethatsme"}, {"rating": 5.0, "review": "Works great !!", "verified": true, "helpfulness": "0/0", "author": "bruno"}, {"rating": 5.0, "review": "Excellent little stick.  I love it!!!", "verified": true, "helpfulness": "0/0", "author": "neelixjc"}]