[{"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/1", "author": "Lizmarie"}, {"rating": 1.0, "review": "Couldn't get the device to work and called up Amazon. After having me start and restart my TV, equipment, and WiFi several times, the rep just told me that this device is not compatible with Samsung TV purchased prior to 2013. No, I'm not crazy, he really told me that.", "verified": true, "helpfulness": "394/444", "author": "Dork"}, {"rating": 1.0, "review": "Waste of money. You still have to pay for services. That I can get thru my playstation and pay for. Why pay the extra 36 dollars to do what my playstation can already do.", "verified": false, "helpfulness": "1/11", "author": "Tina"}, {"rating": 3.0, "review": "Netflix pauses occasionally and it doesn't recovering from buffering.Good attempt but it's difficult to separate paid content from free (prime) ones. To be a differentiator they need to release the phone ASAP and make the remote with voice standard.", "verified": true, "helpfulness": "0/0", "author": "Vivek Vallachira \"Vk\""}, {"rating": 5.0, "review": "Great and easy to use for streaming media. Much easier and user friendly than my Chromecast. Remote is simple but works fantastic.", "verified": true, "helpfulness": "1/1", "author": "Chris Pavelko"}, {"rating": 5.0, "review": "This is a great deal at $39, and I was lucky enough to get it at the $19 price. Within a few minutes of un-boxing the unit, I had it updating with the newest version of the software. The hardest thing for me was getting the battery cover off of the remote to install the batteries.After a little investigation on the internet, it was so easy to add apps like tvmc and kodi to the unit as well as some games and other apps.Trust me, it's well worth the cost for a low price media center for your tv.", "verified": true, "helpfulness": "1/1", "author": "Jon Dubin"}, {"rating": 4.0, "review": "Greater than what I expected.  Happy that  I pre ordered at the lower price!", "verified": true, "helpfulness": "0/0", "author": "M. Bryan"}, {"rating": 1.0, "review": "Both people who bought a Fire phone get an app, but not iOS? Fail!", "verified": true, "helpfulness": "1/14", "author": "Amazon Customer"}, {"rating": 1.0, "review": "You blew it amazon.Who wants to type in wifi passwords with arrow keys? Nobody. Who wants to do it twice? Amazon thinks we all do. Immediately after connecting it downloaded an update and wiped the login.Then on to type in amazon credentials.And now I am forced to watch a tutorial I don't care about.On to the phone app, to get keyboard access. Another forced tutorial to watch. Then you just get a blank area to swipe back and forth. This is awful,  because it behaves like arrow buttons but you are forced to swipe. If its not going to be a fluid motion or a mouse-like cursor,  why not just copy the physical remote? Making a touch screen move a mouse cursor is called a touch pad,  ever heard of it? I found myself holding both together; remote for selecting and phone for keyboard.And then of course you get fire apps (like PBS) which don't recognize the keyboard. I blame this squarely on amazon. Samsung also left this up to the developers and it is a disaster for the user. But what do you care,  I already bought the hardware, right? In every OS when a developer outs in a text box the OS takes care of the rest. It's not rocket science! Oh,  and no HBO Go,  even though Showtime's thing is there.In the end, this is the same old junk everyone else is making. Amazon missed a great opportunity to actually beat the competition. Even the Apple TV is low hanging fruit here.", "verified": true, "helpfulness": "0/12", "author": "pelesl"}, {"rating": 4.0, "review": "One problem that I had with this thing is WIFI range, it is horrible. I had to move my router closer to the stick. Once router was close enough then I was able to download all the updates. Watched Netflix and Amazon prime. Video quality was great. I got it for 19.00 dollars so i can't complain.", "verified": true, "helpfulness": "1/1", "author": "ConklinNYC"}]