[{"rating": 5.0, "review": "I've used Chromecast and Roku (my parents own both) and this is hands down my favorite.With Chromecast, you have to download all of the video/TV apps you want to use on your TV onto your phone (which I hated) since there is no physical remote with the system.. and I hated not having the option of having an actual remote.Roku was fine, but the interface annoyed me (I'm probably just weird) ...The Fire Stick was SO easy to set up and I was done in minutes.  I can hook up my tablet in order to control it, and I can even use my tablet to type in usernames/passwords/search queries onto my TV screen.  I'm an iPhone user and I'm looking forward to their phone-remote capabilities in the future (and I REALLY can't wait for HBO Go).  Plus, this is so inexpensive... You really can't beat it!", "verified": true, "helpfulness": "1/1", "author": "Mei"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "1/1", "author": "Jose Tavarez"}, {"rating": 5.0, "review": "We use this all the time, it's great! It is simple to use, you just plug it in and log onto your amazon account and you are good to go.", "verified": true, "helpfulness": "1/1", "author": "Erin H"}, {"rating": 3.0, "review": "Video transmission is good. Audio is not good. Background sounds fade in and out, rise and fall, very irritating. Tried a replacement stick but have same problem. May need a stronger router signal, but don't know. Amazon help line was little help, but tried.", "verified": true, "helpfulness": "1/1", "author": "Olfart \"Olfart\""}, {"rating": 5.0, "review": "FIRE STICK WORKS GREAT, EASY TO SET UP, NO NEED FOR A  SMART TV, TO WORK.", "verified": true, "helpfulness": "1/1", "author": "Peter E Malchiodi"}, {"rating": 3.0, "review": "The Fire TV Stick itself works well. It is easy to set up and I have moved it from one tv to another tv in the house without a problem. The remote control is a different story. I spent a good 20 minutes trying to get the battery compartment open. I finally went to Youtube for help. When there are four, yes four, different videos telling secrets to getting the battery compartment open should tell you there is a design flaw. It takes a 600 hundred pound gorilla to open the darn thing unless you employ a couple of tools - such as somethning to accentuate the weight on the designated opening area and a small screw driver. Come on Amazon, surely you can do better.", "verified": true, "helpfulness": "1/1", "author": "Steve Wilcox \"Texas Teacher 61\""}, {"rating": 5.0, "review": "I have the Chromecast as well, this product exceeded my expectations and is superior to the Google product. Simple, intuitive controls make navigation easy! My only quip (for the Chromecast as well) is the lack of a volume control. AWESOME product, keep 'em coming Amazon!", "verified": true, "helpfulness": "2/2", "author": "Danielle"}, {"rating": 5.0, "review": "easy to install , works great", "verified": true, "helpfulness": "1/1", "author": "j.michael stolley"}, {"rating": 5.0, "review": "I had it for only 2 weeks now. I enjoy it. It's cery easy to set up. That's the good thing about it. I'm enjoying the experience.", "verified": true, "helpfulness": "1/1", "author": "NEKAVAH"}, {"rating": 5.0, "review": "So happy I made the purchase!! Love love love it!", "verified": true, "helpfulness": "1/1", "author": "tlv207"}]