[{"rating": 5.0, "review": "I had no idea what to expect when I purchased the Fire TV Stick. Best Buy had it on sale for $24.95 and I figured if at the very least I could watch NetFlix it would be worth it. It is so much more than I expected. So many free apps with free content. Some apps basically add tv statikns for free. It is very fast too. It worth the cost. I would recommend even at full price. I didn't plan to sign up for Amazon Prime and figured I would just cancel once free trial is up, however I think I will miss all the added benifits.", "verified": false, "helpfulness": "0/0", "author": "Brandi Jardine"}, {"rating": 1.0, "review": "Worked great the first day. Since then it either won't connect to WiFi, or when it does it struggles to stay connected. Other devices work fine and have no connection issues.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great! Faster than my Roku 3.Works flawlessly with Plex.Bought a few to give as gifts.", "verified": true, "helpfulness": "0/0", "author": "Bob Romero"}, {"rating": 5.0, "review": "Awesomely useful. Lets me access all the great streaming services with ease.", "verified": true, "helpfulness": "0/0", "author": "Chris N"}, {"rating": 5.0, "review": "Worked great right out of the box with little or no effort. I'm a fan!!", "verified": true, "helpfulness": "0/0", "author": "Kay Van Aacken"}, {"rating": 2.0, "review": "It works like a smart TV, not very smart, though.", "verified": true, "helpfulness": "0/3", "author": "Yiping Lu"}, {"rating": 5.0, "review": "perfect item, it is amazing, i have installed some android apps like mozilla firefox, the standard control is unconfortable for gaming, but im not a game fan, so.... now i have an smart tv for only $26. thanks amazon!!!!", "verified": false, "helpfulness": "0/0", "author": "Eric Bris"}, {"rating": 5.0, "review": "Works awesome!", "verified": true, "helpfulness": "0/0", "author": "michele marx"}, {"rating": 5.0, "review": "Love, love, love. Need I say more? :)", "verified": true, "helpfulness": "0/0", "author": "Jacqui"}, {"rating": 5.0, "review": "play's amazon video.comes with a remote.actually plays games! even with the default remote!miracast support!but the downside is it dose not have the deep in-app integration that chromecast has,you can't just click a button in your favorite video app, and have it continue playing on the screen.but the fire TV stick is set up to be a media center, not a companion device like the chromecast,if you want something you can just turn on, watch a movie or show, then leave, it's great!However the UI is VERY amazon centered.you have multiple sections for the amazon video's TV, Movies, prime movies,but if you want to watch netflix, hulu, or youtube, you must leave that section, go to the 'Apps' section, then scroll through a combination of games, apps, and streaming (services all in one big list) to find what you need, and that can be a bit cumbersome.the 'recent's section' is a big help, but I'd still prefer better organisation then 'amazon stuff' and 'everything else'but the fact that you can side load apps like XBMC really is the icing on the already delicious cake,it's not an official option, but without hacking, modding, or jailbraking/rooting, you can easily install your own android apps!that's something the chromecast can not do, even with modding!", "verified": true, "helpfulness": "0/0", "author": "BOBdotEXE"}]