[{"rating": 5.0, "review": "It's just great!", "verified": true, "helpfulness": "0/0", "author": "the orange"}, {"rating": 1.0, "review": "Doesn't work", "verified": true, "helpfulness": "1/2", "author": "Gary K Smith"}, {"rating": 4.0, "review": "The stick is easy to set up and use.  I only wish viewing options were not so limited. and that major networks would offer real time programing", "verified": true, "helpfulness": "0/0", "author": "patricia hamilton"}, {"rating": 5.0, "review": "I love love my new Fire stick! Its very easy for those that aren't that tech savvy. Just plug it in and follow the direction. The remote control gives it a good boost. I tried the Google Chrome and was satisfied because it \"streamed\" form a device like a laptop, cell phone, or computer and it had no remote control. My only con is I'm waiting on HBO GO to come to the Fire stick, however I love watching Netflix! Thank you Amazon for this product cause I just LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "L. Williamson \"Afrodiva\""}, {"rating": 5.0, "review": "I have only had this for a couple of weeks, but we have been enjoying it. It works great and we have the remote app on our phones and Kindle Fires.  They work well, too.  We don't have a very fast internet connection, but there is minimal buffering. I'm getting to watch some highly rated things that I had missed out on.  We really like it.", "verified": true, "helpfulness": "0/0", "author": "hedgielover"}, {"rating": 2.0, "review": "I ordered a fire stick and the delivery was so ridiculous that I canceled the order and bought one at Best Buy for the same price.  I quickly realized that I had done the wrong thing.  There was really very few channels while Roku stick 3500R comes with over 1000 channels including you tube and your own personal streaming from your personal video files including other magnanimous choices, so I returned it to Best Buy.  The product was ok, easy to install, etc., until I realized that I could buy a 3500R stick Roku for only $10 more.  Are you kidding?  The 3500R will do anything that fire stick will do and much much more with the same simplicity as firestick.  I love Amazon's business practices, but they do not have their heads into building their own media network and software.  The are too focused on selling their rentals and trying to mussel out the competition.  I will stick with Amazon at all times when it comes to their business practices and being a good merchandiser, however I think that they should concentrate on competing with others rather than against them.  It would create a better atmosphere for all!  This was my first bad experience with Amazon, but I did buy my Roku from them in the end.", "verified": false, "helpfulness": "0/1", "author": "hoot \"Jim\""}, {"rating": 5.0, "review": "So happy with the fire stick.  Does exactly as advertised.", "verified": true, "helpfulness": "0/0", "author": "TJBGRL"}, {"rating": 4.0, "review": "Like it so far", "verified": true, "helpfulness": "0/0", "author": "John Neureuter"}, {"rating": 5.0, "review": "is wonderful, love being able to watch my old favorites & programming I could not get with cable", "verified": true, "helpfulness": "0/0", "author": "Debbie Dearing-Yoakem"}, {"rating": 5.0, "review": "Love it!  So easy to use and so easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Lindsay"}]