[{"rating": 5.0, "review": "Awesome! I bought it to replace my roku that died. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "CD4Eva"}, {"rating": 3.0, "review": "I have Chormecase which is basically useless to me. I travel and hoped I could use it in hotels. But no, it does not work with their WIFI systems for a connection. I have cable so why would this be of value? And does it change anything on the road. I just dont know", "verified": false, "helpfulness": "0/0", "author": "Robert B. Nowell Jr. \"casual observer\""}, {"rating": 5.0, "review": "I can join with the other reviewers in stating that the Fire TV Stick is simply well done!. The ONLY holdout that I initially had was the inability to provide mirroring from my LG G3, but after doing some additional reading I learned how to do it by using the Settings>Display & Sounds>Enable Display Mirroring. The step that I had missed was to click on Enable Display Mirroring, and then to activate Mirroring on the LG G3!I was also able to use the Second Screen function on my Kindle HD. I later learned after talking to Kindle Support that I could not use the Amazon Fire Remote app because the HD model did not provide a microphone. However I was able to use that same app on my LG 8.3 tablet very well.I truly enjoyed using NETFLIX on Fire TV Stick, and the experience was very smooth and fast when compared to using the Chromecast device.I am not much of a gamer, but I did check out the LIFE game, and it wasn't too bad.Of course the synchronization between using Amazon web site and the Fire TV stick was fast and flawless (I would have expected nothing less with Amazon).That is all I have to say after owning the Fire TV stick for a day. This device is a real keeper!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great, but the lack of an Ethernet port killed the deal for me.  The 4 stars is only for this one issue when compared to the Fire TV box.  Overall the wifi is very good, I just wanted to stream higher quality data than the wifi could handle.  This would not be an issue for streaming from internet sources, so it is great for the average user.", "verified": false, "helpfulness": "0/1", "author": "John C."}, {"rating": 3.0, "review": "Roku is a much better way to go.the fire stick is Hard to navigate and not as many apps as roku. All in all very disappointed", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 3.0, "review": "Worked great the 1st time and i would have rated it a 5. But, the next time i went to use it, it was acting super erratic, Very Slow, and kept having problems connecting to my internet. I pulled it out of the HDMI connection several times and that didn't help. Eventually, i unplugged it from the wall socket. When i plugged it back in it worked fine. So,.......?", "verified": true, "helpfulness": "0/0", "author": "Nic D"}, {"rating": 1.0, "review": "I have a Roku at home and the FireStick at home. Originally when I got the FireStick I gave it 4 stars.  However, it has proved to be a bust.  It's six weeks old and now it can't stay connected to a wireless router that is all of two feet away.  So there is no way to use it.Advantages of Firestick: it is easier to set up than Roku.  Good interface with Amazon primeAdvantages of Roku: More channels, reliability (they last and work for a LONG time and never lose connection)One flaw - a stick needing external power means an extra wire, and the extender cable included is too short for TVs with all the hi-def connections on the back - it's fine with monitors that have a place to plug near the side.Minor problem even on day one - if the internet connection is broken, you need to reboot the FS.  It doesn't want to retry the connection otherwise.  This became a MAJOR problem.  Now with multiple nearby wi-fi's it can't connect to any of them.", "verified": true, "helpfulness": "0/0", "author": "LegalEagle"}, {"rating": 5.0, "review": "I am incredibly happy with this thing. It was super cheap under the Prime membership, and I would gladly pay double the price for it. I cant believe it includes the remote also. I test drove it with Netflix and Amazon prime and all work great and are lag free. If you got lag, blame your ISP or your router, because the FireStick always works great.On top of all it's goodness, the FireStick also allows you to side-load Android apps. That feature alone makes it much better than any competition.I am sold on this thing, and I certainly recommend it to anyone who needs a device such as this.", "verified": true, "helpfulness": "0/0", "author": "NEET"}, {"rating": 5.0, "review": "Love the fire TV stick.  We went with the voice remote which makes it a lot easier to maneuver to shows.", "verified": true, "helpfulness": "0/0", "author": "SafetyWiz"}, {"rating": 5.0, "review": "If you're on the fence with getting Prime, this little thing will push you over a the edge. Excellent streaming stick!", "verified": true, "helpfulness": "0/0", "author": "R. Jung"}]