[{"rating": 5.0, "review": "Nice selection of Prime movies available. Much better interface than on our BluRay player.", "verified": true, "helpfulness": "0/0", "author": "Richard Fitzgibbon"}, {"rating": 5.0, "review": "Love love it. One of best things every!!!", "verified": true, "helpfulness": "0/0", "author": "Roslyn Muldrew"}, {"rating": 5.0, "review": "It was simple to install and works just as described.  My biggest regret is that I didn't purchase it years ago.", "verified": true, "helpfulness": "0/0", "author": "Dr. Ruth Daumer"}, {"rating": 5.0, "review": "I love my Fire TV Stick, I also have Roku3 which cost me around $100 ,Fire Stick cost around $35 with almost the same features so what's not to love?.", "verified": true, "helpfulness": "0/0", "author": "Boyd Myers"}, {"rating": 5.0, "review": "I love it...all I needed and more!!!", "verified": true, "helpfulness": "0/0", "author": "Carissa Stewart"}, {"rating": 5.0, "review": "I am so happy with my Fire Stick! It was so easy to install and I was streaming instantly.  I love that Amazon has some of the old black and white classics!  I watch every day!", "verified": true, "helpfulness": "0/0", "author": "Millie"}, {"rating": 4.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Alice T."}, {"rating": 4.0, "review": "It works about as well as expected.", "verified": true, "helpfulness": "0/0", "author": "Jerry L Clark"}, {"rating": 5.0, "review": "This has the most stable wifi signal out of all the viewing devices I've used.", "verified": true, "helpfulness": "0/0", "author": "Ella A."}, {"rating": 4.0, "review": "I was able to side-load Kodi media center and use it to access my videos and music shares from my server.Since the amazon fire tv box has a usb port  I had wanted to use it instead (it's even more expensive than the stick) so I could plug an external hard disk in that would contain my media files.  According to the internet this no longer works after a certain firmware revision and it appears the new ones have the newer firmware.The fire tv stick works fine - I just would have preferred the more expensive set-top fire tv.  I think it was a bad decision if they really did remove external drive support.  I was told it was of concerns of recording rented shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]