[{"rating": 5.0, "review": "I bought this for my mom and she LOVES it!!  Makes watching TV so much easier!", "verified": true, "helpfulness": "0/0", "author": "Janeen E. Redman"}, {"rating": 5.0, "review": "Amazing, inexpensive, easy to use product! I don't have time to mess with electronics. I have a phone and a Kindle and my two girls have a Kindle. They always wanted to watch shows that we have bought on our Kindle on our big living room tv.. And this little fire stick does that!! So easy just plug it in and then plug it in to your TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "Laura Willis-floyd"}, {"rating": 5.0, "review": "It's great. I bought two sticks and one amazon tv", "verified": true, "helpfulness": "0/0", "author": "Helga Schmidt"}, {"rating": 1.0, "review": "Bad product, remote wasn't working on a couple of them.  The one that did, needed a software update but would not take it.  Junk!", "verified": true, "helpfulness": "0/0", "author": "gus"}, {"rating": 5.0, "review": "I highly recommend the Fire TV stick to anyone looking to leave their subscription tv service.  I was previously paying about $170 for basic satellite tv and internet and ditched them as soon as my contract was up.  (I actually tried to do so earlier, but quickly found out that there isn't a way out of the contract cancellation fee)  Anyhow, when I left satellite behind for a $40 cable internet plan, I knew I'd need some alternative for the kids other than dvds, as I'm about to have twins and will need to entertain the big brothers while I care for newborns. I almost bought a Roku box, but then a friend suggested the streaming stick.  I am glad I went with the fire stick, since it comes automatically with the remote, while others are sold separately.  The streaming stick also costs much less than the box and does not need to take up any space in our media center.Now we can watch Netflix, Prime, and Hulu and I am paying less than half of what I was before for entertainment.  I can rent movies from Prime without leaving the house, have endless Curious George with no commercials, and watch current tv shows on hulu for so much cheaper.  To top it off, now that the boys are done with naps, we now have \"quiet time\" after lunch where we sit down and watch nature shows.  Our family is loving it!Note:  if you press a button on the remote and it acts \"stuck\" and goes out of control, then that means you need to replace the battery in it.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Bloomer"}, {"rating": 3.0, "review": "I think the way the Fire stick is advertised is misleading.  The cover of the box displays all these choice channels.  But the thing is you have to buy most of them.  The app is free, but to get the service there's a monthly charge.  I'm thinking of returning it.  I might as well get cable tv back...cheaper. Boo!!!!", "verified": true, "helpfulness": "0/0", "author": "Gman"}, {"rating": 5.0, "review": "Excellent product. So simple to install", "verified": true, "helpfulness": "0/0", "author": "Rhonda Sher"}, {"rating": 5.0, "review": "Once one can open the remote to insert batteries (not easy), this is an excellent device. The quality of Amazon Prime movie choices, even on my not-that-fast internet connection is superb. Feels almost like 3-D (it isn't). It is so much better than what I've seen via Chromecast, although I haven't compared Apples to Apples (grin) yet.... I'm impressed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Kodi is the bomb!", "verified": true, "helpfulness": "0/0", "author": "Shawn Kinner"}, {"rating": 3.0, "review": "Product is a great idea.  But I have trouble connecting to it when I sign on.  I switched it to my mom wifi network and still have trouble.  It's great when it's working.", "verified": true, "helpfulness": "0/0", "author": "CJ"}]