[{"rating": 5.0, "review": "Love it, picks up the wifi perfectly (we have trouble with other devices, but not this)", "verified": true, "helpfulness": "0/0", "author": "Sandra E Wesolowski"}, {"rating": 5.0, "review": "Works great, no issues and very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Donna R"}, {"rating": 5.0, "review": "We love Fire Stick.  It was super easy to set up and to navigate and I like all the apps and options available.  Can't wait to see what else is added.", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Gary Paraschak"}, {"rating": 4.0, "review": "Just now learning to use so far pretty good. One mistake, I have Netflix but not knowing I ordered a movie and was charged. Did not realize I needed to be on  logged into Netflix to get it free. Was charged. Learn by our mistakes.", "verified": true, "helpfulness": "0/0", "author": "Theresa O'Donnell"}, {"rating": 5.0, "review": "This little dynamo has changed my TV watching forever!", "verified": true, "helpfulness": "0/0", "author": "T. Munro"}, {"rating": 5.0, "review": "This is a terrific item.  Best thing that Amazon has come out with, now I don't have to rent movies anymore.", "verified": true, "helpfulness": "0/0", "author": "marie martin"}, {"rating": 5.0, "review": "I have been using the fire tv stick for about a week now. Installation was easy. Love the simplicity of the remote. I am new to streaming, so I recently subscribed to Netflix (had a dvd subscription 8 yrs ago), Hulu Plus, and of course Amazon Prime (which I haven't seen much use for yet). Since I got the Fire Stick, I haven't watched 'regular' tv. It is always in sync, although I experienced buffering 2/3x (internet speed 50mps). I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "rachel griffith"}, {"rating": 5.0, "review": "Ease of use and great content right out of the box. Love the voice search.", "verified": true, "helpfulness": "0/0", "author": "Troy Calton"}, {"rating": 5.0, "review": "So easy to set up. Love it and enjoying streaming.", "verified": true, "helpfulness": "0/0", "author": "jmkv"}]