[{"rating": 5.0, "review": "Great Product,it works better than the Google Chrome, the only problem is that I live in Mexico and due to geographical restrictions I cannot watch Amazon Prime Video :(", "verified": true, "helpfulness": "0/0", "author": "Erick Mendez"}, {"rating": 5.0, "review": "The picture quality is impressive.", "verified": true, "helpfulness": "0/0", "author": "Ashley Sullivan"}, {"rating": 5.0, "review": "Easy to use. The only downside is the remote doesn't light up and you can't see the buttons in a dark room. Otherwise it performs as advertised.", "verified": true, "helpfulness": "0/0", "author": "She"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "HeyThurEvryBudy"}, {"rating": 1.0, "review": "Slow I got fast internet thru out my house this stick just wouldn't get it right slow", "verified": false, "helpfulness": "0/0", "author": "taina lovatos"}, {"rating": 3.0, "review": "Good but slow and sometimes loses the network", "verified": true, "helpfulness": "0/0", "author": "Anna Luzania"}, {"rating": 5.0, "review": "Awsum", "verified": true, "helpfulness": "0/0", "author": "G. Bringas \"stormshadow\""}, {"rating": 3.0, "review": "I absolutely love the number of apps you can use with the Fire Stick. Amazon Instant Video, Netflix, YouTube, HBO, no problem! I bought this to use in tandem with an Apple TV, so I would have access to Amazon Instant Video. It certainly allows me to do that, but as much as it pains me to say (I'm not an Apple fan), the usability and interface are abysmal when compared to the ATV. The menus are poorly organized, it constantly hangs, and will frequently lose Wifi connection when coming out of hibernation, and seems to have a difficult time maintaining an HD stream without buffering.The slow response time and frequently needing to be restarted (through the System menu) means this is probably best used as a portable solution in hotels or when visiting a friend. It's incredibly frustrating to use this on a daily basis.", "verified": true, "helpfulness": "0/0", "author": "Phil R."}, {"rating": 5.0, "review": "Works great.. I am having a problem mirowing to my Kindle or my iPhone.", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 4.0, "review": "love the idea of not having to have and pay for cable tv or satellite but Prime is not organized very well and choices for news are slim. movies are not too great either. Unless you want to pay additional charges. In the long run then your better off just paying for cable tv. maybe Amizon will get better at it as time goes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]