[{"rating": 3.0, "review": "When it is working, the Fire TV Stick is awesome (fast connection, unobtrusive) - however consistency is it's downfall. Some days it works like a charm, other days it turns off the TV automatically, or requires restarting it to access certain applications (like SlingTV). These issues seem to be random - same WiFi connection, some hardware, etc", "verified": true, "helpfulness": "0/0", "author": "A. Fortner"}, {"rating": 5.0, "review": "Very smooth, enjoyable", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Have 2 of them and they work GREAT!! Very happy, exceeded expectations and would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Bought mostly to extend get my Plex on TV. Unfortunately Fire TV stick is not compatible with DTS or 5.1 pass-through HDMI. Aside from this issue great overall solution, especially for prime users with movies and music access.", "verified": true, "helpfulness": "0/0", "author": "Howdoin"}, {"rating": 4.0, "review": "The streaming is smooth and seamless. The remote navigation takes some getting used to.", "verified": true, "helpfulness": "0/0", "author": "Tony Orum"}, {"rating": 4.0, "review": "my android phone can not find this device using the fire stick app", "verified": true, "helpfulness": "0/0", "author": "pumma \"Pumma\""}, {"rating": 5.0, "review": "Perfect little gadget to be able to watch movies and listen to music.", "verified": true, "helpfulness": "0/0", "author": "Bradley S."}, {"rating": 5.0, "review": "This is amazing I hooked it up in literally 2 min and it's so awesome!!! Netflix pandora games my pictures it's just amazing and for 40$ this is a steal!!!!!", "verified": true, "helpfulness": "0/0", "author": "Rebecca Rodriguez"}, {"rating": 5.0, "review": "So easy to use and install.  This is very user friendly and much more reliable than my smart tv function.  I love the fire stick for its compact size and ability to travel to multiple tv's and locations.  I will definitely be using this for a long time!", "verified": true, "helpfulness": "0/0", "author": "Erin Goelitz"}, {"rating": 4.0, "review": "Setup a little difficult. Documentation slight. Sometimes fails to recover from download delays, requiring power cycle to recover.", "verified": true, "helpfulness": "1/1", "author": "Shirley Alley"}]