[{"rating": 4.0, "review": "We now own two and love the ease of use. Amazon Prime is the best source for streaming films.", "verified": true, "helpfulness": "0/0", "author": "Druce Reiley"}, {"rating": 5.0, "review": "Works well - It picked several Wi-Fi's networks in the neighborhood. My WiFi unit is in the bedroom away from the TV but setup showed excellent signal strength for it. Some of the other reviews said they had trouble with strength but I didn't. Crashed once right after set up but I un-plugged the fire stick from the TV and power supply and re-installed and so far so good. My \"smart\" Sony TV would no longer receive YouTube due to a Google change and thought I'd try the stick rather than buy a new TV. Now I can still receive YouTube. Remote is a little hard to work - kinda' small - but not a real problem.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "Great product, best streaming device and very cheap.", "verified": true, "helpfulness": "0/0", "author": "Aladdiyn Hardy"}, {"rating": 5.0, "review": "Was well worth the purchase. Who needs cable, NOT I.", "verified": true, "helpfulness": "0/0", "author": "Toni \"Toni Clark\""}, {"rating": 4.0, "review": "I love it. I just can't figure out how to get my photo's, or more specifically the folders, to jive with what I have in the cloud.", "verified": true, "helpfulness": "0/0", "author": "Brian Harmes \"fred\""}, {"rating": 2.0, "review": "since switching to UVERSE nothing but problems connecting.", "verified": true, "helpfulness": "0/0", "author": "gramps"}, {"rating": 4.0, "review": "Works well.  easy to install.", "verified": true, "helpfulness": "0/0", "author": "Lenord McGownd"}, {"rating": 5.0, "review": "Very pleased...Fire TV Stick exceeded our expectations", "verified": true, "helpfulness": "0/0", "author": "Bud Miller"}, {"rating": 1.0, "review": "A big flop.  Got it so I could use the Miracast feature with an Android tablet. Worthless. Guess if it's not an Amazon Kindle Fire or a Fire Phone it's a coin flip if it will work. Called heads and came up tails.", "verified": true, "helpfulness": "0/0", "author": "David Bertz"}, {"rating": 5.0, "review": "I love it! I'm also glad it let's your smartphone be a remote control in case you cannot find its original one. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "ffces153"}]