[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "BC"}, {"rating": 5.0, "review": "Nice... :)I don't own a competitors version so I can't say anything about that but comparing specs to specs, this WAS the better choice.", "verified": true, "helpfulness": "0/0", "author": "Edward Moreno"}, {"rating": 5.0, "review": "Everything loads so fast I love it.", "verified": true, "helpfulness": "0/0", "author": "anthony henson"}, {"rating": 4.0, "review": "So much faster than my Chromecast. Wish it had HBO go app", "verified": true, "helpfulness": "0/0", "author": "Michael C Pope \"Michael C Pope\""}, {"rating": 1.0, "review": "Severely disappointed with this transaction!  Fire Stick never worked properly and Amazon insisted I follow a silly protocol to determine whether the device was defective or whether it was user error - the protocol seemed to suggest that despite the product's extreme ease in setup that it was my intelligence rather than a porous quality control system at fault.  The Fire Stick I purchased was not able to hold an internet connect - the setup itself took 1 minute - but the device was never able to successfully stream a movie without buffering delays and repeated error messages to check my network connection.  I have an Amazon Fire Box that works perfectly as well as many other streaming devices (Google Cast, iPad, computer, etc.) and all stream content perfectly.  I asked Amazon to replace the product but gave up after many unsuccessful attempts to replace.  I asked for a refund and that was processed immediately.  I am puzzled why it's easier to get my money back than to get the Fire Stick.I want to emphasize that I am a HUGE fan and regular shopper at  Amazon and have been since they launched, and have always been impressed with their range of products, ease of shipping and innovation (active user and  happy customer of Amazon prime).  BUT, it seems that Amazon would rather launch a faulty product quickly than correctly.", "verified": true, "helpfulness": "2/2", "author": "Brooklyn KR"}, {"rating": 4.0, "review": "Pretty damn good.", "verified": true, "helpfulness": "0/0", "author": "Roger Pink"}, {"rating": 4.0, "review": "I have several TV media systems and this one matches up to all of them in terms of quality and ease of use.  It obviously installs easy as you just plug it into your TV's HDMI port.  I also recommend using the external power connection as Amazon does because it really does make a difference in performance of the stick.  Setup was a breeze and since I ordered it through my prime account, it was already linked to that and I didn't have to fill out everything which was a nice surprise.Overall, the functionality is good, obviously, Amazon focuses on prime videos etc but its easy to use Netflix, Hulu, etc.  The only reason I gave it 4 stars instead of 5 is that HBOGo isn't available yet but several news articles online have started its coming soon.  I am also excited that the new Dish SlingTV option will be available on here since I've cut the cable/satellite cord a long time ago and don't get those stations.For the price of this unit, I would definitely recommend it, if you have a kindle fire or fire phone, its great with that too so don't hesitate to buy.", "verified": true, "helpfulness": "0/0", "author": "Safety Guy"}, {"rating": 4.0, "review": "Great product! Easy to use and works great!", "verified": true, "helpfulness": "0/0", "author": "nu_runr@hotmail.com"}, {"rating": 4.0, "review": "husband really likes remote. Easily guide way through all program. Worth the money", "verified": true, "helpfulness": "0/0", "author": "Georgene Billy"}, {"rating": 5.0, "review": "Bought it on sale when it was $19.99 for Prime members. Thought it would great to have in my dorm at college. Received the package while on Christmas break & I have used it everyday since! Turns any TV into a \"smart\" TV. Worth the every penny!", "verified": true, "helpfulness": "0/0", "author": "Alex King"}]