[{"rating": 5.0, "review": "easy to setup", "verified": true, "helpfulness": "0/0", "author": "BJM63"}, {"rating": 5.0, "review": "Really great. Love it. So easy to use. Can't wait for more shows to be added", "verified": true, "helpfulness": "0/0", "author": "Shazz"}, {"rating": 5.0, "review": "Awesome device...just plug and play", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 2.0, "review": "Initially it ran well, now if i could compare it to something, it runs like a cell phone streaming on a 3g network. Im disappointed because it would be a perfect product but due to its sluggish performance I feel like I just wasted 40 bucks on a useless memory stick.", "verified": true, "helpfulness": "1/1", "author": "Jordan Parchment"}, {"rating": 4.0, "review": "Very easy to navigate and install.  The HD quality is good but even with high speed fios cable it still buffers.  I have to turn off everything connected to my wifi top stop buffering.  Besides that,  it's awesome!  Also, just so that everyone knows,  you need it to be plugged into a wall outlet as you watch tv.", "verified": true, "helpfulness": "0/0", "author": "Hector R"}, {"rating": 4.0, "review": "Pretty neat. Not as smooth for mirroring the apple devices, applet tv is better there.", "verified": true, "helpfulness": "0/0", "author": "bikash singh"}, {"rating": 5.0, "review": "No more $220 cable bill!!!", "verified": true, "helpfulness": "0/0", "author": "James Landano"}, {"rating": 5.0, "review": "My boyfriend told me about this fire stick so I brought it to watch Netflix on my tv and it's amazing.", "verified": true, "helpfulness": "0/0", "author": "Daymaris McMillan"}, {"rating": 4.0, "review": "By it's self its OK, but you need the Kodi app to really take advantage of it.  Can't watch sports without the sports devil app.  And we've needed to do maintenance periodically so it doesn't get full too fast.  You just need to clear out the cache probably everyday, but otherwise it's good.", "verified": true, "helpfulness": "0/0", "author": "V. Beaton \"lukenkatiesmom\""}, {"rating": 5.0, "review": "I love it. Travel alot and works great in hotel rooms.", "verified": true, "helpfulness": "0/0", "author": "Clay Prentice"}]