[{"rating": 3.0, "review": "It works well and looks nice, but a little buggy.  the most noticeable is.  when you are  looking through the apps.  some of the images are slow to come up. not a big selection of apps yet, but hopefully that will grow.  there is no SiriusXM. or HBO go.  I watched a movie and no issues with that.  also, you can purchase apps and movies easy like on computer, do not need to put in special codes like the blue ray player amazon apps.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I absolutely love the Fire TV Stick and the product itself receives 5 stars but there are a couple of issues that could be improved upon:There is no off button so I wasn't sure how to end a session on the Stick. I checked Amazon.com/devicesupport and found out that it is not necessary to unplug the device - you simply turn off your TV or change your (HDMI) channel. It would have been helpful to add this on the leaflet included with the Fire Stick.Also one cannot automatically listen to Amazon \"radio\". It's probably easy to do but I have not yet taken the time to find out how it is done. Seems to me it should have been included automatically. There's probably a good reason it's not - i.e. uses too many gigs or something.Would I buy it again? Yes, definitely. The first Stick was a great deal at the Prime introductory price but it is still worth the full $39 +/- price.***This is a footnote made almost two months after I bought my Stick. I've had a couple of months to use my Fire TV Stick and I still love this product. I particularly love to listen to my music through the Stick because I have a Bose sound system connected to my TV. The sound is phenomenal with lots of music choices in my cloud. It's helpful to create your own playlists in advance. I still haven't discovered a way to listen to Amazon radio (is someone knows, I'd love to hear back) but there are other alternatives, almost as good.", "verified": true, "helpfulness": "1/1", "author": "GranMajesty"}, {"rating": 5.0, "review": "I love this. I finally have learned that I do not have to be a technology genius to operate new technology.Reasons I bought this:-I took advantage of the $19 sale-I may get a second TV and didn't want to have to pay cable for a second box-I have Amazon Prime and have not yet taken advantage of all the free movies and TV available to me-I may want to cancel cable to save of the high fees, and this was a great way to get my feet wet in the world of streamingI am hesitant to try out new technology. Maybe I am lazy, maybe I am just stuck in my ways (I am not even middle aged). But I gave this a try.It is very simple to set up.It is very simple to switch from TV to Fire Stick. BONUS - I can rewind the show that was on the channel I had been watching before because this doesn't interfere with my cable prgramming.This is the easiest thing I have ever tried to use. I have little to compare it to, but for a starter product I recommend this. I may gift this to my mother and buy the $99 setup for myself if we get a second TV because it has more memory.Bottom line - if you have never tried anything that allows you to stream movies or TV, this is a great product to try, especially if you are a Prime member. You can load Netflix, hulu, etc. without issue. I haven't had to, because I am watching what I have available on Prime first.Only problem I have is the picture is a little darker than my TV actually is, but I may just have to play with thie settings (and my window coverings).", "verified": true, "helpfulness": "0/0", "author": "D. Indiviglio \"Book Lover\""}, {"rating": 5.0, "review": "I love it when works.  Well, when, I turn on the TV,  AMAZON Firestick doesn't always comes on. At times, I have to unplug the fire stick and remove power to it and reset. Other than this inconvenience, the products work really well. Ease of use. Love the remote.  On one of my TVs the vidoe wasn't syncing and I had to manually set the VIDEO sync to manual from auto. There are tons of apps and  contents to enjoy.  (  I used chromecast in the past )", "verified": true, "helpfulness": "0/0", "author": "nathan paki \"Smkymntnhiker\""}, {"rating": 5.0, "review": "I was using an Apple Tv, and planned to give this as a gift, but decided to try it first.  Well, I guess I will be giving away the Apple Tv instead, this Item has so much more to offer than the Apple.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Elisa Rodriguez \"elisa rodriguez\""}, {"rating": 1.0, "review": "Another botched launch.  Nintendo got roasted for sending out a new console that needed patching, somehow this stick didn't make the news.I got the $20 deal, so I'll probably keep one.  My mother is sending hers back since it requires *MY* Amazon prime account to get the 'free' streaming, so she'll have to go to the living room to use it.  The UI is very unintuitive; as far as I can tell, there is no way to do a search AND filter out the non-'free' content.  Recommendations were all weird; considering how many DVDs and Blu-Rays I bought from Amazon over the years, you'd think they'd be in tune to my likes and dislikes.I also see no way to have profiles, so I'm certain I'm going to get five thousand recommendations for cartoons after my child is using it. When I tried to set up parental protections, it says my passcode was wrong; no way to reset it on the device.Video quality was okay; at first I thought it was terrible, then I realized that they were playing at a lower resolution until it buffered, honestly, I'd prefer to wait until it's clear.I may revisit this if Amazon ever is able to work a content deal with the movie houses similar to auto-rip.  Right now, it seems like it's geared towards selling stuff.", "verified": true, "helpfulness": "0/1", "author": "Ernie \"Ernie\""}, {"rating": 4.0, "review": "Follow-up: Amazon contacted me following my review and resolved some software issues that my firestick has. Occasionally still has issues, but they are resolved with a restart. Good product, good price, great customer service. Looking forward to future software updates to improve product.Have had issues with it connecting to the Internet, issues with the apps. Software seems glitchy, the issues go away temporarily once reset. Issues mainly come up when streaming Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kristine"}, {"rating": 5.0, "review": "I am impressed. Easy set-up and faultless operation. This makes the Amazon app on my TV look bad.", "verified": true, "helpfulness": "0/0", "author": "Fjr Traveler \"medio_mike\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Robert Zarinelli"}, {"rating": 3.0, "review": "Pretty fast and a lot of content, not to keen about the whole idea of being auto registered to my Amazon account. I do want to buy Prime, I have had accident by other users who have at multiple time registered me for Prime because they want to watch the content, I have been charged twice and am having to go and cancel the order several times. I use Netflix and that what I am sticking with, other then that the product is great. One more thing upgrading for Chromecast, it not very plug and play with apps on my phone, I am keeping having to use the remote which I totally hate to do (using the phone to play content is just more convenient as the phone is at you're finger tips all the time, or it's just me)!!", "verified": true, "helpfulness": "0/1", "author": "PabloPicasso"}]