[{"rating": 5.0, "review": "I am officially addicted to this little stick. I was able to get it when it was on sale for $19 and it's the best $19 dollars I have ever spent. I can stream my Prime Instant Videos, Amazon digital movies I have purchased, Twitch, and Netflix. You can listen to the music you purchased on Amazon and some of the songs even have lyrics if you want to sing along or do karaoke. There are a lot of fun apps you can download and the video quality is great.The remote works quickly and doesn't take up a lot of space. I recommend downloading the smartphone app which allows for voice searching. The app makes searching easier than trying to click through each letter. The stick also comes with an extension if your TV's HDMI ports are in hard to reach spots.I read the HBO GO app will be available soon which makes this stick even better.The only bad thing about the Fire TV Stick is that if your ISP has a cap on your internet usage you might go over it because you'll want to use this all the time.", "verified": true, "helpfulness": "0/0", "author": "Addicted Shopper"}, {"rating": 5.0, "review": "I love it!!  It is so nice to have alternatives.  I had a neighbor help install it only because I couldn't reach the back of my mounted TV.  He had no problem and I love my choices.  It is definately worth the price.", "verified": true, "helpfulness": "0/0", "author": "JM Grammy"}, {"rating": 2.0, "review": "States that it is Miracast certified, however seems it is not.  None of my laptops, which are Miracast certified are able to connect.  I have since learned, that Amazon has consciously omitted support for MS Windows devices.  (very disappointing as this was my primary reason to buy this device)Otherwise, for $20, it has worked well to date.UPDATE: Since buying the Fire Stick TV, they have now included \"Windows 8.1 compatibility coming soon\".  (how annoying)", "verified": true, "helpfulness": "0/0", "author": "Johnzot"}, {"rating": 1.0, "review": "1st time I plugged it in it worked great. Then after a few days it froze up completely. Totally didn't respond to the remote. I finally unplugged it to see if it would reboot when I plugged it back in. It won't work and won't hook up to my wireless. I have many devices on wireless and it has a strong signal and all the rest work fine. The fire tv stick just won't connect. For me a waste of money and I will stick with Roku 3 which always works great.", "verified": true, "helpfulness": "2/2", "author": "Harley R. Miller Jr."}, {"rating": 2.0, "review": "Chromecast is so much better", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For 20 bucks it was a a great value along with my 49 dollars amazon student yearly suscription to amazon prime.  The graphics interface is ultra smooth and responsive.  The movie starts instantly once selected.  Awesome hardware inside a little device.", "verified": true, "helpfulness": "1/1", "author": "Jimmy Pong"}, {"rating": 3.0, "review": "I was confused between chrome cast and Fire TV stick. So I bought both.Why I needed this stick? - Because I wanted to share content from my mobile/pc to TV and I want to play content from youtube and other sitesFire TV1. Setup took a long time as it downloaded the new software2. No proper instruction on how to share content (local content) from mobile to TV.3. It has inbuilt games which can be played4. No proper instruction on how to share content (local content) from laptop to TV. Plex can do it.Chrome Cast1. Setup was easy2. Needed to download 3rd party software for sharing content (local content) from mobile to TV.3. No games4. No proper instruction on how to share content (local content) from laptop to TV. You can do who screen casting. But it is slow.Common1. Both the device can do casting from youtube2. Both the device doesnt have in house application to share content from mobile/PC to TVVerdict: I preferred fire tv stick as it has no mobile or external device dependency for playing content in TV.", "verified": true, "helpfulness": "1/1", "author": "Bhellsun"}, {"rating": 5.0, "review": "this works better than I thought it would...great product", "verified": true, "helpfulness": "0/0", "author": "Peter D. Kingsolver"}, {"rating": 3.0, "review": "After hours of testing I've found out the remote for the FireTv Stick messes with my Vizio E390i-B0 39\" TV. Once it happens once it just continues until I removed the batteries & let it set for awhile. I can use the remote for a short amount of time before it start messing with my Vizio tv & trying to turn it off. I used the Android remote app & that works fine for hours, but once I try the supplied remote it's nothing but problems. Very disappointing because the main reason I got it was for the physical remote so family members wouldn't have to mess around with a smartphone.", "verified": true, "helpfulness": "3/3", "author": "Bryce Thomas"}, {"rating": 3.0, "review": "I thought it would blow my Chromecast out of the water but no it did not. Unable to connect to the tablet or phone for slinging videos.", "verified": true, "helpfulness": "0/0", "author": "Patrick Gadde"}]