[{"rating": 2.0, "review": "New Fire TV Stick just got it yesterday. Was working fine but now getting a error while watching any video. Error says \"HDCP unauthorized. Content Disabled\". There is something very wrong with the product. Just noticed similar complaints. Check link : http://www.amazon.com/gp/help/customer/forums/ref=cs_hc_g_tv?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdThread;=Tx1A10FFQXCSZ2M", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 1.0, "review": "My original Nintendo Wii from 2005 has better WiFi functionality than this thing. I'm serious. Like, the Wii is right next to my Fire Stick and streams Netflix without a hiccup and this thing hangs at 25% buffering half the time. Pretty sad. I just want HD streaming. I constantly see 'Connected with Problems' under my network settings even though the device regards the signal strength as 'Very Good'.UPDATE 3/14/15: I took another reviewer's advice and have placed the Fire TV Stick in a static free bag and performance is greatly improved. I'm not increasing my rating, however, because I shouldn't need to do this in the first place.", "verified": true, "helpfulness": "1/2", "author": "Kristopher Wainscott"}, {"rating": 4.0, "review": "Great features for the low price. It has more features than an Apple TV, but Apple TV has a smoother feel and fast internet connection. The Fire TV stick has a lot of lag with video. I'm on a 60 mbps connection and the Apple TV never buffers, but the Fire TV does. I eventually switch back to the Apple TV because the low res buffering is too much.", "verified": true, "helpfulness": "0/0", "author": "Dillon Hafer"}, {"rating": 5.0, "review": "Works great with my TV and wireless router. The installation was simple and quick. I would buy this item again.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "I have only had the fire tv stick for a few hours and it works flawlessly!  Very fast response time, good remote, although if I were to purchase another Fire TV I'd go with the box as it has a better feel to the remote and you can do a voice search on it and you can't on the stick.  Other than that it works great, fast, easy to install, and maneuver around in and I really like that I can upload family photos (unlimited) and Videos to amazon and view them on my Fire TV.  I also like that I can use the Prime music library with it.  I could do the photo's (not video) with Picasa and the Roku but it wasn't as fast loading the pictures over the wifi.  I'm not a game player but I'm sure my grandkids will like being able to play games when they are here, just need to get the controller thingy for it.Yes, I'm trading my loyalty from Roku to Fire TV, sorry Roku.  I've loved my Roku's but the Fire TV is so much better.", "verified": true, "helpfulness": "2/2", "author": "Mema \"Wife, Mother, Mema, Sister\""}, {"rating": 5.0, "review": "I started my streaming experience with the short-lived Logitech Revue (a Google TV device). I really liked the interface and functionality but it was a pain to setup and I found I had to reboot it quite often (it's now connected to the kids TV in the basement and they like it). Then I got a Roku streaming stick which I also like - nice interface and works well so no complaints. Finally got the Fire TV Stick and love it - it was super easy to setup, it has a very nicely designed remote control and interface, a decent selection of app's and obviously works brilliantly with Amazon services (instant video, prime music, prime photos, etc).", "verified": true, "helpfulness": "0/0", "author": "Gareth"}, {"rating": 1.0, "review": "Please make a app with a very simple web page for business travelers to log into hotel WiFi. One star until Amazon can make something that should be a basic feature! I called tech support and they said you can get Wi-Fi from the HDMI port on the TV. Seriously? They have no clue!", "verified": true, "helpfulness": "12/16", "author": "Jonathan"}, {"rating": 1.0, "review": "I tried to order one, but I would have to almost 2 months to receive one. I think amazon should be prepared ahead of time before they sell their devices, 2 months is a long time to wait for a stick. my hopes to try a fire stick went up in flames because of unavailability.", "verified": false, "helpfulness": "1/9", "author": "security"}, {"rating": 1.0, "review": "Was incredibly excited to get this. As close to unusable as it gets. Will work for a moment and then it just stops responding. Then it'll process 100 remote clicks all at once, creating absolute chaos on the screen. A first generation Apple TV that is 7 years old runs better than this.", "verified": true, "helpfulness": "0/2", "author": "Shane Shirey"}, {"rating": 4.0, "review": "Quick and snappy controls, smooth playback, and no issues so far.  Beware of the unnecessarily long intro video to teach you all about the `new fangled' device, which you cannot skip or pause- I will be honest, the video detracted from the experience, and is the only fault that I have found, so far...", "verified": true, "helpfulness": "0/0", "author": "Sean Gokey"}]