[{"rating": 5.0, "review": "Working better than expected.", "verified": true, "helpfulness": "0/0", "author": "James Walker \"nathans bb\""}, {"rating": 5.0, "review": "Easy install / easy to operate", "verified": true, "helpfulness": "0/0", "author": "LesL"}, {"rating": 4.0, "review": "the WiFi remote is very fast and responsive. the processing power is less so.", "verified": true, "helpfulness": "0/0", "author": "Mitchell Tai"}, {"rating": 5.0, "review": "Excellent!!!!", "verified": true, "helpfulness": "0/0", "author": "Milton D."}, {"rating": 4.0, "review": "Fire TV Stick has been great for the most part.  Only issue has been with delays/intermittent pausing of videos.", "verified": true, "helpfulness": "0/0", "author": "Kyle Kilcherman"}, {"rating": 5.0, "review": "Great device!  Easy to set up,  easy to use and the Android Fire stick app works great with it as well. Definitely a great product!!", "verified": true, "helpfulness": "0/0", "author": "Peter J Mitros"}, {"rating": 5.0, "review": "Great device.. I also have the fire phone so it syncs everything from my phone except the apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it... but I got it for the $28 sale going on initially.  Wish I got more for that price.  if I was going to spend $50 for a new one.. I would just consider the bigger Fire TV.. with the better remote.All in all... great product.  Just wish more apps worked with it.  Time will tell I guess.  I was hoping the Slingblade app would let my DISH programing come to the TV, but sadly DISH is not supported.  They want you to get a Joey I guess.", "verified": true, "helpfulness": "0/0", "author": "Neofactor"}, {"rating": 1.0, "review": "It simply just does not work. We have a fire phone and watch prime video on it and it works flawlessly so I thought we should get the fire stick so we can watch prime video on our tv, If you can even get it to stay connected to your wifi the video constantly has to load and apps just simply stop loading for no reason. prime works fine over our wifi on our tablets, pc, and fire phone but fire stick is just a constant struggle to make it do anything.", "verified": true, "helpfulness": "1/1", "author": "Wendy N. Wells"}, {"rating": 5.0, "review": "$20, can't beat that for promotional pricing.  It does what xbox one or chromecast also does.  Wifi is excellent on it and its very simple to connect.  I would buy it again for another room.", "verified": true, "helpfulness": "0/0", "author": "Blaze"}]