[{"rating": 5.0, "review": "Extremely functional and easy to use.  Would recommend for anyone that uses netflix or amazon streaming video as it is much easier than other devices that are similar (also own a Google Chromecast and I prefer the Fire TV Stick for its functionality).", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "love the easy install it took one minute and my TV was ready to watch movies not to mention it was loaded with lots of free apps.", "verified": true, "helpfulness": "0/0", "author": "larry burnett"}, {"rating": 5.0, "review": "absolutely great", "verified": true, "helpfulness": "0/0", "author": "tracy d"}, {"rating": 1.0, "review": "It doesn't work outside US which wasn't clear from the description !!!", "verified": true, "helpfulness": "1/1", "author": "hazem"}, {"rating": 4.0, "review": "Didn't know how much I used the voice search on the Amazon TV. Would be nice to get it with that remote. Thats all I would change.", "verified": true, "helpfulness": "0/0", "author": "HVAC"}, {"rating": 4.0, "review": "I love the fire tv stick! It's great getting to watch netflix and youtube on my t.v.", "verified": true, "helpfulness": "0/0", "author": "Gregory R."}, {"rating": 5.0, "review": "We are enjoying the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I got this in the initial sale for $19.99 and it wasn't even worth that.I bought this to use instead of my Chromecast since amazon prime video isn't supported, but I just avoid Amazon Prime Instant Video most of the time so I don't have to deal with the terrible interface included with the Fire TV Stick. The most expensive, overpriced content is pushed to the top and put in your face and it's not easy to find shows you actually want to watch on Amazon Prime, much less across different services", "verified": true, "helpfulness": "0/0", "author": "J.E."}, {"rating": 5.0, "review": "I'm telling every one to switch  to the Fire stick. No more over paying Dish.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Carpenter"}, {"rating": 5.0, "review": "It's really good device!", "verified": false, "helpfulness": "0/0", "author": "bagain \"Slav\""}]