[{"rating": 5.0, "review": "Roku, Chrome Cast, AppleTV, a ton of others all do the same thing as this...so why buy the Fire Stick?You don’t live in the Apple iECO system, Roku brings nothing to the table, and Chrome is nice doesn’t have Amazon streaming (interesting Bezos)I own all of the above products and this came out and it was 50% off when preorder for Prime members, honestly at that price I couldn’t not buy it.There a lot of other reviews that will be more in-depth but I am brass tacks person and I know others are too, sooooooo....Pro -Apps (install what you want, avoid what you don’t)Speed (snappy menus and gui)Ease of Navigation (Its simple and Ui friendly)Connectivity is above average (no drops, good speed, easy to set up)Medium -The remote (its good, just not great)(phone app remote, better, but now I have 2?)Appearance (depending on where your HDMI’s are it can stick out past the TV as it does on mine)Cable (the included USB to Micro USB to supply power can been seen (see above ))Con –No HBO Go (yet…)Bottom line if you have Prime, and don’t live in the Apple world this is the ticket became it travels well, powered by USB (ps plug it back into a TVs usb port.)Its amazing, bottom line.", "verified": true, "helpfulness": "0/0", "author": "Wonky De Mateo"}, {"rating": 5.0, "review": "worked as advertised", "verified": true, "helpfulness": "0/0", "author": "Dee Dee Shullick"}, {"rating": 4.0, "review": "Everything is fine about the stick.However, there are still very few channels and apps compared to Roku and Chromecast, respectively.Moreover, the screen mirroring sometimes doesn't work with some android devices.Overall, it's good.", "verified": true, "helpfulness": "0/0", "author": "Siavashuul"}, {"rating": 5.0, "review": "love this more than chromecast , my daughter is crazy about that", "verified": true, "helpfulness": "0/0", "author": "eric mfomen"}, {"rating": 5.0, "review": "It's Great I love it", "verified": false, "helpfulness": "0/0", "author": "Richard Wiggins"}, {"rating": 4.0, "review": "Seems to keep dropping the wireless connection (only device in the house with that problem).  Otherwise seems to work OK", "verified": true, "helpfulness": "0/0", "author": "John T. Weigelt"}, {"rating": 4.0, "review": "Works great!  Only issue is it doesn't have a very fluid motion when streaming netflix, and it loses wifi connection sometimes.", "verified": true, "helpfulness": "0/0", "author": "n_charpy89"}, {"rating": 4.0, "review": "Overall I'm quite happy with the fire stick. My biggest complaint is that it doesn't support the CBS app. Since a large portion of what I watch is CBS, it's disappointing to have to watch those shows on my computer. Had I done a little digging before, I might have purchased a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "Britt I Nygaard"}, {"rating": 1.0, "review": "High expectations. Did follow instructions and tried it with a windows laptop, a windows tablet and an android tablet. All rather new. None of them allowed me to mirror my computers on the TV'", "verified": true, "helpfulness": "2/2", "author": "Max Winkeler"}, {"rating": 5.0, "review": "love this.....it should be good for traveling and keeping my amazon video's convenient.  Glad they included the extender cable as my tv needed it.", "verified": true, "helpfulness": "0/0", "author": "alldancergirl"}]