[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Restrictions about using this product outside USA are not specified in its presentation. Now I am stuck with a useless device while I am outside. I can not even use my HBO GO account or watch videos on youtube. Really disappointed because this restriction wasn't specified.", "verified": true, "helpfulness": "0/0", "author": "Edgar Garcia"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kim Hockensmith"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Yender"}, {"rating": 3.0, "review": "As I would like to LoVE it the way I love Apple TV, I feel like there are a couple of things I wish it had. It does not work with APPLE devices (AirPlay) unless you download a third party app that you might have to pay for. Sometimes streaming AirPlay  takes a long time to connect and by the time you connect, you're ready for bed. I assume the fire stick works well with Amazon products such as Apple TV with iPhones and iPads .Other than the AirPlay issue, everything works good. I wish they had the HBO now app and more Apps with better easier search functions when you are looking for apps.", "verified": true, "helpfulness": "0/0", "author": "latracy"}, {"rating": 1.0, "review": "very disappointing, I followed all the instructions, my WIFI is o and working fine, batteries in the remote, plugged into my HDTV with the extender cable and into the outlet, double checked everything a million times, but absolutely nothing happened! If there were not so many satisfied customers, I'd say it is a worthless piece of junk. As there is no phone customer support, I immediately returned it, won't even bother trying to replace. That is the problem with amazon and electronics, no phone customer support.", "verified": true, "helpfulness": "0/0", "author": "heidinyc7"}, {"rating": 5.0, "review": "This is probably the best product we have ever received! We got it as a housewarming gift, and have cancelled all cable and satellite services to use this. Amazing. HUGE fan!", "verified": true, "helpfulness": "0/0", "author": "Kristin"}, {"rating": 5.0, "review": "I love this thing!  There is always something to watch.  And it's simple to use- even my 6year old figured it out!  With Amazon Prime it's just perfect for us!", "verified": true, "helpfulness": "0/0", "author": "R. Ruskey"}, {"rating": 4.0, "review": "Only one thing is denying this product 5 Stars - it lacks NHL Game Center.Other than that, it is a marvelous device that we use quite often.  My only other gripe is that you can not combine music with the photos slideshow.Still, my two peeves are a simple operating system update away, and I have every expectation that Amazon will continue working to make this device the best in class.", "verified": true, "helpfulness": "0/0", "author": "Ed Mann \"Ed\""}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was a piece of cake to set up.  I already have a smart TV in the family room, so getting the TV stick for the bedroom was a no brained.  Great job Amazon.", "verified": true, "helpfulness": "0/0", "author": "luline"}]