[{"rating": 5.0, "review": "I love this device.", "verified": true, "helpfulness": "0/0", "author": "Rogerjon A. Blanco \"Rogerjon\""}, {"rating": 3.0, "review": "Setup was bumpy.Lots of restarts on failed update.Lots of updates.Operation of device is flawless.", "verified": true, "helpfulness": "0/0", "author": "John W."}, {"rating": 1.0, "review": "Lousy user interface. Associated Android app is primitive and hyper-reactive making it nearly useless. The device only seem to  work with the USB based wall power adapter which is included. Using the USB port on my Samsung TV did not work. The on-screen instructions during setup were confusing. The wording made it seem like using the provided power adapter was only recommended, when indeed it was required. I was ready to return the device thinking it was defective, but decided to use the power adapter as a last try when I was able to complete the setup.Oh, and the remote is nearly impossible to open to put the battery in!! Who approved the design of the remote? Just amazing!", "verified": true, "helpfulness": "3/5", "author": "Jay"}, {"rating": 5.0, "review": "Easy install, easy setup and I love the remote and Android application.  I was up and running in minutes.I don't think I'll miss the voice search of the Amazon Fire TV, but we'll see how that goes.  Picture quality is fantastic.", "verified": true, "helpfulness": "0/0", "author": "DJK"}, {"rating": 5.0, "review": "Yes, it takes a little getting used to how to use it , but, I have a Chrome stick, Sony player, blue-ray player, and Wii  which I have used for streaming and the picture quality with this is noticeably crisper and clearer and less buffering which I was getting even with my 50mbps connection.  I do wish it would work with Serviio for streaming videos from my PC but Plex gets the job done.", "verified": true, "helpfulness": "0/0", "author": "Timothy L Lyssy"}, {"rating": 5.0, "review": "My FireTV stick arrived earlier than advertised, and it's bumped my power-hungry PS3 for streaming duties.Installation was simple: My TV has a USB port (an LG 50PJ550, it claims the port is for service diagnostics only, but it works) so I didn't need to use the included adapter.  The power adapter itself is a nice bonus, it's Kindle Fire-compatible (standard USB micro B cable) so I got a free tablet charger out of the deal.  In setting up my wifi I found it supports 802.11ac, so my fancy new router is getting put to use.  Nice!As for apps, Amazon Instant Video / Prime content is given center stage, but Netflix/Hulu/etc. are all easily accessible.  I wouldn't shy away from this if you're not a Prime customer.  The Amazon Instant Video app is more usable than the PS3's, and the Netflix app is pretty much identical as well.Video looks good, I couldn't tell any difference to my PS3's output aside from a bit of jitter/lag for the first few seconds the first time I watch a series or movie.My only concern is that the remote feels a bit insubstantial - all of the weight is at the bottom, so it has a bit of a hollow feeling in your hand.  Not a huge concern, but worth mentioning. You can use your phone a la Chromecast if the remote isn't your thing.Also, Amazon has finally figured out product packaging.  It's really pretty, if that matters to you.", "verified": true, "helpfulness": "0/0", "author": "Gidget"}, {"rating": 5.0, "review": "AWESOME! Answer to my streaming needs. I have both an Apple TV and the Fire Stick. I love the Fire Stick because it streams Netflix, Hulu AND Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "TeacherT"}, {"rating": 5.0, "review": "Working out great as a streaming media player for the bedroom. All our main machines (xbox, ps3, wii) are in the living room with the BIG tv. We didn't want to move any of those to the bedroom but wanted a cheap and easy not to mention small solution for streaming to our non-smart LG tv in the bedroom. We wanted to it to stream Netflix AND Amazon so Chromecast was out. I've used Roku before and I thought their menu design was clunky.The Fire Stick is a breeze to set up, easy and intuitive to use and works perfectly. Plus, it's cheap! That's a lot of entertainment and value in such a small package!", "verified": true, "helpfulness": "0/0", "author": "Btrthnezr3"}, {"rating": 4.0, "review": "Pretty happy with it so far but I did have an issue the other day where it would not connect to any network. I had to power off the unit to restart it which was a pain. I don't think there's a reset option in settings.", "verified": true, "helpfulness": "0/0", "author": "Luis A. Larrea \"blu\""}, {"rating": 4.0, "review": "I don't like how easily it can charge your credit card, especially when \"Prime\" content is mixed with content you have to pay for.", "verified": true, "helpfulness": "0/0", "author": "ed"}]