[{"rating": 2.0, "review": "The fire stick is great at having access to many apps and prime, but it freezes for a second or two at a time. It also seems to have problems buffering, as usually watching shows there are second or two freezes then it catches up to itself. i have also had it lose all the information stored on the stick and had to re login to all my accounts. Im ready to switch back to my PS3.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 1.0, "review": "Terrible ! Just plugged mine in and was excited to get started with it... it takes literally forever to load ANYTHING.  I can barely get through the getting started video, it says the connection is strong as it should be being 1 foot away from the router. This must be detective?  Completely unusable", "verified": true, "helpfulness": "0/0", "author": "Kathryn"}, {"rating": 5.0, "review": "Love this thing. The wife and I use it in the bedroom to watch Netflix and occasionally Amazon Prime Video. I have a Chromecast and Roku Box - this is like have the best of both in one tiny stick.Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "Easy to set up, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Maureen Posner"}, {"rating": 5.0, "review": "Blows the Roku away in nearly every possible way.", "verified": true, "helpfulness": "0/0", "author": "Rusty Graves"}, {"rating": 5.0, "review": "Love it!! Super convenient and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "Really had doubts this would work but it DOES. I have high speed interned and connected to bedroom TV that has no cable connection. I get all my Amazon Prime and Netflix. Quality of movies/videos is great. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Lorilee"}, {"rating": 2.0, "review": "Disappointed. The Pandora app is constantly crashing/hanging. Youtube pairing doesn't work -- it just brings up the app and hangs. Unlike our older Roku, video streaming stutters often.", "verified": true, "helpfulness": "0/0", "author": "DS"}, {"rating": 2.0, "review": "it has netflix on it but it appears that the quantity of movies available is on the short side for example, I wanted to watch Morgan Freeman, Michael Douglas and Robert DeNiro in \"Last Vegas\" and it is not available, also no You Tube, it basically an apparatus for Amazon to try to sell you movies for $12.99 each.", "verified": true, "helpfulness": "0/0", "author": "Mrs Wiz"}, {"rating": 5.0, "review": "Works well Roku is good too", "verified": true, "helpfulness": "0/0", "author": "peter"}]