[{"rating": 5.0, "review": "I have Chromecast, a Roku 3, and a Sony streaming Blu-ray player and this stick is generally as good as the Roku, superior to the Chromecast and far superior to the TV and Blu-ray streaming options.  Very fast, nice user interface and for the same price as the Chromecast, is much more complete.  I prefer the Fire remote to the phone app, which is very sensitive and sometimes difficult to maneuver, but better for searching.  Took no time to setup and log into my Prime account;  I'm still looking for a good sling app (like Webcaster for Chromecast), but am pretty confident that it's not far away.  I've tried Firecast and it doesn't work well for me. This isn't such a big deal because most viewing is between Netflix and Amazon Instant, which work beautifully.  I live in a suburban area that offers only really crappy AT&T; DSL service, but the Fire seems to work fine and I seldom see the \"buffering\" message or notice any lags that were so problematic on the TV's resident streaming feature.My daughter has the full Fire TV, which is maybe the only thing I've seen that works better than this - not to take anything away from Roku3, which also works great.  The main advantage is the Amazon interface to Prime shows, which is very smooth.", "verified": true, "helpfulness": "0/0", "author": "Casysdavid"}, {"rating": 5.0, "review": "Great. Got this for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Croson"}, {"rating": 5.0, "review": "Bought this when it was on sale for prime members. Did not think I would love it as much as I do. We play movies and got hooked on some of the Amazon only tv shows. Listen to music and really like that lots of the songs have the lyrics showing on screen.", "verified": true, "helpfulness": "0/0", "author": "OK"}, {"rating": 5.0, "review": "Excellent Transaction; Super-Quick Ship; Would Highly Recommend!", "verified": true, "helpfulness": "0/0", "author": "Island Girl"}, {"rating": 1.0, "review": "Never worked! Kept losing wifi connection even though settings showed it was connected. Returned it.", "verified": false, "helpfulness": "0/0", "author": "Cilla"}, {"rating": 4.0, "review": "Love it...Easy to install & easy to use & the price is so right.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Would not connect to router.  Returned.  Amazon return support was excellent.", "verified": true, "helpfulness": "0/0", "author": "DLW"}, {"rating": 5.0, "review": "Its so great to get my programs on the TV without the hassle of trying to connect through my other devices.", "verified": true, "helpfulness": "0/0", "author": "Catherine Leys"}, {"rating": 5.0, "review": "Kids got them for Christmas and love it!", "verified": true, "helpfulness": "0/0", "author": "Allison L"}, {"rating": 5.0, "review": "Love this Fire Stick!!  WAY better than Chromecast with ton more content.", "verified": true, "helpfulness": "0/0", "author": "D. Landry \"liberal squasher\""}]