[{"rating": 2.0, "review": "Not much there for free content, what is free is garbage for a married couple in their 40's.Everything else on the stick requires payment and subscriptions with more payments. You would think they could at least add what is already on the public airwaves without having to pay for it", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "Picture and sound  quality are great. If my TV is on the right source and I click the home button on my fire remote or phone it will turn the TV on also. Only thing is volume cannot be controlled.", "verified": true, "helpfulness": "0/0", "author": "C N."}, {"rating": 5.0, "review": "This is absolutely great. There is no buffering and it is way faster than using a DVD player to go on line for Amazon Prime. The voice remote is without equal and very handy to find a movie or serial without having to scroll through a bunch of preliminary junk", "verified": true, "helpfulness": "0/0", "author": "John M"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Denise R. Byrd"}, {"rating": 5.0, "review": "Love this new way to enhance watching tv!! So glad I made the purchase !!", "verified": true, "helpfulness": "0/0", "author": "Pat OHerin"}, {"rating": 4.0, "review": "Its great to no longer have a HDMI cable running across the room as a trip hazard. Fire TV Stick is always plugged in and always up and running.", "verified": true, "helpfulness": "0/0", "author": "Space Cody"}, {"rating": 5.0, "review": "I have a Roku 3 and a Roku stick. This is easily as good as the Roku 3 and is much faster and more responsive than the Roku stick. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Marissa\""}, {"rating": 5.0, "review": "FANTASTIC !", "verified": true, "helpfulness": "0/0", "author": "Rick Briggs"}, {"rating": 5.0, "review": "I have never purchased anything that has given me such pleasure! And I can actually work it by myself. Not being Tech savvy is not a good thing! Thank you so much for selling it to me.", "verified": true, "helpfulness": "0/0", "author": "Katherine Bates"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Curtis M."}]