[{"rating": 5.0, "review": "I love it and think this is the best, tiny, slim, very affordable.  My neighbor has a RULU, clunky, cost about $90....I am so happy Amazon made this stick/remote, easy to set up, easy to use.", "verified": true, "helpfulness": "0/0", "author": "lola Felden"}, {"rating": 2.0, "review": "Lack of USB port for a mouse or a keyboard is not acceptable to me.", "verified": true, "helpfulness": "0/1", "author": "JeffWNC1"}, {"rating": 5.0, "review": "Meets all of my expectations.", "verified": true, "helpfulness": "0/0", "author": "christine lazzaro"}, {"rating": 2.0, "review": "As many hotels have a separate Authenication page to enter a code, haven't been able to get it to work any except at home, which is not why I wanted to use it.  Also doesn't seem to cast to any TV except maybe Samsung, which I don't own.  I have played with it at home but even in same room as my ac router had connection issues where my roku's do not.  I was hoping for a lot due to advertisement, but a bit disappointed so far.Note: I did contact amazon on the hotel issue, which he verified not having a separate  authenication page was an issue with some hotels.  All big hotels that I've used does this", "verified": true, "helpfulness": "0/0", "author": "Bob32927"}, {"rating": 3.0, "review": "Generally satisfaction was ok mainly concern on prime. Every other movie I search is not available", "verified": true, "helpfulness": "0/0", "author": "willians"}, {"rating": 4.0, "review": "Seems to be very good and easy to use.", "verified": true, "helpfulness": "0/0", "author": "james gunsallus"}, {"rating": 5.0, "review": "it works great. its easy, its simple. i have no complaints.", "verified": true, "helpfulness": "0/0", "author": "DenGar"}, {"rating": 5.0, "review": "Love it so easy to use and set up!!!", "verified": true, "helpfulness": "0/0", "author": "Jill Hall"}, {"rating": 5.0, "review": "It's incredibly easy to install.  Amazon walked us through the process.  The only struggle is streaming ESPN.  Our cable provider did not make that easy and I don't have it installed.  I don't blame Amazon for this though.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Heidi Sturm"}, {"rating": 5.0, "review": "I Love the Amazon Fire TV Stick. My husband labeled it \"Mommy's new toy\":-)  I have no previous experience with Roku or Hulu, or any other similar product so I don't really have anything to compare it to...  I do know that I love the concept of having my photos, movies, music, t.v. programs, etc.  in one convenient place!  Who knew that years ago when I first subscribed to Amazon Prime for the 2-day shipping, that I would end up loving all of these \"extras\"?!  I put the free app on my phone for voice control and that was super easy & cool to use too!  We haven't tried gaming yet, but think that will be a fun family activity (since our other video games are in the kids' area).", "verified": true, "helpfulness": "0/0", "author": "readingsanity"}]