[{"rating": 5.0, "review": "This thing works awesome", "verified": true, "helpfulness": "0/0", "author": "scot hansen"}, {"rating": 5.0, "review": "Gary Busey was right!", "verified": true, "helpfulness": "0/0", "author": "justin brassell"}, {"rating": 5.0, "review": "Very user friendly and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Joseph R. Quesada"}, {"rating": 5.0, "review": "Easy directions!", "verified": true, "helpfulness": "0/0", "author": "deb"}, {"rating": 5.0, "review": "This is perfect for the TV in our master.  Good quality and easy set-up.", "verified": true, "helpfulness": "0/0", "author": "Julie T."}, {"rating": 2.0, "review": "I received this fire stick as a promotional offer for sling tv. I was given the choice between a fire stick and a roku stick. Since I already had a roku 3 box I thought I'd give it a whirl. That was my first mistake. As a streaming stick with apps, it's better than chromecast since chrome is limited to mirroring other devices. But compared to the number of tv apps available with Roku, this is definitely Roku's idiot step brother. It's not nearly as robust in selections, the remote has a tendency to jump across three tiles with a single gentle press of the directional button, the YouTube app is definitely lacking in polish, FoxNow, CBS All Access, and several others are unavailable on fire stick. If you're considering this device, pony up the other 99 cents and get the Roku. I should have heeded the advice I received so many years ago - if you play with fire, you're gonna get burned.", "verified": true, "helpfulness": "0/0", "author": "Corey Stevens"}, {"rating": 5.0, "review": "works well,", "verified": true, "helpfulness": "0/0", "author": "William E. Burse"}, {"rating": 5.0, "review": "Simple & Easy, We love it.", "verified": true, "helpfulness": "0/0", "author": "FUZHEWUZHE"}, {"rating": 5.0, "review": "I have a smart TV, but it didn't have access to Amazon prime, so I purchased this Fire TV stick.  I love all the benefits, music, videos and photos using the cloud experience.  So far when watching videos, the frames doesn't freeze up/delays.  When I first signed up for Netflix I didn't have problems but it appears they don't have enough bandwidth to service their customer base, started to experience frame freezing and delays, I disconnected Netflix.  When friends come over I show my photo on my 60 inch TV and play music in the background, they are surprised to hear that this application is Amazon Prime.  Being in the telecom industry for 40 years, I receive discounts for TV service, what I did was disconnect channels that we don't watch and view them on Amazon Prime for free.  Using Amazon prime I am receiving more financial benefits.  Mahalo Amazon!! Please keep the deals coming for Hawaii consumers..", "verified": true, "helpfulness": "0/0", "author": "Nalani Kahimoe"}, {"rating": 5.0, "review": "What a Great product!!!  Amazon hit on something fantastic!!  The Fire Stick brings a World of entertainment to my fingertips.  Thanks Amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "donald p angotta"}]