[{"rating": 5.0, "review": "Very cool to have all those services available now on our current TV and no need to buy a new \"smart\" TV.  Easy set-up too", "verified": true, "helpfulness": "1/1", "author": "hikeroma"}, {"rating": 3.0, "review": "The fact that the device needs a power supply other than a powered USB is a no. The second no comes with the fact that the included USB cable is only useful if the television port is right on an outlet. In my case, with my television being on a mount, this required rearranging my entire setup just to use an occasional accoutrement to my AV system. I also use the ChromeCast use device which has no issue powering from the powered USB hub on the television I see no reason that this device should require wall power. Also having to physically put the unit to sleep is an extra step that should not be requires. Since it must be connected to the wall power a simple off command on the included remote should have been a no-brainer just as with any other independently powered A/V device.As far as I can tell it provides the services promised but the exclusion of a longer cable and no way to stop it from sucking power without going through several menus makes this \"meh\" in my opinion.", "verified": true, "helpfulness": "1/3", "author": "Boos mom \"angelandboo2\""}, {"rating": 5.0, "review": "For the 20 dollars i paid is the best thing. Great definition and really easy to use.Recommended even for the full price", "verified": true, "helpfulness": "1/1", "author": "Andres Uriarte"}, {"rating": 5.0, "review": "Very easy to hook up. Very easy to use. Just make sure you have an outlet near by for the power cord is not very long.", "verified": true, "helpfulness": "1/1", "author": "Brian Johnston"}, {"rating": 4.0, "review": "Great Product.", "verified": true, "helpfulness": "0/0", "author": "Rupesh Gupta"}, {"rating": 1.0, "review": "Same as the fire box , but with limitations. If you have a fire box no need to get this", "verified": true, "helpfulness": "0/3", "author": "Bonnie Peters"}, {"rating": 4.0, "review": "I love it. Makes watching my videos on Prime really easy. It connects you to all your favorite streaming services. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Tyler Lawhon"}, {"rating": 5.0, "review": "I've been using it for 3 days now, so far it meet my expectations but I'll be able to provide more feedback in a month or 2.", "verified": true, "helpfulness": "1/2", "author": "Maxime"}, {"rating": 2.0, "review": "This might be a weird thing to say... But I believe this stick is too powerful. It almost requires that you plug the USB power into the ac adapter instead of any old USB port.  There is also audio issues with dolby digital plus with Amazon instant video. The sound is extremely compressed and is extremely soft. In contrast the Netflix app sounds first rate with dd+. There is also no hbo go, max go, or vudu apps. As for the positives it is extremely quick and connected immediately to my wireless network.", "verified": true, "helpfulness": "1/1", "author": "David Coleman \"gamemaster\""}, {"rating": 1.0, "review": "Great software and speed, but get random lines all over the screen like it has a bad connection to the HDMI. I tried to use another HDMI input but had the same problem, makes it almost unusable. I will contact Amazon about this soon to resolve it.EDIT: No contact or replacement offer from Amazon, Green flickering lines all over make this unusable for doing anything, could not recommend as it is right now.", "verified": true, "helpfulness": "0/0", "author": "Michael T. Bassett"}]