[{"rating": 3.0, "review": "The reason this is rated so low is if you would just say plug the stick into the designated spot on the TV and when the keyboard comes up on the screen use the remote, navigate by using the outside circle of the large circle. After trying numerous times to register on line I finally asked customer service for help, it took three representatives to get this done.  Actually was disappointed with the selection of movies available.", "verified": true, "helpfulness": "1/1", "author": "Doggie Mom"}, {"rating": 4.0, "review": "We have only been using the Fire TV Stick for the past 2 days ~ so far we are very impressed as an alternative to satellite TV.  We are looking forward to saying goodbye to Dish Network and making this our primary TV source!!", "verified": true, "helpfulness": "0/0", "author": "Teresa"}, {"rating": 5.0, "review": "I've had a Roku (v2) for a while.  Love it.  Got the Fire Stick from my birthday.  Wow - I love this thing, too.  I haven't been through all the features yet but I can say that it runs a lot faster than the Roku 2.  Of course it is newer, too.Still getting used to the interface.  The remote works well.  Maybe more later:)", "verified": true, "helpfulness": "0/0", "author": "hogger"}, {"rating": 5.0, "review": "easy to setup and use", "verified": true, "helpfulness": "0/1", "author": "Jarrett"}, {"rating": 3.0, "review": "The only issue I have is that it seems to have a hard time staying connected to wifi. My wifi is fine and this is the only device that seems to have issues. Other than that it's great!", "verified": true, "helpfulness": "0/0", "author": "Lindsay Kramer"}, {"rating": 5.0, "review": "Great product, better than advertised.  Easy installation, must have Prime to get true benefit from this product.", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 1.0, "review": "What a waste of money. Should have went to the Roku for $10 more. The screen for netlflix too small of print to read and the remote is not user friendly/. I should not have believed the Best Buy rep. I believe i will take back and return for refund!", "verified": true, "helpfulness": "1/2", "author": "Lenny"}, {"rating": 5.0, "review": "works very well.", "verified": true, "helpfulness": "0/1", "author": "sergio stubrin"}, {"rating": 5.0, "review": "Fantastic!!! Defiantly pay up front for Amazon Prime", "verified": true, "helpfulness": "0/1", "author": "Paul"}, {"rating": 5.0, "review": "Easy to use and setup.", "verified": true, "helpfulness": "0/1", "author": "Terry Mitchell"}]