[{"rating": 5.0, "review": "does everything it promises best thing since sliced bread coodos.", "verified": true, "helpfulness": "0/0", "author": "michael padurjan"}, {"rating": 4.0, "review": "Still trying to figure it out, but spare time & need haven't hit at the same time.  Figure it will be FANtastic when I get time & understand ALL it can do.", "verified": true, "helpfulness": "0/0", "author": "larry e miller"}, {"rating": 5.0, "review": "Wonderful!  Should have dumped Comcast sooner!!!!", "verified": true, "helpfulness": "0/0", "author": "Sue Sanders"}, {"rating": 2.0, "review": "Worked for a month very well. After 5 weeks stopped working. I tried it on a different TV and I also tried all the tricks and the tips to turn it on. Wanted to return but this item is no longer eligible for return. The return window closed on Jul 20, 2015.", "verified": true, "helpfulness": "0/0", "author": "TDumitriu"}, {"rating": 3.0, "review": "tried the amazon, and still prefer my old roku... Wish i would have paid more for the one with ethernet but the $100 price point doesn't see worth it anymore.", "verified": true, "helpfulness": "0/0", "author": "Chad B."}, {"rating": 4.0, "review": "Works as promised. But I have to say the box version works faster.", "verified": true, "helpfulness": "0/0", "author": "Alex G Salinas"}, {"rating": 4.0, "review": "Works great! Wish it had ability to hook up Bluetooth speakers", "verified": true, "helpfulness": "0/0", "author": "ashley m levy"}, {"rating": 5.0, "review": "The fire stick is awesome!  There are tons of movies and t.v. shows to choose from and the resolution is great. Best $24 I ever spent.", "verified": true, "helpfulness": "0/0", "author": "jeff Bryant"}, {"rating": 5.0, "review": "it works great, eliminated buffering that I had with my Blu ray player", "verified": true, "helpfulness": "0/0", "author": "quinn"}, {"rating": 5.0, "review": "I love my Amazon Fire TV Stick.It does everything its suppose to do.And if your an Amazon Prime member like me.You have tons of movies, TV series and music available to you for watching or listening.", "verified": true, "helpfulness": "0/0", "author": "Banny"}]