[{"rating": 4.0, "review": "So far I'm loving the Fire Stick,  the set up was easy.  I'm using it mostly for my kids and it's great how many children's programs there are.I'd love to be able to watch my xfinity app but maybe that will come.  For now it's been a great purchase.", "verified": true, "helpfulness": "0/0", "author": "husni76"}, {"rating": 5.0, "review": "Totally plug and play.  Came preloaded.  love it", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 5.0, "review": "One of the best a/v purchases I've made. Simple to set up and use; works like a charm if you have a fast enough internet connection...", "verified": true, "helpfulness": "0/0", "author": "Michael Mcmillan"}, {"rating": 2.0, "review": "Not bad for the price but reception is sketchy at times.  Slow reaction to selections.  Remote is simple but could use some improvement.  I like the USB plug that keeps the stick hidden behind he TV.  Kids liked some of the free games but the remote is not very well suited to play them.  We will likely be returning the unit to try something else.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 1.0, "review": "Normally I am a huge advocate for anything Amazon, but this was a huge let down. When I first started using the fire stick I thought it was really nice and easy to use. That is until I wanted to actually watch something. Netflix and Hulu would repeatedly glitch (I made sure that it wasn't the Internet and even checked on another streaming device with no problems) and the glitches would often cause a black screen that could only be fixed by closing out, going to the home screen, and starting over. Overall, I would not recommend this product to anyone and strongly encourage them to go with a Roku device for streaming.", "verified": false, "helpfulness": "0/0", "author": "Jesssica"}, {"rating": 5.0, "review": "Fire stick is awesome. Made my non wireless smart tv wireless and turns any TV into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 1.0, "review": "only works w/amazon apps", "verified": true, "helpfulness": "0/0", "author": "Jose F."}, {"rating": 5.0, "review": "Love the Fire Stick...but the HBO Go app stinks.  All of the other apps work brilliantly, but the HBO GO app sticks, stutters, and annoys the heck out of me.  I suffer through it most of the time but will sometimes just get the laptop out when I can't stand it anymore.The Amazon Prime and Netflix applications are seamless and I never have issues.Come on, HBO - get these bugs worked out!", "verified": true, "helpfulness": "0/0", "author": "P. Hardilek"}, {"rating": 5.0, "review": "Two words.....LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Lauren K Johnson"}, {"rating": 5.0, "review": "Excellent alternative to Chromecast that mates very well with Prime Membership.  My LGTV stopped supporting Youtube and had no support for Prime videos.  Watched Legend of Korra seasons 1 and 2 with it and was worth it just for that.  The screensaver landscapes are also mesmerizing.  I would pay just to update the photos every month and imagine myself there inside the TV.", "verified": true, "helpfulness": "0/0", "author": "Bad Penguin \"bad_penguin\""}]