[{"rating": 1.0, "review": "This came as very easy to charge, plug into tv and go.....NO...the.hardest part is getting that stinkin' back off the remote to get the batteries (that I might add, both go in the same direction).Am sure there is something I'm not doing but it Cant be this tough to use!Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Dawn"}, {"rating": 5.0, "review": "I received my Amazon Fire TV Stick from a co-worker for our Christmas gift exchange.  It does everything I wanted and more.  I would highly recommend this.  Easy to register and set up.  Nice thing about it is once it is set up take it to any TV plug and play.  Thanks Dave Love my gift", "verified": true, "helpfulness": "1/1", "author": "Karen Maranto"}, {"rating": 5.0, "review": "This works great and was very easy toconnect", "verified": true, "helpfulness": "1/1", "author": "Susan Welch"}, {"rating": 4.0, "review": "Very easy to set up. Can use Netflix , and there are lots of tv shows and movies to watch if you have a prime account", "verified": true, "helpfulness": "0/0", "author": "Kristen O'Connor"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "J. Wyatt"}, {"rating": 5.0, "review": "The setup was easy. I ordered the fire tv stick from Amazon so it came pre registered.  Connected to my WiFi and it worked instantly. I recently got prime so this is a must have. The fire tv stick also has games to play and other cool apps.  I wish it had HBO go the only thing I can complain about.  I can also mirror my tablet to television which comes in handy. So overall I say the fire tv stick does everything it says it can.  I would highly recommend this product...I had to revise my original review.  I have to now give it five stars now that HBO go was added.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We had a hard time plugging it directly into the tv and had to use the adaptor. This was actually better since we could hide the whole thing behind the tv.The videos and movies all play as soon as you start them without buffering. We do not own a Kindle fire so are unable to start watching A show and push it to the tv.", "verified": true, "helpfulness": "0/0", "author": "Jennifer  Streets"}, {"rating": 1.0, "review": "When it works, it works. Unfortunately, that is less than 20% of the time.  The rest of the time it's \"Connected with Problems\".  It says my signal strength is good, but can't keep a connection at all.I've tried using different power adapters, moving it closer (which defeats the purpose of buying it) and all other options suggestion on the forums.Maybe a software update will help, but until then I wouldn't recommend this to anyone.Additionally, on occasion  the remote goes crazy when scrolling through prime and will zoom through 10-20 movies instead of just going to the next one when you click left or right.", "verified": true, "helpfulness": "6/6", "author": "David Just"}, {"rating": 4.0, "review": "Love it. Before receiving as a Christmas gift I was using a bulky xbox 360. The only reason why this is not a five because I didn't know you had to keep it plugged up during use. I thought it charged.  Oh well still a great product", "verified": true, "helpfulness": "1/1", "author": "V. Smith"}, {"rating": 5.0, "review": "Cool Device.  Like it much better than the Chromecast (I have both).", "verified": true, "helpfulness": "0/0", "author": "HockeyGod19"}]