[{"rating": 2.0, "review": "It works well for certain things, not well for the most important. Namely, it has good support for Amazon streaming and netflix, but it's awful for Mlb.tv and doesn't offer nbc sports. I get messages that my bandwidth might be too low during mlb.tv games. Speedtest.net suggests I'm pulling down 80mbps though on an old wireless mac (wireless n). Accordingly, I would not recommend this to anyone except for people who might only want to watch Amazon content.Also, I was hoping that my Echo would work with this, but it doesn't.", "verified": true, "helpfulness": "0/0", "author": "AWS"}, {"rating": 3.0, "review": "Not bad - but many apps have buffering problems (and I have 20MPS Cable Internet). Pluto TV and PBS I watch the most. I do not recommend Crackle as it has absolutely no issues playing commercials cleanly and smoothly but all sorts of buffering problems playing content. You think they'd realize that people aren't there for the commercials....but corporate ignorance is never to be underestimated. Sling TV also has many buffering and delivery problems - not worth $20/month for that!", "verified": true, "helpfulness": "0/0", "author": "Jim J."}, {"rating": 1.0, "review": "I wish I could rate this netter", "verified": false, "helpfulness": "1/1", "author": "chris"}, {"rating": 3.0, "review": "I hate that you can skip the intro.Amazon fire TV works great with Amazon Prime but not so much with third party apps.  Both HBO Go and Starzs have video audio sync issues. If I want to watch a movie with no problems I'll either watch it on the Roku or Chromecast.", "verified": false, "helpfulness": "1/1", "author": "TOKE"}, {"rating": 5.0, "review": "IT IS GREAT", "verified": true, "helpfulness": "0/1", "author": "Jill"}, {"rating": 1.0, "review": "Freezes up continuously and the power has to be disconnected.  Very frustrating. All other wifi enabled devices work fine in same location within house.", "verified": true, "helpfulness": "1/1", "author": "Shawn Darche"}, {"rating": 5.0, "review": "Easy to set up.  I was streaming in no time!", "verified": true, "helpfulness": "0/1", "author": "Angi"}, {"rating": 5.0, "review": "love my FS!! lots of cool apps to stream through, tiny remote fits all snug in my hand, you can just call me the \"Stream Queen\"!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Enjoying it.", "verified": true, "helpfulness": "0/1", "author": "donald h."}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "sam"}]