[{"rating": 5.0, "review": "Excelente !¡¡", "verified": true, "helpfulness": "0/0", "author": "fausto espinal"}, {"rating": 5.0, "review": "LOVE IT.", "verified": true, "helpfulness": "0/0", "author": "Michael Burns \"Burnsie13\""}, {"rating": 3.0, "review": "It works ok, just wish it had more Apps. Like GETV, Feeln, Joyce Meyer and I noticed while watching it choppy streaming on some apps.", "verified": true, "helpfulness": "0/0", "author": "BigBoiJ"}, {"rating": 3.0, "review": "The device is ok but the remote is a piece of crap. Use a regular tv remote with it.", "verified": true, "helpfulness": "0/0", "author": "plata"}, {"rating": 2.0, "review": "I purchased the Amazon Fire TV Stick. So far I love it. It is a very convenient way to watch Amazon Prime Videos without extra cords, I am very happy so far, and the price is great. I have yet to explore the other features of the Fire TV Stick, but it is definitely a great deal. Or so I thought. I can't use other Wi-fi devices while watching prime videos.", "verified": true, "helpfulness": "0/0", "author": "Pat from Philly \"Pat from Philly\""}, {"rating": 5.0, "review": "This is just to cool!!!", "verified": true, "helpfulness": "0/0", "author": "Charles Eduardos \"Transformation Coach, Motivational/Inspirational Speaker\""}, {"rating": 5.0, "review": "I have both the fire tv & the fire tv stick. The fire tv stick is what convinced me to get the fire tv. I also have the fire game controller and keyboard. The fire tv stick is awesome and does everything that the fire tv does only in a very compact and portable way. The interface for both devices is identical & the game controller and keyboard are interchangeable between the fire tv stick & the fire tv. If your an Amazon Prime member the benefits are even better because as long as both the devices are registered under the same Amazon account they're all going to share the same Amazon Prime member benefits across all of the fire devices with only the one membership. I got the fire tv for the home and the fire tv stick to take with me on trips. I'm very happy with the fire tv stick & highly recommend it to everyone! Lastly even if your not an Amazon Prime member with the numerous other apps like Flixter you can access your movie and TV libraries through those free apps within the fire tv stick & still be able to see & stream them to the same TV your fire tv stick is connected to. And as a prime member you can get the fire tv stick at a reduced price. Either way (and I'm not a prime member) the fire tv stick is still reasonably priced & still well worth the purchase. You will not be disappointed! I couldn't be more happy! Great job Amazon & thanks!", "verified": true, "helpfulness": "0/0", "author": "Merk Dogg"}, {"rating": 4.0, "review": "Nice and easy no fees", "verified": true, "helpfulness": "0/0", "author": "jason rathbun"}, {"rating": 5.0, "review": "This is an excellent devlce. High quality and very versatile.", "verified": true, "helpfulness": "0/0", "author": "Raul"}, {"rating": 1.0, "review": "I still haven't managed to get this thing working. It won't connect to my router.", "verified": true, "helpfulness": "0/0", "author": "Mary B."}]