[{"rating": 5.0, "review": "Easy to use layout… I love the portability… The only Con would be I wish it had more memory to solve the buffering issues", "verified": true, "helpfulness": "0/0", "author": "Kevin P. Brown"}, {"rating": 1.0, "review": "not very user friendly and always says cant connect when you want it to", "verified": true, "helpfulness": "1/1", "author": "jas"}, {"rating": 5.0, "review": "The Firestick is fantastic.the selection is great,the picture is great.very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The reason I got this was because my wife's apple tv does not have Amazon Prime, nor will it ever.  I bought this when I knew I was going to be in bed for a few days after an injury.  Plugged it in, configured my account settings and has worked flawlessly ever since.  The power adapter is kind of a bummer but the other option is to use up another HDMI port which if you don't have open ones to spare is a non-starter.  I configured my Netflix account as well and have everything I use on one little device about the size of a flash drive.", "verified": true, "helpfulness": "0/0", "author": "James S Coryat Jr"}, {"rating": 3.0, "review": "In theory, this is a great thing. However, constant buffering issues arise.  Also, when you push play from HBO GO or from Amazon prime, expect a three second sound delay.", "verified": true, "helpfulness": "1/1", "author": "E. Barton"}, {"rating": 3.0, "review": "I'm in a Mobile Home Park that has WiFi. I thought I could use this with the WiFi however I haven't been able to get it to work yet.I need a \"Password\". I'll keep trying. I don't have Internet.", "verified": true, "helpfulness": "0/0", "author": "Tori"}, {"rating": 5.0, "review": "Currently own two Fire Sticks.  I love them and debating about a third.  None of my TVs are Smart TVs.  Before the Fire Stick came along I was using Chromecast for Netflix.  I was disappointed I couldn't watch Amazon Prime shows on it.  I signed up for the preorder of the Fire Stick and was one of the first ones to receive it.  Ever since then my Chromecast got up into a drawer.  The Fire Stick does everything I used my Chromecast for and even more.  Hopefully this holiday season there will be a sell and I will buy several as Christmas presents.", "verified": true, "helpfulness": "0/0", "author": "NiceMann"}, {"rating": 1.0, "review": "I've been a ROKU fan and absolutely love it. However, the techie that I am,  I thought I would try the Fire Stick. The specs seem great but its a piece of crap. I thought the usability would be great because it coming from Amazon but it that was not the case. After three days of using it, I received a software update and thats when this really went to $hit. The remote just doesn't respond correctly and everything keeps freezing up. The remote doesn't work to the point of where I cannot even do a factory reset.  DO NOT buy this crap. The ROKU is much much better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this TV stick. I have Amazon prime, my kids love to watch their favorite cartoons in the video library. This is the perfect solution. It is very easy to install. Easy to use. The remote is very convent and user friendly. We use this everyday. Highly recommend for anyone with Amazon prime membership. Great product!", "verified": true, "helpfulness": "0/0", "author": "Stevie"}, {"rating": 5.0, "review": "Everything I expected", "verified": true, "helpfulness": "0/0", "author": "lewis thomas"}]