[{"rating": 3.0, "review": "Works great with Amazon videos, not so great with everything else, can't get it to play more than 5 minutes of video on PLEX without crashing, Netflix is slightly better but still crashed way to often and it drops its connection constantly. I have to restart it so often that I have put it on its own power strip so I don't have to keep reaching behind the TV to unplug it.Hoping Amazon send down some updates to fix all the issues.So for now I'm using it only for Amazon Prime videos, PLEX and Netflix are running perfect on my first generation Roku.I got it when it was on sale for $19 so I don't feel like I have been ripped off, but if I had paid $39 I would be returning it.I feel like I paid Amazon $19 to be a Beta tester.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Have to reboot on a daily basis.  I own a Fire TV and it is great.  I was offered a Fire Stick at $20 to beta test?  Loses network connect even though it is next to router.  Only way to fix it is to unplug and reboot.", "verified": true, "helpfulness": "1/2", "author": "Scott"}, {"rating": 5.0, "review": "UPDATED 3/27/15:I don't know if it's because I updated my Android OS to Lollipop, or if there was an update pushed to my Fire Stick, but screen mirroring works, and works well.Also, HBO GO has been released for the Fire Stick.We'll have to wait until the fall to see if NHL GameCenter/Center Ice is available.I am now pleased with this product.ORIGINAL REVIEW: I will start with a big negative: Screen mirroring with Samsung Galaxy S5 does not work. My phone recognizes the Fire Stick, and the Fire Stick apparently recognizes my phone. When I try to do the screen mirroring, my TV says that it is preparing to mirror with my phone, and it calls my phone by name. So I'm pretty sure the two are talking to each other. However, after several seconds I get an error message saying that they can't mirror. Wireless screen mirroring is a big reason why I bought this. I have plenty of other ways to stream Netflix, Amazon movies, etc to my TV. I have done some internet research and it appears that nobody else has successfully mirrored their Galaxy S5 with the Fire Stick. Second negative: No HBO GO (supposedly coming soon) and no NHL Gamecenter Live. I guess its my fault for not doing more research before buying and finding out ahead of time that those two apps aren't available. Fortunately I pre-ordered the Stick during the sale period and only paid $19. If I had paid full price I would be returning it. Positives: Easy to set up, easy to use, seems to have a faster connection to my WiFi than my PS4. I haven't experienced any low quality video or buffering while using Netflix or Amazon movies.My recommendation: If HBO Go, NHL Gamecenter, or screen mirroring are important to you, I would wait a while to buy this and maybe the apps will be available and maybe the screen mirroring will be fixed.What's really frustrating me is that the Galaxy S5 is the most sold Android device in the US. You'd think that Amazon would have released a product that works properly with the most popular Android device. If the screen mirroring doesn't get fixed soon, if HBO Go isn't added soon, and if NHL Gamecenter isn't available next season, the Fire Stick is quickly going to become another obsolete device in my junk drawer.", "verified": true, "helpfulness": "1/2", "author": "benrb"}, {"rating": 3.0, "review": "PANASONIC PLASMA OWNERS BEWARE!  Love the Stick and hardware, bought one for every TV in the house and the \"EDC Bag\".  But there is a known issue with most Panasonic Plasma TV'S.  You will get a fast blinking green screen every 15 minutes or so.  The only way to cure the problem is change inputs for a few seconds or turning of the Pixel Orbiter option in the menu, which with a plasma is not ideal.  Amazon really needs a fix for this.", "verified": true, "helpfulness": "3/3", "author": "Delana Patnode"}, {"rating": 4.0, "review": "Easy to use and it doesn't freeze like my Roku 3. The only thing I dislike about the Fire TV Stick is the UI and prefer the layout of the Roku's better.", "verified": true, "helpfulness": "0/0", "author": "Father_of_3 \"Father_of_3\""}, {"rating": 3.0, "review": "When it comes to browser media play, chromecast cannot be beaten. Amazon fire stick lacks this feature. It also lacks sports apps(cricket).", "verified": true, "helpfulness": "1/1", "author": "Praveen"}, {"rating": 3.0, "review": "So, so, so BUGGY!!! My netflix keeps crashing and other apps won't load.  It seems to take up much more band width than streaming with my wii.  When it works, it is nice.  Totally unreliable, though.", "verified": true, "helpfulness": "1/1", "author": "Penny Lane \"frecklpwr\""}, {"rating": 5.0, "review": "Good as of now.", "verified": true, "helpfulness": "0/0", "author": "Jose Soto"}, {"rating": 4.0, "review": "The Fire TV stick was very easy to setup on my LG TV and seems to work very well. Right now the only problem I have is the battery cover on the remote.  It has no grip. I couldn't get it opened.  I finally had to grip it with duct tape to open it.  Once the batteries were installed, everything ran smooth.", "verified": true, "helpfulness": "0/0", "author": "S. Davis"}, {"rating": 5.0, "review": "I already have a Fire TV, but the price was so good for this Fire TV Stick, that I could not pass it up.  I plan to give it to my son for Christmas and let him use my Prime account for a month to try the TV Stick out.  I am sure he will sign up for his own Prime account. I downloaded a free copy of Amazon Fire TV Stick User Guide so I can learn a bit more about the stick, and probably will buy one for myself to use in my computer room.", "verified": true, "helpfulness": "0/0", "author": "Snowflashdrop \"Retired = reading and writing!\""}]