[{"rating": 5.0, "review": "I was impressed with how easy it was to hook up and to manuver thru the menu to acess movies.", "verified": true, "helpfulness": "0/0", "author": "Norman G. Wardell"}, {"rating": 1.0, "review": "It's too bad Amazon's Fire TV Stick doesn't work for everyone. It didn't for us and a lot of other Amazon customers.", "verified": true, "helpfulness": "0/0", "author": "Hawkins in Issaquah"}, {"rating": 5.0, "review": "So far so good. The stick and remote have good range. I like the Apps feel to the channels. You do have to pay attention to what you are clicking on in case you accidentally buy a movie or TV show.", "verified": true, "helpfulness": "0/0", "author": "AAM"}, {"rating": 1.0, "review": "Not compatible with Comcast/xfinity users and no HBOGO!", "verified": false, "helpfulness": "0/1", "author": "Darlene Heffernan"}, {"rating": 5.0, "review": "A nice collection of free apps offers endless options. Cutting the cord is easier with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "m"}, {"rating": 5.0, "review": "My 13 year old grandson recommended fire stick to me. I have only had it about 2weeks but I love it so much I have bought another one for a gift.  I highly recommend it to anyone.  Easy to set up and works like a charm.  Love love love it.", "verified": true, "helpfulness": "0/0", "author": "Karen Roberts"}, {"rating": 5.0, "review": "Arrived promptly and did not disappoint.  Would recommend to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Deborah E. Moffatt"}, {"rating": 5.0, "review": "I bought two of these during the pre-sale deal for Prime members. I kept one for myself and gave one as a birthday gift.  Even at full price, I think it's a great little device.  Simplicity is the name of the game for the Fire TV Stick.I \"cut the cord\" a few years ago.  I use a PS3 and a \"smart\" blu-ray player for most of my streaming needs.  I have a TV with nothing attached, and decided to put this to use there.  I didn't expect much but was pleasantly surprised.  Set up was pretty simple (especially with the help of the keyboard on my cellphone using the FireTV app).  The user interface is simple.  The remote is simple.  You can click around quickly enough to get where you need to go and use the onscreen keyboard for searching.  I like using the Fire TV app on my phone though because I dislike having to use the on screen keyboard to input search terms.  The app is easy to use - the voice search is handy. I've played a few of the games- they're cute for killing time.  There are some games that only need the included remote and some that require the optional additional game remote. I don't have the dedicated game remote and probably never will because I'm just not interested.I don't use the wall adapter.  I use the USB port on my TV to provide power to the device.  The manual says to use the power adapter for best results.  The person that received this as a gift use the power adapter because she doesn't have a USB port on her TV.  I don't notice a difference in performance  in our devices.I'm looking forward to the captive portal update so I can use this in hotels.", "verified": true, "helpfulness": "0/0", "author": "Hi."}, {"rating": 5.0, "review": "Love it.  Just gets better the more I use it.", "verified": true, "helpfulness": "0/0", "author": "marcus curtis"}, {"rating": 4.0, "review": "So far i like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Warren Weathington"}]