[{"rating": 2.0, "review": "Defective. -_-", "verified": true, "helpfulness": "0/0", "author": "davidr"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Frank Smith"}, {"rating": 1.0, "review": "I honestly thought that being a prime member that getting a fire stick would be the natural thing to do. Considering how much I pay for a prime membership, you would think that the movies and tv shows would be free. But I was dead wrong. I don't really understand why people were so hot for this item. You can get the same movies and TV shows through Hulu or Netflix. For what the fire stick has to offer I can just keep using my Apple TV or Xbox one.", "verified": true, "helpfulness": "0/1", "author": "Quita Edwards"}, {"rating": 3.0, "review": "I can't view some of the movies.", "verified": true, "helpfulness": "0/0", "author": "Cindy Jones"}, {"rating": 5.0, "review": "It can't get much easier than using the Fire Stick. Reall nice.", "verified": true, "helpfulness": "0/0", "author": "Sher"}, {"rating": 5.0, "review": "excellent device... worked better than expected!", "verified": true, "helpfulness": "0/0", "author": "Sherry Singleton"}, {"rating": 5.0, "review": "Having used smart tvs, a wii, an xbox and chromecast, I got to say nothing comes close to the firestick. The homescreen is extremely easy to navigate and loads up instantly (yes, its that fast), and the serues are organized in an easy to understand fashion. Getting apps sideloaded into it is extremely easy, and there are a lot of games that you can play in it, either by casting or just downloading it into the firestick. I would recomend this over any other option, even the roku or apple tv. For the price, this is the best you can get.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Marrero"}, {"rating": 3.0, "review": "It's really nice does a lot but I can't get a good enough wifi signal on my fire stick on my tv in the basement", "verified": true, "helpfulness": "0/0", "author": "Derreill Reynolds"}, {"rating": 5.0, "review": "The Amazon Fire TV stick is an easy and convenient way to get prime and other media on your tv. I no longer pay for television service that delivers lousy programming and channels I don't want.  A little creativity and the fire stick gets me everything I need in the tv department.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "It was great", "verified": true, "helpfulness": "0/0", "author": "Adrian aldaz"}]