[{"rating": 5.0, "review": "Two sales people at Best Buy recommended the Fire stick over all the other choices, so that it what we purchased. I am very pleased with its user-friendliness. No complaints, only accolades!", "verified": true, "helpfulness": "0/0", "author": "Becky Blackwell"}, {"rating": 5.0, "review": "It's easy to navigate. I really like having the remote.", "verified": true, "helpfulness": "0/0", "author": "judith knod"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "AP"}, {"rating": 1.0, "review": "It works,  than it doesn't work. Connects, than doesn't connect. For awhile i thought it was my internet, so i called and called over and over again and everything else worked for wifi, computer, phone, laptop.  But noo not my amazon fire stick! Shows i have full connection but won't connect. Wasted the money. Id rather spend more and recieve my tv all the time. Its annoying", "verified": true, "helpfulness": "0/0", "author": "amanda rodarte"}, {"rating": 5.0, "review": "This little gadget brings all of my favorite amazon tv up with the easy touch of a button.  Great purchase if you have a tv that is not \"smart\" like the one we had in the basement.", "verified": true, "helpfulness": "0/0", "author": "tonimariep"}, {"rating": 5.0, "review": "love how fast everything loads", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Rick Pierson"}, {"rating": 5.0, "review": "Awesome! This thing is great and very inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Bryan Fawcett"}, {"rating": 5.0, "review": "Finally decided to try and glad I did. Easy to set up. No problems watching with my Internet so far. Good sound (can't figure how). Will be worth the cost even if I only watch several movies or TV shows and then just put it away. There seems to be enough free with Prime membership to choose from that will be no problem. I like how you can purchase or rent certain video rather than join the carriers of certain movies available. Having your music downloaded automatically is a bonus.", "verified": true, "helpfulness": "0/0", "author": "Twirly Bird"}, {"rating": 5.0, "review": "Great investment. Good to have something to watch on summer nites", "verified": true, "helpfulness": "0/0", "author": "Roger Anderson"}]