[{"rating": 5.0, "review": "Just arrived -- Quick ReviewSetup was the easiest I have found on this type of device.  Just entered the WiFi password and boom.The controls are very intuitive.  The ring for L/R/U/D is a bit clunky but certainly workable.Steaming from Amazon Prime was flawless.I have an Android unit on HDMI 1 that may be more sophisticated.  The tradeoff with that is complexity.  The Fire Stick is just so simple that I really prefer it.  What it does it does as well or better than the fancier device.  For watching movies this device is as good as it gets.", "verified": true, "helpfulness": "0/0", "author": "KenP \"ken-p\""}, {"rating": 5.0, "review": "Easy to use. Better than crome cast because it has a remote. I don't like having to plug into the wall though. Otherwise works great, fast set-up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I'm glad I only paid $20 for this. So far I have had chronic issues with it disconnecting from my network. I've had it less than 2 weeks and I can;t even get through a TV episode on Amazon Prime. I keep hoping for an update to fix it, but there is nothing so far. No, the problem is not with my wireless network. I do this stuff for a living. There is definitely and issue with the wireless adapter or firmware on the Fire Stick.  I mainly got this so I could stream Prime Music on my home theater receiver. My Roku's already get more video content than the Fire Stick does. Works great while connected to the network. Too bad it can't maintain a connection.", "verified": true, "helpfulness": "1/1", "author": "Brad"}, {"rating": 4.0, "review": "I love Amazon's Fire TV I have the $99 FireTV in the den. I purchased the Stick while it was being offered at a really good price.  The reviews of the product say that it has a speaker remote, just like my other one, however, when I got it that is not the case, it has a search function, would prefer the speaker remote, not lazy but have learned how to navigate with the speaker function and it saves time especially when you are looking for something for a 3 year old.I will not be returning this one as the price was too good to pass up or return.  But would appreciate someone correcting their site or replacing my remote.I would recommend FireTV but would also recommend you getting the speaker remote.In response to NEXT's response to my review, he/she/it is correct.  I did overlook two small words at the end of the sentence about \"Voice Search That Actually Works\", since it was highlighted as a Feature I must have \"assumed\" that FireTV Stick had a voice remote, without additional charges.  I was WRONG.  Point, none of the other Features have additional charges, I would still suggest that Amazon clarify that a bit better.A big Thank You to NEXT for pointing this out so kindly. Because of it was my error I have changed my rating to a 4.", "verified": true, "helpfulness": "0/1", "author": "JWilson \"aromalife\""}, {"rating": 4.0, "review": "Great value for what it does. Got this at promotional price but still thinks it's still worth it at full retail. Transform your TV to a smart TV instantly. If you have a Smart TV that is working well, then maybe you don't need it. It's portable so that's a big plus.A couple of disappointments. I originally gotten this because it said you can rent movies as low as 99 cents. I thought this was a special pricing for stick owners but I haven't seen any movies for this price. The component for the batteries to the remote is awful. I couldn't tell which way it should open and needed to use a knife to pop open the latch.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 2.0, "review": "The device worked great for a few days, then we began to have intermittent connectivity issues. After a few days of this, it began to work again.  It worked great again for about a week or two. Recently though the intermittent issues returned and now the device will not connect to our network at all. This is strange because our old Roku box works fine as well as the play-station we use to watch blu-rays and to stream netflix. With those two devices working fine as well our other electronic devices, we have to believe this is an issue with the product. We were really excited when this product hit the market and even pre-ordered it but now we have no choice but to return it and purchase some other type of streaming device.", "verified": true, "helpfulness": "0/0", "author": "M. Elliott \"SF222\""}, {"rating": 4.0, "review": "It's what I was hoping for, very easy set-up probably 10 minutes maybe a few minutes more.  Seems pretty straight forward thus far.  Fairly easy navigation.  I have the Chromecast in one room, and wanted this for the primary TV.  Having Amazon Prime I wanted the ability to have easy access to their movie lineup and this now gets me there without a lot of B.S.  Possibly, the only negative is the remote is small and I can already see this falling into the crack of the chair or couch.  The search displays on the screen in smaller letters at least on the 32\" TV.  It says you can download the application for your Android smart phone, but honestly I don't think I'll be doing that.  I pre ordered and it arrived yesterday which was a nice surprise as early on it stated would not arrive until after Christmas.  Head to Head it's so similar to Chromecast as far as price points etc.  I didn't see Youtube logo on here and that would be disappointing especially for home video that can be watched from your youtube account.  Well, I paid 19.00 so I'm not complaining!  I like this and would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Logic101"}, {"rating": 5.0, "review": "Got my Fire Stick yesterday in the mail. Hooked it up today and in about 5 minutes I was streaming content. Works flawlessly, easy setup and nice clean interface.", "verified": true, "helpfulness": "0/0", "author": "Prashant Goel \"palluji\""}, {"rating": 4.0, "review": "Easy to set up. Has been great in my daughter's room allowing her to watch Netflix at the drop of a dime. The remote is easy to use as well.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "i love this device. i have the various media device similar to the fire stick: WDTv, roku, google chromecast. While it is the same. I find it a little bitter than the last two....if it's able to do what the WDTv can do as far as accessing my network and pulling movies from there and i will be a happy camper. It was worth getting it at the special prize! yay...", "verified": true, "helpfulness": "0/0", "author": "myenne"}]