[{"rating": 3.0, "review": "If it had the Time Warner Cable App it would be complete. There aren't many apps to download either. But its a good product. I returned it and go the Roku for the TWC app. And is has more apps to choose from. We loved Netflix and Pandora though.", "verified": true, "helpfulness": "2/2", "author": "Natalie Pitts"}, {"rating": 3.0, "review": "I have the stick and the box version of Fire.  Despite the fact that they only show the stick and controller in all the pics you also really need to use the included powerpack and plug that into the stick. It makes it a little less portable than without needing it.  My biggest issue is that it buffers alot.  I have both units on the same wifi network and the box does not buffer as badly.  The stick does it all the time and it is 10ft from the router.  It is honestly so so because of that.", "verified": true, "helpfulness": "0/0", "author": "Graham Mingst"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "sandyh"}, {"rating": 4.0, "review": "easy to figure out.  strong wifi signal.  good design", "verified": true, "helpfulness": "0/0", "author": "Brian Vigil"}, {"rating": 5.0, "review": "I was afraid I wouldn't be able to figure out how to connect everything. It was incredibly simple. I use Amazon instant video and Netflix. I highly recommend this cool little gadget", "verified": true, "helpfulness": "0/0", "author": "Karen Ann Scofield"}, {"rating": 5.0, "review": "Was easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Frank Menichini"}, {"rating": 4.0, "review": "Like it so far,still learning!", "verified": true, "helpfulness": "0/0", "author": "Charles R Priest"}, {"rating": 4.0, "review": "I own apple tv and chromecast as well. This one is great if you have amazon prime browsing is kind of a drag on the tv, so it's better to look it up on the computer before and search for it on the tv after. However the benefits are that it's a ton cheaper than apple tv and way more user friendly than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Tiffany April Adue"}, {"rating": 5.0, "review": "Love the fire tv stick. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it.easy to use", "verified": true, "helpfulness": "0/1", "author": "clarence"}]