[{"rating": 5.0, "review": "Product as described.Wring well for me!", "verified": true, "helpfulness": "0/0", "author": "RAS25"}, {"rating": 1.0, "review": "Slow", "verified": true, "helpfulness": "0/0", "author": "Nelle D"}, {"rating": 4.0, "review": "The best steaming media device currently available. I have owned several streaming systems, for ease of operation, speed and control the Fire Stick is by far the best. Great audio and video, minimal buffering.", "verified": true, "helpfulness": "0/0", "author": "mike james"}, {"rating": 5.0, "review": "I've homebuilt plenty of XBMC/Kodi boxes in the past. But my latest creation was having issues with the newest version of Kodi (likely due to a video card driver incompatibility issue on Linux), so I decided to pick one of these up on a whim. At $39, why not? And as a Prime customer, we weren't using the full benefits of Prime TV since the bedroom TV isn't 'smart'. This basically makes your non-smart TV a smart TV. Not to mention, you can (as I did) sideload Kodi and use the stick for Prime, Netflix, and local media with Kodi.It does hiccup on high-bandwidth items a bit, mainly 1080p, but I think this is an issue with my network and not with the device itself. Were I to buy again, I'd get the Fire TV box so that I could run cat5 to it rather than stream over wireless.", "verified": true, "helpfulness": "0/0", "author": "Richard Langis Jr."}, {"rating": 4.0, "review": "Overall its great quality, although the enable mirroring function can sometime be unstable with your phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 3.0, "review": "Convenient, but apps are not enough, not fond of the srructure or layout of the apps. Have to reconnect to apps if stick is removed from hdmi slot.", "verified": true, "helpfulness": "0/0", "author": "Jeannie"}, {"rating": 4.0, "review": "I receieved the Fire Stick as a birthday gift, and I love it! I can do anything, from streaming TV shows & movies off hulu, watching digital copies of movies I've purchased in my Flixter account, view photos on my Amazon Cloud, play games, stream music from Pandora, and so much more! I was considering spending money to buy a Smart TV, but with the Fire Stick, I can do all the same things and more!The only drawback I have is that it's not wireless: after you plug it into the HDMi port on your TV, you need a plug that goes from the stick to an outlet. A wire is supplied, but I wish it was longer, because the HDMi port on my TV is on the side, so I can't route it through the cable raceway on my TV stand. It ends up hanging on the side where it's noticable.Other than that, it's a great thing to have!", "verified": true, "helpfulness": "0/0", "author": "cmcino"}, {"rating": 4.0, "review": "Overall, I love it.  I ended up having to get a hdmi extension cable to get it far enough away from my other electronics because it kept dropping my wifi signal but now it works perfectly.  My only complaint is that HBO GO is not available yet and Showtime Anytime does not include DirectTV so I am not able to watch anything with the app.  Fix those two things and it's a 5 star!", "verified": true, "helpfulness": "1/1", "author": "Jeanine Pearson"}, {"rating": 4.0, "review": "It is a convenient way to watch Amazon and other (Netflix, etc) content. I would prefer that it was easier to organize or search.", "verified": true, "helpfulness": "0/0", "author": "Lisa E Cook"}, {"rating": 3.0, "review": "I got this as a Christmas gift and frankly... It's nothing special. We also have a Roku, and I like it a lot better than the Amazon fire TV Stick. The Fire TV Stick has very few useful apps. I basically only use Netflix and YouTube... All of the  system-specific apps are pretty useless. You can't play any games on it unless you buy a special controller. I can't get the flixster app to sync with my ultraviolet account so none of my movies are available. After setting it up and trying to use it for a while, we decided to switch back to the Roku and put the Fire TV Stick with the TV in the guest room... Where it never gets used. Hands down, I would suggest a Roku over this.", "verified": true, "helpfulness": "1/1", "author": "Jason Danley"}]