[{"rating": 3.0, "review": "I should have bought the Fire TV box in the first place .  I thought they did the same thing , I should have done a little more research.", "verified": true, "helpfulness": "0/3", "author": "Thomas Mitchell"}, {"rating": 3.0, "review": "I'm a DirecTV customer and already subscribe to HBO,  Showtime and Pandora.  I'm also a Netflix subscriber with access through my blu ray player.  So as I suspected, other than some Amazon Prime movies and shows not yet available on Netflix, the Fire Stick doesn't give me a lot more content that I'm likely to watch beyond what I already had.  But it was cheap, so I thought I'd give it a shot.It was very easy to install and set up took about two minutes.  The interface is clunky.  Amazon should have studied Apple, not Netflix.About the biggest plus, besides some Prime content not available on Netflix, is I can now look at my vacation photos on my tv rather than just my computer, tablets and phone.  I'm sure my guests will be thrilled.Not much ventured, not much gained.", "verified": true, "helpfulness": "0/1", "author": "Downing Bethune"}, {"rating": 1.0, "review": "Did not know that I needed wireless internet to use.  So I returned it.  My bad not knowing.", "verified": true, "helpfulness": "0/3", "author": "Renee Mahlman"}, {"rating": 5.0, "review": "This is a great product which really specs wise is better than everything in its class.  Roku has it beat only in the channel department.  Roku gives you the ability to replace your cable box because you can just sign in to the channel thru the Roku still saving you money on the cable box monthly rental fee..if Amazon adds the fox locals, abc locals etc..they would put Roku out of business.", "verified": true, "helpfulness": "0/0", "author": "Happy Buyer M-LA"}, {"rating": 1.0, "review": "Internet connectivity SUCKS.  I do not like the interface as much as the Apple TV - it is cumbersome to navigate.  The only good things about this are the price and the access to prime.", "verified": true, "helpfulness": "0/0", "author": "rachaelbear \"rachaelbear\""}, {"rating": 1.0, "review": "Don't like it. Trying to return. Isn't advertised as requiring to be plugged into wall. This isn't helpful for wall mounted Tv. Functionality stinks. Netflix won't get good picture. Network reception is bad even though directly next to wifi box. Poor product overall.", "verified": true, "helpfulness": "0/1", "author": "DoubleA"}, {"rating": 2.0, "review": "Worked beautifully for 2 weeks. Suddenly, I'm getting an error message saying \"movies currently not available\" but when I check wireless connection I'm connected to proper network and signal is listed as very good. Tried reloading but no luck. Advice????", "verified": true, "helpfulness": "0/0", "author": "Judy Gallian"}, {"rating": 5.0, "review": "The Amazon Fire Tv Stick works great. I pluged it in and in a few minutes it was up and running on my Sony LED TV. It took only a few minutes to connect to my Linksys Router which is 32' away. Have had it for about a month now and no problems using it. So if you are thinking about buying a smart tv look into the Amazon Fire TV Stick first, you may fine it to be your best choice. Also I have found that after about 4 hours of use it does get a little warm to touch, other than that it's your best buy.", "verified": true, "helpfulness": "0/0", "author": "Russell"}, {"rating": 3.0, "review": "The fire tv stick works pretty well, though it is designed to push out Amazon content. You have to go to the apps section to find Netflix, HBOgo, etc.  The main issue I have and the reason I only gave it 3 stars is it is not supported by all cable companies. I happen to have charter cable here in the Midwest and my roku worked perfectly until it had a housekeeping mishap. So I replaced it with the fire tv stick because I figured it would do the same thing as my roku but$10 cheaper. Well, that was a mistake. I tried to install hbo go and a couple of others and they are not supported by charter cable. It just recommends contacting your cable company.  Well we all know how that's going to end. So if you want to watch hbo go or sho anytime, make sure your cable company supports it before you order. Or, just order a roku.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Never was deliver  and  they wouldnt replace it, so no review. .", "verified": true, "helpfulness": "1/3", "author": "Robert Smith"}]