[{"rating": 5.0, "review": "Have the fire TV and bought the fire stick for my other TV. Both give me exactly what I wanted in this product.", "verified": true, "helpfulness": "0/0", "author": "Michaelvie"}, {"rating": 5.0, "review": "Excellent stick...been using it for a few months and it works great...and super fast. Love the Amazon Prime movies feature which is easy enough to find and use via the stick menu.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing ever invented  :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Any app involving playing music using this device simply does not work.Spotify app? The music stops randomly after a few songs.Pandora? Hops, skips, and jumps.Airplay? See the Spotify.Amazon Music? No thanks.If you have a \"Smart\" TV aka a television that has apps then you certainly do not need this dongle. It is cheap for a reason. I am utterly perplexed as to why anyone would ever claim that this device offers any value to your home entertainment system. It's neither here nor there - period.", "verified": true, "helpfulness": "0/0", "author": "Buddy Howl"}, {"rating": 5.0, "review": "- high build quality, includes all needed accessories- very stable WIFI, compared to Chinese Android sticks- 1080p picture quality is very good- bluetooth remote works well, no line of sight needed- much more functional than a Chromecast, since it can run without being initiated by another device, also allows you to install many Android apps and like the Chromecast fling content from tablets/phones- Ability to sideload apps without much effort is great- recommend getting these for each of your TVs", "verified": true, "helpfulness": "0/0", "author": "Jude Dsouza"}, {"rating": 5.0, "review": "I just love it will be ordering other soon.", "verified": true, "helpfulness": "0/0", "author": "vicky henley"}, {"rating": 1.0, "review": "Amazon Fire TV Stick needs so many improvements!!", "verified": true, "helpfulness": "0/1", "author": "Willie R Logan"}, {"rating": 4.0, "review": "Have not used it much since receiving it, but setup was very easy and from what little I have worked with it, it is great.", "verified": true, "helpfulness": "0/0", "author": "Sue \"TeddySue\""}, {"rating": 5.0, "review": "What's not to love about the Fire Stick? Turns any TV with an HDMI port into a smart TV and takes up almost no space.", "verified": true, "helpfulness": "1/1", "author": "Walter"}, {"rating": 5.0, "review": "Doesn't get much better than free with subscription to Sling TV!", "verified": true, "helpfulness": "0/0", "author": "Cara Ng"}]