[{"rating": 4.0, "review": "The only things it is missing is a universal search function, it is also missing some popular free channels there are no Sky, Channel 4 and ITV catchup services. if these were included in an update it would be a perfect smart TV solution.", "verified": true, "helpfulness": "0/0", "author": "L H Thomas"}, {"rating": 3.0, "review": "Not streaming well enough to keep. I have no problem streaming movies through Apple but his device being wireless doesn't have the capacity for me to view anything and mu router is only 15' away.", "verified": true, "helpfulness": "1/1", "author": "James Vincent \"Avid Reader\""}, {"rating": 3.0, "review": "I expected more from my fire stick the image lags and freezes. I have Verizon fios so it's not he connection because I spoke to them and it's at its top notch. Most likely returning the item.", "verified": true, "helpfulness": "0/0", "author": "Xiomara C."}, {"rating": 1.0, "review": "Decent interface. Buffers often, sometimes glitching and stalling when watching netflix and even my own amazon library. My roku I have on another tv works fine. Don't know if this is software or hardware but get a firmware update amazon. Its ridiculous when your own device won't play your content.", "verified": true, "helpfulness": "0/0", "author": "Aldizar"}, {"rating": 3.0, "review": "This works well for Amazon videos.  I am very disappointed that I can't get Bravo TV or web searches with this. I cant even mirror my older Kindle HD Fire with this.  I couldn't get my phone to mirror onto this either.", "verified": true, "helpfulness": "0/0", "author": "Another opinion"}, {"rating": 5.0, "review": "as expected", "verified": true, "helpfulness": "0/0", "author": "Melodee"}, {"rating": 3.0, "review": "I'm posting this as an OK product because of the service I received from Amazon and although I just got it and haven't used it much yet.I received the product and got it home and could not get it to connect to my home network(COMCAST). I put in the password NUMEROUS times(YES my password was correct) and it still would not connect. I called Amazon and they, of course, walked me through several things. Those things did not work. They then assured me they would call me the next day with a solution to my problem. I then receive an email from Amazon telling me to do the same things that I had just done so I call back and was AGAIN assured someone would call me the next day. Well, the next day rolls around AND I RECEIVED NO CALL FROM AMAZON. HOWEVER, just out of curiosity, I tried to connect and low and behold it finally connected. BUT I STILL RECEIVED NO CALL FROM AMAZON AS PROMISED. I don't care if they somehow knew I was connected or not LYING TO A CUSTOMER IS NOT A GOOD WAY TO HANDLE CUSTOMER SERVICE ISSUES! I finally got connected and it kept losing signal at first until I figured out I needed to move my router---I did that and FOR NOW it seems to work fine.", "verified": true, "helpfulness": "0/0", "author": "Terrie Coleman"}, {"rating": 5.0, "review": "I love this stick. It's got the most of the apps I use to watch TV and movies and the apps it doesn't have...I assume that has to do with the app developer/owner and not amazon.I like the UI and navigation. Overall this is a nice product which, I assume, will only get better.", "verified": true, "helpfulness": "0/0", "author": "Timothy Kerr"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/1", "author": "William L."}, {"rating": 4.0, "review": "Works good,", "verified": false, "helpfulness": "0/0", "author": "J. Lipham"}]