[{"rating": 4.0, "review": "Love it. My only complaint is the remote doesn't have backlighting", "verified": true, "helpfulness": "0/0", "author": "Corey Thompson"}, {"rating": 5.0, "review": "Love it, really enjoying the Fire TV Stick!!", "verified": true, "helpfulness": "0/0", "author": "Rachel Woods"}, {"rating": 1.0, "review": "Won't work with my current Comcast Wi-Fi integrated router.  No matter what I've tried, all attempts have failed, and I'm an IT professional.  Will be calling support, but will likely be returning the device if the issue doesn't get resolved.", "verified": true, "helpfulness": "2/3", "author": "Chris M McMillan"}, {"rating": 3.0, "review": "Wishing a better selection of online channels were offered.", "verified": true, "helpfulness": "1/1", "author": "Dan Moletz"}, {"rating": 5.0, "review": "I prefer the Fire TV stick over any type of media device (Chromecast, Apple TV, Roku, etc).The Fire TV stick can be used as a standalone device with the remote. I don't have to have my tablet or phone around in order to launch apps or watch Netflix, etc. Half of the time, my devices are rarely charged and always running on low battery. I love the remote that comes with this device. It can be used for everything. For some odd reason, I never lose it either. It is comfortably small.You can download apps to the Fire TV stick. I was amazed at this. I tried a demo of \"You Don't Know Jack\" and \"Fibbage\" and ended up having to purchase the entire 2015 Party Pack for $24.99. Guests are amazed at how innovative these games are. You can connect to the Fire TV with your cell phones and devices and play games in conjunction with your TV. It's so hilarious and entertaining. Yes, I know you can do something similar like this with Chromecast, but the quality of the apps available for the Amazon Fire series are jaw dropping. You can download a fireplace app or an aquarium app to play on your TV, etc.For the price, it is so worth it. I recommend it over and over to all of my friends looking for something that is affordable and capable of playing Netflix, Hulu, etc. You get so much more than what it is priced for. Why buy something that costs more than this?!", "verified": true, "helpfulness": "0/0", "author": "digitalelectric"}, {"rating": 4.0, "review": "Love the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Richard L. Dixon"}, {"rating": 1.0, "review": "Side by side comparison...The stock drops Wi-Fi constantly while the Roku performs.  I will return this item rather than giving it away.", "verified": true, "helpfulness": "1/2", "author": "Richard Firth"}, {"rating": 5.0, "review": "LOVE the Amazon Fire Stick... has made catching up on my fave shows easy, finding new fave shows simple and watching tv in my bedroom will never be the same!!!", "verified": true, "helpfulness": "0/0", "author": "Penny Armstrong"}, {"rating": 1.0, "review": "It's a piece of crap.  Works a few minutes then drops signal, and I've 30mb service.", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I am glad i purchased this fire stick. I delivers ss promised.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}]