[{"rating": 5.0, "review": "Super easy to use! We no longer watch regular TV, as this has taken over our world!", "verified": true, "helpfulness": "0/0", "author": "Jared Rosenkranz"}, {"rating": 5.0, "review": "Great Seller !!", "verified": true, "helpfulness": "0/0", "author": "Chris Bartolomeo"}, {"rating": 4.0, "review": "I had a little trouble, but the trouble shooting app helped", "verified": true, "helpfulness": "0/0", "author": "Lena Pennyfeather"}, {"rating": 5.0, "review": "It is fantastic!  i really enjoy it!", "verified": true, "helpfulness": "0/0", "author": "Gary Terlisner"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick! I could only watch my Prime shows & movies on my kindle or computer. With Amazon Fire TV Stick I can now have my family enjoying watching with me! Thank you AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Angela Ortega"}, {"rating": 4.0, "review": "***-1/2 stars!I love my Fire TV.  It's been great so far.  So getting this one was a no-brainer (got this at the early promo price.)  It works just like the Fire TV but here are my two issues.One, the wireless signal is not as strong as the Fire TV.  Even with a gigabit dual band wireless router, the reception is spotty in the upstairs bedroom (router in living room.)  Other blogs (not on this site) say the same thing.  So keep in mind that the Stick needs to be closer to your router (even with a gigabit dually).Two, this thing gets really hot.  My fear is that it will eventually burn out.  Worse case, cause a short and fire (no pun.)  I know my FTV gets hot too but not like the Stick.  So consider safety if using this on your wall-mount TV.Just a minor issue, I think it would be better to have the power port on both sides of the stick (if not opposite of where it is constructed now) because most HDTV have their HDMI ports on the left side (from screen perspective).  Older ones have the HDMI ports going perpendicular to the TV's (thanks of the flexible extender).  In any case, the power port (it has one but commercials don't tell you it has one) is up when inserted into my TV. Therefore, the power cable plugs on the upward side then has to hang down (which can tug on your stick).  Not a big deal.Other the than the two, it is comparable to the Fire TV.  I do not think these Sticks are meant to be long-use though.  Would recommend the FTV.", "verified": true, "helpfulness": "0/0", "author": "Odii Gis"}, {"rating": 5.0, "review": "Everything and more than I expected!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "There have been issues with the apps loading properly, even though the stick is right next to the router. There are extensive issues with using the remote and the application responding improperly. The setup was easy and I like the look and feel, but try to flip through with the remote is extremely frustrating, it does not work well. I am hoping there is a software/firmware fix.", "verified": true, "helpfulness": "0/1", "author": "John Mellios"}, {"rating": 4.0, "review": "Great product!!PROSEasy setup , ease of use , lots of options , quick uploads .CONSOnly can view on TV its hooked up too.", "verified": true, "helpfulness": "0/0", "author": "Hungry Guy"}, {"rating": 5.0, "review": "Just plugged in and ready to go.  Awesome to be able to quickly SMART capabilities to my dumb tv.  Some people have said that the Stick is slower than the Amazon Fire TV, but there is no doubt that it is quick.  No lag in processing or video.  Only bad thing is now I have a third remote to contend with. (Dish, TV, Fire Stick)", "verified": true, "helpfulness": "0/0", "author": "cboe"}]