[{"rating": 4.0, "review": "Works as advertised, disappointed that it has no parental controls, since I put it into my daughters room. It does allow to restrict purchases or add a pin for everything, but not much good it she has to come get me to enter the pin for every move she makes. If your purchasing for a child's room, better go with the more expensive TV option.", "verified": true, "helpfulness": "0/0", "author": "Kenny W."}, {"rating": 1.0, "review": "This was extremely easy to install and get started using it.April 12, 2015: very disappointed. Can watch Amazon Prime content, but not Netflix. Diagnostics indicate a good connection for NF though. So if you plan on watching NF, do not buy this.", "verified": true, "helpfulness": "0/0", "author": "Daniel-san"}, {"rating": 5.0, "review": "Very cool little gadget.  I had a Google Chromcast which i was impressed with at first but the Fire Stick is even better.", "verified": true, "helpfulness": "0/0", "author": "R \"M\""}, {"rating": 5.0, "review": "It's Absolutely Wonderful!!!!! Super easy to navigate. Even my four year old can use it!", "verified": true, "helpfulness": "0/0", "author": "channyt30"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 2.0, "review": "It's not dependable, it keeps reloading during each show.  I'm going to return it.  My Chromecast works much better.", "verified": true, "helpfulness": "1/1", "author": "Marilyn Rose"}, {"rating": 5.0, "review": "The only things the kids liked better was the new TV's purchased to use with their new fire sticks!  Amazon does it again!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Doesn't do any good if you don't have a amazon account ... more so, its a marketing strategy to sell you even more stuff . Would have sold it back if didn't have a preinstalled account on this ... DON'T BUY...", "verified": true, "helpfulness": "1/1", "author": "altamash"}, {"rating": 3.0, "review": "When it is working properly it is great . I own both the Fire TV and Fire Stick . The Fire Stick needs to be rebooted (unplugged for a few seconds then plugged back into HDMI port)  too often !", "verified": true, "helpfulness": "0/0", "author": "Jerry C."}, {"rating": 4.0, "review": "Works as intended. Plugs into hdmi then plug in the included power adapter.Took a while to get set up with updates and downloads, but I attribute that to being the first day it was released.", "verified": true, "helpfulness": "0/0", "author": "ChaosAD"}]