[{"rating": 2.0, "review": "I wanted to give this more than 2 stars. I really did. The layout and format is excellent. I enjoy that more than the Roku and my Vizio smart tv. However, it has connectivity issues. I'm constantly having to \"forget\" my network and reconnect to load stuff. It doesn't load near as quick as the Roku or Vizio and sometimes seems to take time to buffer when my others don't. Get the kinks worked out next time before you release your product Amazon.***I will note that I purchased this thru Amazon prime on pre order so maybe now that they're in regular production this connection glitch is fixed.", "verified": true, "helpfulness": "1/1", "author": "John Adam Pace"}, {"rating": 4.0, "review": "Easy setup.  Works well on newer tv's.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Snoblin"}, {"rating": 5.0, "review": "Great price for what I wanted - thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Bluesky Walker"}, {"rating": 1.0, "review": "This was a waste of money. The amazon video app on my ps3 works better ... it doesn't freeze every five seconds like the Amazon Fire TV Stick. The menus take forever to load and this device is just slow to do anything. Don't buy this.", "verified": true, "helpfulness": "1/1", "author": "avid reader"}, {"rating": 5.0, "review": "I love this.  It was very easy to setup and to use.  I love not having to hook up my iPad to use Netflix or Prime.  Also nice to have the ability to move to other TV's.Highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Travis R. Larson"}, {"rating": 5.0, "review": "Installation was easy, set up, log in easy as well. Home menu is simple and filled with choices. Love it! We bought this for a new 27\" wifi kitchen TV.  Prime movies, apps, slide show screen savers. Love the aquarium.  Have been uploading family photos to Prime Cloud, now I have them on slideshow to keep me company in the kitchen.  Next project, scanning my recipes to organize and display large enough to see without readers!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty awesome for a room with no cable outlet", "verified": true, "helpfulness": "0/0", "author": "Jeff Jenkins"}, {"rating": 5.0, "review": "This product really beat my expectation .  Clear and rich video and sound. I wish sideloaded app will show on main screen. It's worth more than the price. Now I'm considering dumping Netflix for prime.", "verified": true, "helpfulness": "0/0", "author": "SAHEED OSHIDELE"}, {"rating": 5.0, "review": "This is now my dedicated Fibbage machine. I'm getting a second one for the bedroom.Because this runs Plex ($5 app) it's a complete replacement for my home theater PC. I've been running a Plex media server for a long time now and have always relied on the web interface for computers. The Fire TV Stick let's me break that mold, get rid of an extra box on my TV stand.", "verified": true, "helpfulness": "0/0", "author": "S. M. Pitman"}, {"rating": 5.0, "review": "Awesome piece of technology, best purchase by far.", "verified": true, "helpfulness": "0/0", "author": "Roy Vargas"}]