[{"rating": 1.0, "review": "I 'm a  flight attendant so I bought the fire stick to take with me while I'm on the road. While it worked fantastic at home it does not work in any of the hotels which is the reason I bought it. I'm very disappointed. I would recommend it for home use but for hotels its useless. I understanding they are trying to resolve the issue but there's not a time frame for when that will happen.", "verified": true, "helpfulness": "1/2", "author": "Debbie Wheeler"}, {"rating": 5.0, "review": "great quality product", "verified": true, "helpfulness": "0/0", "author": "ALVARO MARTINEZ"}, {"rating": 4.0, "review": "I have two of these, and they both suffer a slight buffering on occasion. Not sure if it's the sticks or the WiFi.", "verified": true, "helpfulness": "0/0", "author": "R. Hunter"}, {"rating": 5.0, "review": "i got this mainly because for the sling tv, but this product works great! navigation needs a little improvement, but still not bad at all.", "verified": true, "helpfulness": "0/0", "author": "Eug Liao"}, {"rating": 3.0, "review": "i would definitely purchase the fire tv box instead. the stick works sometimes but not all this time and has a hard time connecting to wifi. i purchased a firetv box and a stick, for two different rooms and i like the box much better.", "verified": true, "helpfulness": "1/1", "author": "Nicole Sidoti"}, {"rating": 4.0, "review": "though it was great would recommend it to most people I talk to!", "verified": true, "helpfulness": "0/0", "author": "Jim Messick"}, {"rating": 4.0, "review": "I love the Amazon Fire Stick for it's price, ease of use, and access to programming.  I will limit my review to limitations of the Amazon Fire Stick since it does essentially the same thing as the Roku, and Apple TV, but is less expensive.  I have tried both a Roku and this product and they are virtually the same, except as noted below.  I gave it only four stars for four reasons: 1) There is no way to show only the Amazon Prime Free Programming.  You can put a PIN prompt on it so that you will not inadvertently rack up charges, but there is no way to filter the programming only available for purchase out.  2) The voice search and search seems to only index Amazon's offerings.  Why would I want to pay for a program that I can can get for free through my Netflix or Huluplus memberships?  3) The organization of the entire channels/apps is Amazon centric and it is difficult to configure for an older person to use (my 80 year old mother is now using a Roku, since she had issues with this since it kept prompting her for payment for Amazon programs when she was trying to use Netflix).  You cannot place only the channels/apps in an order that works for you.  Everything always is directed back to Amazon products.  4)  The search and programming with the remote is letter by letter and annoying, there should be the ability to use a laptop or keyboard to search different apps/channels (same as Roku).  This review may seem critical, but I do like/love the Amazon Fire TV stick and would love to see these improvements to have it rise above its competitors.", "verified": true, "helpfulness": "0/0", "author": "Toshie"}, {"rating": 5.0, "review": "All I can do is praise this device! It arrived already setup for my account, and I just plugged it in I am now able to take better advantage of amazon prime instant video! The performance is fast and generally works well! Thank you Amazon for bringing more entertainment into my home! There is even an app that let's you do airplay from an apple device!One Hardware Suggestion: the power transformer, while beautiful in design, is a little too large to fit well on a standard power strip/surge protector. Also, the cord comes out of the bottom making hard to use an adjacent plug on the surge protector. I swapped it with an Apple USB Charger which is smaller and that fixed my plug problems!Also, Bring HBO Go to Fire Tv!", "verified": true, "helpfulness": "0/0", "author": "GisMofx"}, {"rating": 5.0, "review": "The wife and I finally cut the chord from cable/satellite, and are happy we did.  After buying the Amazon Fire TV for the downstairs TV and being very pleased with it, I bought the Amazon Fire TV Stick for my man-cave TV.  It allows me to watch the shows I wan't to watch with HULU, Netflix, and Amazon Prime.  I may have to wait longer to catch up on the shows, but its worth it not having to be a slave to cable providers.  The Amazon Fire TV Stick was stupid simple to set up, and very easy to use.  The device comes pre-loaded with most apps you'll use, and it is easy to download and install others.  It is also a gaming system, although I haven't used this feature.  I look forward to buying the gaming controller so I can try out the games.  I also like that the remote is Bluetooth so you don't have to point the remote at the USB Stick; a great feature for lazy bums like me who can't be bothered with lifting my arms off the couch.  The Stick doesn't have the voice search feature like the Amazon Fire TV box, but that's okay...I don't use it that much anyway.  It also comes with an extension dongle in case the USB port on the TV is too tight to fit the Stick like on my TV.  I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "FilbertBobstop"}, {"rating": 5.0, "review": "Fantastic little device. It's very fast and responsive, unlike a lot of internet TV devices I've tried. The remote is really functional; the Fire TV Stick is easy to control.", "verified": true, "helpfulness": "0/0", "author": "C. Bisanar \"VidRoth\""}]