[{"rating": 5.0, "review": "Easy to use.  Love it", "verified": true, "helpfulness": "0/1", "author": "Michelle Russell"}, {"rating": 3.0, "review": "Better than my Chrome because it has an actual interface and remote. Still has some quirks though.The system never restarts or turns off. It just sleeps. The memory gets bogged down very quickly. Amazon video app usually hogs a ton of resources (just under 300MB) even when it has never been used.", "verified": true, "helpfulness": "0/1", "author": "Matthew"}, {"rating": 4.0, "review": "Like product but did not know I needed WiFi to use it.😊", "verified": true, "helpfulness": "0/1", "author": "Amy Fukushima"}, {"rating": 4.0, "review": "Needs a longer power cable!", "verified": true, "helpfulness": "0/1", "author": "Franktastic4"}, {"rating": 5.0, "review": "awesome little thing, looking forward to windows mirroring!  otherwise, amazon, netflix, android mirroring works fine", "verified": true, "helpfulness": "0/1", "author": "Eric Sun"}, {"rating": 2.0, "review": "Works ok... I bought it mostly for the miracast capability. I had tried a generic miracast dongle and i was unuseable. The miracast function works but you cant really use it to watch movies.... Lags and chops the audio. Netflix works ok on it.... Seems to buffer more than my gaming console does while streaming. Dont get amazon prime just for movies.... Netflix has a better selection for a buck less a month. I suppose it works ok if you just want to watch netflix or watch an incredibly expensive rental. Maybe ill try chromecast i hear it miracasts better.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really like the amazon fire tv stick. the only thing that i would need to do is get more experience using it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had it installed in less than 5 mins with no issues. The device is obviously geared toward Amazon prime content and the scroll speed through menus is slower using HBO Go and Netflix but shows load quickly once selected. I got mine on sale but even at the current price of $39 this is a great value for adding streaming functionality to a TV.", "verified": true, "helpfulness": "0/1", "author": "Christopher Forsythe"}, {"rating": 5.0, "review": "you can use your phone to control the fire stick through an app! That's amazing. Netflix, spotify, YouTube, and even Kodi run great on it. I love being able to push music to my tv using the spotify app and also being able to push YouTube videos to my tv as well.I've used a chromecast before and this is way better. You can use your phone but you don't have to unlike the chromecast.", "verified": true, "helpfulness": "1/2", "author": "Jesus I"}, {"rating": 2.0, "review": "Slow speed than Chromecast and roku,  and unable to use mirroring feature with andoid devices.", "verified": true, "helpfulness": "0/1", "author": "yewming chiong"}]