[{"rating": 1.0, "review": "No matter what we did, including getting a second stick after returning the first, we couldn't get the service.  I don't know if our signal wasn't strong enough or what.  We love our Amazon Kindle Fire TV and use it all the time.  The stick however, just doesn't make the grade.", "verified": true, "helpfulness": "0/0", "author": "Steve B"}, {"rating": 5.0, "review": "Easy set up. Lots of content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As described - great with Prime account for our 2 year old and for travel", "verified": true, "helpfulness": "0/0", "author": "C. Huffman"}, {"rating": 1.0, "review": "CHECK YOUR INTERNET SPEED BEFORE YOU BUY THIS! It does not work on our TVs!  We have the slowest Internet speeds in the country! Will not work til we upgrade our services! There is no faster service available in our area at this time. I wish that Amazon would tell you that your speed must be 3.5 MBPS minimum for the Fire TV Stick to work. We have 1.0 or less! We also have Amazon Prime and the movies do NOT work for us either. Not Amazon's fault but I feel they should mention this in the ad or promo!", "verified": true, "helpfulness": "0/0", "author": "Dusty Miller \"Casey\""}, {"rating": 5.0, "review": "What can I say that every one else has not already said. Handy when traveling!!", "verified": true, "helpfulness": "0/0", "author": "Thom"}, {"rating": 5.0, "review": "Works great, we haven't had any issues with the firestick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Wendi Lynn Turner"}, {"rating": 5.0, "review": "I think everyone should have one .", "verified": true, "helpfulness": "0/0", "author": "robert j feenstra"}, {"rating": 5.0, "review": "Perfect.  Will get another one soon. Super easy set up sand worked great for Amazon video and Netflex", "verified": true, "helpfulness": "0/0", "author": "srae \"srae\""}, {"rating": 1.0, "review": "I'm sure this works great for some but it constantly lost the wifi signal and didn't work with my surround sound.", "verified": true, "helpfulness": "0/0", "author": "jonathan kearley"}]