[{"rating": 4.0, "review": "Ok for the price! But if you're looking for something that performs a little better you have to go for the fire tv.", "verified": false, "helpfulness": "0/0", "author": "Nunoboxe"}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Michael B. Hill"}, {"rating": 5.0, "review": "Canceled DirecTV because of this awesome little TV tool. Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Bradley Sullivan"}, {"rating": 2.0, "review": "Didn't expect that it would differ from my Kindle. The Kindle allows apps like Disney Junior to play without a cable provider, fire stick does not. It's also a pain to add apps and then go to a website to activate them and then realize you again need to have a cable provider. We got Fire Stick and Chromecast because we don't want to pay for ridiculously high priced cable.", "verified": true, "helpfulness": "1/1", "author": "buckmm"}, {"rating": 5.0, "review": "Easy to set up and very user friendly. We now have access to everything in one place.", "verified": true, "helpfulness": "0/0", "author": "suzanne"}, {"rating": 2.0, "review": "The stick is much larger than it looks. It also requires a USB power cord which is not shown in any ads. The power cord is in the package, but you need to be aware that an electrical outlet has to be close to the TV.", "verified": true, "helpfulness": "0/1", "author": "David Hogan"}, {"rating": 4.0, "review": "I have only had it for a few weeks now but I do like the functionality it allows for torrent streaming apps.  My only complaint would be the remote is a bit bothersome to use upon initial setup.  Otherwise, its a very promising device.", "verified": true, "helpfulness": "0/0", "author": "Russ"}, {"rating": 5.0, "review": "Easy to set-up.  Easy to use.  Makes your TV \"smarter\".", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Bought 3 of them to add to my bigger TV's that did not have the Amazon button on the remote and no app available.  Works really good, the remote works good, and the iPad app is good.  Only complaint is the need for the power cord.  Would have been easier if this could be powered by USB.  I tried it, but the Fire Stick kept restarting, otherwise would have had 5 stars.", "verified": true, "helpfulness": "0/0", "author": "GO"}, {"rating": 5.0, "review": "Runs smoothly even if connection isn't keeping up.  Enjoying using this.", "verified": true, "helpfulness": "0/0", "author": "Morgan"}]