[{"rating": 1.0, "review": "Very disappointed. I cannot believe it has to be powered! Yes you have to plug a separate USB power adapter into the wall. I fully expected I could just throw this little puppy into my pocket and take it anywhere for any TV but no, I have to lug a cable and power adapter with me too. Amazon, I think this was a bait and switch cause nothing on the web talks about power when I bought it.Secondly, everything was good until it updated its software. Now the screen has a bit of \"snow\" (yes for you old schoolers, that analog snow you get from a poor connection) and every once in a while my screen drops off completely as if it was not plugged in at all.I bought 2 for the $19 prime intro price, I wouldn't have bought 1 if I knew it had to be powered.", "verified": true, "helpfulness": "5/41", "author": "nanclus"}, {"rating": 1.0, "review": "doesn't work on my 5 year old Sharp TV.  Tried it on my sister's newer TV and it worked fine.  So, if I need a new TV, I will be able to get Amazon Prime on there anyway, so wouldn't need this.", "verified": true, "helpfulness": "3/19", "author": "Deb T. \"Debbie\""}, {"rating": 1.0, "review": "We stream video throughout our house without problem and we wanted the Fire Stick to make it easier to access Amazon Prime content.  I've been disappointed so far.  The device drops wifi connection repeatedly.  It actually performs worse (video quality and dropped connection) than the built-in Amazon streaming on the Sony TV to which it is connected.", "verified": true, "helpfulness": "4/9", "author": "Telemachus"}, {"rating": 5.0, "review": "I'm a media addict and have been for well over a decade.  I have tried all sorts of solutions under the sun to try and create a mostly seamless experience in being able to both stream media and access locally stored media.  I have Chromecasts which with their single 2.4Ghz band support are mostly worthless in my subdivision due to interference.  I recently went to Plex to host all of my local content which has exceeded my expectations so now anything that I'm looking to use must support it which the FireTV stick does perfectly.  Beyond local content, Netflix and Amazon Instant Video (I'm a Prime Member) work perfect as well.I do not believe in the current trend of \"Smart TV's\" and I actually go out of my way to stay away from them.  I prefer to \"bring my own\" intelligence to the TV and so far the FireTV is the best answer.I love the fact this comes with its own remote and can be purely standalone without the need for other devices (PC/Phone) in order to stream although I do hope that in the next generation they add IR capability to be able to control the volume.  I also think adding the ability to control the stick via IR (with an extension cable) for those of us with universal remotes would be a step in the right direction.Update 1/1/2015: I have purchased a few more bringing my total to 4 sticks in the house.  As other reviewers have indicated WIFI range/speed seems to be a bit spotty and not because of the distance of my router which is only 20ft away.  I have also experienced some problems in streaming Netflix content while Plex and Amazon work just fine (in addition to having to sign in to Netflix each time).  Additionally, I have found that it is incompatible with my Samsung DLP (Rear Projection) receiving the \"Unsupported mode\" error.  I tried fixing this by manually setting the resolution from Auto down to other settings but was unsuccessful in getting it to display.  This is obviously a first generation product and I hope that future firmware updates fix some of the issues but for the price I'll keep them even if just for Plex.", "verified": true, "helpfulness": "1/3", "author": "Carl Fugate"}, {"rating": 4.0, "review": "So disappointed.  I had no idea this needed to be powered as you never see an advertisement with the cord hanging from it.  Setup was ok after initial download and install.  After updating I got asked for my wifi password a second time.  In the middle of typing it out again, the screen disappeared and it all worked.  Kind of weird, but whatever.  I wasn't even able to try anything out before the GUI became unresponsive.  Then when it did respond to remote button presses it would have tons of lag.  Then all of a sudden the selection highlight would just automatically scroll all the way up or down the list for no apparent reason.  With essentially what feels like no control with the remote, and no other method of control, I gave up on the thing.  Very disappointed in Amazon and a waste of $20.  Not really sure what the benefit of this will be compared to what I can do with apps on my PS3 (assuming the thing actually worked).Update 1/31/15:  I finally decided to try this again and see if a reset of unplugging the unit and plugging it back in worked.  The SW seems to function fine now which is good.  Using to stream ShowtimeAnytime mostly right now.  I prefer my Chromecast and envision myself using that more often for streaming things to my TV, but I am much more happy with this product now.", "verified": true, "helpfulness": "3/11", "author": "stratocaster1422"}, {"rating": 5.0, "review": "For the price, you can not beat this! I purchased this during the special pricing for Prime members and finally got it hooked up and working for a few days and wow! I am impressed. If this goes on sale again in the future, I will be stocking up for gifts and every room in my house. The ease of use is wonderful, the simplicity is great and the array of things you can do is fabulous. I love the fact that you can use your phone as a remote and type in or speak your searches instead of having to buy another remote or something like that.The ability to have Netfilx, Hulu, and Amazon Prime Video all on one handy little unit is excellent.Bottom line for me - the price of this, even at twice what I paid is still great. I had a roku and hated it right away. I am a prime member, so that may make a difference in my opinion of this but I think the value is excellent and the free movies available are better than netflix by far!", "verified": true, "helpfulness": "14/16", "author": "Nikki"}, {"rating": 1.0, "review": "After two days i was able to stream from netflix five entire seconds, still unable to watch any movies from amazon. Wifi absolutely horrible makes the device useless and no it's not my router I have a chromecast connected to the same tv and works perfectly. Going to return the product.", "verified": true, "helpfulness": "5/10", "author": "Luis Miguel Soares"}, {"rating": 5.0, "review": "Just received my Fire TV Stick today and I am already in love with it! I have been an Amazon Prime member since it was first offered and I love the 2 day shipping benefit, but have not really taken advantage of the free movies and tv shows that are also offered. I have never figured out how to find and play the free movies with my Blu-Ray player that plays Amazon videos.I like watching videos on my TV verses my laptop.It took only a few minutes to take the Fire TV stick out of the box, plug it in to the tv and power outlet, and then to get it set up on my wireless network. It did take several minutes more for the software to update, but then it was already to go!Everytime I have rented Amazon Movies my Blu-Ray player took about 5-10 minutes to download enough of the movie for me to start watching it. I was amazed at how the Fire TV stick immediately started playing the free Prime movie I selected tonight without any buffering or pausing.I downloaded the Fire TV Stick remote app onto my Samsung Galaxy 5S and was able to search for movies using voice search.I am now so pleased that I will be able to take full advantage of my Prime membership - the Fire TV Stick is a must have for Amazon Prime Members!", "verified": true, "helpfulness": "1/3", "author": "Ruth M. \"Navy Wife\""}, {"rating": 3.0, "review": "Initial setup was ok. Ran into issues with network connection being dropped on wi-fi 2.4Mhz and 5Ghz, which is very pathetic since the new ac router was less than 1 feet away. Kinda of annoying that you have to watch the video before your are able to use the system. Same thing with the firetv remote app. Have access to all prime video. Netflix works with firetv app keyboard unlike Nexus Player remote app keyboard that doesn't work with netflix. I bought it since I primarily use plex which is a total failure but it's not really amazon's fault, maybe. If you have a plex psss, you still have to pay for the plex app for $4.99(plex's fault, maybe amazon's for not allowing plexpass) or wait till amazon store has it for free. The other option is to sideload the plexpass app which requires enabling developers mode, allowing unknown source apk install, adb, and the apk. Once you get it sideloaded, the icon does not show up on screen(amazon's fault) so you have to go to settings-> Applications->Manage All Installed Applications->Plex->Launch Application. It's a pain in the ass to have to do this every time(plex and amazon's fault). The physical remote in ways are better than Nexus Play which is annoying with the fast forward function.Bottom line, if you are fully into the prime video ecosystem, this is the play for you. If you want to use it for Plex and have a plex pass but don't want to pay for another plex app, then look somewhere else. If you want plex, amazon prime video, and google video then your only option is the Roku which is under powered. Just got my firetv stick today and it will go back into the box until plexpass is allowed on amazon store or plex is free one of these days.", "verified": true, "helpfulness": "1/5", "author": "CAgamer"}, {"rating": 5.0, "review": "Very fast and works well. Works as well as my Roku 3 at a 1/3 of the price.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}]