[{"rating": 5.0, "review": "The fire stick is amazing. It does not tell you that you need to plug it into a power source but other than another power plug running from the tv, it does the job. I can use my Kindle to control what I'm watching instead of using the remote. We bought two so we could use the other to travel with. Would buy one for every tv if my husband would let me.", "verified": true, "helpfulness": "0/0", "author": "Krista Morazes"}, {"rating": 5.0, "review": "As of right now, I'm really enjoying the Fire TV stick - it was really easy to set up in the HDMI port of the TV, & I also downloaded the remote control app on my Android phone, although it did come with a remote control which works well. Currently I'm only streaming the Amazon shows, & have Amazon Prime, so I have a lot of options, but can also connect to other sources (Netflix, Hulu Plus etc.) if I want. I've had no problem with the shows loading and I'm really enjoying being able to watch shows I missed on the TV as opposed to my smaller Kindle or Android phone! Really love it!!!!", "verified": true, "helpfulness": "0/0", "author": "nomadheart"}, {"rating": 5.0, "review": "It went together in minutes. Performs great. I highly reccomend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As stated.", "verified": true, "helpfulness": "0/0", "author": "C. Hann"}, {"rating": 1.0, "review": "Have to pay to see anything!", "verified": true, "helpfulness": "0/0", "author": "Catarina Faria"}, {"rating": 4.0, "review": "I like it fine . Excellent quality video. But I think it is ridiculous that they want to charge 1.99 per Dallas episode when it's already been out for the last 30 years on VHS and now on DVDS. Should be free!", "verified": true, "helpfulness": "0/0", "author": "Billy Flag"}, {"rating": 3.0, "review": "I like the fire stick. I don't like having to pay for movies as a Prime member. For a hundred bucks a year they should be free!", "verified": true, "helpfulness": "0/0", "author": "gina craig"}, {"rating": 4.0, "review": "Easy to set up . Worked great . Will be use primarily for Netfix", "verified": true, "helpfulness": "0/0", "author": "donna stad"}, {"rating": 5.0, "review": "Love it, but it's definitely awesome when you are an Amazon Prime customer.  VERY easy to use and I love the standard remote that comes with it - no more squinting in the dark to figure out which button I want!", "verified": true, "helpfulness": "0/0", "author": "Amber"}, {"rating": 5.0, "review": "I bought the Fire TV Stick to replace a Roku stick...I really like the speed of the UI as the one in the Roku is kind of sluggish...content wise it has everything that I wanted and also have the chance to play some games with it. Really nice device for the money.", "verified": true, "helpfulness": "0/0", "author": "Alex Loaiza"}]