[{"rating": 4.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "James Wimbish"}, {"rating": 3.0, "review": "Occasionally stutters, lags", "verified": true, "helpfulness": "0/0", "author": "Momo"}, {"rating": 5.0, "review": "Excellent - works as advertised.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 3.0, "review": "According to the ad on your site , you can get an app to be able to speak what show you want, When I tried to download the app it was not for this TV stick. Otherwise it works great.", "verified": true, "helpfulness": "0/0", "author": "Gerald Cornelli"}, {"rating": 5.0, "review": "Wonderful technology allows any regular television to become a smart TV.  Love the amazon fire stick.  Would recommend it unreservedly.", "verified": true, "helpfulness": "0/0", "author": "Rev. John D. White \"camsterdad\""}, {"rating": 5.0, "review": "I love the Fire Stick.  It has kept my partner and I entertained.  I am not sure how this is different from the original Fire TV, but I think it does all the same things, maybe just less storage on the device itself.", "verified": true, "helpfulness": "0/0", "author": "kathryn"}, {"rating": 5.0, "review": "I love this thing. I am thinking about buying another one. Seamless functionality, easy to set up and use. I was at first, somewhat hesitant as I have been thinking about purchasing some Amazon product so I could exploit my Amazon Prime features more, some people seemed disappointed in some Kindle Editions and with Fire TV. While I have no experience with Fire TV the Fire TV stick is a real pleasure to use. So is my Kindle HD.", "verified": true, "helpfulness": "0/0", "author": "Eric G. Johnfelt \"Eclectic Collector\""}, {"rating": 5.0, "review": "Love the fire stick!!!", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 4.0, "review": "Some shows have intermintent pausing which becomes annoying, while seemingly nothing is wrong with the network, wireless etc.  While other shows are fine, no hiccups etc.  We wish it had a better way to detect slowness downs and somehow buffer the show for you.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Love it! Wish I had bought one sooner", "verified": true, "helpfulness": "0/0", "author": "Erin Bosworth"}]