[{"rating": 5.0, "review": "I preordered 2 of them and I LOVE them!!!  Amazon products are amazing....the interface is simple enough for my father to use, and the content available is plentiful....MIRACAST is the big PLUS there...you can mirror your device's screen if it supports it!", "verified": true, "helpfulness": "0/0", "author": "Mike and Jared"}, {"rating": 5.0, "review": "Amazon Fire TV...in stick form and cheaper!  I got a great deal on per-order making this half off, although I'd pay full price for this.  Setup was a breeze, just like it's big brother the Amazon Fire TV.  Performance for streaming seems to be the same as it's beefier big brother.  I have not played games on it so can't comment there.I like having the smaller package that I can pull and take with me!", "verified": true, "helpfulness": "0/0", "author": "R.J. Gura"}, {"rating": 5.0, "review": "I could not be happier.  WE have the Fire Stick HD that operates by voice for the living room and this less expensive model for the bedroom.  Love the AMAZON Series for TV and Movies better then anything presently on TV or cable.  All you need is a router in your home and away you go.", "verified": true, "helpfulness": "0/0", "author": "Bernie"}, {"rating": 5.0, "review": "I have Roku and got this for comparison. I'm a subscriber to Amazon Prime and that makes a huge difference. I've taken to using this rather than Roku. More free good stuff, less of the worthless free garbage Roku offers.", "verified": true, "helpfulness": "0/0", "author": "R. Barry"}, {"rating": 4.0, "review": "Great addition for second tv viewing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Instalation was very easy. Instructions very good.  Now enjoying it very much.", "verified": true, "helpfulness": "0/0", "author": "Phylis Taft \"quilter and rosemaler\""}, {"rating": 5.0, "review": "I bought two units when Amazon has it on sale for Prime members.  At $19 a pop, it is an unbeatable deal.  I have used the stick to play Christmas songs over the holidays.  It is also nice to see the lyrics pop up on the TV while the song is playing.  The kids love it as they like to sing along.  I have been a prime subscriber for a very long time, but I mainly use the kindle library and two day shipping features.  Now with the stick, I am really making use of my prime benefits...which include free prime movies and music.The Stick does not come with a remote with mic, but I installed the Fire TV app on my Andriod phone, and it does voice search easily.  I gave the other stick away as a Christmas present to a friend, and him and his family have been having so much fun with it. I wished I bought a few more when it was on sale.", "verified": true, "helpfulness": "0/0", "author": "Ratatouille \"Vinny\""}, {"rating": 4.0, "review": "it is really cool the control remote, but is made it to work best with amazon prime, not so well with the other apps like Netflix", "verified": true, "helpfulness": "0/0", "author": "leonardo"}, {"rating": 2.0, "review": "The Fire TV stick does basically everything I'd like it to do (I don't play games on it), except that it doesn't  support screen mirroring. I have a Chromecast that I was hoping to relocate to my basement TV, but since the Fire Stick doesn't support mirroring from my device, I'm stuck switching between them. I called customer service and they said that mirroring is only supported by Fire Phone's and Fire tablet's (though it *might* work on other devices). They had no word on whether developers were working this issue or not. From what I understand the Roku supports Miracast without issue, I just assumed the Fire Stick would as well. Pretty disappointing.", "verified": true, "helpfulness": "1/2", "author": "bigbillyvegas"}, {"rating": 5.0, "review": "I am in love with this already!  I preordered through my prime and promptly forgot about it.  When it arrived before Christmas it was a pleasant surprise.  I hadn't had time to really set it up until yesterday, but WOW it was easy to set up!!  Have you always wished you could watch your prime instant video on the TV instead of just on your Kindle??  This little piece of technology is truly amazing and if you know someone who is a prime member and they don't already have this BUY IT FOR THEM!!", "verified": true, "helpfulness": "0/0", "author": "pss6908"}]