[{"rating": 3.0, "review": "IT took a long time for the initial Wi-Fi connection.  All Fire TV had a pop-up that said check the website but there was nothing on the website that was relevant to my problem.", "verified": true, "helpfulness": "0/1", "author": "Stephen Aulerich"}, {"rating": 2.0, "review": "It seems everything is pay to view.", "verified": true, "helpfulness": "0/1", "author": "Donald Jaffe"}, {"rating": 4.0, "review": "Easy to set up and easy to use", "verified": true, "helpfulness": "0/0", "author": "Susan G. Workman"}, {"rating": 5.0, "review": "I would say the stick is awsome, just make sure you have enough  WiFi in order to use it.", "verified": true, "helpfulness": "0/0", "author": "Kim Patterson"}, {"rating": 5.0, "review": "I love it i has the abilities of a powerful TV, the casting from chromecast and the customizations of android device (can install file explorer and a player) am using it to watch netflex and crackle in the same time i can watch my own videos from shared folder on my Pc and watch youtube from mobile , i think its better than having a smart TV", "verified": true, "helpfulness": "0/0", "author": "MAJD"}, {"rating": 4.0, "review": "You gotta be kidding me.. 30 days later.. I was recommending this to everyone.. today it stopped working...Edit:It seems that you need to unplug it from the tv occasionally and restart.  I think it's working again.", "verified": true, "helpfulness": "0/1", "author": "David B. Cline"}, {"rating": 5.0, "review": "I've had the amazon fire tv for less than a month and I love it. It has all the shows my 2 year old loves and I enjoy watching new shows that I normally don't see on tv and no commercials!", "verified": true, "helpfulness": "0/0", "author": "Adrianna"}, {"rating": 5.0, "review": "love this best thing ever to go with my amazon prime membership", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!! Can't believe how reasonably priced it is. Definitely worth it!!", "verified": true, "helpfulness": "0/0", "author": "Monica Holguin"}, {"rating": 1.0, "review": "I bought this solely for the app PLEX, for which I have on a server and wanted to stream to my TV.  What a disappointment that I would be required to pay $4.99 for the PLEX app to be loaded when the advertisement shows PLEX installed, alluding that it's pre-installed.  This tool is ALL ABOUT PRIME.  It streams info from your Amazon account but only after you have to endure the cheesy video start and no way to skip it.The only cool feature is the packaging -- professionally packaged.I will be returning mine immediately.** Added **Amazon, FireTV, and affiliate company employees, family or friends -- please refrain from dumb or snarky comments.  If the box says PLEX on it and there's nothing online OR ON THE BOX that says, not all apps are FREE or INCLUDED, then AMAZON has committed FALSE ADVERTISING.  I have a smartTV.  It has everything but PLEX.  I thought I bought the BEST after thoroughly researching the various devices.  I failed to identify fraudulent advertising practices and now I have learned.  The solution is simple.  I'll attach my netbook and stream my PLEX server offsite to my TV through the netbook's HDMI output.Geeks find solutions.", "verified": true, "helpfulness": "1/1", "author": "Majkboy"}]