[{"rating": 5.0, "review": "I love the remote on this thing!  So far, it's been really great!", "verified": true, "helpfulness": "0/0", "author": "Mel_W"}, {"rating": 5.0, "review": "So far it seems to be really great. I just wish it would have an application for Vudu or Ultra Violet that I could use as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love to be able to watch my Prime videos on my TV. My tablet is a brand that conflicts with Prime so I usually watch Prime on my iPhone but now I can watch both Prime and Netflix on my TV. Having this option is wonderful. I still don't understand the difference between the Fire Stick and the Fire TV but for the price, the Stick works great for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use and works great! Glad I made this purchase.", "verified": true, "helpfulness": "0/0", "author": "Marie Headley"}, {"rating": 1.0, "review": "I have been trying to make this product work since I received it and have even read reviews and books.  I have installed it correctly and I never seen any onscreen instructions to connect to my wireless network...?  I have the correct HDMI slot selected.  This is not east to use.  I have a SHARP LCDTV Model LC-32SB21U.  I'm so upset that what is supposed to be sooooo simple is this difficult!", "verified": true, "helpfulness": "0/1", "author": "kraftyk817"}, {"rating": 5.0, "review": "One of the best purchases, I have made in the past year.  It makes the picture on my HDTV look like I've got a Blue Ray DVD playing all the time.  It was so easy to install, just plug and play, after you set it up for your wireless router.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Kris McQuivey"}, {"rating": 5.0, "review": "Love all stuff this thang can do awwsome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very pleased.  I was nervous with the wifi connection speed due to the distance of the router but it has no issues at all.  Love the quality and the ease of use.  Just what I was looking for.  Sure beat running a cable under my house to get netflix to my tv.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 2.0, "review": "I like the fire stick in theory.  I love being able to watch my amazon prime videos on the big TV.  Also Netflix and other apps are nice to have on the TV.  The problem is that it doesn't always work.  I have to unplug and replug it back in all the time because it gets glitchy.  And that's when I can even get it to connect to the internet.  I ordered a Chromecast and use that mostly now, it works a lot better.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Green"}, {"rating": 5.0, "review": "Very easy to set up. Works great.", "verified": true, "helpfulness": "0/0", "author": "Trrbrd"}]