[{"rating": 5.0, "review": "Absolutely love it! Great device at an even better price!", "verified": true, "helpfulness": "0/0", "author": "Kristen Pooler"}, {"rating": 1.0, "review": "Slow, clunky, freezes a lot. Advertised apps Youtube, Hulu etc not preinstalled. Very odd browsing for Amazon apps. Search is very restrictive when it comes to anything but Amazon video, app search as far as I can tell at this time is non-existant . Sure it's cheap and of you can't afford an Apple TV go for it, just don't expect too much.", "verified": true, "helpfulness": "1/3", "author": "JoelHanson"}, {"rating": 4.0, "review": "It is much faster than the blue ray DVD that I was using but I'm not crazy about the remote.", "verified": true, "helpfulness": "0/0", "author": "David Fort"}, {"rating": 4.0, "review": "I love this, it streams quckly without the usual slow loading that our wii does. The only reason for 4 stars is that you have to stream in HD. Even if my netflix setting is low quality so I don't use all my data, it still uses HD on the Fire Stick. We have only 24 gigs a month, and HD uses 1 gig an hour or more. Amazon, if you want to steal us from netflix and hulu, make SD more accessible. We are cable free, and rural. make a place for us in your plans!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Nice device, easy set up and clean picture.", "verified": true, "helpfulness": "0/0", "author": "Reginald Alston"}, {"rating": 5.0, "review": "Best this money can buy, small but very powerful, you can customize it as you can.One thing I want to recommend if they can come up with IOS remote it's very hard to type anything with original remote,Everything else good", "verified": true, "helpfulness": "0/0", "author": "BA"}, {"rating": 5.0, "review": "Easy quick set up. Fast movie loads from Netflix and Amazon Prime. Great picture and sound and if you were lucky enough to purchase it before it came out at half price an excellent deal. The only thing I'd knock it on is you do have to plug a mini usb connector to the stick that connects to your tv and plug it into the power line. So you still have a wire running around. I had hoped it would get all the power it needed from the tv. Interesting that they don't show that in the picture when advertising which I think is very intentionally misleading. Nevertheless, an awesome device that runs perfectly with features even Roku doesn't have.", "verified": true, "helpfulness": "0/0", "author": "D.J."}, {"rating": 5.0, "review": "Super easy to set up, easy to navigate.  Connected to our Amazon Prime and Netflix accounts quick and easy.  Good buy.", "verified": true, "helpfulness": "0/0", "author": "tarad21"}, {"rating": 5.0, "review": "Love it, great little version of the Amazon Fire TV.  Small footprint and much easier to setup Out Of the Box than Google Chromecast.  Works great with the remote that it came with or the gamepad controller.  Streams Netflix, Amazon Prime and Youtube w/o issues.", "verified": true, "helpfulness": "0/0", "author": "John Grey \"AV98\""}, {"rating": 5.0, "review": "Purchased for use on second TV. Connects to Amazon Fire TV via Wi-Fi so all the services, apps and $99.00 yearly service fee areonly charged once on the Amazon Fire TV. Netflix and Hulu have monthly fees but they are charged on the Fire account. TheFire TV Stick is included in these fees. Our goal is to be free of cable TV. I believe we will reach this goal.", "verified": false, "helpfulness": "0/0", "author": "William E. Krell"}]