[{"rating": 1.0, "review": "I am extremely upset with this product.  Continuously I have received the error message HDCP unauthorized. Contest Disabled.  I have tried everything to fix this.  Including speaking to Amazon Customer Service and going online to see what others have experienced.  I am so disappointed that this doesn't work and that there are so many bugs with this unit.  Customer service was supposed to call me back when I was trying to figure out the problem.  They didn't instead I received an email that went to my junk mail only to read it says try unplugging the unit.  Really!!! I have done that continuously and yet no solution.  I have a SONY Bravia TV from about 2008.. it seems to be a common issue that needs to be fixded.  Very disappointed", "verified": true, "helpfulness": "1/1", "author": "MARY C. BRANHAM"}, {"rating": 2.0, "review": "I don't like giving a negative review, but I'm less than happy with this.  I can't watch a program without it cutting out several times -it doesn't want to stay connected to my network -the only hardware that has an issue.  This really makes it pretty much worthless.", "verified": true, "helpfulness": "1/1", "author": "CJH in A2"}, {"rating": 1.0, "review": "I am currently on the road and learned about the Amazon Fire TV Stick by a couple of young and excited associates at Best Buy and Staples.  I was convinced that the Amazon had a more user friendly interface and that it was due to take over the market by its quality alone! Unfortunately I overlooked the Amazon.com \"Perfectly portable\" information about the products inability to connect to internet in hotels due to the lack of captive portal internet access that requires entering a password or user agreement confirmation prior to connecting to the internet.  I was extremely disappointed to learn this!!  Why make something that is portable that is not really portable?If you are planning to use this anywhere that you have to initially sign into the internet it WILL NOT WORK!!!", "verified": false, "helpfulness": "5/5", "author": "William Trostle"}, {"rating": 5.0, "review": "Love having this for the tv we have that is not a smart tv. My daughter uses it for Netflix and Amazon streaming. Works great.", "verified": true, "helpfulness": "0/0", "author": "Wendylu4 \"Wendylu4\""}, {"rating": 2.0, "review": "Most Of The Apps Aren't Regristerd And The Close Out And You Have To Pay For Everything.", "verified": true, "helpfulness": "0/0", "author": "Annie Merrill"}, {"rating": 4.0, "review": "Works, limited to Prime unless you order other services.", "verified": true, "helpfulness": "0/0", "author": "Bearmaster"}, {"rating": 4.0, "review": "I must say that I am pleased, so far. Having a Chromecast before, this does everything that it's predecessor did... the features I used, anyhow. I do, however, believe that there is need for improvements:1. Service integration - Chromecast didn't do this either, however, I know the Xbox 360 (and most likely the Xbox One) do this. For services available on the platform (Netflix, Hulu Plus, Youtube, VUDU, Target Ticket, etc.) when you searched for a movie/video, it would include results from those services. Now I believe that, given this platform, Amazon could take it a step further and integrate services subscribed to (in my case netflix and Youtube) into not only the search, but the main screen as well. So when I go into the \"Action/Adventure\" genre on the Home page, it would include Action/Adventure Titles from Services I subscribe to. Honestly, I know Netflix is a competitor, but if the services is available for download, why not make it streamline for your customers that pay for your product and/or service. When a movie/video is selected that is in one of these services, it could either warn that it has to open the other service OR just open it.2. Casting - I know there are at least a few decent \"casting\" apps out there. the problem is that, given the nature of the product, this should be already baked into it. I'm not saying screen mirroring (though that would be nice, too), I'm saying that if I have a home movie, video, or song that is playing on or physically on my mobile device (be it Phone or Tablet), I should be able to \"cast\" it to the Fire TV/Fire TV Stick and watch/listen to it on my TV (without having to download a lot of extra softeware to my phone/Fire TV). Granted, some of these still required exra software with chromecast, too. However, I found out, completely by accident, that the Gallery (already included in my Samsung Galaxy S5) had the ability to cast photos and videos that were already on my phone to my Chromecast, without any extra programs not already included. Given that they (Google) seem to be standing still in improving their product (saving getting their developer partners to do the work and \"include\" their cast code in their apps), I believe that if they can integrate it, so can Amazon.3. Create a Fire TV Remote (FTR) App that is optimized for Tablets - Don't get me wrong, I love the app, but sometimes it's easier to grab and/or read the Tablet. AND with more real estate on most tablet screens, there are multiple possibilities for enhanced features such as Second Screen (info about movie, Music Video), Alerts about new movies, search right on tablet (have search results come right up on tablet, select on tablet, start on Fire TV), and so much more.4. Fire TV Remote (FTR) Application / In General - Though I appreciate that this is \"easy\" I do believe that there are some things that could be added to the FTR App. As said above, I believe Second screen could be added to the phone app too, displaying such info as movie cast/crew, release date, interesting facts about a scene you are watching, the name of the song in the background in the scene, etc. Maybe even list movies that include one or more of the stars of the current movie/tv show you are currently watching.Again, above all, I love it so far. I do believe there can be improvements, of which I've listed a few of my top ones. If you have a chromecast and are not happy, I do recommend that you look into the Fire TV or Fire TV Stick. I'm fairly certain that you will be more happy.", "verified": true, "helpfulness": "0/0", "author": "J. Felland"}, {"rating": 5.0, "review": "I love this little stick!!I used to plug my laptop into the TV to watch my shows on the big screen. Then, of course, I couldn't use my laptop for anything else.The Fire Stick has amazing picture, it is quick to respond to the remote commands, and I can use my Android app to control it in case my family gets smart and steals the remote!Being able to stream Netflix and Prime Video is great! My DVD player can only stream Netflix. The option to buy or rent movies that aren't Prime eligible is so convenient too! More expensive than Redbox, but so many more options for new movies that the cost is worth it in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Do not waste your time and money. Buy a roku. This is an incomplete device which is annoying  to operate and does not even do basic things such as pin protection from accidental purchases and one time password setup for Netflix and other sing in applications.", "verified": true, "helpfulness": "0/1", "author": "Great"}, {"rating": 2.0, "review": "Having trouble and can't figure out how to get support.  I'm going to return it and get another one,  Don't know what else to do.There is a problem with the menu scrolling way ahead of the intended target.  When I actually make a selection I get a message stating it is loading, but then it times out and tells me I have a connection problem and I should check my network settings.  When I check them it says the strength if very good, but it is connected with problems.  After a short time it returns to the home screen and the whole cycle starts over.", "verified": true, "helpfulness": "0/0", "author": "Grandpot"}]