[{"rating": 1.0, "review": "Don't know what the problem is but it worked the first night I installed it and it hasn't worked since.", "verified": true, "helpfulness": "0/0", "author": "Steve Wilson"}, {"rating": 2.0, "review": "Received FireTVStick as gift because I wanted to mirror my GalaxyS5 on my Smart TV.  I cannot get it to work & subsequently discovered in recent reviews that Amazon FireTVStick DOES NOT mirror my phone screen (I already have a Chromecast that does not mirror either).  Additionally, in order to view pictures/text videos from my Galaxy S5, you have to upload the images to Amazon Cloud in order to view them on the TV.  Amazon Cloud fills up quickly and offers to SELL you more cloud capacity.  I just want to view my phone pictures without uploading them to the cloud.  I wish I could RETURN the FireTVStick as it does not work.", "verified": true, "helpfulness": "0/0", "author": "Brown Buffalo"}, {"rating": 5.0, "review": "i love it!", "verified": true, "helpfulness": "0/0", "author": "T. haskins \"Teknogray\""}, {"rating": 5.0, "review": "Quite simply ..FANTASTICK !!!!!!  A+", "verified": true, "helpfulness": "0/0", "author": "GRATEFUL DEAD BOOKS LLC \"gratefuldeadbks\""}, {"rating": 5.0, "review": "Took a chance, LOVE IT! Easy to use, easy to set up, works perfectly, everyone should have one!", "verified": true, "helpfulness": "0/0", "author": "one of them"}, {"rating": 5.0, "review": "Awesome! Love it!", "verified": true, "helpfulness": "0/0", "author": "Deborah Mendez"}, {"rating": 3.0, "review": "The stick works well enough. Issues with the remote not working correctly. It is too bad that most of the content I wanted to watch you still have to have cable to watch. If I had cable would not have needed the the fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "K. Kamps"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Gregory"}, {"rating": 5.0, "review": "Easy set up. Better than Regular Netflix, Pandora, etc.", "verified": true, "helpfulness": "0/0", "author": "Richard S."}, {"rating": 5.0, "review": "Worked as advertised.  I am very pleased with this product", "verified": true, "helpfulness": "0/0", "author": "Brian leabo"}]