[{"rating": 5.0, "review": "Works great. Easy to setup and connect to Wifi.", "verified": true, "helpfulness": "0/0", "author": "LAWRENCE SMITH"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "joann andres ibarguen arce"}, {"rating": 5.0, "review": "Easy to setup!! Everything at your finger tips!! Help me and my family step into the technology age. Has everything a roku and 10-20 dollars cheaper.", "verified": false, "helpfulness": "0/0", "author": "Tamara M Jones"}, {"rating": 4.0, "review": "As a person who's on the road for a good chunk of the year this has been a godsend. The only thing holding this back from a5 star rating is the lack of a few apps that I had to work around. Mostly just alternative apks to popular apps (I'm looking at you lakitu!)", "verified": true, "helpfulness": "0/0", "author": "James Marek"}, {"rating": 5.0, "review": "Extremely pleased with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "F. Henderson"}, {"rating": 4.0, "review": "good product easy to use and easy to setup", "verified": true, "helpfulness": "0/0", "author": "Rolando Torres"}, {"rating": 5.0, "review": "The display is very snappy, almost faster than an iPad. There is no lag whatsoever for anything.", "verified": true, "helpfulness": "0/0", "author": "matthew r rhoades"}, {"rating": 3.0, "review": "This is a replacement for the first one that ran very hot and locked up in mid show, requiring power down to reboot.  This second one hasn't done that but it is messing up the TV somehow.  Interferes with audio on normal broadcast channel (we don't have cable). and sometimes pixelates the screen...so there is some type of feedback via the USB connection.  That all stops if I unplug it.  The Fire stick portion works fine, and gives HD TV, but it troubles me that it is a messing  with the basic broadcast signal too.", "verified": true, "helpfulness": "0/0", "author": "Dan K."}, {"rating": 4.0, "review": "Works good but it's a little glitchy needs to be reset from time to time", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 5.0, "review": "Everything I expected and more.", "verified": true, "helpfulness": "0/0", "author": "Juan"}]