[{"rating": 4.0, "review": "I am impressed with the amount of entertainment functions on this Fire TV Stick....have some problems in downloading some old episodes and also at times the sound is off with the movements.....I'm getting a different carrier for my internet with faster speeds and hope that will take care of some problems...also much to learn, but well worth investing in this TV Stick...I understand there is already an up-grade and I'm wondering what that will do that my present stick wont do?", "verified": true, "helpfulness": "0/0", "author": "Darrel B Whiting"}, {"rating": 4.0, "review": "Controls much too sensitive.  My TV automatically switches if anything gets near remote.  Otherwise love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jane\""}, {"rating": 5.0, "review": "Great deal. Very good with Amazon Prime. Have enjoyed using it since Christmas. Already got my money's worth out of it. :-)", "verified": true, "helpfulness": "0/0", "author": "Patty Tressler"}, {"rating": 5.0, "review": "A gift for my grandson.  He was very happy to receive it.", "verified": true, "helpfulness": "0/0", "author": "Jane A. Johnson"}, {"rating": 4.0, "review": "The Fire TV stick is certainly and attractively priced product that has many options, but its apparently overtaxed when searching in the menus and transitioning between screens. I also notice occasional hiccups in video playback over smb, which are likely due to the fire not allowing applications to maintain a proper buffer.", "verified": true, "helpfulness": "1/1", "author": "sean schilke"}, {"rating": 5.0, "review": "Easy setup.  Works well.  Simple.", "verified": true, "helpfulness": "0/0", "author": "Michael Stephan"}, {"rating": 4.0, "review": "A little difficult to install because it was reluctant to connect to the Wi-Fi, but perseverance  paid off. It works fine and it is nice that Kindle Fire pairs nicely with it. Thumbs mostly up. Don't give up during the set-up.", "verified": true, "helpfulness": "0/0", "author": "J. Klug \"Tongajan\""}, {"rating": 5.0, "review": "It is Great", "verified": true, "helpfulness": "0/0", "author": "takeone"}, {"rating": 3.0, "review": "Not as good as Fire TV. We are goning to upgrade our N router to AC so maybe we can stop some of the buffering.", "verified": true, "helpfulness": "0/1", "author": "Douglas G. Green \"Blessed Dad\""}, {"rating": 2.0, "review": "Stick worked fine on my TV. The extender didn't work on either one of my two TVs.", "verified": true, "helpfulness": "0/1", "author": "Louis A. Willis"}]