[{"rating": 5.0, "review": "Everything about this is both easy and great!", "verified": true, "helpfulness": "0/0", "author": "R. Fried"}, {"rating": 5.0, "review": "Enjoy immensely", "verified": true, "helpfulness": "0/0", "author": "Jeri Moore"}, {"rating": 1.0, "review": "I'm so sad about this; the fire TV stick seemed to have it all in such a cute little package. Minimalism, style, efficiency, and it did everything I needed. Prime, Netflix, spotify, and then I plugged it in. At first, perfection. And then? Buffering. Buffering every 1-2 minutes. Constantly. I did all the trouble shooting, and then I packed it up and returned this little butthead.Then I spent the extra $50 and got the Amazon Fire TV set top. Best decision ever made. That was worth the money.", "verified": true, "helpfulness": "1/1", "author": "Kaitlin M."}, {"rating": 5.0, "review": "GREAT!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Hart Wooten"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/1", "author": "Cindy Schoemaker"}, {"rating": 3.0, "review": "Even with the stick a foot away from the router, I get intermittent connectivity issues regardless of internet traffic. Apps seem to freeze constantly. Combine that with a laggy and unintuitive interface and this little stick is very difficult to use.", "verified": true, "helpfulness": "0/0", "author": "Daniel Ting"}, {"rating": 5.0, "review": "We love our new Amazon fire stick so easy to use and large variety of entertainment choices!", "verified": true, "helpfulness": "0/0", "author": "Joann C. Swinkey"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "K \"KR\""}, {"rating": 3.0, "review": "The good thing about it is that you can watch the programs that were limited to my computer or tablet screen to my TV. As a whole, AP doesn't have enough of the old TV shows or if it does they must be purchased.", "verified": true, "helpfulness": "0/0", "author": "Adam B"}, {"rating": 5.0, "review": "I have Apple TV (which I dislike), Google Chrome and Roku.  However, Fire TV Stick is used more than the others combined.", "verified": true, "helpfulness": "0/0", "author": "personal_reviewer"}]