[{"rating": 5.0, "review": "Great tool, easy set up! Love it", "verified": true, "helpfulness": "0/0", "author": "LORI BOUZA"}, {"rating": 5.0, "review": "So easy to install and get operating - had a Chromecast doggle and it was near impossible to get running and no Amazon Prime.  Lots of content and games but needs some more newer movies and seasons beyond first season for the HBO offerings but I love it and would buy again.", "verified": true, "helpfulness": "0/0", "author": "R. Conley"}, {"rating": 4.0, "review": "Actually I love it, but it takes a bit of tinkering to get it to connect to wifi in the home.Cable company can help you connect.", "verified": true, "helpfulness": "0/0", "author": "B. Wells \"tea lover extraordinaire\""}, {"rating": 5.0, "review": "This thing ROCKS! Only issue I have is the batteries only last maybe 3-4 months on the remote", "verified": true, "helpfulness": "0/0", "author": "K. Salama"}, {"rating": 5.0, "review": "This is one of the best things I have every purchased. I watch Netflix while I am studying, cleaning, and when I need to wind down from the day. This stick allows me to access Netflix and my amazon prime videos w/o ever having to get on a computer. I also like the additional apps I can download at no cost to me.", "verified": true, "helpfulness": "0/0", "author": "Shastady Williams"}, {"rating": 4.0, "review": "What's the differences in the Amazon fire tv verses the Amazon stick ???", "verified": false, "helpfulness": "0/0", "author": "amy graham"}, {"rating": 5.0, "review": "I don't how I survived without this! I love it! It was so easy to install and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Julie Anstaett"}, {"rating": 5.0, "review": "makes everything so easy,less equipment", "verified": true, "helpfulness": "0/0", "author": "Vina"}, {"rating": 5.0, "review": "I own a few fire TV 's so much better and faster then the competition.", "verified": true, "helpfulness": "0/0", "author": "bobby brown \"bobby\""}, {"rating": 1.0, "review": "I experienced HDMI video issues right out of the box, which requires some fiddling. Software works half the time. Interface freezes way too often. I get booted out of my apps, which I presume means the app has crashed. Very disappointed with this poorly performing Amazon product. I'll have to wait for some sort of software update and hope it gets better. As a point of reference, I also have a 1st Gen Sony Google TV and it is way more responsive... I originally thought this was going to be an upgrade to the GTV, I was WRONG!! Amazon needs to fix this mess.", "verified": true, "helpfulness": "1/2", "author": "Ken"}]