[{"rating": 5.0, "review": "This is the best media device I have ever purchased.  It works great for streaming services and I have also sideloaded XBMC to play movies from my NAS.  Amazon nailed it this time.", "verified": true, "helpfulness": "0/0", "author": "mr_malina"}, {"rating": 5.0, "review": "I love the fire stick. Got it for $19. What a deal. Works great. It loads the shows much quicker than my apple TV and my Chrome stick.", "verified": true, "helpfulness": "0/0", "author": "pguttery"}, {"rating": 1.0, "review": "will not find a network//waiting for replacement:(", "verified": true, "helpfulness": "1/1", "author": "maggie chicoine"}, {"rating": 5.0, "review": "love it!  I love the apps as well, its very easy to use and the quality as expected is top notch.", "verified": true, "helpfulness": "1/1", "author": "Rebecca J. Goff"}, {"rating": 5.0, "review": "Works great.  I use it for streaming NetFlix.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Like many others, I actually will have two of these. One purchased at Best Buy for $25 on sale, the other coming soon from Amazon from the original sale offering at $20.  The Amazon unit will apparently be pre-provisioned, as the Best Buy unit indicated it was my Fire Stick 2.Again, agreeing with other reviews, this is a very fine and inexpensive way to view Amazon Prime videos and also Netflix.  It does provide 5.1 DD sound and picture quality seems good.  I would give my Apple TV a slight edge for Netflix.Beyond that I have had issues.  First, even though this is supposed to support Miracast, i am unable to get my Miracast enabled Windows 8.1 laptop to work with this machine. I hope a future update fixes that.  One commenter to another thread made a not particularly helpful remark about how Miracast is only for Android units, but thai is simply incorrect. I sure hope that Amazon works this out.Second, I have been unable to get my Logitech harmony hub to pair with the device.  Again, I hope Logitech and Amazon work this out.Third, Showtime does not receive support from Comcast Xfinity on this unit.  Showtime does support my Apple TV.  My goal is to have this unit go on the road. So I hope Amazon, Showtime, and Comcast work this out.  I certainly hope that HBO, Amazon, and Comcast work this out when HBO Go support is announced.In short, this is a simply way to view Amazon prime videos in 5.1.  I can't get Prime in 5.1 on my HTPC, and there is no Amazon prime support on Apple TV so far, and Airplay from an Ipad does not support 5.1 to the Apple TV.  So that is good.I have not tested the sideloaded apps for providing Airplay on the Fire TV stick or XBMC.  My sense is that those have some issues from reading reviews.  I hope those issues also get ironed out.So for now I would say this is a reasonable unit for Amazon Prime Videos and Netflix, and at a moderate price point that is OK for now.  There are many loose ends beyond that and I hope most get addressed over time.", "verified": true, "helpfulness": "1/1", "author": "originalsnuffy"}, {"rating": 3.0, "review": "Would be 5 stars if it were not for the fact that the device becomes useless when the internet is down. I have lots of media stored locally that I use the Plex app to watch. This app and all others stop functioning when the device can not connect to the amazon services.", "verified": true, "helpfulness": "1/3", "author": "Patrick \"bFORTIFIED\""}, {"rating": 5.0, "review": "This is the product we've been waiting for.  Apple iTunes has become increasingly bloated and painful for video downloading.  (A recent movie took 5 days to download between slow speeds and timeouts).  We've been wanting to switch to Amazon as our primary source for movie purchases, but have held up because we couldn't easily watch Amazon Prime on our existing TV.  With the Fire TV Stick that problem is gone.  Watched a full length movie last night with great quality and no dropouts.  Great product and with Amazon Prime it was a great price.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Netflix works so much better than on our smart tv.  Love the interface so easy and clear.  And of course we have Prime so watching tv shows and movies are great.  Lastly - we now have cat tv... our 55 inch tv is a giant aquarium for our cats to look at :)", "verified": true, "helpfulness": "0/0", "author": "April Spinelli \"#46 NYY Fan\""}, {"rating": 5.0, "review": "Very pleased with this unit. I bought it to supplement my 3rd Gen Apple TV, and it works beautifully.I only have one gripe about it, but I won't knock any stars off because of it.I received mine the day it was released, and when I plugged it it, it connected to my network fine. But it had an update to run. No problem, I let it run. Or I should say, I let it try to run. It could not connect t the update server. I tried a couple of times, but gave up eventually. About 2 hours later I tried again and was able to download the update, but it took over an hour. It even gave me a message that the internet seemed slow.I think this is a result of everyone trying to update simultaneously, and not so much an issue with the Fire Stick.I would recommend the purchase for someone who is looking to cut the cord on cable/satellite tv.", "verified": true, "helpfulness": "0/0", "author": "Jason L Heiken"}]