[{"rating": 1.0, "review": "The only thing I regret out of all my purchases from Amazon. Had high hopes for this product and it's a turd.", "verified": true, "helpfulness": "0/0", "author": "Kyle lawson"}, {"rating": 5.0, "review": "I love this thing!  Easy to set up, easy to understand. Great purchase for me.", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 1.0, "review": "We would have really enjoyed it had it worked...either one actually as we tried two. The Fire TV stick kept dropping our internet connection. When it would finally play something it lasted for about 20 seconds and buffered for 10 of those seconds. We have no issues with any other wireless peripherals connecting and holding the connection. Overall a big disappointment.", "verified": true, "helpfulness": "1/1", "author": "Ev's Dad"}, {"rating": 5.0, "review": "Can't say enough about the fire stick. I own two and love them both. Only exception has to do with Hulu app, which is outstandingly poor in performance. Not a fire stick issue.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Overall happy with the Fire TV Stick. Plugged in in and was ready to go. We have a slower DSL internet connection, but it still works pretty good. If it is too slow I just pause a little and let it buffer.", "verified": true, "helpfulness": "0/0", "author": "Will in Michigan"}, {"rating": 5.0, "review": "I really like being able to watch my movies on the TV instead of the computer/Kindle/phone screen.  We mainly uses this to watch Amazon Prime Video and Netflix, although it has many more features/programs available.  Extremely easy set up and very easy to use.  The first time I let it sit idle, I was surprised to see the beautiful \"screen savers\".  Very good buy, very good price.", "verified": true, "helpfulness": "0/0", "author": "Meredith"}, {"rating": 5.0, "review": "Great!!! Going to get 2-3 more.", "verified": true, "helpfulness": "0/0", "author": "Steve F."}, {"rating": 1.0, "review": "I give up with this! can't see any app in the library, there's no way to download nothing (my connection is ok, my one click is working) How I'm supposed to watch Netflix Hulu HBO ????", "verified": false, "helpfulness": "1/1", "author": "Oliver"}, {"rating": 5.0, "review": "overall, works great and is very easy to use! I would recommend this to every one.  I will add that our son lost our fire stick remote.  I was so thankful when I found you can order a replacement.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 4.0, "review": "Much easier to use then other products.  Even the picture seems better.", "verified": true, "helpfulness": "0/0", "author": "KAT"}]