[{"rating": 5.0, "review": "We love it.works Great", "verified": true, "helpfulness": "0/0", "author": "Linda Oconnor \"lindytrav\""}, {"rating": 5.0, "review": "For it's price, its a powerhouse. Lots of great features; smooth and clean. Really enjoy the prime video integration to the main interface.", "verified": true, "helpfulness": "0/0", "author": "avaid"}, {"rating": 1.0, "review": "While the Fire Stick offers a good array of programing, it overheated every time I turned on the TV which made it freeze up, and it would cycle through shutting down and restarting. I returned it and got the more expensive fire TV box. I. Bought a refurbished unit for $79.99 vs the $99.00 new unit price. This is perfect. Avoid the stuck.", "verified": true, "helpfulness": "2/2", "author": "Richard Tutching \"Filmster\""}, {"rating": 3.0, "review": "Kind of a disappointment - almost anything I was interested in watching was not free & cost the same or more than my cable provider charges.  On the positive side, I did enjoy the Amazon series Alpha House (which is free).", "verified": true, "helpfulness": "0/0", "author": "Rose Mary  LaChapelle"}, {"rating": 5.0, "review": "Just awesome. Great interface and selection. A mini media center right in your living room. Get HBO GO and I'll be happy! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "The only thing wrong with this is that the remote is too sensitive, you can press the button just a tiny bit and it skips 2 or 3 steps beyond the selection that you wanted.  But that is a small fault in comparison with the vast selection of shows you can view.", "verified": true, "helpfulness": "0/0", "author": "JMH"}, {"rating": 3.0, "review": "I purchased the Fire Tv Stick because the device I was using stopped working.  Fire Tv Stick worked  good , except it did not have a VUDU application.  I purchased some movies on VUDU and could not access them.  I returned the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Bernie Houle"}, {"rating": 5.0, "review": "Works great and easy set up..and sets to my android phone", "verified": true, "helpfulness": "0/0", "author": "mollie morgan"}, {"rating": 5.0, "review": "I love the fire stick. It is so easy to use and it works with my iPhone !", "verified": true, "helpfulness": "0/0", "author": "MJM"}, {"rating": 1.0, "review": "Pretty poor.I already had a Chromecast. Problem: I'm out of HDMI ports on my TV (You don't have game consoles and a bluray player?). So I had to swap out the Chromecast, which I was using for YouTube and Netflix. For such a low-priced item, I can't believe it really pays to make us all have to buy every content provider's unique device. Will y'all cut that out?I already had Amazon Prime. And I was watching it on my TV and/or Bluray player. So why get this at all? I like Amazon Prime Music. I use the Android, Windows, and OSX apps (mobile, at home, at work) are all great. But there still isn't an option to play my music back at home on my nice TV/Entertainment sound system. And you continue to stubbornly refuse to support Chromecast. The collateral all says this supports Music, so I thought this would be the solution.The Music app, which is the only thing I got this for, is terrible. Search doesn't work. I was forced to scroll through hundreds of albums to find what I wanted to play -- and I won't be doing that again. Yes, I tried the mobile app, and it was pretty useless for this also.My recommendation: stop publicising this as supporting Prime Music, and make the Prime Music apps (which are pretty good) support Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Chris Westin"}]