[{"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "Helen M"}, {"rating": 4.0, "review": "It's awesome to watch Netflix on a screen larger than a Kindle or tablet. The selection of what's available on the Fire Stick was astounding. So worth the money!!!!", "verified": true, "helpfulness": "0/0", "author": "S Maberry"}, {"rating": 4.0, "review": "Really like the interface but it looks like it's a hack to get PlayOn to work.", "verified": true, "helpfulness": "0/0", "author": "RockNRollerDad"}, {"rating": 5.0, "review": "Got this and I have finally dumped cable! With my Netflix subscription, Amazon Prime membership, and a HD antenna, my family has access to all the programs and movies we need.  It is user friendly and the kids had no issues navigating it.  Looking to order one more for our TV upstairs.  Get this and take the plunge, dump Cable TV and save some money!", "verified": true, "helpfulness": "0/0", "author": "MRB"}, {"rating": 5.0, "review": "I picked this up when it had the Prime promotion, for like $20. Great, great deal. We plugged it into our bedroom TV. Works just as great as our AppleTV in the living room. I just wish they'd push the iOS app out a little faster. I hate typing things with a remote, but honestly, once you've logged into everything, it's fine.", "verified": true, "helpfulness": "0/0", "author": "Corey Jones"}, {"rating": 1.0, "review": "goes on, say Connect to network  and thats it.  I am returning it, tried every thing, does not work", "verified": true, "helpfulness": "1/2", "author": "martin fischer"}, {"rating": 2.0, "review": "1. It's clumsy.  The menus start with only Amazon content and you have to scroll down quite a ways to get to non-Amazon content2. It has a very pretty screensaver3. Very little control over the systemFinally - Word to the wise...or those not so wise ;)According to their support desk, Amazon's Fire TV product's YouTube app does not play Google movies by design.  It works for EVERY other YouTube app, but they decided to make it \"incompatible\" on Amazon Fire TV devices.FYI, if you've bought blu-ray discs with 'digital content', you're often able to link those movies to iTunes or Google Play.  None of this content will be available via Amazon Fire TV.P.S. Hulu is frequently broken on the Fire Stick.  Video hangs.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Welker Jr. \"IT_Mike\""}, {"rating": 5.0, "review": "Works great!  I like it much better than my chromecast mainly due to the remote.  It is fast and really easy to use and the games make a fun addition.", "verified": true, "helpfulness": "0/0", "author": "Nick H"}, {"rating": 5.0, "review": "Easy setup and lots of great apps!", "verified": true, "helpfulness": "0/0", "author": "Stephen J. Miska"}, {"rating": 5.0, "review": "What they fail to tell you is that it needs a separate usb power supply, and even if the back of your tv has one... it doesn't supply enough power. Either way, this is an amazing product.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Kim \"frugal homeowner\""}]