[{"rating": 5.0, "review": "It has worked perfectly. Had no problems getting started.", "verified": true, "helpfulness": "0/0", "author": "Edwin Stone"}, {"rating": 5.0, "review": "One of the best $40 I've spent", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Williams"}, {"rating": 5.0, "review": "My husband is using it every day.", "verified": true, "helpfulness": "0/0", "author": "Petrina Smith"}, {"rating": 5.0, "review": "Love It !!", "verified": true, "helpfulness": "0/0", "author": "Brittinae Samuel"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Sy60old \"Sigh55\""}, {"rating": 5.0, "review": "This is a fantastic product that delivers exactly what is promised and more!", "verified": true, "helpfulness": "0/0", "author": "ShanGan25"}, {"rating": 3.0, "review": "Right click on the wheel sticks, overall Amazon Prime is a bandwidth hog compared to Netflix.", "verified": true, "helpfulness": "0/0", "author": "C. Green \"Cycling Guy\""}, {"rating": 5.0, "review": "Pretty great. Having to plug into the wall is a bit inconvenient.", "verified": true, "helpfulness": "0/0", "author": "Andrea Stone"}, {"rating": 4.0, "review": "Absolutely wonderful.  This product works well.  I never have any stutter, it has made my \"dumb tv\" into a \"smart tv.\"  The apps are great.  I will give you a warning and state that if you have Directv or Comcast, alot of apps do not grant you access to their content.  Other than that, and the current lack of HBO Go, it performs admirably.I have attempted to sideload a few apps and a few Roms to play games from my Nintendo days.  It is really difficult to get the controller to operate properly on the sideloaded roms so I have since deleted them.  Overall I much prefer this fire stick over my Chromecast.  There isnt much to say that hasnt been written already.  It is a solid device with great support from Amazon.", "verified": true, "helpfulness": "1/1", "author": "Peter"}, {"rating": 2.0, "review": "it kept telling me my bandwidth wasn't enough.  We have the chromecast stick in the other tv and it works just fine.  So.  not sure what the problem is.", "verified": true, "helpfulness": "0/0", "author": "Suzanne L \"SuzyQ\""}]