[{"rating": 5.0, "review": "Great layout on screen. Very user friendly. Remote is excellent.", "verified": true, "helpfulness": "0/0", "author": "Chesterfield"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Wanda Cameron"}, {"rating": 4.0, "review": "For speed this is great - best streaming stick hardware out there.  I got this for $20 from a pre-launch promotion - didn't really need it but for $20 I was curious.The feel of the equipment is the best of the three dedicated streamers I have tried and actively used - Roku, Apple and now this.I have installed this on a basement HD projector, and it works great.  I like the Roku stick ( I prefer the seasonal aesthetics of Roku), but this is a faster piece of hardware, leading to a smoother browsing experience.The controller has a much better feel than the Apple controller (I've had 3 Apple controllers die on me over 3 years - like a lot of Apple stuff, pretty but not really built to last).  This will also run PLEX, which is a big deal for those with their own movie and video files on a home computer or server, which Roku also does, but Apple does not.", "verified": true, "helpfulness": "0/0", "author": "James T. Barringer \"Just the facts, Ma'm\""}, {"rating": 5.0, "review": "Very smooth-running.  I have a Roku 3 and a Roku Stick.  I gave the Fire Stick to my dad for Christmas.  The Fire Stick does run smoother than the Roku Stick.  BUT, the Fire Stick is much more \"Prime-Centric.\"  This is great for my dad since he only has Prime.  But for someone like me who has Netflix, Prime, Hulu Plus, etc., it's a little annoying to have everything on the Fire Stick point you to Prime Video.  All in all though, a great Stick.", "verified": true, "helpfulness": "0/0", "author": "JWH"}, {"rating": 3.0, "review": "Easy to install and use. Searching videos isn't the best but it's ok. My biggest complaint is the video parental controls are horrible. You cannot set it up so the pin is only required for R rated content. If you set up a pin for videos you need to enter the pin for all videos regardless of ratings.", "verified": true, "helpfulness": "0/0", "author": "GiGiSam"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "retiredwooten \"retiredwooten\""}, {"rating": 3.0, "review": "A little tweaky... I received it the other day.  You have to power this baby, hooking it up to an adapter... your TV USB port is OK, but they recommend plugging it into an outlet with the USB adapter.  However, it sets up rather quickly, and is very easy to use.  Insure you have a fast internet connection or HD is out.  In fact, it takes a little time to get rolling once you are all set up.  Roku still has a hold on this market, but competition is good for all of us consumers.  The choices on the Fire Stick are not as friendly as Roku.  For instance, I own a subscription to PLEX allowing me to watch movies off my server.  Roku allows you to just download PLEX and then work with Plex to activate.  Amazon Fire Stick only has a purchase option of $4.95.  There is nowhere to sign in if you are already a Plex member.If I had my choice on rankings... I would give Amazon's Fire TV Stick a 6, and Roku a 10.  And catching up is all the fun... but they are both making improvements... I predict Roku will remain the leader.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey G. \"Say something about yourself!\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Richard Ballent"}, {"rating": 5.0, "review": "This is a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install, and it works as planned. I just don't have enough time to watch all the things on my play list!", "verified": true, "helpfulness": "0/0", "author": "B. M. Blauvelt"}]