[{"rating": 4.0, "review": "Very easy and space efficient way to access Amazon Prime Streaming.", "verified": true, "helpfulness": "0/0", "author": "Matt Velure"}, {"rating": 5.0, "review": "I have several Kindles and a Fire TV. I am a big fan of Amazon's electronics. I wanted to have the Fire TV capabilities on a television in my spare bedroom. This little stick did the trick! The only thing that disappointed me is that it did not have the remote with the voice capabilities that the Fire TV has. It was a small price to pay by not having that option. If you want to be able to use this more for TV watching than holding a ton of games, this works perfectly!", "verified": true, "helpfulness": "0/0", "author": "R.J. \"RJ\""}, {"rating": 5.0, "review": "Works wonderfully! The only complaint, and it doesn't affect the product, is that the remote is very small and very sensitive! Love the Fire Stick! Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Mary Ann"}, {"rating": 5.0, "review": "Best devise ever!! It's small but does so much and more!", "verified": true, "helpfulness": "0/0", "author": "Timothy P. Leonard \"Bigdog\""}, {"rating": 5.0, "review": "Love it!  Buying a few more!", "verified": true, "helpfulness": "0/0", "author": "JOAN MITCHELL"}, {"rating": 3.0, "review": "The stick worked on  the large television but not on the smaller one.  The roko works on the smaller television. When I contacted Amazon and told them the problem I was told \" the stick is not compatible with that television\".", "verified": true, "helpfulness": "0/0", "author": "Flower Lady  of  Owings Mills"}, {"rating": 5.0, "review": "I love this Fire TV Stick! And the app is really cool. It allows you to quickly move to what you want to view using voice commands!", "verified": true, "helpfulness": "0/0", "author": "Suzanne Barker"}, {"rating": 5.0, "review": "Can't beat this little streaming stick for the price. Great for mounted tv's where you do not want a box hanging down on the ground. Remember you need a power source for this stick so make sure you have the correct setup behind the TV or a power splitter.", "verified": true, "helpfulness": "0/0", "author": "B. Briggs \"talktob\""}, {"rating": 5.0, "review": "This unit rocks!  It's cheap, stays cool, fast, & has a great interface.  Plus, if you're so inclined, you can side-load android apps (think Kodi.tv).  Amazon totally nailed it with this little unit.  If you're thinking about another media streamer - stop now and buy this!", "verified": true, "helpfulness": "0/0", "author": "ParttimeGamer"}, {"rating": 5.0, "review": "It was great", "verified": true, "helpfulness": "0/0", "author": "john nobile"}]