[{"rating": 5.0, "review": "Super simple and easy to install. One thing I will say is that you do need to plug in the Stick to the electric plug that comes in the package. I tried using only the usb cable to the tv as a power source and it put the stick into an infinity loop as it powered on.", "verified": true, "helpfulness": "0/0", "author": "JDIZEL"}, {"rating": 4.0, "review": "very nice, still learning, but looks good", "verified": true, "helpfulness": "0/0", "author": "Craig Rowland"}, {"rating": 3.0, "review": "I like it but though locoal channels would be available and they arn't", "verified": true, "helpfulness": "0/0", "author": "Aussie"}, {"rating": 4.0, "review": "Replaced my WD Live box.  My go to for content.", "verified": true, "helpfulness": "0/0", "author": "OmniMedia"}, {"rating": 4.0, "review": "Perhaps I am just spoiled by the FireTV, but after purchasing 2 Fire TV Sticks for other televisions in our house I am a bit disappointed. My reason for saying that is moving around the Fire TV Stick interface is often very slow and \"clunky\" for lack of a better word. I also noticed last week while using the Fire TV Stick to watch the NFL draft on ESPN that the video would often pixelate and jump or freeze from time to time. While it was doing this I went to the television with the FireTV on it, brought up the ESPN app and watched some of the draft on it. Unlike the Fire TV Stick I never encountered and pixelization or jumping/freezing of the stream. Both devices are on my wireless network with the FireTV actually being in a worse location for signal than the stick in my office.That said it is still a good device and one I would recommend.", "verified": true, "helpfulness": "0/0", "author": "shinerburke \"shinerburke\""}, {"rating": 5.0, "review": "How did we ever live without it!!", "verified": true, "helpfulness": "0/0", "author": "K. Oechler"}, {"rating": 4.0, "review": "I'm okay with this product.  we have watched many Amazone Prime series with it.", "verified": true, "helpfulness": "0/0", "author": "SJClark"}, {"rating": 5.0, "review": "Works great, easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Damon Pettit"}, {"rating": 2.0, "review": "Video constantly skips. I don't have this issue with the same apps on other devices in my home. It makes some shows unwatchable.", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 2.0, "review": "I thought it would be better than what it is. I got it thinking I could watch HBO and other shows because I'm a prime member but it says I have to pay so I'm not very happy with that", "verified": true, "helpfulness": "0/1", "author": "Crystal Michelle Santoyo Cardona"}]