[{"rating": 5.0, "review": "Good movie channel", "verified": true, "helpfulness": "0/0", "author": "Amazon Jerry S"}, {"rating": 5.0, "review": "Does it's job great, it's fast with no lag with good quality picture.", "verified": true, "helpfulness": "0/0", "author": "Fritz"}, {"rating": 1.0, "review": "Not stable...stop working after less than 10 times of usage. Pop up error message or no signal receiving. After not using for 2 months. ..it works again.", "verified": true, "helpfulness": "1/2", "author": "VC."}, {"rating": 5.0, "review": "just plug it in and enjoy. Its that easy.", "verified": true, "helpfulness": "0/0", "author": "starbucks"}, {"rating": 5.0, "review": "Super easy..love it!", "verified": true, "helpfulness": "0/0", "author": "loki holle"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Novak"}, {"rating": 5.0, "review": "So good this is my second one. I really recommend it if you are using plex", "verified": true, "helpfulness": "0/0", "author": "L. Martel Ferguson"}, {"rating": 5.0, "review": "I have a smart tv with the Amazon app and this is far superior. My app is click and wait and I've stopped using it completely once I got this. I actually bought this for my bedroom TV which isn't smart but once I set it up I realized it preformed much better than my TV.  It never has buffer issues which my TV app does. Even crazier is my TV is is hard wired to the router but this little guy is completely wireless. No buffering. Seriously. I was so happy with it I bought 6 for every member of my family. Great for vacations so my kids can watch Disney movies. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Brendan \"covingtb\""}, {"rating": 5.0, "review": "Used to use Amazon prime through my PS3 but was a bit clunky. Bought the Fire Stick and it completed the experience. So easy to use and I synced it up to my Kindle tablet and that was a plus. If you're a Prime user, it's a must. A lot of bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "Pit"}, {"rating": 5.0, "review": "If you have Amazon Prime, its a must-have!!!! I can't stress this enough. Portable, easy to use, fast connection to the internet(this is where it easily beats chrome), ever growing number of apps. The super responsive remote control is a huge plus. Beware however, that it is quite tiny so can be very easily lost, then you'll have to part with over $30 (come on Amazon, how can the replacement remote be more expensive than the entire unit). I also wish it could directly draw power from the HDMI connection so you don't have to plug it to a electric source. All in all, great buy! You wont be disappointed", "verified": true, "helpfulness": "0/0", "author": "Denis Odokonyero"}]