[{"rating": 4.0, "review": "This is my first time using a streaming device. This device currently fits my needs. The only complaint I have is that the remote is very small and I kept losing it until I used velcro to attach it to my tv remote.", "verified": true, "helpfulness": "0/1", "author": "coopertipsy"}, {"rating": 2.0, "review": "Sluggish, freezes, loses connection every day and has to be restarted (unplugged) to find a signal again.  The only good spot is:  unlike its counter part the fire tv box the remote with the fire stick actually works and doesn't give out in 2 weeks.  I planned on getting one as a gift but will be going with another brand until amazon \"gets it together\".  I love amazon and most that they offer and was very sad and disappointed with this device.  I have prime and thought this would be a nice way to view everything in one place.........I was wrong.", "verified": true, "helpfulness": "0/1", "author": "Ashley Tomey"}, {"rating": 2.0, "review": "It gets very hot.", "verified": true, "helpfulness": "0/1", "author": "Brant Clark"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "tiffany Arellano"}, {"rating": 5.0, "review": "I love my Firestick!!!", "verified": true, "helpfulness": "0/1", "author": "Sheri A. Hunt \"Sheri\""}, {"rating": 4.0, "review": "Has been a great streaming device for hotel use. Home use thru my receiver (everything I have goes thru this...PS3, Apple TV, DVR, Wii-U) is a different story though. It's very spotty in getting it to work thru my Onkyo receiver. I seem to have to hit the home button (or any other buttons) several times until after nearly 90-120 seconds before it comes on. That's a pretty annoying amount of time to wait for it to come on and I haven't been able to find a good answer on why that is yet (perhaps someone can enlighten me). Maybe it's only meant to work direct with an HDTV, yet all my other devices respond and startup very quickly. Since I can get it to work eventually, I'm not convinced it's my setup, otherwise it wouldn't work at all. So, I rely on the PS3 and Apple TV for my streaming needs. This is really only useful for me while travelling in a hotel. Another thing....I stream Amazon Prime music to my phone, for which I've created a few playlists. Only one of the playlists is visible on the Fire Stick. I have no clue what I need to do get the others to appear. Don't even know what I did to get one of them to appear.", "verified": true, "helpfulness": "0/1", "author": "lcgy"}, {"rating": 2.0, "review": "Absolutely terrible wifi reception. Everything else is fine.", "verified": true, "helpfulness": "0/1", "author": "Peter Oliver"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/1", "author": "Caro lucero"}, {"rating": 4.0, "review": "Purchased device on Prime Day. Checked online at work It's was price at $24 when I got home it was $39. Great for watch programs online most movies are old.", "verified": true, "helpfulness": "0/1", "author": "Mark C."}, {"rating": 3.0, "review": "I was using Amazon video app in my blu-ray player before buying fire tv stick. I liked the other apps navigation options showing multiple items in one screen. Fire stick shows only 3 max (blu-ray player app showed atleast 12 in one screen) and you have to keep scrolling to find something.Other thing i dont like is making you to buy the HD version by default instead of normal version which is $1 less. you have to go to other ways to watch option to select the cheaper price. thats unlike Amazon.", "verified": true, "helpfulness": "0/1", "author": "Caprisun"}]