[{"rating": 5.0, "review": "The products made in the Amazon.My television has made a smart tv.Anytime, anywhere in the house you can see the video.The very good product.", "verified": true, "helpfulness": "0/0", "author": "Hiroki"}, {"rating": 4.0, "review": "Great to use for quiet time for the toddlers, Curious George is attention getter!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have had to unplug and replug this item several times to have it function properly.  Also, even though my internet connection is \"very good\" movies stop and will not restart until I unplug and replug the Fire Stick.  To say the least I am dissapointed.It would be a big help if Amazon provided a phone number for tech help.", "verified": true, "helpfulness": "0/0", "author": "M. Venuti"}, {"rating": 2.0, "review": "Being stuck with mostly paid viewing, cable isn't much better.", "verified": true, "helpfulness": "0/0", "author": "Barry P. Rummel \"I enjoy listening to Catholic and other religious books. I'm happy to see these books snowballing in available titles.\""}, {"rating": 5.0, "review": "pretty nice, I like it", "verified": true, "helpfulness": "0/0", "author": "JR Weger"}, {"rating": 5.0, "review": "Bought it for my mother. She left it at my house. It is never leaving. Nuff said.", "verified": true, "helpfulness": "0/0", "author": "dwest"}, {"rating": 4.0, "review": "Don't get me wrong--this is a good product. However, if you are an old movie buff, e.g., you'd better think about other avenues as well.", "verified": true, "helpfulness": "0/0", "author": "Stephen Jones"}, {"rating": 5.0, "review": "It works well, fast response. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "bill"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick surprised me by its voice search technology and its speed is amazing. This little gadget works great and the video quality is excellent. At 1080p the movies or TV shows that you play on this product looks very awesome. I like a lot. I am so satisfied that I bought the Amazon Fire TV Box too.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Adames"}, {"rating": 3.0, "review": "Convenient device, lots of options.  However it's range apparently leaves something to be desired.  Streaming Netflix through it, the picture often freezes while the audio continues.  Then the picture runs in fast forward until they re-sync.  This isn't a problem with my other streaming device, and the two are 2 feet from each other.  It makes watching a bother.", "verified": true, "helpfulness": "1/1", "author": "D Leveille"}]