[{"rating": 5.0, "review": "It does what it's supposed to. I wish there were more news apps", "verified": true, "helpfulness": "0/0", "author": "Bruce Hall"}, {"rating": 3.0, "review": "Beware buying this if you have an bank account registered on your Amazon .com account  that is not within the country that you want to use the Stick. It wild not allow you access to programming as it assumes you are in the country assigned by your account details. You will get licence error and invalid geo ip messages. I have spent more than 2 hours on the phone with Amazon technical support but not yet resolved after 10 days. They say they need to change the back end software to overcome the problem.I hope they do as it works great for my neighbour here in the USA.I await a resolution to the problem.... more when that happens... or doesn't.The problem has been resolved... if you're buying this FireTV stick on an account that is not registered within the country of purchase make sure you change the locus of your account to match that for your stick... it then should work OK.", "verified": true, "helpfulness": "0/0", "author": "Englishrob"}, {"rating": 5.0, "review": "Pretty cool device", "verified": true, "helpfulness": "0/0", "author": "Judith K. Wojciechowski"}, {"rating": 5.0, "review": "Hot", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Grudy1225"}, {"rating": 5.0, "review": "We've been pleased with the Fire TV Stick. Having skipped the whole DVR phenomenon, we're really loving the choices of what and when we'll watch. Pausing is handy, too.We liked it so much we bought another one.", "verified": true, "helpfulness": "0/0", "author": "Sheila Seiler Lagrand"}, {"rating": 4.0, "review": "It works pretty well.", "verified": true, "helpfulness": "0/0", "author": "buffy"}, {"rating": 5.0, "review": "Great  love it", "verified": true, "helpfulness": "0/0", "author": "cynthia"}, {"rating": 5.0, "review": "Wow the fire stick was very easy to set up and offers alot of choices .if your not a prime member you should be.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "M. Martinez"}, {"rating": 4.0, "review": "It work really good", "verified": true, "helpfulness": "0/0", "author": "Jacqueline"}]