[{"rating": 4.0, "review": "The onlu reason I gave it 4 stars instead of 5 stars is tha brief instructions could have been included", "verified": false, "helpfulness": "0/0", "author": "Glad R. McCurtain"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Jen Trexler"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Yvette Gonzalez"}, {"rating": 1.0, "review": "Not Good @ allwe do not like it !most things cost money play ......", "verified": true, "helpfulness": "0/1", "author": "Christopher chen"}, {"rating": 1.0, "review": "First Fire TV Stick worked for a few hours, then died.  The supplied hdmi cable was DOA.  I received a replacement Fire TV Stick (sans power adapter, hdmi cable and USB cable).  It was DOA.  To verify the TV was working properly I tested a Google Chromecast Stick and Amazon Fire TV set-top-box, both worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "OverTheHill Techie"}, {"rating": 4.0, "review": "Met my expectations. I have not tried any extra apps except netflix, hulu,and amazon prime but I love it. Sometimes I have a slow connection and the picture is not high quality. But I love having it. I consider it a good investment.", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 5.0, "review": "I love this stick.", "verified": true, "helpfulness": "0/0", "author": "Ollie Cole"}, {"rating": 4.0, "review": "I've become a fast fan of the Fire TV products. We initially bought the Fire TV box and have been very happy with the functionality and performance. All of the available apps are what did it for me - we use Prime, Netflix, and Plex frequently, so Fire TV has been perfect for us. Once we decided the Fire TV platform met our needs, I bought the Fire TV Stick for my office TV. I'm thrilled with the performance. I have a slight concern that there would be lagging due to the lower specs compared to the box, but didn't need to worry - it performs just as well, with no noticeable performance problems.We used a couple of Apple TVs for a few years and never really felt like they met our needs (no Prime or Plex capability). Being able to search for and add new apps has been great. Looking forward to new apps being developed as the platform matures.I only have 2 complaints:1. Sorting - This is a problem with all the video services/platforms. It would be incredibly simple for all these services to provide a TV/Movie list view based on the rating. Netflix at least has a Kids section that is helpful for families. I just want to be able to sort and show a single rating and view the shows available. It's frustrating to have to scroll through the Hangover movies when I'm trying to find a family-friendly comedy. This is a simple fix that would go a long way towards customer satisfaction.2. Prime Music - Amazon's implementation of Prime Music has been mediocre, at best. I pretty much refuse to use the service because the functionality is so poor. Sadly, the Prime Music experience on Fire TV is even worse. You have to go to the Prime Music web UI on a computer, add music to your favorites, then you can see and play that music on the Fire TV. What a horrible experience. I should be able to search the Prime Music library from the Fire TV and manage playlists and play music directly from the Fire TV. I'm not sure if Amazon did this on purpose, or if it is just a work in progress. Either way, it's frustrating and continues to push me to use Google Play Music All Access.", "verified": true, "helpfulness": "0/0", "author": "Russell Babcock \"drbabcock\""}, {"rating": 5.0, "review": "Real nice product", "verified": true, "helpfulness": "0/0", "author": "Logan Bennett"}, {"rating": 5.0, "review": "I'm very satisfied with this small stick wonder. Even though it's hidden at the back of my TV, there's no communication problem between the stick and the controller when I need to search for movies or videos from my library. Even my preschooler easily figured out how the control works in playing games. I would recommend it to my friends.", "verified": true, "helpfulness": "0/0", "author": "Curious George"}]