[{"rating": 4.0, "review": "Great addition to \"Prime\" Membership.Very cost effective way to enjoy features of Prime Membership.It's lightweight, small- not at all bulky and simply plugs in TV.  Setup is simple and I love how it comes already linked to your Amazon profile.Only complaint is that is should come with the voice remote instead of it having to  be purchases separately.", "verified": true, "helpfulness": "0/0", "author": "Danielle Dean"}, {"rating": 4.0, "review": "The remote is very hard to use - very touchy when scrolling.", "verified": true, "helpfulness": "0/0", "author": "Scott Blum"}, {"rating": 5.0, "review": "Best streaming product that I have ever bought. This product is better than the Google Chromecast and it supports better wireless ranges and stores plenty of memory and includes a remote.", "verified": true, "helpfulness": "0/0", "author": "Matthew Senecal"}, {"rating": 4.0, "review": "Some of the programs don't play in High Definition which I though If I had an HD set that it would. Other than that I'm fine with the product.", "verified": true, "helpfulness": "0/0", "author": "JEL"}, {"rating": 4.0, "review": "Works great as long as you have decent wifi.", "verified": true, "helpfulness": "0/0", "author": "paul larson"}, {"rating": 4.0, "review": "Still finding new ways to use it. Cannot get the mirror function to work yet.", "verified": true, "helpfulness": "0/0", "author": "DANA M JOHNSON"}, {"rating": 4.0, "review": "Two downsides of it:1-it doesn't let you search any thing in a language other than English.2- It doesn't play live YouTube videos.", "verified": true, "helpfulness": "0/0", "author": "Ahmad A."}, {"rating": 5.0, "review": "So far I love this product. I bought the Amazon Fire box for living room tv at Christmas and this is for my bed room!", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 4.0, "review": "It certainly has more options than my google chromecast, awesome for prime users. My only complaint is the components are quite big, I had to rearrange my HDMI setup, and add an extension cord so I could use it. Aside from that it's been fantastic, I'd definitely recommend it to a friend.", "verified": true, "helpfulness": "0/0", "author": "samanthapeach"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "darrell"}]