[{"rating": 5.0, "review": "I really like this lil guy.. my only bit of hardship came from searching using the remote... i found it didnt have the responsiveness of an xbox controller or texting feel.  I think its a great start but it seemed sluggish.  The Youtube app DID have a pairing option to use your smartphone to type things in via a smartphone keyboard.. havent tried that but it seems like a possible solution.  Other than that still totally useable and totally an amazing value to be able to watch streaming content on my tv.", "verified": true, "helpfulness": "0/0", "author": "Adam Stogdill \"-Adam\""}, {"rating": 5.0, "review": "A solid addition to any TV, the Fire TV Stick blows it's competition out of the water. Great performance, competent design, and a good price point.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is excellent tool for streaming content to the T.V.  It could not have been easier to set up.  I also have a Roku 3 and, a Google Chrome.  I think the Fire TV stick is going to be my favorite.  I have an Amazon Prime membership and, the way it presents the content I already have purchased through Amazon and, what is available free with my membership is terrific.  I am most excited that it makes Prime Music easily playable on my home entertainment system.  I was able to get this as the early Prime member discount but, it really is worth full price.  Content is easy to find and, I will be purchasing controllers to be able to play the games.", "verified": true, "helpfulness": "1/1", "author": "Gracie"}, {"rating": 5.0, "review": "Pretty pleased with the device thus far.  What I initially purchased it for was to take advantage of my amazon prime and netflix account without casting from (tying up) another device.  The remote was the deal breaker for me which will pretty much put my chromecast to the strap yard.  It gets pretty tiresome trying to wake up the chromecast device at times to stream to it.  What i didn't realize is that the fire tv stick has the capability to cast to it as well with allcast receiver app which was free to download.  So not only do I have a remote that I can directly access apps I can still cast anything from phones or tablets with allcast.  A feature that i have yet to try but I'm sure will work pretty good is the phone app that allows you to say the name of movie titles or tv shows from phone or tablet voice capability instead of pressing the remote a bunch of times for onscreen keyboard brilliant idea.", "verified": true, "helpfulness": "0/0", "author": "datmanty \"PWNED\""}, {"rating": 5.0, "review": "The fire stick is pretty amazing.  It was simple to set up, and it has tons of apps available for it.  I got it mainly for Netflix, Hulu plus, and of course my Amazon Prime video and music accounts.  I am very impressed with the speed of the fire stick.  My videos load very quickly and I have had no problem with buffering playback.  I would highly recommend a fire stick for anyone looking for a streaming device.", "verified": true, "helpfulness": "1/1", "author": "Jooky"}, {"rating": 5.0, "review": "I assembled the device as recommended, using the HDMI extender cable.  It worked OK but every few minutes it seemed to have buffering issues and the picture would cut out for a fraction of a second.  On my TV the power cable was close to where I had to plug in to HDMI.  I moved the Fire TV Stick device to the other side of the power cable and it has been working perfectly ever since.  It makes sense to me that electrical interferance from the power cord could cause a problem.The device works as advertized and as a fan of the Prime offerings that is all I wanted.It's a lot easier than hooking up my laptop, what I used to do.Have used  it successfully every day for over a week now and recommend it highly for Prime users.", "verified": true, "helpfulness": "0/0", "author": "old timer"}, {"rating": 4.0, "review": "I bought two of these when they were $19. I like the compact size, plug it in and you dont even know its there. Downloading/installing the updated software was quick and easy. The only issue I see is the WiFi reach isnt very far. My router is upstairs and the Fire Stick in the living room could not pick up our WiFi. The stick upstairs had no issues. Thinking it was the stick, I swapped them. Same issue, could not pick up WiFi in the living room. I guess I will have to run a new line and move the router to the living room as we use that tv more. If you have concerns about the WiFi reach, get the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "rburton"}, {"rating": 5.0, "review": "I've only had this a few days but I LOVE being able to see all of my Kindle content on the larger screen. I can view my photo albums, watch my saved movies and listen to my music. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "vagirl"}, {"rating": 5.0, "review": "This is a  fantastic little gizmo.  I can get a lot of free channels, get my Netflix.  Streams in from youtube from the computer.  NO MORE DRUG COMMERCIALS EVERY 2 MINUTES on pay TV.  Don't miss that!!  Bye bye DISH.  More money in MY pocket.", "verified": true, "helpfulness": "0/0", "author": "Veronica Deevers \"Wildlife Artist\""}, {"rating": 4.0, "review": "i will compare the fire stick to the roku 3.  The build quality of the remote is flimsy and I was afraid that I might break it just trying to open it to insert the batteries. Roku remote is much more robust.  Roku also has the advantage of many more channels and a better interface.  When looking at movies the roku allows you to scroll right/left 5 movies each click.  Fire stick only allows you to move right or left one movie at a time.  THE GOOD---- The Fire stick loads movies in a fraction of the time that it takes my roku 3.  The quick load time is a great advantage over the roku 3.  Amazon could change interface issues via a software update in the future?  I hope to see that improvement.  Note- I am comparing the $39 fire stick to the $99 roku 3.  The fire stick is well worth the cost of admission....", "verified": true, "helpfulness": "0/1", "author": "bobby"}]