[{"rating": 4.0, "review": "The navigation of the remote control could be better by having keypad for text entry, but the unit works great. Easy to get apps and super easy install. Now there is no need to connect my laptop or a dvd player to my bedroom tv.  Works for all my streaming services.", "verified": true, "helpfulness": "0/0", "author": "S. Mitchell"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "chris gorth"}, {"rating": 5.0, "review": "This device is amazing!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 3.0, "review": "We're a bit neutral about this product. It was relatively easy to set up on our tele but I wish we could scroll through titles a lot faster. The navigation seems a bit wonky in that sense. I accidentally hit the purchase button for a random movie and it charged my Amazon account right away (I had a gift card balance) - I like the neat feature where I can use the stick/remote to request contact with Amazon so Amazon contacted me via phone within seconds of my request. Got our credit immediately.I do not like the remote control app (IOS) - swiping seems to be the luck of the draw on that so we've stuck to using the stick's remote. It's been a few months since I've tried it (I think it was new when I first tried it) so we'll have to check it out again sometime soon.", "verified": true, "helpfulness": "1/1", "author": "dogsrule"}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Kris Earl"}, {"rating": 2.0, "review": "It's OKAY but nothing special! Some days it works other days I get an error message. On the days where it does work, it doesn't really do anything special. We have Netflix and Hulu so does the Firestick, The firestick offers other new releases but you have to pay to either rent or purchase them. To rent them is $4.99 vs. Redbox $1.50, to purchase is about $14.99 compared the roughly the same price to purchase the DVD or Bluray that most times includes access to a digital copy. I'm not impressed. The selection of movies available is limited and as mentioned before the same as Netflix or Hulu so there's really no need for the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Heather Noble"}, {"rating": 5.0, "review": "Was given to me as a gift. Very nice to have when you don't have cable.", "verified": true, "helpfulness": "0/0", "author": "Blair"}, {"rating": 5.0, "review": "Works great. I love it", "verified": true, "helpfulness": "0/0", "author": "Rick T. Pelzl"}, {"rating": 5.0, "review": "The fire stick is easy to use.", "verified": true, "helpfulness": "0/0", "author": "sherry stanton"}, {"rating": 5.0, "review": "i haven't used it much but it was easy to install and i brought my netflix account to it besides my prime  so far very happy", "verified": true, "helpfulness": "0/0", "author": "Judith D. Woronka"}]