[{"rating": 4.0, "review": "Awesome! My family uses Amazon Prime a lot and this is a perfect upgrade to using Amazon", "verified": true, "helpfulness": "0/0", "author": "Allan Long"}, {"rating": 4.0, "review": "It took a little work to get it started, the enclosed instructions were not very clear.  It works as advertised but it is a data hog", "verified": true, "helpfulness": "0/0", "author": "Sherri Clark"}, {"rating": 5.0, "review": "Great product. Easy to install and navigate. Wish I would have bought it sooner. Lots of great content.", "verified": true, "helpfulness": "0/0", "author": "Lisa L Moore"}, {"rating": 1.0, "review": "It did not work after hours with customer service", "verified": true, "helpfulness": "0/0", "author": "thomas mccullough"}, {"rating": 5.0, "review": "Perfect for the bedroom TV!  Remote is very responsive and easy to use.  Easy to set-up!  Very affordable!  Do it!", "verified": true, "helpfulness": "0/0", "author": "The Beave!"}, {"rating": 2.0, "review": "I really liked it at first. The number of apps and games available makes it very appealing. The problem lies within video playback. Whether it's Netflix, Hulu, Plex... all of them are \"choppy\". I had mine connected to a high end Samsung and I could barely watch it because the videos weren't smooth. Cartoons aren't bad (so I moved it to my daughters room) but everything else is terrible. I bought it to replace a Chromecast (which plays perfect) mainly because I wanted a remote. I tried the 2.4Ghz and 5Ghz bands and neither made a difference (my internet is 30 down and 5 up, so it's plenty). Maybe I got a faulty device, or maybe it's just not capable of streaming. Either way, it wasn't a complete waste of money and the price isn't bad, but I can't say I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Zatch"}, {"rating": 5.0, "review": "I just love it", "verified": true, "helpfulness": "0/0", "author": "K. Gunnison"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Normangl"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Catalina Carvajal"}, {"rating": 5.0, "review": "love it but in Mexico there are some apps that doesn`t work.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Apaza"}]