[{"rating": 3.0, "review": "Let me first start off by saying that I've enjoyed the use of my Fire TV Stick since receiving it upon release in early December. After relying primarily on the pre-installed apps on my 2+ year-old TV to stream Netflix, etc., I found this to be much faster and much more accessible. I also love being able to fire up Amazon Music on my TV.So why the three stars you ask?Well... first - the interface.It's suuuuper clunky and more than a little cluttered. Trying to find a movie/show? The predictive recommendations and genres are limited. It's much easier to go to the website, browse, and add to the watchlist. Although I love having access to my Amazon music, if you want to access something outside of your library - good luck. Again, the categories are super limited and not very intuitive. I usually end up having to use the Amazon Music app on my phone, searching, adding to my library, syncing my account on the phone, then syncing my account on the stick to listen to something new. The search option on the stick works well with movies/tv, but not as well with finding music or specifically created Amazon playlists. So the unwieldy phone/multiple syncs method is sadly the fastest way I've found to access that content. There's a lot of wading through content that goes on with this device.Second - the micro USB power port on the stickIt's a tight fit. I noticed that the first time I plugged in the device. This is partly because there is a plastic guard on the provided cable which seals off all but the pin hole on the connecting end. There's no room for error. Maybe the rest of the world always lines up their cables 100% accurately every time they plug something in, but for those of us with bad depth perception, it usually takes a couple of tries. Woe be unto us with this device. Because of the plastic guard, each miss potentially pushes the port into the stick and/or moves the pin.For the first time since receiving it, I took the stick travelling with me to visit family. My mom is trying her hand at cutting the cord, and I wanted to sell her on the stick. I had a hard time getting the power port plugged in at her house, but eventually got it plugged in and fired up. However, when I tried to get it set back up at home, it was a no go. After looking at the port, I realized that it was even more recessed than usual and the pin was slightly bent. I'm a plug-it-in-gently, not jam-it-in-the-hole kinda gal, so this should not be a thing that ever happened. So, I called Amazon, which brings us to our third point...WarrantyApparently the recessed port/ bent pin constitute damage and are not covered under \"normal use.\" Since the stick is touted for its portability, yet has a cable that functions as a blunt object to bludgeon the port in with every mis-plug, one would think that a damaged port would become \"normal\" given enough time. That's considered a design flaw, yo. Fix the stupid cable. Anyway, Amazon offered me a refurb at half price....which is about the same price I payed for the device with the initial promo. That'd be a hard pass. This is the first time I've gotten such terrible support for an Amazon device. I suppose that's to Amazon's credit? At any rate, I took it apart, and, thankfully, nothing was irrevocably damaged. I straightened things out and was up and running again. However, I will never unplug it again. So much for portability.Lastly, permissions for apps...Amazon needs to bully providers to provide app permissions for this device. As a Charter customer, I'm still waiting to get access to Showtime and HBO Go. I'll probably be cancelling Charter soon (let's be real - that's where the problem is), but it'd be neat if cable providers and device creators plus app developers all got on the same page here. Also - I know this is an amazon device, but any chance in getting Google Play here at any point?TL;DRGreat for the price, as others have noted. Device is peppy for its size, but user interface leaves much to be desired. The power port/included cable are an unhappy fit, so unplug at your own risk. Good luck to you if anything breaks since design flaws aren't covered under warranty. Netflix works like a champ, but some apps are still wanting.", "verified": true, "helpfulness": "1/2", "author": "Amazonaholic"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/1", "author": "Yoichi Aminaka"}, {"rating": 5.0, "review": "Love it! Easy to setup and use!", "verified": true, "helpfulness": "0/1", "author": "Janine M. Howe"}, {"rating": 5.0, "review": "I love it.  Getting ready to buy another one.", "verified": true, "helpfulness": "0/1", "author": "Kim Winston"}, {"rating": 5.0, "review": "Super product", "verified": true, "helpfulness": "0/1", "author": "amazonbuyer"}, {"rating": 5.0, "review": "Very easy to use. I really like how easy it is to just take out and take on trips.", "verified": true, "helpfulness": "0/1", "author": "J. Nicholas \"Baller\""}, {"rating": 3.0, "review": "I kept mine plugged in, and it burned up after about 6 months, with the case showing signs of melting / warping from heat. .", "verified": true, "helpfulness": "1/2", "author": "J. Green"}, {"rating": 5.0, "review": "Easy to set up. Gets me what I need and want. Fantastic.", "verified": true, "helpfulness": "0/1", "author": "igor cotler"}, {"rating": 5.0, "review": "Firestik is awesome! I wish I would have gotten this a long time ago when it first came out. Super easy to set up and install", "verified": true, "helpfulness": "0/1", "author": "PIPER"}, {"rating": 3.0, "review": "Is not compatible or have the ability that I can find anywhere of being able to connect it to a Projector and Home theater system, even contacted Amazon help chat.  A regular TV with USB, its pretty simple sooo eeeeh, gave it a 3 possible would consider a 2.5 as I was hoping for some flexibility.  If it's out there it's then it's hidden on how to set up.", "verified": true, "helpfulness": "0/1", "author": "Mo"}]