[{"rating": 2.0, "review": "Very surprised how many movies and shows has to be paid for!", "verified": true, "helpfulness": "0/0", "author": "Steve Weber"}, {"rating": 5.0, "review": "Works very well", "verified": true, "helpfulness": "0/1", "author": "David"}, {"rating": 4.0, "review": "Works as advertised, but lack of play store apps is a big let down... Also not enough games to justify a controler...let 3rd party apps more available without rooting, and it will be 5*", "verified": true, "helpfulness": "0/0", "author": "victor bond"}, {"rating": 5.0, "review": "I love my Fire TV Stick", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Did not work well with Netflix,  kept reloading.", "verified": true, "helpfulness": "0/0", "author": "John J. Manock"}, {"rating": 2.0, "review": "Clunky and slow", "verified": true, "helpfulness": "0/0", "author": "jwow"}, {"rating": 2.0, "review": "I bought the fire stick so I could watch  Netflix by just change the HDMI channel and watch,instead of having to go thru the Wii player and having to turn on  my DVD player,and my stereo comp.for sound,Now it easy to get into Netflix but the problem is it's always buffering,the show comes on then 2 minutes later it buffering then comes back on and then buffering so it take a very long time to get thru every program,I had no buffering problems thru the Wii system and it worked just fine so I can only guess it's the WiFi signal to the fire stick, I even have a Cellspot router and all my other WiFi systems work just fine.?", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "I love it, easy to use and navigate", "verified": true, "helpfulness": "1/1", "author": "juanita from charlotte, nc"}, {"rating": 2.0, "review": "One would think that the Fire TV stick would be compatible with a fire tablet, but alas, one would be wrong.  If you're aware that it doesn't have much more capabilities than the App on a BlueRay player it would be fine.", "verified": true, "helpfulness": "1/1", "author": "Leah M. Moore"}, {"rating": 2.0, "review": "Pretty nifty gadget... Unfortunately it only seems to work if it's within 10 feet of the wifi modem. I also have a Google Chrome stick and it works fine anywhere in the house, as does my Sony blue ray and play station. Bandwidth and connection are all fine??? I'll give it a another week or so and see if I need to return it? Not impressed!", "verified": true, "helpfulness": "0/0", "author": "Anthony Austing"}]