[{"rating": 5.0, "review": "I love my firestick. We used to have a ROKU, which was freezing and buffering all the time. This product doesn't do that.  Another problem I had with my ROKU was I could NEVER RWD or FF a show, without it freezing, I then had to unplug it and wait for it to reboot. With the Firestick all of those hassles are gone. I can also take it with me on vacations, since now I can hook it up to a hotel's WI-FI.", "verified": true, "helpfulness": "0/0", "author": "Maria Sampaio"}, {"rating": 5.0, "review": "It works perfectly !!!!", "verified": true, "helpfulness": "0/0", "author": "Natashad"}, {"rating": 5.0, "review": "In my wife's words, \"it was the easiest set-up ever.  Easy to use...hoping to explore more.", "verified": true, "helpfulness": "0/0", "author": "Roller"}, {"rating": 5.0, "review": "Love It!  Love all the free movies, apps and its east to use.", "verified": true, "helpfulness": "0/0", "author": "Christine K. Taylor \"newworld2\""}, {"rating": 4.0, "review": "lots of great channels and extras and very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Theresa"}, {"rating": 4.0, "review": "Haven't had it long enough to give it a total review but so far has exceeded expectations. Still have a bit of learning to do. Can't go wrong  for the price. Recommended!", "verified": false, "helpfulness": "0/0", "author": "margaret"}, {"rating": 1.0, "review": "Persistent WiFi connection failed message despite entering the WiFI password with the correct case. I have a smartphone and a tablet connected to this home WiFi network OK which is set up with Channel: 11, Security type: WPA Any. The Fire TV Stick sees the home WiFI network OK. Even tried enabling the Guest WiFI network with NO security, and got the same message. The NG7550 combination Modem\\Router is only about eight feet away from the HDTV Model E320-A0. Even tried the 2nd HDTV jack on the back of the HDTV, but the WiFi connection failed message persists. Do I have a faulty Fire TV Stick?", "verified": true, "helpfulness": "0/0", "author": "KI Time \"Unprivileged\""}, {"rating": 4.0, "review": "I like it.", "verified": true, "helpfulness": "0/0", "author": "Orson Blair"}, {"rating": 5.0, "review": "I have a Roku 3 for home, but I got this free with a Sling.tv subscription for travel and love it.  One key feature it has over the Roku is the ability to connect to hotel wi-fi that requires logging in or clicking accept in the browser.The user interface is clean and easy to use and the app selection is great.  Couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "J. Jenkins"}, {"rating": 5.0, "review": "Great product especially if you don't have a smart tv", "verified": true, "helpfulness": "0/0", "author": "Kenneth Robinson"}]