[{"rating": 4.0, "review": "Works very well with the apps/streams it supports.  I have the Fire TV Stick, Roku 3, Chromecast and smart TVs. This one is easy to set up and flat out works.  But so do the others as well.  This one gives me Amazon TV as well, and I like the show 'Bosch'.  Just wish it was a universal device for any app or stream and that I could cast anything from my computers to the TV.", "verified": true, "helpfulness": "0/0", "author": "MCOHRS \"MCOHRS\""}, {"rating": 5.0, "review": "Works great! I might just cancel my cable service..", "verified": true, "helpfulness": "0/0", "author": "Brian L. Wagner \"soundmixx\""}, {"rating": 5.0, "review": "Great for using tv as smart tv! Every once in a while we have a period where it glitches a bit, but I chalk that up to my cable more. Works great!", "verified": true, "helpfulness": "0/0", "author": "Mikaela \"mikaela1969\""}, {"rating": 5.0, "review": "Easy set-up. Very reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Scott Collins"}, {"rating": 2.0, "review": "I purchased the Fire Stick to see how it compared to the Roku Stick I had been using for a year or so. It arrived back in December, was easy to set up and worked great at first. Now, only a few months later, it constantly loses the wireless connection, even though the TV and Stick are in the same room with no obstruction in between except for the TV itself. Either the picture freezes and the voice continues to play or the voice gets stuck or out of sync with the picture, or it just quits and goes back to the home screen. I have to unplug the Stick from the TV, disconnect it from the power source, let it sit for a few minutes, hook everything back up and start over. Sometimes it's good for a couple of days, sometimes only for a couple of hours. I'm not sure it's even worth the hassle of sending it in on a warranty claim.  While I'm giving that some thought, I think I'll still replace it with another Roku Stick. I remain an Amazon fan, just not a fan of the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "lizzier"}, {"rating": 2.0, "review": "Works well but ONLY when very near the wireless modem.  Very disappointed in it otherwise.  When using, it is constantly stopping during program to buffer.  This happens a LOT.  Have had to go back to using the Wii or Playstation to watch Netflix, etc as we don't have the buffering problem when using those.", "verified": false, "helpfulness": "0/0", "author": "G.A."}, {"rating": 5.0, "review": "very cool how this works.  i use it to watch sports, movies, old television programs, and my music not what someone else has picked out.  love it!", "verified": true, "helpfulness": "0/0", "author": "Brother Ray"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Joyce Rubinfeld"}, {"rating": 3.0, "review": "it works good", "verified": true, "helpfulness": "0/0", "author": "secret"}, {"rating": 5.0, "review": "I am really enjoying my Fire TV Stick.  It was easy to set up.  I recently (and gleefully) gave my cable company the boot.  I don't watch tv the way a lot of people do, so my assessment could differ a lot from other people's.  I like to have mindless old shows on while I am working at home - something I don't have to give my full attention to, but can chuckle at now and then.  Right now I am working my way through old Frasier episodes.  I missed the first season of Downton Abbey, so I'm looking forward to watching that sometime when I can give it more attention than I do old sitcoms.  I am also enjoying playing my prime music through the television.,  I took advantage of the offer Sling TV had of giving a free Fire TV Stick with three months prepayment of Sling.  Not so sure about Sling - I probably will not renew, but it's nice to have during basketball season, which is the only sport I really follow.  I haven't fully explored the other options on my Fire Stick as yet, but feel it was worth the price just for what I am using it for now.  Take THAT, Time Warner Cable!!", "verified": true, "helpfulness": "0/0", "author": "rebecca loer"}]