[{"rating": 5.0, "review": "As a prime member you have access to alot of free music & movies.  I back-up my pictures & videos from my phone to the Amazon cloud (free also) & my family enjoys seeing these on the large tv screen.  This is definitely worth buying if you have Amazon prime membership & internet to support it.", "verified": true, "helpfulness": "0/0", "author": "Acmom97"}, {"rating": 5.0, "review": "I love it, although I'm still trying to figure out how to use it. Too busy binge watching my favorite shows :)", "verified": true, "helpfulness": "0/0", "author": "Brenda Eckhart"}, {"rating": 5.0, "review": "After almost a month of use, we really like the Fire TV Stick. It was super easy to install and connect to our WiFi network. We are using it on a 1 year old Samsung tv with a standard home network, nothing unusual or fancy. We have changed WiFi routers and passwords once since installing the Fire Stick and resetting the stick took less than 3 minutes and it had no problems at all. The remote works fine and we've installed the remote control app on my Fire Phone and two Fire HDX tablets and that is working well. I actually prefer the app from my tablet to the physical remote control, my husband feels the physical remote is easier, so each to his own.The videos are clear, the ASAP is very nice and we have had instant play back on almost every Prime movie & tv show we've watched - no buffering like on our previous Sony streaming box. The mirror cast works perfectly from the Fire HDX tablets as well. I love that we can use the Fire Stick for slide shows of our photos and our own videos from the Cloud - no need to boot up the computer, dig through files on the hard drive and drag out USB cables or thumb drives!We don't have a Netflix account - no need with Prime streaming and cable - Netflix is just redundant for us. But the other apps and a few games all work well and we may end up buying the game controller at some point. Glad I bought this and I will probably get a second one for traveling in the future.", "verified": true, "helpfulness": "0/0", "author": "Dogs & Horses \"Spanish Norman Horses\""}, {"rating": 5.0, "review": "I love the Fire TV stick. My TV wont let me route the sound to my soundbar when using this, but somehow I doubt it's the stick's fault and more an issue with my setup. Everything about this is awesome though and I love that I can even get Netflix on it. Great product!", "verified": true, "helpfulness": "0/0", "author": "Rob M."}, {"rating": 5.0, "review": "Very happy with my Fire Sticks.", "verified": true, "helpfulness": "0/0", "author": "Patty Kish"}, {"rating": 4.0, "review": "As soon as they add the ability to log on to hotel wifi, they earn the other star.  I bought this for my overnighter to use with hotel wifi (replacing a product for the \"G\" company).  It is way better.  It is not dependent on my laptop or iPad to get online and with the benefit of their App store, I was able to add Airplay compatibility to connect with my iPhone and MacBook. The device is as fast as my Apple TV and certainly a fraction of the size.", "verified": true, "helpfulness": "0/0", "author": "S. Friedman"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Rachael Robichaux"}, {"rating": 5.0, "review": "This is great. It's easy to set up and easy to use. I have 3 Roku's and this. If you want a streamer this is definitely the one to use.", "verified": true, "helpfulness": "0/0", "author": "Dawn Roland"}, {"rating": 2.0, "review": "Funny how all the commercials DON'T show the power supply cord. Misleading.", "verified": true, "helpfulness": "0/0", "author": "Michelle Hanshaw"}, {"rating": 4.0, "review": "Turns your dumb tv into a \"smart\" tv. It pretty much does everything apple tv does, but so much cheaper and you can get the app and use your phone as the remote.", "verified": true, "helpfulness": "0/0", "author": "Allyson Baylon"}]