[{"rating": 5.0, "review": "Wish it had network TV like CBS, ABC  Fox and more sport .", "verified": true, "helpfulness": "0/1", "author": "Jack Carter"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "AndreaÃ\u0082Â F.Ã\u0082Â Taylor"}, {"rating": 5.0, "review": "love it, streaming is great.", "verified": true, "helpfulness": "0/0", "author": "DreamChaser"}, {"rating": 1.0, "review": "peace of s*** do not buy this! impassible to open remote to insert the batteries!!!!", "verified": true, "helpfulness": "0/2", "author": "Tom Feral"}, {"rating": 5.0, "review": "Thank you, Amazon, for such a terrific product! For under $40, my HDTV without wireless is now wireless! We watch Amazon Prime movies, Netflix and my personal favorite, Amazon music! Once again, an exceptional product from Amazon.", "verified": true, "helpfulness": "1/1", "author": "Amy E. Piispanen"}, {"rating": 2.0, "review": "This is getting hung frequently. Response to the keypad entry for the Youtube is very bad .I prefer to go for Roku. Since the App i am looking for is not supported by Roku ,Still I am using Amazon Fire Stick ...I feel amazon should work on the performance and also work on increasing the apps store.", "verified": true, "helpfulness": "1/1", "author": "Vishnupriya"}, {"rating": 4.0, "review": "Charging cable too short", "verified": true, "helpfulness": "0/0", "author": "Carlos R. Diaz Luna"}, {"rating": 5.0, "review": "I really like this.  I like being able to watch my Amazon Prime stuff without having to connect using my Kindle.  It is a great deal and great if you do not have a Web ready tv.", "verified": true, "helpfulness": "0/0", "author": "Sandnole \"sandnole\""}, {"rating": 5.0, "review": "Got this at a very great price from Amazon and now my \"dumb\" tv is a smart one and can now access all of the various media downloads", "verified": true, "helpfulness": "0/0", "author": "Bluffheights90814"}, {"rating": 2.0, "review": "The device is easy to set up and install. The price is reasonable.  However, I have had to unplug and replug it multiple times in its first week of use. Even when I know for sure my internet is running fast, shows stop in the middle. I bought the fire stick because I wanted to access my Prime Videos easily, but I regret the purchase.  It's just not consistent with streaming.  With this kind of issue the fact that it was easy to install and a good price doesn't matter one bit.  So far, I consider it a piece of junk.", "verified": true, "helpfulness": "1/1", "author": "Rebecca Hoff"}]