[{"rating": 1.0, "review": "It doesn't work. It's constantly buffering. My wireless network is fine. Every other wireless device I have works perfectly.  This is useless. I got it to watch Netflix on my upstairs TV and it's useless.", "verified": true, "helpfulness": "0/0", "author": "Lisa R."}, {"rating": 5.0, "review": "Very fast compared to apple tv  and chromecast.  Having a remote is a must.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "Stick was what we expected. Plan to order more.", "verified": true, "helpfulness": "0/0", "author": "Ronald Brown"}, {"rating": 3.0, "review": "HULU is a disaster on this. I'm sure Ellen D. Would agree.", "verified": true, "helpfulness": "0/0", "author": "Sheila c. Brown"}, {"rating": 5.0, "review": "It's awesome", "verified": false, "helpfulness": "0/0", "author": "jaime jimenez"}, {"rating": 4.0, "review": "I love it movie night  weekend", "verified": true, "helpfulness": "0/0", "author": "bjggvgghhhf"}, {"rating": 5.0, "review": "Love the firestick, its fast and easy to use.  It's faster then my Roku box :)", "verified": true, "helpfulness": "0/0", "author": "Monty Ehninger"}, {"rating": 5.0, "review": "easy to install and provides a lot of service for the costgo for it !!", "verified": true, "helpfulness": "0/0", "author": "ed wondoloski"}, {"rating": 4.0, "review": "Not much to say that hasn't been said in the previous 27k reviews. It blows Chromecast out of the water and is the best platform out there. I own the Fire TV (5 stars) and this.Unfortunately, I am about to return my 2nd Fire Stick. I bought it for my family room TV, which is wall mounted. I plug it in, connect to the USB port, turn it on, and I get a message saying I can't power it through USB. Whhaaaaaaaaa??????? Seriously? So, I am expected to fish the cable through a wall and try to find an outlet? Ummmm.... no. Major fail.If an outlet is convenient, it is 5 stars. Otherwise, it is useless.", "verified": true, "helpfulness": "0/0", "author": "michaelb1968"}, {"rating": 5.0, "review": "I have been an AMAZON PRIME member for a few yrs now. I just recently cut the cable /satellite and bought 2 of these Fire TV Sticks so we can have movies/ tv shows / music available to me through my Prime membership. It also has a great selection of apps to choose from. The speed of the interface is awesome. I was able to connect in less that 5 minutes after hooking them to my tv. I was connected to Prime and Netflix and the search is so much faster than using my blueray dvd player . Te blueray took much longer just to set up. I would reccomend the FIRE TV STICK to anyone who has AMAZON PRIME. E ven if you don't, give it a try and use their 30day trial membership. I will save about $800 this yr including the cost of Netflix and 2 FIRE STICKS after that its is just like money in the bank . And who likes talking to customer service of DISH/ DIRECT or the cable company. Amazon Associates are much more helpfull. I want to thank AMAZON for a great experience and product.", "verified": true, "helpfulness": "0/0", "author": "charlie Houghnagle"}]