[{"rating": 5.0, "review": "It's cool.", "verified": true, "helpfulness": "0/0", "author": "rick gagliano"}, {"rating": 4.0, "review": "Works great. The only thing I was disappointed with is that it has to have a power source.", "verified": true, "helpfulness": "0/0", "author": "Larry D Heiken"}, {"rating": 2.0, "review": "The Fire TV Stick did not work on the TV that I wanted to use it on. The TV was an older samsung 19 inch tv with HDMI slot. The tv wouldn't recognize the Fire TV Stick. I would not have purchased this if I had known that it wouldn't work on that tv. I got it for the 19.99 price so I have decided to keep it and use it on other tv sets. If I had paid the the 39.99 I would have returned it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's been a joy.  I've streamed certain apps through a blu-ray player and another gaming console but never experienced the performance I got with the Amazon Fire TV stick.  It's been amazing.  Can't wait to learn more of the things it's capable of!", "verified": true, "helpfulness": "0/0", "author": "J. Adkinson"}, {"rating": 1.0, "review": "My family uses 2 Kindle Fires, 1 Kindle Reader, and 1 Amazon Fire TV. Also 2 Roku devices. All 6 devices use the WiFi signal from my Comcast Modem/ Router with no problems. Neither of the 2 Sticks that I received could  access \"Amazon.com\" which was required during the installation. My problem was turned over to the Tech division who worked 2 weeks promising that they would call me on 12/13 with an update. No call so I returned the Sticks for a full refund.", "verified": true, "helpfulness": "2/3", "author": "Bill Meckel"}, {"rating": 5.0, "review": "nice idea", "verified": true, "helpfulness": "0/0", "author": "John W. Smith"}, {"rating": 3.0, "review": "Its ok, navigating through all the artists can be quite challenging.", "verified": true, "helpfulness": "0/0", "author": "Samuel Petit-homme"}, {"rating": 5.0, "review": "Love it. Has so many apps and is so convenient", "verified": true, "helpfulness": "0/0", "author": "jessica gomez"}, {"rating": 4.0, "review": "It's good to watch Netflix and to play some games, however I don't feel like paying to watch movies or tv episodes.", "verified": true, "helpfulness": "0/0", "author": "bear"}, {"rating": 5.0, "review": "Easy to use and great, quick reception", "verified": true, "helpfulness": "0/0", "author": "J Myers"}]