[{"rating": 4.0, "review": "Much faster than the Netflix/Amazon Prime apps that come with smart TVs and DVD players.  There are a few bugs, but overall I love this thing.  It's much better for members who have Amazon Prime (Maybe this should be called the Prime TV Stick). The image tiles load almost instantly, and there is no lag as you're navigating around.  Content loads significantly faster than native smart TV apps!Note: To get the FULL advantage of the Fire TV Stick, make sure you're using a 5 Ghz wireless connection. You'll get sharp HD this way.  If your router only supports 2.4Ghz connections you won't be enjoying a good HD experience and you'll notice occasional skips and glitches in the audio. You'll probably also notice a lot of buffering with the Netflix App.", "verified": true, "helpfulness": "0/0", "author": "OAO \"MR GPS\""}, {"rating": 3.0, "review": "It's just ok. I have to reboot it often to get it to work, and the screen freezes frequently.", "verified": true, "helpfulness": "0/0", "author": "Virginia \"Alabama Born and Bred\""}, {"rating": 5.0, "review": "Very happy with this. I replaced my older Roku and don't regret it one bit. It is easy to use and has a great picture on my 1080p TV. I like not having to point the remote directly at the device too.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "at first it was a little hard for me to navigate through I had to keep reading the prompts for an older person I wish it was just a little simpler but thank you again for fire stick", "verified": true, "helpfulness": "0/0", "author": "martha"}, {"rating": 5.0, "review": "great item-wish i bought 2!", "verified": true, "helpfulness": "0/0", "author": "carol frawley"}, {"rating": 5.0, "review": "Initially it had me very frustrated, forced me to watch a video that couldn't be skipped or fast forwarded, then got super slow(i kept pressing the buttons on the remote, minutes later it finally started moving through the Netflix app following every button press and forced me to unplug it to reset it)After the button incident, I moved the power cable from the USB port on the TV to an outlet and it's given me 0 issues since. I don't own a Chromecast or anything similar so this is great, and tons faster than my Blu-Ray player and it's apps.", "verified": true, "helpfulness": "0/0", "author": "Cliffton Thompson"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Debbie Brock"}, {"rating": 5.0, "review": "Amazing and easy to use!!!", "verified": true, "helpfulness": "0/0", "author": "Chai"}, {"rating": 2.0, "review": "Does not live up to my expectations.  We have moved our WiFi router as close as 15 feet away, and it still does not keep a constant signal.  Some days it does not even hook up at all.  And when we do get into Netflix or Hulu it cuts out every few minutes.  Not worth the money, wish I would have just purchased another Roku box instead.  Never any issues with the Roku, even the router farther away now!", "verified": true, "helpfulness": "0/2", "author": "Rich"}, {"rating": 5.0, "review": "Low cost entry-way to a plethora of features when paired with Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "tonyde"}]