[{"rating": 4.0, "review": "It was what I expected and I am very pleased with FIRE STICK", "verified": true, "helpfulness": "0/0", "author": "Neal Kludy"}, {"rating": 4.0, "review": "I love the idea I can use this on any USB PORT television in my house... It is similar to s smart tv ... My experience overall I really like it it ... It seems that the movies sometimes goes through of loading periods even with a great connection to WIFI . I would recommend this to a friend but warn him of this before buying ... I have watched several movies and it does not go through the interruptions on every movie but it has on more than a few movies. On some televisions the screen to choose moovie is sometime partially cut off and you do not see the entire menu .", "verified": true, "helpfulness": "0/0", "author": "Frequent shopper"}, {"rating": 4.0, "review": "Easy and reliable! Minutes to hook up!", "verified": true, "helpfulness": "0/0", "author": "CYNTHIA LERICK"}, {"rating": 5.0, "review": "amazed at how easy it was to set up!  love being able to watch my Amazon Prime movies on a big screen!  wish I would have bought one sooner", "verified": true, "helpfulness": "0/0", "author": "Lorie"}, {"rating": 5.0, "review": "So far, so good. Easy install. Easy use.", "verified": true, "helpfulness": "0/0", "author": "kickin'"}, {"rating": 5.0, "review": "Especially the apps", "verified": true, "helpfulness": "0/0", "author": "Richard D Smith"}, {"rating": 1.0, "review": "Was disappointed that its not compatible with the Galaxy s3 for screen mirroring. If theres a fix for this later on, i`ll update my rating, but for now it`s only gonna be 1 star.", "verified": true, "helpfulness": "0/0", "author": "drewa55"}, {"rating": 5.0, "review": "Had the chrome but now replaced with fire stick....and frickin loving it!!!! Movies and music via prime all the time :) highly recommend...I love the remote too!", "verified": true, "helpfulness": "0/0", "author": "Mr. Beef"}, {"rating": 5.0, "review": "As advertised. Easy installation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Loving it... Easy to use.. save money on a smart TV and just get a good picture with multiple HDMI outputs and a good wireless router..", "verified": true, "helpfulness": "0/0", "author": "Travis Jenney"}]