[{"rating": 2.0, "review": "This device is useless to share your screen unless you own a fire phone or tablet. Do not be deceived by the description of this device that implies you can use this function from any Android device. As a streaming device I'm sure it is fine. I returned mine and ordered a Chromecast stick that works with regular Android devices. This is a blatant attempt to get you to buy another Fire device  where you are tied into Amazon's marketplace.", "verified": true, "helpfulness": "0/4", "author": "G I."}, {"rating": 5.0, "review": "The Fire TV Stick completes the Prime experience. I own a Chromecast as well, but I find the Stick remote highly useful, responsive, intuitive, and a lot better to use than my phone. It may be apple-to-orange comparison, as each serves a distinct purpose, but the Stick really beats using the Amazon app residing on my TVs. The Android Fire TV app is also a gem in case I don't want to use the remote. Overall, this is an excellent product.", "verified": true, "helpfulness": "1/2", "author": "samsungfan"}, {"rating": 5.0, "review": "Initially, the stick could not connect to internet.  After updating, it connects well now.  I am happy to have it.", "verified": true, "helpfulness": "2/9", "author": "David Chen"}, {"rating": 5.0, "review": "Pros: Browsing and start speed is faster on Fire stick than on Roku stick. Has the option to browse prime only movies or tv. Netflix works just as good as on Roku.Cons: Voice search is only for Amazon products. Text search only searches the particular app you are using. Not a multi search liked on Roku. Does not have HBO Go. But then again HBO Go only works on the Roku if you have Verizon and not on Comcast or Xfinity. Chromecast had HBO Go on either service. Games offered on Fire stick are very few and not very interesting. Chromecast has much better games.Overall I like Amazon stick better than the Roku or Chromecast.", "verified": true, "helpfulness": "1/2", "author": "...."}, {"rating": 5.0, "review": "OK so I own the Fire TV which I love.  This is pretty much equivalent in terms of speed and the difference is it doesn't support as many games (I didn't see vice city?).  Anyways the functionality is great and WiFi performance is great.  I mostly bought this for XBMC (Now known as Kodi in v14).  Installation was simple using adb and I was able to connect to my file server without issues to stream videos.  I have not had any issues with crashing and was able to enable zero caching without issues.  Buy this if you are looking for a cheap XBMC/Kodi solution.Pros:-Strong WiFi performance.-Amazon Prime Videos work great-Very fastCons:-The included remote is stiff compared to voice remote.  Makes it hard to type fast.-Remote clicks are pretty loud.", "verified": true, "helpfulness": "10/12", "author": "Brandon"}, {"rating": 2.0, "review": "Took forever to connect to wifi no qwerty keyboard Amazon cheaped out on  the license fee.  The wifi chipset is horrible as it looses connection all the time and gets very hot. Seems after a few tests letting it cool gains connection. I purchased this for a family member with little tech experience as it fits the bill for cheap and cheerful. No WPS on set up and no qwerty makes it a bear for in- experienced users, the heat issue kills the deal. Amazon TV works well,  Fire Stick should be avoided.", "verified": true, "helpfulness": "0/4", "author": "droid dude"}, {"rating": 5.0, "review": "This device streams Amazon Instant Videos faster and in higher quality than any other device I have used.  This device is just super fast in general.  I find it very responsive.The Fire TV Stick would be great for beginners because of how easy and intuitive it is to use.  The navigation pad and a few buttons allows you to perform every function you would need to.  The downloadable smartphone app allows you to speak or use a keyboard on your phone to input text, like movie and TV show names.  This is great so you don't have to enter text using the on-screen keyboard.All of the apps respond quickly.  TuneIn and Pandora sound as good as they would on other devices with a good Internet connection.I'm really glad that I purchased this product since it is much faster than my other devices.", "verified": true, "helpfulness": "3/5", "author": "Juniorverse1"}, {"rating": 5.0, "review": "Love the simple controller and ability to play grade A games.. our whole family enjoys taking turns with the flapping bird game", "verified": true, "helpfulness": "6/7", "author": "Jason Miller \"CRELoadedexpertDOTcom\""}, {"rating": 4.0, "review": "Disclaimer: got it cheap through Prime. So far pretty cool.  Had to re-enter network creds after software update which was annoying, but Netflix and Prime music and video work nicely.  Side-loaded Crunchyroll with little effort, but would like to have it appear in Recent so I don't have to go to settings to launch.  Overall pretty snappy with nice picture.  Arte app is not loading for me, which is irritating.  I'll give it a day or two and then maybe try for support.  So far it is money reasonably well spent.  We'll see how things are when an HBOGO app hits.", "verified": true, "helpfulness": "0/1", "author": "William Kinder"}, {"rating": 5.0, "review": "Great addition to the fire tv family", "verified": true, "helpfulness": "1/2", "author": "Luis"}]