[{"rating": 5.0, "review": "Everything was as expected", "verified": true, "helpfulness": "0/0", "author": "Rhea Painter"}, {"rating": 5.0, "review": "Love how easy it is to use and the remote!", "verified": true, "helpfulness": "0/0", "author": "abutterfly687"}, {"rating": 3.0, "review": "Plusses and minuses to this item.  Setting it up took some work, it loses the internet signal frequently despite being very close to the router.  The HDMI stick is rather long so if your tv is mounted on the wall it may take some finesse and rearranging.  The power adapter to the stick is very short so if your tv is mounted on he wall you need to figure out a different power option. (Extension cord? Ugly.)  I'm working on a solution to that now :( Variety of shows is pretty good but the remote is not the greatest, especially for searching. I may need to suck it up and buy the voice remote :(", "verified": true, "helpfulness": "0/0", "author": "Dragonfly3085"}, {"rating": 5.0, "review": "Love it - perfect addition to any Smart or non-smart TV.Some apps (i.e., HBO Go App) are really laggy and don't run well on it.  I don't think this is a fault of the stick, but moreso the app not being optimized for the stick.  Netflix and games and other apps run just fine.  Really wish the Music section had Stations, but hopefully that comes shortly, as it is now on the app versions.", "verified": true, "helpfulness": "0/0", "author": "Tom Coran \"Tom\""}, {"rating": 1.0, "review": "I've had two of these and threw them both in the trash. You basically have to set it up within 3 feet of your router (and I have a good router) or you will constantly disconnect. PLEX is a gittering mess and Netflix plays only at the lowest quality. Yes, I have very fast internet.", "verified": true, "helpfulness": "0/0", "author": "Hernan Dreispiel \"Hondahunter2101\""}, {"rating": 5.0, "review": "Love this now that I have a good internet provider I am watching everything I can on amazon.", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 4.0, "review": "I'm actually really happy with this purchase. I had been using a small form-factor PC running openelec as my HTPC, but was missing some of the streaming video services (namely Netflix and Amazon). After finding that you can get Kodi running on these fairly easily, I pulled the trigger and bought it. Setting it up was a breeze and getting Kodi installed wasn't terribly difficult (had to go a few times, as the current stable release has some bugs that make it a show-stopper for me, so I had to use the 15.0 beta).I've been pretty happy with it for the last few weeks and would definitely recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Thecal"}, {"rating": 5.0, "review": "Just awesome. Replaced a entire DVD player and game console with a tiny thumb drive sized Amazon Fire TV Stick. I only wish they had signed with HBO but still 5 stars. Go Amazon, I love you.", "verified": true, "helpfulness": "0/0", "author": "Cameron Mills"}, {"rating": 5.0, "review": "Easy to set up..easy to use..very pleased with all aspects of this purchase.", "verified": true, "helpfulness": "0/0", "author": "angela"}, {"rating": 1.0, "review": "I found that the fire tv stick was slow to react and froze a lot while watching a movie", "verified": true, "helpfulness": "0/0", "author": "Peter Guy"}]