[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Katherine M Reynolds"}, {"rating": 5.0, "review": "Way better than Google Chromecast. Very easy to setup, came pre-configred with my Prime account. Been using it everyday and loving it. Haven't tried it without the power supply.", "verified": true, "helpfulness": "0/0", "author": "min rana"}, {"rating": 1.0, "review": "I've been waiting to write a review with the hope a patch would come out and fix my problems.  Let me start off by saying the hides well behind the tv and the way the menu/app are all well above the competition.  The problem I seem to have is the device keeps dropping wifi.  I'm not far from the router and the router is less than a year old and is a very expensive one at that.  The TV the stick is hooked up to has a chromecast and Roku hooked up to it as well as being a Smart TV on its own.  None of which have ever had the least bit of problem connecting to wifi.  Once the signal drops the only way to fix the problem is too reset  the device and when you are watching tv shows/ movies/ sports a freeze is incredibly frustrating.  This happens every day atleast once and usually more than once depending on how much I watch TV.  If this was fixed then the device is worth the price but as of now don't waste your money and just get a chromecast.", "verified": true, "helpfulness": "0/1", "author": "Jonathon R."}, {"rating": 5.0, "review": "Oh, I love this thing. No more PC under the TV. I can watch my Prime and youtube and play slots too!", "verified": true, "helpfulness": "0/0", "author": "Michael La Honta \"gassy\""}, {"rating": 5.0, "review": "Easy to use.  We were able to pre-order at a discount as a amazon prime member. It was bought to replace a Roku that suffered lightning damage.  Very happy with it.  Considering purchasing another one to use with our daughter's smart TV, because the apps on her TV are terrible and unreliable.  It is also worth noting that this Fire TV Stick has the best Netflix app of any of our devices (of three different TVs, the Roku, two different phones, two different tablets)!", "verified": true, "helpfulness": "0/0", "author": "T. N. \"wannielynn\""}, {"rating": 5.0, "review": "I have had Chromecast for some time now.  I took advantage of the Fire Stick deal for Prime members and am very pleased that I did  Setup as extremely easy and within a matter of minutes, we were able to stream Prime content to the TV.  The content didn't stutter or pixelate - just as clear as watching a video.", "verified": true, "helpfulness": "0/0", "author": "Sandi Rothman"}, {"rating": 1.0, "review": "Piece of Junk.", "verified": false, "helpfulness": "0/2", "author": "globalproducts"}, {"rating": 5.0, "review": "I have only used this for a few hours but it is much faster than the Chromecast.  The only thing this really needs is the Synology DS apps.", "verified": true, "helpfulness": "0/0", "author": "Kamron Aghataher"}, {"rating": 5.0, "review": "I purchased this Fore Stick TV for my family for Christmas.  I thought I would try it out before Christmas so we don't have disappointments on Christmas morning.  I loved it! And know they will also.  The setup was so easy.  I really didn't know what it was but thought for $19.00 why not try it.  I have watched Netflix, Amazon Prime and played games.  I loved that I could use my galaxy phone app. As a remote. Definitely a deal. Great if you don't have cable TV in every room.  Think I will buy a few more.  Again love it and know my family will to.", "verified": true, "helpfulness": "0/0", "author": "Carol Battaglia"}, {"rating": 5.0, "review": "Installed super easy. Has many channels available, although not HBO GO unfortunately.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]