[{"rating": 1.0, "review": "Worthless as will not connect to my wireless network after many attempts.", "verified": true, "helpfulness": "2/2", "author": "JB"}, {"rating": 5.0, "review": "Item comes with easy to follow directions. Just plug it into your TV, plug it into the wall, connect to your wireless internet, and you're set. Remote makes it very easy to navigate the menu and it's a nice simple interface. Definitely would recommend to friends and family!", "verified": true, "helpfulness": "0/0", "author": "Courtney L. Fisher"}, {"rating": 5.0, "review": "Great device for what we wanted.....and the price is right!", "verified": true, "helpfulness": "0/0", "author": "mary kay hayward"}, {"rating": 1.0, "review": "Disappointed so far.  The Amazon prime movies are not very good.  The good ones are the ones that have an additional cost.  Not as user friendly as the Apple TV either.  I don't think I'll be keeping the Fire TV stick plugged in for much longer.", "verified": true, "helpfulness": "0/1", "author": "Patty Campbell"}, {"rating": 3.0, "review": "Wish it had slingbox capability.", "verified": true, "helpfulness": "0/1", "author": "Brian Hilburn"}, {"rating": 5.0, "review": "Exactly as explained and came faster than expected. Love it! Pre-order was a great deal thank you!", "verified": true, "helpfulness": "1/1", "author": "Matthew Corona"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "trulyurs"}, {"rating": 4.0, "review": "I purchased this when it was on sale to Amazon Prime members for $19. Once I got it up and running, I had full access to all my Prime content. The interface isn't as refined or smooth as that of the Apple TV, but it functions well and is easy to get up and running. I will be using it to watch Alpha House, TransParent, and anything else I discover that is only available to me through Prime. Definitely worth doing if you want to stream, have Prime, and don't have any (or very much) iTunes content.", "verified": true, "helpfulness": "0/0", "author": "Benjamin \"QA Man\""}, {"rating": 5.0, "review": "It was super simple and I set up both of my fire tv sticks in under 10 minutes.  Pretty fast and the perfect piece of equipment to put on my Samsung smart tv....", "verified": true, "helpfulness": "0/0", "author": "I Love London"}, {"rating": 5.0, "review": "This thing's great. I haven't stopped watching prime shows since I received it. Very happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "O'Donnell Hamlet"}]