[{"rating": 5.0, "review": "Grrrrreat", "verified": true, "helpfulness": "0/0", "author": "Russell"}, {"rating": 5.0, "review": "Works as advertised.  Better than an external box.", "verified": true, "helpfulness": "0/0", "author": "Fbill1"}, {"rating": 3.0, "review": "Works well when it works. Freezes up from time to tine.  Unplug and restart.", "verified": true, "helpfulness": "0/0", "author": "Stan Lewandowski"}, {"rating": 5.0, "review": "10 stars for me. I'm cutting cable as soon as this months subscription runs out. I already have a smart TV with lots of apps, but this was what I needed. All my Amazon Prime videos and music in one place. SlingTV...LOVE IT!Plus tons of other apps that my TV doesn't have. And interestingly, far better picture quality than I EVER got with cable's scrambled, descrambled, downgraded resolution. My TV is performing like it was meant to.The FTVS was easy to set up and everything worked right off the bat. The remote looks like it doesn't do much, but it works great! I didn't mind the onscreen keyboard. It's much better than my Sony equipment and is faster to input too.The apps are easy to use, and the interface is much better than my Sony stuff as well. Easy to read, easy to see your choices.I'm in love with TV again. Bye, bye cable. I not even tempted to look back.So far, so GREAT!", "verified": true, "helpfulness": "0/0", "author": "wrknnwf \"wrknnwf\""}, {"rating": 5.0, "review": "Fantastic.  Going to be able to decrease my cable bill by about 30-40%", "verified": true, "helpfulness": "0/0", "author": "Kenneth Sebastian"}, {"rating": 5.0, "review": "Easy to set up. Never had TV stick but it's much more easier and faster than using my smart TV's remote to look for movies and TV shows. It's simple remote make it even more user friendly. I had student Prime so I paid $50 vs $100 annual fee however as far as movies I had higher expectation. I assumed with Prime I'll have more access to decent movies, there are movies but not as much as it's been advertised you still need to pay for most of them.This is really handy specially for folks who move around more often you can just connect it your WiFi router and stick it to you TV and ready to go.", "verified": true, "helpfulness": "0/0", "author": "Samo G"}, {"rating": 5.0, "review": "I absolutely love it! The picture is really clear too. I just wish it had HBO go", "verified": true, "helpfulness": "0/0", "author": "Kelsey Chalmers"}, {"rating": 2.0, "review": "Did not allow many apps.  Bluetooth mirroring was bad or cut out and would not reconnect.  Used power cord and was mirroring from a kindle fire so I give it some stars for ease of use.  Would never recommend this product.  Will not stream comcast content", "verified": true, "helpfulness": "0/0", "author": "Active Ennui"}, {"rating": 5.0, "review": "Love! Love! Love! Easy to install! Easy to use! All my prime instant video on my big screen!", "verified": true, "helpfulness": "0/0", "author": "Chrishelle"}, {"rating": 5.0, "review": "Easy to Install", "verified": true, "helpfulness": "0/0", "author": "Martha J. Callahan"}]