[{"rating": 5.0, "review": "Absolutely love the ease, of the Fire TV Stick  and the selection of programming available. My only problem is having to plug the power pack in to an outlet, my main TV in the family room will have to wait until I am able to access, but it is wonderful in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Kellianne"}, {"rating": 5.0, "review": "I love my fire stick. We have a smart tv but when streaming I constantly ran into buffering issues. Since I added the fire stick I don't have that problem at all. I dropped my movie channels on my cable since I am a prime member and get all the perks of the free streaming. I highly recommend this product if you all ready have a prime membership. It's extremely inexpensive for the benefits you receive.", "verified": true, "helpfulness": "0/0", "author": "Samantha R."}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Opening a whole new world of things to watch", "verified": true, "helpfulness": "0/0", "author": "K. House \"Memie\""}, {"rating": 5.0, "review": "Easy for seniors to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Steve P"}, {"rating": 5.0, "review": "My family loves it, this is a great deal especially if you're a Prime member", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"BETHANY LUVS BOOKS\""}, {"rating": 5.0, "review": "I've had this about a week now, and so far, so good.  Don't regret my purchase at all.", "verified": true, "helpfulness": "0/0", "author": "Luke's GaGa"}, {"rating": 5.0, "review": "Absolutely a great gadget.  Would buy it again for one of my family members.  Cannot say anything negative about it.", "verified": true, "helpfulness": "0/0", "author": "Flatbush"}, {"rating": 5.0, "review": "We ordered this to replace out roku which had started presenting with red lines. I also replaced Netflix with Amazon Prime. Netflix movies are so outdated and they do not replace often enough. I am so pleased with the ease of using the firestick and the quality of the pictures. Best of all I am loving the offerings from Amazon Prime. So much better than Netflix. I am now watching The White Queen season one for free. If you are thinking of switching don't hesitate.", "verified": true, "helpfulness": "0/0", "author": "kindle customer"}, {"rating": 5.0, "review": "I ended up with the Chromecast and the Fire TV Stick this Christmas.  I use the Fire Stick every day.  I tried the Chromecast a couple of times - it lives in a box, waiting for me to sell it or re-gift it.  Great product - recommended!  (Using the iPhone app as a remote works great, too.)", "verified": true, "helpfulness": "0/0", "author": "Spiderman"}]