[{"rating": 5.0, "review": "Awesome tool on television you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Richard Morton"}, {"rating": 5.0, "review": "Fast and furious. Works sharp. Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Raymond Perez"}, {"rating": 5.0, "review": "It exceeded my expectations and is as good if not better than apple tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Husband loves this. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tonia Hargett"}, {"rating": 5.0, "review": "Better than cable. It works great", "verified": true, "helpfulness": "0/0", "author": "Sharee"}, {"rating": 5.0, "review": "I've been using the Fire Stick since early June 2015. I also use an older Roku box. The Roku is great. The Fire Stick has been even better for me. The Fire Stick is fast, has all of the channels in which I'm interested and can be tweaked by side loading many Android add-ons. It may take a little effort to side load the apps but well worth it. Side load with either TVMC or KODI and you have a media center on a stick. Use the Fire Stick in conjunction with a TabloTV box and the Tablo app, add in TVMC or KODI and you are king of the of your own media empire. I now plan on ordering the Fire TV box for another room and comparing performance for all the devices.", "verified": true, "helpfulness": "0/0", "author": "lvron"}, {"rating": 4.0, "review": "The first stick died on me within a few weeks. It refused to detect any wireless networks whatsoever. I contacted Amazon and they issued me a refund promptly, so customer service was excellent on this occasion.The device works really well when streaming and has many of the big streaming apps and seems to be adding more, however the Amazon appstore is still lacking the apps that Roku and Google have. I only stream from Netflix, Hulu, Amazon Prime, and a few other apps for news, so this stick serves my purposes well.The performance is a little laggy while moving through menus, but it really doesn't bother me at this price point. The design of the UI could be improved to make it more efficient to use overall. The supplied remote works well at many angles. There is no power on/off, you have to either let it go into sleep mode or either unplug it. I just wish Amazon would let you turn off the device when not in use. I end up just unplugging it every time when not in use. I hope Amazon includes this on/off functionality in the next firmware upgrade.", "verified": true, "helpfulness": "0/0", "author": "Mark M."}, {"rating": 5.0, "review": "We are staying in a rental cabin with wi-fi and a TV So we bought the $39 stick from Amazon.  Simple to install and are streaming our favorites on Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Love, love, love this FireStick. It was easy to set up. We have had no problem with streaming at all. If you are having problems with streaming you need to upgrade your Internet!", "verified": true, "helpfulness": "0/0", "author": "Melvin Smith"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "kazem tabatabai"}]