[{"rating": 5.0, "review": "Very easy to set up.  Although I call myself a technohag at age 70, in reality, I'm probably just barely more than basic.  Yet I had no trouble at all.  Being an Amazon Prime member also made it very easy.  It recognized that right away.  I also was able to download my Netflix to it without a problem as well.I bought a book on Amazon to help me with the Fire TV Stick, but found I didn't really need it.  If you're going to do gaming or if you have a Kindle, the book might be helpful.I'm looking forward to having it on my TV.", "verified": true, "helpfulness": "0/0", "author": "Marens MomMom"}, {"rating": 5.0, "review": "Very good if u have prime", "verified": true, "helpfulness": "0/0", "author": "hud morgan"}, {"rating": 5.0, "review": "Awesome, so many choices!!!!", "verified": true, "helpfulness": "0/0", "author": "Linda Loffredo"}, {"rating": 5.0, "review": "We've had our Amazon fire stick for a couple of days. Setup was extremely easy. Took about 10 minutes at the most. The connection speed is great. Definitely happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Leticia Krier"}, {"rating": 5.0, "review": "The Fire TV Stick delivered everything as promised!", "verified": true, "helpfulness": "0/0", "author": "William Kopald"}, {"rating": 5.0, "review": "Great I like the portability to be able to move from TV to TV", "verified": true, "helpfulness": "0/0", "author": "jwesleyj"}, {"rating": 3.0, "review": "I like the convenience of being able to access netflix, amazon videos, watch espn, etc.  I have to have it plugged into the wall at all times to use it, which was not expected.  I thought it would just be a stick that plugs into the HDMI slot that can be moved between tvs with ease and no cords.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "This is easy to set up and quite intuitive to operate. We will enjoy using it, particularly with the Prime subscription and all the movies and television series that are available free through Prime.", "verified": true, "helpfulness": "0/0", "author": "C. Reader 1"}, {"rating": 5.0, "review": "Love my new fire stick...it is amazing!!", "verified": true, "helpfulness": "0/0", "author": "Debbie Whetsell"}, {"rating": 4.0, "review": "I was under the impression that being a prime member there would be far more programming that could be watched on instant video at little or no charge but that is not the case.  If you want to watch some of the newer movies in some cases you have to pay as much as $20.00 to view the movies.  My kids do like the TV programming on instant video. I am satisfied with the ease at which you can download and watch movies but feel they need to let you know that you are going to have to pay more than they lead you to believe when they are trying to get you to become a prime member.", "verified": true, "helpfulness": "0/0", "author": "Rob"}]