[{"rating": 4.0, "review": "Super cool device with a poor selection of apps.", "verified": true, "helpfulness": "0/0", "author": "Simbiosisgroup"}, {"rating": 5.0, "review": "A good convenience; no complaints", "verified": true, "helpfulness": "0/0", "author": "winston"}, {"rating": 4.0, "review": "Very impressed with the Amazon FireStick. I've been using for streaming Netflix and Sling TV and find the interface easy to use and quite fast. Excellent picture quality with my 50 mps internet speed. Only issue I have not resolved is trying to use my Denon Receiver Remote control instead of the Firestick remote.", "verified": true, "helpfulness": "0/0", "author": "steven ascher"}, {"rating": 4.0, "review": "I absolutely love it!  I take it on trips, play games, and use amazon instant whenever I want. Having amazon prime is not just a great asset because of the free shipping deal, you can listen to music as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little device is amazing.  Ease of set-up was great.  Daily use of the remote is just plain simplicity itself.  Using this now instead of the veryawkward blue-ray player set-up I was using.  This fire stick set-up has a 'fast forward' feature that really works remarkably well, as does the pause and resume feature.  Couldn't be happier with this.  Faster, easier, and intuitive.  Great value for the money too.  Absolutely and positively the fastest, easiest, and least expensive way to put streaming services on your TV.  Netflix plays particularly well on this.", "verified": true, "helpfulness": "0/0", "author": "jrgawencki \"Flick Flack\""}, {"rating": 1.0, "review": "I purchased the stick as a compliment to my SLINGBOX, and the remote is not good for this at all.  Very frustrating, and I will probably have to return the stick.  Technical assistance person I spoke to was great though!", "verified": true, "helpfulness": "0/0", "author": "Brian Short"}, {"rating": 1.0, "review": "It doesn't Work signal is always dropped. I have a  Chrome also and have no problems with it", "verified": true, "helpfulness": "0/0", "author": "Mike Jostes"}, {"rating": 1.0, "review": "Not pleased, doesn't easily sync with my Mac.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 1.0, "review": "Can't connect to my wifi. Doesn't offer my cable company for any apps I want... Waste of money", "verified": true, "helpfulness": "0/0", "author": "Grant Cook"}, {"rating": 1.0, "review": "I returned it because I got it to watch MLB.TV and it did not keep up. The streaming was just buffering nonstop, I have have super fast wifi speed. Got the Roku stick and no problems.", "verified": true, "helpfulness": "0/0", "author": "Stephen Coleman"}]