[{"rating": 5.0, "review": "For all the people with HULU stuttering issues, the problem is with the stock power adapter. I was able to resolve the issue with both of my fire tv stick's by plugging the power into my XBOX's. It also worked with an standard iphone USB adapter. Not sure if Amazon went cheap on the power blocks or if they are purposely filtering down the 5volts, possibly to extend the life of the device or prevent overheating but it comes at the expense of the sticks performance. I love the firetv stick and would suggest it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Fizzybubbly"}, {"rating": 5.0, "review": "Much better than chrome cast", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "So much awesome media brought right into the comfort of your living room!", "verified": true, "helpfulness": "0/0", "author": "Ty Kraynik"}, {"rating": 5.0, "review": "It seems to connect really well and works Great!", "verified": true, "helpfulness": "0/0", "author": "Joe Stapleton \"Joe Stapleton\""}, {"rating": 5.0, "review": "Very pleased with this selection.  Tried to decide what to get and compared it in price, capability and reliability to other similar products and this one won out in every category.  Another benefit was that it was extremely easy to setup and so we were able to enjoy it almost immediately.  Lastly, the amount and quality of the shows and movies on Amazon Prime is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Dennis R. O'Brien"}, {"rating": 5.0, "review": "Excellent product and service!", "verified": true, "helpfulness": "0/0", "author": "Edward Chisholm"}, {"rating": 1.0, "review": "The first time I installed it on my 7 year old Sony 52\" TV it worked great. Then I took it upstairs to the TV in the kitchen so my wife could enjoy it and it worked great. When I took it back down to the Sony it no longer worked. All I could get is a blue screen with a message that said something like, \" access was denied\". I tried resetting to factory defaults but still got the same message. Next I contacted customer support and spoke to a tech who had me try the same things I had already done and then said he could not help me and would transfer me to another tech. This guy had me try all the things we had already tried with several more like disconnecting all my inputs to the TV except for the Fire Stick; but nothing worked. Finally he just told me the fire Stick was not compatible with my Sony. So of course, I asked him why it worked the first time I used it and was able to watch a movie on Prime without a problem. He had no answer except that the TV is not compatible with the Fire Stick. I tried searching for an Amazon web page that would give me a list of TV's that are or are not compatible with the fire Stick and could not find anything. It seems to me that if the Fire Stick is not compatible with all TV's that Amazon would let people know before the purchased the Sony TV. Now I've got a Fire Stick that doesn't work on my main TV and a year of Prime that I can't make full usage of. I feel like I've been ripped of by Amazon.", "verified": true, "helpfulness": "0/0", "author": "RV'N SNOWBIRD"}, {"rating": 5.0, "review": "My husband purchased the Fire stick for me as a Christmas present.  I LOVE it!  I was able to see movies that I thought was lost forever. Kinky boots &  Greystoke - the Legend of Tarzan, two of my all time favorites!We have 5 grandchildren 3 of them are 3 years old a toddler and a new born. The variety of movies is just wonderful.  They have a fun time choosing what they want to see and can ONLY see at Grandma's!Thanks again for such a great gift.", "verified": true, "helpfulness": "0/0", "author": "LadyTBear \"I'm a Grandma of 8 mother of 5 and love to read, fish, sew, go  camping.  I REALY LOVE my Kindle for all I can do on it!\""}, {"rating": 5.0, "review": "I love this thing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Hesam Musallet"}]