[{"rating": 4.0, "review": "Easy to install but T.V. has to be close to a wall outlet.  Periodic freezes while streaming but no longer than 2-3 seconds. Purchased the Roku 2 as well. Like the interface better on Amazon but Roku streamed better.  No other noticeable differences.", "verified": true, "helpfulness": "0/0", "author": "Amazon lover"}, {"rating": 5.0, "review": "Excelent Product! Alot of  cool things that you can do with this.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Awesome product! Love it!", "verified": true, "helpfulness": "0/0", "author": "Jill o. Montgomery"}, {"rating": 5.0, "review": "It works perfectly for our Netflix streaming and Amazon Instant Videos.  Highlyrecommend over Crome Cast.", "verified": true, "helpfulness": "0/0", "author": "Pepper P. Potts \"book maven\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "KINO"}, {"rating": 5.0, "review": "We love this thing. Best electronic investment ever. And I am saving nearly 100 bucks a month by dropping cable TV!", "verified": true, "helpfulness": "0/0", "author": "Kelynda"}, {"rating": 2.0, "review": "Won't/can't auto-start next episodes (it says it can't reach the Netflix service) and then kicks me, forcing me to log in every 24-44 mins.It's 2 stars only b/c having access to Prime music is nice, but I'm using my Smart TV to satiate my Netflix addiction. I've never actually browsed Prime video so it's nice not knowing what I'm missing!", "verified": true, "helpfulness": "0/0", "author": "Johnny K"}, {"rating": 5.0, "review": "Screw cable. These sticks are the way to go.", "verified": true, "helpfulness": "0/0", "author": "William Becker"}, {"rating": 5.0, "review": "My wife and I finally decided to ditch cable/satellite since TV isn't really a necessity and I was tired of paying for garbage I didn't watch or care about. So far the Fire Stick has allowed us to download all the apps we've wanted so we can watch movies, listen to music, or play some games when we have some time.I was able to install the Fire Sticks to my TVs with ease and supply them power and still keep them hidden behind the screen so you don't see any ugly cables. I really like the Fire TV app that allows me to control the Fire Stick when my daughter decides to play with the remote and lose it. I'm able to control both my Fire Sticks from the app so I don't have to be concerned about which remote goes with which TV.", "verified": true, "helpfulness": "0/0", "author": "Louis Fleming"}, {"rating": 5.0, "review": "I'm the type that asks people to do these sort of setups for me, but this I did myself in about 10 mintues from start to finish.I so enjoy wathcing shows on my TV as opposed to my iPad.  Would recommend to anyone wanting to stream to TV.", "verified": true, "helpfulness": "0/0", "author": "JW"}]