[{"rating": 5.0, "review": "So far, so good.  Received as a Christmas gift and have enjoyed watching Netflex and Amazon Prime.  I used to have to plug into my computer and have a cord running to the TV.  This is much easier.", "verified": true, "helpfulness": "0/0", "author": "Louise in St. Louis"}, {"rating": 5.0, "review": "Works great. Finally, a way out of the cable/satellite black box. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Stephen J. Haessler \"theoecon\""}, {"rating": 5.0, "review": "It works great!  Can access my Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Dla"}, {"rating": 3.0, "review": "Works for what I need it for, but wish the voice search worked with stuff other than just Amazon, like Netflix.", "verified": true, "helpfulness": "0/0", "author": "J. Nieski \"Josh\""}, {"rating": 5.0, "review": "LOOOOVE this thing. All the apps (hulu, netflix, prime, etc.) are now all in one place and the kids can jump from one to the other all on their own.  Buying one for every tv this year.  Plus, the app on your phone makes it super handy to use when you inevitably lose the remote.", "verified": true, "helpfulness": "0/0", "author": "Becky Benedict"}, {"rating": 5.0, "review": "I bought the Fire Stick for my daughter to use on a TV in her bedroom.  It was easy to set up and works great.  I have a Roku box in a different room and prefer the Fire Stick.  Cool product...nicely done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Michael Hardin"}, {"rating": 3.0, "review": "I bought this product through BB prior to Christmas and have had repeated issues with the wifi dropping in and out.  The interface and content is great, but I cannot recommend due to it only working 50% of the time.", "verified": true, "helpfulness": "0/0", "author": "Byron"}, {"rating": 3.0, "review": "I like the remote, easy set up, seems like all the shows I like to watch I have to pay extra for.", "verified": true, "helpfulness": "0/0", "author": "Tonya T."}, {"rating": 5.0, "review": "Love it. Work as well as Apple TV and it's cheaper and better than Google stick.", "verified": true, "helpfulness": "0/0", "author": "Cindy Pennycuff"}, {"rating": 5.0, "review": "I am in love with this!  I use it almost everyday.  For now I am just watching Netflix shows but it works great and is easy to get the hang of.", "verified": true, "helpfulness": "0/0", "author": "Erika Humphrey"}]