[{"rating": 5.0, "review": "Works well and fast shipment too!", "verified": true, "helpfulness": "0/0", "author": "Scott99"}, {"rating": 2.0, "review": "Drops it's network connection roughly once every 2-3 hours requiring backing out to the main menu and resetting via the setting menu. Absolutely the dirt worst Twitch.tv app I've dealt with. I'll be purchasing a Chromecast and chucking this into the closet to gather dust. 2 stars because it actually does work, just not in a way that should impress anyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Working as expected", "verified": true, "helpfulness": "1/1", "author": "JSchrodair"}, {"rating": 5.0, "review": "I love my Fire TV stick. I'm already an Amazon Prime member and I also use it to watch Netflix. It works great and I haven't had any problems with it. Was super easy to \"install\", if you can even call it that. You just plug it in and follow the instructions on the screen. I would recommend for any Prime, Netflix, Hulu, etc subscriber.", "verified": true, "helpfulness": "1/1", "author": "Abby \"alynes\""}, {"rating": 5.0, "review": "awesome , love the fire stick. buying another one right now", "verified": true, "helpfulness": "0/0", "author": "Leonard"}, {"rating": 5.0, "review": "I love it! A whole new world has opened up for me :-)!I would call myself technologically challenged but even I was able to set it up!", "verified": true, "helpfulness": "0/0", "author": "Doe"}, {"rating": 2.0, "review": "I have the Amazon Fire TV Box and purchased 2 of the sticks for my kids for Christmas, was not at all unimpressed with the clarity or the steaming capacity on the TV screen compared to the box. Or vs the roku box or stick( better on both of those then Amazon stick ??) seemed a bit strange especially with the high reviews. Any suggestions on what I may need to adjust or settings. All newer TVs and have great internet service .....Disappointed !Love the my anazon box, just don't want to spend $200 for 2 more .", "verified": true, "helpfulness": "0/1", "author": "Toni"}, {"rating": 5.0, "review": "wow what a great product. I just love my prime udated just fine great apps great conection via wifi simple to use real fast. even with uverse", "verified": true, "helpfulness": "0/0", "author": "Brian F. Velazquez Sr."}, {"rating": 1.0, "review": "A pretty long process to set up , apps took a long time to download . I have a Roku stick and it was already to go just log into the apps you want. Get your connection and log in,  no app download.", "verified": true, "helpfulness": "1/3", "author": "chris villanueva"}, {"rating": 1.0, "review": "Checked after midnight, really early this morning, and before work and it was priced 39 all those times with no indication of when it would be 24.  As soon as my lunch break started, I checked only to find it was 100% claimed, with a full waitlist, yet an advertisement with it saying as a prime member this deal is just for me!  WHAT A JOKE!  I have had my eye on it for awhile but was waiting for a sale.  I almost bought the other day then heard about Prime Day.  It was the only item I wanted today.  I think I will be buying either the chrome or roku sticks from another store instead, even though Amazons has more features. They are cheaper and the one time I thought I could get a good deal on this, I couldn't.  Unfortunately,  I have already paid my prime membership for the year just a couple months ago.  I will milk it for all its worth with free shipping and TV and movies, then never buy it again and probably not order from amazon.  I am even an amazon credit card holder, but from my experience and many other disappointed customer reviews I read today, they did not treat their customers right with their sales today.  Way to lose customers when they are trying to build up new prime members....losing old ones in process.  I read the reason they ran prime day was to be proactive against a competing company to launch later this year.  I am now interested in learning about the competing company and paying that membership when my prime expires!", "verified": false, "helpfulness": "7/10", "author": "booklover"}]