[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "i.hamilton"}, {"rating": 1.0, "review": "This device could not hold a Wifi connection (with or without the extender) while every other device in my house connects and streams perfectly fine. Possibly just a defect but the process of getting it replaced started turning into shenanigans... I was transferred to 3 different people before I decided to hang up and return it for my money back.", "verified": true, "helpfulness": "1/1", "author": "Zimberg"}, {"rating": 3.0, "review": "Doesn't provide the services I was expecting without having to pay extra.", "verified": true, "helpfulness": "0/0", "author": "Judith Hobby"}, {"rating": 3.0, "review": "When it works it's good. Too bad it drops off the network every 10 minutes. It gets pretty hot too. My roku is hooked up to the same TV and has no issues with the wifi.", "verified": true, "helpfulness": "0/0", "author": "christopher"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "Johnnie linares"}, {"rating": 3.0, "review": "The device works well enough I suppose on Amazon Prime content. After trying a couple of the other apps however the Fire Stick comes up short. Netflix (which I use all the time) does some weird things. You'll be watching a movie and the video will suddenly freeze but the audio keeps going. After a few second the video super fast forwards to catch up to the audio. Very annoying behavior!Another app I use alot is HBO-GO. On this device HBO-GO is more like HBO-SLO. Slow to the point of unusable.The Amazon Fire stick is a great concept, I love the remote, but it still falling short of a seamless watching experience to date. I only hope it gets better.", "verified": true, "helpfulness": "1/1", "author": "Raxx050"}, {"rating": 3.0, "review": "Have had no problems with it until I changed the batteries... the remote has not worked since!", "verified": true, "helpfulness": "0/0", "author": "b. hall"}, {"rating": 1.0, "review": "Again just fire stick does not respond to the bt remote... Amazon has replaced it once, but after installing the replacement today i still can't get the remote to work w/o being behind the tv... The tablet app works, what's up?. Since this was a replacement and I've returned the original i don't seem to have the option to request a replacement, any assistance? Thanks, KD", "verified": true, "helpfulness": "0/0", "author": "Ken Duke"}, {"rating": 5.0, "review": "I wanted netfilx box for a family member and it fills that role perfectly tho on the first day it was running a bit hot so after u set it up let it stay plugged in and in sleep mode for a while should be fine", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 3.0, "review": "It sucks that I can't use it for HBO because an agreement with Comcast wasn't reached yet.", "verified": true, "helpfulness": "0/0", "author": "Valeria"}]