[{"rating": 5.0, "review": "Love fire tv. Met all expectations and beyond.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as described. I do wish it had a \"launchpad\" type setup to where I could set my most-used apps. Best I can figure out is to use the \"recent apps\". Performs well, though. Well worth the purchase, especially for using Amazon Prime and SlingTV.", "verified": true, "helpfulness": "0/0", "author": "Donny"}, {"rating": 4.0, "review": "Easy load works great", "verified": true, "helpfulness": "0/0", "author": "Mike Lueer"}, {"rating": 2.0, "review": "I got this as a birthday present. Better than average search menu for videos, very fast. My only complaint is that I have not found a way to connect bluetooth headphones to it. It obviously has bluetooth support, so it would seem fairly minor to include this as an additional download, even if it mean  t buying amazon speakers or headphones. From searching I found a android apk that would work but there is an audio lag.I can't honestly recommend it.", "verified": false, "helpfulness": "0/0", "author": "Cheryl B."}, {"rating": 5.0, "review": "My husband absolutely loves this.  Took all of 3 minutes to set up.  Works almost like our Kindle so it's easy to get used to.  Hoping more things become available at no charge! :-)", "verified": true, "helpfulness": "0/0", "author": "kam mommy"}, {"rating": 5.0, "review": "Wow! I am totally surprised, this thing is outstanding.My kids are watching cartoons as I type this through the Fire Stick,lol. Thank You Amazon,I am going to buy 3 more of these, for each room we have, says my Wife,lol. \"NOT\". I give this 5 stars across the board, and would give it moreStars if I could. BUY THIS, if you have an HDMI tv, and decent ISP, you must buy this thing.OMG, its outstanding, youtube is hooked to me now,Along with my Amazon Prime, it was so so so easy, plug & play, and within 4 mins I was up and running.Easy to navigate, easy to add apps.,and easy to setup , how can you go wrong ?? Especially for this Price. Amazon, you got it together with this thing. The Remote works veryNice also. Hope this helps those who are being cautious.....don't , this works, hands down. And Amazon has a money back warranty.Jim", "verified": true, "helpfulness": "0/0", "author": "Jim Lyman"}, {"rating": 1.0, "review": "Kept dropping the wifi , freezing up and would check wifi signal and it would say very good . But freeze up a lot . Took back to store my internet is 50 Mbps , newer router .. So that wasn't the problem .", "verified": false, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "it works great  its so easy to install and so easy to use  id recommend for anyone who enjoys tv", "verified": true, "helpfulness": "0/0", "author": "Burt F. Cypress \"dart shooter\""}, {"rating": 5.0, "review": "Works great. Buying more for my other tvs. Like the remote. Easy to set up and operate.", "verified": true, "helpfulness": "0/0", "author": "gary winningham"}, {"rating": 5.0, "review": "We are well satisfied with the fire stick and would highly recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}]