[{"rating": 5.0, "review": "This is a great device. It does everything. So far I've beenvery impressed how fast it is, how stable it is and howversatile. Lots of apps to install, side loading apps is supereasy, and I can cast from my phone or tablet as well.I paid $25 on black Friday. I'm really happy I did.", "verified": true, "helpfulness": "0/0", "author": "John Lamb"}, {"rating": 1.0, "review": "I just set up my fire stick and I am not real HAPPY with the remote, I think it is possessed", "verified": true, "helpfulness": "1/3", "author": "Sandra Hilton"}, {"rating": 4.0, "review": "twitch tv only streams at 480p", "verified": true, "helpfulness": "0/0", "author": "Sean Lowe"}, {"rating": 2.0, "review": "Amazon shipped the product super late. Amazon has not made the iOS app available as of yet, despite their promise to do so after a lengthy delay.There's a little lag in the interface. While it's serviceable it not like the zero lag in the current Fire TV. In its current state I wouldn't recommend buying it  unless you were able to receive it for $20 or less.I'd recommend purchasing the Fire TV if you could find a good deal on that. The Fire TV you has voice search built-in via the included remote, therefore you wouldn't have to wait on the ISO app to take advantage of that feature. The Amazon Fire TV would also eliminator the lag issue, however it is not worth purchasing at it's full retail price, so again I'd recommend such a purchase only if you recieve a significant discount from its regular price.The bottom line is, if you're starting from zero and you can get a good price on either the Fire Stick (>$20) or the Fire TV (>$60) they're okay devices. If you already own Chromecast, Apple TV, Roku or something else similar, you're better off just pushing Amazon's apps and service to your device wireless. The slight convince that you gain with a dedicated device is not work the cost in their present state.", "verified": true, "helpfulness": "0/0", "author": "Johnny Walker \"Personal Hoarder\""}, {"rating": 5.0, "review": "Love it. Very impressed at the speed and fluidity of interface. Can't believe how good it is for something in such a small package. Do wish it had Ethernet option, but I guess that's what the FireTV Box is for.", "verified": true, "helpfulness": "0/0", "author": "Stereodan"}, {"rating": 5.0, "review": "Very slick.  Easy to set up and use.  Picture quality is excellent.  No lag or distortion.  Very happy with this.Just wish it would work with my Onkyo A/V receiver from 2008 so I could get 5.1 surround sound working.", "verified": true, "helpfulness": "0/0", "author": "JerseyGMP"}, {"rating": 5.0, "review": "Used it for 2 weeks, and so far beats Roku & both smart TVs on speed, memory, user interface and general design.", "verified": true, "helpfulness": "0/0", "author": "To build a city upon a hill \"Albion, rule the waves\""}, {"rating": 5.0, "review": "We love it and its works great. Got it pre-order for $25 so it was a good deal.", "verified": true, "helpfulness": "0/0", "author": "R. howard"}, {"rating": 4.0, "review": "Works well on one tv a little flakey on another", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very user friendly, clear streaming. A must buy, great value", "verified": true, "helpfulness": "0/0", "author": "jayco \"jayco\""}]