[{"rating": 3.0, "review": "Not what I expected!", "verified": true, "helpfulness": "0/0", "author": "Victor Trujillo"}, {"rating": 5.0, "review": "Makes watching tv easier", "verified": true, "helpfulness": "0/0", "author": "Cindy Wyatt"}, {"rating": 4.0, "review": "There are a number of feelings I have towards this little stick. I love it ultimately there are only a few small tweeks I would make. The remote is too small and gets lost all the time with a dog and a kid I can never seem to find it. Additionally it won't work if it's not plugged into the wall. I wish it could be charged and then plugged in. But hey, not everything is perfect. I recently had an issue with this where I was in the middle of a show and it shut down. I couldn't get it to work. I contacted customer support. They couldn't make it work either and told me to wait a few hours. That didn't work. I then e-mailed them and they are sending me a replacement no questions asked. That makes me very happy.Pros:Lots of appsYou can chose your apps, they aren't pre-loadedSmallEasy to installPrice cannot be beatCons:Small remote gets lost a lotNeeds to be plugged in all the time, not convenient.", "verified": true, "helpfulness": "0/0", "author": "Devdevie"}, {"rating": 5.0, "review": "Great item love having it for hotels", "verified": true, "helpfulness": "0/0", "author": "Wise2615"}, {"rating": 5.0, "review": "I,m so happy we purchased the Amazon Fire TV stick.  It is one of the best decisions we have ever made.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Pistolese"}, {"rating": 5.0, "review": "this is truly better than cable..", "verified": true, "helpfulness": "0/0", "author": "Nery"}, {"rating": 5.0, "review": "works great on our tv's we recommend it to our friends and family. perfect price.", "verified": true, "helpfulness": "0/0", "author": "JENKIKI"}, {"rating": 4.0, "review": "Awesome, with Tigo LTE!!!", "verified": true, "helpfulness": "0/0", "author": "jeronimo"}, {"rating": 5.0, "review": "Great item super fast shipping love it..", "verified": true, "helpfulness": "0/0", "author": "Jon Delaney"}, {"rating": 5.0, "review": "Great Product. Easy to use. Easy to set up. And can accompany you if you travel.", "verified": false, "helpfulness": "0/0", "author": "Afsi Siahkoohi"}]