[{"rating": 3.0, "review": "I had difficulaty setting it up, but it works after set up.", "verified": true, "helpfulness": "0/0", "author": "Carol McMillan"}, {"rating": 5.0, "review": "I would recommend Amazon fire stick to anyone. Especially someone who already is an Amazon Prime customer. It works very well.", "verified": true, "helpfulness": "0/0", "author": "Regina"}, {"rating": 1.0, "review": "This is not worth 1 cent. It disconnected and streams all through movies.  I have full great connection and it still does not work I am sending them both back got one for gift I am embarrassed I gave it now. They have same problem.  Only 1 star cause I had to to submit this", "verified": true, "helpfulness": "1/1", "author": "Joni"}, {"rating": 4.0, "review": "This works great so far....", "verified": true, "helpfulness": "0/0", "author": "treed0218"}, {"rating": 4.0, "review": "Happy with the product, but not happy that I had to input my credit card info just to get the FREE Netflix app!", "verified": true, "helpfulness": "0/0", "author": "Mary A. Lord"}, {"rating": 5.0, "review": "Simple to install and use! Great for the price!!", "verified": true, "helpfulness": "0/0", "author": "Shani Law"}, {"rating": 5.0, "review": "Great! No issues!", "verified": true, "helpfulness": "0/0", "author": "Alberto Lopez"}, {"rating": 5.0, "review": "Works just like it said. I'm satisfied", "verified": true, "helpfulness": "0/0", "author": "vincent Basnight"}, {"rating": 5.0, "review": "Effortlessly  I can connect to Netflix  and Amazon  streamed entertainment.  The quality of the picture  is excellent . This was what I wanted with the fire stick and that was what I got", "verified": true, "helpfulness": "0/0", "author": "Carolyn Bennett"}, {"rating": 5.0, "review": "Love it!!! Extremely easy to use and makes purchasing Prime more worth it now! I also love that it doesn't take up space (like a box), got enough of those already attached to my tv.", "verified": true, "helpfulness": "0/0", "author": "USA424"}]