[{"rating": 5.0, "review": "Absolutely Awesome, Just plug and play. Works fantastic!!! I recommend this for everyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm lovin' the Fire Stick so far. We have a second home with no cable, but with WiFi. I used to watch TV via my Kindle Fire and a HDMI chord. I take full advantage of Prime content. The biggest differences are that I don't have to take the device back and forth with me all of the time and that now I have a remote. The streaming seems to be pretty consistent even though I live in the land of spotty internet service. At this price point, you can't go wrong with the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "BT Brewer \"BT Brewer\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Bekki Meyer"}, {"rating": 5.0, "review": "Smooth, simple, useful, great app support on phone.  Bonus: supports wireless AC for added wireless bandwidth!", "verified": true, "helpfulness": "0/0", "author": "Max Polk \"Max\""}, {"rating": 5.0, "review": "In the first week I had my money's worth... I am so happy I got it.", "verified": true, "helpfulness": "0/0", "author": "Karen S Weihrauch"}, {"rating": 5.0, "review": "I have used it everyday since getting it. My favorite feature is being able to use my phone as a remote. I often lose the actual remote, but luckily I can use my phone. Only negative I would say is that I didn't order two of them when they first came out!", "verified": true, "helpfulness": "0/0", "author": "C. Car"}, {"rating": 5.0, "review": "Every Playon owner should get this stick.  Been using since Oct 14.  To get Playon to work install playon on your android phone or tablet, so now it shows up in your list of purchased apps.  Next side load playon onto the fire stick.  Go to apps launch it.  Next install from app store, will connect the 2 and playon now shows up as an app for you in your recent list.  I watch prime movies\\tv and playon, this thing works as well as my sony bluray player, great device.", "verified": true, "helpfulness": "0/0", "author": "Father of 7 kids \"Jeffnusa\""}, {"rating": 4.0, "review": "Affordable purchase, but a little laggy.", "verified": true, "helpfulness": "0/0", "author": "L"}, {"rating": 1.0, "review": "For some reason not able to connect toy TV. For some reason notAble to recognize my wiifii", "verified": true, "helpfulness": "0/1", "author": "Christina Hladek"}, {"rating": 2.0, "review": "When it works, it is an amazing unit for the price tag. But it shows random tv static for like 5 seconds every 30-60 min. Plus randomly shows a blue screen showing \"unauthorized HDCP content\".I would expect such performance from a chinese un-branded unit. Not an Amazon Product.", "verified": true, "helpfulness": "1/1", "author": "Matias Ortiz"}]