[{"rating": 5.0, "review": "Easy to use; a real pleasure.", "verified": true, "helpfulness": "0/0", "author": "Bea Vinyard"}, {"rating": 5.0, "review": "Well, I got mines two days prior to when it was supposed to be delivered.  I am so HAPPY with my purchase.  You can't go wrong with Amazon.  I was kind of scared that my new Sanyo TV wouldn't be compatible, but the thing worked out GREAT!!!  It was so simple to hook up, I didn't even need or read the directions.  Picture quality is very clear. If you're into movies like me and can not afford the high cable prices, take my word, THIS IS IT and THEN SOME!!!", "verified": true, "helpfulness": "0/0", "author": "Sheila Nichelson"}, {"rating": 5.0, "review": "Love it and its easy to set up, and good price too. And I like the is small can take anywhere.", "verified": true, "helpfulness": "0/0", "author": "Brenda Moreira"}, {"rating": 5.0, "review": "I just love it...ease of installation and use are key...I may never get off the couch!!!!", "verified": true, "helpfulness": "0/0", "author": "Marina Buchanan \"Mriaje\""}, {"rating": 4.0, "review": "I like the Fire TV Stick, although I have not tried any of the other brands.  It works better than the Amazon App on another smart tv that I have.  I don't think I would buy another smart tv again.  I would use either a Fire TV Stick or other brand if it offered what I wanted.  My only problem with this Fire TV Stick is that I decided to purchase it after Christmas and it was not available from Amazon for about 5 weeks.  After waiting about a week, I was able to get one from Best Buy.  They must be pretty good if they were sold out after the holidays.", "verified": true, "helpfulness": "0/0", "author": "Dennis R. Martinec \"dmartinec\""}, {"rating": 5.0, "review": "Love the Fire stick.  Easy to setup and picture quality is good", "verified": true, "helpfulness": "0/0", "author": "Joyce Arenas"}, {"rating": 5.0, "review": "I bought this product because it has the Sling TV app on it. I borrowed my sister's in law Fire Stick for two weeks before purchasing. It is fluid and I enjoy that I can use the Amazon fire app if/when my kids lose the remote. I also own a AppleTV and would've bought another of those if it had the sling app, because I have a lot of songs on iTunes. I do not know a person who owns a Roku, so I can't make that comparison.", "verified": true, "helpfulness": "0/0", "author": "Gary S. Wulf"}, {"rating": 5.0, "review": "delivery was on time, set up was very easy even for someone like me who is failry clueless to electronics.", "verified": true, "helpfulness": "0/0", "author": "V Cooper"}, {"rating": 5.0, "review": "Cancelled cable and saving money!", "verified": true, "helpfulness": "0/0", "author": "Frank S."}, {"rating": 4.0, "review": "Easy to setup and get working. Hard to tell it is streaming over the internet. I am not a big TV show watcher, but was interested in the Prime Movie offers since I am a prime customer. Hard to find a movie I would actually watch. Odd selection.Update, I just realized it does not appear to have a web browser app. Ironically, if our Samsung TV had a web browser, I would not have needed the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "M. Ward"}]