[{"rating": 5.0, "review": "I am enjoying all the different choices of movies and programs.  I love the preview on the movies!  very easy to use!", "verified": true, "helpfulness": "0/0", "author": "valerie Marinovich"}, {"rating": 5.0, "review": "still learning how to use it but I wish I'd known about it sooner.", "verified": true, "helpfulness": "0/0", "author": "M. Baker"}, {"rating": 4.0, "review": "navigation is clunky.", "verified": true, "helpfulness": "0/0", "author": "Tim  Nord"}, {"rating": 5.0, "review": "Is easy to install", "verified": true, "helpfulness": "0/0", "author": "Hector"}, {"rating": 2.0, "review": "Well I have a Kindle and Amazon Prime so I thought the Fire TV stick would be a good ideal, that was a mistake. The fire stick keeps pausing while watching a movie, new apps you can set up but can't keep them, it's not user friendly. Bottom line is that I have a Roku also and I like It a 100% better and more user friendly.", "verified": true, "helpfulness": "0/0", "author": "donald jones"}, {"rating": 3.0, "review": "The up button stopped working for us right out the box.  It functions great aside from that, but I wish the button worked.Solution:If this happened to you and you can't go up, either:A) be very precise of what you want to watch / doorB) Press the back button, and traverse all the way through again!", "verified": true, "helpfulness": "0/0", "author": "DDoan"}, {"rating": 4.0, "review": "I love it !! I really like sling tv", "verified": true, "helpfulness": "0/0", "author": "Greg Comstock"}, {"rating": 5.0, "review": "Easy to Navigate, comparable to the Apple TV, except it doesn't stop for no reason like the Apple TV does.", "verified": true, "helpfulness": "0/0", "author": "Donna Sims"}, {"rating": 4.0, "review": "Unfortunately, it was back ordered and then it came one day too late for me to take to my vacation home where I had planned to use it. I did try it out at a friend's house. And did get to set up my amazon prime and several other apps, as well as upload pictures to Amazon photo storage to view on the tv. Pandora and online radio stations were easy to use.  It did seem to freeze once, and did not respond to up/down or any buttons on the app. Unplugged it and turned off tv and then back on and it worked. It looks like it will be useful  at some point, as I I needed to buy a different unit (dvd with wifi) for my vacation home since the fire stick did not arrive on time. It took 4 days after they said it would ship so I was disappointed that it arrived after I left home. (was still within the time frame given for backorder). I do not have tvs at my house with the correct connections.", "verified": true, "helpfulness": "0/0", "author": "Joyce Lander"}, {"rating": 5.0, "review": "As described.  Great tool to view movies, play games, and listen to music on your tv", "verified": true, "helpfulness": "0/0", "author": "Mary R"}]