[{"rating": 3.0, "review": "Does a good job of streaming, wish it had internet so you use other services like putlocker. One of my least favorite things is that it seems to really eat up the internet, when this thing is running and I try streaming on my ps4 It's just sitting there in a buffering limbo. I use ATT high speed so it shouldn't be this way.", "verified": true, "helpfulness": "0/0", "author": "Trevor LaFaire"}, {"rating": 3.0, "review": "It is almost too much being offered to chose from.  The search with the on screen keyboard is very troublesome - I suggest it moght be better to spring for the bucks and get the verbal search configuration.  It works great, just too much.", "verified": true, "helpfulness": "0/0", "author": "Rodney L Woodworth"}, {"rating": 5.0, "review": "Just what I expected and received in a very speedy manner.  Thanks.", "verified": true, "helpfulness": "0/0", "author": "Claude Miller"}, {"rating": 5.0, "review": "That is the best invention for TV ever 👍🏽👍🏽👍🏽👍🏽👍🏽", "verified": true, "helpfulness": "0/0", "author": "S. Straughter \"Music Specialist\""}, {"rating": 5.0, "review": "Has all I need form my entertainment", "verified": true, "helpfulness": "0/0", "author": "Douglas"}, {"rating": 5.0, "review": "Great Item", "verified": true, "helpfulness": "0/0", "author": "William Barahona"}, {"rating": 2.0, "review": "unfortunately, the device does not work as proposed.  .  It buffers, or stops the feed, for 30- 40 seconds every 5 minutes.  There have been many instances of the device simply telling us that Amazon cannot be accessed.  Have no idea why,  we have Wi Fi that we can access the internet from other devices in that room... and it will not let us search, or go to home, or any other option.  WE turn it off and wait until later.", "verified": true, "helpfulness": "1/1", "author": "leslie a  heath"}, {"rating": 5.0, "review": "Buen producto", "verified": true, "helpfulness": "0/0", "author": "william mendez"}, {"rating": 5.0, "review": "Loving it", "verified": true, "helpfulness": "0/0", "author": "Eric Carlson"}, {"rating": 2.0, "review": "Had a lot of problems getting it set up, multiple calls to customer service.  Finally have it set up but not thrilled with it.  It not as easy as it says it is!!!Takes multiple clicks to get it to start a show.  I'm giving it another few days of test run but will most likely return it and go with a Roku or Blu Ray.", "verified": true, "helpfulness": "0/1", "author": "Debra Cooper"}]