[{"rating": 5.0, "review": "This thing is Slick! I will be purchasing another as well. Now I can dump the movies channels from my satellite and save 50 dollars a month. Dont be in doubt, Check it out!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great fast device, easy to customize", "verified": true, "helpfulness": "0/0", "author": "Who am I to know?"}, {"rating": 1.0, "review": "This fire stick will not connect. I bought this to stream Netflix and Hulu. My smart tvs and Apple TV work just fine but when you turn on the fire TV, it will load and then say that there is something wrong with the Internet. Apple TV and smart tvs will still be streaming just fine. The problem lies in the fire TV stick, not my internet. But something reliable, not this.", "verified": true, "helpfulness": "0/1", "author": "Adam Kanoff"}, {"rating": 5.0, "review": "I've only had the Amazon Fire stick for a week and it works great! I used a Roku before and the Fire Stick is just as easy to use and install but was half the cost!  So far, I am very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Shanna Taggart"}, {"rating": 5.0, "review": "Bought it to stream Sling TV, but love it with Prime. Didn't know it had to plug into the wall...it does not get power from the HDMI port. You can plug it in to the TV USB port, but it is not recommended. (it works fine though, shhhh).", "verified": true, "helpfulness": "0/0", "author": "auramine"}, {"rating": 4.0, "review": "Easy to undersatnd.  Friendly to use", "verified": true, "helpfulness": "0/0", "author": "Sally Gutierrez"}, {"rating": 4.0, "review": "I bought the fire TV stick as part of my developing plan to cut the cable.  But this review is for the fire TV stick. So I will focus on that. The fire TV steak is another aspect of the Amazon prime universe. it brings the Amazon prime service to your TV.  Of course that is primarily video in the case of TV though the Amazon prime music teacher can also be Accessed.  There are also games and assorted other apps in the App Store.  The device also interfaces with other video streaming services like  YouTube, Hulu, HBO go, and Sling TV. Using the fire TV stick,  for cutting the cable is a three-part game.  You need a digital TV antenna to pick up your local station for local news and stuff like that.  You need the fire TV stick to access other content off the web. And you need subscriptions to assorted services for the fire TV stick.  And you need subscriptions to assorted services for the fire TV sick.  I would suggest Amazon prime, because it has such a large amount of free content.  This gives you your on-demand and premium type content.  To fill in the gap between your local content and the premium content, I would suggest Sling TV. This service provides real-time streaming of other cable channels like the history channel, the food channel, and home and Garden channel, etc. As well as children's content like Disney and Cartoon Network. Back to the fire TV steak, the device is easy to use.  It plugs into the back of your television and her into a power outlet. And I when you power everything up, it leads you through the set up.  To be sure, you must have access to high-speed Internet over a Wi-Fi connection in order for this device to work. The device is very inexpensive, however, the initial purchase price is the smallest part of the total cost of ownership. TCO  include the cost of accessing high-speed Internet plus the monthly or annual charges for the streaming services plus any pay-to-view content you buy.I would definitely recommend the fire TV stick. Even if I don't eventually cut the cable,  I would definitely recommend the fire TV stick. Even if I don't eventually cut the cable, I will  leave it installed on my TV. It is a very convenient way to watch my Amazon prime content on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Grandpa Scuba \"Water Art Music Life\""}, {"rating": 5.0, "review": "We love our fire stick! It works perfect for viewing Amazon Prime on the television.", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 4.0, "review": "One of my favorite purchases from AMazon!", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 5.0, "review": "Awesome, it's everything Amazon said it would be", "verified": true, "helpfulness": "0/0", "author": "Victory77"}]