[{"rating": 5.0, "review": "I bought this for my husband and he loves it! Our tv doesn't have the \"smart\" app options, so by plugging this in we have access to them!", "verified": true, "helpfulness": "0/0", "author": "S. Slater"}, {"rating": 3.0, "review": "I'm satisfied with this product .", "verified": true, "helpfulness": "0/0", "author": "zoosk"}, {"rating": 5.0, "review": "Great things come in small packages. This thing works amazing with a very low power footprint. Lots of things you can do with it, much more than my roku and Apple TV, though I do still like my Apple TV.  I'll get theFire TV box soon to replace my current roku. kodi works well on this little thing", "verified": true, "helpfulness": "0/0", "author": "Carlton J. Hebert \"CABEAR\""}, {"rating": 2.0, "review": "This is better than nothing, but I am having trouble because it cuts out every few minutes. I was looking for a way to watch Amazon Prime on our extra TV, but this isn't the solution. I am disappointed it doesn't work better.", "verified": true, "helpfulness": "0/0", "author": "Theresa Ramos"}, {"rating": 4.0, "review": "I ordered it from eBay no problems enjoying my firestick", "verified": true, "helpfulness": "0/0", "author": "TERESA CANNADYTEAL"}, {"rating": 4.0, "review": "I like it because i can see movie from many channels like youtuce, amazon prime, netfilx. I used Chromecast before and I like the Chromecast app better. I can find the videos on youtube by typing name directly through the phone. For Fire stick, i have to use arrow. If they fix this feature, it will like it more.", "verified": true, "helpfulness": "0/0", "author": "Patti"}, {"rating": 5.0, "review": "Great for the apps and streaming, no complaints, but if you want a device just to mirror phone or tablet I recommend Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jay W"}, {"rating": 1.0, "review": "To be honest, I hate the fire stick. Instead of spending $40 on the fire stick; I should have just got cable. Because to use any of the things that are advertised, you have to have subscriptions: HBO Go, Encore, History Channel, ect. The thing I learned about the Amazon Fire Stick is that, its a really cool way to access everything you have to have a subscription for. The Fire Stick is poorly represted as to what it actually is/does. You have to keep it plugged in. I basically spent $40 to do everything I can do on my game system. So, to me the Fire Stick was a waste of money.", "verified": true, "helpfulness": "0/1", "author": "Steffanie Taylor"}, {"rating": 2.0, "review": "Ire", "verified": true, "helpfulness": "0/0", "author": "Reviewer123"}, {"rating": 5.0, "review": "Awesome! I thought not having a keyboard would be a pain! Doesn't bother me at all! Love it!", "verified": true, "helpfulness": "0/0", "author": "Ashlee Mattox"}]