[{"rating": 4.0, "review": "Small, powerful, inexpensive and does exactly what I want.", "verified": true, "helpfulness": "0/0", "author": "Brendan"}, {"rating": 5.0, "review": "MY wife is loving this and using it with the downstairs tv as well as other tv's upstairs.", "verified": true, "helpfulness": "0/0", "author": "David and Louise"}, {"rating": 1.0, "review": "Keeps disconnecting from wifi, even though the router is standing no more than five feet away in the same room.Also, the Fire TV Stick is always shown as just the stick and the remote, but what they don't show you in the pictures is the rather large power adapter that it cannot work without. I thought maybe it would get enough power from the HDMI connection, but apparently it does not. The fact that the power adapter plugs into the side of the Fire TV Stick also limits the amount of space I have for other HDMI cables in the back of my TV.Even though I got it for $20, it sits without use at all. Best to just get a Roku.", "verified": true, "helpfulness": "1/2", "author": "Diab"}, {"rating": 5.0, "review": "No problems at all so far.", "verified": true, "helpfulness": "0/0", "author": "Tom Good"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "jtgordo"}, {"rating": 5.0, "review": "Had trouble getting my second Fire TV Stick to work.  (My son-in-law installed the first.)  Knew it was something simple--and it was when there was a space in the WiFi address, I put a space.  No spaces was my problem!", "verified": true, "helpfulness": "0/0", "author": "Judy Miller"}, {"rating": 5.0, "review": "Love it!  It's so easy to use and there are so many shows to watch.", "verified": true, "helpfulness": "0/0", "author": "Jo"}, {"rating": 5.0, "review": "Plugged it in, connected it to the network and was watching Netflix in no time. I have had no problems with it at all. My granddaughters love Netflix on a bigger TV rather than a tablet all the time.", "verified": true, "helpfulness": "0/0", "author": "Linda McBroom"}, {"rating": 5.0, "review": "So good that I am considering buying another one for our bedroom to replace a Roku.  I did have some initial trouble getting the iPad and Android apps to find and recognize the device.  Perfect companion to Amazon Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Tom B."}, {"rating": 1.0, "review": "This device donot have browser that is the major drawback in it. What I realize this device is only made for Amazon store", "verified": true, "helpfulness": "0/2", "author": "prashant"}]