[{"rating": 5.0, "review": "The more I've used my Fire TV stick, which I originally purchased last year during its $20 intro price for Prime customers, the more I've come to like it. I use it for Amazon programming (mainly Prime and free, but occasionally purchased on-demand series like The Walking Dead and Orphan Black), as well as Netflix and Plex. The picture and sound are quite good and the user interface pretty easy to maneuver within. Not long ago, I upgraded to a new Kindle Fire and have been discovering the benefits of the integration between the two devices.More recently, I was on a vacation and although the hotel where I stayed was pretty decent, its TV left much to be desired. It was an older non-smart model paired with a Comcast cable box that displayed a totally mismatched resolution. In the past, I would've just plugged in one of my media sticks and watched some videos from that -- but this TV wouldn't support that either. I'd just tossed the Fire TV stick into my suitcase on impulse at the last second, but was happy to see it worked just fine with this not-new-enough-or-smart-enough television. Even more impressive was the fact it was able to connect to the hotel wifi and stream through it. I think there were just two times when the message popped up about there not being quite enough bandwidth for good streaming, but these were both at bad times of the evening; before long again, all was fine and I was able to entertain myself with MY viewing choices, not just what was available on squish-distorted viewing via the cable box. All I can say is if you do want to take it on the road with you, don't forget the power adapter and remote control.Personally, my feeling is the best value in having the Fire TV stick is when you also have Amazon Prime, because it opens up the whole Prime library for viewing or listening.", "verified": true, "helpfulness": "0/0", "author": "BeccaM \"Technowitch\""}, {"rating": 2.0, "review": "I bought early on for $19 as a prime member. I love Amazon but honestly this thing is a dud. We stream all of our TV. We watch on iPads, kindle Fire HD and a Roku without any issues. Anytime we watch a show on the Fire stick the show freezes repeatedly. So much so it's basically useless. I would not recommend.", "verified": true, "helpfulness": "1/1", "author": "PFD"}, {"rating": 5.0, "review": "The Fire Stick is awesome. The streaming is so fast. I loved mine so much I bought one for my mom for Mother's Day and she loves it.", "verified": true, "helpfulness": "0/0", "author": "lilo \"Lisa\""}, {"rating": 5.0, "review": "Plug in and boom! Amazon apps right in front of you with no effort. Stick comes with standard remote (voice remote available for extra) and a power plug to charge stick. You can set this stick to mirror with certain Kindle tablet devices. I bought this the second it was announced and am very happy with it. Its better then the Fire box as it is perfect for Traveling. One downside I've had is connecting to hotel Wi-Fi. Other then the Wi-Fi failures, I recommend this stick. No set-up needed as long as you have an Amazon account.", "verified": true, "helpfulness": "0/0", "author": "Michael Kontogiannis"}, {"rating": 5.0, "review": "Great product! Wish even our smart tv's had buildt in fire sticks! simple and easy to use, installation was a breeze!", "verified": true, "helpfulness": "0/0", "author": "Cherryl.V"}, {"rating": 5.0, "review": "Works as described,  completely satisfied. I have used mine to cut the cord to cable TV.", "verified": true, "helpfulness": "0/0", "author": "Billy Perkins"}, {"rating": 5.0, "review": "Great device for movies, apps and even mirroring your smartphone. Definitely consider this device for streaming.", "verified": true, "helpfulness": "0/0", "author": "Steven Singh"}, {"rating": 5.0, "review": "Very easy to use.  Give me great immediate access to my favorite movies", "verified": true, "helpfulness": "0/0", "author": "Jim Prince"}, {"rating": 5.0, "review": "Very please with it. Have lost lots of sleep since the purchase watching movies.", "verified": true, "helpfulness": "0/0", "author": "bigwhit9357"}, {"rating": 3.0, "review": "No access to HBO Go or HBO Now or HBO Whatever is a huge disappointment. Access to HBO would change my rating to 4 stars.The YouTube app is not as fluid as the Web application; if there is a Search function, it is not easy to find. My workaround involves using another computer to make YouTube content available via one of my playlists.The photo of the Fire TV Stick does not include the adapter, which is misleading; it makes the Stick look like it is powered by the TV. This is not the case.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]