[{"rating": 5.0, "review": "totally love it! beats getting up and down to switch movies!", "verified": true, "helpfulness": "0/0", "author": "steve Maxfield"}, {"rating": 1.0, "review": "Kept shouting off", "verified": true, "helpfulness": "0/0", "author": "Beverly"}, {"rating": 5.0, "review": "Great Value for the Price.My Son love's it", "verified": true, "helpfulness": "0/0", "author": "Victoria Fess"}, {"rating": 5.0, "review": "Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "Works very well.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Larry E. Shelton, Jr."}, {"rating": 4.0, "review": "Easy to set up and works better than Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Steve Aspacher"}, {"rating": 5.0, "review": "Best product ever, easy to install, easy to use, easy to enjoy", "verified": true, "helpfulness": "0/0", "author": "ab7337"}, {"rating": 4.0, "review": "The fire stick is pretty easy to install and very easy to use with my LCD T.V  I like the fact that you can add addtl apps too.", "verified": true, "helpfulness": "0/0", "author": "ohYouFancy"}, {"rating": 5.0, "review": "Nice product.  1080p quality", "verified": true, "helpfulness": "0/0", "author": "jeremya972"}, {"rating": 5.0, "review": "I think my wife is becoming jealous, since every time we watch a show through the Fire Stick I say how much I love it. But in all sincerity, it is a great product for our needs. We love watching the NWSL (National Women's Soccer League) games and it is super easy to do through their YouTube Channel. Also, we have a Prime membership, so any TV shows, Movies, Music that are included in Prime are free to watch. Also, the quality of the images & content is excellent; shows and movies for purchase are usually offered in crisp HD format. Additionally, I have a Hulu and Sling account, so after activating both products to sync with the Fire Stick, streaming any TV or movies from those sites is easy. It is almost a complete package enough to get rid of cable. The only missing aspect is Fox Sports! Purchased through Amazon Prime when Sling and Amazon were offering it for free if three months of Sling was purchased upfront.", "verified": true, "helpfulness": "0/0", "author": "Lindsay Ryan"}]