[{"rating": 1.0, "review": "Have has to replace this thing already only had it a month", "verified": true, "helpfulness": "0/0", "author": "Elexis Thompson"}, {"rating": 5.0, "review": "I love my AMAZON Fire Stick, and I recommend it to all of my friends!  It's simple to set up and use, with a great variety of movies and shows.  Much simpler than the THREE+ remotes it takes just to watch a DVD at our house!", "verified": true, "helpfulness": "0/1", "author": "Teri N \"SeattleFoodie\""}, {"rating": 5.0, "review": "I love the Fire Stick even though I have cable including HBO, which I'm planning to cancel. Someone who can't afford another monthly bill would greatly benefit from this. ...... especially if they have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "K. Rojas"}, {"rating": 5.0, "review": "Easy to set up and use.  We are Amazon Student members so we have access to the Amazon Prime library making the Fire TV Stick the choice for us.", "verified": true, "helpfulness": "0/0", "author": "Keith Parrish"}, {"rating": 4.0, "review": "I purchased the Fire TV stick after having a good experience with the Fire TV, as I had no issues with it and it works as advertised. I'm going to break this review down into several sections: setup, user interface, apps, my experience so far and a comparison against other products on the market.Historically I've never had any issues with Amazon products, whether it was a Kindle, Fire TV, or Amazon Basics product. Setup has always been idiot proof and just worked. However, this is the first product I've ever purchased that took most likely an hour to setup. I unplugged the Chromecast I was replacing and plugged in the Fire TV stick and hooked it to the USB port on the TV. Right away I got an error message saying the USB port on the TV was not powerful enough to power the Fire TV stick. Being that it worked for the Chromecast I was a bit surprised, but I know it has better hardware so it is understandable. I would say it is a bit of false advertising that it can be supported on a USB port, so if that is a requirement for you, might want to look at a Chromecast or something that takes lower power.After getting it powered up, I joined it to the network, or at least I thought I did. The Fire TV stick kept making me put in my information over and over again. After pulling the power to it and reconnecting it finally took my info and let me put in my Amazon information, or at least I thought it did, because once again it lost the WiFi connection. Over and over again I went through this cycle of it losing the connection, until it finally let me sign into my Amazon account and loaded the main menu, however none of menus were loading and I kept getting network errors. After some research I found a lot of people were having issues with this and some recommended using the HDMI extender to improve the WiFi connection. Once I added the extender, I stopped getting the error messages and the connection seemed more stable. There were many times I almost gave up during setup, as never in my life have a hooked up a streaming device and had so many issues.In my review of the Fire TV, one of my biggest gripes was the user interface. I've never been much of a fan of Amazon's user interfaces on their tablets or Kindle, so the same goes for their Fire TV products. Obviously the interface is very Amazon driven with short cuts to Prime content, music, photos and so on. Users also don't have the ability to organize apps or the way screens are laid out, so that is a problem. If you are purchasing this for the basics, it gets the job done, but you have to get past a lot of Amazon fluff to get there.As far as applications go and the store available, I would highly recommend finding the apps you want from using the store online and sending them to your Fire TV stick, just like you would a Kindle book. You will find that Amazon offers more apps than the Chromecast and Apple TV, but less than Roku. However, you will find they cover all the big ones, like Netflix, ESPN, Amazon Video, and so on. There are only two apps that are missing at this point in my opinion that are deal breakers. First and most important, is HBO GO, which is available for the Fire TV, but not the stick. HBO and Amazon need to hurry up on this before Game of Thrones returns. The other app that is missing, but I'm going to assume we will never see, is Google Play Movies. It would be great to see this option, but I'm going to guess since we don't have Amazon on the Chromecast that we won't see Google on Fire TV any time soon.So far my experience has not been all positive, from having a hard time setting it up, but it has not been all bad. The interface and speed of navigating the Fire TV stick has been pretty good. I was not expecting it to be nearly as fast as the Fire TV, but it does a good job. There is not too much lag when loading content or jumping around the menus, but if you have a Fire TV you will notice a difference.Netflix runs well as expected and Amazon's ASAP technology works great when trying to predict what you might start watching next, in terms of Amazon video. I've also used the Slingbox app pretty heavily, which is something I want to highlight. I've used the Slingbox app on the Chromecast, Roku, and Apple TV. I would have to say that the Fire TV and the Fire TV stick have the best user experience. With all the other boxes and sticks you have to start the stream from your phone and control it through your phone, like fast forwarding and so on. With the Amazon products you can start the stream from the app and control all basic functions through the remote, never needing your phone. Most of the reviews for the app are pretty terrible, but mostly because the app does not support older models of Slingbox. It is without a doubt one of the best streamers for Chromecast.I don't want to go crazy here, comparing the Fire TV stick to everything on the market, but I want to discuss a bit. I've been a long time fan of Apple TV, Roku, and Chromecast. It took a lot to get me to start switching to Amazon products, but after they got the app support, it came down to specs for me. The Fire TV is pretty much the fastest box you can get, but I needed something with a remote that was just a stick to hide behind a TV. Overall I feel like the apps all these products offer are pretty much the same any more, so it comes down to UI and form factor. In my opinion this is the best streaming stick that you can get spec wise, but maybe not the friendliest.Pros:- Cost- Form factor hides easily behind a TV- Comes with a remote- Speed is pretty snappy- Has just about every app you could want or need- Slingbox app is amazingCons:- Wireless setup had some issues (use the extender it comes with and keep trying)- No HBO support as of right now- USB port on my less than a year old TV does not power the unit- Ships with the non-voice remoteOverall, I think it is a great product, with a few issues. Setup should be easier and hopefully it stays connected to my WiFi, I'm knocking a star off for that. Second, HBO support needs to come. Otherwise if you are looking for a cheap streamer you can't go wrong.Update:- HBO is now available so I raised a star. Thank you Amazon and HBO!!!!", "verified": true, "helpfulness": "0/0", "author": "Aaron Mills \"VWHSRocket\""}, {"rating": 1.0, "review": "Does not pickup the wifi signal very well. My tablet (iPad) and the TV can be right next to each other. The tablet will pickup the signal and stream videos, while the Fire TV Stick, buffers and buffers.", "verified": true, "helpfulness": "0/0", "author": "Paul Ames"}, {"rating": 5.0, "review": "Incredible product.  Absolutely love it and the price can't be beat.", "verified": true, "helpfulness": "0/1", "author": "John David Monson"}, {"rating": 5.0, "review": "Quick and easy! I just wish that there were more movies available for free with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "C. Renee Stokley"}, {"rating": 5.0, "review": "AWESOME!", "verified": true, "helpfulness": "0/1", "author": "Joshua Steele"}, {"rating": 5.0, "review": "Awesome. Simply awesome. Easy to set up, and easy to use. Perfect for me. There are several excellent streaming systems out there, but this one is the best for me. I'm not a huge TV watcher or game player, but I do like the option to watch a show or a movie, and the choice (rather than paying for everything, most of which I don't use, a la the major cable companies) and to occasionally download and play a game on the TV, rather than my phone or Kindle. (not that that isn't fun, too.) Thank you, amazon. I have cut the cord. You have saved me 100 bucks a month...and more!", "verified": true, "helpfulness": "0/0", "author": "Kevin M. King"}]