[{"rating": 3.0, "review": "Not only did I get the Fire TV Stick, but I was charged for Prime even though when Stick was purchased, it said I got a month of Prime to try it out.  I'm very disappointed the number of movies that have to be paid for, and I'm not talking about recent movies.  I wanted to watch a Tom Selleck movie that was made in 2000, yet I would have had to pay for it.  I would suggest those interested in the item to call customer service and get a full understanding of just what you get.", "verified": true, "helpfulness": "0/1", "author": "BRH"}, {"rating": 5.0, "review": "I had order this on pre-sale.The best 20 dollars that i have ever spend.Works well!!!", "verified": true, "helpfulness": "0/1", "author": "Luis Colon"}, {"rating": 5.0, "review": "This thing is amazing. I'm seriously considering canceling my cable and just using this amazing entertainment geyser.", "verified": true, "helpfulness": "0/1", "author": "billsamazonianbear"}, {"rating": 5.0, "review": "Awesome! I am buying another one for my other tv.", "verified": true, "helpfulness": "0/1", "author": "Thomas Gibbons"}, {"rating": 2.0, "review": "I feel like more in depth instructions should be included.", "verified": true, "helpfulness": "0/1", "author": "Sally Holland"}, {"rating": 5.0, "review": "This tv stick is incredable something so small could do so much,I suggest everyone should have one rel simply and keeps you busy with gamesand lots of fun stuff.", "verified": true, "helpfulness": "0/1", "author": "rose"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Jim McClughen"}, {"rating": 3.0, "review": "Peri like that everything I have ordered online for music and video is available through the stick.  Setup was very easy.  Don't care for pause in the middle of music or video waiting for download to catch up.", "verified": true, "helpfulness": "0/1", "author": "nobilar"}, {"rating": 5.0, "review": "Works fantastic!  Was able to set it up in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "D. Albert \"glueexpert\""}, {"rating": 3.0, "review": "Still trying to figure them out.", "verified": true, "helpfulness": "0/0", "author": "Krista Rockwell"}]