[{"rating": 3.0, "review": "Trying to put batteries in the remote is very challenging. I shouldn't have to go to the Internet to find out how tough it was to remove the cover to install batteries.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Great choice :)", "verified": true, "helpfulness": "0/1", "author": "Ariel"}, {"rating": 3.0, "review": "I have to say I am enjoying my Fire TV Stick.  For the value, it definitely delivers with a smooth interface, making navigation pretty intuitive.  My only gripe is that I bought this not only to enjoy Netflix, Amazon Prime & Spotify, but for Vimeo.  Which makes me wonder who's the culprit for it's consistent buffering while watching short videos.  Everything else streams just fine, so I'm not sure what to make of it besides hope there's an update of some sort that will fix it.  Otherwise this works great hooked up to my AV Receiver and I used all the accessories that were provided (HDMI Extender, USB Cable & USB wall plug).  I use this on a 1080p dumb tv and put the settings on the fire stick to a 720p output in hopes that the streaming demand would help speed up Vimeo, but it still looks great and I've left it that way.  Hope this review helps some people out there on choosing whether to buy or not buy the Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "Spunos"}, {"rating": 4.0, "review": "Love it! Has exceeded my expectations! Would buy it again!", "verified": true, "helpfulness": "0/1", "author": "Jon Michael Williams"}, {"rating": 5.0, "review": "Awesome so far loving it", "verified": true, "helpfulness": "0/1", "author": "hlthomp"}, {"rating": 5.0, "review": "Awesome aND affordable !", "verified": true, "helpfulness": "0/0", "author": "Lexy Bledsoe"}, {"rating": 1.0, "review": "Beware, not possible to set up second screen with iPhone", "verified": true, "helpfulness": "0/0", "author": "Maria A Lim"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Beverly Culbertson"}, {"rating": 1.0, "review": "Terrible.  Won't connect to my Netflix. If it does it drops. I don't have this problem with my apple tv. Don't purchase this product!!! Spend the extra 50 dollars and get something that works.", "verified": true, "helpfulness": "0/0", "author": "Daniel Carbonel"}, {"rating": 4.0, "review": "Great product. Works really well.", "verified": true, "helpfulness": "0/0", "author": "William Bell"}]