[{"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Kelvin F."}, {"rating": 5.0, "review": "I have both the fire tv and now the stick. If you are not into gaming the stick is all you need! Don't waste your money on a smart tv. Get yourself a stick.", "verified": true, "helpfulness": "0/0", "author": "Andres Carrera"}, {"rating": 5.0, "review": "The best tool I have purchased to view t.v. with.", "verified": true, "helpfulness": "0/0", "author": "Creative Beauty"}, {"rating": 1.0, "review": "It's a waste of money", "verified": true, "helpfulness": "1/3", "author": "alan"}, {"rating": 3.0, "review": "I own the Fire TV Stick plus I have two google chromecast, apple tv, roku and Kodi (XBMC) so I know what I'm talking about when I said this device is three stars, If I have to put them on line of which one is better for sticks ChromeCast is better, is faster and doesn't reboot itself, for box RasperryPi is the cheeper way to watch TV/Movies.Fire TV Stick have potencial for gaming and TV which in theory is superior to ChromeCast but the problem is that is slow, I don't have patience to wait for it, also the WIFI speed is only 802.11b witch is not the best one for streaming my tv is next to me router and I was watching a movie in 480P because of the internet speed in the device I have 75MPS so its not my IPS connection.", "verified": true, "helpfulness": "1/2", "author": "Luis Tejada"}, {"rating": 3.0, "review": "Not bad, but definitely way below expectations.Amazon claims Fire stick is better than Roku stick. This is definitely a stretch. I think is the other way around. Let see the pros and cons:Pros:- Fire stick is cheaper- You don’t have to register it. It comes pre-registered to your Amazon account. You have also the option of changing the account as and when you wish to do so.Cons:- Fire user interface sucks. It is not necessarily counterintuitive but is not comfortable either. Roku has a better and customizable user interface.- Amazon claims higher speed for Fire and no buffering. This is false claim. So far it has taken Fire more time than Roku to start the same show on the same network.- Amazon fire stick lost network connection at least 4 times in a day. This never happened to Roku stick on the same room, on the same TV.- Any app has to be downloaded and manually installed on Fire. They are preinstalled on Roku stick. You just have to activate it/added to the favorites.- CC is either too small (1” tall on a 55” TV ) or huge on some channels. There is no way to adjust it. Roku offers the user the option of easily customizing the CC size.I had seriously considered yesterday returning the stick to Amazon. It does not worth the hassle. Most likely the stick will end up somewhere in a box with other obsolete electronics. I will stop by Best Buy today to buy a second Roku stick.", "verified": true, "helpfulness": "1/2", "author": "L.M.H."}, {"rating": 5.0, "review": "Easy setup, smooth video. Love the simplicity of the remote.", "verified": true, "helpfulness": "0/1", "author": "Kevin S. Knight"}, {"rating": 5.0, "review": "I have An Amazon fire tv and love it. I use my firestick on a mini projector. It's Amazon fire tv's,\"lil bro.\" it works great.", "verified": true, "helpfulness": "0/1", "author": "felix carrillo jr"}, {"rating": 5.0, "review": "Simple to use.  Plugged it in, signed in on the screen and it was up and running, no problems.", "verified": true, "helpfulness": "0/0", "author": "C Michael"}, {"rating": 5.0, "review": "Very nice so far so good ...simplifies getting to netflx,hulu,and offers abilities to get good free channels you can't get without cable. I use an antenna and refuse to pay these outrageous cable and satellite charges.", "verified": true, "helpfulness": "1/1", "author": "Lynda Nolan"}]