[{"rating": 5.0, "review": "Super slick, why bother with a box?  Love Amazon, and the new Fire Stick just adds to the family of quality products.  Ordered this back in Oct. at promo rate - for use on 42\" Panasomic Viera TV..  What could be simpler for a long time Amazon Prime member, open box, plug into HDMI port, the Fire stick automatically set itself up to my Prime account in Jess than 2 minutes, then selected Netflix, logged into account, and several other App based Accounts, and literally, everything was ready to go.The time to connect to Amazon Prime Video, Netflix, Etc is lightening fast and actually outpaces our other Smart TVs preloaded with same apps (Samsung, Vizio, & Panasonic).I have read through the various reviews and really can't understand why so many people have problems with an awesome plug and play.  Yes you must log onto specific accounts, but, that is true regardless whatever product you are using to access services.Pros:-  easy set up-  fast interface- small footprint- easy to use remote-  download Voice activated remote from App Store (android).  Super cool, and gives you another remote.Cons-  should have ordered 2 nd at Promo price for beach place-Unknowns / more to come-  games ?  Not a gamer, need to wait for daughter to take a break from new PS4-  Other Apps. Many more to explore", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Used to used my PS4 to watch amazon prime instant, this is definitely an improvement from that. I like using the remote as compare to a PS4 control, shows my home photos on my tv. great to use with family", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "1 star because miracast doesn't work with windows 8!!!! fix this and I'll up my rating.", "verified": true, "helpfulness": "2/4", "author": "Joe Maslanka"}, {"rating": 5.0, "review": "Watching Amazon video right now with it.", "verified": true, "helpfulness": "0/1", "author": "LB"}, {"rating": 5.0, "review": "Awesome Product. Excellent Wi-Fi! Excellent Picture. Excellent Value $19. Would like to see Amazon.com Home Page and easier way to find Free Media, maybe a separate category!", "verified": true, "helpfulness": "0/0", "author": "JAYSDE"}, {"rating": 4.0, "review": "Love my fire stick", "verified": true, "helpfulness": "0/0", "author": "Scott Durnford"}, {"rating": 1.0, "review": "Outstanding product when it works.  Constantly has problems staying connected to WiFi.  Can only watch it for a couple of hours at a time, and then you have to cycle power yo get it to reconnect.", "verified": true, "helpfulness": "1/2", "author": "david w. cooper"}, {"rating": 5.0, "review": "This thing is considerably better than chromecast.  I recommend getting a prime account though.", "verified": true, "helpfulness": "0/0", "author": "L. Littlejohn"}, {"rating": 5.0, "review": "I was lucky to grab this item at about 1/2 price when Amazon advertised it a few months ago. Well worth the small price. Installed easily, didn't interfere with my Roku device, and works well.  Easy to navigate and offers lots of content.", "verified": true, "helpfulness": "0/0", "author": "Mark in New York"}, {"rating": 5.0, "review": "Like it in comparison to the roku. Definitely a better remote. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}]