[{"rating": 1.0, "review": "Really really sad this is being advertised so heavily for the holiday gifting season, but it is not actually available until January 26, 2015.", "verified": false, "helpfulness": "2/7", "author": "KBA312"}, {"rating": 5.0, "review": "this is geat, it gives you huge amount of selectons.", "verified": true, "helpfulness": "0/0", "author": "Owen Rex Mandry"}, {"rating": 5.0, "review": "Looks to be as good as the big box that coasts $99. The only differences so far is that this one doest not have the voice search on the remote and seems to have a weaker reception to WIFI (needs to be closer to the router than the normal FIRE TV, in other words), but those two things not withstanding, it's still a very good product. :)", "verified": true, "helpfulness": "0/0", "author": "audio_stan"}, {"rating": 4.0, "review": "I love that I can use this to stream media from my Amazon Prime account, but I hate that I can't stream or \"mirror\" things from my phone to the TV. I have a Samsung Galaxy S5 and it's not compatible for mirroring.", "verified": true, "helpfulness": "1/1", "author": "ARiniker"}, {"rating": 4.0, "review": "This is great for anyone with amazon prime. This is hands down the easiest interface to navigate the amazon on demand content. Everything else works well, also, but the main page navigation is not always easy. It can be a bit overwhelming at times and make the screen feel crowded.If you're a PLEX user, plan to plop down a solid $5 for the app. I have never had to pay for plex on any of my other devices. The cost of plex and the clunky home screen bring the rating down to a 4. I would have loved to give it a 5 but I just can't.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, would recommend to anybody.", "verified": true, "helpfulness": "0/0", "author": "Robert O. Oberkrom"}, {"rating": 5.0, "review": "This thing is awesome.  If you are a prime member you have to get one of these.  It makes streaming better.  The prime services are great and even netflix works better on the stick than on my smart TV.  Love being able to use it for my prime music as well.  A must buy.", "verified": true, "helpfulness": "0/0", "author": "mpc345"}, {"rating": 5.0, "review": "I have to be honest, I was a little skeptical about this thing but I was able to get if for less than $20 with Prime so I thought I couldn't lose and I was in the market for another Roku.It was a little finicky when I first started it up.  It tried to upgrade the software several times before completing successfully.  I suspect since I was part of the first wave to receive this, the Amazon servers were overwhelmed with requests.  Once I made it through the upgrade process, set up was a breeze.  It instantly recognized my networks and I was able to quickly get online.  Set up for Amazon Prime was automatic so nothing more to do there.  Set up for Netflix was the usual setup and was quick to complete.The device definitely is Amazon Prime-centric.  All you Amazon content is visible on the Home screen but it also works very well with Netflix.  The picture and sound quality has also been very good.  Fire TV is my go to device for watching any Amazon content, movie and music are both covered.Navigation is easy but I have found the companion app from the Google Play store to be disappointing.  The navigation from the phone is from a touch pad interface and it is very touchy, almost unusable.  Navigating with the included remote, however, is very easy.Not sure if this will be a true Roku killer (since it is missing HBO Go, which starting in April will be a stand alone option, not requiring an HBO subscription) but it comes pretty close.  I would definitely recommend over ChromeCast since it has its own remote control and does not require an Android device to operate.", "verified": true, "helpfulness": "0/0", "author": "Flybrew"}, {"rating": 4.0, "review": "Content availability and usability is great. Very cool that all my cloud photos are automatically accessible and was able to easily download the smugmug app as well. Way better than my earlier blueray with streaming player. Minor glitch is rarely it will wait for content which the older player didn't do. On the while though , $20 very well spent!", "verified": true, "helpfulness": "0/0", "author": "Anoop Balakrishnan"}, {"rating": 5.0, "review": "Works as advertised.  No issues.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "NoName"}]