[{"rating": 2.0, "review": "I was very excited to get my Amazon Fire TV Stick; unfortunately, after 3 hours of trying to get it to work, including 45 minutes on the phone with Amazon, nobody could figure out why it would lose connection from the internet every 30 seconds. When I ran a test on the device, it said it was connected with good strength. I unplugged and restarted the Fire TV stick multiple times. I restarted my internet multiple times. Both my cell phone and laptop were connecting to the internet alright. At the end of the night I made the decision to just return the product altogether. It's an awesome concept, but unfortunately I think that I just received one that was bad.", "verified": true, "helpfulness": "1/1", "author": "Stephanie Matsey"}, {"rating": 5.0, "review": "Got ATT-Uverse. It works great with Amazon Prime movies.Not so great with MLB. So I'm stuck on the MacBook until I get home to MO from CA.I'm missing my Cardinals in their FANTASTIC season on the big screen.Go Cards, GO!!!", "verified": true, "helpfulness": "1/1", "author": "Jarhead"}, {"rating": 5.0, "review": "Easy!", "verified": true, "helpfulness": "0/0", "author": "Barbara Tuset \"Responsible\""}, {"rating": 5.0, "review": "For the price, this is the best product on the market. Will not disappoint.", "verified": true, "helpfulness": "0/0", "author": "fcauthen"}, {"rating": 5.0, "review": "Great product, great value !!! Love it", "verified": true, "helpfulness": "0/0", "author": "Jorge Luis Guerra"}, {"rating": 5.0, "review": "Excellent it's was one of the best purchasesI made.  I do recommend!!!", "verified": true, "helpfulness": "0/0", "author": "Gene"}, {"rating": 5.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "judy eggleston"}, {"rating": 5.0, "review": "Quickly and easily turns a dumb tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Clay Ehlers"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Vanessa Sales"}, {"rating": 5.0, "review": "perfect for the bedroom and for taking on the road! love it!", "verified": true, "helpfulness": "0/0", "author": "MrMaC757"}]