[{"rating": 3.0, "review": "I mean, it's convenient. But it loses signal easily.", "verified": true, "helpfulness": "0/0", "author": "Steigen"}, {"rating": 5.0, "review": "Awesome product.  Very fast and easy to use.  Installed the Fire Stick app on the kindle and can now use as a second remote with voice search.", "verified": true, "helpfulness": "0/0", "author": "Scott in GB"}, {"rating": 5.0, "review": "The Fire Stick is simple and easy to use. I was up and running within 5 minutes.  Good job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Dave A"}, {"rating": 5.0, "review": "Black Friday deal, well worth it.", "verified": true, "helpfulness": "0/0", "author": "Edward Beyer"}, {"rating": 2.0, "review": "It seems to crash a lot, the interface also takes some getting used to, its a bit counterintuitive to me.It has a lot of apps (just like Google's Chromecast) but I haven't found Youtube, not sure if its not on there or what - if so, big disappointment.The screen mirroring function also ties up your tablet or phone so you can't do anything else, whereas with Chromecast I can throw my screen to the TV and still use my phone (slooooooow as it may be).", "verified": true, "helpfulness": "0/0", "author": "W. Ward"}, {"rating": 1.0, "review": "I haven't experienced any of the technical difficulties that others have, however beware if your service provider is Cox Communications. The full content of some channels such as History, and A&E; etc.. are not available as Cox has not partnered with A&E;, History (and others) for any TV offerings through the Amazon Fire TV products. As such, many of the programs I would want to watch are unavailable to me. I wouldn't have known or even guessed that this was the case based on what I had read through Amazon's product info. Cox Communications does not plan to participate in these offerings any time soon according to a forum response I received recently from a Cox representative. If you are lucky enough to already be a customer of one of the approved service providers on the respective channel's website, (i.e. A&E;), then you can view full content for that channel. If not, then your choices are definitely less. I have read another review in which the customer had the same issue with a different provider.", "verified": true, "helpfulness": "0/0", "author": "E. Coleman \"thetoltec\""}, {"rating": 5.0, "review": "UNREAL.  THE AMOUNT OF CHANNELS AND CLARITY IS TERRIFIC.  GREAT BUY.", "verified": true, "helpfulness": "0/0", "author": "Paul W. Siegel"}, {"rating": 5.0, "review": "FREAKIN' AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Jon Fiddelke"}, {"rating": 4.0, "review": "Great product for the price. Some video and music apps show a teeny bit of lag in the menus but it's not bad at all. I tried using the USB ports on my TV to power the Fire Stick but was told on screen when it powered on to use the supplied USB power adapter instead. The supplied 1 amp power adapter was a little big to fit in the open outlet on the power strip between two other plugs so I had to use another USB power adapter I had on hand from an old Samsung phone. I think the only real improvement I can think of right away that Amazon should consider would be to add a volume up/down to the remote that could be programmed to either a TV or audio receiver so the user doesn't need two remotes at their side when using this device. The usb adapter could also be downsized for the reason noted above.", "verified": true, "helpfulness": "0/0", "author": "Lights On"}, {"rating": 1.0, "review": "Pre-ordered and it came quick. Picture quality is great. WIFI has issues. It will connect. Then it will loose connection. Must unplug and replug each time to reestablish the WIFI connection. Doing this about every 20 to 30 minutes is anoying.", "verified": true, "helpfulness": "1/1", "author": "M. Pfeiffer"}]