[{"rating": 1.0, "review": "Not enough instructions included.  Having issues signing on to our Netflix account with this device.  Netflix works well on the computer and with the Playstation 3 which is hooked up to a smaller TV in another room, however kept getting kicked off of Netflix when using the Amazon Firestick on the big TV.  At this point in time I am reading to return the firestick.", "verified": true, "helpfulness": "0/0", "author": "Cynthia L. Mann"}, {"rating": 4.0, "review": "I love it!  So thrilled that I can get Amazon Prime on my TV!  Easy to set up. Wish the plug in cord was longer, but other than that, love it!", "verified": true, "helpfulness": "0/0", "author": "Debra L"}, {"rating": 4.0, "review": "Very easy to install... I love amazon products and this item is no different.  The picture is so clear and the options for use are amazing.  My only issue is not being able to search the Web for outside video sites.", "verified": true, "helpfulness": "0/0", "author": "Jessica M Belair"}, {"rating": 5.0, "review": "It's a whole new world of entertainment!", "verified": true, "helpfulness": "0/0", "author": "Eric Stern"}, {"rating": 5.0, "review": "Thank you for making the Fire TV Stick available with the Sling TV promotion.  My landlord would not allow me to have cable and internet installed to the townhouse I'm renting.  I found a way to get internet, but still didn't have cable.  The Fire TV Stick was the answer and works extremely well.  Hook up was a breeze.  My plan is to get all things amazon when it come to technology.  Good quality products.  Thanks again!!", "verified": true, "helpfulness": "0/1", "author": "V. Driskill"}, {"rating": 3.0, "review": "Still trying to find out what different programs will cost me.  What is the best program to get national news?Is there anything that's free?You need better and more instructions within the package.Not as clear as it should be.", "verified": true, "helpfulness": "0/0", "author": "Len"}, {"rating": 5.0, "review": "Very easy to install.  The full length power cord was very helpful.  We were up and running in about 5 minutes.  Make sure you have sufficient available HDMI ports on your TV if its a TV install.  Remote is nice and compact and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael OConnor"}, {"rating": 5.0, "review": "As good as expected. Don't know why I waited so long.", "verified": true, "helpfulness": "0/0", "author": "PB Nyren"}, {"rating": 3.0, "review": "I did not find it as friendly as Roku and returned it.", "verified": true, "helpfulness": "0/0", "author": "Not Maven \"not maven\""}, {"rating": 4.0, "review": "Would have given 5 stars, but you need to have a cable subscription for a lot of channels.  That kind of defeats the whole idea of the product.", "verified": true, "helpfulness": "0/0", "author": "Steve Davis"}]