[{"rating": 2.0, "review": "For the price difference you are going to get more out of the Full Fire TV vs the Fire TV Stick. You will find its much faster and contains more storage space. At a $39 price point Fire TV Stick Just isn't worth it.", "verified": false, "helpfulness": "0/0", "author": "Gower Limited"}, {"rating": 4.0, "review": "I'm not sure yet but I think it's going to be a good buy. I haven't had time to get everything checked out. I'm going to have to get my internet upgraded to be a little faster. But for the most part I'm happy with it.", "verified": true, "helpfulness": "0/1", "author": "granny 1"}, {"rating": 1.0, "review": "So here's the thing: one star is admittedly harsh.  There are plenty of reviews here you can read that talk up all the wonderful aspects of this device.  For me, however, the only true positive is that it natively handles Amazon Prime a lot better than the competition - so much so, of course, that I'm fairly certain they have crappy Prime apps for competitors on purpose, in order to steer Prime users to Fire TV.  But that just doesn't work for me.  I have Rokus and Apple TVs and smart TVs and the lot of it, and the device which is best is the device that is actually used.  Despite the fact that it handles Prime better, it doesn't do it so much better that it's frankly worth it to me to switch devices.  Additionally, it doesn't play nice with my Harmony remote, and I don't know why I'd reach for a secondary remote - especially since I got the Harmony in order to ditch all those secondary remotes - just so I can access Prime, which I already can do on multiple other devices.  So it goes unused.  I honestly might as well not have it.  Ergo: one star.  However, if this is the ONLY device you use?  Sure, why not.  I still don't think it's the best of the possible options, but, again, if you have Prime (or especially only Prime, and not Netflix and Hulu Plus, as I have), and this is your only device, then it's perfectly 100% acceptable.  Where \"acceptable\" is hardly, you know, five stars...", "verified": true, "helpfulness": "3/4", "author": "B. Coleman"}, {"rating": 2.0, "review": "Sucks that Amazon has to lie about Miracast certification.  This thing works on a VERY limited number of devices, and apparently they didn't check to see that Miracast is a standard.  It'd be like saying that a dollar is currency verified for the entire United States, but then you find out it only works in four states.  Pretty stupid overall.  It does do app streaming alright, but that really doesn't cover screen mirroring, which is the whole reason I got one", "verified": true, "helpfulness": "0/0", "author": "steven daycak"}, {"rating": 4.0, "review": "I really enjoy the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Keith W. Zollars"}, {"rating": 5.0, "review": "Easy to set up and easy to use.", "verified": true, "helpfulness": "0/1", "author": "Jennifer"}, {"rating": 1.0, "review": "Drops wifi connection all the time or freezes up after a while . Roku stick that I own works perfectly fine all the time. Please look at other options , I am not sure that Amazon has good quality control on their hardware. Buyer beware.", "verified": true, "helpfulness": "11/12", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I replaced a roku with this. It's so much nicer then having that little box although I haven't yet gotten into.how to download anything more then what came o  it suck as Netflix, Amazon prime,Showtime and one other. I no it's supposed to have a lot more if you want them but you have to go into your account to load them.and I'm not even sure how to.load them to the firestick instead of my fire kindle. I'll figure it out. Otherwise the color on it was amazing. It really made my t.v. look even better then it usually does. Quite brilliant.", "verified": true, "helpfulness": "0/0", "author": "L. Hayes"}, {"rating": 3.0, "review": "While not as functional as the Chromecast, it works simply and effectively.  I just wish the menus were cleared and there was an app for it on the iPhone5.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Meklemburg"}, {"rating": 1.0, "review": "There's not much positive I can say about this device. The UI was extremely laggy, it transitioned slowly from active state to screensaver, the list of chocked would reset while browsing through movies causing me to lose where I was, etc. The worst part? This device has minimal potential value unless you plan on spending some serious cash on Amazon video services. This thing is half Amazon service advertising. I was actually surprised that amazon would ship such a terrible product and am absolutely floored that there are so many positive reviews.", "verified": true, "helpfulness": "3/3", "author": "Philip Kohler"}]