[{"rating": 5.0, "review": "Does everything! installed xbmc/kodi and now this is my HTPC", "verified": true, "helpfulness": "1/1", "author": "Steven S."}, {"rating": 4.0, "review": "The remote wheel scuffs really easily. That's about my only complaint. Sometimes connecting to a network can take a few minutes. Overall quality product. Wish there was Ultraviolet support.", "verified": true, "helpfulness": "0/0", "author": "TheRogueMando"}, {"rating": 5.0, "review": "This little thing is great, and even better now that I've found that you can sideload Kodi (XBMC) on it quite easily, making it a truly versatile media player for local and streaming content. Good work Amazon.", "verified": true, "helpfulness": "1/1", "author": "krisp"}, {"rating": 4.0, "review": "I ordered two of these and both were a bit challenging to setup in the beginning but once they were updated have been working well. Makes my old dumb flat screens smart! I love the fact I don't need a smart phone or tablet to use it. Remote works great.", "verified": true, "helpfulness": "1/1", "author": "ttowens"}, {"rating": 5.0, "review": "Own 3 of these.  For the price they are absolutely unbeatable.  Fast, always on, beats the hassle of using a PC or PS3 to stream video from Amazon/Netflix/Shotime.  Be even better when HBO GO is released.", "verified": true, "helpfulness": "0/0", "author": "Ryan M. Couture"}, {"rating": 3.0, "review": "Digital Media content is unavailable out of United States.Unavailable direct cast from android apps to Fire TV, for example, google music.", "verified": true, "helpfulness": "1/1", "author": "Jonathan Cordero Duarte"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "jason d."}, {"rating": 5.0, "review": "I am a big Chromecast user, but couldn't pass up the price Amazon offered for prime users.  Upon trying this stick out, I absolutely love it.  I highly recommend this as it has a few more features that the chromecast can't do.  Also having a remote control makes the experience even better.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 4.0, "review": "Very effective.  Only suggestion would be a remote SOURCE capability.", "verified": true, "helpfulness": "0/0", "author": "Michael W. Franks"}, {"rating": 5.0, "review": "Amazing. I haven't used this a lot yet, as I'm a Roku addict, but this was on sale for $19 and I had to give it a try. It's FAST. And it works very well. I'm looking forward to using it some more, and may even replace my Roku's with these, especially my older ones.I wasn't able to power it though the HDMI port, it needed the included AC adapter. My understanding is that some newer televisions (mine is several years old) may not need the adapter. Even with the adapter, it's still better than having a box that has to sit somewhere.", "verified": true, "helpfulness": "0/0", "author": "JK"}]