[{"rating": 2.0, "review": "The best thing that it has going for it is the price, but might as well get a Chromecast instead. I bought this when it was half off to be able to stream, PBS and Showtime. Well, the selection on the PBS app through amazon in highly limited and Showtime won't stream with the cable company I have access to. So, once you collect all of these silly things and fill up your Hdmi ports then you might be able to avoid cable, but it is difficult. and by doing a test, netfliz comes in a little clearer through the Fire stick over the chromecast but it is jumpy between frames. So, make your choice.", "verified": true, "helpfulness": "0/2", "author": "Jeremy Farmer \"Jeremy Farmer Photog\""}, {"rating": 2.0, "review": "just got this. easy to connect, set up. a bit cranky with my 5G network, but works fine on the 2.4G one. works well. my roku box ALWAYS takes a full minute to 'unblur' netflix, the fire tv stick is in focus instantly.the menu is a bit busy, but sleeker, more modern than the roku menu. and i will be happy to never see the roku 1992 animation when i reboot that device (which i needed to do regularly).so far extremely stable (but it's only day 2). plex was easy to setup ($5. thru amazon, i think it was free on the roku). wish i could customize the menu...maybe later? i don't need games, music. would like it simpler...looking forward to the ios app, but really, pretty easy to use. and a great price! def worthwhile.EDIT: couple of days later....sometimes, when we power on the tv, the stick has lost it's network connection. today, had to unplug then replug the AC to get it back. would like to be able to disable sleep, so it's always on (and our tv is off). this works with the roku box, but not the fire tv (yet). might help that issue...EDIT2: so, plex has issues, and all the movies i've converted (with handbrake) to store on my computer do NOT play in surround thru the fire stick (this works with my roku box). this is a HUGE disappointment, and am hoping amazon fixes this. thought this would replace my roku, but glad i kept it. ugh!EDIT3: june 30, 2015...and no fix for the plex surround issue. so am replacing the stick with a roku box...which does not have this problem.for most people, the fire stick should be sufficient, and...it's great at what it does well. so it goes...", "verified": true, "helpfulness": "0/0", "author": "fff3k"}, {"rating": 4.0, "review": "Little kludgy and needs to unplugged and replugged to activate if I don't use it for a couple of days but overall I like it.  Nice replacement for watching web content after the Samsung Blu-Ray firmware upgrade rendered it useless for anything but playing discs.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 2.0, "review": "Wish there was an option to broadcast from my computer to the TV", "verified": true, "helpfulness": "0/3", "author": "Jeff Thompson"}, {"rating": 5.0, "review": "It's a nice device, fits exactly in the back of my TV. It give me access to my amazon prime account. The quality of the movies and it resolution is very good. I have free access to The History Channel programs and another places like Crackle, Hulu and Netflix. The remote control is easy to use. I recomend this device", "verified": true, "helpfulness": "0/0", "author": "Oncologo"}, {"rating": 3.0, "review": "Sometimes it says it's connected to the internet with problems and doesn't work. But the wifi connection says it's very good.", "verified": true, "helpfulness": "0/0", "author": "This guy"}, {"rating": 5.0, "review": "Amazon fire TV stick is very fast and easy to set up. The picture quality is of HD quality. Highly recommended if you need something at home or to take it with you on the go to watch while traveling at a hotel or friends house.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 1.0, "review": "On October 27th I ordered the Fire TV stick, and received my email confirming this order, and an estimated delivery date of December 10, 2014.  I reviewed my orders today, December 8, 2014 as I had not yet received a shipment notification, and I absolutely could not find this item in my order history.  I then reviewed my emails, found my email confirmation that I had in fact ordered this item, and the order number.  I typed the order number in on Amazon.com and nothing came up.  However when i ran a \"rder history report\" the Fire TV stick was in there.  So I chatted with amazon on-line ... I will not be receiving my Fire stick as they cancelled the order-2 DAYS after I placed the order, because they were out of stock.  So frustraing, do not order until it gives a close delivery date.This is how our conversation went..You are now connected to Levi from Amazon.comMe:Hello, on 10/27/14 I ordered a Fire TV stick, which is listed in my devices, and it is in my email as \"order received\" and estimated delivery of December 10, 2014, however, when I go into my amazon order history i cannot find the order for my Fire stick. The order number is 10/27/2014 XXXXXXXX Fire TV Stick Electronics . When i download an order report the purchase quantity says \"zero\". This is an item we are expecting to receive and we would like to resolve this issue.Levi:Hello E, my name is Levi.Me:helloLevi:I'm sorry you're having problem with the order that you received. No worries, I'd be happy to look into this and see what I can do to help.Me:Thank you. Just to be clear, the issue is that we have not received our order.Levi:I'm sorry to keep you waiting. Our system is running slow right now but we're doing our best to resolve your issue. Please bear with me.Me:no problemLevi:Thank you.I'm sorry to keep you waiting.Me:okLevi:Can you verify to me the order number for the Fire TV Stick, please?Me:XXXXXXXXXLevi:Upon thoroughly checking, the Fire TV Stick on this order was cancelled.Me:why?and WHEN was it cancelled?Levi:Upon checking, the Fire TV was cancelled because it is Temporarily out of stock.Me:I do not understand how this justify's a cancellation of an order, since this product is still available to purchase on amazon.comhello?Levi:It was cancelled on October 29, 2014.Me:that was 2 days after I placed the order. I want to know WHY my order was cancelled. The delivery estimate wasn't until December 10th and this product is STILL available for purchase on amazon . Therefore is clearly is not out of stockLevi:I'm sorry, I don't have the option to the reason why it was temporary out of stock.No worries and rest assured that I will forward your concern to our appropriate department so that they can investigate regarding this matter.Me:i want to know why my order was cancelled if this product is continuously for sale on amazon. it is an amazon device and has been for sale for months.Thank you for forwarding this because we would like the Fire TV stick we ordered, and for the price we ordered it for on October 27, 2014. We are very disappointed in how amazon handled this matter. We were not even aware it was cancelled. I checked my account around Thanksgiving and it was still visible on there telling me there was a December shipping date. And according to you my order had long since been cancelled, with no notification to me.Levi:When an item is listed as \"Temporarily out of stock. Order now and we'll deliver when available,\" this means the item is currently out of stock and we’re not sure when we’ll get more of this item.You're welcome, E.Me:I understand that Levi. So are you telling me that between October 27th 2014 and December 8, 2014, no more of these have come into stock? then why is it still for sale on amazon?will you please transfer me to your managerwhat number may i call to speak to someone about this issue?Levi:Rest assured that our appropriate department will surely look into this and will investigate with your concern.Me:please tell me the telephone number i may call to speak to someone.Levi:You can contact as by phone. Amazon contact number: 1-866-216-1072Me:thank you. and how will i hear of the resolution of my issue? will a fire stick be sent to me?Levi:You can reach Fire TV Customer Support by phone directly and toll free from many countries by clicking the Contact Us option on the support pages:Amazon Fire TV: https://www.amazon.com/firetvsupportFire TV Stick: https://www.amazon.com/firetvsticksuppo...(See full link)You're welcome.Me:and you are sending my issue to someone who will resolve this matter appropriately?Levi:Yes, you're right.Me:please let me know to whom you will be sending this matter to. I would like to have this for my records. PLease provide me with the department information, the employee identification number, as well as their titleLevi:For security for purposes we are not allowed to give this information.Don't worry and rest assured that our Fire TV Stick representative will speak to you.Fire TV Stick: https://www.amazon.com/firetvsticksuppo...(See full link)Me:when? this was suppose to be a christmas present and now I am just getting the run aroundLevi:Your question will be best handled by Fire TV Customer Support.", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love this little device. It was super easy to set up, has lots of options and stays connected to my WiFi. Having previously purchased two Chromecasts (one replacement) that don't work well at all, I was a little apprehensive. They wouldn't stay connected and required constant factory resetting, but the Fire stick is so much better. I have had no issues at all except that it is sometimes a little slow to wake up after disuse. My mother has had no trouble with hers nor has my daughter. Definitely worth the purchase. Amazon was out of stock so I got 4 from Best Buy for $25 each.", "verified": true, "helpfulness": "0/0", "author": "Khatira"}, {"rating": 3.0, "review": "We have them all now. Roku, Chromecast, and now the Fire stick. I'm only giving it 3 stars because the installation was ridiculous. It wasnt hard, just frustrating. We wanted it for our TV that is not a smart tv. We use our Roku and Chromecast on that one, but thought this was the perfect solution to our guest bedroom needs. I must have misread, because when they made a comparison to Chromecast, I thought that it meant you can mirror the computer with TV. If you can, please comment so I can do this. With that said, it didn't work in our bedroom. It was having trouble connecting to our router. We took it to the Smart TV, same thing, but after several attempts that's the TV, it will work on. The one we don't need to use it on.  The 3 lines button, do not use this to make upper or lower case, physically down arrow over to the abc when connecting the router password to the device.This is as of DAY 1, I will update in a few weeks. It's nice, the kids like that you can get Netflix and few others, but it's nothing that's not on our Roku. My husband likes the free fireplace app, but dislikes that we will still have to use Chromecast to mirror our computer for other things. The picture is nice and the ease of connecting to my Amazon account is nice and scary.  For $19, there isn't much to complain about.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SBUXmommy\""}]