[{"rating": 4.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Stewart J. Go"}, {"rating": 5.0, "review": "No complaints, love this for prime videos.", "verified": true, "helpfulness": "0/0", "author": "BabaeChen"}, {"rating": 3.0, "review": "most apps don't work outside of America", "verified": true, "helpfulness": "0/0", "author": "Sheldon Alleyne"}, {"rating": 5.0, "review": "This is everything I could want in a set-top box and best of all it is completely out of sight. There are all of the apps that I need for my media viewing needs (e.g. Netflix, Plex, and Hulu+). It was very easy to set up because it came preloaded with all of my account info right out of the box. Just set it up on my network and we were off to the races. There are several pluses to the fire tv stick versus chromecast and ruku stick. In my opinion the fire tv stick beats the chromecast hands down. The remote is ridiculously handy to have and best of all it does not require a second device to stream content, but it can still have content cast to it. However I had hopes of using this device for miracasting from a Win8.1 tablet but I have not been able to get this working as of yet. I ordered one went it went on sale for $19 just to give it a try. I have been so pleased with it that I plan to order a second for the bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "Zachary M"}, {"rating": 5.0, "review": "Had no idea what this was when I ordered it, but gave it to my daughter for Christmas and she has been watching HBO and Prime movies and shows ever since. It is extremely easy to use and worth every penny!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly B. Raymer"}, {"rating": 5.0, "review": "Pretty cool, after learning how to navigate the fire TV stick from Amazon. I only wish there was an app to access the Internet/Facebook etc.", "verified": true, "helpfulness": "0/0", "author": "Terry Brown"}, {"rating": 4.0, "review": "We received a Fire TV stick as a Christmas gift.  My husband has been enjoying it ever since.  The wide array of movies and TV series the stick allows him to watch is amazing.", "verified": true, "helpfulness": "0/0", "author": "beeblue"}, {"rating": 5.0, "review": "I highly recommend this streaming device.  You really need to be a prime member to enjoy the full benefits of it.  Also great for streaming netflix, hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "glj104"}, {"rating": 1.0, "review": "This does not work outside of the United States of America. Funny Amazon had no problem taking my money from a billing address outside of the United States but when you try to access the amazing content promised by PRIME you end up with jurisdiction issues.  Amazon NEEDS to state more clearly that THIS WORKS ONLY IN THE USA. I thought it would have been like Netflix - pay the subscription and get the content. Not so. I am very unhappy and feel like Amazon has no problem misleading its international customers.One day later and now I can't even use it to access my Netflix account anymore. Totally useless. I would love to return this and get my money back.", "verified": true, "helpfulness": "8/10", "author": "dawn"}, {"rating": 4.0, "review": "Love it!  Too Bad I cannot use it in all of my TV's.  Is there any way I can connect the Fire stick to a non- HDMI TV?  I have TV's that still use a compound connection. Please help!  Thanks!", "verified": true, "helpfulness": "0/0", "author": "dreamofjinni"}]