[{"rating": 2.0, "review": "I wanted this to work- I missed the $19 price and was about to buy one at $39 when I was given one as a gift.Newer TV, plenty of HDMI outlets. Great wireless signal.And it would not work. A few dozen attempts (with and without customer support) to reset, replug,etc. Nada.It would let me connect to the internet then freeze. Amazon issued a replacement stick, which arrived promptly. Again, it did the same thing. I tried each HDMI port. I tried another TV just to see if it was the TV. No luck.Wish I knew why, and I wish there had been a solution other than sending it back for a refund (since it was a gift, they were willing to refund me with credit to Amazon, which was great.", "verified": false, "helpfulness": "0/0", "author": "MidwestMom"}, {"rating": 4.0, "review": "Seemed like a quality product and was pretty darn fast and is basically a toned down fire tv but in a stick. I returned mine for two reason ... I needed a good streaming Amazon Prime box ... and JUST as these got shipped TiVo finally did an update to their box and gave me a solid Amazon Prime app that works perfect. So with that the need for these was almost not there (since it has Netflix and ll the other basic stuff already as well) ... .Plus I use a IR Universal Remote for all my devices and this being RF I would Have to use the supplied remote and I couldn't program my universal to control this since it has no IR functionality.So in the end this is a KILLER little unit and for the 19 bucks I paid a steal ... but in the end for me and my use and needs I still returned both.Nothing to do with Amazons great product ... TOP NOTCH like always along with their CS and company overall. :)", "verified": true, "helpfulness": "0/0", "author": "Chris I."}, {"rating": 3.0, "review": "Doesn't work as good as the Amazon Fire TV Box.It does alot of buffering and stopping throughout some of the movies.Don't think I would recommend this product to someone else unless it  was programmed better than the one I got.", "verified": true, "helpfulness": "0/1", "author": "Jasper Talbert"}, {"rating": 1.0, "review": "I purchased it when it came out. It plays the initial video upon setup but everything else gives me an unkown error. It says to contact Amazon if problem persists but there is no where to get help.", "verified": true, "helpfulness": "0/0", "author": "HH"}, {"rating": 5.0, "review": "Took some time to get used to it. Love it and the remote. Really good for older parents who do not use smart phones as remote. It is responsive and the video preview when scanning forest and back is excellent.The only issue I had was when I plugged it into a samsung TV the colors were over boosted. And I was not able to adjust the settings. On a Vizio they are perfect. So may be an issue with the TV.We have a chromecast, Apple TV and this and we have defaulted to using this now. It is the most user friendly with the included remote.The remote app however is pretty sub par.", "verified": true, "helpfulness": "0/0", "author": "Mr C"}, {"rating": 4.0, "review": "Its ok.....", "verified": true, "helpfulness": "0/0", "author": "J.D."}, {"rating": 5.0, "review": "Great little device. Keeps my family entertained. Supports Plex, Netflix, and Amazon Prime TV. What more could you want?", "verified": true, "helpfulness": "0/0", "author": "Mr. Smith"}, {"rating": 1.0, "review": "Update 2/15/15:Freezing is back on Netflix.  Buy the FireTV box or a roku.  The stick is terrible.____________Amazon exchanged the stick and power adapter.  Yes, defective exchanges will be just the stick and just the power adapter separately.Buzzing/freezing is still gone.  The video/audio sync issues seem to be fixed, but now I still get a very tiny pause in the exact same times on certain netflix video.  For the price I paid $20, I'm going to keep it; however, if you a picky about perfect streaming video and have to pay $40 MSRP, get something else._________Spoke too soon.  Now instead of freezing/buzzing, the streaming video will slow down for a few seconds but the audio remains perfect.  It then goes back to normal until it does it again in 30 minutes or so.  Zero streaming issues, zero buffering issues, local vs internet streaming does the same thing, etc.  I have two and both are doing this.  Have to send them back and look for better devices._____________Replaced the supplied adapter with a 5V 2A one.Buzzing and freezing?  Gone.Remote control glitches / ghost presses that I thought was just normal?  Gone.So far things have improved but I'm going to keep testing for it._______________Every ~40 minutes I get a very noticeable buzz along with a screen freeze and then the video resumes normally.  You can't ignore it and it completely removes you from whatever you were watching.  This happens over and over after about the same amount of time passes.It isn't my wireless network nor my internet connection.  A quick google search reveals that the probable source of the freezing is that the power supply provided is causing the issue.  The solution is to use a different USB power source or go against the explicit instructions in the manual and plug it into a USB port on the TV.  Well I don't have a usb port on the TV so I am screwed and must listen to this buzz.  Hopefully I can send these back.Everything else is great.  The UI, the wireless range, the apps, etc.  Everything is great except for the buzz / freeze every single 40 minutes you watch.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "easy. works perfect.", "verified": true, "helpfulness": "0/1", "author": "DSL"}, {"rating": 5.0, "review": "I bought this because I have many movies and TV shows for viewing and they look very good indeed in HD.  Unlike some of the other purchasers I needed only to follow the instructions provided for a successful viewing of a movie I had that my wife had not seen. Excellent product recommend to all!", "verified": true, "helpfulness": "0/0", "author": "Jim H."}]