[{"rating": 5.0, "review": "Best media player out there", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 5.0, "review": "A lot of bang for your money. Worth the price just to have everything in one place. Nice to have Plex and Pluto apps already there too. Installation was easy enough. Bluetooth remote is great, hardest thing to do is get used to NOT pointing the remote at tv.The usb on tv didn't supply enough power for stick. So had to plug it into outlet for correct voltage. Not really an issue .", "verified": true, "helpfulness": "0/0", "author": "MetalMike"}, {"rating": 5.0, "review": "I love the fire stick! Super easy to use and stream other apps! I wish it streamed vudu, but other than that, works great and meets our needs.", "verified": true, "helpfulness": "0/0", "author": "ckulupka \"Cathy Kulupka\""}, {"rating": 5.0, "review": "Perfect for our needs! Love the easy set up and the fact that they have it already linked to my prime account. We have two and will be ordering a third. Makes it a Smart TV pretty much but without the price tag of one!", "verified": true, "helpfulness": "0/0", "author": "Amy Austin"}, {"rating": 5.0, "review": "Love my Amazon Fire TV stick!", "verified": true, "helpfulness": "0/0", "author": "Julie bules"}, {"rating": 5.0, "review": "Have been absolutely pleased with the Firestick performance and ease of use! It's on the opposite end of our home and picks up signal strength flawlessly. Also easy to add other streaming apps and upload pics and videos!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works well but it constantly is pushing amazon content", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "By far the best device to enhance a non-smart or smart TV. I love mine and so do the kids.", "verified": true, "helpfulness": "0/0", "author": "Troc"}, {"rating": 5.0, "review": "i love it - after being an A tv fanatic adding this basic stick to my life has redefined my layers of on demand tv - my only regret is not getting the FIRE TV stick sooner!  Waste no more time, get it NOW", "verified": true, "helpfulness": "0/0", "author": "William F."}, {"rating": 5.0, "review": "This is a handy little gadget! I wish my prime account had access for more shows and movies but this piece of equipment works really well!", "verified": true, "helpfulness": "0/0", "author": "Bekie March"}]