[{"rating": 4.0, "review": "Got it for the discounted price early on. We don't have an internet TV but not I feel like we do. Basically use Amazon Prime Music/Video, YouTube, and Netflix. The all work great. The reason it gets a four is b/c sometimes we have connection issues with the firestick - it's definitely the fire stick b/c our laptops, kindle, phones, and ipad do not have issues.", "verified": true, "helpfulness": "0/0", "author": "Shawn E Fellows"}, {"rating": 3.0, "review": "Viewster doesn't work fine (Fire TV control is weird on this app), Crackle doses't work at all and when I use CrackleR it displays \"script error\" so I can't see movies. IGN and WWE Network work fine.", "verified": true, "helpfulness": "0/0", "author": "Norman Urbina"}, {"rating": 5.0, "review": "Soo cool love this this thing", "verified": true, "helpfulness": "0/0", "author": "Cara B."}, {"rating": 5.0, "review": "Love this, hardly watch netflix any more. very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Selina TX"}, {"rating": 5.0, "review": "I love my Fire TV Stick.  It's not bulky, and its interface is totally smooth.  You can even pair it to your phone to use it as a remote.", "verified": true, "helpfulness": "0/0", "author": "Cassie Andrews"}, {"rating": 1.0, "review": "This gadget is for US territories only please don't purchase this item if your are living in third world countries absolutely useless rubbish can't even stream your local media without plex rubbish rubish rubish", "verified": true, "helpfulness": "0/0", "author": "Miami"}, {"rating": 4.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "shanon bowling"}, {"rating": 2.0, "review": "Works ok to link up, but the need to plug it into a power source is a deal breaker.  The whole point of a simple stick is to avoid cables!", "verified": true, "helpfulness": "0/0", "author": "J. D. Bader \"Tanker Jade\""}, {"rating": 5.0, "review": "Easy to use and set up on your tv. Great for bringing to hotels for amazon instant video viewing and for Netflix and you tube.", "verified": true, "helpfulness": "0/0", "author": "Sarah99"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]