[{"rating": 2.0, "review": "I love the idea of having an easy way to stream Amazon Prime to my TV but when I first installed the Firestick I had streaming issues in Hulu only. I was advised to uninstall and re install Hulu. That worked a little better but I have since cancelled Hulu because I had Netflix. Then I started having streaming problems in Netflix so I reinstalled Netflix but this only helped minimally. I'm going to switch back to the Chromecast that I have on another TV.", "verified": true, "helpfulness": "0/0", "author": "Diamondbrite"}, {"rating": 5.0, "review": "WE HAVE HAD FIRE FOR 1 WEEK LOVE EVERYTHING ABOUT IT. WOULD LIKE TO SEE ADULT MOVIES ALSO INCLUDED.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Needs a lot of work. My feeling is that the hardware is pretty solid, but the software is not very good. Amazon video services work pretty well, but I continuously get video playback errors with the Hulu and Netflix apps. My PS3 and Roku Streaming Stick work fine even when the Fire TV Stick (FTS) isn't, which tells me that the FTS is the issue. The FTS seems a little less responsive than you would like. It feels like it isn't very good at freeing up memory when you leave apps. I would pass on this device for now.", "verified": true, "helpfulness": "0/0", "author": "Michael Jensen"}, {"rating": 5.0, "review": "Great replacement for cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I never tried a streaming stick before and I did not know what to expect but I did expect more, at the same time I am happy with it and would recommend this product. The included remote is nice and sleek, that's a plus.", "verified": true, "helpfulness": "0/1", "author": "leo"}, {"rating": 5.0, "review": "Looking forward to using. So far it meets my expectations.", "verified": true, "helpfulness": "0/0", "author": "Thomas Conroy"}, {"rating": 3.0, "review": "It work real good! Easy to hook up and set up", "verified": true, "helpfulness": "0/0", "author": "Daniel Feliciano"}, {"rating": 5.0, "review": "Can't be beat for the money! No problems to date and good performance after a month of use.", "verified": true, "helpfulness": "0/0", "author": "James Yarbough"}, {"rating": 5.0, "review": "One of the best things I have purchased in a long time!", "verified": true, "helpfulness": "0/0", "author": "Theresa Lovette"}, {"rating": 5.0, "review": "Better than Chromecast because of remote.  If you have a Prime account, it's a must have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]