[{"rating": 5.0, "review": "Amazon's Fire Stick exceeded my expectations. It is small, immediately responsive to the remote and very fast for streaming content. I ordered it on a whim as a Xmas present for my wife and we are both amazed at its performance.Five Stars, absolutely.", "verified": true, "helpfulness": "0/0", "author": "Craig Balthrop"}, {"rating": 5.0, "review": "I LOVE this thing! Works flawlessly with my Prime Membership. It was easy to set up, and the menu system is straight forward.  I really enjoy the Bluetooth remote, why aren't ALL remotes Bluetooth? We use it for watching free prime movies and listening to prime music collections. The screensaver has some nice pictures.  You can tell the pictures have a Seattle area influence. I got a Fire TV for Christmas, but as we aren't gamers, we kept the Fire Stick. Overall I would definitely buy again.", "verified": true, "helpfulness": "0/0", "author": "Dthraco"}, {"rating": 5.0, "review": "I got my Fire stick for $19, figuring I could retrofit a regular TV into a \"smart TV\" with little risk.It's perfect!  I plugged it in, signed into my Prime and Netflix accounts and I'm set. I've been binge watching some series during the holiday hiatus and it has worked flawlessly with both.  I look forward to getting HBO go in the spring.", "verified": true, "helpfulness": "0/0", "author": "Tania M."}, {"rating": 5.0, "review": "Very easy to set up and works great. I plugged it into an empty HDMI port of my AV receiver, put the USB connector into a wall adaptor (for powering the stick) and was going in a few minutes. I think all I needed to do was enter my wifi password. Everything fromVine Videos was there and more. Nice to not have to hook up a laptop.Prime music could be better integrated. As it is you have to select things on a PC beforehand to add to your music and then you can listen to just those things.", "verified": true, "helpfulness": "0/0", "author": "Gabriel's Buddy"}, {"rating": 5.0, "review": "It was easy setting up even for me at 71 years of age.  It met all my expectations and more.", "verified": true, "helpfulness": "0/0", "author": "Maureen Lankewich"}, {"rating": 5.0, "review": "We love it! It is easy to use. I use the voice remote which I downloaded on my phone. I recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "jetrider"}, {"rating": 5.0, "review": "Great product, all media apps work great including the plex app with media server.  It's portable, brought with on vacation and plugged into hotel TV, worked like a charm.", "verified": true, "helpfulness": "0/0", "author": "Nathan R. Hudson"}, {"rating": 3.0, "review": "Great, but sometimes takes too long to awake, lost connection. Remote control out of control, repeat key press by itself too often.Plays Music without TV on with my AV Receiver, that's great.", "verified": true, "helpfulness": "0/0", "author": "Kerstin  O."}, {"rating": 5.0, "review": "Wireless function is better than expected. Remote is comfy and easy to use.", "verified": true, "helpfulness": "0/0", "author": "R. D. Grimes"}, {"rating": 5.0, "review": "Easy, easy, easy. Love it!", "verified": true, "helpfulness": "0/0", "author": "Carol S. Paasch"}]