[{"rating": 5.0, "review": "So easy to set up and the picture is so much better than my passTV streaming device.  Have only used a couple of times, but so far I am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Wixie J Skellett"}, {"rating": 5.0, "review": "I think it's great. I should take it camping when they give wifi", "verified": true, "helpfulness": "0/0", "author": "Lisa A. Haas"}, {"rating": 3.0, "review": "Great device, works great but installing the TVMC add on Application required manual intervention.  Once done it all works Great.", "verified": true, "helpfulness": "0/0", "author": "Lyudmila L Parker"}, {"rating": 5.0, "review": "Love this I have no cable and it does exactly what I need it to do for a busy bee like myself.", "verified": false, "helpfulness": "0/0", "author": "Stephanie A"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "KIM TAISUNG"}, {"rating": 5.0, "review": "Still exploring, nice.", "verified": true, "helpfulness": "0/0", "author": "Richard Roosa"}, {"rating": 4.0, "review": "Good device but user interface could be improved.  Good selection of apps but you have to download them.  Selection of apps is only reason I would select it over Apple TV.", "verified": true, "helpfulness": "0/0", "author": "DD"}, {"rating": 4.0, "review": "The Fire TV Stick works great, although I'm a little disappointed with the amount of content that is free through Prime. The Stick itself is awesome. It is fast, super easy to use and set up, and I was able to plug it into my receiver to use my surround sound system. The video and sound quality is great, I would just like more content made available for Prime members.", "verified": true, "helpfulness": "0/0", "author": "J. Finfrock"}, {"rating": 4.0, "review": "We were trying to use Google Chromecast and had one problem after another.  Plugged in the Firestick, downloaded Netflix and started watching.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Shelley Citron"}, {"rating": 5.0, "review": "The fire stick is amazing and super easy to use!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customerfffffdd"}]