[{"rating": 1.0, "review": "im use to netflicks. I have a roku.this doesnt make it easy to watch all the prime videos", "verified": true, "helpfulness": "1/3", "author": "richard fleitman"}, {"rating": 5.0, "review": "Excellent. Better than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "William S."}, {"rating": 5.0, "review": "We love the Fire TV Stick, it's so easy to set up and use, even an elderly person (over 80) can use it!", "verified": true, "helpfulness": "1/1", "author": "Carving Lady"}, {"rating": 5.0, "review": "It's great and easy to use... Love having the remote to use also the app works well", "verified": true, "helpfulness": "1/1", "author": "Gurpreet Singh"}, {"rating": 5.0, "review": "I own the chromecast and have used Roku. I am impressed by this little Fire TV Stick.  Fast response and videos appear show up without buffering although HD quality improves after a few seconds depending in the speed of your internet.  It seems so have way more contents and apps too.  I am only scratching the surface on what's available but am truly impressed.", "verified": true, "helpfulness": "0/0", "author": "naturesfarmer"}, {"rating": 3.0, "review": "I suspect that my complaints will be corrected in time but as i write this I'm not super impressed.  It is easy to use and has functioned largely without problem.  It doesn't have Crunchyroll or Vudu which are minor annoyances.  The real problem I have with it is that in a given episode of a show on Netflix there will be several instances where the screen will stutter for a split second accompanied by an unpleasant electronic sound.  In the end it is the sound which is most annoying and the thing which made be finish the rest of the season of the show I was watching on my Roku box.In short.  For the price it's pretty good and I expect future updates will make it even better.", "verified": true, "helpfulness": "0/0", "author": "Geomancer"}, {"rating": 5.0, "review": "I received my Fire Stick yesterday and have been playing around with it since. Currently I'm listening to my Christmas playlist while a slideshow of my pictures play on my tv. Our big \"smart\" tv is old and the apps on it don't update, so the cool features of Netflix for kids, ect don't work on the tv. With a 9 and 6 year old that's a feature I can finally make use of. Not to mention Amazon prime right at my fingertips. I always hated using the wii for movies as well since it would kill the batteries. This with its own regular like remote is a much better daily used item.I guess the only wish I had was if there were a VUDU app and a way to play iTunes movies on it (but I doubt Apple or Amazon will ever allow apps to be on the same hardware).", "verified": true, "helpfulness": "1/1", "author": "Samantha"}, {"rating": 5.0, "review": "This product is outstanding. Simple and easy to install and use. If you have a newer TV set with the HDMI plug port and WIFI internet, plus watch Netflix or Hulu Plus or Amazon Prime or all three .... this devise is for you. Buy it!", "verified": true, "helpfulness": "1/1", "author": "S. D."}, {"rating": 5.0, "review": "I've been able to catch up on all of my favorite shows without any buffer issues or connection problems. I love it!", "verified": true, "helpfulness": "1/1", "author": "Maria Jackson"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "omar"}]