[{"rating": 5.0, "review": "Great value for the money. Loaded full of features with untapped potential just waiting to be discovered!", "verified": true, "helpfulness": "0/0", "author": "Mr. Yewcic"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 4.0, "review": "It does what I wanted it to do. It seems to limit some selections.", "verified": true, "helpfulness": "0/0", "author": "philip v powers"}, {"rating": 3.0, "review": "It does not work with iOS devices which limits its usefulness, to me at least.The setup was super easy.  I just wish I had read the part about it only working with Kindle and Android devices for streaming purposes", "verified": true, "helpfulness": "0/0", "author": "C. Dinan"}, {"rating": 5.0, "review": "I luv the fire stick the problem is Netflix doesn't have a big selection to stream I prefer YouTube to stream movies thru fire stick", "verified": true, "helpfulness": "0/0", "author": "wayne"}, {"rating": 5.0, "review": "So easy to connect to my T V, the remote was difficult to open .The price was right, especially with the free month of Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Mary Domke"}, {"rating": 4.0, "review": "I haven't had the stick that long but from what I have noticed it is meeting all of my expectations", "verified": true, "helpfulness": "0/0", "author": "Lakisha Strickland"}, {"rating": 5.0, "review": "Love how responsive the features are, and prefer it over Google chrome because we control it from a remote and not the iPad or iPhone", "verified": true, "helpfulness": "0/0", "author": "Dutch Girl"}, {"rating": 5.0, "review": "Awesome contentRidiculously easy to hook upNeed seven more please.", "verified": true, "helpfulness": "0/0", "author": "BedStuyDoOrDie"}, {"rating": 5.0, "review": "My kids enjoy it everyday, with Amazon Video Prime and others free video channels, my kids have more fun than the cable which was costing me a lot of money every month(I cut it by the way). I bought it  since it was release for the first time; and I had some WIFI connection problem because of the TV mount I had behind my TV; The Amazon extension was a little short to solve the problem. I bought a longer hdmi extension for about $10 on Amazon and the problem was solved. I can just ask Amazon to make a longer Extension for this since we have so many things behind the TV that can affect a WIFI connection. Thanks", "verified": true, "helpfulness": "1/1", "author": "PeaceMaker \"DOM\""}]