[{"rating": 5.0, "review": "Great shows easy to use. Easy to install", "verified": true, "helpfulness": "0/0", "author": "Walt Dunn"}, {"rating": 5.0, "review": "My husband and I have an 8 year old TV that does not have Smart TV capabilities. We bought this so that we no longer needed to use our XBOX for streaming Netflix. Can't beat the price and the quality is great. We're happy with our purchase.", "verified": true, "helpfulness": "0/0", "author": "Maeve"}, {"rating": 5.0, "review": "LOVE LOVE it", "verified": true, "helpfulness": "0/0", "author": "J. Ferguson \"~J~\""}, {"rating": 4.0, "review": "Like the remote compaired to Crome cast", "verified": true, "helpfulness": "0/0", "author": "bryon cordova"}, {"rating": 5.0, "review": "Easy to install, love the flexibility and choices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Absolutely love it. Best bang for your buck.", "verified": true, "helpfulness": "0/0", "author": "Christopher Young"}, {"rating": 5.0, "review": "I have one cable box in my house and four TVs.  Needed something cheap and easy for my basement TV and the Amazon Fire TV Stick exceeded my expectations.  I don't plan on gaming with it like you can with the full size Fire TV but for media consumption you can't go wrong with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Christopher Hansen"}, {"rating": 5.0, "review": "Working fine, but had to call you and Netflix to get hooked up.", "verified": true, "helpfulness": "0/0", "author": "john read"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick exceeded my expectations. If I have one minor quibble, it's the introduction video that auto starts when you first plug in the stick. There should be an option to skip it before or during playback. Other than that, it's one of the best streaming players out there and @ a low cost.", "verified": true, "helpfulness": "0/0", "author": "tech-fanatic"}, {"rating": 5.0, "review": "Wow, this little thing works really well. Been enjoying all the Prime content.", "verified": true, "helpfulness": "0/0", "author": "Bubba Brindle"}]