[{"rating": 4.0, "review": "The Stick performs well, including using Netflix and Prime content.  Basically I am quite satisfied with it.  Cons:  It doesn't seem to add new playlists after I've added them to my Kindle, although I used the sync function; I have to add them separately.  Also, display mirroring seldom works the first time--I have to re-boot the Kindle to get it working.  Apparently this is the accepted fix, per the Help Desk.  (It's not clear if this is a Stick problem or a Kindle problem.)So, while there are a few issues, I'm glad I got it and use it often.  I'm looking forward to the day that CBS All Access adds the Fire Stick to their supported devices", "verified": true, "helpfulness": "0/1", "author": "Chris Woods"}, {"rating": 5.0, "review": "Everything I need or want to watch is in one place.  YEAH!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Donna Folino"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "John R DiPaulo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Scott Ellis"}, {"rating": 5.0, "review": "This is almost as great as sliced bread.  Easy to use and very hand for the whole household!", "verified": true, "helpfulness": "0/1", "author": "Skygod811"}, {"rating": 5.0, "review": "Amazon keeps making great products", "verified": true, "helpfulness": "0/1", "author": "Brian"}, {"rating": 4.0, "review": "Works well but was a bit tricky to set up. I had to repeat the process several times until it finally found my network. I like it for watching Prime and Netflix. Great for such a small device.", "verified": true, "helpfulness": "0/1", "author": "D. Edger"}, {"rating": 5.0, "review": "I had the roku 2 previously and this seems to work just as well. Speed is fast and I haven't encountered any problems :)", "verified": true, "helpfulness": "0/1", "author": "ToriG"}, {"rating": 5.0, "review": "Love it.  Works great.  Our summer camp now has DSL/wifi, but no cable available (we get NBC & PBS only on our antenna).  Bought this thinking we'd give it a shot, but lots of viewing options available on it thanks to our Amazon Prime.  It's a snap to move from tv in living room to tv in bedroom.  It works for us and we're happy to have it.", "verified": true, "helpfulness": "0/1", "author": "GottaLuvCruising"}, {"rating": 5.0, "review": "Plugs in, menu comes up, and away you go. Good price, too.", "verified": true, "helpfulness": "0/1", "author": "K. Sherman"}]