[{"rating": 5.0, "review": "Great item 👍", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "We purchased this to use when we travel to our time share vacation spot. The WiFi signal is not very strong there so the Fire Stick did not help us much. Have no need for it at home. Plan to try again when we go on vacation.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Excellent addition to a new way of enjoying movies. Easy to set up for those of us that are not real techy. Wish I had purchased this long ago. Great item! Well done Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "K. Capuano \"SweetMamaCap\""}, {"rating": 5.0, "review": "Fire stick is just amazing :) I connected it to my projector and now everything is completely wireless 👏 love it", "verified": true, "helpfulness": "7/7", "author": "Gilberto aladen velez"}, {"rating": 4.0, "review": "Picture quality is great with no flaws when watching T.V. shows or movies. Prime music playlists are very good. Standard remote is not the best game controller, but I don't play many games anyway. I would like to see a YouTube option since they have some good shows too. If NASCAR or Indycar races were available (even on a pay-per-race basis) I'd ditch cable.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Weyda"}, {"rating": 5.0, "review": "I love my Fire TV Stick. I have a Vizio HDTV that is a smart TV and so I had gotten used to all the conveniences of having a smart TV. I got a second HDTV that isn't a smart TV so my Fire TV Stick allowed me to turn my second TV into a smart TV. Now I don't have to hook my laptop up to my TV to watch Netflix, I can use the Pandora app on my TV and watch Amazon Instant Video. All the benefits I have on my smart TV in my living room are now available on my HDTV in my bedroom thanks to the Fire TV Stick. I'd definitely recommend this to others. The price was great and I think it's much more cost effective to get a regular HDTV and add the Fire TV Stick than it is to buy a smart TV. I'd likely go this route for future additional TVs.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Morgan"}, {"rating": 1.0, "review": "I purchased this on sale for $26...why was I charged $39...?  As for it's quality..it works fine but doesn't seem to actually do much of anything.", "verified": true, "helpfulness": "0/3", "author": "Susan Brouillette"}, {"rating": 4.0, "review": "I cannot tell you how much I really enjoy this.  My only issues . . . \"only\" issue . . . is that now my digital channels (all of them) blink from time to some.  This did not happen before I started using this Fire TV Stick.  However, the HDMI movies are crystal clear.", "verified": true, "helpfulness": "0/0", "author": "Maggie \"Maggie\""}, {"rating": 4.0, "review": "I put a brightly colored rubber bracelet at the bottom of the remote to help us find it better. We have a lot of black or dark wood furniture and that can make the remote hard to find.The whole family loves the set-up as we can go from Amazon Prime to Netflix to Hulu all in the same line or row of apps.", "verified": true, "helpfulness": "0/0", "author": "Libra Rye"}, {"rating": 4.0, "review": "The Fire TV Stick is a great, stand alone product. It allows people to have the freedom of a 'smart tv' without limits imposed by the TV manufacturers. Being able to stream Netflix, Hulu, Amazon Prime, etc. is an awesome thing and then add in all the other options Amazon includes it is really over the top for ~$40.I didn't rate it 5 stars because I also have a the full version Fire TV and their is a noticeable difference in performance between the two.I have great internet service (50Mbps) and the wired services are always better. The wireless of the stick is good, but there is skips and delays that I don't see on the full Fire TV.Plus the stick doesn't come with a voice command remote, which the full version does.", "verified": true, "helpfulness": "0/0", "author": "jamarine_73"}]