[{"rating": 5.0, "review": "Very good product. easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Jose Luis Garza"}, {"rating": 4.0, "review": "Only reason I am not giving it 5 stars is because I purchased the Fire box and stick to eliminate my 170 dollar direct tv bill.  The wording in the description made it sound like paid for features, such as hbo go would be included with my Amazon Prime membership.  When I connected both the box and stick, the set up prompts me to choose which cable company I have to be able to watch HBO and Showtime.  Lame, the whole point of buying these items was to disconnect my cable company.  Why would I need this, if I still had cable.  Lame.  Otherwise, it's fast and has lots of great features and access to movies that do come with my prime membership.", "verified": true, "helpfulness": "0/0", "author": "j. jones"}, {"rating": 5.0, "review": "This is my third Amazon TV type product, and I love them so much, I got rid of my outdated Roku and my cable!  This is all I use and one of my favorite gifts to give.  That being said, this last one, I had an issue on the set up because it wasn't preset for my account like my others had been and apparently my DVD player was interfering with the reception of the wifi to the Amazon stick.  I called customer service at Amazon and they told me to use the extender that came with the stick.  It worked perfectly and I was able to set it up and get it running smoothly.  That being said, I have to mention that I had one of the best customer service representatives I have ever come across in all my years of dealing with, well humanity!  Maya JM blew me away with his courtesy and friendliness, and made the process incredibly enjoyable.  Kudos to Amazon for as always, hiring the best of the best!  Wish I could treat him to a cup of Civet coffee!  And I also purchased the spock socks he made me laugh about!  This guy is awesome! A true keeper.  Wish I had his direct extension!", "verified": true, "helpfulness": "0/0", "author": "M. Horton"}, {"rating": 1.0, "review": "Plugged it in, set it up aaaaaaaanndd....NOTHING! Despite my Prime account it never recognized me. The Main Prime Instant Video failed miserably! The only app available tha seemed to work was Netflix. Could not obtain any apps - and the few available, just said \"pricing unavailable\". Called support - in the Phillipines - ran me through everything, deregistered, power-cycled....no change.Sad they'll be calling back in 24-48 hours (if she can figure out the time and date where I am). They should have said screw it - we'll just rush you out another. You open it and it looks impressive, like Amazon's take on Apple packaging - this ain't no Apple product though!We'll see...........", "verified": true, "helpfulness": "0/0", "author": "Chris Newhook"}, {"rating": 5.0, "review": "I am very happy with my fire stick it was so easy to hook up. I have already started watching new programs and series.have had no problems to date. I down loaded the app and can use my phone as the remote.So far so good.", "verified": true, "helpfulness": "0/0", "author": "lodger"}, {"rating": 1.0, "review": "Every time I try to use it netflix tells me that I can not see that movie at this time. It's the same with every program, tv show or movie. If I look for the same movie on my fire tablet I can see all without a problem. What is the problem? If I can't see any movies I will have to return it. Any idea what is wrong?.", "verified": true, "helpfulness": "0/0", "author": "Diana Arguinzoni"}, {"rating": 2.0, "review": "I bought the Amazin Fire Stick after reading some great reviews. I have been a roku and chromecast user for a while and needed something to replace my aging roku. I did not want another chromecast as I really wanted access to watch prime movies on the device and wanted to try something other than roku. I received my Amazon Fire stick today and set it up once I got home. I was shocked to find myself blocked out of HBOGo and many other apps that are available for chromecast and roku are not available. I am disappointed to see that Amazon pushes its own content so aggressively that I have to look at their offering on the main screen. I also think the navigation is a bit lousy. The only good thing I can see so far is the processor is quite fast and the remote works nicely... Other than these two positives the Fire Tv is a crappy comparison to roku, Apple TV and chromecast.", "verified": true, "helpfulness": "0/0", "author": "PCS"}, {"rating": 2.0, "review": "We bought this about 2-3 months ago. Worked great at first...then, about 3 weeks ago, Hulu stopped working properly. We looked online, followed forum advice, did the troubleshooting, etc., and couldn't find a fix that lasted more than a day. This is not a problem Hulu (which, admittedly, has its own issues), as we're still able to use Hulu via laptop.Now, today, Netflix isn't working on the Fire stick, either. Just checked the Amazon user forum and it looks like this is a common problem without a real solution. Most people said they had to call Amazon customer service and argue with them until they sent a replacement. Frankly, I'm not up for this, especially for a product that seems to have multiple problems.Overall, the Amazon Fire stick is a great concept, but the execution is pretty poor.", "verified": false, "helpfulness": "0/0", "author": "E. Throesch"}, {"rating": 5.0, "review": "We did not want to purchase a video game console or HDMI monster cable to enjoy Prime streaming. Fire TV Stick went beyond my expectations! Very easy to setup up and use with the remote. I'm finally getting use of my Prime Account without the hassle of getting out the laptop and having the convenience of viewing on a large TV monitor for \"family/friend movie night\". I'm discovering new series to fall in love with every time I use it, like the Veggie Tales series for my little preschooler. Love that I can download apps to enhance the experience, for example I synced my Fire TV stick with my HBO Go account. Lastly, you can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "GloryB"}]