[{"rating": 5.0, "review": "WORKED PERFECT--EASY TO INSTALL", "verified": true, "helpfulness": "0/0", "author": "Robert Atols"}, {"rating": 2.0, "review": "Very disappointed the format for Amazon movies doesn't format to fit my screen but Netflix and Hulu does I don't find Controls Interface friendly and I will stick to my Roku", "verified": true, "helpfulness": "0/0", "author": "WILLIAM E TRIMBLE"}, {"rating": 4.0, "review": "It is too early to do an evaluation; however, my initial impressions are favorable.  Easy to install, easy to use, still evaluationing quality of videos.overall, very good", "verified": true, "helpfulness": "0/0", "author": "Jack Portenier"}, {"rating": 5.0, "review": "Very happy with my Fire TV Stick other than having to wait for it while it was out of stock.  It was easy to set up and use.  Everything I need was included in the box.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "The setup and use was easy.", "verified": true, "helpfulness": "0/0", "author": "M. Hurd"}, {"rating": 5.0, "review": "I'm going to test and install this weekend. Directions look simple and easy enough....I will update my review later after I install. I'm not a \"tech\" kind of person, but I don't see where I can't do this.*****UPDATED REVIEW 2/23/15: I installed this while my son was at our house yesterday. He was so impressed by what this little gadget could do, that I ordered one for him as a gift. This Fire TV stick is FANTASTIC! Super easy installation!As a Prime customer I now have access to ALL kinds of movies and ALL kinds of tv shows.The TV picture i'm getting while using the stick is better than what I get from my cable company TV picture!I don't know how Amazon is doing this for this price but I HIGHLY recommend you buy yourself one!AWESOMEPRODUCT!!!***", "verified": true, "helpfulness": "0/0", "author": "CM"}, {"rating": 5.0, "review": "I have had my fire stick for about a week now and I love it . It does everything it's supposed to easy to set up easy to use. I have had no problems. Areally great buy at a reasonable price. A must have for streamers and game players like myself. Not to mention with Amazon prime and my fire stick I'm saving a little over $800.00 a year on my cable bill and  free shipping is a bonus which easily pays off my Amazon Prime bill. Thanks Amazon good job.", "verified": true, "helpfulness": "0/0", "author": "shirley"}, {"rating": 5.0, "review": "Sir I want to ask, I am from Singapore, n I just bored I of ur prod, it seem not good enough for me, co's I stil need to buy or rent from Amazon. Com, when to watch movies or tv sires,", "verified": true, "helpfulness": "0/0", "author": "Kamal"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "wes"}, {"rating": 5.0, "review": "I just received my fire stick this week and I was so excited.  The setup was a piece of cake (even for someone who is not good with technical issues).  Anyway, I love the fact that I can watch shows and movies on the TV instead of my tablet - FABULOUS.  The reason for the low rating is that my fire stick keeps sticking.  When watching a show that would have had commercials, the picture will stop on one image while the sound continues on.  Last night was the worst so far.  I had to get up after EVERY ad and unplug the device from the TV and the power just to get it to \"reboot\" since there is no power button on the remote.  I hate to send it back so soon because I had to wait for it to come back in stock, but if this continues, that is exactly what I will do.  ****So glad I didn't send my fire stick back.  Hulu plus is the only thing that I have problems watching.  Everything else is perfect.  I'm changing my review to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Monica Moore"}]