[{"rating": 4.0, "review": "Needs HBO GO immediately. Chromecast is better.", "verified": true, "helpfulness": "1/1", "author": "Justin R Whaley"}, {"rating": 5.0, "review": "This little thing is awesome! Fast enough, good video quality, great price, great selection of apps... What else could you ask for?", "verified": true, "helpfulness": "0/0", "author": "Dustin Norman"}, {"rating": 1.0, "review": "I'm frustrated that when I ordered this, customers were told their Fire TV Sticks would be received towards the end of November.  I ordered it and needed to receive it within the promised time frame as I will be moving in December.  Now shipping has been updated to Monday, January 6th which is after I will have moved.  I am a big Amazon fan but it's not right to promise customers they would receive something by a certain date and time and then after the purchase, make a 2-month change to that.  Maybe the bright side is that some of the bugs can be fixed before mine in sent?  Or maybe I can cancel?  Always a bright side.", "verified": true, "helpfulness": "1/3", "author": "Amy"}, {"rating": 4.0, "review": "The setup was easy, although I haven't figured out the voice remote yet (I'm in the middle of finals at college - no time). My roommates and I watched two movies with it and they worked well.  But...no HBO GO appears to be available...perhaps I haven't figured out how to load it or something...(sigh)...after finals I'll take more time with it.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 4.0, "review": "Pretty nice little device.  I have a bunch of similar products (Roku, Chromecast, Google TV Box).  Each has its' own pros and cons.  The Fire TV stick is great for Prime (as should be expected).  Using other apps is about as easy as any other device.  The Roku wins in terms of number of apps, but for the apps I use (Prime Video, Netflix, PBS Kids) the Fire works well.  I wish it supported Hulu (as opposed to Hulu Plus), but I'm not sure any of the streaming players support that.  I haven't used the Android app, but I like the simple remote (I like it more than the app-based chromecast interface and the remote on the Google TV box).  Just enough buttons to do what you need and to make it easy to use in an unlit room.", "verified": true, "helpfulness": "1/1", "author": "dave"}, {"rating": 5.0, "review": "Have had it for a couple weeks, really like it, glad it came with Plex installed so we didn't have to sideload an app for streaming. Only hang up we've found is that it can't/won't stream 5.1 channel audio from a DLNA source. Interface is really intuitive and easy to use. Hasn't hung on us once or needed a reboot at all.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Foote"}, {"rating": 5.0, "review": "The fire stick was very easy to program to my TV and has performed as stated. What more can one ask?The price was right.", "verified": true, "helpfulness": "0/0", "author": "Nickie Kirk"}, {"rating": 5.0, "review": "Super easy to set up. After 5 minutes I was watching the intro video on it. I had no problems watching any of my Prime stuff and Netflix was quick and easy to set up and use. Now I don't have to use the wii in the living room to watch the stuff my family watches. The only thing is my tv's usb port wasn't strong enough to power it so I did have to plug it in. It happens, that's more on my tv than the fire stick though.", "verified": true, "helpfulness": "0/0", "author": "Rose D"}, {"rating": 5.0, "review": "This was so easy to set up even a middle aged woman with a little computer knowledge can do it.As said in previous reviews you need the password for your router/modem for wifi and it will set itself up.All the choices for programs you see on your computer you will now see on your TV screen.I purchased this when it was on a two day sale for $19. and I figured what the heck, but at  $39. it's stilla bargain.", "verified": true, "helpfulness": "0/0", "author": "Frugal Shopper"}, {"rating": 5.0, "review": "Love it!  Works great giving you a cool new navigation  interface. I even take it with me on trips, giving me the ability to watch my Amazon and Netflix shows. I have found that you can even use some TV remotes to navigate the fire. Much better than the Roku or your Blu-Ray player. This would make an excellent gift for family and friends.", "verified": true, "helpfulness": "0/0", "author": "Rosco"}]