[{"rating": 4.0, "review": "I think it is going work real well for me! And the family!", "verified": true, "helpfulness": "0/0", "author": "Pat28"}, {"rating": 3.0, "review": "It is nice when it works but it freezes up a lot - particularly using the slingbox player app - and is frustrating to be in the middle of a program and have it quit.", "verified": true, "helpfulness": "0/0", "author": "pcs \"Pcs\""}, {"rating": 5.0, "review": "Super easy to install.loved it.", "verified": true, "helpfulness": "0/0", "author": "Iris"}, {"rating": 5.0, "review": "Have two smart tvs , I like the fire stick better because it is easier to use and the setup is a no brainer. I will not buy another smart tv , only a regular one and add the fire stick to make a smart tv. I'm very happy with the fire stick's performance and ease of set up.", "verified": true, "helpfulness": "0/0", "author": "TomTom213"}, {"rating": 3.0, "review": "Interface not nearly as intuitive as Roku 3.  Video seems to stutter at times (I have never had this problem with a Roku3).  Other than that it works just like any other video streaming device.", "verified": true, "helpfulness": "0/0", "author": "J. Price"}, {"rating": 5.0, "review": "Excellent work's fastest streaming yet", "verified": true, "helpfulness": "0/0", "author": "Linda Fry"}, {"rating": 2.0, "review": "uses way too much data. need a way to control data usage like Netflix has", "verified": true, "helpfulness": "0/0", "author": "Terry Howell"}, {"rating": 4.0, "review": "Okay, so apparently many people have had difficulty getting their Fire Stick to work.  I did too and I am a senior citizen.  However, I remained undaunted and figured that since my Panasonic Viera was purchased in 2009, prior to when streaming devices like the Fire Stick were invented, I had to somehow figure out how to make the TV recognize the device.  I got out my manual for the TV and realized that what I needed to do was to be able to label the HDMI-2 outlet where the Fire Stick was plugged in as a device--it couldn't be a streaming device because that wasn't listed as one of the options.  So I went to set-up and just selected HDMI-2 and picked one of the options (I think I selected gaming device) just to let the TV know that there was something in that HDMI-2 slot.  It worked!  The next time I turned on the TV, I went to input, selected HDMI2 and the Fire Stick HOME came up and the rest was easy.  I suspect that with a new, smart TV, none of that would have been necessary.  I watched House of Cards and knew that I had made a good choice!  If I never use the Fire Stick for anything else, just being able to see this Netflix series on a 55\" screen made the purchase worthwhile!", "verified": true, "helpfulness": "0/0", "author": "Alice S. Magrane \"AliMagrane\""}, {"rating": 5.0, "review": "Love it! So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amy Dillinger"}, {"rating": 5.0, "review": "So great. I need to get more to give as gifts.", "verified": true, "helpfulness": "0/0", "author": "chris white"}]