[{"rating": 5.0, "review": "Great device, it made me rethink my cable package.", "verified": true, "helpfulness": "0/0", "author": "Jeffery W. Mitchell"}, {"rating": 1.0, "review": "Not work instant video in argentina or other place than usa..where do you inform in your advertisment...disgusted", "verified": true, "helpfulness": "0/0", "author": "Nicolas Mantelli"}, {"rating": 5.0, "review": "Love it. Bought it for myself, but my husband took it downstairs and liked it so much he says I can't have it back. Will get another one for my TV upstairs. I'm a little worried about our internet streaming 2 shows at the same time. That is our internet provider though, the fire stick could do it with no problem.", "verified": true, "helpfulness": "0/0", "author": "Alicia M."}, {"rating": 1.0, "review": "Buyer Beware! I am very unhappy with the level of Customer Service I have received regarding a problem with my Fire Stick.  I started with online chat, and after being passed through 3 different agents, I was then told I needed to get on a phone call.After I spent 10 minutes on the phone describing my problems with the Fire Stick  asking for a replacement under warranty, I was told I needed to be passed on to a different tech support individual who would help me.  That agent received incorrect information from the prior agent regarding my problem which meant I had to explain once again and continually repeat all the trouble shooting efforts I had made.My fire stick keeps losing the internet connection. The agent tried to tell me it was my bandwidth - however that would not explain why the fire stick had worked perfectly for 10 months and then started giving me problems 3 days ago.  The lack of understanding and empowerment from the agents is astounding. We're talking about a product that likely costs Amazon $5 to produce - and apparently it's not possible to send a loyal Prime customer a replacement rather than make me spend more than 30 minutes repeating the same information over and over again.After threatening to cancel my Prime membership, and spending a total of 45 minutes trying to resolve this, the agent finally said she would send a replacement Fire Stick. I don't know why it takes this level of pain to get support from Amazon that supposedly prides itself on customer service.", "verified": true, "helpfulness": "1/1", "author": "Marilyn30041"}, {"rating": 5.0, "review": "Love it! After using a Wii for years - trying to get a wobbly hand on exactly the right spot to do anything - the Fire TV Stick is heaven! Very easy set up too!", "verified": true, "helpfulness": "1/1", "author": "A. C. Plymale"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "1/1", "author": "heechul kim"}, {"rating": 5.0, "review": "i'm semi-illiterate when it comes to contemporary tech/ my son mentioned this product ... it's a very reasonably priced gateway bdevice that is quite easy to use ... glad i got it !", "verified": true, "helpfulness": "1/1", "author": "j publik"}, {"rating": 5.0, "review": "so far so good! Easy to install, up and running in seconds. VERY fast (compared to our admittedly ancient roku). GREAT picture quality. The only problem has been with the NBC News App, which would also be great if it didn't stutter. Maybe somebody will fix that. Otherwise, back to the plusses, the menu and organization and search functions are SO much easier. Overall delight!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "pretty nice and easy to install. Work great.", "verified": true, "helpfulness": "0/0", "author": "RONALD OLDOREN"}, {"rating": 5.0, "review": "Easy to set up. Simple to use. Best decision in tv programming that I've made in years.", "verified": true, "helpfulness": "0/0", "author": "Bret Kelly"}]