[{"rating": 5.0, "review": "Exceeded expectations.  Very powerful device for its size.", "verified": true, "helpfulness": "0/0", "author": "Michael H. Weinmann"}, {"rating": 5.0, "review": "I've had no problems what so ever! It works great for netflix, pandora and a lot of other things!", "verified": true, "helpfulness": "0/0", "author": "Kk"}, {"rating": 5.0, "review": "Loved everything about it", "verified": true, "helpfulness": "0/0", "author": "alan andon"}, {"rating": 1.0, "review": "Bought this for my parents hoping to give them an enjoyable and easy source of entertainment. But it has since been a nightmare. It takes a few minutes to load and once it has, it is difficult for them to navigate through prime and items to purchase. They have actually hidden the remote because if it's touched, moved or even looked at- it will switch the tv source to load the fire stick and you can't stop it. You can imagine their frustration when a show is cut off suddenly thanks to curious, tiny hands from grandbabies. And then, trying to navigate back to the cable source is just another headache they've encountered. The remote though simple, is tiny. Again a difficult obstacle with tiny hands who hide things.It is nothing spectacular and honestly I'm so disappointed. I've raved about Amazon and this was such a let down. What was meant to make life easier has subsequently given them permanent fears of turning on the television and led them to hiding remotes in drawers..Maybe we got a dud or maybe it just is not as user friendly as I had hoped.", "verified": true, "helpfulness": "0/0", "author": "Paige L. \"LP\""}, {"rating": 5.0, "review": "It was a gift. They are enjoying it.", "verified": true, "helpfulness": "0/0", "author": "susan folger"}, {"rating": 5.0, "review": "Works great.  Make sure you have a strong signal when you first love link it to your WiFi.", "verified": true, "helpfulness": "0/0", "author": "Stan R"}, {"rating": 3.0, "review": "Provided lots of entertainment but the buffering was a problem for us. Would've been a fantastic device if not for that issue.", "verified": true, "helpfulness": "1/1", "author": "kevin cronholm"}, {"rating": 1.0, "review": "Not what I was expecting. It appears most of what is shown is pay for programs. My wife and I spent about a half hour looking through the menus.We thought it would be like Netflix, which we've had for years, but no. I may be wrong, but this first blush tells me we have to go online to search for movie and programs to add to our account then we can watch them. If that's not right then we just couldn't figure it out. Help in the box instructions or in the TV service was virtually nil. Got it two weeks ago, haven't gone back to it since. Really not sure if it's worth it.", "verified": true, "helpfulness": "0/0", "author": "Wryfox"}, {"rating": 5.0, "review": "it arrived earlier than expected and works exactly like i hoped it would but if youre expecting to just plug the stick in your tv the way it is sorry youre gonna need the other items that come in the box", "verified": true, "helpfulness": "0/0", "author": "Gabbi"}, {"rating": 5.0, "review": "The setup was so easy and the media choices are fantastic! All this for such a low price! Love, love, love it!", "verified": true, "helpfulness": "0/0", "author": "Sharon Taylor"}]