[{"rating": 5.0, "review": "Is better than I expected.  Easy Easy set-up and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Nicole C."}, {"rating": 5.0, "review": "The Fire TV stick works great and easy to install!  So glad not to have to buy computer cords and hook it up the old way!", "verified": true, "helpfulness": "0/0", "author": "Teri M"}, {"rating": 4.0, "review": "nice product and nice picture.  i use it mostly to watch hulu+, netflix, and amazon prime.  the picture is very clear and it's easy to use - pretty much plug and play.  Just attach everything in (it's intuitive what plugs into what), plug this into the wall socket and TV HDMI, then connect to your wifi, add the channels you want (and username/password if applicable) and it's good to go.", "verified": true, "helpfulness": "0/0", "author": "Kid T"}, {"rating": 5.0, "review": "The Fire stick was supra singly easy to install and use.  I have amazon prime and hulu plus. I was able to install the stick and set it all up without difficulty. It already had my amazon prime loaded onto it. Now I no longer have to watch from my laptop. The Fire stick was an excellent idea and very affordable.", "verified": true, "helpfulness": "1/1", "author": "Lisa W."}, {"rating": 4.0, "review": "This is a great way to add  I your Amazon based devices. I've owned a Kindle for 3 years and adding the Fire stick allows me to stream my movies and music from any media source now.I give it 4 stars because I too have had a problem with it disconnectimg from my router.  I had 4 bars on my phone and lap top when the Fire tells me it can't find home and to check my router...When I reboot the Fire Stick it reconnects without a problem... So, yeah there's that.", "verified": true, "helpfulness": "0/0", "author": "Charles Dartt"}, {"rating": 5.0, "review": "The Fire Stick is great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Anderson \"Car Guy\""}, {"rating": 4.0, "review": "fire stick itself is great, access to various streaming services. Amazon prime, meh. if I bought a lot from Amazon the free 2-day shipping would be worth it (well that is if the USPS can get their crap together and deliver in two days). As for the Amazon streaming i found that Netflix had the same titles for no additional cost. everything I looked up was $1.99 per episode on Amazon. Since I am already a member of Netflix I decided to drop Amazon.I was also real interesting in the free photo storage, but the upload process was such a drag, and the interface is just refined. The mobile app is even worse. There is no saved presets that will allow you to view your photos in any other format then recently uploaded. The mobile app has no way to view files in a folder hierarchy. Furthermore the names of files are case sensitive \"Car\" folder is not near \"cats\" folder.", "verified": true, "helpfulness": "0/0", "author": "scubalizard"}, {"rating": 5.0, "review": "Easy set up.  So glad to have it for Amazon prime TV and movies!", "verified": true, "helpfulness": "0/0", "author": "Colleen Dallam"}, {"rating": 5.0, "review": "Awesome. Easy to connect and use right away!", "verified": true, "helpfulness": "0/0", "author": "Laura Garcia"}, {"rating": 4.0, "review": "Worked as expected and compliments the bigger Fire TV. I have this set up in the bedroom and with the iOS remote I can control both units and have all my content synced.  Not as fast as its bigger brother but good for what it does. My only wish was that it was powered through the unit itself instead of having a wall outlet.", "verified": true, "helpfulness": "0/0", "author": "Nikone Sysouchanh \"nikonesys\""}]