[{"rating": 5.0, "review": "Great product. But you can only access prime movies if you live in the USA. Unfortunately, I was not aware of this restriction.", "verified": true, "helpfulness": "0/0", "author": "SHAKA NKHOSI"}, {"rating": 1.0, "review": "This Item was miss read and a mistake ,  But Great for someone who wants to buyAnd Rent Movies", "verified": true, "helpfulness": "0/1", "author": "Carlos"}, {"rating": 5.0, "review": "I love this so glad I looked into this. Its great!!!#", "verified": true, "helpfulness": "0/0", "author": "patti jessen"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Osliris Barrios"}, {"rating": 2.0, "review": "I live in the caribbean and every options doesn't work. I guess to bad for those that lives in the caribbean !!!", "verified": true, "helpfulness": "0/0", "author": "Myko"}, {"rating": 5.0, "review": "Great product, easy to setup, simple to use...", "verified": true, "helpfulness": "0/0", "author": "Eric Halvorsen"}, {"rating": 1.0, "review": "Will not work with Netflix and continues to freeze for brief periods while watching TV.", "verified": true, "helpfulness": "1/1", "author": "Marc T"}, {"rating": 5.0, "review": "Really like this device.  Much, much faster than the built-in Samsung TV SmartHub.  Also nice UI.  Another Amazon score.", "verified": true, "helpfulness": "0/0", "author": "Greg Maravilla"}, {"rating": 4.0, "review": "Like it  a lot  It met my expectations.", "verified": true, "helpfulness": "0/0", "author": "cheryl foy"}, {"rating": 1.0, "review": "I was so excited to get this stick. We just downgraded our cable and kept our high speed internet and then purchased this stick. The first day I plugged it in I had problems. I called the help number and they did help me in getting the stick to work and to stay connected to the Internet. This worked great all day and night, the next morning....and then started having major internet issues again. It kept dropping the connection. I called Amazon and they said it was on their end and their connection seemed to be like a roller coaster. I had asked if there were others complaining of the same issue and he said yes, quite a few actually. So I am returning this and just bought the Roku 2. Love it. Haven't had one issue yet.", "verified": true, "helpfulness": "0/0", "author": "Danielle Vanallen"}]