[{"rating": 5.0, "review": "I love the firestick.  We only have a tv antenna now and wifi in the house.  We are saving over $100 a month by shutting off cable and/or satellite.  There are lots of options with firestick.", "verified": true, "helpfulness": "0/0", "author": "P. Foster"}, {"rating": 4.0, "review": "I'm reserving that last star, going with four stars initially, because I'm still exploring all the available content on my new Firestick since I've not yet had it even a week.  So far, I'm finding lots of movies and TV shows and music videos to watch, and music to listen to, as well.  The only drawback I can find thusfar is that HBOGo and ShowtimeAnytime require a subscription to a TV service in order to access them on the Firestick.  Like many people nowadays, I'm trying to cut the cable, not tie myself back to it again.  So, when will Firestick offer these now exclusive subscription services on Firestick for a fee, just like NetFlix, HuluPlus and AmazonPrime?  I'm very happy with my Firestick, otherwise, and can hardly wait to explore it further!!!  It's an amazing little gadget, opening a world of entertainment!!!", "verified": true, "helpfulness": "0/0", "author": "B. A. Davis"}, {"rating": 3.0, "review": "Hadn't had it a year, bought it at best buy and the plug almost caught fire. It was something we used daily and enjoyed, but now I'm afraid to get a new one fearing it may do the same thing.", "verified": true, "helpfulness": "0/0", "author": "Naomi"}, {"rating": 5.0, "review": "Enjoying being able to access games, movies, music, photos, videos, etc. from the TV!", "verified": true, "helpfulness": "0/0", "author": "nikigirl"}, {"rating": 2.0, "review": "Doesn't seem to work nearly as well as our roku. The wifi gets stuck a lot and lags. And a roku plugged into the same TV has no issues.", "verified": true, "helpfulness": "0/0", "author": "Charlie Scott"}, {"rating": 5.0, "review": "Love it!  It is easy to use and we always can find something to watch!", "verified": true, "helpfulness": "0/0", "author": "Lee Riordan"}, {"rating": 4.0, "review": "Easy to setup and connect.  The combining with Amazon cloud to show my videos and pictures on my TV was great. I would have given it 5 stars except the content available on Netflex streaming and Amazon Prime video is very limited.  This drawback means I won;t use the fire TV stick very much, but I don;t plan on returning it.", "verified": true, "helpfulness": "0/0", "author": "BAK \"BAK\""}, {"rating": 5.0, "review": "Great little thing, So very easy to use.  Just plug it in a go.  I had a Roku stick before and It was such a hassle to get it to work I hardly used it.  But the Fire TV Stick I used everyday!", "verified": true, "helpfulness": "0/0", "author": "Bee Gee"}, {"rating": 1.0, "review": "Had for 45 days junk stopped working. Only has 30 day return. 1 year warrenty but now jumping thru hoops to get replaced", "verified": true, "helpfulness": "0/0", "author": "kim k."}, {"rating": 5.0, "review": "Absolutely love it! Have used it almost non stop since purchasing. Very easy to install and set up.", "verified": true, "helpfulness": "0/0", "author": "KAREN A MCMAHON"}]