[{"rating": 5.0, "review": "I just received the Fire Stick today, installation was a breeze! It makes a nice addition to my Chrome cast, Roku, Raspberry Pi and Samsung onboard equivalent of these dongles. The Chrome cast is almost useless, the Roku pretty nice, works well, the Raspberry Pi rocks, works great with my home server and the Samsung thing seems cluttered. The Fire Stick on the other hand, works seamlessly. I haven't explored everything yet, but Netflix nor Amazon video have dropped out. Big problem with Roku and Samsung! So far I really like the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 5.0, "review": "After 2 days of use the Fire Stick has surpassed my expectations.  The kids have enjoyed the gaming feature, and love we can get Amazon Prime video and Netflix on the same dongle.  Totally worth the price so far.", "verified": true, "helpfulness": "0/0", "author": "Nolan P Beran"}, {"rating": 1.0, "review": "I either received bad hardware or this is incompatible with my Samsung TV.  When the Fire Stick boots I see the Amazon logo flash and then just get snow - reminds me of rabbit ears in the 80s.  That lasts for a minute then the screen resets and it starts over again.  May just be a lemon but the product is unusable - was really excited to get it and am now totally bummed.", "verified": true, "helpfulness": "1/2", "author": "Dov Zimring"}, {"rating": 4.0, "review": "I've owned a number of streaming devices and the Fire TV Stick has been the best one by far.  The user interface is intuitive and easy to use.  It is fast and responsive, unlike the frustratingly slow response from many other devices.The only flaws so far have been occasional crashes of a couple of the apps and the awkward search feature is cumbersome with the basic remote.  Well worth the money.", "verified": true, "helpfulness": "1/1", "author": "ReviewsByDeal"}, {"rating": 1.0, "review": "I can't really give this an honest evaluation because I still can't get it to connect to the wifi.  Every other product in my house (Roku, Xbox One, Sony Smart TV, Dell laptop) can all connect to my wifi but the Amazon Fire Stick can not. I'm disappointed.", "verified": true, "helpfulness": "2/4", "author": "Megan K. Pierce \"Megan\""}, {"rating": 4.0, "review": "My internet didn't connect to it and I had to unplug it several times before it ran smoothly......looking forward to many nights of shows!", "verified": true, "helpfulness": "0/1", "author": "Alan Carr"}, {"rating": 5.0, "review": " Very Very impressed with the snappyness of this thing. I had a few hiccups with getting my new flat screen tv to recognize it but after the initial update on a separate tv it worked great on all my tvs. The speed of this thing is sick, video plays great and sounds great over my surround sound. For the money this is one of those no brainers. Especially at the $19 pre order price and its even worth the full $40 price. I wish it had DLNA and gonna throw a big complaint out there. Amazon please allow the usb port on the back of the Fire TV box to play video from a flash drive or external hard drive. I make some short films and plugging it in the back to see how it looks on tv would ease my life a little. Sorry I know that has nothing to do with the stick I just had to get that out of my system. Anyways this is great! If I have any issues I'll update. Enjoy! Oh And sorry for the grainy vid. I did this for You**be and i had to downgrade the quality to meet Amazon's criteria for videos. Search Isaiah's Reviews on that one site that plays nothing but videos :) for the full HD unboxing and review.", "verified": true, "helpfulness": "1/1", "author": "Isaiah's Reviews"}, {"rating": 2.0, "review": "App collection is not so great. Mainly I wanted HBO go and plex. I couldnot find HBO go and plex was a paid app. I have not found a reason the buy Fire stick and not chrome cast. Remote is a big plus though.", "verified": true, "helpfulness": "1/5", "author": "Cerebrum \"Samit\""}, {"rating": 1.0, "review": "i preordered 2 fire sticks assuming they would be released at 40$,  they arrived at my door and from day one stores were selling these for 24$.  the value is misleading and was just used to trick people into preordering", "verified": true, "helpfulness": "1/8", "author": "josh"}, {"rating": 1.0, "review": "Setup  is so hard. Does not even allow  me to login with  amazon id.  Waste of time", "verified": true, "helpfulness": "0/1", "author": "Siri J"}]