[{"rating": 4.0, "review": "It works great when you have good bandwith.  Other then that I can't get HBO GO or Showtime Anytime becasue I'm a comcast prescriber.", "verified": true, "helpfulness": "0/0", "author": "Ryan Rosa"}, {"rating": 3.0, "review": "I enjoy the fire stick but I had hoped I would be able to mirror apps from my phone. It seems that this is only possible from the fire tablet? Also some of the apps I was hoping for are not available. Overall, it works for Netflix which was the main purpose so I guess it'll be fine.", "verified": true, "helpfulness": "0/0", "author": "Jasmine"}, {"rating": 5.0, "review": "Very pleased with Fire Stick.  Great for traveling or home use.  Very easy set up.  Would recommend over my earlier Roku.", "verified": true, "helpfulness": "0/0", "author": "budsims"}, {"rating": 4.0, "review": "Not bad. wish it had more channels. The channels it does have are pretty good ones.", "verified": true, "helpfulness": "0/0", "author": "oneduckman"}, {"rating": 5.0, "review": "Very pleased.  I have a Samsung smart tv that constantly lost its internet connection.  With the fire stick, I'm no longer having this difficulty.", "verified": true, "helpfulness": "0/0", "author": "VJA"}, {"rating": 1.0, "review": "I loved this at first, I was looking forward to it having HBOGO on it! I started watching and the first few episodes were fine, but now it takes an hour and half to watch 55 minutes of program because of the freezing!! I'm so disappointed. It freezes and buffers during prime videos I pay for as well. And my router is literally right behind the TV it is hooked up to..", "verified": true, "helpfulness": "1/1", "author": "Sarah Swadley"}, {"rating": 2.0, "review": "Extremely limited wifi range. Bought the Fire Stick on sale for $25 before Christmas 2014. Seemed to work well initially, then we moved and its faults became obvious. While the interface and content are pretty nice, the Fire Stick only effectively works within 10 ft of our wifi router, which is unfortunate, because we purchased with the intent of this device working with our bedroom TV, and had it performed as we expected, we would have bought the Fire TV for our living room. Instead, we had to move the Fire Stick to our living room to be close enough to our router to be functional and move our smart DVD player to our bedroom. In addition to extremely weak wifi, the Fire Stick processor can also be overworked and requires almost a daily hard (unplugging) reboot. On the whole, while the content is good and when it works well it's great the Fire Stick is too unreliable for me to recommend. But the Fire TV or something else, the Fire Stick is unlikely to satisfy your needs.", "verified": true, "helpfulness": "2/2", "author": "Jared J. Jones \"Jared\""}, {"rating": 1.0, "review": "not what i thought it was", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Julie A"}, {"rating": 4.0, "review": "I have a question about item, my television only has one HDMI input, and a USB input what type of adapter would you recommend ??Please reply at your earliest convenience to senahrndz31@icloud.com.Thank you", "verified": true, "helpfulness": "0/0", "author": "senahrndz33 \"Serena Hernandez\""}]