[{"rating": 5.0, "review": "The picture is clear. The set up a breeze", "verified": true, "helpfulness": "0/0", "author": "Carey Ray"}, {"rating": 2.0, "review": "At $19 for Prime Members, I just had to try it out. Unfortunately, the Fire TV Stick has a ways to go if it wants to compete with the Roku 3 or Apple TV or Google Chromecast (all of which I have). The setup was easy, but the initial software update was very slow. Software installs were quick (Netflix and Plex). The actual usage is where the Fire TV Stick falls on its face. My first test was watching a few things off my Plex server. Even SD content stopped every few seconds to re-buffer; not acceptable. On Netflix, the buffering problems went away, but on both apps the video kept picking up random horizontal lines like it was having a sync issue. Finally, the device required a re-start as the menu response dropped from immediate to around a 30 second delay per button press. Hopefully, future software updates will fix these problems, but for now the Fire TV Stick is a loser.", "verified": true, "helpfulness": "1/1", "author": "Mitchell Hamm"}, {"rating": 2.0, "review": "if it ever gets here.. Really Amazon????", "verified": true, "helpfulness": "0/3", "author": "joe01880 \"Joe\""}, {"rating": 4.0, "review": "Very nice works great, easy set up, I got it a few days ago the only problem I encounter with this stick sometimes and it happens quite often the image get stalt or freeze for a second and a very loud pitch sound comes from the tv is quiet anoying and the first time it hapened i though my tv was getting bad, then I nottice it was the memory stick, I hope this stop for happening with an update.", "verified": true, "helpfulness": "0/0", "author": "Leon Venegas \"L Venegas\""}, {"rating": 3.0, "review": "ok", "verified": true, "helpfulness": "0/1", "author": "Otis"}, {"rating": 4.0, "review": "When I ordered this, it was backordered and the Fire Stick arrived two weeks prior to the anticipated date, so thats a bonus. It was easy to install with the little dongle that comes with it to allow space for the power adapter. After connecting it to wifi and a brief update the stick was ready to use. It then played a quick introduction video. I was then able to find the apps I wanted to download to this stick (after a moment of searching entertainment for flixster). The apps were easy enough to enter passwords/activate. I can now stream tv from my \"dumb\" tv in my home office. :)Overall, super easy to install and have running. And a nice picture.I haven't had buffer issues, but it is placed in the same room and very close to the wireless router.I would give 5 stars if Amazon would add HBOGO to the available apps, but I'm sure that has more to do with the HBO/Amazon deal than anything else.I'd be happy to answer any questions you may have on this.", "verified": true, "helpfulness": "0/0", "author": "JeniAnn"}, {"rating": 5.0, "review": "Easy to install and configure. I connected to my wireless network and was streaming Netflix and Amazon Prime within 5 minutes. Works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Mark C"}, {"rating": 5.0, "review": "Love it Loveit!!!", "verified": true, "helpfulness": "0/0", "author": "JUDY LELAND"}, {"rating": 1.0, "review": "So far, huge disappointment.  It requires a software update.  However, after trying to connect on 2 different networks I am unable to do so.  First network it connects to says \"Unable to Contact Amazon\".  Other says downloading software, but after 2 hours there is no progress.  So, I take it to work and try and use my network there, but I have no TV...just my computer with an HDMI port.  But, I guess it only works on TVs with HDMI.  I can't seem to connect with the computer.Seems like it would be great for me, but since it doesnt work, I have to give it one star.  Very disappointed thus far.", "verified": true, "helpfulness": "0/1", "author": "NH"}, {"rating": 5.0, "review": "It took only minutes to set this up and to begin to explore all of the available selections. I am a long time Prime member so I concentrated on this area and I am very happy with the wide variety of choices. For the price I just do not see how you can beat this.The video quality is great on my HDTV and I have seen absolutely no buffering or latency issues. My Toshiba TV has (3) HDMI ports that are all mounted on the rear of the TV.  I used the HDMI adapter/extender cable which was a great idea to include for anyone with a wall mounted TV with minimal room behind it. The cable allows you to access the HDMI port and connect the FIRE TV stick so that it lays flat against the back of the TV and avoids a potential issue.I highly recommend this to anyone who wants to vastly increase their ability to access a huge assortment of movies, TV shows, games etc....  If you are already a Prime member it is a no brainer.", "verified": true, "helpfulness": "0/0", "author": "T. Piotrowski"}]