[{"rating": 4.0, "review": "Plug it in and follow directions on the screen, even the less tech savy can use with confidence", "verified": true, "helpfulness": "1/1", "author": "L. Porter \"ancientgatekeeper\""}, {"rating": 5.0, "review": "Great features", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It is easy to setup and use. It's full potential remains in the app ecosystem.  Right now it is no Chromecast replacement, let alone an Apple TV replacement. But it has that potential, especially with voice search.", "verified": true, "helpfulness": "0/0", "author": "Allan Edwards \"Allan\""}, {"rating": 5.0, "review": "Wish I had purchased 2 of these. The Fire TV Stick was so simple to set up and we have used it with ease every day since we got it. I would recommend this for everyone.", "verified": true, "helpfulness": "0/0", "author": "B. Ruhland"}, {"rating": 5.0, "review": "This thing is slick! It's so easy to use, it make my wifi blu ray player look ancient.", "verified": true, "helpfulness": "0/0", "author": "Derek J Hackl"}, {"rating": 5.0, "review": "Works like a gem. Originally got for $19 from Amazon for being an early adopter! Love it", "verified": true, "helpfulness": "0/0", "author": "TheNESbro"}, {"rating": 4.0, "review": "The best part is that it came preconfigured to my account. There was no need to fiddle with signing in. I wish there was a customizable start screen. I'D like stricter restrictions for kids. For example, I only want them to watch a specific few channels.", "verified": true, "helpfulness": "0/0", "author": "Jode"}, {"rating": 5.0, "review": "Amazing!  Love the Fire TV Stick.  Easy set up.  Great picture quality!  Wish I had bought additional ones at intro price!", "verified": true, "helpfulness": "0/0", "author": "Animalhsz"}, {"rating": 5.0, "review": "Good stuff.  Fast, nice UI, great price.  All good.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Hill \"dJ heebee\""}, {"rating": 4.0, "review": "I love this Fire TV Stick. It is fast, easy to use and intuitive. Accessing amazon content and renting movies is a breeze (Remember when we had to go to blockbuster). My Only complaint is the lack of a VUDU app and a Google Play app. I prefer to buy movies that come with the digital copy. I ALWAYS choose amazon, or use ultraviolet with VUDU. Unfortunately the only movies I seem to be able to add to amazon is Disney. I hope they add vudu soon. I am considering switching to the Apple TV now that the price dropped to $69. I can just use airplay to watch Amazon and Vudu.", "verified": true, "helpfulness": "1/1", "author": "A. Brancheau"}]