[{"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "jlr2121"}, {"rating": 5.0, "review": "Great product! Got everything I was expecting and more", "verified": true, "helpfulness": "0/0", "author": "Katelyn Gilman"}, {"rating": 5.0, "review": "Very easy to use and set up! Works great anywhere in the house!", "verified": true, "helpfulness": "0/0", "author": "Katie McCullough"}, {"rating": 1.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "LAWRENCE R COLBY"}, {"rating": 3.0, "review": "You still need to pay extra fees every month for Netflix and movies not on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "I converted my dumb bedroom TV into a smart TV.It's used mostly with Amazon Prime, and for that it works quite well, and I've been very happy with it.  I replaced a competitor's device with the Fire Stick because the competitor's Android device wasn't very iOS friendly, and had no remote.", "verified": true, "helpfulness": "0/0", "author": "Kevin D."}, {"rating": 5.0, "review": "This was a gift to my daughter-in-law and she is extremely satisfied with it's performance", "verified": true, "helpfulness": "0/0", "author": "CrankyOne"}, {"rating": 4.0, "review": "Good quality picture for a streaming device. Way better than ps4.", "verified": true, "helpfulness": "0/0", "author": "wayne cockefair"}, {"rating": 2.0, "review": "Very easy to set up, easy user interface, good idea overall but after 10 days it just quit working, wouldn't turn on, nothing but a black screen. Back it went and plugged in the replacement..worked perfectly, here we are 3 weeks later and now it freezes while loading some things..loads others but then turns to a gray screen. Tried all the trouble shooting, nothing worked. So back it goes..2 fire sticks and barely a month later, this time I'm getting my money back and buying the Roku. For such a large company you'd think a product would work better..very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 5.0, "review": "Bombbbbbb", "verified": true, "helpfulness": "0/0", "author": "scott a mrsny"}]