[{"rating": 4.0, "review": "So far so good. Able to put XBMC on it with a little effort. Got it on sale as a Prime member, and am very pleased with how quick it is compared to my old set top box. Only wish the menu weren't so cluttery and chaotic. But that may change someday w/ firmware update.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Got my fire stick earlier than expected which is always a great thing. So far no complaints! I was using my Wii to stream so now that I have this I'm super excited to have all these already loaded on instead of me downloading. I think it's a great investment and I'm both happy with it!", "verified": true, "helpfulness": "0/0", "author": "AKANYC \"#1AKANYC\""}, {"rating": 3.0, "review": "I purchased this for $20 for their prime sale.  If you asked me, it should be worth half that.  My only desire/advantage for devices like this, is getting content up on a big screen TV.  For that alone, this is a three star and a half experience.For portability, it's not bad, all streaming sticks unfortunately have to be connected to some external power source, which is clunky in itself.  Browsing through this on a remote control alone is a clunky experience compared with using your cellphone.  Searching things by inputting letter by letter is a pain.  In this day and age, a more touchpad/touchscreen based remote with voice search would take the sting out.  I'm not a direct subscriber to Amazon Prime, so much of that content isn't free.  My primary uses for this probably will come from watching youtube,  using plex, and using miracast.If your cellphone/tablet is miracast capable, that's probably the easiest interface.  It's kind of tucked away under the system setting for some reason.  If you play game apps on your phone, however, there is some lag and it is enough to make them unplayable, in my viewpoint.  For youtube, you have to download an app from fire stick.  For the best browsing experience, it's good to use another cellphone/tablet with the youtube android app.  The youtube android app can then cast connect to the stick.  Sometimes it doesn't connect or takes over ten seconds to make the initial connection though.The plex app, which was free when I downloaded it, allows media streaming from remote Internet connected devices.  I use it to stream things from my computer.I wish there was a power/sleep button on it so I can save energy, but if you want it to sleep, you'll have to select that in the settings every time you want it to.Again, by itself, searching on the Fire Stick OS with the included remote is a pain, to input letter by letter.  The remote control doesn't even have a search button.  The native browsing process is rather tedious in terms of discovering good recommendations.  Overall, I'd give it a three star experience.", "verified": true, "helpfulness": "0/0", "author": "m"}, {"rating": 5.0, "review": "It is a plus to have extra options.", "verified": true, "helpfulness": "0/0", "author": "nita shonka"}, {"rating": 5.0, "review": "I got it $19 with promotion, during pre-order. It's really great product, even the accessories price higher than that. (remove, charger, HDMI extend cable and USB cable)", "verified": true, "helpfulness": "0/0", "author": "Element Hu"}, {"rating": 5.0, "review": "I really love it", "verified": false, "helpfulness": "0/1", "author": "lph322"}, {"rating": 5.0, "review": "Does everything we need it to. Kids can use it just fine to watch their shows.", "verified": true, "helpfulness": "0/0", "author": "Jolaine Mast"}, {"rating": 5.0, "review": "this is awesome", "verified": true, "helpfulness": "0/0", "author": "elissa"}, {"rating": 5.0, "review": "Great product, love that I can watch Netflix and Amazon Prime. Amazon doesn't try to pretend that other streaming services don't exist, which I appreciate.", "verified": true, "helpfulness": "0/0", "author": "Aaron's final word"}, {"rating": 5.0, "review": "Works great....easy to use!", "verified": true, "helpfulness": "0/0", "author": "Steven C."}]