[{"rating": 5.0, "review": "So love it", "verified": true, "helpfulness": "0/0", "author": "Sandra R."}, {"rating": 2.0, "review": "This fire stick has good apps but is the biggest piece of crap when it comes to the Internet connection capabilities. I pay for extra high speed internet with a router not more than 25 feet away and it literally NEVER works. It is the only device of 6 we have that ever has problems keeping a connection. I would not recommend getting this product until they get a firmware update to fix the problem.", "verified": true, "helpfulness": "0/0", "author": "Wade Derby"}, {"rating": 3.0, "review": "I hate that it has to be plugged into an outlet.  The device works great but the cord is a pain.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "How do I live without this? Although wish it had you tube (it doesn't for obvious reasons)", "verified": true, "helpfulness": "0/0", "author": "Earl Jackson"}, {"rating": 5.0, "review": "been using to watch movies. just wish had a owners manual with it. slowing able to figure how to use prime. quality of product great, works great looking forward using it more. Thanks Terry", "verified": true, "helpfulness": "0/0", "author": "terry p deharte"}, {"rating": 5.0, "review": "Great product for the price.  Purchased for my teenage daughter who loves it.  Easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "deb"}, {"rating": 3.0, "review": "In theory, this is a great, relatively cheap solution for streaming on your TV through Amazon, Youtube, Netflix, etc. In actuality, it has major problems with connections, buffering, and locking up. Since we purchased, we've watched several movies and tv shows, and haven't yet made it through one without a buffering issue. My internet/wifi doesn't seem to be the culprit here either as we've tested with other wifi-enabled devices including a smart TV and Wii. Fairly disappointed in the issues this has given us already, and would recommend looking elsewhere at this point.", "verified": true, "helpfulness": "0/0", "author": "RhinoDad"}, {"rating": 5.0, "review": "The Fire TV Stick is so easy to set up and use.  We replaced a blu ray player with the Fire Stick and it is so much faster.  I hadn't seen one in use before and really couldn't envision how it works.  I am not disappointed.  The Fire Stick cost about half of what we paid for the blu ray player.  Hope to replace our other two players with the Fire Stick soon.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth G. Montstream"}, {"rating": 1.0, "review": "I bought the product thinking it was something else. I'm from Peru and I can only watch YouTube and Netflix. For example, I want to subscribe to Claro Video and I can not see it. My brother has Amazon Prime and can not see anything because it is outside of USA. I cant see HBO!!! I hope this problem is solved because, for now, not recommended.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Barandiaran Castro"}, {"rating": 1.0, "review": "I received a Fire TV Stick as a gift; I don't think I would buy one even for that one person who you don't like but feel like you have to buy a gift for anyway. The interface is annoying to use and this fact is compounded by the delay between input and cursor action. The app selection is very basic and is beat by Google and Roku's devices. The only way to get any kind of value is if you have Amazon Prime, but even then your selection is limited compared to Netflix. To top everything off, this thing will barely stay on. There are times where after turning the TV on, I have to wait upwards of an hour or more for it to decide to stop constantly restarting and stay on.", "verified": true, "helpfulness": "0/1", "author": "Adam Britt"}]