[{"rating": 5.0, "review": "great price, great product and great support", "verified": true, "helpfulness": "0/0", "author": "frankfav"}, {"rating": 4.0, "review": "Works great.", "verified": false, "helpfulness": "0/0", "author": "chrisc"}, {"rating": 5.0, "review": "I travel 52 weeks a year and I wanted something better than hotel television but hotel Wifi uses a captive portal. This means you can't login to the wifi unless you have a device with a screen and a keyboard where you can enter your room number and select what internet you want to buy or get for free. This is the first device that allows that.IMPORTANT: It DID NOT work when I first got it. I tried it at home and it worked great. It even downloaded the latest software but when I got to the hotel it did not work. What is supposed to happen when you select the hotel wifi is a browser window is supposed to open so you can enter your room number and purchase internet. That did not work. I took it home and I updated the software (you have to do this at home where it can connect to the internet without the captive portal). Once I did this it worked perfectly at hotels. Don't take its word for the fact that it updated software. Force it to do that at home.Now it works great. I plug it into an HDMI port on the TV (or on the furniture console in some hotels) and then I go to networks and select the correct hotel network. You have to be patient but eventually it will open a browser window where you can enter your name and room number and select internet. Once it is working, it will go for as long as you selected internet. Some hotels make you repurchase every 24 hours but that is not a problem. This gives you access to your Prime, netflix, hbo go and other content. Way cheaper than buying hotel movies with much more selection. Hotel TV is terrible and this makes it perfect. Remember not to leave it in hotel when you check out.", "verified": true, "helpfulness": "4/4", "author": "Dimi"}, {"rating": 5.0, "review": "Love it. Easy set up. Watching movies immediately", "verified": true, "helpfulness": "0/0", "author": "Julie Neblock"}, {"rating": 5.0, "review": "I love it.  The fire tv stick is really easy to set up and there is a huge variety of movies and tv shows on Amazon Prime.  I also love being able to access my music and photos on my tv.", "verified": true, "helpfulness": "0/0", "author": "Jaylene Gonyea"}, {"rating": 5.0, "review": "It's better than cable!!!!", "verified": true, "helpfulness": "0/0", "author": "Desmond Crump"}, {"rating": 3.0, "review": "Lots of buffering with sling app.", "verified": true, "helpfulness": "0/0", "author": "Steven R. Martel"}, {"rating": 3.0, "review": "How much does this charge a month? Cause money seems to be token out my card every month. A lot at that so someone please tell me", "verified": true, "helpfulness": "0/0", "author": "Dayzha"}, {"rating": 5.0, "review": "worth every penny", "verified": true, "helpfulness": "0/0", "author": "Good Granny"}, {"rating": 5.0, "review": "Already had a fire on one TV bought the stick for the bedroom TV, they work well together.", "verified": true, "helpfulness": "0/0", "author": "Happy reader"}]