[{"rating": 3.0, "review": "Doesn't work on older TV's.  Amazon  should provide a list.", "verified": true, "helpfulness": "1/1", "author": "Jim Farnham"}, {"rating": 4.0, "review": "Overall, a great streaming device. Good interface, easy to use and set up. The fifth star is withheld because of occasional glitchiness with the interface - nothing severe, just not as fluid as other devices.", "verified": true, "helpfulness": "0/0", "author": "MVMac"}, {"rating": 5.0, "review": "Watched first movie the other day with it. Effortless to setup. Well done.", "verified": true, "helpfulness": "0/0", "author": "Mark Westmeyer"}, {"rating": 4.0, "review": "Works just like it says ... good quality easy to install ...freezes on me sometimes but other than that perfect", "verified": true, "helpfulness": "0/0", "author": "zurisaday perez"}, {"rating": 5.0, "review": "Works great! Turn your standard HD TV into a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 1.0, "review": "This product stunk.  It would not connect to amazon.com.  I thought it might have been my network, but  nothing I did worked.  Every other device I own connects without an issue, but I couldn't even get past step 1 of the set-up.  I'm returning this and will just keep using my PS3 instead.", "verified": true, "helpfulness": "2/2", "author": "King DingDong"}, {"rating": 2.0, "review": "Nice interface but the youtube app is a joke and that was my primary use case for this device.  Also not compatible with any of google's services.", "verified": true, "helpfulness": "0/0", "author": "Gary D"}, {"rating": 5.0, "review": "So far, so good with my unit. Lot's of negative reviews popping up out here since introduction.For those seeking the highest audio/video quality in home theater, go with a streaming device like this.Prior to these streaming devices, you had to use a blu-ray player to get true 1080P video resolution and 7.1 Dolby surround.Get 'em both when viewing movies and TV shows broadcasting such content. Another bonus for me is being able to play Amazon Prime music through my home theater.I can't believe the sheer volume of video and audio programming you can get for free if you are an Amazon Prime member.And for $39?  Buy it!", "verified": true, "helpfulness": "1/1", "author": "Bang-for-the-buck \"Jim\""}, {"rating": 5.0, "review": "VERY GOOD", "verified": true, "helpfulness": "0/0", "author": "MARCIO HAGIME YOSHIDA"}, {"rating": 3.0, "review": "I have amazon prime but to watch a prime movie in HD I still have to pay. When it's free on A regular smart tv. Other than that it's ok by me.", "verified": true, "helpfulness": "0/1", "author": "Marc Lijoi"}]