[{"rating": 2.0, "review": "Not sure im going to keep it....", "verified": true, "helpfulness": "0/0", "author": "Carme Colas"}, {"rating": 5.0, "review": "Totally great.  I love Amazon.", "verified": true, "helpfulness": "0/0", "author": "Mark Berger"}, {"rating": 5.0, "review": "Bought this as a gift and the recipient loves it.", "verified": true, "helpfulness": "0/0", "author": "Nic Starck \"Nic\""}, {"rating": 4.0, "review": "This item was simple to install and performs streaming services as advertised.  Occasionally locks up but readily restarts successfully.  The remote control via a smart phone application is a nice added benefit.", "verified": true, "helpfulness": "0/0", "author": "J B MacLatchie"}, {"rating": 5.0, "review": "It works wonderful.", "verified": true, "helpfulness": "0/0", "author": "Sue G"}, {"rating": 5.0, "review": "We love our fire TV stick.  Extremely user-friendly. We even love the screen savers! Exceeded our expectations!", "verified": true, "helpfulness": "0/0", "author": "trent's mommy"}, {"rating": 2.0, "review": "The fire stick was a good idea but the device does not work property if the fire stick is more then 15ft from the router.  Waste of money. I return mine within 24 hours after receiving it. Do not buy if you TV is not located next to the router.", "verified": true, "helpfulness": "0/0", "author": "Walter L Brown"}, {"rating": 5.0, "review": "Exactly what we needed.", "verified": true, "helpfulness": "0/0", "author": "J. Alexander"}, {"rating": 4.0, "review": "It's a great device you have an amazing internet connection but if your like most of us that doesn't happen. So it stops all the time if your watching a movie or you have to let it load for longer then your movie is.", "verified": true, "helpfulness": "0/0", "author": "christina clendening"}, {"rating": 5.0, "review": "so far so good, setup was easy and my amazon content loads very quick on this device.  Nice to be able to watch games on the watch espn app, just waiting for hbo to go and to be able to use in hotels which is coming and it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "Sean M"}]