[{"rating": 5.0, "review": "Easy setup and works great!  Our WiFi router is set up in our living room. We use the Fire stick in the farthest bedroom in house from WiFi, appx 75 ft away and works great.", "verified": true, "helpfulness": "0/0", "author": "Grandflanma"}, {"rating": 2.0, "review": "Too difficult to navigate. Very little free viewing, most programing had to be paid for.Wish I had bought a smart TV instead.", "verified": true, "helpfulness": "0/0", "author": "Janice M. Peffer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "corinda a graham"}, {"rating": 3.0, "review": "i like the fire tv stick but some channel don't work even when an agent try to help me solve the problem. she told me that she'll have a tech call me to help me with the error code 400-1 to make the most important channel work for my child. so i'm still waiting", "verified": true, "helpfulness": "0/0", "author": "R J"}, {"rating": 5.0, "review": "The Fire Sick was easy to install and set up. I have used it mostly every day since receiving it and found it to be easy to use and navigate through the content available. It has lived up to my expectations and everything it was advertised to do.", "verified": true, "helpfulness": "0/0", "author": "Eward F. Kipp"}, {"rating": 4.0, "review": "It does exactly what I need it to do. And I love the remote!", "verified": true, "helpfulness": "0/0", "author": "Evanna Payen"}, {"rating": 5.0, "review": "The best all around tv streaming device you can buy right now. Use agk fire app to sideload kodi and firestarter launcher & you're all setup!", "verified": true, "helpfulness": "0/0", "author": "Micah Davis"}, {"rating": 5.0, "review": "We love it.  It works better for us than Netflix did.  We had spooling problems with Netflix and while their customer service tried to fix it, we continued to have spooling problems.We also love the Prime membership offerings with Fire Stick.  Awesome.", "verified": true, "helpfulness": "0/0", "author": "Shirley A. Rudd \"sar\""}, {"rating": 5.0, "review": "I have the Google Chromcast also.  The Fire TV Stick is so much easier to work with and program.  It's really nice not to have to use my computer.  I never use the chromcast anymore.", "verified": true, "helpfulness": "0/0", "author": "Hank"}, {"rating": 4.0, "review": "The set-up was a little more difficult than expected.  All of the instructions were in German, and my fluency is more than 40 years out of date.With assistance from the help line, I was able to find the correct selection to change the language to English.  The unit works fine.", "verified": true, "helpfulness": "0/0", "author": "Charles McSorley"}]