[{"rating": 4.0, "review": "Excellent little device - I recommend it", "verified": true, "helpfulness": "0/0", "author": "Julio Palacio"}, {"rating": 5.0, "review": "Wonderful!  Easy to install and easy to use. With Amazon Prime makes it even better. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Richard Bonillas"}, {"rating": 3.0, "review": "It was worth a try but I had the same experience as some others where the stick just wasn't powerful enough to connect with our wifi. We wanted to use it in our basement; the route is on the first floor. We have a Fire TV that can connect to our wifi from the basement but the stick could not. I also wasn't trilled about having to plug the stick into a power outlet. I had thought one advantage of the stick was the clean look unencumbered by cords. The cord provided seems rather short - I would have needed an extension for it.", "verified": true, "helpfulness": "0/0", "author": "J. Gallant \"mozart32\""}, {"rating": 5.0, "review": "Very easy to install!", "verified": true, "helpfulness": "0/0", "author": "Tosha S."}, {"rating": 2.0, "review": "Our problem with this product is the audio works but the video pauses for a while and then runs real fast to catch up to dialog, this happens frequently and is very annoying and disappointing.  I should add this happens while watching Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jon C Neubauer"}, {"rating": 5.0, "review": "I wish I could I have gotten one sooner.... This thing is AWESOME", "verified": true, "helpfulness": "0/0", "author": "rottlovr"}, {"rating": 4.0, "review": "I purchased the Fire TV Stick to be able to take advantage of watching Prime Movies/TV on my television.  Very easy to set up and to use.  It comes through with a few useful apps such as Netflix and Hulu.  You can also purchase other apps from the app store to be able to watch more shows.....some are free, some are subscription.  Unfortunately, the show I was hoping to be able to watch has yet to have an app to allow me to watch it with the Fire TV Stick.  Maybe in the future.", "verified": true, "helpfulness": "0/0", "author": "Diana DeCota"}, {"rating": 5.0, "review": "Just as I ordered.  Works great and is easy install and use.", "verified": true, "helpfulness": "0/0", "author": "Becky10cats"}, {"rating": 1.0, "review": "It took me multiple hours to get this to work on my older high def TV.  Nothing wrong with the TV as the Fire Stick worked fine on my neighbor's open access network but would not work on my password protected one.  I looked at lots of posts and finally reconfigured my router, limiting some options, as was mentioned by several posts.I have never had so much trouble installing a piece of computer, wifi, etc., equipment.  It's not that I am unfamiliar with electronics as I have supervised a laser lab for decades and have been a professor of electrical engineering for a similar period of time.I will keep it for a little while now that I have invested so much time getting it to work.  If it gives me any more trouble, it is going back.", "verified": true, "helpfulness": "0/0", "author": "Susan  D"}, {"rating": 5.0, "review": "Gets the job done so far use mostly for Plex however doesn't transcode certain movies depending on the file type on server.", "verified": true, "helpfulness": "0/0", "author": "Nicks Tech Corner"}]