[{"rating": 5.0, "review": "It required one help call on my Fire HDX.  I should have know that I would have to turn on Blue Tooth.  After doing that, it worked like a charm.  I purchased it primarily to access Amazon Prime streaming TV.  It works extremely well.  Also tried mirroring my HDX to the TV and that was also seamless.", "verified": true, "helpfulness": "0/0", "author": "John W. Waterman"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it.  We first tried the Chrome one and returned it because it was too complicated and didn't work with my router.  I bought the Fire TV stick, plugged it in and it welcomed me and worked great!  I highly recommend it to anyone looking for this type of service.  I plan to use in in our camper this summer, too.  Thank you for your wonderful product!", "verified": true, "helpfulness": "0/0", "author": "Granby Grammie"}, {"rating": 5.0, "review": "I got my fire stick a few days ago.  It was very easy to setup and I have been making better use of my Amazon Prime benefit every day!!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Munson Beall \"Cheryl\""}, {"rating": 5.0, "review": "love it,easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Barbara Schatz"}, {"rating": 3.0, "review": "connected through receiver, sound not as good as I excpected.", "verified": true, "helpfulness": "0/0", "author": "Rick Mazurek"}, {"rating": 5.0, "review": "works fast and it is user friendly", "verified": true, "helpfulness": "0/0", "author": "David P. Swartz"}, {"rating": 5.0, "review": "EASY to install!!!!!!!! and- easy to use! WHY did i wait so long????!!;/)👍", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "This is the greatest technology ever!  It was so easy to set up and operate. Now I can watch all my favorite shows and movies on my TV. It is user friendly in terms the average person can understand. It is easy to navigate thru the menu and functions.  I love it!  Thinking about getting another one for the bedroom TV. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sheba"}, {"rating": 5.0, "review": "Not hard to hook up and works great. I am sorry it took me so long to get this item. SUPER", "verified": true, "helpfulness": "0/0", "author": "james caine"}]