[{"rating": 5.0, "review": "Excellent as usual.", "verified": true, "helpfulness": "0/0", "author": "Victor D. Helzer"}, {"rating": 4.0, "review": "I have question regarding monthly charges. Do we have to pay monthly charges for watching anything on Fire TV??????", "verified": false, "helpfulness": "0/2", "author": "fire fire"}, {"rating": 1.0, "review": "Still no workable Miracast.  Come on.", "verified": true, "helpfulness": "2/4", "author": "owen_meany"}, {"rating": 5.0, "review": "Love it!  Can get rid of some cable channels.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I bought this device in December 2014 and first few months it worked just fine. I didnt expect this device to be magic box but it was fine for what it was advertised to do. I mostly watched Netflix and sometimes Amazon Prime. Around March/April (3-4 months after I got the device) it started giving me serious problems. While watching a show or movie on Netflix, picture would intermittently flicker and jerk for few seconds after every couple minutes. Then the picture would just jump to current location few seconds later. And finally approximately 3/4th way though the movie, video will stop while the audio keeps going. I have to stop the movie and restart it.Amazon's customer service while usually great, has been absolutely horrendous when it comes to this device. I have had 4 calls with customer service which all pretty much went like this:Call 1: So sorry to hear about this, blah blah blah. Lets clear netflix cache, clear data and uninstall and reinstall app. You should be all set. We will call back in couple of days to check in with you. NO CALL BACK. Issues started again 2-3 days later.Call 2: I called back again a week later and was told the same script again - so sorry this is happening..BLAH BLAH BLAH. We have to go through all the steps again - clear cache again, uninstall app and reinstall. Then additionally, factory reset Fire TV stick. You should be good to go now and we will call back in couple of days to check in. NO CALL BACK. Issues start again within couple of days.Call 3: Same freakin script again - Made me go through all these steps again and told me to try hooking Fire TV Stick without the HDMI extender that came with it. This should fix the issue and we will call back to make sure there is absolutely no issues going forward. Wait for it - NO CALL BACK and issues start again.Call 4 (LAST CALL) on June 22nd - Apparently the agent transferred me to higher level support for fire tv stick or whatever they call it and the agent told me that he is opening a ticket for this and it should be fixed within 24-48 hours. And now it is 3 weeks later with same issues.Its to the point that I dont use this device - it just sits there. I didnt expect this from Amazon and have learned a lesson about never buying Amazon branded hardware, no matter how good a deal it may seem.Expected better from you Amazon.Update (7/18/2015): Oh and the audio is completely out of sync if you are watching HBO Go on Fire stick.", "verified": true, "helpfulness": "2/2", "author": "VM"}, {"rating": 5.0, "review": "These are great to have.  I have these on two of my tv sets.  I don't know how I lived without them.  I'm home all day, and watch tv while I do whatever I'm doing.  Unfortunately, cable tv is lacking sometimes.", "verified": true, "helpfulness": "0/0", "author": "sandy in lou."}, {"rating": 4.0, "review": "Great value. Easy to set up and navigate.I can display photos from Amazon cloud.", "verified": true, "helpfulness": "0/0", "author": "RCF"}, {"rating": 1.0, "review": "can't say I love it, and I hated not being able to get it for prime day. Seems like Amazon only offered 5 at the 24 dollar price, I got added to the waitlist, which was garbage, waitlist was just a way to make you feel like you were going to get the prime deal price and then evil laughter was heard from Amazon. I felt like a hamster on a wheel with a carrot in front, then the carrot got pulled away and tossed on the floor. I am sad.", "verified": false, "helpfulness": "3/18", "author": "Boy of Destiny"}, {"rating": 5.0, "review": "This is by far better than Apple TV. Very speedy. Absolutely must have.", "verified": true, "helpfulness": "0/0", "author": "sunnyngtx"}, {"rating": 3.0, "review": "Works fine, but it isn't powerful enough to run the mlb.tv application without freezing the stream every few minutes.", "verified": true, "helpfulness": "0/0", "author": "Neil"}]