[{"rating": 5.0, "review": "I love this product!!! I never even knew these streaming sticks existed, but I'm now in love. If you already have a Netflix, Hulu, or even a Amazon Prime account, but don't have a smart tv then this is really up your alley. My dad couldn't even believe that you could do so much on a device that was only a one time fee of $40. I consider myself to be very technologically savvy, but I am not very good at setting things up (I.E. computers, DVD players, game systems etc.). I tend to leave the set up process for my dad or brother to do, but this thing was so easy to set up! I had it up and running with 15 minutes after just 5 simple steps. I would totally recommend this product. :)", "verified": true, "helpfulness": "0/0", "author": "Alaina"}, {"rating": 4.0, "review": "easy to set up & use ....HOWEVER there seems to be \"internet \" issues..... error messages , have done all recommended things and it still freezes and has to be restarted.", "verified": true, "helpfulness": "0/0", "author": "H. S."}, {"rating": 2.0, "review": "Things a pos. It works okay with my internet but will just freeze during a show causing me to have to unplug it and replug it from the hdmi port when it doesnt feel like playing usually.", "verified": true, "helpfulness": "0/0", "author": "corey koss"}, {"rating": 5.0, "review": "Perfect for me. I have and use a Roku, an Apple TV, a Google Chrome and this Amazon Fire TV Stick. I'm very happy with all of them.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like it.", "verified": true, "helpfulness": "1/1", "author": "HWAN JUNG"}, {"rating": 4.0, "review": "Would 5 star it but it doesn't have good miracast and a TV dongle that cant cast your screen accurately isn't really useful for me. The apps work just like you'd expect them though!", "verified": true, "helpfulness": "0/0", "author": "V. Langer"}, {"rating": 5.0, "review": "Has worked great so far", "verified": true, "helpfulness": "0/0", "author": "William C Kuebler Jr"}, {"rating": 5.0, "review": "Fire stick is amazing. Although, I wish the control was easier to use it's a bit clumsy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "took me five minutes to get it up and running. i thought i was going to have to sign into Amazon but it is already there ready to choose what ever you want to watch. only had to sign into netflix and whatever else i have. soooo awesome.", "verified": true, "helpfulness": "0/0", "author": "amiller"}, {"rating": 5.0, "review": "Love it and very good price", "verified": true, "helpfulness": "0/0", "author": "RCAASI"}]