[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Guanin Ramirez"}, {"rating": 1.0, "review": "This is garbage. I thought it would be better and more convenient than google chrome. The streaming is terrible! I thought it was just my internet connection but all of my other devices work fine, Waste of money.", "verified": true, "helpfulness": "0/0", "author": "vanity rivera"}, {"rating": 1.0, "review": "Does not offer Livestream, one of the most used and useful centers for all kinds of programming about colleges, universities, and sports activities. Even the older models of Roku have Livestream.", "verified": true, "helpfulness": "0/0", "author": "DesertDweller"}, {"rating": 5.0, "review": "Super simple, super awesome. I have Prime, so it makes it that much better. (You should get Prime even if you don't purchase this, but especially if you do). I also have Apple TV--still a great product--but at more than twice the price of FireTV stick and because it can't just \"plug-in\" to the back of your TV like FireTV stick can--I might be biased toward the FireTV stick", "verified": true, "helpfulness": "0/0", "author": "Russell Lemmer"}, {"rating": 5.0, "review": "Love the ease and convenience of it.", "verified": true, "helpfulness": "0/0", "author": "kindle"}, {"rating": 4.0, "review": "It actually exceeded my expectations.  I just wish there were better parental controls.  You can block the whole device to stop kids from get into the system, but I wish there was a way to block certain types of content as well.", "verified": true, "helpfulness": "0/0", "author": "Urban"}, {"rating": 4.0, "review": "Took 3 levels of Amazon customer support to get the upgrade to load, but now that its working, we absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "dee faust"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "angie"}, {"rating": 5.0, "review": "love my amazon stick since day one...have had it for few months", "verified": true, "helpfulness": "0/0", "author": "Glenda"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "G. Montoya"}]