[{"rating": 5.0, "review": "Great for the price especially when you have a fire phone", "verified": true, "helpfulness": "0/0", "author": "Sasha Armstrong"}, {"rating": 3.0, "review": "Setup and functionality work fine for me, the \"always\" on functionality means my Samsung detects it every time I turn on the TV and switches to that HDMI input.  Wish there was a way to power it off, putting it to sleep makes no difference :(Not ideal design ....", "verified": true, "helpfulness": "0/0", "author": "tucker74"}, {"rating": 5.0, "review": "Its really simple to set up and was ready to go when it connected to the internet!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "its fantastic.its eaisy to use,there is alot to watch.", "verified": true, "helpfulness": "0/0", "author": "Phillip Emily"}, {"rating": 4.0, "review": "I like it for watching programming on the big screen tv. There are some issues with buffering at times but I have worked them out.", "verified": true, "helpfulness": "0/0", "author": "Gary Kensing"}, {"rating": 4.0, "review": "Took forever to arrive!", "verified": true, "helpfulness": "0/0", "author": "Heliman"}, {"rating": 5.0, "review": "I absolutely love this! It was so easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "N. Alexzander Smith"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Emily Traylor"}, {"rating": 4.0, "review": "I really love the Amazon Fire TV stick. I had connection issues with my Chromecast because supposedly it was too far away from my WIFI router (it was a whole room away), and I made the switch. The Fire TV stick runs so much faster, and the remote makes it much easier to control. It is certainly biased towards Prime, but the other apps Netflix and Hulu work perfectly well. Highly recommend this product if you're looking for an affordable streaming option.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 4.0, "review": "I really like this device. It looks slick and works well. Only negative is that navigating the interface is a little clunky.", "verified": true, "helpfulness": "0/0", "author": "Greg Small"}]