[{"rating": 5.0, "review": "Get this! I am not so hip on all this new technology, but this is so easy. In fact my 5 year old uses it alone.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "Very handy.", "verified": true, "helpfulness": "0/0", "author": "RossH"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "hima"}, {"rating": 5.0, "review": "I see why people do away with paying for cable with this device.  Sure, there are movies that you pay for, but i doubt anyone has enough time to watch so many movies that it costs more than their cable does.  Even with that, there is so much FREE programming that you don't even need to venture into the paid stuff.This is not Fire Stick's fault, but I'll put it in here for others - I ordered this with the voice control remote.  I didn't find out until after I received and used it, that you can do the voice control remote thing through just about any smart phone using the Fire stick app.  Again, not Fire sticks fault, it's mine for not doing the research earlier.  Had I known this, I wouldn't have ordered the voice control remote and just used the app.Great product though, and well worth the $39!", "verified": true, "helpfulness": "0/0", "author": "Sarge"}, {"rating": 5.0, "review": "Much better than chromcast", "verified": true, "helpfulness": "0/0", "author": "crystal"}, {"rating": 5.0, "review": "I love my firestick highly recommended to anyone with an hd tv and WiFi.", "verified": true, "helpfulness": "0/0", "author": "Debra E. Kasson"}, {"rating": 4.0, "review": "Really useful...", "verified": true, "helpfulness": "0/0", "author": "renukaradhya"}, {"rating": 5.0, "review": "I love it! Great price for a great product! Very easy to set up and navigate.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "I love it, especially since I'm already a Prime Member.  I wish I had heard about it sooner!", "verified": true, "helpfulness": "0/0", "author": "Patrick Carter"}, {"rating": 5.0, "review": "Easy to use and I love how fast the Netflix shows load compared how it worked with my old Roku.", "verified": true, "helpfulness": "0/0", "author": "Jill L. Parmenter"}]