[{"rating": 5.0, "review": "LOVE it.  Bought a Fire TV for the condo a few months ago.  Now that our home FINALLY has wi-fi  (was stuck with dial up for years), ordered the STICK.  Also have an ECHO.  Love it!  Want another one!", "verified": true, "helpfulness": "0/0", "author": "No No Nanette"}, {"rating": 1.0, "review": "My unit arrived defective.  It would not pick up a signal and would not respond to the remote control unless the control was no more than a foot away from it (and yes, I had new batteries in the control).  When I was able to get it to work, the picture was horrible and the sound was garbled.  I immediately switched over to my WII U system, loaded the Amazon app, and the picture and sound was fine.  Sending back for an exchange.  Will update my review when I receive the new one.", "verified": true, "helpfulness": "0/0", "author": "John Drago \"Macro Enthusiast\""}, {"rating": 2.0, "review": "It worked well but used up my Androids wifi hotspot data too fast. So I have to return it because I couldn't mirror it without using the wifi. Also couldn't get the app. to connect to my wifi. Lastly, many movies and shows cost money despite being a primary Amazon Prime member and the selection was not as vast as they say.", "verified": true, "helpfulness": "1/1", "author": "swbl"}, {"rating": 3.0, "review": "My tv keeps getting a blank black screen when I try streaming... Ever since I pluggged it my tv screen turns black", "verified": true, "helpfulness": "0/0", "author": "Tommy V How"}, {"rating": 5.0, "review": "Easy to install even for tech-challenged older people.  Works great so far!", "verified": true, "helpfulness": "0/0", "author": "Patricia L Austin"}, {"rating": 1.0, "review": "cool thing to have if it worked properly, it is constantly cutting out, and searching while the show is on...i am not very happy or satisfied with it so far.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Outstanding", "verified": true, "helpfulness": "0/0", "author": "Sean Snow"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Anitad"}, {"rating": 1.0, "review": "Didnt meet expectations", "verified": true, "helpfulness": "0/1", "author": "Cornbread"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "T.N. Tolbert"}]