[{"rating": 5.0, "review": "Works great!  Beautiful sharp picture. My only regret is that the remote is so small. We've lost it a number of times. I also installed the phone app for those times. We were so surprised at how easy it was to install and use, because we are not great with technology. Enjoying Prime a great deal.", "verified": true, "helpfulness": "0/0", "author": "Laury"}, {"rating": 5.0, "review": "the Wifi range on it is a bit weak, initial setup took a little bit of effort / troubleshooting, but after that, and i placed it in a room with better wifi, this thing works great, better than boxee and roku 2 for streaming video apps.", "verified": true, "helpfulness": "0/0", "author": "William Brown"}, {"rating": 4.0, "review": "Great item.  There's a slight lag at times with other devices on the network that impact performance.  Otherwise, I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Ajs2020"}, {"rating": 5.0, "review": "Love this stick think I will stick with it!!!!", "verified": true, "helpfulness": "0/0", "author": "Marvin Richard"}, {"rating": 3.0, "review": "The networking is just way too buggy.  It's constantly stuttering or locking up.  Rebooting fixes it.  I don't have any app's installed this shouldn't happen.  The networking would also just say their was unknown problems but other devices are able to connect and work just fine in the same room.", "verified": true, "helpfulness": "0/0", "author": "sportbikerr1"}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Renee Ringeisen"}, {"rating": 5.0, "review": "easy set up.  Streams without buffering.  Much better than Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jon M. Beard"}, {"rating": 5.0, "review": "Great product! I am loving this!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Bushovisky"}, {"rating": 5.0, "review": "Where to begin. First things first, I have also purchased the Fire TV box, and love that as well. Since this is much more inexpensive, it makes a great man cave or bedroom streaming device. I decided to try it out in the master bedroom to watch a little tv with the family before bed, and it does not dissapoint. It immediately starts playing once prompted, which is great. Not only does the playback start instantly, the picture quality is top notch.  The content inside is unbelievable, if you have an Amazon Prime membership and a Netflix account, you have so many options to chose from in just those two apps. The remote that comes with this Fire Stick is identical to the box set, except for the voice search, which is not missed.  I have had it in use for two weeks now, and I would definitely consider purchasing more to go along with other TVs in my house.Rating 1 to 5 (5 being 5 stars)Price-- 5Ease of setup--5Ease of navigation--5Remote-- 5Content--5Picture quality--5", "verified": true, "helpfulness": "0/0", "author": "Scott Osborne"}, {"rating": 5.0, "review": "Love this item, now i dont have to plug my laptop to my tv to watch netflix or prime.", "verified": true, "helpfulness": "0/0", "author": "B67rockbx"}]