[{"rating": 4.0, "review": "Not enough free children's movies available.", "verified": true, "helpfulness": "0/0", "author": "RVCNY"}, {"rating": 3.0, "review": "don't care for the lack of DLNA connectivity.  Easy setup, and I like the android remote app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"PalmettoSC2007\""}, {"rating": 5.0, "review": "The Fire Stick is really fast and cool. We replaced an old Roku with this on our bedroom TV and are satisfied so far. I only wish it had BYUTv so I could watch Studio C more easily on it. :)", "verified": true, "helpfulness": "0/0", "author": "Jblyne"}, {"rating": 4.0, "review": "I haven't had the Fire TV Stick for long but I am enjoying it, especially the remote.  The only reason I gave it four stars instead of five is that it isn't compatible with the network apps that allow you to watch episodes for free.  I hope at some point that it will be compatible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I LOVE IT!! Thank you...so convenient being so small. Very easy to set-up.", "verified": true, "helpfulness": "0/0", "author": "E. Villanueva"}, {"rating": 5.0, "review": "Easy set-up and smooth functions.  I love this product.  I put it on the TV in front of my Treadmill and watch great shows during my workout. Works great.", "verified": true, "helpfulness": "0/0", "author": "Clint Schutte"}, {"rating": 5.0, "review": "Pros:Very portable. We are able to easily move the Fire TV stick from our bedroom, to our weight room (for use while running on the treadmill), on vacation, etc.Access to key apps including Netflix, Pandora, Hulu, and PBS.Price: this is less than half the cost of Apple TV. If your family hasn't gone all in on Apple, this is an excellent option. The Fire TV stick performs on par with my Apple TV.Cons:Would love to have an IOS compatible remote that I can control from my iPhone. I understand this may be coming in the near future.Would love to have expanded access to TV and Movies - in particular documentaries.Would love to be able to mirror devices that operate on Microsoft and Apple platforms.", "verified": true, "helpfulness": "0/0", "author": "Acoustic Player"}, {"rating": 5.0, "review": "Most definitely worth it. I purchased when it was on super sale for Prime members. We were able to get rid of our cable because this offers a lot of awesome shows and movies for people for purchase and for free. You can play music wirelessly from your phone, access Netflix, Hulu, loads of apps and it's super easy to use. I love that it just linked up to my prime account and it was almost no work to set up. Super awesome product, very comparable to Apple TV", "verified": true, "helpfulness": "0/0", "author": "Ali"}, {"rating": 5.0, "review": "Excelent for my TV. Love it.", "verified": true, "helpfulness": "0/0", "author": "Humberto"}, {"rating": 4.0, "review": "Easy to install and use.  Even better for Prime members.  Could use a more intuitive interphase to identify Prime vs Non-Prime content for movies, tv shows and music.", "verified": true, "helpfulness": "0/0", "author": "Ernesto Echeandia"}]