[{"rating": 5.0, "review": "Very awesome, worth the money!", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "This was a gift from our daughter-in-law and son and what an absolutely wonderful gift.  It was very easy to hook and and works great.  Would highly recommend to others!", "verified": true, "helpfulness": "0/0", "author": "Collett Albright"}, {"rating": 3.0, "review": "The interface of the Fire TV/Stick is not as easy to use or fast as the Roku.  Also, I have connection problems with the Fire Stick that I have not had with any other Wi-Fi device in my home.  The Fire stick has a tendency to lose the Wi Fi signal and then has to be powered off for it to work again.  This is really the first electronic device from Amazon(I own 4 Kindles and 2 Fire Phones) that has not met or exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Antina L Bischof"}, {"rating": 5.0, "review": "Love my fire stick!", "verified": true, "helpfulness": "0/0", "author": "Michelle Renee Koons"}, {"rating": 4.0, "review": "Very pleased so far. Only issue is that there does not seem to be a Web browser", "verified": true, "helpfulness": "0/0", "author": "William cook"}, {"rating": 5.0, "review": "Worked great, as expected. Very easy intuitive installation and worked first time and so far, everytime.", "verified": true, "helpfulness": "0/0", "author": "Frank Bayno"}, {"rating": 5.0, "review": "Exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really enjoy my fire stick. I was looking for an alternative to using my ps3 for streaming netflix and this solved it over and above. I love that I can manage my music on amazon and stream it to my entertainment center. Plus if I misplace my remote I have the app on my Kindle and both my work and personal phones. Keep up the good work. I do occasionally have some lag problems but I firmly believe that has more to do with my Internet provider", "verified": true, "helpfulness": "0/0", "author": "Johnny"}, {"rating": 4.0, "review": "I love it.  I like thay all of the apps are on the device and dont have to be \"casted\".  However,  one thing that pisses me off is they want me to buy the plex app.  Ive already bought it on three Google accounts,  im not buying it a 4th time.", "verified": true, "helpfulness": "0/0", "author": "Jacob L Senn"}, {"rating": 5.0, "review": "Better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Juan P Lopez"}]