[{"rating": 1.0, "review": "Not really much to offer even with having Prime account. What a waste.", "verified": true, "helpfulness": "0/3", "author": "James Mitchell"}, {"rating": 5.0, "review": "Works well. can't wait for IOS App for remote with voice", "verified": true, "helpfulness": "0/0", "author": "christopher cioffi"}, {"rating": 5.0, "review": "I just got my Fire TV Stick today. It was hooked up and ready to go in less than 15 minutes and I am no geek. The selection of movies and TV on Prime is great and I can even get Netflix. This is an amazing piece of technology. The only slightly annoying part s that I only have one plug in on my tv so I have to disconnect my cable to use it. But I'll find a way around that I'm sure.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Horton-Newton, Author \"Elizabeth Horton-Newton, Author\""}, {"rating": 5.0, "review": "This product is a definite must if you want something small and easy to control. Most people who want the remote and something that will not take up space while playing their basic needs. This product is a definite must. Unlike the chromecast this is a product all on it's own and it doesn't require a \"cast\" in order to play stuff. It also allows amazon prime videos and netflix. The only complaint I have is the forward and rewind could be a lot better.", "verified": true, "helpfulness": "0/0", "author": "shadez82"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Flair pens"}, {"rating": 5.0, "review": "Exactly what I wanted it to be. Only downside and this isnt the products fault is that you still have to have cable to get some streaming apps such as watchespn. We were trying to get away from buying cable and this helps alot but not quite 100% there yet.", "verified": true, "helpfulness": "0/0", "author": "Cody Weed"}, {"rating": 4.0, "review": "We really like this thing.  The only drawback I find is that it is an Amazon product.  When you use \"search\" it only searches Amazon Videos.  The Roku would search all the streaming services for you.", "verified": true, "helpfulness": "1/1", "author": "siterkittyutah"}, {"rating": 5.0, "review": "I love the Amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "Amber Thimons"}, {"rating": 5.0, "review": "Absolutely love this thing. Incredibly easy to install - pure plug-and-play once you put in your WIFI password.Picture quality is phenomenal and sound is vivid and clear. The remote is very responsive. An added bonus for me was paying half price as a A Prime pre-order. Strongly recommending you try this out.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "It's fantastic!Sometimes the picture freezes", "verified": true, "helpfulness": "1/1", "author": "Dathan Byrd"}]