[{"rating": 5.0, "review": "I love it!!! It's fast, efficient, and good quality HD.", "verified": true, "helpfulness": "0/0", "author": "empera13"}, {"rating": 3.0, "review": "Funky. Way less streamlined than I had imagined due to the necessity to plug a power cable into it. The power cable blocks other HDMI ports. Very poor design. They included an adapter to work around this obvious problem, so the slick little device pictured winds up looking like a clump of wires hanging off the back of your TV.  Some of us actually make an effort to make sure our AV systems don't look like a rats nest. This looks really messy. Kludgy.  The power cube is oddly shaped and big. It is the kind that cannot be used in a power strip without blocking another outlet. Very poor design. The remote feels very flimsy, yet was difficult to open to insert the included batteries.From a design standpoint, it seems like they had gotten far along the line of design, probably to the point that they were manufacturing them and then discovered some fatal flaw that required it to be plugged in to a power source. Hence the overall kludginess. I hope I like it more, but right now I feel a little underwhelmed.", "verified": true, "helpfulness": "0/1", "author": "C. Riess \"The Jaundiced Eye\""}, {"rating": 5.0, "review": "Excellent interface, very fast & simple. However, it should be free to Prime members...", "verified": true, "helpfulness": "1/1", "author": "Careful Shopper \"GadgetGeek\""}, {"rating": 5.0, "review": "Awesome! I love that it's very fast and easy to use. For the price I got it at I have no complains. I was lucky enough to get it when they released it at a discount price for prime members. It's everything I expected and so much more. If you're having doubts I suggest you go ahead and get it. I'm sure you won't be disappointed. I read some of the negative reviews and they just seem like they are complaining for no reason whatsoever. There's nothing negative to say about this product. Period.", "verified": true, "helpfulness": "0/0", "author": "Daniel Chowdhury"}, {"rating": 1.0, "review": "Piece of crap", "verified": true, "helpfulness": "1/8", "author": "steve matthews"}, {"rating": 3.0, "review": "It's okay. I don't know what more elaborate statement to make than \"it's okay.\" We expected it would offer more free access to movies, shows and more. We strongly dislike that it needs to be plugged into an outlet and cannot be relied on simply when the Stick is inserted in the HDMI port. If we could go back we wouldn't have spend the money.", "verified": true, "helpfulness": "0/0", "author": "Molly"}, {"rating": 3.0, "review": "Have only used this device, a Chromecast, and AppleTV (with Plexconnect). Chromecast is too different imo to compare, so versus the AppleTV (which may also be an unfair comparison, but meh)Fire TV Stick:-Has more apps-Remote doesn't need line of siteApple TV-Has a \"snappier\" interface-Is organized better/simpler, dumbing it down for a better experience.Dislikes:-Outdated Plex client (which still works fine, except for it not loading the library all the time, but you just have to refresh the Plex App and they load)-Crowded interface... everywhere. Within Netflix, within Plex, on the right-skewed home screen. It's fugly.-This was a HUGE one for me. The device refused to connect to stay connected to Wifi because I have slashes in my password (not sure which kind really impacted, as I had both). So I had to change the password on all my devices, which sucked. This was true even after the firmware was applied.-Had to call support to try to figure out the wifi issue. Tier 1 was like talking to my mother about tech stuff. Tier 2 was like talking to old Dell support who was reading from a script, but just letting me try things without guidance. Neither were even close to being able to provide a solution, but they were nice.May, update this as time passes, as this review is only day one.Honestly, if Apple actually released something new, with an App store, I would just stick with that. But since they are making me feel like a chick waiting for her BF to propose, I have to explore other avenues. Can't wait forever.", "verified": true, "helpfulness": "1/2", "author": "Saul Villalobos"}, {"rating": 4.0, "review": "Very happy with this.  Wish it did a better job at telling me where else I can watch a show, for some shows I've noticed it'll tell me I can also watch it on Hulu but there are still a lot of shows where it doesn't give me any other options even though I know they are on Hulu or Netflix.  However other than that I thought setup was very simple (I did hate being forced to watch the Welcome video) and I just really like it, it's nice and fast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "As far as a cheap way to stream netflix it was pretty awesome, but if you want the absolute best streaming experience I'd say go for the fire tv or the roku 3 instead. The only thing that upset me is it dosnt come with the voice search remote you gotta buy that one separately, but you can download the fire tv app that allows you to use the voice search (which works very very well but only for amazon instant video content) for free so I guess its an even trade off. All in all if you want a reasonably priced way to watch netflix or hulu on the big screen than this is the product for you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased it on sale for $25.Very intuitive, easy setup. The streaming is fast and seamless. Great games and apps my family loved it. I was so pleased I purchased a second one two days later for the tv in the family room . Great product!", "verified": true, "helpfulness": "0/0", "author": "Sammie Wright III"}]