[{"rating": 4.0, "review": "This is my first experience of streaming to TV and I'm loving it. Amazon streaming series and movies are top notch.  Already a Netflix member, I am trying out their streaming now and am thoroughly enjoying perusing the many other content resources on the Firestick. Both my new TV and my new Fire TV Stick were installed last weekend, so my rating is based on my being new, not necessarily knowledgeable...but liking what I've experienced so far. To date, my only complaint is the infrequent buffering that seems to have increased with items viewed, but I am patient! Perhaps there is an easy solution? TWC says I have a very fast connection. If not for that inconvenience, I'd give the Firestick five stars.", "verified": true, "helpfulness": "1/1", "author": "Andrea Wilson"}, {"rating": 5.0, "review": "Awesome device.  In my opinion, better than Roku's stick or Chromcast which I will explain why later.What I like:1) More powerful, more RAM, and more space than either of the other two sticks, to my knowledge.2) Cheaper than Roku's stick, and only a few $ more than Chromecast.3) It works on android's operating system which means you can sideload android apps (like Kodi aka XBMC)4) Portability.  It's an android computer on a stick.  Sure it's not as snappy as my android tv box or a computer, but it's meant to be portable so I forgive that it's not uber powerful.5) Wifi works well from my testing.  Better than the Chromecast I had.6) Inexpensive.  When you consider the possibilities for this stick, a $39 computer is just unheard of.7) Along with XBMC, I like the dedicated Amazon video/music features.  I essentially have any entertainment at my fingertips in a $39 package.What I don't like (all of which are forgivable considering the possibilities, pricepoint and intended use):1) The apps aren't super snappy, but snappy enough for the portability tradeoff.2) Need to plug into an outlet sometimes.  I've ran into this on 3 of 4 tv's, but they were a little older, so it makes sense.  My new 4k tv had no problem powering the device through usb.3) Solely a wifi unit.  To be expected given package size, but in my dreamworld, It'd have an ethernet jack.4) Maybe a cover or carry case to protect the HDMI plug when being stored would be nice,So everything I didn't like about it is forgivable, because the possibilities for the unit with it using android more than make up for it.  I'm an android user and love the fact that I can treat it as such by putting android apps on it.  Their are a couple of different ways to do it, and you can do it with apps already on your phone and by downloading the APK files onto your computer and uploading them to the stick.  If you aren't familiar with XBMC (now called Kodi) then you're missing out.  The nice thing about this particular android stick compared to the others on the internet is that even though there are others out there that are more powerful, this one at least is mainstream and has tech support through amazon should you need it.  You can't necessarily say that for the dedicated android sticks.Though this stick doesn't have as many \"channels\" as the roku stick, XBMC trumps that in my opinion.  Any many people love the chromecast for it's tab casting thing.  You can do that with this stick too, it's called miracasting.  You might not be able to do it from your laptop or pc, but I personally don't find that feature appealling considering most of what I want to cast is on my mobile device, and I'll take the dedicated remote of the firetv stick over the forced usage of smart phone with the chromecast.This stick is not perfect.  It does have it's flaws, and some people like it, and some don't.  It all comes down to personal preference.  But I can't say I dislike this product.  It's my android tv on a stick.  I can stick it in my bag and take it on trips or like I did recently, used it at the hospital while my wife was there.  Had all my videos from home available there in the hospital room.  Couple that with all the features that Amazon preloaded onto it, and you have everything you need.  Having tried all 3, I'm vouching for this one.", "verified": true, "helpfulness": "1/1", "author": "L. Wohlscheid \"Larysius\""}, {"rating": 5.0, "review": "Amazing peice of technology! East set up and super simple to use! Will buy one for every TV in the house.  Totally worth the wait.", "verified": true, "helpfulness": "1/1", "author": "Thomas Pryde"}, {"rating": 2.0, "review": "Inconsistent experiences are my feelings on the Fire TV Stick. At times it is a champ and runs smoothly with WatchESPN, Plex and other apps. Then there are times when it constantly wants to drop my network connection or speeds suffer despite every other network device in my house running smoothly.The UI is also a bit hit or miss. I like how everything is presented with Prime movies and other apps, but at times I wish there was more advanced controls and the ability to control how much is running. The UI is a bit basic at times and it makes it frustrating.Overall when the Fire TV Stick works, it works fairly well. That said, I believe some software and firmware updates could really help it be a more consistent and wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Calvin Alexander McDermid"}, {"rating": 5.0, "review": "Love it!! Easy to use plus it's got an amazing iphone remote app. Great way to wind down after a long day and have all my favorite shows on demand and commercial free. Couldn't be happier! :)", "verified": false, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "It's has so many options still it is worth it.", "verified": true, "helpfulness": "0/0", "author": "Dale Diller"}, {"rating": 5.0, "review": "This was the best thing I have ever bought from Amazon. I can watch all my stuff on one tv, Google (via Youtube) Crackle, Flickster; everything. I am not lacking in the slightest and I am able to watch content without the annoying stuff that runs in the background on a PC from slowing down my viewing.", "verified": true, "helpfulness": "0/0", "author": "Christopher Hall"}, {"rating": 5.0, "review": "Solid", "verified": true, "helpfulness": "0/0", "author": "Ronald Johnson"}, {"rating": 2.0, "review": "Love the idea but execution is lacking...and it doesn't look like Amazon is responding to the issues.Any time I try and stream I get reloading and stumble issues, do not have the same problems with my iPad or wii.", "verified": true, "helpfulness": "0/0", "author": "bells30 \"idbella\""}, {"rating": 5.0, "review": "Excellent!!  I use it mostly for streaming movies and tv.  To this point it has worked flawlessly and I can control it from my iPhone.  It has a clear picture and no lag except for when I use Hulu.  The only thing that I don't like is that it has to stay plugged in.  I understand it and it doesn't change my opinion that this is an excellent piece of technology, but I would like it if I didn't have that extra cord.  I recommend this for everyone.  It is great!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Music"}]