[{"rating": 3.0, "review": "The Fire TV Stick is a cheap alternative to the Fire TV box, and it is obvious. I have had streaming issues since the day it arrived (kudos to Amazon for shipping it earlier than expected). My sister has a Fire TV box that is hardwired to a router and has none of the issues I have had.The Good: There are lots of apps and content to view. It has almost all of the popular services: Netflix, Hulu, Amazon Prime TV (of course). The controller is easy to use and HD supported programs work well.The Bad: Does not have VUDU, so the only way I can watch my digitally owned movies is through Flixster (which does not stream HD). You can tell when it is heavy traffic time because you cannot watch anything due to buffering every 10 seconds. During the heavy traffic times I can switch to my Playstation 3 and stream just fine.Again this is a cheap alternative to Fire TV, Apple TV, and Roku. I wish I would have spent a few more dollars and purchased a Roku so I could stream VUDU. It does work good as long as you have fast internet that does not slow down during the busy hours of the day (5-7pm, 9:30-10:30pm) when everyone is checking Facebook.I would recommend this to anyone who has fast internet and does not have a digital movie library, or needs a cheap streaming device for a kids TV. If Amazon would fix the streaming issues and get a HD VUDU app, this would be a 5-star home run.", "verified": true, "helpfulness": "0/0", "author": "Spencer W Ray"}, {"rating": 2.0, "review": "Couldn't get a connection on my Samsung DLP TV or Denon AVR Receiver even though WiFi signal is strong (Wii at same location connects to WiFi with no problem). Worked fine on Samsung Smart TV that is next to my router but that's not where it was needed.", "verified": true, "helpfulness": "0/0", "author": "mariasepa"}, {"rating": 5.0, "review": "love this. watch a movie every night.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Adams"}, {"rating": 3.0, "review": "I was disappointed because of the range of reception to my router. I could not use it in the room I wanted too because it would not pick up the internet. I have other devices that I have in the same room and have no problem with them.", "verified": true, "helpfulness": "0/0", "author": "Harold K. Sickles"}, {"rating": 4.0, "review": "Works great for us. Great for travel.  Can be a little finicky sometimes.  Overall, great product.", "verified": true, "helpfulness": "0/0", "author": "davidjames911"}, {"rating": 3.0, "review": "I rate this a 3 because its a back and forth issue. This does provide quick access to several apps that are used often. Hulu, Netflix, Pandora, to name a few. Yet i am sick and tired of having to reset the damn thing. Not only does it need to be reset, when i do reset it the parental control resets and turns off purchase protection which in turn allowed my kid to buy an episode she didnt need to have.", "verified": true, "helpfulness": "1/1", "author": "Chris Baldwin"}, {"rating": 1.0, "review": "I bought this device based on its advertisement. At present I have a setup in which a sungle HDMI capable Denon receiver is driving my LG TV. This receiver has an Apple TV connected to one of the HDMI ports, a Roku 3 box to the second, a Google chrome stick to the third and all work well at 1080p. I've connected the Fire TV stick to the remaining port only to receive a flickering image about 5 times a second. Just got off a talk with Amazon support. The person there informed me that the stick does not support a receiver and has to be hooked up directly to a TV. What a lame design decision!!! If you're anything like me suggest you avoid this device at all costs!!!!!!", "verified": true, "helpfulness": "2/3", "author": "yosgof \"yosgof\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Derell"}, {"rating": 5.0, "review": "Great for a spare room with no cable box.", "verified": true, "helpfulness": "0/0", "author": "John Rose"}, {"rating": 3.0, "review": "works fine.  Abit harder to install than the commercial shows", "verified": true, "helpfulness": "0/0", "author": "maggyjohn"}]