[{"rating": 5.0, "review": "Easy to use, just plug and go. I use it to stream amazon prime and Hulu and it's petty much the shizz.", "verified": true, "helpfulness": "0/0", "author": "William Harrison"}, {"rating": 5.0, "review": "I already had the Google Chromecast, of course they compete, but they are 2 different animals, where Chromecast allows you to \"throw\" what is on your computer to the TV screen, Firestick allows you to use your TV as a terminal to access programming on your TV, it is very nice, and I see this, or something similar becoming the future of TV...", "verified": true, "helpfulness": "0/0", "author": "J. Morgan"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ali Barriere"}, {"rating": 5.0, "review": "Received my Fire Stick from Amazon, was super excited! From opening the box, plugging it in, connecting to my internet, I was watching Netflix in a span of 5 minutes!!! Just what I was hoping for. Works great, and very simple to navigate. And the price is unbelievable! My daughter has Apple TV, which costs from $99.00 to $139.00, and my Fire stick cost me $39.99, and does everything Apple TV does! It is a \"no-brainer\"  See for yourself!", "verified": true, "helpfulness": "0/0", "author": "Catherine Edwards"}, {"rating": 3.0, "review": "Doesn't work good with MLB app", "verified": true, "helpfulness": "0/0", "author": "LUIS RODRIGUEZ"}, {"rating": 3.0, "review": "It takes more time to load some content", "verified": true, "helpfulness": "0/0", "author": "Aldo Carrillo"}, {"rating": 5.0, "review": "Works almost as good as Apple TV except that I can't view my Mac on my TV screen.", "verified": true, "helpfulness": "0/0", "author": "eclarino_one"}, {"rating": 4.0, "review": "So far so good! I'm a little disappointed at the navigation and show options but I really enjoy it overall!", "verified": true, "helpfulness": "0/0", "author": "CKFEC"}, {"rating": 4.0, "review": "Still learning about what it can do but was easy to start up and use.", "verified": true, "helpfulness": "0/0", "author": "L. Davis"}, {"rating": 1.0, "review": "I plugged in the Netflix and I could hear but  could not see the Movie. After calling with excellent Customer service It worked after and Hour. After a weekend of viewing , Monday Night it went off again. I went through the steps by myself and it would not reset. I called then another Great Customer service person. But I refuse to take an Hour to update remove software to re install. I have to keep updating .. It's so limiting Easier to watch Netflix on my lap top", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}]