[{"rating": 5.0, "review": "easy. works perfect.", "verified": true, "helpfulness": "0/1", "author": "DSL"}, {"rating": 5.0, "review": "I bought this because I have many movies and TV shows for viewing and they look very good indeed in HD.  Unlike some of the other purchasers I needed only to follow the instructions provided for a successful viewing of a movie I had that my wife had not seen. Excellent product recommend to all!", "verified": true, "helpfulness": "0/0", "author": "Jim H."}, {"rating": 5.0, "review": "Amazing equipment, easy to use, kids friendly, and i get to watch all that Amazon Prime has to offer in big screen! Love it!", "verified": true, "helpfulness": "0/0", "author": "diana"}, {"rating": 2.0, "review": "I'll consider this little thing \"beta.\" For the $19 pre-order price, it's just about a value, provided Amazon will do some updating.Pros:- Decent UI. Best option I found for streaming Amazon Prime.- Small.- Can't complain too much for the price.Cons:- UI stutters and hangs frequently.- Every -- and I mean: EVERY -- episode or movie watched will stutter for a few seconds until the buffering is done.- Ridiculously poor placement of the power-supply (microUSB) jack. Take a clue from ChromeCast! Placing it on the side will inevitably restrict where the FireTV Stick can be used without blocking the HDMI port next to it.- Remote is unreliable. I often need to press it a second or third time to wake it up.- Wifi dies regularly... video playback will stop, the device will suggest going to network settings, and not a single network will be found. Needs powercycle to recover.- No way to stream locally hosted videos without PLEX -- which costs $5 and requires their spyware/server running inside your network.- Restricted to Amazon's \"app store\" -- so if you already purchased certain apps in the proper app-store, you get to buy them all again.- No decent way to provide shortcuts on the home screen -- i.e. weather? Favorite item from the watch list?- Haphazard parental controls and no filtering capabilities at all -- yes, we can restrict purchases, but what if I want to block/hide all content rated PG-13 and above? I personally don't watch R-rated garbage either, so I don't want to see it, thankyouverymuch, and certainly not have my children exposed.One of the two stars here is value-for-money. A streaming Android Device for $20 is a decent value, even though it's lacking quite a few features. In practice, it's restricted to playing very limited content, and really just Amazon Prime Video -- and for that, it really ought to be free. The other star is unbridled optimism that Amazon will take the feedback seriously and improve this thing... and if they don't, that the major gaps in functionality will be filled by fellow app developers.Amazon -- work with Plex and make it free, or develop your own.", "verified": true, "helpfulness": "0/0", "author": "F. Lastname"}, {"rating": 5.0, "review": "The first couple days I was frustrated--it was disconnecting and I was only able to play a couple of brief videos.  Then I connected it to a TV in another room and it came to life.  So, even if it says your wifi signal is very good, it may not be good enough.  I bought an HDMI extension and put it back on the original TV and it's working great.  It's now worth seeing what Amazon Prime movies have to offer and I'm up to Season 1 Episode 5 of The Walking Dead on Netflix with no buffering or hitches.  And I'm even playing a cool pinball game on my big TV.  Very cool.", "verified": true, "helpfulness": "0/0", "author": "justmytwocents"}, {"rating": 5.0, "review": "When I received my Fire TV Stick the streaming was terrible.  Every couple of seconds it stopped to \"buffer\".  Tried turning all devices using WiFi off and it still struggled.  I rebooted the stick with no luck to better streaming.  I also added in the HDMI extender cable, again with no luck to better streaming. I called Amazon and the wait time was nonexistent. They helped me obtain an update and now it's working perfectly. I'm glad the customer service was great!  I do wish this had the Rhapsody app though.", "verified": true, "helpfulness": "1/1", "author": "Amanda Essink"}, {"rating": 5.0, "review": "Chromecast pales in comparison. The Fire TV stick Wi-Fi reception is an order of magnitude better. Dedicated remote is nice; not tied to tablet or phone.", "verified": true, "helpfulness": "0/0", "author": "tjwilliam125"}, {"rating": 5.0, "review": "This firestick is the bomb.  I was using kindle to watch movies on my tv, what a pain.  The remote is great.  There's nothing better for such a reasonable price", "verified": true, "helpfulness": "0/0", "author": "K. Condon \"KC\""}, {"rating": 3.0, "review": "works ok but doesn't have VUDU app", "verified": true, "helpfulness": "1/1", "author": "William Rogers"}, {"rating": 5.0, "review": "It can Play games too!", "verified": true, "helpfulness": "0/0", "author": "Gui Hua Li \"aaaa\""}]