[{"rating": 2.0, "review": "I expected a powerful mirroring function, which can be replaced HDMI cable when I watch a movie. Even my internet speed is not slow, the quality is different from what I expected. Is there any method to get a good quality? Other service looks good.", "verified": false, "helpfulness": "0/0", "author": "HAE S."}, {"rating": 2.0, "review": "The stick is a reasonably capable device, it has more memory than most competition and more processing power too. The price of the power is that there is no way to power the stick off of the HDMI port and an external power supply is needed. The USB cable shipped with the stick is annoyingly shorter than most TV power cables. One may need to move stuff about or to buy a longer USB cable to power up the stick. Otherwise, the hardware is quite sound.The software is bad. The UI looks like it's been designed by the engineering team - there's a list of pages on the left and content pages on the right. Navigation is not intuitive at all, clicking up and down controller buttons changes almost the entire screen; each content page shows only a few oversized tiles forcing one to scroll left and right a lot looking for anything interesting to watch. Search is Ok, it finds what I look for, but more often than not I don't know what that will be and I just want to browse what's there. Netflix had figured out browsing a long time ago, Amazon should have copied what Netflix has.Then, the stick runs apps. Some are games, some are video players. Everything that is not Amazon is an app. I haven't yet found a way to pin an app to the top of the home screen. There is a section of \"things you did recently\" at the top of the menu, but it is just too volatile to be useful. I understand that helping out Netflix is not of the highest priority for Amazon, but having to scroll down a lot and then some to the right to launch a very popular app is just wrong. Roku has figured out the layout of the home screen a long time ago. Amazon should have copied Roku.The most annoying feature so far is \"parental controls\". The way it is done has no properties of parental controls whatsoever; instead, it is a PIN that locks everything. Seriously. Purchasing is not separated from viewing, free Prime videos are locked so when a kid wants to watch Spongebob I have to go downstairs and enter the flippin' PIN. I haven't yet figured out whether the PIN unlocks a single video, or it expires after some time, but I've had to run downstairs far too many times.I am fine with a PIN locking purchases and viewing of rated contents, but the blanket locking of everything does not fit any definition of \"parental controls\". I may be insane, but to me parental controls are viewing restrictions based on time and ratings, and reporting; Amazon doesn't have either.Also, kids rarely search, they browse. Browsing's bad. Netflix gives you a screen full of tiles that you may scroll up and down left and right.There is also an issue with the service in general. Netflix splits an account between users and every Netflix app asks \"who's watching\" before it spits out recommendations. Amazon annoyingly doesn't do anything like that. Everybody gets everything, all recommendations get mixed together.Playback is OK. Sometimes there are compression or frame loss artifacts here and there, but most of the time videos play nicely. Pausing, resuming, rewinding, etc. - all work just as they're supposed to.Except for having to supply external power, all my issues with the stick are in the software. Hopefully in time Amazon will figure them out. Most likely, by that time I'll have to buy a new device. For now I'll switch back to Roku, even though mine is prone to overheating.", "verified": true, "helpfulness": "10/10", "author": "P. Karpenko"}, {"rating": 3.0, "review": "not enough free tv programs yet unless I have not found them", "verified": true, "helpfulness": "0/0", "author": "william j bump"}, {"rating": 5.0, "review": "Exactly what I ordered", "verified": true, "helpfulness": "0/0", "author": "Hkonziee"}, {"rating": 2.0, "review": "One problem after another.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this from Best Buy for 23.98. Well worth the price, I was very impressed with how seamlessly it hooked up to the TV. Can even play games with the remote that comes with it. I highly recommend this to anyone that is thinking of upgrading to a smart TV and wants to save $100 in the process. Simple, easy, and very affordable. 5 Stars+", "verified": true, "helpfulness": "0/0", "author": "Steve G"}, {"rating": 3.0, "review": "The Fire TV Stick holds a ridiculous amount of potential for what came out to a very inexpensive price (promo period). However, it feels incomplete and recommending the item weighs heavily on your intended use for it.Pros:1. Hugely inexpensive for the included specs, well built hardware and excellent packaging.2. As a consumption device for all things Amazon it's fantastic, it works well and is organized nicely for the use of the Amazon Prime features we all know and like. Best interface for Amazon Prime yet.3. Netflix and YouTube work well as expected.4. The mobile phone controller app works well5. Supports \"casting\" from certain applications6. Supports Miracast7. ADB support, you can sideload (though it'll be tucked away in the Application Manager)8. Games runCons:1. Make no mistake, this is an Amazon Prime device. The interface will remind you of this constantly, as it is very unintuitive for the use of other applications.2. Hulu is tremendously sluggish, and Plex seems to have a 50/50 functional/not functional success rate on it.3. The applications crash on a semi-regular basis.4. I have purchased a few of these for friends and family, and unfortunately my initial one seems to run into regular Wifi connectivity issues (Wifi tends to just disappear completely on it for long periods of time), I'm hoping this won't be the case for other ones I've distributed.5. The device constantly stops responding after entering my PIN to unlock it from Family/Kid mode for Settings modifications.6. It's simply a little too buggy/glitch-ridden for primetime at this point.7. Games don't run well.At the discounted rate it was introduced, you can't really go wrong with this device. However, I feel at full price, you're entirely too close to much better options.Bottomline: If you want a device to consume Amazon Prime content, this is a good one to get. If you want a device for a slew of viewing apps, then at full price, this is too close in range for other, better devices. Good at a discount, only passable at MSRP.", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 5.0, "review": "Best for the price", "verified": true, "helpfulness": "0/0", "author": "Ismael Lopez"}, {"rating": 5.0, "review": "Got more than I expected before when Amazon said I should expect it.  I must thank Staples for a lower price than Amazon's introductory price of $19.99.  Paying less that 17 dollars made my day.  The unit is so good that I will not cancel my order for the one that Amazon says that will be delivered to me after January 5th, 2015.  The Fire Stick blows Chromecast out of the water.  However, Amazon should have played fair and created an Amazon Instant Video App for the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "greymoment"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Andrew J. Keane \"Drew\""}]