[{"rating": 4.0, "review": "This is pretty good, and I no longer use my Sony blu ray player's built-in applications.  I would rather spring for the bigger version for a hard-wired ethernet connection.  My WiFi is strong, but this unit lags sometimes.", "verified": true, "helpfulness": "0/0", "author": "M. McCafferty"}, {"rating": 4.0, "review": "Does more than o thought it would", "verified": true, "helpfulness": "0/0", "author": "brad hipple"}, {"rating": 5.0, "review": "I got this at the promotional price and it's  sooo worth it.. Not sure what the current price is but I will tell you it our beats the 4 ROKU's I have in the home which have cost over $50 ea and I have 2 broken ones at the moment.. Fire stick is the way to go for your Netflix vudu hulu and all the other great channels.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worked out of the box easy setup.", "verified": true, "helpfulness": "0/0", "author": "Harold J. Morrissette"}, {"rating": 3.0, "review": "On back order till Feb.", "verified": true, "helpfulness": "1/2", "author": "Gfam"}, {"rating": 4.0, "review": "Great and easy to use.  I wish u can cast with the product.", "verified": true, "helpfulness": "0/0", "author": "Jimmy"}, {"rating": 5.0, "review": "Awesome responsiveness and includes Amazon Prime music; which is not included on any of my smart TVs or Blu-Ray players. It seems Amazon says it is not ready for travel use, but I have used it when on the road and it has worked so far.", "verified": true, "helpfulness": "0/0", "author": "SDT"}, {"rating": 5.0, "review": "Bought for my 7 year old son and he loves it. Very pleased with the product. Love that the provided remote or tablet can be used to operate the device.", "verified": true, "helpfulness": "0/0", "author": "terrance leverette"}, {"rating": 4.0, "review": "This thing it's great! Thinking about canceling my cable service now. Many of the channel apps (a&e;, history) require a log in provided by your cable provider but since my provider fits not participate they are useless to me.", "verified": true, "helpfulness": "0/0", "author": "jester1977"}, {"rating": 4.0, "review": "For over a year now, I've been using an HDMI cord to attach my 8.9\" Kindle HD to my TV so that I can watch things on a bigger screen and it's always worked for me. Until my parents bought me the Fire TV Stick for Christmas this year. IT'S ABSOLUTELY WONDERFUL. It's a smooth set up and has fantastic features. The only downside I've found so far is the small amount of games that are actually available for the TV Stick, but that's not too bad for me, since I use it primarily to stream movies and TV Shows. I wasn't expecting the Stick to be required to plug in to the wall as well as the TV, but as long as you have an extra outlet near your TV, you're golden!", "verified": true, "helpfulness": "0/0", "author": "Sarah Weisel \"theater\""}]