[{"rating": 3.0, "review": "I purchased this Fire TV Stick after reviewing all the positive and negative feedback reviews, and researching it very well from its own descriptions and great features. I got rid of Dish after they raised my bill ridiculously and really looked forward to getting my Fire TV Stick with Sling TV programming!!! When I received it, I was really jazzed with all their great features, as advertised!! The installation process is super fast and super easy, especially if you already have an account with Amazon!! Super cool, I must add!!! I was up and running in several short minutes. The picture clarity is superb!!! The audio is also first-class!!!I resisted joining Amazon Prime, because I already had accounts with Sling TV and Hulu Plus. And...they seemed to work quite well with my Wi-Fi wireless network system!! However, after seeing all that Amazon Prime has to offer...so much out there!!...I joined up. =====Now here is the reason I have given this review three stars.===== Amazon does most all of their programming with \"streaming\" and it is TOTALLY AGGRAVATING!!!!!! With all of the amount of memory storage capacity it maintains, they still \"stream\" EVERYTHING!!! They also state, that I don't have enough bandwidth with my high speed internet to handle their streaming, so my viewing will be constantly starting and stopping while viewing my TV program and movie selections!!!! One of their strongest arguments to having you purchase this equipment, is that your viewing selections would be seen immediately!!! Even if the loading process took a minute or two, I could be very happy with that!! At least, I would be watching my selections seamlessly!!!What gets me the most, is that you can only watch ONE PROGRAM AT A TIME or LISTEN TO ONE RADIO STATION AT A TIME, so why is it so hard to \"load\" that TV selection, movie, or other programming selection \"into available memory\" for seamless viewing pleasure?????!!!!! It is not rocket science, and the Fire TV Stick already has the technology built-in!! I have tried everything imaginable to make the Stick work as well as the Sling TV and Hulu Plus programming, but to no avail. I will do my best for a while longer, but may have to return the \"Stick\" after all. Sooooo Sad So Far!!!!", "verified": true, "helpfulness": "0/0", "author": "ERIC T. \"ETMAGIC\""}, {"rating": 3.0, "review": "I like it in terms of content and available apps, but half the time the damn thing won't connect to my wifi network, or it yo-yo's off and on and off and on. Makes for a frustrating experience, not being able to connect or get through a show without a \"network error\".", "verified": true, "helpfulness": "0/0", "author": "Erica Ryan \".:: a e r ! k u h ::.\""}, {"rating": 1.0, "review": "As i already had a Fire TV box, and was happy with it, I pre-ordered this as a Prime member for the discount with the intention of using it in the bedroom. Unfortunately this thing has an awful wifi connection. Even with my access point 12 feet away it will only stay connected for a few minutes. In the odd times it does work, it will constantly stop whatever I am watching to buffer. I understand it can be fixed with a firmware update......so do it.I would not recommend buying this unless they fix the issue. Purchase the Fire TV box instead; it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "C. Decker"}, {"rating": 5.0, "review": "Get you a FireStick already!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey T. Pickett"}, {"rating": 5.0, "review": "I love the Amazon Fire stick and all the benefits that comes with...I am really enjoying it", "verified": true, "helpfulness": "0/0", "author": "Linda Barnes"}, {"rating": 5.0, "review": "I love my Fire TV Stick now I can watch Amazon, Netflix etc on my tv and not my tablets anymore. It was so easy to hook up and operate. I should have purchased one a long time ago, but I did get 5 dollars off so I'm very happy about that. I would suggest this item to my friends and family.", "verified": true, "helpfulness": "0/0", "author": "Patricia Williams"}, {"rating": 2.0, "review": "The firestick does not function well.  This is my second one.  The problem is its connection to your WiFi.  It loses connection and then gives you all sorts of messages, some just that you have to ceck your network connection to Amazon services are not functioning.  This is really funny because I am sitting next to the TV and working on my computer through its WiFi connection.  I think it is a scam to tell you the truth.", "verified": true, "helpfulness": "0/1", "author": "Lilac Fox \"Lilly\""}, {"rating": 2.0, "review": "a lot of buffering", "verified": true, "helpfulness": "0/0", "author": "Patrica J. Stinson"}, {"rating": 1.0, "review": "Not highly impressed with the new fire TV Stick. The streaming is slow and very patchy. I like my Rucko. I will be switching back to it.", "verified": false, "helpfulness": "0/0", "author": "Robert Hernandez"}, {"rating": 3.0, "review": "I enjoy using it for the most part. Remote works great and easy to control from my android phone, which is pretty awesome. The only problem I have is that it lags a lot. Supposed to have more memory and processing power than all the other streaming video setups, but even with a wifi network that can handle 3 streaming systems, MMORPG gaming, and still get over 100 mb/s speed test all at the same time, the fire stick lags a ton. I am assuming that its a software problem that they need to fix. I have a chromecast and a roku and they stream just fine with no lags, but even with a \"very good\" connection and nothing else running on my network it still lags.", "verified": true, "helpfulness": "1/1", "author": "John N"}]