[{"rating": 1.0, "review": "Purchased as a replacement for the Amazon Fire TV because the Netflix app didn't correctly function. It appears to be a mistake and I will be returning the Stick as well because it isn't compatible with the Stick either. If Amazon can one day resolve the issue, I would reconsider the Stick because it is useful with having Prime. Thank god for the free shipping and returns.", "verified": true, "helpfulness": "0/0", "author": "Matthew Steltz"}, {"rating": 5.0, "review": "Love it. Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love the fire stick, it's fast and easy to use.  Setup was a breeze and I was up an going in a few minutes.", "verified": true, "helpfulness": "0/0", "author": "Tim Arvey"}, {"rating": 5.0, "review": "I picked up one of these when they were 19 bucks not knowing if I would get any use out of it.  We use it everyday now.  Easy to move from TV to TV.", "verified": true, "helpfulness": "0/0", "author": "The Spunkster"}, {"rating": 1.0, "review": "We plan on sending it back the Stick gets you nothing you can't get with out it !  Do not waste your money", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "So far so good. All I have done is stream Netflix but it's working fine.", "verified": true, "helpfulness": "0/0", "author": "Rachel Raymond"}, {"rating": 1.0, "review": "Not worth Amazons name.  A joke really!!! Took 3 weeks to deliver,  wasnt able to hook up to my first Wi-Fi and so I changed companies because I wasnt satisfied with them to begin with.  Then I got my next Wi-Fi subscriber and Iit says I dont have enough band with.  A joke really because the DVR that I have that carries the very same Netflix that I was trying to watch on Amazon works fine!!!  I want my money back and an apology for this crappy device!!!", "verified": true, "helpfulness": "0/0", "author": "Matthew Rodriguez"}, {"rating": 5.0, "review": "I LOVE, LOVE, LOVE this! I received it already  preinstalled with my info from my Amazon account and movies etc. that i have bought from them over the years. It was programed to just me:) was so easy to install and use. Takes the place of my kids game systems to watch HULU and Netflix plus loads of other apps that the game systems can't do. This is the best money I have spent in a long time! I have been telling anyone that will listen about this and that they need to get one. With every cent and then some! It is a must have for anyone that uses any online streaming for their movies.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "It is WONDERFUL.", "verified": true, "helpfulness": "0/0", "author": "linda j. lee"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Richard"}]