[{"rating": 1.0, "review": "Out of Box , It is terrible.  I cannot believe Amazon launched this CoCo item.  The device opens and the opening was good, but I was unable to select a movie on Amazon Prime or Netflix.  The remote seems to work, then not.  The device hangs, then all the presses you made take place at once.  Apple TV works flawlessly, I just wanted to be able to watch my Amazon Prime with the Fire Stick withouit hooking up my laptop.  This is junk.", "verified": true, "helpfulness": "3/14", "author": "Recce Puke"}, {"rating": 5.0, "review": "I picked up one of these at the launch day pricing and now regret not getting more than one!  Mine arrived pre-registered to our family's prime account making the initial setup painless.  Within 10 minutes I had Netflix, Plex, Pandora, Youtube, Crackle and my Prime subscription services all working in harmony and streaming content in HD and Super HD.  The price point on this is perfect even at the non-introductory rate -- my only recommendation would be to figure out a way to bundle the voice remote with this at a discount. I think that's the only thing missing from the whole package; however, it is in no way crippling the experience.Speaking of experience, the thing I was worried most about with this and the FireTV  in general, was Amazon shoving it's content down my throat throughout the user experience; and I'm shocked to say they handle their content integration tastefully.  The apps I use most are the most prominent thing on the home screen, and I can find the content I'm looking for in those nearly as easily as the Prime content. Despite clear pricing and delivery options, I never feel like I am being sold to. My opinion on this might change if and when I decide to get the voice remote or when Amazon releases the iOS voice capable remote application.", "verified": true, "helpfulness": "1/2", "author": "R. Hammons"}, {"rating": 5.0, "review": "Picture is crystal clear. The setup was simple and the menus are intuitive and simple to navigate.", "verified": true, "helpfulness": "0/1", "author": "Scott Groth"}, {"rating": 2.0, "review": "For $20 it seemed like a good complement to my Roku and Prime membership.Buy this product ONLY if you want to be a guinea pig for the Amazon QA team.Have been trying for the last 3 days to get it to work, it is stuck while \"updating tothe latest software\". Sometimes it fails while checking, sometimes during the download.Of course, other wireless devices work fine.Of course, the URL for their support is meaningless.I work in the networking area, and know that their servers are overloaded.Amazon, how about designing a product that does not fail out of the box for many of your customers?Besides deploying enough server capacity to handle the onslaught of new customers,99+% of your customers would work fine with the software that it ships with (you must haveinstalled something that works, right?), so why not run a couple of times with that software beforeattempting to update?UPDATE 11/22/2014: Finally got to working stage after 4 days, and only by trying many (>10) times,ultimately moving the device. After that, same issues (bad user interface, bad Wifi) as otherreviews. It's now mostly working as described in the product literature. I'm raising it one starafter at least getting it to work, but leaving my overall comments as warning to others.", "verified": true, "helpfulness": "8/17", "author": "U Z"}, {"rating": 3.0, "review": "The picture quality is phenomenal.I find the controller somewhat difficult and inconvenient for use.The only problem I have with this device is that every thirty or sixty seconds the device freezes (screen turns black). This happens often and the screen remains black for like 3 seconds.It happens too often.", "verified": true, "helpfulness": "6/8", "author": "guillermo"}, {"rating": 5.0, "review": "I can already tell that Amazon has got something here with this great device.  The apps are endless and if you are a PRIME member with Amazon you get a library of over 40,000 movies and TV shows FREE OF CHARGE.  This is a mush buy!  I would recommend having a Wi-Fi source close by for the best results due to being a wireless device.", "verified": true, "helpfulness": "11/13", "author": "Clay Campbell"}, {"rating": 4.0, "review": "Are you a Prime Member? Then you need to purchase, and use this!What I like:The ease of use is unlike any other smart tv set-up that I have tried. I first started just using the remote, which was easy enough because it is similar to other systems, but once I started using the app on my phone I fell in love. The app makes it so much easier to scroll through, and find things you want. It also adds the functionality of voice control, which is good if you know what you are looking for.The speed that videos play is very fast. When I use my Chromecast to stream the Hulu Plus app it takes a while to buffer, but not on this thing. Shows come on almost instantaneously.The layout of the home screen is also very intuitive, allowing you to easily scroll through tv shows, movies, games, and apps.The design is also very minimal, and plain, which for a tv dongle is a good thing. No one will notice it being back there, and it won't distract.Things that need work:There isn't much here, but I think the most important thing would be to allow more seamless movement between shows available on amazon and on Apps such as Netflix and Hulu. For example, last night I wanted to watch an episode of \"Marry Me\", and when I searched for it once, it said it was available in Hulu so I had to download the app and then search again, but the second time it didn't show up? I had to go into Hulu to find it. If Amazon could show me every option on one screen, so I can choose, and the show starts, that would make this a 5 star.Gaming, I thought I read that there are games where you could use your phone like a wii remote, but I didn't see that. I opened a game and it just was a blown up pixelated version of the regular app on my phone. I will try out more games design for the Fire TV soon.What I wish a TV dongle would do:Live TV, I am amazed that no company has figured this one out, and I know it is because of greedy cable providers, but I wish live streaming TV was an option. Even if I had to pay $5 or $10 a more for ESPN, that would be great. My internet provider doesn't let us use Watch ESPN, unless you pay for cable so that is no fun. Work on that Amazon ;). Streaming a live news source, and/or local broadcast channels, would be cool too.Update: 12/2/2014One more gripe is with the App on the phone, it lags slightly, and when you close the app it some times does not like to reconnect quickly.", "verified": true, "helpfulness": "8/11", "author": "voltzgj \"Greg\""}, {"rating": 4.0, "review": "I will start off by stating I do like this device. I found the interface to be very smooth and responsive. The extra processing power is quite apparent. I own the Fire TV Stick, Google Chrome Cast and the Roku stick and the Fire TV Stick is by far the best performance wise but for me for when looking at a device like this, content is king. This would be my break down:- If you are using Amazon as you media streaming service or you are in to playing Smart Phone style games on your TV, Fire TV Stick is the way to go.- If Google is your primary media streaming service and you don't mind using your Smart Phone as a remote, you should be looking at Chrome Cast.- If you utilize different services (Amazon, Google, Vudu, Hulu, etc.) or just want the flexibility to do so you should be looking at Roku, I find, at least for the moment, that Roku has the biggest selection of content providers.- If you are an iTunes user you need to look at Apple.", "verified": true, "helpfulness": "6/8", "author": "Ronald S."}, {"rating": 5.0, "review": "This is my first PLUGGED in hdmi kind of device. I do have a Apple TV before. But I never owned a Roku or Chrome cast so my review won't be comparing then vs Fire TV Stick.Fire TV Stick is packaged nicely, comes included with Hdmi extender, usb charger, remote, batteries for remote.Setup is easy. I am sure nobody should have issues there.Interface is very clean. Basically if you have a Prime then you are good to go. All music and movies that I have created playlists in Amazon came as it is.Games : I downloaded some games and they seemed decent. Obviously there is not a huge selection. But I heard only Fire TV Stick has any selection as other consoles doesn't even support games. To be frank I don't think I will be playing games on this anyway.Apps: all major apps like YouTube,vevo, pbs kids, Disney etc are there. It is nice to have more memory so you can install many apps. As I am from India we love watching TV from my country and there is YUPP TV app on it.Movies : Prome moviesMusic : Prime music and any purchased content from Amazon. I liked the way it shows lyrics and full page background. Makes my tv look classy.PROS :Great Device. Solid Built. More memory than others. FastCONS:I hate there is an extra cable that needs to charge the Hdmi dongle. I don't know if this is the case with all of the devices like this. It's a pain to charge it to the wall socket as my tv is on the wall and I hate cables dangling.There is lag when watching videos on pretty much every appBesides few cons which may not be the issue for a lot of people. I LOVE The ease of watching and having SOOOO much content at finger tips. Overall agreat device and for the price you don't have to think twice. Great gift for Christmas if you luckily ordered 2.", "verified": true, "helpfulness": "3/5", "author": "V. Rayi \"krishna\""}, {"rating": 5.0, "review": "Love it.  Easy to use.  My only concern is that Amazon says Plex is included, but you actually have to pay for the app.  Am I missing something?", "verified": true, "helpfulness": "1/3", "author": "No Attribution"}]