[{"rating": 1.0, "review": "I loved the Fire Stick for a short time, but the more I used it the more it crashed and was just a pain to use in general. I went through all the troubleshooting and nothing worked. Severely disappointed.", "verified": true, "helpfulness": "0/0", "author": "j.hauter"}, {"rating": 5.0, "review": "Easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Karen Greseth"}, {"rating": 5.0, "review": "Easy to set up and it was working properly in just minutes.Very flexible with a terrific range of choices.  Better than Comcast cable.", "verified": true, "helpfulness": "0/0", "author": "D. A. Weinstock \"Dr. Dave\""}, {"rating": 5.0, "review": "I love my tv stick! Definitely not disappointed.", "verified": true, "helpfulness": "0/0", "author": "Tracy Vautour"}, {"rating": 4.0, "review": "Great product, easy to set up and use...only suggestion: on the remote put arrows on circle button...took a few minutes to figure that was more than just a select button....it should be marked to indicate left, right, up down ....", "verified": false, "helpfulness": "0/0", "author": "Dave Terry"}, {"rating": 1.0, "review": "I usually never leave reviews but I felt like I had to this time. I have constantly had problems with this product which is so disappointing because I have always found Amazon products to be good quality. I have issues with it staying connected to the Internet. I have issues with loading/buffering. It's not the Internet connection because all other devices connected work fine with no problems. I have also frequented search engines for problems and found the band-aid solutions to some of these problems but it shouldn't be this way. I should be able to start up this gadget and know it's going to work and not worry that I'm going to spend the next 10-15 mins doing restarts and data clearing to make it work.When it does finally work it's great - especially for the price. But the times it works are just too infrequent for me to suggest this to other people. Especially with so many options out there.(UPDATE 05/02/2015)Well, there was a software update a couple weeks ago and now my Fire Stick is basically unusable. I have reset it. I have gone through all of the suggested procedures that had worked occasionally. Basically, it doesn't stay connected to the wifi (when all of my other items have no problems). So I now have a $40 chunk of plastic that is out of the stage where I can return it and customer service does nothing but suggest things that I have already tried. Such a disappointment Amazon.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "I can't say enough about this stick got 2 for Christmas presents for my kids they love it. Thinking about getting them and the box for all my tvs and canceling cable", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 4.0, "review": "Amazing little device. Install was easy and the navigation was equally as easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome and very easy to setup... you will not be disappointed!!!", "verified": true, "helpfulness": "0/0", "author": "Anthony Hodges"}, {"rating": 4.0, "review": "I have a fairly quick internet service. its good enough to use 8 devices over wifi, but when this was added, and all other devices wifi was off, it still kept losing the signal. Finally, after moving the t.v. and taking the extender off and just having the stick plugged in to the hdmi, it finally works properly.", "verified": true, "helpfulness": "1/1", "author": "Mary Remington"}]