[{"rating": 5.0, "review": "Easy to install, preregistered with Amazon, if only it worked, I would have been very happy.  Defective - keeps disconnecting from the router every 2 minutes.  Strong signal, no other problems in same room on other devices.  Returning for credit.** EDIT and Upgrading review rating **  ... Although what I said is true and it was returned, it appears that this is not the fault of the product.  I now wish I would have kept the Amazon Fire Stick until my situation is resolved.  I tried installing the other chrome brand of tv stick and it does the same thing, causes my DSL router to fail after I am all done setting everything up according to directions.  Not sure what the problem is as I have read many other people having the same issue, but it is a home network issue, not a problem of the FIRE STICK.  Just beware.  I give up and will live without it but I am sad to see the Fire Stick returned - I wish it would have worked at my place and it does seem friendlier to use than the chrome version.Just confused as to why so many people are commenting on their internet getting disabled when using either brand of TV stick ... calling overseas helpline for my DSL service provider for assistance made my trip to the dentist seem completely painless.Clueless and sad it didn't work.", "verified": true, "helpfulness": "2/2", "author": "Johnny B."}, {"rating": 5.0, "review": "If you have Amazon prime, this thing is a no brainer. Netflix, Pandora, Spotify all with the one devise. Very intuitive to use too. Well done.", "verified": true, "helpfulness": "0/0", "author": "Julien"}, {"rating": 5.0, "review": "We love our fire stick.  I love that you can access the amazon prime music on it and my husband and son enjoy the games on it as well.  It is compact and small and we got it for a great price.  It was perfect for our wall mounted television in the kitchen!", "verified": true, "helpfulness": "0/0", "author": "H. Patterson"}, {"rating": 5.0, "review": "Works great. Easily installed.", "verified": true, "helpfulness": "0/0", "author": "John W."}, {"rating": 5.0, "review": "amazing...even in the backwoods.", "verified": true, "helpfulness": "0/0", "author": "Amazing Things"}, {"rating": 5.0, "review": "I love these, and my family love them also, I would recommend these for everyone.", "verified": true, "helpfulness": "0/0", "author": "BOSSLADY65"}, {"rating": 4.0, "review": "No buffering,  set up on my prime account out of the box! It even comes with its own remote. The only thing I find frustrating is the fact that it requires it's own power supply.  Mind you that this is the case with all the other guys too. (IE roku, chromecast, etc)  The remote is very useful, however with a 5 year old at home I find myself using the app more often than not. This is by far the best way to make that dumb TV smart. :)", "verified": true, "helpfulness": "0/0", "author": "Joe Workman"}, {"rating": 1.0, "review": "Would not stay connected to Internet!! Really enjoyed ease of functions but one cannot enjoy a device if it has software issues!!", "verified": false, "helpfulness": "0/0", "author": "Justin Salters"}, {"rating": 4.0, "review": "Like the ability to play games, but I am spoiled by the ability to screen cast from my laptop using the Google Chromecast. Overall this may make most people happy", "verified": true, "helpfulness": "0/0", "author": "Michael Gatlin"}, {"rating": 5.0, "review": "Streams much faster than the google Chrome", "verified": true, "helpfulness": "0/0", "author": "Anibal Ramos, Jr."}]