[{"rating": 5.0, "review": "I already owned the Fire TV box with voice remote so I knew I would like the interface of the Fire TV Stick.  It plugged right into an HDMI input and a powersource.  THe next step was to connect with my network and log into Amazon & Netflix.  In 5 minutes, I was watching TV.  Such a simple concept and it is tucked away neatly behind the TV.  Remote is very intuitive and I have had no issues with the signal.  Great purchase for the price.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"gmj\""}, {"rating": 4.0, "review": "After installing, kept getting error message on Netflix (HD-CP unauthorized).  Amazon tech support said it was a Netflix problem and to call them. After calling Netflix tech support, found out that my HD TV is on the edge of being to old to stream video.  There was a firmware update for my TV. And it may or may not help with my problem.  Took ten minutes to update and I can stream videos just fine. There was no mention of this in any advertising of the Amazon stick,", "verified": true, "helpfulness": "1/1", "author": "Thomas Mares"}, {"rating": 2.0, "review": "It works well with Netflix and youtube on its own or iOS device.  However, there is no app for iOS yet to mirror the iOS device.  If you owns iphone, iPad, the only thing you can do with fire stick at this point is Netflix and youtube.  I am a bit disappointed and I won't recommend it for iOS user for now.", "verified": true, "helpfulness": "1/1", "author": "SG"}, {"rating": 1.0, "review": "Wow - really hyped up and very very very poor reception.  Have a small home and the only tv this will work on is the one that's in the same room as the router.  And instant video?  What a joke!  Sign up for hulu plus and watch all the current shows you want for $7.99 a month.  Amazon wants $1.99 an episode AFTER you pay the $99 a year fee.  Total ripoff as far as I'm concerned and would not recommend this product to anyone.  Save the $15 and buy the Chromecast - simple setup - no issues - get Hulu Plus!", "verified": true, "helpfulness": "0/0", "author": "L. Holmes"}, {"rating": 5.0, "review": "Easy set up with no problems.", "verified": true, "helpfulness": "0/0", "author": "Neil or Sharon Ullman \"Bake904\""}, {"rating": 2.0, "review": "Have trouble with the controller double clicking and it freezes quite a bit", "verified": true, "helpfulness": "0/0", "author": "Nicholas D Wilson"}, {"rating": 5.0, "review": "Great for movies, old and new TV shows. I have just begun to discover thegreat things I can do with my Amazon Fire Stick !! Love it !!", "verified": true, "helpfulness": "0/0", "author": "bing"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Lee mclain"}, {"rating": 5.0, "review": "Work's great", "verified": true, "helpfulness": "0/0", "author": "wesleystallings"}, {"rating": 5.0, "review": "Excellent streaming device, very responsive, fast browsing. For what I've used it for Amazon streaming and Netflix no issues at all!", "verified": true, "helpfulness": "0/0", "author": "Big Dawg \"Big Dawg\""}]