[{"rating": 3.0, "review": "The Fire stick is easy to setup, use and is responsive.  However, the content is very disappointing.  Even with a Prime membership (and Netflix), most TV shows and Movies cost quite a bit for rental and purchase.  I was also disappointed that access to the internet media is more challenging.  You have to download an \"app\" to Youtube for instance in order to what media there.  However, I am a member of other media sites, and I cannot access their media since they do not have an \"app.\"", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick is great. We looked at similar products before purchasing and I'm glad we chose this one!", "verified": true, "helpfulness": "0/0", "author": "Brittany Dickmeyer"}, {"rating": 4.0, "review": "It keeps freezing saying slow internet even though the internet is very fast .", "verified": true, "helpfulness": "0/0", "author": "don.snover"}, {"rating": 5.0, "review": "Great for movies!", "verified": true, "helpfulness": "0/0", "author": "Bernadette Fox"}, {"rating": 2.0, "review": "Not all services working in Kuwait for sorry :(", "verified": true, "helpfulness": "0/0", "author": "Amr Tawfiq"}, {"rating": 5.0, "review": "Its amazing! So simple, fast, and useful! I love my Fire TV Stick if you are on the fence about it... buy it. You will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Collin Blank"}, {"rating": 2.0, "review": "I pre-ordered 2 units and 6 months after I received them, they both stopped working.  Amazon is replacing both units, but they say they are only warranteed for 1 year.  If yours stops working, make sure you request a replacement before your year is up!", "verified": true, "helpfulness": "0/0", "author": "Jeannine S."}, {"rating": 2.0, "review": "Worked for a few days then lost connection. Tried to reconnect and \"no go\". Wondered when I would have problems with it since it would get very warm, almost hot. Also the remote started to jump several \"lines\" off and on. I found out that problem by reading the reviews after the fact.Anyway, Amazon is EXCELLENT taking back a defective item. Sent it back and ordered a new one which won't be available until the middle of February. Hopefully the new batch has had the problems corrected.", "verified": true, "helpfulness": "1/1", "author": "Renie Jenkins \"Ren\""}, {"rating": 5.0, "review": "Amazing! Especially good if you have Amazon prime. So easy to watch Netflix and prime tv.", "verified": true, "helpfulness": "0/0", "author": "Gina Lucchesi"}, {"rating": 5.0, "review": "Love this thing!", "verified": true, "helpfulness": "0/0", "author": "Katie Andrews"}]