[{"rating": 5.0, "review": "LOVE IT!!!!!  So easy to use, especially for an \"oldie\".  Am finally getting to watch The Wire from the beginning. The choices are endless.", "verified": true, "helpfulness": "0/0", "author": "Carol L. Smith"}, {"rating": 5.0, "review": "I absolutely love the Fire Stick!Turn your newish but not smart TV into a smart TV!I also have the Google Chrome but like the Fire Stick much more due to the remote and not having to use my phone or other device.Absolutely recommend if you want to watch your Prime movies or Net Flicks on your TV.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"She's all heart\""}, {"rating": 3.0, "review": "There have been very few items that I purchased from Amazon that I have been disappointed with. However the Fire TV Stick has been disappointing.  Give me my ROKU any day.  The Fire is harder to use and understand than my ROKU.  For instance when looking for movies the Fire Stick allows only for a single advance of movies; while the ROKU shifts a page of 5 movies at a time.", "verified": true, "helpfulness": "0/0", "author": "RICHARD SALO"}, {"rating": 5.0, "review": "I wasn't sure what this would be but when I saw that Prime members could get it months ago for $19 I figured \"what the heck, I'll get one\".  The Amazon app on my TV has been getting worse each month and I know the WiFi isn't the issue so I figured I'd spend the $19 to get an alternate way to view the Prime shows. I ordered it (in advance of the release) months ago and it arrived this month.It works really well! The remote is either Bluetooth or WiFi as you can use it behind your back. The stick is lightening fast.  You can hit the home button on the remote and the TV switches from cable to the Fire Stick and shows you the main index (at least on my Panasonic plasma).The Amazon Prime shows that I've been watching are in 1080p. I don't see the compression issues that I notice in cable and the Amazon app on my TV. This is a better solution.The set up is crazy easy as the stick is already personalized and linked to your Amazon account. The first thing it shows on the TV is \"Are you XXX? Do you want this registered to your Amazon account?\" It then goes through a quick tutorial.The remote takes a few minutes (maybe an hour) to get, but once you get it, it is so much better than anything you have used before.The only drawback is that it uses more power than the Chromecast so you have to plug it into the wall, not the USB on the TV. When using the USB all power goes off when the TV is off.  I still need the Chromecast to mirror stuff from my Android. I'm starting to understand why new TVs come with so many hdmi and usb ports. I'm already maxed out and historically I'm not that guy.", "verified": true, "helpfulness": "0/0", "author": "MichaelSJ"}, {"rating": 4.0, "review": "Works good, easy to set up. Very fast when loading a movie.", "verified": true, "helpfulness": "0/0", "author": "Steve &/or Laurie Muniz"}, {"rating": 1.0, "review": "While I have bought two of these devices and do love using them, I have to drop my rating to 1 star for a very big overlooked bug (Amazon may believe it is a feature). The only way I have found to prohibit purchases is to enable parental locks and set a PIN. This is no big deal. However, sometimes my Internet decides to be lazy and I am left with only the content on my LAN. Here's the problem; your PIN is stored in the cloud! Why? I have no idea! So, when I go to manage applications to get into Kodi (another problem that Amazon needs to fix, put Kodi in the App Store!), I'm prompted for my PIN. Due to my Internet being out, my PIN is not accepted and I can not get into my applications! Please Amazon, push an update that included local PIN recognition.", "verified": true, "helpfulness": "0/0", "author": "NothingLasts1987"}, {"rating": 2.0, "review": "Hardware seems to be fine, however software is VERY buggy, to a point of being almost unusable. Before this, I have used Roku 2, Roku Stick, and Chromecast. Roku has a great software system, however the hardware was causing some lag while using the device. Chromecast never had software issues, however it was difficult to use with a smartphone.I purchased the TV stick because it was inexpensive and also has superior specs to both Roku and Chromecast. However, software is a huge problem. Some of the issues I have encountered 1) Netflix app doesn't want to open and keeps giving me an error message. 2) Device begins to perform sluggishly after watching few Netflix episodes in a row and I am forced to do a manual restart 3) UI is designed to drive  you to Amazon Prime, so its very cluttered with Amazon's offerings, but to get to whatever you want to watch or open an app, it requires 5+ clicks. 4) Device disconnects from the router frequently, and has to be solved by restart. It's very annoying and time consuming.", "verified": true, "helpfulness": "1/2", "author": "Boris Lezaic"}, {"rating": 1.0, "review": "So frustrated. Keeps freezing, especially when watching Hulu, doesn't remember where I was in the episode or what episode I am on. Buggy and crappy. Video stutters often.", "verified": true, "helpfulness": "1/2", "author": "Lila Bonobo"}, {"rating": 4.0, "review": "Viable alternative to the fireTV. Major difference is voice search", "verified": true, "helpfulness": "0/0", "author": "Hector"}, {"rating": 5.0, "review": "easy to install and so far the family loves it", "verified": true, "helpfulness": "1/1", "author": "Audrey Spracklen"}]