[{"rating": 5.0, "review": "I love Fire Stick, great picture quality. With the remote control, it's the perfect stick", "verified": true, "helpfulness": "0/0", "author": "Angel Castillo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "niceboy718"}, {"rating": 5.0, "review": "Just what I wanted! Very easy to set up and super quick to get to playing what I'd like to see. No waiting time :) And for the price you just can't beat it! Was going to purchase Roku stick before and now that Amazon has their own we just had to try! Way cheaper and amazing quality! Can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 4.0, "review": "I feel like having prime would make this a way better experience since it seems to be geared towards improving that navigation, etc.  Overall, the games are fun.  It is easy to use.  Well organized.  Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Krissy Scott"}, {"rating": 3.0, "review": "The one Issue I have with this little devices is I want the ability to install other apps... I want to have XBMC as an option too!", "verified": true, "helpfulness": "0/1", "author": "Joshua Hatfield"}, {"rating": 5.0, "review": "I have a Chromecast, a Roku and this.  Chromecast just seems clunky to me, however it does have its advantages.  I haven't explored the Fire TV Stick and all its features yet, but I like it as much or more than the Roku already.  Plus it was already setup with my Amazon account info, pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 4.0, "review": "I have had the tv stick for about a week now.  Setup was not as easy as it should have been.  It had trouble downloading the software update.  Maybe the server was just busy.  I also had to unplug the stick from the power source to try the install again.  At that point, the stick was not recognized by the tv.  Anyway, after a few trys the update was successful.  From then on, the stick as performed flawlessly.  Love the interface, especially the separation of Amazon Prime offerings.  I would definitely recommend the Fire TV Stick.", "verified": false, "helpfulness": "0/0", "author": "Roletide"}, {"rating": 4.0, "review": "Works very well if connected to its AC adapter, would not work reliably on the TV's USB power like my Google Chromecast device has for a year. Not sure why Amazon can't get their device to run on the same power as Google can. Overall a solid device, just not happy about having to use another power line going to my TV. Android FireTV remote control app is disappointing compared to Google chromecast android app features, but the FireTV physical remote included with the FireTV does work very well.", "verified": true, "helpfulness": "1/2", "author": "Matt Florell"}, {"rating": 5.0, "review": "Extremely good value for such a practical nifty streaming device.  Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "John F. Hale"}, {"rating": 5.0, "review": "Despite the bad reviews, I don't have any issues with this device. connects to wireless with no problems and stays connected. Purchased it to ease the load off of my playstation. It's great. Menus are easy to navigate. I did connect it to the TV directly and TV  connects to my Receiver via optical sound cable. I couldn't comment on connecting it to the receiver directly since I have a older one and current set up works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Cenk N."}]