[{"rating": 5.0, "review": "This thing is amazing I want to get one for every TV in my house. Had only one issue with the picture but I was able to fix it by lowering the resolution.", "verified": true, "helpfulness": "0/0", "author": "ben nicastro"}, {"rating": 5.0, "review": "Awesome stuff. Simple to install, and even more easier to use.", "verified": true, "helpfulness": "0/0", "author": "Komail Haider"}, {"rating": 5.0, "review": "Awesome. Way better than chromecast. Got it for free by signing up for 3 months of sling tv", "verified": true, "helpfulness": "0/0", "author": "n.merritt"}, {"rating": 5.0, "review": "Very cool product! Turns your regular TV into a smart tv. Can move it around to all the tvs in the house. Download the fire stick app for your phone and it's all at your fingertips without the remote! So glad I bought this, considering dropping cable now!", "verified": true, "helpfulness": "0/0", "author": "MD,RN"}, {"rating": 4.0, "review": "A lotta bang for your buck!", "verified": true, "helpfulness": "0/0", "author": "cody tilley"}, {"rating": 5.0, "review": "This streams from my wi-fi router fast enough to watch Amazon and Netflix movies without any problem at all. I like the way the software organizes the channels and selections within each channel.Be aware that the 'stick' needs external power, so there will be a small cord running from the back of the TV (where the stick is installed) to the closest 120vac outlet.The remote is great, too. Easy to set up. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Utah Pete\""}, {"rating": 2.0, "review": "I ended up buying one but as I live in Dominican Republic amazon applications do not work for the town can only use netflix. I wonder if a vpn could work and thus enjoy my purchase to the fullest?", "verified": true, "helpfulness": "0/0", "author": "luis torres"}, {"rating": 5.0, "review": "Haven't had a chance to use it much but so far so good. Very easy to set up and easy to navigate through the menu. Anxious to use it inn my rv when \"camping\".", "verified": true, "helpfulness": "0/0", "author": "Bob Kesler"}, {"rating": 5.0, "review": "Pretty dang cool", "verified": true, "helpfulness": "0/0", "author": "cde"}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Susan Cutler"}]