[{"rating": 5.0, "review": "I have Netflix, Amazon prime, watch ESPN and HBO go. This item plugs into the hdmi port on the back of a flat screen tv. I set it up in just a couple of minutes and I'm only slightly tech savvy. It is very simple to operate. My 76 year old father is using it and he has a hard time with electronics. The best $39 ever spent. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "James Dugger"}, {"rating": 5.0, "review": "I'm enjoying the movies already.  Once I got it installed onto my television, smooth sailing.gg", "verified": true, "helpfulness": "0/0", "author": "Ginger Gore"}, {"rating": 5.0, "review": "So very easy to set up. Was viewing movies, TV shows and downloading apps in minutes. Excellent quality and responds much faster than my cable access. Hours of great viewing without the cable company hassle.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Joe Z\""}, {"rating": 4.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "brad C"}, {"rating": 5.0, "review": "We just ordered our second Fire TV stick.  This is simply the best streaming device out there for the price.  Personally I like it better than our PS3.  New apps seem to be coming out every week.  We just love it!", "verified": true, "helpfulness": "0/0", "author": "Arley"}, {"rating": 5.0, "review": "This is an excellent buy.  Easy to work and awesome movies/series - can easily recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Mossy \"Kathy\""}, {"rating": 1.0, "review": "Why do you have to buy all the good stuff?", "verified": true, "helpfulness": "0/2", "author": "Annalis"}, {"rating": 5.0, "review": "Great streaming device, works right out of the box (with my prime info already loaded).  Worth every penny...", "verified": true, "helpfulness": "0/0", "author": "Christopher N"}, {"rating": 5.0, "review": "I love this item.  We do not have any cable or channels on our television.  But, with the fire stick, we can easily watch Netflix or Amazon Prime videos directly through the television.  I no longer have to have the cord connecting my tv to my kindle.  It is easy to use.  And I like that I have parental blocks on it as needed.  My 7 year old can operate it without issue.  We haven't lost the remote, but if I do, I have the fire stick remote app on my phone.  I have tried that and it works just fine.We had a few issues at the start where it was not staying connected to the internet.  but, I think that was due to my wi-fi and where I had it placed at the time.  We haven't had any issues since.", "verified": true, "helpfulness": "0/0", "author": "Kregrub"}, {"rating": 5.0, "review": "Thank you've Slenti item as requiredAnd experimented with YouTube Llosa I try to buy from Amazon himA very coolThanks Amazon", "verified": true, "helpfulness": "0/0", "author": "alghumayan"}]