[{"rating": 5.0, "review": "Great unit, works well.", "verified": true, "helpfulness": "0/0", "author": "allen leichtman"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Michael solomon"}, {"rating": 3.0, "review": "It still takes a long time to charge my kindle although better than before", "verified": true, "helpfulness": "0/1", "author": "Paul A Feinberg"}, {"rating": 1.0, "review": "I found the product to meet all my expectations. And the service dept was very helpful also.", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 5.0, "review": "I purchased the Fire TV Stick and I'm very happy with it.  It was easy to set up and I love the small lightweight remote.  I had been using my old Wii to watch Netflix and it was inconvenient to switch from Netflix to Amazon Prime TV.  I almost purchased the Chromecast, but noted that Amazon Prime TV doesn't play well with it and that was the primary purpose I wanted a product.  In the last 2 weeks I've been watching Amazon Prime TV and Netflix to my heart's content.  I know there is much more content available but watching TV is not my full time job.", "verified": true, "helpfulness": "0/0", "author": "Gloria \"tapp4010\""}, {"rating": 5.0, "review": "All I expected and more.", "verified": true, "helpfulness": "0/0", "author": "Shaye"}, {"rating": 4.0, "review": "It's ok but can't hook up to surround sound system", "verified": true, "helpfulness": "0/0", "author": "george ochoa"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 4.0, "review": "My girlfriend has a hard time sleeping in total silence, so having this attached to our bedroom TV is great for playing anything on Netflix or Prime to help her knock out. I don't have cable TV because there's never anything on TV. I give it 4 stars because using this stick in a different room from my AC router has a lot of hiccups. There is only 1 wall between the router and the stick and it still skips. I have to keep it in the same room.", "verified": true, "helpfulness": "1/1", "author": "Tony Yang"}, {"rating": 5.0, "review": "Love it great product", "verified": true, "helpfulness": "1/1", "author": "monica"}]