[{"rating": 5.0, "review": "Love, dont get me wrong I like the Roku boxes, but I recently signed up SLING TV and I got a free Fire TV Stick... and I love it. I did have the option to 50% of the Fire TV or free stick.. really thinking of selling my roku s and getting all fire tv s", "verified": true, "helpfulness": "0/0", "author": "Manuel M."}, {"rating": 5.0, "review": "It works as advertised.  Plugged in and set up in minutes.  No problems so far.", "verified": true, "helpfulness": "0/0", "author": "Matthew Knez"}, {"rating": 4.0, "review": "Couldn't be easier to set up.  Not being tech-savvy, I usually have my kids do stuff like this, but it wasn't necessary.  Took about one minute.  The only reason I didn't give it 5 stars is because the buttons on the remote are a bit difficult to push.  Wish I had done this sooner.", "verified": true, "helpfulness": "0/0", "author": "Tavys sister"}, {"rating": 5.0, "review": "Great being able to watch what I want to when I want to!  I have the Fire Stick and Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "beverleylee brown"}, {"rating": 5.0, "review": "Couldn't be simpler. Exactly what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Ben Braughton"}, {"rating": 5.0, "review": "Amazon is on fire with all the stuff they do", "verified": true, "helpfulness": "0/0", "author": "Tyler M Golden"}, {"rating": 5.0, "review": "This is one of the best TV Sticks out there period!!! More than the Amazon content the entertainment this stick offers via Side loaded apps is unlimited.  Load Apps like KODI, FIRED TV, Llama etc.and you are all set for great entertainment.  The stick is pretty fast and the remote is awesome, especially when working as controller for playing games.", "verified": false, "helpfulness": "0/0", "author": "Jai"}, {"rating": 5.0, "review": "Great streaming device.  I think I like it more than my Roku.", "verified": true, "helpfulness": "0/0", "author": "W. M. Brown"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "kathy"}, {"rating": 5.0, "review": "Very impressed with the fire stick. Performance is better than Roku (I own earlier and later sold on Craigslist). Dishworld app used to buffer every 2 mins in Roku, however SlingTV works perfectly in firestick.", "verified": true, "helpfulness": "0/0", "author": "Advanx"}]