[{"rating": 5.0, "review": "Exceeded expectations. Very easy to use.", "verified": true, "helpfulness": "0/1", "author": "John Zook"}, {"rating": 5.0, "review": "Works great, better than cable or Sat. TV", "verified": true, "helpfulness": "0/1", "author": "GORDON EZZELL"}, {"rating": 5.0, "review": "Love the fire stick! I actually have two one for my bedroom and one in the basement. It is easy to navigate and a remote can be downloaded to your phone. My son watches a lot of Netflix so it's a great purchase for us!", "verified": true, "helpfulness": "0/1", "author": "elizabeth johns"}, {"rating": 5.0, "review": "Love IT..", "verified": true, "helpfulness": "0/1", "author": "Beatriz Viola"}, {"rating": 5.0, "review": "So easy to install and set up. Very happy with the product and the price.", "verified": true, "helpfulness": "0/1", "author": "Mary K"}, {"rating": 5.0, "review": "Amazon has a great product.", "verified": true, "helpfulness": "0/1", "author": "Jrubins \"JRubins\""}, {"rating": 5.0, "review": "I have a Chromecast, Roku and several connected Blu-Ray players, but this is the best one by a good margin. Easy to install, fast, both loading and navigating, supports all the major streaming services, and nice extras (games, etc. Amazon content, etc.).", "verified": true, "helpfulness": "0/1", "author": "James E. Howell"}, {"rating": 4.0, "review": "Received promptly, set up was easy and in a few minutes we were watching Netflix. The only thing that kept my rating below a 5 is my slow internet connection. I am presently stuck with a 3 Mbps connection and this causes some stuttering and at times a less than clear picture. My problem to be sure and not the Fire Stick but as an overall experience 4 is my rating. It is only as good as your connection to the internet", "verified": true, "helpfulness": "0/2", "author": "K. Richardson \"AU tiger\""}, {"rating": 5.0, "review": "When it first came out I thought about it, and didn't buy it.  So NOW I'm so happy I bought it, so many movies and tv shows to choose from.  Brings back fun memories from the old shows and lots of new shows to watch.  I didn't want to purchase HBO or other premium channels, too expensive. Pretty sure Amazon will always be updating the selections. With the Fire TV Stick lots to choose from.  Amazon sent me a step by step installation via email.  Also if need be YouTube has videos too. I an older adult (Sr.) and female and it was easy to set up.", "verified": true, "helpfulness": "0/1", "author": "Marti Peters"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Lynn"}]