[{"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "Rene' Noojin"}, {"rating": 1.0, "review": "Not sure I see the benefit over Netflix. Movie selection is... OK. I have Comcast Xfinity cable -- which Comcast claims is running at their highest speed -- and still movies hang up with the Fire Stick. Curious, as this never happens with Netflix. Never. Unless movie selection improves and the hang-ups stop, I will be very unimpressed.", "verified": true, "helpfulness": "0/0", "author": "Stephen P. Lloyd \"I am still learning.\""}, {"rating": 5.0, "review": "We would be lost without this little Fire Stick. It's been a blessing!", "verified": true, "helpfulness": "0/0", "author": "Rochelle"}, {"rating": 1.0, "review": "dose not do what it suppose too do, will only work for awhile bud purchase on my part, don't buy this item.", "verified": true, "helpfulness": "0/0", "author": "larry"}, {"rating": 5.0, "review": "Very happy with the flexibility and options to install useful apps.", "verified": true, "helpfulness": "0/0", "author": "Richard E Hower"}, {"rating": 3.0, "review": "Need help to stream from I-pad  & phone.", "verified": true, "helpfulness": "0/0", "author": "Buddy E. Strawser"}, {"rating": 5.0, "review": "I was very excited when I recieved the Fire TV Stick as a gift from my wife. Ever since we joined prime, I wanted a way to enjoy the content on the big screen, this is the perfect solution at an amazing price. Terrific value. If you have Prime and adequate internet service, this is a no brainer.  The interface is smooth and easy to navigate. The iOS app works great on our iPhones and iPad, the added voice control feature is a HUGE plus. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "JandJ"}, {"rating": 5.0, "review": "Very excellent service.", "verified": true, "helpfulness": "0/0", "author": "Lionel Bowman Jr"}, {"rating": 5.0, "review": "the fire stick is great. it took less than 15 min to hook up and set up. if you have amazon prime this is a must have.", "verified": true, "helpfulness": "0/0", "author": "john cassity"}, {"rating": 4.0, "review": "As expected, would like to see more recent titles", "verified": true, "helpfulness": "0/0", "author": "Martin J De Leon"}]