[{"rating": 5.0, "review": "I'm loving the stick! I can watch shows,listen to music, watch movies, search YouTube, play games...I don't know how I lived with out it. TV should automatically come with a firestick.", "verified": true, "helpfulness": "0/0", "author": "Lovelyladyai"}, {"rating": 5.0, "review": "I use a Roku in my room and had one for my son in his room.  My Roku works fine, but even though the wireless router is closer to my son's room, the Roku would lag so bad that he just stopped using it.  I got the Fire TV stick to see if it would work for him better.  He loves it.  It brings up video right away and I no longer have to hear him complain!  Great buy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"dipstop\""}, {"rating": 4.0, "review": "works great! The device itself works great and I like the interface.  The picture quality is great and most of the apps are great and I look forward to trying more.  The espn app is particularly disappointing though because you have to already be paying for cable and have espn for it to work which defeats the purpose.  I was hoping to get rid of cable and thinking the espn app would make that more doable for me but I digress.  lots of cool features and great product", "verified": true, "helpfulness": "0/0", "author": "Alec Regalado"}, {"rating": 5.0, "review": "Amazing and easy to use it! But Missing are Vudu but I know HBO Go will coming on Mid-2015 for Fire Stick...My opinion about subtitles and caption are ok because Does not support subtitles in Flixster app and very few app but no problem with Amazon Instant Video and support subtitles, too! Sling is the first time on Amazon Fire Stick that was so great HD picture, nice channels and extra cartoons, sports, or news/cooking and of course support is closed-caption! I wish this need add app a little more like, Vudu and DisneyMoviesAnywhere *not WATCHDisney*. Amazon Games app are enjoy to play it!", "verified": true, "helpfulness": "0/0", "author": "beeyobee \"BeeyoBee\""}, {"rating": 2.0, "review": "I really wanted to like this item but unfortunately whenever it is static for more than 8 hours it looses connectivity. I'm an IT guy so I already did all the \"fixes\". The big problem is that it will loose connection with PLEX and I have to restart the device before it will connect again....this is the same with all the media on Fire Stick.Also, I run a \"N\" network with all gig wired and the video quality is substandard.", "verified": true, "helpfulness": "0/0", "author": "Robert Turner"}, {"rating": 5.0, "review": "This works great! I had chromecast and I feel like fire stick loads faster. And I liked being able to fast forward and rewind with the remote.  It also has parental blocks (which is part of the guided setup) so kids can't make purchases from prime video. Definitely happy with it.", "verified": true, "helpfulness": "0/0", "author": "Shop mom"}, {"rating": 5.0, "review": "AWESOME ITEM", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 3.0, "review": "The mini USB plug need to go vertically rather than horizontally everything  works pretty good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well. Easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Gary Gale \"ggale\""}, {"rating": 5.0, "review": "Great device! The introduction that walks you through how to use it is amazingly simple, to the point, and extremely helpful. It isn't a difficult device to use by any means but I was impressed by the \"how to\" nonetheless. My only suggestion for improvement - and this is really specific and clearly a first world problem - but it would be great if the photos during the standby section includes where the photo is taken. I bet this would increase tourism to those places ... Who knows, maybe the destinations will pay for the advertising.", "verified": true, "helpfulness": "0/0", "author": "Marcella Agner"}]