[{"rating": 5.0, "review": "Very nice and functional unit. I have received and replaced my Roku TV units and Apple TV unit with Fire sticks. Excellent feature set and speed, nice form, good to receive all necessary parts in the box (including the HDMI extender - nice touch!).  I do hope the UI becomes cleaner and less cluttered over the next several releases.", "verified": true, "helpfulness": "0/0", "author": "Tej Dhawan"}, {"rating": 5.0, "review": "Very easy to install and then navigate.", "verified": true, "helpfulness": "0/0", "author": "Sue Wu"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Suzanne Semones"}, {"rating": 5.0, "review": "The fire stick was really easy to setup.  We had it joined to our wifi network and running in just a few minutes.  The menus are quick and responsive and the streaming experience in HD has been excellent!", "verified": true, "helpfulness": "0/0", "author": "M. Farwell"}, {"rating": 2.0, "review": "I received the Firestick as a gift for Christmas.  However, we have not been able to actually watch a movie.  The buffering is constant.  I was hoping for so much more.  My router is about 10 feet away from the tv, I'm using the extension piece for the hookup on the tv.  I have not contacted my service provider to see if there's a problem with Frontier....I'm a bit discouraged at this point.", "verified": true, "helpfulness": "0/0", "author": "L. Kotila"}, {"rating": 5.0, "review": "This is so very easy to use and the movies and programs available are awesome.  Just cancelled Netflix!!", "verified": true, "helpfulness": "0/0", "author": "Cheryl L. Herber"}, {"rating": 5.0, "review": "Easy to install and it adds a tremendous amount of movies and music.  For the price, it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Connie/Jim"}, {"rating": 5.0, "review": "Easy to install.  With a prime membership there are a large number of outstanding movies and series available for free. There is also a very extensive selection of current movies.", "verified": true, "helpfulness": "0/0", "author": "Daniel Rice"}, {"rating": 5.0, "review": "Love it!! Easy to use and so many options and features!", "verified": true, "helpfulness": "0/0", "author": "Shirl"}, {"rating": 3.0, "review": "It's a bit slow to respond and navigation could be cleaned up. Also, seasons of TV shows should start from newest to oldest instead of oldest to newest.", "verified": true, "helpfulness": "0/1", "author": "Michael Oteri"}]