[{"rating": 5.0, "review": "Skeptical because of the price then blown away by how well it works. I spent hundreds extra on a \"smart tv\" last fall that still does not work. Bought the Fire Stick for a smaller TV and 5 mins later I had a true \"Smart Tv\". Excellent purchase. Buying another one for the \"dumb TV\" I bought last fall.", "verified": true, "helpfulness": "1/1", "author": "Kellie Roberts"}, {"rating": 5.0, "review": "Very easy to set up and use, it works great right out of the box. I have a little trouble with buffering when watching a show but believe that's related to the download speeds associated with Hughes Net. Only thing I'd suggest is for those of us without true high speed internet include a feature that allows selection of SD instead of streaming all in HD.", "verified": true, "helpfulness": "0/0", "author": "Kennon Robertson"}, {"rating": 3.0, "review": "I bought the Fire TV Stick primarily as a way to watch Amazon Prime content.  I have a Chromecast that i've had since it first came out that I used to watch Netflix content and I figured that the Fire TV Stick would be the best of both worlds.It's a great way to watch Amazon Prime content but there are currently some content available with the Chromecast that isn't available on the Fire Stick.  That isn't so much of a big deal right now considering it's fairly new and the apps need go be developed for it.  There are a bunch of other apps I haven't even checked out yet so that's a plus.The major drawback is that I periodically get logged out of Netflix which means I have to log back in again.  I've had it happen twice in the same week so there isn't some 90 timeout i'm hitting.Pros:* Access to Amazon content* Access to Netflix, Showtime Anytime, and other content* Dedicated remote* Phone/Tablet app to use as a remoteCons:* Periodic logout from Netflix* No HBO GO or Max Go yet (I thought I read HBO Go was on the way)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is awesome and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "this fire tv stick met all my requirements.", "verified": true, "helpfulness": "0/0", "author": "James W."}, {"rating": 1.0, "review": "Just providing another data point here.I have been using Roku for years, and got this for the little TV in the guest room since I didn't want to spend a lot.Like the Roku, it works well in the sense that you can use the internet to stream content from places like Amazon Prime or Netflix. (I use internet services for TV and movies, and don't pay Time-Warner for TV cable service.)Things that are wrong:1. Once something is playing, mine hiccups from time to time, skipping a moment of content.2. The interface is amazingly terrible. I always think Hulu is bad, but this is even worse. Amazingly, it's especially bad with accessing Amazon content. I can't imagine what they were thinking.With the Amazon content on the Roku, I can easily navigate to my Watchlist for TVs or Movies. Here -- WTF? -- the movies and TV shows end up in the same listing.The bad user interface is a software issue, so I'm hoping that Amazon will step it up and we'll get updates and the usability of the device will increase.The hiccuping, I'm not sure; maybe it's a firmware thing that can be addressed with an update, or maybe I got a defective unit. Hard to say.", "verified": true, "helpfulness": "0/1", "author": "Mainiac"}, {"rating": 3.0, "review": "I had trouble with the Fire Stick because our internet is too slow. Amazon sends it's programs at very high speeds so there was constant buffering. I was told that Netflix adapts it's speed to the speed of your internet and this streams much better.", "verified": true, "helpfulness": "0/0", "author": "Linda B"}, {"rating": 3.0, "review": "poor instructions if something went wrong. literally had to figure it out on your own.", "verified": true, "helpfulness": "0/0", "author": "Rick Stevens"}, {"rating": 5.0, "review": "I have been too bust to test, but it will probably make my DISK go away!!!!!", "verified": true, "helpfulness": "1/2", "author": "Bill W. Hogge"}, {"rating": 5.0, "review": "Great Netflix supplement", "verified": true, "helpfulness": "0/0", "author": "Rob T"}]