[{"rating": 4.0, "review": "All seems to be good, but we did have a bit of  trouble getting connected and staying connected to our wireless network.", "verified": true, "helpfulness": "0/0", "author": "Hopeless Hacker"}, {"rating": 5.0, "review": "Fire TV stick is great! Came loaded with my account info and was as simple as just plugging it in!", "verified": true, "helpfulness": "0/0", "author": "bookaddict"}, {"rating": 5.0, "review": "Wonderful device, enjoy the different options.", "verified": true, "helpfulness": "0/0", "author": "Old Smokey 710"}, {"rating": 1.0, "review": "Was axon asked me to rate this. Sorry, I got ot for Christmas, it's hooked up but I really have no idea what to do next. Seems like it's just a device to enable me to buy/rent movies???So I can't give any feedback", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "C Brent Adams"}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Mfresh82"}, {"rating": 5.0, "review": "A powerful punch of awesome tech in a small and well thought out design. Fire Stick make any TV smarter and enables you to maximize your TV's entertainment potential. Far superior to Google's Chrome Cast and a more economical alternative to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "T. Arnold"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "MrBoh"}, {"rating": 5.0, "review": "I bought this at a kiosk right before Christmas. At first we had issues with it not registering. We ended up calling customer service and they fixed it. So it worked, slowly. Didn't use it during the week (I binge watch on the weekends) and it stopped working. So I removed it and reregisted it and ended up calling customer service again and they couldn't fix it. So I ended up calling the kiosk and they took it back even though I threw out the box. This new one works flawlessly with the help of the Almond range extender that I bought. Now I'm completely satisfied. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome! puts every movie ever made in the palm of your hands! Let's us watch all our movies and shows without ever getting out of bed!", "verified": true, "helpfulness": "0/0", "author": "Alfonso Despacio"}]