[{"rating": 1.0, "review": "Don't like it", "verified": true, "helpfulness": "0/2", "author": "Chris B."}, {"rating": 5.0, "review": "Great streaming device!  Super simple to install and setup. Excellent video quality, no buffering or drops. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Michael A Wood"}, {"rating": 1.0, "review": "If I could give this less than 1 star I would.  Waste of money and horrible customer service.", "verified": true, "helpfulness": "0/1", "author": "Donna Digiacomo"}, {"rating": 5.0, "review": "I am very impressed with the fire stick.I hope more people will purchase great little device", "verified": true, "helpfulness": "0/0", "author": "H. Moore \"HLMoore\""}, {"rating": 5.0, "review": "This is absolutely fantastic. Right out of the box, it started installing and no problems whatever. It sure has a lot to offer and the remote is really cool. I'm sure after using it for a while and watching a few movies, it will more than pay for itself. Even my 62 year old wife figured out how to work it with no complaints. That's great.", "verified": true, "helpfulness": "0/0", "author": "SOUPY"}, {"rating": 1.0, "review": "Fast and easy install. I have only used Amazon Prime and the stream is excellent. This is a great product at a very reasonable price.I was too quick with my original review. I was in the middle of a movie when the Fire Stick died. It lost internet connection and network properties showed \"connected with problems\". I did a factory reset and now cannot connect to my router. All of my other wireless devices work fine. This is going back.", "verified": true, "helpfulness": "0/0", "author": "GerryC \"GerryC\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "reneecp"}, {"rating": 5.0, "review": "I really like streaming device.  I have been a Roku fan in the past...they are great.  However, I am belong to Amazon Prime, which, makes the Fire Stick a better and very cost effective option.  As good as or better than the Roku for other applications, but both are good products", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "So far we love it", "verified": true, "helpfulness": "0/0", "author": "Stacia"}, {"rating": 4.0, "review": "Great product. Interface feels more intuitive to me than Apple TV. It would be 5 stars if I could connect my iTunes and Macbook Air through it like I can with AppleTV", "verified": true, "helpfulness": "0/0", "author": "P. Cello"}]