[{"rating": 5.0, "review": "Love the simplicity of setup and usage. Liked it so much got one for my parents.", "verified": true, "helpfulness": "0/0", "author": "Jonathan M. Brennan"}, {"rating": 3.0, "review": "Like the functionality and all the apps available.  Would rate better if only it did not require its own power source.  I assumed it would power when plugged into the TV's HDMI since there is no mention or picture of an external power source.  Also, the power cord supplied is too short to reach an outlet behind the entertainment center.  Does have a USB option if your TV has one, however it is \"recommended\" that you use the power cord instead which is a micro USB that plugs into the Fire Stick itself.Other than that, it's pretty cool, not to mention the portability when traveling!", "verified": true, "helpfulness": "0/0", "author": "Watcher"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Bob Bretherton"}, {"rating": 5.0, "review": "After owning Chrome Stick, I needed something that would allow me to watch Amazon Prime Movies on my TV, I bought the Chrome Stick to do that but it failed desperately. Fire Stick does exactly what I needed and even more! Very Happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Arthur Mazeau"}, {"rating": 4.0, "review": "Great product, blows away roku and for 1/3 the price!", "verified": true, "helpfulness": "0/0", "author": "Curtis McNeill"}, {"rating": 3.0, "review": "Buffering issues.", "verified": true, "helpfulness": "0/0", "author": "G. Schwartz"}, {"rating": 5.0, "review": "Works as advertised!  Well worth the investment.  I'm accessing Netflix much more than in the past as a result.", "verified": true, "helpfulness": "0/0", "author": "Gary Jong"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Cheryl thunberg"}, {"rating": 4.0, "review": "Very responsive and abled device. I am pleasantly surprised at this little unit as I also have a Roku and Apple TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Cesar A. Nau"}, {"rating": 3.0, "review": "Fire stick works well. Movie rental fees are expensive.", "verified": true, "helpfulness": "0/0", "author": "Don"}]