[{"rating": 4.0, "review": "It is a little confusing on how the shows work. Which ones do I get to watch, and why do I have to buy others", "verified": true, "helpfulness": "0/0", "author": "Morton Sager"}, {"rating": 4.0, "review": "I like the product. But there has been a few times that it was not connecting to my wifi. Even though every other device was.", "verified": true, "helpfulness": "0/0", "author": "Lorretta Watson"}, {"rating": 4.0, "review": "The fire tv stick set up was easy. The device itself is vey easy to use with amazon prime video.", "verified": true, "helpfulness": "0/0", "author": "Dan Price"}, {"rating": 5.0, "review": "Fire TV Stick is the greatest thing since sliced bread", "verified": true, "helpfulness": "0/0", "author": "Tiggerbeeman"}, {"rating": 5.0, "review": "just got this.  love it.", "verified": true, "helpfulness": "0/0", "author": "alys barendt"}, {"rating": 5.0, "review": "I am happy to say that this FireStick worked right out of the box, no problems setting it up, no real difficulty in connecting to the wifi. We can watch Amazon Prime movies and TV shows for free, and their library is pretty good. The HD video is very good quality.Very occasionally (twice in one month) the movie freezes while the streaming data recovers, and then the movie restarts with no problem and no action needed by the viewer. Once, the dreaded message \"No Wi-Fi available\" came up. I just rebooted the wifi router, and the problem disappeared. It's a great product!", "verified": true, "helpfulness": "0/0", "author": "BRobb"}, {"rating": 5.0, "review": "So far it has been very good", "verified": true, "helpfulness": "0/0", "author": "Stephen Harris"}, {"rating": 5.0, "review": "i was happy  to find this Fire TV Stick, I was not able to get into NetFlix anymore and this was one way to do it.  It was not that difficultto set up and so far I am well pleased.", "verified": true, "helpfulness": "0/0", "author": "Nola T. Geaney"}, {"rating": 5.0, "review": "Works great and easy to move from location to location.", "verified": true, "helpfulness": "0/0", "author": "Edward T. Wolf"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "john"}]