[{"rating": 5.0, "review": "Love it. Bought one for a gift", "verified": true, "helpfulness": "0/0", "author": "Linda Lind"}, {"rating": 5.0, "review": "Great for a gift idea. Love this item and will purchase more in the future.", "verified": true, "helpfulness": "0/0", "author": "Greg Hughes"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Patricia Rakus \"PattyNJ\""}, {"rating": 4.0, "review": "I've got 2 Roku's (one I gave to a friend) and bought a Chromecast at Xmas for myself. Before that...had an android TV stick I ordered from China. The problem with the Roku's and the Chromecast is you can't run XBMC/Kodi on them. On the Amazon Fire's...not only can I do this...but the remote works fantastically. The Chromecast is way too unstable to be usable for anything but sucking up electricity.Now...the only problem I've had on the Fire Stick is my wireless dropping out...making the device useless. It's not Amazon's fault...but it would've been nice to have an additional USB port where I could've plugged in an adapter and then plugged in a USB Ethernet connector. When I can't get the wireless to work...am forced to use my Xbox360 with its Ethernet connector to watch Netflix. Really wish Amazon would allow the off-loading of apps from the Play Store that Amazon doesn't have available like Coursera.", "verified": true, "helpfulness": "1/1", "author": "Furball"}, {"rating": 2.0, "review": "This was hard to install on my TV. It took two days and multiple online searches for the problems my computer expert son and I encountered with installation. Also the remote is difficult to use. Fast forward rushes ahead at a breakneck speed. It is hard to reach the area of a movie or TV show one wants to view. I will continue to use the Fire TV Stick in hopes that it will be easier to use as I become more familiar with it. The movies and TV productions themselves are of good quality and enjoyable to watch once one finally is able to get to where the user wants to be.", "verified": true, "helpfulness": "0/0", "author": "docdks \"dkseilhe\""}, {"rating": 5.0, "review": "Love the stick but directions should include what to do if you have cable to hook it up.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Gangemi \"CG\""}, {"rating": 4.0, "review": "The only thing missing is volume control on the remote.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Enjoy the stick, we daycare for our grandson and we enjoy the children  programs.  A great alternative to cable tv.", "verified": true, "helpfulness": "0/0", "author": "gregory m mitchell"}, {"rating": 4.0, "review": "Very much like the Firestick. Easily hooked up and started.  My only complaint is that the menu system confuses my elderly parents. The consistently go to the Amazon content when they're trying to access Netflix.", "verified": true, "helpfulness": "0/0", "author": "Matthew Horton"}, {"rating": 5.0, "review": "Easy to use.  WiFi works better then I expected. Clear picture. No lag. Deff recommend  I'm a Netflix hbogo junkie. Both work great on the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Christopher S"}]