[{"rating": 5.0, "review": "Very nice! Easy setup, and very very fast!", "verified": true, "helpfulness": "0/0", "author": "dholanda"}, {"rating": 4.0, "review": "I love how much faster this loads and streams compared to Chromecast. i just feel like it is a smoother user experience/interface. I really enjoy the portability of this as well.My only wish was for the makers of these types of products to figure out a way to power it from the TV without having to plug it in to a  seperate outlet. Outlets are at a premium by my TV. I already have many different tech devices plugged in. Please figure out a way to make this work without the power plug. This is in no way personal towards amazon and the fire tv stick. This is how all of these \"stick streamers\" operate. Otherwise, this is a great product for streaming video from hulu, netflix, amazon instant video. Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "K. Carpentier \"music nut\""}, {"rating": 5.0, "review": "Great and simple way to get your internet subscriptions anywhere in the house. Highly recommend it. Sooooo much better than Roku. I am on a campaign against Roku. Received it as a gift. Still don't know how I will tell my nephew I can't use it. I've owned 4 other devices for streaming and Roku was the first one that I've tried to activate only to find that the device is useless unless you supply a credit card number. I already have accounts for Amazon and Netflix and some free providers. I don't intend now or ever to subscribe to anything else from Roku. BUT they won't let you use the already paid for device until you turn over your personal information. DON'T buy Roku. Go Fire TV Stick. Even if you don't have an Amazon Prime account (consider getting one) the stick will provide many options.", "verified": true, "helpfulness": "0/0", "author": "Uncle Billy \"Bill\""}, {"rating": 5.0, "review": "The Fire TV stick by Amazon exceeds my wildest expectations I never knew I had. The Fire TV stick is a must have for every Prime user! Flawless streaming, easy to navigate menus, and simple set up. I'm raving about it to everyone!", "verified": true, "helpfulness": "0/0", "author": "Sam Still"}, {"rating": 5.0, "review": "I wasn't sure if I'd find this useful, as my TV offers Amazon, Netflix, YouTube and a couple others. As a Prime member, I was notified of a 2 day sale for half price and took advantage. If I didn't like it, it could become a gift. I just threw the box away! It's become a favorite way to explore TV. I cut cable a few months ago and this brings back networks that I'd miss otherwise, and some news offerings. It plays wirelessly in higher definition than my TV does wired so I'm impressed with what it can do. I'm not one to put my content and private life on anyone's cloud so likely won't place my photo or music library on Amazon's cloud, but for those who don't value or understand the value of privacy, it's a nice ability to have. There's more to explore than I've discovered, but I'd be satisfied at full price. It's easy to use and works very well. Kudos for including Netflix!", "verified": true, "helpfulness": "0/0", "author": "Steven J"}, {"rating": 5.0, "review": "Performs well and easy to setup.  The amazon fire stick application for android phones (which is free)  makes it really easy to find movies because of the voice recognition feature.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "butlerbob"}, {"rating": 1.0, "review": "Just buy yourself a Chromecast. I never have seen my Chromecast buffer as much as the Fire TV Stick. I compared APP to APP on each of the devices, and Chromecast clearly won. Sure, the Fire TV Stick brings a remote but its buggy and tends to have a large delay.", "verified": true, "helpfulness": "1/4", "author": "Sara Melo"}, {"rating": 5.0, "review": "Epic little stick! It beats the living hell out of a Roku.", "verified": true, "helpfulness": "0/0", "author": "Jackson Turing"}, {"rating": 5.0, "review": "This is the greatest one out there.  I watch 90% of my TV online and the Fire Stick blows away the Roku I have, which is one of the better Roku. Fast forwarding and rewinding load time is very very fast, no loading message, no buffering messages, it just starts playing right away.  Netflix and Hulu on this thing is great, much faster loading and playing than my PC. I'm buying a second one and also getting rid of DVD player that streams.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire TV Stick has exceeded my expectations. I plan on buying the Fire TV box and moving the stick to another room. Great decision.", "verified": true, "helpfulness": "0/0", "author": "Rosebud"}]