[{"rating": 5.0, "review": "We are enjoying our Fire TV Stick.  We have a Chromecast as well and between the two of them, we have a lot of entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Rick B"}, {"rating": 5.0, "review": "Awesome love it!", "verified": true, "helpfulness": "0/0", "author": "Clay Johnson"}, {"rating": 5.0, "review": "Excellent value!  Love the interface--simple, clean and intuitive.  One of the best purchases I have made this year,", "verified": true, "helpfulness": "0/0", "author": "L. Shoaf"}, {"rating": 5.0, "review": "I only bought this because it was offered half price to prime members.  I'm glad that I did because not only is it useful but it has been fun too. I'd worried that it might be difficult to use without a voice control on the remote, but I didn't want to spend the extra money to upgrade.  Instead I just downloaded the Fire TV app onto my phone (Galaxy S5) and used the voice control function on it. If you are a prime member this is a great item to have.  The only reason I wouldn't use this would be I had a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Kalykatkat"}, {"rating": 2.0, "review": "Frequent App Crashes, especially when my 3 year old is trying to watch Disney Junior. Expected same content within apps as other devices, but apparently Amazon hasn't negotiatied the same level of access with cable providers. Promising an Apple iOS remote, but no sign of the app yet.", "verified": false, "helpfulness": "0/0", "author": "Cody R Francisco"}, {"rating": 3.0, "review": "Excellent, however there's no volume control. Most devices running android, which this does, will let you control the volume in app. This device does not allow this for any app, even Xbmx/Kodi (which installed nicely, but doesn't work when playing back video on several versions that I've tried, non-rooted) Called amazon customer service and they said no volume control with either the fire stick or fire TV. We need another remote, like the one that came with your TV, to control volume.If this is not a problem and you don't care about xbmc, then you will love this little device. It's like a Roku for less $.Oh, and this device requires all connected components be HDCP compliant or else no video will play.", "verified": true, "helpfulness": "0/0", "author": "Selene and Johnny Faire"}, {"rating": 5.0, "review": "Easy to use. Allowed us to put a TV in a play room that doesn't have cable. Definitely recommend if you have an older TV that is not a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Jessica Kirby"}, {"rating": 1.0, "review": "It constantly disconnects from the Internet. I have to unplug everything, tell the network settings to forget my wifi connection, then plug everything in and reset my password. It's not worth it. I work from home and have one of the highest Internet packages, and this is the only device that as issues with my home wifi. It's really frustrating and, as I said, not worth it.", "verified": true, "helpfulness": "2/2", "author": "MegC"}, {"rating": 5.0, "review": "The best investment I have made this whole year!!", "verified": true, "helpfulness": "0/0", "author": "Sharif"}, {"rating": 3.0, "review": "Works well. The reason I rate it a 3 is that I need to unpkug it to watch TV; otherwise, the tv screen goes dark every few minutes. Good selection of games, but can be glitchy at times.", "verified": false, "helpfulness": "0/0", "author": "Albert Bodden"}]