[{"rating": 5.0, "review": "Whoever came up with this idea is a genious.  You can take it with you anywhere.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Amiri Rosa \"Ami\""}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Batdorf"}, {"rating": 5.0, "review": "Works great for my Prime videos and movies. I'm still working through the other features.", "verified": true, "helpfulness": "0/0", "author": "whodathunkit"}, {"rating": 5.0, "review": "finally plugged it in to our tv!  awesome!  so easy to use and thousands of movies and games at your fingertips!", "verified": true, "helpfulness": "0/0", "author": "joseph c. ortis"}, {"rating": 3.0, "review": "The technology is good, but I'm finding switching between Regular TV & use of Firestick cumbersome - the Cable Co. remote has a button \"Video Source\" which I use to go back & forth. Most likely with more experience it'll work out OK.", "verified": true, "helpfulness": "0/0", "author": "nanci"}, {"rating": 3.0, "review": "First you need to use the clicker for the TV to change the input from the HD channel for cable to the HD channel for the fire stick. Then you get to use the fire stick. It will be nice when an updated fire stick allows you to change the HD channel so that you do not need two clickers.", "verified": true, "helpfulness": "0/1", "author": "Arnold Glass"}, {"rating": 1.0, "review": "I thought u have all the free movie want u become a amzon prime but you don't i am cancel my membership", "verified": true, "helpfulness": "2/3", "author": "Albert Lee"}, {"rating": 5.0, "review": "Works well, amount of viewing options are great!", "verified": true, "helpfulness": "0/0", "author": "sld"}, {"rating": 5.0, "review": "This is great! Easy set up and great price!", "verified": true, "helpfulness": "0/0", "author": "KaseyG"}, {"rating": 5.0, "review": "Loving the fire stick,  I must say it's better than roku", "verified": true, "helpfulness": "0/0", "author": "Calvin C."}]