[{"rating": 5.0, "review": "Easy installation. Great product!", "verified": true, "helpfulness": "0/0", "author": "Nina Young"}, {"rating": 3.0, "review": "You would think that it could derive it's energy from the TV HDMI.BUT , alas it is not so. You need to jack it into a USB port or wall outlet.Cords I say, CORDS!!", "verified": true, "helpfulness": "0/0", "author": "Drew Walter"}, {"rating": 4.0, "review": "Very excited to receive the Fire TV stick. I have a Chromecast and was interested in the use of the remote as my Nexus 5 battery seems to drain quickly even without use (Thanks for the Lollipop update Google!).Pros:Fire TV Stick provides a rich platform built on Android that allows playing video and music right from your Amazon account. Previously I was using PS3 to access prime videos because of the lack of Amazon Video support for Chomecast.Fire TV Stick also has app integration direct from the Amazon Android Appstore. You can play games or interact with other video platforms such as Netflix, Crackle. TwitTV, Hulu Plus, etc. (This is similar to Roku). Furthermore, the platform is fairly open allowing for \"side-loading\" apps such as XBMC (which provides better video streaming support for other media formats).Cons:There are stability problems with applications and the rest of the platform. For example, Crackle will randomly open while watching Netflix and start playing content. ESPN will crash when network goes out.There is no built in application to stream local media on the network.", "verified": true, "helpfulness": "0/0", "author": "regular user"}, {"rating": 2.0, "review": "Almost no instructions on operation of the remote.  Particularly with apps.  I am using the Slingplayer app and there are absolutely no instructions on how to use the remote. Also app  needs improvement.", "verified": true, "helpfulness": "0/0", "author": "Robert Curran"}, {"rating": 5.0, "review": "Works great!  As an amazon prime member gives me the ability to listen to all of my Prime music and watch all my Prime TV/Movies.  With NetFlix I'm now on this TV more than the one with AppleTV.", "verified": true, "helpfulness": "0/0", "author": "L.A. Wigles \"roadtrip\""}, {"rating": 1.0, "review": "This did not meet expectations.  It was difficult to set up (no instructions).  It is not simply plug in and use.  It has to be activated.  Which for some unknown reason it would not activate.  I had to use the extension for the stick and then it activated.  However, there is a separate charge to use every feature.  Nothing is included.  The biggest issue is the fact that when watching a movie or TV show the upload is constantly buffering.  I am returning the product.", "verified": true, "helpfulness": "2/3", "author": "Vince"}, {"rating": 5.0, "review": "Not as many channe ls as Roku yet but it will.  Easy setup I bought dirct from Amazon so was preprogramed with my info Some of the channels require you to pay a subscription fee which is in the pre sale ads. Some others were free only if you receive them on  cable or  satelite such as Hbo go or Showtime which I expected  Overall I like the firestick as I can take it with me where ever  i am and whatch what I normally  miss", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"joelpps\""}, {"rating": 4.0, "review": "Great product, functions perfectly. Good value compared to alternatives. Navigation is a little clunky. The iOS app leaves something to be desired. Maybe that aspect will improve over time.", "verified": true, "helpfulness": "0/0", "author": "Brad Hancock"}, {"rating": 5.0, "review": "This is a great device. Ours is not a real \"tekkie\" household, so this is just what we needed. Smart tv without having to go buy one.  We have prime and access to movies is great. Also no problem accessing my netflix account.  Love that it is portable. Can move from one TV to  next easily.", "verified": true, "helpfulness": "0/0", "author": "Judith L. Green"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "josh"}]