[{"rating": 5.0, "review": "I bought this for my wife.  It was a snap to setup.  I have an older flat screen so I had to use a HDMI switcher since I only have one HDMI connector.  Even with using the switcher there was no problem setting it up & getting it up and running.", "verified": true, "helpfulness": "0/0", "author": "fhk"}, {"rating": 5.0, "review": "Keep up the good work", "verified": true, "helpfulness": "0/0", "author": "Edul MALESRA"}, {"rating": 1.0, "review": "At first... you notice 1st rate packaging and then super simple simple setup. that's where it goodness ends. if you had intentions of spending the evening watching tv and movies, never mind. you'll spend it clicking up and down and all around. then buffering every 2 minutes. ( no its not a connection or range thing. 3 feet away from the router and no errors) as if the amazon prime app wasn't bad enough with the 1st season being apart of Prime then the next at $15, its the 3 suggestions per page and as long as you want to watch what they want you to watch, that's great. Other wise go to Netflix. uh oh.... somehow they even managed to screw Netflix up too. 2/3 of the screen with a big pretty picture of the highlighted show or movie and then a couple itty bitty little icons of the other shows/movies. click...click...clickclickclick this is fun. BANG!I have an idea, lets cram a zillion 1/2 rate apps and games that barely work onto one pretty little stick. awwww... too late, amazon beat me to it.the reason Netflix USUALLY works is because if its on there, you can watch it. no need to enter parental control passwords for each show... because of coarse some are part of Prime and others arent, no 15 menus to click through. click the picture, pick the episode if there is one and tadaaaa. entertainment. if ever there was 10 pounds of crap in a 2oz. stick, this is it.a note to the team that came up with Prime tv/movies. your apps suck. they are click intensive, counterintuitive  and annoying. maybe you should navigate the net version of Netflix, to see how it should be done. sometimes doing it a \"better way\" has already been done. on occasion its better to follow, that be the focus of an epic fail.i wont even bother sending this back. this stick has a 16oz claw hammer in its future. the $20 i spent is a bonus to all those who had a hand in producing this worthless piece of inevitable landfill, as a way to help them sleep at night. because they obviously wont based on the quality of their work.", "verified": true, "helpfulness": "2/3", "author": "steve Deryck"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Analisa Hernandez"}, {"rating": 4.0, "review": "I love it, but am disappointed that you still have to pay for some things or that some channels still require a cable provider to watch. Why should I pay a yearly fee for a service that I could easily watch with my cable provider? There is no incentive to keep it past the free trial period. I do like the convience of it but directv go enables me to watch things anywhere too. Why pay for this service and cable. I would pay for the fire stick if I didn't have to still be subscribed to cable to watch certain channels", "verified": false, "helpfulness": "0/1", "author": "Marcus Hoey"}, {"rating": 1.0, "review": "My review is not on the Firestick other then to alert certain Comcast customers who have the Xfinity X1 System that the Firestick may not bE compatible with their modem/voice/router combination. I have the SMC and it doesn't work. I believe Amazon is negligent in not alerting us to this fact.  The Fire Stick, in all probability is an outstanding product from all the favorable reviews, but not when it won't work with your system.", "verified": false, "helpfulness": "0/3", "author": "JACKR"}, {"rating": 5.0, "review": "I received it ahead of schedule which is always a plus!  Everything works good and seems pretty smooth.  There is a power adapter that is required to be plugged into the stick that I was unaware of, but not a deal breaker.  For their first swing at a stick version of FireTV, its a great start.", "verified": true, "helpfulness": "0/0", "author": "Orion6192 \"Orion6192\""}, {"rating": 3.0, "review": "I have had the FTVS for 2 weeks now it is glitchy with Netflix and with Cracke. my prime membership expiered and I have not tried it on amazon prime video. will upgrade review when they come up wit an update for Netflix glitchyness.", "verified": true, "helpfulness": "0/0", "author": "Robert Duran"}, {"rating": 4.0, "review": "So far: its alright.I plugged it into my projector, does what it says it will.Con: I plugged it in and used it last night, afterward I couldn't find any way to turn it off so I just turned off the projector, fine. When I turned on the projector today it was on \"resetting to factory defaults\" - apparently I or my cat had bumped the buttons on it while the projector was off. So I had to go through set-up again. You can't forward through or skip the welcome to Fire Stick video.I don't want to have to climb up and unplug it to turn it off,  it needs to either go to sleep eventually or have an off option (let me know if I just failed to see it). It would suck  to have to deal with it resetting or worse, things getting purchased, just because it can't turn off and the buttons press easily.Also: I was excited about the 'fling to second screen' capability ... before realizing that is only designed to work with Fire phones and tablets. I'm pretty sure it could work with an Android app, maybe with a slight delay, I'm just not willing to buy a fire phone or tablet just for that... but if it had that for android I would buy into my own prime account (I'm on a family prime account, and I'm not the primary so I don't get video, I'm mostly using this for netflix and the occasional video rental).", "verified": true, "helpfulness": "0/0", "author": "Elissa"}, {"rating": 5.0, "review": "Just received the Fire TV stick today.  So far, it is wonderful.  Very easy to set up and has lots of categories from movies, to games and apps and many more functions.  My TV in my craft room is not hooked to cable so I was only able to get the standard stations but with this,,I have so many options.  Your TV must have an HDMI port to be able to use.", "verified": true, "helpfulness": "0/0", "author": "Marsha"}]