[{"rating": 5.0, "review": "Have 3!!!", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Easy set up and conivient to have espically with two children. We are trying to save  money by not subcribing to cable and with this device and amazon prime we hace access to all of our kids favorate shows.", "verified": true, "helpfulness": "0/0", "author": "CNazzy"}, {"rating": 5.0, "review": "Have purchased two fire sticks and both preform as described. I am in my early 70s and have no problem hooking up or operating. Will buy more in the future for gifts.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Jones"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Minnie Zavala"}, {"rating": 5.0, "review": "Awesome, Working perfectly, no complicated set up. LOVE IT!!", "verified": true, "helpfulness": "0/0", "author": "Pennie"}, {"rating": 3.0, "review": "When its working I like it  but it seems to freeze up and have bad pic quality too often", "verified": true, "helpfulness": "0/0", "author": "eben bubbins"}, {"rating": 5.0, "review": "Love the Amazon Fire TV Stick!  Very small and compact, but packs a big punch! We have also owned a Roku, and the Fire Stick is by far the best choice!", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 5.0, "review": "I was very surprised by the abilities in this little device. I am a Amazon fan!! I havent used any other service on the internet b/c Most of my needs are met with amazon. Most important, it's affordable. I live on a strict budget, I am a single Mother with 3 children. There is onlt one thing that I have had a problem with and that is when the device gets HOT (to the touch) , it doesnt work. My remote will not be able to stop the choices from running on and on. Example: If I choose Netflis and Press it with my remote, My choices start rolling on the screen and I can't stop it until I unplug the fire stick and let it cool off. Then it works normal again. Thanks again.", "verified": true, "helpfulness": "0/0", "author": "Michelle Kornegay \"Michelle Kornegay\""}, {"rating": 5.0, "review": "I like this the only thing I don't like about it is that you have to have game controller to play the games and you can't buy them anywhete. I have some on order with amazon and they are taking forever to come and my Grandsons want them now I hate that about the fire stick", "verified": true, "helpfulness": "0/0", "author": "ARLEEN HARRISON"}, {"rating": 5.0, "review": "Does not take much space, easy to setup. Need power cable and plug this into HDMI.You need to download apps , like Netflix and hulu , as  initially I thought they are pre-installed but installation was very fast.Really convenient and you can also download an app to your phone if you don't want to use the remove it comes with.", "verified": true, "helpfulness": "0/0", "author": "A. Massourian"}]