[{"rating": 4.0, "review": "Pre ordered in October, received mid December. Not too happy with how long it took. Or the non-skippable intro video. Come on Amazon, we're not all 80 years old learning to use technology.  Otherwise its a Netflix stick,  does its job.", "verified": true, "helpfulness": "0/0", "author": "Sarah Marian"}, {"rating": 5.0, "review": "I picked this up for like $15 pre-release.  Made my dumb TV smart.  Even at the full price, if you're a prime user, you're crazy not to have one on every TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We had a little trouble installing it. I see there are a lot of tv shows that I missed 2, however the description says season one. Can you access season 2 after you view season 1?", "verified": true, "helpfulness": "0/0", "author": "P. Onstott \"book person\""}, {"rating": 5.0, "review": "Absolutely love this item.", "verified": true, "helpfulness": "0/0", "author": "C. Huppert"}, {"rating": 4.0, "review": "The cons: documentation and troubleshooting information is slim to none.The pros: lots of content, much of it free for PRIME members.I had trouble setting up my unit, and MANY USERS report this same problem: the unit is \"Connected with Problems.\" I finally had to go into my router set up (An Arris TG 862 Wireless) and MANUALLY ENTER THE UNIT'S MAC ADDRESS. Once this was done, the unit operated flawlessly. I'd give the unit itself 5 stars and the set up info 3 stars for an overall 4 star rating.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Bohne"}, {"rating": 4.0, "review": "This device does not have web browsing support. You cannot open a browser, or view any web page.  My corporate guest network requires a password (supported by Fire TV Stick) and then (normally) a browser window pops up where the user must accept the terms and conditions by clicking a button on a web page.  Fire TV Stick cannot display browser content, so the user cannot authenticate on my corporate network.  To use the device, I must use another network (like a phone's hotspot), which is inconvenient.So far, I found only CBS News for live TV news.  I haven't found anything like Fox or CNN live continuous streaming news.  Still, there are a few useful apps and plenty of access to Amazon content.I like it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Silicon Valley Reader\""}, {"rating": 5.0, "review": "Easy to set up. Easy to download apps. It is everything I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "Eric Robb"}, {"rating": 3.0, "review": "It is good but expected more apps.  Amazon prime app is available on other devices so I am expecting the apps to keep coming.Set up was very easy.  Movies look great in HD.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Just what I needed", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 2.0, "review": "Its OK amazon still charges to dam much for shows", "verified": true, "helpfulness": "0/1", "author": "cktech71"}]