[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Hendon"}, {"rating": 5.0, "review": "Yes, yes, yes - it works.", "verified": true, "helpfulness": "0/0", "author": "dotchris"}, {"rating": 5.0, "review": "Let met start by saying that I had a very specific purpose for this device.  I run a Plex Media Server and wanted to be able to access my library from a non-smart tv without spending 80-100 dollars to do so.  I didnt want Chromecast because I didn't want to use an android device to control it.The FireTV stick is EXACTLY what I was looking for. It's setup was easy, I got the plex app installs in minutes and was able to browse my library.  My only regret is thatbi didnt get two at the introductory 'for prime members' price.", "verified": true, "helpfulness": "0/0", "author": "Thomas Williams"}, {"rating": 4.0, "review": "This is exactly i ws looking for and i found it. At first i was thinking of getting the Roku but i saw tthe Fire TV Stick was coming out so i grabbed it and i'm happy with it. good price and it works flawlessly. I recommend this to every one.", "verified": true, "helpfulness": "0/0", "author": "Pedrito Lopez"}, {"rating": 3.0, "review": "needs some work before being a ROKU stick replacement.  Adequate for now lets hope the AMAZON brand trickles down to this and we dont wind up with another \"Fire Phone\".", "verified": true, "helpfulness": "0/0", "author": "Mario & Michelle Barros"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Ann C. Dorsey"}, {"rating": 3.0, "review": "I like the interface of the fire tv stick. It works well most of the time.It does seem to be a little underpowered. I would recommend the full fire tvover this.", "verified": true, "helpfulness": "0/0", "author": "T. Lindsey"}, {"rating": 5.0, "review": "Awesome device! No buffering and Tons movies and shows!", "verified": true, "helpfulness": "0/0", "author": "alexandria beare"}, {"rating": 4.0, "review": "I bought it to fill in a few gaps/deficiencies on my Vizio smart tv. The Amazon app is way better than the one native to my tv. I was really hoping that they would add HBO Go as an app to it since they have some sort of deal with HBO already. But, not so far.", "verified": true, "helpfulness": "0/0", "author": "Rex B."}, {"rating": 4.0, "review": "As far as these so called sticks go I do like the Fire TV Stick better than the other two that I own, the Roku hdmi stick and the google chromecast, but.....  The Fire TV Stick is faster, not much lag at all like Roku has and the google chromecast will only cast to your tv what you have on another form of media ie. computer, phone, or tablet.  If you are thinking of buying one of these to replace your cable or satellite tv then realize you will be truly limited on what you can watch.  From my experience over the last year or so, netflix and amazon prime are very limited on the movies, especially new ones that you can stream and therefore watch on the fire tv stick.  There are some free channels that you can watch, and a lot of pay channels if you want to.  I use the fire tv stick to browse and watch some movies sometimes from amazon prime and netflix, and there are some corny channels that you can watch on both roku and fire tv stick.  As far as the picture quality I do like the fire tv stick much better.  If you want to try a hdmi stick to watch tv the fire tv stick should be where you start, it is economical as well as very good picture quality.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]