[{"rating": 4.0, "review": "I do like the fire stick a lot after finally getting it to work after a lot of trouble shooting, and after buying a wifi extender so it could be used in an upstairs bedroom. But once we got it working it is amazing and I enjoy a whole lot and it's a joy to use and very intuitive", "verified": true, "helpfulness": "0/0", "author": "Jaimell Johnson"}, {"rating": 5.0, "review": "When I first bought the Fire Stick, I was unable to use it as my only internet connection was xfinity wifi. As you need to manually login to access xfinity, it did not work with the Fire Stick. Just an FYI -This plugs into one of the HDMI slots in the back of most if not all new flat screen TVs. It comes with a USB and charger that will need to stay plugged in to an outlet to provide power to the stick. I am not familiar with Roku or Chromecast, so I cannot speak to those, but I LOVE the Amazon Fire Stick. I can easily watch Netflix/HBO without having to go through my Wii or having to hook my computer up to my TV. There are a ton of apps you can download for free to add to your experience. My son loves watching Minecraft videos on YouTube, so that's his favorite aspect. He can now watch that on the TV rather than a small screen of a tablet or phone.I've had no issues and have been beyond pleased with the capability and user friendliness of this product. I highly recommend it! It makes cutting the cable cord so much easier!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have only had it for a week, but I am very happy with the purchase.  It really exceeds my expectations.  The remote is easy to use, and the quality of the streaming is excellent.  Thinking of buying a second one.", "verified": true, "helpfulness": "0/0", "author": "Debra James"}, {"rating": 5.0, "review": "We are very happy with the firestick. it is very easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "dco"}, {"rating": 1.0, "review": "This item does not work at all. Do not buy it. It is absolutely terrible. The wifi will be at full strength and it will lose the connection, it will buffer maybe 20 times during a 30 minute TV show. Overall this is a piece of trash. Thank you Amazon for the waste of $40", "verified": true, "helpfulness": "0/0", "author": "Conor Brennan"}, {"rating": 3.0, "review": "I'll start by saying I am not yet used to the Fire Stick and perhaps my opinion is jaded because of my familiarity with Roku.I find the Fire Stick is much slower to bring up programs.  There is far too much clutter on the screen, too many other programs seem to overtake my \"recently viewed\" or my list.  I am hoping I get used to all the clutter and can learn to disregard. I don't find the arrangement of information to be organized, for example, I have NetFlix, Amazon Prime, and the other streaming services such as Hulu etc.  They are all over the place so it is a hunt 'n peck to find something.I am THRILLED though with this feature -- when you are done watching a show, if a series, it goes right on to the next episode without the need of using the remote to select again (as with Roku).  This little feature along is worth all the other things I don't care for.", "verified": true, "helpfulness": "0/0", "author": "deborah"}, {"rating": 4.0, "review": "Serves my needs, works well but wish it provided more information on the fire sticks operation and which programs are eligible for viewing with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Susanne Nobile"}, {"rating": 1.0, "review": "I got a Fire Tv Stick for free for buying Dish's Sling Tv Program for 3 months... This Fire Stick is probably the worst product I have ever used. When I am watching programs with it, it seems to screw with the router. It will disconnect the fire stick and every other device using the internet. Then you have to forget the wifi network and then re-establish the network. Then it will take about 4 minutes to reconnect my other devices back to the wifi...I thought this was a fluke, but I have tried three different fire sticks... And it is not my router.... I play Xbox 1 and use my other devices all the time on wifi and never have problems..When ever I use the stick, it kills all the connections to every device..", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 3.0, "review": "We love our Amazon fire tv,but the fire stick still has some bugs to work out. It freezes or says it cannot connect after watching TV for a day. You ha e to disconnect the power entirely to reboot it. I'd also like to see voice search on the stock remote, makes searching so much easier.", "verified": true, "helpfulness": "0/0", "author": "elizabeth redding"}, {"rating": 5.0, "review": "Absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "Diana"}]