[{"rating": 5.0, "review": "I love the fire stick. All have to do is connect the stick to the HDMI than plug it to the outlet and update and follow directions on the screen. Really nice just like the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Tobias"}, {"rating": 5.0, "review": "Got the Fire Stick for my daughter and she loves it! Thinking of getting another one when they're not back ordered", "verified": true, "helpfulness": "0/0", "author": "Rafael Hernandez"}, {"rating": 1.0, "review": "didn't like it.", "verified": true, "helpfulness": "2/8", "author": "Lakshmi Narayana Gupta Kollepara"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Robert Martin"}, {"rating": 5.0, "review": "It was a good buy. Good remote and the remote app on smartphone is fantastic. Only drawback is, can't cast videos from chrome based phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Doesn't work with HBO Go, Starz Play, or Showtime Anytime (with a comcast account).  Chromecast works with all three.", "verified": true, "helpfulness": "2/2", "author": "Chris Labbe"}, {"rating": 1.0, "review": "Not as mature as chromecast and apple tv . not happy with the performance.", "verified": true, "helpfulness": "4/6", "author": "Sandeep"}, {"rating": 1.0, "review": "Pros:Looks nice,easy setupCame with HDMI extender cable, This is needed due to the design of the Fire stick and my Samsung Smart TV.Navigation was easy with remote while it worked on day 1. Pressing the amazon remote will also start up my TV if it was off.Cons:It's not working on day 2 and onwards.Loses network connection to WiFi. My router is sitting just next to TV and WiFi works fine for all other phones/  laptops. So it's just this Fire stick.Remote will not respond or will just work on its own. This makes it totally unusable. When I press Up button once it will go all the way up to the Search menu and will be stuck there.When I press Down button it will scroll all the way down to the last menu item.I was really looking forward to use it and keep it. I tried resetting / rebooting the fire stick. Also removed batteries in remote and put it up again. But that didn't help.Youtube app is not as good as the native app I have in my Samsung SmartHub. It shows low resolution video and also keeps showing ads. The SmartHub youtube app doesn't show any ads.I am better off with just the apps in Samsung SmartHub. Only problem with it is it takes a few seconds to load every time I start TV.I thought having a dedicated device will be helpful as it will instantly load up youtube and other apps when I turn on TV. But unfortunately this device didn't work.Though I got it just for $20, I am going to return it now. This is not worth it.", "verified": true, "helpfulness": "8/11", "author": "Soulmate"}, {"rating": 1.0, "review": "No problem connecting the TV Stick to a Pioneer receiver but the remote is a piece of junk.  Like one of the reviewer has stated: \"It's either non-functional or would cycle through the menus at lightning speed\".", "verified": true, "helpfulness": "1/4", "author": "Howie"}, {"rating": 5.0, "review": "It works really well. Very cheap alternative to buying a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Mx"}]