[{"rating": 5.0, "review": "My wife and I have really enjoyed our Fire Stick.  We use it with our Sony 47\" in the bedroom, which is a Smart TV, but this is simply more convenient and brings the Google TV integration into our bedroom.  Love being able to swipe from our phone just about any media we want, and then access additional Apps that aren't on the TV.  It does come with a power USB cord that can be used to power the stick from the TV, rather than the wall.  That said, it does take time to boot up as it's only powered when the TV is on.  We have the Asus Cube in the living room which is also fantastic, and I've used the Chromecsast.  The thing that I like about the cube is that it has a mouse pointer option and a Qwerty keyboard on the back of the controller.  The thing I like about the Fire Stick is that it is very Amazon friendly and the user interface is similar to that of Netflix.  Other than that, they are all quite similar and you can't go wrong with any of them.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Yokus"}, {"rating": 5.0, "review": "Great job on this Amazon really efficient but only problem is the remote control is to small. A little bigger will be nice.but overall AMAZING job", "verified": true, "helpfulness": "0/0", "author": "Delvin"}, {"rating": 3.0, "review": "This product is ok but the picture skips a lot", "verified": true, "helpfulness": "0/0", "author": "Suzanne B."}, {"rating": 1.0, "review": "Used it for the first time. In the first 5 mins it froze and restarted it self.  Tried it for 30 mins and it restarted or froze 10 times while stating wifi connection issues.  Move it next to the router and still occurred.  Also tried different power supplies and connecting usb into the TV.  Getting a replacement sent to see if I just got a lemon.", "verified": true, "helpfulness": "1/2", "author": "TwoPeasInAPod"}, {"rating": 4.0, "review": "it turns off every time the TV pauses or is turned off. I have to continually adjust the volume for different applications or stations that I watch. At that point I have to find out which remote will adjust the volume. for some reason I have four remotes associated with my fire stick and I have been unable to find a way to correct that the system will not connect to the Internet without errors", "verified": true, "helpfulness": "0/0", "author": "pj"}, {"rating": 5.0, "review": "Very happy with it so far.  Remote is easy to use and easy to navigate offerings.", "verified": true, "helpfulness": "0/0", "author": "flygirl"}, {"rating": 5.0, "review": "Luv it...", "verified": true, "helpfulness": "0/0", "author": "Ofelia"}, {"rating": 2.0, "review": "The HD quality is very disappointing.  It never really clears up.  I compared The Fire TV Stick head-to-head to Chromecast on my TV and the Chromecast won hands-down every time.", "verified": true, "helpfulness": "0/0", "author": "SEOMike \"SEOMike\""}, {"rating": 5.0, "review": "If you've not purchased a streaming stick yet, and you're a Prime member, the Fire TV Stick is the one to buy.", "verified": true, "helpfulness": "0/0", "author": "Kregg"}, {"rating": 5.0, "review": "Very happy with the fire stick, works really well, there on screen layout and menu are great. Works much smoother, and the remote functions seem to be much more responsive than with my Roku stick", "verified": true, "helpfulness": "0/0", "author": "steven hall"}]