[{"rating": 4.0, "review": "I bought this product to maximice the benefits of my prime account but it was very desapointing to find out that only works on the US. Now, i will not renew my suscription because of this, but other than this, the hardware itself do pretty much as espected to", "verified": true, "helpfulness": "0/0", "author": "Héctor Vera"}, {"rating": 5.0, "review": "I currently have 2 apple TVs, All the current and Last Gen Consoles, and a Playstation TV.  I had another room in my house that I wanted to get connected to the apps provided by these devices.  I also didn't want to pay the full price of the Apple TV again as well for a supplimentary device(only going to be used by guests).I then debated between chromecast and fire TV stick.  I just wanted a more budget option.  The biggest seller for me was I didn't want people to have to use their smartphones in order to use the device while they visiting.  Enter the Fire TV Stick that met all my needs of being a smaller device like the chromecast, and also have a remote!After booting it up, I really like the interface.  It's sleek and works well.  I also like that this has the Hulu app that allows the \"New Episode\" tag to appear on icons unlike the apple TV.  Another thing that matters to me is that it comes with Amazon Instant Video(of course being made by amazon) which is one of the apps the apple TV lacks.I actually debated switching one of my apple TVs with this due to the different features it allows and just an interface that I prefer more.  I couldn't be happier with the Fire TV Stick and if I need to get another device to do this task it will definitely be another one of these.  The price is great and the product is solid!", "verified": true, "helpfulness": "0/0", "author": "MSMJ Shaffer \"FMZ\""}, {"rating": 5.0, "review": "It's just great.  But I would love more apps.  Like vudu and hbo go.", "verified": true, "helpfulness": "0/0", "author": "boodydag"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Dalia Hunt"}, {"rating": 5.0, "review": "Love the new item!!!", "verified": true, "helpfulness": "0/0", "author": "desirae"}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Robert D. Steinmetz"}, {"rating": 5.0, "review": "Absolutely fantastic!", "verified": true, "helpfulness": "0/0", "author": "David Kennedy"}, {"rating": 5.0, "review": "Excellent dongle for video streaming. Own both Chromecast and FireTV Stick. Find the Stick not only has all of the features that the Chromecast has, but also the ability to install apps on it. The Stick can operate independently and requires no mobile device to control it. Very snappy and easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Anthony Le \"technology lover\""}, {"rating": 3.0, "review": "its ok.  connection problems, even after cable company came and checked system and replaced our older wifi box.  works well when working.  have prime.  needs better quality movies.  another subject for another day.", "verified": true, "helpfulness": "5/5", "author": "don cardoza"}, {"rating": 5.0, "review": "Great invention. Easy to set up and operate.", "verified": true, "helpfulness": "0/0", "author": "LauraP"}]