[{"rating": 5.0, "review": "Tried to set up on day of arrivai, but was not able to connect. Got messge that my account was not recognized. Tried again next day, and setup was smooth and uneventful. Apparently it takes a whole day before your Amazon Prime account gets recognized by Firstick. Streaming was very good, no stop and go's.", "verified": true, "helpfulness": "0/0", "author": "Max S. Teng"}, {"rating": 5.0, "review": "I had purchased the Amazon Fire TV some months ago and was pleased with it. When it came time to get something for another room TV I went with the Fire Stick. I opened the box and had it running in about ten minutes tops. It works great. I do miss the voice control so that may be next.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Easy to install and use! Works great", "verified": true, "helpfulness": "0/0", "author": "K. Woxland"}, {"rating": 5.0, "review": "Love it! Very easy install and setup. Works great and remote is easy to use. My apps on Samsung Galaxy Tab A including the Amazon Fire app, YouTube and Netflix immediately recognized the Fire TV Stick after installed and easily integrate with and use it to display on and interact with tv. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Pen"}, {"rating": 5.0, "review": "Great product. Blows Chromecast away", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"cuthbertalain\""}, {"rating": 5.0, "review": "Easy to install and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Linda J Labraney"}, {"rating": 5.0, "review": "A few glitches signing in to Netflix but once everything was set I was well pleased. Having Prime is well worth it and I am glad I chose Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "charles voos"}, {"rating": 5.0, "review": "So far, so good!  We love the Fire Stick.  It's really easy to use and has a huge selection of movies and shows to choose from.  We are not super \"techy\" people, but I am impressed with how my Kindle Fire is synched up with the stick.", "verified": true, "helpfulness": "0/0", "author": "Angela O'Donnell"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "christian d mcclarty"}]