[{"rating": 2.0, "review": "You have to subscribe to prime to get anything good", "verified": true, "helpfulness": "0/0", "author": "tina dillow"}, {"rating": 5.0, "review": "Easy to set up and use.  Only problem has been my WiFi's occasional weak signal which causes an interruption in viewing.", "verified": true, "helpfulness": "0/0", "author": "Carolyn S. Devine"}, {"rating": 5.0, "review": "This is a really cool device!  And with Prime, there is a ton of content to enjoy.  I'm yanking the cable TV and will enjoy commercial-free programming now.", "verified": true, "helpfulness": "0/0", "author": "bentprong"}, {"rating": 5.0, "review": "Love this! So easy to set up too. Now I can have my favorite apps plus Netflix and prime movies on my smart tv!", "verified": true, "helpfulness": "0/0", "author": "Dawn Autry"}, {"rating": 5.0, "review": "I was able to get this during the introductory sale for $20, but I'd say it's a great buy even at the full $40.This will turn any display with an HDMI port into a great way to watch streaming content (assuming you also can get sound from that display).  There are a number of hardware options for streaming content, and this is one of the good ones.  I have it plugged into an older Panasonic plasma that is wall mounted in my office, and it's tucked behind the TV and out of sight.  Sure, there's still the power cord for this, but I have it tied up against the TV power cord.Navigating through the menus is very fast, and it starts to play videos quickly, too.  My main reason to get it was for streaming online videos, but I've also used it for Prime Music - which it also does a great job with.  I haven't played any games on it, yet.You can also load other applications on it.  I know folks that have sideloaded Kodi (formerly XBMC) home theater software on it, and they seem very impressed by the Fire TV Stick's ability to handle it.  I haven't loaded it, yet, but I plan to.I love the RF remote (i.e. you don't need line of sight to the stick to control it).  It's just so easy to use, and I'm slowly breaking my habit of pointing the remote in the direction of the device - because you don't need to.  Granted, an RF remote was a requirement for any stick that would be hidden behind a TV...but I still love it.  :)The one nit that I have is that videos are initially lower resolution when they start playing.  That's the trade off for starting up a show very quickly without much buffering - it starts to play, and then catches up with the buffer for the higher resolution.  If you're internet is fast enough, you may never notice this.  I have ~35 Mbps download speeds, but I get lower resolution for a few seconds when shows start.  I wish there was a setting (and maybe there is and I haven't found it) to force it to buffer, as I'd rather wait another few seconds and get high def right from the start.All in all, I'm highly impressed.  I bought it on a whim and expected it to serve little purpose for me, but I was happily proven wrong.  It is incredibly handy in my office and works astoundingly well.  I very much recommend it.", "verified": true, "helpfulness": "1/1", "author": "Adam Wood"}, {"rating": 5.0, "review": "This is the best device for streaming a bunch of services, and games and apps, I'm really amazed of the capacity of this little stick, it needs to be connnected to ac power at all time, easy setup, easy to navigate, perfect option if you don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Andres"}, {"rating": 5.0, "review": "Simple to use. No more looking for lost controller now that my kindled and phone can operate it.", "verified": true, "helpfulness": "0/0", "author": "Brett Ackerman"}, {"rating": 4.0, "review": "Love my Amazon stick, Only wish there were more movies available that I like,", "verified": true, "helpfulness": "0/0", "author": "Joi1960"}, {"rating": 5.0, "review": "Works as it should, very easy to set up..just follow the directions!", "verified": true, "helpfulness": "0/0", "author": "Millie \"Millie\""}, {"rating": 4.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Jared Orgeron"}]