[{"rating": 2.0, "review": "I guess I missed the fine print that you could not mirror from an iOS device.  My bad.", "verified": true, "helpfulness": "0/0", "author": "R. Paul Yuncker"}, {"rating": 3.0, "review": "It's a great little device that brings all your TV and movie needs into one. It's  easy to setup  and navigate. At times it can be slow or stop altogether which is a bummer and the in no definitive way to turn it off. You have the option of going into the setting menu and putting it to sleep or unplugging the power supply. It would be nice to have something on the main menu or even the controller to turn it off/put it to sleep.", "verified": true, "helpfulness": "0/0", "author": "Aaron Moore"}, {"rating": 5.0, "review": "I appreciated the instructions that said that the set up connection would take a few minutes. That helped to not worry everything was OK because the set up did in fact take almost 10 minutes.The interface is just like the Kindle and it is very snappy and responsive to flipping through movie/tv options. The app download of Netflix went easily and that app maybe doesn't load quite as fast as Amazon movies but it is still pretty snappy.Overall this was a great low-end tech investment. We were using an HDMI cord from our computer to our TV so the biggest appeal for us with this device was the remote.Great product overall and for the price point (which we purchased under a special Prime member-only sale) was fab.", "verified": true, "helpfulness": "0/0", "author": "Wendy E. Almeida"}, {"rating": 5.0, "review": "Works perfect. Much better then having a box", "verified": true, "helpfulness": "0/0", "author": "michael bradley"}, {"rating": 5.0, "review": "Super easy to set up and navigate content. Couldn't ask for any more at this price!", "verified": true, "helpfulness": "0/0", "author": "Gary Reakes"}, {"rating": 5.0, "review": "Finally, after waiting for 3 weeks after ordering, the stick got here! I already have a couple of Rokus, a couple of smart Blu Ray players, and a chromecast, so when I saw this deal, I almost passed it up, but then sense prevailed and clicked on the order button. Was a little disappointed when the local Best Buy had it in stock and mine still wasn't shipped, but decided to wait it out and it finally got there (to be fair, it got there a week before the promised date, so I shouldn't really complain).Once I plugged it in, configured the Wifi connection, all seemed to go well until it went to download the latest software. Unfortunately no matter what I tried, it kept failing to download. I gave up initially, had some dinner and a couple of hours later took it down to my basement and hooked it up to the projector to try again (thats where I wanted to put it in the first place anyway - but was trying on my TV upstairs which is a few feet away from the Wifi router). However, this time everything went smoothly - the download took some time but succeeded and I got the intro video. Did some research and downloaded some apps, games, sideloaded XBMC, and everything works more smoothly than I imagined. I did use the power supply that came with it, and also the HDMI extender that came with it. Not sure if makes a difference, but I have been enjoying the content for the last week - no stutters on Amazon prime content - built in movies, TV shows, Amazon music, Photos - everything was already pre-configured to my Prime account.I think its an awesome deal and a much better deal than the Chromecast which is more of a novelty compared to the stick. I think the wait was worth it.", "verified": true, "helpfulness": "0/0", "author": "Amdroid007"}, {"rating": 4.0, "review": "Easy to setup.  Only using it for a couple of days.  Works great so far.", "verified": true, "helpfulness": "0/0", "author": "Don D"}, {"rating": 3.0, "review": "Would not work right thru TV, picture but no sound.  Had to route it thru my yamaha amp to get both, but it seems to work ok there.", "verified": true, "helpfulness": "0/0", "author": "Melvin C. Woda \"Mel W\""}, {"rating": 5.0, "review": "Other than some problems that originated from my ISP, I love this little doohickey!!!  Navigation is smooth and intuitive, the movies that are selected on Netflix boot-up and start very quickly, and the image quality is more than acceptable for my needs.  Overall, I consider the purchase to have been a good one.", "verified": true, "helpfulness": "0/0", "author": "Sylvester Simons \"Mazlow7\""}, {"rating": 4.0, "review": "Very easy to setup.  Needs VuDu as an additional service.", "verified": true, "helpfulness": "0/0", "author": "Bob Castellano"}]