[{"rating": 4.0, "review": "This was my first time using a streaming device for our tv and I like it. I am not the most tech-savvy person and this was pretty simple to use. The most difficult thing about this was trying to get the back of the remote off to put the batteries in. It was surprisingly difficult to remove, but after looking it up on the internet, I was able to remove it. That definitely needs to be fixed.The name \"Fire TV Stick\" is totally appropriate because I always feel like my device is going to catch on fire from being so hot. I read online that it is fine to leave it plugged into the tv, but I feel like I need to unplug it after each use due to the extreme heat. Not sure if this is a defect or it I just watch too much tv at once. I promise you, I do not sit in front of the tv all day, but I do tend to watch a few episodes of shows after my child goes to bed.Overall, I am happy with my Fire Stick and feel like I am in the loop now, so thank you, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Flora"}, {"rating": 4.0, "review": "Prior to purchasing the Fire TV Stick I had the Apple TV and the Chromecast.  I bought the Fire Stick because I was consistently running into issues with the Apple TV needing to buffer.  I noticed a big difference in speed with the Fire Stick, it seems much quicker.  My one complaint would be certain shows seem to freeze for a few seconds every once in awhile.  If I turn the power off to the Fire Stick it seems to resolve this issue for awhile.  Currently I still have all three devices hooked up to different TVs but the Fire Stick is on my main TV, the Chromecast on my secondary TV, and the Apple TV on one I hardly use at all.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "LOVE - LOVE - LOVE !!!I even purchased a 23 inch Led TV to go with it, I just take it to whatever room I want! Love the selection.You can watch a whole series very easily!!! I love watching movies in the bath, so I have this securely on a cart and just roll it in! with the remotes, the tv stays well away from the tub and I can just relax and watch a movie!", "verified": true, "helpfulness": "0/0", "author": "Jill Mitchell"}, {"rating": 5.0, "review": "Easy install.  User friendly home page.  Quick downloads.", "verified": true, "helpfulness": "0/0", "author": "Funrn 0"}, {"rating": 3.0, "review": "I had a lot of trouble setting it up.  Its still not on the Internet choice I wanted it to be on.  It is interfering with the speed of my internet service.  Now my digital cable tv is buffering.  Playback of netflix movies in same room on Firestick are buffering and same movie same connection not buffering on computer use.  I'm going to take it up and see how it works on my grandson's tv on another internet service provider.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My Family Loves This Ideam", "verified": true, "helpfulness": "0/0", "author": "Dustin Whitworth"}, {"rating": 4.0, "review": "There was a variety of pre-recorded programming.  However, I was expecting something that would receive and play live or remote cable TV broadcasts.", "verified": true, "helpfulness": "0/0", "author": "Albert W Frantum"}, {"rating": 5.0, "review": "5 star", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 4.0, "review": "Just do yourself a favor and buy this if you're on the fence. It works great. It's not expensive. The only drawback is that there is no Fire TV Stick app available for Windows Phone 8.1, which is disappointing. I'd love to be able to use my Windows Phone to type search terms in the Fire Stick apps.I also use a Roku on another TV. I kinda like the Roku remote better compared to the Fire TV Stick, and the Roku Windows Phone 8.1 app works even better than the remote. The Roku is more expensive, however.Toss a coin if you have to. Either way, you'll be happy.", "verified": true, "helpfulness": "0/0", "author": "DinoZuma"}, {"rating": 4.0, "review": "Very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Vanessa L. VanStee \"sneezedoc\""}]