[{"rating": 1.0, "review": "This thing is truly terrible. I have had it for 6 months now and I reget not upgrading to a new Roku box. It has a piss poor wifi radio and I constantly have to reboot. Buffering constantly! Concept was good and hardware looks nice, but definitely under performs. I have always been a big Fan of Amazon, but they missed the mark on this one.", "verified": true, "helpfulness": "0/0", "author": "Katie Mailloux"}, {"rating": 5.0, "review": "This thing rocks!!!", "verified": true, "helpfulness": "0/0", "author": "Ryan Salazar"}, {"rating": 1.0, "review": "Complete garbage that I can't watch movies that I bought from the Google play store on this.  Had I known that I would have bought a roku instead.  Or at least something not so locked down.  It's all Android so amazon will use Google open source os but not allow paid services on it.  God forbid there is a little competition. This is the last time I buy any fire products. It's too locked down monopoly like", "verified": true, "helpfulness": "0/0", "author": "ed"}, {"rating": 5.0, "review": "AMAZING PRODUCT. LOVE IT.", "verified": true, "helpfulness": "0/1", "author": "paulo"}, {"rating": 5.0, "review": "¡Great Product¡", "verified": true, "helpfulness": "0/1", "author": "Elvia"}, {"rating": 4.0, "review": "Great Product, once again Amazon wowed!!", "verified": true, "helpfulness": "1/1", "author": "shoppa1999"}, {"rating": 5.0, "review": "Love this thing, works great. I have a Samsung tv with Netflix but I prefer the version of Netflix on the fire stick. Plus you get amazon prime movies, shows, music, and all kinds of other tv station apps to watch free tv. Really can't beat it for the price", "verified": true, "helpfulness": "1/1", "author": "Mitch Conner"}, {"rating": 5.0, "review": "Bought this during the \"big sale\" because my fiance' kept raving about how it was awesome and he wanted one. I have come to love it as well. Very easy to use. No issues using it with the remote. I use it with my Samsung 46 inch TV and it works perfectly. I can play my Amazon music that I purchased through the app that is installed on the stick and have mini concerts in my room. I can watch all the Amazon Prime videos and the instant ones. I think for the price paid, it was a great investment.", "verified": true, "helpfulness": "1/1", "author": "Keedyboo"}, {"rating": 3.0, "review": "What's with the screensaver activating while I am watching a movie???", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 5.0, "review": "great way to view prime video, digital purchases, and listen to music via amazon music", "verified": true, "helpfulness": "1/1", "author": "jt"}]