[{"rating": 1.0, "review": "Followed instructions but it will not work. Referred me to Amazon.com but I cannot find a number to call or what to do. I have unplugged it several times but it still will not load. It says I am connected to internet.  Guess I will return it.", "verified": true, "helpfulness": "3/3", "author": "Niklee"}, {"rating": 3.0, "review": "Everybody has the same stuff.  If it's interesting you will have to pay, and pay, and pay for it.", "verified": true, "helpfulness": "0/1", "author": "Walter Prochorenko"}, {"rating": 2.0, "review": "Fast and easy to use. Good Wi-Fi reception.However, no support for YouTube. I know Google (Owns YouTube) and Amazon are fierce competitors, but I want, and expected, to have a YouTube app. When companies try to hurt each other, we, the consumers lose. Wise up Amazon.I WANT MY YOUTUBE!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer \"Savy Shopper\""}, {"rating": 5.0, "review": "This is an awesome item to have! It works really fast and easy to use. the games are also fun to play and music streaming is great too.", "verified": true, "helpfulness": "0/0", "author": "gloria"}, {"rating": 4.0, "review": "So far, the Fire TV Stick seems to have been a good deal for $20.  I'm not sure I'd feel that way if I'd paid $40 for it, though.  It has a few drawbacks that have me scratching my head.  First off, it doesn't play well with others.  The closer it is to my TV, the more feedback I get in the form of alarming beeps and boops and buzzing.  It isn't  constant, but it was often enough that I've plugged it into an HDMI hub and moved it off to the side which has cut the incidences significantly.Second is the user interface.  It's pretty, but like a lot of things created by Amazon, it seems badly thought out in certain areas.  Obviously the bulk of the thought went into presenting the Amazon's Prime and Cloud Drive offerings, and they're reasonably good, but when you get to the Apps section, you have to scroll through all of your apps to find the one you want.  There's no way to organize them.  Finding them originally isn't a problem, but once you've added them to your Stick, then it's a long slog through however many you have.  Some of the apps behave oddly too.  Amazon music goes on playing unless you hit the pause button.  Everything else stops cold when you back out of it.I think the app that bothers me most, though, is Spotify (I'm sure there are other ones that share this drawback, but I've not encountered them yet.)  In order to use Spotify on my TV, I have to run it on my phone.  Um... no, I'm not going to sit here and run down my phone battery to play music from my Spotify account on my TV.  I'll just listen on my computer.  Thanks very much.  What's up with that?  However it's nice to see that I can finally access my movies in Flixster with the Stick.The remote?  Well it's... okayish.  No volume control at all, which means it's not a stand-alone remote by any stretch.  That's fine, I suppose, but I hate juggling multiple remotes for one source.I know this sounds really complain-y for a four star review, but I really do like the Stick.  If I didn't like the options and the quality, this would have been a three-star review at most.  But access to my photos, my music, my Prime stuff for $20?  I'm content.", "verified": true, "helpfulness": "0/0", "author": "Tracy Rowan \"Tracy Rowan\""}, {"rating": 5.0, "review": "I love it.  It has been great to have access to all of my Amazon stuff on our tv.  We used to use a gaming system to watch Netflix and Hulu, but with this tv stick I was able to clean a lot of the clutter off my tv cabinet.  This stays plugged in to the tv neatly, and takes up no space.  It was easy to set up and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dory Gale"}, {"rating": 5.0, "review": "I've at one point or another had every streaming device from Apple TV to google chromecast to fire TV and the best thus far is the fire stick! I say this because the games alone blow the Roku out of the water and the selection of games are amazing. I'm a prime member and have been for years! Amazon is my go to, one stop shop for anything and nearly everything I could ever need... Great job! Only complaint is that the Apple iOS app is currently unavailable but I know it's in the works so not really a mark against the device!", "verified": false, "helpfulness": "1/1", "author": "J. Stromgren"}, {"rating": 2.0, "review": "As Prime Member, read about and saw availability and sale price at Best Buy so returned unopened Roku3 and purchased and  installed Stick. on Bedroom non-smart TV. Very pleased.with initial installation, even recommended purchase to friends but in 2-3 days stick performance became unstable as it  would not recognize my network. Maybe just a fluke but Returned Stick to Best Buy and repurchased highly rated Roku 3 with extended warranty at Target Three times the price but feel more confident about product. Works great with network. Because I have I-pad and I-phone, would have purchased Apple TV if it had Amazon Prime accessibility.", "verified": false, "helpfulness": "0/1", "author": "Captain Nemo"}, {"rating": 5.0, "review": "Impressed with streaming. Streams better than iPad or computer over same network. I have not seen any buffering as of yet. Makes for an enjoyable movie experience.", "verified": true, "helpfulness": "0/0", "author": "m2surveyor"}, {"rating": 1.0, "review": "Useless for iOS", "verified": true, "helpfulness": "1/2", "author": "RealTime_Review \"Electronics Geek\""}]