[{"rating": 5.0, "review": "It's amazing, great quality, very easy to install", "verified": true, "helpfulness": "0/0", "author": "vickyvicks \"Vicky\""}, {"rating": 1.0, "review": "This thing works great, until it doesn't work. We were impressed by the streaming quality until the grey static screen showed up on our TV. This HDMI port on our TV always works without any issues with our Bluray player. The Fire TV won't stay on for longer than 30 minutes at a time so we still haven't finished watching this 007 movie. Is this a defective product that needs to be returned or is there something else we can do?", "verified": true, "helpfulness": "2/3", "author": "Annie T Yoshiyama"}, {"rating": 1.0, "review": "Without Prine membership it's worthless. ChromeCast is better for my use.", "verified": true, "helpfulness": "3/5", "author": "Alejandro najera"}, {"rating": 5.0, "review": "Really happy with this purchase. This item is cheap enough that I can put one on all of my tv's. I love the fact that I can quickly take my amazon library with me to a family members house. It comes with a power adapter but I was able to just plug the unit into my USB slot on my tv. I also have the roku stick and I prefer amazons stick due to the price.", "verified": true, "helpfulness": "0/0", "author": "Adrian R."}, {"rating": 5.0, "review": "Great product. Easy to set up/use", "verified": true, "helpfulness": "0/0", "author": "Abby Petrullo"}, {"rating": 4.0, "review": "It has same function as my Fire TV but wireless only.  I have not had the same success with Plex as I have with the hardwired Fire TV but that may be my wireless router.", "verified": true, "helpfulness": "0/0", "author": "beazle"}, {"rating": 4.0, "review": "Excellent device", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Jim's E-Store\""}, {"rating": 5.0, "review": "Pros:-The interface is easy to navigate, it is a bit too easy to buy things but you can set a pin for purchases and allow videos to play without requiring the pin, which negates the issue.-Good quality even streaming on my low speed connection (2mbs), wifi connected well, operated for hours without any issues.-I don't mind having to plug into power and HDMI, I wont be moving it so it's no big deal.-The remote is simple and works. Haven't used the app yet, but it looks promising.-Auto-next video is great for TV shows.Cons:-It doesn't work with \"captive portal Wi-Fi sign-in\" YET... this would be AMAZING for my hotel room", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 1.0, "review": "Have several Kindles and other wireless devices that work just fine from our 12mbps router but the FireStick will only work within 10 ft of the router...so unless your TV is in the same room as your WiFi router you're toast. All this confirmed while trying to trouble shoot with Amazon Tech Support on the phone...reset to factory sets, reboot ...everything and no cure.  Will not stream content...even though our cheap little Samsung WiFi ready BluRay player (and all other devices) does it just fine from over 30 ft away. Way too weak an WiFi antennae in this thing...not like their excellent Kindles. Extremely disappointing.", "verified": true, "helpfulness": "163/186", "author": "Suzanne Appenzeller"}, {"rating": 5.0, "review": "I think this is great.  I haven't watched this muck tv in years.", "verified": true, "helpfulness": "0/0", "author": "goliva46"}]