[{"rating": 5.0, "review": "Excellent product easy to install took less than five minutes to get everything taken care of so it wouldn't work immediately would highly recommend it to anyone who has Amazon products or who doesn't it say an excellent utility to help watch all those movies and TV shows there to like so well", "verified": true, "helpfulness": "0/0", "author": "Marekate"}, {"rating": 4.0, "review": "I'm very happy with my FireTV stick. Easy installation, crisp picture and no freezes. Some cable apps (A&E;, ESPN, etc) need authorization codes to work and my cable company, Charter, is not an available option so I didn't give the stick 5 stars, but I'm happy with it otherwise.", "verified": true, "helpfulness": "0/0", "author": "Irene Ilmonen \"CMIRily\""}, {"rating": 5.0, "review": "A perfect way to watch movies we have been waiting to go to dvd.  Instead I can watch on my kindle fire HD or on their tv.  I can control what and when I want and with prime it is all free!!", "verified": true, "helpfulness": "0/0", "author": "Phredd"}, {"rating": 5.0, "review": "I'm loving this thing!  It works so much better and faster than my BluRay player.  I've watched many things on Amazon Prime (I've been a member for years), Hulu, and Netflix.  Absolutely no glitches or hiccups or problems.  I only hope I don't end up going over my \"allotted\" download limit with Comcast.", "verified": true, "helpfulness": "0/0", "author": "D. Calloway \"AVID reader\""}, {"rating": 5.0, "review": "B", "verified": true, "helpfulness": "0/0", "author": "michael kevin morrison"}, {"rating": 5.0, "review": "This thing is amazing!!  Needed this awhile ago.  Did exactly what the instructions said and BOOM, instant connection to my Prime account.  The best thing was it arrived Christmas eve.  When there's nothing on TV, which there often is, this gives you other choices.  I have Prime and Netflix.  Plan on using this stick a lot!!", "verified": true, "helpfulness": "4/4", "author": "William Jones"}, {"rating": 2.0, "review": "This is the best, and the price and ease to use are the best too. Great selection of viewing material, LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Joe Haas \"papa joe\""}, {"rating": 3.0, "review": "I live in a rural area where DSL and cable are not available, so my \"high speed\" Internet is not that great.  I have tried to stream shows and movies with a smart tv and with an iPad, but my internet will not keep up with either because I cannot manually buffer.  With our Kindle Fire, though, I can pause the show for 3-5 minutes and can watch for at least an hour with decent quality and never have to rebuffer.  I was excited about the Fire Stick because I thought it would work the same way and that we could finally stream to our tv.  However, this does not seem to be the case because no matter how long we pause the show, it does not continue to download so we are in a constant state of rebuffering.  I am still working to try to figure it all out, but as of right now, I am very disappointed.My other complaint, which is also caused by our slow internet, is that the menus are slow to load, so if you are browsing for a show before it all loads it jumps back a level when more of the menu does load.Update:  It appears that the shows do continue to upload when paused, but the status bar does not indicate that this is happening.  Additionally, I cannot tell if it will continue to the end of the movie or if it will only go so long.  We kept one movie paused while we watched an entire DVD movie.  When we started back with the Fire Stick movie, it had to buffer about 20 minutes in but then showed the rest without rebuffering.  Not completely sure if it is our Fire Stick or our Internet.", "verified": true, "helpfulness": "3/6", "author": "Lance Boyer"}, {"rating": 3.0, "review": "The jury is still out on the fire stick. It has trouble catching up with wifi, unlined our Wii, which does just fine. I bought this because my second player does not have the amazon app. I do like that music plays with words on screen so you can karaoke or sing along. I have this plugged into the aux video hdmi input on out denon home theater system.", "verified": true, "helpfulness": "0/0", "author": "PlantationGal"}, {"rating": 4.0, "review": "easier to search than Apple TV - easy to set up", "verified": true, "helpfulness": "0/0", "author": "AC"}]