[{"rating": 3.0, "review": "I purchased this unit to unify my streaming experience on my TV. Between netflix, HBO, and Prime video, this product looked promising. You have to download the apps to the stick which only took a few minutes to install. Streaming from all services except for Plex worked seamlessly.My main complaint is that playing back content from my local Plex server is a constant struggle. I can't watch anything from plex without there being dropped frames or long spans of buffering time. In contrast, I have a Raspberry Pi configured with RasPlex to watch Plex content which works seamlessly with much less hardware than this FireStick has. With the specs of the FireStick, I would have hoped for better playback from Plex. This could be an issue with the Plex app and not the hardware itself, but I want to share my experience with any other users looking for a Plex front end.If you want a cheap Plex front-end, look elsewhere. I am thrilled with RasPlex on a Pi. This product is more intended to stream commercial services.", "verified": true, "helpfulness": "1/1", "author": "Luke20333"}, {"rating": 5.0, "review": "Turned my 6 year old TV into a Smart TV. So easy to install and use it took longer to get the ladder from the garage to reach the wall mount TV.", "verified": true, "helpfulness": "0/0", "author": "John W. Baker"}, {"rating": 1.0, "review": "I got this as a gift to replace my Roku.  It will not stay connected and buffers every minute or two. I did not have this problem with the Roku, which I unfortunately gave to my daughter.  Don't waste your money.  Roku may cost a bit more, but at least it works.", "verified": false, "helpfulness": "1/2", "author": "Stacyj"}, {"rating": 5.0, "review": "amazing", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 3.0, "review": "When it works it is good. Disappointed in how many shows need to be purchased separately. Also that the connection to my wi-fi has failed for two days with the stick yet my tablet picks up signal just fine. A lack of technical support also seems to be present leaving the stick useless to me at this time.", "verified": false, "helpfulness": "0/0", "author": "Bronwyn Hawke"}, {"rating": 5.0, "review": "I tried the Google Chromecast, I didn't like it one bit. I bought one of these, and then I bought 2 more! I love this product! Excellent job Amazon in providing one of the best streaming television platforms ever!!", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "Super easy to use. Love it.", "verified": false, "helpfulness": "0/0", "author": "Pamela J Bourke"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Chad Stewart"}, {"rating": 5.0, "review": "This item is more convenient than the original Fire TV.", "verified": true, "helpfulness": "0/0", "author": "?"}, {"rating": 4.0, "review": "nice to have as a companion to Prime - slightly sluggish to use", "verified": true, "helpfulness": "0/0", "author": "Mike Markot"}]