[{"rating": 2.0, "review": "Worked for a while,now cannot connect to the internet.", "verified": true, "helpfulness": "0/0", "author": "denis lemek"}, {"rating": 5.0, "review": "Totally love it! Lots of movies; especially with Prime. Also found some travel guides that were helpful for a trip outside of the Country.", "verified": true, "helpfulness": "0/0", "author": "Lori L. Wiese"}, {"rating": 4.0, "review": "I think my fire TV stick is fantastic. With all the free apps at your disposal you'll never run out of things to do, especially when they're that much fun! It's really a high-end media player for your TV. Movies TV photos and music and much, much more!. Share data with your mobile phone and your friends mobile phones or other android devices. You can download data from your computer right into your fire TV stick  Thank you. Oh by the way, you can upload data from your PC or Mac computer to a cloud storage device so you don't have to use up your internal memory which you can access from your fire TV stick remote. The only downside found is with the remote control. It doesn 't have voice commands on the remote you have to buy the second remote which is almost like the first for $29.95. Why didn't they use that parameter on the original remote. The other parameters are the same. Then just charge a few dollars more instead of $30 more for the second remote .You're taking advantage of the consumer!", "verified": true, "helpfulness": "0/0", "author": "Krisco Kid"}, {"rating": 1.0, "review": "I have a Vizio TV with wi-fi that has Amazon and several other streaming services (Netflix, Crackle, etc.). The Fire Stick constantly has trouble connecting to the network, while I'm able to connect to the same services with my Vizio TV with no problem. (We live in a rural area, maximum available DSL speed is 1.5 Kbps, we have wi-fi at 6 Kbps and we might be able to get 12 Kbps if we switch to Exede satellite service.) So far, I can't see what the hype is all about.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mohoosier\""}, {"rating": 5.0, "review": "I love the fire stick.  I used to have a roku.  I would never use anything else.", "verified": true, "helpfulness": "0/0", "author": "Paula Glasgow"}, {"rating": 5.0, "review": "So far it works well, and was very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "danaebug"}, {"rating": 5.0, "review": "Love the stick and the fact that I can carry it when traveling so I can use it in hotels that require passwords on Wi-FI", "verified": true, "helpfulness": "0/0", "author": "john in jax"}, {"rating": 5.0, "review": "Content streams perfectly, little to no buffering, no connectivity issues with my wifi, setup and watching a show in less than 15 mins. Remote works perfectly. Will be purchasing another for a second TV. Love, love, LOVE it!", "verified": true, "helpfulness": "0/0", "author": "victoria"}, {"rating": 5.0, "review": "It is working great,  we love it so far so good. Sling tv has some performance issues but overall everything else has met or exceeded our expectations.", "verified": true, "helpfulness": "0/0", "author": "Johnny Bunch"}, {"rating": 5.0, "review": "I bought this for traveling. It works for all HDMI TV hotel internet setups, even the password portal types. Once you choose the hotel wifi, it pauses for a minute or 2 as if it wont connect...then the hotel login screen opens with no problem. Works great. A must have.", "verified": true, "helpfulness": "0/0", "author": "Adam Lomax"}]