[{"rating": 3.0, "review": "Netflix app is great.  Would have liked to use the Android apps I'm familiar with from the Play Store to take advantage of my NAS, but found a comparable app on the Amazon App store.  Instructions say to use the provided power adapter, but it seems to work with just USB power.  One of the better HDMI sticks out there, but I still find myself favoring my Chromecast.", "verified": true, "helpfulness": "0/1", "author": "BRIAN"}, {"rating": 5.0, "review": "Great job Amazon. Other than the steps to download, it's fast and crystal clear streaming. I love the phone app with speech!", "verified": true, "helpfulness": "0/0", "author": "Ihersh \"spoll\""}, {"rating": 5.0, "review": "This is awesome and much smaller than our Roku that we have in the living room.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Love it. Works great. I can now watch Amazon movies from my TV without having to plug my laptop to the TV.", "verified": true, "helpfulness": "0/0", "author": "Toco Toucan"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Linnie"}, {"rating": 5.0, "review": "Best of the current generation of streaming devices. The combination of low price, snappy performance, and selection of streaming sources is beyond anything else on the market. I've been a longtime AppleTV user, but will be upgrading my TVs to Fire devices.My biggest concern was the speed of the device. There may be a some difference between the capabilities of the Fire stick and the full Fire TV box, but it was so minor I really couldn't tell a difference.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 4.0, "review": "Overall, I'm happy with the FireTV stick.  Menus load quickly and there are a wide variety of streaming services that work as well as apps (such as Pandora, Spotify Connect, etc.).The interface is a little confusing at times and highly favors Prime video and music, which is to be expected with a product from Amazon.  Universal search would be a great feature.  Also, since the remote is bluetooth, I am unable to control the FireTV through my Harmony remote.  That said, you can't beat the offering considering the price point.", "verified": true, "helpfulness": "0/0", "author": "jay4190"}, {"rating": 5.0, "review": "Easy set-up, best way I have seen to use Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Bret P Stone"}, {"rating": 4.0, "review": "It's great! Ease of installation. You need to include the information about the remote in the instruction. Had to go online to get what I needed. Also ????? can you move the Fire TV Stick to other TV'sThanksDiane", "verified": true, "helpfulness": "0/0", "author": "Diane Berger"}, {"rating": 1.0, "review": "This device would not pick up my Wi-Fi signal 15 feet away from my Wi-Fi.  I know it works because my apple TV device was in the same location as the Fire TV Stick. I moved it to a another room, which was further away, and it worked. I had to wait for the update, which was expected. Then, you have to sit through an instructional video. This was a little annoying since it's actually easy to use.  The USB connection for power is problematic on some TV's depending on the locations of the HDMI and USB.I am not sold yet.", "verified": true, "helpfulness": "12/16", "author": "Timothy Bickford"}]