[{"rating": 5.0, "review": "Love it!!!! Can't beat the price! I need a few more!", "verified": true, "helpfulness": "0/0", "author": "M. Wear \"tn mom\""}, {"rating": 3.0, "review": "It's ok for the $20...but not for $40. The streaming services are too limited. I bought thinking you could add streaming services ala roku. No dice. Not flexible enough. Would also like to access outlook cloud. I won't return only because the price was right. Also the damn battery cover is insanely difficult to open! This is something that really has to be addressed. 65 years old and decades of electronic experience and never seen anything as badly designed as the battery cover access on the remote for this device!!!!!!!!!!", "verified": true, "helpfulness": "3/5", "author": "daHawk"}, {"rating": 5.0, "review": "I received this product about five days ago. It has been working well without incident.  Thanks Amazon.", "verified": true, "helpfulness": "1/1", "author": "Larry Lincoln \"fifi the cat\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/1", "author": "nora pinks"}, {"rating": 5.0, "review": "I can't say enough good things about the Fire TV Stick!  I now have access to all my favorite Prime movies, tv shows and even all my music right on my TV!  I can also access my Netflix account!  The interface is extremely well laid out and it's very user friendly.  The remote doesn't have a cheap feel to it at all.  The button are well placed and offer excellent \"feedback\" when pressed.  Overall I think Amazon did an AMAZING job with this product and I'm completely happy with it and highly recommend it!", "verified": true, "helpfulness": "1/2", "author": "PD"}, {"rating": 5.0, "review": "Plugged in to our TV and was up and running streaming prime videos in about 15 min.. ( we had to do a software download) There was a tutorial at the beginning that easily explained all the features.  I don't see us ever using it for gaming. It is great not to have something big and bulky sitting on a tv stand. We like it so much i just ordered another one.", "verified": true, "helpfulness": "0/1", "author": "BerlyGirl10"}, {"rating": 5.0, "review": "Exactly what I was looking for plus more. I wanted a quick and easy way to give my parents a way to make their TV a smart TV. The UI is easy to follow and the remote is awesome and easy to use. This is an awesome product.Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Yep"}, {"rating": 5.0, "review": "I have to say that I am a huge fan of the Fire TV stick. It's great for streaming online content - including prime, netflix, and spotify. For the price this can't be beat!", "verified": true, "helpfulness": "0/1", "author": "Mark"}, {"rating": 1.0, "review": "When it's working it's great, but I'm having tons of intermittent tech issues (frozen screens, malfunctioning remote even with fresh batteries installed, etc). Rebooting usually fixes whatever is going wrong, but I want to watch TV, not reboot continuously. Very frustrating compared to the Roku I had previously (and will probably hook up again when I bail on the Fire Stick). Support non-existent, remote feels cheaply made. It's Amazon, so I'm sure several versions from now it'll work fine.", "verified": true, "helpfulness": "2/4", "author": "Denis Cleary"}, {"rating": 3.0, "review": "This isn't a bad device, but the initial setup is maddening.After unwrapping it, plugging it in and connecting it to my network, it has to download some new software. OK, not a big deal, many devices do that the first time. This isn't that old, so I assume it shouldn't be that out of date and therefore shouldn't have much to download. After 10 minutes (yes I was timing it), it still wasn't done ... and we have a fast connection. I decide to go get something to eat and come back. Now I'm back at the wifi screen where for some reason I have to connect to my network again. It's a good thing passwords are so easy to type while arrowing back and forth to each letter on a tiny remote. It connects again, and after a few minutes I'm ready to go.Or so I thought - then you have to sit through a 3+ minute sales pitch video where they tell you all of the reasons the FireTV stick is great. Reasons you most likely already know BECAUSE YOU BOUGHT IT. And of course there is no way to skip, as the buttons have no effect during this. \"You can press the Home Button to go Home at any time\" - except, of course, during this annoying sales pitch.Other than the initial setup which wasn't the best experience I've ever had, it's not bad. It appears to have connectivity issues at times, which makes it seem sluggish (you click on a show and it takes 10 seconds for the play button to appear on the next screen), but it's not awful.It has a games section, which I assume is for games in your library that are stick compatible? It only showed me 8 when I have way more games than that - although after downloading a game it said something about an unsupported controller, so who knows.All in all, it's not horrible, but I expected better - still, for $19 (I got the $20 off deal) I can't complain.", "verified": true, "helpfulness": "2/3", "author": "Dave B"}]