[{"rating": 3.0, "review": "I don't have an hdmi receiver so the picture isn't very clear", "verified": true, "helpfulness": "0/1", "author": "Dominic"}, {"rating": 5.0, "review": "It's easy to use, I thought it was going to be one of those 'advanced technology' gadgets that's hard to figure out even after reading and following all the instructions. I wish I had it before now. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Macias"}, {"rating": 5.0, "review": "I heart this", "verified": true, "helpfulness": "0/0", "author": "Kyara riggs"}, {"rating": 5.0, "review": "Love it, so easy to use!", "verified": true, "helpfulness": "0/0", "author": "xeno"}, {"rating": 5.0, "review": "The Fire TV Stick works great!  I get to watch so many shows I love and use my Amazon Prime to watch many of them for free.  Great purchase, worth every penny.", "verified": true, "helpfulness": "0/0", "author": "TinaMDonnelly"}, {"rating": 5.0, "review": "Perfect for the portability.  Another hit by Amazon", "verified": true, "helpfulness": "0/0", "author": "abg"}, {"rating": 3.0, "review": "So far it is working, but I did not expect to have to rent movies that are 20 years old.  What happened to prime movies galore?Nerflix seems to have it right.  There have been few exceptions where I could not look at the movies I wanted on Netflix,So, you tell me, why was 'Top Gun' going to cost $4.99 to watch.", "verified": true, "helpfulness": "0/0", "author": "GPS"}, {"rating": 1.0, "review": "It worked well for about a month and then I couldn't excess any movies. I still haven't sent it in for a new one.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "This box show up on time..am loving and enjoying all the tv show and movie", "verified": true, "helpfulness": "0/0", "author": "malou mukendi"}, {"rating": 3.0, "review": "It did not meet my need. Not that the Fire TV Stick didn't work, it worked very well but not for what I wanted. I have a fire HD 7 and wanted to mirror whats on the Fire screen to my big screen TV. Can't do that with an HD 7, it requires an HDX 7 only. I didn't realize until I tried it to no avail. Information I had received was incorrect.", "verified": true, "helpfulness": "0/0", "author": "Willy"}]