[{"rating": 2.0, "review": "still having issue's with getting it to work like it should....(not a dummy) was going to purchase two more...but think I will be waiting to many issues with this one", "verified": true, "helpfulness": "0/2", "author": "Judy Savage"}, {"rating": 5.0, "review": "Love all the movie choices!", "verified": true, "helpfulness": "0/1", "author": "kter4u \"Catherine Homan\""}, {"rating": 4.0, "review": "Easy to set up and I love it", "verified": true, "helpfulness": "0/1", "author": "Candice-Lee"}, {"rating": 5.0, "review": "Loves it", "verified": true, "helpfulness": "0/1", "author": "Hectordiaz"}, {"rating": 5.0, "review": "Excellent device. We are really enjoying its ease of use.", "verified": true, "helpfulness": "0/1", "author": "Paul H. Pflieger"}, {"rating": 2.0, "review": "I have been very disappointed with this device. WHEN it works, it works well. But, it seems that it spends most of the time hunting for the wifi signal and after acquiring it, works well for a short time (a VERY short time) then it drops the signal! You may think the problem is with my wifi signal and you'd be wrong. The signal is VERY strong, as proven by the three laptops, two desktops, an Android tablet, an iPad tablet, three cell phones, two big screen, flat panel TVs, two high-end receivers, a Blu-ray player, two Xboxes, and two PlayStations. None of which have the slightest problem with attaining and maintaining the wifi signal anywhere in our house! Oh, did I mention the Fire Stick is only about six feet from the router?!I had very high hopes for this device and I am still willing to give it a bit more of a chance. Perhaps it only needs a \"burn-in\" period :-) But, if I'm still having this problem a week from now... back it goes and I'll just stream from the Xbox (which has not had any problems, just the Fire Stick with its remote control is more intuitive and easier to work for my wife than a thumb controller :-).  This review... to be continued.", "verified": true, "helpfulness": "0/1", "author": "Aaron H."}, {"rating": 5.0, "review": "Enjoyed the free Amazon prime.", "verified": true, "helpfulness": "0/1", "author": "Rebecca F Stancil"}, {"rating": 3.0, "review": "Its ok. Some of prime movies stink.", "verified": true, "helpfulness": "0/2", "author": "mitch"}, {"rating": 5.0, "review": "It's perfect for my kids. They want to watch Youtube(which is no longer available on Directv) and Netflix. I also can find some movies and shows to watch. I currently have directv but really only have it for football. Could see myself saving lots of money on satellite and just using this. Got it on sale for $24. Can't beat it.", "verified": true, "helpfulness": "0/1", "author": "klos"}, {"rating": 3.0, "review": "I wish Amazon will allow us to download Kodi (aka xbmc) as that will allow me to watch LiveTV using HD Homerun plugin.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]