[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "OPAL"}, {"rating": 5.0, "review": "My Samsung is about 2 years old and is a SmartTV however the apps are outdated and the entire process is slow getting these apps fired up.  The Amazon Fire TV Stick works better than I had previously hoped it would.  I like how everything is integrated into one Menu System.  Its easy to switch between Prime, Hulu, Netflix and other applications.  I am about 1 month into Cutting the Cord and this has made it much easier to be able to gather all of these applications into one Menu.  Also the fact that I can quickly surf my Amazon Prime queue and Movies I have purchased makes this even better.  The Fire Stick does not come with Voice Control via the included remote, but you can download a Controller App and the Voice Control works extremely well if you want that feature but do not want to purchase the FireTV.  I am planning on getting a FireTV for the other TV in the house.", "verified": true, "helpfulness": "0/0", "author": "David Johnston"}, {"rating": 5.0, "review": "Bought many of this for my family 👪 & friends.excellent product with sideloaded xbmc😃", "verified": true, "helpfulness": "0/0", "author": "SS"}, {"rating": 5.0, "review": "Good!!!", "verified": true, "helpfulness": "0/0", "author": "Ma Ruwena Sevilla"}, {"rating": 5.0, "review": "It was easy to install. It goes great with prim membership. It is easy to use, the little animation was cute and helpful.", "verified": true, "helpfulness": "0/0", "author": "starr*"}, {"rating": 5.0, "review": "As advertised. Highly recommended over ChromeCast or AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "After installing my fire stick and watching awesome TV with it -- I noticed a HUGE spike in GB usage.  I did some online research and discovered I was not alone.  It's unplugged now.  Not much of a deal at $39 when I had to pay overage charges.", "verified": true, "helpfulness": "0/1", "author": "Arctic Moon Beam \"Lovely MoonBeam\""}, {"rating": 5.0, "review": "Easy to set up, great price and lightning fast connectivity!", "verified": false, "helpfulness": "0/0", "author": "elpaso"}, {"rating": 5.0, "review": "Love it, great item, fast shipping", "verified": true, "helpfulness": "0/0", "author": "tonald downes"}, {"rating": 5.0, "review": "Very easy to set up and works great. Very happy.", "verified": true, "helpfulness": "0/0", "author": "Jayne Mohr"}]