[{"rating": 5.0, "review": "Amazon fire TV stick is one of the most useful and unique devices I have ever purchased.  I have been an Amazon prime member for one year and buy alot of products on Amazon and have loved the site forever. This stick lets me do EVERYTHING!!! It even has sling so I can watch regular TV through the app not too mention Hulu, Netflix, Prime, Crackle,  Youtube, Games, Apps and more lol....$40 bucks whaaat?? I would pay $80 bucks for it..... ONE PROBLEM!! I had too buy it from BEST BUY! because AMAZON!! wont have stock UNTIL MARCH 10TH!!! Im not mad Amazon baby but im dissapointed :-( ..... Still Fire TV Stick RULES!!!!", "verified": true, "helpfulness": "0/0", "author": "Jerry Adkins \"Explorer88\""}, {"rating": 5.0, "review": "We use the Fire Stick with Amazon Prime and Netflix.  We can watch almost everything we want using these two services.  I would like to see some Disney shows and movies available on Amazon Prime though.  The stick works nicely, though it does have a hiccup every now and then.  Resetting the stick does help when it can't seem to connect to the internet.  It does help to have the wireless router closer to the stick.  We ended up moving the router into another room in the house so that it would be closer to both sticks that we use in different rooms of the house.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Ripoll \"sweetheartclb\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Zury"}, {"rating": 3.0, "review": "I'm hoping someone from amazon can respond to me.  I have been trying to figure out how to get help with my fire stick.  I really like it and when it runs good it is awesome.  However, we do have problems almost half the time when trying to watch on it.  It just won't play or skips half the time.  It usually says it doesn't have internet connection, however when we look at the signal strength it is on full strength.  Please help- what do we do?  Otherwise we might have to return it.  Also, when the fire stick doesn't work, we can watch without problems through my laptop or kindle fire so I know it is specifically the fire stick.  If it doesn't resolve, I will have to return.", "verified": true, "helpfulness": "0/0", "author": "Candice Krueger"}, {"rating": 4.0, "review": "I just got Netflix and I love it, very easy to use and install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install. Easy to find programs or movies to watch. Great price for use on bedroom TV for late night tv watching", "verified": true, "helpfulness": "0/0", "author": "Pk"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 3.0, "review": "Wasn't as exciting as I thought it would be.  There are a TON of things that one has to pay extra for (i.e. having to rent Bridge on the River Kwai?)The Amazon rating system seems very peculiar and is obviously trying to steer one towards paying extra money.  Probably worth it overall at that price, but don't get carried away with all the hype.", "verified": true, "helpfulness": "0/1", "author": "Chris"}, {"rating": 5.0, "review": "Amazing! It works great, and is very affordable! LOVE that it comes with a remote unlike other 'sticks,' AND it was so easy to install!", "verified": true, "helpfulness": "0/0", "author": "Kayla Stephens"}, {"rating": 5.0, "review": "Thank you, good", "verified": true, "helpfulness": "0/0", "author": "MohamedSaed"}]