[{"rating": 5.0, "review": "We got this for my daughter to stream amazon prime. Works great and she loves that she doesn't have to watch her favorite shows on her kindle any more.", "verified": true, "helpfulness": "0/0", "author": "Mary Grover"}, {"rating": 5.0, "review": "I love my Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Dawn Wilkes"}, {"rating": 5.0, "review": "Easy to connect fast loading really like it thinking of getting another.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy setup. No issues. I prefer my AppleTV but it doesn't have a SlingTV app yet so I'm using the Fire TV stick instead.", "verified": true, "helpfulness": "0/0", "author": "Dru \"Dru\""}, {"rating": 4.0, "review": "This device has performed pretty well. The features and loaded apps on it are user friendly. I would suggest this to anyone who does not have a smart TV.I would like to see a device come out with more of an open platform though. I have accounts for many network TV stations who have apps. I would like to be able to download these apps to my Fire TV Stick so that I only have to interface with one device.Once again, I would suggest this device to anyone. It performs flawlessly. It even comes preloaded with your Amazon credentials which really makes this a plug and play device.", "verified": true, "helpfulness": "0/0", "author": "Jordan Sterzinger"}, {"rating": 5.0, "review": "It is one of the best thing I got love it", "verified": true, "helpfulness": "0/0", "author": "Stella C."}, {"rating": 3.0, "review": "It is good but many things have to be paid if you are not using prime. The size of the pictures too choose a program are too small. It gets stocked occassionally I downloaded Tv Classics and it doesn't work", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great stuff! Just a little confusing to start but all in all great! Still finding new things. Love all the choices.", "verified": true, "helpfulness": "0/0", "author": "Meghan Martell"}, {"rating": 5.0, "review": "Awesome! Set up was a breeze. Couldn't be happier with it.", "verified": true, "helpfulness": "0/0", "author": "Rick Bowen"}, {"rating": 2.0, "review": "You have to pay for to many stations and programs. When you're a customer would prime that they should all be included.", "verified": true, "helpfulness": "0/0", "author": "John Hickey"}]