[{"rating": 4.0, "review": "Very easy to use. Deceit selection of movies. Wouldn't mind seeing better varity of Prime Videos. Other that, a good buy.", "verified": true, "helpfulness": "0/0", "author": "Tenlitigator"}, {"rating": 5.0, "review": "Easy to use with the included remote or my Smart Phone. I love using my Smart Phone with it; it's just fun :) Has the two apps I'm most interested in - Amazon, of course, and Netflix - plus plenty of other apps - some free and some needing a cable subscription - I'm not so big on playing games on my TV, so I've not looked into what type of games it carries. I absolutely love this! I'm very pleased with my purchase.", "verified": true, "helpfulness": "1/1", "author": "scarlet_study_21"}, {"rating": 5.0, "review": "Read a lot of reviews prior to purchasing... Easy hook up and no issues with it stopping or pausing due to internet issues. I definitely will be purchasing another one in the future for my other tv.", "verified": true, "helpfulness": "1/1", "author": "Melinda Brown"}, {"rating": 4.0, "review": "Works as advertised.", "verified": true, "helpfulness": "1/1", "author": "Davidson"}, {"rating": 5.0, "review": "Yes I love my Fire Stick I received as a birthday gift. I have watched several movies now and I know I will continue to enjoy this for years to come.", "verified": true, "helpfulness": "1/1", "author": "Beth Foster \"Foster Books\""}, {"rating": 5.0, "review": "Forget google chrome - go for the firestick. Super easy to install and use. LOVE IT", "verified": true, "helpfulness": "1/1", "author": "Sanders"}, {"rating": 5.0, "review": "Excellent device. Very convenient and useful.", "verified": true, "helpfulness": "0/0", "author": "Arafat Ahmad Qureshi"}, {"rating": 5.0, "review": "I USED TO HOOK MY COMPUTER TO MY TV SO I COULD WATCH AMAZON THROUGH MY PRIME MEMBERSHIP. SOMETIMES THE THING WOULD GET OUT OF SYNC AND I WOULD HAVE TO RESTART EVERYTHING, BUT WITH THE VAST AMOUNT OF MATERIAL AVAILABLE THROUGH AMAZON I WOULD STUMBLE THROUGH AND CARRY ON BECAUSE I LOVE TO WATCH MOVIES. I PARTICULARLY ENJOY MOVIES WITH A CHRISTIAN THEME, AND AMAZON HAS A LARGEER SELECTION BY FAR THAN NETFLIX, WHICH I ALSO WATCH. TO WATCH NETFLIX I HAD TO OBTAIN A BLUE RAY PLAYER AND THEN HOOK IT TO THE TV. IT SEEMED LIKE EVERYTHING WAS BEING HOOKED TO THE TV, AND THEN I DISCOVERED THE FIRE STICK. WOW AND WOW AGAIN. MY COMPUTER IS BACK ON THE DESK WHERE IT BELONGS, MY BLUE RAY PLAYER IS ONLY USED TO PLAY BLUE RAY DISCS. AS FOR THE FIRE STICK I FIRST FOUND OUT OF ITS EXISTANCE WHEN I WAS VISITING MY BROTHER WHO HAD A APPLE TV DEVICE AND WHEN I GOT HOME I DID A LITTLE RESEARCH AND COMPARISON AND THE LARGE VARIETY OF MEDIA AVAILABLE THROUGH THE FIRE TV STICK THAT I OPTED FOR THE LITTLE, INEXPENSIVE WONDERFULLY UNOBTRUSIVE DEVICE. WHEN YOU HAVE GONE THROUGH THE PACES AS NOTED ABOVE YOU REALLY ENJOY SOMETHING SO EASY TO USE, SO EASY, AND IT FUNCTIONS PERFECTLY OUT OF THE BOX. THE PRICE IS LOW ENOUGH SO EVERYBODY CAN HAVE ONE, AND I THINK THEY SHOULD. IT DESERVES MORE PRAISE THAN I AM ABLE TO EXPRESS.", "verified": true, "helpfulness": "1/1", "author": "John W. Prewitt"}, {"rating": 5.0, "review": "Enjoying it", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up spent 3 hours watching!", "verified": true, "helpfulness": "1/1", "author": "michele dolan"}]