[{"rating": 5.0, "review": "I'm a prime member and I like the free movies. It opens up loads of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Eugene Savage"}, {"rating": 5.0, "review": "I gave this to my sister and brother-in-law for Christmas.  They love it! They have been using it to stream their Netflix movies.  It was pretty simple to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  Never learned to use the old VCR, but this is so easy.  I like watching what I choose when it suits instead of settling on what is broadcast. This product is brilliant!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My wife is ecstatic with it. This tool makes it easy for her to enjoy and manage her viewing of the Amazon entertainment inventory.", "verified": true, "helpfulness": "0/0", "author": "Richard H Garnes"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Unknown"}, {"rating": 2.0, "review": "The fire stick is a cool device but it has horrible streaming qualities1. It buffers all the time2. it has horrible video quality3. it is bad for even amazon instant videoi do recommend this item if you are going to get something like this i recommend an APPLE TV", "verified": false, "helpfulness": "1/2", "author": "Amy Simmons"}, {"rating": 1.0, "review": "Kept getting a HFCs error.  Had to unplug replug everything in.  Could watch one or two shows then it would error again.  Still waiting for Amazon to figure out the problem.  Got tired of messing with it, am returning", "verified": false, "helpfulness": "1/2", "author": "Jami Harms"}, {"rating": 4.0, "review": "I am happy with the Fire Stick.  The simplicity of the remote. The installation was a breeze. I am looking forward to trying this at our cottage and see how it works there. I am still taking advantage of all the prime shows. I did buy the voice remote and have commented on that.(not real impressed with that. It is a waste of money)  However for the Fire Stick it is a good value for the money.  The only thing I do not like is that it is not very user friendly to those that are blind.  One of the members of my household is blind and still enjoys television.  The fire stick does not have descriptive video service like blue rays have.  It is very difficult for the blind family member to navigate the tv menus. Because the remote or fire stick  does not talk back. Like a smart phone or computer will.  The voice remote only listens to what you say to it. There is no voice playback on the fire stick to tell you what menu or movie you are on. If you do get this product for the blind of visually impaired and you are budget conscious, you will want to set the parental controls so that non prime shows and apps are not accidentally purchased. The fire stick is great to catch up on  shows.  I am still toying around with it and learning the benefits of the product.", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "Best TV accessory ever. Have Google TV box and Chromecast, Fire TV Stick blows them away on content, versatility and performance. A stellar product, every TV in the house should have one.", "verified": true, "helpfulness": "0/0", "author": "Shane Kozloff"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "john cornett"}]