[{"rating": 5.0, "review": "Easy, seamless installation!  A few minutes and it running!  I reccomend this product!", "verified": true, "helpfulness": "0/0", "author": "M. M. Caskey"}, {"rating": 5.0, "review": "It is great and affordable/", "verified": true, "helpfulness": "0/0", "author": "K. Roberts"}, {"rating": 5.0, "review": "Easy to install great apps fun to use.", "verified": true, "helpfulness": "0/0", "author": "Ursula Wozniak"}, {"rating": 5.0, "review": "Works great.  Downloads faster than our Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Larry S."}, {"rating": 5.0, "review": "Much better than just using a Smart tv. App remote us really user friendly. Very hard to take cover off remote to put batteries in. Works fast and produces great quality.", "verified": true, "helpfulness": "0/0", "author": "T. Weinstein \"Big Researcher\""}, {"rating": 4.0, "review": "It is fantastic!  No complaints.", "verified": true, "helpfulness": "0/0", "author": "Charismaticqt"}, {"rating": 5.0, "review": "If I could give it more than five stars I would!  Easy set up, almost intuitive use (and I am not a techie).  I have ordered a couple more to give to family members.  Pictures are sharp and clear on my large screen HD tv.", "verified": true, "helpfulness": "0/0", "author": "Jean Wilson"}, {"rating": 5.0, "review": "The very best media server I have ever used, exceeded only by the voice recognition capabilities of the fire receiver, which I also own.  Works fine with multiple sources including Netflix, YouTube, and Plex.", "verified": true, "helpfulness": "0/0", "author": "Stephen Breden"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Bree Anderson"}, {"rating": 1.0, "review": "NOT HAPPY !  NO WHERE IN YOUR DESCRIPTION  DOES IT STATE ( YOU MUST HAVE  WI - FI )TO OPERATE  THE FIRE STICK.  I  HAVE A COMPUTER WITH A  MONITOR WHICH  IS  HDTVHMDI  READY.  PLUGGED  THE  FIRE STICK IN TO HMDI PORT,YOUR  FIRE STICK  SYSTEM  ( WOULD NOT WORK ) ! ! !DUE TO  ( NOT HAVING )  WI -FINEED TO  PROVIDE  A SOLUTION IN WHICH  THOSE CUSTOMERS WHO HAVE  DSL CABLECAN CONNECT TO A  CABLE SPLITTER BOX AND USE  FIRE STICK INSTEAD OF WI - FI", "verified": true, "helpfulness": "3/5", "author": "Al Somebody"}]