[{"rating": 5.0, "review": "I didn't want to wait until January so I bought this at a local store for $25. I am so glad I didn't wait! This has already replaced my Chromecast. This does everything that Chromecast does, plus I can watch Prime TV and movies without having to cast my phone screen. If I had known this was coming out, I wouldn't have wasted my money on Chromecast. The remote that comes with it is handy. There is also an app available for download if you would rather use your voice or a keyboard for searching.", "verified": true, "helpfulness": "0/0", "author": "Mandie"}, {"rating": 5.0, "review": "Better then I could've expected, it is super fast, I absolutely love it.  I had been using a different box, until someone recommended I pre-order this.  The other box was so slow there was even a lag from when I paused a video to when it actually stopped.  This isn't a problem at all with the fire TV stick at all, it also offers so many more features and apps.  One of the best things I have purchased this year.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 3.0, "review": "Pros: The device is always in a ready state which is pretty cool, so there is no need to boot up a console and be bugged by online friends while I watch Netflix.  The device seems to run very fast and is quite small.  The circle on the remote functions very much like an old iPod control ring.Cons: I got this device for Spotify so I could listen to music in my living room only to find out the Spotify app is complete garbage.  The app requires you to pair with a mobile device to control Spotify, which then requires a premium membership, so basically the app does nothing for non-premium members.  In general there aren't many apps and some of the apps like ESPN require cable provider program enrollment, which is pointless.  I navigate mostly from the recent apps section as I have no clue where the apps install to.  Being an Amazon device means most of the menu items cater towards Amazon content.I have personally moved entirely to streaming and this device doesn't provide much that isn't already available via PS4, PS3, Xbone, or 360.Basically this device would be ideal for:- Users without consoles that are looking for the same sort of streaming experience.- A portable streaming device for those extra bedroom TVs or when going on vacation.", "verified": true, "helpfulness": "0/1", "author": "Bryan Szarko"}, {"rating": 2.0, "review": "I have slow Internet.  However, it's usually enough to stream Netflix and Youtube (and usually Hulu Plus and Amazon Prime).  I can successfully stream Netflix on my Xbox 360, PS3, Xbox One, PS4, and my smart TV.  However, the Fire TV Stick kept buffering over and over again, until I gave up and moved to another device.I also had issues with the remote.  I'd be entering an email address or password and it would vary between doing it correctly, entering too many characters, or entering no characters at all.  The same happened with navigation.  I'd push down and it might not respond, or it might jump 6 entries down.  Imagine how much fun that was.I have requested tech support on the remote, but I doubt they can do anything about the poor buffering capabilities.  Overall, my excitement quickly turned to disappointment.", "verified": true, "helpfulness": "0/1", "author": "J. Spencer"}, {"rating": 5.0, "review": "As an IT professional I have to admit that the Amazon Fire Stick works exactly as described.  It was a breeze to install and getting used to navigating the remote was easy.  As a Prime member it is a great way to view movies since my Samsung Blue Ray device doesn't support Amazon Prime.  There is no delay when watching a TV program or movie and even my wife likes it!  Great price for a device that provides such quality of sound and picture through your WIFI connection.", "verified": true, "helpfulness": "0/0", "author": "Nicholas J. Hubbuch \"Retired MBA\""}, {"rating": 5.0, "review": "Absolutely Love it!", "verified": true, "helpfulness": "0/0", "author": "Joseph S. Thompson"}, {"rating": 3.0, "review": "Works good for amazon prime content. However I hate the fact that the device is more to push a user to buy more content that already available.Free content is hidden under 3 layers o user content.I don't want to buy more when I am already paying $99 for the prime membership.", "verified": true, "helpfulness": "0/0", "author": "Vineet"}, {"rating": 3.0, "review": "Compares well to Chromecast and Roku. I like the remote. Setup takes a very long time. Nothing unique overall however.", "verified": true, "helpfulness": "0/0", "author": "PalBri"}, {"rating": 1.0, "review": "Still awaiting technical support...received 11/22", "verified": true, "helpfulness": "0/0", "author": "BS Dietrich"}, {"rating": 4.0, "review": "I enjoy the easiness that it was on applying this to my TV.  However, maybe it's my ignorance for these types of devices, but there is no on/off feature for it.", "verified": true, "helpfulness": "0/0", "author": "David"}]