[{"rating": 2.0, "review": "I have a fire tv and 2 fire sticks.  I tried, however, using one of the sticks on my Sony Bravia and I cannot get the tv to recognize it.  It works fine on my Samsungs.", "verified": true, "helpfulness": "1/2", "author": "cgolden"}, {"rating": 5.0, "review": "Where do I begin? I was using my XBOX 360 to watch Amazon Prime video. Saw this go on sale and figured, what's a 4th media player (2 Western Digitals and 1 Panasonic)? I've since retired my XBOX from use (the power draw between the Fire Stick and the 360 are night and day) and have been using this solely for my Prime and Netflix viewing. Apps like Pandora, Youtube, Crackle all work well. Plex runs very well, barring your device streaming the content has the processing power to do so (8-yr old Athlon computer is the bottleneck). Have only played a handful of simple games and haven't noticed any discernible \"stutter\" from the unit.Pros: small form factor; comes with additional USB power source; comes pre-programmed with your Prime Account info, which gets you up and running faster; Very easy for anyone to pick up and use.Cons: Noticed a glitch with the remote when browsing. On occasion, it seems that the navigation buttons almost \"stick\", cycling through a bunch of titles inadvertently. Isn't app related, as I've had this happen with third-party apps, as well as on the Home screen. But isn't a deal breaker. Would rather have a wired connection vs. wireless...but honestly: where would they put it?TL;DR version: solid media player; If you enjoy watching Prime Video, definitely the way to go. If you don't have a solid wi-fi connection, you may run into issues when streaming HD content", "verified": true, "helpfulness": "0/0", "author": "GinaTurtle07"}, {"rating": 3.0, "review": "Had a lot of trouble watch anything. It buffers constantly.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "Having so much fun! Orange is the New Black and Californication! Fun stuff for the kids too...corrupting them with Pee Wee's Playhouse!", "verified": true, "helpfulness": "0/0", "author": "darbeach"}, {"rating": 5.0, "review": "Revolutionizing movie watching.  I really like this product.  May buy another.", "verified": true, "helpfulness": "0/0", "author": "Welch \"LWWelch\""}, {"rating": 3.0, "review": "Physical review: awful.  The unit is too wide to plug into an HDMI port next to other stuff (shoulders are too wide), so you have to use the included short cable.  So now it's a dangling thing.  Then it DOES NOT WORK WITHOUT USB POWER which plugs into the side of the stick. And if you use the power supply that Amazon includes, it is too wide to plug in to any power without blocking another outlet.  On my two-to-six adapter, it blocked the receptacle above it and the one next to it, taking up 3 spaces.  So now you have a gangly mess: 2-3 receptacles wasted for power to a block dangling from another cable.  The reason I bought it was the $19.95 initial price.  I think it's worth that.  But it's sure not classy like an Apple product!", "verified": true, "helpfulness": "89/98", "author": "Dan H."}, {"rating": 5.0, "review": "Works as I'd expect", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "We are really enjoying our new Amazon Fire Stick!  It gives us so any options for what we want to watch and is easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "TV, gaming, quick and easy set up....what more could you ask for!", "verified": true, "helpfulness": "0/0", "author": "A. Dinglebunny"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Calvin M."}]