[{"rating": 4.0, "review": "Was hoping more movies would be available especially when I go into search mode. I can understand the New Releases having a cost, but movies from the 60's, 70's, 80's, 90's and pre 2010 movies you would think be more readily available.", "verified": true, "helpfulness": "1/1", "author": "Marvin Jarvis"}, {"rating": 5.0, "review": "Awesome product! Works great!", "verified": true, "helpfulness": "0/0", "author": "matthewryan9"}, {"rating": 5.0, "review": "Finally, this just works!! remote is GENIUS. Prime Members just order one already!!", "verified": true, "helpfulness": "0/0", "author": "R.Texan"}, {"rating": 1.0, "review": "Poor product.  Remote control goes through a set of batteries every week.", "verified": true, "helpfulness": "0/1", "author": "Scott in Surprise"}, {"rating": 5.0, "review": "The fire stick was easy to install and use. We are able to use it on the tv in the game room or move it to the bedroom TV very easily.  I'm super impressed on how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "Kimkbs"}, {"rating": 5.0, "review": "Love this!!! So much better than chrome cast", "verified": true, "helpfulness": "0/0", "author": "Joaquin Ramirez"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Emma Jane"}, {"rating": 5.0, "review": "Love it. Watched movies all weekend.  Now I can't say that there's never anything on tv. Very entertaining", "verified": true, "helpfulness": "0/0", "author": "T. Small"}, {"rating": 5.0, "review": "Does what its suppose to do streaming the products", "verified": true, "helpfulness": "0/0", "author": "product user"}, {"rating": 3.0, "review": "I bought this device because I knew/had read it installed KODI/XMBC which is a \"huge value\" and it didn't have over-heating problems unlike other android STICKS they make.. I like the amazon stick.. but I also read that it has incredibly buggy software compared to the roku3 which has a hell of a lot less ram.. and so for my part.. I tried the youtube app (which sucks) and saw it crashed (it did work for a while) I also even saw the \"netflix\" app crash (none of amazon 'prime' apps have crashed that I noticed yet)So for my part I say it's true.. this amazon fire stick's 3rd party or whatever and whoever made these apps are buggy.. which is the only sad/bad thing I have to say about it..I'm now installing kodi and I assume it won't crash much.. but I dunno..? all I can say is I like the amazon fire tv stick.. the software is nice mostly..... but the fact that amazon is running android and the fact that on NORMAL android the netflix or youtube app doesn't crash.. I give them a rating of \"PATHETIC\" when it comes to their apps :( (it's hoped that this will be fixed.. and I too hope so.. so I look forward to playing with kodi and amazon prime apps.. but I'll stay away from a lot of the 3rd party as I expect them to crash be buggy as well) netflix doesn't always crash?I dunno why amazon could just had made this a full android implementation..?? I think I'd been happier if they had.. I have a samsung smarttv in front of me.. it too has some kind of ARM processor and RAM in it.. same technology my phone/fire tv has.. but it's implementation of android and it's app's are too crappy to bother with.. even if it has NETFLIX.. it doesn't have 'prime' and it doesn't have 'kodi'", "verified": true, "helpfulness": "0/0", "author": "Dave"}]