[{"rating": 3.0, "review": "Disappointed that some apps, especially Acorn TV not supported.  New feature to be able to use on hotel systems will be a big plus if it really works.", "verified": true, "helpfulness": "0/0", "author": "Mikey N"}, {"rating": 5.0, "review": "this is my second fire TV stick. The set up was so easy it took me all of maybe five minutes to install it and have it up and running. I don't understand the people who said they had a problem putting the batteries into the remote. It's just like any other remote you open up the back door and you insert the batteries it couldn't be easier.  Anyway I inserted this into an open port on my HDMI switcher. I attached the extender which I think everyone should do and then plug the power into an outlet. Turn on the TV went to the source That the fire stick is plugged into and up popped the home screen and welcome message. From there all you have to do is register or if you have an account put in your Amazon email and password and you're up and running I went to Netflix just to try it out and the picture was beautiful and the sound was fantastic and it was very quick loading with no buffering issues like my AppleTV or Roku. With fire TV stick you really don't need an AppleTV or Roku or any other streaming device. And it's $39 you really can't go wrong considering that Apple TV is $99 Roku I think is at least that price. I haven't watched any full length movies yet but when I do I'll post an update. So far, so goodUpdate: watched Star Trek  The picture was great and I did not experience any buffeting issues. Loaded fast  A neat thing is when you pause the movie, you can see the names and pictures of the actors. The sound on my surround sound system never sounded so good. I don't know if that's an attribute of the stick , but movies sound better than ever", "verified": true, "helpfulness": "0/1", "author": "Gerry S \"Thesil\""}, {"rating": 4.0, "review": "Str8", "verified": true, "helpfulness": "0/0", "author": "GARY   BROWN"}, {"rating": 4.0, "review": "Was easy to set up and use right of the box.", "verified": true, "helpfulness": "0/0", "author": "Glenn Hill"}, {"rating": 5.0, "review": "Works great! Wish I could screen cast my phone or laptop", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 1.0, "review": "Poor device. Steady cutting off, does not keep internet connection. Which I could locate receiptto return back to store.", "verified": true, "helpfulness": "1/1", "author": "Bryant mayes"}, {"rating": 2.0, "review": "After about a week, Netflix no longer worked on the Fire Stick. The Fire TV Stick loaded very slowly when it did work. We purchased a Google ChromeCast and love it. I would not recommend the Fire TV Stick to anyone.", "verified": true, "helpfulness": "1/1", "author": "Benjamin Gordon"}, {"rating": 5.0, "review": "First off, I have to say I also own a rodku (I purchased that before the Fire Stick). Anyways, I much prefer the Amazon Fire Stick. I found it much easier to set up and use. And since I am an Amazon prime member, there are endless choices of movies and programs to stream for free. I honestly wish I would have purchased this before the Roku. If you are an Amazon prime member and are wondering which to choose between, get yourself the fire stick. It's a great price, easy to set up and use, and you get so much to watch with your prime membership.", "verified": true, "helpfulness": "0/1", "author": "Dawn"}, {"rating": 1.0, "review": "I got charged 100 bucks for something I never bought, don't ever put your debit card number. It's a scam!!", "verified": true, "helpfulness": "1/2", "author": "David"}, {"rating": 4.0, "review": "Need more content on Prime.", "verified": true, "helpfulness": "0/0", "author": "Katrina Haney"}]