[{"rating": 1.0, "review": "due to the slower speed of my internet this devide does not work well for me.  i have a wii which i use netflix just fine on.  I also have a cromcast which also works well for my streaming and netflix.  so i am unsure if this device just has too much for my internet to download or what the problem is.  I see that there seems to be great features but buyers beware if you do not have a fast enough connection this is not for you.", "verified": true, "helpfulness": "1/2", "author": "Alyssa Klaphake"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Betty L. Edwards \"blondie\""}, {"rating": 5.0, "review": "We love it the whole family enjoys it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Great device.  Easy to setup and use.Quickly starts movie, TV show, etc and buffers quickly so there is no waiting to start.If Prime movie content could have more recent content, I would have rated 6 stars!", "verified": true, "helpfulness": "1/1", "author": "George A Kossl"}, {"rating": 5.0, "review": "Love this little product, it is so easy to install, and you can add so much to this awesome piece of technology. Thanks and look forward to getting the most out of this stick. Great delivery time, got in just a few days.", "verified": true, "helpfulness": "0/0", "author": "Jesse Stansel"}, {"rating": 5.0, "review": "Very, very pleased. A fantastic addition to our viewing entertainment.", "verified": true, "helpfulness": "0/0", "author": "Outdoor Adventurer \"Hooked on True Adventures\""}, {"rating": 5.0, "review": "This stick is so simple! I plug it into any TV I'm watching. It just works. Thanks!!", "verified": true, "helpfulness": "0/0", "author": "Mary S."}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "warren coleman"}, {"rating": 4.0, "review": "So far it has worked well, but I was disappointed  on one movie I rented, I was charged $9.99 .", "verified": true, "helpfulness": "0/0", "author": "Jimmy Pinon"}, {"rating": 5.0, "review": "I am quite pleased with the fire stick. I have other streaming devices and this by far my favorite so far.", "verified": true, "helpfulness": "0/0", "author": "hotdog farmers"}]