[{"rating": 5.0, "review": "Nice, way better than Roku..", "verified": true, "helpfulness": "0/0", "author": "Tracy E. Mundhenk"}, {"rating": 3.0, "review": "The features arent great and comparable to Roku or Apple TV", "verified": true, "helpfulness": "0/0", "author": "YE Siva"}, {"rating": 4.0, "review": "This is a neat little item. I really like its ease of use and portablity. I knocked off a star, becuase it is a little undpowered. Streaming occasionally suffers and updates take forever.", "verified": true, "helpfulness": "1/1", "author": "David Hoffmann"}, {"rating": 5.0, "review": "I have two smart tv's but still purchased the fire stick so that I could dump comcast cable (blech!!!) and move to sling. Since neither of the tv's currently support Sling I needed to upgrade. Couldn't be happier.  When streaming to my tv downstairs (wi-fi) I would get a very choppy connection. Zero problems and much faster with the fire stick. Use if for plex as well and stream in HD with no lag (currently only have a 25 mbps connection at home). It helps that I'm already in the amazon eco system but I got one fire stick for free (pre-paid for 3 months of sling) and I got the other one for 10 off (29.95) as another sling promotion. Would highly recommend to any one who's thinking of cutting the cord or simply to boost your streaming exp.", "verified": true, "helpfulness": "0/0", "author": "monty45"}, {"rating": 5.0, "review": "Easy to use, great picture quality and no issues with the streaming that we previously had running netfix on our xbox .", "verified": true, "helpfulness": "0/0", "author": "OffshoreVermin"}, {"rating": 5.0, "review": "Really great device! Got it with the Prime discount! :)", "verified": true, "helpfulness": "0/0", "author": "Juan Panesso"}, {"rating": 4.0, "review": "Very slick tool! It worked very well. The only drawback (always room for improvement) was trying to enter names, passwords, search names, etc. It just takes some doing to spell out longer names/words. Otherwise I never had a problem with it. I've decided to pick up a Tivo unit.  The stick will be used on a yet to be purchased HDTV for another room.", "verified": true, "helpfulness": "0/0", "author": "Scott A. Miller"}, {"rating": 5.0, "review": "great tv stick", "verified": true, "helpfulness": "0/0", "author": "michael chui"}, {"rating": 5.0, "review": "I am enjoying such a large assortment of TV & Movies and original programming that I'm thinking of downgrading my cable tier as I don't watch it as much these days!", "verified": true, "helpfulness": "0/0", "author": "MsRottn"}, {"rating": 3.0, "review": "Hulu just doesn't work on the Fire Stick.  I don't know if that's Hulu's fault of Amazon's fault, but every show I watch freezes on the Fire Stick.  I know it's not my connection because when I plug in my Roku there are no problems.That said the Amazon fire stick has a nice interface and is really good at Netflix and Amazon.  If you're not planning on watching Hulu, then I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Elena F Bonifacio"}]