[{"rating": 4.0, "review": "Works great as expected.", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 5.0, "review": "This is a great little device! It does however seem to have a bit of jerkiness when navigating around - this may be due to the lower speed internet in our area. I like that you don't actually need to plug it into the wall if your TV has a USB port.", "verified": true, "helpfulness": "0/0", "author": "Michael Mucklow"}, {"rating": 4.0, "review": "The set up was successful once I inserted the plugs all the way in to the sockets.(power and HDMI). I watched a Prime series I have been watching with my Roku devise all a larger TV than the one in my bedroom. The only difference I have noticed so far is the sound; it was not as clear. I have yet to figure out whether or not I can get subtitles. Otherwise, the FireTV Stick met my expectations. Thank you.", "verified": true, "helpfulness": "1/1", "author": "joan dittmer"}, {"rating": 5.0, "review": "Great device. Hides conveniently behind your television while offering a quick connection, easy to navigate interface, and a ton of apps.One thing of note is the comfort of the remote. It's quite possibly one of the best feeling remotes I've ever held. The fact it doesn't have to have line-of-sight to the device just helps add to the experience of using it.", "verified": true, "helpfulness": "0/0", "author": "Ben Estes"}, {"rating": 3.0, "review": "I'll start by saying I like the Fire stick overall.  However, I don't it's quite as good as the Chromecast.  I like having the remote as an option, and I like that I can still \"cast\" media to the Fire Stick like I could with the Chromecast. But other than the remote, I don't see any advantage to the Fire Stick.The negatives I do see with the Fire Stick:1. UI is cluttered with unwanted Amazon content.---Instead of a simple app list, the home menu is full of terrible suggestions and tons of pay content that I have no interest in buying. If you want to know what it's like, try opening Netflix by going to the Play Store or App Store instead of just clicking the icon on your homescreen.  If you  only use a few apps, then this won't be a big issue due to the \"recent\" app list, but you'll still have to see all the clutter on the home page regardless.2. I have to re-purchase Plex for Amazon.---I would MUCH rather have Plex (and HBOGO for that matter) than Amazon Prime Video.3. 5G wireless connection has a ton of bugs.---Android Fire TV app can't find the Stick over 5GHz and several Stick apps have trouble with the 5GHz network.4. No volume control---Different apps have different audio settings requiring me to constantly switch remotes to re-adjust the volume.I'm going to use the Fire Stick for a few more days to make sure it's not just a need to adapt, but right now I think I prefer the Chromecast's device-based interface to the slight advantage of a physical remote.", "verified": true, "helpfulness": "1/2", "author": "malachi"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Ronald Austin"}, {"rating": 3.0, "review": "I already have the Chromecast and when Amazon put this out for only 19 dollars I figured I would give it a try.  The Pros:  I like the remote and  the on screen interface very much.  The Cons:  Who ever designed where the power cord goes should be fired.  it makes it so hard to use with other HDMI devices on my tv.  Chromecast got it right by putting it on the end of the stick not on the top side where it blocks not one but two HDMI ports.", "verified": true, "helpfulness": "0/0", "author": "Jason Ferber"}, {"rating": 4.0, "review": "The Amazon Fire TV stick is a great little device. It has all the popular apps except HBO Go (it's coming soon according to Amazon). The stick and remote are built well from plastic. The interface runs smoothly and has hardly any lag (my eagle eyes noticed a little sputter one of the games but the video streaming apps worked flawlessly). If you like having media displayed on your TV and a remote to navigate through it, you will not be disappointed. This should be a great alternative to the Roku and Roku Stick. If you have a Prime membership or buy digital media through Amazon, it's all linked to the stick. Amazon pre-registers the stick to your account (if you bought it yourself and not a gift) so setup is a breeze. Just plug into HDMI and attach the provided power supply and you're ready to binge watch all the Prime video you can handle. you can plug the stick into a USB port on your TV but Amazon prefers you to use the wall adapter so you'll get maximum performance. I used the USB port on my TV and the stick worked fine. There's a video to even walk you through on how to use it. Since it uses a version of Android, you can also install secure, third party apps from the web. If you like having a software interface and remote, this should be an economical device for you.", "verified": true, "helpfulness": "1/1", "author": "FLorence"}, {"rating": 5.0, "review": "Freaking awesome!!! Easy to setup and use. Can access my Prime account  Netfliz  etc All I need now is the game controller. A great produce.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've had a few days with my Fire TV Stick, and it's just what I was hoping for. I've been through many streamers in my time, from Rokus to Chromecasts, to self-contained off-brand solutions. All of them seemed to be lacking one or two things that were dealbreakers for me. Rokus were sluggish and rarely updated their apps, Chromecasts wouldn't use 5GHz WiFi and wholly relied on external devices for content, and the other solutions were often no solution at all.I purchased a Fire TV Stick for myself, and one for my folks. For me, it offered much better bandwidth to my media server and much improved load times for apps. For my parents, I was able to retire both their Chromecast and Roku, and save on some clutter and operator confusion. All in all, it's just what I was looking for right now.", "verified": true, "helpfulness": "0/0", "author": "Colt Stratton"}]