[{"rating": 1.0, "review": "If you are in the Pacific Northwest and have Comcast Xfinity with HBO, you won't be able to watch HBO-GO with this Amazon Fire Stick, which is a total bummer. I am returning my and getting a Roku, which is compatible with Comcast with HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Ricetub"}, {"rating": 1.0, "review": "I bought this device mainly so that I could stream television shows over Hulu, and it CONSTANTLY freezes and skips during playback, to the point where it's unwatchable.  I know it's not my internet speed either, but I can watch just fine on any other device in the house.  Garbage.", "verified": true, "helpfulness": "1/1", "author": "JP4"}, {"rating": 4.0, "review": "For the price, I can't really complain. I love my FIRE TV and this remote just feels so flimsy to me. It also doesn't keep me logged in like the FIRE TV does, I wish it remembered my Netflix info for faster access. The service is great and Amazon does a great job at streaming video. It's worth $39 in a heartbeat. I'll be getting this for my kids room next!", "verified": true, "helpfulness": "0/0", "author": "Brittney P. \"AdvoCare Distributor~ Brittney Patterson\""}, {"rating": 5.0, "review": "Just what I was looking for", "verified": true, "helpfulness": "0/0", "author": "leroy bogle"}, {"rating": 5.0, "review": "Great! Movies, TV, you can watch it!  Get one!", "verified": true, "helpfulness": "0/0", "author": "BACH"}, {"rating": 5.0, "review": "Great investment", "verified": true, "helpfulness": "0/0", "author": "Suzie"}, {"rating": 5.0, "review": "Makes my television functional without cable.", "verified": true, "helpfulness": "0/0", "author": "alison859"}, {"rating": 5.0, "review": "Wonderful. Amazon did an excellent job of making a wide variety of features available through the Stick. It can be paired with a kindle for viewing from the Kindle to a TV. Couple it with Prime and you can watch many videos free and all of your music prime. So hook that TV with the theater sound and you'll be set. Super easy to setup, it walks you through the process.", "verified": true, "helpfulness": "0/0", "author": "Lovely Lily"}, {"rating": 5.0, "review": "I was surprised that I would like it so much, but I love it. I've had Amazon Prime and streaming via my smart tv and did player for a few years, but this stick made using it effortless and finally something that I use. He interface is very nice and the stick is fast. I'm a true fan and barely watch cable TV any more. Now it's all streaming all the time.", "verified": true, "helpfulness": "0/0", "author": "J. Spinner"}, {"rating": 5.0, "review": "One word....OUTSTANDING", "verified": true, "helpfulness": "0/0", "author": "Reggi"}]