[{"rating": 5.0, "review": "The Fire TV Stick is amazing! I used to hog the PlayStation if I wanted to watch Netflix or Hulu but now they are all at my fingertips with the Fire stick.  On the down side, some of the third party apps suck because they are riddled with ads!!!!  In some cases the long commercials play every 2mins while you're trying to enjoy a show.  Ads Really Suck third party app makers!!! And they are a huge TURN OFF!  Please ease up on the ads,  we get it already!", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "It is great I love it", "verified": true, "helpfulness": "0/0", "author": "Jimmytaylor"}, {"rating": 5.0, "review": "Great purchase!", "verified": true, "helpfulness": "0/0", "author": "Amber L Harris"}, {"rating": 4.0, "review": "The Fire TV Stick was easy to install and it works well.  The only issue I have is that I have Klipsch Speakers and for some reason I cannot get the audio to connect to my speakers.  I was on a Chat for over 25 minutes and to no avail.  The tech support did try several options but nothing seemed to work.  So while I love it, i am disappointed as it loses the theater-like atmosphere..", "verified": true, "helpfulness": "0/0", "author": "Tillie Schlata"}, {"rating": 4.0, "review": "Pretty damn good. Would def recommend", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 4.0, "review": "The only negative thing I will say is sometimes it won't connect to the wireless.  Other than that, I'm good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "great product, but I'm not sure if it impedes the sound volume on my TV. Has anyone complained regarding a loss of volume?", "verified": true, "helpfulness": "0/0", "author": "herb jacobson"}, {"rating": 5.0, "review": "Love it!!!!!!! Much more than I expected 👍🏻", "verified": true, "helpfulness": "0/0", "author": "Frances Coolidge"}, {"rating": 1.0, "review": "I am very dissatisfied with the Firestick.  Constant buffering makes watching very difficult.  I was really looking forward to getting the Firestick and am very very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Cora"}, {"rating": 5.0, "review": "Yes love it", "verified": true, "helpfulness": "0/0", "author": "mirna"}]