[{"rating": 5.0, "review": "I was contemplating on purchasing a smart tv for my bedroom, until i purchased the Fire Stick. So far, I've not had any connection or lagging issues and the picture clarity is great.I highly recommend it for your household or as a gift for someone.", "verified": true, "helpfulness": "0/0", "author": "Tonya K."}, {"rating": 5.0, "review": "It does exactly what I need it to do. I like the shows I get with Prime. I also have Netflix which give me even more of a variety of shows. It is portable and I can watch prime shows on my iPad as well. Nice to start a show on the TV and continue watching on the iPad in another room.", "verified": true, "helpfulness": "0/0", "author": "William C Vollmer"}, {"rating": 3.0, "review": "LIVE TV NOT REAL", "verified": true, "helpfulness": "0/0", "author": "robert melendez"}, {"rating": 5.0, "review": "I have a Roku, AppleTV, Chromecast, PS3, PS4, and all my TV's are smart TVs.  So I am not lacking in ways to stream I am just looking for better ways to do it.  I really like the Fire TV and take it with me traveling and its great because the interface is simple to use.  Chromecast has no remote which means you use your phone which is great until someone calls and you want to pause it but cannot because your phone is ringing.  Connectivity seems to work great and is one of my favorite streamers and I have recommended it to a few friends who also like it.  The Miracast feature is great addition by the way!", "verified": true, "helpfulness": "0/0", "author": "Murph"}, {"rating": 5.0, "review": "Great device!!!", "verified": true, "helpfulness": "0/0", "author": "Jimmy Drake"}, {"rating": 5.0, "review": "works great!!!!", "verified": true, "helpfulness": "0/0", "author": "Debbie Kackley"}, {"rating": 5.0, "review": "Lovet", "verified": true, "helpfulness": "0/0", "author": "Salvador Ramirez"}, {"rating": 5.0, "review": "Fire Stick surpassed my expectations.  I've been the user of another streaming media device for several years.  I was surprised by the speed at which Fire Stick operates and responds to the user.  O was equally impressed with the intelligent, intuitive layout of the system & controls.  I snagged this bad boy for $34.00 on sale.  Even if it were at the regular price, you simply cannot go wrong.  I'll probably pick up another 1 or 2 for the other TVs in my home.  Get it or regret it.", "verified": true, "helpfulness": "0/0", "author": "DJSTEVEZ \"dj-stephen-z-\""}, {"rating": 5.0, "review": "Love it....no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Mark Lawrence"}, {"rating": 5.0, "review": "We were using the Boxee Box but have had a problem with streaming. The fire stick is portable which makes it r favorite new gadget!", "verified": true, "helpfulness": "0/0", "author": "Jordan Kirk"}]