[{"rating": 5.0, "review": "It is super fast, and easy to use.", "verified": true, "helpfulness": "0/0", "author": "David Ball"}, {"rating": 4.0, "review": "Initial setup and starting use was a bit rocky, but it works well now.", "verified": true, "helpfulness": "0/0", "author": "Trayer Wiley"}, {"rating": 5.0, "review": "Happy with this  easy setup and good selection of movies and TV shows  I also have netflix which has different kinds of movies.  This fire stick can be used to control netflex and others like Hulu plus.  There are games available but my son uses xbox  I think the games cost more.  Nicely done.I would recommend for cable cutters.", "verified": true, "helpfulness": "0/0", "author": "van e wahlgren"}, {"rating": 4.0, "review": "All in all, the Fire TV Stick  is the best device that I have purchased in a long time. I have my Amazon Prime videos, Netflix, Pandora and the ability to stream videos from my iPhone in a very compact package for traveling.I am very happy with the AirPlay/DNLA Receiver app on my Fire TV Stick. I plug my Fire Stick into the HDMI input on my receiver when I am home, or into a TV when I am traveling.When home, I use the $2.99 Plex media server app to stream videos from the Plex server on my Win7 PC to the Fire TV Stick that is plugged into my Yamaha Receiver. I did not like the old Plex software on my PC, but the current version is very nice. No video dropouts and the quality can be very good. I installed the Plex media server on my Fire TV Stick and on my PC after AirPinPcSender stopped working.When traveling, I can stream videos from my iPhone using AirPlay. I turn on AirPlay and start playing the video and it appears on the TV. The resolution is good.You can also install a YouTube app on both your iPhone and the Fire TV Stick and play YouTube videos controlled by your phone. Be sure to have the YouTube app open on your Fire Stick TV - then select \"YouTube TV\" as the device from the YouTube app on your iPhone (DON'T select Fire TV). The device is selected by touching the icon that looks like a TV.", "verified": true, "helpfulness": "1/1", "author": "T. Farrell \"Timmer\""}, {"rating": 3.0, "review": "The Amazon Fire TV Stick works quite well.  But ...I have Apple TV.  I have Roku.  I have the Amazon Fire TV Stick.  Even though the Fire TV Stick works quite well, the people at Amazon have not allowed Glen Beck's programs through some sort of censorship.  So if I want to see Glen Beck I have to go into my bedroom and use my Roku.  Also, the menu system on the Fire TV Stick is not as user friendly as Roku.", "verified": true, "helpfulness": "0/0", "author": "David E. Young \"Dave\""}, {"rating": 5.0, "review": "Excellent product. Purchased for $19.00. Regret I only purchased one.", "verified": true, "helpfulness": "0/0", "author": "Josichel"}, {"rating": 5.0, "review": "This is possibly one of my best and worst purchases of my life. The best features, well obviously, being able to stream movies, tv, music, and movies straight to your television. This has been a blessing. I mean, lets be honest, I may pay a lot of money for expensive cable but 90% of the time there is nothing on television that I do not want to watch anyway.The worst feature, the amount of my time I now devote to television! I mean I should be out contributing to society in a meaningful way but nooooooo I am sucked in to binge watching seasons of television shows. Oh well, such is life.Beyond that there were a few problems when I first attempted to set up the system. The stick would not recognize the wifi network in my house so I had to purchase a new router. Once that occurred, the device was golden.", "verified": true, "helpfulness": "1/1", "author": "Desiree Williamson"}, {"rating": 4.0, "review": "I love the FireTV Stick. Doesn't have any extra nonsense, other than a little that's required.Solid product.Only lost a star because the menus look a little dated.If I could rate 4.5 stars I would.If I still love it in a few months I'll update to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "andrew Bailey"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "christian gonzalez"}, {"rating": 3.0, "review": "freezes needs update", "verified": true, "helpfulness": "0/0", "author": "Joshua"}]