[{"rating": 3.0, "review": "Connectivity is spotty at best even though our wireless router is right next to the TV where the Fire TV stick is being used. This seems a bit more complicated to use than the Roku I have. The remote barely works - there's a huge delay between when a button is pressed and when the action is executed. I guess that's also related to the connectivity issue. I guess it's just not as intuitive as I'd like it to be. It was a good purchase for what I paid, but price doesn't mean much if the item itself doesn't function wellI've only used it for about 2 weeks now, so I'll revise my review if things get better.", "verified": true, "helpfulness": "1/1", "author": "Sarah"}, {"rating": 5.0, "review": "Works great love it", "verified": true, "helpfulness": "0/0", "author": "Cynthia Cooper"}, {"rating": 5.0, "review": "Very easy to use. Lighting fast", "verified": true, "helpfulness": "0/0", "author": "Michael B."}, {"rating": 5.0, "review": "It's awesome I love it!", "verified": true, "helpfulness": "0/0", "author": "Kamrin"}, {"rating": 3.0, "review": "I wish there were more free options.", "verified": true, "helpfulness": "0/0", "author": "cassie wiegand"}, {"rating": 5.0, "review": "I wrote a review when I first purchased the stick.  Since then the errors have been fixed and this is an awesome device.  I will be putting one on each non-smart tv in my home.", "verified": true, "helpfulness": "0/0", "author": "Simonne Rey"}, {"rating": 3.0, "review": "Already have a Roku, so it really didn't fill a need.", "verified": true, "helpfulness": "0/0", "author": "Rajarshi Guha"}, {"rating": 4.0, "review": "I like the seamless transition between apps. Also using my phone keyboard for searching is a big plus. It would be nice if you could search for movies or shows across all apps with one search.", "verified": true, "helpfulness": "0/0", "author": "Curtis"}, {"rating": 5.0, "review": "It is extremely easy to set up and even my husband is able to figure out how to use it and he's pretty challenged in the electronics department.  I love all the apps you can get on it and I'm so happy to finally be able to watch Netflix in my living room!", "verified": true, "helpfulness": "0/0", "author": "keebers"}, {"rating": 4.0, "review": "Instructions a  little vague for my level of expertise, but I got it done, I think. A little Amazon top heavy, at least don't make the other services as obscure.", "verified": true, "helpfulness": "0/0", "author": "Bert Vinson"}]