[{"rating": 3.0, "review": "Works well. I don't have access to most of the apps because I have Comcast and they block it. The fire stick works well with sling TV and it's the fastest Netflix app I've ever used.One complaint: the remote malfunctions and send to get stuck in one direction. Not sure if it's a hardware or software issue.One more: I thought it would incorporate titles from other apps like Netflix into its home screen.", "verified": true, "helpfulness": "0/0", "author": "Nick Brisson"}, {"rating": 5.0, "review": "Very easy to install", "verified": true, "helpfulness": "0/0", "author": "maxine mortenson"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "R. Clason \"common sense\""}, {"rating": 4.0, "review": "After waiting 3 weeks, I received my Fire Stick.  I plugged it into my sound system and it immediately was recognized.  Using the supplied remote was simple.  It is somewhat limited on applications, but it has the ones I'm most interested in.  I am satisfied with my purchase and look forward to taking it with me when I travel on business.", "verified": true, "helpfulness": "0/0", "author": "PTTM Munneys"}, {"rating": 5.0, "review": "Gave to my son", "verified": true, "helpfulness": "0/0", "author": "mario g. alfaro sr."}, {"rating": 1.0, "review": "Keeps buffering during movies. I guess I don't have the patience for it.", "verified": true, "helpfulness": "0/0", "author": "Nancy K"}, {"rating": 4.0, "review": "good selection but confusing what is free and costs", "verified": true, "helpfulness": "0/0", "author": "douglas shoaf"}, {"rating": 5.0, "review": "Thank you Amazon!!! Love the fire stick!!! So easy to use. Recommend this to anyone that wants a smart tv but can't purchase one.", "verified": true, "helpfulness": "0/0", "author": "unknow"}, {"rating": 4.0, "review": "I love this over Chromecast.  It was easy to setup, using a remote as opposed to needing another device to get it connected.It works great in the living room, but even with 'excellent' signal in the bedroom doesn't work so well.  I have to extend it by using a 3\" HDMI cable and HDMI coupler to get it to work.  Otherwise it just indicates it cannot get a signal even though it shows full bars.Hulu playback is iffy.  But the more the Hulu apps on any device are updated, the worse they get.", "verified": true, "helpfulness": "0/0", "author": "Sliverbaer \"good times\""}, {"rating": 5.0, "review": "Easy to install and use if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Peggy V."}]