[{"rating": 1.0, "review": "Worked for about a month ... slowly got worse, now just constant errors and I can't watch anything. What a waste!", "verified": false, "helpfulness": "0/0", "author": "jessi hosler"}, {"rating": 4.0, "review": "Love it! However it could be a little more user friendly. But over all it is great!", "verified": true, "helpfulness": "0/0", "author": "cdaniels"}, {"rating": 5.0, "review": "This is the best thing I have bought in years. I LOVE it! Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Sheree Rensel \"wizzlewolf\""}, {"rating": 5.0, "review": "good option over dvd players", "verified": true, "helpfulness": "0/0", "author": "Robertson Dorleus"}, {"rating": 5.0, "review": "I have tried so many items to stream our movies from Amazon Prime and other companies. This is so nice and small and easy to take with you on road trips. I do however thank the remote control could be designed a little better. But I have big fingers and every thing on the remote is small. The right left, up down are in the top circle and the band is a little small to my thinking. But I do love this thing.If you travel a lot and like watching your shows make sure and get this to take with you. It is very easy to set up and has a video tutorial built in. Great value too.", "verified": true, "helpfulness": "0/0", "author": "Jack S."}, {"rating": 5.0, "review": "Works great! When you can't get a Cat5 cable somewhere, just plug one of these bad boys in!", "verified": true, "helpfulness": "0/0", "author": "Jason Saxon"}, {"rating": 5.0, "review": "Amazing value and easy to install or use.", "verified": true, "helpfulness": "0/0", "author": "Rennie van Wyk"}, {"rating": 5.0, "review": "Good for remote areas where sound is not an issue. Plugged in to a TV you won't get surround nor have the option. Using in a bedroom where the blu-ray wifi would not pick up. Works great.", "verified": true, "helpfulness": "0/0", "author": "D. Semple \"Sun Dried\""}, {"rating": 1.0, "review": "I don't know if this product is very shady. A friend highly recommended it. And I've used this about 4 times. I've wasted more time waiting and looking at \"Loading\", \"network connection lost\" every 30 seconds and other error messages. I have yet to watch anything with no problem for more than 15 mins. While all the other wifi devices works just fine. Its only about 15 ft away from the router. It shows very good signal and it drops. VERY VERY DISAPPOINTED.  I wish I can give this no star rating.", "verified": true, "helpfulness": "1/1", "author": "YouKnowIt"}, {"rating": 5.0, "review": "Love it.... Along with my hulu and Netflix.... There's no need for cable!!!!", "verified": true, "helpfulness": "0/0", "author": "Rhonda B."}]