[{"rating": 5.0, "review": "I love the layout and responsiveness. In particular can control the fire stick with my TV remote no need to use the fire stick remote.", "verified": true, "helpfulness": "0/0", "author": "sidd \"sid\""}, {"rating": 2.0, "review": "Overall this thing is good. For $39 it's a fair value. As far as I know the only major differences between this and the regular Fire TV is that this does not have included voice search with the remote (you can still use a phone app or buy the voice search remote separately though if you want), and the Fire TV has an ethernet port and audio out for connecting to a home theater. None of that is worth the extra $40+ dollars to me, so I'd recommend this Fire TV stick over the regular Fire TV.I've mostly only used this for Netflix and Youtube but I enjoy it for both. I synced my normal Youtube account to it and then added Youtube videos to my playlist to watch on the Fire TV Stick. I love searching for documentaries on Youtube!Update: Over the last month or so Netflix streaming has performed terribly on this device. I use other devices for Netflix (PS4, Xbox One, and a Sony Blu Ray player) and all perform better than this device is currently performing. The issue is probably lousy wi-fi reception, though I'm not positive. Regardless It's been annoying to the point that I've nearly stopped using it for Netflix. Also there is still no Vudu app. For these reasons I'm lowering my review score considerably and would not currently recommend buying this. I also like that it has it's own menu listing for my Amazon digital movies. It's very simple to scroll down and go through them. I only have a few, but it does make me much more likely to actually watch them now.The one thing that really hurts this device for me (and the reason I won't give it 5 stars) is the fact that it does not have the Vudu app. I buy quite a few Blu Rays and so have many digital copies of all the movies I love, but I cannot access them with this device. If Amazon ever brings Vudu to the Fire TV Stick, then consider this a perfect 5 star review.", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 4.0, "review": "I bought this when Amazon introduced the product and only paid $19 for it...wish I had bought 2 of them.I had previously bought the Fire TV and returned it due to its limitations.  Those same limitations are present on the Stick version but I was willing to overlook them at only $19.", "verified": true, "helpfulness": "0/0", "author": "El Pato"}, {"rating": 5.0, "review": "Casting to the TV is not for me, but this device turns any older LCD/LED TV into a new multimedia entertainment system. All the music I have ever purchased through Amazon is available in the library with all movies and shows. Plus with Prime, you get access to all Prime movies, tv, now music playlists, and the lasts apps. I bought this less than I paid for the Google product, but I would buy another one of these devices for the same price without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Mine will not turn on or work. I'm very disappointed and will be returning it.", "verified": true, "helpfulness": "0/0", "author": "C. Goodman"}, {"rating": 3.0, "review": "It's ALMOST the best streaming box on the market. It's has The Blaze, HBOGo, YouTube, Hulu, Netflix, the only thing keeping it from being the BEST streaming box on the market... it currently doesn't have the VUDU app. I have over 162 HD movies and tv shows on my VUDU account. Once Amazon allows for a VUDU app it will be the perfect streaming box.", "verified": true, "helpfulness": "0/0", "author": "Eric Chacon"}, {"rating": 4.0, "review": "Get device but have had wifi trouble since the 12/21 firmware update.  Hopefully it will clear up soon.", "verified": true, "helpfulness": "0/0", "author": "J. Mills"}, {"rating": 2.0, "review": "I get tired of seeing Amazon promote the fact that they have tens of thousands of movies and TV shows available online, many of which they say are \"Free to Prime Members\", but when you use this little dongle to access that allegedly HUGE library of content, all you can see is a hundred or so in each category (Movies, TV, Popular, Newest). To make matters worse, there's no way to sort anything -- you have to scroll through titles six-at-a-time in each of their extremely broad categories.Not to mention that virtually every movie I've found that I'd like to watch ... is not \"Free to Prime Members\". I have to rent it.Hey Amazon ... I'm paying you $99/year for Prime. If I have to pay more for movies, I'll subscribe to Hulu or Netflix or get a Roku box where I can get an unlimited number of movies that really ARE \"free\" to their \"members\", as well as live TV and news channels.Also, searching is a PITA with this thing!  You can search for titles, although a lot of popular titles lead to \"promotional videos\" that are simply 2-minute trailers for the TV shows or whatever that aren't otherwise available.You can't get any contemporary news TV shows. You can't get any live broadcasts (that I could find). You can find a lot of TV shows identified by \"Season\" number, but there's no indication of WHEN they were first broadcast, leading me to assume they're targeting people who are already familiar with them.At least the movies have release dates on them.But don't expect to be able to search for anything by genre, actor, year, publisher, or anything meaningful. You'll find a boring drama movie just released this year (2014) right next to a classic comedy movie released in the 1980's next to a chic flick from 2004.And they don't even list the TV shows in any particular order. You'll find Season 3 of something, then a while later find Season 9, then later on Season 1 will show up.Maybe this thing was designed as a game to see how many TV shows and Movie titles you can remember and find by thumbing a button back and forth over a grid of letters and numbers...", "verified": true, "helpfulness": "2/2", "author": "David Schwartz \"The Tool Wiz\""}, {"rating": 3.0, "review": "The Fire Stick is OK. The picture quality isn't as good as on my Sony 5200 DVD player and I am disappointed in its sensitivity to my WiFi signal. Hopefully devices that support the AC standard will be out soon. The interface and speed are adequate. The price is low enough that I'll keep it, but its only OK.", "verified": true, "helpfulness": "0/0", "author": "Herb TwoCrows"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Starla Villalba \"Starla\""}]