[{"rating": 5.0, "review": "Love this product, only really beneficial when purchased with Prime", "verified": true, "helpfulness": "0/0", "author": "Chris10"}, {"rating": 5.0, "review": "Fire Stick's performance is far superior to the Chromecast.. straight out of the box", "verified": true, "helpfulness": "0/0", "author": "Masud Kadri"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Michelle Steffin-Sullivan"}, {"rating": 5.0, "review": "Received it in two days,  plugged it in and it works great.", "verified": true, "helpfulness": "0/0", "author": "maria felicetta"}, {"rating": 5.0, "review": "Love it, works great.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Montgomery"}, {"rating": 2.0, "review": "The stick makes a strange humming noise and constantly gets stuck. There are several apps that I have available on my Roku and other Amazon devices that are simply  not available on my Fire Stick. I would purchase the Roku over this device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great with the exception that it makes the wifi in my house not work as well.", "verified": true, "helpfulness": "0/0", "author": "Sue K-C \"S. K-C\""}, {"rating": 5.0, "review": "I really thought, could a streaming device improve on an early generation Roku?  The Roku was fine, but our second TV was operated thru a mind numbingly slow Blue Ray player so we decided to replace it with this little jewel.  I was so impressed.  Everything is a little faster than the Roku and sooooo much more searchable.  Its awesome.", "verified": true, "helpfulness": "0/0", "author": "Are You In?"}, {"rating": 1.0, "review": "Horrible device. I have a 50 meg download Internet connection, with nothing else running on this Internet connection, start a show or movie and the device takes up every bit of my Internet download. So much so, that I can't do anything else on the Internet, not even basic email.Doesn't matter how long and patient I wait on the streaming/buffering, nothing changes on my Internet download, still maxed out and can hardly get a show to play.I am in the IT industry and know advanced troubleshooting and this device has a serious issue.Also got this device in order to sign up for Sling to view on my TV, Sling membership is going to waste.", "verified": true, "helpfulness": "0/0", "author": "jwhite0071"}, {"rating": 3.0, "review": "Would be a 5 if it had the voice remote", "verified": true, "helpfulness": "0/0", "author": "Dawn V."}]