[{"rating": 5.0, "review": "Pre-ordered one of these as I was looking to replace my Roku 2 that has never received and updated Netflix app.  This is a great product for the price, it's fast, easy to setup and has worked wonderfully so far.  If you have devices that stream and need an upgrade, definitely think about the Fire Stick or Fire TV", "verified": true, "helpfulness": "0/0", "author": "Charles Dumbaugh"}, {"rating": 5.0, "review": "I love it, it's not perfect but then for this price it's a great option to other similar priced items out there. I've noticed that screen animations aren't completely smooth, there are some slight hangups once in a while with animation transitions. The screen saver app photos are jerky on screen as well. I picked this up to use in hotels when I travel for work, I will find out soon enough how it works with hotel wifi. I also have several Apple Tv's and a Roku 3 to compare to as well as a Xbox One. The main winner of this device over the chrome cast is the RF remote, having the remote is great out of box as you don't have to launch an app on your smartphone every time you want to do something.... Also I appreciated the touch amazon did where the Fire Stick is already linked to my Prime account so no setup was required as far as adding my account information to have access to my Amazon library.", "verified": true, "helpfulness": "0/0", "author": "Krewger"}, {"rating": 5.0, "review": "Quick setup.  Works well with my WiFi.  Picture and sound quality are both excellent.  No problems streaming TV shows or movies from Amazon.  Remote works well.  (Can't say the same for the Android app.  But that does not distract from the Fire Stick's excellent performance.)", "verified": true, "helpfulness": "0/0", "author": "M. Reilly"}, {"rating": 5.0, "review": "Absolutely amazing little device. You get the most out of it if you have prime. Like it a lot better then the Roku's it has replaced.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 1.0, "review": "can't mirror laptop .. Firestick sucks..", "verified": true, "helpfulness": "0/1", "author": "Pengfei Yang"}, {"rating": 4.0, "review": "Good, but needs HBO Go added.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Except for my \"slow internet connection\" it worked great.", "verified": true, "helpfulness": "0/0", "author": "Animallover \"Adopt a friend for life.\""}, {"rating": 5.0, "review": "Setup was a breeze. Works well.", "verified": true, "helpfulness": "0/0", "author": "Venkatesh"}, {"rating": 4.0, "review": "Great device - especially if you are using the Amazon features.The search on the Netflix app hangs often (you just back out of it) so I've had to use Netflix on a computer to add items to my list.Really wish VuDu was on the box, as I have a huge library there, but I can see that it's competition for Amazon's digital streaming service and probably will never be offered.", "verified": true, "helpfulness": "0/0", "author": "ChrisL"}, {"rating": 5.0, "review": "So easy to use.  Provides so much entertainment with Netflix and Pandora as well as games and other apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]