[{"rating": 5.0, "review": "More tan i expected!", "verified": true, "helpfulness": "0/0", "author": "lottie"}, {"rating": 5.0, "review": "Remarkably easy to set up and the streaming quality is excellent. The remote app for the iphone is especially handy for voice searching. The only negative is that some streaming services like HIstory Channel and A&E; require that your cable/satellite TV provider offer access via Fire Stick, which some like Directv do not. Otherwise the many different apps that can be installed with Fire Stick give lots of options to access content.", "verified": true, "helpfulness": "0/0", "author": "J Nelson"}, {"rating": 5.0, "review": "My kids absolutely love it and keeps them busy whether it be playing games or keeping up on their favorite shows, I love it too a very good and wise investment to make. It has a lot to offer.", "verified": true, "helpfulness": "0/0", "author": "janet m williams"}, {"rating": 5.0, "review": "Actually, even better than I expected. And a bargain at the cost of Prime.", "verified": true, "helpfulness": "0/0", "author": "Raceman"}, {"rating": 3.0, "review": "Sometimes crashes and needs to be unplugged. Most amazon games don't load onto it like they say they do. I still like it and use it daily. Fix these things and 5 stars all the way.", "verified": false, "helpfulness": "0/0", "author": "Samuel R Wart"}, {"rating": 5.0, "review": "Perfection!", "verified": true, "helpfulness": "0/0", "author": "K. Rena Whittaker"}, {"rating": 5.0, "review": "After reading the manual (sold separately) I found this surprisingly easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "cricutgal123"}, {"rating": 5.0, "review": "Was torn between Fire TV Stick & Fire TV Box. We love the stick. It truly was easy to set up following the instructions. So far this is replacing Cable TV for any TV viewing in our house. Thank you Amazon for another great product.", "verified": true, "helpfulness": "0/0", "author": "DB \"Finally a Mom\""}, {"rating": 5.0, "review": "I have all of the gadgets (Roku, Apple TV, Netflix, etc). But I have to say the Fire TV Stick is my favorite.  The picture quality is impeccable (sometimes my Apple TV is pixelated) and the download is almost instantaneous (Netflix on my older DVD player tends to buffer while the Apple TV may have to restart).  I think Amazon is changing the way we watch TV and movies.  Plus the fact that it comes with my Prime membership may be enough to make me cancel my other services.", "verified": true, "helpfulness": "0/0", "author": "Shawn Maus"}, {"rating": 5.0, "review": "Awesome product!Easy to use and works great. Now I can watch Netflix on my tv instead of my phone... I love it.Just be aware when you get it that the round circle on the remote is actually a navigation button... press it. It took me a minute to figure that out and I couldn't get started until I called tech support for help... yes, I felt very dumb!", "verified": true, "helpfulness": "0/0", "author": "Outrageous Lady"}]