[{"rating": 2.0, "review": "I was disappointed there wasnt more content available for customers who do not have an Amazon Prime account. It seems there would be thousands of programs to watch if you have prime but it wasnt made clear when it was purchased and seemed to me to be kinda self serving to Amazon. If i wanted prime i would have had it already, but i dont see spending 100.oo a year for content you can find elswhere. You also cannot access Nefflix or Huluplus without having those accounts activated as well. Seems the \"Free\" content isnt very abundant. Until i decide to get a Prime account, if i ever do, I now have another useless remote and something taking up one of my HDMI ports.", "verified": true, "helpfulness": "0/1", "author": "Kevin Aveyard"}, {"rating": 5.0, "review": "So easy to use.  It was already programmed to my Amazon account.  Pretty much sets up itself.  I love it!", "verified": true, "helpfulness": "0/0", "author": "RC Wood"}, {"rating": 3.0, "review": "I can not figure out how to use it. I did not want to pay extra for ever show I watch. Not for me.", "verified": true, "helpfulness": "0/1", "author": "cajunlady"}, {"rating": 4.0, "review": "Long wait but glad to get. It works as promised. Excellent entertainment!", "verified": true, "helpfulness": "0/0", "author": "sese2007 \"kriskris\""}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Charles R Overby"}, {"rating": 4.0, "review": "Viewing is much more pleasant. No more HDMI across my living room floor to hook up the laptop.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it. I switched from my chromecast to this. Now I basically have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 1.0, "review": "Month and a half later product was received. ..", "verified": true, "helpfulness": "0/2", "author": "Ricardo Flores"}, {"rating": 5.0, "review": "We love our Fire Sticks! We have 3. 😀", "verified": true, "helpfulness": "0/0", "author": "RENEE COMEAUX"}, {"rating": 5.0, "review": "It works even better then I thought it would.", "verified": true, "helpfulness": "0/1", "author": "William Forbes"}]