[{"rating": 5.0, "review": "one of my new favorite technology items.  Strongly considering dropping cable.", "verified": true, "helpfulness": "0/0", "author": "David Bouse"}, {"rating": 3.0, "review": "I like it a lot. The only thing keeping me from giving it 5 stars isn't even Amazons Fire Stick TVs problem. The issue lies within the SLING TV player included in the fire stick. The sling tv is still a little glitchey. even with a great Internet connection on other WiFi devices, the sling player needs to buffer a lot. The picture does get really pixelated once the picture does finally come back. It plays the Amazon Instant Videos perfectly fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than I thought it would be", "verified": true, "helpfulness": "0/0", "author": "370378"}, {"rating": 5.0, "review": "Compact, works great on my tiny kitchen TV that didn't have a cable box attached!", "verified": true, "helpfulness": "0/0", "author": "Major Rips \"Major\""}, {"rating": 3.0, "review": "Movies should be accessible outside of the U.S.  Apple TV allows it. Why Amazon can't get into the market.", "verified": true, "helpfulness": "0/0", "author": "Cado"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Duchatellier \"JMD\""}, {"rating": 4.0, "review": "It works pretty good.  The downside is that even when it's receiving a strong signal.  Four to five bars it's ability to send back ( it's radio) is not very strong.  Placement is critical. You do not want to be far from the router, and you want the stick unobstructed. An hdmi extender is almost a given.  However its functionality is great overall.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ian Coan"}, {"rating": 5.0, "review": "Loving my Firestick. Used to watch stuff on computer. Oh so much better.  Easy to install and use. Also connects to start phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Fast, and nice. Not a huge fan of the menu look, and it has some oddness with wireless. Plus, mirroring from a Kindle doesn't run very smooth. It's choppy....which I don't get, I have a wireless router that pushes 30+ down, and 300+ networked, not that it's a factor. If I stream directly, it seems fine. Just the mirroring seems to be an issue. But still a nice product.  I'v found it easier to hook up my 2nd gen Kindle directly to the TV with a HDMI cable. Picture is much better. Just sucks, because you have to get up and go to the TV to pick the next item to show. If the mirroring was smoother, it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Christopher Bishop"}]