[{"rating": 4.0, "review": "Great device at a very small price", "verified": true, "helpfulness": "0/0", "author": "Philw99"}, {"rating": 5.0, "review": "I had to wait a month for the Fire Stick because they were out of stock after the holidays but I'm glad I did. This little stick was super easy to install and it works great.", "verified": true, "helpfulness": "0/0", "author": "PBS"}, {"rating": 5.0, "review": "Great! The Firestick provides excellent access. Easy to install. Real value!", "verified": true, "helpfulness": "0/0", "author": "John H. Cox"}, {"rating": 5.0, "review": "Love it! I have two TVs. One upstairs and one downstairs, and I can move it between both without any reconfiguring. Actually, I'm on here to purchase a second one for my \"smart\" TV because I like the streaming shows and capabilities of the Fire Stick way better than my TV's built-in streaming function. I'm sort of shocked by all of the bad reviews. My router is downstairs, and my upstairs TV streams just as well as the TV that is nearer the router. It installed easily and flawlessly on both TVs. I love the simplicity of the little remote. I'm a very happy customer!", "verified": true, "helpfulness": "0/0", "author": "unsatisfied scientist"}, {"rating": 1.0, "review": "Junk. Just received this and it will not connect to our WiFi. We've tried several times over the course of 2 weeks with no success. We've done every single thing in the troubleshooting section to remedy this and it still won't connect. Our router is about 12 feet away. And it has nothing to do with the number of devices on our network since this is simply replacing our Google Chromecast. I guess we're plugging the Chromecast back in. Sorry Amazon-maybe I got a dud but first impressions stick with me. Giving 1 star b/c I have no option to give zero stars.", "verified": true, "helpfulness": "0/0", "author": "kate gibson"}, {"rating": 5.0, "review": "I love it....its just as good as the Amazon Fire Tv....for much less money...has same capabilities...save your money....buy this instead!!!!!", "verified": true, "helpfulness": "0/0", "author": "ann washington"}, {"rating": 5.0, "review": "Oh my gosh - it EXCEEDED our expectations.  We had Chromecast and my husband had no interest in it whatsoever.  However, when the Fire TV Stick arrived and I showed him all that was on it, he commented, please leave that little remote where I can find it.  I guess he's as hooked on Amazon Fire TV Stick as I am!  Bravo, Amazon, once again!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer Deb Swanson"}, {"rating": 5.0, "review": "This is great. Set up was so easy even I could do it. Sure beats streaming in with my laptop. I am enjoying it with  my prime and netflix. Great to find something that you like.", "verified": true, "helpfulness": "0/0", "author": "superreader"}, {"rating": 5.0, "review": "Great experience will make me a couch potato", "verified": true, "helpfulness": "0/0", "author": "kenneth peebles"}, {"rating": 5.0, "review": "so far i love my fire stick. i can watch the movies i like in the comfort of my room", "verified": true, "helpfulness": "0/0", "author": "cindyrella"}]