[{"rating": 2.0, "review": "It is clearly missing most of the movie apps that it should have.  There is no Vudu or Target Ticket or anything good for playing a great deal of digital copies we already own.  I think Amazon needs to add these apps quickly if they are going to compete with Roku", "verified": true, "helpfulness": "1/3", "author": "tomcat7"}, {"rating": 1.0, "review": "I just got my fire TV STICK and I JUST can,t get it to work---I tried for 8 days and NO GO", "verified": true, "helpfulness": "0/2", "author": "joe  b  holguin"}, {"rating": 1.0, "review": "There is a restriction to fully use it in Mexico. I beleive that Amazon should warn about this restriction or even the Prime suscription must says that for international costumers. Expensive and useless. I recomend to buy Chromecast, it's a much better product from a real global company.", "verified": true, "helpfulness": "2/4", "author": "Isaac Hern\u001andez Aguirre"}, {"rating": 4.0, "review": "Still trying to play with it.  I like it so far.  How does it work with Netflix because I thought about purchasing Netflix to go with it.", "verified": true, "helpfulness": "0/0", "author": "Jack A. Caniglia"}, {"rating": 5.0, "review": "works great, easy install!", "verified": true, "helpfulness": "0/0", "author": "Fred Steinberg"}, {"rating": 1.0, "review": "As a very loyal amazon customer, I bought the fire TV stick with very high hopes. Ever sense day one I have had issues with streaming video from Netflix, Hulu, and Amazon. I called amazon customer service and they told me that despite them showing my internet down speed as 11mbps, that I needed to call my ISP and that they would not replace my fire stick. Now it has started resetting itself at random times while streaming video. Best bet: get a roku", "verified": true, "helpfulness": "3/6", "author": "Everett J."}, {"rating": 5.0, "review": "If you have Amazon Prime membership, get this! Price is well worth it! You can use it on any tv - so get more than one if you like - I will.", "verified": true, "helpfulness": "0/0", "author": "NJScorpio59"}, {"rating": 3.0, "review": "if you don't have prime, it's not really worth it. I have a wifi blueray player that does the same function as far as going on pandora & Netflix", "verified": true, "helpfulness": "0/1", "author": "Kathryn Carpio"}, {"rating": 3.0, "review": "PROs: Very responsive UI. Remote is way better than using your phone or tablet to control.CONs: Loses network connection about once a week.  Easy enough to blame on my ISP but the chromecast plugged into the HDMI port next to it works fine during the Fire Stick's connectivity issues. Also tends to disconnect if you watch for several hours, like kids then adults watching a movie in a short span. Only way I've been able to get it to reconnect to network is to unplug it and let it cool down as it can get relatively hot to the touch.Requests: A way to pull up the screensaver and leave it up. I'm lazy and don't feel like uploading my own pics to cycle, plus yours look better.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This should be the \"Guizmo\" of the year.  I have been very pleased with the performance of this small devise.  It is very easy to use and comes with it's own remote.  There is more to watch on the Fire TV Stick you can ever imagine.  The picture is HD quality and the sound is loud and clear.  Amazon has outdone themselves this this small devise.  Everyone should own a Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Robert E. LaGrange"}]