[{"rating": 4.0, "review": "Bottom line, would buy again. Setup was easy and quick. It had trouble initially connecting to wifi (though the device know it had a strong connection.) Had to call customer service and they had me factory reset which did not solve the problem. They offered to send a new one. I decided to try mine again another day and has worked since. Would recommend having it in the same room as the router, had to move mine even closer to prevent delays. Easy to operate, user friendly.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Easy to install and navigate.  Good selection of movies free with Prime.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Willems \"hogman43\""}, {"rating": 5.0, "review": "Works as stated. Easy to use and customizable", "verified": true, "helpfulness": "0/0", "author": "davidknox6010"}, {"rating": 5.0, "review": "I bought this to use with my Slingbox. The product works and Slingbox is one of the Apps, but the Firestick has a difficult way of searching for Apps. I found it on line on the Amazon site and had it sent to my Firestick instead of trying to locate the app on my Firestick, it is much easier.", "verified": true, "helpfulness": "0/0", "author": "Terry"}, {"rating": 3.0, "review": "Pros: Smooth navigation with very intuitive interaction with the sleek remote. Offers a lot of content such as Netflix that's much easier to work with than Netflix off our Blu-ray player. Netflix comes off great. Cons: HBOGO is out-of-sync with its audio (audio is about a half-second ahead of the content) as it renders HBOGO unwatchable. I researched this and found that dozens of others have posted about this issue over the last few months in an Amazon forum (http://www.amazon.com/HBOGO-Audio-sync-Fire-stick/forum/Fx3THIQES502AOU/Tx3BBSA3JCR2T0P/1?_encoding=UTF8&asin;=B0089BPEZS) and many have posted that the solutions given to them are unsatisfactory. One solution was to turn off Dolby, which, even if it does work it defeats the purpose of HBOGO on the Fire Stick. I myself asked for help regarding this issue and Amazon only sent me a form email in response. I'm not confident I'll use the stick all that much if Amazon continues to ignore the problem.", "verified": true, "helpfulness": "1/1", "author": "Tom Oling"}, {"rating": 4.0, "review": "I LOVE IT! only complaint is it randomly buffers while I am watching a show (not sure if that is my internet) but my mom has a roku and that never happens on her, BUT i paid less than half when I got this (20 dollars) so overall I LOVE IT and strongly recommend! super easy to set up :)", "verified": true, "helpfulness": "0/0", "author": "Maiioo"}, {"rating": 5.0, "review": "Awesome! Better than my other 2 devices!", "verified": true, "helpfulness": "0/0", "author": "Carl Thomas"}, {"rating": 4.0, "review": "Long as have a pretty strong wifi signal it's great.. if have less then very good you may experience issues..", "verified": true, "helpfulness": "0/0", "author": "bald11971"}, {"rating": 5.0, "review": "Love my fire stick", "verified": true, "helpfulness": "0/0", "author": "David Enriquez"}, {"rating": 5.0, "review": "Oh so beautiful...installed Kodi on this....is awesome...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]