[{"rating": 4.0, "review": "It's really great. Love the recommendations you get after watching a movie. HD color is also good. Only thing that stopped me from giving a five star rating is the buffering on netflix. Sometimes it can be flat out annoying, other times it's not an issue. Hope they will come up with a fix. Other than that, it's well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Floridaboy"}, {"rating": 3.0, "review": "It's a bit slow and seems to have no difference performance wise from the added power. It has consistent network issues and has now completely stopped connecting. (going to send in for warranty and hope that solves it) Has a great selection of apps, and such, but can't seem to run them as they are really made for the full size unit, not the stick.", "verified": true, "helpfulness": "0/0", "author": "Ethan M."}, {"rating": 5.0, "review": "This is so easy to watch our favorite movies on Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Marguerite Mead"}, {"rating": 5.0, "review": "Works great! Luv it!!!", "verified": true, "helpfulness": "0/0", "author": "Silvia Rodriguez"}, {"rating": 5.0, "review": "Wish I had been using for years.  Much simpler to install and use than I anticipated (anxiety was unfounded).  Can't believe all I get for the small purchase price.  Just love everything about this and have been telling family and friends all over the country, especially those who do not have cable, to get this.", "verified": true, "helpfulness": "0/0", "author": "Gordon F."}, {"rating": 5.0, "review": "It's wonderful. It's so easy, and works really well. I'd recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 3.0, "review": "Works ok for most services but mine will not allow Netflix to load.  It says Netflix is busy and to try again later.  Netflix works fine on the \"Roku and the Netgear devices.  I think Amazon forces Netflix to not work properly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Fire TV Stick.  Will never be at a loss for movie or TV to watch again - Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Not Given"}, {"rating": 5.0, "review": "The best thing ever made i get most of my shows on hula, have Netflix and amazon prime and now hbo go added to the mix able to listen to my Pandora also the best purchase i have ever made with amazon.", "verified": true, "helpfulness": "0/0", "author": "Debra Hines"}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Ms. Williams"}]