[{"rating": 3.0, "review": "I THOUGHT  COULD GET MORE OUT OF  IT !", "verified": true, "helpfulness": "0/0", "author": "Elsa Gonzalez"}, {"rating": 5.0, "review": "Excelent product!!!!!!!!!  Very easy to set up and run.", "verified": true, "helpfulness": "0/0", "author": "Ramon L. Olgin,Jr"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Renato"}, {"rating": 5.0, "review": "Easy install, and great results.", "verified": true, "helpfulness": "0/0", "author": "James D. Baird"}, {"rating": 3.0, "review": "Haven't used it enough to make a decision about it.", "verified": true, "helpfulness": "0/0", "author": "Teresa D. Garnes"}, {"rating": 2.0, "review": "Does it work in Europe while traveling ?I am afraid not, becouse of \"regionalization\".I purchased Prime, only to find that my purchase, my money, does not work in Europe.During cold war Russians were jamming broadcast from BBC, Radio Free Europe or VOA.Now we have \" regions\".Nice.", "verified": false, "helpfulness": "0/1", "author": "as200"}, {"rating": 5.0, "review": "I got this for my dad in Father's Day. We hooked it up Sunday and all he did was watch Netflix the rest of the day! #success", "verified": true, "helpfulness": "0/0", "author": "Candace Switniak"}, {"rating": 2.0, "review": "When it works it's great.. Keeps losing wifi and the router is right next to it", "verified": true, "helpfulness": "0/0", "author": "Maria weatherbee"}, {"rating": 1.0, "review": "If you do not want your kids to get addicted to games, avoid this product. I went looking for alternate ways to access YouTube after google stopped that service on smart TVs that are purchased two years ago. That in itself was a sinister and appalling decision. So when we went looking for a solution, the sales person at Best Buy suggested this Fire TV stick. But Fire TV Stick is not what we should have given the fact that we have a 4 year old boy.", "verified": true, "helpfulness": "0/1", "author": "John P."}, {"rating": 5.0, "review": "I wanted to try Netflix and all the other ....  But didn't want to spend alot of money, so I bought the Fire Stick for $34.00 and it works GREAT. I am an Amazon Prime Member so I get watch alot of movies free.The remote is small this is the only downfall.  However, I put the remote app on my phone.  So, if I misplace the remote (children, you know).  I can use my phone (kids stay away from phone).  You will not be disappointed with this the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Gussy"}]