[{"rating": 4.0, "review": "just love it.  works great, easy to connect", "verified": true, "helpfulness": "0/0", "author": "Ed Miles"}, {"rating": 5.0, "review": "I don't have cable so I rely solely on streaming services for my entertainment needs. I own a Chromecast as well, but enjoy having a dedicated remote and easy to use interface that's provided by the Firestick GUI. Chromecast can be nice to stream YouTube videos and such from a cellphone or tablet, but it's clunky and sometimes difficult to switch between Netflix or YouTube without reseting the device. I haven't had any issues with the Fire Stick in this regard. The inclusion of casual games is also awesome.", "verified": true, "helpfulness": "0/0", "author": "John C. Griffin"}, {"rating": 5.0, "review": "Love it we really enjoy watching Netflix without a computer love it.😃😊", "verified": true, "helpfulness": "0/0", "author": "Marjorie Angelo \"purse collector\""}, {"rating": 3.0, "review": "Bought the Fire TV Stick in October, 2014, didn't receive it until December due to a back order and by May, 2015, it stopped working.  Liked it when it worked.  Liked it enough that I want to purchase another one.  Afraid it won't last..........", "verified": true, "helpfulness": "0/0", "author": "SAC"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Abdoulay G Rodriguez"}, {"rating": 5.0, "review": "Fast delivery, nice product.", "verified": true, "helpfulness": "0/0", "author": "Thomas D. Senne"}, {"rating": 5.0, "review": "Fabulous technology, works great", "verified": true, "helpfulness": "0/0", "author": "Mrs. Sarah \"Ms. Sarah\""}, {"rating": 4.0, "review": "Having just installed this in the last few days, I found this simple, compared to the Chromecast. It is unclear how much content I will find that I like, but it appears promising.", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Green \"High School Teacher\""}, {"rating": 4.0, "review": "You don't save five dollars because making it $34 takes it below the $35 for the free shipping. Add in the cost of shipping and you are back to the original price.", "verified": false, "helpfulness": "0/1", "author": "AndyD"}, {"rating": 5.0, "review": "Works pretty much as advertised! Had to re-boot the unit a few times now but other than that it works well.", "verified": true, "helpfulness": "0/0", "author": "Anthony N."}]