[{"rating": 5.0, "review": "I love how it was preloaded with my information since I am already a Prime customer. Made set up even easier! Great, diverse programming for the whole family. Even discovered more benefits with my Prime membership (hello--MUSIC!).  This is changing the way experience entertainment. Well worth it!", "verified": true, "helpfulness": "1/1", "author": "Michele Brown"}, {"rating": 5.0, "review": "Easy to install and worked perfectly from the start.  Lots of media choices, apps and games.", "verified": true, "helpfulness": "1/1", "author": "John L. Gerrond"}, {"rating": 3.0, "review": "It's not an Apple TV, but I expect it will expand with additional Apps.", "verified": true, "helpfulness": "0/1", "author": "Camper1"}, {"rating": 3.0, "review": "The Fire stick is easy to install and use, however if you have limits on  data usage it can present a problem. If the Fire Stick is on and the TV is on, then it is  using internet, even if you are watching a DVD. It needs an off switch, instead of unplugging it.", "verified": true, "helpfulness": "1/1", "author": "Donnie W Jolley"}, {"rating": 5.0, "review": "When I bought the stick I did not have very high expectations since there is a more expensive alternative. However, this stick provides what it claims. It is great for someone that uses Amazon Cloud for music and photos, who is a member of Amazon Prime, and Netflix. Everything is located in the same spot, which makes it very convenient. The device works really well even though it is wireless--I have not experienced any loss of high resolution or speed when watching movies. Every so often you need to reset it, but it is not a very big deal.Even though the device is listed as not supporting surround sound IT DOES! I love the quality of the sound for playing music and watching movies. I love that it shows the lyrics to the songs.My only negatives are that(1) the stick is that for some reason all movies show up really dark on the TV screen. If I change my TV settings to compensate, it is too bright when I switch to cable. It would be nice if it had some way of controlling the brightness and contrast.(2) even though you have your Amazon cloud music and Prime music available, you cannot modify or create playlists or select specific Prime radios to listen to. If there is a way, I have not figured it out.", "verified": true, "helpfulness": "1/1", "author": "NoWayJose"}, {"rating": 1.0, "review": "A piece of junk.  I can't watch a movie because it is continually buffering.However,  I can watch Netflix streamed to my TV without interruption!", "verified": true, "helpfulness": "0/1", "author": "Jimmy Vaught"}, {"rating": 3.0, "review": "I'm disappointed with this device. I bought two of them when they became available to Prime customers at a big discount. I kept one and gave one to my son at college. I do love the ability to connect my Amazon music into my home theatre and seeing the lyrics on screen for some songs made the Christmas season more fun for the family. However not all features work as designed. For example, the voice recognition in the Android app is not very good. I work with Nuance voice recognition products in my job, so I'm very familiar with how the voice reco should work. Bottom line, it just doesn't work as well as it should. Voice recognition is spotty at best. Plus, connecting the Fire Stick to your tablet or phone to control You Tube is extremely kludgey. There is a consistent disconnect between what is on your device and what your TV recognizes via the Fire Stick. The device almost always loses sync with the TV and you can't control what you're seeing on TV like you should be able to do. This is unfortunate because  I love Amazon and I am a committed customer, but I'm just not convinced that this device is their best offering. I also own a Chromecast and a Roku, so I'm very familiar with how these things should work. The Chromecast is still the better product and is easier to use. Sorry, but I would not recommend another purchase of this generation of Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Like it a lot.  Super easy to set up and to operate, and performance and picture are great.  Only thing is, the stick has a power cable which is not shown in any of the advertising.  You have to plug this thing into an outlet.  Think Amazon is being slightly disingenuous by not featuring this in any pictures or tv adverts.", "verified": true, "helpfulness": "0/0", "author": "Objective Reviewer"}, {"rating": 1.0, "review": "I liked the Fire Stick while it was working.  Two days after the initial use, it stopped working.  The unit would not turn on due to a bad power supply.  I had to return it to Best Buy for a full refund.", "verified": true, "helpfulness": "0/0", "author": "Lost Jedi"}, {"rating": 5.0, "review": "Great interface, easy to use and set up.  I like it more than my chrome cast", "verified": true, "helpfulness": "0/0", "author": "darrell fullmer"}]