[{"rating": 5.0, "review": "Very easy to install. You do have to have an open electrical outlet though. We love ours and would recommend it.", "verified": true, "helpfulness": "0/0", "author": "DSM"}, {"rating": 5.0, "review": "Perfect for the bedroom TV!", "verified": true, "helpfulness": "0/0", "author": "Emporia"}, {"rating": 5.0, "review": "Great value for the money. It lets us stream SlingTV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As of May 2015, this is the best bang-for-the-buck streaming playback device. Has everything that I need- Netflix, Hulu, Prime, TWiT, Spotify (via my phone of computer) and, perhaps most importantly, Plex.It is so simple to use that my 83-year-old grandmother and toddler can both navigate it with ease. If my kiddo misplaces the remote, I can just use my smartphone.Better functionality than my now-outmoded Chromecast for only a few bucks more. Definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Mr. Splashy Pants"}, {"rating": 5.0, "review": "I'm a big fan of the chromecast and have a roku, but am now a huge fan of the fire tv stick.  What it does out of the box is already great but once you tap into side loading apps like showbox,HD cinema, kodi, and Firefox browser this really makes it amazing.  If you're a cable cutter then this is the route to go. And my moga game controller was also compatible!", "verified": true, "helpfulness": "0/0", "author": "AdamB85"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "David Blackwood"}, {"rating": 3.0, "review": "Works as advertised . Will be much better if they add more channels.", "verified": true, "helpfulness": "0/0", "author": "Steven F. Randolph"}, {"rating": 4.0, "review": "TV content -  3 starsApp content - 4 starsGame content - 4 starsMusic - 5 stars and down!!!", "verified": true, "helpfulness": "0/0", "author": "Ale Jul"}, {"rating": 2.0, "review": "I'm generally unhappy with this product after switching from Google Chromecast. It way to often freezes and then fast forwards to catch up and other time it cuts out on sound. Had I known I wouldn't have given away my chromecast.", "verified": true, "helpfulness": "0/0", "author": "alex hartford"}, {"rating": 5.0, "review": "So, I won this product at a work function, and I went into it not knowing fully what to expect... And this little thing has blown my mind away... So much that one little stick can do!! In my opinion, it's definitely worth more than $39.99! I was expecting at least $80.", "verified": true, "helpfulness": "0/0", "author": "Katieeee"}]