[{"rating": 5.0, "review": "Loving it", "verified": true, "helpfulness": "0/0", "author": "jaime vega"}, {"rating": 5.0, "review": "Was a simple process to set up. Had it going in under 5 minutes.  Linked up to my Amazon account and watching movies.  It is awesome", "verified": true, "helpfulness": "0/0", "author": "Z. Collins"}, {"rating": 2.0, "review": "WORKED FOR AWHILE, SOUND KEPT GOING OUT,PICTURE WOULD HANG AT TIMES, TOO MANY PROBLEMS", "verified": true, "helpfulness": "0/0", "author": "Joe Presley"}, {"rating": 4.0, "review": "The Fire Stick was easy to instal. I have a Kindle Fire Tablet and all the pictures loaded into it was available to view on my TV thru this device. There are movies and many other enjoyable entertainment to view.  Only one app that I want to view was not on it.", "verified": true, "helpfulness": "0/0", "author": "Gloria Wheeler"}, {"rating": 5.0, "review": "I love this item", "verified": true, "helpfulness": "0/0", "author": "Christopher Roseboro"}, {"rating": 5.0, "review": "Good product, netflix work in latam", "verified": true, "helpfulness": "0/0", "author": "Roberto A. Arias R."}, {"rating": 2.0, "review": "I don't like that it has to be plugged to the electric outlet, I understood this device would power through the TV, also it is not scanning into my internet to stream, it keeps looping and displaying the message No Network Connection when all other devices in the house are streaming just fine. The brief time it did work it was pretty cool. I have Prime so I guess I can continue to enjoy it through the Playstation... I am returning the Fire Stick.", "verified": true, "helpfulness": "1/1", "author": "M. T. P. Roig"}, {"rating": 5.0, "review": "Great, easy to navigate", "verified": true, "helpfulness": "0/0", "author": "Ken Ng"}, {"rating": 5.0, "review": "Our Fire TV Stick arrived yesterday.  Set up was easy, and I'm not a technical savy person.  The interface is awesome.  We have access to Netfix through our Sony DVD player, but the interface is horrible and frustrating.  Love the interface here and that we can also access our prime videos.  Glad that we got it during the 2 day Prime sale, but would have been happy if I had paid full price.  Thank you Amazon!!", "verified": true, "helpfulness": "0/0", "author": "D. Forman \"Ben's Mom\""}, {"rating": 5.0, "review": "This device so TOTALLY blows away the old Amazon Streaming app that was loaded on our Panasonic Blu ray player!!The old app would tell you: TESTING CONNECTION SPEED, wait, wait, wait... STREAMING MOVIE, wait, wait, wait and then, guess what, even though you had chosen HD (and maybe even PURCHASED it in HD) Amazon would decide that your connection speed (and ours was a rocking 50mbps at the time) just didn't cut it SO THEY DOWNGRADED TO SD!!! Arghhhhh!!! So, we stuck to purchasing only Blu rays.The Fire Stick TV was offered to us as Amazon Prime members for only $19.99 and we figured we'd take the chance on their claims that there would be no more WAITING for movies to stream... that the Fire Stick would already have the movie downloaded to our unit (with storage up to 8GB) and ready to roll before we even knew what we wanted to watch... well, I'm here to tell ya... THEY WERE RIGHT!!!!The menus are just brilliant... you can move sooooo fast through your video library, watchlist, everything else... it just makes streaming wonderful! Add to that, the access to IMDB Cast lists and bios, overview... alternate choices I wasn't even aware of, Dolby Digital + (at this point, if I'm not mistaken, no streaming service streams DTS-HD Master Audio or True HD).We purchased \"The Zero Theorem\" and the graphics just POPPED off the screen and the audio kicked and had plenty of punch and it worked our 5.1 system with panache!Now, I do pit streaming versus Blu ray on nearly the same level. There are some films, like \"McCabe & Mrs. Miller\", \"Restoration\" etc that are NOT available on Blu ray that ARE available in HD streaming - you can't beat that. Or, if you don't care about all the Special Features that Criterion charges you for, you can purchase \"Tootsie\" in HD for only $12.99 versus Criterions $27.97!!Love it - hope this helps...", "verified": true, "helpfulness": "0/0", "author": "Za09"}]