[{"rating": 5.0, "review": "It's the best money I have spent in a long time.Now we can watch movies and listen to music and not have to pay high cable bills.You can pick and choose the movies you want to watch.It's great.You should try it.", "verified": true, "helpfulness": "0/0", "author": "TM Guy"}, {"rating": 5.0, "review": "I loved how easy it was to set up. It already had my prime account login details saved when I plugged it in. Works smoothly. Great UX. I just wish it had full HBO Go access.", "verified": true, "helpfulness": "0/0", "author": "Bensonhurst Jazz"}, {"rating": 5.0, "review": "The Fire Stick is a very good device considering it's size. The dual core chip does the job with Streaming and picture quality is excellent with HD resolution. I have both the Fire TV Box and Stick......The only drawback to the the Stick vs Fire TV is the lack of USB input for a keyboard to navigate.I would recommend it over the Chromecast in head to head usage because it comes with it's own remote and built in Apps. Chromecast depends on another device (Applle/Android/PC) to control it.Good luck", "verified": true, "helpfulness": "0/0", "author": "Theater Guy"}, {"rating": 5.0, "review": "The family loves it. Everything that a smart tv has. An upgrade without buying a really expensive tv.", "verified": true, "helpfulness": "0/0", "author": "Melina"}, {"rating": 5.0, "review": "This is great! Already have Internet on the TV and Apple TV but this outperforms both. Simple to setup and use. Well done, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Carol Manley"}, {"rating": 4.0, "review": "Works well; not quite as sophisticated as some of the larger boxes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own both Google chromecast  and Fire TV stick. I got Fire TV stick for $20 when it is available for preorder. It is a clear winner among these two. I can install any third party application on the device, you can't do that on the chromecast. I have to admit that the streaming is very good and hardly see the buffering issues that I notice with chromecast. A real remote is another added benefit. If I were to choose chromecast or Fire TV I'll pick Fire TV in a heartbeat.", "verified": true, "helpfulness": "0/0", "author": "Balaji Balasubramaniam \"Balaji\""}, {"rating": 1.0, "review": "Same complaint as others.  Drops wifi signal for no good reason when all my other devices work fine.  Back to my wii for streaming movies etc I suppose.  Have the same problem with prime movies as well though so this may not be a device so much as an Amazon problem.  Sure to lose the crazy small remote all to often as well!!  Bought it to watch prime and it will not even do that.  This thing sucks would not buy knowing what I know now.", "verified": true, "helpfulness": "2/2", "author": "Rebecca P."}, {"rating": 5.0, "review": "It is a great streaming device that is easy to set up and use. And when coupled with  Prime Instant video it is a bargain!", "verified": true, "helpfulness": "0/0", "author": "Rodney F. Tims \"Old Wrench\""}, {"rating": 3.0, "review": "I love my FireTV and had high hopes for the FireTV Stick. When it works, it's fantastic. But it seems to drop the network connection quite frequently, and the only way to fix it is to power cycle the Stick by unplugging it and plugging it back in. This minor issue can be quite annoying, and happens nearly every day.Because of this, I can't say I recommend it, but I also won't say I don't recommend it, as when it works, it works well. I hope maybe it's a firmware issue that Amazon can somehow issue and update for and fix.", "verified": true, "helpfulness": "0/0", "author": "Pedram"}]