[{"rating": 5.0, "review": "So far I love it.  I was connecting via a cable and my computer before.  That was too cumbersome and annoying.  Now with the fire stick, I can watch NetFlix and Amazon in an instant.  I have yet to try all the features.  But when I get a chance, I'm sure it will be awesome as well.", "verified": true, "helpfulness": "0/0", "author": "Tevonda Hayes"}, {"rating": 5.0, "review": "Amazing product, easy set up!", "verified": true, "helpfulness": "0/0", "author": "Chapis"}, {"rating": 5.0, "review": "Great product, fast, crisp, no lag time. Simple setup anyone can do it. I love this thing!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kenneth E Higgs"}, {"rating": 2.0, "review": "I thought it was suppose to mirror your kindle.  It does not.  the Firestick comes with a three foot power cord the plugs into it.  I did had not seen any pictures or descriptions of this on commercials or on website.  It really does not do that much more than my blueray player.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "My son bought this and is very Happy with it.", "verified": true, "helpfulness": "0/0", "author": "Bev"}, {"rating": 5.0, "review": "Gave this to my daughter who lives next door and doesn't have cable.  She loves to watch TV series.  With the tv stick logged in to my wireless network she gets superior audio and video on her 42 in HDTV an home theater system.  Setup was a snap and the menu was easy to follow to make changes.  Best 39 dollars I ever spent on entertainment electronics.", "verified": true, "helpfulness": "0/0", "author": "K.  Bassett"}, {"rating": 5.0, "review": "Love it, works great!!", "verified": true, "helpfulness": "0/0", "author": "R. Donegan"}, {"rating": 5.0, "review": "I didn't think I'd find something I like more than the Chromecast. This is WAY better. As a Plex user, I like that I don't have to have my phone or tablet to power it. The user interface is much more pleasing and some of the other apps are great.", "verified": true, "helpfulness": "1/1", "author": "J. Nickel"}, {"rating": 5.0, "review": "So happy to now get Amazon Prime on my TV as my blue ray device doesn't get it!  Works quickly and efficiently.  Easy to browse movies.  Using it for Amazon Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "jcrack"}, {"rating": 5.0, "review": "Just plug it in and connect to wi fi and you are ready to watch many movies and TV programs", "verified": true, "helpfulness": "0/0", "author": "Danny c"}]