[{"rating": 4.0, "review": "Great!!!", "verified": true, "helpfulness": "0/0", "author": "pete gordon"}, {"rating": 2.0, "review": "Fire TV Stick is not there yet.  It constantly locks up and has software issues.  The remote gets non-responsive and I have to unplug the device to reset everything.  Also, I can't figure out how to turn it off.  The instructions do not include how to turn it off (if there is a way to turn it off).  I would not recommend this device at this time.  It needs work.  Also, it's not totally wireless.  You still have to have it close to an outlet so it can be plugged in.  This was not made clear as there's no picture of the power cord in the product photos.  I also have a regular Fire TV.  It works great.  I haven't had the same software problems with it or the non-responsive remote.  Not wireless but neither is this stick.", "verified": true, "helpfulness": "0/0", "author": "Justin Daniels"}, {"rating": 5.0, "review": "I waz secaptal at first but after a few days I got use to the menus and other features and now I love it who needs cable when u got fire stick", "verified": true, "helpfulness": "0/0", "author": "matthew ray"}, {"rating": 5.0, "review": "Excellent product.  Easy to set up and navigate.  Very user friendly.  I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Daniel Beismer"}, {"rating": 5.0, "review": "Its awesome easy setup and i love u can personalized your screensaver :D", "verified": true, "helpfulness": "0/0", "author": "zoie"}, {"rating": 4.0, "review": "Overall great device, extended use creates lagging and has to be power cycled.", "verified": true, "helpfulness": "0/0", "author": "Funkypunk"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Stantuf"}, {"rating": 1.0, "review": "can't cast from PC or desktop? forget it!Cancelled my pre-order.Chromecast supports casting from cloud, windows pc, android phone.  Amazon once again has tried to build a wall around their product, but have strangled themselves instead.", "verified": false, "helpfulness": "1/2", "author": "Barry Holsinger"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "keith cobb"}, {"rating": 5.0, "review": "Awesome! We absolutely love this.", "verified": true, "helpfulness": "0/0", "author": "sabby77"}]