[{"rating": 4.0, "review": "Overall pleased with the Fire Stick but on a few occasions, it has frozen up on me while on the main menu.", "verified": true, "helpfulness": "0/2", "author": "Jenny867 \"Jennifer\""}, {"rating": 5.0, "review": "So glad we finally \"cut the cable!\"", "verified": true, "helpfulness": "0/1", "author": "Barbara"}, {"rating": 5.0, "review": "Fantastic device, easily moved from room to room, and it even worked in the hospital for access to movies!", "verified": true, "helpfulness": "0/1", "author": "col"}, {"rating": 4.0, "review": "Great purchase! We decided to do away with cable, and we can get everything we need with the apps and streaming capabilities.", "verified": true, "helpfulness": "0/1", "author": "diamondback6161"}, {"rating": 1.0, "review": "So far it meets up to my expectations", "verified": true, "helpfulness": "0/4", "author": "Norman Strefling"}, {"rating": 4.0, "review": "It worked for a few days, then repeatedly displayed NetWork Out of Range. After close to two hours on the line with Amazon and Verizon support representatives, decided to go for the only possible solution (which may not work at all) -- a router extender to bridge the 25 to 39 foot distance between the TV and the router. So why did it work for awhile? Service reps said network congestion; seems unlikely since it happened  on several different days in my undense neighborhood. My Verizon FIOs handles all of my other wireless devices quite well no matter where they are in the house. And the router extender costs more the Stick!So the network extender worked and i am able to use the fire stick.", "verified": true, "helpfulness": "0/1", "author": "Donna Allman"}, {"rating": 4.0, "review": "We added this to watch the WWE network.  Also wanted a more selective movie watching choice.  I was a bit overwhelmed by all the things out there.  The fire stick is doing a great job.  Not hard to understand, son did set up as I can't. Only wish is that there was 1 remote, albeit I can live with the 3 I use now.  Fun to watch some of the movies and enjoy the you tube. Was a good investment for time I will spend during surgery recoup and rehab. Then just knowing it is available is a nice touch.", "verified": true, "helpfulness": "0/1", "author": "Charlene Owen"}, {"rating": 5.0, "review": "Love it love it love it!!!!!", "verified": true, "helpfulness": "0/1", "author": "KT"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "mustI"}, {"rating": 5.0, "review": "#1SELLER", "verified": true, "helpfulness": "0/2", "author": "Antonio Matos"}]