[{"rating": 5.0, "review": "So far it has been great, I have it upstairs above my wifi router and had no issues so far. I have noticed a little lag in the remote but nothing that caused any issues.", "verified": true, "helpfulness": "0/1", "author": "Tony"}, {"rating": 3.0, "review": "I need to play with this a bit to figure out if this is worth leaving FIOS for.  I am unable to get back to cable once Amazon Fire TV was downloaded.", "verified": true, "helpfulness": "0/1", "author": "Lisa A Shaw"}, {"rating": 5.0, "review": "We absolutely love the Amazon Fire TV Stick! You save a ton of money over the standard Amazon Fire TV box, and if your TV has the capability to just plug it into an HDMI port, then you're good to go! The only drawback is that it does not have voice activated search on the remote. We have the standard Amazon fire TV in our bedroom, and we use voice search for everything. We were thrilled to save the money with the fire TV stick but I guess I didn't read the fine print ahead of time to see WHY I was actually saving so much money. I didn't realize voice activated search was worth $60, but apparently it is! :-) No big deal – I figure for all of the money I saved, I can easily type letters into the search box. Thanks Amazon, for another great product!", "verified": true, "helpfulness": "0/1", "author": "MyKidsLoveShoes \"MB Hansen\""}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/1", "author": "Cindy O. Harrison"}, {"rating": 5.0, "review": "The Fire TV Stick is so simple and offers so much for the price it is difficult not to sound too overboard.  My family has already enjoyed many movies we have wanted to see for much less that pay-per-view from our cable provider or dealing with DVD's.  I am a moderately computer literate baby boomer with still some anxiety about tackling the newer technologies on my on.  The set-up practically sets itself up and the remote is simple yet leads to a wealth of selections.  Can you find your HDMI input?  Then you can do this no problem.  If only cable providers could come up with this type of simplicity that leads to what seems like endless choices that are easy to search and review.  Thanks again, Amazon!", "verified": true, "helpfulness": "0/1", "author": "Coastal Jim"}, {"rating": 5.0, "review": "Works great!!Just wish I had waited until Amazon Friday when it went on sale!!", "verified": true, "helpfulness": "0/1", "author": "Romans10:13"}, {"rating": 4.0, "review": "The unit works perfectly. It was easy to set up and we love all the programming that is available. The one thing that held us back from giving this five stars is that we cannot leave it plugged in and watch local programming via the antenna. The stick creates interference which cannot be resolved without simply unplugging it from the HDMI slot. We tried to trouble-shoot on the Amazon website, but it simply denied there was a problem. Online we found that some wrap the stick with aluminum foil. We tried that but it only helped slightly. So we've resigned ourselves to unplugging it when it's not in use. Too bad there is no \"on/off\" for the unit. That might have resolved the issue.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey Bleijerveld"}, {"rating": 3.0, "review": "Not quite what I was hoping for.  The Stick is not as pleasing as the Apple TV as far as the menus go and the apps.  Other than Plex, there isn't anything it offers the Apple TV or Roku 3 don't have, and the others are faster.", "verified": true, "helpfulness": "1/2", "author": "Jason"}, {"rating": 3.0, "review": "the Fire TV Stick is a great device. The Hulu App is buggy and can be frustrating but overall the performance is good.", "verified": true, "helpfulness": "1/2", "author": "MRRoth"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "Pat"}]