[{"rating": 5.0, "review": "Great replacement for satellite pay TV", "verified": true, "helpfulness": "0/0", "author": "Leonard R Hansen"}, {"rating": 5.0, "review": "Worked exactly as expected.  No Complaints and I would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "MIchael Ochoa"}, {"rating": 4.0, "review": "My husband and I love our fire tv stick.  Setup was quick and easy, simply plug in and a video introduces you to the Amazon fire tv.  Navigation is easy.  You don't have to worry about turning it on and off, it simply goes dormant after a period of not using.  They have a large library of programs and apps, I wish there was a few more but I'm sure there will be more in the future!", "verified": true, "helpfulness": "0/0", "author": "Hailey Oliver"}, {"rating": 5.0, "review": "Works great! No problems with loading ever!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "I bought this for my mother for Mother's Day. (I know, I know) SHE LOVES IT!!!!  This is her second favorite gift, next to her Kindle Fire.  So far she loves that the music has lyrics, so you can sing along.  She loves the slot machine and bowling games, and the fact that she can watch a ton of movies.", "verified": true, "helpfulness": "0/0", "author": "Toastie"}, {"rating": 2.0, "review": "The concept behind this product is awesome. The actual product.... could be better. My biggest issue is with the lag and freezing that often occurs from very basic usage. I often have to restart the fire stick (which I had to google btw to figure out how to do). At first I thought the issue was my internet, but it's not my internet works just fine. I also use Sling tv quite a bit and I don't know if it's them I should be ranting with, but Amazon supports them so I have no problem ranting here as well. Sling tv used to work great, now I'd say it works maybe a third of the time before telling me an error has occurred. The UX in terms of navigating their menu is awful too.I expected better Amazon. Affordable product shouldn't mean cheap experience, especially when Amazon is normally great in that regard.So... basically BE BETTER Amazon", "verified": true, "helpfulness": "1/1", "author": "NikkiS"}, {"rating": 5.0, "review": "Works wonderfully well.  I am considering weaning myself from cable and dish services and this fire stick is a great way to do it!", "verified": true, "helpfulness": "0/0", "author": "cynthia murphy"}, {"rating": 2.0, "review": "I really wanted to like this thing but I truly can't stand it.  Its constantly sticking or not working at all.  It has no real features and I get more apps on my roku, wii and playstation.  I don't recommend this for a main television.  Maybe a kids room.", "verified": true, "helpfulness": "1/1", "author": "M pulliam"}, {"rating": 1.0, "review": "Did not like because I have to pay extra for High-Def, and fades in and out", "verified": false, "helpfulness": "0/0", "author": "patricia a. bijaczyk"}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Krystle Morales"}]