[{"rating": 2.0, "review": "As long time Roku users, we were pretty excited to get our Fire Stick.Pros:It is easy to set up and use.It has all the same channels that we were already using on the Roku.The picture quality is great.Cons:It freezes up at least once every time we use it.The remote is extremely sensitive, it will pause the show, go up several sections, etc., if you barely touch it.And...did I mention the freezing up? Because that's actually pretty annoying.We are going to be returning this product and going with something else.We might try again after Amazon gets a chance to work out some of the bugs as the concept is great, but it just doesn't work like it should.", "verified": true, "helpfulness": "0/1", "author": "Tamara Ockree \"Tam\""}, {"rating": 5.0, "review": "Awesome product! good job amazon.", "verified": true, "helpfulness": "0/0", "author": "PAguy"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "vernette"}, {"rating": 4.0, "review": "I am passioned for smart things. I have bought and tried some Smart TVs, an Apple TV, a WDTV, Google Chromecast, LG Blue Ray 3D, and some similar functionalities built in in my PS3. Now, thanks to the generosity of Amazon, I have my Fire TV Stick just for $19 as a Prime Benefit and I have some things to share with you:Highlights:- For $19 this is a great media/streaming player- Amazon ecosystem is being improved really fast and enhanced with great digital content- If you are a Prime Member, this is a must have to enjoy music, videos and apps included as part of your benefitsPros:- Besides Amazon content, you are able to see Netflix, Hulu and a lot of more content available online (memberships required)- Unlike Google Chromecast, this stick have its remote and an actual API where you can control what you want to see, which is better for me and for a lot of other reviewers here- Don't like the idea of having an additional remote? If you use your smartphone to control your TV and/or additional devices, with the Amazon Fire Stick Remote App you would be able to do the same. I have this connected to my Samsung Smart TV and it works as an Anynet+ Devices, so I can control this with my TV remote. I read that this also works in some Sony, LG and other TV brands.- As al Amazon device, you will be supported by a really great team which would do the best effort to solve your issue/concern/question- The size is great, you don't need extra space in your shelf/cabinet/table to allocate it. It would be behind your TVCons:- Some times this is not as fast as expected. The interface would have some lag which is annoying- The dives have been made so tiny to be hidden behind your TV, but you have to attach the power cable which for me kills some of the stylish of the device itself- I'm having an issue where I have to re-enter the Netflix login information more often that I would think. None of my other media player ask me for this information unless I have change my password or something like that. I have written to Amazon regarding  this issue and they told me they would be happy to help me during a phone call with one of their support representatives and I have be in front of my TV. Once I have solve this issue I will update this review for sure.Amazon have still to work in some improvements, but in general, I feel happy with this media player.", "verified": true, "helpfulness": "1/1", "author": "Simon"}, {"rating": 5.0, "review": "This is the best device to stream Netflix on. I absolutely love it and would totally recommend it to anybody looking to stream Netflix. It's cheap and works awesome. I bought it for my parents and they love it also.", "verified": true, "helpfulness": "0/0", "author": "Kayla Fleurant"}, {"rating": 5.0, "review": "Easy to setup and it moves relatively fast. I thought I could plug the USB into the TV or cable box for power, but it kept asking for it to be plugged into the wall adapter, so I did. The tutorial goes on a little long, couldn't skip it, but i'm sure some people need it.", "verified": true, "helpfulness": "0/0", "author": "Dr Whom"}, {"rating": 5.0, "review": "I have both the fire tv box and stick... I have been experiencing issues with the box and non with the stick.I am very pleased but wish the stick would have come with a voice activated remote like the box does but I realize then it would cost more for the stick.", "verified": true, "helpfulness": "1/1", "author": "Melfig"}, {"rating": 5.0, "review": "Small and great. I wish if it could power from HDMI, and not require power adapor.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "product worked OK for me.", "verified": true, "helpfulness": "0/0", "author": "gary johnson"}, {"rating": 5.0, "review": "Awesome! We are enjoying our fire stick greatly!", "verified": true, "helpfulness": "0/0", "author": "Pamela C. Hoffman"}]