[{"rating": 3.0, "review": "Works well, but the interface is a little confusing at first, and the lineup doesn't currently stretch very far beyond Amazon's own services and Netflix.  But, in fairness, this is to be expected. The thing just launched, and I think it has tremendous potential as adoption grows.One thing it misses is sling abilities.  For example, I can't use Netflix on my phone and then select the Fire Stick as the playback device.  I have to use the app on the stick to browse and then play.  Not a big deal?  Would you rather \"search\" with a remote than your mobile?  Nope, typing is slow and clumsy.And Amazon Prime Music is kind of a mess.  You can't even search for music on the stick.  You have to search it out online and then add it to your library before you can play it on the Fire Stick.  And while selection is good for an addon service, it pales compared to Google Play Music or Spotify.One bright light -- the native TuneIn app is fantastic.  This brought radio back to my house.All that said, I was an early adopter and these are expected imperfections for a brand new product.  Overall, this shows great promise, and I'm pleased with the purchase.", "verified": true, "helpfulness": "0/0", "author": "xm-s"}, {"rating": 4.0, "review": "The Fire Stick was easy to install and works well, but I was disappointed that so many of the movie choices require additional purchases. My impression had been that the free offerings under Amazon Prime would be exhaustive, but that is not the case.", "verified": true, "helpfulness": "0/0", "author": "Jim59"}, {"rating": 1.0, "review": "I have a Kindle account in the UK and an Amazon.com Prime account in the US.  Apparently this makes it impossible for me to use my US bought Fire stick in the US, as it thinks I am in the UK.  So far (one week later), Amazon technical department have been unable to resolve this.  I will return the stick as useless.", "verified": true, "helpfulness": "1/1", "author": "Barbaros"}, {"rating": 5.0, "review": "Turned my tv into a smart tv, practically. I refuse to pay for cable ever again! Plus, as a Prime customer and kindle fire HDX owner, an entire new world of possibilities opened up with streaming and screen mirroring. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I love that I don't have to fire up my PS3 every time I want to watch to watch Amazon Prime or Netflix. I don't like so much how slow this thing is. Responsiveness is lacking.", "verified": true, "helpfulness": "0/0", "author": "L. G. \"L. G.\""}, {"rating": 5.0, "review": "An amazing deal for the Amazon prime price of half off! It beats the Chromecast in that it has gaming. The down side is that now I need to buy the game controller if I want to play the funner games.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well. Hoping to use this as first stepping stone to eliminate way too expensive cable.", "verified": true, "helpfulness": "0/0", "author": "adam ludwig"}, {"rating": 4.0, "review": "Works good except I cannot get the  PBS app to activate by using the procedure and activation code listed by the stick info. Also I wish it had the basic hulu app in addition to hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Walt Breitigam"}, {"rating": 5.0, "review": "So simple to use!  Great picture quality and lots of offerings.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Morris"}, {"rating": 5.0, "review": "This thing is awesome! I sideloaded xbmc/kodi to watch all my backed up Blu-ray and music library from my upstairs media server. Connected via WiFi-N and runs smoothly. This allows me to watch my media along with Netflix and Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "K. Askari \"neo_rambo\""}]