[{"rating": 5.0, "review": "This was the answer! I can now watch Amazon prime on my TV! Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 5.0, "review": "The Fire TV Stick was the perfect solution for my family room entertainment center. It replaced a Chromecast that just couldn't hold on to my wifi signal. The Fire Stick manages to keep an HD picture streaming with very little buffering while my Chromecast would often offer nothing but a spinning circle.The remote works well, and ships with batteries! It's tiny, so when you lose it (and you will) you can download an app to use on your phone or tablet. This app can offer up even more functionality like voice search.Fire TV Stick is definitely worth a look if you're in the market for a dedicated streaming device, especially if you're already a Prime member. I'd take it above my Chromecast and Roku.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Hobbs"}, {"rating": 4.0, "review": "Excellent item. Allows me to make any TV with an HDMI connection a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "There is always something to watch or music to listen to or a game to play. I hardly ever watch regular TV any more. And you can take it with you wherever you go that has an internet connection and use it. I've had mine since right before Christmas and not a minutes worth of trouble out of it at all. If you want a great streaming media device for your TV, I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Cwmsladym"}, {"rating": 3.0, "review": "I love the ease for which I am able to watch Bosch. I am a prime member. My husband and I put movies we want to see on our watch list. When he tried to watch one it said we have to pay. Doesn't Prime advertise unlimited movies???? What gives???!!!!", "verified": true, "helpfulness": "0/0", "author": "Mary Angela Robinett"}, {"rating": 5.0, "review": "I love it !!", "verified": true, "helpfulness": "0/0", "author": "Marcia Kipnis"}, {"rating": 5.0, "review": "Very easy setup, love the series that are specific to Amazon", "verified": true, "helpfulness": "0/0", "author": "Michelle Mcgee"}, {"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "siobhan Gregory"}, {"rating": 1.0, "review": "Be careful. This is not compatible with all TV's even if your tv has a HDMI connection. Learned this the hard way unfortunately.", "verified": true, "helpfulness": "0/0", "author": "Joel Behlmer"}, {"rating": 5.0, "review": "Great.  Exactly as I expected.", "verified": true, "helpfulness": "0/0", "author": "Howard"}]