[{"rating": 4.0, "review": "Very nice - design and build quality. Sleek and fast interface.", "verified": true, "helpfulness": "1/1", "author": "C. ROBNSON \"Jazz Buff\""}, {"rating": 5.0, "review": "This is a nice solution for streaming.  Wish it had some more support for the 'fling' feature from common desktop browsers (Chrome, FF, IE, etc.) and it's still missing the iOS app as of 11/24.Stoked that it has access to your purchased Amazon music and Pandora.", "verified": true, "helpfulness": "0/0", "author": "DevoRAnd"}, {"rating": 5.0, "review": "Love it! Bought for my daughters room!", "verified": true, "helpfulness": "0/0", "author": "Ricardo Stevens"}, {"rating": 3.0, "review": "It is a good start. I would like to see some updates in the future. The ability to customize the home screen would be great. That way I can have netflix, twitch and prime videos on the home screen. I would also like the \"sleep\" function to be easy to access.", "verified": true, "helpfulness": "0/0", "author": "M & R Blaine"}, {"rating": 5.0, "review": "The Fire Stick is working fine.  Installation was easy.  Enjoying it.", "verified": true, "helpfulness": "0/0", "author": "James B. Norman Jr."}, {"rating": 5.0, "review": "So far so good. I would like it to support Vudu also.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "JoAndra Osborne"}, {"rating": 4.0, "review": "I experienced some issues during installation. It kept telling me that it couldn't connect to wifi. It connected after 3rd time. Also, the parental control passcode (not wifi password) is visible to everyone. So the parental control is pointless.", "verified": true, "helpfulness": "2/2", "author": "jajabor"}, {"rating": 5.0, "review": "Love the new fire stick.  It is very user friendly and easy to start watching shows.  I was pleasantly surprised to the seamless integration with AMAZON Cloud Drive, which allows you to watch personal videos and pictures that are uploaded to the cloud.  Also until the iOS remote app is released its easy to use Netflix or AMAZON prime on your iPhone to find shows and then sending it to the TV to watch on big screen.", "verified": true, "helpfulness": "0/0", "author": "LA Cool"}, {"rating": 5.0, "review": "Excellent! I bought this while it was on promotion for $20...a really good deal. Relatively easy to connect to the TV...just find the HDMI slot and push in. My TV has two HDMI slots and it did not work in slot #2 but it worked in #1. I connected the power source, installed the batteries on the remote and \"it was good to go.\" It was very difficult to remove the battery cover on the remote, but with patience it finally started to move. If this happens to you, be patient! I get Netflix, Amazon, PBS, and others providers too. I'm a Prime member and a lot of the Amazon \"stuff\" is included but not all. I was surprised there were still a few programs that demanded payment. I'm very pleased with the Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]