[{"rating": 4.0, "review": "Easy to install, add prime and it's the best deal", "verified": true, "helpfulness": "0/0", "author": "Dennis Reynolds"}, {"rating": 4.0, "review": "Love my Amazon Fire stick, many more pros than cons! I have to admit, I was a bit apprehensive about purchasing the fire stick for two reasons: first, I haven't used my DVD player since my kids went off to college because my husband and I can't work it, and second: we live in the country and connect wirelessly via a service called bluezoom through a WiFi antannea on the roof of our house, and I didn't know if the speeds would be ample. But then I reasoned that I had enough signal to watch movies on my tablet on my prime account, was quite proficient with my computing skills, so maybe this could work. And besides, the price was really reasonable so if not I could give it to one of the kids or send it back. So I are ordered it and the unit arrived about a month earlier than anticipated to my surprise. Super easy install - plug it into a USB slot on your TV and connect the power cord to the stick and you're good to go. It came up immediately, and watching movies has been no problem at all. I've even taken the plunge and signed up for Netflix and hubby is loving the classic TV app. The only problem I've had is that when I try the search function and manually type in a movie name, the app will somehow revert back to the home screen half way through my searches, and I have to search several times to successfully find what im looking for. The same thing happens when I'm browsing a category like genre. But I'm hoping a software update fixes the problem. We love the extra remotes installed on our tablets as well.", "verified": true, "helpfulness": "0/0", "author": "Angela40330"}, {"rating": 5.0, "review": "Quick and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Albert"}, {"rating": 5.0, "review": "Easy setup and works great. The only minor issue was getting the door of the remote open to insert the batteries. It took a little more effort than you might expect.", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 5.0, "review": "I got this \"Pre-release\" for $20 and I have to say, what a bargain. Even for $40, still a great deal. I have an older  Pre-Smart TV and needed a connection to my wifi. This answered the call. Very easy to setup and very ease to use. I really wanted to do the Fire TV device but I have no LAN connection near my TV. Anyway, the picture is great, Netflix and Amazon Prime Streaming work very well. I even side-loaded \"Kodi\" and I have no complaints what's so ever. I'd buy again if I needed another.", "verified": true, "helpfulness": "0/0", "author": "powmaster"}, {"rating": 5.0, "review": "this is great. try it.", "verified": true, "helpfulness": "0/0", "author": "Richard L. Howe"}, {"rating": 2.0, "review": "The interface is wonderful but the streaming does not keep up so it buffers every minute or so which renders it pretty much useless. The Fire Stick indicated our WiFi signal as very good, and we don't have any trouble with buffering in other devices.  The Netflix app seemed to do a better job than the Amazon instant video but even with Netflix it buffered a few times in 40 minute show.", "verified": true, "helpfulness": "0/0", "author": "Wiscomom"}, {"rating": 5.0, "review": "Love this product! So excited to change up how we watch tv.", "verified": true, "helpfulness": "0/0", "author": "Tabitha"}, {"rating": 1.0, "review": "Buffers alot, my WiFi router is new and WiFi connection strong, very frustrating as I try to stream HBOs John Adams on Amazon prime", "verified": true, "helpfulness": "1/1", "author": "happy shopper \"Leslie Day\""}, {"rating": 5.0, "review": "It was very easy to set up. We were up and running in just a few minutes.", "verified": true, "helpfulness": "0/0", "author": "Anke Heckhoff-Wedul"}]