[{"rating": 3.0, "review": "I expected more free movies even after I purchased amazon prime. Some of the \"for rent movies are free on Netflix, and most are cheaper at red box.", "verified": true, "helpfulness": "0/1", "author": "Harry Williams"}, {"rating": 5.0, "review": "Works just awesome!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gordon J. Dubs"}, {"rating": 1.0, "review": "I bought this to stream netflix", "verified": true, "helpfulness": "1/6", "author": "DaisyRoscoeSam"}, {"rating": 5.0, "review": "It is an awesome device.", "verified": true, "helpfulness": "0/1", "author": "Vinson Johnson"}, {"rating": 4.0, "review": "The Fire TV Stick is a media streaming device. It displays videos on a television or other display device in resolutions up to full 1080p High Definition and delivers sound with Dolby Digital Plus for speaker configurations up to 7.1. It does not support newer standards like Ultra HD (4K), Dolby Atmos, or HDMI 2.0.Two AAA batteries for the remote control are included, as is an HDMI extender in case the stick is too wide to fit in the HDMI port on whichever display device is to be used. This same concern for space problems did not extend to the included AC power adapter which is a 1.5 by 1.5 by .75 inch plastic box with retractable blades protruding from the very center. Plugging it into a standard power strip wasted three outlets.The power adapter connects to the stick using a standard USB-A to USB-micro cable, so theoretically it could be connected to a convenient USB port instead of using the inconvenient adapter, but the manual states that for best performance the adapter should be used.The Stick is very well packaged with each piece either in a form-fitted plastic tray or neatly separated by cardboard dividers. Clear plastic film is wrapped around all of the major components, which took quite a while to meticulously peel off. This kind of packaging assures that the device will arrive in mint condition.Setup is simple -- install the batteries in the remote, plug the Stick into the TV or whatever display device will be used, connect the AC adapter into the Stick, and follow the instructions on the screen. Normally a stone-cold simple task, but it took three tries to connect to my WiFi router. There was no error message to indicate why the connection failed the first two times.Once connected, the WiFi is very stable and fast, supporting dual band wireless \"n\" and all previous protocols. The current wireless \"ac\" protocol that is in common use is not supported but will hopefully be a future upgrade. And, since it is automatically registered to the Amazon account that purchases the device, any video or audio content previously bought is displayed for immediate use. Once setup is complete, the Home menu is displayed on the screen.A voice search option is available using the free mobile app. I found this easier to use than trying to initiate a search with the included remote control because it is tedious to type one character at a time to create a search phrase. To do this, once the Home menu is displayed, start the mobile app; select the Fire Stick and type in the four digit number displayed on the TV screen.A voice search can be started from the mobile device by dragging the displayed microphone icon down from the center top edge until it displays \"listening\", then holding that position while speaking a search term or phrase like an actor's name, movie or television show title, etc.The Stick's version of what was said will appear in a box on the television screen, and either a list or the selection will appear. From there, the search can be initiated by making a selection and tapping the mobile device screen. The search can be narrowed to only Prime choices by saying \"Prime Only\" before the search term or phrase.Regardless of the method used, search results are structured with closest matches at the left with less exact matches appearing to the right. For example, a search for \"Godzilla\" included \"Maleficent\" further to the right.In addition to the voice search, this free app encompasses all of the other features of the remote, although I found the \"touch pad\" interface is erratic making it difficult to navigate effectively. Simply paging through a list of movies returned by the search was needlessly cumbersome and wasted a lot of time.The Fire TV Stick plays three kinds of video/audio material including streaming Amazon's live content, digital content stored on the cloud purchased from Amazon, and material from external sources such as mobile devices or apps available from the Amazon App store such as NetFlix, Vevo, HuluPlus, HBO GO, Watch ESPN, MLB.com Premium, etc.Game apps can be downloaded, many for free, but it is not much fun playing most games with the remote control or the Fire TV remote app on a mobile device. Amazon sells a wireless game controller which may improve the experience but I have not tried it.Another capability of the Stick is that it can connect to a PC monitor with an HDMI input and a sound output so videos and music can be played without turning on the PC utilizing the equipment like a separate home entertainment center. I was impressed with video and sound quality.The Fire TV Stick is fast and convenient to use, easy to install and has future potential since Amazon appears to be interested in adding content and apps.", "verified": true, "helpfulness": "1/1", "author": "M. Hill"}, {"rating": 5.0, "review": "Very nice device for turning a \"dumb\" tv into a \"smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "Joe Schmuckatelli"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Brad Lips"}, {"rating": 5.0, "review": "At first I wasn't sure if this would be any good. I pre-ordered it at a great price.  It was easy to set up and easy to navigate.  You must have it plugged in for it to work properly. You can use the power cable that comes with it or you can plug the usb cable into your tv usb port. Works fine either way.  The control moves flawlessly with no hesitation. There are many apps (Neflix, Hulu plus, YouTube etc...) to chose from and you can install more ( some free, some not free).I love the integration of the Amazon instant video which made it easy to find my previously purchased shows and movies.  I plan to buy another one for my living room tv even though it is portable. The only \"flaw\" is that it doesn't have a power off button. It goes into standby after a set time.  I just unplug mine. But that's just me. Overall I love it and glad I decided to get it.", "verified": true, "helpfulness": "0/0", "author": "S. Moody \"Starcat\""}, {"rating": 5.0, "review": "Awesome! Easy setup and use. I highly recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Raleigh"}, {"rating": 4.0, "review": "I am not giving the Fire Stick five stars until I connect my husband's stick in his basement man cave. If he can use it with ease, then I will give it 5 stars.  I bought the voice controlled remote for the upstairs which I like.", "verified": true, "helpfulness": "0/1", "author": "CJ"}]