[{"rating": 4.0, "review": "Streaming takes high speed internet. Servers have been down once where internet wasn't an issue but the media couldn't be connected to. Will update later at another time if that continues, for now has only happened once. Would like video that costs to be separated more from other videos.", "verified": true, "helpfulness": "0/0", "author": "Buyer2345"}, {"rating": 5.0, "review": "Best thing I ever bought. I take it everywhere. I know i could just use my phone to watch tv. But this make my life easier. Plug it into any tv that I can get it into , hop on the first avalible Wi-Fi signal. And watch what I want or  my kids favorite shows. It works well at grandma's house.", "verified": true, "helpfulness": "0/0", "author": "angus35"}, {"rating": 1.0, "review": "I have 150 Mbps internet speed and this thing still buffers its ass off. I've done everything I  can do and still buffers. Junk go with something else and don't waste your money. Amazon missed the boat on this thing.", "verified": true, "helpfulness": "0/1", "author": "oke10710`"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "penny moran"}, {"rating": 4.0, "review": "It's exactly what I expected.", "verified": true, "helpfulness": "0/0", "author": "Shoji"}, {"rating": 5.0, "review": "Best product I've used in a very long time. The interface is extremely snappy and the device allows a great deal of user control. I am a big fan of the way Amazon has allowed 3rd party apps to be installed. It's as simple as using an android app called \"apps2fire\" to copy over your favorite android apps to the big screen. I've installed Firestarter launcher that brings up all my third party apps at a doubletap of the home button. Not only can I watch my favorite shows, but I also have my favorite classic Nintendo / Sega games to play. All packed into a stick that could fit on a keyring. Unbeatable price point. Getting a chromecast / roku over this beauty would be a mistake.", "verified": true, "helpfulness": "0/0", "author": "Jesse Fleming"}, {"rating": 5.0, "review": "Very impressed", "verified": true, "helpfulness": "0/0", "author": "......"}, {"rating": 5.0, "review": "Has good selections of tv shows and movies. Worth getting especially if you have only very basic cable.", "verified": true, "helpfulness": "0/0", "author": "sammi"}, {"rating": 5.0, "review": "I was impressed with how easy it is to use. I 'll liked the help video that can be accessed. I have watched off several movies on Amazon Prime. I need to subscribe to Netflix to increase my viewing.", "verified": true, "helpfulness": "0/0", "author": "Al Chance"}, {"rating": 5.0, "review": "One of my favorite purchases this year. I want to buy another one!", "verified": true, "helpfulness": "0/0", "author": "norm"}]