[{"rating": 1.0, "review": "NO NO its a miss", "verified": true, "helpfulness": "0/4", "author": "Jim R. \"ZB\""}, {"rating": 5.0, "review": "Love this little gadget!  It was easy to install after we contacted our internet service provider and Amazon and got input from them on what was needed.  Started streaming immediately after connection and it is super!  Works smoothly with just seconds of download time to get into the connection.", "verified": true, "helpfulness": "0/0", "author": "JZ"}, {"rating": 5.0, "review": "I've enjoyed wathing Prime movies and TV shows, but my teenage boys have had the most fun playing games now available on our TV.  It's been a great purchase.", "verified": true, "helpfulness": "0/0", "author": "Michelle Gemmell"}, {"rating": 5.0, "review": "Great!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Juli Michel"}, {"rating": 2.0, "review": "PROS- Enjoy the remote as compared to Chromecast- Interface seems to be well layed out for my needs although a little more cluttered than Roku- Easy to setupCONS- Stops to load frequently- Has locked up a few times that required a restart- Overall connectivity seems to be questionableAs an owner of 3 Rokus and a Chromecast, I do like the size of the Fire Stick as well as the very easy to use remote.  The Netflix interface looks much better than on my Roku 2 as well as most of the other \"channels\".  However, when compared side by side to the Roku, on the same wireless network in the same location, it does not perform as well.  It constantly stops to load or buffer and multiple times has got to 25% and stopped for 3-5 minutes.  My wireless speeds are around 20-30 Mbps so should not be causing any streaming issues.  It appears it just doesn't properly smooth out the content or must \"buffer\" differently than the Roku.  The Roku loads at the beginning but never experiences any lag or drops.  Overall I enjoy the physical specs and interface, but its issues with streaming (which shouldn't be an issue for a streaming stick) are pushing me to return to using the Roku.  Hopefully these issues could be resolved with a firmware update at which point I will update my review.", "verified": true, "helpfulness": "1/2", "author": "jeremym8"}, {"rating": 3.0, "review": "As a small device it's great with a lot of content. At times it's a little slow loading screens and running other apps. For watching Amazon stuff, and listening to Amazon Prime Music it's awesome.Recommend: If you need a portable device to stream content, definitely get this. If you can sacrifice portability, get the Amazon Fire TV box (not the stick). The extra speed and horsepower helps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's my daily thing!", "verified": true, "helpfulness": "0/0", "author": "Federico Romero"}, {"rating": 5.0, "review": "Nice product, would purchase from this vendor again", "verified": true, "helpfulness": "0/0", "author": "Ronnie Amazon Customer"}, {"rating": 5.0, "review": "I really like the Fire TV Stick. Much better than Apple TV, unless you depend on Apple Air. But for Netflix and Amazon Prime, it works great and the picture is wonderful! I like the fact that you can go into the settings and change the picture quality. That helps if you have slower Internet. I like it better than Chromecast, too. I downloaded some apps that have relaxing music and waterfalls and stuff. Even an aquarium! Pretty cool!", "verified": true, "helpfulness": "0/0", "author": "Cranky Greg"}, {"rating": 5.0, "review": "All I can say is It's Amazing! Installing and using is very quick and easy.  I'm still exploring all of the entertainment options.  I am very happy with the Fire TV Stick.  I have reccomended it to all of my friends.", "verified": true, "helpfulness": "0/0", "author": "Larry L. Brumfield"}]