[{"rating": 5.0, "review": "So far it's been working great!!!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Fogelmark"}, {"rating": 5.0, "review": "Great buy for individuals that do not have a smart TV in their bedrooms.", "verified": true, "helpfulness": "0/0", "author": "Jody Sanders"}, {"rating": 5.0, "review": "Nice to be able to access all my stuff on another TV only 39.00, it is easy to navigate!", "verified": true, "helpfulness": "0/0", "author": "JoAnn Brady"}, {"rating": 5.0, "review": "Easy to use and highly recommended. If you have the internet, who needs cable?", "verified": true, "helpfulness": "0/0", "author": "John B."}, {"rating": 4.0, "review": "Works great for the kids room TV", "verified": true, "helpfulness": "0/0", "author": "David Crow"}, {"rating": 5.0, "review": "Great product. Instant access to all the movies and content you want", "verified": true, "helpfulness": "0/0", "author": "Bret"}, {"rating": 4.0, "review": "I've had this item for some time now, and am very pleased with it.I honestly had the chrome cast, and a Roku already. I bought this item to play fibbage, but once I began to use it, I found the Fire TV Stick to be easier to navigate for myself, and my family.A great buy. I travel for work, and setting this up on a hotel display takes two minutes to setup.", "verified": true, "helpfulness": "0/0", "author": "David Horowitz \"Steve Holt!!!\""}, {"rating": 5.0, "review": "great product , fast delivery", "verified": true, "helpfulness": "0/0", "author": "daniel g. ortiz"}, {"rating": 3.0, "review": "I surprised that you can't mirror from my amazon kindle hd.But it was easy to set up.More difficult to figure out how I can mirror from my ipad or hd. I only had this product for 2 weeks and the fire stick makes it enjoyable to watch Netflix and my Amazon prime shows on the big screen.", "verified": true, "helpfulness": "0/0", "author": "kristy cervantes"}, {"rating": 5.0, "review": "i bought this for my 7 year old's room. Now that we have it I wish I would have never bought the chrome stick for my living room. So much nicer than having to cast from my phone. also love that they offer other movie channels on the home screen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]