[{"rating": 5.0, "review": "The Fire stick is easy to use and the picture is beautiful. I am enjoying the experience", "verified": true, "helpfulness": "0/0", "author": "Rhea J Boscolo"}, {"rating": 5.0, "review": "Performed well", "verified": true, "helpfulness": "0/0", "author": "Patrick J Nevison"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up and easy to use. Gives me more reasons to love my Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Janis bunck"}, {"rating": 5.0, "review": "Wonderful!!  Great, great service and support", "verified": true, "helpfulness": "0/0", "author": "Michel  Tschirret"}, {"rating": 3.0, "review": "Was under the impression you could play video or project games from your phone onto the TV. Thus far I've not been able to do that. It will play pictures I upload, but that's it. 5 stars for the easy set-up and other functions.", "verified": true, "helpfulness": "0/0", "author": "Scott Preston"}, {"rating": 5.0, "review": "Easy installation and great performance", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to set up!  Lots of titles to choose from", "verified": true, "helpfulness": "0/0", "author": "E. Shipman \"shopper\""}, {"rating": 5.0, "review": "Bought this in late 2014 when it was offered for $9 or something like that. Thought I'd check it out. I also have a Roku, a Chromecast, and a PS4 - plenty of streaming options. The chromecast obviously has more flexibility, and roku is great. But I will say I'm impressed with the Fire TV stick. Functions pretty much like a Roku, but is a lot cheaper.If you're just looking for a way to stream Netflix, Amazon prime, Hulu, or Pandora - I'd recommend this over a Chromecast because this comes with a BT remote like newer Roku's do, which is surprisingly handy - but it's a lot cheaper than a Roku (at the moment). If you want a chromecast for other purposes (streaming from a browser, Lollipop screen mirroring etc) then stick with the Chromecast. And of course it's dead simple to rent or buy stuff from Amazon as you would expect.I find this to be a great solution for someone looking for a low-hassle, low-cost means to stream movies and such. Note that it DOES require it's own power connection plugged into the wall, unlike the Chromecast which can be powered from the TV's USB port. Just something to keep in mind. And the power connection sticks out of one side of the fire tv stick which means it can't be placed \"between\" other HDMI connections.", "verified": true, "helpfulness": "0/0", "author": "Rob Maynard"}, {"rating": 5.0, "review": "Worked great,", "verified": true, "helpfulness": "0/0", "author": "Cecil H. Evans"}]