[{"rating": 1.0, "review": "Again just fire stick does not respond to the bt remote... Amazon has replaced it once, but after installing the replacement today i still can't get the remote to work w/o being behind the tv... The tablet app works, what's up?. Since this was a replacement and I've returned the original i don't seem to have the option to request a replacement, any assistance? Thanks, KD", "verified": true, "helpfulness": "0/0", "author": "Ken Duke"}, {"rating": 5.0, "review": "I wanted netfilx box for a family member and it fills that role perfectly tho on the first day it was running a bit hot so after u set it up let it stay plugged in and in sleep mode for a while should be fine", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 3.0, "review": "It sucks that I can't use it for HBO because an agreement with Comcast wasn't reached yet.", "verified": true, "helpfulness": "0/0", "author": "Valeria"}, {"rating": 5.0, "review": "Very happy with my order.", "verified": true, "helpfulness": "0/0", "author": "dorothy anderson"}, {"rating": 5.0, "review": "I purchased the Fire Stick because my blu ray player was having problems connecting to Netflix.  The Fire Stick connects quickly, the controller is easy to use, and you can't beat the price.  Why pay $200 for a smart TV when when the Fire Stick will make your TV smart.", "verified": true, "helpfulness": "0/0", "author": "Roger Watson"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I find this to be better than the competition (i.e. Google Chromecast, Roku) because it is easy to use and you don't have to stream through your computer. Roku is similar but I like the Amazon interface better. There are a variety of different apps; I can watch HBO GO, Hulu Plus, Netflix, view photos, use youtube, watch CBS and NBC news, and even TED talks. Very happy I purchased the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Chelsea Heaps"}, {"rating": 5.0, "review": "It's very very good I love it.", "verified": true, "helpfulness": "0/0", "author": "Carlos Barreda"}, {"rating": 5.0, "review": "Easy install.  Take it out of the box and plug it into the back of the tv then to the electrical outlet", "verified": true, "helpfulness": "0/0", "author": "Luvs2Read"}, {"rating": 5.0, "review": "It was unbelievably easy to set up and use! Love it so far!", "verified": true, "helpfulness": "0/0", "author": "happiness"}]