[{"rating": 5.0, "review": "I literally use it everyday for Netflix and Hulu, fell in love with it when I ordered it definitely recommend!", "verified": true, "helpfulness": "1/1", "author": "Tayah"}, {"rating": 5.0, "review": "Love the Amazon fire stick, we wouldn't have it any other way.  The stick doesn't buffer quite as quickly as the fire TV does but that was expected due to memory and size.  We have both and this is on the secondary TV.  Love it, can't say enough about its capabilities, this and it's big brother are worth every penny!", "verified": true, "helpfulness": "1/1", "author": "Lyle LaBonte"}, {"rating": 1.0, "review": "Pretty unsatisfied with the fire stick. I just got the product today and it wont even go 10 minutes without loosing connectivity to my wi-fi.", "verified": true, "helpfulness": "0/1", "author": "Trinity Schmidt"}, {"rating": 1.0, "review": "Yes, its easy to install and a little easier to search. But beyond that, no value add to my Sony Bravia TV.I wanted to listen to music-limited choices and doesn't even play whole song.I wanted to use screen mirroring to look at photos with friends but its not compatible with either my iPhone or my Surface Pro. So thought I would sign into Shutterfly-oops-not supported.So try signing into Google-oops, not supported.Really Amazon? who uses an Amazon Fire phone?", "verified": true, "helpfulness": "1/2", "author": "Quen Zorrah"}, {"rating": 4.0, "review": "Very entertaining well worth the money", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "The great item and an excellent acquision.", "verified": true, "helpfulness": "0/0", "author": "Giovanni"}, {"rating": 5.0, "review": "Adore my Fire Stick. I love watching movies on my devices, but sometimes you just want it on the big screen! Super-easy set up. Remote is idiot-proof and we even take it with us on every road trip and vacation so that we can watch our Watchlist, Netflix and YouTube movies and shows.", "verified": true, "helpfulness": "0/0", "author": "L. Webster"}, {"rating": 5.0, "review": "excellent product!", "verified": true, "helpfulness": "0/0", "author": "Nikkita \"Nicoletta\""}, {"rating": 4.0, "review": "The Fire stick works well, the power cord could be longer.", "verified": true, "helpfulness": "0/0", "author": "Michael Lau"}, {"rating": 5.0, "review": "I love it!!", "verified": true, "helpfulness": "0/0", "author": "Vette"}]