[{"rating": 5.0, "review": "The quality is fantastic.  I started watching movies in this Fire TV and it's amazing..  I only wish they had more choices rather than all the good popular ones, they say, either you need to rent it or buy it.  Still, it is worth every penny.  Awesome choices and excellent quality!", "verified": true, "helpfulness": "0/0", "author": "Amazon Frequent Buyer"}, {"rating": 5.0, "review": "The Fire TV Stick has met every expectation I had for it ...  it was easy to install, is intuitive to operate, and has provided an added dimension for video entertainment when the opportunity presents itself!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I love it I'm going to get  to more", "verified": true, "helpfulness": "0/0", "author": "Lovella C."}, {"rating": 5.0, "review": "What a change, it works great just as advertised.", "verified": true, "helpfulness": "0/0", "author": "CL WELCH"}, {"rating": 5.0, "review": "Love it! Great product at a great price!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "This review is based on the promotional pre-order price that was available to prime members.We use the Firestick on our bedroom TV and Chromecast out in the living room. The Firestick is nice in that the interface is comprehensive of all content. We have not used the prime app as a remote- only the hardware remote. It gets confusing if we lose that tiny little remote. Changing between apps/content is much smoother than the Chromecast and of course the Firestick includes amazon prime, which Chromecast does not.Chromecast is individual apps casting content so changing between apps (Hulu to Netflix) can be a less than smooth. However, I really like mirroring my web browser for things like reading, twitter, etc.. Also, it is much more portable since it is just the drive and your phone, which is always on your person. Chromecast is better for portability and casting the Chrome browser. Firestick is better in having most content.", "verified": true, "helpfulness": "0/0", "author": "M&B"}, {"rating": 5.0, "review": "Easy setup, amazingly good music & video catalogs & all for an astounding price which includes all the other benefits of Amazon Prime!!!", "verified": true, "helpfulness": "0/0", "author": "Kip Jankowski \"Listener/Writer/Seeker\""}, {"rating": 5.0, "review": "Absolutely love it!  It works perfectly and I've no problems at all.  Have used it for Amazon Prime, Netflix and Hulu Plus.  Many hours have been spent using it since it was received, so I can honestly say that it could not work better.", "verified": true, "helpfulness": "0/0", "author": "TexasTradition"}, {"rating": 5.0, "review": "Easy to set up and works great!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "This is a great idea, but it needs to be unplugged and plugged back everyday in order to reconnect to the Internet. I have better luck with my chromecast. If you own an iPhone or ipad, you won't be able to mirror to you tv with Firestick or chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]