[{"rating": 2.0, "review": "To use the phone Fire TV app, you need the remote with you.  You can't use the phone Fire TV app by its self.  You need the Fire Stick Remote too?  Why offer an app when I need the remote too?", "verified": true, "helpfulness": "0/0", "author": "Robert Newman \"RN\""}, {"rating": 2.0, "review": "I have enjoyed the product itself. What I did NOT like was being asked during set up if I wanted to try Amazon Prime for free for one month and then finding a $101 charge on my credit card. I was interested in trying the Prime free to see how I liked it in comparison to similar services. Thankfully I was able to end the membership and have my money returned. But this left a bad taste in my mouth and I most likely will go with one of the comparable services.", "verified": true, "helpfulness": "0/1", "author": "MommyDJ"}, {"rating": 5.0, "review": "Love it,quick setup for Prime videos.", "verified": true, "helpfulness": "0/0", "author": "Frank Padilla"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "tery"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mendo77 \"Mendo77\""}, {"rating": 5.0, "review": "Love this thing! Bought it for my YouTube only solution and end up using it for all my streaming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So I made the jump. I had AT&T; u verse internet & TV bundle, $190/month.  I dropped that down to internet only for $45/month, got the Fire TV stick, and signed up for Netflix and Hulu+, $8.99/each. With the Prime membership I already have, my options are virtually endless. The buffering so far has been extremely limited, and only happens with Hulu, leading me to believe it's their problem, not the fire stick. I couldn't be happier with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Interestingly Different\""}, {"rating": 5.0, "review": "Fantastic. Now I can watch movies and shows on Netflix and Amazon Prime using my HDTV.", "verified": true, "helpfulness": "0/0", "author": "ces"}, {"rating": 2.0, "review": "After the last update it is horrible. Netflix and YouTube crash constantly. Can barely stream amazon movies.", "verified": true, "helpfulness": "0/0", "author": "Pen4711"}, {"rating": 5.0, "review": "Easy to set up and easy to use.  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "CPC"}]