[{"rating": 4.0, "review": "Love it! No need for cable tv!", "verified": true, "helpfulness": "0/0", "author": "Stephanie brown"}, {"rating": 2.0, "review": "Constantly loading,takes forever to watch a show, even with high speed internet", "verified": true, "helpfulness": "0/0", "author": "Angela m Gallo"}, {"rating": 5.0, "review": "Had my son plug it in and away I went!  Great.", "verified": true, "helpfulness": "0/0", "author": "Rosey Kyle"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "vlk"}, {"rating": 5.0, "review": "This is a great product.  My other TV has a roku stick.. hard to pick my favorite though.  They are good for different things.", "verified": true, "helpfulness": "0/0", "author": "Nicki"}, {"rating": 5.0, "review": "I ordered the Amazon fire tv stick as a replacement for a new Roku that I returned (the roku was expensive and you had to subscribe and pay for ALMOST ALL content; little was included); what a fortunate decision! The Fire TV stick  works great. Easy to use, intuitive, and excellent voice search (Siri could learn something here!)! Coupled with my Amazon Prime Membership, it's an outstanding deal!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Bat"}, {"rating": 5.0, "review": "So far I love it! I really only use it for Netflix, Hulu, Pandora, and YouTube (because the other apps require subscriptions or whatever), but so far it has been great. I didn't want to shell out a ton of money for the AppleTV, plus my boyfriend has it, and while it is great and I am a avid Apple fan, this tiny thing does what I need it to do, at half the price.", "verified": true, "helpfulness": "1/1", "author": "Corrie"}, {"rating": 4.0, "review": "We used the Amazon Fire TV stick on a recent trip and it was brilliant. Plug it in, get it set up with the hotel wireless, and go!We'd tried the Roku stick first, but it couldn't handle the hotel wireless system (which required that you click \"agree\" to gain access). Fire TV had no problem with that at all. It was easy as pie to get it up and running.My only complaint is that the Fire TV Stick doesn't get as good of wireless reception as the larger (puck-sized) streaming devices.Otherwise, though, it's the perfect media player while on the road.", "verified": true, "helpfulness": "1/1", "author": "J. Walsh"}, {"rating": 3.0, "review": "should work with tv usb not an extra adapter. Apps should work in all countries", "verified": true, "helpfulness": "0/1", "author": "Nelson Herrera"}]