[{"rating": 5.0, "review": "We love it. Perfect for what we need.", "verified": true, "helpfulness": "0/0", "author": "Crystal C Rumsey"}, {"rating": 5.0, "review": "Very easy to set up.  Includes both Netflix and Amazon prime apps", "verified": true, "helpfulness": "0/0", "author": "White collar"}, {"rating": 5.0, "review": "Has been great", "verified": true, "helpfulness": "0/0", "author": "Ronnie"}, {"rating": 5.0, "review": "Love this.  Makes it life so convenient.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Semo"}, {"rating": 4.0, "review": "Good product.  Good price.", "verified": true, "helpfulness": "0/0", "author": "Kevin Riechelson"}, {"rating": 5.0, "review": "Samsung told me that my not quite five year old tv was not compatible with Amazon Prime Streaming.  When I asked if there was a work around, the representative stated that I would have to update my television.  Not believing this could be true, I emailed Amazon Prime who quickly responded.  My television was not compatible but they supplied me with a long list of devices that were.  Since I did not want another electronic device taking up a lot of room, I ordered the Fire Stick.  It was up an running in less than 5 minutes and works beautifully.  I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "sonora"}, {"rating": 5.0, "review": "Love this. I actually bought 2. One for my daughter & one for my living room. Their is so much you can do on this. Great investment.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 4.0, "review": "It's easy to install and works very well except for one glaring issue. You can't resume where you left off on Amazon Videos, I don't know why but it won't work. Amazon please fix this. Other than that it's great, works mostly as I expected.", "verified": true, "helpfulness": "0/0", "author": "Tye Ortiz"}, {"rating": 4.0, "review": "works fine", "verified": true, "helpfulness": "0/0", "author": "lee m wibert"}, {"rating": 5.0, "review": "Everything I expected and at the touch of a finger. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Don Boddeker"}]