[{"rating": 5.0, "review": "Fast, responsive, easy to use, good wireless support and streaming support has been real good even though my wireless network is not great throughout my house.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 1.0, "review": "Don't lose the remote for this device. You won't be able to use it ever again afterwards. I even have a phone that I can use as a universal remote for any TV but it won't work on this device just for the simple reason of them not being on the frequency of Internet connection. same router, same Internet connection, different frequency, yet this p.o.s won't work!", "verified": true, "helpfulness": "0/0", "author": "Tpmmy F."}, {"rating": 5.0, "review": "Happy with the purchase", "verified": true, "helpfulness": "0/0", "author": "sonya green"}, {"rating": 5.0, "review": "My sons like this fire stick, great selection, although we need prime now!", "verified": true, "helpfulness": "0/0", "author": "Julie, RS"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Garrett"}, {"rating": 5.0, "review": "Works great and easy to use.  Great selections of shows.  Better than cable.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Mann"}, {"rating": 5.0, "review": "Great product.  After opening the box we were up and running in 1/2 hour.  Very easy to use and is fast.  Downloaded the phone app, this also works very well.", "verified": true, "helpfulness": "0/0", "author": "A. C. Karlo"}, {"rating": 4.0, "review": "It was easy  to hook up and start I still have to play with it to see what ot does  ut I get netflix on a tv tthats not even hooked up to cable just  by Putting in my codes.  I am a bit disappointed that I will have to pay extra for certain programs.", "verified": true, "helpfulness": "0/0", "author": "dorothy koprowski"}, {"rating": 4.0, "review": "Plex streaming at 1080 is almost impossible. Skips. Would prefer the wired version by far. Or a forge TV", "verified": true, "helpfulness": "0/0", "author": "BGaulin"}, {"rating": 4.0, "review": "Very impressed with the easy set up and syncing with Fire HDX tablet. Love it!", "verified": true, "helpfulness": "0/0", "author": "Susan C"}]