[{"rating": 1.0, "review": "Overheat and freeze after two hours of watching", "verified": true, "helpfulness": "0/0", "author": "h"}, {"rating": 4.0, "review": "I do like the Fire TV Stick.  It has a great interface.  The remote is simple and easy to use.  It was easy to set up; Amazon even put my account info on it for me so it already knew who I was out of the box.The things I don't like:  I have had network issues with it not liking a strong internet connection, I see others have had the same problem.  This problem seems to appear and disappear at random.  I'm not sure why.  The other problem I had is that it only allows 720p or 1080p streaming.  I have a slow internet connection and unfortunately that is what I'm stuck with in my area.  I can't even pay more to have faster internet.  The stick constantly under-buffers for 720p or 1080p.  Some lower quality streaming on Amazons end would help.  My Panasonic BlueRay Player does not have this problem when using it's Amazon app though.  It however does use a direct internet connection rather than a wireless one.All in all I like the FireTV Stick.  I just think there are still some kinks to work out.", "verified": true, "helpfulness": "0/0", "author": "Sean Lehman \"Sean Lehman\""}, {"rating": 4.0, "review": "The Fire TV Stick works great and is really fast! The only thing I don't like is the fact that you cannot add as many 'apps' as you can to the Roku (a similar unit by a different manufacturer). I can't wait to try the voice command when the iOS app is released! Be advised you DO need to connect the stick to an AC outlet. (The power supply is provided in the accessories....they just never mention it.) The remote is small and sleek!", "verified": true, "helpfulness": "0/0", "author": "Dean in NC"}, {"rating": 4.0, "review": "My original review was One star because of...I want to like it, and it seemed good in my limited use when it worked, but it hasn't been worth the horse S time dealing with it. I got one, did the power-cycling on all devices (Fire Stick, Modem, Router); didn't work. Did tech support, and nothing. Chalked it up as a lemon. Returned, got another and same WIFI connection problems. Everything is \"Currently Unavailable\" or I am \"Connected with problems\".No issue on my laptops (2), PS3, iPhone, iPod, Galaxy Tab, Sony Smart Blu-Ray player or any other number of devices that have connected with my network along the way.Even if it is MY network/router, it SHOULDN'T be - as in, the device should be able to operate just as any of the other devices HAVE and DO.Pretty disappointing, to be honest. I love Amazon's services, but their devices have been misses (Kindle Fire and now this) with me.Lack of stock, currently, and at this point, I would just wait for a second generation.*** Update 1/16/2015I took a few nights and forgot about my headache with the unit. I had the opportunity to take the unit to my Uncle's house and signed in without issue there. In saying that, I was able to update the software there, came home, plugged it in after another hard reset of my router (which I did originally, as well), and it WORKED! I like it a lot now that it is functional. Fast, good response, good picture, the sound is a little low but fine, and the apps thus far seem good/great. The addition of Amazon music and photo viewer capabilities, is awesome as well! I do enjoy the product now that it works, and if it wasn't for the HEADACHES, I would LOVE it.", "verified": true, "helpfulness": "1/2", "author": "M"}, {"rating": 3.0, "review": "I have both ROKU and the Fire Stick (FS). I bought the FS when it was available the Prime Members for $20 and because I was running into issues with the ROKU not connecting , reliably, to my work WiFi (after consulting our it department and various blogs determined the ROKU WiFi is finicky. The FS connects to what ever WiFi network I challenge it with unconditionally. So, why 3 stars. It promised Showtime, which it has, however, unlike the ROKU it doesn't support Showtime if the provider is DirectTV (or DirectTV doesn't support the FS). This is huge for me as I have DirectTV and can not take advantage of Showtime and I suspect I will have the same issue with HBO. I do have Netflix and Amazon Prime, both work flawlessly. I might not have bought the FS had I known about the lack of Showtime support. If anyone has a solution to this issue, I'd appreciate a notification.A less important criticism, unlike the ROKU the FS can not be powered from the TV USB port, which is significantly more convenient, especially when traveling to hotels and trying to find a spare plug.", "verified": true, "helpfulness": "1/1", "author": "Drmaverick_tx"}, {"rating": 4.0, "review": "Love it but the roku stick does have more apps and channels.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this thing. You can turn just about any TV into a video streaming TV. I went around the house plugging it in to different TV's and it worked on all of them. We currently have Roku boxes but now can move this device from TV to TV instead of having a dedicated streaming device permanently attached to each TV.", "verified": true, "helpfulness": "0/0", "author": "Dipper Foxtrot"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "danielpanduro"}, {"rating": 5.0, "review": "Love it! It was so easy we plugged it in and immediatley watched a movie. Of course, prime is the best.", "verified": true, "helpfulness": "0/0", "author": "Carol Ann Pelton"}, {"rating": 4.0, "review": "So far so good. I like the smooth operation of the programming and services on it. Just wish I could mirror some things from my phone on it.", "verified": true, "helpfulness": "0/0", "author": "Guillermo"}]