[{"rating": 5.0, "review": "Works great and does everything I expected it to.", "verified": true, "helpfulness": "0/0", "author": "Brittany Knudson"}, {"rating": 5.0, "review": "Excellent product.  WorksWell.", "verified": true, "helpfulness": "0/0", "author": "Thomas MaKinster"}, {"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Brunella"}, {"rating": 2.0, "review": "Has to b constantly b restarted.", "verified": true, "helpfulness": "0/0", "author": "jamie Million"}, {"rating": 2.0, "review": "Was so excited to finally order and get my Amazon fire stick in so I could use it in my room. I have been nothing but disatisfied with this product. I followed all the steps set it up and since day one has not worked correctly. Says it is connected to my internet with very good strength yet cannot play anything and when it finally does load it loads to 25% plays for less than a minute and loads again. I have good internet everything else in the house works yet this doesn't. I wish I wouldn't have spent my money on this and I wouldn't have had I know it would be more of a hassle than a blessing.", "verified": true, "helpfulness": "0/0", "author": "C.R. \"C.R.\""}, {"rating": 3.0, "review": "Great when it works. However we often have to reset it by changing the USB port we plug it into because it loses its signal.", "verified": true, "helpfulness": "0/0", "author": "Monica Milano"}, {"rating": 5.0, "review": "Excellent, easy to use!! Love the fire TV stick. On time fast delivery.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline S. Lane"}, {"rating": 1.0, "review": "Well I will start by saying I absolutely loved my Fire TV Stick for about a week. The reason I am giving it 1 star is because it completely stopped working after that first week. I have tried a different Amazon power source and it still will not work. It is completely shot. I really love Amazon and have a Fire phone myself, but this is the first Amazon product I have been unhappy with. Waste of $40.", "verified": true, "helpfulness": "0/0", "author": "Joe S"}, {"rating": 5.0, "review": "I really love it", "verified": true, "helpfulness": "0/0", "author": "vicki hubbard"}, {"rating": 5.0, "review": "Easy to work, and met my expectations. So much to explore.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]