[{"rating": 3.0, "review": "Remote to small for larger hands or people that have stiff or arthritis", "verified": true, "helpfulness": "0/0", "author": "paul j labruzza"}, {"rating": 1.0, "review": "My fiance and I bought this because we don't have cable. At first, it worked great. Then, without having changed the router or our internet, the device just wouldn't stream. It was literally 4 inches from our router, so we know it got great signal strength. Eventually the device became unuseable. I contacted amazon support for help and they sent me a new device. That one had the same issue, if not worse. So I contacted support a second time. Then sent me a SECOND replacement. At this point, it was a week later and by the time the second unit came, I ended up with THREE unworking amazon fire sticks and lost the 40$ that we spent instead of getting a smart TV [we bought a new TV the same day we got the fire stick]. Now we have wasted hours of time trying to get the device to work with no luck.Support was also suppose to call me to help me with it and never did. I've even had my router replaced and paid for Comcast to come out to the house and check our exterior lines and everything and all signs indicate it's just the device. Bummer. We won't buy any more amazon specific devices.", "verified": true, "helpfulness": "2/2", "author": "Kelsie"}, {"rating": 5.0, "review": "Amazon does a great job of making things simple to install and simple to use!  The Amazon Fire TV stick works great.  Probably will switch my Netflix subscription to streaming rather than getting actual discs.", "verified": true, "helpfulness": "0/0", "author": "Greenjeans"}, {"rating": 4.0, "review": "Nice product a great addition to my bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "nice as present", "verified": true, "helpfulness": "0/0", "author": "orlando"}, {"rating": 5.0, "review": "Was easy to install, works great. No problems so far.", "verified": true, "helpfulness": "0/0", "author": "Bob B"}, {"rating": 1.0, "review": "Slow download . I went back to roku", "verified": true, "helpfulness": "0/1", "author": "Rita Crespin"}, {"rating": 5.0, "review": "Simply amazing!!! After months of research and comparing it to Roku and Chromecast, i finally ordered it on Prime Day for $20. Best purchase ever! I think i may cancel cable tv but going to test the waters first. I wish i didnt wait so long to get one.  The best feature is I can now view all my IP surveillance cams on my TV! Love everything about it. No cons yet. Pull the trigger and get one.  I know it may sound like I'm affiliated with Amazon (I'm not) but I'm getting the Amazon Echo next when it goes on sale next.", "verified": true, "helpfulness": "0/0", "author": "Amit"}, {"rating": 5.0, "review": "Setup and use very simple. Reception excellent", "verified": true, "helpfulness": "0/0", "author": "Margo W. Tyler"}, {"rating": 3.0, "review": "Works as advertised.  I do not like that fact that you have to supply power to the unit.  Makes for a messy and cumbersome setup.  Plus, the cord they provide is not long enough.  Performance is good and fast.  Don't believe and of the articles you read about wirelessly connecting to other game controllers.  If you can even get it to connect, the lag is very bad.  The best part is easy access to my prime lineup.", "verified": true, "helpfulness": "0/0", "author": "Scott S"}]