[{"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Mysura Reddy"}, {"rating": 5.0, "review": "Love it!!! Goodbye cable!", "verified": true, "helpfulness": "0/0", "author": "Michael Sutton"}, {"rating": 4.0, "review": "My Firestick worked fine when first installed (1 day) but now refuses to recognize my a Wifi network. All other devices on my network connect with no problem.Revised Review: after turning the Firestick on and off several times it now works as advertised.", "verified": true, "helpfulness": "1/2", "author": "Gil Few \"Gilbert E. Few\""}, {"rating": 4.0, "review": "Very powerful device for its size.  I would have given it 5 stars if it allowed me to throw mobile device media the way the Chromecast does.  I was looking to completely replace the Chromecast with this device.., but maybe next model of the Fire TV Stick will have this feature.The only other complaint I have is not knowing if the selected show or movie will cost additional $$ until I open the selection.  There should be an icon showing additional costs before opening the selection.", "verified": true, "helpfulness": "0/0", "author": "NicholasTroyer"}, {"rating": 5.0, "review": "Great little product!", "verified": true, "helpfulness": "0/0", "author": "Felix J. Perez \"Just Felix\""}, {"rating": 5.0, "review": "Loving the fire TV stick for Plex, Netflix, and You Don't Know Jack Party! Definitely a stocking stuffer!", "verified": true, "helpfulness": "0/0", "author": "Dhruv P."}, {"rating": 1.0, "review": "Not happy with the video streaming.  It buffers every few minutes.  I have an amazon prime app on my Playstation 3 and it doesn't behave this way,  the app checks the connection speed up front and then loads a pre-buffer to preveny constantly interrupting playback.  Silly me to assume that the fire tv stick would be as advanced as the app, or more.", "verified": true, "helpfulness": "1/1", "author": "IDBUG \"T\""}, {"rating": 5.0, "review": "Great cheap media player", "verified": true, "helpfulness": "0/0", "author": "Tony C"}, {"rating": 5.0, "review": "Good product.  Now I don't have to run the Xbox constantly to watch netflix.  The only thing I wish these little stick things would do (chromecast included) is draw power from the t.v., it sucks to have to plug it into a power source and the t.v.", "verified": true, "helpfulness": "0/0", "author": "Chris Moriarty"}, {"rating": 5.0, "review": "I pre-ordered this for $19 and am extremely pleased. I would have easily dropped the $39 price for one.", "verified": true, "helpfulness": "0/0", "author": "Brian Sokolowski"}]