[{"rating": 5.0, "review": "It's awesome! Other than live local news, I don't miss cable.", "verified": true, "helpfulness": "0/0", "author": "Niegin Bassett"}, {"rating": 5.0, "review": "It is great and was easy to install and set up.Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Carol Landy"}, {"rating": 5.0, "review": "Absolutely fantastic device.  We got rid of our Dish Network and just use the Firestick and the apps you can download.  Using SlingTV, Netflix and Hulu I'm only paying $40 a month as compared to $104 with Dish and all of their channels I didn't use.  My kids love that they can go to their favorite shows at the push of a button rather than wait for a certain time for them to come on and their is more content then OnDemand.  My wife loves Netflix documentaries and I'm a fan of their original TV shows.  No more cable or Satellite for me.  And the picture quality is very sharp coming from this littler bugger.  Give the Firestick a try and also try the apps with free trials to see how you would like it.", "verified": true, "helpfulness": "0/0", "author": "Omari James"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ryan Collins"}, {"rating": 5.0, "review": "Great price with plenty to see", "verified": true, "helpfulness": "0/0", "author": "david trevigne"}, {"rating": 5.0, "review": "great decision!", "verified": true, "helpfulness": "0/0", "author": "P Parks"}, {"rating": 4.0, "review": "Good device. I wish it had a setting for closed captioning but otherwise works well and is convenient.", "verified": true, "helpfulness": "0/0", "author": "mark kitzman \"book maven\""}, {"rating": 3.0, "review": "We like it a lot My husband found found  OLD movies that he loves.", "verified": true, "helpfulness": "0/0", "author": "Jeanette Hayes"}, {"rating": 5.0, "review": "I'm so glad I finally gave in and bought this. I love it!", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 5.0, "review": "The fires stick is all that and more. I previously had Apple TV. This is soooo much better. I'm glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Willie"}]