[{"rating": 5.0, "review": "I got my Fire TV stick yesterday, and had it set up in less than 15 minutes.  It's super easy, and all the apps I need are available (Netflix, Hulu Plus, Pandora).  This is really a great product!  Brings your favorite computer/tablet programs to the big screen of your tv.  I definitely recommend this to anyone who is even considering dumping his/her cable company but keeping internet service.  Two thumbs up!", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 5.0, "review": "Wow.  It turned my TV into a smart TV.  The fire stick can do so many things.  This the Fire TV Stick gives you access to movies, music and your  photos as well as games and more via your television. I'm telling you, you do not have to have an ounce of technological know how to have this thing up and running in a matter of minutes.  So easy to use.", "verified": true, "helpfulness": "0/0", "author": "skinny izzy"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Kurt Causie"}, {"rating": 5.0, "review": "Works well.Pros:-Very easy to install,-displayed picture is of better quality than my Cable picture!-very good selection of free movies - I'm an Amazon Prime member,-used double stick Velcro strips to mount the Fire TV Stick to the back of my TV - using Velcro, allows you to make the Fire Stick transferrable to other TV's,Cons:-this is the cheaper option between the Fire TV Stick and Amazon's Set Top Box for Fire, thus there is no Audio Out Options with the Fire Stick (probably not a concern for the average consumer),-the Fire Stick only works wirelessly (i.e. there is No option to hook up directly to your Cable Modem hard-wired), ensure you have high speed Internet wireless connectivity - anything less, and this Fire  Stick will not work very well.Very highly recommended, especially if you are already an Amazon Prime Member!", "verified": true, "helpfulness": "0/0", "author": "cajunjake"}, {"rating": 4.0, "review": "I love the Amazon Fire TV Stick. It was very easy to setup and the picture quality is amazing. I would have given five stars, but for some reason I cannot get the sound volume to go through my Bose system. I can only get it to go through my TV.", "verified": true, "helpfulness": "0/0", "author": "Things4Me"}, {"rating": 4.0, "review": "Very cool gadget", "verified": true, "helpfulness": "0/1", "author": "g.omany"}, {"rating": 4.0, "review": "Good and cheap way to make any TV \"smart\", with the wealth of Amazon-branded and general apps available. Only real drawbacks are that it's only wireless, and you need ADB/Plex to push anything to it over the network. The first is fine considering the size, the latter can be fixed by having a PC/Mac/Whichever be able to read and write to it via the USB for media file transfers so you're not clogging the network bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Loved it til we got smart tv. Works well and is easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "MBC"}, {"rating": 1.0, "review": "Your refusal to honor my prime membership agreement will result in my failure to renew it. Further i will avoid making purchases on amazon. Com to the best of my ability. DAMN YOU!", "verified": false, "helpfulness": "1/2", "author": "stephen b boucher"}, {"rating": 5.0, "review": "Being an older guy(67) this was a big leap for me! BUT, i had just about ALL the commercials memorized and realized THAT was my clue to buy this thing! And, i am SO glad i did...what a joy and so simple to install and use! Once i figured out the VERY FEW ins and outs of the thing - i cant wait to get back to it to ENJOY something else. When i watch regular TV now, the commercials are irritating & again, cant wait to get back to my stick...thank you so much for this pleasurable device!", "verified": true, "helpfulness": "0/0", "author": "JOHN B MCCOY"}]