[{"rating": 5.0, "review": "I love it. Its very easily set up and easy work. I actually bought two. One for my bedroom and one for my son's bedroom.", "verified": true, "helpfulness": "0/0", "author": "Holly Lomprez"}, {"rating": 5.0, "review": "put xbmc on there and wow....", "verified": true, "helpfulness": "0/0", "author": "Hindean"}, {"rating": 3.0, "review": "You still need a cable provider for most apps that are advertised.", "verified": true, "helpfulness": "0/2", "author": "Kristin"}, {"rating": 4.0, "review": "While it met most of my expectations I am somewhat disappointed with the apps that are not compatible with it and with the frequent buffering even with High Speed internet and cable. APP like Youtube tned to freeze and I find that the unit gets very hot and has to be unplugged, cooled, and rebooted often. I am thinking of moving up to the FireTV.", "verified": true, "helpfulness": "0/0", "author": "Jackio"}, {"rating": 5.0, "review": "Why clutter up the space your 55 plus inch HiDef TV already takes?  Combine your Prime account with this nifty little gadget to watch all the movies, series, foreign and domestic.If you buy this easy-to-use product, expand your viewing pleasure and watch The Good Doctor, an excellent Korean drama, love story.  So, okay .  You have to read the subtitles.  Chinese, Japanese, Korean, Indian , and even British actors. Oh, yes, outstanding US everything.Enjoy", "verified": true, "helpfulness": "0/0", "author": "mrl"}, {"rating": 5.0, "review": "Works well needs to be plugged into wall power in addition to the TV to work", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Big things do come in small packages!  A great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "what I wrote for the user guide applys", "verified": true, "helpfulness": "0/2", "author": "Johng"}, {"rating": 5.0, "review": "it was all I needed", "verified": true, "helpfulness": "0/0", "author": "charles     amrowski"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jessica"}]