[{"rating": 4.0, "review": "It is very good .I like it .I'll recommend to my friends.", "verified": true, "helpfulness": "0/0", "author": "Stone Chau"}, {"rating": 4.0, "review": "LI've it!", "verified": true, "helpfulness": "0/0", "author": "Shabira"}, {"rating": 1.0, "review": "1 Star says it all.... every single app requires to enter my cable provider..... it fails every time I want to pair my tablet or smartphone.... it locks my tv everytime I turn it on...", "verified": true, "helpfulness": "0/0", "author": "george"}, {"rating": 4.0, "review": "I've had it about week and used it all weekend to really put it through the paces. The set up is pretty easy and the interface is nice. I like how it works with the remote and it is very easy to get around the different Apps. The HuluPlus interface could be improved to get to personal queues- it just isn't organized the way I would have it personally. I will say that my WiFi is signal is only \"very good\" at best; often it gets bogged down beyond my control- (thanks to U-verse and my living arrangements in a backhouse). The U-verse equipment just isn't very good, especially the WiFi, even though we have an extender and have done all we can. So the Stick lost the signal often or couldn't load the stream, especially when the guests in my landlord's home are all on the WiFi. I suspect that this has more to do with connectivity setup than the Stick but if you have similar issues (multiple uses on the stream, equipment not up to the task, you want to use it in a large house or separate building and with multiple users) it may present the same limitation. In my hands, my Chromcast was able to pick up where The Stick could not. By and large, what I was viewing was still watchable on Chromcast when The Stick wouldn't connect, although still some streaming delay, but not terrible- so interesting. That said, I really do prefer the Fire TV Stick interface and getting Amazon Instant Video and PBS- it is the better interface and the content additions make it an excellent value especially if you are a cord cutter. I look forward to seeing what they do with the iOS interface when it becomes available.", "verified": true, "helpfulness": "0/0", "author": "S. Johnson"}, {"rating": 4.0, "review": "its ok", "verified": true, "helpfulness": "0/0", "author": "michael trotter"}, {"rating": 5.0, "review": "The one thing to keep in mind is that if you are a prime member through a primary prime member, you will not get all of the benefits as advertised for prime members. You will essentially need your own prime account or get your primary prime member to give you their username and password.", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 2.0, "review": "I am surprised by the behavior of this product. When you switch off the TV without putting this device to sleep, you cannot reconnect to the WIFI without doing a Factory Reset. This is annoying for multiple reasons which could be well understood without much details. An always ON device behaving like this not what is expected!", "verified": true, "helpfulness": "0/0", "author": "Madhavi"}, {"rating": 5.0, "review": "Awesome product - set-up was easy and it just works!  Great value.  Thank you", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 3.0, "review": "I already own a Chromecast but when the Fire promised Miracast I was hooked. Chromecast will support Windows only so far as the Chrome browser. I wanted something that would take the entire Windows desktop experience. Miracast promises to do just that.Unfortunately, as of this review there is no support for Miracast on Windows machines. It does support some Android phones/tablets (like my GS4) but you are out of luck if you want to fling your Windows desktop.The product description specifically calls out Miracast certification. At the very least Amazon should explicitly state that Windows casting does not work at this time. I suspect there will be a lot of disappointed users after they fire this device up for the first time.", "verified": true, "helpfulness": "12/13", "author": "W. Coleman \"billandcat4\""}, {"rating": 5.0, "review": "Very nice just like the apple TV", "verified": true, "helpfulness": "0/0", "author": "Sheeco"}]