[{"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "rcd2ent Rich"}, {"rating": 5.0, "review": "I was sceptical about buying this, thinking that it was to good to be true. But, I'm totally blown away! Amazon Fire Stick is AMAZING! I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 4.0, "review": "Easy to setup.Have not watched movies yet.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The Fire Stick exceeded my expectations. Prior to buying it, I used an HDMI cable with a connector to my ipad to view Prime content. I figured the Fire Stick would eliminate wires and it did. Oh, but it did so much more!  There is a ton of content on the Fire Stick. I'm thrilled!  And kicking myself for not cancelling my exoensive cable bill sooner.", "verified": true, "helpfulness": "0/0", "author": "Mary R. \"Mary R.\""}, {"rating": 5.0, "review": "My Fire TV Stick stopped working after 9 months.  Amazon quickly replaced it with a refurbished one.  I haven't had the refurbished one long, but so far it's working fine.  I like the Fire TV Stick much better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "So far works just like the amazon fire box. However we do not use anything else besides netflix/hbo etc on this. No game apps or any of that. Not even sure if it is supported as we bought this just cause it was cheaper that the box for another room since thats all we use it for.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "I absolutely love this little Fire TV Stick it's absolutely awesome!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "V. Roberts"}, {"rating": 5.0, "review": "very easy to install and operate.", "verified": true, "helpfulness": "0/0", "author": "sue"}, {"rating": 5.0, "review": "This thing is amazing! Game apps are a bit odd though. I recommend the controller for games.", "verified": true, "helpfulness": "0/0", "author": "deaton.j"}, {"rating": 5.0, "review": "the fire tv stick is so easy to navigate. I have a Roku and I loved it until I go the  fire tv stick. it is so much easier to use.", "verified": true, "helpfulness": "0/0", "author": "Betty L. G"}]