[{"rating": 5.0, "review": "I am an amazon worshiper. I would buy everything I need from them if I could. This has a superb interface and is a great device", "verified": true, "helpfulness": "0/0", "author": "CFS"}, {"rating": 3.0, "review": "As stated in the headline, this plays Prime Instant videos great after stalling at the very beginning for a second or two. After that there's rarely any loading or glitching. Playing Netflix or Hulu Plus, however, is a different story. Very often with both services the video will freeze or go black while the audio continues. With Netflix this fixes itself by speeding through the stalled video to catch up. With Hulu Plus, the video usually stays frozen until you stop the streaming and go back to it. On it's worst days, it will begin the episode from the beginning instead of resuming. This is completely frustrating!We purchased this as a means to take some of the load off of our aging Playstation 3, but there are sometimes when we have to fall back on that if we want to watch something uninterrupted.Save your money for a roku box or buy a chromecast if you use an android phone. That's my advice.", "verified": false, "helpfulness": "1/1", "author": "chris flint"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jorge Beltran"}, {"rating": 3.0, "review": "Great as expected.Your lost many features for not being in USA", "verified": true, "helpfulness": "0/0", "author": "Mario Ortiz"}, {"rating": 5.0, "review": "Finally can watch Amazon prime video on my HD TV.", "verified": true, "helpfulness": "0/0", "author": "quantum fields"}, {"rating": 3.0, "review": "Works well.  Not as many current movies available as I would have expected.", "verified": true, "helpfulness": "1/1", "author": "LeeLee"}, {"rating": 5.0, "review": "Very happy with this purchase.  A great bargain.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "the amazon fire t.v stick is awesome but it lack a little but i stil like it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I used to have a Roku but the Amazon Fire TV Stick is so much easier.  I mainly stream Amazon Prime videos and music, but I also use it to stream Netflix, Pandora, and much more. It is really great.", "verified": true, "helpfulness": "0/0", "author": "Naturesway13"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "roger slaven"}]