[{"rating": 5.0, "review": "Worked flawlessly, right from the git go. Super product. Best delivery too! Thank You.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Cynthia Bunten"}, {"rating": 5.0, "review": "Well ill admit this is better than my Chromecast since you have a remote and the interface is friendlier.", "verified": true, "helpfulness": "0/0", "author": "AG"}, {"rating": 4.0, "review": "Love it,  now if only i could add the tw app to it!!!", "verified": true, "helpfulness": "0/0", "author": "Victoria G"}, {"rating": 5.0, "review": "In the interest of full disclosure: I have noticed that video (specifically through the Hulu app) will pause and I have to return to the home screen and reload the entire app to get it to play again - but this could be due to a number of factors, including many options not related to the Fire TV Stick itself. Despite this minor annoyance, I do LOVE this device!", "verified": true, "helpfulness": "0/0", "author": "abcthatsme"}, {"rating": 5.0, "review": "I've been using FireTV Stick for about a week now and it's awesome! It was so easy to install and it works exactly as I expected. I am 100% immersed in the Amazon ecosystem so getting this device was a no-brainer for me. I can stream all my videos, music and photos flawlessly. I can watch my Netflix and YouTube with no major buffering or lagging issues. I can even play some of my favorite games on it. Very happy customer so far!My only very minor complaints would be that the remote control is extremely hard to open to replace the batteries and that the device still  can't be used in hotel rooms or any place that requires a webpage internet login. Amazon says it's coming soon, so hopefully they really do mean SOON. lol", "verified": true, "helpfulness": "0/0", "author": "Mary \"sleepless777\""}, {"rating": 5.0, "review": "Arrive on schedule.  Very easy to install.  Easy to use on screen directions for installation and for navigating the site.  Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Ronald Davis"}, {"rating": 4.0, "review": "Nice option for a guest bedroom. Needs IOS app for controls.", "verified": true, "helpfulness": "0/0", "author": "Rputney"}, {"rating": 1.0, "review": "If I am aPrime member why do I have to pay for some shows??", "verified": true, "helpfulness": "0/1", "author": "gayle merrill"}, {"rating": 4.0, "review": "I really like this so far.. I just purchased it so I have no issues as of now. I will have to update my review once I have been using the product for a couple of months. So far no complaints.", "verified": true, "helpfulness": "0/0", "author": "Natelya Maxwell"}]