[{"rating": 5.0, "review": "Easy to install and I have no issues with it.", "verified": true, "helpfulness": "0/0", "author": "Michele"}, {"rating": 3.0, "review": "Meh, intermittent at best... HIGH quality streaming, though! Nice interface. It just \"stalls\" a bit", "verified": true, "helpfulness": "0/0", "author": "JTWarren \"Pseudonym4Reality\""}, {"rating": 5.0, "review": "I decided to try Amazon Prime mainly because I'm getting ready to cut the FIOS cord and want to increase my viewing options. My BluRay downstairs has an option to add Prime, which I did, but it isn't available on the BluRay upstairs so I bought the Stick.  It is ridiculously easy to install and everything is well marked. If you have a password for your internet access, have it handy for your setup. There are a boatload of movies and TV shows included at no charge with your Prime membership. Amazon lets you know if a movie is not included with your Prime membership so you will know if it will cost ya. The picture quality is terrific and even though I have the HD version of Netflix, I swear the picture I get with Prime is sharper.My next step is to add Sling TV for $20/month - bunch of channels and is available via the Fire TV Stick. Also purchased an Ooma from Amazon - phone service for $3 a month - you can even port over your existing phone number for a one time fee of $38 (N.B. Do this BEFORE you cancel your existing phone service.) The final piece of the puzzle is the internet service. I'll either keep FIOS or switch to Comcast/Xfinity - whoever gives the most bang for the buck. In my personal situation, there is only one channel I regularly watch that, at present, I won't be able to get once MY PLAN is in place. But the trade off is a savings of well over $1,200 a year. Not bad for a little upfront fancy footwork.So Amazon Prime, Sling TV and Netflix for movies and shows, Ooma for phone and some sort of Internet service...hah, made in the shade!", "verified": true, "helpfulness": "0/0", "author": "Sharon K."}, {"rating": 5.0, "review": "good quality", "verified": true, "helpfulness": "0/0", "author": "Ruth"}, {"rating": 5.0, "review": "I had to give up cable. This made life great! I have added apps to this and I never have problems streaming my programs. Great purchase", "verified": true, "helpfulness": "0/0", "author": "PS"}, {"rating": 5.0, "review": "I've been using Google Cast and the Fire Stick is far better. I primarily use Netflix and it loads faster on the Fire Stick over Google Cast and my Xbox. I hope to see more apps for the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "pluckieduckie"}, {"rating": 5.0, "review": "I'm using the Fire Stick right now and I love it! It was easy to set up and I can watch Amazon Prime, listen to music, and watch Netflix on my TV for the first time with no hassle! Literally took five minutes to set it up and learn how to navigate it.  This is a steal for $39!!!!", "verified": true, "helpfulness": "0/0", "author": "Skyler Quade"}, {"rating": 4.0, "review": "Love it! Just wish they would add titles more often to prime! Love that it came with a remote and the Netflix app! I also listen to Pandora on occasion! Get it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Melissa J.\""}, {"rating": 1.0, "review": "I bought a new smartTV parallel to when Fire stick arrived and it seems it's unnecessary now.Is it possible to exchange it for the alt. free gift from Sling TV, which I think was 3 mos free Prime?", "verified": true, "helpfulness": "0/1", "author": "Brad"}, {"rating": 5.0, "review": "Like the product very much.. Again Amazon Comes through......", "verified": true, "helpfulness": "0/0", "author": "Buddy"}]