[{"rating": 5.0, "review": "awesome..great for entire family. Easy set up, easy to use", "verified": true, "helpfulness": "0/0", "author": "deebrom"}, {"rating": 4.0, "review": "Sadly the Fire TV stick has a bad habit of overheating on us. I'm not sure why either! When that happens everything slows down and it just is a pain in the arse. I have to unplug it from power, and the tv to let it cool down before we can use it again. Ah well, in the end it's nice to have something that's faster than the Wii at playing Netflix and Youtube... though I'm starting to wonder if there is something better suited for us out there.", "verified": true, "helpfulness": "0/0", "author": "KJohnson"}, {"rating": 4.0, "review": "Unfortunately the sound on two of the movies I was watching cut out.  Other than that it is fine.", "verified": true, "helpfulness": "0/0", "author": "LH Bushnell"}, {"rating": 5.0, "review": "If you install tvmc this thing is great", "verified": true, "helpfulness": "0/0", "author": "Dustin Z"}, {"rating": 5.0, "review": "This is my 2nd fire stick. I travel for a living and it's been a TV life saver when I'm in hotels.  I also have a chromcast it handy too but the fire stick is leaps and bounds better", "verified": true, "helpfulness": "0/0", "author": "Shelly"}, {"rating": 5.0, "review": "Just what we need.  We have a 2 year old and we don't get to watch a lot of TV.  This had everything we wanted.  Clipped 100 dollars off our tv dill. Cable better watch out.", "verified": true, "helpfulness": "0/0", "author": "Darrell Freeman"}, {"rating": 4.0, "review": "Bought the Fire TV Stick from Best Buy when they ran an aggressive sale. Hooked it up and it did not work, no power, nothing. Life events caused us to delay further troubleshooting for a few weeks. Then we tried on other TVs with the same result.  Attempted a return to Best Buy but we were beyond their return window.  So we contacted Amazon under their 1-year warranty program.  Dealing with Fire TV customer service was challenging to say the least.  I was first told it was a Best Buy problem, not Amazon; then was told Amazon would replace it; then was told Amazon would not replace it.  But perseverance and patience paid off and Amazon eventually decided to do the right thing and replace their defective unit.  Replacement eventually arrived and this unit worked flawlessly. So my 7 year old Sony is now a smart TV -- really enjoying the experience!", "verified": true, "helpfulness": "0/0", "author": "DJRF16"}, {"rating": 5.0, "review": "I have been using this for a few months and am very happy with it. In fact, I plan on purchasing a second for another television in another room. It has turned my television into a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Sammy David Hicks"}, {"rating": 3.0, "review": "I like it but it continually is buffering looking for the signal.. it claims my signal is not good --this is while I have my I pad or laptop in my hand, apparently working just fine.  I have even turned off all computers etc and it makes no difference.  If this doesn;t improve i will probably send it back.  how long can i keep it before I send it back?  Suggestions on making it work better.  My system is wireless and I have a fairly new TV bought this past Christmas.  I have been trying to watch Downton Abby.  (and it's good)  I love that it was so easy to install (I did it myself!)", "verified": true, "helpfulness": "0/0", "author": "Peggy Mead"}, {"rating": 1.0, "review": "I ordered a new firestick, and when I plugged it into my tv, it came up registered to someone else. Clearly this was not a new product, but a refurbished one, being sold to me as new. I tried it anyway, and after less than 2 weeks it randomly stopped working. I went to amazon to order a replacement, but they said they could not help me with that and I would have to contact the fire TV support team. They gave me a link to a Q&A; page for firestick, with no way to contact the merchant for help. I am returning this product now and will not be ordering another one!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]