[{"rating": 5.0, "review": "A++++++", "verified": true, "helpfulness": "0/0", "author": "Terry Huenink"}, {"rating": 3.0, "review": "Unfortunately doesnt work well when u have satellite internet speed. Very very very slow in downloading. Not the product!! Excellent product. Reason for three star rating is downloadable capabilities with satellite internet wireless connection.", "verified": true, "helpfulness": "0/0", "author": "stu"}, {"rating": 1.0, "review": "LAGS, LOSES NETWORK, SLOW TO PLAY EVEN JUST FOR MUSIC FILES! Every device in my home (PS3&PS4; gaming/video/music, Tablets gaming/video/music, Desktop gaming/video/music, Phones gaming/video/music, Roku gaming/video stream flawlessly. Start up the amazon fire stick with all of its holier than thou statistics and you will be greatly disappointed. Don't spend the money.Please don't spend the money", "verified": true, "helpfulness": "1/2", "author": "Ouber"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 4.0, "review": "It's convenient, easy to set up and use. I'll change to five stars if it is still working after a year.", "verified": true, "helpfulness": "0/0", "author": "Iread"}, {"rating": 4.0, "review": "Reviewed wrong item.", "verified": true, "helpfulness": "0/1", "author": "M and M"}, {"rating": 4.0, "review": "Used the Fire TV Stick to keep up with my YouTube and Netflix videos while renting a vacation house.  Setup was easy.  I was not able to properly sign in to my account on the native You Tube App.  I could only view the standard video suggestions. Sign in just kept asking me to sync with my device and never got to the sign in process for my You Tube account. I downloaded One Tube and was able to sign in and get all my subscriptions and favorites. Netflix worked great as well as Prime Videos and songs.  I will use it at home on my smart TV as it does not have many of the apps installed on the Fire TV stick. Missed the one day sale, but it is still a good value.", "verified": true, "helpfulness": "0/0", "author": "Limitby9"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 5.0, "review": "Very happy with this product! I bought two one for me and one for my son !", "verified": true, "helpfulness": "0/0", "author": "Renee M Spackman"}, {"rating": 4.0, "review": "The firestick is a great product and worth the $39.99 I paid. The image quality is far more superior than the Apps that come with my smart tv. I have Netflix on my smart TV app but I have decided to watch Netflix through Amazon fire stick because of the crisp, clear image quality. It is also very simple to operate. I had no trouble figuring out the remote or the registration process. I did have some trouble jamming in to firestick into my tv's HDMI port. It definitely took some muscle to get it in. Otherwise, it is an over all very good buy. My brother saw the image quality on my tv and had decided to purchase a fire-stick.", "verified": true, "helpfulness": "0/0", "author": "Mui Ying Kwan"}]