[{"rating": 3.0, "review": "The Fire TV stick does a nice job when it's working, but is hampered by glitches and freezes. From a glitch standpoint, every other show I watch will have the picture freeze and the sound continue at some point. The only way I've found to fix this problem is to back out of the show and then resume it. Not a huge deal, but annoying nevertheless.As for freezes, occasionally the unit will lock up and not respond to any key presses from the remote. The only fix is to reboot the TV stick by unplugging it and plugging it back in.If Amazon can iron out these problems, it definitely deserves 5 stars.", "verified": true, "helpfulness": "0/0", "author": "JavaBarista"}, {"rating": 5.0, "review": "I can't believe how good this thing is!  Since I have Prime membership already, I figured I'd use it to watch movies and listen to music on my TV instead of just on my computer.  The remote has a very solid feel to it and it's simple design is a breath of fresh air, compared to the cable TV remote.  Well done, Amazon.  I'm a fan.", "verified": true, "helpfulness": "0/0", "author": "Tony W."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "CHRISTINE CARBALLO"}, {"rating": 2.0, "review": "by the time I pay all the charges I might as well have cable", "verified": true, "helpfulness": "0/0", "author": "david W. Estes"}, {"rating": 5.0, "review": "Great product. Better than chromecast and Roku. Will evan work at hotels which require authentication", "verified": true, "helpfulness": "0/0", "author": "Richard A Brooks"}, {"rating": 2.0, "review": "Amazon's software quality had never been able to compete with Google/Microsoft.The particular fire tv stick I got has terrible compatibility issue with certain TV's HDCP functionality. It is very difficulty to have the stick play anything at all. You have to power on the fire tv stick first, then unplug the tv's power cord (turn off tv won't work) then plug tv power cord back to reset the HDCP decryption. Anytime you switch from fire tv to cable tv, you have to this crap again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, very portable", "verified": true, "helpfulness": "0/0", "author": "it can inprove but it's pretty good."}, {"rating": 3.0, "review": "It's cool but it won't connect to the 5ghz network. My 2.4ghz network has too much interference and it seems slower.  I've been looking around for a fix but it connects with problems so I have to stick with the lower network for now", "verified": true, "helpfulness": "0/0", "author": "Brandon Young"}, {"rating": 4.0, "review": "Nice product, works well.", "verified": true, "helpfulness": "0/0", "author": "Paul J"}, {"rating": 5.0, "review": "Great for streaming, easy to set up, very user friendly, and at 39 bucks a bargain. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "ARog"}]