[{"rating": 3.0, "review": "Product hooked up easy.  The problem is that I guess our internet is not fast enough so I wasn't able to watch anything on it.  It just kept searching for a signal.  So, I can't tell anyone how well it works.", "verified": true, "helpfulness": "0/0", "author": "Wayne Dimirsky"}, {"rating": 4.0, "review": "Useful features, price was right.", "verified": true, "helpfulness": "0/0", "author": "Patrick Gilmore"}, {"rating": 5.0, "review": "Effin' awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to work with  and the value is great", "verified": true, "helpfulness": "0/0", "author": "JF"}, {"rating": 5.0, "review": "Yea amazing", "verified": true, "helpfulness": "0/0", "author": "had for 8 hours"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mr.E"}, {"rating": 5.0, "review": "Love it! Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very simple to install and use.  I was not aware the voice command only works with Amazon programs but that is not really a problem, just something I would have liked to have been aware of when purchasing.", "verified": true, "helpfulness": "0/0", "author": "Dora"}, {"rating": 5.0, "review": "Came pre-configured due to being a prime member.  Easy hookup and operated flawlessly right out of the box.  Excellent value and highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "This is the best purchase I've made in years.It was very easy to set up, and connected within a few minutes of opening the box. Amazon has it right with the interface compared to Roku (which I have tried but returned).  I have NOW completely cut my cable cord. It is amazing how many channels are free using the Amazon Fire Stick, with Pluto TV (several hundred), BBC News, NBC News, CBS News, PBS, Smithsonian If you subscribe to HBO GO ($14.99 a month) and Netflix ($8.99 for HD) as I do, I now have a total television bill of $23.98 compared to over $109.00 before, and with YouTube there are zillions of channels to watch for news, music, sports, etc. I love it!!", "verified": true, "helpfulness": "0/0", "author": "Joel Brown"}]