[{"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "David Earl Herzog"}, {"rating": 5.0, "review": "ADD 10 MORE STARS LOVE IT", "verified": true, "helpfulness": "0/0", "author": "gerry walsh"}, {"rating": 3.0, "review": "Good device if ur using it for all it's extras or netflix or Hulu however it's a little more complicated if using side loaded apps or trying to cast from table or phone. For me the chromecast is still the way to go.", "verified": false, "helpfulness": "0/0", "author": "Kathy Hunsaker"}, {"rating": 5.0, "review": "I can watch prime time vedio no problem", "verified": true, "helpfulness": "0/0", "author": "Thomas K. Y. Lai"}, {"rating": 5.0, "review": "For the price cannot be beat.", "verified": true, "helpfulness": "0/0", "author": "the_imp"}, {"rating": 5.0, "review": "Easy to use easy set up able to move it to another TV with no problems actually thinking about purchasing another one because we use it that much and canceling cable!", "verified": true, "helpfulness": "0/0", "author": "AshChen17"}, {"rating": 1.0, "review": "I had originally praised this product, but after only four months it doesn't work right at all.  It constantly bumps me out of apps and tells me I have no internet, but when I go into network settings it says I'm connected to my wifi and I have very good signal strength.  I called Amazon about this and they had me unplug my router and Amazon fire stick and then plug them back in.  I told them that I know the stick is faulty because the internet on all my other devices works just fine and I can even run programs on my computer through an HDMI cord into the same TV without any problems whatsoever at all... Yet still they act like it's anything else that's causing the problem but the stick.  Don't waste $40 on this garbage!! Your better off getting Apple TV.  That's definitely where I'm headed after this experience...", "verified": true, "helpfulness": "0/0", "author": "The \"Liz\"ard"}, {"rating": 5.0, "review": "So nice to watch hulu and Netflix and amazon prime on the large screen of my TV.", "verified": true, "helpfulness": "0/0", "author": "Trish Kimball"}, {"rating": 3.0, "review": "Love it, but there's no TWC TV app.", "verified": true, "helpfulness": "2/2", "author": "Mauricio A. Palma II"}, {"rating": 3.0, "review": "I've only had it 2 weeks and am finding the most annoying thing is bleeps in streaming.  Music and shows will skip.  :/", "verified": true, "helpfulness": "0/0", "author": "Kathy Tietz"}]