[{"rating": 3.0, "review": "It's ok.", "verified": true, "helpfulness": "0/0", "author": "Danny Padgug"}, {"rating": 5.0, "review": "Opened the box. Plugged it in. Watched a cute into video that started automatically. Enter my WiFi code and because my Prime account is pre-configured, I'm watching a movie in less than 10min from when it was on my doorstep.No buffering, skipping, or other nonsense.  The browsing UI is the best of all my various ways to connect to AIV.I would recommend this even to my aging parents!", "verified": true, "helpfulness": "0/0", "author": "CLAY D HAGLER"}, {"rating": 4.0, "review": "works fine, a little hard to install", "verified": true, "helpfulness": "0/0", "author": "Wayne Oberlander"}, {"rating": 5.0, "review": "I bought this hoping to bring netflix and other stuff to my tv and it works. It has a friendly interface and it does what is expected and more.", "verified": true, "helpfulness": "0/0", "author": "Rodolfo"}, {"rating": 3.0, "review": "i wasn't thrilled with how hard it was to install. if it isn't lined up exactly, it won't go in the hdmi slot. finally got it tho. otherwise it's what i expected. lots to watch, not enough time to watch it all.", "verified": true, "helpfulness": "0/1", "author": "maggie mae"}, {"rating": 2.0, "review": "This gets a two star because this stick gives me a headache at least once a day. I bought this as a solution to not having cable. I have accounts for Netflix and Hulu Plus. Both apps crash or can't connect to the internet. It constantly says the device is not connected to the internet and then it'll drop off the network.I've had to power cycle the device itself and the modem and clear the cache from the apps and a myriad of things. At least once a day, a show I'm watching has froze where it is stuck and needs to be power cycled. Shows get stuck on ads that are stuck in the middle of downloading.I'm being very nice saying I have problems once a day. The reality is that this happens at least three times a day. VERY FRUSTRATING. I should just get the Roku box. My friend who has the Fire TV box says she has the same issues with hers. I was hoping for a small solution.Outside of the device having its issues, I love the design of the remote and it works beautifully. The price is good but you pay for what you get. I'm hoping for a firmware/app updates soon that will address some of these problems.", "verified": true, "helpfulness": "0/0", "author": "sunshine4all \"sunshine4all\""}, {"rating": 1.0, "review": "Only got it because it was a gift and the Kindle Fire won't work with chrome cast any more.", "verified": true, "helpfulness": "1/2", "author": "Adam  Rader"}, {"rating": 5.0, "review": "This is tremendous, but addictive! Setup and connection couldn't be easier. I love it!", "verified": true, "helpfulness": "0/0", "author": "Vicki S. Cousley"}, {"rating": 4.0, "review": "Good selections, would like to see more done with streaming without having to go to third party apps from my computer, and live streaming.", "verified": true, "helpfulness": "0/0", "author": "Timmon Holt"}, {"rating": 5.0, "review": "We replaced our Google Chrome with this and it is far better and better than the Vision streaming box that we have.", "verified": true, "helpfulness": "0/0", "author": "Terry Bush"}]