[{"rating": 5.0, "review": "Our whole family love the Amazon Fire stick. should I say its on Fire with our famile. Welove it. has shows, Apps,and games for all ages. THank you for making an awesome product.", "verified": true, "helpfulness": "0/0", "author": "June  Giuliano"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV Stick for my mother. It along with its user interface is very simple and straight forward to use.", "verified": true, "helpfulness": "0/0", "author": "CupCakeMartian"}, {"rating": 5.0, "review": "Perfect solution for our non smart TV!  Even with the dongle hidden behind the TV set it still is able to receive the signal from the transmitter!  I'm impressed.  We are Prime customers so this was a no-branier for our family.", "verified": true, "helpfulness": "0/0", "author": "Craig A"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Glenn Murdock"}, {"rating": 5.0, "review": "Love it! Creates any tv into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Lauren Welch"}, {"rating": 5.0, "review": "Easy to set up and started watching right away!", "verified": true, "helpfulness": "0/0", "author": "T Nobles"}, {"rating": 5.0, "review": "Just as advertised.", "verified": true, "helpfulness": "0/0", "author": "Melinda Rader"}, {"rating": 5.0, "review": "Recently cut the cable cord, and haven't really looked back yet.  I typically do a lot of research before buying any technology, and I did so before deciding on the Amazon Fire TV stick.  It installed without any problems and I haven't had any problems with it yet.  I stream mostly Amazon Prime, Netflix and Pandora and it works great on all of them.", "verified": true, "helpfulness": "0/0", "author": "Postive Strategies"}, {"rating": 5.0, "review": "This Fire Stick is the best thing since flushing toilets!!!  It is incredibly fast - hardly any wait time at all.  I thought the lan cable was pretty good, but it is no comparison to the Stick.  Definitely a good piece of technology at a great price.", "verified": true, "helpfulness": "0/0", "author": "pitb"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Matthew Artz"}]