[{"rating": 4.0, "review": "limited and gets hot fast which tells me it is more apt to burn out some day.  definitely could be better.  since i got it at $20 i cant complain at all.  Also requires usb power but wont work on tv supplied power (at least in my case) must use power outlet to plug in usb transformer (supplied).  also firmware offers channels that this device will not work with.  you try to use it just to discover that you need to buy a different product.  if the frigin thing doesn't support it - it should not tease you with it.  just another up sell attempt.  For $20 buy it just to throw into your travel bag but don't waste your time if this is going to be your primary device.  Buy a Roku or similar.", "verified": true, "helpfulness": "1/2", "author": "Rick Burks"}, {"rating": 5.0, "review": "Unbeatable for the price. Got it on sale at brick and mortar store. Nice to have it as secondary unit on upstairs tv.", "verified": true, "helpfulness": "2/2", "author": "nrn"}, {"rating": 5.0, "review": "I've only ever used a smart TV and my playstation 3 as ways to watch netflix/amazon prime etc but I love the fire stick so far! it's great to watch music videos, listen to music, watch showtime, or watch ESPN. Very easy setup and the apps work really well", "verified": true, "helpfulness": "1/1", "author": "soitgoes"}, {"rating": 3.0, "review": "If you are already part of the Amazon ecosystem, then this little device might be perfect for your streaming needs. The home screen focus is HEAVILY on Amazon Prime content. Even though you can still access your other content through Netflix, Hulu, Twitch etc, you sometimes have to do a bit of navigating as the Prime content takes up a good 90% of the screen real estate.I also own a Chromecast, two Rokus and an Xbox 360 that are used as streaming devices, and so far the FireTV Stick is the only device that occasionally has to stop and buffer Netflix. I'm not sure why that is. For reference the FireTV Stick is about 8 feet from the router, my internet speed is 30/5 from my isp, and i get around 18-22 via wifi; buffering really shouldn't be an issue (and has never been an issue in 2 years with Roku). I do like that FireTV has Twitch, which xbox also does but Roku does not.The biggest problem I have with the FireTV Stick though is the remote. The remote has a mind of its own, and if you press 'Down' once, it might go one row down, or it might (and often does) speed down through about 7 or 8 rows. Now here's the challenging part, you now press Up, Up, Up to get back to the row you initially wanted to see, but just as often it will speed up through 7 or 8 rows. So really, trying to select a specific row on the homescreen or in Fire TV settings or in an app like Netflix is a gamble. You just never know if this will be your lucky day and the remote won't register one click as if you're still holding the button as it zooms you to the bottom of any list. It's actually extremely frustrating and I don't know how this got through QA.Keep in mind this remote issue also affects games; in Putt the Planets, it's nearly impossible to fill the power bar to where you want it, as one fast press of the select (middle) button often registers as you holding in the button and you watch the power meter fill to the top when you were just trying to tap the golf ball in from 4 inches away.I do really like that a few of my Amazon Appstore games are on my FireTV. Several need a special gamepad to play, but I have 4 games that I can play with the (certainly possessed) FireTV Stick remote: Quell, Quell Reflect, Badland and Putt the Planet.Conclusion: I like the device as a secondary device (I'm using it in the bedroom", "verified": true, "helpfulness": "0/1", "author": "Whedon"}, {"rating": 4.0, "review": "Works great and will track all your shows progress. No waiting to load or buffering. Great time saver", "verified": true, "helpfulness": "1/1", "author": "Tom Tarleton"}, {"rating": 4.0, "review": "A very impressive Internet TV option.  The Apps make it particularly powerful, check out Pluto TV.  I wish it had browser capability", "verified": true, "helpfulness": "1/1", "author": "J. Martin"}, {"rating": 5.0, "review": "Super easy to set up.", "verified": true, "helpfulness": "1/1", "author": "Michael S Kiely"}, {"rating": 1.0, "review": "You ripped me off for the thirty-day prime trial . I wrote numerous emails complaining about this and you people came up with some garbage excuse I don't have a credit card on my Amazon account and I am not going to put one on there,", "verified": true, "helpfulness": "1/5", "author": "R.L. Zamboria"}, {"rating": 5.0, "review": "Its the best things it works on any hd tv and its save me time from cOnnecting my computer to the tv and love the fact that it has amazon prime music", "verified": true, "helpfulness": "1/1", "author": "Cristina C"}, {"rating": 5.0, "review": "Can't have too many streaming devices. Wish it had vudu, though you can side load it.  It's not a roku 3, but for the price and for what it does, I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "jtb"}]