[{"rating": 5.0, "review": "Great device. Should of ordered  more.", "verified": true, "helpfulness": "0/0", "author": "Maxx"}, {"rating": 4.0, "review": "I love it!  Except 1 button is not responsive to press.", "verified": true, "helpfulness": "0/0", "author": "dave jorge"}, {"rating": 5.0, "review": "I love the stick. I use to connect my Kindle to my TV and would always haveto walk over to the Kindle to change programs.  Now it's so convenient to access amazon prime and Netflix with the remote that comes with the stock. I can also easily move it from one tv to the next.  Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I haven't used all of the features yet but it basically plugs in already synced to your amazon account and it turns your TV into a smart tv. It is a great little gadget!", "verified": true, "helpfulness": "0/0", "author": "CH \"CH\""}, {"rating": 4.0, "review": "Excellent performance for the money. Interface is decent. Remote works well. Looking forward to getting the game pad for the kids. Wifi signal is pretty good on it for the router being downstairs with the stick being used upstairs.. Everything is based around amazon prime. But, thats to be expected. All other apps are secondary. I was surprised how well and quick it was for the size of it!", "verified": true, "helpfulness": "0/0", "author": "ChrisB"}, {"rating": 5.0, "review": "Just received my Fire TV Stick and we love it!Its a breeze to install as well as a quick connection to your home internet.Happy Holidays... :)  mjt", "verified": true, "helpfulness": "0/0", "author": "Margo J. Thibault"}, {"rating": 3.0, "review": "If you're married to Amazon Prime, this is a great way to cut the HDMI cord from your Kindle Fire HD. Prime still doesn't have the content library of other providers and it's becoming harder to stay with this service. The stick itself was a great pre-sale purchase at $19.99 but I'd be hard pressed to go $39.99. NOTE: Kindle apps still hit or miss and some just don't work at all. I'm thinking of changing my published name to Amazon Liker.", "verified": true, "helpfulness": "0/0", "author": "Amazon Lover \"John\""}, {"rating": 3.0, "review": "I was expecting a streaming device that would act like a chromecast and a roku. But it doesn't. You have to get third party casting apps that are just horrible and the appstore is mediocre at best. Not a whole lot to pick from. No where near the apps a roku has.", "verified": true, "helpfulness": "0/0", "author": "Dale31B"}, {"rating": 5.0, "review": "Works great and easy enough to install. Thanks A+++", "verified": true, "helpfulness": "0/0", "author": "Albert Entralgo"}, {"rating": 5.0, "review": "Great product. Easy instalation. Connected immediately to WIFI in a room that has weak signal.  Streaming is great. Like that I have Amazon and Netflix on one device. Looking forward to IOS app to stream iPad.  Installed on a 10 year old Sony first gen HDTV, making it as Smart as my new Samsung.", "verified": true, "helpfulness": "0/0", "author": "Aeroboy"}]