[{"rating": 5.0, "review": "Fire Stick is great! It is truly amazing how such a small device can stream such high quality content. It is also impressively smooth to browse through content with, especially in comparison to the Apple TV. I have used an Apple TV for the past 3 years and recently needed another streaming device and this product blew the Apple TV out of the water. Its smaller, faster, crisper, the remote doesn't need to point directly at the device, and allows for far more content (assuming you have Amazon Prime) then the Apple TV provides. The Fire Stick makes cutting the cord from cable a pretty seamless transition.", "verified": true, "helpfulness": "0/0", "author": "Ricco Garcia"}, {"rating": 5.0, "review": "Up until ordering this I watched all of my Amazon content on an iPad. The Fire TV Stick has now completely supplanted my apple TV.", "verified": true, "helpfulness": "0/0", "author": "Carolyn from NYC \"carolyn\""}, {"rating": 5.0, "review": "I love it.  It is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "13 to luv"}, {"rating": 4.0, "review": "Nice to have an alternate choice in viewing TV.", "verified": true, "helpfulness": "0/0", "author": "Linda M"}, {"rating": 5.0, "review": "This TV stick was so easy to install and set up.  Less than 5 minutes, and we had access to everything we could possible want!  I would highly recommend the Amazon Fire TV Stick over other brands.  We had tried another brand before this one, an ended up returning it and buying the Amazon stick.  Very happy with our decision.", "verified": true, "helpfulness": "0/0", "author": "Carol York"}, {"rating": 4.0, "review": "This is the one of several entertainment sticks out there but price wise the cheapest one I have seen.  There is allot to choose from as far as movies, games and apps.  The tutorial was very straight forward and made everything easy to understand.", "verified": true, "helpfulness": "0/0", "author": "Shawn Van Fossen"}, {"rating": 5.0, "review": "Easy to use and great downloads.", "verified": true, "helpfulness": "0/0", "author": "Edmund S. Wojtysiak"}, {"rating": 5.0, "review": "Really am enjoying the more efficient speed...and ease compared to the Roku, which I have had for 2 years.  Like that as well, only the Fire Stick is easier to install...as I could do it, who is not that computer savvy.", "verified": true, "helpfulness": "0/0", "author": "Elana Peters"}, {"rating": 5.0, "review": "I had been using a blue-ray player to access both the Netflix and the Amazon video services for the last 2 years. (one of my TV's isn't 'smart') I have had several acquaintances rave about their amazon fire TV device. My early Samsung blue-ray device has been acting up a bit, and I never liked the cumbersome and SLOW online access operating system. So I picked up a 'stick' and I love it! Its an extremely simple interface and its as fast, or faster, than using my one year old desktop. That's comparing a wifi connection to a hard wire to access internet service. The only suggestion would be to have; Make the remote programmable to operate volume on TVs. Then again, the price would be a bit higher with that option. (not to mention support issues) So its all good! If you have an available HDMI port... Try it! Buy it!", "verified": true, "helpfulness": "0/0", "author": "Lvs2hunt"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Thomas D. Hanson"}]