[{"rating": 2.0, "review": "I was hoping that this would eliminate using one my my Blu-Ray Players for streaming, but that will not be the case.To start, the UBS \"power cable\" is rather short and required the use of and extension cord. Not a big deal, but short sighted on the developers. Also the 90 degree angle on the power plug that the UBS cable goes into would mean that plugging it into a surge protector would require it to be plugged into the bottom spot or it would take up two spots. Again, not a big deal, but short sighted on the the developers. Once hooked up the setup was easy which was nice. After that, things went down hill. After downloading the Netflix app and getting that up and running the video quality is rather poor. Within a five minute span, it can go from great quality to bad to OK and then back to great to OK and then bad again in no particular order. This happens continuously... never ending. Annoying when trying to watch a movie. Has nothing to do with my internet or wireless network as other wireless streaming devices (four of them) do not have this issue. Thinking this might have something to do with Netflix, I tried Amazon Prime Video and had the same results.The Stick also lags from buttons pressed on the remote. You can push a button and nothing happens to you push it again and again and again.... then the Stick responds to each button press scrolling past what you were actually wanted to select. Dumb.I was hoping to recommend this to people new to online streaming, but I defiantly will NOT be. This would be a horrible first experience in streaming due to the video quality. This would defiantly turn new people off from streaming video.Maybe things will improve with time, but who knows. Until it does, the ONLY THING I would use this for would be taking with on trips and still being able to watch streaming TV at places that have WiFi. Even then, I might not take the time to hook it up.I purchased it for $20. If I paid full price, it would be getting returned immediately.*If things get better I will update my review*", "verified": true, "helpfulness": "0/0", "author": "EB"}, {"rating": 5.0, "review": "I ordered two of these during the pre-sale event and I am glad I did! I LOVE LOVE LOVE them! I purchased it mainly to watch Netflix. We have been using a Wii for years and it was a pain with slow response time and a lot of freezing. The Fire TV Stick has not frozen once and the response time is immediate. Streaming videos on Netflix and other apps on the device do not take a long time to load. Most items only take about half a second. .Pairing is awesome! I love that I can be watching a video on YouTube on another device and then switch to TV without having to search for the video. The only drawback is that the YouTube app loads kind of slow. Even with the slower load time, it's really nice, for me, when watching recipe or how to videos to be able to see it on a bigger screen instantly.The overall interface could use a little improvement. For the way that I use it, it doesn't flow well, but I still give the device 5 stars. Since I bought it during pre-sale, I think it is an awesome buy for the money. At full price, I am not sure since their are other devices that can do similar things and more. However, for a user just wanting to watch TV on Demand, Netflix, Hulu and such, this is perfect with it's features.", "verified": true, "helpfulness": "0/0", "author": "Marcina"}, {"rating": 5.0, "review": "What a GREAT product! Purchased this for when I traveled and used a wifi hotspot instead of my home wifi. I provided the hotspot provider the wifi MAC address of the Fire stick and I was in watching in minutes. Picture and sound are great, remote easy to use with very fast response from both the remote and the Fire Stick. Could not be happier.", "verified": true, "helpfulness": "0/0", "author": "E. Coleman"}, {"rating": 5.0, "review": "As a longtime user of the Roku line of devices, I was skeptical.  We had tried the Google Chromecast and had been underwhelmed.  Plus, we already had access to things like Netflix and Pandora through most of our televisions via other devices (e.g. game platforms or Tivos).However, the fire stick leaves them all in the dust.  The difference, really, is Amazon itself.  To have access to things like Prime Music, some of the game apps that I have downloaded to my Kindle, and all of the movies I have purchased in the past is amazing.  We have spotty access to all that Amazon offers us on various devices, but this is, hands down, the best all-inclusive Amazon device.It also does great with the other apps.  Things like Netflix and Pandora work as they should.  There are many other apps available to purchase, and lots available free.  As a Roku user, this was the real treat.  FREE games for my kids?  Yes, please.The only thing I miss is the motion-control remote, like our Rokus have.  This is a tiny issue and really only applicable for game-playing.I did get this with the special promotion Amazon had running a few months back, so I know I got it at a steal, but it's easily worth the regular asking price.  This *is* our new streaming device -- we will not buy any other incantation of the tiny black box!", "verified": true, "helpfulness": "0/0", "author": "Carlye G"}, {"rating": 5.0, "review": "This was easy to set up as promised!", "verified": true, "helpfulness": "0/0", "author": "bonbon55 \"Bonbon H.\""}, {"rating": 5.0, "review": "This is an amazing device, with fire TV you don't need a smart TV any more", "verified": true, "helpfulness": "0/0", "author": "Hamid Tofighi"}, {"rating": 2.0, "review": "Just being honest...  I picked one of these up because it was only $20.  I had hopes of it being able to free up a Chromecast that I use mostly with Plex.  Unfortunately, there are some clear disadvantages.1. The remote control is spotty.  There is random delay and hit/miss with button presses making it navigation error prone. - Just noting that I did use the extension cable and the external power to avoid interference.2. Not specifically against the Fire TV Stick, but the Plex interface is lacking and streaming via Plex has random pauses and disconnects.  I did try different profiles and settings and could get streaming to work with some videos, but it was not consistent with other videos.  With the Chromecast, it just works...  I read somewhere that the Fire TV Stick has a 20 Mbps video bitrate limitation.3. The Fire TV did a couple of updates and I found it annoying after each update I had to enter in user specific information, including Wifi details.In the end, if the idea of this device is to compete with the Chromecast and enable Amazon Video access, I would be more likely to use an Amazon video app on a tablet and stream to a Chromecast (if it were available) then deal with the Fire TV Stick experience.", "verified": true, "helpfulness": "0/0", "author": "S. Walton"}, {"rating": 5.0, "review": "Love the Fire TV Stick!  Does everything as described, easy to install, easy to use.  Installed the remote controller on my Kindle and that works great!", "verified": true, "helpfulness": "0/0", "author": "Christine Bowser"}, {"rating": 5.0, "review": "Works great and packaging was well done.", "verified": true, "helpfulness": "0/0", "author": "JAWC"}, {"rating": 2.0, "review": "Thought it came with Plex, but the app is $5 extra. Also, if you don't have Prime, it's not super useful. Apple TV and Google Chromecast are better.", "verified": true, "helpfulness": "1/2", "author": "Fake Name"}]