[{"rating": 5.0, "review": "Fantastic value.....great little product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I rate this at only 3 out of 5 because, although the product in and of itself is satisfactory, it does not adapt to those subscribers that suffer from a low speed DSL location. My physical address sits near the end of the DSL line, therefore we are stuck with low quality and sometimes interrupted streaming at times. After many years of complaints lodged with our ISP, there is nothing more we can do. We do not live in town, so cable is not an option, and satellite is not the best deal for us either.With my laptop, it adapted by adjusting the quality of the feed, which I can live with.The Stick is not capable of such a function, (hence the on-screen warnings of low speed connection) and should be. It's fortunate I only spent $20 instead of full price.", "verified": true, "helpfulness": "0/0", "author": "Phillip Sumpter"}, {"rating": 5.0, "review": "Easy to install works great grest price", "verified": true, "helpfulness": "0/0", "author": "andrew czepiel"}, {"rating": 5.0, "review": "I am very satisfied with this purchase.  it is amazing and so fast and remote control goes through every option with a breeze.  The remote control app for your phone or tablet is cool too with the voice search.", "verified": true, "helpfulness": "0/0", "author": "Raymond Jones"}, {"rating": 5.0, "review": "We like it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer mullenaux"}, {"rating": 4.0, "review": "Seems to work fine,haven`t really used it much.Picture is great,selections are good and it`s easy to set up.", "verified": true, "helpfulness": "0/0", "author": "richard burke"}, {"rating": 4.0, "review": "Excited to see the updates but works fairly well now.", "verified": true, "helpfulness": "0/0", "author": "Natalie Ahumada"}, {"rating": 4.0, "review": "For the price it's definitely worth it. Very smooth and easy interface. Only gripe is the remote, can be glitchy at times", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "I get green screen issue every 5 mins. Turn the TV off and on helps for 5 mins.How can I fix this?FIX FOUND:This happens to Panasonic Plasma TVs. Turn off Pixel Orbiter under Anti Image Retention Setting.This will fix it immediately. Everything works fine.Leaving it at 1 star until Amazon fixes this bug.Thank you Danny C. for telling us the fix.REVISED REVIEW TO 5 STARS. - 02.15.2015", "verified": true, "helpfulness": "1/1", "author": "R. Lee"}, {"rating": 5.0, "review": "Eazy peazy set up. Purchased for the prime members cost if $19.00. You can also get an app for your phone for remote and voice search capabilities...", "verified": true, "helpfulness": "0/0", "author": "angelabryant"}]