[{"rating": 5.0, "review": "Works great! Easy to set up and use especially if you have access to prime videos. I would definitely recommend the Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Steve Harty"}, {"rating": 5.0, "review": "Love the convenience and portability...exceeds my expectations...", "verified": true, "helpfulness": "0/0", "author": "Fast Resolution"}, {"rating": 5.0, "review": "This thing rocks, such a fast response compared to the chromecast and the remote is a great accessory.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Great device! Easy to use and install. Prime members do get the most out of it. You can then get the prime movies and music. If not you can use it for Netflix and rentals.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "It take the place of my box in my bedroom. Which is great no more paying for an extra box and I can watch almost everything I can in my front room. I would recommend this to anyone who has Amazon prime or Netflix or Hulu etc.", "verified": true, "helpfulness": "0/0", "author": "Michelle Pomozzi"}, {"rating": 5.0, "review": "Works Great!!!!", "verified": true, "helpfulness": "0/0", "author": "rick miller"}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Marty Lowe"}, {"rating": 5.0, "review": "Works great. Streams well.", "verified": true, "helpfulness": "0/0", "author": "Kev"}, {"rating": 5.0, "review": "Love it. That sums it all", "verified": true, "helpfulness": "0/0", "author": "Richard Ardila"}, {"rating": 2.0, "review": "To start with, I work in IT and have experience setting up wireless networks. At home, my other (competitor's) streaming \"stick\" works fine. I say that because I have had nothing but issues trying to get this device to talk to my Google Nexus 5 (Android) phone. It works fine with it's bluetooth remote, but the UI is significantly more difficult to navigate using the remote than the phone. Since the connection doesn't work, none of the tie-ins work, so I can't give this device more than 2 starts. If they fix the app", "verified": true, "helpfulness": "0/0", "author": "Rowdy L Vinson"}]