[{"rating": 5.0, "review": "I loved the Fire TV Stick because its the exact same thing as the Fire TV but smaller ,but a tiny problem at first was the wiring but it got easier.", "verified": false, "helpfulness": "0/0", "author": "Ginny Orzell"}, {"rating": 5.0, "review": "Fantastic device, so much faster and more stable than our Roku2 was, apps are nicer too, more responsive and feature filled.  Mainly used for Netflix, and the Netflix app is leaps and bounds better than Roku's version.", "verified": true, "helpfulness": "0/0", "author": "A Computer Guy"}, {"rating": 5.0, "review": "Got it as a gift for Christmas from my daughter .....Had amazon prime on my amazon fire tablet .Now I'm able to see everything that I see on my tablet on my T V ....easy to set up ....love it . Thanks Karen", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and go. Works well with huge variety of andmovies", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"marvinshults\""}, {"rating": 2.0, "review": "The interface is much much slower than the Fire TV, which I also have. It has several times now dropped connection with my wifi network. To restore I have to reach behind my TV and disconnect and reconnect power to restart it.Streaming is much slower as well. While watching a program via Hulu Plus, there would be a pause between commercials and program. This does not happen with the Roku 3, which again I also have. Yes, it is not a fair comparison between the Fire Stick and the much more expensive Roku 3, but I'm just reporting a user's experience.", "verified": true, "helpfulness": "0/1", "author": "Ken"}, {"rating": 5.0, "review": "Works extremely well. Programming like Netflix & Amazon Instant Prime are mostly what I view. For the price, a great value.", "verified": true, "helpfulness": "0/0", "author": "Not So Pleased"}, {"rating": 5.0, "review": "I really don't use any of the other movie apps but If you are an Amazon Prime member - this item is a must!  Works great was very simple to set up and no problems since - Thank you once again Amazon.", "verified": true, "helpfulness": "0/0", "author": "Joseph W."}, {"rating": 5.0, "review": "First of all, I must say it sure works better than the seashell I was using before. Seriously, everyone should have one of these if they enjoy home (or away from home) entertainment. Thanks for a great little product, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Rod"}, {"rating": 3.0, "review": "This was something I was excited about; I already have a chromecast and wanted something that was easy for my mom and dad to use as they are not smartphone friendly. I didnt quite expect this.Well lets start off with a pros and cons...PROS:-Low power consumption-Responsive-Includes a dedicated remote-Wide variety of different streaming servicesCONS:-Hangs up frequently-Certain apps like netflix, (that you would think would be the main attraction for the device) are actually kinda hard to access, it feels klunky and way too many button presses just to get into the application. Let alone trying to install it.-Doesn't feel polished-SETUP TAKES FOREVER.... no seriously, if you wanna pull this outta the box and use it, you have to wait through these annoying tutorials.(Not really a con, but it would show up next to my chromecast but wouldnt let anything be casted to it from other devices)Overall it works, just feels clunky at times with the interface.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 4.0, "review": "Was given this Kindle Fire Stick as a gift and am enjoying it so much that I bought a Kindle Fire to go with it. I love that I could load my photos too & have them scroll on my tv screen. Setting it up was super easy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]