[{"rating": 5.0, "review": "Picked one up on a whim when they introduced them to prime members at half off, even though I already had a Chromecast.I now want to throw my Chromecast into the nearest ocean.  This fireTV stick is the absolute dog's danglies.  Fast with great UI.  Love having a remote, because a remote never spontaneously forgets that it's controlling what you watch on the TV (YEAH I SAID IT, CHROMECAST).My girlfriend has one of those new Roku cubes, and while nice enough, doesn't stack up in my opinion.I would happily pay 39 for this all day long. If you disagree you are a flawed individual and that's okay, everyone is a unique snowflake, but you are the one who has to live with being wrong.", "verified": true, "helpfulness": "0/0", "author": "Erik Bork"}, {"rating": 4.0, "review": "Very easy to use. Little slow streaming but they may be the internet connection.Delivery was delayed by a month. Great buy for $19. (Prime Introductory price: think it is now $39)", "verified": true, "helpfulness": "1/1", "author": "Jpgdog"}, {"rating": 5.0, "review": "So nice to watch what I want to watch when I want to watch and not have to pay a high Cable bill.  Great product.", "verified": true, "helpfulness": "1/1", "author": "Kelley Godfrey"}, {"rating": 1.0, "review": "This thing locks up at least once a day and you have to unplug it to get it to work. Waste of money", "verified": true, "helpfulness": "1/2", "author": "Mike"}, {"rating": 5.0, "review": "I installed this on an older (dumb) TV for my grandson to watch his kids shows on. In less than 5 minutes I was watching Amazon Prime videos and that included plugging the TV and the Fire Stick in. It comes pre configured with the family Amazon account information already entered. A quick download and I was logged into my Netflix account. I installed parental controls and adjusted the account settings so my grandson can't do any in-app purchasing.The user interface of the Fire TV Stick is clean and intuitive and the remote clutter free, unlike my new TV who's remove has about a thousand buttons.If you are using a \"dumb\" TV or are just not near a cable connection the Fire TV Stick is a great way to extend the TVs  usefulness in your household.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Works great. I use in Home and RV.", "verified": true, "helpfulness": "0/0", "author": "Stump Jumper 42"}, {"rating": 5.0, "review": "Its so easy to use and fits into the TV.. Love it", "verified": true, "helpfulness": "0/0", "author": "Nadiya"}, {"rating": 2.0, "review": "On paper, great product. But just like Betamax vs VHS, it lacks content.  I have an old  Roku and it is far superior since it has many more channels and, importantly, live content. Since day one TV was about live content. Roku provides it but not FireTV.", "verified": true, "helpfulness": "1/2", "author": "Fantomfears"}, {"rating": 5.0, "review": "Good product does what is claimed", "verified": true, "helpfulness": "0/0", "author": "Usn"}, {"rating": 5.0, "review": "It was relatively simple to install (once we synced to our wireless) and everything after that was easy.  We have quickly started to use despite being sceptical at first.  I'd recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "Jeffery S. Petrich \"J Petrich\""}]