[{"rating": 5.0, "review": "I love my Chromecast, but having a non-phone remote, makes this thing work better for most applications.  I don't have to teach others how to load an app, etc.  Apps provide DLNA file system display, Netflix, etc.  Great little product.  Gonna have to get some for my other TVs.", "verified": true, "helpfulness": "0/0", "author": "Byron L. Ferguson"}, {"rating": 5.0, "review": "Best TV stick out there.The only CON is: Lacks of Xfinity TV App.", "verified": true, "helpfulness": "0/0", "author": "Neo"}, {"rating": 5.0, "review": "I received it, plugged it in, logged it onto my network, watched the intro video, signed into multiple video/music accounts, watched a few minutes of a couple of movies to make sure it worked, listened to a couple of songs, and downloaded and tested the controller app for my smartphone - all in about 45 minutes.Someone mentioned it would have been nice if this could have been powered by the TV's USB port.  True, but I don't know if that would have been enough power.  In any event, it does have to be plugged into a wall outlet.  That is my only disappointment, although not a major one.The value for me is in travel with an extremely portable device.  At home, I have a smart TV and a smart Blu-ray player.  But now, I can take all my online content with me to watch in hotels, motels, rental homes, etc.  That is a real plus.", "verified": true, "helpfulness": "1/1", "author": "Dog Lover"}, {"rating": 3.0, "review": "1/1/15 Update:Have been running into some connection issues with mine of late. (Previously the only issue had been a little hiccup with the remote one time.)  Over the past week I have lost connectivity either completely or via near endless buffering several times which resulted in the need to unplug and reset the device. (I am now testing it with the HDMI extension to see if it provides any relief.)Unfortunately, amazon support via both email and telephone was disappointing as they only regurgitated the info readily available online or per the user manual. They told me they'd call me back about the matter within an hour after doing further research but ended up writing me to tell me they somehow couldn't get through to me on the phone associated with my account. Huh? Really?For the record, we have many wireless devices including iPhone, iPad, a handful of Kindles and Kindle Fires, Chromebook, Apple TV etc.  Not one of these other devices has exhibited these problems with streaming or connectivity.  When it works, the audio and video is fine. And so it goes...For the $19 paid, I'll most likely end up keeping the device...though if it keeps hiccuping over the next couple of weeks I may end up booting it to the curb and send it back to amazon. Time will tell.Original Review:Early days...but so far, so good.  Ordered this during the \"Prime\" member special so it was a no-brainer for me despite already owning an Apple TV.  Having the Fire Stick means I no longer have to watch Prime video by flinging the content to the Apple TV via airplay from an iPhone or iPod.  That convenience alone is worth the $19 price paid.Setup was a breeze with the pre-registration of the device and since I am familiar with my network particulars and password.Qualitatively, the video is roughly equivalent to Apple TV and if it lags at all it may simply be a result of the device location.The audio quality via Dolby Digital is superb on my system.The remote's battery compartment was a bear to get open and I ended up using the thin blade of a letter opener to assist in that needless hassle.The remote works well as does the \"remote app\" on my Kindle Fire HDX (when it's not losing its connection sporadically).Voice search via the app worked very well the few times I tested it.  Nice that the remote app also works with Netflix, though minus the voice search feature. (Speaking of which, Netflix audio and video was quite good as well.)I don't plan to use the unit for my Spotify, Prime Music or other music accounts as I prefer to listen to music via my component (and surround sound) audio system without the added necessity of running the TV.I know that several folks have reported issues with this device so I am hoping that I won't encounter the same during this 30 day trial period.  If all remains as is, for my particular uses it is money very well spent.I would definitely recommend this unit to friends or other interested parties.", "verified": true, "helpfulness": "0/0", "author": "Blues"}, {"rating": 5.0, "review": "I got this for my husband for the holidays.  Unfortunately, Amazon didn't have them in stock so I had to buy it elsewhere (for more $$).  It's SO simple to use and has tons of content.  Just plug it into your tv and go!  When Amazon has them back in stock, I will be purchasing more of these! Great product, great value!", "verified": true, "helpfulness": "0/0", "author": "deborah L"}, {"rating": 4.0, "review": "I really like this product. It really doesn't do anything more (that I care about) than my Sony Blu-ray player that I bought a few years ago does (Amazon Prime/Netflix/Youtube). Sure it can play games, and that appeals to some, but for me, I wanted to set up streaming on a second TV - instead of having it hooked up to my computer and having to use the Flash version of the Amazon player because of ridiculous DCMA bs regarding a computer hooked up to a monitor with HDMI (no next epsiode?) With having dealt with that for the last couple years on that computer, I was quite happy to see the pre-order deal they had for this. It's a slick user interface, for the most part, and it's much quicker than my blu-ray. Streams from Amazon MUCH better. Doesn't seem to ever have the stop to buffer and have to go back out to a menu and resume it problem that the blu-ray does.What knocks it a star? Well, the phone app remote is just weird. It works on the main menu items, but for instance trying to search within Youtube, it kick you out to the main search screen, not using your voice input to populate the youtube search. I don't know any other reason I'd use that feature, so it's rather inconvenient. My blu-ray player allows the voice and keyboard input from my android tablet and it works flawlessly, so why Amazon's doesn't pull that off is the big question, I know they want to use their own \"cloud\" processing for the voice, but when the devices that are being used for the remote already have that feature built in, it doesn't make any sense whatsoever.But let's get back to the product proper. Easy setup, slick interface, responsive, streams smoothly, auto-plays next episode. It's a win.Oh, to end on a con, the battery door on the remote. I honestly thought I was going to break it, trying to get it open to put the batteries in. luckily, I did not, but I had visions of having to hold the batteries in with cardboard and tape, like so many other remotes that have lost their doors. So, that could/should be re-looked at.", "verified": true, "helpfulness": "0/0", "author": "M. Smith"}, {"rating": 5.0, "review": "I just got this yesterday, it hooked up really easily to Netflix and Pandora.  I haven't compared other devices, since I'm already such an Amazon member.", "verified": true, "helpfulness": "0/0", "author": "Katrina R."}, {"rating": 5.0, "review": "Great, so much better than Google Chrome. Almost like a X Box set up, very user freindly.", "verified": true, "helpfulness": "0/0", "author": "Bryan E. Price"}, {"rating": 5.0, "review": "Inexpensive access to Netflix and other streamers.", "verified": true, "helpfulness": "0/0", "author": "ancientmariner \"a.m.\""}, {"rating": 5.0, "review": "Amazon does it again!  I love it!", "verified": true, "helpfulness": "0/0", "author": "CJtheGreat"}]