[{"rating": 5.0, "review": "I'm a road warrior and wanted a way to watch TV in hotel rooms without hauling cables and speakers. I tried ChromecCast and, even with several calls to IT to push my device through, was unable to connect to the Internet. I ordered Fire Stick and was streaming movies within 10 minutes... So easy and inexpensive!", "verified": true, "helpfulness": "0/0", "author": "Caryn Colgan \"Caryn\""}, {"rating": 1.0, "review": "I can't get anything to play. I get a blue screen with HDCP unauthorized and content disabled. I get no sound. This was a horrible idea.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, I love it. The fire Stick with Amazon prime is a great combination. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "George Ford"}, {"rating": 5.0, "review": "Ordered 2 of these products since i have 2 t.vs came in 2 days nd i installed both of them in under 15 minutes it gave my t.v life real easy to install nd now i can watch movies t.v show get apps nd even play games on my t.v worth the money sometimes it buffers cause of wifi but continues in less than a minute", "verified": true, "helpfulness": "0/0", "author": "Kareem Borrego"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "MadMike"}, {"rating": 5.0, "review": "Small and portable, plugs right into the TV and had no issue working.  I particularly like this unit since I have a toddler and when we go to relatives who do not have small children I can bring this along and hook up quickly (at least after it has been on their network once) and stream shows for him.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Great item would  recommend", "verified": true, "helpfulness": "0/0", "author": "donald haluska"}, {"rating": 5.0, "review": "This Fire Stick + being a Prime member gives me enough viewing options that I disconnected Cable from the TV. Also, Amazon has some excellent TV shows for kids that are only available through Amazon.", "verified": true, "helpfulness": "0/0", "author": "John F. Colgan"}, {"rating": 5.0, "review": "Great combo with prime. Better than cable or Directv", "verified": true, "helpfulness": "0/0", "author": "John J. Francis \"rojac70\""}, {"rating": 5.0, "review": "I kept debating  whether or not this would be a purchase worthy of buying but I must admit this is even better than my chromecast. Now I can FINALLY watch stuff on my Prime watch list on my tv. Only drawback: the way the stick is designed made it where I had to unplug my bluray player. That's why I was hesitant to buy it because of seeing previous reviews. But I'm satisfied. You just have to try it out for yourself.", "verified": true, "helpfulness": "0/0", "author": "tp78"}]