[{"rating": 5.0, "review": "It's awesome and we love it!!! ☺️", "verified": true, "helpfulness": "0/0", "author": "jess martel"}, {"rating": 5.0, "review": "I've been using it for a week and have no complaints. Does exactly what it should. I'd confidently recommend this to anyone looking for a low-cost solution for streaming TV.", "verified": true, "helpfulness": "0/0", "author": "Matt Salter"}, {"rating": 5.0, "review": "Easy setup and the apps load quicker than an apple tv.", "verified": true, "helpfulness": "0/0", "author": "Lacey"}, {"rating": 5.0, "review": "Easy to set-up, easy to use. Everything it was advertised to be. Very pleased!!", "verified": true, "helpfulness": "0/0", "author": "Geraldine Van Sickle"}, {"rating": 4.0, "review": "Love it so far!", "verified": true, "helpfulness": "0/0", "author": "Andrew Kern"}, {"rating": 4.0, "review": "Easy to install and operate.  Unfortunately, I had lots of problems with wifi after the first day.  I made some adjustments to my router (added guest network and enabled video mode) and so far, this seems to have fixed the issue.  If I don't have any further issues with wifi, I would bump this up to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Sonya Armiger"}, {"rating": 5.0, "review": "easy to install worked like champ from the start.  More access than I have had with just Netflix.  Remote real touchy when you have it off.  You can just pick it up and it will go to the stick.", "verified": true, "helpfulness": "0/0", "author": "Jim \"Jim\""}, {"rating": 5.0, "review": "The fire stick is awesome!!!", "verified": true, "helpfulness": "0/0", "author": "orlando salinas"}, {"rating": 5.0, "review": "After months of dragging my son's laptop down to the Family Room to plug it into the TV to watch NetFlix, this was such a simple solution. My son plugged it in, set it up and voila! We were then able to very easily watch anything not only from NetFlixx but also from Amazon Prime Library. So easy I could have done it myself!! In addition we downloaded the Amazon Fire TV Remote App which accommodates voice commands and did not have to buy the additional Fire Stick Remote Control.", "verified": true, "helpfulness": "0/0", "author": "DrCJHC"}, {"rating": 5.0, "review": "Works well, some movies that seemingly should be part of Prime have to be paid for.  As far as the remote functioning is concerned, I wish all remotes used RF instead of IR like the Fire TV Stick remote.", "verified": true, "helpfulness": "0/0", "author": "Tom"}]