[{"rating": 5.0, "review": "I cannot believe I am getting the same thing as I did with my original Roku. I thought about giving it as a Christmas gift this year but nobody I knew needed one.  Very happy I kept it for myself.", "verified": true, "helpfulness": "0/0", "author": "Debbie H"}, {"rating": 5.0, "review": "Easy to set up. Plugged into my HDTV (had to use the connection device which was supplied) and power outlet. Entered my wifi password. Made a few setting changes on my HDTV to optimize. Entered my Amazon account and my Netflix account. Watched a couple shows from both Amazon Prime and Netflix. Very satisfied. I expected Amazon Prime to work, wasn't so sure about Netflix. However it all worked perfectly!", "verified": true, "helpfulness": "1/1", "author": "Homey Jim"}, {"rating": 5.0, "review": "I usually have trouble getting things to work as advertised, but this was a snap.", "verified": true, "helpfulness": "1/1", "author": "Jim"}, {"rating": 5.0, "review": "Good experience", "verified": true, "helpfulness": "0/0", "author": "Ron Barkman"}, {"rating": 5.0, "review": "This is so much better than the or any  thing out there. No buffering!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the product. I had to up my wifi carrier for better bandwidth. Wish I had done this sooner. I've had Prime for some time and did not realize how seamless and how great this added feature is.", "verified": true, "helpfulness": "1/1", "author": "Brandon D. Walker \"Happy Big City Camper\""}, {"rating": 4.0, "review": "A little unreliable when trying to stream from the iPhone Netflix app, but overall a solid product.", "verified": true, "helpfulness": "0/0", "author": "M. Elam"}, {"rating": 4.0, "review": "Love it. User feindly and work where ever you go. Amazon TV Stick is a must have if you like to watch movies and more.", "verified": true, "helpfulness": "0/0", "author": "Amafan"}, {"rating": 3.0, "review": "love the stick but had to buy plex when I all ready had it was a pain till I talk to the right girl got refund but got the run around", "verified": true, "helpfulness": "1/1", "author": "Lawrence J. Dunn Jr."}, {"rating": 5.0, "review": "Wow!  Rock solid, easy to set up and uae. UI giod but a little different.  Smashing great for all Amazon related stuff.  Haven't found many of my channel favorites from my R*K* device yet.  Add a F-F adapter and 3'~6' F-M extension cableand you have a perfect travel kit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sailing Fool\""}]