[{"rating": 5.0, "review": "At first I thought, \"is this just another redundant piece of technology?\" The answer to that question is: maybe. That answer, however, is not cut and dry. We used an XBox for our video streaming, complete with HDMI cable quality streaming. It was perfectly capable of satisfying our needs (hulu, amazon prime, hbogo, netflix) and had done so for some time. Amazon offered us the opportunity to buy this for half price and I, being a complete amazon nut, jumped on the opportunity. Here are a few reasons why I like the stick, and why our XBox has been dormant for longer periods than it has ever rested:--Searching for Titles- Access films from the homepage that are offered through prime instant video. There is also a \"more ways to watch\" option that occasionally ushers you towards a streaming service that includes the title you are trying to view (this feature is not quite as great as it could be, yet!)--Smooth Homepage-Seamless, smooth interface where you can access prime instant video, rent or purchase videos, access your apps (netflix, hulu, etc.), and search.--Extra steps- Or rather the lack thereof. Turn on the tv and if it is still on the correct input, you're ready to go. With all your passwords in, you are there in seconds.--App Appearances-Coming from the XBox the apps are so much easier to use and more pleasing to the eye.--Mobile App- Kind of gimmicky, but also kind of fun especially due to the voice search which works really well.I'd like to see the \"more ways to watch\" streamline and act as a way to sort through all the services we pay for these days. If they did that I'd sing high praises for this up and down.If you're on the fence, I'd err on the side of giving it a shot; especially if you are on here reading Amazon reviews and are a prime member, you're halfway there already - I can tell.EDIT: We've used this a lot, let me start with that. At this point, the wireless connectivity issues have made it so frustrating that we have switched over to the xbox until I'm ready to buy a Roku. As a buddy of mine said \"Amazon does marketing, not products\" and I hate to say it, but I think he is right. With all the emphasis on the wireless performance of the stick, it hasn't really lived up to the expectation.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Great device for entertainment. Every one should have one.", "verified": true, "helpfulness": "0/0", "author": "Gerald E Palermo"}, {"rating": 5.0, "review": "Purchased for my teenage daughter and she loves it. Yes, a parent can do right in the eyes of a teen.", "verified": true, "helpfulness": "1/1", "author": "ACK!"}, {"rating": 4.0, "review": "Docked a start for no VUDU app. I liked this enough I am considering upgrading to the larger Fire TV for the added power - games don't work too well on the stick (which I expected giving the specs). Side loading is fun and easy though sideloads firefox is just too much for the processor and performance isn't where great (again, expected based on specs). The price point is awesome but really just served as a selling tool for the larger unit. Do you self a favor and spend the extra $50 and get the big one.", "verified": true, "helpfulness": "1/1", "author": "N. Busse"}, {"rating": 4.0, "review": "It is a nice streaming device. Good quality stream.", "verified": true, "helpfulness": "1/1", "author": "Kenny"}, {"rating": 5.0, "review": "This is an AWESOME addition to my media collection in my house.  I bought two of them for my daughters and so far they seem to really enjoy using. I had an issue with the wireless connection dropping but that was resolved with the purchase of a \"TP-LINK RE200 AC750 Universal Wireless Dual Band Range Extender (Wall Plug)\" I also bought from Amazon.  The available apps and games on the stick are vast and offer a wide variety of option for watching and playing.  For the price you can't go wrong, and if you have Amazon Prime it is a must own.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Schleprock\""}, {"rating": 5.0, "review": "I love the Amazon fire stick so far. It's great to be able to stream TV shows and movies right from the fire stick. Can't wait to keep using it!", "verified": true, "helpfulness": "1/1", "author": "Alison"}, {"rating": 5.0, "review": "!I really just love the ease of the Fire TV stick. It's so much easier and intuitive than using my Sony Blue Disk with the benefit of also being able to get to my Amazon Prime and Videos.", "verified": true, "helpfulness": "1/1", "author": "EJMcDonald"}, {"rating": 1.0, "review": "First of all, I don't see any literature that states that most of what is programmed on this fire tv DOES NOT WORK outside of the United States!  This has been the worst purchase I have made with Amazon.  Remote won't stay working so then I go to just my regular tv remote to get the system to work.  I also purchased the voice activated, which also stops working, the voice part, gives like 2 seconds to say what you want, and most times does not understand so you can never get it to work and then it stops working all together.  My Amazon prime doesn't work, as I continue to get a library content error.  But I sure can BUY MORE movies from Amazon and those will work, but nothing that comes free works.  HULU does not work outside the United States, nor does the Showtime.  I have almost given up trying any other programming.  The only thing that does work is the Netflix, but hardly worth spending 100.00 for the access.I AM EXTREMELY DISAPPOINTED", "verified": true, "helpfulness": "4/9", "author": "Tammie S."}, {"rating": 3.0, "review": "Here is the Problem with these sticks, apparently they are very \"picky\" on what TVs they want to work with.  I bought two and the first one I installed had issues every night I used it for a week (wouldnt turn on, would not connect to wifi, had to unplug to restart, etc).After 5 days, I tried installing it on another Tv and it would not turn on, called Amazon and was told about how \"picky\" they are, they sent me a new one and had me install my second one to see if it was a TV issue or a Fire TV Stick, it was the stick that was the problem.I like the idea of this product, I like that my kids do not have to cast their ipad to the chromecast anymore, but this first impression/experience I had with this does not allow me to rate it more than three stars, I will upgrade it to 4 after more time if it does not have any more issues.", "verified": true, "helpfulness": "1/2", "author": "shieldfan"}]