[{"rating": 4.0, "review": "Nice and easy to use. Love it.", "verified": true, "helpfulness": "0/0", "author": "Lynn Matherly"}, {"rating": 2.0, "review": "I hate to give anything a bad review, but the Fire TV Stick from Amazon just didn't work with my TV and Internet provider.  The Amazon technicians were very helpful, and replaced my unit two different times, but it still made no difference.  They tried everything but couldn't understand why it didn't work.  Amazon suggested that I contact my ISP, Comcast, to see if they had any suggestions.  Since I really was not having any problem with my Comcast Xfinity service, Comcast had no idea how they could help me.  All in all, it just didn't work for me, and I finally I had to send it back for credit.  The one thing that did bother me, is that they charged me a re-stocking charge.  I am a Prime member, and didn't take too kindly to the re-stocking charge.", "verified": true, "helpfulness": "0/0", "author": "John Wedge"}, {"rating": 5.0, "review": "Easy to set up and run.", "verified": true, "helpfulness": "0/0", "author": "Susan H. Everson"}, {"rating": 1.0, "review": "Did not connect correctly to my internet. Very disappointed. After trying to get it to work for several hours I returned it. May buy a Roku.", "verified": true, "helpfulness": "0/0", "author": "Ohiopicker"}, {"rating": 3.0, "review": "Subscription offers limited shows.", "verified": true, "helpfulness": "0/0", "author": "C. Patrone"}, {"rating": 5.0, "review": "Husband loves it", "verified": true, "helpfulness": "0/1", "author": "Blahsan"}, {"rating": 3.0, "review": "not what I thought as the extension did not have the connection for htv. only for hdmi. so wont work...", "verified": true, "helpfulness": "0/0", "author": "robertcline"}, {"rating": 2.0, "review": "its taking to long to load youtube and that makes my granddaughter mad", "verified": true, "helpfulness": "0/1", "author": "charlie 1950"}, {"rating": 1.0, "review": "Waste of money esp when I have all that this provides on the TV. I don't remember ordering it - but I am old.", "verified": true, "helpfulness": "0/1", "author": "Design Scales"}, {"rating": 5.0, "review": "Excellent item recommend to everyone", "verified": true, "helpfulness": "0/0", "author": "peter m."}]