[{"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Cody Wulk"}, {"rating": 5.0, "review": "I was as easy to hook up as advertised.  We have a great variety of programs to view at about 1/10 the cost of basic cable.  I have hooked up a digital antenna and get my local programs as well.", "verified": true, "helpfulness": "0/0", "author": "William J. Fitch \"Maverick\""}, {"rating": 1.0, "review": "never received it.  two months back ordered and canceled when I found it cheaper on the shelf at Best Buy........", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Simply great.", "verified": true, "helpfulness": "0/0", "author": "venkata"}, {"rating": 5.0, "review": "This Amazon Fire TV Stick is way more better than chromecast, I have both of theme and now I hate chromecast, its more complicated to use even to put pause on a video sometimes yo need to reload the app to put pause, but with the TV Stick its really ease to use.. I have 1 chromecast and 2 TV Sticks and I'm thinking on buying a new Stick to replace the chromecast..", "verified": true, "helpfulness": "0/0", "author": "Edgardo"}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "more accessibility to apps with the Fire TV but a great overall investment. Easily mobile.", "verified": true, "helpfulness": "0/0", "author": "cathy"}, {"rating": 4.0, "review": "Make sure your Tv is HDCP compliant. Searching is very laborious. But quality and speed are good.", "verified": true, "helpfulness": "0/0", "author": "Kim Kinsey"}, {"rating": 5.0, "review": "I have a SmartTV, AppleTV, Chromecast and Roku that can access Netflix, Hulu Plus and Amazon Prime but using the Fire TV Stick is much more fluid.Reasons why I use the Fire TV Stick:-Included Remote Control (batteries included): no line of sight needed-Very fast at accessing library-Low profile; basically a dongle on one HDMI port and USB port-Access to Amazon Prime Video-Light gaming (flappy bird; 'nuff said)Reasons why I don't use Chromecast:-No remote; your phone or PC/Mac essentially is your remote-No native appsReasons why I don't use Roku:-Roku is really great, but Amazon Fire TV stick is much faster and more fluidReasons why I don't use AppleTV:-Actually AppleTV is a great alternative if you bought into the Apple ecosystem-My AppleTV is tucked away on the TV stand and sometimes the remote doesn't register. I can move it, but my kids would touch it or move it back again...Reasons why I don't use the SMART TV:-Very clunky and slow-Wireless sometimes spottyEver since I bought the FireTV Stick, I haven't touched the other devices. Time to sell all because I found the device of choice... at least for now.", "verified": true, "helpfulness": "0/0", "author": "Joseph P. Park"}, {"rating": 5.0, "review": "Ther is so much it can handle.  Have Google Cast but can't get my prime movies on it.", "verified": false, "helpfulness": "0/0", "author": "Jack Borener"}]