[{"rating": 5.0, "review": "The FireTV Stick seems to be every bit as functional as it's older sibling, the Fire TV box - which I also have. Although it lacks the USB, optical, and ethernet ports of the set top box, if you don't require those things and are fine on WIFI - there's no noticeable difference in operation or processing power. The remote is a simplified version of the one that comes with the STB - sans the voice control - but perfectly functional. And I've been able to download the Fire TV Remote app to my phone and tablets and it functions perfectly with both devices. Sideloading of apps (like TVMC) works just as it did with the STB. At $19, I'm glad I bought 2! I will be buying several more for the other TVs in the house as well as for Christmas gifts this year. Too bad Amazon is backordered and I will have to purchase those at other retailers in order to have them in time. I currently have Apple TV and Roku - and I think the Fire TV Stick could win this race. The only thing I'd REALLY love is to have the Time Warner Cable (TWC) app function on this and I wouldn't need any of my Roku's. I look forward to further development of apps and content on this device.", "verified": true, "helpfulness": "3/4", "author": "D. Snedigar"}, {"rating": 1.0, "review": "I am glad I only paid $19 for this.Set up was a pain (as highlighted by other reviewers).  It took me 45 minutes to make it work, and never told me what the problem was (likely that it had weak WiFi).  It was only once I decided to move my TV close to the router that it picked up the software update and allowed me to start watching something.Interestingly, Chromecast works just fine in my den and the speed and picture quality look the same.  Oh well... hardware spec aren't everything after all.  Back to watching Netflix on my Chromecast.", "verified": true, "helpfulness": "12/20", "author": "Antoine"}, {"rating": 1.0, "review": "I was going to buy one of these but not at 40.  Why couldn't they extend the sale through black Friday.?  I already own the fire TV was going to put this in the kids room.  Oh well.", "verified": false, "helpfulness": "1/39", "author": "C. Wilhelm"}, {"rating": 5.0, "review": "Many other reviews here cover the finer points of the Fire TV Stick better than I would, so I'll let them take credit where credit is due. I did, however, want to post a review regarding my admittedly brief thus far experience.When I first plugged in the Fire TV Stick and turned on my TV, I had a sinking feeling when the picture came up with the Amazon logo in the center of the screen plus lots of green lines and audible crackling/static. My TV didn't take this very well and switched to a blue screen declaring \"Not Support!\" after a few seconds. I tried another port and used the included power adapter; this only resulted in less green lines/specs with the same static sound.I was a little upset that I had this great little device and it didn't work like it should. I decided to get it online and let it update to see if that would help. (By the way, if you're using MAC address filtering on your home network, you can scroll all the way to the right of the list of available networks to get the device's MAC address.) After it finished downloading, the device restarted... no weird stuff! It installed and restarted again... still no weird stuff!I'm quite happily watching The X-Files right now via Netflix; it installs like a smartphone app in just a few seconds. The remote is sized right and makes me feel like my Chromecast should've had one all along. I keep my phone by my side while watching TV, but a real piece of hardware with a button you can press is so much quicker and less cumbersome than having to wake up my phone, swipe, tap, etc. to do what I want. The Chromecast is generally a few bucks cheaper than the Fire TV Stick, but the remote makes the cost difference well worth it (I got it on the $19 pre-order though, still it would be worth it).Like I said, I haven't used it a whole lot, but I'll update this review if I run across something which warrants it.", "verified": true, "helpfulness": "8/10", "author": "Joel"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "1/3", "author": "peter guerriera"}, {"rating": 5.0, "review": "It's an amazing device that replaces my LG TV's Smart TV capability and probably my Chromecast. My only gripe would actually be with the Twitch app since the quality is mediocre, and that sucks considering that's actually the main reason I bought it. Otherwise, it's a pretty fun device, and even though I didn't need the tutorial that plays during installation, I think it's really well done for the non-techie consumer. I hope the Twitch app will include the option to choose the stream quality like the Plex app, which is excellent! Can't wait to integrate it with my phone so that I can use the voice search. When the Amazon Echo comes out, I'm sure they'll be able to integrate that too. Amazon has a real winner here!", "verified": true, "helpfulness": "3/4", "author": "Dissonance"}, {"rating": 5.0, "review": "Fantastic product.installed first try with no issues.great that it is already registered to my amazon prime acct... saves some setup steps.I love it.", "verified": true, "helpfulness": "1/2", "author": "N. Miller \"Tiffany's mom\""}, {"rating": 4.0, "review": "Very happy with the product. I own a fire tv and the only difference I've notice is the remote is not voice activated. The only thing I have to complaint about is the lack of better applications, and there is no remote application for the iPhone. Overall... well done Amazon, well done.", "verified": true, "helpfulness": "0/1", "author": "Mario Pagan"}, {"rating": 4.0, "review": "Wouldn't work at all on my Samsung TV/computer monitor.  All I got the Amazon logo with static.  I was hoping to set it up inside so as not to have to run in and out of my garage workout space because it is sub freezing right now.Anyway - plugged it into the garage TV, got signed in to my WiFi network and it HAS TO DOWNLOAD NEW SOFTWARE.THEN THE UPDATE FAILS.So, right now, it's trying again.  Not a good out of the box experience, to say the least.  The USB micro cord was a nice length, the plastic of the cord has a nice suppleness to it - and the batteries worked in the remote.-----------------------------Update - 30 minutes later.Have moved the FireTV into the house to take over media streaming for the PS3.  PS3 was running hot in the new TV stand, and the FireTV stick seems more than capable.  Love the phone app integration, and as others have mentioned the picture is first rate.------------------------------UPDATE - 4 days + of useWow.  Maybe I'm behind the times but this is AMAZING.  WAY better than the PS3 streaming.  Quick, responsive - I'm sure the 1080HD stuff looks better.  I wish I'd ordered two.  Sticking with the 4 stars because it was finicky with the monitor - maybe the monitor doesn't have the right type of HDMI?  But without the bit of trouble right out of the box - 5 stars.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far so good, but kind of strange it took roughly 30 mins to update the firmware right out of the box. Also kind of silly a micro USB power adapter has to be plugged in to it at all times. I assumed it would draw power from the HDMI connection, but that's not the case. Not sure if same applies to Chromecast or not. For $19 though, very pleased. After firmware update, set up was a breeze. Connected to home network flawlessly, and already had my prime account info loaded which was a nice feature. No need to enter passwords or anything. I've never owned an android product, and was pleased that app purchases were already linked to my Amazon account, and didn't require me to create a new android account. Only reason I bought this was to stream PLEX to the other TVs in my house. Works great, and the PLEX interface is almost as good as the home theater version. Way better alternative then Apple TV AirPlay which I was using prior. No brainier for the die hard PLEX fans out there.", "verified": true, "helpfulness": "1/2", "author": "E. Walker \"ewalk\""}]