[{"rating": 5.0, "review": "I had Chrome cast and Samsung before.  Fire stick is WAY BETTER.  I can actually watch a movie without buffering now.  There are several aps like Hulu plus, but you have to pay extra for those.", "verified": true, "helpfulness": "0/0", "author": "Erin Lakin"}, {"rating": 4.0, "review": "Quick and easy to set up. The Netflix functionality is different than it is on my Apple TV connected to another TV, but I guess I'll get used to it.", "verified": true, "helpfulness": "0/0", "author": "Dan G"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Christinabookworm"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "bhave"}, {"rating": 5.0, "review": "sure like it but I made a mistake on pathfinder  I watched it  then it the wrong way and had to buy it after I already seen it.", "verified": true, "helpfulness": "0/0", "author": "Bob Glaser"}, {"rating": 5.0, "review": "I would recommend this fire tv stick to those who are especially on Prime. So much to view. I bought the audio remote and like that a great deal,also.", "verified": true, "helpfulness": "0/0", "author": "Patty"}, {"rating": 5.0, "review": "works great very fast perfic picture", "verified": true, "helpfulness": "0/0", "author": "bruce bloom"}, {"rating": 5.0, "review": "We have the Google Chrome stick that we picked up first that ended up being very substandard and choppy.  I have had no problems what so ever with streaming from the Fire TV Stick and it has truly surpassed even what we were expecting of it.  Very very pleased with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Susan Jensen"}, {"rating": 5.0, "review": "My husband gave me this as a gift and it is great.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Pamela A. Lee"}, {"rating": 5.0, "review": "Great little easy to use system that is plug and play.  The great part of this is the content that is added and the easy access to it.  Fire TV Stick is a great product and very excellent value for any Amazon Prime customer.", "verified": true, "helpfulness": "0/0", "author": "Mark Hutchins"}]