[{"rating": 5.0, "review": "Just moved and decided to cancel our $200.00 monthly Uverse bill. Now we pay $15 a month for Hulu and Netflix (also an Amazon prime member) and we are just as satisfied if not more since we are saving so much more money!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Lee"}, {"rating": 5.0, "review": "Easy to install/setup.  Started streaming without any lag time at all.  Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 4.0, "review": "I have had the Fire Stick for a little over a month and am very satisfied.  I debated between this and Apple TV as we use Macs and I-phones, but as Prime users felt the Fire stick was the better choice.  It loaded quickly and set up was straight forward.  As I did not buy it through Amazon due to a Best Buy gift card it was not set up with my account info prior to receiving it.  Signing in to my account information was simple.The search feature without voice is a bit cumbersome, but after a few uses was not a problem.  The remote, though small and simple, is intuitive and works well.  I have downloaded several new apps with no problem.  Amazon material certainly loads much quicker and is front and center in the format, but other items load with little wait time and are easy to see.  I watched \"Band of Brothers\" and each episode was ready to go when prompted with minimal wait time.I did set up a wireless router extender that is located right near the TV so my signal is very strong.  The primary purpose for this purchase was so we could \"cut the cable\" (other than internet), and with a new OTA antennae for the TV we are pleased with the set up.I will update this review in a few months if necessary .", "verified": true, "helpfulness": "0/0", "author": "Doc Clay"}, {"rating": 5.0, "review": "Firestick lives up to its name. Turns your tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Ann Ochsner"}, {"rating": 5.0, "review": "I Love this item. It works great on my non-smart tv's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am loving it", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 5.0, "review": "Love it! Exactly what I expected. and what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Alice"}, {"rating": 5.0, "review": "Easy to set up and begin using.  Haven't yet really explored all it can do, but looking forward to doing so.  I am currently deep into Downton Abbey so I am a happy camper.", "verified": true, "helpfulness": "0/0", "author": "Donna J. Wessel"}, {"rating": 5.0, "review": "Zero complaints. Beats my chromecast dongle all the way back to the junk drawer. My only regret is not buying 3 of these. The remote makes all the difference in the world, chromecast is reliant on your phone or PC to function. This little guy is a steal at the 39$ price tag. Well played amazon, well played.", "verified": true, "helpfulness": "0/0", "author": "MyProductReview"}, {"rating": 5.0, "review": "Great product and easy to use. Get the most out of movies from Amazon and Netflix, music and more. It's right there at your fingertips. Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Roberta Brown"}]