[{"rating": 1.0, "review": "Still can't download Disney Channel s fir my kids", "verified": true, "helpfulness": "1/5", "author": "eina"}, {"rating": 5.0, "review": "We only wanted this for the Netflix feature and it definitely has fulfilled that beautifully.  As well when I had a question I phoned the customer support line and got a real person to speak to which was wonderful.  They were very efficient and friendly.", "verified": true, "helpfulness": "0/0", "author": "Paulette M."}, {"rating": 4.0, "review": "It works well, but I wish it had more channels. Right now the Roku has the most diverse selection of channels. I think the Fire supports Showtime, but I don't think it has HBOGo. I'm sure the increase in channel selection will come in time. I will say that I like that I can buy shows directly from Amazon without entering my password repeatedly. It's a little \"Amazon Prime\" centric, but that's to be expected. It is an Amazon Fire Stick after all. Overall, a good purchase. I'm happy with it.", "verified": true, "helpfulness": "0/0", "author": "Rosie May"}, {"rating": 5.0, "review": "video streams from amazon prime startup very quickly. the phone app has voice recognition so there is no need to buy the other remote. it does require that you use the included ac plug instead of the usb port on your tv. I tried it, and it didn't work. It might on yours. If your phone supports it, it can mirror your screen, though I wouldn't use it for gaming.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Great! Works right out of the box! Just plug it in and go.", "verified": true, "helpfulness": "0/0", "author": "Patricia Pluciennik"}, {"rating": 3.0, "review": "Don't buy this if you want Miracast capabilities. Despite saying it is Miracast™ Certified, it is not listed as certified on their (Miracast) site and it does not work with many Miracast certified devices. It will not work with Windows 8.1 nor does it work well with many of the Android devices I have tested. It works well with the other \"Fire\" devices and with a few Android tablets/phone. If it was truly certified it would work with all the other certified devices.I purchased it to use for Plex, which it does not do a great job with either. First off, they have a known problem with getting anything more than stereo for sound, so if you have a nice home theater setup, you will be disappointed. Again I have heard from both Plex and Amazon that they are working on that. There is also a lot of stuttering on playback of higher quality videos.I also have a FireTV and it also suffers from the Plex issue and I am sure the Miracast as well. So it is not just about power, it is something with the coding.The app selecting is limited, very limited, but being pretty new I can deal with it. I was shocked to see that it does not have a browser, especially their own Silk browser. This causes issues if you take this with you to a hotel and it needs to open a web page to enter credentials or even pay. I think they are missing a major opportunity here.This device is fine for a secondary tv or at hotels that don't require a browser to access the network.", "verified": true, "helpfulness": "4/4", "author": "Clintre"}, {"rating": 5.0, "review": "Bought during the prime sale. Wish I would have bought more. Blows away my roku and with some work you can side load apps virtually eliminating my need for cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like it!! Lots of apps you can download. Not sure about gaming though", "verified": true, "helpfulness": "0/0", "author": "Yung-feng Chou"}, {"rating": 3.0, "review": "I will start off by saying I love the product but it does need a little work. Love the platform besides there should be a search for not just amazon libraries. It would be nice if it searched hulu and Netflix all in one search.Also it would be nice to have social media apps and Web search avalible on the fire stick.I also dont like all the cords required, it was advertised as being as easy as pluging it in and you need external power and an extender.Wile it is plugged in it messes with my regular channel reception as well.Oh and more kid friendly apps like on screan books exct.I'm sure these things will get addressed as more people request it, and I will raise my review ad they get addressed.Over all, love the product.", "verified": false, "helpfulness": "1/1", "author": "holly casey"}, {"rating": 5.0, "review": "Love it!  Replaced my Roku stick with the Fire TV stick and am very pleased. Much faster and the UI is much more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Rowell"}]