[{"rating": 3.0, "review": "had quite a few problems with the sound and quality when we 1st purchased it, but after the multiple updates it is really working better", "verified": true, "helpfulness": "0/0", "author": "Logan's Run"}, {"rating": 1.0, "review": "THIS UNIT WORKED FOR JUST ABOUT A WEEK AND THEN BEGAN DOING AS IT PLEASED AND REFUSING TO FOLLOW MY INSTRUCTIONS.  IT PULLED UP SITES I ON YOU TUBE WOULD NEVER GO TO, WOULDN'T TURN OFF OR CHANGE CHANNELS.  OUR APPLE TV IS MUCH EASIER TO USE, DEPENDABLE, AND FOLLOWS INSTRUCTIONS.  I'M RETURNING IT AND DRIVING DIRECTLY TO THE APPLE STORE.  ONCE AGAIN I MUST DISCOVER \"CHEAPER IS NOT BETTER\"!", "verified": true, "helpfulness": "0/1", "author": "SASQUATCH"}, {"rating": 4.0, "review": "Happy with fire stick, lots of choices to pick from. Wish it had more streaming or live coverage for up to date news & weather though. In General , Happy with this product, lots of movies to chose from, and love the old original tv programs. Thank-You to whomever invented this technology. Very Nice!", "verified": true, "helpfulness": "0/0", "author": "Betty Nerren"}, {"rating": 5.0, "review": "Awesome product that suits my family's entertainment needs.  Leave it to Amazon to update devices for today's consumers.", "verified": true, "helpfulness": "0/0", "author": "alison wagner"}, {"rating": 5.0, "review": "It's great to no longer be tethered to the Kindle!!", "verified": true, "helpfulness": "0/0", "author": "Jerry B"}, {"rating": 5.0, "review": "I'm not very tech savvy, so I'll keep this brief.  I previously had GoogleTV, but it was the first version of it, so I needed to upgrade.  I was somewhat hesitant to purchase Amazon Fire TV Stick because of the price -- was wondering if it was too good to be true, however I love it!  I've had it a couple of weeks and have had no issues with Netflix or Amazon Prime.  I love being able to transfer it among TVs within my house and it was super easy to setup.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Bought for my Daughters room and she absolutely love this. I have the Fire TV puck in the front room along with Neflix and I prefer the Amazon unit - especially the voice commands. This little device saves you a lot of money if you have a TV with HDMI but not a smart TV or smart DVD player. The only issue is the need to plug into an outlet - has a long enough cable (with extension) but there is the issue of having another cable hanging out.", "verified": true, "helpfulness": "0/0", "author": "TooClean"}, {"rating": 4.0, "review": "No issues. Works great and very convenient. I'm having some resolution issues but I am increasing my bandwidth to see if that resolves the buffering and pixelating. I have two fire sticks and one Fire tv so I am thinking my Mbps is the issue.", "verified": true, "helpfulness": "0/0", "author": "Cameron"}, {"rating": 5.0, "review": "Love it! Easy to install", "verified": true, "helpfulness": "0/0", "author": "Toni Wood"}, {"rating": 4.0, "review": "This is my third tv streamer but my first for the Amazon Fire stick. So I feel when I rate this I am a bit more fair as I do have other brands to compare with it. Now don't get me wrong we bought a Roku a few years back and got rid of our satellite bill. Best choice ever. Each month I paid close to $100 to get the channels that my family wanted. And when the weather went bad there was no tv. So I looked into my choices and at the time there was no Amazon Fire. So the best on the market was Roku. But, now that I have both I must say for your money best value is the Amazon Fire! First there are so many more channels. Second there is even games don't get to excited they are little apps same as what you can play on your Amazon tablet or smart phone. But, hey they are there and on a big screen! Third you obviously still have all your movie channels like Netflix and all so the same there but what Amazon has that Roku can't hold a candle to is the Pluto channel that has many channels your going to LOVE there is news, sports, diy, cooking, anime. You name it there is even history and science. This one app alone is worth the difference. But, there is even more. So I give this the best review ever! If your in the market for a streamer DO GET THIS! It is very much worth the money. And if you want you can still watch Starz and HBO. This is so much better then cable! And I can crank up the music on this thing while I clean house.Update: Now that I have had the Fire for a while and can compare to the Roku there is one factor that has come to my family's attention. While like I said before is true the actual streaming is not as good as the Roku. So we are waiting (a lot) for buffing or loading of a show. There is nothing quite like watching the news and in the middle of key wording to have the Fire stop streaming and start buffing and once it starts you miss what the man was trying to say. So if this doesn't bother you then the Fire is the way to go.", "verified": true, "helpfulness": "0/1", "author": "Frankie L Parks"}]