[{"rating": 5.0, "review": "Very impressed with it. Before I had a cable from my kindle fire hd to my TV. This has much better picture quality, I love the remote and the remote app is pretty slick too. Best $40 I've probably ever spent. :-)", "verified": true, "helpfulness": "0/0", "author": "Michael Barreno"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "TERRY GRISA"}, {"rating": 5.0, "review": "Easy to install, easy to use.  Amazon original programing, which is why we got the TV Stick, is great but the rest of the Amazon prime video library is not.", "verified": true, "helpfulness": "0/0", "author": "Irene Zabarkes \"InZ\""}, {"rating": 4.0, "review": "For the money cutting the cable saves, this is GREAT! I wish the prime selection was larger/newer. We got prime specifically for our tv & the selection is very limited & outdated for the most part. I would still reccomend this to anyone,  but if I could improve it, that's how I'd start.", "verified": true, "helpfulness": "1/1", "author": "ashton"}, {"rating": 1.0, "review": "Will this work on my element t.v?", "verified": false, "helpfulness": "0/1", "author": "roro"}, {"rating": 3.0, "review": "Setup was quick and the menus are easy to navigate. However, I've noticed while using Netflix that the network connection is dropped roughly once an hour. Resetting the device has been the only way I've found that works around this, which is very annoying. Hopefully an update comes out that will fix this.", "verified": true, "helpfulness": "1/1", "author": "Blake Owens"}, {"rating": 5.0, "review": "Easy to install. Lots of variety", "verified": true, "helpfulness": "1/1", "author": "Angel Palmer"}, {"rating": 5.0, "review": "Was very easy to hook up. Works great, we added Amazon Prime & Netflix for very little money. Would recommend to anyone who gets tired of same shows different day on TV.", "verified": true, "helpfulness": "0/0", "author": "Cora RObbins"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Andrea L Schell"}, {"rating": 5.0, "review": "I love my Fure TV Stick. No matter where I go I have access to my prime TV and movies.", "verified": true, "helpfulness": "0/0", "author": "NikkC"}]