[{"rating": 5.0, "review": "First time using fire tv , setup is dumb proof , the intro also helps to discover how to enjoy it better , works pretty fast and it's great deal also. I had an issue with the delivery but Amazon took quick measures and left me satisfied at a 100%!Just a note, the packaging is extremely well made and sells from the first moment", "verified": true, "helpfulness": "0/0", "author": "Omega_buyer"}, {"rating": 4.0, "review": "So far so good. I am an Amazon Prime member so I have had the opportunity to view shows and movies via my Kindle; now I can do the same on my big screen TV. The set up was amazingly simple and it works like a charm. There are loads of movies and shows to pick from, though I am more interested in those that are free! ;-) Still the prices are generally low enough to bear for a movie now and then.", "verified": true, "helpfulness": "0/0", "author": "nucci"}, {"rating": 5.0, "review": "Love the fire stick.Loads of free content and easy to navigate.No lag. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Jake Kee"}, {"rating": 5.0, "review": "\"Cut the cable\" on the bedroom TV and replaced it with this.  Couldn't be happier.  Easy 5 minute setup and I was good to go!  If I had one small complaint is that the \"one button purchase\" option on my Amazon account must be turned on.  Not a problem when downloading free apps, but if browsing on the pay stuff use caution.  Particularly with the iOS app.", "verified": true, "helpfulness": "0/0", "author": "Patrick M"}, {"rating": 5.0, "review": "Works perfectly. Great price. Love it.", "verified": true, "helpfulness": "0/0", "author": "Becklaw"}, {"rating": 5.0, "review": "Love it!! Perfect for my needs.", "verified": true, "helpfulness": "0/0", "author": "Rusty Wool \"Rusty\""}, {"rating": 5.0, "review": "This is great! It was a \"no brainer\" to set up and is so easy to use. I have it installed on the TV in the berth area of our boat. We have Amazon Prime as well as Netflix and now both my wife and I can enjoy a wide variety of entertainment options on a TV which was only being used as a DVD player until now.", "verified": true, "helpfulness": "0/0", "author": "FWS3"}, {"rating": 5.0, "review": "Easy to use, works great", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "This has turned my regular old TV into a complete entertainment package.  i love it.  so easy to set up and use.  i just gave my googlechromecast away.", "verified": true, "helpfulness": "0/0", "author": "Grace Silver"}, {"rating": 5.0, "review": "works great. i love it :)", "verified": true, "helpfulness": "0/0", "author": "jessicat"}]