[{"rating": 5.0, "review": "The only issue I have is the streaming staying active.", "verified": true, "helpfulness": "0/0", "author": "Kay"}, {"rating": 4.0, "review": "So far so good. It works great with my Sony HD TV. No complications on installing. Just wish HBO Now and Showtime Anytime were available apps..", "verified": true, "helpfulness": "0/0", "author": "Kenya Edwards"}, {"rating": 1.0, "review": "I've not purchased this item yet. I was curious if you had to have internet in order to use this device?", "verified": false, "helpfulness": "0/1", "author": "Brittny Tygart"}, {"rating": 5.0, "review": "The zipper, the light bulb, sliced bread. and the Fire TV Stick. All have made our life easier. Seriously, the Fire Stick is FANTASTIC. Truly plug and play very simple. If you do not have a smart TV, this is the best option. I am only sorry that I waited so long to order it.", "verified": true, "helpfulness": "0/0", "author": "Carl Grimes"}, {"rating": 5.0, "review": "The best thing ever", "verified": true, "helpfulness": "0/0", "author": "Filiberto C."}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "bernard"}, {"rating": 5.0, "review": "This thing is great! We used our Wii U for Netflix, Prime, and HBO Go. This stick has everything in one place! The only thing I would warn you about is that the remote is very small...", "verified": true, "helpfulness": "0/0", "author": "TatersDad81"}, {"rating": 3.0, "review": "There is a lot to like about the Fire Stick, but periodic connection problems are causing me to give 3 rather than 4 stars. I occasionally lose the Internet connection for reasons unknown. Also, I experience ongoing streaming issues with Hulu, but that might be an app issue because I seldom have problems streaming Netflix. Also, I wish I checked the compatibility issues a bit more before purchasing. I thought that I was going to be able to mirror my Kindle Fire to my tv screen using the Fire Stick; however, only certain models of the Fire allow you to mirror. Overall, the pros outweight the cons, but I am not quite as excited as I thought I would be.", "verified": true, "helpfulness": "0/0", "author": "mpa 64"}, {"rating": 5.0, "review": "A 66yr.old and taking in all music and film ,well pleased !", "verified": true, "helpfulness": "0/0", "author": "Michael Castillo"}, {"rating": 1.0, "review": "I was not impressed.", "verified": true, "helpfulness": "0/0", "author": "Thomas Hurlock"}]