[{"rating": 3.0, "review": "Works very good, however, unless you use prime video their is no way to remove all the amazon prime preloaded apps.", "verified": true, "helpfulness": "0/1", "author": "bryan barks"}, {"rating": 4.0, "review": "Great deal .works very well. Easy to use", "verified": true, "helpfulness": "0/0", "author": "SUSAN E."}, {"rating": 3.0, "review": "The main reason I purchased the Fire Stick was to watch Netflix. The app is horrible in that it buffers constantly. If your main reason is to watch Netflix, check the Fire Stick/Netflix app reviews online--they all say the same thing. The Amazon Prime videos do not have any issues to date.The Pandora app works well, too.These are the two I use most so I can't account for any others.Interface is easy to use, and in regards to the remote: I like that its small; it would help if the home button were on the bottom row to avoid hitting it when one is using the wheel to fast forward or rewind.", "verified": true, "helpfulness": "0/0", "author": "Jonell"}, {"rating": 4.0, "review": "very good and helpfull", "verified": true, "helpfulness": "0/0", "author": "Morteza"}, {"rating": 5.0, "review": "Love it so easy to hook up and I fell like i'am at the movies great!", "verified": true, "helpfulness": "0/0", "author": "Mickey"}, {"rating": 5.0, "review": "Love it!!!!  No need to buy a smart tv again!!!  Awesome and for a decent price too!", "verified": true, "helpfulness": "0/0", "author": "Stacey Eskelson"}, {"rating": 4.0, "review": "Finally I can get rid of cable!", "verified": true, "helpfulness": "0/0", "author": "cjetski"}, {"rating": 5.0, "review": "My grandson set it up for me and it is awesome. I love it. Thank you.", "verified": true, "helpfulness": "0/0", "author": "sandi lange"}, {"rating": 1.0, "review": "not at all what it says it is.. Worst thing I have ever purchased on amazon.", "verified": true, "helpfulness": "0/0", "author": "Thomas Heil"}, {"rating": 5.0, "review": "This is an excellent product for the price. It's low powered easy to install and has all the common apps. No latency issues with WiFi. I'm using 5GH  which is short range and the connection is solid, Again, great buy.", "verified": true, "helpfulness": "0/0", "author": "E. Green"}]