[{"rating": 2.0, "review": "Keeps loosing connection with new perfectly working network", "verified": true, "helpfulness": "0/0", "author": "BC"}, {"rating": 1.0, "review": "I purchased the Fire Stick while they were doing a promotion, so it took while to get here. I had hope that it would work well, but unfortunately it hasn't met my expectations. I have and love the Roku, and expected this to be similar, but more affordable.The first thing that I noticed that I though was odd is that the stick sill has to be plugged in to an outlet, or at least the instructions tell you to. In my mind it looses some of its benefit of being a stick if it has to be run to an outlet. Oh well, not really a big deal.The devices interface is easily enough to navigate and has all the options advertised, which is great.When it works properly, I'd rate it a 4-star, but often times there is such an extreme lag that it become unusable. My internet speed is plenty fast and isn't the problem. My TV is brand new and should be compatible. It just randomly acts up and is unpredictable. The remote almost seems to be broken, then the button you touched a minute ago (no exaggeration) reacts.I guess perhaps I may have gotten a faulty product, but at $19 it wouldn't be worth sending it back.", "verified": true, "helpfulness": "2/3", "author": "Penelope Thomas"}, {"rating": 5.0, "review": "Works great.  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "J. Elder"}, {"rating": 5.0, "review": "Easy to connect, use, and navigate. Great little device.", "verified": true, "helpfulness": "0/0", "author": "KC"}, {"rating": 5.0, "review": "What's there to say, it's fantastic. We love it.", "verified": true, "helpfulness": "0/0", "author": "L Butler"}, {"rating": 5.0, "review": "Great product. It works as promised.", "verified": true, "helpfulness": "0/0", "author": "Gjallahorn"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Sarah Johnson"}, {"rating": 2.0, "review": "I should've stuck to Roku. It is horrible It freezes all the time. It is not my internet because I have tried it on three TVs and have the same problem whereas I don't have any issues with Roku.  I wish there weren't so many apps preinstalled.  It was total clutter I had to take a lot off.  Some apps not compatible.  Going back to Roku", "verified": true, "helpfulness": "1/1", "author": "sunscreen mom"}, {"rating": 4.0, "review": "Works well most of the time.  Easy, convenient, fairly fast.  Con:  loses connectivity from time to time even though has almost clear line of sight to router.  We use it for Netflix and sometimes, Pandora.  Also enjoy the fireplace display.  Small, easy to use remote.  The stick is completely unobtrusive which is nice.", "verified": true, "helpfulness": "0/0", "author": "MG"}, {"rating": 1.0, "review": "Love it, love it, love it!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}]