[{"rating": 5.0, "review": "It works very good.  Now I don't have to buy a smart TV.  I would highly recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 4.0, "review": "This is such a great entertainment investment! I got it so that we could stream Netflix and Prime without having to connect one of our computers to the tv. Being able to watch YouTube is a fun plus. Then my boyfriend discovered the games. Oh, the games! A lot of them can be played with just the remote. (Badland FTW!) Unfortunately, a lot of other games we wanted to play require the game controller and the TV Stick isn't compatible with it. So, we decided to upgrade to the box. What made us upgrade to the box faster was that the TV Stick's remote isn't durable enough to withstand marathon gaming sessions. (Zen Pinball is intense, and I cracked the remote's navigation ring.) The only other downside is that we had to change our router's security settings in order for the TV Stick to connect to the internet. This is, apparently, a sometimes issue with Xfinity.Bottom line: If you want HD streaming and light, casual gaming, get the TV Stick. It's well worth it!", "verified": true, "helpfulness": "0/0", "author": "Rose Scarlet"}, {"rating": 5.0, "review": "Can drop HBO now.  Plenty of movies to watch free with prime.", "verified": true, "helpfulness": "0/0", "author": "Alice J. Pridemore"}, {"rating": 1.0, "review": "Worked great for the first few months. But now it drops the connection consistently. Hulu Plus doesn't work at all. after every commercial it either stays on a black screen or freezes the screen. Replaced a roku. Signal strength is great but wireless just drops out.", "verified": true, "helpfulness": "0/0", "author": "Ryan S. \"Ryan\""}, {"rating": 3.0, "review": "This is the second fire stick I've had, as the first stopped working and Amazon replaced it. Now this one can't connect to my wifi, although it had been working perfectly. I called Amazon and it worked again after I unplugged it and plugged it back in.", "verified": true, "helpfulness": "0/0", "author": "Quantum Natalie"}, {"rating": 4.0, "review": "I like the idea behind Fire TV Stick better than the actual product. I wasted hours troubleshooting. Sometimes even the support people could not help me. Sometimes the cable company and Amazon support threw the ball at each others and I was on my own dealing with delays and settings and unable to load video when the connection was supposedly very good.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "Works great, easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Warren E. Reed"}, {"rating": 5.0, "review": "I love this. Really good selection of apps and games. The UI is easy to use.", "verified": true, "helpfulness": "0/0", "author": "S.Munoz"}, {"rating": 1.0, "review": "This product does not work.  It will not show videos streaming on my iPad or laptop on the video screen.  All I get is a few pixels and no audio.  Somewhere in the documentation it says \"experimental,\" which means they aren't sure if it will work or not.  It will not hold an internet connection.  It will show that I am connected, then when I play it says not connected.  This is worthless.  Either send me a new one that works, or give me my money back.  My wife bought the apple device and it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Steve Earley"}, {"rating": 5.0, "review": "was a gift my Daughter loves this.", "verified": true, "helpfulness": "0/1", "author": "George"}]