[{"rating": 3.0, "review": "using both the fire tv and this stick I can say spend a little more and get the faster unit.... especially using Plex I noticed slow downs...", "verified": true, "helpfulness": "1/1", "author": "John Hillestad"}, {"rating": 5.0, "review": "Gotta have amazon prime or you have to pay to see anything new.", "verified": true, "helpfulness": "0/0", "author": "mowmoney"}, {"rating": 3.0, "review": "It works, but is very slow on loading data.  Not quite what I had expected.", "verified": true, "helpfulness": "1/1", "author": "Warren Broux"}, {"rating": 5.0, "review": "So far so good, just do not like it is externally powered", "verified": true, "helpfulness": "0/0", "author": "Patrick J. Trinchese"}, {"rating": 5.0, "review": "Love the stick", "verified": true, "helpfulness": "0/0", "author": "Joanne"}, {"rating": 4.0, "review": "works great, would give it 5 stars but it doesnt show that there is a big long power cord that feeds the fire stick which makes it bulky and funny looking, and so far EVERYONE that has come over asks me whats sticking/hanging out of the side of my tv...", "verified": true, "helpfulness": "1/1", "author": "fifthday"}, {"rating": 5.0, "review": "Work great and are easy to setup and navigate.", "verified": true, "helpfulness": "0/0", "author": "BlugTX"}, {"rating": 5.0, "review": "We love this little stick.  Regardless of which family member speaks to it,  it understands and brings up the title.  Easy to install, easy to set-up, and even easier to find and watch the shows we want.  Great little gadget.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"queen of piers\""}, {"rating": 4.0, "review": "I bought the Amazon Fire Stick, because I could not afford my cable companies prices. Read the reviews, so took a chance, also added HULU so I could watch local TV you know shows that are on known regular channels.  Any way this product has worked real well for me (69-70)year old.  Tonight however it decided to give me sass.  With this message Digital channel signal strength is low!  So for the first time in a week I can not watch TV, I like the Fire TV Stick, I'll give it a 4 star, because even with this glitch, it worked great for me.  I can and will recomended to those who want to get out from under $100 dollar cable bills just for TV and live on a tiny, tiny income.", "verified": true, "helpfulness": "3/3", "author": "Claudia Mott \"avid reader\""}, {"rating": 4.0, "review": "Giving 3 stars because when I did the research when wanting to replace my broken Chromecast it states that the Fire Stick does everything and more..(so I purchased)..However you cannot Stream Live  from your Laptop onto your TV like with the Chromecast. Also HBOGO is still not working. I will be purchasing another Chromecast and will put the Fire Stick Downstairs for the kids to watch Netflix, Hulu, Prime, ect..... But if you want to stream from your Laptop to the TV this is not the stick for you.", "verified": true, "helpfulness": "1/1", "author": "HelloDollie"}]