[{"rating": 1.0, "review": "Received this for free after paying in advance for 3 months of Sling TV. It's worth exactly what I paid for it. It runs VERY hot in use. It stutters every few seconds. It frequently flashes a notice that my service isn't fast enough to support HD streaming--Motorola modem, Netgear dual band router AND my ROKU 3 works flawlessly on my network. The whole system is cheap and flimsy. It's a flash drive with software loaded onto it. The only way I've found to open the remote to change the batteries is by bouncing it off the floor. My advice is spend a few extra bucks and buy a ROKU. Even a ROKU 1, as slow as it is, works better than this device.", "verified": true, "helpfulness": "0/0", "author": "M. Bingham"}, {"rating": 5.0, "review": ".A handything to own when there is nothng on cable. Better pitcure then HD cable", "verified": true, "helpfulness": "0/0", "author": "Craig C. Leslie"}, {"rating": 5.0, "review": "Love it, better than the Google ChromeCast", "verified": true, "helpfulness": "0/0", "author": "Taymonk"}, {"rating": 3.0, "review": "Is there an app I can download as a browser???", "verified": true, "helpfulness": "0/0", "author": "jawjuhred"}, {"rating": 5.0, "review": "Same for the app", "verified": true, "helpfulness": "0/0", "author": "Carol Hamilton"}, {"rating": 5.0, "review": "Love ya", "verified": true, "helpfulness": "0/0", "author": "Kandie bowen"}, {"rating": 5.0, "review": "I love it.  Small unit, everything included.", "verified": true, "helpfulness": "0/0", "author": "Nance"}, {"rating": 5.0, "review": "If you are a Prime member then why wouldnt you want this. Extends the value of your membership by allowing you to watch your movies on the Flat Screen! 55\" way better than 9\". Use your prime movies you are paying for them already!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Terrible!!!! Poor picture and sound quality and very poor customer service. Poorly designed. Don't waste your money on this product very subpar.", "verified": true, "helpfulness": "0/1", "author": "Kathie S."}, {"rating": 1.0, "review": "I already owned a Chromecast but have Amazon Prime, which does not play nicely with Chromecast. I ordered the Fire Stick to take advantage of this membership benefit.  All I can say is CUMBERSOME ! Rather than conveniently casting from ones device one must keep track of a miniature remote.  I found this annoying as I had to strain to see the screen to select letters on the keyboard.  My eyes are good but the interface is very small.  Never mind the chance of misplacing the teeny remote.  It also drives, drives, DRIVES everything to Amazon ! It doesn't flow freely to one app to the next.  I was very disappointed and returned it.  Go with Chromecast. It's easy to use and a pleasure.", "verified": true, "helpfulness": "0/2", "author": "SueF \"sfurey7\""}]