[{"rating": 5.0, "review": "Me & my husband love it! It works perfect never had a problem. Set up was super easy. We are even going to buy one for our bedroom soon!", "verified": true, "helpfulness": "0/0", "author": "bama clark"}, {"rating": 3.0, "review": "The fire stick performed as expected.  Easy to install and works great with my iphone app!", "verified": true, "helpfulness": "0/0", "author": "Ross D Contella"}, {"rating": 5.0, "review": "I really wasn't expecting this to have a power cord as well, but it works fine and doesn't annoy me.", "verified": true, "helpfulness": "0/0", "author": "Valerie"}, {"rating": 5.0, "review": "Got the Amazon Fire TV stick as part of a free promotion for sling TV and I love it for the sling TV and slingbox apps.  There are lots of app options for the Amazon fire stick that are not available on Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Matthew Spaulding"}, {"rating": 4.0, "review": "The Fire Stick itself works great.  I just wish they would have more 'up-to-date' FREE movies for Prime subscribers.  They are some, but not a lot.  Other than that...the Fire Stick is a great price and works great.  Has many apps (pandora, etc.) which is great if you don't have a 'smart tv' to start with.", "verified": true, "helpfulness": "0/0", "author": "S. Hawkins \"Dallas\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Debbie Stone"}, {"rating": 5.0, "review": "I just love it...best thing amazon has invented And it takes up no space. I am able to watch so many movies now. Haven't played the games yet but will do. So satisfied definitely recommend and the price is awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Senad R."}, {"rating": 4.0, "review": "Works very well. Everyone in my family is loving this technology. Took way too long to ship (1month), Soo I give 4.5 stars.", "verified": true, "helpfulness": "0/0", "author": "JGo420"}, {"rating": 5.0, "review": "Love this!  it was on back order but glad I bought it.  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "drez"}]