[{"rating": 4.0, "review": "Did a fine job. Can get a good selection of movies.", "verified": true, "helpfulness": "0/0", "author": "Robert Pedersen"}, {"rating": 1.0, "review": "on the television commercial with Gary Busey demonstrating how the fire stick works it never shows the requirement of an additional USB cable and an additional power outlet to make it work properly. They should include this information in the commercial suppliers will be aware and make the correct choice. I'm returning this device for credit. It is not what I wanted or expected.", "verified": true, "helpfulness": "0/1", "author": "San Diego Customer"}, {"rating": 1.0, "review": "Worked great for the first two days, now refuses to connect even though its 10feet from the router. Like cheap toy that breaks after the first day", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my firestorm many wonderful programs and movies available!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "This photo does not show it but you actually have to have the stick attached to a power source. Additionally even with the fire stick extension on one of my tv's it was still hidden behind the tv and thus useless. I do have an amazon fire tv which I have no problem with but I sent the stick back", "verified": true, "helpfulness": "0/0", "author": "Tracy Fletcher"}, {"rating": 1.0, "review": "The fact that you are subjected to sitting through a 10 minute how to video that cannot be skipped is unacceptable. Amazon what are you thinking?? The interface is way too busy as well and you have to download Netflix and other channels. This product is just a huge hassle and I wish I hadn't wasted my money or time thinking it was an upgrade. Stick with roku!", "verified": true, "helpfulness": "0/2", "author": "E Kenner"}, {"rating": 4.0, "review": "I ordered this because my main media device was a playstation 3. I loved using that but I wanted to go to something with a smaller footprint. When I saw this on Amazon for $20, I couldn't say no. I mainly use prime, netflix and hulu plus for movies and TV so this fit the bill. It has been great so far. My reason for dropping a star is the wireless. I have tried everything under the sun. I will preface by saying I am a network tech, so while I don't know everything, I do know that the issue is with the device. I tried different APs(first one was cisco, second was the wireless built into my belkin), different wireless channels, different IP schemes(static and dynamic), tried changing network security types and even used simple qos to make sure that it was getting enough bandwidth. I checked my firewall and even shut it off on my router to test if that was causing issues. No matter what I do, the device will randomly disconnect from my network. If I go to reconnect it will see my wireless but not connect. No other devices have this problem on my network except for this. Unless I missed something, the only thing left is the devices software or firmware. I wish amazon would look into this as it seems many other people have this same issue. It is a huge inconvenience due to having to reboot the device in order for it to connect again. Besides this, it's great. Hopefully amazon fixes this networking issue because it is the only thing that keeps me from loving this thing 100%.", "verified": true, "helpfulness": "0/0", "author": "Cheapskate"}, {"rating": 5.0, "review": "one of the BEST items I have ever purchased.  very easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Robin Rigney"}, {"rating": 5.0, "review": "Wow! Just wow!I didn't expect this to be something I would enjoy this much. I have two smart tv's and one TV that is not smart. I bought this in order to make it easy to access Netflix, Hulu, HBO, etc. on that TV. I am already so blown away by the interface, the recommendation algorithm, and just the overall quality of this product, that I am planning on buying additional units for my smart tv's. It's that good.Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Jingyi Wang"}, {"rating": 5.0, "review": "I love my fire stick one of the best things I every bought", "verified": true, "helpfulness": "0/0", "author": "Tim Bailey"}]