[{"rating": 5.0, "review": "So easy to set up and use.  I use it so much I wanted one for the tv in my bedroom, too.", "verified": true, "helpfulness": "0/0", "author": "Nancy Bordeau"}, {"rating": 2.0, "review": "It works well enough but there are better TV sticks out there. The apps crash often (hbo go is especially bad), the OS is rather slow and feels like a cluttered mess that is constantly trying to get you to buy things and download other apps. If you ever have to do a factory reset you will be forced to sit through the intro video again as it isn't skip-able. I've already had to call the tech support once and even they admitted that you need to unplug it regularly to let it reset itself, and then plug it back in a few minutes later. I wouldn't recommend even at this low of a price, go with a roku player instead.", "verified": true, "helpfulness": "0/1", "author": "Grant"}, {"rating": 5.0, "review": "Love it! Easy to set up and use, inexpensive with great content with access to Netflix, Hulu and others.", "verified": true, "helpfulness": "0/0", "author": "Catherine Waggener"}, {"rating": 4.0, "review": "Like it woks great", "verified": true, "helpfulness": "0/0", "author": "Alicia M."}, {"rating": 5.0, "review": "So far we are loving it !", "verified": true, "helpfulness": "1/1", "author": "Kitty Coleman"}, {"rating": 2.0, "review": "I was disappointed to find out that FreeTime show are not available on the fire tv stick. The main reason I purchased it.", "verified": true, "helpfulness": "1/2", "author": "chris walker"}, {"rating": 5.0, "review": "This has been a lot of fun.  Set up was really easy and only took minutes.  I am not a very technical person, but I was able to set up without any help. The program basically guides you through setup.Before I purchased my Fire TV Stick I had to hook my Kindle to our TV in order to  watch Netflix and Amazon Prime.  That meant that if my daughter wanted to watch a movie I could not use my Kindle.  I also had to navigate pauses and stops... through the Kindle. The Fire Stick comes with a remote, so I can pause without leaving my seat.Now it is so easy for the whole family to use it.  I also love streaming my favorite radio station through our Bose TV sound system.  I highly recommend this.  It is well worth the money if you are in the situation I was in.", "verified": true, "helpfulness": "1/1", "author": "lettie"}, {"rating": 5.0, "review": "So far so good! It's so nice for my husband and me to be able to watch a show\\movie (netflix & Amazon video) on the \"big screen\".Easy set up.", "verified": true, "helpfulness": "1/1", "author": "Wicked65"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Efrain"}, {"rating": 5.0, "review": "I can't believe I've committed to no cable. but I have and I'm loving it", "verified": true, "helpfulness": "1/1", "author": "Erin Thibodeaux"}]