[{"rating": 5.0, "review": "Awesome...,we love it!!!", "verified": true, "helpfulness": "0/0", "author": "Nan Tibolla"}, {"rating": 1.0, "review": "Worst Streaming Media device yet. Looks good but will not connect to my router. Have an Apple TV, Roku and Chromecast, all work flawlessly. Was hoping I could take advantage of the all the Amazon Prime shows since I am a Amazon Prime user. Total crap, much easier just to stream it from my computer to my Apple TV. Half baked, alpha release of this device. Should be able to at least connect to a Cisco E3000 router without an error every time it tries. Maybe the next version will be better but for now stay away and buy something that actually works. Glad I got it on the half price deal and not for the full price.", "verified": true, "helpfulness": "2/2", "author": "Paul Sloan"}, {"rating": 5.0, "review": "Best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Cathy Morse"}, {"rating": 2.0, "review": "Thumbs down, Amazon. After nearly a month of attempting to use the Fire Stick as our primary TV streaming device, we are very disappointed in it's performance. It constantly freezes/stalls, and we have to cycle power almost every night. We typically give up and go back to our dependable 1st generation Roku. The $20 we spent on it during the Prime membership promotion wasn't even worth it.", "verified": true, "helpfulness": "1/1", "author": "Bethany F. Collins"}, {"rating": 3.0, "review": "I have been using the Fire TV Stick since its release a few weeks ago. I like the ease of menu navigation and quick response time with the remote. You can tell they designed the navigation so the user would be encouraged to use the Amazon video service. It was definitely worth the $20 pre-sale amount I paid. I don't think I would pay more though $30 because of the technical problems described below.The main problems I have experienced so far is the lag, and freezing of the stick, when dealing with the viewing Apps. If you view Amazon videos, there is no problem. However, if you use the Netflix App to stream Netflix through the Fire TV Stick, you will experience video lagging and frequent freezing of the Fire TV Stick. This also seems to happen when viewing video from any other source than Amazon. The Fire TV Stick also locks up and loses my wifi signal every few days, requiring me to unplug and reboot the Fire TV Stick at least twice a week. If it wasn't for their limited viewing apps (i.e. Netflix, HBO Go, VUDU, etc), and the Fire TV Stick locking/freezing every few days, I would give this product 5 stars. For now, I can only give it 3 stars until they can make it run smoother without locking/freezing every few days.", "verified": true, "helpfulness": "1/1", "author": "RDB"}, {"rating": 2.0, "review": "I bought the Fire Stick for the sole purpose to use the nba game time app so I could stream games. The app constantly freezes.  So disappointed.", "verified": true, "helpfulness": "0/0", "author": "Regina Murray, OSB"}, {"rating": 5.0, "review": "Tons of stuff to watch and do........ it's awesome!!!!!", "verified": true, "helpfulness": "0/0", "author": "Erika"}, {"rating": 4.0, "review": "The Fire TV Stick was a Christmas gift.  I am very pleased with it and will get a lot of use out of it.  It was easy to install on my TV.  We have watched one movie which streamed perfectly, no gaps or interruptions.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow. now the Wii console is downstairs and we have all our connectivity.Took 3 mins to install and use due to pre programming be Amazon.", "verified": true, "helpfulness": "0/0", "author": "Lance"}, {"rating": 4.0, "review": "The setup was very easy. The only thing i was hoping to be able to do access more tv shows without cost. Other than that its great", "verified": true, "helpfulness": "0/0", "author": "southernangel"}]