[{"rating": 5.0, "review": "Fantastic.  I love it.  A new way to watch TV.", "verified": true, "helpfulness": "0/0", "author": "James Glen"}, {"rating": 5.0, "review": "I have been waiting for this and what a success!!If you are an amazon user and a prime user this is a must. This give you all your content including cloud content accessible anywhere there is WiFiI love itThank you Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "StriderHyru"}, {"rating": 5.0, "review": "Best ever!! I'm canceling Netflix tomorrow - Fire Stick is the greatest!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Movies are advertised as free- they are not. In the \"first run\" category you must pay. Variety is lacking on new movies. I feel misled.Easy to install and use. Mirrors AppleTV.", "verified": true, "helpfulness": "0/1", "author": "Barb K"}, {"rating": 4.0, "review": "Fire TV Stick is faster than my old Roku.  I am unable to get Dolby Digital output to my stereo whereas my Roku does with no issues.  Navigation is nice n smooth.  I just wished I had prime so I could use other features.  Currently use with PLEX and other available media apps.", "verified": true, "helpfulness": "0/0", "author": "RBSC"}, {"rating": 4.0, "review": "Have only been using it for just over a week and so far, so good. We primarily use the Netflix and Amazon apps and both have worked well. The Hulu app seems to slow down and freeze a lot. If you get one, be sure to explore the other apps: last night I found the PBS app, documentary app and a few more. We used to stream via a computer and having a remote is great!", "verified": true, "helpfulness": "0/0", "author": "USR"}, {"rating": 4.0, "review": "Was slow to setup but after some time works well. The app is little slow too but does work.  Overall is above average with the performance", "verified": false, "helpfulness": "0/0", "author": "Toby Dean Everroad"}, {"rating": 2.0, "review": "Very poor performance. For something with decent specs, I didn't expect the UI to be so sluggish and the wifi on it to be so poor. My tv is literally 3 feet from my router and streaming would have audible/visual hiccups every minute or so.", "verified": true, "helpfulness": "0/0", "author": "Jamezeite"}, {"rating": 5.0, "review": "Amazing product! Apples to apples compared to  Chromecast, the Chromecast doesn't hold a candle!", "verified": true, "helpfulness": "0/0", "author": "Meredith Nunnally"}, {"rating": 5.0, "review": "5 Stars for doing exactly what it said it did. Took a minute to pair with Wi-Fi, but runs very smoothly and pretty fast for a stick. Wish they had HBOgo app.", "verified": false, "helpfulness": "0/0", "author": "norma murdoch-kitt"}]