[{"rating": 4.0, "review": "The Fire TV Stick is a great product for the price. However, I have had a Roku 3 for 9 months now and I will continue using it as my main streaming device. The main feature that the Roku has that is missing from the Fire TV Stick is searching content from all apps in a single search. On Roku you can see what videos are available (and at what price) across Amazon Prime, Hulu, Netflix, and many more services. On the Fire TV Stick you are limited to the Amazon ecosystem on the main screen and search. You have to go into apps individually to see what content is available. I have Amazon Prime but most of the videos I watch are on other services.The remote has a nice feel and is a little smaller than the Roku 3 remote. The power cable was long enough for my setup and the HDMI extension cable allowed me to plug the stick into the side HDMI port on my TV. My router is on the other side of the house and I haven't had any signal issues.I ordered this as a gift in case I ended up giving it to someone (I pre-ordered it) so it did not come tied to my Amazon account. I had to enter my Amazon password using the remote. I had to change my password to a simpler one and then back because I use generated passwords with LastPass and entering a long password on the remote is a tedious task. So if you order this as a gift for someone it will be a bit awkward to login initially. Other devices/apps display a one time code that you enter on your computer to register the device; this would be much better than the approach Amazon took.Overall, this is a very inexpensive streaming device that has nearly all of the features of any of the more expensive devices out there. You can't go wrong with the Fire TV Stick if you are looking for an inexpensive way to stream to your TV.", "verified": false, "helpfulness": "0/0", "author": "Robert H"}, {"rating": 2.0, "review": "I am not overly thrilled with this as of yet. It's clunky and difficult to navigate when trying to search for channels. The apps I searched for before purchasing (TWC/AMC specifically) are not compatible with this device, which is a huge disappointment. It is definitely amazon-centric which was to be expected, but holy cow, trying to find anything else is a nightmare.", "verified": true, "helpfulness": "1/1", "author": "nathansmom712"}, {"rating": 1.0, "review": "Would love to write a review of the Fire TV Stick, however it's back ordered. So glad that they made sure that BEST BUY for their shipment instead of fulfilling their PRE-ORDERS.", "verified": true, "helpfulness": "9/18", "author": "Matthew & Jennifer Weyna"}, {"rating": 2.0, "review": "After trying a Roku stick and Chromecast I had high hopes for the Fire TV Stick.  Like the predecessors it to is plagued by abhorrent wireless connection problems. If your TV Stick is located directly above your router it works great but if it's in another room, even when the Network Status states it has a \"very good\" connection it doesn't work properly.Why oh why can't these companies make a device that has remotely equivalent connection capabilities to those in my laptop, phone, tablet, etc.. I can stream netflix w/o issue in HD on all of those devices but all I get is buffering on the Fire TV Stick and the Chromecast and Roku Stick I tried.Not worth even trying out the rest of it as it's not going to work in the room it needs to. Guess I'll continue to leave my laptop plugged in to the TV.Sad...", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 1.0, "review": "As a a prime member where is my Fire STICKll the local stores all have it but i have to wait until DEC 25th to get it what gives?", "verified": true, "helpfulness": "7/16", "author": "cmore"}, {"rating": 1.0, "review": "Total piece of crap!! Bogs down network. Can't use anything else if this is connected. Glad only paid $20. Not worth returning. It's in the trash.", "verified": true, "helpfulness": "0/3", "author": "eric"}, {"rating": 1.0, "review": "Needs a software update right out of the box; minus one star.Update fails five times in a row; minus one star.Searched XDA, Reddit, and Google for a way to skip mandatory update, just so I can try the device; minus one star.Fire Stick will not connect to the android app; minus one star.The Stick fails to buffer as well as a Chromecast, which isn't saying much, but makes streaming terrible.  The Stick will drop connection without warning, prompting a device reboot.  This is as hurried as Android 5.0 and the user experience suffers.For a $40 device, I'd never even consider such a device.  My Chromecast and Roku 3 are more than capable.  At the Prime promo discount of 50% off, it's still a pass.  This thing will only be more successful than the Fire Phone because of the low price, it's still an Amazon product that doesn't do books-only and that means fail.", "verified": true, "helpfulness": "0/0", "author": "F. Ingers"}, {"rating": 3.0, "review": "Just plugged in our new Fire Stick and NO VUDU! We are so disappointed, no way to access our digital video library :-( Still trying to decide whether to keep it or return it for the Roku stick which has VUDU. On the up side it seems to be really fast compared to the Roku2 which is what we had. Really wish it had VUDU because as of now that's the only downfall.", "verified": true, "helpfulness": "1/3", "author": "Krista B."}, {"rating": 4.0, "review": "Great video streaming and my amazon content is available for streaming too.  Awesome little stick.", "verified": true, "helpfulness": "0/0", "author": "Bradley Redford"}, {"rating": 1.0, "review": "The stick has some great capability, but it's flawed by extremely poor Wireless performance. It is 5 feet away from the router , and one bar of signal strength is already lost. Constant buffering makes watching movies miserable. I bought two of these sticks and both perform the same way. Will return them both .....", "verified": true, "helpfulness": "3/6", "author": "Anton Iliev \"AHTOH\""}]