[{"rating": 5.0, "review": "I would like it wirelessly connect my laptop to my tv like some of their competitors *cough* google *cough* Other than that though, it is great.", "verified": true, "helpfulness": "0/0", "author": "Trevor Vaughan"}, {"rating": 5.0, "review": "Love it! So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Katie A. Helms"}, {"rating": 5.0, "review": "Work beautifully.", "verified": true, "helpfulness": "0/0", "author": "Gary B."}, {"rating": 4.0, "review": "i was going to give this 3 stars but then found it unfair as it could be crappy Internet that makes it perform poorly.  I'm not sure of the cause so I'll give it 4 stars.  It is nice, easy to use, and if you have Amazon prime it for obvious reasons strongly caters toward prime video usage.  I had prime before and had a ROKU.  I never ever used prime on that as it is really crappy to use through ROKU.  On this thing it makes everything so easy to get to use find etc and really makes prime worth a lot more with how heightened the video portion is through this thing. But, at least on mine, it's slow as balls, and resulting my have very glitchy segmented video a LOT of the time.  Like I said I can't pin the culprit as I haven't used it anywhere else before with better or worse internet service so I don't know, but if it is the stick I have to say it really blows to watch video that looks like everything is loading up I. Half second increments just in time to play it enough to make it seem just variable enough to not turn the show off completely.", "verified": true, "helpfulness": "0/0", "author": "TA"}, {"rating": 5.0, "review": "It's amazing", "verified": true, "helpfulness": "0/0", "author": "yemis reyes"}, {"rating": 4.0, "review": "Love the fire stick, the best buy I ever made.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "Love it! Best present ever from our son!", "verified": true, "helpfulness": "0/0", "author": "Nancy Werling \"tweetsmom\""}, {"rating": 2.0, "review": "I bought a Fire TV stick to use with my 21:9 monitor, both for full-screen viewing and to view as a second input using half the monitor. It fails badly for both of these cases because the device assumes a 16:9 screen, and does not scale well if given anything else. Do not attempt to use this on a non-16:9 screen. It does not scale appropriately.", "verified": true, "helpfulness": "0/0", "author": "Luke Sneeringer"}, {"rating": 5.0, "review": "Fast, easy, full of content.", "verified": true, "helpfulness": "0/0", "author": "Nic Meredith"}, {"rating": 5.0, "review": "Love this product!!!! And if you combine it with sling tv there is no more need for cable", "verified": true, "helpfulness": "0/0", "author": "Bobby Carey"}]