[{"rating": 5.0, "review": "Great little box that does a lot. Very intuitive and speedy. I can stream movies through it or from my PC through the Plex app. So much for so little. I bought one for each room of the house.", "verified": true, "helpfulness": "0/0", "author": "Michael Odahowski"}, {"rating": 2.0, "review": "My tv has no USB", "verified": true, "helpfulness": "0/1", "author": "James A. Broz \"zorbajim\""}, {"rating": 5.0, "review": "I lve my fire stick it's easy to use and has everything on it", "verified": true, "helpfulness": "0/0", "author": "laura"}, {"rating": 5.0, "review": "I bought as many as i could i brought a couple of my family  members into the subscriber age and the are having little to no difficulty with it", "verified": true, "helpfulness": "0/0", "author": "ian dixon"}, {"rating": 5.0, "review": "Totally plug and play.  Works beautifully!", "verified": true, "helpfulness": "0/0", "author": "Pam DeVengencie"}, {"rating": 5.0, "review": "Great gadget for the price.  Can wait to watch all of the movies through Prime.", "verified": true, "helpfulness": "0/0", "author": "Jerome Hayes"}, {"rating": 5.0, "review": "While I like my Chromecast very much (and it can do some things that the Fire Stick can't) the Firestick streams better/faster and more reliably. I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "M Jordan"}, {"rating": 3.0, "review": "Candidly, the Fire TV stick is not ready for Prime Time.  Overall I like our 2 Roku devices (the Roku 2 & Roku 3) much better than the new Fire TV Stick. The Fire TV Stick navigation is clumsy and cumbersome compared to the Roku.  Surprisingly, navigating to find my favorite music on Amazon Music is terrible (I much prefer using Roku to stream my music through Amazon Music).However, the video and audio quality of the Fire TV Stick appears to be slightly better than the Roku, boosting my rating to a mediocre 3-stars.", "verified": true, "helpfulness": "1/1", "author": "BeachBum"}, {"rating": 5.0, "review": "Love the Fire TV Stick!", "verified": true, "helpfulness": "0/1", "author": "Tony Mason"}, {"rating": 4.0, "review": "Still playing with it and seeing what's available and not, but if you don't subscribe to Amazon Prime, the device is very limited in what you can get as the free channel/apps are not interesting. Otherwise, you will need to purchase a lot of the content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]