[{"rating": 5.0, "review": "It is just what I needed and I am please as punch to rid myself of the cable company!", "verified": true, "helpfulness": "0/1", "author": "Kyle Wallace"}, {"rating": 4.0, "review": "With the fire stick I don't have to watch Netflix on my cell phone anymore.", "verified": true, "helpfulness": "0/1", "author": "john simon"}, {"rating": 5.0, "review": "Easy to set up and use. Still trying to figure out though. Love the fire TV app for my iPhone that lets me use the phone as a remote with voice command.", "verified": true, "helpfulness": "0/0", "author": "tadshade"}, {"rating": 5.0, "review": "I'm addicted", "verified": true, "helpfulness": "0/0", "author": "DKIB"}, {"rating": 5.0, "review": "Love it! Very easy to set up and user friendly.", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 5.0, "review": "Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "This is an excellent purchase if your plans are to stream content.  You can not beat the price.  There is no need to be a smart TV or BlueRay player with Fire TV Stick.  I easily get Prime Video, HBOGo, Netflix, Hulu, etc.  Set up was very easy.  Also can view uploaded pictures to Amazon storage.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "It did not work with a satellite system", "verified": true, "helpfulness": "0/0", "author": "Jeff J Nohl"}, {"rating": 5.0, "review": "All I can say is wow. Very impressive piece of tech. I bought it on vacation at my parents house. My mother has prime but never used the instant video. I was able to teach them how to use prime instant video, netflix, hulu, and crackle. They were stunned and amazed. They quickly bought one for themselves.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I am not aware of this product until recently recommended by friend. Product is very amazing best plugin device for your TV. Only thing I didn't like was the power chord. All the wiring is done through the wall but this product wiring will standout on top of the wall as it needs power to work.", "verified": true, "helpfulness": "0/1", "author": "sekhar"}]