[{"rating": 4.0, "review": "Pros:You can tell its android (FireOS I'm sure), the developer options are exposed and you can load apk's on it and use adb (though I haven't tried yet but I did see the options in settings)It has a remote, I like the chromcast but having to unlock your phone to pause or play the next episode makes you appreciate the remote.Cons:There doesn't seem to be a way to restrict purchases without also requiring a PIN to adjust settings.This device won't output 1080i preventing use on my older big screen that doesn't support 1080p or 720p. (the chromecast does work at 1080i on this tv)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is so cool! I love the fire T.V stick!! Highly recommend it for people who don't want to go through the trouble oh setting up your computer or making sure your device is charged. 👍😊", "verified": true, "helpfulness": "0/0", "author": "Joanna Hanlon"}, {"rating": 3.0, "review": "Not as good as roku yet", "verified": true, "helpfulness": "0/0", "author": "Joseph D. Taylor \"jdjataylor\""}, {"rating": 3.0, "review": "It works fine but often freezes even with lightning fast internet connection. We have had more success with our roku stick.", "verified": true, "helpfulness": "0/0", "author": "Rene Rocha"}, {"rating": 1.0, "review": "Does not support twc tv. No time warner cable tv app!!!!Supports paid subscription apps like netflix and hulu which my smart tv already has. Not much else.", "verified": true, "helpfulness": "2/4", "author": "av g e \"av g e\""}, {"rating": 5.0, "review": "I bought this on the Prime Membership special offer.  Set-up is easy and it appears to work well...", "verified": true, "helpfulness": "0/0", "author": "Jim \"Jim\""}, {"rating": 4.0, "review": "This streaming stick is really good for it's price. It's cheaper than the Roku Streaming Stick and costs a bit more than the Chromecast. The performance of the device is great. It never lags. But for some reason, there are barely any games on this thing. Overall, this device is great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is wonderful!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty awesome!!!! Makes having amazon prime even better", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]