[{"rating": 4.0, "review": "Cool!", "verified": true, "helpfulness": "0/0", "author": "M. Longhofer"}, {"rating": 4.0, "review": "I like the fire stick as it is easy to use, small, and contains access to a ton of content! My Television is mounted above my fireplace and I have experience difficulties with the remote skipping. I am not sure if this is a dysfunctional remote or because of the tv height.", "verified": true, "helpfulness": "0/0", "author": "Jenna"}, {"rating": 5.0, "review": "I have Netflix and I enjoy watching the movie.", "verified": true, "helpfulness": "0/0", "author": "Roberta (BOBO) Prock"}, {"rating": 2.0, "review": "I like the number of apps available for the device.  Unfortunately, the stick crashes and freezes routinely making the overall experience disappointing.", "verified": true, "helpfulness": "0/0", "author": "J. Lockwood"}, {"rating": 5.0, "review": "35 bucks and it makes you tv into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Travisi"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Loretta Childs"}, {"rating": 4.0, "review": "I wanted the Fire Stick for three main purposes: Netflix, Youtube and Kodi XBMC. All of the run great with no issues at all nor lags. Of course, in order to install xbmc you need to read some tutorials because it's not on the Amazon Store. It would be great if you could access the Play Store instead of the Amazon Store.", "verified": true, "helpfulness": "0/0", "author": "galbin \"galbin\""}, {"rating": 5.0, "review": "I need to buy a couple more, GREAT product", "verified": true, "helpfulness": "0/0", "author": "Hansford22"}, {"rating": 5.0, "review": "It is fantastic. Turned my regular t.v. into a smat t.v.", "verified": true, "helpfulness": "0/0", "author": "Irma M. Nunez"}, {"rating": 5.0, "review": "Not only is this little devices one of the coolest gadgets to come along in a long time but it's ridiculous all of the things it does for the money. It's also packaged so well that I can't bring myself to discard anything either. The slam dunk clincher is the smart phone App which makes this thing a joy to use. A+. Way to go Amazon engineers!", "verified": true, "helpfulness": "0/0", "author": "Ed K."}]