[{"rating": 5.0, "review": "Fabulous.", "verified": true, "helpfulness": "0/0", "author": "Christina Bloom"}, {"rating": 5.0, "review": "For $34 and it works better than the Apple TV! So easy to use and it's HD!", "verified": true, "helpfulness": "0/0", "author": "Victor Trang"}, {"rating": 4.0, "review": "The Fire Stick does a fine job of navigating what to watch, has simple hook up and no issues with streaming", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Beitzel"}, {"rating": 5.0, "review": "Turns a TV into a smart TV.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Kerri Largo"}, {"rating": 4.0, "review": "Don't use it, having a voice remote.  Don't need it.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "These work great gave them out as gifts.", "verified": true, "helpfulness": "0/0", "author": "Patrick Le Beau"}, {"rating": 5.0, "review": "Loving it so far.  I almost hate to say it but for the month I've been using it, I find myself going to the Fire TV Stick more than my Roku 3 & I love my Roku.The picture screen saver is great, pulling in your prime pictures and it has a sleep feature also that I enjoy.  I'm using Netflix, Hulu Plus, Plex, Youtube, Pandora and they are all running great.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "I absolutely love the Amazon Fire Stick and I will tell you why. I have 2 ROKU 3 HDMI sticks and a WII to stream wireless and the Amazon fire Stick is far superior in speed, ease of interface and screen mirroring from my Samsung Note 3 to my TV. The Fire Stick is super easy to navigate with a slim remote that feels good in your hand, You have your choice of several streaming devices and hands down this is the best! Very responsive to your commands without delay and a beautiful menu layout - I have nothing bad to say about it - I will be getting another one soon!", "verified": true, "helpfulness": "0/0", "author": "solarheater"}, {"rating": 5.0, "review": "The process to buy and then install was so easy!", "verified": true, "helpfulness": "0/0", "author": "gary wayne thompson"}, {"rating": 5.0, "review": "Nice", "verified": false, "helpfulness": "0/0", "author": "DELIA"}]