[{"rating": 5.0, "review": "Love this product so much.  Im sick of all the channels on cable I never use and this is the perfect solution.  If you are a prime member than using this is a no brainer.  Easy set up and easy to use.  Cutting the cable has never been better.", "verified": true, "helpfulness": "0/0", "author": "TIM TROTTER"}, {"rating": 5.0, "review": "Impressed with the Fire TV Stick. I mainly use my Apple TV to rent new videos and watch Netflix. This is a game changer.  I mainly bought it so that I could use the video watching benefits of my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Walter Basil"}, {"rating": 2.0, "review": "I like the interface okay, but the darn thing stops to buffer way to often. My Roku 2 box hardly ever has that problem. The same tv and wifi connection was used to check both. I DO really like the voice search with the smartphone app.", "verified": true, "helpfulness": "0/1", "author": "Donald F Rakes Jr"}, {"rating": 5.0, "review": "Everything I expected and more. Looking forward to trying out the gaming on it.", "verified": true, "helpfulness": "0/0", "author": "Bryan Chen"}, {"rating": 5.0, "review": "Best Christmas present ever bought for the hubby!", "verified": true, "helpfulness": "0/0", "author": "peggy carter"}, {"rating": 3.0, "review": "Allows to finally make use of my Prime membership benefits for movies and shows but I wish that it wSnt just a glorified rental app like Apple TV. No discounts and maybe one season is available for viewing. I mean, I get more bang for my buck with Netflix.", "verified": true, "helpfulness": "1/1", "author": "bcjofre"}, {"rating": 1.0, "review": "My wife gave me a Stick for Christmas. I can't connect it, even though my TV is flat screen, HD, and less than 7 years old. I had to give it to my son. I'm very disappointed!", "verified": false, "helpfulness": "2/6", "author": "P. Pratt"}, {"rating": 1.0, "review": "This device has been a nightmare. The first TV we tried it on it couldn't connect to our WIFI. We figured the signal wasn't strong enough. We moved it to a TV in the same room as our wireless router and it still would not connect. Tried a third TV and it finally connected. (This one was the same distance from the wireless router as the second TV, weird). Pulled up netflix just to try it out. Started playing something and within a minute the TV started screeching and the screen went white. After trying it on three TVs I decided this was not worth the money. I only paid $20 for it, but it was so bad I would prefer to have my $20 back. Forgot to mention before that the stick corrupted to HDMI capabilities on the second TV we used it on and now we can't get our normal TV channels in HD. So in reality it has ended up costing us more than just the $20.", "verified": true, "helpfulness": "1/4", "author": "Ashley M."}, {"rating": 4.0, "review": "Great alternative to traditional HTPC.  Definitely get full use with amazon prime (which is great on its own anyway).  Only issues I have is a few hiccups with WiFi comm, though that could also be partly due to my router, and an easier way to power cycle the device without having to fish for and unplug cords would be nice... built in sleep function is nice for saving power, but does not provide a full reset option.", "verified": true, "helpfulness": "0/0", "author": "Matthew Graeff"}, {"rating": 5.0, "review": "I gave the First TV Stick to my boyfriend for Christmas and absolutely love it.  I'll be honest, at first I had an idea of what it was and what it did but didn't 'get it' 100 percent.  But, I hooked it up in a matter of minutes, and had it figured out and working moments later.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Tracy Toccalino"}]