[{"rating": 3.0, "review": "I hate the remote and the search. The remote is too small and the round circle is impossible to navigate.The search screen takes forever when not a key board.", "verified": true, "helpfulness": "0/0", "author": "Betty G. Miller"}, {"rating": 5.0, "review": "Love the programs available and easy to operate", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Everything I want to try costs money, didn't realize that.", "verified": true, "helpfulness": "0/0", "author": "Lynda"}, {"rating": 5.0, "review": "love it!! No commercials.", "verified": true, "helpfulness": "0/0", "author": "YaYa130"}, {"rating": 5.0, "review": "Easy to install, and the quality is wonderful. Love the tutorial", "verified": true, "helpfulness": "0/0", "author": "D. Kutik \"simply the Best\""}, {"rating": 5.0, "review": "Love it better than cable....", "verified": true, "helpfulness": "0/0", "author": "Donald Reed"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "lbaehl"}, {"rating": 5.0, "review": "Great device, lots of use, love the remote (purchased one for my phone aswell), always streaming with this device. There are alot of others complaining about connectivity. Yes, this is a smart device, so you will need a fairly recent router, just like the rest of the streaming devices. Comparing a generic 3 year old dlink $50 router to my current asus $200 router, the fire stick will work with outdated equipment, but in this day there will be too much interference for 3 smartphones, 1 tablet, 2 desktops, and 1 laptop to work at the same time, firestick is a little more sensitive to poor network setups than others. Any router with ac will be able to handle this device.", "verified": true, "helpfulness": "0/0", "author": "Bazzeil"}, {"rating": 3.0, "review": "It worked well enough, but I was surprised and disappointed that the free HULU was not available for it, only the not free HULU PLUS.So to get HULU I needed to connect my laptop to the Television via an HDMI cable--a nuisance, and it takes up my last free HDMI slot.So I don't use the Fire TV Stick anymore..", "verified": true, "helpfulness": "0/0", "author": "Theda"}, {"rating": 5.0, "review": "Love my fire TV", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"mistut\""}]