[{"rating": 1.0, "review": "Really disappointed with this.  I plugged it in and tried connecting to my router but I can't get past the software update screen.  It keeps restarting the device.  I'm not sure if my product is defective or what...", "verified": true, "helpfulness": "0/0", "author": "Rani G."}, {"rating": 4.0, "review": "I bought this so that I could play Amazon Prime Video on the TV conveniently. It does the job there, 5 stars.However, -1 star, since a fire stick doesn't support cast (as in chromecast). With cast/chromecast, I (or a friend who is over, or me at a friend's house) can push anything on my phone to the TV. We use cast all the time for HBO, YouTube, Google Music, and Google Movies, I don't think fire stick supports any of those.Also, you can't control the volume from the fire stick, something I can do from Chromecast and Logitech revue (google TV). So you'll need to keep your TV remote handy. You also can't browse the entire prime music catalog from the fire stick, you have to use your computer to manually add tracks to your library...I would give this 5 stars if a future update added cast support to the fire stick (making this a Chromecast plus user interface for amazon prime video). And I would also like amazon prime video app on my phone to be able to cast movies to the fire stick, and to Chromecast. I.e. why do I have to stop the currently playing show, to use the TV ui to find the next show to play. For reference, a third party developer built PrimeCast, which enabled amazon videos to be castable to a Chromecast. It was quickly shut down, I'm guessing Amazon was not pleased, but it shows you that amazon video and casting is not a technical limitation, but an amazon policy. So much for earth's most friendly company.Conclusion:If I had to buy just one smart stick, it depends on the content that you will use on it. For me, I would buy the Chromecast. If you were going to buy two devices then I would get Chromecast and then a fire stick. The only people that I see buying this over the Chromecast, would be people that don't use YouTube, Google Movies, HBO Go, or Google Music. Or people that would prefer yet another remote. If the only things you used were Netflix and amazon prime video, then maybe this would be your better choice.", "verified": true, "helpfulness": "1/2", "author": "Peterpants \"Software Engineer\""}, {"rating": 4.0, "review": "Really enjoying this product. A little clunky but it's the first gen for goodness sake! Early adopters should get that there will be bugs and have the option to help Amazon improve it. It doesn't work? Return it for a replacement. Recommend.", "verified": true, "helpfulness": "0/0", "author": "A. Croop \"yankees girl\""}, {"rating": 5.0, "review": "I snagged this when amazon was having a $20 special. We have two of the Fire TV's which we bought for $84 each. This is basically the same thing if you don't care about storage. We just have these for Netflix, Prime, etc. Our kitchen TV doesn't have a cable drop, so this was perfect for me to watch Netflix, HBO, etc. while cooking. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "J. Elliott"}, {"rating": 1.0, "review": "Wifi is weak on this product... Right next to router (with the power adapter plugged in) and constantly looses connection.", "verified": true, "helpfulness": "7/8", "author": "Jason Torrence"}, {"rating": 5.0, "review": "Awesome!! Better than Chromecast, no need to have your tablet or phone. All Apps are loaded into the Fire Stick. No lag on Wi-Fi, love the many options available in terms of movie/tv apps. Easy set up and not necessary to use power adapter if your TV has a USB always powered.", "verified": true, "helpfulness": "0/0", "author": "Gnmorpheus"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/0", "author": "Diana F. Figueroa"}, {"rating": 5.0, "review": "Easy to install, easy to use.  Very fast!!  Love it!!", "verified": true, "helpfulness": "0/0", "author": "Linda C."}, {"rating": 5.0, "review": "Easy setup. Amazon account was already entered. Be careful if giving as a gift since it is shipped tied to your account.The stick loads menus and content quickly.  The user interface is easy to understand and navigate.  If you have Prime, it is a great purchase. The included remote is a nice size and has decent range. This was something I missed with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "John F."}, {"rating": 4.0, "review": "Just missing chromecast features...", "verified": true, "helpfulness": "0/0", "author": "Punam Salve"}]