[{"rating": 5.0, "review": "I works better than our smart tv...", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "DawnKOStrutter"}, {"rating": 1.0, "review": "The potential is great, the operation is not. After five weeks of multiple calls to Fire support and my cable/wifi provider, I was told my Fire TV Stick had to be 5 (Five) feet from my wifi modem.Now the Fire TV Screen always said I had a \" very good \"connection and my cable company could \"see\" it was operating... But no streaming, no YouTube, Hulu, or BBC ( the latter two freebies).", "verified": true, "helpfulness": "1/2", "author": "Film Fan Scot"}, {"rating": 4.0, "review": "Works great just slow if you download a lot of apps", "verified": true, "helpfulness": "0/0", "author": "Chuck Johnson"}, {"rating": 5.0, "review": "Does as it says and fast processing.", "verified": true, "helpfulness": "0/0", "author": "Khamvanh"}, {"rating": 5.0, "review": "This is my 2nd stick.  We love this so much that it causes arguments.  I am hoping a 2nd tv with this will help out.  I also love that I can take it with me while I travel. \"I received this item at a discounted rate in exchange for a review.  Regardless the opinions found herein are based on my experiences with this product.\"", "verified": true, "helpfulness": "0/0", "author": "Dez Mo"}, {"rating": 5.0, "review": "It takes the place of cable", "verified": true, "helpfulness": "0/0", "author": "Dorothywashington"}, {"rating": 5.0, "review": "Love it!  Would recommend it to anyone", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "This is awesome.  I thought long and hard about this purchase. But it didn't matter, I couldn't find any thing i disliked. It is super easy to install, linked right up. Sleep feature is convenient, but if you turn off the tv, it turns off. I would recommend this to anyone", "verified": true, "helpfulness": "0/1", "author": "Lacey \"Lacey\""}, {"rating": 5.0, "review": "I have both the fire stick and the fire TV and I love both. The fire stick is nice because we can take it with on vacation and use it in hotels easier.", "verified": true, "helpfulness": "0/0", "author": "Katie Martinez"}]