[{"rating": 4.0, "review": "works well; a bit fiddly to start", "verified": true, "helpfulness": "0/0", "author": "Diantha Naftali"}, {"rating": 3.0, "review": "Glad I got it cheap when it first came out. Everything works well but if you're not a prime member getting to other apps isn't front and center", "verified": true, "helpfulness": "0/0", "author": "RayRayS"}, {"rating": 5.0, "review": "It gets everything I want done. I would suggest if you want to play games on the device to buy the game controller with it. Some games only work with the controller.", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "Cancelled my TV subscription after I got this", "verified": true, "helpfulness": "0/0", "author": "Talal"}, {"rating": 5.0, "review": "Lots of options. Love it.", "verified": true, "helpfulness": "0/0", "author": "Laurie sanden"}, {"rating": 5.0, "review": "Very fast, very cool, very good", "verified": true, "helpfulness": "0/0", "author": "Valerio Cerron"}, {"rating": 4.0, "review": "Still new to me ,got it as a gift . It was good to watch a couple of movies . I'm not sure that my prime is on it . I don't see thousands of movies listed .", "verified": true, "helpfulness": "0/0", "author": "Melvin Weekley"}, {"rating": 4.0, "review": "This is easy to set up and I like it but I do have a problem with it losing the Internet connectivity often even though my internet connection comes up strong on my TV settings. I use the HDMI cable so the stick is not plugged directly into my TV so it's a better but not great.", "verified": true, "helpfulness": "0/0", "author": "madmit"}, {"rating": 5.0, "review": "The Amazon Fire stick out did my expectations of it by far. I love it. The commercials that are on tv about it only say a little of what the fire stick can do. It's so simple to use to! 5 star rating!!", "verified": false, "helpfulness": "0/0", "author": "Alyssa Lopez"}, {"rating": 5.0, "review": "I'm having a problem with it. The bedroom that I need it in is a room furthest from my router and it starts and works for a few minutes and then continually buffers and also not in HD", "verified": true, "helpfulness": "0/0", "author": "Peter Bulley"}]