[{"rating": 5.0, "review": "Wow! I ask myself,why do I need cable TV!", "verified": true, "helpfulness": "0/0", "author": "GARY CARTER"}, {"rating": 1.0, "review": "This device keeps dropping WiFi connectivity while using it. Looked at all the forums and there is no solution...waste of money. Seems it needs a firmware update but no solution as of yet.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 1.0, "review": "Horrible Wi-Fi.It refuses to connect to my 5GHz wireless, regardless of the channel, only connects on the 2.4GHz channels but has playback issues. My laptop streams HD content flawlessly in the same location, and even further away, so it's not a problem on my end.", "verified": true, "helpfulness": "0/0", "author": "Amber \"Amber\""}, {"rating": 5.0, "review": "Perfect I'll be buying more for my other tvs", "verified": true, "helpfulness": "0/0", "author": "tamika"}, {"rating": 5.0, "review": "Badass streaming device although it lags it still does its purpose", "verified": true, "helpfulness": "0/0", "author": "Edward Segura"}, {"rating": 5.0, "review": "Met all my expectations.  I am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "ann g"}, {"rating": 4.0, "review": "Easy setup and navigation. Great HD picture. Valuable enhancement to a Prime membership. Even if you don't have Prime Video it is worth it for Netflix alone.", "verified": true, "helpfulness": "0/0", "author": "Steve80020"}, {"rating": 2.0, "review": "While at first I thought it would be great. I connected my hulu and it constantly freezes so I have to exit and come back to my show. Netflix likes to freeze as well. I am disappointed but am hoping for updates that will fix these glitches", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Christine Hirsh"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome. I have a non-smart tv but this device basically made it a smart tv. Works great with my Internet speed.", "verified": true, "helpfulness": "0/0", "author": "Julio Bustos"}]