[{"rating": 5.0, "review": "What a wonderful, easy solution.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Saralin"}, {"rating": 5.0, "review": "Good buy and enjoy it!", "verified": true, "helpfulness": "0/0", "author": "Tonya Powell"}, {"rating": 5.0, "review": "I am very surprised at all the possibilities I have with this viewing option!!  Thanks Amazon for another great product", "verified": true, "helpfulness": "0/0", "author": "Sara Vriesen"}, {"rating": 5.0, "review": "We have had one for about 2-3 weeks.  It is a great product.  I was looking to lower my cable bill and this is a great alternative.  It does everything that I need.  My kids love this.  They are able to watch what they want to watch whenever they want.  That are some great apps that I loaded on for the kids.  Well worth the money.  I have cable internet so I have no problems with speed and there are no delays.", "verified": true, "helpfulness": "0/0", "author": "KL"}, {"rating": 5.0, "review": "gonna really look it over more this afternoon, but so far so good it works fine and now i dont need my iphone or tablet to watch tv", "verified": true, "helpfulness": "0/0", "author": "Oreomama"}, {"rating": 5.0, "review": "Switched from Roku stick because it stopped working. The fire stick performs as stated and Sling works with the fire stick unlike the Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Janice Bang"}, {"rating": 5.0, "review": "its great! better than I imagines!", "verified": true, "helpfulness": "0/0", "author": "Andres A Turcios"}, {"rating": 5.0, "review": "We absolutely love our new purchase in the Amazon world. Not having to get up to change what your watching is NICE! Taking effort in the middle of the night sucks.lol", "verified": true, "helpfulness": "0/0", "author": "karsch12"}, {"rating": 4.0, "review": "I have bought 3 of these now and gave one as a gift for my daughter that doesn't have cable. This is a great product if you are a prime member! My son loves the games and I love the many movies and TV shows you have access to.", "verified": true, "helpfulness": "0/0", "author": "sheri davis"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "suzieq"}]