[{"rating": 5.0, "review": "Just received my fire stick today.  loving it so much.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 3.0, "review": "Its okay. But the app store has too little apps to download", "verified": true, "helpfulness": "0/1", "author": "Reviewer101"}, {"rating": 1.0, "review": "This device can best be described as \"broken right from the get go\". Here is the reason why (this is just my personal experience and others may or may not have experienced the same):-Being a Prime member, Fire TV Stick was available for pre-order at a more-then-decent price of $29.94. I have been on a look out to purchase a streaming device for all my digital content and this didn't seem like a bad deal to try out. I put in my pre-order and I was immediately informed of the expected delivery date. The item arrived a couple of days early.Problem#1: The shipping box inside the delivery package was open already. Even though it was inside the plastic USPS envelop, the packaging looked rushed to me. Carelessness at Amazon's part.Problem#2: The original Amazon Fire TV stick box (that contains the Stick and rest of the contents) was shiny and glossy. However, it was scuffed on one side as if someone already tried to tear it open. Again, careless handling, but not a deal breaker \"so far\".Problem#3: Ignoring all the minor issues, I took out the stick, plugged it on to my TV's HDMI input and connected the power adapter to the wall socket. The Amazon splash screen came on immediately. At this point, I was prompted to connect to a wireless connection. It detected my home WiFi right away and after putting in the passkey, it showed \"connection successful\". The next thing it did was to check for updated software and it sat there for 15 mins before failing. The error message was \"cannot connect to Amazon services. Please check your internet connection or contact us for support...\".Problem#4: At this point, I did what any layman would do. Unplugged the stick, unplugged power adapter and plugged in again. Same problem.Problem#5: After jumping through these hoops couple more times, I decided to get help from support. Started a chat session with an agent and after learning about my problem, he told he needed to have someone from the tech support team call me. Received the call right away. The person on the phone sounded like a harassed kid with a weird accent. He could barely sound relevant and seemed to have little knowledge of how to troubleshoot this device (I am a software professional myself and know a thing or two about hardware as well). He asked me to powercycle the stick (see #4 above) which I did,except that this time he asked me to wait for atleast 2 mins before plugging the stick back in. This time, the set up process went a little further while the technician was still on the phone with me.Problem#6: The technician wanted to stay on the call while I made sure everything worked (appreciated!). After I finished the set up of my account, it played a Welcome video. After the video finished playing, it tried to load the \"home screen\" where it shows the list of movies and videos. Error! 'Unable to connect to amazon services. check your internet connection or try again later\". Told the same to the technician. He suggested to reboot my internet router and modem. I reluctantly did the same and the next moment, my internet stopped working. Did Fire TV stick break my internet? As per the technician, I should call my internet provider and he'll check back in a day or so.Problem#7: Disconnected the Amazon support call and called my internet service provider. After spending a couple of hours with different people, finally got my internet to work. Checked it by connecting all my devices (iPad, smartphones and two laptops). Everything checks out fine. Excited that things are working, plugged the stick back in to my TV, connected to my internet and viola, the home screen loaded successfully. Decided to do a search for a TV show I like but the search failed with the exact same error message as prior! I am streaming Live TV on my laptop as I write this review which means I have internet connectivity and there are no problems with it. However, the Fire TV stick is able to connect to my home connection for a few moments and then gets disconnected. It somehow can't stay connected and the only way I have had it connect so far is to power it off, power on again and connect to the network. That too for just a few moments.I am so disappointed in this product that I'm thinking of returning it back and getting a ROKU instead. At least, I'll have peace of mind and I'll get the services I was charged for.", "verified": true, "helpfulness": "2/4", "author": "MuqadderzKindle"}, {"rating": 5.0, "review": "I am enjoying my stick.  Even better that I got it at the promotional price.  I support Amazon products which is why I waited to buy this over that of the competition.  I am not disappointed.", "verified": true, "helpfulness": "0/0", "author": "Zenaida Mananquil"}, {"rating": 5.0, "review": "I was a little worried after reading some of the issues others had, but I haven't had any problems at all.  Followed the instructions verbatim.  It took a few minutes to download the latest update, and bingo! Worked like champ. I tried it with Netflix and Amazon Prime video so far.  Remote is easy to use and intuitive (took some effort to open the back to put the batteries in though).It's a winner!", "verified": true, "helpfulness": "0/0", "author": "J. Dauntless"}, {"rating": 5.0, "review": "Just got two sticks today! Very easy to set up and get started with. Very intuitive! I love how it is integrated into my Amazon account. Kind of creepy, like it reads my mind (at least tracks my searches). Instant hit, adding layers of entertainment to our cable less household! Looking forward to exploring more!", "verified": true, "helpfulness": "0/0", "author": "Erin Mounsey \"Erin of Christ\""}, {"rating": 1.0, "review": "I really hope I can up my star rating one day. But, today is not the day. I have Roku 2, Roku 3, and now the stick. I thought it would be nice to have something more portable than the Roku for when I travel. I just watched back to back 22 minute sitcoms, one on the Fire TV stick and one on my Roku 3. The Fire TV stick kept pausing. No indication of buffering or anything. I'd say it happened about 10 times through the episode. Then, just to make sure my internet wasn't being flaky, I watched another episode on my Roku 3. Not a single issue. Played right through. Because of this, I have to rate the stick a one. Hopefully the firmware will be updated to be a better performer in the future.", "verified": true, "helpfulness": "1/2", "author": "A Customer"}, {"rating": 2.0, "review": "Sorry I love amazon and I like most amazon products but this is a non starter.  I have the roku and its far faster. The display is ok not great and the same for the interface.  What really bugs me is no vudu. Vudu is the best quality service and if you create a streaming device without vudu its a huge minus.", "verified": true, "helpfulness": "1/3", "author": "The Ben Man"}, {"rating": 4.0, "review": "11/30/2014I've only had it a couple days, so I'll update this review if something changes.Pros:Responsive interfaceQuick setupPlex app works good for stream from my PCSupports cast to TV from YouTube app on smart phoneMany app choicesDecent free content with many appsVoice search from fire TV smart phone appBetter Netflix interface than my blurayCons:No live news appI am super happy with it and recommend it!Update: 12/2/2014today the device seems unstable. Once Netflix would not load, power cycled device. Then it worked well for an hour. then after a 30 minute break, starting a different show resulted in a pause/play endless loop where the show paused for half a second then played for half a second, repeat. :(the netflix loading issue could be device hardware, device OS, flaky internet/router, but I don't think you can blame the netflix pause/play loop on my internet connection. Seems more like a software bug. Maybe an OS update in the future will make it more stable.Update: 12/13/2014device still has great features, but stability is lacking. I hope a firmware update comes out soon to make it more stable. I do not like to have to power cycle it so often.", "verified": true, "helpfulness": "0/0", "author": "Paul \"Computer_Guy\""}, {"rating": 3.0, "review": "i was under the impression when I spoke with customer service that I would be able to cast to the stick from my iPhone just like I would with chromecast. Unfortunately this isn't the case and requires an android based companion app. I really wish they would support casting because it's built right in to many iOS apps like my Synology DS Video app.Maybe time will tell.I do like the built in apps and the performance.", "verified": true, "helpfulness": "1/1", "author": "Brian C."}]