[{"rating": 5.0, "review": "OMG! This thing is amazing. I have one Chromecast, but this one is way better....I love it and recommended it for all my family and friends!", "verified": true, "helpfulness": "0/0", "author": "JuliaGray"}, {"rating": 5.0, "review": "The best deal for tv", "verified": true, "helpfulness": "0/0", "author": "lulu50"}, {"rating": 5.0, "review": "Thanks Amazonwhat else can I say, now that my wife has the fire stick, I am beginning to feel less important.How could any stick be comparable to Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "1consumer2theother"}, {"rating": 5.0, "review": "Easy to install and easy to operate. Good choice of movies.", "verified": true, "helpfulness": "0/0", "author": "Francisco B Garcia"}, {"rating": 5.0, "review": "Work wonderfully", "verified": true, "helpfulness": "0/0", "author": "Kristin Tucker"}, {"rating": 3.0, "review": "I haven't used it yet I will when I get closer to the city and then I'll have a wifi connection but it probably works pretty good", "verified": true, "helpfulness": "0/0", "author": "William Kowalski"}, {"rating": 5.0, "review": "Works great for streaming.", "verified": true, "helpfulness": "0/0", "author": "Judy Fox"}, {"rating": 5.0, "review": "Good product for the price, I'm sure there are better devices.I got mine for $20 and it gets the job done.", "verified": true, "helpfulness": "0/0", "author": "Shah"}, {"rating": 3.0, "review": "You might be better off waiting for a revision of this product, Amazon got it right but this still needs some more power under the hood. I regularly have to wait for simple tasks to complete and it becomes irritating after a while, we have two of these and one regular Fire TV unit, I prefer the regular unit for it's \"snappiness\", the regular unit just seems to be a lot more responsive with intensive apps like Plex and Sling.You can't really power it off the USB from your television set either, the processor slows to a crawl when under powered and Amazon recommends the unit be plugged in directly to a power outlet when you try to power it via TV USB.Had I known that from the beginning I might have just stuck with the regular Fire TV units, the price lured me in and they function well, just not as well as I had really expected or needed. I am still a huge fan of Amazon's original electronics and I see great value in the quality build and power inside of most their products but this one fell short in the usefulness department for me.Let me know if I was able to help you. ;)", "verified": true, "helpfulness": "0/0", "author": "Mat C."}, {"rating": 5.0, "review": "Great stick... Saved lots of money !", "verified": true, "helpfulness": "0/0", "author": "Lucia"}]