[{"rating": 1.0, "review": "If I could get it to work, I might give it a higher rating.", "verified": true, "helpfulness": "1/1", "author": "melissa martin"}, {"rating": 5.0, "review": "i am beyond happy I got this!  We purchased before it was released at a nice discount and would gladly pay full price for because it's worth every penny. We have this in our bedroom & also have a Roku on our tv downstairs and like the Fire TV better.", "verified": true, "helpfulness": "1/1", "author": "Pamela S. Pearce"}, {"rating": 5.0, "review": "All I can say is, I love this product better than my apple TV and roku. With Amazon prime, I makes perfect sense to own this rather than any other product of its kind.", "verified": true, "helpfulness": "0/0", "author": "Dktom"}, {"rating": 5.0, "review": "great product! great price!", "verified": true, "helpfulness": "0/0", "author": "Mark Zajkowski"}, {"rating": 3.0, "review": "Lots of options to connect you to Amazon, but no web browser?  Seems like an odd omission.  I just ASSUMED there would be one.  If I had done proper research in advance, I wouldn't have bought this product.", "verified": true, "helpfulness": "1/1", "author": "P. Tuesley"}, {"rating": 5.0, "review": "Works great.  The picture is high definition.  The interface is easy.", "verified": true, "helpfulness": "0/0", "author": "F. Parsons"}, {"rating": 5.0, "review": "Works like a charm. Simple and effective.", "verified": true, "helpfulness": "0/0", "author": "Judith A. Anderson"}, {"rating": 5.0, "review": "I love this thing.  The only problem I've had with it was when the cache was full on the netflix app it wouldn't stream.  It took me a while to figure out that you must clear the cache every few months.  Other than that it works great!", "verified": true, "helpfulness": "1/1", "author": "Anthony Ferraro"}, {"rating": 5.0, "review": "MORE movies, No commercials, CUT my cable bill in half and got BETTER content because we opted to join Prime. Also... My older smart phone works GREAT as a second remote.", "verified": true, "helpfulness": "1/1", "author": "Garry Towns"}, {"rating": 5.0, "review": "love it !!!!", "verified": true, "helpfulness": "0/1", "author": "Lilly Ocasio"}]