[{"rating": 1.0, "review": "Disappointed. I purchased this primarily to watch Prime Videos. At the time I purchased this product the product  description clearly stated that 30-days free trial Amazon Prime Videos were included with purchase. Well, I  found out after purchasing that this is not the case. I contacted customer service and they assured me that they would fix my account so that I could access prime videos on my account as advertised. However, after waiting for more than a week to fully use the Fire TV stick, I contacted customer service again, only to be told that I would not be getting the prime trial after all. So after months of waiting for delivery, I will be unable to really use this product. I have listed a few product pros and cons below.Pros:**Easy set up- especially if you purchase from Amazon (it comes with your account information already  pre-loaded). Has an initial setup video that plays when you first plug in.**Small stick profile saves space**HDMI extender included (you will probably need it if your tv is wall mounted)**Nice picture and video quality.Cons:**No Amazon Prime Videos despite product details claims.**Remote back cover is difficult to remove in order to add batteries.**No setup/installation guide (I had to watch unboxing videos on YouTube  to make sure I was setting up and removing the remote battery cover correctly)**Doesn't really offer anything that you can't get elsewhere for less money.**NOT Portable, and the size is actually larger than chromecast and roku stick (it is visible . Also, since it requires power cord, it  is not portable or as visually pleasing as roku and chromecast).**Miracast/Screen Mirroring feature only works when home network is off. When I attempted to mirror my kindle to my tv using the stick it would not work while the home network/internet was on. Worked fine when I turned off the network/internet. Unfortunately, that meant that I could not mirror the silk browser from my kindle to my tv.**Stick requires home wi-fi network and does not have wired network capabilities.I got this when Amazon was running a promotion, so I only paid ~$20 for it.  But since it doesn't have all the features advertised, I am thinking about returning it. Without Amazon prime videos, I am not sure how useful it is. There are many other products out there that offer everything this stick has and then some (like roku, or even a blu-ray player). I am not sure it is worth $20, but I definitely would not pay $40 for it. At this point, my initial impression of this device is disappointment. I would not purchase again or recommend to a friend.", "verified": true, "helpfulness": "0/1", "author": "gr8tOne"}, {"rating": 5.0, "review": "I got my Fire Stick today three weeks early.  The install was very easy.  Everything is working great including the Closed Captioning.  I have it plugged into my receiver and the video is sent to my projector.", "verified": true, "helpfulness": "0/0", "author": "Raymond D. Gathright"}, {"rating": 3.0, "review": "When I watch Amazon instant video through the fire tv stick, they look like soap operas.When I watch through the built in app on my vizio tv, the videos look good.Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "L. Housley"}, {"rating": 3.0, "review": "Recommend reading the online instructions before operating the stick. Otherwise you may be surprised with unexpected charges.", "verified": true, "helpfulness": "0/0", "author": "Terry Roberts"}, {"rating": 5.0, "review": "Ivery had a Google Chromecast for about a year now... I liked it except I could not play videos from my Amazon Prime Account and I had to always use my phone as a remote... well, then this was released! Im really enjoying it! It was easy to set up, similar setup as the Chromecast.. My kids like the game features too. I do wish we could play videos from our Google play accounts. If there is a way I have not found it yet. The remoremote for this is somewhat small so make sure you put it up and not lose it!", "verified": true, "helpfulness": "0/0", "author": "Mal Green"}, {"rating": 5.0, "review": "So far I love this device.  Super fast and easy to use. I only had it for one week.", "verified": true, "helpfulness": "0/0", "author": "RHUCS"}, {"rating": 4.0, "review": "Love it... we didn't suffer from any set-up glitches, thank goodness, and haven't had any trouble with the stick finding our Wi-Fi. The interface is quite klutzy but it's not a deal breaker... would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Mayflyaway"}, {"rating": 5.0, "review": "Functioning very well so far for streaming and the introductory price is hard to beat.  Had to use an extension cord to get power to the stick given that the adapter and cord are on the short side for where my second TV is placed (high on a dresser unit).  Don't really have much of a comparison point given that I haven't tried the chromecast stick.  Seems just as fast as the streaming option on my LG HDTV.", "verified": true, "helpfulness": "0/0", "author": "Older Expert"}, {"rating": 1.0, "review": "Sorry, but this is a loser.  Specs looked interesting, but things load much slower, not faster, than Chromecast or Roku.  Constant freezeups in the same locations the other two systems streamed just fine. If they can fix it with firmware update, I'll give it another chance. If not, it's tossware.  I couldn't in good conscience sell this to someone else. It's $20 and a half-hour of testing I'll never get back.", "verified": true, "helpfulness": "0/0", "author": "Harry Miller"}, {"rating": 5.0, "review": "Great product and easy setup!", "verified": true, "helpfulness": "0/0", "author": "Juan G. Cruz"}]