[{"rating": 2.0, "review": "was not what i was looking for i could not,i repeat could not stream video from my laptop to my tv .So i saw not advantage of my cable service.", "verified": true, "helpfulness": "0/0", "author": "Glenn K."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Khrista D Villegas"}, {"rating": 5.0, "review": "Lots of great programs and movies.", "verified": true, "helpfulness": "0/0", "author": "William H Washburn"}, {"rating": 1.0, "review": "If you are deciding on the Fire Stick, forget it.There are much better choices out there.The software (app) is ridiculous, and you must use the supplied remote.I have spent years trying to rid myself of remote controls.If you don't have Prime it's pretty much useless and trying to navigate is unbelievably frustrating and time consuming.My Chromecast, along with  Hulu Plus, Netflix, Google TV &  Movies and Pandora is a much cheaper, smoother and pleasing experience.", "verified": true, "helpfulness": "1/1", "author": "T2i Owner"}, {"rating": 5.0, "review": "Easy to set up.  Easy to use.  Get one for every TV you have.", "verified": true, "helpfulness": "0/0", "author": "Kelvin Neely"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Mandie Scott"}, {"rating": 5.0, "review": "LOVE this! I bought this for my husband for Christmas when they had the $19 deal. The only thing that I regret is not buying more than one. The fire stick is better than chromecast. We have the chromecast in our living room and we have the fire stick in our bedroom. It was easy to setup and has so many options and more apps. We watch movies and our shows all the time with our fire stick instead of using our smart tv. So much faster and easier to work. We have yet to experience any delays or stalling during a movie like with our smart tv.I can't recommend this enough. Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindness"}, {"rating": 5.0, "review": "Great Product. Using it for around a month. Has been working very well", "verified": false, "helpfulness": "0/0", "author": "Venkatesh Ramamurthy"}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Laura Moore"}, {"rating": 4.0, "review": "It actually enabled me to watch my streaming videos", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]