[{"rating": 1.0, "review": "does not work!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "great device, i will recommend it", "verified": true, "helpfulness": "0/0", "author": "alberto leon"}, {"rating": 4.0, "review": "Faster and snappier than Chromecast. Nice to have the controller.", "verified": true, "helpfulness": "0/0", "author": "Vu Nguyen"}, {"rating": 5.0, "review": "It's every thing all in one it's great", "verified": true, "helpfulness": "0/0", "author": "Victor Saltzman"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Jason DAmico"}, {"rating": 1.0, "review": "Useless. I have 4 TV sets in the house. Where the USB connects to the stick, I have cable and video wires on every TV. In order to plug the stick in, a wire must be removed. So I figured that I would pack the stick and use it when I travel. Well, already stated in 3 hotels and we have the same problem. The engineering department that developed this should be ashamed of themselves. Stick is useless to me. Unacceptable, especially from Amazon.", "verified": false, "helpfulness": "1/4", "author": "Michael A Stanford"}, {"rating": 5.0, "review": "Amazing capabilities out of this small \"stick\" . Got it for my father in law and first thing he said was ' damn, technology is really moving up fast'", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 1.0, "review": "Bought two because they had great potential. However from the start they have constantly dropped the network which causes me to have to restart them and they are constantly needing to buffer when they don't drop the signal.  They also buffer when trying to play videos on my local network. I have many devices that connect to my network with no problems.  I even waited for an update which did little for the constant buffering.  I will be returning both as they do not fit my needs because they have troble even when not contending with internet congestion.", "verified": true, "helpfulness": "1/1", "author": "Tony B"}, {"rating": 5.0, "review": "Great, but need voice search.", "verified": true, "helpfulness": "0/0", "author": "bats"}, {"rating": 4.0, "review": "Very intuitive interface and very responsive. I have an apple TV and a Chromecast and while I still prefer Apple especially for my 5-year old, Fire TV stick is a solid second best. Much better than Chromecast and the gaming and apps features  may eventually make it even better than Apple TV but it is not really there yet. Still, the remote is great, even the included one since it doesn't require line of sight.", "verified": true, "helpfulness": "0/1", "author": "Jailoliv \"Jai\""}]