[{"rating": 5.0, "review": "Love it!  I have cut the cable cord and enjoy my TV time so much more now.", "verified": true, "helpfulness": "0/0", "author": "Rita Hayes"}, {"rating": 5.0, "review": "I love this little device. There are so many apps and videos that I'll be exploring it for a while. I've had it for just a couple of days now and look forward to using it as much as I can. Videos load a lot faster on this stick than on our PS3 which we were using for Prime and Hulu.", "verified": true, "helpfulness": "0/0", "author": "sketch201"}, {"rating": 5.0, "review": "I love this thing! It's easy to use and allows me to access Prime Music (and of course Prime movies and TV) in addition to the many other streaming options.", "verified": true, "helpfulness": "0/0", "author": "guatemama07 \"guatemama07\""}, {"rating": 4.0, "review": "Thought I would be able to get ant apps that were available through the app store. But works well with what is available at this time. Not sure if I will keep it as having a Smart TV we are able to get most of these already", "verified": true, "helpfulness": "0/0", "author": "Terry Wimberly"}, {"rating": 5.0, "review": "I absolutely LOVE my new Fire TV Stick! Has tons of movies, TV shows and games! Loads really quickly and easy to use! Installation took less than 5 minutes!  Would highly recommend to anyone and everyone!", "verified": true, "helpfulness": "0/0", "author": "Cindy U"}, {"rating": 5.0, "review": "What can I say that stupid tv commercial almost stopped me from getting this thing. But since I had prime already with some research found it was worth it to get it over chromecast. Money well spent.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 4.0, "review": "I have not had any connection problems and I live in a rural area.  Very easy to set up and install.  The only thing I do not like is most of the \"good\" shows you still have to pay for even on top of the $99 per year Prime membership.", "verified": true, "helpfulness": "0/0", "author": "carsie"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "PNL"}, {"rating": 5.0, "review": "Simply amazing and easy to use. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jessica Ann Puckett"}, {"rating": 5.0, "review": "I bought 2 of these when Amazon pre-released them. I added some apps to them and started watching many shows. I turned off my satellite TV because I don't need it anymore since I have the Fire TV Stick. I've used others like Google Chromecast, Raspberry Pi, and other Android boards but with the Fire TV Stick and remote, it gets the most use in our home. I highly recommend the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Brandon King"}]