[{"rating": 2.0, "review": "Amazon takes movies from years you would think would be part of prime. I am speaking of 40/50/60/70 movies and more and they give you a taste of movies to see and then want you to pay extra. I do not have this with Netflix so I will probably not renew even though I spend more than a $1000 a year in purchases with Amazon. #Don't Control Me Entertain The Desire To Keep Me As A Customer", "verified": true, "helpfulness": "1/1", "author": "Log Cabin Fever \"Log Cabin Fever\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 3.0, "review": "It's an okay device.  It's very nice that it's so small that you could take it with you when you go out of town.  Being able to access your prime account this way is fantastic.  I rarely used mine before getting the Fire Stick.My biggest complaint, and it really almost ruins the device for me is that when I pause a video, if there is any sound at that moment, it gets stuck like a CD skipping really fast.  I pause and unpause 10 times trying to find a moment where there is no audio, and then I often have to rewind 10-30 seconds to catch what I missed.  This happens while watching on Prime or Netflix; I haven't tried any other apps.Secondly, it often tells me that I don't have a fast enough internet connection to watch without stops for buffering.  This happens at moments where if I switched to the Apple TV, I do not have a problem, and at times where an app on my phone tells me that my internet is working at 50 Mbps.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Cooper"}, {"rating": 4.0, "review": "Works as expected but have only had it a couple of days. Remote is somewhat awkward for large fingers but will probably become easier over time. I use it for Netflix and Amazonprime and performance is good and using the 5ghz capabilities probably helps. Portability is a big feature especially if you travel or have multiple TVs that are not all smart TVs. I have recommended it to friends already.", "verified": true, "helpfulness": "0/0", "author": "Wayne P. \"golfMB\""}, {"rating": 4.0, "review": "If Comcast is your cable/internet provider, don't bother... none of the cable channels will work for you.", "verified": false, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Love my Amazon fire stick", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Great Device, I love it!", "verified": true, "helpfulness": "0/0", "author": "Showdown"}, {"rating": 5.0, "review": "I love this little gadget. The only problem I had was opening the back door to the remote to install the batteries. Worked on it for two weeks before it loosened up and opened.", "verified": true, "helpfulness": "0/0", "author": "Gabriela Brown"}, {"rating": 3.0, "review": "Need clearer categories of what's free. Not a trap to get people to buy or rent for $ accidentally.", "verified": true, "helpfulness": "2/2", "author": "mike from Michigan"}, {"rating": 4.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "David Tunink"}]