[{"rating": 5.0, "review": "Bought this as a gift. They could not use. I had received Smart Tv for X-mas. Found it very slow to respond. Was going to return Fire TV stick, but tried on my new smart TV. What a difference the Fire stick has made. Everything works much faster and easier now. So glad I tried it before returning.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's ok", "verified": true, "helpfulness": "0/1", "author": "Ghulam Abbas"}, {"rating": 1.0, "review": "A very frustating experience!  I bought my Fire TV Stick directly from Amazon and from day it did not work.  They gave a great deal of instructions and after a very long and troubled process, It finally started up.  Another big surprise!  I did not work right.  I have my Apple TV on the next room and it ran smoothly, but the Fire kept on stopping every five minutes or so!  Customer Support were nice, but at the end they just did not anything. They kept on asking me again and again to contact their Customer Service with the same story over and over!  I just gave up and lost my money!  Big thumbs down for Amazon...I know I am just a customer in the millions they have, so .....", "verified": true, "helpfulness": "0/0", "author": "Carlos Umana B"}, {"rating": 5.0, "review": "A lot things to do on it..Thank you", "verified": true, "helpfulness": "0/0", "author": "Regina M."}, {"rating": 5.0, "review": "Really enjoying the Fire stick.  I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Terri Wilson"}, {"rating": 4.0, "review": "It's nice and convenient. Easy to use as well. Only issue I have is if you leave it on too long it overheats and slows down and/or stutters.", "verified": true, "helpfulness": "2/2", "author": "Kevin H."}, {"rating": 4.0, "review": "Excellent device but needs HBOgo and other cable subscriber app like TWC app.", "verified": true, "helpfulness": "0/0", "author": "robert guzman"}, {"rating": 5.0, "review": "Very easy to use only took me a few minutes to understand how to work it.", "verified": true, "helpfulness": "0/0", "author": "Jackie Gruette \"Jackie Gruette\""}, {"rating": 2.0, "review": "The device is full of serious performance problems and clearly was not ready for release when they released it. It constantly drops a network connection, on a Wi-Fi network that has a strong signal and that serves 10 other devices none of which has any problem. When it's working, it's slow. But without a connection it does nothing at all; it's as functional as a leadless pencil.", "verified": true, "helpfulness": "0/0", "author": "Aaron Contorer"}, {"rating": 5.0, "review": "the best!!! love this so much. better than using a wii or an xbox", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]