[{"rating": 5.0, "review": "If you want a commercial free experience that is low price and select what you love only, well the fire stick is the right service for you, combine that with the amazon prime membership and you are set. There are free games, free movies, and songs, even tv shows. I used to have Direct TV and paid a ton for hundreds of channels I was not interested in at all. This was my solution to that horrible problem.", "verified": true, "helpfulness": "0/0", "author": "Cesar Rodriguez"}, {"rating": 5.0, "review": "The fire tv stick work great", "verified": true, "helpfulness": "0/0", "author": "Anthony Holmes"}, {"rating": 4.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Lillian Alicea"}, {"rating": 5.0, "review": "Only wish I had got this sooner! So far...I Love it!", "verified": true, "helpfulness": "0/0", "author": "Rushnay"}, {"rating": 5.0, "review": "Easy to set up. Works great.", "verified": true, "helpfulness": "0/0", "author": "Dr. Mike"}, {"rating": 5.0, "review": "I never Thought that there would be a product that comes so close to replacing cable or sat.", "verified": true, "helpfulness": "0/0", "author": "Wornout \"wornout\""}, {"rating": 2.0, "review": "It's OK.  Not great.  I prefer my Roku devices. Minus one star for not having Yahoo! Screen, minus another for having to search all over for \"apps\" that I don't use that often, and minus another star for a stick that has to be plugged in ALL the time because it requires more power than 95% of all HDMI outlets supply.  I also have an issue that whenever I play a Prime video, it stops 30 seconds in and then I have to press play, as it pauses itself.  I would choose another Roku 2 if I could make the choice again.", "verified": true, "helpfulness": "0/0", "author": "Steve Roth \"-Stevo\""}, {"rating": 4.0, "review": "Great product but sometimes has trouble with Netflix!", "verified": true, "helpfulness": "0/0", "author": "Schari"}, {"rating": 3.0, "review": "Before I purchased this item, I read the reviews and noticed people complaining about a lot of buffering when you're watching MLB TV through the stick.  They are right.  All the movies, TV shows and other items I view play fine.  But when I try to watch a game through MLB TV (I have a subscription) it pauses and buffers every 10-15 seconds.  Not a great way to watch a game.  Luckily, I also have Apple TV on the same internet connection and rarely get a buffer pause on that.  What's wrong with Fire Stick that this happens?  I'm obviously not the only one who has experienced this.  It is because it's a live broadcast and not a movie or TV show on your servers?  It's very frustrating and reflects poorly on your product.", "verified": true, "helpfulness": "0/0", "author": "Tucson Bob"}, {"rating": 4.0, "review": "works as advertised good price & almost as good as fire which I also use", "verified": true, "helpfulness": "0/0", "author": "george"}]