[{"rating": 5.0, "review": "I purchased a competitors model and it stopped working after an update.  I should have never doubted Fire TV Stick. My expectations have been exceeded by this item and my kiddo loves the games.", "verified": true, "helpfulness": "0/0", "author": "Michael Washington"}, {"rating": 5.0, "review": "Love the Amazon Fire Stick, except that our 4 year old  grandson is a little too handy with it and has ordered 4 movies.  The remote is now up on a very high shelf.  It is wonderful, but watch out for the users.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Annoyingly drops connection. Have to unplug and replug in the device.  ISP and router not the issue. Pending customer service review of issue. Updated to follow.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Gavazzo"}, {"rating": 4.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "mary Pierce"}, {"rating": 5.0, "review": "What can I say - I stream Netflix and Amazon Prime anytime I wish on our Workshop HDTV! Remote is simple, yet I find easy to understand with the on-screen menus.", "verified": true, "helpfulness": "0/0", "author": "Bayou Reader"}, {"rating": 5.0, "review": "Very easy. User friendly. Would buy again.", "verified": false, "helpfulness": "0/0", "author": "Nicole Day \"Nicolemaarie\""}, {"rating": 2.0, "review": "Not really that impressed..i have fast internet but this thing is constantly freezing and alot of times you have to pause it so a show can load how you would on YouTube.  Im going back to my roku.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Baroni"}, {"rating": 4.0, "review": "We have only had the fire stick for a week...so far so good...some buffering, but think we just need to up our internet speed.", "verified": true, "helpfulness": "0/0", "author": "Mary Wynne"}, {"rating": 1.0, "review": "Don't bother. Seemed nice at first, but buggy and Amazon support for this apparently ranks far below their dealing w/ non amazon products.  Advice is ... Don't bother.", "verified": true, "helpfulness": "0/0", "author": "blah"}, {"rating": 5.0, "review": "I had a chrome cast before, and the fire stock blows it out of the water.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]