[{"rating": 4.0, "review": "Let me be clear, I am a very avid Roku customer (I have 3 versions), and I found it lacking various apps (The Blaze TV, VUDU, etc) to be able to give this little device top marks,  (tech specs are pointless without features).I have been very impressed with how well it streams, and stays connected.  It's easy to navigate and setup was a breeze.It connects to an android app so you have a keyboard and voice control.  At this point, I'm going to throw it on a TV I don't use a lot, and won't buy another at this time.", "verified": true, "helpfulness": "0/0", "author": "GTWar"}, {"rating": 4.0, "review": "love the interface, very responsive to menu changes, move start and stop.  Love it to watch Amazon videos.", "verified": true, "helpfulness": "0/0", "author": "Chris OFlaherty"}, {"rating": 1.0, "review": "I bought this in hopes of having an easy way to stream Amazon Prime content. We have a few devices (TV, Xbox360, etc) that are capable, but they're all a bit slow and have a poor interface. Well, the Fire Stick makes them all look good. Everything about it was slow. It struggled to connect to our wifi, which no other devices have had an issue with. It even struggled to connect to the remote that came with it!", "verified": true, "helpfulness": "1/5", "author": "Ginormous K"}, {"rating": 4.0, "review": "Neat!", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 5.0, "review": "I preordered the fire stick.  Figured how could I go wrong for $20.  It arrived last weekend.  Set up was a breeze.  I'm ready to reduce my u-verse tv to the very basic level.", "verified": true, "helpfulness": "0/0", "author": "T Hart"}, {"rating": 5.0, "review": "We own 2 Apple TV's and the fire stick is a great (cheaper) alternative with a lot of the same features!", "verified": true, "helpfulness": "0/0", "author": "Karin F."}, {"rating": 1.0, "review": "Non stop connection issues. I bought two of these and regret it. I have a roku 3 and it is a million times better. I thought this would similar (and less expensive) but I have had nothing but trouble since I bought the fire sticks. Connection issues non stop (which were not an issue with the role that was in the same location before I bought the fire stick).In summary, very disappointed. Either pay extra for roku or stay away. Would not buy again or even recommend to others trying to save money on a lower priced product. This doesn't work well.", "verified": true, "helpfulness": "3/5", "author": "Devlin J. Cary"}, {"rating": 4.0, "review": "Nice UI, but the Wi-Fi is very buggy. I added the HDMI extension, very little improvement, moved it from the side connector to the back connector and it's better, but still loses connection often. I have tried my 802.11g network and 802.11a.c. network and both have problems but only on the fire stick.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "As an Amazon Prime member I purchased the Amazon Fire TV Stick for $19 when it was available for pre-order.  I figured for 19 bucks what the heck.  I have also owned the Google Chromecast which I bought for $25 when it was on sale.  Overall I would give the Chromecast 1 Star and I would give the Fire TV Stick 2 Stars.  Here is why...Both the Chromecast and Fire TV Stick have an awesome form factor, I love the idea of having my streaming apps on a small quiet low power device that I can be left ON all the time or has a fast enough boot time that its up and running fairly quickly after turning everything on (I have a Harmony One remote that controls all my entertainment devices).BUT...Controlling the Chromecast and the Fire TV Stick leaves something to be desired.  The Chromecast can only be controlled by an app which means I have to use my phone/tablet (which I find rather annoying).  Amazon did one better by giving the choice between an app or an included remote.  This is the primary reason I rated the Fire TV Stick 1 Star higher than the Chromecast.  Unfortunately neither device can be controlled by my Harmony remote which basically makes them useless to me (after living in a world with 1 remote for years I'm not willing to go back to multiple).Both devices use wireless as their primary network interface, I for one have far too many 2.4GHz devices in my house for these to get reliable signal.  It took me 10 failed software updates in my basement before I gave up and moved the Fire TV Stick upstairs to get it up and running (I can only guess interference with my wireless gaming headset).  I would rate these devices higher if they supported Ethernet over HDMI.My only other remark is that I would gladly overlook all the short comings of the Fire TV Stick if it fully supported HDMI CEC.  Each TV manufacturer has their own brand name for CEC (I have two Samsung TV's and they call it Anynet+) but in short full CEC support means you could control the Fire TV Stick with the standard TV remote (the remote commands are passed over HDMI to the connected device).  For me this would mean I could use my Harmony remote to control my TV which in turn would pass the remote commands to the Fire TV Stick.Maybe someday a company will create a device that supports all the features I want but perhaps that's just wishful thinking...", "verified": true, "helpfulness": "1/2", "author": "Josh Green"}, {"rating": 5.0, "review": "I have several Roku boxes, a Roku stick, and a Chromecast. The Fire TV stick is much better than the Roku. It's comparable to the Chromecast. We love that you can play the game apps from Amazon on it too. Now we just have to get the game controller!", "verified": true, "helpfulness": "0/0", "author": "AngelLeah"}]