[{"rating": 1.0, "review": "Plugged it in - not detected! Tried every HDMI port on my Samsung HDTV, used the supplied power cord, tried with/without HDMI extension cord.. but it is not being detected. I tried my friend's TV (sony) and it is not being detected. My chromecast stick works fine on both the HDMI ports. I am planning to send it back. I am disappointed with it as I waited for a long time to get it and there is no troubleshooting information anywhere on the amazon website.", "verified": true, "helpfulness": "1/1", "author": "Vagrant soul"}, {"rating": 4.0, "review": "This is a good buy easy set up plenty of shows. and games.", "verified": true, "helpfulness": "0/0", "author": "roger"}, {"rating": 4.0, "review": "easy to connect and worked great.", "verified": true, "helpfulness": "0/0", "author": "Love my Labs \"Cheryl\""}, {"rating": 1.0, "review": "I ordered this in October at the amazon prime special price. We received the package in November but upon setting it up, found the stick was faulty. I spent a long time on the phone with two separate technical service reps troubleshooting the item, which would not make a connection to the television. We tried every single thing (and we're quite techy).  Finally CS decided it was faulty and I was to send it back, which I did. They received it. In December I received a replacement refurbished **remote** only -- no actual Fire TV stick. (Which was the faulty item in the first place.) I then called customer service again and was on the phone for an hour while they tried to issue a replacement. Instead, they are having me order another one and promising a refund on one of them with delivery now at the end of JANUARY. (I originally ordered in October, when they offered the special.) I've now spent many hours on the phone on hold and with CS and also made two trips to the UPS store and ordered the item (as directed by customer service) TWICE and paid for it TWICE and I have yet to receive a new working FIre TV Stick set, and probably won't receive it until 3 months after my initial order and I suspect it won't be new, either -- just a refurbished one. I love amazon and order all the time - however this really seems to be ridiculous incompetence.", "verified": true, "helpfulness": "0/0", "author": "Pittsburgh Reader \"Pittsburgh Reader\""}, {"rating": 5.0, "review": "Really satisfy with the fire stick, operation is smooth. resolution is good.Only one problem from my friend. It can't connect to the wifi in hotel if the wifi need a web login.Hope amazon can improve it.", "verified": true, "helpfulness": "0/0", "author": "Bruce Chen"}, {"rating": 5.0, "review": "Love it. Works great with Netflix and amazon prime instant Video. I have chrome cast and a smart TV fire tv works best for me.", "verified": true, "helpfulness": "0/0", "author": "Ian Pratt"}, {"rating": 3.0, "review": "Its a nice device but I will not give it a higher rating until HBOGO is available on it.", "verified": false, "helpfulness": "1/1", "author": "Ryan"}, {"rating": 4.0, "review": "\"HDCP unauthorized. Content Disabled\" issues. In a Nutshell, it woked for one day.Update 12/11/14After a 30 minutes call with Amazon's support team, I was able to play video again. The issue was solve by resetting the router. I haven't found any other issue, so I updated my review.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is a great little device. Super fast response while scrolling through menu. Interface has very nice appearance. I am totally satisfied.", "verified": true, "helpfulness": "0/0", "author": "herodvii"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "connie scanlan"}]