[{"rating": 5.0, "review": "EXCELLENT!", "verified": true, "helpfulness": "0/0", "author": "Juanita"}, {"rating": 5.0, "review": "Love it! We mainly use it for Netflix and Spotify", "verified": true, "helpfulness": "0/0", "author": "Emily Gonzalez"}, {"rating": 4.0, "review": "Great, sometimes has trouble connecting to internet but usually ends up working.", "verified": true, "helpfulness": "0/0", "author": "Mike Latocha"}, {"rating": 4.0, "review": "will get better with time (apps) great wifi performance", "verified": true, "helpfulness": "0/0", "author": "Emmanuel munoz"}, {"rating": 5.0, "review": "Get lost AppleTV. Amazon Fire TV Stick is my new favorite.Yet again, Amazon has surpassed my expectations, and placed a smile on my face. The FIRE TV STICK is an excellent product. Allows me to customize my experience, and at a price you could never beat. Interaction and loading speeds are great, although some people say FIRE TV itself is much faster. My only suggestion is that Amazon clean up the interface a little bit better. It sometimes seems cluttered or disorganized. Otherwise, if you are even thinking about this product, DON'T HESITATE.Thank you yet again Amazon for completely surprising me.", "verified": true, "helpfulness": "1/1", "author": "C. Roberts"}, {"rating": 5.0, "review": "Dig it big time!!", "verified": true, "helpfulness": "0/0", "author": "Kris"}, {"rating": 5.0, "review": "fantastic piece of equipment.  ONLY WISH I PURCHASED IT, BEFORE PURCHASING MY SMART  TV.", "verified": true, "helpfulness": "0/0", "author": "A. Spencer \"ALPATTER\""}, {"rating": 4.0, "review": "I really like this. Very easy setup and simple to use. The remote feels like a 99 cent product but as long as you don't have \"Hulk\" like hands it works just fine. I may get the Fire TV box  for my main viewing TV since it has more memory and keep the Stick for my bedroom TV. Otherwise, this is good value for the money spent. Actually, I got my Stick for free when I singed up with \"Sling TV\".", "verified": true, "helpfulness": "1/1", "author": "consumersleuth24"}, {"rating": 4.0, "review": "I have the fire TV and I bought the stick fort sister. She is so happy with it. My only complaint is that you have to plus the stick into the electricity to make it work. When I bought it I thought it would just draw power from the TV itself. That's my only complaint", "verified": true, "helpfulness": "1/1", "author": "Richard Riess"}, {"rating": 4.0, "review": "So far so good. I like that it's so portable.", "verified": true, "helpfulness": "0/0", "author": "Tee"}]