[{"rating": 5.0, "review": "Works great. Easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Theresa Logan \"Happy Mamma\""}, {"rating": 5.0, "review": "I LOVE the Fire Stick. I have an three Apple TVs for my TVs and use them primarily for Netflix, HBO Now, Hulu, etc. I only bought the Fire Stick since it's only $39 and I already subscribe to Amazon Prime. WELL the Fire Stick is fantastic--very fast, wide selection, with well arranged content, especially for the price. Since it also has Netflix, Hulu, and HBO Now in addition to Amazon Prime, I rarely use Apple TV anymore.", "verified": true, "helpfulness": "0/0", "author": "Dreamspinner"}, {"rating": 3.0, "review": "I like how this product practically turns my tv into a smart tv I just dont loke how it needs to stay connected to an outlet and al though my tv has a usb port the device just turns on a resyarts over and over again over all tho I am satisfied", "verified": true, "helpfulness": "0/0", "author": "chdz3"}, {"rating": 5.0, "review": "Look my fire stick. Slim remote has chrome cast beat bad. Install apps and mirror images from your cell with a snap. Great way to make  any HDMI capable TV, a Smart TV. Wireless network is required", "verified": true, "helpfulness": "0/0", "author": "Sam Smith"}, {"rating": 5.0, "review": "Awesome service. I chose this over the others because it simply was the best value and had all of the programs relevant to my tastes.", "verified": true, "helpfulness": "0/0", "author": "Gypsy2222"}, {"rating": 1.0, "review": "The sale, shopping etc was great but I'm not real pleased with the product.", "verified": true, "helpfulness": "0/1", "author": "Karen Morgan"}, {"rating": 4.0, "review": "Best decision ever. Still figuring things out.", "verified": true, "helpfulness": "0/0", "author": "Tiffany wynn"}, {"rating": 1.0, "review": "I am pretty upset with this purchase. My television came with Netflix already installed on it and we stream through our Wii. Well, I wanted the HBO channels as well so we purchased the Fire Stick. It will not work properly. It keeps losing signal and has to constantly reload. I know it isn't my WiFi because my Netflix and Amazon Prime that is on my television still works.", "verified": true, "helpfulness": "1/1", "author": "melissa beavers"}, {"rating": 5.0, "review": "I have a smart TV but always felt the quality of the streaming for Netflix and AmazonPrime and as the TV in my bedroom, which is a bit older, maybe right when Samsung first introduced the smart TV, started really acting up I decided for 40 bux, the fire stick was worth a try.  I really love it.  I have cable as well of course and find that I end up spending more time using apps on the fire stick than i do on the cable i pay for monthly.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Conrad"}, {"rating": 1.0, "review": "The device worked well for a while, two months later it cannot connect to netflix at all. It refuses to do it. My other devices: ipad and cell phones and laptop do it flawlessly. This is just the worst product I ever bought. I would like  a full refund.", "verified": true, "helpfulness": "1/1", "author": "Dr. Luis San Andres"}]