[{"rating": 5.0, "review": "It actually works!", "verified": true, "helpfulness": "0/0", "author": "Don Blanchard"}, {"rating": 4.0, "review": "Pros : Plays most of my media through Plex, fast, good apps but could use more.Cons: Most of the stuff is Prime only which I knew going in, wish there was some for non-prime members or a more intuitive menu like Movies and TV for non-prime.  Wish Vudu was an App but I have most of my movies linked through the Flixster App.", "verified": true, "helpfulness": "1/1", "author": "Christopher Ancel"}, {"rating": 2.0, "review": "This thing works when it wants to. Very problematic.", "verified": true, "helpfulness": "0/0", "author": "Gadget Freak"}, {"rating": 5.0, "review": "This was a Christmas gift and I love it. A great product.", "verified": true, "helpfulness": "0/0", "author": "Annie S. Diggs"}, {"rating": 5.0, "review": "Purchased this on a whim when Amazon was having the prime member preorder pricing. Works well, with some minor complaints.I tried to use the USB port on my tv, but the fire tv stick said the port wasn't sufficient to power it. I have to use the included power adapter. Minor gripe.Also, for the first few days the fire stick glitches often loosing connection and dropping programs. Seems to be an issue more so with the non Amazon aps.Overall, great buy at the special price and at current price, especially if you already have Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Really a breeze to set up, connected to my WiFi fast and simple. I was impressed! Works great, lots of really cool programing!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device. Really made access to the shows much easier.", "verified": true, "helpfulness": "0/0", "author": "Michael Shelton"}, {"rating": 5.0, "review": "Just to much", "verified": true, "helpfulness": "0/0", "author": "theresa m powell"}, {"rating": 5.0, "review": "Does exactly what it says it does. Very satisfied", "verified": true, "helpfulness": "0/0", "author": "abby"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Pamela Mathis"}]