[{"rating": 4.0, "review": "Works way better than appleTV when it comes to buffering, starting, rewinding, etc.I do wish that they would make it so a universal remote would work with the unit.  And HBO GO doesnt work with XFINITY on this...but Apple TV does.", "verified": true, "helpfulness": "0/0", "author": "jazzyj"}, {"rating": 5.0, "review": "works great, user friendly, set up video on stick makes it a breeze", "verified": true, "helpfulness": "0/0", "author": "R. Walston"}, {"rating": 5.0, "review": "Works great. As good as my Apple TV.( which does not have amazon prime)", "verified": true, "helpfulness": "0/0", "author": "Thomas C. Gibbs"}, {"rating": 4.0, "review": "When watching prime movies, the movie stops streaming half way through. I had. To call amazon for help. The problem was solved but it is very annoying.", "verified": true, "helpfulness": "0/0", "author": "Gerald Laukus"}, {"rating": 4.0, "review": "Works great...  easy to navigate... works really well with the FireTV app.", "verified": true, "helpfulness": "0/0", "author": "Timothy Moore"}, {"rating": 5.0, "review": "Use it more than I thought I would! LOVE IT", "verified": true, "helpfulness": "0/0", "author": "Monet Salamon"}, {"rating": 5.0, "review": "I've had the WD box, the Roku Box and stick, and smart TVs.  So far - this little Fire Stick seems to be the most intuitive and user friendly.  I bought it for a bedroom TV that has no cable or antenna service and it has exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "jan simnacher"}, {"rating": 1.0, "review": "No. Still broken had to return it. Now I found out with this email that you sold me a refurbished item when I paid full price. Last time I buy it through Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dennis G."}, {"rating": 5.0, "review": "Love it! Works well, great selection of TV shows, movies, and apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rese29\""}, {"rating": 4.0, "review": "Can't get any NHL games on here they have everything but that other then that it's a great product just wished they had NHL or cbs sports", "verified": true, "helpfulness": "0/0", "author": "Mike mccormick"}]