[{"rating": 4.0, "review": "Good product. Sometimes has network issues , need to cycle power to have it connected to my WIFI again.", "verified": true, "helpfulness": "0/0", "author": "Arunb"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Robert Amidon"}, {"rating": 5.0, "review": "I love it!  I click 2 buttons and I am watching something I picked out!!", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "So far we love the choices we now have.", "verified": true, "helpfulness": "0/0", "author": "Laura Van Valkenburg"}, {"rating": 3.0, "review": "Very glitchy for me, which will hopefully be fixed done the line with updates.  Nice interface and great looking remote to have in living area.", "verified": true, "helpfulness": "0/0", "author": "Bryan Jacobs"}, {"rating": 1.0, "review": "I just got around to installing this after the holidays and other family commitments that took up most of January.  I have had nothing but issues.  My wireless router is fine, my bandwidth is fine.  We have no issues with any other devices that we have connected to our tv.  The video playback halts quite often and displays low bandwidth errors or disconnects from the wireless altogether.  I cannot even make it through 1 episode of a standard definition tv show.  Since I installed it mere days after the return window expired, Amazon would not allow me to return the device for a full refund or even store credit.  My only recourse was to allow them to troubleshoot the issues.  It seems to be working ever so slightly better, but I am still inundated with low bandwidth errors.  It is interesting that I can typically use several devices to access streaming content on a regular basis with no issues, but when this ONE device is the only one utilizing bandwidth, it cannot seem to find adequate bandwidth with which to function adequately.  It is my fault for not attempting to install this within the return window, but I am very disappointed that Amazon was unwilling to budge on their policy for the sake of a loyal customer and for good customer service.  This device will be finding its way into the nearest trash bin as soon as I am finished writing this review.  And I will not consider purchasing any other items manufactured by amazon and will stick with Apple.", "verified": true, "helpfulness": "0/0", "author": "dayzeegirrl"}, {"rating": 5.0, "review": "I have had my firestick for a couple of months now and find myself watching stuff on it nearly everyday.  It is easy to use and I have had absolutely no problems with it.", "verified": true, "helpfulness": "0/1", "author": "Sky \"sky_santangelo\""}, {"rating": 5.0, "review": "Best purchase! My boyfriend ordered one when it was on pre-sale not really knowing the capabilities. Once it came we were so stoked! We use it everyday.", "verified": false, "helpfulness": "0/0", "author": "Shontel C."}, {"rating": 5.0, "review": "i am not good at electronics,but this was not difficult to install, I am still finding new ways of keeping things in order,but that is great for me! HAPPY BUYER.", "verified": true, "helpfulness": "0/0", "author": "DANNY E. FIELDS"}, {"rating": 1.0, "review": "I purchased 2 of these at the $19 sale price and after 30 days of limited use - one has failed completely and the other has consistant WIFI connectivity issues.  I have tried factory resets, WIFI resets, and contacted customer service.  No replacement or refunds - save your money and buy a roku.", "verified": true, "helpfulness": "1/1", "author": "Michael"}]