[{"rating": 3.0, "review": "The first flaw is that it doesn't work with the USB port in the TV to power the unit, so you need to manage the long cable and connect it to a power outlet - which can be messy if you have a wall mounted TV. Second flaw is that the sound quality is very poor. I tried various settings but still the sound levels are very low on my SONY 720p LCD TV.", "verified": true, "helpfulness": "0/0", "author": "Harold Finch \"Lots2Doo\""}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Daniel Pinkstock"}, {"rating": 2.0, "review": "Upon additional use of the TV Stick, I occasionally have to re enter account data to access Netflex. This is very inconvenient.", "verified": true, "helpfulness": "0/0", "author": "scott h jordan"}, {"rating": 5.0, "review": "Easy set up. Loads of content. intuitive controls with built in tutorial.", "verified": true, "helpfulness": "0/0", "author": "Michael Southern"}, {"rating": 4.0, "review": "This is very easy to set up but spends a good bit of time buffering....except for the buffering, it's awesome", "verified": true, "helpfulness": "0/0", "author": "Ruby"}, {"rating": 3.0, "review": "Love that I can use my Netflix with thisEasy to use and set upLove that it give you more options then just plain old TVIt remembers where you left off atSo you can say I'm a happy camper", "verified": true, "helpfulness": "0/0", "author": "J. Foote \"JEWELZ\""}, {"rating": 2.0, "review": "The availability of the movies is not as stated. You have to enroll to amazon prime to have more access to them. You're also renting movies that you can get at a cheaper rate going to Redbox. Not a happy customer.", "verified": true, "helpfulness": "0/0", "author": "sulma1019"}, {"rating": 1.0, "review": "Getting the Twitch app was literally the reason I bought a FireTV Stick. As of 1/3/2015, the Twitch app is horrible! It doesn't even allow users to login with their Twitch account to view the (potentially less-popular) streams that they prefer. Users are stuck watching popular streams picked by someone else. Overall, FireTV Stick is nice, but I already had all the other app functionality on my TV before I bought the FireTV Stick. I had much higher hopes from Amazon. Unless/until Amazon significantly imrpoves their Twitch app, I'll consider my purchase as a big disappointment.", "verified": true, "helpfulness": "1/2", "author": "Doug M"}, {"rating": 5.0, "review": "Using it Now!!!", "verified": true, "helpfulness": "0/0", "author": "Greg Beck"}, {"rating": 4.0, "review": "Would be great if you guys would support vudu.", "verified": true, "helpfulness": "0/0", "author": "matthew langford"}]