[{"rating": 4.0, "review": "I really like this device.  I bought it to replace my outdated Roku since it was cheaper than the Roku Stick.  For some reason, the video lags much more than any other streaming device I have, including the outdated one.  Strangely enough, the audio doesn't lag but it takes a minute for the video to catch up to it.", "verified": true, "helpfulness": "0/0", "author": "Krash \"Krash\""}, {"rating": 5.0, "review": "I purchased this item over Google Chromecast for one simple reason.  It supports Amazon Prime and Google's stick doesn't.  It works well for what it is.  I do like the cell phone remote application.  It did take some research to realize that my TV's USB didn't provide enough power; had to use the enclosed power adapter.  That wasn't a big deal for me, but wanted others to be aware.The included remote is not infrared, which is nice because it doesn't have to have line of sight for it to work.  Big thumbs up for Amazon on that design.", "verified": true, "helpfulness": "0/0", "author": "David H."}, {"rating": 5.0, "review": "had problems with it at first but updates seemed to have cured them", "verified": true, "helpfulness": "0/0", "author": "Eric Quick"}, {"rating": 5.0, "review": "Easy and fun", "verified": true, "helpfulness": "0/0", "author": "Tina M. Bumgardner"}, {"rating": 4.0, "review": "It took me a while to fully understand the capabilities of the firetv stick, and I'm a pretty tech-savvy person. I have come to like it a lot...it has the same features as the more costly Roku system and also allows you to broadcast your phone screen via wifi mirroring. Overall, it's a pretty great product. However, if you have the extra money, go for a roku.", "verified": true, "helpfulness": "0/0", "author": "Just your average shopper"}, {"rating": 5.0, "review": "Easy to use. Wish I had tried this before renewing my cable package.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "its a slow process to uncable, fire helps the process.", "verified": true, "helpfulness": "0/0", "author": "carl"}, {"rating": 1.0, "review": "Randomly disconnects from the internet mid-show and also freezes up unexpectedly.  Would not purchase again and do not recommend", "verified": true, "helpfulness": "0/0", "author": "Matthew Russell"}, {"rating": 5.0, "review": "Great, works .", "verified": true, "helpfulness": "0/0", "author": "Sarah L. Beaverson \"Sarah\""}, {"rating": 5.0, "review": "The Fire TV Stick is exceeding my expectations.  It started off rocky, but once I moved my router to another room closer to the TV, everything started working fine.", "verified": true, "helpfulness": "0/0", "author": "Larry Emmel"}]