[{"rating": 5.0, "review": "I have both an Apple TV and an Amazon Fire Stick TV. I actually prefer the Fire Stick. It has more features and I prefer the remote control. It a good value as well, considering it costs less than half of what an Apple TV costs.", "verified": true, "helpfulness": "1/2", "author": "River Gal \"Linda\""}, {"rating": 5.0, "review": "Picked this up during (insert your own adjective) Prime Day. Had been using my iPad and the Amazon Video app to watch videos, but really wanted to be able to watch on my TV, without paying a whole lot. This little gadget exceeded my expectations - easy to connect, navigate, and super portable! Brought it with me on a recent trip out of town; within 5 minutes, I had it hooked up to the TV, connected to the hotel's WiFi, and the kids and I were having a movie night. I haven't downloaded the remote app as the included remote works fine for my purposes.", "verified": true, "helpfulness": "0/1", "author": "Z&O's Mom \"Kate L.\""}, {"rating": 5.0, "review": "My daughter bought the Amazon Fire TV Stick for me and it is great. I am enjoying it very much.", "verified": true, "helpfulness": "0/1", "author": "bama  fan"}, {"rating": 5.0, "review": "Excellent for watching Amazon Prime content on my TV.  We recently cut the cord and have been cable free, watching Prime offerings on our Kindles and cell phones.  This lets us watch the same content but on the big screen.  Has led to some binge watching and late nights.", "verified": true, "helpfulness": "1/2", "author": "Garrett"}, {"rating": 5.0, "review": "Love being able to stream!", "verified": true, "helpfulness": "0/1", "author": "Carol L. Elliott"}, {"rating": 5.0, "review": "I just keep watching movies and play video games.  I had no clue this stick would provide hours of entertainment.", "verified": true, "helpfulness": "0/1", "author": "shakira bradley"}, {"rating": 5.0, "review": "I am  very  happy  with  the  ease of  setup and  playing  with  movies and  shows.", "verified": true, "helpfulness": "0/1", "author": "Margaret Cobb"}, {"rating": 4.0, "review": "Make side loaded apps appear in \"my apps\" and I'll give it 5 stars.", "verified": true, "helpfulness": "0/1", "author": "James M. Green"}, {"rating": 5.0, "review": "Great device...especially for an HDTV with no apps. Plenty of choices available. Works great with the iphone app that works like an additional remote.", "verified": true, "helpfulness": "0/1", "author": "Barbh"}, {"rating": 5.0, "review": "Got it mainly for Netflix, works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Laura"}]