[{"rating": 2.0, "review": "more expensive to use that expected almost everthing has an extra charge to watch", "verified": true, "helpfulness": "0/0", "author": "del"}, {"rating": 1.0, "review": "Amazon is GREAT, but someone flubbed on this....big time. I wish I had bought this just so that I could have returned it; but no, it was a gift. In it's non-working mode, it locks up when you request to watch something...anything. In it's \"working\" mode, you get 5 minutes of video followed by 1 minute of \"Loading\". Literally....5 mins, 1 min, 5 mins, 1 min. Do the math: IF you're patient enough to sit through a 2 hr. movie, that movie stretches out to 2 hrs. 23 min. The extra 23 min. is just for load times. Oh, and the 1 min. load time is constant, but the 5 min. of video isn't. Sometimes it's as little as 2 mins. video, but never more than 5 min. Is it a hardware issue or a software issue? I don't know and I just don't get it; everything else that Amazon touches turns to gold....except for this thing.  OMG, I getting more than 10 min. of video now. I better shut up and quit while I'm ahead. Good luck in whatever you decide to do.", "verified": false, "helpfulness": "0/1", "author": "Robert F. McQueen Jr."}, {"rating": 1.0, "review": "We are very disappointed in the Amazon Fire Stick. We have had it for 2 months and it already stopped connecting to our WiFi. I was on the phone for over an hour, and talked to 6 different people about our problem. Some spoke good English and some you couldn't understand them at all. One guy even hung up on me. They all had me do the same thing to get my Amazon Fire Stick working again. But it's still not working and it seems like NO one wants to just send me a replacement. Rose V from customer service even call me at 11:33 pm when we were all in bed sleeping, to talk to me about it. Not cool.", "verified": true, "helpfulness": "0/0", "author": "Anthony Ingrassia"}, {"rating": 1.0, "review": "we have the fire TV box and love it, so we bought the stick for a bedroom.  The stick is terrible.  It loses wifi signal all the time and is super glitchy.  Just buy the fire TV box and skip the stick.", "verified": true, "helpfulness": "0/0", "author": "K S."}, {"rating": 1.0, "review": "It doesn't work that well and you either have to subscribed to the apps or buy the shows or movies.", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 4.0, "review": "Very good streaming stick. It isn't the best for your own media, but it works well for web streaming.Update May 12, 2015:I've owned this stick for several months now, and I am taking my rating from 5 down to 4. This stick is still great for Amazon or Netflix streaming, but several apps are very slow or suffer usability issues on it. Unfortunately, the only apps I can use to get to HBO are among these apps. It appears the OS update to 1.5 preceeded worsening sluggishness with these apps, so I would venture a guess that the operating system consumes more memory than it used to, and high-memory apps are struggling even more because of it.I have also discovered that 5GHz wireless networking only works with this device on channels without Dynamic Frequency Selection (DFS) which is a suboptimal setting for your router to have to be set to (my router warned me I shouldn't do it when I made the change) because it means it can't channel hop if you are experiencing congestion or interference on that specific channel. I have a rather high-end Netgear Nighthawk R7000 router, and setting it to allow the Fire Stick on the 5GHz network caused intermittent connection interruption issues with other devices. So I have to use 2.4GHz with this.*HBO Go has very sluggish menu response, and sometimes titles refuse to play on it.*Sling TV VOD content (HBO) similarly refuses to play sometimes (though the UI works snappily).*Tablo TV (over the air DVR) is unusable on it because menus are incredibly slow and video stutters frequentlyAll of that said, I think this is probably still quite a deal as far as streaming sticks go. The remote easy to use, and the main UI is clean and quick. I got mine when they were running the $19 promo, and it was totally worth it. At $39 it is reasonable. I also own a 2014 Roku 3 (outgoing version) which I use on my bedroom TV, and I am replacing this stick which I use on my living room TV with another Roku 3. I didn't compare the Fire Stick to the Roku because the prices are dramatically different, and the Roku 3 is probably a better match with the full blown Fire TV. I will be keeping this stick for use on other TVs or on trips.The reason I am replacing this with a Roku 3 is because I know the Roku 3 works well for HBO Go, Amazon, Netflix, and Tablo TV (which I have invested a fair bit of money into so I need it to work well with whatever main streaming device I have on my TV). I was torn between the full Fire TV and the Roku 3, but I haven't personally used the Fire TV so I went for a known versus an unknown. If you prepay for 3 months of Sling TV now, you can get a free Fire Stick or Roku Stick, or you can get a Fire TV or Roku 3 (2014 model) for $50 which is what I am doing to get my Roku 3.", "verified": true, "helpfulness": "0/0", "author": "freetolio \"freetolio\""}, {"rating": 5.0, "review": "Better than having cable", "verified": true, "helpfulness": "0/0", "author": "Pete Maggio"}, {"rating": 5.0, "review": "Great Purchase.  Loads of old movies and television programs.", "verified": true, "helpfulness": "0/0", "author": "Corey R."}, {"rating": 2.0, "review": "Too difficult for me to use and took too much time to load up (Netflix).I gave it away to a friend. ($40) cost.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 4.0, "review": "easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "John Gettys"}]