[{"rating": 5.0, "review": "This is an excellent piece of equipment", "verified": true, "helpfulness": "0/0", "author": "Melanie Sasseen"}, {"rating": 4.0, "review": "Absolutely love it. My only recommendation would  to have the list of movies in each queue listed alphabetical", "verified": true, "helpfulness": "0/0", "author": "stephen morgan"}, {"rating": 5.0, "review": "I am so happy with the fire stick so great and well worth the price", "verified": true, "helpfulness": "0/0", "author": "Jenny Paluzzi"}, {"rating": 5.0, "review": "This product is so awesome; I am in college and live on campus so my friends and I are always using netflix to watch movies but we have to crowd around one of our laptops. With this product I plug it right into my tv and we can watch stuff from amazon prime and netflix. I can also bring it home to use it too. I definitely recommend it to anyone! I have had the google chrome stick and think that the amazon one is way better!", "verified": true, "helpfulness": "0/0", "author": "bralph"}, {"rating": 5.0, "review": "Love it!  Less than 5 minutes to connect and install.  Easy to navigate and I'm able to watch movies or entire seasons of tv show on my own schedule ... commercial free!  Look forward to using all of the other available options as there is plenty of interesting and useful content to explore.", "verified": true, "helpfulness": "0/0", "author": "Blanco Bronco"}, {"rating": 5.0, "review": "I am very pleased with my Fire TV Stick.  It was so easy to install and start working.  Am looking forward to  watching all those videos and movies I can find.  I love the size of it.  It is so small and the remote is really really small.", "verified": true, "helpfulness": "0/0", "author": "Pat Achor"}, {"rating": 1.0, "review": "We thought we could use this to replace our Apple TV. However, the picture quality is terrible as nothing that comes with Prime Video streams with HD. They charge similar prices as Itunes for renting or buying in HD, so we'll pass and just keep using Itunes. Our Apple TV streams Netflix in higher quality. Disappointed.", "verified": true, "helpfulness": "1/2", "author": "Olivia M"}, {"rating": 5.0, "review": "Thanks to this device, my afternoons are no longer the same. While I used to arrive from work, get ready to work out and then come back to eat, now I arrive home, seat back, put some Breaking Bad episodes, eat and then eat more. Totally worth it! Couch-potato approved.", "verified": true, "helpfulness": "0/0", "author": "Andres"}, {"rating": 5.0, "review": "Love, love, love my fire sticks and fire t.v. box!!!! No more cable or satellite in our home and we don't miss a thing!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great technology that actually works as advertised.", "verified": true, "helpfulness": "0/0", "author": "The Infinity Group"}]