[{"rating": 5.0, "review": "Wonderful. It's fast, responsive, easy to use. Also was able to sideload quite a few apps including kodi. Does tend to run slighter hotter than warm, while connected to the tv.", "verified": true, "helpfulness": "0/0", "author": "nobokov"}, {"rating": 5.0, "review": "I love this thing. Great buy.", "verified": true, "helpfulness": "0/0", "author": "Arturo Martinez"}, {"rating": 4.0, "review": "When I first got this I was unaware that it required a power adapter. Slightly disappointed with this, but overall great product. There's even no buffering on my terrible college WiFi. If you're going to get something for streaming and don't care about price go with the fire TV because of the Ethernet capability, but if you are on a budget this will work great.", "verified": true, "helpfulness": "0/0", "author": "Ben Forman"}, {"rating": 5.0, "review": "Love everything about it. Easy to work.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Soto"}, {"rating": 5.0, "review": "Wifi works much better than chromecast.  Setup was very easy, it even enabled amazon prime video automatically.It doesn't even stick out the side of your TV like chromecast does.  I returned my Chromecast and am buyinganother fire tv stick!", "verified": true, "helpfulness": "0/0", "author": "Bruce Hill"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Minisuit stylus"}, {"rating": 3.0, "review": "Not that great. I don't buy or rent movies so it's ok for Netflix. It would be a lot better if the smartphone app actually worked but it doesn't. A lot of room for improvement with this one, only marginally better than my 4 year old smart bluray better. I received it as a premium for purchasing another item so for free I guess it's allright", "verified": true, "helpfulness": "0/0", "author": "Steven B."}, {"rating": 5.0, "review": "I absolutely love it.  It has replaced my Roku 2.  Could not be easier to set up and use and it incorporates flawlessly with Amazon Prime.I've used the aforementioned Roku, Apple TV, and now the Fire TV Stick.  The Fire is my favorite, hands down.", "verified": true, "helpfulness": "0/0", "author": "King Neptune \"Vagabond\""}, {"rating": 5.0, "review": "The Amazon Fire TV Stick was extremely easy to set up. It took maybe 5 minutes or less to set up.The movie, tv, games, and apps selections were great.I prefer a separate remote vs using a smartphone or tablet.", "verified": true, "helpfulness": "0/0", "author": "D. Mclean"}, {"rating": 1.0, "review": "It is terrible. I am amazed by all the good reviews. It doesn't stay connected. Haven't used it for more than 15 minutes in 2 months. I have had a roku for 3 years now and it is amazing so I was excited to try Amazon streaming device but I am highly dissapointed! One star is being generous!", "verified": true, "helpfulness": "1/2", "author": "Stephaine"}]