[{"rating": 3.0, "review": "Would be better if some of the apps worked with Time Warner Cable.", "verified": true, "helpfulness": "0/0", "author": "Jim Zelenko"}, {"rating": 5.0, "review": "I have a Fire TV and now I have 3 Fire TV sticks. The Sticks work great and I am adding one to every TV in the house. I even have one on order to go into my computer bag for when I travel. The only thing missing is the voice search and you can get that by buying the remote with that built in or using your smartphone as a remote.", "verified": true, "helpfulness": "0/0", "author": "mchipguru"}, {"rating": 5.0, "review": "Works really good! Tou can move it from tv to tv, just overall great product!!", "verified": true, "helpfulness": "0/1", "author": "vane"}, {"rating": 5.0, "review": "Awesome device, only thing missing is vudu for movies but seems to have every other streaming service I use.", "verified": true, "helpfulness": "0/1", "author": "Victor R. Noceda \"applegeek\""}, {"rating": 4.0, "review": "Very easy to install and setup.  Great picture and sound.  Prime Video and Prime Music are great. You need to have Prime to make full use of this, but it you just have Netflix and/or Hulu it’s still great. Just a few more apps until 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Loren B"}, {"rating": 5.0, "review": "I like it a lot and works well with you tube, no lagging, smooth stream. excellent product. I wish with a full web browser, among other great features so I can browse", "verified": true, "helpfulness": "0/0", "author": "Robel Roberto \"Robel747\""}, {"rating": 5.0, "review": "This did exactly what I needed it to do.  I was very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "gary e. davis"}, {"rating": 1.0, "review": "First it wouldn't connect to the internet. Then it refused to download software. Then it told me my email address wasn't valid. Now it says I do not have an Amazon account. I've done all the troubleshooting and it's STILL not working. Literally hours wasted. It's worthless.", "verified": true, "helpfulness": "1/2", "author": "mynci"}, {"rating": 4.0, "review": "I am pleased with the Fire stick since I am able to stream my Amazon music as well as to watch tv and movies.  It is nice to be able to download apps too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Il stick to rocu .these sticks are terrible with wifi. They stop movie way to much even next to modem .....ROKU way better ,, I got fire tv stick 1/2price at best buy taking it back today .", "verified": true, "helpfulness": "1/1", "author": "ari lovato"}]