[{"rating": 5.0, "review": "Movies are free", "verified": false, "helpfulness": "0/0", "author": "Adrian"}, {"rating": 4.0, "review": "So far the Fire stick is working great.  The only reason for 4 stars out of 5 is couple of times it either lost connect or stalled due to bandwidth issues.  Not sure if it’s the TV Stick or my internet service.  But right from the get go it loaded on fine already program with my account and user name.  The programing is great. I have a 5 year old LED non-Smart TV so the Amazon TV Stick gave me access to many of the internet programing options easily.", "verified": true, "helpfulness": "0/0", "author": "Michael Fisher"}, {"rating": 4.0, "review": "Easy! Love it! Much better than the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 4.0, "review": "It is really amazing what you can do with a tiny HDMI dongle such as this for only $40. I really resisted buying this for a really long time because of my affinity for stock Android. But when I saw what an unpolished product the Nexus Player and other Android TV devices turned out to be, I pulled the trigger.Boy am I glad I did. The interface is very slick and simple to navigate. The picture quality of streaming video services such as Netflix and Amazon Prime is exceptional. I have other streaming devices in my home and none of their video streams look as clear and sharp as the Fire Stick, and my fire stick is the furthest device from my router in my house.Cons: Quick and simple cons are that the remote does not support voice search, and the Fire Stick does not support bluetooth devices such as headphones or keyboards/mice. I had a small bluetooth keyboard/trackpad device that I wanted to use but the Fire stick does not support those functions. The more expensive Fire TV does support these functions though.Another con is no Chromecast support. Instead of including this, Amazon is foolishly pushing their own version of Chromecast technology. It would be nice if Amazon would stop playing these games and just include such simple and open source tech.The other major con hides a significant PRO. Luckily, you can side load apps, which is how I got Kodi media player installed. Unfortunately, side-loaded apps do not show up in the main app menu. In order to access the app, you need to either dive down through layers of settings menus to launch it, or hack in a shortcut by installing a \"dummy\" app from the app store and then reprogramming that app to launch Kodi instead.Besides these few cons, it is really hard to complain about the versatility and performance you get from this thing for only FOURTY BUCKS! It really is a steal and it has effectively replaced my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "reiththestud"}, {"rating": 5.0, "review": "I love it! It was so easy to install! It puts all of my favorite movies and videos on one portable device.", "verified": true, "helpfulness": "0/0", "author": "Stephanie DiSabato"}, {"rating": 1.0, "review": "Product has never worked properly.  All other wireless devices in my home receive good wifi signal strength and get internet connection just fine.  The fire tv stick cannot reliably connect.  I'm returning the stick.  No consumer should have to deal with the technical difficulties presented snd/or the many hours attempting to resolve the technical difficulties.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of the best purchases ever...exceeded my expectations...works like a charm!", "verified": true, "helpfulness": "0/0", "author": "j burns"}, {"rating": 5.0, "review": "Easy to use !", "verified": true, "helpfulness": "0/0", "author": "Chantelle Halim"}, {"rating": 1.0, "review": "yupp TV is not functioning  at well.When we call YUPP TV they said it is problem with your Amazon Fire TV stick.They suggested us to callAmazon .What is your phone nuimber for service?", "verified": true, "helpfulness": "0/0", "author": "ROY,COLE & SPERANZA, CPA'S"}, {"rating": 5.0, "review": "Fantastic.Easy to set up.Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]