[{"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Paul Struckhoff"}, {"rating": 2.0, "review": "You pay for the stick, then you pay for everything on it.", "verified": false, "helpfulness": "0/0", "author": "jeff march"}, {"rating": 5.0, "review": "I couldn't use it. I returned it.", "verified": true, "helpfulness": "0/0", "author": "Basil E. Lallos \"zeus\""}, {"rating": 5.0, "review": "Excellent device ever! So glad I got it! I love it and everything!", "verified": true, "helpfulness": "0/0", "author": "Hillary Ashmore"}, {"rating": 4.0, "review": "Does the trick. Disconnected from wifi once but other than that no issues. I just wish more stuff came free with Amazon Prime as far as movies and TV shows that's my main problem with it", "verified": true, "helpfulness": "0/0", "author": "R. Turner"}, {"rating": 5.0, "review": "Amazing array of shows and movies available through the Netflix and Huluplus apps. This purchase was a great choice.", "verified": false, "helpfulness": "0/0", "author": "Homedude47"}, {"rating": 5.0, "review": "I love it, works great!", "verified": true, "helpfulness": "0/0", "author": "April L."}, {"rating": 5.0, "review": "Great device!  My smart blue tooth just wasn't getting a regular signal so i gave this a try and it set up quickly and works great.  Enjoying Bosch, an Amazon tv series, that is included with the 30 day Prime trial you get with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I've been using the Fire Stick for a week now and I'm very happy with my purchase so far. Streaming Netflix and Amazon Instant is not as laggy as  I expected based on my initial Network settings issue. It took multiple attempts for my Network and Fire Stick to sync but after a Network RESET, it was easy to load my account. We can update the REVIEW after I have time to play the games and stream music.", "verified": true, "helpfulness": "0/0", "author": "Moloko13"}, {"rating": 5.0, "review": "Awesomeness! Works flawlessly so far...so easy to use and good price!", "verified": true, "helpfulness": "0/0", "author": "Mainemurf"}]