[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Real Buyer"}, {"rating": 5.0, "review": "Just what I was looking for. Set up is so simple and with Amazon Prime there is no monthly fees.", "verified": true, "helpfulness": "0/0", "author": "ocgregw"}, {"rating": 5.0, "review": "Excellent value. Very fast and works with USB plugged into television. I did not have to use power outlet as suggested in user manual. Not a gamer so I can't comment on gaming apps.", "verified": true, "helpfulness": "0/0", "author": "Glenn \"Glenn\""}, {"rating": 4.0, "review": "This a good middle between the chromecast and fire TV box/Nexus player. You get the streaming apps netflix, Hulu, Amazon prime video and casual gaming only bad side very hard to search as you need to input every letter manual and slowerer then casting.Great very casual gaming remember this a dual core so even tho you can play some video intense games they lag or freeze up, or having open them up again to play, Small games play smooth. Games are Limited at the moment that support just the remote.There is some lag from time to time flipping thru the OS.", "verified": true, "helpfulness": "0/0", "author": "Mariah Chavez"}, {"rating": 5.0, "review": "Awesome fast device!", "verified": true, "helpfulness": "0/0", "author": "cris"}, {"rating": 5.0, "review": "Excellent product if you have an amazon prime account.", "verified": true, "helpfulness": "0/0", "author": "Kyle Van Duzer"}, {"rating": 5.0, "review": "I am still learning how to use all of its features.  So far it is just mind blowing.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Jim T. \"tigger\""}, {"rating": 5.0, "review": "Easy to setup and works great!", "verified": true, "helpfulness": "0/0", "author": "Christopher Kowaleski"}, {"rating": 5.0, "review": "Plug and play.  Easy to operate. No issues at all!!", "verified": true, "helpfulness": "0/0", "author": "Brian McCoy"}, {"rating": 5.0, "review": "Great value and performance. Very impressed with Fire Stick & remote app for phone.I hope more content comes online sion, such as Google TV&Movies;, Disney Movies app, Slacker radio, Sirius XM.Buy one if you are Prime & Netflix users, fantastic interface.", "verified": true, "helpfulness": "0/0", "author": "Jamie Thomas"}]