[{"rating": 1.0, "review": "Not at all what I expected...a lot of \"hidden charges.\"", "verified": true, "helpfulness": "0/1", "author": "awesome"}, {"rating": 5.0, "review": "Love my firestick", "verified": true, "helpfulness": "0/0", "author": "Ravin"}, {"rating": 4.0, "review": "It disconnects from the internet more than I like.", "verified": true, "helpfulness": "0/0", "author": "Amy Towler"}, {"rating": 1.0, "review": "It doesn't work. Or It rarely works. It worked when we first got it, but frankly the performance of even streaming netfilx was so shoddy, that I was better off using the netflix app built into the TV than using this device. Meanwhile the apple running on the same wireless network, 3 feet away, runs just fine. A waste of my money.", "verified": true, "helpfulness": "0/0", "author": "AirborneLt \"justALittleGuy\""}, {"rating": 5.0, "review": "Just another great way to enjoy our family TV.", "verified": true, "helpfulness": "0/0", "author": "John D. Leach \"Collector and coupon King\""}, {"rating": 1.0, "review": "After three days since I received my fire stick, it still doesn't work. Three different phone calls for help and no one could help me get past the request for a password (not their fault. All tried their best) This was supposed to be an easy to install item. No instruction booklet, so if you're having problems, you're out of luck. Have high blood pressure, and had heart surgery this spring. Didn't need the aggravation. I'd return the item if I didn't  have to re box it and drive somewhere to mail it. Instead it's in the garbage where it belongs. Oh well, caveat emptor. While I'm at it, why is it so hard to leave a complaint about an order. I've wasted three or four hours on this issue. Cmon Amazon , you can do better. I'm a loooong time prime customer and hate to complain, but there it is. Easy to install? Not even close. Call me disappointed.", "verified": true, "helpfulness": "0/0", "author": "Donald L. Campbell Jr."}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/1", "author": "Osvaldo Garcia Jr. \"ogarciajr\""}, {"rating": 5.0, "review": "I got this to try to talk my grandma into getting rid of her cable but she wasn't for it. So I used if for a couple of months and loved it! I watch mainly netflix or amazon primes tv and it worked great! Then I got grandma a tv in the living room and showed her how to use it and wrote it down, and she learned and now you can't pry her away from it! This is a great TV stick for the price!", "verified": true, "helpfulness": "0/0", "author": "Melissa Montano"}, {"rating": 5.0, "review": "This is the second Fire Stick we have purchased .  Love them because they take up no space.", "verified": true, "helpfulness": "0/0", "author": "vicsuellyn"}, {"rating": 4.0, "review": "Met our expectations. Very fast and easy set up and operation.  The only reason I give it 4 stars is that there is occasional tracking. But I knew that might the case with the lower price option and it may be partly due to our Internet service. Bottom line, for the price you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "TnL Houston"}]