[{"rating": 1.0, "review": "I would have loved this product if my remote didn't die a few months after using it. The remote wasn't dropped and only used with normal conditions. Went to look for the replacement remote and of course they are not available right now. However, people have given the replacement remoter low ratings for it dying in a few months as well. Makes it challenging to even consider ordering a new one once they come in stock. I love amazon and use many of there products but very disappointed in this product and feel like my money was taken on this one.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its great", "verified": true, "helpfulness": "0/1", "author": "B.Brown"}, {"rating": 5.0, "review": "I have apple TV, Xbox one, Samsung Smart TV but still have to buy Firestick for one and only one purpose. That's for Kodi.Apple, Xbox or Samsung does not support Kodi, Amazon Firestick allowed me to install Kodi with Minimal help.Works really well for Kodi.Comparing to Apple Tv this is not the greatest clarity we get for other apps.", "verified": true, "helpfulness": "0/1", "author": "Prime + Movies Vs Netflix \"Winner is Prime\""}, {"rating": 5.0, "review": "Very nice and user friendly.", "verified": true, "helpfulness": "0/1", "author": "Jill Johnston"}, {"rating": 5.0, "review": "Absolutely love it.", "verified": true, "helpfulness": "0/1", "author": "SiMyer"}, {"rating": 5.0, "review": "I love my fire stick! Now I can watch movies and tv shows on my big tv instead of just on my Kindle or phone. Well worth the $40!", "verified": true, "helpfulness": "0/1", "author": "Lori A. Smithen \"Lori S.\""}, {"rating": 5.0, "review": "Great product. Easy to install and set up.", "verified": true, "helpfulness": "0/1", "author": "Terri Shaneyfelt"}, {"rating": 5.0, "review": "Love it! Easy to use & I love all of the apps that I can get.", "verified": true, "helpfulness": "0/1", "author": "80's Girl"}, {"rating": 5.0, "review": "Fantastic. Did need to use the extender. Great picture--very clear quality. No delays in the streaming (at least so far). Absolutely recommend.", "verified": true, "helpfulness": "0/1", "author": "Carol Jarboe \"TerJar\""}, {"rating": 4.0, "review": "Simple to use. Free stuff old news.", "verified": true, "helpfulness": "0/1", "author": "Humility"}]