[{"rating": 5.0, "review": "We love it. Very easy to use.  Grand kids find it easier to use than cable. You can easily move it from room to room.  Just ordered 2 more!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Lucky enough to purchase for $19 pre-sale Prime Members. Set-up was very easy: plugged it in the tv and connected the power cord. The fire stick was already pre-loaded with my amazon account and set-up for netflix and youtube was simple. The menu is good and easy to navigate, could use a little streamline work though. Being a dual-core system the stick does suffer from a little lag in the menus, but the faster systems (Roku3 and FireTVbox) are $100. When loading netflix it is still pretty quick for a dual-core. Streaming was good, 1080P signal and had no problems with WiFi signal. For the price this an outstanding media/internet streamer. For those of you that didn't get in on the $19 sale I see it in store at some electronics stores for only $25. For $25 and up to the retail price of $39 it's still the best streaming stick you can get.", "verified": true, "helpfulness": "0/0", "author": "Loki \"V\""}, {"rating": 4.0, "review": "Overall very happy I purchased this. Aside from some set up issues I'm happy with its ability. Would have given 5 stars if the set-up wouldn't have consisted of a 30+ minutes phone call with customer service trying to set it up.", "verified": true, "helpfulness": "0/0", "author": "Clara's Mama"}, {"rating": 5.0, "review": "Works great ! No slow streaming. Amazon just needs more and newer movies!", "verified": true, "helpfulness": "0/2", "author": "Grandma \"Aleida\""}, {"rating": 4.0, "review": "Things that I like :A. Great packagingB. Fast responseC. Fast Dual Network [2.4+5Ghz]D. HDMI Cable extenderE. Netflix 1080P And Amazon Prime 1080PF. Nice RemoteAnd Don't Like :A. Poor UiB. No Power ButtonC. Required external powerD. Few AppsE. Very disorganize Home Screen", "verified": true, "helpfulness": "0/0", "author": "Cyborg"}, {"rating": 5.0, "review": "Works perfectly.picture quality looks as good as my blue rays on my tv. No lag when switching between menus. Will order 2 more as gifts and one for when I travel", "verified": true, "helpfulness": "1/2", "author": "Ernie Quinones"}, {"rating": 5.0, "review": "Great to watch movies on the large screen instead of our Kindle.", "verified": true, "helpfulness": "1/2", "author": "rebecca"}, {"rating": 5.0, "review": "Love it! Miles above Chromecast, but not quite Apple TV", "verified": true, "helpfulness": "1/2", "author": "LowRain"}, {"rating": 3.0, "review": "Delivered to my mailbox on a Sunday, well ahead of both the date originally promised by Amazon, as well as the revised date. Setup was straightforward, less than 10 minutes from opening the box to selecting a WiFi connection, entering passphrase, and downloading/installing software updates. Having the tutorial play *before setup* would have been useful. Amazon online support is available at http://www.amazon.com/gp/help/customer/display.html/?ie=UTF8&nodeId;=201622650.When I got a Chromecast last year, I explored 1-month trials of Amazon Prime, Netflix, and Hulu (the latter lasted about 10 minutes, when I realized that Hulu TV was riddled with ads), and Redbox on demand (which was an even shorter trial when I found that it required Silverlight). Of the three, Amazon Prime content came closest to my interests, but watching it without an Amazon device was awkward.My media consumption is primarily PBS OTA broadcasts, Pandora, Google Play Music, YouTube, Comedy Central (which streams without ads!) and the occasional Red Box rental. I don't have a Playstation, X-Box, Roku, or smart TV.I can see no difference in broadcast quality, sound, or performance between the Chromecast and the Amazon Fire Stick with Xfinity providing a 30 Mbps download speed. Both devices run at about the same temperature, and each performs best with a dedicated USB power source and HDMI extender cable (included with both).There is a Fire TV remote app for Android devices (including tablets), but the user interface is bizarre, a blank gray screen that works more or less like the handheld remote: all action occurs on the TV screen, not on the tablet, so the lack of physical buttons makes using it a disorienting experience. As with a Chromecast, the Fire TV Stick and the Android device must be on the same Wi-Fi connection to interact with each other; that is, if you have a dual-band router, and the Fire TV is connected with the 5.0 gHz band, the Android device cannot find the Fire TV Stick if it is using the 2.4 gHz band. The sole benefit of the Android app is that it adds voice input, which is one way to avoid the awkward native search function.I don't think it's just a case of familiarity, but I find a Chromecast to be a far more useful device. Here are a few reasons:* Basic OperationChromecast: Start casting from any device and the Chromecast turn on the TV, automatically selecting the appropriate HDMI port. I didn't realize how convenient this was until the Fire TV stick arrived. Remote, what remote? Whatever I have am using at the moment is my remote.Fire TV Stick: Some reviewers have commented that type size for on-screen program information is too small; on a 40\" TV program descriptions are barely readable at 10 feet; a 48\" or larger TV is required for easy reading.* Movies & TVChromecast: Streaming Amazon Prime Instant Video content requires tabcasting, which turns a laptop into a lap heater. It's not the most efficient approach.Fire TV Stick: Streaming Amazon Prime Instant Video content is a pleasure. Since we never had more than basic cable, there are a host of series that I have never seen (6 Feet Under, The Sopranos, etc.,) plus Amazon TV offerings, and about the same selection of movies I would get from Redbox. My use of Redbox DVD rentals is probably mostly in the past, especially since Redbox is raising prices in December.* MusicChromecast: Everything I own, including MP3s digitized from LPs is in Google Play Music. For what I don't own, Pandora continually surprises and delights with unexpected content, as well as extended \"liner notes\" about performers and performances.Fire TV Stick: Except for CDs picked up at live performances, virtually all my recent music purchases have been MP3s and CDs purchased from Amazon, so they are accessible. On the other hand, they are all in Google Play Music, which has a much richer user interface. The Pandora app is similar to the Android version, but is not as easy to use with the remote.* Apps & GamesChromecast: I'm not a gamer. The list of Chromecast-enabled apps is now in excess of 1000.Fire TV Stick: Very few, none of personal interest. If Amazon can attract developers this may change, but for now, Amazon apps for the Fire TV Stick are far, far behind the competition.* YouTube/Tabcasting Local ContentChromecast: EffortlessFire TV Stick: Fuhgeddaboudit from a laptop. A Kindle Fire HDX is required.For my media habits, in every area other than Prime Instant Video content, the Chromecast wins hands down. If I subscribed to Hulu or Netflix I might feel differently. If I had an Amazon Fire HDX tablet (which can fling content to the screen), I might feel differently.In my brief experience, the Amazon Fire TV Stick was easy to set up and performs as well as, but no better than a Chromecast, but is harder to use due to the remote and user interface, and has more limited functionality.Bottom line for me: At $20, the Amazon Fire TV Stick was well worth the price of admission just to be able to watch Prime Instant Video content easily, and in this way it complements, rather than competes with a Chromecast. At the full retail price of $40, it's a harder sell, especially compared with the Roku stick, which offers more content.----------------------------Update, December 17: After three weeks of uneventful performance, tonight the Fire TV Stick froze up while watching a NetFlix movie; the stick wasn't unduly warm, but the TV just kept displaying a rotating arrow while it attempted to reload. The remote was useless, and could not be used to control the stick. After unplugging and powering down the stick. I switched to the Chromecast, and watched the rest of the film without interruption. From now on, the Fire TV Stick will be used for Amazon Prime, and nothing else. I hope it is more reliable with Amazon content.Update, April 17: I don't know when the software update was done, but pressing and holding the Home button now brings up a 3-button menu in which Sleep is the default choice. As previously, if it's asleep, pressing the Home button turns on the TV. Huge usability improvement. In addition, passwords are now displayed as they are typed, rather than each character disappearing after a brief delay. This makes it far easier to enter a long, complex, mixed-case, alphanumeric password — something that was nearly impossible when the Fire TV Stick was first released.", "verified": true, "helpfulness": "845/930", "author": "Selden Deemer"}, {"rating": 4.0, "review": "So far it works better than ROKU or Chromecast just because you have some more possibilities in how you operate it. only things that I'm missing so far are a LAN port, audio out (can be done with a HDMI-audio splitter) and IR control to make it work with my universal remote.", "verified": true, "helpfulness": "0/0", "author": "An Honest Engineer"}]