[{"rating": 4.0, "review": "Liked my fire tv stick,!, watched moves works great!", "verified": true, "helpfulness": "0/0", "author": "Misty Brown"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Thomas Patrone"}, {"rating": 1.0, "review": "My wife and I have had nothing but problems with the Fire TV Stick since we got it right before Christmas.  We purchased the stick to watch streaming services on our non-internet connected TV, so we were expecting a seamless streaming device...as promised by Amazon.  Since December, the device has stopped working twice (once I can't explain, the other quite possibly was because the AmazonBasics batteries died 2 weeks after installation), has repeatedly reset my log-in information, and freezes between 5-15 times per program while watching Hulu or Netflix.  I've followed the troubleshooting guide laid out by Amazon and nothing seems to make the device function any better.  Before you assume that the problem is with my internet, I have connected my AppleTV, Chromecast, and XboxOne to the TV in the exact same spot in my living room, and all three of those streaming devices performed well without any interruptions.  I'm hoping that there will be a firmware update soon that will solve these problems, but until then, I'm extremely disappointed with the quality of this product that has been highly touted by Amazon.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "I love it, watch several good prime movies", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 2.0, "review": "Requires repeated resetting to keep internet connection. Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Chris Carroll"}, {"rating": 5.0, "review": "Liking the extra choices.", "verified": true, "helpfulness": "0/0", "author": "Beckie"}, {"rating": 5.0, "review": "Got three for Christmas, two for us and one for one of the kids (got them aPrime account also).  We had to get a new router cause old one was screwing up so we got Netgear 900 router which turned out to be fine, but even the dual band wasn't strong enough to get a good signal to our end of house.  So that meant a WiFi extender, again Netgear 1200.  With that set up the signal was just fine and we were in busiess!!The fire stick is an excellent product!  Easy to use and understand and fun if your signal is strong, but it sucks if it is always buffering or telling you to watch at a later time.  But with enough signal everything is smooth!  About the only complaint is that one has to wait, sometimes a long time, before it is free with prime!  Otherwise, lots of viewing!  Rate it at five cause I like up and coming new directors and there are a lot of them!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like it but I like my Apple TV more sorry if I could listen to my Audible stories on the fire tv I would be more then happy :)", "verified": true, "helpfulness": "0/0", "author": "Johnna-rae"}, {"rating": 5.0, "review": "We were VERY impressed with the Fire TV Stick, after a couple days we ordered another!!!!", "verified": true, "helpfulness": "0/0", "author": "Patsy Ann"}, {"rating": 5.0, "review": "Amazon stays for amazing", "verified": true, "helpfulness": "0/0", "author": "theron"}]