[{"rating": 5.0, "review": "Absolutely the best!!!  I love it!!!", "verified": true, "helpfulness": "2/2", "author": "dorothy Dwyer"}, {"rating": 1.0, "review": "Useless for travelers or anyone wishing to utilize outside of the U.S.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"myworld1013\""}, {"rating": 1.0, "review": "Advertised with Showtime Anytime, but many cable providers don't allow access through the Fire app for some reason. Good luck getting your other devices to stream to your TV through this. To top it off, it automatically signs me out of Netflix every few days so my kids can't even consistently use it for that. The Fire TV Stick was a neat idea, but in practice is basically a $40 YouTube streamer.", "verified": true, "helpfulness": "1/2", "author": "Samuel Joy"}, {"rating": 4.0, "review": "No HBO GO", "verified": true, "helpfulness": "0/0", "author": "Jose Gomez"}, {"rating": 1.0, "review": "The interface is not as user friendly as Apple TV.  For instance, when you go to Youtube the \"search\" option is at the bottom and takes forever to reach.  \"Search\" should be the first option!  After you get into \"search\" it's a daunting task to input anything.  And, god forbid you miss a letter.  You have to clear the ENTIRE THING!  It's ridiculous!  I downloaded the touch-screen app on my iPhone, but it won't allow me type anything in, which is the whole point of the touch-screen app.  It might be a decent product if they work out these bugs, but until then don't buy it!", "verified": true, "helpfulness": "2/3", "author": "Dwight Fontenot"}, {"rating": 5.0, "review": "Awesome product. Besides no Airplay capabilities I now like this better than my Apple TV.  There is an ap for Airplay but it can be unreliable esp for video. Happy with my purchase plan on buying another", "verified": true, "helpfulness": "1/2", "author": "Kenneth B."}, {"rating": 4.0, "review": "Nice.  I just need to get used to using it.  I'm sure there are more uses and features than I know about, but I will enjoy using it.", "verified": true, "helpfulness": "0/0", "author": "Sandy Widger"}, {"rating": 5.0, "review": "I am so excited to use this more and become more familiar with it.  It was easy enough to set up - even for me, and I don't do a whole lot of streaming of anything. This will hopefully allow us to enjoy more of the amazing benefits of AmazonPrime.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is what I can share - I gave it to an older parent who didn't need me to set it up and configure & called to tell me she loves it! She even ordered Prime service on her own. I thought I was going to have to set it up the next time I visited and was very happy to find out otherwise. Made a great gift!", "verified": true, "helpfulness": "2/2", "author": "The Texas Turtle Girl \"TexaCali\""}, {"rating": 4.0, "review": "Must for Prime members.  Does not work with Apple iPhones, iPads, or Mac laptops and desktops.  For that you need Apple TV, which I also own.  I love Apple TV the most since I am in that realm of devices.  Fire stick has some nice extras though.  Voice controlled app for iPhone is very innovative and works much better than expected.  It also has games.  It is unclear how many games and apps can be downloaded and if that affects speed.  Another flaw is if you are watching a series and step away accidentally it is hard to get back where you were. Note not all games work on stick, so pay attention when buying.  Should limit based on device.  It has different apps than Apple TV and not as many.  Some better, some worse and the majors are all the same.  Big negative is they are putting up paywalls for a lot of apps and shows.  This is the biggest negative.  They need to get content owners in line to stop this nonsense.  They already have so many lucrative sources of income and now want to bleed us more.  One other Big thing is the device is not what the picture shows, just plugging a stick into the HDMI doesn't work. You have to plug into sidof the firestick a big USB cable and plug into TV USB or preferred USB base that plugs into wall.  This misled me.  I plugged to TV to hide, but it keeps annoying me with message that it is not connected right.  Supposedly it can't update software unless using preferred base.  In ads, they show someone fully hooking up with everything and no cut away scenes.  It takes longer to hook up than shown and adjusting antenna frustrating too.This said, overall I still like it, but like Apple TV better.", "verified": true, "helpfulness": "1/2", "author": "G. Hale"}]