[{"rating": 5.0, "review": "The Fire TV stick is an amazing product the functionality delivered as promised.", "verified": true, "helpfulness": "0/1", "author": "Brian J. Bean"}, {"rating": 2.0, "review": "Features were pretty good but the RF only remote meant I could not use my Logitech Harmony remote with it. It didn't matter anyway as the unit died less than 24 hours after I plugged it in. The video just flashes on over and over so you cannot watch it now. Prior to that it still had issues. It crashed so bad after a few hours that I had to cycle power on it. For $20 it is pretty amazing but only if it keeps working for a while.", "verified": true, "helpfulness": "1/1", "author": "T. Knettel"}, {"rating": 1.0, "review": "Let me preface this by saying that I've always been a fan of Amazon and their service.  Unfortunately, I had the same issues that many seem to have encountered.  The WiFi connectivity is spotty, at best.  Here's my experience:1. Went to Best Buy and bought it for $25 because I didn't want to wait the 1+ month Amazon was showing I'd wait for it to arrive.2. Got home, plugged it in, got the prompts for connecting to a network, but for some reason couldn't connect to my network telling me that it couldn't reach Amazon.com. Note that, while having to enter my network password about 20 times due to the systems inability to connect, the remote has some glitch that was causing it to randomly move across the characters as if I was holding down the left/right/up/down portions of the remote.  This was very frustrating, to say the least.3. Went to the support page and it mentioned resetting via the remote and/or unplugging.  Tried both.4. Finally got connected to my network and it prompted to download an update, which I started.5. About 2 minutes into the update download, it tells me that it's lost connectivity, so I try to connect again and no go.  Tried resetting again, Googling for a fix and still no go.6. Called Amazon support and she indicated it may be defective and to go back to Best Buy to get an exchange.7. Went back to Best Buy and did the exchange.8. Came back home and, guess what, same exact thing.  Even the bug with the remote.9. Called Amazon support and she indicated that sometimes registering the serial number resolves the download issue, so she registered my serial number.10. While still on the line with Amazon, tried connecting and was successful.  Was prompted for downloading the update and it started.  Seemed to be downloading without issue, so I let the Amazon support go.11. 6+ hours later, the update was finally finished downloading and applied.  This process started around 6pm and finished around midnight.12. Now I thought I was in business, except the tiles were taking forever to show and it was pretty much unusable.  At this point, I was tired and went to bed.13. Next day I called Amazon back and was transferred to a second level of support that seemed much more knowledgeable.  Explained to him all the things I went through the previous day. He suggested that, instead of plugging the unit directly into the HDMI port on my TV, try using the dongle to connect it.  Sure enough, that seemed to do the trick so we finished the call.14. Over the next day, I still noticed that my router was showing it only connecting between 5 & 11 mbps, sometimes down to 1 or 2 mbps.  Other devices were having no issues connecting at 50 mbps.  Also, things just weren't very consistent.  The device cut out alot, having to buffer and what not.  So, I moved the router so it is directly in the line of sight of the unit and that seemed to help.  Now it seems to be connecting around 26 mbps, but still there's this spotiness to it's ability to stream anything.  Sometimes, I give up and go back to the PS3 for a smooth experience.Earlier this week I got the one I ordered from Amazon. I decided to return it today, unopened, due to a very frustrating attempt to watch the PBS News Hour this evening.  And it wasn't just PBS.  I could go into Netflix or any Amazon prime movie and same thing, cuts out frequently.  So, I've finally given up on this product.  I'll keep the one from Best Buy for novelty and, who knows, someday maybe it'll be worth something like an Atari E.T. video game cartridge.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to install. Worked well for videos, apps, etc. Usability of the interfaces continue to lag Apple products. Have problems with music playlists - need to reboot once in a while. For the price one pays, a bargain.", "verified": true, "helpfulness": "0/0", "author": "Sathis Menon"}, {"rating": 1.0, "review": "Bad lag:(", "verified": true, "helpfulness": "1/3", "author": "DS"}, {"rating": 2.0, "review": "i recently order an amazon fire tv today and i would like to know if i would receive it before Christmas", "verified": false, "helpfulness": "0/9", "author": "Crystal"}, {"rating": 5.0, "review": "Do you have to have WiFi or internet connection to use it", "verified": false, "helpfulness": "0/3", "author": "erica johnson"}, {"rating": 1.0, "review": "Reception is poor, does not stream well.", "verified": true, "helpfulness": "1/3", "author": "Swain's"}, {"rating": 1.0, "review": "I purchased the Fire TV Stick for $19.99 on a whim.  I've been really disappointed ever since it arrived.  Setup was fine, there was the obligatory update and the rest of the process was ok.  Nothing else worked, however.  Just navigating around in the menus my TV will randomly turn off.  This doesn't happen when playing content like Netflix or Amazon Instant Video, just when navigating the OS menu.Speaking of Instant Video, I purchased Guardians of the Galaxy and spent about 30 min trying to get it to play.  Despite reboots and restarts the video always plays out of sync with the audio.  This is not a problem when I view the movie on the Amazon app built into my Visio TV, or BluRay player, or Xbox.My wife asked me why I purchased something to do what our TV already does.  I'm asking myself why I purchased something that CAN'T do what my TV already does.", "verified": true, "helpfulness": "4/5", "author": "Daveed"}, {"rating": 4.0, "review": "This device works great, is easy to use, and has a pretty sweet remote control app that I was able to download from the Google Play store. As far as what it's intended to do, it's a great product. I don't own a kindle fire, so I am unable to take advantage of the device mirroring capability. I own an iPad, so there's obviously no way to mirror that to the Fire TV Stick. That being said, I was hoping that the Fire TV Stick would keep me from having to purchase Apple TV. And here's why I'm only giving it four stars: Since there are so few apps available on Fire TV, I ended up having to get Apple TV anyway (I don't have cable). For example, Fire TV does not provide apps for FoxNow or for ABC. Apple TV does. However, if you are purchasing this to watch Netflix or Hulu, this is a great option for the price. I moved this device to my bedroom to use for streaming Netflix. Awesome for that! If it had more available apps, it would be five stars, hands down.", "verified": true, "helpfulness": "1/1", "author": "MT###"}]