[{"rating": 4.0, "review": "The Fire TV Stick is a neat streaming device.  Easier than hooking up my iPad to the TV (iPad>AV connector>HDMI>TV).  Only issue I have with it is that it appears to not follow Dolby's guidelines regarding Dolby Digital Plus (DD+).  From the Dolby Digital Plus website (http://www.dolby.com/us/en/technologies/dolby-digital-plus.html):\"Compatibility with Current Equipment-------------------------------------------------------Equipment with Dolby Digital Plus will unlock its full feature set, including 5.1- and 7.1-channel capability (depending on the program).If your system includes only Dolby Digital, you'll still get 5.1-channel surround sound, with the highest-quality Dolby Digital signal possible—Dolby Digital Plus content is easily converted to a traditional Dolby Digital signal.\"However, it appears that the Fire TV Stick isn't providing a properly encoded Dolby Digital 5.1 signal (if at all) in that my A/V Receiver can't process the stream.  It's an older receiver and doesn't support DD+, but  has no problem with Dolby Digital 5.1 from multiple devices.  When the Fire TV Stick is set to output \"Dolby Digital Plus\" then my A/V receiver doesn't put out any sound.  If I turn off DD+ in the Stick menu (i.e. output only stereo) my receiver can then output the 2 stereo channels.  This has apparently been a known issue for quite some time (see the Amazon Customer forum thread on this topic:  http://smile.amazon.com/gp/help/customer/forums/ref=cs_hc_g_m_oldest?ie=UTF8&forumID;=Fx1SKFFP8U1B6N5&cdThread;=Tx1KOVJHREPPETT&cdSort;=newest).  Had I known that I may not have bought the stick.  And it seems from the forum messages that this issue also plagues the Fire TV (box).So, if you're not using a surround receiver at all (i.e.just 2 channel stereo), the TV Stick should work great for you.  But if you plan on using it with a surround sound system, make sure it will support Dolby Digital Plus streams, at least until Amazon implements the 5.1 stream (properly?).  I, of course, used the fact that the Fire TV Stick (gave $24 for it on Prime Day) doesn't support DD 5.1 properly to justify to my wife the purchase of a new receiver that *does* support Dolby Digital Plus (~$500).  Hope she doesn't read my reviews. :)", "verified": true, "helpfulness": "0/0", "author": "Brian_254"}, {"rating": 5.0, "review": "I love how easy the Fire stick was to install and set up.", "verified": true, "helpfulness": "0/0", "author": "Krista K"}, {"rating": 5.0, "review": "My 4 year old Samsung 55 inch TV could not get the Amazon Prime app and since I pay to be a Prime member, this has always bugged me. This little device works great and was easy to install. At first it didn't connect to my router, so I just had to reboot my router, and then all was fine. As an aside, several calls to Samsung about the TV were less than fruitful, and were met with surprise at first, and the an \"oh well\" attitude.", "verified": true, "helpfulness": "0/0", "author": "John J. Swain"}, {"rating": 4.0, "review": "If this could puch out Bluetooth to audio speakers, it would receive 5 stars. Love it.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Bresiani \"Robbzilla\""}, {"rating": 5.0, "review": "The speed and portability of the device are tremendous . I can fit all the necessary components in my pocket and go to any friends house and watch netflix and amazon instant video. This is a great product.", "verified": true, "helpfulness": "1/1", "author": "LD"}, {"rating": 4.0, "review": "It has most of the apps you would want on a media streaming stick, though you'll find some missing that you're used to finding in the android Play store. It's not the fastest media streamer, and sometimes chugs, but a restart fixes that quickly. The remote that comes with it is very comfortable to use, and there seems to be little to no input lag between the controller and the stick. If you tire of using the on-screen keyboard to type, you have one of two options. You can download the Fire TV app from the Google Play/Amazon Appstore and use voice search, or use your android devices keyboard...OR you can buy the premium Fire TV remote that has integrated search functionality. I opted for the former, rather than the latter, because I already have an android phone. I got this on sale for $25, but overall, I think if I had to pay full price for it, I would be more than happy.", "verified": true, "helpfulness": "0/0", "author": "Slamacow! \"Strum and Coke\""}, {"rating": 4.0, "review": "It's a great little device, however some of the apps you download for it still have some kinks that can be somewhat frustrating at times.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Love this Amazon stick. So glue to my tv. Watch slots of movies. Thanks.", "verified": true, "helpfulness": "0/0", "author": "dtn"}, {"rating": 1.0, "review": "Impossible to connect to the Internet. This is a piece of crap.", "verified": true, "helpfulness": "0/0", "author": "Santanna"}, {"rating": 3.0, "review": "it continually freezes up; sometimes for many minutes. I have a good connection.", "verified": true, "helpfulness": "0/0", "author": "Joann Arrington \"Mama Mary\""}]