[{"rating": 5.0, "review": "Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Ahunsick"}, {"rating": 5.0, "review": "Creat Stuff And cheap.", "verified": true, "helpfulness": "0/0", "author": "Rafael adames"}, {"rating": 2.0, "review": "has a generic remake version of YouTube, limiting its compatibility with casting devices.was hoping this would be an upgrade from our Google chromecast, however quickly we discovered it was not as compatible as the chromecast with most services. while the first it has a little bit better buffering and load capacity, ultimately we ended up using both chromecast and the fire stick which is a disappointment.", "verified": true, "helpfulness": "0/0", "author": "L.P."}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Excellent as advertised!", "verified": true, "helpfulness": "0/0", "author": "Virginia Trevathan"}, {"rating": 5.0, "review": "very good device i like itbut there is not specific application for it in android nor IOS", "verified": true, "helpfulness": "0/0", "author": "akram abdallah"}, {"rating": 1.0, "review": "It does not work. I used it two days and things were ok. But, now the response is that is not connected to the internet, of course it is. Any ideas of what is happening and how to correct?", "verified": true, "helpfulness": "0/0", "author": "William R."}, {"rating": 4.0, "review": "I've had the Fire TV Stick for about 4 months now so I've put it through its paces pretty well. Overall it's very good as long as you aren't looking to use apps like Sling TV or the MLB.TV app.Netflix and Amazon content are perfect. Couldn't be happier with the zippy interfaces and high-quality video streams. Problem is I use Sling TV and the MLB app more than those other 2. The MLB app is junk and unwatchable unless you want to listen to the radio feeds only. It buffers every 10-20 seconds which renders the live games unwatchable. And it positively is the stick since the app works perfectly on the Roku stick, iPad, iPhone and even my LG smart tv.Sling TV for the most part is above average to good.  Again the app is mostly perfect on the above devices (not available on my tv), but on the Amazon stick it buffers and has to \"catch up\" way more than it does on the other devices. I don't know what it is about the Amazon stick but something in the software or hardware chokes up these live streams when they work great on other devices.So if you aren't as interested in the live streaming apps I've mentioned the stick is a great purchase but since my focus is on using the 2 aforementioned apps it's frustrating that this stick and all its processing power is outdone by the older and less powerful Roku stick.The main reason for the 4 stars despite my seemingly less than positive review is the Android-OS and the ability to sideload Android apps. For me, that means Kodi (formerly XBMC). That is the true benefit of this stick (and Fire TV) over the Roku if you are into doing such things. It's not quite as good as on a computer, but it does an incredible job with the hardware running Kodi on the stick and having the content on the TV without having to worry about tethering or streaming the content from your computer to the TV.So that's my long-winded and maybe somewhat confusing review of my experience with the Amazon stick with my particular use-case. Hope it helps someone in a similar situation.", "verified": true, "helpfulness": "0/0", "author": "Richard Allegretti III"}, {"rating": 3.0, "review": "For the price point, its a pretty awesome little device. I have had it for about six months now. We bought it as a means of streaming shows we watch regularly without the expense of a PS4, Apple TV, or other larger system.Sadly, it has some MAJOR cons.  This is definitely an example of 'you get what you pay for'.Pro:  -Easy to use  -simple to install  -lots of apps for all the basic needs like Hulu and Prime and Netflix, Youtube, etc.Especially for the price point, this was a fantastic solution for having a tv experience without cable or consoles.Cons:  -TERRIBLE app programming. It is clear that designers do not yet know what to do with this system.  It is a new system, and none of the apps really worked 100% perfectly with it. Youtube didn't have a means to navigate subscriptions, Amazon scattered in Prime and Purchase-Required content without filter.  -Navigation was pretty dismal, yet search functions were slow and tedious even with the android app interface.  -There was also no direct web browsing, which seemed like a fairly massive oversight.  -Massive buffering issues, with shows interrupted mid-way and requiring full system resets and starting over from the beginning, especially in youtube and hulu apps.Ultimately, the buffering issues, especially, were killing points for us. We ended up still ultimately buying a PS4 console and, while the apps use similar interface, the difference was drastic- no lags, no slow navigation, and a lot more features for searching and bookmarking. Not to mention actually having a browser.If you are very low on cash and want to have a streaming experience, its a decent option. I don't have enough experience with other items in its category to say that it is the best option, though. if I had known these issues existed, originally, I might have thought twice about purchasing it.", "verified": true, "helpfulness": "0/0", "author": "Angela Tak"}, {"rating": 3.0, "review": "The stars might be too low.  So far it is doing all I ask although there was a time when it couldn't connect to the \"Home\" screen.  Also, when I switch to the HDMI port I'm using on my tv I get a blank screen.  I have to push the center button on the control to get the SLING TV screen up (that's all I'm using it for right now).  I used to go right to the last channel I was watching a couple weeks ago, now it's just a blank screen.  Still, it does what it does so far.", "verified": true, "helpfulness": "0/0", "author": "Carl Reszka"}]