[{"rating": 3.0, "review": "It's hooks up easily. The remote is okay to navigate, but limited.  The options to control (pause, rewind, fast forward) are jerky and limited.  what I really hate is how the credits get put into a tiny window so you can't read them, or pause them to read them, and the next show begins too quickly.  I really still prefer DVDs.", "verified": true, "helpfulness": "2/2", "author": "kmitchell"}, {"rating": 1.0, "review": "Not worth the money. Unit freezes repeadily and had to return the 2 I bought", "verified": true, "helpfulness": "0/0", "author": "SilverDiver"}, {"rating": 5.0, "review": "For some time - we've used the HDMI cable to the TV to watch shows - and while that wasn't a minor inconvenience - this thing makes watching our online shows a breeze! So wish I had bought this before - love it, highly recommend! If you don't have a smart TV - get this!!!", "verified": true, "helpfulness": "0/0", "author": "Jim A \"Jim A\""}, {"rating": 5.0, "review": "Easy to set up and easy to use. I got this mainly to watch YouTube on my television and it works great. Very impressed with how fast everything loads and plays.", "verified": true, "helpfulness": "0/0", "author": "Joseph McCumber"}, {"rating": 5.0, "review": "I love this device.", "verified": true, "helpfulness": "0/0", "author": "BetsyB. \"betsybme\""}, {"rating": 5.0, "review": "Very happy we can now watch our Amazon Prime movie stuff on our TV downstairs without going through the Wii.  Could not have been easier!", "verified": true, "helpfulness": "0/0", "author": "Linda Genrich \"Elizabeth's Mom\""}, {"rating": 5.0, "review": "It's an amazing product. My son and I really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Marielle Carrington"}, {"rating": 5.0, "review": "Nice unit for the price.  The interface is quick and have had no issues.", "verified": true, "helpfulness": "0/0", "author": "bm4deals"}, {"rating": 3.0, "review": "Is it working in Qatar?", "verified": false, "helpfulness": "0/0", "author": "Mahmoud Elemam"}, {"rating": 2.0, "review": "I like this, but the reason for which I bought, it did not meet it!I bought it for watching Youtube videos from my iPhone, but it doesnt work!Chromecast works so good at home, and I bought Fire Stick for office TV.But when I select a video on my iPhone and click on the cast button, it just stays on Playing on XYZ TV and keeps on revolving.Doesnt work 99% of time.What to do ???", "verified": true, "helpfulness": "0/0", "author": "Soumendra Jena"}]