[{"rating": 5.0, "review": "The Fire TV Stick installation was amongst the easiest thing I have ever done. You simply place the adapter into the stick, insert into the hdmi port, and then plug the cord into an outlet. We are a Prime family and watch a ton of Amazon content on the Stick, in addition to listening to music on it as well.Would like to purchase another one, hoping Amazon starts to run sales on them like they do on their other products.", "verified": true, "helpfulness": "0/0", "author": "piscesshopper"}, {"rating": 5.0, "review": "It is a great alternative to cable or the dish. Great quality for the price as well. I would highly recommend this product.", "verified": false, "helpfulness": "0/0", "author": "Robert Poe"}, {"rating": 5.0, "review": "Bought it for my girlfriend, she loves it, the set up was super easy too.", "verified": true, "helpfulness": "0/0", "author": "shery varghese"}, {"rating": 5.0, "review": "Does everything it says it will, but as they continue to come out with MiraCast updates with Windows 8.1 (and hopefully Windows 10 here soon) I hope the support for laptop or desktop streaming to the FireStick improves.  Screen mirroring through Android works perfectly though, no connectivity issues on any of the applications or settings.  Must have if you are an active Prime user.4.9/5", "verified": true, "helpfulness": "1/1", "author": "Tyler"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Garrett"}, {"rating": 5.0, "review": "Easy use", "verified": true, "helpfulness": "0/0", "author": "Mark L Ireland"}, {"rating": 5.0, "review": "Wifi great", "verified": true, "helpfulness": "0/0", "author": "Vinh Hoai Nguye"}, {"rating": 4.0, "review": "Met my expectations", "verified": true, "helpfulness": "0/0", "author": "Amar Reddy"}, {"rating": 3.0, "review": "Its not netflix level,  but I think it will be one day. So with Amazon prime being a few dollars cheaper for a years worth and free music and shipping its well worth the value.", "verified": true, "helpfulness": "0/0", "author": "lee gray"}, {"rating": 5.0, "review": "I love this!", "verified": false, "helpfulness": "0/0", "author": "Sherri Barnett"}]