[{"rating": 5.0, "review": "Easy set up!! Love all the selection of movies & shows!!", "verified": true, "helpfulness": "0/0", "author": "lorrie donohue"}, {"rating": 5.0, "review": "Great device. I enjoy using it. My wife has started using it.", "verified": true, "helpfulness": "0/0", "author": "John Clark"}, {"rating": 3.0, "review": "I do not have cable and so many of the Fire TV Stick features do not work for me.  For example the ESPN app will not show any videos without first asking for my cable provider even though you can watch free videos on the ESPN website.  I also wish there were more apps like the Roku stick has.  Other than that I enjoy having features such as Netflix to easily access.  I look forward to the addition of new applications in the future.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "A great little way of watching Amazon videos on the tv.  Searching is fine although not as easy as using a laptop and amazon.com.  Additional channels are available too for watching and gathering a wide range of information.  These all get you closer to not needing that $$$ cable service; Ahh.", "verified": true, "helpfulness": "0/0", "author": "Searcher"}, {"rating": 4.0, "review": "This Fire TV Stick is so easy to use and has an excellent variety/selection of movies you can choose to watch. So far, I love it! I look forward to watching a lot of movies from home. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Youlanda Clay"}, {"rating": 5.0, "review": "I thought Gary Busey was crazy. Well he is but that's besides the point. The Amazon Fire stick is absolutely awesome. Easy to use and I am able to search for everything from the new iPhone app that synchs to your device in minutes. You won't find a better value to boost your Amazon Prime membership", "verified": true, "helpfulness": "0/0", "author": "Reginald Knight"}, {"rating": 5.0, "review": "Quick load times.  User friendly interface.  Remote is a bonus!  Travels well and plug-in-plays nicely into any HDMI capable TV's with WiFi network access.", "verified": true, "helpfulness": "0/0", "author": "Jason Lanthier"}, {"rating": 3.0, "review": "The fire stick is great...when it can connect to the same WiFi I use for every other device. I've tried unplugging, reprogramming, etc but the stick only works without connectivity issues about 30% of the time.", "verified": true, "helpfulness": "1/1", "author": "Lidawi007"}, {"rating": 3.0, "review": "Fire stick has a hard time connecting to the WiFi. I got it for Christmas and never used it because of poor internet connection.", "verified": true, "helpfulness": "2/2", "author": "Amanda Pettingill"}, {"rating": 4.0, "review": "tab casting from the phone is missing like chromecast . other than that the app streaming is really good and fast. \"amazon fire stick\" app loses connectivity to the remote often. It is taking time to re-establish the connection. More apps available compared to chromecast.", "verified": true, "helpfulness": "0/0", "author": "Gowtham Ram"}]