[{"rating": 5.0, "review": "Works beautifully.  I love that I can now watch Amazon Prime shows along with my Netflix shows and listen to Spotify all through this device.  I also have Google Chromecast and would recommend the Fire TV Stick a million times over GC (I have had some difficulties in GC playing Netflix stuff and it is very difficult to play Amazon Prime shows on it).  I love how easy it is to search of shows/movies using the Android app and the remote is very nifty as well.", "verified": true, "helpfulness": "0/0", "author": "bridgegirljen02"}, {"rating": 2.0, "review": "The fire stick is a wonderful concept.  The first day I had installed the streaming device all worked well with the amazon prime videos.  I believe after the new software update I could no longer stream the videos.  even the ones I owned.  The message I received \"HDCB not authorized.  Content restricted\".  Spent about 3 hours with service folks.  After all done and reinstalled software and setting it back to factory defaults it still gives the same message.  It was an issue they have no answer for as of yet. They told me they were sending my information to the tech who are developing the software.  That was two weeks ago.  no response since then.", "verified": true, "helpfulness": "0/0", "author": "Salvatore A. Ciliberti"}, {"rating": 4.0, "review": "The best part about the Fire TV Stick was the easy of setup. While some privacy advocates may get a little squeamish over it; I like the fact that the device was registered to my prime account when it arrived. The only action I had to take for setup was entering my wireless router password. Navigation is intuitive. Within 5 minutes of opening the box, I was watching a movie.", "verified": true, "helpfulness": "0/0", "author": "David Duda"}, {"rating": 5.0, "review": "After testing and getting disappointed with a chromecast, I decided to try the Fire Stick, is a very interesting device, that works very good. I did not have WiFi signal issues, and the inclusion of a remote control is a big plus. It is definitively a gadget I could give to my parents for everyday use.", "verified": true, "helpfulness": "0/0", "author": "Jairo Lopez"}, {"rating": 1.0, "review": "I really wanted to like this but it drops the network connection constantly even though my router is less than 20 feet away.Sound stutters and makes an obnoxious noise. Unplugging and resetting fixes this for a while.Listened to some music from my Plex server on my phone and casted it to the stick. That album randomly started playing again on its own until I finally had to unplug it. I really wish I'd just have gotten one to try out before I bought two and talked my mom into buying two.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "This is an interesting device.  Out of the box it is about as long as a deck of cards and about a 3rd as wide.  It seems to be well built.  My only gripe with the outside is that it doesn't have a \"power\" light of any sort to let you know that it is working.The first time I plugged it in it only worked on 1 of my 6 HDMI capable devices.  Fortunately after I found a screen that it worked on I was able to download the firmware update which fixed that problem.  If I hadn't had a screen that it happened to work on it would have been a problem though and I would have had to send it back.  Hopefully the next batch will have the update on them already.It works quite well.  The menu navigation is fast and everything seems to be pretty easy to use.  The Prime Music functionality is really not that great.  You can only play artists and tracks you have already found previously and put into your library.  There doesn't seem to be an easy way to search tracks or play a selection of tracks based on a musician or style.The other thing that bothers me about this device (and it may not be the device it may be Amazon's video service itself) is that when I'm watching a movie or show every 5 or 6 minutes the video playback will stutter.  It comes back almost immediately but the entire screen goes black for 2 - 3 seconds.  Granted 2-3 seconds isn't that bad but it is SUPER annoying.Overall, it is a good device for consuming Amazon content but it is clearly a first generation product.  Considering I paid $19 for it I can't complain at all.", "verified": true, "helpfulness": "0/0", "author": "CaptainBasic"}, {"rating": 5.0, "review": "The installation was easy though for some reason I wasn't aware that the stick needed to be connected to power (I thought, like a USB, it would get it from the device it was attached to).  The software was automatically updated and then a nice short video introduction was presented.  I then connected to my NetFlix account and continued watching a show which I had started earlier that day on my iPad.  The control is simple and easy to use.  I intend to move the stick to a TV in the garage and will report back if there are any difficulties in doing so.", "verified": true, "helpfulness": "0/0", "author": "stevew"}, {"rating": 5.0, "review": "Great product. Better streaming and apps than the Xbone. This is also better than the chromcast.", "verified": true, "helpfulness": "0/0", "author": "Edward Nigma \"TheEnigma313\""}, {"rating": 3.0, "review": "It's worth  the risk at $19 (for Amazon Prime customers).  However the choice of apps is limited AND there is no support for the remote control app on the Apple iPhone.Why is the usb power cord placed on the top/bottom of the device instead of the end?  Be prepared to juggle some hdmi connections in order to find a socket for this device.My biggest complaint is with the marginal remote control.  It is extremely awkward to use, forcing me to enter login names and passwords multiple times before getting them right.I also own the Roku Streaming stick and prefer it to this one.  Sorry, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Robert Peters"}, {"rating": 5.0, "review": "Just got it, so this review reflects setup.Easy - plugged it in, found and signed in to my WPA2 WiFi, updated firmware, signed in to Netflix and Pandora, and tried it out - success!And, this is all through my Sony AV receiver! Whoo-hoo!I'm not going to rate the android app here, but they have more work to do there - I'm not sure they chose the right approach for the touchpad...I'll stop by in a month or two to revise based on long-term use...", "verified": true, "helpfulness": "0/0", "author": "John"}]