[{"rating": 5.0, "review": "Works beautifully", "verified": true, "helpfulness": "0/0", "author": "bernie"}, {"rating": 2.0, "review": "So far its 2 stars because I had to write a bad review to get my order processed faster. After that review the process was cut to 1/3 the wait.After receiving the product I have started to use it. This product is not a plug and play. You have to update it and make sure everything is up to date or it will not work. I am waiting on it to update right now and I will revisit this review once I can try it for what I bought it for.If you don't update it you will get messages like the one I attached.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Fire Stick. Very user friendly. Works great.", "verified": true, "helpfulness": "0/0", "author": "Allen Howard"}, {"rating": 5.0, "review": "This is really a excellent product - makes viewing Amazon Prime much easier - works just as expected (and easy to install).", "verified": true, "helpfulness": "0/0", "author": "Penny Davis"}, {"rating": 5.0, "review": "I got in on the preorder deal with this little stick which was just under 20 bucks so it wasn't a very hard decision. I also own the Roku stick which I replaced with the Fire stick. Man what a difference! To be fair, both the Fire and Roku end up at the same place with Netflix, HBO GO, etc. but getting there is the main difference between the 2. The Roku is slow. When I bought the Roku it was the only stick in town so I didn't have much of a choice. The Fire is fast and the interface is beautiful. The instruction recommend against usb power and suggest using the included usb-to-ac adapter. Since my tv is mounted on the wall and I'm going for the no-wire appearance, a 3rd power plug was not an option for me. I used a micro usb-to-usb cable and plugged it into my tv's usb port and the Fire worked just fine. Unless Roku can pack the power into a little stick like Amazon did with the Fire the choice seems obvious to me which one to choose.", "verified": true, "helpfulness": "0/0", "author": "Mark MC \"Riff Merchant\""}, {"rating": 5.0, "review": "Very easy set up works so much better than streaming thru our blu ray", "verified": true, "helpfulness": "0/0", "author": "Debbie Garman"}, {"rating": 4.0, "review": "excelente", "verified": true, "helpfulness": "0/1", "author": "Jorge A. Romero S"}, {"rating": 2.0, "review": "I preordered the Fire TV Stick when it was first announced, for the Prime introductory price of $19.99 and waited for a couple or three months for it to be in stock again and delivered.  That price was too much, considering the fact in only worked well for a month.  That month, I greatly enjoyed the extra speed (over my old Roku), the menus and app options, and the sharp video.  And then.  The device started stuttering while streaming from ANY service—Amazon, Netflix, Hulu.  There would be half second or full second skipping, a stutter, in which the sound would continue as normal but the video would lock briefly before resuming.  Very annoying.  After a week or so of that, the video started locking up completely, freeze-frame, while the sound would continue.  This was not a case of poor internet connectivity or speed; at those times, I'd just turn on my PS4 to watch whatever I had been trying to watch on the Fire TV Stick.  It got to the point that I'd just turn on my PS4 instead of even bothering with the Stick.  I also noticed that the Stick was VERY hot to the touch.  I eventually disconnected the Stick entirely and returned to using my slower but much more dependable Roku.  It's a shame, really.", "verified": true, "helpfulness": "1/1", "author": "Curtis G. Weeks"}, {"rating": 3.0, "review": "I pre ordered this with the 20.00 off prime discount. I'm glad I couldn't order more than one. The interface is nice, but is difficult to navigate and is missing key features like recently played items. At its normal price point its an ok deal.", "verified": true, "helpfulness": "2/2", "author": "linuxman84`"}, {"rating": 5.0, "review": "So fast, so convenient!!  I gave my chromecast to the grandparents because this made it immediately obsolete!!! I don't know how I lived without the fire tv stick!!!  Plus, when I lose the remote (it's tiny, it happens) there is an app on my phone to let me navigate.  You must own this!", "verified": true, "helpfulness": "0/0", "author": "Bess"}]