[{"rating": 5.0, "review": "👍👍", "verified": true, "helpfulness": "0/0", "author": "Janelle Jee"}, {"rating": 4.0, "review": "Works very well!", "verified": true, "helpfulness": "0/0", "author": "FJD"}, {"rating": 5.0, "review": "Lots of great Free movies with Prime membership!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very cool. Movies to expensive especially the older ones.  $3.99 for Jumangi way to much. We will use it but not to often to hard on our budget", "verified": true, "helpfulness": "0/0", "author": "Bob Hawkins"}, {"rating": 1.0, "review": "I don't have access to any service except Youtube.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Great...it I could get my local channels I would blow out comcast.come on amazon give us our local channels", "verified": true, "helpfulness": "0/0", "author": "tommyv43"}, {"rating": 1.0, "review": "Its nothing spectacular. The netflix app couldn't work. It took a long phone conversation with netflix to figure out i needed my credit card on the stick to get any of the apps to work. I don't like having my credit card info on the fire stick for multiple reasons one of which is I or the kids might accidentally pay for stuff. The paid stuff is front and center on the stick and the free or amazon prime stuff in the shadows. I'll give it another week and if it doesn't grow on me I'm sending it back.", "verified": true, "helpfulness": "0/0", "author": "Belita"}, {"rating": 5.0, "review": "Chrome-cast was very temperamental and linked to the computer. In contrast, Fire Stick has been reliable and doesn't require setting up the show on the computer first. Just turn on the TV, choose the HDMI port you put the stick in and watch. The remote is so simple it could be a Mac invention. I get Netflix better than my smart TV handled it, and, as a Prime member, the shows available for free member viewing are pretty good.", "verified": true, "helpfulness": "0/0", "author": "Flowerchild2995"}, {"rating": 5.0, "review": "Just received it and set up in minutes. Beautiful interface. Has so much more then Chromecast at a similar price point. Amazon hit it out of the park with this little device. Just not sure what to do with my Chromecast now, anyone interested in buying it.....? Lol", "verified": true, "helpfulness": "0/0", "author": "Lester Combs"}, {"rating": 4.0, "review": "It is the best video streaming device in the market, and I have tried many.  The only issue that I have is the streaming of photos and videos from Amazon Cloud Drive.  Photos are not maintained in the order that one uploads them and cannot be sorted by file name, only by name of folders.  Videos are displayed by their length, not by their file name.  That means if you want to go to a particular video you need to know its length.  These are two serious flaws when streaming photos and videos.", "verified": true, "helpfulness": "0/0", "author": "Dom Perignon \"Carm\""}]