[{"rating": 5.0, "review": "Did not even have it for five minutes and my mother was asking for her own.", "verified": true, "helpfulness": "0/0", "author": "Stephanie McCann"}, {"rating": 2.0, "review": "Seems to work pretty well so far.  The biggest problem I have with it is that you are unable to select directv as a provider with the history app.  All other devices directv is one of the providers that is available to sign in with.", "verified": true, "helpfulness": "0/0", "author": "user"}, {"rating": 5.0, "review": "It is great!", "verified": true, "helpfulness": "0/0", "author": "Deanna J Viehman"}, {"rating": 1.0, "review": "It doesn't interface with our internet well. It has interuptions while watching a show and slow speeds.  My router is two rooms away so that could be some of the problem.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 3.0, "review": "Honestly,  it was super easy to set up.  I love that it has Netflix and PBS apps.  BUT I wish HBO GO app.  If you can add more popular apps to download that would be great!  Other than that I'm a happy customer.  Love Amazon!", "verified": true, "helpfulness": "0/0", "author": "V. Lynch \"Vicky\""}, {"rating": 3.0, "review": "Haven't even plugged it in yet and a little irked.  All advertisements, even the picture to the left don't show that you need to connect a power supply.  A little deceptive advertising.  Very Bogus.", "verified": true, "helpfulness": "0/0", "author": "John C. Keiler"}, {"rating": 5.0, "review": "It is better than Netflix by far.Thanks..easy to set up and got me lots of choices I didn't have.", "verified": true, "helpfulness": "0/0", "author": "Anne Swatzell"}, {"rating": 5.0, "review": "Fun, easy...love it!", "verified": true, "helpfulness": "0/0", "author": "Anne Breen Magario"}, {"rating": 5.0, "review": "I am very impressed with its streaming speed and apps.", "verified": true, "helpfulness": "0/0", "author": "Felix I. Quiros"}, {"rating": 4.0, "review": "I will have to 're-program' my WiFi Extender for Fire Stick........would NOT log into my ATT Uverse WiFi!", "verified": true, "helpfulness": "0/0", "author": "A. J. Landry"}]