[{"rating": 5.0, "review": "I just wanted a small TV in my kitchen to watch while I was working.  I didn't want to bother with adding a cable jack and the necessary digital receiver.  The price was right and now I am set!", "verified": true, "helpfulness": "0/0", "author": "CHARLOTTE M HOERLEIN"}, {"rating": 5.0, "review": "I installed it and all went very easily.  The directions to pair the remote with the fire stick worked very well.  However I downloaded the  iphone app for the fire stick, to use as a second remote when I wanted to voice search.  So far that app is not working and will not pair with the fire stick.  I like it anyway and Amazon tech support is looking into the problem for me and will let me know if there is a fix for that.  I have never used the Amazon photo cloud that comes with my prime membership.  But we downloaded that app and my husbands ipad pictures uploaded to the Amazon cloud.  They then appeared on the TV screen and anytime we want to watch them there we can.  I also discovered if I left pictures and went to my Amazon music it would start and then play with the pictures.  NIce experience. I think my prime membership is well worth the price because i have so many other benefits besides the free shipping.  It was a no brainer to buy the fire stick when our other media player could not be updated anymore. It does so much more.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "the fire stick is great thanks.", "verified": true, "helpfulness": "0/0", "author": "Chris W."}, {"rating": 5.0, "review": "Awsome device we Love our amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "gerald alexander"}, {"rating": 5.0, "review": "Works great so far ... the videos that I have watched so far have played very smoothly ... as with Netflix, the available movies to stream could be greater ...", "verified": true, "helpfulness": "0/0", "author": "Mike M."}, {"rating": 4.0, "review": "Big fan of Fire TV and the Stick but in my opinion you're gonna want the voice activated remote for the Stick as well  ...", "verified": true, "helpfulness": "0/0", "author": "michael cinquegrana"}, {"rating": 5.0, "review": "I purchased for my daughter, she loves it. Says she literally plug it in, turned it on and was watching Netflix in minutes!Was on back order but worth the wait.", "verified": true, "helpfulness": "0/0", "author": "Lola G \"avid reader\""}, {"rating": 5.0, "review": "Excellent product, I have ordered a second one.", "verified": true, "helpfulness": "0/0", "author": "Doris Jones"}, {"rating": 4.0, "review": "Works good.Wish there were more pre teen shows for my son. It would be nice to be able to let the kids only select free shows and movies. Overall a good product.", "verified": true, "helpfulness": "0/0", "author": "Momof3"}, {"rating": 5.0, "review": "We are very pleased with the Fire Stick.  Does all we wanted it for and am learning more what it can do all the time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]