[{"rating": 1.0, "review": "Had to return this after having to reset it every single use. I was getting the message that the content is disabled. Ordered a Roku instead.", "verified": true, "helpfulness": "1/3", "author": "Katie"}, {"rating": 4.0, "review": "Works great. Buffers a little in bad weather.", "verified": true, "helpfulness": "0/0", "author": "StacyWest"}, {"rating": 5.0, "review": "Easy set up and easy navigation.", "verified": true, "helpfulness": "0/0", "author": "Dan B"}, {"rating": 5.0, "review": "Easy to set up and works great!", "verified": true, "helpfulness": "0/0", "author": "curt schultz"}, {"rating": 5.0, "review": "So easy to set up... Loving our Netflix streaming!!!!", "verified": true, "helpfulness": "0/0", "author": "Summer love"}, {"rating": 4.0, "review": "I think it is amazing!  The only problem I have is that it takes a long time for the programs/movies to load and play without stopping to buffer.  I even called my internet company and had them upgrade my speed, and it still has problems loading.  I really do love all of the tv shows and movies I have at my fingertips, though!", "verified": true, "helpfulness": "0/0", "author": "hdhdbdgu"}, {"rating": 2.0, "review": "Shuts down several times during a movie have to reboot it each time", "verified": true, "helpfulness": "0/1", "author": "Geneva Wylie"}, {"rating": 1.0, "review": "Could never get it to work with my wireless network, although my Apple TV works fine.  When it did occasionally connect and show the movie menu and I selected a movie to play, the movie only started and then failed with an error message.  BTW, I'm a computer person and software engineer who knows his way around a network - it was clear HOW to set it up, it just didn't work.  It only cost $20 so it's not really worth the trouble to send back to Amazon - they just got $20 from me that they get to keep.  Overall, Not ready for 'Prime' time.", "verified": true, "helpfulness": "0/1", "author": "TedZ"}, {"rating": 3.0, "review": "Great for the most part but I have to give it a three star due to how often it has to be rebooted ( about once every four hours, yes I am beinge watching tv series).", "verified": true, "helpfulness": "0/0", "author": "philip j isley"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Janice Auerbach"}]