[{"rating": 3.0, "review": "We love our Amazon fire tv,but the fire stick still has some bugs to work out. It freezes or says it cannot connect after watching TV for a day. You ha e to disconnect the power entirely to reboot it. I'd also like to see voice search on the stock remote, makes searching so much easier.", "verified": true, "helpfulness": "0/0", "author": "elizabeth redding"}, {"rating": 5.0, "review": "Absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "I love my Fire TV stick. I probably watch more shows on it than I do my satellite channels. Easy to set up. Easy to use. Works great with my prime subscription.", "verified": true, "helpfulness": "0/0", "author": "Deborah Slocumb \"Debbie\""}, {"rating": 5.0, "review": "A fantastic device. So much to choose from for any type of entertainment", "verified": true, "helpfulness": "0/0", "author": "denise brown"}, {"rating": 5.0, "review": "Loved it!!! The last post was a mistake. This is a great product.", "verified": true, "helpfulness": "0/0", "author": "Kathy M. Marks \"BnBchef\""}, {"rating": 4.0, "review": "Yes it met my expectations.  It's easy to download and to operate.  It has a lot of information that is not even mentioned when you read what it does.  I really like it so far.", "verified": true, "helpfulness": "0/0", "author": "Helen P. Woodard"}, {"rating": 2.0, "review": "It's a headache in a box. It has too many issues to be worth consideration. Video lag and latency issues riddle the apps.  Amazon makes it incredibly difficult to return. I have never had a bad experience with Amazon before but this has been ridiculous. Their Fire TV support people don't listen and assume something is wrong on your end instead of even considering that the stick could be faulty. Save your time and go with a Roku.", "verified": true, "helpfulness": "1/1", "author": "S.W."}, {"rating": 5.0, "review": "Delivery was on time install took no time at all so far so good", "verified": true, "helpfulness": "0/0", "author": "Peter D."}, {"rating": 1.0, "review": "All the movies I wanted to watch, even old movies, had to be rented or bought.", "verified": true, "helpfulness": "0/1", "author": "Pamela Waldron"}, {"rating": 3.0, "review": "Having problems, maybe we need a better modem though. Love all the shows we can get, sooo many. Trial and error though. I turned off my cell and internet access on my ipad, seemed to work better. Not so many devices trying to use the same thing. Changed my cable setting with the cable company, my streaming is faster now. Seems to be evening times when the streaming slows. But the people who stream some of the shows don't stream the whole show. Or maybe it's just our misunderstanding of the stick. Hoping we can get rid of cable completely soon. Depends on this stick working well enough. Time will tell.", "verified": true, "helpfulness": "0/0", "author": "Dona Freels"}]