[{"rating": 5.0, "review": "I have to say I was a little hesitant to order something so small to do wonders. I love my Fire TV Stick, at first I had a little trouble connecting it to the internet, but 24 hours later it's working wonderfully. I love that it has it's own remote easy to use. Very practical and I can connect it to any TV so it's good for traveling or visiting people, all you have to do is log in to your apps accounts and you are ready to go>", "verified": true, "helpfulness": "0/0", "author": "Maria Mundo"}, {"rating": 4.0, "review": "Very useful and works well.  We do have to limit the wireless devices a bit when using it because it slows the buffering.", "verified": true, "helpfulness": "0/0", "author": "Wes D"}, {"rating": 5.0, "review": "I am very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Fred Quintero"}, {"rating": 5.0, "review": "GREAT!!!!!", "verified": true, "helpfulness": "0/0", "author": "Milton Brown"}, {"rating": 1.0, "review": "Froze on main screen before I really got a chance to use it.", "verified": true, "helpfulness": "0/0", "author": "Yvette"}, {"rating": 5.0, "review": "Excellent device.  Great buy for the money", "verified": true, "helpfulness": "0/0", "author": "Paul  W"}, {"rating": 1.0, "review": "I am so very disappointed!!!! I hooked it up and it worked for all of about 5 minutes, enough for me to set it up and add some movies to my que. first, the sound went out on the set up video. I unplugged it and plugged it back in. I went back to cable and then went back to the HDMI with the fire stick to watch my movie. Nothing but a Black screen!! No menu, No sound, No picture NOTHING!! Needless to say, this will have to be returned. My mom has the box with the stick and she has never had a problem with it. Uses it every day!  I am hoping they will send me a new one in place of this one! hopefully its just a faulty stick.", "verified": true, "helpfulness": "0/0", "author": "GoodKitty73"}, {"rating": 5.0, "review": "Nice!!!", "verified": true, "helpfulness": "0/0", "author": "Roger Dill"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "paul"}, {"rating": 4.0, "review": "pleased but not many good free movies....", "verified": true, "helpfulness": "0/0", "author": "john hicks"}]