[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Thomas W Knueven"}, {"rating": 3.0, "review": "A lot of the apps that I got are very grainy. Lifetime is one that I got and it freezes up for a few seconds then plays for a few minutes then freezes. Picture is not very good at all even tho I have a hi-def tv.", "verified": true, "helpfulness": "0/0", "author": "Cathy Parker"}, {"rating": 5.0, "review": "Amazing. Absolutely love this!", "verified": true, "helpfulness": "0/0", "author": "Carrie J"}, {"rating": 5.0, "review": "Love the Fire TV Stick and the ease of using it.  It is great to be able to access so many movies and programs in one spot!", "verified": true, "helpfulness": "0/0", "author": "Olgranny19"}, {"rating": 5.0, "review": "So much fun and easy to use! All I had to do was plug it into the TV, sign in to Netflix, Hulu and other channels, and done! Interface is similar to the XBOX One, and the Fire stick is AFFORDABLE. So cool.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "I have both the Chromecast and the Fire TV Stick.  I prefer the Fire TV Stick because you do not need to \"cast\" from a web browser.  It makes viewing more reliable as it cuts out the \"middle man\".  I like that it has a remote and I am even able to use the Chromecast app to \"cast\" to the Fire TV Stick.  It's great for watching ESPN3 when your team isn't on television.  With that said, I do like that you can cast almost anything from the Chrome browser to the Chromecast.  Some college sports can be found online and watched this way.  I would hope in the future that Amazon could secure some more apps for this, such as HBO Go.  Overall it's worth the cost for the functionality you get.", "verified": true, "helpfulness": "1/1", "author": "PMG"}, {"rating": 5.0, "review": "We use it almost as much as our Roku 3.  It's a great device.  And for the 20 dollars we paid?  It's spectacular.If you have a Prime account and don't have one, your'e doing yourself a huge disservice.", "verified": true, "helpfulness": "0/0", "author": "M. Metalios"}, {"rating": 2.0, "review": "Interface is slow, switching between apps takes some time. Remote seems unresponsive at times. Sometimes nothing happens even after multiple  clicks and then suddenly all the clicks register at once. Frequent app crashes. I use the Plex app and have seen it lose connection, screen go blank, lost audio very frequently. At $20, you cant expect a lot, but was hoping it was more reliable.", "verified": true, "helpfulness": "0/0", "author": "Amit"}, {"rating": 5.0, "review": "Great Item", "verified": true, "helpfulness": "0/0", "author": "Shelly Lawson"}, {"rating": 5.0, "review": "Bought for a discounted price in Q4 of 2104 for Prime Members.  Arrived earlier than expected.  I had my doubts after owning an Apple TV, and currently running most of my stuff off of a gaming station.  After I took 2 minutes to figure out the controls, this has become my favorite media player.  No lag, very little buffering at the beginning of shows, and the selection on Amazon Instant video just gets better and better.  I haven't tried using my iPhone or Amazon Fire HD Tablet as a remote, but I haven't needed to.I wish that it didn't have to be plugged in all the time (that's wasn't obvious to me until I opened the package), but I can live with it.  Looking forward to the update that will allow me to use it in hotel rooms where a WiFi login page is required.  This may already be available, at this time, but was not at the first of the year.", "verified": true, "helpfulness": "0/0", "author": "B \"B\""}]