[{"rating": 5.0, "review": "The hardest part of installation was opening the darned remote to put the batteries in!", "verified": true, "helpfulness": "0/0", "author": "TxRN"}, {"rating": 5.0, "review": "As a Prime member got this for $19.  What a bargain!  Easy to install on TV.  Easy on-screen set up.  Remote has good controls.  Zillions of amazon Prime free TV shows and films.  With amazon app, a nice way to store and view photos.  Use it much more now than the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Crownbach"}, {"rating": 4.0, "review": "Overall good experience just that some apps that I use quite a bit like Spotify and Showtime App cannot use them one because I dont pay for premium Spotify and the other app because Comcast does not have an agreement with Amazon. Still a work in process.", "verified": true, "helpfulness": "0/0", "author": "erick"}, {"rating": 5.0, "review": "We are very pleased with Firestick. Previously, we had used our Samsung blue ray DVD player to stream Netflix through and were not able to get closed caption or Amazon Prime movies. With the Firestick we are able to stream movies from Netflix, Prime, and numerous others. The best thing of all, is that they all have closed caption now. Being hearing impaired,  this is a huge plus for me!", "verified": true, "helpfulness": "0/0", "author": "Edyouk8or"}, {"rating": 5.0, "review": "Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Patricia L. Daurizio"}, {"rating": 5.0, "review": "I wasnt sure what I was buying... I am still confused between Amazon Prime and the Stick but I dont care... I love the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Tammany"}, {"rating": 1.0, "review": "This device primarily useful for Amazon set of products.. not able to cast from Laptop, Android devices.", "verified": true, "helpfulness": "0/0", "author": "Venkat"}, {"rating": 5.0, "review": "Quick and easy, great to use ! We love it .", "verified": true, "helpfulness": "0/0", "author": "dorothy silvers"}, {"rating": 4.0, "review": "The only thing that would make this better is if it had YouTube.", "verified": true, "helpfulness": "0/0", "author": "oak"}, {"rating": 5.0, "review": "I love it... I also have an Out door projector and it works grate with it.... Download all the apps and away I went...  from netflix  to games for the kids.", "verified": true, "helpfulness": "0/0", "author": "Leonard Targett Jr"}]