[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Katora finney"}, {"rating": 5.0, "review": "It took me a little while to figure out how to get it connected to the TV and internet but once I got past that it was wonderful.  I really enjoy watching the prime movies since they are free for me.  I would like to see more TV shows than what is listed.  My husband loves WWE, Monday Night Raw, and Thursday Night Smack Down.  Haven't found any of those wrestling TV shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Slim, lightweight and works great with my Sony tv!!https://www.youniqueproducts.com/products/index?psid=115888", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought this on sale to have in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Gaylen A. Anderson"}, {"rating": 5.0, "review": "Very nice  options and versatility for on-demand viewing. Another great thing about Amazon Prime!!!!", "verified": true, "helpfulness": "0/0", "author": "J M Jones"}, {"rating": 5.0, "review": "Was everything I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "Steve Krogh"}, {"rating": 2.0, "review": "The price is right, and having HD is nice, but the menu is really tough to use, even for Amazon video.  Trying to navigate through Netflix is really tough (there is a reason that Amazon sells it cheaply) and really frustrating.  It isn't hard to build an intuitive menu.", "verified": true, "helpfulness": "1/1", "author": "Pete outside the beltway"}, {"rating": 4.0, "review": "Love this product. Four stars because Netflix has some glitches with the keyboard to enter  user name and password but that is not the fault of this product. Can still get it to work. All other movie streaming programs have no problems.great product.", "verified": true, "helpfulness": "0/0", "author": "Laurie A. Jehlik \"ljr\""}, {"rating": 1.0, "review": "Still haven't gotten it to work with my smart TV", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick is great, easy to install, especially for someone who is not real technically savvy.I love being able to watch movies from Prime on my TV.", "verified": true, "helpfulness": "0/0", "author": "Audrey Sansone"}]