[{"rating": 5.0, "review": "Love the Fire TV Stick.  Arrived on time, easy to install and use.  Already had Amazon Prime and Netflix Subscriptions.  Should have gotten this months ago.", "verified": true, "helpfulness": "0/0", "author": "Eva J Weston"}, {"rating": 3.0, "review": "I am having problems with movies. They can not be seen. There is a message error. That the movie is currently unnavalable.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Tapia"}, {"rating": 3.0, "review": "It worked great until our power went out, no I can't seem to get it to work, actual stick seems really warm", "verified": true, "helpfulness": "0/0", "author": "bathunt"}, {"rating": 2.0, "review": "It's Apps aren't useful to me. Amazon Prime TV has very little I care to watch so Apple TV works better for me.", "verified": true, "helpfulness": "0/0", "author": "Chris Williams"}, {"rating": 5.0, "review": "Excellent for what I paidNeed more products like these that's useful and good price point", "verified": true, "helpfulness": "0/0", "author": "Nagesh G"}, {"rating": 5.0, "review": "Works great, I love it!", "verified": true, "helpfulness": "0/0", "author": "Debra E. Hampton"}, {"rating": 5.0, "review": "I really like the fire stick. I also have Chromecast and like that too, but the Firestick has a nice home screen and remote to choose what I might want to watch at that time. I find myself using the Firestick most often, and Chromecast for stuff that's not currently on amazon. It was very easy to set up, just a few clicks, and had a lot of aps already installed. Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Scott M. Stergios \"Scott Stergios\""}, {"rating": 5.0, "review": "Love it! easy to work", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "We love it and it is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dannysucich"}, {"rating": 5.0, "review": "works great, used mostly for \"Prime\" and \"Sling TV\"", "verified": true, "helpfulness": "0/0", "author": "Corliss Hyer"}]