[{"rating": 5.0, "review": "Amazing!! We aren't using our cable at all anymore.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Mosca"}, {"rating": 2.0, "review": "I'm rating this 2 stars because when this thing wants to work it works just fine but there will be times it just freezes and doesn't respond so I have to unplug the damn thing to reboot it basically. YouTube is horrible on this thing constant buffering and freezing. If you have prime this works great when you watch prime videos other then that it's an ok product. Do not I repeat do not get the sling app and sign up for the free trial! It's a pain in the ass to try and figure out how to cancel it if I'm going to pay that much for a couple channels I might as well just get direct tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Katrina Allen"}, {"rating": 4.0, "review": "i do really like the streaming ,, no buffering.. lots of channels but i need a guide. i am sure there is one. havent found it yet", "verified": true, "helpfulness": "0/0", "author": "Renee Scoggins Holloway"}, {"rating": 4.0, "review": "First, let me say that Fire TV is a great service and I highly recommend it.  I first purchased the Fire TV \"box\" that allows for a wired Ethernet connection.  For a second TV I thought I would try the much cheaper Fire TV stick.  The stick uses wireless \"WiFi\" Ethernet.  Here comes the downside of the stick.  Because it only works over WiFi, in the evening when my neighbors are all at home probing the internet or watching their streaming IP service, the Stick does not have enough bandwidth to deliver service.  For that reason I recommend that you buy the Fire TV box rather than the stick.  Both provide great service, but the box has the hard wired Ethernet, and expanded capacity for compute and bandwidth intensive games.  The remote control that comes with the stick does not have the voice search capability. Let me say that the voice search on the Fire TV box works much better than I ever expected and is probably worth the extra dollars just by itself. If I were to buy another Fire TV it would be the box rather than the stick.  I hope this helps you in your purchase decision.", "verified": true, "helpfulness": "0/0", "author": "Dr. Jeffrey Harris \"Dr. Jeffrey Harris\""}, {"rating": 5.0, "review": "Compact and easy to use with intuitive interface", "verified": true, "helpfulness": "0/0", "author": "Mouawad Daher"}, {"rating": 5.0, "review": "Love it. Use it constantly. Needs rebooted sometimes.", "verified": true, "helpfulness": "0/0", "author": "Kaye"}, {"rating": 5.0, "review": "I love this thing! It's small inconspicuous and provides all the viewing pleasures that I desire. Even the remote is small and pretty intuitive. I've got no complaints. I'm off to use the thing now ;-)", "verified": true, "helpfulness": "0/0", "author": "oPinonateD"}, {"rating": 5.0, "review": "since justified and bosch are over it doesn't have a lot of viewing for me", "verified": true, "helpfulness": "0/0", "author": "Carol D."}, {"rating": 5.0, "review": "Love it and shipping speed has been outstanding", "verified": true, "helpfulness": "0/0", "author": "jaime"}]