[{"rating": 5.0, "review": "This is the best Christmas that I have ever received.  I have enjoyed many hours of entertainment and I have barely used all that it offers\"", "verified": true, "helpfulness": "0/0", "author": "Melody apter"}, {"rating": 2.0, "review": "Could be my internet speed but it freezes up.  You have to reload about every five minutes.  I don't have this problem with my Roku. UPDATE: Increased internet speed and we have no problems.  Amazon is always willing to help out and that is an added bonus.  P.S. I love the installed screen savers- almost rather sit and watch those.", "verified": true, "helpfulness": "0/0", "author": "Shewolf"}, {"rating": 5.0, "review": "So far, so good. It's got a nice, slick interface. It streams media quickly and well. It's pretty much exactly what I was hoping for. We have 4 Roku's including a Roku 3. I will probably replace the Roku's with these little Fire things whenever the Roku's die. Hard to go wrong with these.", "verified": false, "helpfulness": "0/0", "author": "Eugene Gomez"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Kristin Smothers"}, {"rating": 5.0, "review": "A great addition to our entertainment system. Movies and tv shows at the touch of our finger. Paired it with Amazon prime!! Unlimited possibilities!", "verified": true, "helpfulness": "0/0", "author": "cmfOhio"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Eddie Atkins"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Gary S. Hardman"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Doug Holloway"}, {"rating": 5.0, "review": "Surprisingly easy to set up and use.  Great access to Amazon series and other TV shows and movies.  Finally something to watch without advertising!", "verified": true, "helpfulness": "0/0", "author": "JSUSANJ \"Love to read on my Kindle\""}, {"rating": 2.0, "review": "Most of the good movies charge a rental fee.", "verified": true, "helpfulness": "0/0", "author": "Larry Rachels"}]