[{"rating": 4.0, "review": "I have a Chromecast so I was hesitant to buy another streaming stick. I'm glad I did because the Fire TV Stick is so much better. I no longer have to always have my phone available to play something. In addition, if you have a little bit of tech skills you can install almost any android APK on the Fire Stick, making it much more versatile.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Easy to use so far :~)", "verified": true, "helpfulness": "0/0", "author": "Scott L Thomas"}, {"rating": 5.0, "review": "Why pay for other online movie services when one Amazon Prime membership is all you need? The stick was all we needed to enjoy all our favorite movies and TV series shows.", "verified": true, "helpfulness": "0/0", "author": "DixieGirl"}, {"rating": 5.0, "review": "Worth it", "verified": true, "helpfulness": "0/0", "author": "Matthew Neal"}, {"rating": 4.0, "review": "works as advertised", "verified": true, "helpfulness": "0/0", "author": "RANDY W RUCKMAN"}, {"rating": 5.0, "review": "Almost like a complete solution in one small pocket-size package", "verified": true, "helpfulness": "0/0", "author": "Eisen Atherly"}, {"rating": 1.0, "review": "Not as I expected! Seems like it won't connect to wifi as I thought it would!", "verified": true, "helpfulness": "0/0", "author": "james baker"}, {"rating": 3.0, "review": "Difficult to manuver and not as much free as we thought", "verified": true, "helpfulness": "0/0", "author": "Preacher Bill"}, {"rating": 1.0, "review": "My Fire TV stick does not function well at all. The picture continually goes out of HD to a fuzzy image and it's constantly reloading while viewing on Netflix. I have a Google Chrome that does not have the same issues.", "verified": true, "helpfulness": "0/0", "author": "zachary means"}, {"rating": 5.0, "review": "This has been a wonderful purchase for me.  I do not have cable.  The Fire Stick makes it possible for me to watch Netflix and Prime offerings when I want to and where I want to.", "verified": true, "helpfulness": "0/0", "author": "Alice D. Murphy"}]