[{"rating": 5.0, "review": "Great my daughter loves it and she uses it to watch Netflix", "verified": true, "helpfulness": "0/0", "author": "Aide Buentello"}, {"rating": 5.0, "review": "Do not think Amazon's Fire TV Stick is a Chromecast imitation. For those looking for an Android on a stick to add the \"Smart\" to their existing TVs, Amazon Fire TV stick is most bang for the buck choice!I bought this Fire TV Stick during Amazon's pre-release promotion.  I didn't have much expectation at that time.After receiving the Fire TV Stick, I quickly realized the hidden potential of this device. And the best known secret of this device is the fact that you can sideload Android App. This is a killer feature for this device of this class. Without the need of rooting the device (and you can't), user can sideload (i.e. install without going through Google Playstore or Amazon appstore) Android apk files (app files).  The possibility of this is endless.For example, I use it together with some NAS apps (i.e. Synology DS files) together with some android player such as BS player and MX player. With these, I can play all sorts of media files from my NAS using the Android Fire TV Stick.Alternatively, user can install apps  like XBMC which opens up endless possibility of media streaming.Software:For the built-in UI  is very easy to navigate. It is true that without Amazon Prime, the pre-installed set of apps (music, prime video) are not very useful.  Therefore, for those without Amazon Prime, all the built-in  apps are not that useful. Personally, as a Amazon Prime user, I find the Amazon Prime video , Music do a very good job on the Fire TV Stick. I started regularly streaming music every since I got the Fire TV Stick. It is very handy and easy to navigate.Hulu Plus, PBS players and youtube all do a very good job without the need of  Amazon Prime membership.For those without Amazon Prime,  Fire TV Stick is still a very attractive device simply  because of the potential of sideloading Android apps. For Amazon Prime users, the addition of Prime Music and Prime instant video make it a sweeter deal.The software is very stable and I rarely run into situation where the device is frozen or requires reset.Hardware:The whole package is very well presented. Batteries are included for the remote control. The Fire TV stick has enough built-in memory to install most of the apps. Wifi  is definitely stable and have very good reception. The wifi capability is far better than any of those China made Android on a stick. Connection to the TV is very simple. The included hight quality power supply and the HDMI  extension cord (for tight space) are nice touches.The remote control has a very nice feel. The use of wireless remote instead of Infrared is definitely a good design choice since wireless remote does not requite line of sight to operate.  But occasionally, button presses would lag a little but it definitely not a deal breaker.As a bonus feature, the Fire TV Stick is HDMI-CEC compatible. This means that with a compatible TV, you can you your TV's remote control's direction, back and enter button to control Fire TV Stick. And this works very well.Compared to Chromecast:I also own a Chromecast. The fundamental difference between Chromecast and Fire TV Stick is that Fire TV stick is a smart device where Chromecast is more like a passive \"slave\" device that requires another device to control it or tell it what to play. Basically Android fire TV sick can do everything that Chromecast does except mirroring a phone screen.Shortcoming:The bigger shortcoming is that not all Android apps can be navigated using just the direction and enter keys. So at times, you'll need to resort to the android amazon Fire TV app that lets you use a soft keyboard. But even with that, there is still no official app that lets you do a mouse pointer which is required in many apps.The addition of bluetooth connectivity for other devices like mouse or keyboard would be welcomed.At the price of $39, there is really no competition. Any China made Android on a stick with similar  dual core CPU performance and a remote would cost more , not to mention that those devices typtically unstable  wifi and buggy software.At this price point, the only competition is the Chromecast. Chromecast costs $35 but without a remote. Also, it is a passive device, it requires another device (phone or tablet) to control it. The only thing that Chromecast beats the Fire TV stick is the screen mirroring feature. Other than that, Fire TV stick wins.In conclusion, I would highly recommend the Amazon Fire TV stick because of the potential of sideloading Android apps without rooting. With or without Amazon Prime, this is still the best device at this price point.", "verified": true, "helpfulness": "1/1", "author": "Gadgets Kid"}, {"rating": 3.0, "review": "It is nice, but the interface is a bit cumbersome. You have to keep srolling to find your apps. Might swich to something else that is easier to use.", "verified": true, "helpfulness": "0/0", "author": "Bull Moose"}, {"rating": 5.0, "review": "Absolutely love the Fire Stick TV. Very easy to set up and use. It exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Susann Braverman"}, {"rating": 3.0, "review": "Have not been able to use it much.  Tells me my internet connection is too slow.  Starts and stops while it buffers, like the variety and the interface.However I'm stuck using my Chromecast instead.  The remote and on screen interface are easy to use and not having to have a second device to play what you want to see is nice.", "verified": true, "helpfulness": "0/0", "author": "JuanCholo"}, {"rating": 5.0, "review": "Fire TV Stick Fantastic! Have it hooked up to a tv on my treadmill. Makes running inside easy.", "verified": true, "helpfulness": "0/0", "author": "Dell Foxen \"The Farmer in the\""}, {"rating": 5.0, "review": "I love my fire stick!! Our family uses this all the time. And a great price as well! I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Can watch shows from different apps. Can't search for other apps & install them.", "verified": true, "helpfulness": "0/0", "author": "Erwin"}, {"rating": 5.0, "review": "Easy to install. Good content.", "verified": true, "helpfulness": "0/0", "author": "John oakes"}, {"rating": 4.0, "review": "I bought 2 of these originally. So far both have screwed up. On the first one the stick stopped working. On the second one. The controller stopped working. Changed batteries before it no help there. I like the stick is the reason I marked it high as I did. Amazon's customer service is out standing and I know I will be taken care of. I do have some issues with some of the program where as I can watch shows on Hulu and netflix for free and have to pay on Amazon.", "verified": true, "helpfulness": "0/0", "author": "Clyde H. Roberts"}]