[{"rating": 1.0, "review": "Mostly I use YouTube", "verified": false, "helpfulness": "1/6", "author": "konguraj"}, {"rating": 5.0, "review": "Wish it had a usb port for external use but all and all it's a great alternative from paying the cable company.", "verified": true, "helpfulness": "0/0", "author": "Javon M."}, {"rating": 4.0, "review": "Was fast and updated it self right off the bat with no issues. The unit can lock up from time to time causing you to reboot it by pulling the power cord. I say a few bugs to work out but for the money a good buy. It was on sale for 24 dollars.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Is great we enjoy watching TV shows on Hulu on our tv instead of computer ate thinking of buying another one and give as gift to family.  We cut down on our cable to save money and this helps make up for a lot of what we lost would recommend if you have subscription to Hulu or Netflix", "verified": true, "helpfulness": "0/0", "author": "Kristina Jackson"}, {"rating": 4.0, "review": "Still can't give it five stars because of the original headache, but the original headache was caused by the Netflix app. Deleted, then reinstalled the app and the fire stick is working fine. Kudos to Rolla at Amazon support.  The comments below are from my original post.Well, it worked for about 10 minutes, went to all the upgrades, worked perfectly well it was giving me the introductory video, and then about 10 minutes then the remote froze when I was trying to enter my Netflix ID and password.  Then it says it's not connected to the network, funny everything else in my house is connected. Went back and doublecheck my Wi-Fi and cable modem and everything's fine.I go and reset my login Wi-Fi and it shows very good strength, enter the password for the Wi-Fi and now it shows poor strength. My Wi-Fi and modemare approximately 15 feet from the stick.  Prior to this I was connecting to Netflix via my cheap Walmart DVD player, never had an issue. This thing is pathetic. I don't imagine Amazon will post this review.  if Amazon can fix this problem, I'll go back in and change my review, but will never give this thing five stars due to the initial problems.", "verified": true, "helpfulness": "0/0", "author": "Skippy"}, {"rating": 2.0, "review": "It skips, and stutters, and now we can't even get it to connect to wifi anymore. It's telling us it's the wrong password, it's not. Won't connect at all. I'm annoyed, and hope they have some type of update SOON.", "verified": true, "helpfulness": "0/0", "author": "Mike & Jaimie"}, {"rating": 4.0, "review": "Not bad for a stick, but does not compare to the Roku 2 and 3.  I paid for the Plex app and it does not work, but I don't think that is the Fire stick's fault.  However - beware of purchasing apps for this if they do not have a free trial to test with.  I have to assume that because this is so new that the developers don't have the experience that they have with their Roku counterparts.  This comes with a great flexible HDMI adapter in case you only have a side-mounted port on your TV that would make it stick out past the frame.  The remote feels more fragile than does the Roku remote.", "verified": true, "helpfulness": "0/0", "author": "Jim Schuuz"}, {"rating": 5.0, "review": "Exactly what I expected.  Better than Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Frank Robles \"sonicspd\""}, {"rating": 5.0, "review": "Works great, bought during the initial promotion.  Lots of options for kids shows, i would recommend it for that reason alone.", "verified": true, "helpfulness": "0/0", "author": "Barnes"}, {"rating": 3.0, "review": "We  bought the stick to compete with our already owned chromecasts.  We wanted to have the current Plex functions with the added Amazon Prime videos and music.  The first thing I noticed was that the Plex functions are in an app that you have to purchase.  Already being a Plex lifetime subscriber, I was hoping to be able to just log in and use Plex, but alas you have to pay the 5 dollars for the app from the Amazon store.  Five dollars isn't the issue, but it did seem like it was touted as a feature, not a pay feature.  The Amazon video playback is smooth and works well.  The Plex app crashes quite a bit and is about a year behind the actual Plex app that you purchase from Plex.  Other than that, the thing works fine.", "verified": true, "helpfulness": "0/0", "author": "Michael O'Brien"}]