[{"rating": 3.0, "review": "I love what the fire tv stick allows me to access from my tv, but the remote is hard to control.  For example when you have type something on the tv screen, the remote is over sensitive and it takes a lot of effort to get it to go to the button you want it to go on.  Not bad if you only need to click on a big icon, but very frustrating when you have to type in passwords.  Thankfully, I only needed to do that for the first week as I was setting up my stuff.I do love that it turned my dumb tv into a smart tv at a low price.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Excellent product if you belong to Amazon prime, Hulu, and net flicks.Easy to hook up and to operate..Very simple", "verified": true, "helpfulness": "0/0", "author": "D. gahring \"oilcitysis\""}, {"rating": 2.0, "review": "This was supposed to be much more powerful than the Roku LT that it was replacing. So I have my Roku to my girlfriend. However the fire TV stick will not stay connected to my internet. My Roku had no problem. My roomate has the same problem with his fire tv stick. Now I just use my xbox for everything since it streams netflix perfectly and my fire stick buffers every 2-3 minutes during netflix. I would look recommend looking at another product because this one was very disappointing for me. Especially for being an amazon product", "verified": true, "helpfulness": "0/0", "author": "Aaronrocksg"}, {"rating": 5.0, "review": "Only way to watch TV", "verified": true, "helpfulness": "0/0", "author": "Mike Crowder"}, {"rating": 5.0, "review": "Set up in 5 minutes. I recommend buying the USB power cord separately. Prime video service is not quite as easy to navigate as Netflix, but give it time. I have not tried the voice remote option that is standard with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "TR"}, {"rating": 5.0, "review": "This is easy, simple and works great. It comes with your Amazon account information already loaded, so setup is simple as entering your wi-fi password. That's it.  The remote is tiny and simple to use, and the phone app is stellar.  It's exactly what it is advertised to be, and it works well.  On a slow (DSL) connection, performance is sometimes noticeably limited, being much better on HD shows than on older movies and shows.  This can be circumvented by starting the show and pausing for sometime (while watching another source) to let the show download onto the stick.", "verified": true, "helpfulness": "0/0", "author": "Olemax"}, {"rating": 2.0, "review": "Got this when it went on sale before the holidays. I've played around with it for a few months now and overall, I'm not impressed.Pros: Fairly cheap, handles Amazon Instant Video well, includes a remoteCons: Both Netflix and Plex run HORRIBLY.  Netflix videos have all sorts of artifacts and streaming videos over Plex is all but impossible.  In comparison, both Plex and Netflix run flawlessly on my Chromecast. With my Chromecast, I can stream full 1080p; with the Fire TV Stick, I can't even stream 480p without loads of buffering.So if all you're doing is using this to watch Amazon Instant Video, it's worth the purchase. However, if you want to use Netflix, and or Plex, get a Chromecast instead.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great Device!", "verified": true, "helpfulness": "0/1", "author": "Richard Smith"}, {"rating": 3.0, "review": "It does bring a good picture, but I had problems with it, and with switching back to my blu-ray player.  I had to buy a switch to go back and forth, and another HDMI cord.  And the USB cord gets worn after a few uses and switches back to the blu-ray.  I had an Amazon technician tell me to buy the switch.  I've put in a lot of money just to watch Amazon, and half their programs are at an additional cost, which they say is just the breaks.  Prime membership does not give you the shows you may want to watch without costing you $3 or more per episode.  Bait and switch?  Maybe.", "verified": true, "helpfulness": "0/0", "author": "V. Wallace"}, {"rating": 5.0, "review": "I'm so pleased with the Fire TV Stick.  I had to purchase a stronger Wi-Fi router in order to have uninteruptedstreaming.  After that - no problem.The only other problem I had was with the remote that comes with it, it's very hard to open to place the batteries in it.The instructions didn't show how to open it, I had to go on youtube to see how to open it.", "verified": true, "helpfulness": "0/0", "author": "Elaine Marie"}]