[{"rating": 5.0, "review": "My wife immediately migrated to the more user-friendly user interface of Fire TV over our old stand-by media streamer, a PS3.  I like not only the layout of menus and speedy ease of navigation, but also am impressed with the apparent ability of the stick to stream higher quality video over my wireless network. To do it justice, I now need to upgrade my older Netgear router to take full advantage of the Fire Stick's capabilities. What's a tech nerd to do? Such a first world problem.Set up was simple. It may be overkill, but I use MAC filtering on my network and found the Fire Stick's MAC address under Settings > System > About. Such a configuration is by no means necessary, so don't worry if that \"MAC filtering\" is Greek to you. Though the stick itself plugs into a USB port on your TV, be advised that the Fire Stick will not work properly using power from a USB port. You WILL need to give this device AC power from an outlet with the hardware provided. But really, what's another wire in my rat's nest anyway?Now I'm tempted to get the super-duper voice remote to go with...", "verified": true, "helpfulness": "0/0", "author": "Red Insight"}, {"rating": 5.0, "review": "I am a prime member, so I get  my money's worth and more. This device is great, much faster than my older ROKU. A fine way to \"cut the cable\". (Don't forget to keep your internet, though.)Update: Had a problem with the Fire keeping up with a movie rented from Amazon, it kept stopping to spool up. I had said nothing to amazon yet, but they keep a virtual eye on these things, apparently.I received an email from them stating that they noticed the glitch, and REFUNDED MY $$ for the rental! They did make a point that Refunding of Rented Video is not something they normally do, and i think it is not likely to happen again anytime soon, but still, great service.They went on to tell me how to clean off the 'Stick's apps and info, to get it rebooted, so to speak. I haven't done it yet, but will today. (LINK PROVIDED BELOW)I have never had service like this from any other streaming service. I did have the problem, but Amazon cared that I had it, and they made it right.Although I have a full (FIOS 50/50) Wireless signal within 24 inches of the FireStick, and nothing else taking bandwidth (so it was not my equipment or my signal) I know that setup of equipment sometimes loads up memory with junk. Cleaning it up just might do the trick.Here's a copy of the \"troubleshooting\" link for ways you can \"potentially improve your viewing experience\":You can copy and paste it in a browser.http://www.amazon.com/gp/help/customer/display.html?nodeId=201431300", "verified": true, "helpfulness": "0/0", "author": "greyman"}, {"rating": 2.0, "review": "This thing has some serious issues. The connection to my wifi consistently fails, while all my other devices work great. It has some serious loading issues when it is connected. The stick get extremely warm. Outside of Prime and Crackle it lacks any other decent video support. The History and AE apps dont offer anything to get excited about.", "verified": true, "helpfulness": "0/0", "author": "bradick Herring"}, {"rating": 5.0, "review": "After yet another round of cable company blues, I told them to finally \"bite me\", it took me exactly 2 minutes to be free.....feels great. This product is as advertisedd and more, it is simple to use, and at the age 65....I appreciate it...lol", "verified": true, "helpfulness": "0/0", "author": "Harold E. Lewis"}, {"rating": 5.0, "review": "live it", "verified": true, "helpfulness": "0/0", "author": "Ruby"}, {"rating": 5.0, "review": "Still exploring it.  Easy hookup works great", "verified": true, "helpfulness": "0/0", "author": "David A."}, {"rating": 5.0, "review": "My son came over to install because of my tv's location but it still took less than 5 minutes to complete install!!!!", "verified": true, "helpfulness": "0/0", "author": "Jessica Brooks"}, {"rating": 5.0, "review": "Probably one of the best HDMI dongle out there for price to performance ratio. I expected a few things not working for the first version of any devices in the market, Fire TV Stick included. Hopefully they'll keep updating the firmware and release more features. Right out of the box it won't connect to my 2.4 GHz network, had to connect it to 5 GHz no biggie. By the way after I restore the stick to default factory settings, it finally connects to my 2.4 GHz network. Got it on sale for $19.00.Pros:Screen mirroring works fine with my S4 and S5, but there's like a 0.5 second delay. Still tolerable.Streams movies with no lag at all.GUI is clean and very very very very very very very very very very very very user friendly.Extremely responsive when scrolling through movies and menus.Cons:Main reason I bought the stick is for the screen mirroring feature and this piece of crap stick supports miracast but it doesn't work in Windows 8.1 on my laptop. Miracast™ Certified logo should not be on the product page.", "verified": true, "helpfulness": "2/2", "author": "DangerZone"}, {"rating": 5.0, "review": "just like it's big brother, nice and fast PERFECT", "verified": true, "helpfulness": "0/1", "author": "Jefferey"}, {"rating": 5.0, "review": "Awesome and easy to use.", "verified": true, "helpfulness": "0/0", "author": "pe4dolphins"}]