[{"rating": 5.0, "review": "So far we are loving it! I have Prime so that enables more features.There is a learning curve.It should INCLUDE an instruction booklet, in reasonably sized print.  There are features we haven't figured out yet. Seventy year old brains are not as\" in tune \" with today's terms or technology.", "verified": true, "helpfulness": "0/0", "author": "Mizmaven"}, {"rating": 5.0, "review": "Really enjoying the Fire Stick. A lot more options with Amazon Prime, but worth is when you purchase items from Amazon too. So many movies, games and shows available.  Like that it works with my WiFi easy set up too.", "verified": true, "helpfulness": "0/0", "author": "Raegan Weber"}, {"rating": 5.0, "review": "The Fire TV Stick is great! I have a non-smart tv in my upstairs bedroom and wanted a way to get media to it. This is the perfect accessory for doing just that. I love the smooth integration, between my Amazon Prime account and the interface of the software. It allows me to have another access point to my Amazon media, without having to spend a bunch of money on bulky equipment. When this is plugged in behind the TV, you have no idea that it is there. Would recommend this to people who have a Prime account.", "verified": true, "helpfulness": "0/0", "author": "dogpile"}, {"rating": 5.0, "review": "Arrived in a promptly matter. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Meriam Gardner"}, {"rating": 5.0, "review": "Enjoying it very much.  Easy to use.  Enjoy the movies and the music.  Wouldn't be without it.", "verified": true, "helpfulness": "0/0", "author": "Philter"}, {"rating": 5.0, "review": "Great alternative to monthly cable!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Morgan"}, {"rating": 5.0, "review": "I am very pleased.  It is working great.", "verified": true, "helpfulness": "0/0", "author": "Margie Kolby"}, {"rating": 5.0, "review": "So I don't claim to be any technology guru and don't plan to post some long extensive majorly specific review of the Fire TV Stick. I am just your average working mother/wife.  But I do LOVE this device.  I have the Chromecast and the Fire TV.  My children were always using the Fire TV so I decided to invest in the Fire TV Stick for my bedroom. So glad I did.  Now I have all of the same features in my room and I can enjoy all the Fire TV Stick has to offer in my own quiet domain.  I also love that I can link my Kindle to this device.  I plan on researching further to experience all this device can do but for now I am quite pleased with it.  It is very simple to navigate and I get to enjoy it all to myself!  Would definitely recommend this to all.", "verified": true, "helpfulness": "0/0", "author": "DaddysKeyz"}, {"rating": 5.0, "review": "We love the fire stick, however, it was extremely difficult to open the back to insert a battery. We ended up going online to find any helpful hints. So glad to see it wasn't just us that couldn't open it! We followed the advice of some fellow strugglers and finally opened it! Definitely needs some design improvement!", "verified": true, "helpfulness": "0/0", "author": "M. Kelly"}, {"rating": 4.0, "review": "Quick start up and easy navigation. Initially installed on a TV in a bedroom and performed well. Later moved it to a TV in the family room. Buffering made it unusable there. An XBOX in the same location performed much better despite taking longer to start up and get to my Netflix account. This may be related to the wifi reception in that room, but both units are using the same router.", "verified": true, "helpfulness": "0/0", "author": "Peter Branower"}]