[{"rating": 1.0, "review": "There is way too much buffering.", "verified": true, "helpfulness": "1/3", "author": "Marilyn S. Pease"}, {"rating": 5.0, "review": "So I'm an Apple guy, and I have an AppleTV on every TV in the house. Why do I have a Fire stick and why do I love it? It all boils to two things.First, I have a Prime membership, and I had not watched one movie or TV episode in the last two years of having Prime. I can't watch it on an AppleTV, but now I have access to all the Prime content from the place I actually want to watch it. All the content I have through Apple I have to pay for, but this is content I have access to bundled into the price of a Prime membership I would have anyway. The range of content seems to be growing, so for now I'm not bored.Second, it works like a charm. The internet speeds in my area are not great, sometimes our access slows way down, which stinks for a family that has all their content in the cloud. The Apple TV will often sit there for a while waiting to buffer before it plays. This can sometimes say the expected wait is 20 or 30 minutes. The Fire Stick however will buffer as it goes, and will display a compressed video until it can catch up to HD, then automatically switches over to brilliant 1080. This is an awesome feature when you want to watch the next episode of How I Met Your Mother, and you don't want to wait for the buffering. One other nice feature, speaking of TV episodes, is that you can hit play once and it will keep playing right into the next episode - Apple makes you select the next episode manually - not a big deal, but super convenient for binge watchers.", "verified": true, "helpfulness": "0/0", "author": "Burgess Family \"Shane\""}, {"rating": 5.0, "review": "Great product with lots of options for things to watch.  Very easy to set up.  All most as good as a smart TV.  I have done the cord cutting and don't have cable TV  and this gives many options for all kinds of programming.  The money saved over cable TV is wonderful.", "verified": true, "helpfulness": "0/0", "author": "VaroomVaroom"}, {"rating": 5.0, "review": "Excellent device! easy to setup.During the initial setup, I found my device to restart on and off ; I noticed that it needs to plugged on to a  power outlet (needs 1mAh , whereas my tv had only .5 supply). Hope this lil tip helps someone out there facing the same issue I did :) Overall, no complaints and great performance!", "verified": true, "helpfulness": "0/0", "author": "yuvashree dilipkumar"}, {"rating": 5.0, "review": "Love this thing. Have the Fire TV (full size) in the living room and picked this up for the bedroom TV to replace an aging WDTV product. This does so much more and the speed is perfect. Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jason Kloos"}, {"rating": 5.0, "review": "Been using it for awhile now and love it.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "I've had an Apple TV for a few years now, and loved the interface and integration of services, but the Fire Stick blows it out of the water. The UI is so easy to navigate, and looks great. The performance is top notch, zero lag when loading or playing video. All the services you could want are provided.Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "Aric Miller"}, {"rating": 5.0, "review": "Easy to use with steps that take you from the whole process. Lots of apps available to stream. Great price!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer wonder woman"}, {"rating": 5.0, "review": "Works perfectly. No bugs (yet), unlike Chromecast that I gave up on a year ago.", "verified": true, "helpfulness": "0/0", "author": "DashHound \"dachshund\""}, {"rating": 1.0, "review": "We've had the fire stick for a month and have yet to be able to watch a movie uninterrupted without streaming delays, even though we had a DEDICATED DSL INSTALLED at 10mg, the highest speed available on Century Link. Furthermore, if you search for \"Fire Stick Support\", one is connected to several operating manuals for PURCHASE. We could not find any support database or information, and NOTHING of the kind is included in the box. So, we've simply contributed to Amazon's growing profit margin.", "verified": true, "helpfulness": "0/1", "author": "D C Dan Lee"}]