[{"rating": 5.0, "review": "LOVE IT! Easy to set up and use. Always something to watch now on TV. So glad I finally ordered it!!!", "verified": true, "helpfulness": "0/0", "author": "nolegirl"}, {"rating": 5.0, "review": "The Fire Tv stick worked great. I am not too impressed with movie and Tv options offered. To be perfectly honest I was planning on giving up Netflix in favor of Prime but not sure that will happen. We started watching the Downton Abbey series and got to series five and found out we had to pay for it, even thou we had prime, but were able to get it thruour NetFlix ???", "verified": true, "helpfulness": "0/0", "author": "Paul A., Curnalia \"Paul Curnalia\""}, {"rating": 5.0, "review": "Love it!  Really easy to use!", "verified": true, "helpfulness": "0/0", "author": "Lisa Ayala-Davis \"Lisa\""}, {"rating": 4.0, "review": "The stick is great, highly recommend this product.  Easy to use, and lots of movies and shows at your finger tips.  Only complaint is, Amazon Prime does not have over 1000 free movies, you have to pay for most of them.  The list of free movies it small.", "verified": true, "helpfulness": "0/0", "author": "Anastasia Coffin"}, {"rating": 5.0, "review": "I love it. I can use it to mirror my phone now. Watch YouTube again n Netflix all in one location. It's portable and convenient. Great!", "verified": true, "helpfulness": "0/0", "author": "W. Harris"}, {"rating": 4.0, "review": "Really enjoying our new fire stick. Transformed our Tv without issues. My daughter loves all the learning apps. It's perfect.", "verified": true, "helpfulness": "0/0", "author": "nquinonez"}, {"rating": 5.0, "review": "Works great, better than the box which came with my Infinity connection.", "verified": true, "helpfulness": "0/0", "author": "gary w rodenz"}, {"rating": 1.0, "review": "this fire stick is for old tvs i have smart tv , my tv have all applications ready and i don't see the difference i won't to retun this thinks", "verified": true, "helpfulness": "0/3", "author": "marco"}, {"rating": 3.0, "review": "I like that I could just plug it in and use it quickly.  It would be better if I could search for movies I want to see instead of having scroll through movies to find one to watch.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Sanik"}]