[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "M. Perpina \"Ritz\""}, {"rating": 5.0, "review": "I love it! I can watch all the shows I love on YouTube on my nice big TV, instead of on my iPad. It is easy and convenient to use. I bet that when I get Amazon Prime it will be even better!", "verified": true, "helpfulness": "0/0", "author": "Roberta A. Lore"}, {"rating": 3.0, "review": "It works.", "verified": false, "helpfulness": "0/0", "author": "Graymalkin626"}, {"rating": 5.0, "review": "Love the fire stick! Have owned an Apple TV for years, but wanted a way to watch my Prime stuff on my TV without having to use AirPlay. The stick is inexpensive, and has streamed video excellently. It was very easy to install and set up. I am really glad I purchased it!", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "I have a chromecast and I believe that the FireTV is better. It works faster and, in my opinion, the remote is a great feature.", "verified": true, "helpfulness": "0/0", "author": "Bruno Carneiro Ferreira"}, {"rating": 4.0, "review": "Works great, would like to see more recent TV series such as homeland etc. available.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far I am very happy with it as long as it can connect to Amazon.  Had some problems with that.", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "This is a quality product. Netflix, Hulu Plus, HBO Go - basically every streaming service is available on the Fire TV Stick. It's an absolute must have if you are an Amazon Prime subscriber. The build quality of both the Fire TV Stick and remote are great.It also comes with a power adapter and HDMI extender. I have bought 3 of Fire Sticks and only needed to use the power adapter on an older TV (2010 model) because the USB port on my TV didn't provide the TV Stick with the necessary power. It takes up very little space and will travel easily.It is easy to use and very responsive. I bought one for my parents who were still using a first generation Roku - and the are loving the Fire TV Stick. Overall it was a great buy.", "verified": true, "helpfulness": "1/1", "author": "Michael C."}, {"rating": 4.0, "review": "Overall, I really like the Fire TV Stick. The pros are that it's very convenient to take on the road to be able to stream content from hotel rooms and such, requiring little space in the travel bag. Also menu seems very fast and responsive. Seems to be somewhat lacking in solid signal strength and does buffer a bit too much in my opinion, but I know signal strength varies greatly from location to location. However, in my office where the Google Fiber wireless router is, on some of the apps it still buffers almost constantly, whereas the Google Chromecast does not (on the same TV). So this is either in the TV stick itself (reception), or particular apps that maybe are causing the buffering.Some of the apps need more work, and I hope development continues on these, but overall it's a great device for a fantastic price for streaming, especially while on the road.", "verified": true, "helpfulness": "0/0", "author": "RandomPhoto"}, {"rating": 3.0, "review": "Works well but I haven't figured out yet how to browse the internet with it.", "verified": false, "helpfulness": "0/0", "author": "Aimee L. Baer"}]