[{"rating": 5.0, "review": "Surprisingly good - compares very favorably to Chromecast and almost as good as Apple TV (at half the price). Easy setup, it's a great purchase for $40 or less.", "verified": true, "helpfulness": "0/0", "author": "Cruise Cardinal"}, {"rating": 1.0, "review": "Check the support forums before you buy this product as you will clearly see numerous people complaining about steaming issues with certain apps. There are known problems with the device having choppy playback with Netflix and Hulu. This doesn't seem to happen while using other apps and Amazon content was always perfect. Our 720p Apple TV plays these apps just fine so it was nothing to do with our network connection. Tried several troubleshooting tips, but none fixed the choppy playback for Netflix and Hulu.", "verified": true, "helpfulness": "1/1", "author": "J. Baum"}, {"rating": 5.0, "review": "Love it! We have 3! We cut cable and bought these to stream Netflix, Hulu, and sling TV primarily. A little slower (literally seconds.....not enough to be concerned over) starting apps then turning on the cable box but so much cheaper! Highly recommend (we also did a prime trial but honestly more stuff on Netflix, so will be cutting out prime after 30 days....DO NOT NEED PRIME ACCOUNT TO WORK THIS FYI!)", "verified": true, "helpfulness": "0/0", "author": "M. Mahoney \"tgrlipgloss\""}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 4.0, "review": "Nice interface, works with Harmony Remote... but would be EPIC if i could control through our Amazon Echo.", "verified": true, "helpfulness": "0/0", "author": "Tim Hunt"}, {"rating": 5.0, "review": "Product works as advertised. The navigating around the screen is a bit cumberssome for an old guy like me, but it does the job.", "verified": true, "helpfulness": "0/0", "author": "r abel"}, {"rating": 5.0, "review": "Great portable item all of the streaming is great, I am thinking about buying the Fire TV box and donating my Roku Box.", "verified": true, "helpfulness": "0/0", "author": "Insight"}, {"rating": 3.0, "review": "I really do love this thing, wanted to give 5 stars and own several of them. But just one gripe - they're behind the times in the app department. They need to add Verizon and Time Warner Cable apps to the stick so one can watch on other tv's without the pricey cable box. Roku already has this. Come on Amazon! You're better than that!", "verified": true, "helpfulness": "0/0", "author": "Gaga"}, {"rating": 5.0, "review": "Works as it said it would and is only $40 - we regained some functionality lost with our apple TV - we now have both -a very cost effective addition.", "verified": true, "helpfulness": "0/0", "author": "Madeline Miller"}, {"rating": 5.0, "review": "Love it! Foolproof set up easy, easy to navigate, sorry I waited so long, worth it! Do it!", "verified": true, "helpfulness": "0/0", "author": "Murphy Bass"}]