[{"rating": 1.0, "review": "Where do I start? Plugged into TV. Setup went fairly quick.Tried to watch a couple of movies. Got the dreaded running circle in the center - Buffering. OK, show started. Here comes the circle again. Says no internet connection. Check internet and it says (Very Good). Went back to movie and it started up and then got the circle again. Well after about 20 something times. Reset router. Changed connection on TV. Removed the adapter. All with the same results.Then tried to search for my TV shows. They have them, but you have to PAY per episode. $1.99 to $2.99 each. Almost everything you want to watch is PAY PER VIEW!This does get Really HOT.As the circle turns and turns and TURNS...", "verified": true, "helpfulness": "0/0", "author": "toobad \"toobad\""}, {"rating": 5.0, "review": "Bought it for my husband who is disabled...and he loves it. Watches the older shows to the newest releases.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Burchfiel"}, {"rating": 5.0, "review": "I was hesitant in purchasing the fire stick.  I finally bought it and wow!  No buffering,  and it's lightening fast.  I would give it 10 stars if I could", "verified": true, "helpfulness": "0/0", "author": "Ashley  Klingel"}, {"rating": 5.0, "review": "Love it! My television is not a \"smart\" TV.  Fire stick has given us freedom from our small tablets or phone.  My grandson love he can watch Minecraft videos on you tube.  Great product!", "verified": true, "helpfulness": "0/0", "author": "hugci"}, {"rating": 5.0, "review": "Not enough stars to rate accurately.I plugged this into my TV, changed the signal source, followed the easy steps and ta-da it worked.Great picture quality and amazing supply of TV and movies.  With this, I don't need cable.  I pay for Hulu and Netflix and plan to add HBO as soon as it is available to purchase in a stream only format.Will never go back to cable.....ever", "verified": true, "helpfulness": "0/0", "author": "uncommon_boston"}, {"rating": 5.0, "review": "The picture quality is so much better than it was when I used my laptop.", "verified": true, "helpfulness": "0/0", "author": "lil ol me"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Carol L White"}, {"rating": 3.0, "review": "Received as a gift. Nice but needs more apps. Particularly looking for Coursera and EdX.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This turned my old 7 year old HDTV to a smart TV.  I not tech savvy and went on a You-Tude instructional video.  Did not even watch it for 2 minutes.  Once I got over my fear, set up was one easy as 1,2,3.  I am using Amazon Prime and Netflixs but there is still so much more.  Really enjoy watching movies on TV than on my I-Phone.  Would decently recommend to friends.  Wish I would have purchased soon.", "verified": true, "helpfulness": "0/0", "author": "Linda Alicea"}, {"rating": 5.0, "review": "Quite a lot of punch in such a small package. Immediateness after install was amazing. Unbelievable cache of goodies and movies. Granted, some are a little goofy and dispensable, in general very impressive", "verified": true, "helpfulness": "0/0", "author": "Niceshooz"}]