[{"rating": 4.0, "review": "Works as well as the \"other\" popular media streaming device, but is missing one of my most desired content (TED talks).  Works as well as the \"other\" popular media streaming device.  Well I'll try again, ROKU has a better search function in that it will deliver results from many sources (at one time that included Amazon).  The first time I reviewed this, Amazon did not post it presumably because I mentioned the competition.I have updated this review and moved my rated from 3 to 5 stars.  Amazon listened and added the TED TALKS app! So, I happy...Really needs a hardwire ethernet connection.  bumping it down one star!", "verified": true, "helpfulness": "0/0", "author": "Drummer Boy"}, {"rating": 4.0, "review": "the description was not clear as to whether or not the remote was included so I ordered another one.  That bites.product is good and works well.", "verified": true, "helpfulness": "0/0", "author": "B. Foss \"nana\""}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "1/1", "author": "moonhyoung cho"}, {"rating": 5.0, "review": "Took a little time and effort to get set up on wireless. Almost gave up...but so glad we didn't!Once we got it working, it works great! Super user-friendly. Gets great wireless signal. Has lots of apps and options. Much more user friendly than our smart TV. In fact, if I got a do-over, I would buy a regular (non-smart) TV, and just plug this handy gizmo in!Also love the phone app remote. Like it better than included remote.Plan to buy a couple more, and have gotten them for family. Makes a great gift!", "verified": true, "helpfulness": "1/1", "author": "LV"}, {"rating": 5.0, "review": "Best tech since Ipod", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Just OK", "verified": true, "helpfulness": "0/0", "author": "HotRod"}, {"rating": 5.0, "review": "Everything I hoped it would be: easy to set up and use, quality streaming. I have only had it operational for a couple of days, but so far I am quite pleased with it.", "verified": true, "helpfulness": "1/1", "author": "David Lloyd"}, {"rating": 2.0, "review": "Nothing but a pain. Got it for tv in bedroom to watch nextflix and it doesn't play half the time. I Have to unplug it and then plug it back in every time I use it because it says the network connection is lost. When it does play it stops multiple times to load. I Do not have this problem on any other tv just the one with the fire stick. I pre ordered mine and got one of the first ones made so I'll give amazon the benefit of the doubt, perhaps they worked out some bugs or I just got a lemon.", "verified": false, "helpfulness": "2/3", "author": "ronni"}, {"rating": 4.0, "review": "Fast, easy setup.  Only issue is crashes about once a week", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "I already own 2 chromecasts but bought this because I was able to get it at the PRIME price.  I love it so far, especially because of the remote.  The chromecast has limited apps and programs that I can use.  But the fire tv stick has easy access to all the prime shoes and movies.  And on top of that I am able to play games, listen to music, search the web, use apps.  I love it!", "verified": true, "helpfulness": "1/1", "author": "Aloha Ninja"}]