[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 1.0, "review": "JUNK-JUNK-JUNK!!! does not work!  do a goggle search and see.  Why they just did not leave the apps for smart TV.  They even sent a replace stick and still nothing register on the TV.  And of course you try to call or email back the person you talk to first you cannot.  You can only speak to someone who does not speak ENGLISH!!!!! Like their phone JUNK-JUNK-JUNK!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Chip"}, {"rating": 4.0, "review": "Was looking to upgrade the smart features of an older tv.  This was a great solution.  A lot more features, apps and games than what the TV came with.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 2.0, "review": "First, I have to say this product actually fit my needs and the specs seems pretty good. I got it this January 2015 and use for like two month, there is two things I really disappointed are, first, the content keep showing me blue screen with HDCP Unauthorized Content Disabled showed! I searched the reviews on Amazon and most of ppl have this issues and I know that the Amazon haven't send the major software updates for this big issue! The other thing is the connection of the wifi is bad for my case. I am currently using 50mpbs Comcast Internet speed and I am using my iPad to streaming movies for 1080p quality with no problem but I tried to get the smoothly movie experience on the Amazon fire TV stick but it's truns the HD movie will freeze or stop playing all the time. Even I watched the NBA on the nba league pass too. I don't think that's the problem of my internet speed or my wireless router because all other devices works fine! So that's the down side of this product makes me feel.The thing is, I dut like a product that you will feel stressful and needs to check online for the problems every time with new app or new functions when you install or try to use it!", "verified": true, "helpfulness": "0/0", "author": "Brian Sobrino"}, {"rating": 5.0, "review": "😊👍", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast, easy to use and great to be able to mirror my Kindle Fire HDX to my TV.", "verified": true, "helpfulness": "0/0", "author": "mctom"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I was interested in Sling TV and I needed just a bit more impetus to get me to try it out. I've been interested in the Fire TV and the TV Stick for tinkering purposes. The Stick worked great out-of-the-box and is quite zippy, especially compared to the Roku stick. Sling TV works great, as has any other streaming media we've thrown at it. The Fire TV and TV Stick are both notable because they are Android-based and you can use your computer to put additional programs and files on them through your local wireless connection. For example, I'm running the Firefox browser, a file system manager, a meta media collector/player, and a portable game console emulator. None of these appear the Amazon Appstore, but can be loaded and run nevertheless. Props for the remote, too... simple to use and very responsive. Would probably buy another but our Roku stick will suffice for now. Great job!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"byte_man\""}, {"rating": 5.0, "review": "We are very pleased with the Fire TV Stick  .  We can now watch so many programs at any time we want. We may even consider dropping our cable subscription which will save us some money.", "verified": true, "helpfulness": "0/0", "author": "Ms. Anna Albers"}, {"rating": 5.0, "review": "Happy with product", "verified": true, "helpfulness": "0/0", "author": "kai"}]