[{"rating": 5.0, "review": "Impressed with this little guy so far.  Set-up is a breeze, and the interface is easy to navigate.My Amazon account was pre-initialized based on the order, which was a nice surprise.The Netflix app is not pre-installed, you have to download it and then use the alphabet-picker interface to sign into your account.Had a few stutters in the refresh on the main screen.There is no \"reboot\" or shutdown option, but you can put it to sleep.Comes with Plex app for sharing home media.  I should mention that what you see is a list of available apps, you have to select them and download.It says it has 5GB of free space, which I assume will be consumed by additional downloads.Amazon Prime is preloaded of course, and each video or episode is marked with a \"Prime\" logo, which means you can watch it for free if you have a Prime account.I believe the OS is android and it is very similar to kindle HD, etc.  You can enable \"developer\" mode, which activates debugger output and appears to allow you to side-load apps (I haven't tried it yet).It comes with a short HDMI cable and charger with micro USB cable, which is a very nice value for the price.  I didn't need the HDMI shorty as I had enough room to plug it in directly.So now I have like 10 ways to watch netflix:  smart TV, roku, TIVO, firestick, android tablet, IOS devices...This is convenient, though, even if you have a smart TV, because you can flip between display sources and apps by just flipping through the input sources.  This is way faster than starting an app on the smart TV, and then going to a different source, because you have to exit the app and then restart it after changing.  Having a dedicated source means you can pick up where you left off.I've had other HDMI sticks and this is the best one so far.", "verified": true, "helpfulness": "0/0", "author": "tremlabs"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Kiki"}, {"rating": 2.0, "review": "Low quality.  Frequently non-responsive to clicks.  Abysmal interface in key respects such as 'browsing' through show lists in a linear fashion - one by agonising one.  Had to factory-reset it twice so far to get it working again. This is no apple TV.  Has the plus of offering the big three on a sole device - prime, netflix and hulu.", "verified": true, "helpfulness": "0/0", "author": "Robert Morris"}, {"rating": 4.0, "review": "I have had the stick for about a month now... and I have to say it is all the goodness of the FireTV box in a smaller package.  In general, I feel the thoughts of \"sluggishness\" is somewhat unfounded - I have not noticed any significant slowness as compared to my living room box.One item to note:  My wi-fi signal is max, with the AP connected to 75/75 Mbps over a Gigabit LAN.  So if the stick is making ajax or other calls to the amazon servers, other peoples' signals/networks may be the reason for the sluggishness.One other item to note:  Today my stick lost contact with my AP.  It would connect then immediately disconnect.  I rebooted my AP and the same behavior existed.  I then rebooted the stick, and it was able to connect again.  If it keeps happening, it will need to get addressed by the devs.", "verified": true, "helpfulness": "0/0", "author": "Count Rugen"}, {"rating": 5.0, "review": "Great product - loving it so far!!! Interface is easy and great extras!!!", "verified": true, "helpfulness": "0/0", "author": "tszuch"}, {"rating": 4.0, "review": "Getting it set up was a bit of a pain.  We bought this to use in our bedroom, but when we tried to set it up it started with an automatic update but had trouble connecting to the wi-fi to accomplish said update.  We checked our roku to see if it wasn't a problem with the wi-fi but that worked fine.  We ended up taking it downstairs to our family TV which is right next to our router and it was able to accomplish the update, though it took quite a while.  Once that was all done we took it back to our room and it has been working great ever since.  We have no trouble streaming from it...we primarily use it for Amazon prime, Netflix, and Pandora.  I would recommend the Fire TV Stick, just watch out for that first update (and we'll have to see how it goes with any subsequent updates).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works great - I am a Prime Member so this is ideal for our household.", "verified": true, "helpfulness": "0/0", "author": "Aunt Barbara"}, {"rating": 3.0, "review": "Despite being advertised as the most powerful \"stick\" out there, it stills feels sluggish and unresponsive at times. I could see this product being more worthwhile in the future, seeing as at the moment, there are very few supported apps. Pushing content to the stick itself is easy enough, although it usually just bugs out or sits there. Thankfully, the main reason why I purchased this was to stream Netflix on a non-smart TV. It accomplishes that well enough. Perhaps the next iteration will be a bit snappier and have more supported applications and features. As it stands, it's just okay.", "verified": true, "helpfulness": "0/0", "author": "Jacob Reed"}, {"rating": 1.0, "review": "tl;dr: Very pretty menus, crippled by Hollywood DRM, rushed to market for Christmas and before all the bugs have been fixed.  Wait 6 months, it will probably be great.HDCP unauthorised. Content disabled. That on a blue screen is the only thing displayed now.  It worked great the first day.  On the second day I got the Amazon Blue Screen of Death.  After resetting the device several times it started working again.  Day 3, no amount of resets will fix the error. The stick is plugged directly into the HDMI port of the my fairly new (2012 Vizio E70a3) and powered by the included wall wart.Performance of the remote i painful and annoying. button presses often stall or get missed, only to have the remote start randomly jumping around.Network performance is scattered.  It often has to be running for 5 minutes before it will connect to my 5Ghz (ac, low interference). The WiFi router is only 5 feet away from the stick.Overall the device is immature beyond being crippled by Hollywood DRM. It was obviously rushed to market ahead of Christmas. It looks pretty and hopefully the software will get fixed and it will be useful sometime next year.", "verified": true, "helpfulness": "3/3", "author": "Chris Pugrud"}, {"rating": 5.0, "review": "This does everything its supposed to do and more. Its amazing how much functionality could be packed into one little stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]