[{"rating": 5.0, "review": "Very happy with the TV Stick.  I have no problems with connecting and was easy to install.  So happy my tv is now a smart tv.", "verified": true, "helpfulness": "0/0", "author": "B. Killinger"}, {"rating": 4.0, "review": "My only complaint is the Remote is two small keeps getting hidden in chair or table. Maybe making it a bright color or bigger will help with this problem", "verified": true, "helpfulness": "0/0", "author": "James Smith"}, {"rating": 1.0, "review": "Worthless piece of crap that i would have been better off wiping my ass with the $20 i spent on it. Buffers like a stuttering retard off his ritalin making any video longer than 10 minutes  completely unwatchableMove it from 1 tv to another and it loses its memoryWorthless", "verified": false, "helpfulness": "0/2", "author": "Big Mike 0311 \"Molon Labe\""}, {"rating": 5.0, "review": "Didn't know I needed a remote until we used this fire tv stick. We used chromecast before which I also really liked but having a remote makes using this so much easier to use. Built in youtube app makes everything seamless. Not laggy at all which chromecast used to be when casting from my phone. Now I can just use the built in app instead and somehow it doesn't lag as much. Used this to sing along with youtube karaoke. We used this to watch some tv shows from amazon prime (wish they had better/more shows though).  Love it! I don't use chromecast anymore. Amazon got it right.", "verified": true, "helpfulness": "0/0", "author": "Novembreskye \"insomniac\""}, {"rating": 5.0, "review": "its really cool, this is my first streaming device", "verified": true, "helpfulness": "0/0", "author": "uncler"}, {"rating": 3.0, "review": "after update, it won't stay connected even when sitting beside the router.  while it tries to connect to a very good connection, the connection then shows up as a very weak signal.  things may have been this way even before the update, but I'm not sure anymore.  all I know is the thing was good for 30 minutes, and now it's totally awful.UPDATE:I used the extender, plugged the stick into the wall, and moved the unit to the side hdmi port placing it right above the router this time.  It seems to work like it was meant to now.  Ideally, extender or not shouldn't make too much of a difference.  In this case, it mattered.", "verified": true, "helpfulness": "1/2", "author": "Earl.Jornales"}, {"rating": 5.0, "review": "Arrived before estimated date. Was easy to set up, Works great.", "verified": true, "helpfulness": "0/0", "author": "John K. \"JK\""}, {"rating": 5.0, "review": "Bought this as a Christmas gift for a friend of mine, never seen her so tickled over something, she loves it, great job amazon", "verified": true, "helpfulness": "0/0", "author": "Movie Guru \"3ddude\""}, {"rating": 5.0, "review": "Glad I pre-ordered it on a reduced price.  Great little product.  Setup was pretty straight forward, followed the instructions and had it running in less than 30minute.  Enjoying the HBO series Rome now.  :-)", "verified": true, "helpfulness": "0/1", "author": "Warp8x"}, {"rating": 5.0, "review": "Don't get to use it as much as i would like but it is portable and works well", "verified": true, "helpfulness": "0/0", "author": "EM"}]