[{"rating": 5.0, "review": "Yes it works good.  Thank You", "verified": true, "helpfulness": "0/0", "author": "Paul Norton"}, {"rating": 4.0, "review": "It works great. We use it often but wish there was a standby mode when the TV is off.  Update it to wakeup when the TV turns on or using the remote so it wouldn't stay warm to the touch  when not in use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it, it's the best thing next to expensive cable...", "verified": true, "helpfulness": "0/0", "author": "carla"}, {"rating": 5.0, "review": "Love My Fire Stick!! It's fast and never buffers no matter which app your using. Would highly recommend over Apple Tv cause of value and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Melissa Patterson"}, {"rating": 4.0, "review": "Very good device. Interface is a little clunky but overall a very good product", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "I bought the firestick with some reservation, but after having it for a few months its a great value with Amazon Prime! The movies are incredibly sharp with great detail with 1080P. Love it!", "verified": true, "helpfulness": "0/0", "author": "Joel Tilson"}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Kelsey  Stockwell"}, {"rating": 2.0, "review": "great idea and easy to work, but with in app purchases it was a let down, and limited content even worst...i can get all i need on an xbox or ps3 and that makes this item not that good, besides having to plug it in to a power supply (i would say if you have nothing its worth getting) but if you have stuff... don't...", "verified": true, "helpfulness": "0/0", "author": "Luxas"}, {"rating": 5.0, "review": "I have a Roku stick which I really liked, but the Fire Stick is even better and for less money.", "verified": true, "helpfulness": "0/0", "author": "Bob Graybosch"}, {"rating": 5.0, "review": "Did not want to spend the extra $15.00 (per TV for the cable boxes)a month for the TV on our teens  rooms.  The AMAZON stick is the best invention ever.  $39.00 and they can watch all their shows.", "verified": true, "helpfulness": "0/0", "author": "megan"}]