[{"rating": 2.0, "review": "I thought I was going get prime for 30 days for free but I was wrong", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it's virtually invisible and it works!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire Stick is the answer to make a dumb TV very smart! Hardware wise it's on the lower end compared to other devices on the market but it's adequate enough for what I need. This stick has a lot more functionality than a Google chromecast and it's only $4 more.", "verified": true, "helpfulness": "0/0", "author": "Andrea G. Guerrieri"}, {"rating": 4.0, "review": "Much better than chromecast. No need to sync up your phone/ tablet. Just grab the remote and go. There have been some connection issues with third party apps like HBO and Netflix. However, this is usually remedied by just unplugging it for 5 seconds.", "verified": true, "helpfulness": "0/0", "author": "Drew P Millitello"}, {"rating": 5.0, "review": "Fire TV Stick joins my other cable alternative devices - Chromecast and Roku - to round out my TV access suite. What I like most about the Fire Stick is the immediate access to, and promotion of, Amazon original series that are free w/ Prime. Thoroughly enjoying it. Can't wait for next seasons of Mozart in the Jungle, and Alpha House.", "verified": true, "helpfulness": "0/0", "author": "DS23"}, {"rating": 5.0, "review": "It is great totally worth the money I am always entertain now the games and the different time of streaming it's awesome", "verified": true, "helpfulness": "0/0", "author": "Marcelo gallardo"}, {"rating": 3.0, "review": "Not enough apps.", "verified": true, "helpfulness": "0/0", "author": "bcmurph"}, {"rating": 1.0, "review": "Doesn't work... pissed off.  Waste of money", "verified": true, "helpfulness": "0/0", "author": "PamGlenn"}, {"rating": 5.0, "review": "YouTube Netflix you name it no more wires connecting your phone to your TV and being interrupted with phone calls alerts what have you. Just sync to wifi and use the remote and off you go", "verified": true, "helpfulness": "0/0", "author": "Richard Chiolo"}, {"rating": 5.0, "review": "I love love love this!  Now I wish I had purchased it earlier!", "verified": true, "helpfulness": "0/0", "author": "nmrich"}]