[{"rating": 5.0, "review": "Works as well as the box.", "verified": true, "helpfulness": "0/0", "author": "Ladycop 415"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing. Very fast and easy to use. Phone app works perfectly as a remote control. A must have with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Boiler98"}, {"rating": 4.0, "review": "As an owner of chromecast, roku and the fire stick I have used a lot of these kinds of devices. In general the Amazon fire stick works very well and is my current go to for my main TV. It does a very nice job presenting the whole Amazon video ecosystem, even putting all the free prime items together in one place, rather than doing some weak marketing attempt to force users to wade through paid content to get to the free - a very nice touch.  Two things I really like that are not obvious. First the parental controls are head and shoulders above other solutions. Part of the issue is that services like Netflix which have apps for fire stick have horrible approaches to this. So having them in decent form on the fire stick is really great, helping cover for inadequacy in the numerous apps I have loaded. The second thing I really like is the selection of apps is really much better than expected. In fact there is even one that turns the fire stick into an AirPlay compatible device, which if you are on ios is really great (think it was $.99 for that app though. Well worth it!)A couple nit picks I hope will get addressed through an update. The parental controls should be set up so that the parent can okay a show or an app use one time at a time, as well as an option to allow use for some time period. Right now it prompts you to just disable the setting, which means after a show you have to remember to go in and turn the setting back on. The other item is that I really wish they had the simple.tv app available for it, like it is on roku. Again, these are but picks because in so many ways the fire stick does everything else really well!Update - changing to 4 star because of the parental control not auto-engaging after allowing access to an app. What this has ended up meaning is that more often than not the parental controls get forgotten. There really needs to be options for: 1 time approval for that one app/show/etc., a time based approval (for next 1/2/4 hours), and then a permanent off option (which is basically what it is now). This should be integrated into the UI right at the point where the content is blocked.", "verified": true, "helpfulness": "0/0", "author": "D. Rosing"}, {"rating": 5.0, "review": "Great product. Hides away in the back of my home audio receiver and gives me quick access to all my favorite apps.  I actually prefer this to my smart tv menu.  It's quick, responsive, intuitive, and sleek.  Amazon is putting a lot of resources into making this a comprehensive media stick and it's paying off.  My only complaint is that the remote feels just slightly cheap, and I really do mean just slightly.  You can feel the seams for the battery port when you pick it up and it's balance is slightly biased toward the bottom.  I'm just really picky about my remotes.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Ryder"}, {"rating": 5.0, "review": "User friendly, fun to use, and endless entertainment! We have downloaded apps, watched movies/tv series, uploaded photos and streamed music. Much better than Apple TV. Plug and play and the best part is we can move it to any of our TV's.", "verified": true, "helpfulness": "0/0", "author": "Jennifer R Parsch"}, {"rating": 5.0, "review": "I love this!  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Andrew Cole"}, {"rating": 4.0, "review": "I find the fire TV stick very useful", "verified": true, "helpfulness": "0/0", "author": "Beverly Bechard"}, {"rating": 5.0, "review": "love it.. love it...love it..", "verified": true, "helpfulness": "0/0", "author": "Lori Bailey"}, {"rating": 2.0, "review": "This thing is awesome when it works, which is about 50% for me. Sometimes it turns on, sometimes it doesn't. Have to unplug from my tv and re plug it back in to get it to work, and that doesn't always help", "verified": true, "helpfulness": "0/0", "author": "Why"}]