[{"rating": 3.0, "review": "I love my Fire TV, but this Fire Stick seems to be lacking a bit. I had my FireTV downstairs and the Stick upstairs in my room. Apparently it needs to be closer to the wireless router to function properly.... but none of my other wireless devices have this problem in my room. So my solution was to bring the Fire TV upstairs and leave the stick downstairs. That seemed to do trick. But as always, I love my Amazon TV!", "verified": true, "helpfulness": "0/1", "author": "liz"}, {"rating": 1.0, "review": "Amazon said the delivery date would be in 5 - 8 days, but it took a month.  I was not happy about that.This device is total junk!  It stopped working after a few months - so did the replacement after a couple of months.  Dealing with Amazon with this issue was very time consuming.  It took me about 40 minutes on the phone (mostly on hold) for Amazon to finally commit to replacing this unit (probably with another piece of junk.)Don't waste your money.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 2.0, "review": "The Wi-Fi range is extremely weak.", "verified": true, "helpfulness": "0/1", "author": "C. Diemer \"Uncle Kirby\""}, {"rating": 5.0, "review": "You can notice that its a bit slower than the Fire TV, but I already knew that and I all I can say.. is that for the price and what it give... its a great product. I would buy more and even give them as gifts.", "verified": true, "helpfulness": "0/0", "author": "Felipe Amigo"}, {"rating": 1.0, "review": "Wow, what a disappointment.  Being a prime member, I was excited about this.  However, after trying to use it a few times, my excitement has waned.  Here's the problem: it won't stay connected to WiFi.  My AppleTV and Roku 2 are connected to the same TV, and they have no such problems.  It's so bad that I end up using the Roku to access Amazon content.  I didn't return it because I figured that Amazon would send out new firmware, and things would be better.  Unfortunately, that's not been the case.", "verified": true, "helpfulness": "0/0", "author": "Boulder1259"}, {"rating": 5.0, "review": "So happy that my husband got me the fire stick. We can now watch Netflix and do other things from the TV in our room. It's very user friendly and easy to use. I would recommend to everyone! Thanks Amazon...you continue to be awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Andrea A. Petagna"}, {"rating": 2.0, "review": "I was really looking forward to getting this device. I love Amazon and was hoping it would perform as advertised. Unfortunately, I was one of the unlucky ones that received a unit that simply refuses to work consistently. Very unhappy. Straight out of the box, the device worked for maybe an hour and then nothing. So I unplugged the stick to reset and it worked again for half of a movie. The stick never works longer than the length of a movie. So if you're going to purchase - you may get a good device - you may not.", "verified": true, "helpfulness": "0/0", "author": "TTVL1923"}, {"rating": 1.0, "review": "DO NOT BUY THIS PRODUCT!I have been an Amazon customer for over twelve years and when I bought this Fire TV Stick on December, it came with a thirty day free Prime trial. Because I hadn't used Prime for over two years, and hadn't used a free thirty (30) free trial during that two year period, I was, according to all the Amazon representatives, eligible for the thirty day free trial to see how I liked the Fire TV Stick.Despite more than seven hours on the phone with /Amazon Customer Service, and despite all sorts of assurances ranging from a promise of a free year of Prime, a thirty dollar credit to buy a Prime membership, e-mail assurances that it would be fixed within forty-eight hours ( It's been four days!); and even a follow up e-mail saying twenty four hours had gone by but he was still working on it, phone calls from Amazon to me ( Blaine), I have never received my thirty day .free trial and do not expect to.Amazon's much praised \"customer service\", as far as I'm concerned, has lost all credibility with me.William Temple", "verified": true, "helpfulness": "0/1", "author": "William Jordan Temple \"Reader\""}, {"rating": 5.0, "review": "You must try this if you do not have a smart tv.  Before this, we used our PS3 to connect to netflix and Amazon.  We would have to turn on the PS3 then change our input on our tv.  Then we would have to turn off and on to change which system we wanted to use.  With the amazon Fire TV stick, it is so easy to navigate between these systems.  And it just has so many cool features.  We are so happy with this.  I plan to buy more for family members.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "i did not realize it cost monthly fee.  the advertisement was deceiving to me.", "verified": true, "helpfulness": "0/0", "author": "avery williams"}]