[{"rating": 4.0, "review": "It works as aspect-ed. Too Bad I can't include the stick operation on my universal remote TV control", "verified": true, "helpfulness": "0/0", "author": "B Kuler"}, {"rating": 5.0, "review": "Love it!!! Can stream my Netflix and more now!!! Plus amazon prime has so much to offer!", "verified": true, "helpfulness": "0/0", "author": "Firefighter in Florida"}, {"rating": 4.0, "review": "Super fast shipping!! Great price, easy to install and works great!!", "verified": true, "helpfulness": "0/0", "author": "tracy stewart"}, {"rating": 5.0, "review": "Didn't know what I was missing!  I now get to watch some of my favorite shows and movies anytime I want.  And so easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Nighthawk \"Nighthawk\""}, {"rating": 5.0, "review": "Apparently there are a lot of \"lemons\" in this device. I guess I got lucky. I haven`t had any problems at all.I was up and running in no time. Also Amazon went out of there way to help me with another issue with the shipment of this device. So five stars there also. I hope their quality control improves. When I see almost 2000 one star reviews that worries me.", "verified": true, "helpfulness": "0/0", "author": "Norm Brooks"}, {"rating": 5.0, "review": "We have 5 of these, and they are fantastic. We just have these plugged in to each TV, and the TV is mounted on the wall, very simple and low power. The phone app is fantastic as well.", "verified": true, "helpfulness": "0/0", "author": "John Palmer"}, {"rating": 1.0, "review": "I wanted to love this product! I am a serious Amazin fan. It is the only site I but off of! In comparing this to my Roku it is much slower and loses connection frequently. Which is frustrating! The remote makes loud clicking noises when it is used which wakes up my husband when sleeping at night. The fast forward buttons don't really tell you how fast it's going and if you're watching HULU I find myself watching a lot of commercials because of trying to find where I left off. I will be selling this product in craigslist and buying another Roku for my bedroom. It just isn't worth all the trouble.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Michael"}, {"rating": 5.0, "review": "It works great...", "verified": true, "helpfulness": "0/0", "author": "Mary Curran"}, {"rating": 5.0, "review": "A very smooth interface, quick & easy setup, great streaming!", "verified": true, "helpfulness": "0/0", "author": "Jeff Urbanski"}, {"rating": 3.0, "review": "I would like to give this product four or five stars, but upon receiving the product, I discovered that SD is not an option when streaming through Fire TV. I should have done more homework. We have a slow internet connect, so were streaming SD versions of items available on Amazon through my laptop, which worked great. Cannot do this through Fire TV, according to the help chat I just completed. I can adjust the setting to stream at a lower quality to prevent constant buffering,  but my only purchase option will be HD, so I'm paying the higher price still. I do not have a higher speed internet option in my rural area, so this is disappointing. Hoping Amazon will consider updating this product to allow for the SD streaming purchase option.", "verified": false, "helpfulness": "0/0", "author": "Catherine G"}]