[{"rating": 5.0, "review": "Had it working in 5min.", "verified": true, "helpfulness": "0/0", "author": "john b."}, {"rating": 5.0, "review": "set up was easy and it works great", "verified": true, "helpfulness": "0/0", "author": "PPP"}, {"rating": 5.0, "review": "This is much easier to use than two different models of Roku we have used in the past. It has turned out smaller kitchen TV into a streaming behemoth.  We have been using it for a week now and I like how it does not drop its wifi connection.  The Roku one is constantly dropping the signal and forcing me to re-login every single time.  We don't even use that one anymore.We will definitely be getting another Fire TV Stick soon.", "verified": true, "helpfulness": "0/0", "author": "Geek Dad"}, {"rating": 4.0, "review": "I hope to love but it's on backorder so truthfully I it works as the reviews indicate", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 2.0, "review": "I was so happy to get the new Fire TV Stick. I have a Chromecast but wanted this since I did not need any other device to watch it on my television. Set up was fairly simple, I had to unplug and retry 2 or 3 times to get the update to download but it finally worked. The quality is great and having a remote is wonderful. However, not even 2 days after I got it all set up I got a blue screen that said, \"HDCP unathorized. Content disabled.\" I had sound but only this blue screen. I tried everything...unplugged it (from tv and wall), reset to default settings, reset my router, cleared data and cache (per instructions on support page from Amazon), deregistered from my Amazon account and reregistered it...NOTHING worked. I looked at review on Amazon and found one that had the same problems but no solutions. So, I contacted Amazon support and this is the response I received:\"I'm sorry for the trouble you had streaming on your Fire TV stick. We certainly don't want our customers to experience such issues.HDCP (High-bandwidth Digital Content Protection) is a digital copy protection system that helps to prevent unauthorized duplication of digital audio and video content when a content player is connected to devices such as monitors, TV, or other external devices. To resolve this issue please try disconnecting any other displays you have connected to your TV.Please unplug all HDMI inputs from the TV, Unplug TV from power. Plug TV back in. Plug fire stick back in.If this doesn't resolve the issue, please contact us via phone so we can collect some required information while you are online and involve our technical team into this.\"I did this and it worked...for not even 2 days. So, now I have the blue screen again with \"HDCP unauthorized. Content disabled.\" So, I guess in order for this product to work I will have to unplug everything from my tv every 2 days...definitely not something I want to do just to watch a few shows. I can use my Chromecast and not have to worry about it. If you get one...I hope you don't have this issue or I hope Amazon has a fix for this ASAP.", "verified": true, "helpfulness": "13/15", "author": "CAMommy7"}, {"rating": 3.0, "review": "Will know more when I finally get it....Some day in January...Purchased in October *sighs*", "verified": true, "helpfulness": "0/2", "author": "chelsea"}, {"rating": 5.0, "review": "Works fine now, we had some issues connecting to our network and had to unplug cord and replug for solution.", "verified": true, "helpfulness": "0/0", "author": "David Rank \"Book Reader\""}, {"rating": 5.0, "review": "I am LOVING this Fire TV Stick.  It works GREAT, the remote is awesome and doesn't require you to point it just right.  Its quickly responsive.", "verified": true, "helpfulness": "0/1", "author": "Sara M Rutkowski"}, {"rating": 1.0, "review": "It's difficult to tell what's on Amazon Prime or is to be paid for. It doesn't ask you to confirm if you are purchasing a TV show so it's easy to accidentally purchase shows you think are part of Prime.Also didn't connect to my internet for the first few days. All other devices were connected fine.", "verified": true, "helpfulness": "1/3", "author": "Kenneth Han"}, {"rating": 2.0, "review": "Not as great as the Roku 3.  Also deducted a star because of the unskippable welcome video after first installing.", "verified": true, "helpfulness": "2/6", "author": "Matthew"}]