[{"rating": 4.0, "review": "Late delivery...but fantastic device", "verified": true, "helpfulness": "0/0", "author": "Michael Painter"}, {"rating": 1.0, "review": "Be forewarned if you have a smart TV you don't need this. Also if you have a TV with a DVD player built in this won't work on it. It took us three calls to customer service to have this be determined. Extremely frustrated with customer service but this seems to be typical that not all agents seem to have to knowledge to access the same information so they can help you the first time.", "verified": true, "helpfulness": "1/1", "author": "P. Elson \"Avid Reader\""}, {"rating": 1.0, "review": "Couldn't find much to watch that didn't take upgrading to Amazon prime, so I signed up for that, then the fire stick started scrolling on its own.  I couldn't control it with the remote, so I unplugged it.  The stick was very warm to the touch, and I haven't used it since.....", "verified": true, "helpfulness": "1/1", "author": "Bob"}, {"rating": 5.0, "review": "I really like the simplification of this stick. I don't like that you still have to purchase most movies and TV shows even with Amazon Prime. I would recommend it though!!", "verified": true, "helpfulness": "0/0", "author": "Darlene Beasecker"}, {"rating": 5.0, "review": "WOW. I love the Fire TV Stick.  It was easy to install, easy to use and fun to watch. This is really a good alternative to the television.", "verified": true, "helpfulness": "0/0", "author": "spanish girl"}, {"rating": 5.0, "review": "This product works great, and was really easy to startup, but found the remote control almost impossible to open for inserting the batteries. Hope there are more programs like Bosch & Mozart Jungle.", "verified": true, "helpfulness": "0/0", "author": "Linda Pelto"}, {"rating": 5.0, "review": "I love this thing! It's everything I expected and MORE!", "verified": true, "helpfulness": "0/0", "author": "slw3stacy \"slw3stacy\""}, {"rating": 5.0, "review": "Very easy set up and a large variety of movies and TV shows. Picture seems so much clearer. We love it.", "verified": true, "helpfulness": "0/0", "author": "Peggy DeLong"}, {"rating": 5.0, "review": "It's awesone!", "verified": true, "helpfulness": "0/0", "author": "sexyladi24"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Pamela Danberg"}]