[{"rating": 5.0, "review": "Ordered it to use with a Slingbox M.  Utilizing the Amazon App it works as expected on my home network.  I have Apple TV too, but this is much easier to utilize and smaller.  I was able to power the Fire Stick from a USB port on the TV so there is no need to run the AC power supply that came with the device.", "verified": true, "helpfulness": "0/1", "author": "MB"}, {"rating": 1.0, "review": "Stops and starts even when the signal is very good.  Freezes, have to turn off tv, wait a while, then turn back on.  Frustrating!", "verified": true, "helpfulness": "3/3", "author": "Elton Rouse"}, {"rating": 4.0, "review": "Works good.  I just wish the remove was better and had keys.", "verified": true, "helpfulness": "0/0", "author": "scofflaw"}, {"rating": 5.0, "review": "This item is great for the cost and programing available.  I would like to see better perks for Prime customers.", "verified": true, "helpfulness": "0/0", "author": "christopher buczkowski"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "Works very well once connected to wifi (which wasn't a problem at all; just follow the instructions). The quality of the picture is amazingly clear and sharp. I've got a blu-ray player that also runs Amazon Prime & Netflix, but is glitchy and has to reload occasionally - not so with the Fire TV Stick. Only a one time issue, it didn't wake from its sleep, so I had to disconnect it from power source and TV, but once plugged back in everything was back to normal, and and I haven't had the issue again. I have now had it for over a month.", "verified": true, "helpfulness": "0/0", "author": "Frank H"}, {"rating": 4.0, "review": "Easier way to stream television shows and movies.", "verified": true, "helpfulness": "0/0", "author": "J. Shorter"}, {"rating": 1.0, "review": "I could never get good reception to the stick. I had to go back to Airplaying from my iPad to my Apple TV. I had high hopes, though. Nice design.", "verified": true, "helpfulness": "1/1", "author": "Amazon girl"}, {"rating": 5.0, "review": "Amazing, works great", "verified": true, "helpfulness": "0/0", "author": "laddy brown"}, {"rating": 4.0, "review": "I'm very pleased with this product which was easy to install.  At first, I didn't switch the HDMI so it didn't work.  After changing that, it was good.", "verified": true, "helpfulness": "0/0", "author": "Geneva Burns"}]