[{"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Don Lobacz"}, {"rating": 3.0, "review": "The Fire TV Stick works well.  No problems yet but we've only used it for several days.  What I am disappointed in is that virtually all streaming content on Amazon is paid only. What is the use of Premium if we must pay for all content?  Netflix is a much better deal.", "verified": true, "helpfulness": "0/0", "author": "Gary M Brown"}, {"rating": 5.0, "review": "Love this item", "verified": true, "helpfulness": "0/0", "author": "Jacqueline M. Ransaw"}, {"rating": 4.0, "review": "This item worked very well when watching a program on Netflix. I watched last year's episodes of a program I recently discovered. The Fire TV Stick worked very well. I attached it by putting the cable it came with into a different HDMI input than the one my internet, phone and tv provider uses on the back of the TV. I simply chose between the different input sources using the TV remote to watch my usual providers programs or those of Netflix, which must be purchased.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 4.0, "review": "Great product and a must have if you are a Prime member. I do however prefer my Chromecast over this any day. At least my Chromecast will cast Pandora and YouTube. The firestick only cast Amazon Prime Video and the few apps they are contracted with. Not bad for the price though.", "verified": true, "helpfulness": "0/0", "author": "Stage 1 Productions"}, {"rating": 5.0, "review": "lots off fuj", "verified": true, "helpfulness": "0/0", "author": "Barbara J. McCabe"}, {"rating": 5.0, "review": "very good!", "verified": true, "helpfulness": "0/0", "author": "yangeunho"}, {"rating": 2.0, "review": "Set up was fairly easy and quick. I plugged the small device into my TV USB with no problem and then plugged the other end into my nearby outlet.  Next, I followed the on-screen Fire Stick registration steps and connected to my WiFi. Then I set up the Fire Stick app on my android phone and apple iPad for voice activated remote control (This was optional). Wah La! All done in less than 20 minutes.  I was scrolling through all the movies and video options and was happy to easily access Pandora for music streaming with just a couple of clicks of the remote. I was loving it.All was great until I tried to access Netflix. The main reason I purchased the Amazon Fire Stick was to access Netflix in my living room. I have access to Netflix on other TV's in my home and on all of my devices, but I did not have a smart TV in my living room so this seemed to be a great option.  Unfortunately, although I have a strong WiFi connection and all the other features and apps work just fine - Netflix does NOT WORK with the Amazon Fire Stick. At times it will connect to Netflix momentarily and allow you to select a show only to tell you that the title is unavailable. Many times it won't even connect to Netflix but will ask me to register Netflix again. I never have a problem with Netflix on any other device.  It is a very specific issue with the Fire Stick. I've learned that many other consumers have complained about the same issue. I just ended up putting the Fire Stick back in it's box and away in a drawer.  Kind of a waste of money for me personally. :-(", "verified": true, "helpfulness": "1/1", "author": "Arlene Tanner"}, {"rating": 5.0, "review": "It's been great to watch Prime and Netflix on our television. This is easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "It works beautifully and I downloaded an app called Air play npn and I can air play and mirror my iphone and mac on it just like apple tv! :D !!!", "verified": true, "helpfulness": "0/0", "author": "Haifa Faraj"}]