[{"rating": 3.0, "review": "I would like it to work with my Synology movie server, but it doesn't.  Maybe someday they can get DS Video working.  If Prime member it is nice, but otherwize it's like having a hotel box where you pay way too much for stuff you'd get on cable or at Red Box.Interface is good, though the remote is really small.", "verified": true, "helpfulness": "0/0", "author": "Steaming Zephyr"}, {"rating": 5.0, "review": "I was please how easily I was able to set it up and use it as well.", "verified": false, "helpfulness": "0/0", "author": "John McCarthy"}, {"rating": 4.0, "review": "I purchased this Fire stick to replace my chromecast and I am very happy. I really like that I have more app choices than chromecast and the unit seems to operate better. I also added sling tv to it and it works fantastic!", "verified": true, "helpfulness": "0/0", "author": "Larry Blenn"}, {"rating": 5.0, "review": "Love it.  Install we easy. Nice selection of movies. Great deal!", "verified": true, "helpfulness": "0/0", "author": "David B Coates"}, {"rating": 1.0, "review": "unable to use fire stick due to too low of internet speed offered in my area ( 1.5 ) max. had everything checked out by a teck even changed  out modem and router and DSL line ! Fire Stick require a faster speed to work efficiently ! really liked the program and concept !", "verified": true, "helpfulness": "0/0", "author": "roy armstrong"}, {"rating": 5.0, "review": "Way easier to use than Chrome, and of course, includes Amazon.", "verified": true, "helpfulness": "0/0", "author": "Joshua Grant \"JB\""}, {"rating": 5.0, "review": "I have a Chromecast and Fire TV Stick.  My wife has an iPhone and I have an Android device which we have used for Chromecast viewing.  While the Chromecast has some limited uses for us, the Fire TV Stick blows it away in typical viewing.  By typical viewing I mean Netflix, Amazon Instant Videos, Sling TV, and more.  While I consider myself a geek and high tech, as others would consider me as well, the simple but effective remote for the Fire TV Stick just blows away using your smartphone.  There is just something nicer about navigating and selecting what to view on your TV with a the Fire TV Stick remote versus picking it out on your phone and submitting your selection to your router and sending it onward to the Chromecast.  We always have our smartphones on us, but it just doesn't feel the same.  The viewing experience is greater and better.  Choose this over the Chromecast for your high tech husband and especially everyone else in the world who isn't a geek.", "verified": true, "helpfulness": "0/0", "author": "Peter Roberts"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/1", "author": "TJ"}, {"rating": 5.0, "review": "We love it! We also have another company's product that works similar to this, but the nice thing about this is it doesn't have to be connected to a device to use it...just WiFi! It works great and I have only lost the tiny remote twice! Bonus: If you lose the remote, you can just download the app to your phone and use that as a remote. I think my couch ate the remote the second time and I have yet to recover it.... I still have hope, though.", "verified": true, "helpfulness": "0/0", "author": "Charity"}, {"rating": 2.0, "review": "Once it finally connected to the internet, I was very impressed with the fire stick. It took me over an hour to get it to connect to my wifi when I first got it. Then the issue wasn't as prominent, it still had trouble here and there but it was rare. I have had it for a little less then a month and now I can't get through a 45 minute show without it buffering or losing connection. You can see how frustrating that would be. And it now it does this new thing where it kicks me out of Netflix then won't connect and I have to load it again. I am becoming more and more disappointed with this product.", "verified": true, "helpfulness": "0/0", "author": "Cortney"}]