[{"rating": 5.0, "review": "I love this thing", "verified": true, "helpfulness": "0/0", "author": "Erika"}, {"rating": 5.0, "review": "Works great!! Bought it for Sling TV app and for Amazon prime which I will be getting in the next month or so.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Great purchase.  I was using a laptop for prime videos and the wifi on it died.  The Fire Stick is a great replacement.  Since it came tied to my prime account, it only took a couple of minutes to set up.  Then I watched to short video on how to use it, and that was all that was needed.  I did find once that the stick was taking a long time (15 seconds or so) to connect to my wifi once.  I just unplugged it and plugged it back in and it connected immediately.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "W. Carlson"}, {"rating": 5.0, "review": "Love the firestick. Works better than I had hoped. Highest recommendation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it good love it", "verified": true, "helpfulness": "0/0", "author": "johnny straight"}, {"rating": 3.0, "review": "I don't know if it's Time Warner's incredibly awful service or the Fire TV stick that's to blame, but I have to reboot the stick almost every night.  My wife watches a lot of Netflix, and after about 2 hours of watching, it hangs...resumes....and then says there's no internet connection.  So we wait, and eventually I put my book down and stroll over to the tube, remove the power plug, plug it back after a few seconds, and everything's ready to go.  I've done speedtests from Time Warner's servers and it seems I'm getting my usual poky 11 mbps down, .6 mbps up, so it's most likely not that.", "verified": true, "helpfulness": "0/0", "author": "Emmett Hoops \"at78rpm\""}, {"rating": 1.0, "review": "Does not work, it will not connect to the internet", "verified": true, "helpfulness": "0/0", "author": "Bob Azbell"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Craig Arden"}, {"rating": 3.0, "review": "Very slow compared to its description. Acceptable, but not outstanding.", "verified": true, "helpfulness": "0/0", "author": "J. Meekins \"bigDADDY\""}, {"rating": 5.0, "review": "Bought three of these, and couldn't be happier. We decided to ditch our overly priced cable and try using a streaming device. Have had installed for a few days and so far they far exceed my expectations.", "verified": true, "helpfulness": "0/0", "author": "Whiskey soup"}]