[{"rating": 5.0, "review": "I have an Apple TV2 as well. We rarely use it anymore. The content available from Amazon Prime is good.Much less buffering than on Apple TV. An incredible bargain. Makes me that much closer to cutting the cable cord and only keeping Internet.", "verified": true, "helpfulness": "0/0", "author": "Spencer"}, {"rating": 5.0, "review": "I've really been disappointed with Netflix- nothing I ever want to watch is available! A friend suggested I try Amazon and I love it. Almost everything I've queried has been available for streaming. I also really enjoy their web series Catastrophe.", "verified": true, "helpfulness": "0/0", "author": "Jim M \"Kip 7\""}, {"rating": 5.0, "review": "I travel often for work and this thing is a life saver when you're bored in a hotel room!", "verified": true, "helpfulness": "0/0", "author": "archetype52"}, {"rating": 4.0, "review": "Already a Prime member with a wireless router, the setup was very easy, simply plug it in, set the input to the correct option and follow directions.  The grandkids use it regularly when they visit.  The content availability is a broad selection of music, TV shows, and movies.  Recommend to anyone looking for a viewing alternative.", "verified": true, "helpfulness": "0/0", "author": "mirenburg"}, {"rating": 4.0, "review": "Love it. The only reason for not giving it 5 stars is the lack of useful instructional material for navigating with the remote.", "verified": true, "helpfulness": "0/0", "author": "Paul Sandifer"}, {"rating": 5.0, "review": "Easy to set up, and I have no tech skills. User friendly, great picture and sound quality. Very happy with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Carol Marner"}, {"rating": 5.0, "review": "Love Love Love it", "verified": true, "helpfulness": "0/0", "author": "Diane Meagher"}, {"rating": 5.0, "review": "Love it ! Cheap and easy to install", "verified": true, "helpfulness": "0/0", "author": "jessica frias"}, {"rating": 5.0, "review": "This Product is very FAST", "verified": true, "helpfulness": "0/0", "author": "Christopher J."}, {"rating": 5.0, "review": "So easy to install and use!!!  I highly recommend this product", "verified": true, "helpfulness": "0/0", "author": "Catmstar"}]