[{"rating": 5.0, "review": "I purchased the second Fire Stick for a friend. I love the ease of use and the ability to watch movies anywhere you go on a bigger screen.  Sure, I can watch a video or stream on my laptop but why not use a 55 inch TV or even the 40 inch in the hotel room for a better quality picture.  I thoroughly enjoy the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Jimmy B. Morgan"}, {"rating": 4.0, "review": "Enjoying the firetv stick. Takes a little getting use to but easy to use and very convenient. No issues and would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "dominique root"}, {"rating": 4.0, "review": "It's great, except for the MLB app. It freezes. Otherwise, all others apps are great.", "verified": true, "helpfulness": "0/0", "author": "Micah Kaskavage"}, {"rating": 5.0, "review": "Between Amazon Prime & Netflix, you got all the movies you want. Can drop Showtime, HBO, etc., on cable or satellite providers and save some money. Super easy install & setup. Must have good Wi-Fi signal. Find the stick gets pretty hot the longer it runs. Then it gets kind of quirky. Running straight for 8 hours seems to be OK. After that, becomes a bit hot and quirky. But a couple hours down-time & you're good to go again. Great for the price.", "verified": true, "helpfulness": "0/0", "author": "Elaine M. Bell"}, {"rating": 3.0, "review": "No web browser included so I returned it ;(  Maybe the future will bring updates and I would happily try it out again.", "verified": true, "helpfulness": "0/0", "author": "Stacy H"}, {"rating": 4.0, "review": "Easy to install and use.  Have to say I am disappointed in the number of movies and tv series available for free under prime.  Found some I would like to watch but most of what I would like to watch is either unavailable or I have to pay to watch them.  And I prefer older shows and movies, not the latest.  There is so much more to watch on Netflix. The advertising for the Fire Stick is misleading as it makes it sound like there are all these free movies etc to pick from for free viewing when the free choices are minimal.  I am retired  and on a fixed income so the lack of choices was a bit upsetting.", "verified": true, "helpfulness": "0/0", "author": "Sharyn \"swittrup1\""}, {"rating": 5.0, "review": "Super easy. We've had all of the Rokus (not wireless) except the stick.  We have a Dlink which is wireless, but timing is a bit off when using remote, delay is a real bug, but still use in other room.This new deal is great, easy to set up and so easy to use. Very customer ffriendly.", "verified": true, "helpfulness": "0/0", "author": "Bryn"}, {"rating": 1.0, "review": "Unstable wifi connection. Can't even stream Amazon Music without problems. I'll be going back to the Roku.", "verified": true, "helpfulness": "0/0", "author": "Nancy Thompson"}, {"rating": 3.0, "review": "Its great when it stays connected. Often the movie will not \"be available\" due to streaming problems", "verified": true, "helpfulness": "0/0", "author": "Alaya"}, {"rating": 5.0, "review": "this is my second stick in the house, love the device!", "verified": true, "helpfulness": "0/0", "author": "xsweetdreamx"}]