[{"rating": 5.0, "review": "I love my fire stick! It gives you a lot of options to choose from. Its very easy to install and use. My wife does not even watch cable anymore since we installed the fire stick. And since it's only $40, I installed it in every room in my house.", "verified": true, "helpfulness": "0/0", "author": "TBTECHREVIEWER"}, {"rating": 3.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Judith I."}, {"rating": 5.0, "review": "I love being able to watch movies using the Fire stick.  It's so much easier.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 4.0, "review": "When your gateway is right next to the TV it works great.  It can be a little fussy about the signal otherwise.  But since I moved the gateway it's fantastic.", "verified": true, "helpfulness": "0/0", "author": "Stacy"}, {"rating": 1.0, "review": "This seems like a pocket drainer to me. You purchase the Fire Stick, pay to become a Prime user (annually), then you pay for most of the apps that you use within the Stick (monthly)??????I hope I'm incorrect and just not understanding how this work! If not....Anybody wanna buy a Fire Stick?", "verified": true, "helpfulness": "0/4", "author": "LaTasha Neal"}, {"rating": 4.0, "review": "All in all, I find that the Fire TV stick is less intuitive and user-friendly than the Roku stick.  It works, it does everything Roku does (and some Amazon specific things Roku doesn't), but it takes some time to get it set up and learn how to navigate properly.  It is fast and portable and works well with Netflix.  The one thing it has over Roku, however, is portability.  All in all, I would normally give this 3 stars, compared to a Roku stick, but added one star for portability.  To go portable with Roku, you have to bring a router with you and the remote.  I got the Fire TV Stick because my family can take it with us when we travel, connect to any wireless network , and we can use the smartphone app in case we forget to bring the remote.  In the arena of portability, the Fire TV Stick is king.", "verified": true, "helpfulness": "0/1", "author": "Joshua McGough"}, {"rating": 5.0, "review": "Excellent and very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "ZIAD E."}, {"rating": 4.0, "review": "It works as advertised.  It is on a HDMI switch, has to be reset after switching to the Firestick.", "verified": true, "helpfulness": "0/0", "author": "R. O. Davis"}, {"rating": 5.0, "review": "I love my amazon fire stick so much I purchased this one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "S. Stone \"Stone\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Carol"}]