[{"rating": 1.0, "review": "This does not work and no one at Amazon can tell me why.  Sadly, not one person in such a big company cares enough to figure it out, even though I was promised someone would.", "verified": true, "helpfulness": "0/2", "author": "Charles Teegarden"}, {"rating": 4.0, "review": "So far I have not been able to fully enjoy this product,  I did watch a movie on Prime and it was slowing, stopping and would take a few minutes to resume...  This happened all through the movie...  But as I said I haven't been able to fully explore or enjoy this product.", "verified": true, "helpfulness": "0/0", "author": "Mercy Hughes"}, {"rating": 3.0, "review": "While it is fast and comes with a nice long usb cable and power adaptor which other competitors do not.  Fire does not Vudu, which is where I have chosen to manage my Ultraviolet (and my largest) video library.  My only option seems to be Flixster which is a buggy lower resolution alternative to accessing my Ultraviolet content.  And given Vudu (as far as the reviews I read) is the #1 service of it's kind (Target Ticket has even now dropped out of the competition all together) this is a major failing to not include the app which is standard on every smart TV, Blu-ray player and modern console system I have ever owned.  I have a 7 year old TV that has a Vudu app for god sakes (still works flawlessly today).  And since this stick was to connect to my AV receiver so I can stream anything to my main TV or my overhead projector I am still stuck with no option to stream Vudu to my projector as the app is part of my TV and can't be broadcast out to the AV receiver.  I guess I should have looked into this before I bought it but I can hardly be blamed for assuming the #1 Ultraviolet app would be included with what Amazon hopes to be the #1 streaming device...And if this is all because Walmart owns Vudu and is Amazon's biggest competitor then that is just pathetic.", "verified": true, "helpfulness": "1/2", "author": "Dustin"}, {"rating": 5.0, "review": "Easy to install and this is going to make me question why I keep paying for cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love my Fire TV. Spend the little difference in the cost and get the full Full Fire TV or get the better remote, it makes a world of difference.", "verified": true, "helpfulness": "0/0", "author": "Mark Absher"}, {"rating": 3.0, "review": "easy to install and set up and is ok for watching prime video on it but the interface is a little confusing.  while browsing the included prime videos are mixed in with the rentals.  the app for my phone is just the same as the included remote.  why cant i browse on my phone and then just cast it to my fire stick?  will stick with my chromecast for now.", "verified": true, "helpfulness": "0/0", "author": "Matthew Fisher"}, {"rating": 3.0, "review": "Nice product easy to use however I was disappointed to find out even though I am an amazon prime member There are not that many \"free\" movies. By saying if you are a prime member you have access to 40000 movies tv games etc. Well technically you can access them but only about 120 moves are free if you are a prime member. All the rest you must pay for.. Like 5.99. Since I already pay over 100.00 for being a prime member I assumed I would not have to \"rent\" any movies. With Netflix you pay 7.99 permonth for unlimited movies. With Prime you pay 104.00 per year which is almost 9.00 per month and you don't get that many movies included for that price. If all movies were included I would give 5 stars", "verified": true, "helpfulness": "0/0", "author": "Mike Raimondo"}, {"rating": 5.0, "review": "I got this for Christmas.  Takes about 5 minutes to install and WOW watch all the movies you want and most are free.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great product...I love it and use it often!", "verified": true, "helpfulness": "0/0", "author": "Clara H Crews"}, {"rating": 5.0, "review": "I am a huge fan of Amazon, and this product! You will love it too!", "verified": true, "helpfulness": "0/0", "author": "Edwin P."}]