[{"rating": 5.0, "review": "What TV should have always been like!!!", "verified": true, "helpfulness": "0/0", "author": "hawkcaller"}, {"rating": 5.0, "review": "We love our Amazon Fire Stick. So much, that we have eliminated our cable bill altogether and choose to just use Netflix, Hulu and Amazon Prime Plus. I was a little apprehensive about how well this would all work together but it is awesome and is saving us over $100 per month. I am going to say something pretty obvious here, (but for those less \"technically inclined\")--Make sure you have Internet capabilities to support audio and video streaming at a fairly rapid rate, so that you don't run into any hiccups. All you do is call your current Internet provider, who will help you figure this out:)", "verified": true, "helpfulness": "1/1", "author": "Angela M Brown"}, {"rating": 5.0, "review": "Very happy with the Fire Stick.  It is easy to install and use.  Great buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Wish three where more apps but good for the price, Mine randomly pauses or looses signal for whatever reason I have done all the trouble shooting suggested and have even exchanged it once thinking I just got a lemon but the newest stick also randomly pauses and looses signal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"S. Hampton\""}, {"rating": 5.0, "review": "Dont know how I lived without it!", "verified": true, "helpfulness": "0/0", "author": "DL"}, {"rating": 5.0, "review": "I am taking advantage of see it Prime at no cost and watching lot of show!!", "verified": true, "helpfulness": "0/1", "author": "SLTaylor"}, {"rating": 3.0, "review": "I should have bought the Fire TV box in the first place .  I thought they did the same thing , I should have done a little more research.", "verified": true, "helpfulness": "0/3", "author": "Thomas Mitchell"}, {"rating": 3.0, "review": "I'm a DirecTV customer and already subscribe to HBO,  Showtime and Pandora.  I'm also a Netflix subscriber with access through my blu ray player.  So as I suspected, other than some Amazon Prime movies and shows not yet available on Netflix, the Fire Stick doesn't give me a lot more content that I'm likely to watch beyond what I already had.  But it was cheap, so I thought I'd give it a shot.It was very easy to install and set up took about two minutes.  The interface is clunky.  Amazon should have studied Apple, not Netflix.About the biggest plus, besides some Prime content not available on Netflix, is I can now look at my vacation photos on my tv rather than just my computer, tablets and phone.  I'm sure my guests will be thrilled.Not much ventured, not much gained.", "verified": true, "helpfulness": "0/1", "author": "Downing Bethune"}, {"rating": 1.0, "review": "Did not know that I needed wireless internet to use.  So I returned it.  My bad not knowing.", "verified": true, "helpfulness": "0/3", "author": "Renee Mahlman"}, {"rating": 5.0, "review": "This is a great product which really specs wise is better than everything in its class.  Roku has it beat only in the channel department.  Roku gives you the ability to replace your cable box because you can just sign in to the channel thru the Roku still saving you money on the cable box monthly rental fee..if Amazon adds the fox locals, abc locals etc..they would put Roku out of business.", "verified": true, "helpfulness": "0/0", "author": "Happy Buyer M-LA"}]