[{"rating": 3.0, "review": "I am still getting to know what I can and can not do. The one thing I am finding frustrating is just how much I still have to pay for, and I am a Prime member. Otherwise, I love the choices in movies, etc. that it offers.", "verified": false, "helpfulness": "0/0", "author": "tracey"}, {"rating": 5.0, "review": "Love it!! Perfect for my 6 year old son TV needs", "verified": true, "helpfulness": "0/0", "author": "GAPeach"}, {"rating": 4.0, "review": "I really like the way the interface works, and the little remote is great.  The one thing I found to be a problem is that the charging cord to the stick, which the directions recommend you leave plugged in all the time, is not nearly long enough. Most TVs are not that close to a power source, so I had to run an extension cord in order to make it work. This cost them a star in this review. I would also have liked VUDU to be available through the Fire TV Stick.  I did own a Google Chromecast device, which does have VUDU but does not have Amazon Prime, which I watch much more.  Overall, I like the Fire TV Stick much better than Google Chromecast, which had a few other issues (such as stopping it from casting), and I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Deb H"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "robert e purnell"}, {"rating": 5.0, "review": "Amazing. I have tried a few other brands on the market and this by far is the best!!!", "verified": true, "helpfulness": "0/0", "author": "jason tavernier"}, {"rating": 5.0, "review": "Everything you all sell it top of the line I wouldn't go anywhere else for online shopping thank yall", "verified": true, "helpfulness": "0/0", "author": "Josh C."}, {"rating": 5.0, "review": "The Fire Stick was one of the best purchases I’ve made in a while. It was a gift for my wife and she just loves it. Now all of our televisions are streaming Netflix. There’s a lot more available on the Fire Stick than we expected.The Fire Stick was easy to install on our TV and it hooked right up to our wireless network and began streaming within minutes.", "verified": true, "helpfulness": "0/0", "author": "Phillip Floria"}, {"rating": 4.0, "review": "Great device to stream to your TV, setup is a snap, lots of free prime movies and shows, looking forward to more.  Just remember to use your free 30 days of prime before purchasing prime.", "verified": true, "helpfulness": "0/0", "author": "Gregg M Szafran"}, {"rating": 4.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Ian Williams"}, {"rating": 5.0, "review": "Stop buying cable or satellite. Best quality videos,movies!  My favorite gift. My whole family fell in love with this .Apple is attempting to copy it. The world of entertainment just took a major shift in quality and choice.  Even Hollywood has been put on notice. Take a quantum leap or recede into history.", "verified": true, "helpfulness": "0/0", "author": "Lucy Mcoosie \"OleetaJ.Hays\""}]