[{"rating": 5.0, "review": "The kids love it and it is great for a heavy Amazon user.  Best $19 I have spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "Steve H"}, {"rating": 1.0, "review": "Worked great at first.  Liked it so much that i buoght 2 more. Then after 5 weeks it started freezing and i had to trouble shoot it and it continued to freeze and drag.  Contacted customer support.  They made me trouble shoot it and after over an hour of calls it still did not work and they said the return date had passed and maybe i should contact my cable company because its the fault of my connection not their stick.  Interesting that it only happens with the one.  My download speed is 33 mbps.  After over an hour of calls and buying 3 sticks they were only able to offer me grief for replacing it.  VERY DISAPPOINTED WITH THE CUSTOMER CARE.I only have trouble with this one, so wth?You would think that being a prime member who purchased three of their crappy product they would try to take better care with their customer service.", "verified": true, "helpfulness": "0/0", "author": "jeffrey konzen"}, {"rating": 3.0, "review": "Got it on sale for $19.99, and it was worth it at that price, but the interface needs a remodel.  I wish that the app interfaces were more like there PC counterparts.  They have a remote with a mic so you can use your voice, but you have to buy that separate?  That is a rip-off.  They should include it to be competitive.  I don't even use mine anymore.  I just use my old PS3, which does everything that this thing does, but it is much more responsive, and has a better factory controller.", "verified": true, "helpfulness": "0/0", "author": "BigRob"}, {"rating": 3.0, "review": "The remote is better than a Roku's, but I think the overall Roku package is better.I think if you're married to Amazon services only, you can't go wrong with it. But I prefer the flexibility of the Roku platform better.", "verified": true, "helpfulness": "0/0", "author": "Julez"}, {"rating": 5.0, "review": "I prefer this to the chromecast. I have both and this is much easier to use and has better picture quality for streaming netflix and hbogo.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Let me start off with the fact that I'm a software developer, and probably a little more tech savvy than most. I'm also a longtime prime member who makes a majority of their purchases from amazon.com.Initial SetupSetting up the device is very intuitive. Most people shouldn't have any trouble getting it connected to the TV, power, and WiFi.If you buy the device from Amazon, it comes linked to your prime account, so you don't have to worry about logging into your Amazon account.You do have to download and log in to other apps, such as Netflix, Sling, Hulu, etc.It shouldn't take more than 5 minutes or so to be up and running, especially since you now have the ability to skip the tutorial video. (Thanks for this feature Amazon)Using the DeviceI found that the main menu is overly cluttered with Amazon services. The are around 5 different menu options for watching Amazon Instant Video. It also has shortcuts for Prime Music, and Photos. You two ways to get to any third party apps, either recent or apps. Disabling certain things, like music or photos, in the parental controls doesn't remove them from the menu. There's still a placeholder there so you can click on it and enter your pin. Amazon apparently doesn't realize that prime members use other services, in my case more heavily, than amazon instant video. Amazon's attempt to pigeonhole users into Amazon services on the Fire TV doesn't sit well with me, and it takes away from the usability of services on what could be a fantastic device. However, if you only use Amazon's services, the menu might be perfect for you.RemoteUnlike the Fire TV box, the Fire TV stick doesn't come with a voice search remote. You can purchase one for it. I'm not big into voice search so this didn't bother me at all. The remote that is included works well, if you are within range. The remote is Bluetooth so it's maximum range is about 30 feet. If you have a giant living room, or have a media cabinet away from your seating area like I do, this poses a problem. I knew this limitation going in and it did not affect my rating, but did try to put the stick in my media cabinet which is at the edge of the Bluetooth range and found it to be completely unusable. The remote was very unresponsive, and would sometimes act like a button was held down when it did respond. The range is worse than that of my Xbox controller, which works(although with occasional disconnects) with the Xbox from the same distance.Parental ControlsYou can pin protect purchases, amazon instant video, music, apps, and photos. Unfortunately the pin protection is all or nothing. You cannot pin protect or hide anything by content rating. The only thing I found at all useful was the pin protection of purchases, which pin protected the free YouTube app for some reason. So when the kids ask you for your amazon pin, you'll have to apologize for yelling at them for trying to buy apps when you find out they were indeed free.At this price point, you'd think that Amazon would have the foresight that parents would get this for children to use. Unfortunately, they completely missed the mark on the parental controls. I understand that they are trying to force parents into the monthly subscription fee for Free Time. However, Free Time isn't even available on this device. Even if it was, I couldn't see paying for it when parental controls are built into Amazon Instant Video for other devices.For those of you not familiar with the Amazon Instant Video parental controls, it allows you to pin protect purchases and content by rating, and choose which of your devices you want to apply the settings to. Curiously, you cannot apply the settings to the Xbox or Amazon Fire TV Devices. The parental controls are managed at https://www.amazon.com/gp/video/settings. I didn't know about the settings until I called customer service about the Fire TV box a year and a half ago and they directed me there to set up the parental controls for it. Of course it didn't work and I returned the Fire TV box because of it. Since the Fire TV stick wasn't explicitly mentioned as excluded, and Free Time is not available on it, I thought I would be able to manage the restrictions by content rating there, but I was incorrect.I admit that, as the consumer, not doing the research is my fault. Even if I can't return the Fire TV sticks, I'll eat the cost and go with alternative devices(any other streaming media player) that respect Amazon's parental controls.Other than the parental controls the device is great. However, if I were to get a streaming device for myself, I wouldn't be looking for a cheap device. I find it hard to believe that others aren't also buying this for their kids.Any features not mentioned are because I did not use them.If I were to ignore the parental controls issue, the device would get a 3-4 rating. It's really a fantastic little piece of hardware, but the amazon bloated user interface really turns it into an amazon streaming device that can stream other media rather than a media streaming device.", "verified": true, "helpfulness": "0/0", "author": "dericklebron"}, {"rating": 4.0, "review": "I love my chromecast and was leery of this device. My suspicions were proven insubstantial I am happy to report. This thing works wonderfully with my amazon prime account. I received this product for free with a 3 month subscription to sling ( to watch NBA games ) and it is pretty quick. I have yet to use the netflix or twitch apps on it but am very satisfied with its performance and user interface. I would definitely recommend the FireTV stick to anyone.", "verified": true, "helpfulness": "0/0", "author": "T. Clayton \"T. Clayton\""}, {"rating": 5.0, "review": "one of the best its a must have", "verified": true, "helpfulness": "0/0", "author": "Affordable Security Locksmith & Alarm"}, {"rating": 3.0, "review": "Love the verisitility and size. The price was a huge factor in my decision to purchage. Unforunately I would only say I'm about 60% satisfied with this device as it has a harder time keeping a wifi connection than my cell phone does. Often times it pauses for minutes or says that it can't currently access an internet connection.", "verified": true, "helpfulness": "0/0", "author": "rhiannon marie willert"}, {"rating": 4.0, "review": "This was very easy to install, easy to use, and works well. My only complaint is navigating the apps. I would like to be able to search the free apps by category and I couldn't easily do that, you can either look through the top free apps of all categories or look through them by category. We have 2 rokus and bought one of these because it was cheaper than the roku stick and it looked very promising, and I'm glad that Amazon didn't follow suit on the new roku remote design with the app buttons for Netflix, Hulu, etc. because honestly they are more of a nuisance than a convenience- they've been bumped in the middle of a show and then we have to navigate back to where we were to start it back up again.It has a decent speed and good quality video, overall I'm happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "twinmama"}]