[{"rating": 5.0, "review": "It was easy to install, and works well. Very simple to navigate.", "verified": true, "helpfulness": "0/0", "author": "khalil"}, {"rating": 2.0, "review": "Setup, scrolling, and video quality are all good but cannot keep a connection.  I have it connected to my phone's WIFI and it cannot stay connected more than 10 minutes.  Phone WIFI works perfect with everything else including smart TV.", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Timothy Welker"}, {"rating": 5.0, "review": "I absolutely adore this thing.  For streaming I have used chromecast, xbox 360, xbone, and an hdmi enabled tablet, but the fire stick is by far my favorite.  I used a Roku 2 very briefly so I can't say how it stacks up in comparison, but it currently is the most regularly used device for streaming in my household.  I would definitely get another one should the need arise and only wished that I had bought an additional one when it was originally on sale!", "verified": true, "helpfulness": "0/0", "author": "project_aye"}, {"rating": 5.0, "review": "Comes with a video tutorial, easy to install, and very easy to navigate. It's a little hard to get used to after viewing videos (Netflix, etc.) through my Nintendo Wii for so long.", "verified": true, "helpfulness": "0/0", "author": "T. Lentz"}, {"rating": 5.0, "review": "Awesome", "verified": false, "helpfulness": "0/0", "author": "Calvin Ray Calrk \"Calvin Ray\" Kungfu seeker\""}, {"rating": 2.0, "review": "They get you with the promise that you can eliminate cable, but nothing is free.  The site is very misleading with this product.  You need to purchase Amazon Prime in order to watch anything.  Otherwise I love Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amy B. Duprey \"NY Redhead\""}, {"rating": 5.0, "review": "Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Jenny Shaughnessy"}, {"rating": 3.0, "review": "Still on the fence with this one.. Not what I expected.", "verified": true, "helpfulness": "0/0", "author": "Ol' Lady"}, {"rating": 3.0, "review": "Streaming quality is good... I felt the pic quality was better than Roku 3 devices I have used in the past. Apps available are quite limited; Youtube app needs to be improved quite a bit. I tried Plex, Netflix and amazon apps- they all worked good.", "verified": true, "helpfulness": "0/0", "author": "Suresh S \"ssb\""}]