[{"rating": 5.0, "review": "It was everything it was advertised as. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Alice K. Collins"}, {"rating": 5.0, "review": "The FIre Stick is so easy to install and gives you access to Movies and TV from Prime, HBO, Netflix, Hulu and many more.", "verified": true, "helpfulness": "0/0", "author": "bettempol@gma7"}, {"rating": 5.0, "review": "Very nice*******", "verified": true, "helpfulness": "0/0", "author": "elsa daley"}, {"rating": 1.0, "review": "I liked it up until it stopped picking up my Wi-Fi signal after less than a week.", "verified": true, "helpfulness": "3/5", "author": "Hugh O'Brien"}, {"rating": 1.0, "review": "the stick worked like a charm the first night -- since then I have been unable to connect it to the wireless in my house. It keeps saying that I don't have the correct wireless password...and yet, that same password works with all other devices in my house. It's been very frustrating.", "verified": true, "helpfulness": "3/4", "author": "Brooke D."}, {"rating": 5.0, "review": "It works really well, and I get Amazon movies for free.", "verified": true, "helpfulness": "0/0", "author": "James Glantz"}, {"rating": 5.0, "review": "Fire stick is awesome.  Great apps, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The fire stick works well, however the services provided through the fire stick I find to be lacking. Especially the Amazon portion. Even as a prime member, I found it very expensive. $2.14 for one episode of a Sponge Bob cartoon. I had hoped for more for my $99 a year.", "verified": true, "helpfulness": "0/1", "author": "Kevin Getty"}, {"rating": 4.0, "review": "Super easy to set up and use. We are loving it!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "This device is so much easier to transport than the Fire TV! It has all the same benefits as the Fire TV but at a lower cost and smaller size", "verified": true, "helpfulness": "0/0", "author": "Tyler Porter"}]