[{"rating": 4.0, "review": "Super easy setup - great resolution,I dont miss cable or satellite TV at all!", "verified": true, "helpfulness": "0/0", "author": "Field Tech"}, {"rating": 1.0, "review": "Would be great if it worked. Has nice features but it won't stay connected to wi-fi and keeps resetting. Shows it has a strong signal but continuously disconnects every 30 seconds and takes as long to reset.", "verified": true, "helpfulness": "1/1", "author": "Bahamaroot"}, {"rating": 4.0, "review": "As advertised", "verified": true, "helpfulness": "0/0", "author": "T. Garrison \"TGG\""}, {"rating": 5.0, "review": "This little TV stick has been great.  I've got a few devices in my living room for internet connectivity but needed something in my bedroom so I could watch a little netflix or hulu in bed before I go to sleep.  The Fire TV stick is perfect for this and it also has access to my Amazon prime account so there is even more content at my disposal.  The stick takes up very little room and its fast/easy to use.", "verified": true, "helpfulness": "0/0", "author": "Daniel Glenn Horn \"Dan\""}, {"rating": 5.0, "review": "I think Fire Stick is great. I would recommend this to everyone...", "verified": true, "helpfulness": "0/0", "author": "kim maynard-dennis"}, {"rating": 4.0, "review": "The device is good. I just wish it had more support for esoteric streaming services like Crunchy Roll.", "verified": true, "helpfulness": "0/0", "author": "Michael Cassil"}, {"rating": 2.0, "review": "This product has been a huge hassle.  It often doesn't want to connect to our internet (even though all other devices in my house are connected fine) so it won't play any movies or shows.  We've restarted it by unplugging the power numerous times. And now tonight, while in the middle of a movie I paid for, I'm getting crazy messages on a blue screen that say it's unauthorized and the content is disabled.  So I'm getting no picture beyond this message  but I do get sound.  This whole thing has been nothing bus a massive annoyance.  Only reason I gave it 2 stars is because when it does actually work it's pretty great.", "verified": true, "helpfulness": "0/0", "author": "Sarah Statham"}, {"rating": 5.0, "review": "Very easy to use and downloading doesn't take long at all! I went from a Xbox to this and I love this. I love that I can take it wherever I want too!", "verified": true, "helpfulness": "0/0", "author": "Andie"}, {"rating": 5.0, "review": "I LOVE IT. MY GRANDDAUGHTER SHOWED ME HOW TO WORK IT.", "verified": true, "helpfulness": "0/0", "author": "Sue Rhoads"}, {"rating": 4.0, "review": "Overall I am happy with this product. Amazing performance, brilliant clarity in user interface. Only thing that comes short is the keyboard interface. I believe the decision to not put keyboard buttons on remote and also not give voice control with remote is not the very best one. At-least one of it could have been provided on remote control. I would have loved it if voice control was built in remote control. Mobile app is ok, but nobody wants to use it when sitting in front of a tv.", "verified": true, "helpfulness": "0/0", "author": "Abhishek Chaturvedi"}]