[{"rating": 2.0, "review": "The fire TV stick was easy to setup and it does work but that is about it. Like most of the Fire line (fire, phone, fire TV, fire tablet) the content is extremely limited on the app market side. You have the traditional apps Hulu, Netflix, HBO, Crackle, Starz, Showtime, Sling television but the app market is missing apps like Encore, FX Now, USA Now, Fox Now, AMC. I feel like the device never had the consumer in mind. The product feels like one big advertisement for their Amazon Instant Video. The Fire TV could be huge line of products but Amazon has not put real effort into building complete products and made available content to support their products. I would not pay full price for any fire product line until Amazon steps up their app market quality.", "verified": true, "helpfulness": "1/1", "author": "Jeff"}, {"rating": 4.0, "review": "Good Variety of items to watch but not as much as I had anticipated", "verified": true, "helpfulness": "0/0", "author": "C. Amos"}, {"rating": 5.0, "review": "It has every streaming service onto one device!", "verified": true, "helpfulness": "0/0", "author": "Austin Adib"}, {"rating": 4.0, "review": "Update: This has been giving us a lot of problems lately. We had to bring the DVD player that has the Hulu and Netflix apps on it also back into the living room because the firestick freezes up when on Hulu. We have the highest broadband that Time Warner offers. I did speed test and my speeds are way faster than needed. The DVD player plays Hulu and other apps fine. So, we now have the firestick in the bedroom so that the kids can play the game apps. But, this is not good for watching Hulu or Netflix, especially Hulu.Just got this today after buying during Prime Day. We love it! We were using a DVD player that had apps to access our Prime movies, Netflix, Hulu, YouTube and Pandora. It had a lot of apps we never used. But, the fire stick is loaded with apps and games. Kids have been busy all day now downloading free games and checking out what they can do on it. I was going to move the dvd player to the bedroom for the TV in there so we can get on Netflix in there but now I am thinking about just buying a second fire stick soon.", "verified": true, "helpfulness": "0/0", "author": "yesterdaysmom"}, {"rating": 4.0, "review": "I picked the Fire stick up on Prime day for a good price. I'm happy to report it works well so far. It worked right out of the box. Just plugged it in, entered my wifi network password, and we were up and running. I am using it on my secondary tv. I have the Fire TV box on my main tv and I love it. I dropped my cable because we have more than enough to watch with all the Prime content and Netflix. We're saving a fortune.", "verified": true, "helpfulness": "0/0", "author": "K. Cooper"}, {"rating": 5.0, "review": "I plugged it in and was watching movies in five minutes pretty cool  I can say it worked like a champ at my house.I recommend it", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "The fire stick works very well.  I am pleased that my tv is now a smart tv without the expense of purchasing one.I also enjoy being a Prime member and having so much access to free movies.", "verified": true, "helpfulness": "0/0", "author": "Patsy \"Helen Charles\""}, {"rating": 5.0, "review": "Amazing! Easiest plug and play setup. Don't overthink it, just order it.", "verified": true, "helpfulness": "0/0", "author": "keezy"}, {"rating": 1.0, "review": "Connection issues forever and ever. Despite having strong signal and other devices streaming quickly, the fire stick always has to buffer of say that the signal is poor. I seriously just wanted it so I can watch Amazon Instant Videos on bigger screens than that of my laptop, but at least my laptop never has to rebuffer after each minute.", "verified": true, "helpfulness": "0/1", "author": "Sherry Flores"}, {"rating": 5.0, "review": "I love this fire stick", "verified": true, "helpfulness": "0/0", "author": "Mark Dennis"}]