[{"rating": 4.0, "review": "Very cool device.  I do wish the devise allowed you to cast your iPhone or iPad to the screen like Chrome cast permits.  The tie in with Amazon Prime is what sold me.  Instructions are poor - if you have a home entertainment system you need to plug the device into the entertainment system, not directly into the TV (for best performance, sound etc)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great player! We took it with us to Aruba. Kids watched Netflix when we were not at the beach. By the way Netflix has a much better collection in Aruba than in US. Newer movies too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It does the job.  I was disappointed that this will not mirror  from my kindle hd tablet, like apple tv.  Otherwise it is satisfactory", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this works great everything i expected", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased for our upstairs TV.  It works wonderfully to stream Amazon Prime or Netflix.  We have been quite pleased to upgrade our inexpensive TV to be a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The only issue is that installing bateries was not easy, or explainedRequired 2  steps", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 5.0, "review": "Stream lines everything well. Easy to use. Great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works very well. works as expected.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This item arrived as expected. It's truly easy to setup and functions as described by Amazon. There is just one major flaw which I find annoying and fail to understand why Amazon hasn't addressed it yet since I'm not the first person to complain about it. Also, Amazon has both the skill and technology to address the issue and resolve it if they wanted to.  The issue is not being able to filter items between what is free to view (based on my Prime account) and the items that will incur a cost to view.  Finally, if there is a cost associated with a title it should be posted clearly with the item in the display panel when scrolling the available video options.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!! Very easy to set up and use. So happy that I got it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]