[{"rating": 5.0, "review": "My family and I enjoy this device, trust me you can't go wrong with the Firestick! Shipped on the 6th and I received on the 7th. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Darryll"}, {"rating": 1.0, "review": "I wanted to love the Fire Stick so much! It is sadly unusable, as it has an incredibly slow refresh rate and skips several times a minute. We use the Chromecast and Apple TV with no problems at all, I hope they release an update to fix these issues that make the stick pretty much worthless.", "verified": true, "helpfulness": "0/0", "author": "Danielle Gruberger"}, {"rating": 5.0, "review": "Easy to set up and works great.", "verified": true, "helpfulness": "0/0", "author": "LH"}, {"rating": 5.0, "review": "My daughter and son-in-law bought this for me. He had it set up and running in 5 minutes and I've already watched two documentaries and two movies. It's great, works simply and has a great selection of videos to choose from. The perfect compliment to my prime membership.", "verified": true, "helpfulness": "0/0", "author": "Melody Snider \"Bookstore Lady\""}, {"rating": 5.0, "review": "I got this for my grandfather to provide him endless hours of entertainment.  I was immediately impressed by its snappy performance.  I plugged it into his stereo receiver to utilize his surround sound and it works like a champ; If you plan on plugging it into a receiver like I did, make sure you can use the HDMI port furthest to the right, since the power plugs in on the right side of the stick, you need the right side of the stick to be open.  Alternatively, you can use the HDMI extender provided in the box.  It's easy to get the impression that it's going to be a nice product just by opening the box and viewing the layout of the contents.If you have WiFi, prime, and netflix, this device can make a non-smart TV feel like one.", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 3.0, "review": "My Fire TV Stick constantly has to buffer and be restarted. I cannot watch one show without this issue. I checked my internet speed and our download speed is near 25GB.  It is too bad, I love it otherwise.", "verified": true, "helpfulness": "0/0", "author": "Lori T."}, {"rating": 3.0, "review": "The stick well, sticks upon playback. When watching a show, it stops for a decond and continues. Don't like that at all, Love the ROKU better. Does not stop and go all the time during shows.", "verified": true, "helpfulness": "0/0", "author": "GLBTGuide"}, {"rating": 5.0, "review": "I was immediately surprised by the connection speed and content of this device right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Steven Ketterman"}, {"rating": 5.0, "review": "Since I am a loyal amazon customer this was a no brainer for our bedroom. Its small out of the way and works really well. Easy enough for my wife to use because she's no where near tech literate. LOL", "verified": true, "helpfulness": "0/0", "author": "Bryan McIntyre"}, {"rating": 5.0, "review": "This sick is super fast.", "verified": true, "helpfulness": "0/0", "author": "Alex"}]