[{"rating": 5.0, "review": "Love it. works great! now i'm going to buy an antenna for local channels and cut the cable completely off.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good device! Got it from best buy when it was on sale during Christmas!", "verified": true, "helpfulness": "0/0", "author": "Patrick L."}, {"rating": 5.0, "review": "Very good streaming device. Nice stick for the Amazon eco system.", "verified": true, "helpfulness": "0/0", "author": "VenuK \"Venu K\""}, {"rating": 5.0, "review": "Since I kicked pay tv to the curb, was looking for something with more channels to watch with antenna.  Easy to install, lots to watch that is free and can switch to other tv's easily.  Pleased", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 4.0, "review": "Bought it cause I thought I wouldn't need a power supply. I was wrong. You still need a power supply but if you have a newer model TV, you can use the USB port to power it up, meaning no cables going for the wall. The software feels polished. Fast and user friendly. It even starts with a demo video to show you it's features.", "verified": true, "helpfulness": "0/0", "author": "Joseann J. Robles"}, {"rating": 4.0, "review": "The only reason why I didn't give this device 5 stars is that I think the device could be faster.Load times for the apps are a little laggy.Setup was a breeze, although forcing a person to watch the tutorial was frustrating.I have purchased two of these devices and everyone in the household has enjoyed them.The remote would be nicer if it didn't make such a loud clicking noise. I did find a fix, use your mobile device as the remote with the free app.It has taken the place of a gaming system for streaming Amazon/Netflix/Plex, kids (or adults) should will be pleased to hear.I was glad to see that I can use my Plex server with this device and not have to rely on the big named online services for my entertainment.I recommend you use the enclosed HDMI extension cable to receive the best signal from your wireless network. If you still have issues, check the channel your wireless signal is currently running and try changing it to a less busy channel. I had some connectivity issues and resolved them with the above.Over all worth the money.", "verified": true, "helpfulness": "0/0", "author": "Russ S"}, {"rating": 5.0, "review": "Had a few weird things happen with the ui skipping around when I first got it.  After the first day it stopped skipping and has been working great.  Nice fast UI", "verified": true, "helpfulness": "0/0", "author": "Ryan Moore"}, {"rating": 5.0, "review": "SO EASY TO INSTALL AND MOVIE SELECTION IS FANTASTIC....LOVE IT", "verified": true, "helpfulness": "0/0", "author": "GRADY TIBBS"}, {"rating": 5.0, "review": "When I was a small child my dad would tell me stories of Tibet.  I was taught that Spiritual Masters of Tibet could manifest anything they want.  I had to wait a long time, but Amazon made this a reality.  Almost every day I manifest things with a few mouse clicks, and that sure is easier that the training the Tibetan Masters had to go through.  Then there is the idea of Nirvana -- a Spiritual State of bliss.  So when I watch the Fire Stick I think to myself, \"This must be Jeff's Nirvana.\"", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]