[{"rating": 5.0, "review": "Very happy with this purchase.  Interface is easy to use and speed is excellent.", "verified": true, "helpfulness": "0/0", "author": "Trudy Perkins"}, {"rating": 2.0, "review": "I cannot get this Stick to work on Netflix. I've tried it in every room and have decided that it's not compatible my provider.  Thinking about moving to a new one, but not sure I want to invest that much money in Charter plan instead of buying a Roku.", "verified": true, "helpfulness": "0/0", "author": "SoccerVanna \"soccer vanna\""}, {"rating": 4.0, "review": "Enjoying the fire stick, streaming through it, no problems, like the apps that are on it. Only con is finding a mini keyboard and mouse to use with it.", "verified": true, "helpfulness": "0/0", "author": "Gerry"}, {"rating": 5.0, "review": "Very pleased. And hope someday we can buy an appp that will allow us to watch live sports, such as ice hockey. Will we be able to ad updates to our Fire stick when they ad new apps?  Thanks", "verified": true, "helpfulness": "0/0", "author": "Janet Brown"}, {"rating": 5.0, "review": "I am amazed at what I get for this very affordable purchase. I've had Netflix and Huluplus for several years but the upgrade automatically received by using the Fire TV Stick is worth every penny. Navigation is much easier; I'm getting more out of the pay services for the same price. Movie options seem endless. Additional channel options including games like pinball are the icing on the cake. I'm very happy I decided to purchase a Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "NM Amazon Shopper \"Empath\""}, {"rating": 3.0, "review": "Not overly impressed with the Fire TV Stick because it seems so slow streaming. I have had a lot of interruptions while trying to play a movie on netflix.", "verified": false, "helpfulness": "0/0", "author": "Robert Heffner"}, {"rating": 5.0, "review": "Does everything as advertised, can't say the same for Sling.", "verified": true, "helpfulness": "0/0", "author": "H. Walsh"}, {"rating": 5.0, "review": "Love having this...easily installed...VERY easily installed...quick delivery...installing the battery in the remote was a bit tricky (hate to say that but....it was... )...recommend highly...", "verified": true, "helpfulness": "0/0", "author": "lemontree"}, {"rating": 5.0, "review": "Exelente producto", "verified": true, "helpfulness": "0/0", "author": "muy buen juego"}, {"rating": 2.0, "review": "It has trouble keeping the wireless connection. There are two other wireless devices in the house and they don't have the same kind of problem. In addition even the smart TV's which are a wired connection, always have trouble with the amazon instant tv web site. But the Netflix and HULU don't seem to have this problem.", "verified": true, "helpfulness": "0/0", "author": "Joe Large"}]