[{"rating": 1.0, "review": "Don't put a deal out there that Prime members can't even get before 1pm!", "verified": false, "helpfulness": "3/6", "author": "JW"}, {"rating": 1.0, "review": "Waste of money if you have a slow internet. Even with a fast internet movies cost $ and  nickle and dime you to death.No you can not mirror your Fire tablet and browse the internet.No you can not use it as an android operating system. That would be great. No it does not have a browser. I hacked it and added one butwithout a remote key board and mouse hooked to the tv. I goes no where.If it had a way to download a movie and watch it later it would be more useful.For me all it does is stutter.", "verified": true, "helpfulness": "1/2", "author": "Snowplace"}, {"rating": 5.0, "review": "I have loved having the amazon fire stick. It super easy to set up and is user friendly!", "verified": true, "helpfulness": "0/0", "author": "kacey chavez"}, {"rating": 5.0, "review": "I bought this Amazon five TV stick for two months now and I love it is very nice to be able to watch Netflix watch tons tons of videos specially if you Amazon prime member very nice  highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Mohamed"}, {"rating": 1.0, "review": "I'm writing a bad review just because I didn't get one of these on Prime Day! I waited and by the time I put it in my shopping cart, the deal was over.", "verified": false, "helpfulness": "11/16", "author": "Andrew"}, {"rating": 1.0, "review": "This is so unfair!!! I've been a prime member for so long and waited for prime day for a long time. And now the \"wait list\" is full and I can't get this fire stick for a discount. I got SOO happy and my boom put down so quick. Ughhhh!!!", "verified": false, "helpfulness": "13/19", "author": "GILLIAN"}, {"rating": 5.0, "review": "As described, it is a fabulous little stick!  Works perfectly, easy to set up and browse and watch.", "verified": true, "helpfulness": "0/0", "author": "Jan Button"}, {"rating": 4.0, "review": "Works well. Can sometimes slow cable connection, so I have to unplug it if I am just watching TV, but it works as expected. Glad I got it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Waited all day for the sale on this thing and they are sold out?? I'm very upset and this prime day bs is a bunch of bs and not fair at all!", "verified": false, "helpfulness": "11/16", "author": "Lisa LaShé"}, {"rating": 1.0, "review": "This is very wrong! I looked at 7am this morning and this deal was already sold out. Thanks a lot Amazon. I am a long-time prime customer and I can't even get the deal you promised. You should do better in the future with making sure you have enough deals on this for your valued customers at least through the morning time. Thanks a lot for nothing.", "verified": false, "helpfulness": "11/16", "author": "Robin"}]