[{"rating": 5.0, "review": "Love it!  Easy to install, does everything they say it does!", "verified": true, "helpfulness": "0/0", "author": "felonmelonman"}, {"rating": 5.0, "review": "Love it! Works wonderful for a older TV.", "verified": true, "helpfulness": "0/0", "author": "deborah gibson"}, {"rating": 3.0, "review": "I wanted it so i could watch netflix, and for that matter it really works! Its great.But unless you have amazon premium, there is not much more you can do with it. All movies and amazon series are paid.Nevertheless, i recommend it, but is not a life changer.", "verified": true, "helpfulness": "0/0", "author": "Carolina"}, {"rating": 4.0, "review": "Very clear picture! Enjoying the customized picture screen saver as well as available apps!", "verified": true, "helpfulness": "0/0", "author": "Kyra"}, {"rating": 5.0, "review": "Simple setup, easy to use.  Who could ask for more", "verified": true, "helpfulness": "0/0", "author": "JWH"}, {"rating": 4.0, "review": "Started out pretty good; now everything I try to watch says \"we've encountered an error with this video, select another title\". Code is \"license error\" or something to that effect. Now, as I try to watch anything NOTHING COMES UP so I can't even see what it actually says.Just spoke with customer service, very helpful. Apparently my wifi connection is too slow or too many people in my complex are on line right now. I need to have a stronger signal for optimum performance.So, other than that, I really like it.....", "verified": true, "helpfulness": "0/0", "author": "DorothyTurner"}, {"rating": 5.0, "review": "Best purchase I ever made. I cut my cable bill in half.", "verified": true, "helpfulness": "0/0", "author": "dianne correia"}, {"rating": 5.0, "review": "Great concept", "verified": true, "helpfulness": "0/0", "author": "Lori Campbell"}, {"rating": 5.0, "review": "Love it. Glad I heard about it", "verified": true, "helpfulness": "0/0", "author": "Unknown"}, {"rating": 4.0, "review": "I love the Amazon Fire stick. I use it every day and it has been the best thing for any TV. It has many all the apps you need. The remote is very nice and allows easy access to all the apps. Using it with your phone is useful too. There is no competition to the Fire Stick. Dont even think about getting Chromecast, it doesn't even compare to the Fire Stick.Now that I have said all the things I about the Fire Stick, I will rant on something that bugs me about it.Wireless connectivity must be fixed.I hate when my fire stick wont connect to the internet. It connects to my home router, but sometimes it just wont fully connect.I get the error \"Connected with Problems\"I dont think it is difficult to fix this error as must devices are connected to WIFI now and the bugs from early development have been fix and usually when there is a connectivity issue, it is fixed by an update very quickly. This product has been out for months and it still has this issue.Its not that big of a deal to re enter your password or reset the stick, but it is an inconvenience and a waste of time.I wish I could rate it lower, but I do love it enough to give it Four Stars.Please fix the connectivity issue.This is the best thing since sliced bread", "verified": true, "helpfulness": "0/0", "author": "Xavier \"Xman\""}]