[{"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "atthew"}, {"rating": 3.0, "review": "OK.  I felt it was intuitive to use and easy to set up, but there were not enough features for us. We could not access vudu or Google tv/movies or disney movies because they are direct Competitors. I also could not import my digital library in to amazon, I would'very had to purchase them all again  on Amazon. So, we are returning it.", "verified": true, "helpfulness": "0/0", "author": "S. Manning"}, {"rating": 3.0, "review": "So....3 stars, but let me explain. The quality, ease, features of the Fire TV stick are wonderful. I COULD really enjoy streaming media devices, and this one experience certainly would not make me want to change to any other device. However, in my research, no one could tell me how much data would actually be used. I decided to risk $35 just to see if I could offset the way overpriced SAT services. On arrival, set up was easy, plug and play. I went to the Prime movies (free) and found a really good one. I checked my data usage before and after the movie. What i have determined FOR ME, is that you use just about 3GB of data per hour. ONLY if you have unlimited data would this be good or you will be paying a provider premium dollars for all the overage you will encounter, and quickly.Had i known the data usage, I probably would not have ordered, but that is the only reason to be careful. Just passing data use along.", "verified": true, "helpfulness": "0/0", "author": "kdizzle"}, {"rating": 4.0, "review": "I am very impressed with the stick.Simple to set up. Simple to use.And this from a very unsay computer person. So happy I am cutting my comcast service to basic basic", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 3.0, "review": "It functions, but would be much better if the streaming media didn't stutter and pause (at all).  Chromecast has no problem using the same equipment and wifi network, so I'll be using that instead until the stuttering problem is worked out.", "verified": true, "helpfulness": "0/0", "author": "Cameron Beattie"}, {"rating": 5.0, "review": "This is the best thing I bought all year!!!! Easy to use. The Amazon Fire Stick is so portable that it can be packed in you purse, suitcase or backpack while traveling. Just plug the stick in the wall and TV and you are watching movies quick and fast. I hated using other streaming devices because they did not work like a regular remote. This is so easy because all you have to do is start your remote and off you go. Amazon has hit a home run in my book! I wish I had bought more when it first came out, but I will be getting more soon. These would make a great gift to anyone who streams movies. Remember you can stream more than Amazon Prime, it works with Netflix and so on. If you don't have one of these you need to buy one if you love to watch movies and want the easiest option for streaming.", "verified": true, "helpfulness": "0/0", "author": "Marjorie Zielinski"}, {"rating": 3.0, "review": "Every now and then it konks out", "verified": true, "helpfulness": "0/0", "author": "gerald oscar"}, {"rating": 5.0, "review": "I love my fire stick.  It was beyond easy to install and the features seem endless. Everything you could need/want is included.", "verified": false, "helpfulness": "0/0", "author": "Lucky Pez"}, {"rating": 5.0, "review": "Love this thing!  Totally replaced my Roku.  Only wish I could get a crunchyroll app on here, but still this is great.  Has an excellent menu layout!", "verified": true, "helpfulness": "0/0", "author": "Acepoem"}, {"rating": 5.0, "review": "THis is great if you dont have a smart TV", "verified": true, "helpfulness": "0/0", "author": "ltpsp \"ltpsp\""}]