[{"rating": 5.0, "review": "Great selection of shows.", "verified": true, "helpfulness": "0/0", "author": "TJ"}, {"rating": 5.0, "review": "Perfect! Does exactly what my originally priced Fire Stick does and for about $10 less! Although I'd appreciate if they added more language features, especifically spanish. I have family that would use it more often if it was in their native language! Anyway, buy refurbished, guys. It's a no brainer!", "verified": true, "helpfulness": "0/0", "author": "Antonio A."}, {"rating": 5.0, "review": "Works like a dream super fast and the streaming is  amazing", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 1.0, "review": "Waiting for something to load is not what I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "EMT"}, {"rating": 5.0, "review": "I love my fire stick!!", "verified": true, "helpfulness": "0/0", "author": "Sherre6"}, {"rating": 5.0, "review": "Incredible options with the Amazon Fire Stick. Movie and TV Fans should really.  like this", "verified": true, "helpfulness": "0/0", "author": "MICHAEL MCCRIMMON"}, {"rating": 5.0, "review": "Amazing Product!", "verified": true, "helpfulness": "0/0", "author": "Chyna"}, {"rating": 4.0, "review": "Continued until two months, I'm glad to do for yourself to this end, it looks good, I also have no too many ideas, useful, spending choices, good. Apple has always been a leader in electronics industry and I'm glad I have a chance to see.", "verified": false, "helpfulness": "0/0", "author": "Whittinghill\tWriston"}, {"rating": 4.0, "review": "Streaming takes high speed internet. Servers have been down once where internet wasn't an issue but the media couldn't be connected to. Will update later at another time if that continues, for now has only happened once. Would like video that costs to be separated more from other videos.", "verified": true, "helpfulness": "0/0", "author": "Buyer2345"}]