[{"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "Adam Williamson \"-Adams Beard Oils\""}, {"rating": 3.0, "review": "I was disappointed with the Amazon Fire TV Stick because I guess I misunderstood what it was for. I was under the impression that it was going to bring me other movie/tv channels without charging for each one. I am returning it. I thought it would be some kind \"antenna\" to bring in more channels than I am getting, but I was wrong.", "verified": true, "helpfulness": "0/0", "author": "karyn elayne cameron"}, {"rating": 4.0, "review": "The convenience of this is great as well are the features. My only issues is that it sometimes has internet connection problems with Centrylink and the remote goes haywire when scrolling through Netflix.", "verified": true, "helpfulness": "0/0", "author": "Single Daddy"}, {"rating": 3.0, "review": "cant figure out when i do a search if it includes all other apps downloaded or do I have to go into each app like Netflix or HulU to find what I am a looking for. but other than that it is pretty good! Downloaded the phone app and the voice search works great.", "verified": true, "helpfulness": "0/0", "author": "Ryan DeCoster"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Günter Weber"}, {"rating": 5.0, "review": "Really like it! Still trying to figure out if/how to cast my phone screen to TV. If I can, this'll probably replace Chromecast altogether. Otherwise, having both rocks so far.", "verified": true, "helpfulness": "0/0", "author": "Dang"}, {"rating": 5.0, "review": "I didn't expect to like it as much as I do. Love the variety!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it. going to get another one for my other TV", "verified": true, "helpfulness": "0/0", "author": "BETTY ASBERRY"}, {"rating": 5.0, "review": "very easy to use and install. lots of shows and programs to watch is you have Prime.", "verified": true, "helpfulness": "0/0", "author": "vicki halbakken"}, {"rating": 5.0, "review": "Nice product, works great.", "verified": true, "helpfulness": "0/0", "author": "PJ Carlson-Hafner \"Dr of Knowlege\""}]