[{"rating": 5.0, "review": "I like this better than Chromecast. It has Netflix and Amazon built in. Not back for under 40 bucks. If you have Wifi and a HDMI input you're good to go. I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "mikeyyyownz"}, {"rating": 2.0, "review": "I think we would have loved this to use with Netflix. Unfortunately, when it arrived we found out that the HDMI on our TV is not compatible with the Fire stick. There was no where in all of the research we did, that mentioned if you have HDMI/DV port it will not work! Customer service at Amazon (who was very helpful and spent a good amount of time trying to figure out our problem) told us that the correct type of HDMI port had only been in TVs about 7 years, so if your TV is a little older, please try to check carefully before you buy. A far as I could see in the specs (admittedly I don't understand them completely) we had everything we needed - HDMI, HDTV, 1020i, etc. It was one devide that looked like it would be really easy to use and we are very disappointed.", "verified": false, "helpfulness": "0/0", "author": "R. Henderson"}, {"rating": 4.0, "review": "Installation was easy, the operation is user friendly.  We enjoy seeing old movies.", "verified": true, "helpfulness": "0/0", "author": "Dan Luthye"}, {"rating": 4.0, "review": "it was an  easy set up . The only thing it that it does not or is not supported by Directv and some of the shows that would be avail I have to log in for on my TV supplier and its not supported. Dish and others are but not Directv. I emailed both and was told that that the other needs to approach us in order for us  to work out the support issue. so I dont  have all the channels that are available for that.", "verified": true, "helpfulness": "0/1", "author": "Arthur R."}, {"rating": 1.0, "review": "Doesn't connect to wifi. The wifi router is behind the TV. Network connection lost error all the time.This is junk. Havent watched any program after week 1.My older smart TV and DVD player and other network players work well.How do I return this stuff ?", "verified": true, "helpfulness": "7/8", "author": "Ash"}, {"rating": 5.0, "review": "Very impressed! Gave it to my son for Christmas and he loves it! Thank you!", "verified": true, "helpfulness": "0/0", "author": "Javahaus"}, {"rating": 5.0, "review": "My sister was on Christmas break and never changed the TV back to regular stations.", "verified": true, "helpfulness": "0/0", "author": "Lois Soto"}, {"rating": 5.0, "review": "Works great, was perfect for my H D tv without a Internet DVD player.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 1.0, "review": "It was great while it worked, which was one week. Now it can't seem to pick up my Wifi signal, although my Kindle in the same room can. Keeps asking for password,etc. I put it in & still doesn't work. Very disappointed. Purchased early and had to wait for it to come in. Very excited to the point that I was ready to purchase 5 more for my kids. If someone could make a suggestion on how to correct this problem, I would be most appreciative. Never had a problem with any other purchases from Amazon but very disappointed with this product.", "verified": true, "helpfulness": "0/0", "author": "Joanne Jones"}, {"rating": 1.0, "review": "Does not work in college dorms due to internet connection. Boo Amazon :-((", "verified": true, "helpfulness": "0/0", "author": "Secretkey23"}]