[{"rating": 5.0, "review": "Great product for mobile use.  I prefer the regular Fire TV for permanent installations such as home.  I prefer the Fire TV Stick when I'm traveling.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 1.0, "review": "It works well, but it pisses me off that amazon refuses to allow us to use our Prime Video on Chromecast.", "verified": true, "helpfulness": "0/0", "author": "C. Azzam"}, {"rating": 5.0, "review": "Fire TV Stick has done what Roku could not.  It has made me a streaming fool.  I have a Roku 3 and have never stayed glued to the tube like I have with Fire TV Stick.  I have been on Prime Video constantly since it arrived.  Great product.  Great interface.  Smooth streaming.  Love it.", "verified": true, "helpfulness": "1/1", "author": "Chad Gaines \"Blender\""}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "I also have a chrome stick and find I prefer this over it for use.", "verified": true, "helpfulness": "0/0", "author": "Richard Fraley"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "David K Anderson"}, {"rating": 5.0, "review": "excellent quality, incredible movie/music offering", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm pleasantly pleased with the Fire TV Stick. I'm still learning what I can watch and do with it--but it loads fast plus the remote and interface are intuitive. For the most part, I can run the remote without even looking at it. I can't say that with the remote for my TV or my DVD player. I took it on the road with me recently and used it at the hotel--and it worked great! I love that it's portable.", "verified": true, "helpfulness": "0/0", "author": "Brigette"}, {"rating": 5.0, "review": "Awsome!", "verified": true, "helpfulness": "0/0", "author": "Oscar Rodriguez"}, {"rating": 4.0, "review": "has resume function, easy to control, but no power button.", "verified": true, "helpfulness": "0/0", "author": "V. le \"klanva3\""}]