[{"rating": 4.0, "review": "Charges several dollars for the good movies, has a good selection of TV shows, but has its limits.  I do however, get tired of sifting through garbage movies that I have never heard of.  ESPN is nice.  Make sure that you have good bandwidth before you buy this.  I run 6mbps and its almost too slow.", "verified": true, "helpfulness": "0/0", "author": "Jimmie Thomas"}, {"rating": 5.0, "review": "So the ONLY thing that I don't like about this is the MANDATORY external power supply that's never shown in the commercials. You have to run a the usb cable to a wall outlet. Not great for my setup, but the device itself is awesome. Now I just need a prime membership and I'll be all set.", "verified": true, "helpfulness": "0/0", "author": "Random"}, {"rating": 4.0, "review": "A good product, basically does as it describes.  Great for watching netflix and prime.  Only drawback is the remote.  The remote is tiny, and was lost on day 2.  Luckily the app works great and now my phone is my remote.", "verified": true, "helpfulness": "0/0", "author": "frank d brown"}, {"rating": 2.0, "review": "setup is easy and aside from the power cord requirements, the stick works well for streaming videos.  i really only have one complaint, but since it's the reason for me purchasing this product, it's kind of a big deal.i purchased this as i travel for work every week and wanted to be able to take my shows on the go when i'm in hotel rooms instead of watching video on my iphone or ipad, which obviously have much smaller screens.  when i used this in an older hotel that didn't have an integrated hotel/tv system (ie includes hotel info, pay per view options, etc), the stick worked just fine.  when i used this in a modern hotel with those aspects, i found that the input function is disabled on those tvs, so you can't switch from the cable to hdmi input...  which is a HUGE problem since the stick plugs into the hdmi port.  you can ask the hotel to enable the input function, but from my experience at two hotels, the hotel either does not know how to or the hotel does not want to, since they would have to disable it again once you've checked out, and it's kind of a hassle...it works just fine with my tv at home, but i already have a smart tv so all my streaming is already integrated into my tv and i don't really need an additional stick to access my shows.if anyone has any workarounds for the input issue, please let me know!", "verified": true, "helpfulness": "0/1", "author": "chicago"}, {"rating": 4.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Robin E Collier"}, {"rating": 5.0, "review": "Great purchase. The Amazon stick was super easy to install and even easier to operate -- very user friendly.  Very happy with this item and would recommend highly.", "verified": true, "helpfulness": "0/0", "author": "RV"}, {"rating": 1.0, "review": "I've gone through two of these now. First one never fully booted up correctly. It was stuck after the Amazon logo appeared on screen. Second replacement did the same after the automatic software update. They still have a software problems with this. Tech support for this was out of India. I might try again once they work the bugs out.", "verified": true, "helpfulness": "1/1", "author": "Dirk Danger"}, {"rating": 5.0, "review": "I love it ,my son bought it for me because it is easier to navigate than another device I had.", "verified": true, "helpfulness": "0/0", "author": "Margo Wilkie"}, {"rating": 5.0, "review": "one of the best products i have used in a long time great value for money", "verified": true, "helpfulness": "0/0", "author": "Leon Alcivar"}, {"rating": 5.0, "review": "Now I can watch Netfix in my bedroom!", "verified": true, "helpfulness": "0/0", "author": "Rosemary Vaughn"}]