[{"rating": 5.0, "review": "Fire stick is great, but there are not enough good movies on Prime.", "verified": true, "helpfulness": "0/0", "author": "Patricia Wofford"}, {"rating": 5.0, "review": "I purchased this for my daughter's playroom.  My husband and I have the Fire TV for our use.  While this does tend to be a tad slower than the fire TV it still works great and we haven't had any issues with it.  We have had it for over 2 months now.", "verified": true, "helpfulness": "0/0", "author": "K. Bryant"}, {"rating": 5.0, "review": "Great, easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Bochski"}, {"rating": 5.0, "review": "I have nothing but good things to say about the Fire TV Stick! I cannot compare it to the Fire TV, because I've only used these... but I have two now, and I use them 1) on an older tv that is not a smart tv and 2) on a newer tv that I purposefully bought as a non-smart tv because I knew I'd be using a Fire TV Stick with it. My daughter benefits from this device every day and night. She watches all of her favorite cartoons thanks to the availability of Netflix and even a little Amazon Prime Video! It comes with Amazon Prime for a certain amount of time included, can't remember how much. I've always been a prime member, and this device was no exception to my satisfaction with Amazon and its own line of products! Thanks, Amazon! Keep up the good work!", "verified": true, "helpfulness": "0/0", "author": "Joshua Storme King"}, {"rating": 5.0, "review": "This thing is awesome at an awesome price! My kids love it!", "verified": true, "helpfulness": "0/0", "author": "Brett McCollum"}, {"rating": 2.0, "review": "It's a cool device but just thought would be more and an easier remote", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 5.0, "review": "Works well. Perfect for bringing on road trips for hotel use.", "verified": true, "helpfulness": "0/0", "author": "Ronald G. Ifferte"}, {"rating": 4.0, "review": "This is a great device for me to take on the road in hotels. Once I figure out screen mirroring, I'm totally set.", "verified": true, "helpfulness": "0/0", "author": "M. Anderson"}, {"rating": 5.0, "review": "AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Nathan Rupert"}, {"rating": 3.0, "review": "This has more television series than movies, which I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Mary"}]