[{"rating": 3.0, "review": "It  can be very slow and a little glitchy. I have excellent internet speed and some things it would take forever to load.  It is somewhat difficult to download some \"channels\"  to it without going through a ton of steps.  (If you like TVMC be prepared to jump though a ton of hoops to \"side load\" it.  It is also very \"Prime\" reliant, even though I have Amazon Prime it seems very focused on that one aspect.  I had bought this to replace a ROKU,  moved the ROKU to the bedroom.  I have since brought the ROKU back to the living room and now the Fire Stick is in the guest room.", "verified": true, "helpfulness": "0/0", "author": "Beverly Leffingwell"}, {"rating": 5.0, "review": "This is really useful to watch TV and movies at home", "verified": true, "helpfulness": "0/0", "author": "Tejashkumar Shah"}, {"rating": 1.0, "review": "It constantly freezes and is very slow to load apps and content.  I would not recommend.  I would suggest a Roku or an Apple TV, or even a Chromecast if you are fine with the lack of a remote or traditional operating environment.", "verified": true, "helpfulness": "0/0", "author": "empirep"}, {"rating": 5.0, "review": "Excellent product and its works like charm . Wonder stick.. Just loved it ..stream everything ..better than roku and Apple TV", "verified": true, "helpfulness": "0/0", "author": "Rizwan \"riz\""}, {"rating": 5.0, "review": "I love it! Easy to set up and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Dianna L Gilbert"}, {"rating": 5.0, "review": "Very simple installation and super easy to use even for the youngest members of the household.  It is budget friendly and a viable alternative to cable/satellite television.", "verified": true, "helpfulness": "0/0", "author": "Evangeline"}, {"rating": 5.0, "review": "I'm upset with my self that I did not buy one of these sooner.  Super easy to set up and so easy to use.  I will probably buy a second one for the other TV.", "verified": true, "helpfulness": "0/0", "author": "Clifton R. Woods"}, {"rating": 4.0, "review": "Affordable alternative to cable, have live t.v. access through the Sling membership. Love it!!!The device tends to freeze up a lot on popular channels but other than that has been a great product.", "verified": true, "helpfulness": "0/0", "author": "Dustin Bishop"}, {"rating": 1.0, "review": "If only there were an option for zero stars... or negative stars.This does not deserve a single star.I have excellent internet speed and still this product fails to function without constantly freezing and buffering.I expected this product to suck way less.... because it is Amazon.Amazon has always impressed me, so this worthless piece of excrement was a surprise.This product literally freezes about every 10 seconds.I have wasted far too much time trying to make myself feel good about spending money on this product.My recommendation: if you have the option of spending money on this product OR flushing cash down the toilette, please opt for the toilette.... it will be far more entertaining and substantially more effective than using the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "I had a Roku unit in the basement that was not picking up the Amazon Prime programs any more (the modem is on the first floor). The Roku used to pick up the signal with no problem. I decided to gamble and buy the Fire Stick in an attempt to get the Amazon Prime channel back. It worked! I have been able to access both Amazon Prime and Netflix without a problem on my basement TV. One caveat you may be unaware of: the Fire Stick must be plugged in to an electrical outlet! Fortunately, I had installed an electrical outlet directly behind the TV so I was able to plug it in without any wires being visible. I have had this Fire Stick unit for about a month and can stream with no problems. I'm glad because I have about 12 movies I bought that are in my Amazon Prime library that were rendered inaccessible when the Roku could no longer pick up the Amazon Prime channel.", "verified": true, "helpfulness": "0/0", "author": "John G."}]