[{"rating": 4.0, "review": "very impressive for the money great performance at a great price", "verified": true, "helpfulness": "1/1", "author": "perry"}, {"rating": 4.0, "review": "I love it.", "verified": true, "helpfulness": "0/1", "author": "Happy Yogi"}, {"rating": 3.0, "review": "not enough news chanel options.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "I liked this more than Chromecast (I have this, chromecast, roku 3 and WD TV). It's a pain to use my cell phone all the time to change things. For example, if I'm watching something and someone calls my cell phone... it's hard to pause and answer the call. This thing has a remote that works great. I hooked this thing up to my projector to get rid of the HDMI cables. Now I can watch movies and i don't have any cables going to my PC. I never had any issues with Hulu or Netflix. Definitely enjoyed this product. Good job, Amazon!", "verified": true, "helpfulness": "1/1", "author": "RT \"RT\""}, {"rating": 5.0, "review": "We love the firestick! We live in an area with sketchy cable and it has been a lifesaver. Well worth every penny!", "verified": true, "helpfulness": "1/1", "author": "Jan L. Bishop"}, {"rating": 5.0, "review": "A very different change of pace.  Excellent.  A wonderful story.", "verified": false, "helpfulness": "1/1", "author": "skip share"}, {"rating": 1.0, "review": "I dont like how I purchase movies to my kindle however its already reached its max capacity with only 4 movies... the fire stick is no good either.", "verified": true, "helpfulness": "0/2", "author": "Danny Guerrero"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Heath  W  Larson"}, {"rating": 5.0, "review": "I am very happy with Fire TV. I like the remote, chromecast doesn't have that offered.", "verified": true, "helpfulness": "1/1", "author": "Jennifer"}, {"rating": 5.0, "review": "Works just as intended. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Greer"}]