[{"rating": 4.0, "review": "This works pretty well,  I can move it from one TV to another unlike the Mohu antenna that can hook up to only one TV at a time.  At first glance it appears there are a lot of choices, and even though there still is a lot of choices, some of those choices are not free, and some are available only if you have a subscription to a participating cable/satellite company (ridiculous since the main reason to use Amazon Fire TV Stick is to \"cut the cable\"), or maybe they are only available in a certain region, etc.  Also items are listed in more than one category, so, again, there are not as many choices as it seems at first glance. I guess I can't blame Amazon Fire TV Stick for this, but I have problems with slow streaming/buffering even though I have high speed Internet service (ATT).  I purchased Sling TV and I am somewhat disappointed with the picture quality on some of these channels, and, again, some listed are only available with participating subscription service or are regional.  Still, a one time purchase of this equipment along with an antenna for local programming and a subscription to Sling TV and Amazon Prime is still less expensive than a subscription to Cable/satellite TV and I get fewer channels I'm not interested in.", "verified": true, "helpfulness": "0/0", "author": "JessieJS"}, {"rating": 5.0, "review": "Neatest thing since the Kindle Fire that hooks up to your TV.The app for the phone allows voice search, So Cool.Wish it had a surf the Internet app.", "verified": true, "helpfulness": "0/0", "author": "Chris Zellner \"Lakedog\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Maria morford"}, {"rating": 5.0, "review": "Highly recommend if your looking for something that pretty much does it all", "verified": true, "helpfulness": "0/0", "author": "Saint719"}, {"rating": 4.0, "review": "still like my ROKU much better", "verified": true, "helpfulness": "0/0", "author": "SUNI ONE"}, {"rating": 3.0, "review": "compared to other devices i have, this seems to have a couple of bugs i have yet to figure out. One i noticed is when streaming its seems to freeze or pause on its own.  my other streaming stick devices, havent had the same issues at the same location in the same position etc.", "verified": true, "helpfulness": "0/0", "author": "Cusco"}, {"rating": 1.0, "review": "There's better out there shop around", "verified": true, "helpfulness": "1/2", "author": "malaina"}, {"rating": 4.0, "review": "I ve share the results of Fire TV with a lot of friends and they are all amazed the quality of the product!I recommended to everyone!!", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 3.0, "review": "I dont really need it. i always fat finger the 1click order with amazon. I wish i can disable that on my acct.", "verified": true, "helpfulness": "0/0", "author": "Lon"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Patricia M DiPonzio"}]