[{"rating": 4.0, "review": "I like it so far.", "verified": true, "helpfulness": "0/0", "author": "Novia McFarlane"}, {"rating": 5.0, "review": "I'm really enjoying my fire stick. I get to watch my prime and my Netflix right on my big TV now.  Much better then watching on my kindle.", "verified": true, "helpfulness": "0/0", "author": "christina"}, {"rating": 5.0, "review": "I received this as a gift and it is amazing!", "verified": true, "helpfulness": "0/0", "author": "Roy D. Brechbuhler"}, {"rating": 5.0, "review": "So muck better than I thought it would be", "verified": true, "helpfulness": "0/0", "author": "Paul L. Beck"}, {"rating": 4.0, "review": "Works as advertised. Easy to install.Five stars for this.However, the remote is not user friendly. It slips through my fingers - it's hard to grasp. When it's face down it's hard to pick up. And the jog-dial does not always do what I want it to do.Thus the 4 stars.Message to Amazon:Put three finger sized indentations along the left edge to make the unit graspable - and distinctiveMake it easy to pick up when face down - the bevel on the back might look cool but it's not user friendly, I have to slide it off the edge the table to pick it up. Maybe make the radius on the front larger and thus easier to graspMake the jog-dial work better - it jumps more than one selection at a time and it's hard to feel or find unless I am looking at itI have normal sized hands and work with my hands so I have a sense when a devise is hand friendly or not - this device is definitely not hand friendly. Maybe it needs to be just a tad larger...with a grip on the back...It's an inexpensive device but it can be a stunning looking and working device at the same time.", "verified": true, "helpfulness": "0/0", "author": "Roy Prince"}, {"rating": 5.0, "review": "Easy install and simple to control.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Huen"}, {"rating": 5.0, "review": "Very useful. Purchased from eBay and very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Whitley"}, {"rating": 5.0, "review": "Love it! Use it everyday -)", "verified": true, "helpfulness": "0/0", "author": "richard"}, {"rating": 5.0, "review": "It is perfect!", "verified": true, "helpfulness": "0/0", "author": "BILLIE L BENNETT"}, {"rating": 5.0, "review": "This is all I watch now, I haven't watch cable in weeks lol!!!", "verified": true, "helpfulness": "1/1", "author": "Georgette Munox"}]