[{"rating": 4.0, "review": "crisp clear picture", "verified": true, "helpfulness": "0/0", "author": "gman"}, {"rating": 1.0, "review": "It took 1 hour to type in my passwords. The remote sucks. After that it could not connect to my wi-fi. This was a total waste of my time trying to get this to work. Returning it immediately. there is also no telephone number for any type of customer support. Now I know why the price is so cheap. Come on Amazon, I expect more and better from you.", "verified": true, "helpfulness": "1/1", "author": "brad bailey"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 5.0, "review": "Thousands have covered the techno stuff.  I just want to compliment Amazon for the utter ease with which you set this up and use it.  You hook it up and bing! this geeky little animated bloke pops up and he's actually as charming a he is supremely understandable.  Way way faster than our 2011 Roku -- as it should be.  Brilliant all round.", "verified": true, "helpfulness": "0/0", "author": "brityank"}, {"rating": 5.0, "review": "Great product !!  Love it", "verified": true, "helpfulness": "0/0", "author": "Mike H \"Mike\""}, {"rating": 4.0, "review": "As a means to access streaming services it does the trick as well as any other I've seen. My ultimate goal is to get away from satellite (or cable) services that offer lots of channels but with nothing of value on 90% of them. I like the \"stick\" format as I really don't need another box under the TV.I was surprised that the unit required external power \"for best performance\" via the supplied USB adapter, just one more cable to get tangled up and make it a little more awkward to move between TV sets. I already had Netflix and also added HuluPlus; unfortunately non-premium Hulu isn't available as an app on the Fire Stick. I also took advantage of the free trial of Amazon Prime for the first month. Unfortunately, most things worth watching on Prime come at further cost and for this reason I doubt I'll maintain the subscription even with the 2-day free shipping that forms the other part of the offering. Netflix streamed as well as it does on my other devices and I've had no issues there at all. HuluPlus on the other hand has presented some issues with stuttering video, usually where the show freezes for a second or two every 30 seconds or so. It plays fine on my laptop but I wonder if there's a buffering issue. I'm not sure if this is a problem with the app or the hardware? I've also got my fingers crossed for a HBO NOW app. I have the service but can only stream on my laptop, not the Fire Stick.The remote does the job well and you can even use a mobile app on your phone to control the stick. This makes text entry (searching and password entry) much easier than using the remote.For $40, I can't complain and I consider it money well spent. If only one of the streaming services could get their strategy and content right; one service that gives you everything you need, a la carte maybe, at the right price without all the junk filler to make you think you're getting a good deal.", "verified": true, "helpfulness": "0/0", "author": "Mick Morley"}, {"rating": 5.0, "review": "We needed a simple way to add our movie accounts and other streamed content to the bedroom TV and the Fire TV Stick worked perfectly.  Be aware that some of the available content is not closed captioned but that is not a fault of the device it is the content provider's.", "verified": true, "helpfulness": "0/0", "author": "IT/AT"}, {"rating": 2.0, "review": "I really wanted to like the Fire TV Stick. I have everything Amazon except the phone but this just has had too many problems and I've spent hours on the phone with customer support and it still doesn't work as expected. I should have gone with a Roku. For whatever reason the stick doesn't communicate well with any remote, I've had 3 different remotes all with the same problem, sometimes it responds, sometimes not, sometimes it acts like I hit a button several times when I only hit it once which makes entering any text or numbers almost impossible, just getting the thing set up was a nightmare. Amazon seems to think the problem is the remote so they keep sending me replacements. Clearly this stick is a lemon and I wish I could just return it.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "I'm still trying to get the \"hang\" of typing my title into the top - have to begin again, A Lot! - am not used to this as I don't text - but I love having the world of YouTube at my disposal!!  I haven't watched anything else!!  A dream come true once I really learn how to use the site--Thank You Amazon!", "verified": true, "helpfulness": "0/0", "author": "D. MacDonald"}, {"rating": 5.0, "review": "The best there is.", "verified": true, "helpfulness": "0/0", "author": "P. Rodriguez Jr. The Mechanic \"Peterod\""}]