[{"rating": 5.0, "review": "I love it, still have more to explore with it but so far I am really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "annette curelli"}, {"rating": 4.0, "review": "wish there were more apps available, yahoo specifically", "verified": false, "helpfulness": "0/0", "author": "Melissa Bryant"}, {"rating": 4.0, "review": "For some reason mine has an issue staying connected to the internet or it glitches in and out on music and shows. Other than this it works beautifully and it is exactly what I was hoping for! I just need to figure out how to make my connection stronger.", "verified": true, "helpfulness": "0/0", "author": "Brittany Remole"}, {"rating": 1.0, "review": "After two days and over 5 hours with Amazon tech reps it still doesn't work.  This review is for the tech service as well as the product.", "verified": true, "helpfulness": "0/0", "author": "Richard J. Mayer"}, {"rating": 5.0, "review": "It works great!My cons are the menu/interface, but it is no worse than the Chromecast or Roku.", "verified": true, "helpfulness": "0/0", "author": "Joshua"}, {"rating": 3.0, "review": "I love the fact that this actually has a remote with us vs the Chromecast where I have to use my phone or iPad. I also like the lay out of the screen and the ability to search all apps. The problem that I have with it is that it constantly freezes! It's really annoying. I did buy this when it first came out so hopefully newer versions have that fixed. Other than having to always restart my program, it's good.", "verified": true, "helpfulness": "0/0", "author": "KMC1982"}, {"rating": 1.0, "review": "Disappointed! Too many show require then to be bought.", "verified": true, "helpfulness": "0/0", "author": "melissa puckett"}, {"rating": 5.0, "review": "It is wonderful, thinking of buying another one.", "verified": true, "helpfulness": "0/0", "author": "Ana Cotor"}, {"rating": 5.0, "review": "I'm still learning what this can offer, but so far I'm very pleased with it. It doesn't seem to require too much bandwidth to stream a good picture. The packaging was very nice and initial setup pretty easy. I've signed up for Sling TV and have used Pandora multiple times. One of the big draws for me was Amazon Prime Video streaming, but I really haven't used it yet. I have streamed some music from Amazon, which worked well. Remote integration so both the TV and Fire Stick could be controlled from one device would be a great addition.", "verified": false, "helpfulness": "0/0", "author": "Patty Presswood"}, {"rating": 4.0, "review": "totally worth it...so easy to watch net flicks now...tried google chrome first and it wanted our whole family to change all of our browsers to google chrome or it doesnt work (brought it back)", "verified": true, "helpfulness": "0/0", "author": "Joseph Nelson"}]