[{"rating": 3.0, "review": "I am disappointed that I cannot easily cast internet sites from my i pad to my TV using Fire Stick.  I have tried to find some apps that will work with fire stick to make this happen but I have not been able to find one.  The instructions sent with Fire Stick should have listed some apps and applications to make this happen.  I have found apps to project photos but not websites.", "verified": true, "helpfulness": "0/0", "author": "David B. Lamb"}, {"rating": 1.0, "review": "This claims Miracast certification and it apparently is, but don't assume that it will work with just any Miracast-capable device. It does not at present work with ANY Windows device, though they are Miracast-capable and apparently work with a bunch of other Miracast devices. So don't assume your Windows tablet, laptop, or phone will work with this. It will not.The product page says (in small type) that Windows 8.1 support is \"coming soon\" whatever that means. It doesn't mean now.", "verified": true, "helpfulness": "0/1", "author": "Julie Miller"}, {"rating": 5.0, "review": "Absolutely GREAT! I also have Chromecast but the Fire Stick puts it to shame! There are so many more shows and movies to watch PLUS other apps that are available. I'm also impressed with how many \"free\" shows and movies Amazon offers. If something I want to watch isn't available for free, the price to own it is very reasonable.", "verified": true, "helpfulness": "0/0", "author": "Mary Ellen Carr \"Alexis and Mariah's Grandma!\""}, {"rating": 5.0, "review": "Awesome I can't get enough of it. I'm in bed all weekend enjoying Netflix and Hulu, also I use the fitness app each morning before work.", "verified": true, "helpfulness": "0/0", "author": "Sophia reed"}, {"rating": 5.0, "review": "Terrific", "verified": true, "helpfulness": "0/0", "author": "christine earl"}, {"rating": 5.0, "review": "Great product. Works well..", "verified": true, "helpfulness": "0/0", "author": "russell meyer"}, {"rating": 4.0, "review": "I love everything about this except that the USB ports on my TV's aren't powerful enough to run this device. I have a Roku and it runs fine off the USB ports on my TV, but with the Fire TV Stick I have to use the wall adapter and find an outlet to plug it in. Other than that it's great.", "verified": true, "helpfulness": "0/0", "author": "Blue McCorsky \"ReadinRebel\""}, {"rating": 4.0, "review": "very efficient and easy to use.  i do prefer my laptop in doing a \"search\" and reading the basic themes of future episodes of a tv series.  worth the money.", "verified": true, "helpfulness": "0/0", "author": "Kirk Lett"}, {"rating": 5.0, "review": "Easy navigation, great video quality for Amazon and Netflix, pandora is great, hope they continue to develop this.", "verified": true, "helpfulness": "0/0", "author": "Donald J. Rudawsky \"Experiment33\""}, {"rating": 5.0, "review": "So easy to install.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Debbie Rhodes"}]