[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Krista B."}, {"rating": 4.0, "review": "I use to stream Amazon Prime and Netflix from my Wii; this is so much easier and faster! I have very little streaming issues (not as many as I did with the Wii). I also purchased Sling TV and have been very happy.  With all three subscriptions it is still less many than cable and very worth it!", "verified": true, "helpfulness": "0/0", "author": "Heidi Lynn"}, {"rating": 5.0, "review": "Easy and works GREAT! LOVE IT", "verified": true, "helpfulness": "0/0", "author": "DECTRA RICE"}, {"rating": 4.0, "review": "Excellent for the money. It's not 5-star in my opinion simply because it lags a bit, and sometimes quite a bit, while scrolling between channels. But once you're on the content you've selected, it works like a champ. Excellent HD picture and a large selection of Amazon Prime (of course...) stuff, but also a lot of free channels for movies (Crackle) and streaming TV services (Sling TV). If you're looking to ditch the high-price of cable or satellite TV like I was, this is the way to go.", "verified": true, "helpfulness": "0/0", "author": "Phillip Withers \"PapaGuk\""}, {"rating": 5.0, "review": "So far so good. Downloaded the remote app for iPhone. Love that!", "verified": true, "helpfulness": "0/0", "author": "jeannie"}, {"rating": 4.0, "review": "Only for amazon members", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Absolutely love my new fire tv stick. I have not had any issues or problems with it, couldn't be happier", "verified": true, "helpfulness": "0/0", "author": "Ria Renee Rikard"}, {"rating": 5.0, "review": "I really like the Fire TV Stick. It is way better than the chrome stick. I returned the chrome months before I tried the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "jholst"}, {"rating": 5.0, "review": "Good streaming media player.  It was easy to set up and meets my expections.", "verified": true, "helpfulness": "0/0", "author": "Mitchell Kerr"}, {"rating": 5.0, "review": "Could not be happier with this product. It delivers on what it says it will, and is high quality. Keep it up", "verified": false, "helpfulness": "0/0", "author": "coachshawks"}]