[{"rating": 2.0, "review": "I'm sure this device works stellar with city Internet.  But with my rural service Amazon really should facilitate standard definition streaming.", "verified": true, "helpfulness": "0/0", "author": "Bradley Mercer \"brad\""}, {"rating": 1.0, "review": "Waste of money.... Hardly NO APPS...  Mlb Premium doesn't work on video to watch games.. Go with Roku !!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Buckeye JJ \"Huge Amazon shopper!\""}, {"rating": 3.0, "review": "I prefer the Roku 3. When this stick gets bluetooth for wireless headphones like the Fire TV I will give it a better rating.", "verified": true, "helpfulness": "0/0", "author": "Brandon M. Early \"uthguy9\""}, {"rating": 4.0, "review": "I also have an AppleTV, but I had to give this a try since it was so cheap. I really like it since I can install a  lot of the apps from the app store, which you cannot do with the AppleTV. The only gripe I have is that this device stutters from time to time when I am streaming Netflix in HD. I think the processor may be a bit under powered, but for the $20 it cost, I am not complaining.", "verified": true, "helpfulness": "2/2", "author": "CardFan"}, {"rating": 1.0, "review": "Not different than competitors", "verified": true, "helpfulness": "0/1", "author": "hassan nehme"}, {"rating": 4.0, "review": "Very convenient with lots of choices.  Two issues...some things play with sound others you have  to change settings.  Also have to physically turn TV back to hdmi when you are done if you have Comcast remote", "verified": true, "helpfulness": "0/0", "author": "Ninamat \"Calliope\""}, {"rating": 5.0, "review": "I just purchased a second Fire TV Stick for use with my bedroom TV.  I think that says it all.  Inexpensive, easy to install and use.  Unit does not need to be in direct line of sight with the remote control, so can be inconspicuous.  Very nice and an excellent value.", "verified": true, "helpfulness": "0/0", "author": "Michael F. Sullivan"}, {"rating": 5.0, "review": "I love it. Very easy to set up. Works extremely well.", "verified": true, "helpfulness": "0/0", "author": "JASON LEONARD"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "STEVEN SANCHEZ"}, {"rating": 3.0, "review": "I thought there would be more selections for free for Prime members.", "verified": true, "helpfulness": "0/0", "author": "John Mikula"}]