[{"rating": 5.0, "review": "just got it hooked up and working Great alternative to regular tv movies. comercial free", "verified": true, "helpfulness": "0/0", "author": "bev"}, {"rating": 5.0, "review": "Good price!!", "verified": true, "helpfulness": "0/0", "author": "wmileh"}, {"rating": 5.0, "review": "Great toy at a great price. Better than another major player's \"stick\" IMO.", "verified": true, "helpfulness": "0/0", "author": "D. M. Jean"}, {"rating": 5.0, "review": "Love my Fire TV Stick! Having come from a place of an Apple TV, Chromecast, and now the Fire TV Stick, I can say with confidence that the Fire TV Stick is set apart from the others. The interface is smooth and easy to use. Much like a smartphone which we are all used to, you only download the \"apps\" that you need. If you download the Fire TV App, you have all kinds of functionality with the keyboard and voice search!", "verified": true, "helpfulness": "0/0", "author": "Leo Jurgens"}, {"rating": 5.0, "review": "This is absolutely awesome my kids and I absolutely love it! Bought as a gift for my sons birthday to use on a tv that we don't have cable on (but is an hdtv) and was a little disappointed that there would be a long wait before it came back in stock (almost a month) but it actually came in a lot sooner than expected (only a week later) and works fantastically.  Easy to install and use, love the fact that it has parental control option so then I have no surprise charges on my card! TV display actually looks better sharper and crisper since installing it.", "verified": true, "helpfulness": "0/0", "author": "Kizzy  DeSantis"}, {"rating": 5.0, "review": "This is my favorite streaming device I've purchased.  I've had chromecast and the net gear device but this is far superior.", "verified": true, "helpfulness": "0/0", "author": "Jennifer O'Connell"}, {"rating": 1.0, "review": "didn't get in time promised", "verified": true, "helpfulness": "0/1", "author": "randy schmall"}, {"rating": 5.0, "review": "Easy installation and just perfect. Very happy. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Banx"}, {"rating": 3.0, "review": "I really like my stick.....i wish u could down load more apps..", "verified": true, "helpfulness": "0/0", "author": "Tina Greene"}, {"rating": 3.0, "review": "If you want YouTube as part of the apps supported by your media stick, then look elsewhere.  The YouTube app for Fire is a third party app and should not be confused with the genuine YouTube app you would find on your phone, smart tv's, and blu-ray players.  The menus on the fire stick could be better and do not buy this for the games as that falls short too.  The android app needs some work for this device, but at least it does have an app to help you with navigation and typing in searches.  The Plex app is currently free and works fairly well with streaming your own video content.  Hulu Plus and Netflix work well, too.Overall, Amazon would have done better if they had focused on presenting a good quality media player with a user defined menu system, instead we are given a device who's obvious purpose is to push anything it can sell you on Amazon.  If you got this for $19 like I did, it a nice deal.  For $39, keep you eye on updates and read more reviews before you decide or look at the the full size box streamers, including the Amazon Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "C. Robinson"}]