[{"rating": 5.0, "review": "I am really impressed.  This small thing just blew out of the water all similar gadgets I have including Chromecast, Roku, smart TVs and some Android microcomputer, When you unpack the stick you will have no doubt that you are dealing with a top notch device. The responsiveness is incomparable both in video playback and the user interface.I wish Amazon included full keyboard with the device but it undoubtedly would increase the price.", "verified": true, "helpfulness": "0/1", "author": "Papa Carlo"}, {"rating": 5.0, "review": "Very cool!  I own a Roku LT and a second edition AppleTV.  Wanted another streaming device for the bedroom and decided to give this a try.  The unit is very small and surprisingly fast.  Interface is clean (similar to the ATV) but includes both Amazon Prime and Netflix (which was a must).  While the Roku has the advantages of letting you search across all channels from the main screen, you can't do that with the Fire TV stick (at least not yet that i can tell) the overall speed and clean interface of the Fire TV stick makes up for much of that - along with being able to \"voice search\" anything on Prime from my iPhone via the app.  Very very impressed with the responsiveness and that is likely due to the large storage/buffer capacity and fast networking.  Definitely recommended.", "verified": true, "helpfulness": "0/1", "author": "Irwin Fletcher"}, {"rating": 4.0, "review": "Love the concept, but doesn't have as many games as Fire TV.  My son loves Minion Rush and I thought since it was available on Fire TV, it would also be available on the Stick, but it is not.  :-(  Other than that, I am able to use the things I use regularly like Amazon Videos and Netflix, so I am content.", "verified": true, "helpfulness": "0/1", "author": "Mrs. Reynolds"}, {"rating": 5.0, "review": "This is awesome we own 4. EASY to use and even has games.", "verified": true, "helpfulness": "0/1", "author": "Kimberly Thomas"}, {"rating": 5.0, "review": "Love it! I have a Roku and wanted a second unit for my living room tv. The Fire Stick works great and is easy to use.", "verified": true, "helpfulness": "0/1", "author": "Elena P"}, {"rating": 1.0, "review": "Cannot recommend at all. It would not even connect to my primary network, despite repeated fiddling.  Not what I need after a long day at work with overtime. I gave up and had it connect to my other network, which is a much weaker signal, by the way, so that was not the issue for me.  However it refused to update despite repeated attempts, restarting the device, etc.I am returning it as defective and recommend anyone else with hardware/software issues to do so, also.  As I told Amazon in the comment for the return, I don't have time to debug beta crap.  I bet they eat millions on this.  Very disappointing.EDIT: So, this morning, I decided to give it another chance.  It did managed to update, which it apparently needed to do several times before finally starting up and playing a fairly decent welcome help video.  However, this was still on the secondary network.  Encouraged I decided to see if it would now properly connect ... sadly, no.  For the record, there is nothing exotic about my network; it's a common home router model using WPA2-PSK encryption. I do have a MAC address access list but the device was added and I have even disabled that to no avail, just in case.  For whatever reason this device is just not properly designed or configured, oddly the other network is similarly configured, though further away so a weaker signal and not preferred as it is a satellite, metered, connection.  The upshot is that I will keep the device as it may be useful, even if only for another charger, given the price I paid. There is no way I can recommend this device though and I still think it merits 1 star, for the total lack of attention to technical detail, horrible out of the box experience, etc.  If you can get it as cheap as I did ($20) and you are prepared to take a chance on it not working for you, have at it, otherwise there are a host of better products. The remote, though, is not bad.", "verified": true, "helpfulness": "11/14", "author": "Gaidheal"}, {"rating": 2.0, "review": "We got ours on black Friday from Best Buy. Great features, easy to use, but offers a horrible connection. Initially we had it in our second floor with our router in the basement. It barely worked. So we moved it to the T.V. in the basement, feet from our router and it still loses the network connection every 30 minutes or so. We have not had connection issues with our Sony Bluray player or Roku. Really disappointed.", "verified": true, "helpfulness": "4/4", "author": "Jill M. Przekurat \"First time mom\""}, {"rating": 4.0, "review": "The Fire TV Stick is amazing!  It would be PERFECT if it could also stream YouTube!!  Otherwise, I completely love this device and the direction this technology is going!", "verified": true, "helpfulness": "0/1", "author": "jenn"}, {"rating": 5.0, "review": "Fantastic device.  I switched from a Revue and ROKU to these sticks!  I wanted something smaller that would allow me complete access to all of my streaming content no matter the television I was on.  These sticks give me that ability.  I don't game and the ONLY thing I use these for is streaming video and audio from various sources.  With HBO GO part of Prime and the SHO app, I have all my streaming content availalbe to me.The Android remote is the fastest I have found.  It is as fast of the actual handheld remote that came with the device.  Speaking of the device itself, it was an absolute breeze to setup.  Plug power into device, plug device into TV, and follow the on screen prompts.  I would recommend a good mid to high end router with wireless a or wireless n to make streaming that much stronger and easier.I would recommend this device to anyone who wants great streaming and also a small foot print.", "verified": true, "helpfulness": "0/1", "author": "Volzbalz"}, {"rating": 1.0, "review": "Crashed 4 times in first 10 minutes. Takes over TV at times when not in use. Offering of apps is sparse. If you're not a prime member probably not worth it.", "verified": true, "helpfulness": "2/3", "author": "Cary Jay Vaughn"}]