[{"rating": 5.0, "review": "I did have to use the extender so it would pick-up the wifi signal better and after that it has been a dream.Hooked it up in my son's room so he can watch what he wants without paying a fortune for an extra cable box.I also use it to catch up on past seasons of some of the shows I watch.Going to check out the games portion sometime soon.", "verified": true, "helpfulness": "0/1", "author": "Lisa M Heckel"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Brittany way"}, {"rating": 4.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/1", "author": "kevin revelette"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Marat Mitelman"}, {"rating": 5.0, "review": "Worked very well for two months, then became erratic. Eventually it was unusable.Update:  Well, I spoke to customer service (Opal) and was told a replacement would be sent.  How can you not be happy with Amazon?Second update. I received a replacement and it works very well. It's my go to for home music since my TV has surround sound. The whole transaction had only a \"speed bump\" and I'm pleased with the product and the purchase.", "verified": true, "helpfulness": "0/1", "author": "michael g."}, {"rating": 4.0, "review": "Some times hard to get it to link with my wireless router.", "verified": true, "helpfulness": "0/1", "author": "Charles J Cacciabeve"}, {"rating": 3.0, "review": "Not my top choice when it comes to streaming devices. It just buffers a lot and loses signal. I am going back to my Ruko", "verified": false, "helpfulness": "0/1", "author": "Edna Porter"}, {"rating": 4.0, "review": "Pretty great device. Netflix and amazon Prime stream pretty seamlessly. Radio apps and youtube are great too. I may never leave the house again.", "verified": true, "helpfulness": "0/1", "author": "pastoralia"}, {"rating": 1.0, "review": "I do not like it at all.  I will be watching something and it stops to buffer continuous.  Or it says my internet signal isnt  strong  enough So i do not use it at all  I use my WII and never have issues", "verified": true, "helpfulness": "0/2", "author": "kathy s"}, {"rating": 5.0, "review": "I LOVE my amazon fire stick!I first got one to gift to my mother for her to access movies, and then realized that i needed one for myself!Came in a perfect little box with everything needed, including batteries for the remote, which is spectacular!First had a run in problem, that i didn't think that the Fire stick itself would fit in my mother's TV HDMI port, then to find out that it comes with an extender which made a perfect fit because it is a flexible wire extender, so the only problem i had was an EASY fix. Thank goodness! My mother and i both love this.It is an easy set up, and has walk through directions once hooked up on how to use the remote!Has many streaming selection which is again another plus on this device!", "verified": true, "helpfulness": "0/1", "author": "Jessica"}]