[{"rating": 4.0, "review": "Great product I like the amazon line (not the phone lmao sry amazon) the only one thing that I don't likeis that you can't stream from your phone hate that.  You can mirror you phone but then you have to sit their and hold it on landscape mode not fun... amazon please fix it", "verified": true, "helpfulness": "0/0", "author": "The god"}, {"rating": 1.0, "review": "I'm so glad I only paid $20 for this. It's a piece of crap. I have a strong Wi-Fi signal and my other devices have no trouble, but this thing freezes and buffers and takes forever to do anything. It's especially bad when watching Netflix or using the Amazon music app. It just took 7 minutes to play a 4 minute song because it plays maybe 6 notes before it freezes and says it's loading. I am really disappointed with it and can't recommend it to anyone.", "verified": true, "helpfulness": "1/1", "author": "Kristen Mcquinn"}, {"rating": 4.0, "review": "The audio has issues (cuts out regularly) and from what I've read, unplugging it and resetting it is the only means of \"fixing\" it. I would be a great service had it not had that issue.", "verified": true, "helpfulness": "0/0", "author": "JISacramento"}, {"rating": 5.0, "review": "A+++++=", "verified": true, "helpfulness": "0/0", "author": "Cheryl Dearien"}, {"rating": 5.0, "review": "Performed as indicated.", "verified": true, "helpfulness": "0/0", "author": "Element"}, {"rating": 2.0, "review": "I really like being able to watch what I want. The only thing about this Fire Stick is it gets really hot and then just pauses on its own. I have to unplug it for awhile and it works again.", "verified": false, "helpfulness": "0/0", "author": "Margie Hunter"}, {"rating": 4.0, "review": "Very pleased with this purchase. Super-simple to setup, and works perfectly with my Amazon Prime Video subscription. The only drawback is the external power supply (something they never showed in any of the TV commercials)...", "verified": true, "helpfulness": "0/0", "author": "Rock Roberge"}, {"rating": 3.0, "review": "Was looking for a unit to use in holtel rooms. Not able to connect to wifi in hotel rooms is due to no Google search or internet search.", "verified": true, "helpfulness": "2/2", "author": "Monte Growe"}, {"rating": 5.0, "review": "Worked flawlessly. Love it. Best $35 ever spent.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, I like it.", "verified": true, "helpfulness": "0/0", "author": "Terrence F Bray"}]