[{"rating": 5.0, "review": "it's just awesome! easy simple to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Sejin Oh"}, {"rating": 4.0, "review": "nice addition and simple to use", "verified": true, "helpfulness": "0/0", "author": "Bob Huffman"}, {"rating": 5.0, "review": "Super easy to install and navigate. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Prudence Garza"}, {"rating": 1.0, "review": "Ordered this based on the excellent reviews and the price. Needed to add a 3rd streaming player to our home.  We have a Roku 1 and an original AppleTV (I'm an early adopter).  I swapped out the AppleTV for the Fire Stick in my main room to add Amazon Prime streaming in that room.The Fire Stick would not maintain a connection to my wifi.  We never were able to stream anything after an hour of troubleshooting using both online and direct contact with Amazon customer service (3 reps: 2 useless, 1 polite but not helpful).  I WAS ACTUALLY TOLD BY TWO AMAZON REPS THAT THE FIRE STICK WOULD ONLY WORK IF WAS WITHIN A 5FT RANGE OF THE ROUTER!!!  They've been hearing a lot of the same complaint and were working on a software update. Seriously??Unplugged it and sent it back for a full refund - within the 30 day window.  Not waiting for an update that may or may not happen.  Hooked old AppleTV back up and was back in business (minus Amazon Instant Video).", "verified": true, "helpfulness": "0/0", "author": "Desmond Laffan"}, {"rating": 5.0, "review": "I love it  works well easy to set up", "verified": true, "helpfulness": "0/0", "author": "Michael Wright"}, {"rating": 5.0, "review": "Great product, portable and can be connected on any of the newer TV's.", "verified": true, "helpfulness": "0/0", "author": "John D'Occhio"}, {"rating": 5.0, "review": "Working as expected", "verified": true, "helpfulness": "0/0", "author": "Debbie Janson"}, {"rating": 5.0, "review": "I'm loving it so far!", "verified": true, "helpfulness": "0/0", "author": "Marvin Castro"}, {"rating": 5.0, "review": "Loving it!", "verified": true, "helpfulness": "0/0", "author": "ogidigirl"}, {"rating": 5.0, "review": "I love Amazon Fire TV Stick. I'm not into games and all the other gadgets and all I need is the Fire Stick. I can watch and catch up on movies and television shows that I've wanted to see.", "verified": true, "helpfulness": "0/0", "author": "Valencia Miller"}]