[{"rating": 2.0, "review": "Let me guess, you showcase HBO rejects (I know because I just cut HBO off my cable provider and went to Showtime), so I will not even consider this piece of tech based on that alone. I know the way these things run. See about 1/2 yr ago I purchased a device at WalMart called a Rabbit which was supposed to show thousands , etc, blah/blah/blah. After 3 wks the piece of garbage broke in half while I was trying to get the piece of China wretched technology. I try (with lil luck to avoid products coming out of China, we all know that they have it in for us and it won't be long b4 they come out of their over-pop country for revenge on the USA", "verified": false, "helpfulness": "0/2", "author": "Eric D Ridenour"}, {"rating": 5.0, "review": "Works as advertised. Great", "verified": true, "helpfulness": "0/1", "author": "Carl Golston II"}, {"rating": 5.0, "review": "way cool", "verified": true, "helpfulness": "0/0", "author": "john henry"}, {"rating": 3.0, "review": "This has boosted my Netflix game immensely :) I use it for Netflix, Hulu, and pandora and for the most part it's great. Many times it has acted up so that Netflix wouldn't load an or there was some glitch so that I had to unplug it from the power source for a bit and then go back. If it wasn't for the glitches this would be a 5 star item! Nonetheless I am happy I bought it!", "verified": true, "helpfulness": "1/1", "author": "Nicole V"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Karla"}, {"rating": 5.0, "review": "This Fire TV is great... not perfect... but I am more than willing to accept the growing pains in the hope that; I will some day be able to drop my current satellite  TV carrier;  as they are no joy to deal with.... an example of this; is that most popular movies are eventually all repeatedly played on all of the other movie  channel's . The thing about the latter topic is the learning curve that is disturbingly now a disappointing fact that = one new popular movie will play over and over sometimes for full year; one new movie is now on every network I pay for. I think having an entertainment package that is set up to expire in certain ways or in whole or in parts;  evolving into a negative learning curve...that  my bill gradually grew too  over $130.00 monthly and did  eventually end up being $150.00 monthly . I have had conversations with others with a monthly cable  bill of $200.00 this to me is unbelievable; considering the bill at some point suddenly felt like an unfair carnival game .  I now have to constantly keep open eyes on my current satellite entertainment package and there tactical billing changes....I am fed up with the double talk; each and every time I have to renegotiate my entertainment package just trying to keep my bill around the $100.00 range. I actually had a customer agent laughing at me because I stated the history of TV in my lifetime from free TV with commercials; evolving  to  piad cable with no commercials and now in these times of technology; you are now a part of an indifferent private Club known as fine art of \"Algorithms\" in  what can and does feel like maze of double talk information;  turning what sounds like a good product until  that day of realizing; not only was I locked into a contract but my bill was now a constant flux of jockeying back and forth with a trained customer care person; that now made recommendations that  apparently are compleatly designed to have any of my input turned into a recorded loop or what some would  call; \"a moment of clarity\" especially when a quality customer care person calls me up on my time and with all sincerity has an outright fit of laughter concerning my locked in contractual billing woes and the disbelief that TV was actually free at one time.... Anyway gogetem Amazon. I have everything Amazon and would like nothing more to than to pay into a full on TV entertainment  package with a company like Amazon that I believe in; Amazon has repeatedly proven to me that they can and do everything better... in customer satisfaction in all there products and services. All of my personal experiences with any and all of  Amazons costumer staff has been by far the most outstanding group of people that seemingly without effort; make a worldwide company feel like one of my own tribe or family of friends that I would break bread with any day of the week. I hope to have Fire TV as my primary entertainment package by the middle of 2016.", "verified": true, "helpfulness": "1/1", "author": "Chatow"}, {"rating": 1.0, "review": "I can not use this product in Peru.  Maybe you should tell the costumers that it is only for USA", "verified": true, "helpfulness": "1/1", "author": "cecilia d"}, {"rating": 2.0, "review": "Have yet been able to use it, have tried all suggestions from your tech people. Not sure what to do next. Any further help would be great, would love to use it.", "verified": true, "helpfulness": "0/0", "author": "John Ziola"}, {"rating": 5.0, "review": "This works perfectly. We use it for Netflix, Amazon Prime, and SlingTV. It works so well, I'm not sure why people would get the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "memoryr"}, {"rating": 5.0, "review": "My Husband and I are loving our Fire Stick!!!! So simple to use and convenient...", "verified": true, "helpfulness": "0/0", "author": "Shanaya Jones"}]