[{"rating": 5.0, "review": "OMG I love this! I can stream so much, and $100 a year is so worth it to stream so many tv shows and movies. Amazon rocks!", "verified": true, "helpfulness": "1/2", "author": "Jackie Scott"}, {"rating": 5.0, "review": "Cut thew cable, this save money.", "verified": true, "helpfulness": "0/1", "author": "Scott Wyskiel"}, {"rating": 5.0, "review": "The Fire Stick is on a tv in a guest bedroom that does not have a cable box. It works very well and I am pleased to have it.", "verified": true, "helpfulness": "0/1", "author": "singnote"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Michelle S."}, {"rating": 5.0, "review": "Great investment!! I have no cable in my bedroom and the fire stick took care of that problem.  Great price!! Easy to install!! Would highly recommend!!!", "verified": true, "helpfulness": "0/1", "author": "Cassi Martin"}, {"rating": 3.0, "review": "I have both a fire stick and a roku. So it's hard not to compare the two. The fire stick is extremely inconsistent. Often it doesn't load the show or movie and even more often it cuts in and out. Almost like the service just disconnects for awhile. I know it's not my internet because as I mentioned I also have a roku and I never have problems with it. Fire stick is definitely convienent and extremely portable but it's just not reliable.", "verified": true, "helpfulness": "1/2", "author": "JB"}, {"rating": 5.0, "review": "My bedroom TV isn't a \"Smart\" TV, so the Fire TV Stick has been great for those times evenings I want to watch a movie from my bedroom..  Easy to use!  So many things to chose from!!", "verified": true, "helpfulness": "1/1", "author": "victoria champ"}, {"rating": 2.0, "review": "Great when it works. At night with two baby monitors going often says slow internet  connection. And will not play.", "verified": true, "helpfulness": "1/1", "author": "Kristin S."}, {"rating": 5.0, "review": "Easy to use layout… I love the portability… The only Con would be I wish it had more memory to solve the buffering issues", "verified": true, "helpfulness": "0/0", "author": "Kevin P. Brown"}, {"rating": 1.0, "review": "not very user friendly and always says cant connect when you want it to", "verified": true, "helpfulness": "1/1", "author": "jas"}]