[{"rating": 5.0, "review": "Love this!!!", "verified": true, "helpfulness": "0/0", "author": "Jill Laurello"}, {"rating": 5.0, "review": "Prefer the Fire Stick over the Amazon Prime app on my Sony TV. This plugs right in and works great. No buffering for me and the interface is simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Simon \"SR\""}, {"rating": 5.0, "review": "Despite some negative reviews, I bought one because I trust Amazon. Right out of the box, in just a few minutes I set it up using my home WiFi and accessed Netflix. The ONLY feature that could be improved would be to make it easier to open the battery compartment of the remote. Amazingly, it took me 2 minutes to slide the cover open. I guess, even in the best of families are a few black sheep, but what the heck--now I know I need to use a thin blade to pop it open.", "verified": false, "helpfulness": "1/1", "author": "Patrick L"}, {"rating": 5.0, "review": "After ordering this on my prime account through pre-order for $20, I honestly didn't expect much. However, this device has replaced my roku, ps4 for all my tv's. The ability to mirror cast is a great bonus!", "verified": true, "helpfulness": "0/0", "author": "Jacob a Edwards"}, {"rating": 3.0, "review": "Would like to see it have function of playing movies off of network computers. The games suck and the apps too. The wifi 5 works good. Everything works great. Paid 19 bucks for pre-order.  But what I don't like is this device as all technology is all about making money. Money gets in the way of what really could be 100 times better. For 19 bucks I get my money's worth. But I'd gladly spend 300 bucks for something that was really worth my while. It just isn't there yet. Technology deflates and gets better in time leaving me to feel jaded and wait for something good to actually come out. But you can't wait because in this world u gotta take what you can get. I figure in 5 more years this stuff is gonna be so outdated and worthless. Time and money will tell.", "verified": true, "helpfulness": "0/0", "author": "PonySlaystation"}, {"rating": 5.0, "review": "Got it on the early $19 deal and got here a week ahead of schedule. Works much better than my old Roku. The Roku took forever to load a movie before it would start playing and would stop and reload occasionally. I only have DSL and it's not very fast, but we watched a movie last night and it loaded instantly and didn't stop to reload once. I am very satisfied with it.", "verified": true, "helpfulness": "0/0", "author": "Hamster"}, {"rating": 1.0, "review": "The $20 dollar price was good, but it would not work for me.Everything was fine except it always stops in the middle of the movies.", "verified": true, "helpfulness": "1/2", "author": "Ken T."}, {"rating": 2.0, "review": "UPDATE. After 8 months. My Fire Stick is dead. I have no idea what happened to it. It just wouldn't turn on one day. I replaced the batteries but it still wouldn't wake up. I tried unplugging it and plugging it back in, it still does boot up.I wish there was YouTube and crunchyroll. It is light on apps/channels. But it makes up for it in performance. Far quicker, and better picture than watching video on my PS3.", "verified": true, "helpfulness": "0/0", "author": "Prime User \"Prime User\""}, {"rating": 1.0, "review": "Killed my entire network anytime it logged in.  Never got it working properly.  Sending it back, hoping I just got a defective one.  For anyone else you will have to reset your router every time it connects.", "verified": true, "helpfulness": "0/1", "author": "PenName"}, {"rating": 5.0, "review": "I have been using this product for a few days now and I have to say it's my favorite thing to use!! The installation was seamless with my Samsung TV and the HD looks amazing for such a little stick. My only gripe is that I wish I can have all the TVs in the home hooked up together,but I think this more of a wish for a future update ..Hint hint Amazon...", "verified": true, "helpfulness": "0/0", "author": "Jeremy Valadez"}]