[{"rating": 5.0, "review": "This is s great buy for the money!", "verified": true, "helpfulness": "0/0", "author": "Tiffany Martinelli"}, {"rating": 5.0, "review": "Love it almost as well as my fire tablet", "verified": true, "helpfulness": "0/0", "author": "Threase Grimsley \"ttttttt\""}, {"rating": 4.0, "review": "The tech support for this thing is nuts!  I ordered this device in Jan 2015.  I don't remember when it was delivered.  Anyway, it worked great for awhile.  About a month ago, I noticed that it didn't automatically switch the TV to the proper input when the HOME button was pressed.  This was annoying, but I just reached for the TV's remote and manually changed inputs.  Hey, I'm easy.  Then, last week, it just stopped working.  All I got was a message on my screen that said the TV was not receiving a signal from the device - check networking and other connections.I called Amazon tech support.  They took me down the rabbit hole.  I was on the phone for a couple of hours doing all the elementary troubleshooting that everyone does prior to calling for help.  At one point, Amazon contacted my cable provider's tech support and put me on a three-way call!  Amazon wanted Comcast to remotely switch my router's frequency from 2.4 Ghz to 5 Ghz, or vice versa.  Both the Comcast tech and I simultaneously asked, \"WTF?\"  Evidently, Amazon has a known issue with this thing losing connectivity.  I was not in the mood to reconfigure almost a dozen WiFi enabled devices in my home to accommodate this one device that used to work.The kibosh was put to the Amazon insanity when I finally asked the question, \"Is this thing still under Amazon warranty?\"  The answer was, \"Yes.\"  So, I told them to send me an RMA because I was done trying to resurrect what was clearly a dead device.  The Amazon tech (Jake) was cheerful and professional throughout my ordeal.  Of course, it wasn't his fault.  He has a protocol to follow.Amazon quickly replaced the offending device.  The replacement works great - so far (less than 24 hrs as of this post).", "verified": true, "helpfulness": "1/1", "author": "S. P. Cooper"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/2", "author": "dionicio diaz"}, {"rating": 5.0, "review": "Very quick response time amazing for its size!", "verified": true, "helpfulness": "0/0", "author": "Walter M."}, {"rating": 5.0, "review": "GREAT item", "verified": true, "helpfulness": "0/0", "author": "Jorge Paredes"}, {"rating": 3.0, "review": "This firetv stick is good to use esp. when you have the option to sideload many great apk from other sources. The remote is small and light but it lack a keyboard.", "verified": true, "helpfulness": "0/1", "author": "Andrew"}, {"rating": 5.0, "review": "No review.", "verified": true, "helpfulness": "0/1", "author": "Michael J. Lynch"}, {"rating": 5.0, "review": "Love it!  Cancelled cable service (trying to cut down on expenses), and this is all we use now.  Great selection especially for kids.", "verified": true, "helpfulness": "0/0", "author": "JENGR \"JENGR\""}, {"rating": 5.0, "review": "Awesome !! Set up is so easy!! Everyone should have one of these", "verified": true, "helpfulness": "0/0", "author": "BRENDA IMHOFF"}]