[{"rating": 2.0, "review": "Slow performance. Buy  the Fire TV box  instead of this and you will be much happier", "verified": false, "helpfulness": "0/0", "author": "John Bartos"}, {"rating": 4.0, "review": "Love it.  I think they have some bugs to work out.  I have to keep finding my WiFi.", "verified": true, "helpfulness": "0/0", "author": "C. Bailey"}, {"rating": 5.0, "review": "I have been really thrilled with the Fire Stick. I know some of the other reviews had issues with dropped connections, etc. I have had it almost 3 weeks and have only had one drop and a few slowdowns. I blame that mostly on my internet provider. (My iPhone 6 loses it's wifi connection at least 2 or 3 times a week, so these are the trials of technology, I think.) Anyway, I already have prime (love!) and since I don't have cable, it is absolutely the easies way to watch stuff on my real TV instead of my laptop. Former roommate had an Apple TV and this is as easy to use but half the price.", "verified": true, "helpfulness": "0/0", "author": "Merridee"}, {"rating": 5.0, "review": "I gave the Fire TV Stick 5 stars because it works perfect. I set it up in 5 minutes. It programmed itself. It found my wireless in 10 seconds and prompted me what to do. I have an Amazon account so it arrived programmed in my name. I already have a Smart TV so it duplicates some items such as Netflix etc. but with my Amazon Prime I now get movies and TV series not offered else where. I recommend the Stick to anyone with a HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Sara \"maddog504\""}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Amazon has their finger on the pulse of what customers want, the Fire Tv Stick is fantastic and at a great price, it also does Kodi/Xbmc.  it is truly outstanding!!!", "verified": true, "helpfulness": "0/0", "author": "HarryMcOne \"HarryMcOne\""}, {"rating": 1.0, "review": "Awesome. Exceeds my expectations!!!", "verified": true, "helpfulness": "0/2", "author": "Mark Reeves"}, {"rating": 5.0, "review": "I am amazed how easy this was to connect, and to use, and to watch the shows.  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "E. Roberts \"make life easy\""}, {"rating": 5.0, "review": "If you have cable or satellite service without Fire Stick you're seriously missing the boat.  Start with an Amazon Prime account then DROP any additional services from you cable or satellite provider because you'll get most of that back with your new Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "Desi \"Destiny K. Coleman\""}, {"rating": 5.0, "review": "Worked great. Love it.", "verified": true, "helpfulness": "0/0", "author": "2Treks"}]