[{"rating": 4.0, "review": "I have really enjoyed having this in my home. The home menu is easy to navigate and very user friendly! Access to endless hours of entertainment and apps for the whole family! Having the fire stick makes paying for prime even more worth it! It's also great for traveling!", "verified": true, "helpfulness": "0/1", "author": "Megan Kucera"}, {"rating": 4.0, "review": "we love it...........still learning though", "verified": true, "helpfulness": "0/1", "author": "J Cochran"}, {"rating": 4.0, "review": "I love streaming devices and having things at my fingertips, and this stick does as good a job as any in my opinion.  I own the original Roku, the AppleTV, a Magnavox streaming box, a Vudu Spark and now this.  I picked it up for $24 on Prime Day.  I found it to be easy to set-up.  I'm a big Amazon Prime fan, so I bought it primarily for streaming their content.  I was pleased to see that the Flixster app on the stick allowed me to stream my Vudu/UV collection.  I have about 100 of those movies so that is cool for me.  The other pleasant surprise was the included free games that can be played on the device.  I installed Flappy Bird and Crossy Road and played it with the kids passing the remote around the room.  I know they are mindless games, but sometimes just having everyone in the room together to do the same thing around the TV and enjoy it is worth it because they would so often rather just be hiding out in their rooms or with their faces in some personal electronic device ignoring everyone else.  We also installed the Game of Life for free on the device and played it.  It was nice to play on the big screen, and not have to do the banking, spinning, piece moving, setup, etc.  My only concerns for the device are... it seems to get hot after using for hours, but I don't know if that would ever be an unsafe thing or affect its longterm performance, and I don't like that it requires external power beyond what a TV USB port can provide.  My Vudu Spark works solely by plugging into the HDMI port, then into the USB port on the TV.  As I understand it, this pretty much needs or works best by actually using the wall plug.  It was included though so that is good.  I give it 4 stars instead of 5 due to those last couple points, but for the price I got it for it was a great deal.", "verified": true, "helpfulness": "0/1", "author": "G-Man"}, {"rating": 5.0, "review": "Very pleased w all the choices", "verified": true, "helpfulness": "0/1", "author": "JAN COLE"}, {"rating": 4.0, "review": "I was really interested in the Firestick but was unsure. On Prime Day it was on sale for $24 - my sign to give it a try. Love it!! Easy to install, easy to use and the pic quality is great. There are so many channel apps to choose from I can cancel my cable service without missing it. Great product!", "verified": true, "helpfulness": "1/2", "author": "Miss April"}, {"rating": 5.0, "review": "This device does it all, it's what I thought the chromecast was going to be.Old people might have a hard time getting used to it, but you can't beat it's features and speed is top notch.", "verified": true, "helpfulness": "0/1", "author": "john hufford"}, {"rating": 5.0, "review": "upWorks great, easy set", "verified": true, "helpfulness": "0/1", "author": "H. Phelps \"NCRN\""}, {"rating": 4.0, "review": "Worst decision I have ever made.does not workcannot connect to the Internet.", "verified": true, "helpfulness": "0/1", "author": "lethres smith"}, {"rating": 5.0, "review": "Instant access and excellent picture and sound. The only issue I have is figuring out how to search.", "verified": true, "helpfulness": "0/1", "author": "Caryl Hall \"darkreader\""}, {"rating": 5.0, "review": "An amazing purchase. Definitely worth every penny. You can watch Netflix or Amazon prime or other streaming like HBOgo or Hulu! It's as easy as plugging it in.", "verified": true, "helpfulness": "0/1", "author": "Benwho"}]