[{"rating": 5.0, "review": "I am very pleased with the Fire TV Stick.  It was extremely easy to set up and always connects to the internet quickly and streams videos well. The games are a nice plus and the portability is a wonderful feature.  I have already recommended it to a friend who also purchased one.", "verified": true, "helpfulness": "0/0", "author": "CaddyH \"True Dreamer\""}, {"rating": 1.0, "review": "This thing has absolutely no range. Even with a WiFi signal of good, it constantly buffers and disconnects. All of the apps need to be re-authenticated once a week. Not worth the aggravation.", "verified": true, "helpfulness": "1/1", "author": "G-Man"}, {"rating": 5.0, "review": "I have been wanting a fire stick for a while now.  I already own an apple TV, and wanted a device that would allow us to access our Amazon Prime services such as the movies, music etc.I bought this when it went on sale on Prime Day and have been in love ever since.  Unlike apple TV, you can personalize this with the ability to download SO MANY APPS!  I'm talking games, tv channels, aquarium, fireplace, etc etc!Parental control - love hate relationship.  I love that I can set one so that my 5 year old doesn't accidentally buy something he shouldn't.  (it's happened in the app store before)  However, having to enter it before every show, movie, game etc that's on prime is a pain.  Honestly, I haven't looked to see if I can modify the settings soooooo....We have had some freezing issues with the stick in leaving games - other than that - it works flawlessly.  I have told (bragged) to everyone about how awesome this stick is.  Truly a great entertainment addition to any house - Amazon Prime members or not.", "verified": true, "helpfulness": "0/0", "author": "Sarah S."}, {"rating": 5.0, "review": "This was the perfect answer for our big screen TV that was not a smart TV.  Worked exactly like it was suppose to, installation was simple.  Amazon Prime and Netflix has opened up a thousand more choices and the best part is it is really affordable.", "verified": true, "helpfulness": "0/0", "author": "Vickie Richmann"}, {"rating": 5.0, "review": "I love this device.", "verified": true, "helpfulness": "0/0", "author": "B. Fisk"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Michele Burton"}, {"rating": 1.0, "review": "It overheats and is constantly buffering. A 30 min show takes an hour and a half to watch", "verified": true, "helpfulness": "1/1", "author": "sara studer"}, {"rating": 5.0, "review": "Great. Fast remote. I used it to see my favorite Arabic channels through kodi.", "verified": true, "helpfulness": "0/0", "author": "Almuthanna"}, {"rating": 5.0, "review": "Raved review", "verified": true, "helpfulness": "0/0", "author": "Famous Smith"}, {"rating": 3.0, "review": "Limited to the supported apps and a bit slow to response after running for awhile.if I didn't get it for free, I probably wouldn't have bothered with it, still happy with using my chrome cast instead", "verified": true, "helpfulness": "0/0", "author": "Josh85JC"}]