[{"rating": 5.0, "review": "Excellent device.  Easy to use.  I only ask that the issue with hotels and internet connectivity be fixed because it would be so nice to use while I travel.  Truly great, thought", "verified": true, "helpfulness": "0/0", "author": "Eric Ledford"}, {"rating": 1.0, "review": "The instructions are incomplete. I've had to call Amazon every time I've used the device and the instructions given by the techs were simple. If clear, concise and complete directions were provided with the item bought, everything would be a lot easier. It's frustrating and annoying. Plus, I don't like the fact that you have to restart both the kindle and the fire stick every time you want to use them together. I'd rather just plug in and switch over than the options presented at present. As soon as there's something else available that does the same thing, I'm going to throw the fire stick away.", "verified": true, "helpfulness": "0/0", "author": "K. Smith"}, {"rating": 5.0, "review": "Wow.. Easy..do not waste money on a smart tv... We have both Apple TV and firestick on different tv's.", "verified": true, "helpfulness": "0/0", "author": "dan / runner"}, {"rating": 4.0, "review": "So far I am satisfied", "verified": true, "helpfulness": "0/0", "author": "Beth Hoel"}, {"rating": 4.0, "review": "easy to use and works just fine", "verified": true, "helpfulness": "0/0", "author": "matt vestal"}, {"rating": 5.0, "review": "The Fire Tv Stick surpassed my expectation's. Best streaming stick on the market. The apps are great and there's so much you can do that others can't. Other companies will surely imitate this product just know amazon was the first (mainstream) to provide such a great product.", "verified": true, "helpfulness": "0/0", "author": "Santana"}, {"rating": 3.0, "review": "The content is wonderful. The problem is the stick, it was hard to get into our HDMI port. Now I had to buy a switch to get other hdmi to work.", "verified": true, "helpfulness": "0/0", "author": "Jimi P"}, {"rating": 4.0, "review": "I'm still learning what this can offer, but so far I'm very pleased with it.  It doesn't seem to require too much bandwidth to stream a good picture.  The packaging was very nice and initial setup pretty easy.  I've signed up for Sling TV and have used Pandora multiple times.  One of the big draws for me was Amazon Prime Video streaming, but I really haven't used it yet.  I have streamed some music from Amazon, which worked well.  Remote integration so both the TV and Fire Stick could be controlled from one device would be a great addition.", "verified": true, "helpfulness": "0/0", "author": "JustAGuy"}, {"rating": 4.0, "review": "5 Stars if remote was bigger for those with bad eyes. Easy-peasy setup", "verified": true, "helpfulness": "0/0", "author": "KarenH"}, {"rating": 5.0, "review": "Easy to use, easy to set up. We purchased this for our son's room, in lieu of cable. We have Roku boxes for our other TV's. This was significantly less expensive and works just fine. I don't anticipate this getting anywhere near as much use as, say, the family room TV; but for the one show a day allowed in his room it's great.", "verified": true, "helpfulness": "0/0", "author": "A. Rhodes \"Anne\""}]