[{"rating": 5.0, "review": "I've had a Chromecast since it was released, and I was iffy about it at first. But it was a new product and it's been updated enough that I really like using it. The Fire TV Stick is a similar product to Chromecast, but I would not say that they are identical. I really like having an independent interface and remote to navigate with. Sometimes I don't want to pull something up on my phone/laptop and have to keep it on to be able to watch something via Netflix, so I like the independence of this guy. But I keep and use both of them, as it's nice to be able to cast my computer screen to the TV, and they have a little different offerings.I think it's the better present for someone who's older/less tech savvy, and maybe even for the Average Joe who wants something really simple to work with. For people who like their toys, I would say get both, for they are both interchangeable and unique.", "verified": true, "helpfulness": "1/1", "author": "Wyatt True"}, {"rating": 5.0, "review": "The Fire Stick compares to a Chromecast, but is way better because it has a remote. The remote is great - it's responsive, good clicky feedback and has just enough buttons to do what it needs to without being overly complicated. Also, the kindle fire remote app for smartphones is awesome.The Amazon interface is very fast and smooth. If your internet speed is fast enough, content loads quickly and smoothly.If you wish to stream content from your PC, the Plex app also works very well on the FireStick.One negative is the power adapter is terrible. It's shaped to where it will not fit well into almost any power strip without blocking at least one other outlet unless its the last one. The design of the Firestick USB power adapter is garbage.", "verified": true, "helpfulness": "1/1", "author": "Joe"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "E. Scott"}, {"rating": 4.0, "review": "Not bad if you have good wireless coverage in your home, but a little difficult if your Wi-fi is spotty. Had to buy a Wi-fi booster to get it to work the way I wanted.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Wish it could charge through the USB port on the tv.  I still prefer the Roku stick.", "verified": true, "helpfulness": "1/1", "author": "RSB"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "1/2", "author": "Jennifer W."}, {"rating": 5.0, "review": "Surprised what this little thing can do. I got it at a discount so I figured I'd buy it. The one thing I hoped it would do, was to mirror my phone which was playing movies from my WD \"MyCloud\" over 100 miles away. Receiving data wireless from my MyCloud to my phone then to my phone to the Fire Stick was to much data to transfer. The movie would buffer alot and just wasn't worth it. However mirroring your phone itself is easy (at least with Android in my case). If you want to show pictures and play video content from your phone itself, it does a marvelous job! The only other thing I used was Netflix and that worked very smoothly. Other than that I haven't explored the Fire Stick's full potential. Great buy for the price!", "verified": true, "helpfulness": "1/1", "author": "Garrett"}, {"rating": 5.0, "review": "Amazing product so so so so happy", "verified": true, "helpfulness": "1/2", "author": "Anthony m."}, {"rating": 5.0, "review": "This was super easy to set up and start using, and the remote makes it super easy to use. I have another brand, but got this one so I could cast Amazon Instant Video to my main TV and for the same price, think this one beats the competition. We watch Netflix, as well, so this serves all our needs. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "BSM51"}, {"rating": 5.0, "review": "just love it", "verified": false, "helpfulness": "0/1", "author": "Sergio Correa"}]