[{"rating": 4.0, "review": "Really awesome product!", "verified": true, "helpfulness": "0/1", "author": "Genita Walker"}, {"rating": 5.0, "review": "Our Fire TV Stick, is simply amazing.  It functions flawlessly.  Installation was easy, even for my techno- challenged, self.  I can't say enough about this product...Other than, buy it !!", "verified": true, "helpfulness": "0/1", "author": "Gary Scott Fischer"}, {"rating": 5.0, "review": "I luv it", "verified": true, "helpfulness": "0/1", "author": "Erich Lane"}, {"rating": 3.0, "review": "So I did my research on the Amazon Fire TV Stick and bought it because it was affordable and I'm getting rid of my COX TV in the next month or two.One thing I didn't count on or even notice was the length of the USB Cable (60 inches).  I plugged the Fire Stick into the TV and tried to plug it into the power strip and it wouldn't reach.Nowhere on the description does it mention how long the USB Cable is.  Also, when you buy the Amazon Fire TV Stick it doesn't give you the option to buy a longer cord.Make sure your TV and power cord are within 60 inches of each other or else you won't be watching Amazon TV.", "verified": true, "helpfulness": "1/1", "author": "Kevin Sheehan"}, {"rating": 5.0, "review": "Looooove", "verified": true, "helpfulness": "0/1", "author": "Lacey K."}, {"rating": 5.0, "review": "The Fire TV Stick provides me with everything I need to make my TV viewing more individualized to meet my unique needs.  Plus, I is very easy to use for a total non-techno geek like me.", "verified": true, "helpfulness": "0/1", "author": "Doris Machinski"}, {"rating": 4.0, "review": "Easy to install and setup. Being able to use the remote and voice control app on my phone is a plus. Loving it so far.", "verified": true, "helpfulness": "1/1", "author": "Fred Padgett"}, {"rating": 5.0, "review": "So many apps. Hours of entertainment.", "verified": true, "helpfulness": "0/1", "author": "Dorothea C. Belcher"}, {"rating": 1.0, "review": "Would not pick up a wifi signal where our Roku did (bought this to replace the Roku). Returned.", "verified": true, "helpfulness": "1/1", "author": "George"}, {"rating": 2.0, "review": "The service is fantastic; the gimmick of getting you to buy remote after remote and the previous ones become \"sofa lunch\".  I've purchased and lost another remote.  I called CS and asked how to locate the remote (surely, there is something I can make beep).  Oh no, you must find the little booger manually or buy a new one (another new one).  They act like it's no big deal to buy another remote, perhaps I should buy several and keep the extras for when I misplace the next one.No, I'm not buying another remote.  I've turned my smartphone into the remote and, aside for way too speedy scrolling, it works fine.  Damn, I'm still angry!", "verified": true, "helpfulness": "0/2", "author": "Jo"}]