[{"rating": 5.0, "review": "Great product!  We cancelled cables and needed something for the bedroom TV and this is perfect!  We can download all our apps (NetFlix, HBOGo, Showtime Anytime), and the HD Quality is fantastic!  Picture is super clear!  Highly recommend for any TV in your home.", "verified": true, "helpfulness": "0/0", "author": "kewlCHIKA413"}, {"rating": 5.0, "review": "Great addition to make your TV a smart TV. Easy to use and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "robert crowder"}, {"rating": 5.0, "review": "awesome! keep it in my sons room so he can watch his favorite you tube videos- love that its portable.", "verified": true, "helpfulness": "0/0", "author": "kristen thress"}, {"rating": 5.0, "review": "it's a marvel.  so easy to install, and to use.  was having a lot of problems with connections to Netflix with my Blu-Ray, but this is amazing. A great product, very reasonable priced.", "verified": true, "helpfulness": "0/0", "author": "Mary Cilia"}, {"rating": 2.0, "review": "The idea is nice, but it's simply not powerful enough to do what they are trying to accomplish. I have consistent issues with performance -- HD video will hiccup, stuttering when changing screens, etc. Problem I just don't have with my Chromecast - admittedly they are very different devices, but I prefer it. If you really want a Amazon TV, buy the full Fire TV not just the stick, it just isn't good enough.", "verified": true, "helpfulness": "0/0", "author": "Peckles"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jeff L Hunter"}, {"rating": 5.0, "review": "Great Product!!!", "verified": true, "helpfulness": "0/0", "author": "Balamurugan Muthiah"}, {"rating": 3.0, "review": "The ads indicate access to many movies at no additional charge.  We have found even very old movies, including children movies, have a charge to view.  Very disappointed - Net Flix offers more movies with no charge.", "verified": true, "helpfulness": "1/1", "author": "Joanshaw"}, {"rating": 5.0, "review": "Wanted something to turn my dumb tv into HAL. This came very close.", "verified": true, "helpfulness": "0/0", "author": "kj"}, {"rating": 5.0, "review": "Love, love, love!!! Would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Angela \"Angela M Brandon\""}]