[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jennie Pierce"}, {"rating": 4.0, "review": "much better than my chromecast", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "This has to be the BEST money we've spent in a long time! We were able to finally watch Netflix, Amazon Prime, as well as our movie channel subscriptions. Great little gadget that we will use for a long time!", "verified": true, "helpfulness": "0/0", "author": "Kristine A"}, {"rating": 5.0, "review": "Bought this with an Amazon Prime offer. Works seamlessly with our Samsung Smart TV. Simple installation once our wifi network was recognized and the password entered. Good product.", "verified": true, "helpfulness": "0/0", "author": "Phil Purdin \"MacMan\""}, {"rating": 5.0, "review": "So easy to work with. Sorry I didn't get the voice remote. Easy to hook up! took only a minute. Came with everything you need to hook it up with. Easy to buy, easy to use.", "verified": true, "helpfulness": "0/0", "author": "S E Sears"}, {"rating": 4.0, "review": "Works well but the remote does not have the voice capability which was too bad, which is why I gave it a 4 not a 5.  You can buy the voice remote but it just should have come with it or there should have been an option to upgrade at ordering.  I have the stick and the box, different tv's.", "verified": true, "helpfulness": "0/0", "author": "Susan C. Parks"}, {"rating": 5.0, "review": "I didn't but this from Amazon. But at best buy and we love it!!!", "verified": true, "helpfulness": "0/0", "author": "Jacqui75 \"Jacqui Lungo\""}, {"rating": 4.0, "review": "Quick and easy set up.", "verified": true, "helpfulness": "0/0", "author": "dennis fahnestock"}, {"rating": 5.0, "review": "Amazing piece of equipment runs kodi really well  and you can mirror ipad or android.All you need in one small device.", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 4.0, "review": "Shipping was super fast and it was delivered on a sunday.. tv stick is great minus the lag that I get.", "verified": true, "helpfulness": "0/0", "author": "Samantha Hanson"}]