[{"rating": 5.0, "review": "Works perfect!", "verified": true, "helpfulness": "0/0", "author": "Barbara Z. Church \"slugchurch\""}, {"rating": 3.0, "review": "I want to give it a higher rating but can't because I can't use it like I want too. I received it as a gift and I know it is awesome because I have seen it work but it does not work on my TV. My TV is only a year and a half old and it works on another TV in our house that is older. So yes I can use it in another room but I don't need it in there I wanted it for the room that I could not have the abilities of the fire stick. Just frustrating because basically I have to buy a new TV and end up spending money that I thought I would be saving by buying a $40 item.", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 1.0, "review": "It just gives me access to for fee networks.  It was a gift so I had no expectation.  Not impressed.", "verified": false, "helpfulness": "1/2", "author": "Jennifer Etheridge"}, {"rating": 5.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  It is awesome.", "verified": true, "helpfulness": "0/0", "author": "Elena"}, {"rating": 5.0, "review": "Got it as a gift for my parents and they love it", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "it is new and it has it's issues...already failed us once but love the liberties it allows!", "verified": true, "helpfulness": "0/0", "author": "Lauren Dale"}, {"rating": 5.0, "review": "Its like turning your tv into a tablet.  So cool and with Amazon Prime you have such great selection of movies and tv shows to watch.  My family loves it.", "verified": true, "helpfulness": "0/0", "author": "steven b. dym"}, {"rating": 5.0, "review": "Love it! So user friendly and without the cost of switching to a smart tv! Best gift I received this Christmas!", "verified": true, "helpfulness": "0/0", "author": "Amber Lynne Eakin \"amberpie\""}, {"rating": 5.0, "review": "Love the stick.  I had Chromecast but this far exceeds that.  Took me a bit to get it to \"talk\" to my router, but once that happened everything went vert smoothly.  Love having the remote (Chromecast does not have that).  For the price it is a great buy.", "verified": true, "helpfulness": "0/0", "author": "Linda"}]