[{"rating": 5.0, "review": "Good stuff does what it's supposed too!", "verified": true, "helpfulness": "0/0", "author": "demetrius harris"}, {"rating": 4.0, "review": "This device is such a sweet little media streamer! Everyone in my house was in love with it and it's ease of use. Personally, I do not think it is missing anything at all for average consumers. It is Miracast enabled, so you can stream to it, but it did not work with my surface pro 3. I originally bought to stream my SP3's screen, but it did not do so, so I returned it. It would have had 5 stars and it would not have been returned if it would have streamed my SP3 screen. Other than that, AWESOME device Amazon!", "verified": true, "helpfulness": "0/0", "author": "Andres Cavada"}, {"rating": 4.0, "review": "I really like that the fire tv 📺 and it was very easy to setup and I was able to get the apps that I use almost everyday.", "verified": true, "helpfulness": "0/0", "author": "purson;)"}, {"rating": 4.0, "review": "Love this little stick!Did I need yet another media device? No but, the price is right and the little device is so darned convenient!Play games, movies, ambiance apps at home or when you travel.Easy to connect to any modern TV - comes with an HDMI port dongle extender to let you plug this in when the space on the tv is too tight.Interface is snappy and quick. Took it to a hotel over New Years and used it for playing movies and games with friends.Comes with a small external power block but uses minimal power - mine has worked well by simply plugging the non proprietary usb power cable into the usb port found on most modern TVs.Pros:Small and portableCurrent GUI nice to useSips power so can be used with TV usb portCons:No power/reset switch for if it freezes (some apps may make this happen)USB is on the side instead of at the rear end of the stick - odd placement means the dongle will be needed in many cases.Doesn't appear to support the modern HDMI port power standard that would allow you to simply plug and play", "verified": true, "helpfulness": "0/0", "author": "X. IrAal \"Avid Amazon Prime Purchaser\""}, {"rating": 1.0, "review": "This device is not ready for release. Here are some of the issues:- Embedded Miracast support not working: My sony experia Z3 compact does not connect to the fire-stick. Firestick with latest software just reboots on an connect attempt. Attempts on a previous version resulted in failures to connect, reboots of the firestick,, connection drops. Casting of audio never worked.- Airplay application AirBuddy not working. Server says on, but Server settings display empty MAC address and ip address- Slightly choppy video playback for any video- Issues with fire stick audio: problems switching between dolby digital (as in amazon prime video), and back to 2 channel PCM (as in music). Bit rate gets messed up and audio sounds in slo mo.Bottom line: Return to sender", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer \"johnnyb555\""}, {"rating": 4.0, "review": "It was a gift for my daughter..she said she really likes it so far.", "verified": true, "helpfulness": "0/0", "author": "candace"}, {"rating": 5.0, "review": "Very nice device. I was surprised at how easy it it was to install and how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "Rich Sherwood"}, {"rating": 5.0, "review": "Very easy to install. It takes less than 5 minutes. Very satisfied with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Lots of fun, have only played with it for an hour or so, but it will be beneficial.", "verified": true, "helpfulness": "0/0", "author": "S. Phillips"}, {"rating": 4.0, "review": "Great device, turns your regular tv into a smart tv", "verified": true, "helpfulness": "0/0", "author": "Tom,g"}]