[{"rating": 5.0, "review": "Like it so far!", "verified": true, "helpfulness": "0/0", "author": "Janet dotson"}, {"rating": 4.0, "review": "Very satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "Yvette Gomez"}, {"rating": 2.0, "review": "Mine seems to restart mid movie sometimes. Not a huge deal, but not ideal.", "verified": true, "helpfulness": "0/0", "author": "Jjwpg"}, {"rating": 5.0, "review": "I can't same anything bad about this thing. I'm mostly using for Streaming Sling TV through the TV and Netflix, but seriously a great device! No issues and love pairing it with the app.*** UPDATED 6/12/15: This device is still up and ticking. I cannot imagine a more user friendly device. As much as ever, I still love pairing this device with my phone and being able to pull up things on the screen from my phone or tablet. I recently got a Lenovo Yoga laptop and have been excited to give it a whirl as well. As I just attempted to try it live, it failed horribly, but there is still hope.The Amazon Fire saves the things I like and use frequently on the immediate menu when it's own. It's like Netflix... it shows everything you recently watched/used and makes recommendations for you. Now whose cable company does that?PROS: Cost effective, especially if done as a promo with Sling TVWorks well for live streaming, games and other thingsEasy to use from remote included or cell phoneSmallOut of sight, out of mind, but WORKS GREAT out of sight!CONS: I really wish it didn't have to be plugged in. It adds to the many other cords  I already have plugged in.And currently, figuring out how to connect my laptop wirelessly to it!", "verified": true, "helpfulness": "0/0", "author": "JV Marketing"}, {"rating": 5.0, "review": "great value", "verified": true, "helpfulness": "0/0", "author": "Lee Family Perdido"}, {"rating": 5.0, "review": "Easy set-up. Easy to use. Fast. Way cheaper than buying a slow smart tv or having to turn on a blu-ray to access wifi.", "verified": true, "helpfulness": "0/0", "author": "Bendy Rivera"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick has opened a great big world of quality TV.  The only caveat I have is it is not as easy to install as the directions lead you to believe.  After a chat with a FIOS tech, I was able to unlock the secret and was up and running and I am very glad I stuck it out.", "verified": true, "helpfulness": "0/0", "author": "Anne Perzeszty \"Brooklyn Reader\""}, {"rating": 5.0, "review": "We are loving our Fire TV Stick.  Finally cut the cord with the cable company and will not go back. Enjoying all the movies available to us as Prime members.  We've added Hulu to further customize our viewing choices.  Works great with many additional apps.", "verified": true, "helpfulness": "0/0", "author": "Janet B."}, {"rating": 5.0, "review": "I enjoy it very much", "verified": true, "helpfulness": "0/0", "author": "melinda s laird"}, {"rating": 1.0, "review": "Will not stay connected to WiFi", "verified": true, "helpfulness": "0/0", "author": "Mike Lane"}]