[{"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Starla Villalba \"Starla\""}, {"rating": 4.0, "review": "I'm an Amazon Prime member, so got this for $19 as part of special offer back in October.  Using it to finally have smart TV capability on an older Vizio TV that I have. Except for the wifi connection getting periodically lost, I love the Fire Stick. (note: It recovers itself in a minute or so, so it's no biggie, just a bit of an annoyance)BTW, the Amazon usability team/engineering nailed it with the easy to use/very intuitive setup experience - love it compared to the setup I had to do a few years okay with my Roku units.  Only thing I would recommend Amazon do is make the virtual keyboard be a \"ABCDEF...\" keyboard versus being laid out like a qwerty keyboard.  When I'm looking up at the TV and clicking on the remote control,  it's not the same user experience as having a qwerty keyboard beneath my fingertips, and having the keyboard laid out as query, makes it difficult to navigate - Roku wins on the keyboard layout.", "verified": true, "helpfulness": "1/1", "author": "mamashenay \"WebQueen\""}, {"rating": 5.0, "review": "We love our new Fire Stick. I bought it @ an amazing $19 and planned to use it when we travelled and in our RV but fter using it for a couple of weeks we've decided to keep it a permanent fixture. The stick is very quick and responsive and is a single source for movies, music, pictures and games. The picture is superburb and I wished I had purchased a couple more at that price. :)", "verified": true, "helpfulness": "0/0", "author": "Stephanie Dozier"}, {"rating": 5.0, "review": "Set up was easy and use is very simple. I have access to Amazon Prime, Netflix and several other programs including games. I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Deana"}, {"rating": 1.0, "review": "This device would not hold a network connection.  I tried for 10 days... reading help forums and trying it on different devices around the house.  No luck.  A few nights ago I set it to playing fireplace videos and it would freeze about every 10 minutes for a few minutes with intermittent network connection issues.  I have had a ROKU for a few years now which has worked flawlessly.  The Fire stick is about the same thing so I am returning it and getting another ROKU.", "verified": true, "helpfulness": "1/1", "author": "CB \"CB\""}, {"rating": 3.0, "review": "First off I will say I bought the Fire Stick during the $20 promotional period (which was nice. I bought the Chromecast for $23 during Black Friday deals). I've been using both but prefer the Chromecast both because added purchases are cheaper (Plex is $1.99 on the Play Store and I can use it on both my phone and with the Chromecast whereas on the Fire Stick it's $4.99 and can only be used on the stick). Rented movies on the Stick are more expensive. $3.99 vs $2.99 on the Chromecast for the same movie. The Chromecast can be powered off the USB port on my TV whereas the Stick needs the wall power. The Chromecast supports a lot more applications than the Stick. The Fire Stick doesn't support any Google apps (which I use a lot of) but not surprised by this. What I do like about the Fire Stick is the app that can be downloaded so your phone can be used as a remote. The app allows speach searching as well and is very accurate. Basically if you use Amazon products go for the Fire Stick but be prepared to spend more than if you went with the Chromecast. If you use Google products definitely go for the Chromecast as you'll be able to do more with it.", "verified": true, "helpfulness": "2/2", "author": "J. Osier"}, {"rating": 5.0, "review": "Fast", "verified": true, "helpfulness": "0/0", "author": "phil"}, {"rating": 4.0, "review": "So far so good. Very easy setup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 5.0, "review": "Incredibly easy setup! Great streaming device!", "verified": true, "helpfulness": "0/0", "author": "jumpinjill"}, {"rating": 5.0, "review": "Got it on a great sale offer from Amazon.  Works perfectly and easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "sunesis"}]