[{"rating": 5.0, "review": "We are enjoying our Amazon Fire Stick very much.  It was fairly easy to installeven for technology challenged.", "verified": true, "helpfulness": "0/0", "author": "Brenda C. Smith"}, {"rating": 5.0, "review": "I love it!  I have a smaller flat screen with no internet access and this works perfectly for bedrooms or my sewing room.", "verified": true, "helpfulness": "0/0", "author": "wahlnut"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Darrylt"}, {"rating": 5.0, "review": "This product is fantastic! It's all I need now to watch app my favorite Netflix shows AND Amazon shows! Plus, it's intuitive and suggests new shows and movies to watch. Completely pleased and very happy with this product!", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kurtis Huether"}, {"rating": 5.0, "review": "For watching TV and movies it is perfect, the stick isn't meant for to many games, I play crossy roads and its good on it. I watch TV shows without buffering.", "verified": true, "helpfulness": "0/0", "author": "David Druyor"}, {"rating": 5.0, "review": "Great, it does all my chromecast does and more. The only setbak is that the android app does not work in Dominican Republic.", "verified": true, "helpfulness": "0/0", "author": "Aristides Diaz"}, {"rating": 5.0, "review": "Great product.  Really pleased with it.", "verified": true, "helpfulness": "0/0", "author": "wendy bee"}, {"rating": 2.0, "review": "The Prime TV Watching material is pitiful.", "verified": true, "helpfulness": "0/0", "author": "Art Jonez"}, {"rating": 4.0, "review": "If you want to cut the cable, get a Roku.  If you primarily want to watch Amazon Prime, this will work (though Roku is better for that, too).  The Firestick is portable and will allow you to logon to guest networks that required web-based authentication.  It's obviously built to push Amazon content.  Though the channel list is growing, it will never compete with the thousands offered through Roku.", "verified": true, "helpfulness": "0/0", "author": "Private \"Unlisted\""}]