[{"rating": 3.0, "review": "I like it but I feel like it's limited compared to chromecast and other items", "verified": true, "helpfulness": "0/0", "author": "Tanner Rodrigues"}, {"rating": 5.0, "review": "I am over happy with this device. My play station 3 just gave out on me completely. I was using it only for the smart aspect since my bluray stopped working 2 years ago. Fire sticks user interface is so easy and smooth to use it's amazing. Opening it up and having amaZOn prime directly in your face is great. I got this for 19.99 during the two day special. I didn't expect to be this happy about it and I am.It pushes Dolby digital plus audio and 1080p video. Loads fast. Remote is easy to use. Interface is straight forward.I have an iPhone so i can't mirror my device...that would be my only con. I would love for amaZOn to create a bluray player with this user interface. It would be an instant purchase for me.", "verified": true, "helpfulness": "0/0", "author": "Moon"}, {"rating": 5.0, "review": "Works very well, smooth navigating, easy setup.", "verified": true, "helpfulness": "0/0", "author": "Frank Sambol"}, {"rating": 5.0, "review": "This device is amazing. The only thing I wish I had done is get the voice remote.", "verified": true, "helpfulness": "0/0", "author": "Emily Ellisor"}, {"rating": 5.0, "review": "Works great! Very easy to set up and it's nice to have internet TV somewhere besides the 'main box' downstairs.", "verified": true, "helpfulness": "0/0", "author": "SillieOlMe"}, {"rating": 4.0, "review": "it is good; specially when you are subscribed to Amazon Prime Services.But could be great it it allow stream from laptop as well, and this is a major let down for many.", "verified": true, "helpfulness": "0/0", "author": "Amit Jain"}, {"rating": 4.0, "review": "I got it as a gift I already have a machine for Netflix. So not sure yet what I will use it for but I like the simple use and setup also the phone as a remote is cool", "verified": true, "helpfulness": "0/0", "author": "Corey J. Blau \"CBlau\""}, {"rating": 4.0, "review": "Seems to be so far. The only issue is that it does not have all the apps like my apple TV unit does eg. Willow.tv.", "verified": true, "helpfulness": "0/0", "author": "Lorna D. Wallace"}, {"rating": 4.0, "review": "I like it but it would be better if you did not have to plug it in a outlet (always have a wire hanging around)", "verified": true, "helpfulness": "0/0", "author": "Ed Rolfngsmeyer"}, {"rating": 5.0, "review": "Fire TV Stick is all you need. Say no to cable.", "verified": true, "helpfulness": "0/0", "author": "Matt Istvan"}]