[{"rating": 2.0, "review": "The Amazon Fire stick was very easy to install and setup. It plays video on Amazon Prime well, however, it will not play Netflix videos smoothly. The image freezes while the audio continues to play. It happens very frequently during the program on every Netflix program we attempt to watch.", "verified": true, "helpfulness": "1/1", "author": "Mark"}, {"rating": 1.0, "review": "Every time I turn it on it simply throws up its hands and complains \"can't connect to the internet.\"That could be due to a poor wifi signal from my router, but I doubt it. None of my other devices (Android tablet, iPhone, iPad, Blu-ray player, Nintendo Wii, etc.) have any trouble with my wifi signal.So far, haven't been able to do anything with it. I did read that getting its software / firmware updated is supposed to help. I just haven't had the time to hassle with it.If you have a poor or flaky wifi signal, I'd pass this one up. It is pretty much useless without wifi. Half the time when the wifi does come up, I will start a search, and before the search is finished, I get the dreaded \"can't connect to the internet.\"", "verified": true, "helpfulness": "0/0", "author": "T. A. Baker \"Cybermouse\""}, {"rating": 5.0, "review": "We absolutely love it! Ordered it for my daughters room. Now she can watch good kids programming without paying for another cable hook up!", "verified": true, "helpfulness": "0/0", "author": "linda kocjan"}, {"rating": 4.0, "review": "So far, very good.  If you have two HDMI ports, you may have to try both to get the Fire TV Stick to work.  I got mine to work on the \"out\" port.  I have 2 of these devices.  My 2nd TV has only one port, and it worked great the first time.  Signal is occasionally dropped, but overall, performance is outstanding.  I chose this over other devices because I am a Prime member, choosing this just made sense.  Very good.  Would definitely recommend.  Setup of the 2nd Stick was super easy after having installed one. Happy to be making better use of the membership!", "verified": true, "helpfulness": "1/1", "author": "Sandy \"Sombra del Monte\""}, {"rating": 5.0, "review": "The Fire TV Stick is great! You can read my full review here --> http://bit.ly/FireStickReview", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "Very quick response and easy to set up. Love my Netflix, I just wish Comcast would contract with Amazon so I can have my HBO Go!", "verified": true, "helpfulness": "0/0", "author": "KissaMew"}, {"rating": 5.0, "review": "Good product does what it says it does", "verified": true, "helpfulness": "0/0", "author": "Omar f"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "D. Provost \"grandma27kids\""}, {"rating": 3.0, "review": "I have to restart it every 2 or 3 days. It freezes and I would recommend the chromecast instead.", "verified": true, "helpfulness": "0/1", "author": "JL85"}, {"rating": 5.0, "review": "Love this thing! Had two Chromecast and now they are collecting dust. Bought 2 of these to replace them and never looked back.  Offers the same and so much more with a remote, streaming capabilities, and countless apps. I use it even with a smart tv so that in itself shows how much I think of them. Great product!", "verified": true, "helpfulness": "0/0", "author": "brown92"}]