[{"rating": 5.0, "review": "Awesome so far!", "verified": true, "helpfulness": "0/0", "author": "Jaso-Sarm"}, {"rating": 1.0, "review": "I bought this to connect to my TV instead of having to connect the laptop to the TV when I want to stream on Netflix. It did not work at my home and I thought the internet connection may not be consistent enough. Took to my beach house where we have wonderful internet service through FIOS and it still will not stay connected to the internet. I am very disappointed in this and will be returning it.", "verified": true, "helpfulness": "0/0", "author": "Jodi"}, {"rating": 5.0, "review": "The Amazon fireTv stick, one of the greatest releases of 2015. Extremely easy to set up & very productive for the family. This is something an average daily consumer would be very happy about getting.", "verified": true, "helpfulness": "0/0", "author": "Jovany Michel"}, {"rating": 5.0, "review": "This little stick works great for streaming video and music and is the cheapest of all the options. Pandora and Netflix work great on it. The stick is easy to install and use and I feel like anyone, young or old, could use it.If you found this or any other of my reviews helpful, please rate this as 'helpful'.", "verified": true, "helpfulness": "0/0", "author": "Cyndi"}, {"rating": 5.0, "review": "Fire TV Stick is awesome for its price 34$. I installed KODI and few other apps and it works like a gem. Only issue what i see is Youtube is bit slow (hangs sometime - may be internet issue) when accessing from Fire TV app but it was good when i access it using Kodi.Overall I am happy with this product. I was having Apple TV 3 earlier and although i dont find the smoothness with fire stick, it is easy to customize and install any apk app to it which makes the life easier.", "verified": true, "helpfulness": "0/0", "author": "Indira"}, {"rating": 3.0, "review": "I didn't expect to have to pay for so many things. Old movies,Netflix,etc. I am some what disappointed. I can't even use the Netflix I already have without buying the app on the Firestick.", "verified": true, "helpfulness": "0/1", "author": "Sharon Townsend"}, {"rating": 4.0, "review": "Worked good for a couple of weeks.  Love the prime movies though, I use it on my Ruko.", "verified": true, "helpfulness": "0/0", "author": "Kent Stapleton"}, {"rating": 5.0, "review": "I really like how easy it was to attach to the TV and love all the entertainment!", "verified": true, "helpfulness": "0/0", "author": "Bassnman"}, {"rating": 5.0, "review": "I love the firestick and its remote. The instructions are clear, set-up was easy. Within minutes I was watching netflix! 🌀", "verified": true, "helpfulness": "0/0", "author": "Kendra Hunter \"Kendra Rose Huntress\""}, {"rating": 5.0, "review": "I have a question.  I have DISH tv and my computer is ATT Uverse in home network for security.  How do I add this to my home network?  And the second question is, since I have Dish, do I turn on the tv and just turn on the Stick or do I have to go into another mode with my tv remote?  Thank you.", "verified": true, "helpfulness": "0/0", "author": "snowbird37"}]