[{"rating": 4.0, "review": "For people who don't really care for TV its nice. Can watch hulu Netflix and other things to watch or you can buy and rent movies on it. Only thing it requires is Wifi to run. For 50$ I think it was. Good investment.", "verified": true, "helpfulness": "0/0", "author": "Bryan Fentress"}, {"rating": 5.0, "review": "Love this product - we don't have a smart TV so I was watching on my laptop - this makes it so easy to see my favorites on our 55\" TV.  Very easy to install!", "verified": true, "helpfulness": "0/0", "author": "Belinda K. Stewart"}, {"rating": 5.0, "review": "Works great and easy to use. Streaming is much faster and more reliable than either of my bluray players.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up, works great!", "verified": true, "helpfulness": "0/0", "author": "Kevin \"dcrossm1\""}, {"rating": 5.0, "review": "This thing is great!!! 10 minutes from box to watching our favorite shows. Super easy install, very short instructional video and a short update. I have pretty slow wi fi and it only streamed once I am very pleased!!", "verified": true, "helpfulness": "0/0", "author": "PamelaSouthworth"}, {"rating": 5.0, "review": "We love our firestick. Easy enough for the kids to use and it's affordable!", "verified": true, "helpfulness": "0/0", "author": "Hillary Willeford"}, {"rating": 4.0, "review": "It enabled me to cut down on the clutter, I'd had because initially I streamed content through a game consoleThe Fire Stick is an excellent tool. Keep up the good work Amazon", "verified": true, "helpfulness": "0/0", "author": "Leonard C Stringer"}, {"rating": 1.0, "review": "Absolute garbage.  After spending two hours scouring the internet for solutions, power cycling things, and tweaking wifi settings, I gave up and shipped it back.  A product like this should not require this amount of effort on a fairly common router/access point (ASUS RT-AC68U).", "verified": true, "helpfulness": "0/1", "author": "Matt K"}, {"rating": 4.0, "review": "We love being able to share our favorite shows with the whole family. The apps and fun features make it great for everyone.", "verified": true, "helpfulness": "0/0", "author": "JK Capps"}, {"rating": 5.0, "review": "Did just what I needed it to do. My smart TV wouldn't work with the preinstalled apps while also attached to my Directv receiver. I didn't want to have to plug/unplug anything so this was a less expensive option to get Netflix plus I can get Prime movies too which I couldn't with the more expensive TV apps.", "verified": true, "helpfulness": "0/0", "author": "S. Parks"}]