[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Ultron 1234"}, {"rating": 5.0, "review": "I love my fire stick, its great", "verified": true, "helpfulness": "0/0", "author": "Julio cruz"}, {"rating": 5.0, "review": "they took apple tv and made it betterand I purchased it from prime and it came pre programmed", "verified": true, "helpfulness": "0/0", "author": "lee guice"}, {"rating": 5.0, "review": "Shreds.", "verified": true, "helpfulness": "0/0", "author": "Stephen McDaniel"}, {"rating": 1.0, "review": "Terrible.  No buffering ability so you better have high download speed and very stable signal.  Roku next to it has no problem at all", "verified": true, "helpfulness": "0/0", "author": "Brian Hunt"}, {"rating": 5.0, "review": "I love it especially since I subscribed to Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "Larry Bryan"}, {"rating": 5.0, "review": "Huge fan of it so far.  Basically turns a regular tv into a smart tv and you can take it with you.  We've had it at the hospital for the delivery of our daughter and plan on taking it on an upcoming  vacation.  First bought the chrome cast and only had it for a day before returning it for this. No comparison-this is the way to go!", "verified": true, "helpfulness": "0/0", "author": "J. Calkins \"timberlegs\""}, {"rating": 5.0, "review": "It’s insane how much this thing holds. And I Love the user interface.", "verified": false, "helpfulness": "0/0", "author": "Brian Uzzo"}, {"rating": 5.0, "review": "Hubby loves it!  Better than chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Lonnie Betts"}, {"rating": 2.0, "review": "Not the best product. I had my router right next to the TV and it still would not connect. The Fire TV said the wifi connection was very strong, but it would still not play any movies, ever. I would suggest spending extra money in buying a better product or make sure you have a perfect internet connection.", "verified": true, "helpfulness": "0/0", "author": "Sofia"}]