[{"rating": 5.0, "review": "Love it! just what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Maria \"Maria Lopez\""}, {"rating": 5.0, "review": "wonderful! exceeded my expectations! like it better than my apple tv", "verified": true, "helpfulness": "0/0", "author": "Phyllis A. Petty"}, {"rating": 5.0, "review": "Awesome product, I love it!", "verified": true, "helpfulness": "0/0", "author": "josh"}, {"rating": 1.0, "review": "Constantly loses connection and has to rebuffer. I am ordering a chromecast to replace it.", "verified": true, "helpfulness": "0/0", "author": "Andrew Heim"}, {"rating": 1.0, "review": "Incredibly laggy. My FireTV works fine and I have no issues with Chomecast so it is not my connection. A very inferior product. I would suggest spending the extra money for the FireTV or to go with a competing product altogether.", "verified": true, "helpfulness": "0/0", "author": "S. Waldron"}, {"rating": 5.0, "review": "THE BEST!", "verified": true, "helpfulness": "0/0", "author": "Lori Johnson"}, {"rating": 4.0, "review": "Great little device that has many options and features.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "nothing like I expected", "verified": true, "helpfulness": "0/1", "author": "Grunetta Brown"}, {"rating": 4.0, "review": "I bought the Fire TV Stick several weeks ago to stream Netflix and sideload Kodi so I could stream video from my Synology NAS. My NAS video content is all in 720p and my Netflix account is set to stream in HD. This was a problem for the Fire TV Stick. On both Netflix and Kodi, it would have to pause every few minutes to buffer. This was not a Netflix issue or a internet/LAN bandwidth issue. My PS3 streams Netflix in HD just fine.A few days ago, I received my Fire TV. Sideloaded Kodi and got it all up and running. The faster processor and larger memory allows this to stream both Netflix and Kodi in HD with no buffering issues. They are both great products, but if you want to stream HD, go with the Fire TV. If you want portability and HD is not a priority, the stick will be just fine.", "verified": true, "helpfulness": "0/0", "author": "L. Clair"}, {"rating": 5.0, "review": "Actually was very impressed with my Fire Stick, the amount of viewing options seem endless with excellent picture quality as well as audio, my only complaint is the difficulty when trying to watch certain movies that will not stream through the Fire Stick, you either have to watch on HBO's new streaming or watch it on a computer, of course you have the option of purchasing it, the older movies come through fine...but it still worth the purchase price.", "verified": true, "helpfulness": "0/0", "author": "Charlotte Hartmann"}]