[{"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Diakil"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Gianna Felix"}, {"rating": 1.0, "review": "I have been able to get it to connect 1 time to the internet since I bought it 2 months ago. I thought it may be my internet so I borrowed it to my mom and nothing. Could not connect. Also you need to plug in into the TV which I knew but that if had to be plugged in to a outlet also was a bummer. If you want any help with it GOOD LUCK!!!!!! I thought maybe there was a setting that I could change to get better luck but the manual that come with it basically tells you plug it into you TV and the wall. If you aren't getting a good signal add the extender to it. I had my router sitting behind my TV and that was still not strong enough signal. I have very fast internet for everything else. (use the XBOX and a BluRay player and they are perfect) Bought this to have something easy to move from TV to TV.SAVE YOUR MONEY!", "verified": true, "helpfulness": "0/0", "author": "Heidi Hemmesch"}, {"rating": 5.0, "review": "Easy to connect and use...even for the tech-challenged.", "verified": true, "helpfulness": "0/0", "author": "Donna Maness"}, {"rating": 5.0, "review": "yes... it was so easy to hook up to my TV and use ...It couldnot be any simpler...", "verified": true, "helpfulness": "0/0", "author": "barbxcats"}, {"rating": 5.0, "review": "I was skeptical of this at first, but decided to purchase when there was a good sale going on.  Once received, I hooked it up (which was very easy) and got everything setup.  I love this product and use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Todd Thompson"}, {"rating": 5.0, "review": "Easy to set up.  So far enjoying the movies", "verified": true, "helpfulness": "0/0", "author": "kristy"}, {"rating": 5.0, "review": "It's been a really great thing to have!!", "verified": true, "helpfulness": "0/0", "author": "Kyle balding"}, {"rating": 1.0, "review": "U still have to pay for HBO, Netflix, Hulu? or does it come free with this product", "verified": false, "helpfulness": "0/0", "author": "John Dewitt"}, {"rating": 5.0, "review": "It the best !!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Paul Z."}]