[{"rating": 5.0, "review": "I love my new fire stick! I am going to order one for every room!", "verified": true, "helpfulness": "0/0", "author": "sandra kilpatrick"}, {"rating": 3.0, "review": "So far I have only used it to access my subscription to Sling TV.  For that purpose, it works just fine.  Most other channels available are duplicates of what I can access through my wi-fi enabled Blu-Ray player.  Since I don't play games or listen to radio with my TV, I probably will not use it for more that Sling TV.  Besides, most movies that I might want to watch are either not available or have a rental fee attached.  I can rent DVD's locally for less that the streaming rental fees.", "verified": true, "helpfulness": "0/0", "author": "L. B. Falgiani"}, {"rating": 2.0, "review": "It freezes up on me. Have to unplug and start it again.  This happen a lot", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 5.0, "review": "Had no idea how EASY this would be for such a technologically challenged person as myself...amazing little piece of equipment!! I feel very good about my purchase and would recommend it highly!!!", "verified": true, "helpfulness": "0/0", "author": "DebbieMcK"}, {"rating": 5.0, "review": "Outstanding!!", "verified": true, "helpfulness": "0/0", "author": "Judy Avans"}, {"rating": 4.0, "review": "really liked it", "verified": true, "helpfulness": "0/0", "author": "Tammy Dapper"}, {"rating": 3.0, "review": "It seems to work ok but the big negative is no surround sound thru my Bose surround sound system as can only get sound thru the TV speaker and that sucks!", "verified": true, "helpfulness": "1/1", "author": "Johnny Boy"}, {"rating": 1.0, "review": "No, I am having issues with the fire stick. It reacts different when using on different TVs. I have a LG and VIZIO. Work perfectly fine on the LG and loads really fast. The VIZIO, no. It takes a long time to load and it freezes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Love fiction books\""}, {"rating": 5.0, "review": "I don't know if I'm using this wrong, but I have literally not even gotten a single spark while using this.If first thought I try it out by lightning our fireplace, because we have a natural gas assist so it's fairly easy to start. I made sure it had fresh batteries and the lights came on, but nothing. Not a spark. I tried several times then went ahead and used a cheap dollar store fire stixk, which worked immediately. So I know it's not our fireplace.Thinking maybe it was meant for outside use, we tried the next weekend to start the grill and then a campfire. The grill is a standard charcoal grill. Again, no luck with that. Maybe it was the liquid firestarter that caused the problem here?  So we tried a camp fire with no accelerants, all natural wood, twigs and some bits of paper for the Firestick to light. Nada.I'm not sure what we're doing wrong. I plug the USB part into the USB port on my computer, then aimed the Firestick directly at the item we wished to ignite. I didn't even see a spark or anything! But I thought maybe it is all done with infrared, so no sparks. What is so puzzling is that it didn't seem to matter what I was trying to light,  nothing worked, there wasn't a spark or even a puff of smoke, let alone an actual fire.The device seems well made, maybe I got a faulty unit. It seems like other reviewers like it, so I know it's just got to be something I'm doing wrong. Will keep trying and will update you if I figure it out.PS: another strange thing, when I plugged the USB into my TV instead (thinking that since maybe it has more  power, it might help ignite better) I suddenly started getting all kinds of channels with tons of shows and even some games.  I don't have cable, so I'm not sure what's going on here. A strange development to be certain!", "verified": true, "helpfulness": "0/0", "author": "maximum verbosity"}, {"rating": 5.0, "review": "I don't think that we should have to pay for movies that came out last year, even if they were on HBO and such. I tried to watch Maleficent with my niece and it wanted me to pay for it. I think that is wrong. It is an old move.", "verified": true, "helpfulness": "0/0", "author": "melanie todd"}]