[{"rating": 5.0, "review": "After about four years of paying for Amazon Prime, I only used it for shipping.  It is to bad I did not read all of what Prime was giving our household.  Now that we have an Amazon Fire Stick, my whole family is enjoying it's programing.  Kudos to Amazon for their programming.By the way, The Fire Stick works perfectly.", "verified": true, "helpfulness": "0/0", "author": "David F"}, {"rating": 5.0, "review": "I can't believe I didn't buy this sooner!!!", "verified": true, "helpfulness": "0/0", "author": "Kimi Gomez"}, {"rating": 5.0, "review": "I like it more than cable!", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 1.0, "review": "Its simple for me. The only thing this stick has that I use is Netflix. I needed it to also have Vudu and YouTube but nope. So for me, the stick is pretty useless.", "verified": false, "helpfulness": "0/2", "author": "jody"}, {"rating": 3.0, "review": "works good but , watched 5 seasons of true blood just to find out season 6 and 7 were not included !", "verified": true, "helpfulness": "0/0", "author": "JOHN"}, {"rating": 2.0, "review": "I have a ROKU 3 device already and it works pretty good, but I do get a lot of buffering at times.  Will this happen with the Fire Stick ?  Also can I access USTVNow. ??", "verified": false, "helpfulness": "0/0", "author": "Tom D."}, {"rating": 4.0, "review": "I am enjoying the easy access to amazon prime and netflix. Many of the programs, like nbc do not update and are old news when I go to them. Some programs seem to stall and go off regularly and at times shows/ movies on prime stop though this does not seem to happen with netflix.All in all I think it was a good investment in entertainment. It set up fairly easy once I figured out how to enter the access code for the internet. It is far more enjoyable to watch on my TV than it was on the computer...I like that I can take it from the main TV to the bedroom TV though I may buy another for downstairs in time.  For the price it is a good alternative to those who don't want to pay for cable.", "verified": true, "helpfulness": "0/0", "author": "pj"}, {"rating": 5.0, "review": "Best purchase EVER!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth A. Bulger \"ebulger\""}, {"rating": 5.0, "review": "This is great! Highly recommend fire stick!!", "verified": true, "helpfulness": "0/0", "author": "Derri M Dalton"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Margaret Wallace"}]