[{"rating": 4.0, "review": "The Stick worked great at home, but when I moved to college I could no longer use it since it must be connected to Wifi and most University Wifi passwords require to put an identity and a passcode, and there is no way to put your identity it is useless while I am away from home. If this could be fixed in any way, then this would be perfect.", "verified": true, "helpfulness": "0/0", "author": "melchor"}, {"rating": 5.0, "review": "Got this for my son and he LOVES it! He even gave it a tweet on Twitter!", "verified": true, "helpfulness": "0/0", "author": "G L Childress"}, {"rating": 4.0, "review": "This thing is cool!  I have a couple Roku's, and had been looking for something smaller in stick format when this was released so I jumped on it and am very happy so far!  It is geared toward Amazon of course, but HBO GO is coming, Netflix is nice, and I also like the Pandora app on there and the Prime Music integration too!  Overall, a great little stick with a remote.  My only beef is that it requires external power...nice device tho and I'm very happy with my new Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Had it since Christmas, performs wel beyond expectations.", "verified": true, "helpfulness": "0/0", "author": "Steven Palmer"}, {"rating": 4.0, "review": "Turns a dumb TV into a smart TV. Easy to understand and use.", "verified": true, "helpfulness": "0/0", "author": "Christian Miller"}, {"rating": 4.0, "review": "Great picture", "verified": true, "helpfulness": "0/0", "author": "florence S. Abel"}, {"rating": 5.0, "review": "Very easy to set up and use. Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Karen Camisa"}, {"rating": 5.0, "review": "Makes it very easy to watch Prime movies, Netflix and Hulu.  It was a good purchase", "verified": true, "helpfulness": "0/0", "author": "hebrew"}, {"rating": 4.0, "review": "I like the stick but I'm not happy with the lack of apps. I found way too many \"free\" apps that require a subscription. If I need to pay for content, it should be clearly stated. Hopefully, that will change in the future. When I plugged the stick into my tv, I had a hard time getting a signal. The stick came with a HDMI extender. It worked very well after that.", "verified": true, "helpfulness": "0/1", "author": "Nicole Smith"}, {"rating": 5.0, "review": "The Fire Stick has fulfilled my expectations.  It provides wireless HD content to my (older) Samsung flat screen and has so far been without hesitation, without motion artifacts, and has produced high quality sound through my equally old Sony stereo tuner and my Bose 301s.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Life is but a poor player...\""}]