[{"rating": 4.0, "review": "The thing is awesome, the only thing keeping it from getting five stars is some operational parameters. 1 you can't turn it off, I put it to sleep, but it continues to play music. I'd like to play music with the screen saver, and be able to install apps like tbs online so we get stuff that doesn't require a premium paid subscription like prime or Showtime. the control with my phone bit is pretty cool though.", "verified": true, "helpfulness": "0/0", "author": "Crunchman"}, {"rating": 2.0, "review": "High priced service for simple tv and movie viewings", "verified": true, "helpfulness": "0/2", "author": "E"}, {"rating": 5.0, "review": "Easy to hook up we love it", "verified": true, "helpfulness": "0/0", "author": "Gary Ennis"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "ma2013"}, {"rating": 5.0, "review": "Great, was up and running within minutes of opening the box, the remote and the Amazon original content/Prime content gives this a bit of an edge for me over my old Chromecast (which I replaced with the fire stick, need more hdmi ports!).", "verified": true, "helpfulness": "0/0", "author": "Paul Plunkett \"pplunkett\""}, {"rating": 3.0, "review": "Found out after I bought it that Samsung devices don't work with it, so you can't mirror your phone. The remote app works fine, but you can't mirror your device, which was one of the main reasons I bought it.", "verified": true, "helpfulness": "0/0", "author": "Kyle Harsch"}, {"rating": 5.0, "review": "Love it!!!  More Movies", "verified": true, "helpfulness": "0/0", "author": "Ramon W."}, {"rating": 5.0, "review": "Easy to setup. Works great.", "verified": true, "helpfulness": "0/0", "author": "Gerardo A Gonzalez"}, {"rating": 5.0, "review": "Ease of set up and now accessing my Prime from the little controller which is included  Also accessing Hulu+.", "verified": true, "helpfulness": "0/0", "author": "Tammy Z H"}, {"rating": 4.0, "review": "I like the Fire TV Stick. It is nice to have access to all the different movie and music apps without having to connect to my laptop through an HDMI cable. However, it has shown me how bad our internet connection is through cable. Connectivity was going out every 10 minutes. Big hassle, but has nothing to do with the Fire TV Stick, which I am very pleased with. Once connectivity is fixed, I expect it to work smoothly so we can watch without much interruption. I think the people we had visiting at our house will be purchasing the Fire Stick too.", "verified": true, "helpfulness": "0/0", "author": "Lisa E. Marquez-Valenti"}]