[{"rating": 5.0, "review": "Works like a dream!  Simple plug in and follow the instructions.", "verified": true, "helpfulness": "0/0", "author": "Joey T"}, {"rating": 5.0, "review": "This works great. Takes a few minutes to update and load when you first plug it in then it is off and running. It streams flawlessly in HD. I'll be buying more for other TV's in the house.", "verified": true, "helpfulness": "0/0", "author": "Michael Raudenbush"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Edwin Telles"}, {"rating": 5.0, "review": "This is the best thing since sliced bread!!! So many functionalities packed in one little device. It hasn't let me down yet. I especially love the mirroring function. No Lag!!! 😃AWESOME.", "verified": false, "helpfulness": "0/0", "author": "F. Hawkins"}, {"rating": 5.0, "review": "Way better interface than is on my smart TV.", "verified": true, "helpfulness": "0/0", "author": "robsmind"}, {"rating": 4.0, "review": "First, let me say since the Fire TV Stick has just been released at the time of this review I expect that problems will be fixed and more apps will become available over time.  It appeared to be very responsive with the Bluetooth remote.  Menu navigation is well organized and fairly intuitive.  It certainly worked well with Amazon's video and music service, especially with Amazon Prime.Now as to problems.  The unit is power hungry.  I could not use the USB port on either my AV receiver or my TV to power it.  I had to use the supplied power supply.  I tried using the Android app on my Google Nexus 7 to control the Fire TV Stick.  While it worked like the Bluetooth remote it would not work properly with the touted voice search.  The Fire TV Stick would respond that it could not understand what was said.The current app offering is rather limited.  But I expect it will increase over time depending on the Fire TV Stick's popularity and how tightly Amazon will control app development.  The Fire TV Stick is my fourth such device.  I hope that it will become as popular as the Google Chromecast with many apps to exploit its power.", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "Work great. Gets all the typical channels. Roku has more channels but fire has enough of them.  The interface is more refined and faster then roku.  I way prefer this to chromecast.", "verified": true, "helpfulness": "0/0", "author": "sjidzior"}, {"rating": 2.0, "review": "The main reason I bough this was so that I could watch Prime videos that I already had downloaded to my Fire HD 7 on my TV. However apparently the Fire HD 7 does not support \"mirroring\" and thus if you switch from viewing on your fire to viewing on the TV, it streams the video again to the Fire stick. Since I have a slow Internet connection due to living rural (and no other options), the streamed video quality is garbage. I can download to my Fire HD at 720P in the background, so getting decent quality video on the fire is not an issue. So basically this does nothing that the Amazon app on my PS3 can't already do. It's getting returned.", "verified": true, "helpfulness": "0/0", "author": "Texas Mark"}, {"rating": 5.0, "review": "No need a device like tablet or laptop to watch streaming. Extra advantage that it has remote.", "verified": true, "helpfulness": "0/0", "author": "skb"}, {"rating": 4.0, "review": "Super. Easy to use. Would have got a fifth star if had a browser.", "verified": true, "helpfulness": "0/0", "author": "Stefan"}]