[{"rating": 5.0, "review": "Work great, even a little better than ROKU, I will need to get use to the format. Like the small remote.", "verified": true, "helpfulness": "0/0", "author": "holly dominguez"}, {"rating": 4.0, "review": "Haven't used them yet.  Christmas gifts.  But  i think the access will be perfect for the equipment the recipients have.", "verified": true, "helpfulness": "0/1", "author": "Barefootdog"}, {"rating": 4.0, "review": "Well it's very inexpensive and matches much of what my Roku 3 will do with the added benefit of apps like XBMC which very few options support.The downside is the UI is a mess. Amazon has mixed all their content in a main menu while everything else is nicely packaged into discrete apps. I know it sounds weird but it actually feels harder to use when Amazon content is jumbled like this. I wish Amazon would put their stuff in a Amazon app because right now I feel this is too confusing to gift to Mom or other less technical people. So far Roku is the better interface even if you watch Amazon content.", "verified": true, "helpfulness": "0/0", "author": "John D. Biggs \"tech guru\""}, {"rating": 4.0, "review": "Performs as advertised. Binge watching buddy!!!", "verified": true, "helpfulness": "0/0", "author": "Mr. Meanface"}, {"rating": 5.0, "review": "This thing is AMAZING !!!!", "verified": true, "helpfulness": "0/1", "author": "Jonathan Pedroza"}, {"rating": 5.0, "review": "I got it for $20 as there was a pre-launch promotion.  It arrived a month or so after I ordered but I am glad I ordered it.  It is worth its money even with its full price ie $40.  It is way better than Google Chromecast if you have Amazon Prime and wanna enjoy  those Amazon Prime shows like \"Defiance\" on your big screen high def tv", "verified": true, "helpfulness": "0/0", "author": "Hassan M Farooqi"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Terry Sykes"}, {"rating": 5.0, "review": "Neat, it opens a whole new world.  I have just used it for Prime Videos but it's worth it. Real easy to install.", "verified": true, "helpfulness": "0/0", "author": "Bigbore"}, {"rating": 5.0, "review": "I really love this. I previously used chromecast and put this on one of my tvs in its place just to try. I love that it doesnt require my phone and can run on apps with the remote. Great alternative to cable as I can access netflix, my NBA league pass, prime videos, and  even get the news. Only issue is that it does not have a power button.. the stick just goes to sleep but always uses power.", "verified": true, "helpfulness": "0/0", "author": "Kate B \"ktb\""}, {"rating": 5.0, "review": "we are blown away with this little gadget. I have a chromecast that hardly gets used, and really expected this to be the same way. It has all but replaced the ps3 in our bedroom. we use it for prime movies, netflix, games, prime music, pandora, and occasionally renting movies through amazon. if there was a way to have it browse my network for movies on my computer, this would be perfect.", "verified": true, "helpfulness": "1/1", "author": "Erik Lawrence"}]