[{"rating": 4.0, "review": "It's decent. Really wanted to hide it behind the TV but does not get enough power from the USB port on that TV to function properly (Slow wifi). So had to AC. Besides that it's already. Mainly use for KODI since we have a Apple TV already on that TV and it's apps are superior.", "verified": true, "helpfulness": "0/0", "author": "Galina"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "janet Doucette"}, {"rating": 3.0, "review": "Overall, we are enjoying the item.  The main reason I bought it was to be able to watch Netflix, and unfortunately that does not work well at all.  The shows buffer far too much, the video locks up while the audio keeps going, and that throws the show out of sync for several minutes at a time. After I re-hooked up the Wii, Netflix works perfectly. So, it is not my tv or router or internet, etc. Also, cannot watch YouTube videos on it at all.  I had to by an app for $2.99 and use a different device to watch YouTube.  Not sure if there are issues with our Samsung TV, or if I just expected too much.  Those issues aside, which are major to me, we enjoy the Prime tv selection although there are a LOT of older movies or shows that I can't believe are not included for free.", "verified": true, "helpfulness": "0/0", "author": "Monica L. Allaback"}, {"rating": 5.0, "review": "This is an amazing gizmo.  I no longer have to sit in front of my computer to watch great stuff from Amazon.  I'm loving it!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it so much, bought another one for my son's TV in his room.", "verified": true, "helpfulness": "0/0", "author": "S. Hodges \"Garrett's Mom\""}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Paul Childs"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Michael Thompson"}, {"rating": 5.0, "review": "This was easy to set up and use.  Its a great way to catch up on missed shows or to view Netflicks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Using it for Netflix and love it.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "This was very easy to setup and navigate.  The best streaming video device on the market.", "verified": true, "helpfulness": "0/0", "author": "Jared Davis"}]