[{"rating": 5.0, "review": "It's Great", "verified": true, "helpfulness": "0/0", "author": "Jumanne"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Michael L."}, {"rating": 5.0, "review": "Love Love this!!!", "verified": true, "helpfulness": "0/0", "author": "Mark Fleshner"}, {"rating": 1.0, "review": "bought this for my dad and it said for each app (netflix, prime, etc.) that we tried to make that the service was not avaialble at this time...and it also said all connections were good.  kept buffering....sent it back.  i had bought one for our home so i didn't have to connect my kindle fire, and haven't used it much, but my daughter said it does the same thing, constantly rebuffering.", "verified": true, "helpfulness": "0/0", "author": "Sharyn M. Masullo"}, {"rating": 5.0, "review": "Best technology ever made", "verified": true, "helpfulness": "0/0", "author": "Sudesh Bhagarattie"}, {"rating": 5.0, "review": "It worked just as well as my brand nee one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works well, except for the Slingplayer app. Even though I never lose connection to my Slingbox when using the Android or the Windows app, the Slingplayer app will drop connection after 10-15 min. Wireless signal connectivity is strong in the room in which the stick is, and I don't lose connection on Netflix, etc, so I've narrowed it down to the app.", "verified": true, "helpfulness": "0/0", "author": "Cooley Hurd"}, {"rating": 4.0, "review": "Wish you could cast things from your phone to the TV using the app, but overall we love it!  Love the remote control.", "verified": true, "helpfulness": "0/0", "author": "Abby"}, {"rating": 5.0, "review": "Exceeded my expectations! Love this fire stick. We play games and watch movies all the time with it. I also use it for music and my photos. Def worth having and def worth the measley 39 bucks it is.", "verified": true, "helpfulness": "0/0", "author": "Dina"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Micki Free"}]