[{"rating": 3.0, "review": "Summary: it's adequate, does the job while doesn't shine in any particular way.Pros:• good access to amazon content, specially for Amazon prime members.• system restarts are fast (which will come in handy, read below in cons)• offers slingTV, which was main reason for getting this stickCons:• search functionality is only on Amazon, not across other content apps as far as I can tell.• remote is not great. Navigation on remote is frustrating• certain apps, slingtv, need to the stick to restart constantly for the app to work. I am not sure if this is slingTV app issue or a fire stick issue, but the restart does help.I got this through slingTV, and the options were either this stick or the rocky stick. In all honesty, I was leaning towards Roku. I would have gotten the Roku if it wasn't for the device specs showing the fire stick with more processing power, and the fact that I am a prime member.", "verified": true, "helpfulness": "0/0", "author": "@bashar"}, {"rating": 5.0, "review": "I am very pleased! Has met and overpasses my expectations. Was very reluctant for a while. Read many reviews and finally decided that the only way to give a fair and just assessment was to try it. I am glad I did. I travel quiet often and this device definitely provides the flexibility to maintain relevance with the programs I gotten accustomed to. I will take with me to the middle east and will post updates on performance shortly. BLUF: If you are the traveler type, this is the item of choice... Go for it, you will not regret it!", "verified": true, "helpfulness": "0/1", "author": "Fidel Arvelo"}, {"rating": 5.0, "review": "Great to watch all my FREE Prime Member Movies and so easy to connect. The screen saver photos are stunning. Great deal for Prime members! Get your under 48 hour shipping and movies for 100 bucks a year. Heck, I have gotten some of my stuff within 18 hours with Prime. This thing even sweetens the deal more.", "verified": true, "helpfulness": "0/0", "author": "Regular Joe"}, {"rating": 5.0, "review": "A MUST HAVE ON ALL TVs", "verified": true, "helpfulness": "0/0", "author": "Laura Brown"}, {"rating": 1.0, "review": "The firestick constantly freezes and it is almost impossible to watch anything on it.", "verified": true, "helpfulness": "0/0", "author": "Nick Luongo"}, {"rating": 5.0, "review": "This expands my viewing choices immensely. I love it.", "verified": true, "helpfulness": "0/0", "author": "Donna Donaldson \"aislinnluv\""}, {"rating": 4.0, "review": "Far superior to the Chromecast I was using, although it was tricky to install. Had to go to the help videos. It would be helpful if the navigation circle had arrows on it so I would have realized what it was.", "verified": true, "helpfulness": "0/0", "author": "BunnyLady"}, {"rating": 2.0, "review": "Kept freezing up. Went back to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "joewit"}, {"rating": 5.0, "review": "Exelent product! !", "verified": true, "helpfulness": "0/0", "author": "Hugo"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "margaret cornn"}]