[{"rating": 5.0, "review": "best thing since sliced bread! Upgraded from chromecast to the stick. Sideload android apps is awesome. Expands my options. Wish it had a network port.", "verified": true, "helpfulness": "0/0", "author": "Foosking"}, {"rating": 5.0, "review": "It's great.  Especially with Amazon Prime, you get a great selection of things you can view anytime.", "verified": true, "helpfulness": "0/0", "author": "swissmissmom52"}, {"rating": 5.0, "review": "This fire stick was a breeze to set up. I am a regular user of Prime Video, Netflix, etc. the loading is quick, the layout, very easy to navigate through and extremely user friendly. I also like the free games they allow you to download and have fun with. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "B. Smith \"B.Smith\""}, {"rating": 3.0, "review": "Device works ok, seems to forget assigned IP address from wireless router.  Have to periodically dismiss wireless network and rejoin to have full operational status.", "verified": true, "helpfulness": "0/0", "author": "K. Dawson"}, {"rating": 5.0, "review": "We love it, works great for all our viewing, we use it daily so glad to have found a product so simple to use, I can only surmise the 1 Star ratings had bad WiFi in their locations to begin with to have such dodgy connectivity, works great at our house on DSL.", "verified": true, "helpfulness": "0/0", "author": "BlueSchmoo \"Wendy - NM\""}, {"rating": 4.0, "review": "For a woman is was really easy  to install & I'm enjoying it watching my movies.", "verified": true, "helpfulness": "0/0", "author": "Peggy Leith"}, {"rating": 5.0, "review": "works well and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great streaming device! Super fast and runs smoothly!Pro: unlike chromecast the Fire TV Stick runs by itself. No need to tie up a device to stream!  Big pro!Con: there is no way to shut it off unless you unplug it. Not a huge deal as it has a sleep mode but shutting it off would be a nice option", "verified": true, "helpfulness": "0/0", "author": "Thajawn"}, {"rating": 5.0, "review": "Works Excellent, Side-loaded Kodi. Plays wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lally"}, {"rating": 3.0, "review": "I wish I had known before purchasing this, that I still needed to plug this device into an outlet. Apparently, my TV (<5 yrs old) does not produce enough power on its own to support the stick without it being plugged into an outlet. I'm still getting familiar with everything else, so I'll edit this review when I have more information about the user interface.", "verified": true, "helpfulness": "0/0", "author": "Sara Therrien"}]