[{"rating": 2.0, "review": "Not good at streaming movies like in Netflix", "verified": true, "helpfulness": "0/1", "author": "Jamie Suarez"}, {"rating": 5.0, "review": "OMG- I LOVE this amazing way to watch shows.  I held out, not getting cable, and knew I was missing out on shows that everyone was talking about.  With this Fire TV Stick, now I can watch Amazon Prime shows, and my son set me up so I can watch Netflix and Hoo-loo, too!  Perfect tool for me!", "verified": true, "helpfulness": "0/0", "author": "qwiltz"}, {"rating": 5.0, "review": "Very easy set up, awesome remote control and great performance!", "verified": true, "helpfulness": "0/0", "author": "Jim Lollar"}, {"rating": 4.0, "review": "Product is great. Can't wait for HBO Go app and would love to see Starz app as well.", "verified": true, "helpfulness": "0/0", "author": "Ellis Geer"}, {"rating": 1.0, "review": "Didnt work...installed properly, I never would connect to my internet even though it said it was connected I could not actually use it. kept getting an error message saying could not contact Amazon try again later.", "verified": true, "helpfulness": "0/0", "author": "C. K. Calitri"}, {"rating": 5.0, "review": "Awesome!  This is all you need to cut the cord.  Setup is a breeze and it comes preloaded with your account settings.  All you have to do is plug it in and you are ready to go.  If you don't have a prime account, you will find yourself having to pay for a lot of programs and movies.  I have prime, netflix and hulu.  This combo is way better than traditional cable in my opinion.  Just get a cheap antenna for local stations and you are all set up.", "verified": true, "helpfulness": "0/0", "author": "nathan"}, {"rating": 5.0, "review": "We have all types of devices in our home  and this one is by far the best.  I will be replacing all other devices with this one.  The picture and sound qualities are so much better.  You can't tell that the movie is streaming.", "verified": true, "helpfulness": "0/0", "author": "CAK0023"}, {"rating": 4.0, "review": "Has worked flawlessly, so far.  I use it upstairs from my main wireless setup, with an access point in the room.  No problems at all with sound or picture, with the exception of vary rare and brief pixellation.  Video/Audio synce has been excellent.Setup was simple, and it didn't take long to become acquainted with the menu interface.  That menu is weighted toward Amazon's own video library, but one into the Netflix application, I find it similar to Roku for its ease of use.  I downloaded the PBS App, which works well.I am using the Fire Stick on my 42\" 720p Plasma TV -- I don't know if a 1080p unit would be more demanding.  No home theater setup, since this is just a bedroom TV, so I don't know how it would sync up through a receiver.The only reason I do not give it 5 stars is that I have not used it that much, and my demands are limited.  I would not use this for my home theater setup, because I don't trust the quality/consistency of wireless on a larger 1080p TV and 5.1 audio.I pre-ordered at the $19.99 price, and find it to be in incredible bargain.Note:  You will need to plug the unit into an AC power source.  The USB dongle has a 6\" cable and separate AC adapter with a 4' cord.Quick Additional Note:  The excellent setup instructions include a cute video that I think would be helpful to those who are less technically savvy.  I applaud Amazon for such a creative user friendly effort!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Ellis"}, {"rating": 5.0, "review": "Bought one for ourselves and one for my parents who aren't as technologically savvy and we both love it.  My parents previously had a Chromecast which didn't get too much use due to them not knowing/understanding what could be cast.  The Fire Stick has completely alleviated this due to the remote and on screen menu.", "verified": true, "helpfulness": "1/1", "author": "Jeff Ferry"}, {"rating": 2.0, "review": "Very disappointed.  It works GREAT IF you have a TV that is less than 5 years old (something they neglected to say on the product description).  I moved it to a different TV and it works fine - but it doesn't work on our bug screen in the living room.  I'm with the other users, am I supposed to buy a BRAND NEW TV, so that a $50 Fire Stick will work???", "verified": true, "helpfulness": "0/1", "author": "Chrissy G"}]