[{"rating": 5.0, "review": "Excellent for watching Amazon Prime content on my TV.  We recently cut the cord and have been cable free, watching Prime offerings on our Kindles and cell phones.  This lets us watch the same content but on the big screen.  Has led to some binge watching and late nights.", "verified": true, "helpfulness": "1/2", "author": "Garrett"}, {"rating": 5.0, "review": "Love being able to stream!", "verified": true, "helpfulness": "0/1", "author": "Carol L. Elliott"}, {"rating": 5.0, "review": "I just keep watching movies and play video games.  I had no clue this stick would provide hours of entertainment.", "verified": true, "helpfulness": "0/1", "author": "shakira bradley"}, {"rating": 5.0, "review": "I am  very  happy  with  the  ease of  setup and  playing  with  movies and  shows.", "verified": true, "helpfulness": "0/1", "author": "Margaret Cobb"}, {"rating": 4.0, "review": "Make side loaded apps appear in \"my apps\" and I'll give it 5 stars.", "verified": true, "helpfulness": "0/1", "author": "James M. Green"}, {"rating": 5.0, "review": "Great device...especially for an HDTV with no apps. Plenty of choices available. Works great with the iphone app that works like an additional remote.", "verified": true, "helpfulness": "0/1", "author": "Barbh"}, {"rating": 5.0, "review": "Got it mainly for Netflix, works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Laura"}, {"rating": 5.0, "review": "Amazing access to everything.", "verified": true, "helpfulness": "0/1", "author": "Hilndrwatchr"}, {"rating": 5.0, "review": "LOVE THIS!  Very user friendly and so much easier to use than the Google Chromecast!  The remote is big enough and everything works great!  AWESOME JOB AMAZON! :)", "verified": true, "helpfulness": "0/1", "author": "Shelley Hudes"}, {"rating": 5.0, "review": "Very small and hides behind my tv.  The android remote works well and can do everything the regular remote can do.  Its pretty fast. I use it for Prime, Netflix, and Plex and they all work great.", "verified": true, "helpfulness": "0/1", "author": "JE"}]