[{"rating": 1.0, "review": "Not a good a product as I thought it would be. Hate that I can't broadcast from my phone and also it had to have a power adapter. Really disappointed in the product. I also waited a month from ordering to receive it.Love amazon products but this one was a let down.", "verified": true, "helpfulness": "0/0", "author": "Trent Witz"}, {"rating": 5.0, "review": "This device is so much better than Google Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Jacob Ajjarapu"}, {"rating": 5.0, "review": "Easy hookup & install, Awesome, Thanks so much.", "verified": true, "helpfulness": "0/0", "author": "Cletuss"}, {"rating": 5.0, "review": "Very easy to install and works great!", "verified": true, "helpfulness": "0/0", "author": "Deuce19"}, {"rating": 2.0, "review": "First read all the instructions first!Why because because step 4 says turn on your TV.  Maybe Step 1 should have been \"make sure your TV is OFF\".I had my smart TV turned on as I usually hot swap items into the Inputs. Needless to say wasted quite a bit of time.Ok that's on me. Did I mention I have a smart TV. That means I did not need a Fire, however I got one for some other TV. But now after getting it to work I think I will keep it on my Smart TV, why because the little remote is better and quicker than my TV remote.I did download the Ipad Fire Remote App but that takes a long time to connect.Today when I turned on my set My Fire Stick was not recognized. I had to unplug the replug in the USB power pack.Wonder what tomorrow will bring.Because of these I only gave it 3 stars. Whether my bugs or my TV set bugs. I don't need this aggravation.So I would say for Smart TV's the only avantage is the remote and the ease of using this remote.For all other sets with HDMI inputs would probably be an enhancement. But this makes my smart TV seem to be stupid.Changed to two stars !I now realize why they offer the extension. SO YOU DONT HVE TO REACH behind the TV to unplug / plug in order for it to work.This is so dumb.  I bought if to make using Prime easier. What a irritating product. Wake up every day turn on coffee maker, oh don't for get to reset the FireStick. Stupid.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Bolger"}, {"rating": 3.0, "review": "At this time the stick is a fine idea and execution in services is fine.  I would like them to address a few things moving forward.  I travel work and somehow them making it easier to travel with and plug into hotel TV's would be a boon in use.  Great media content on the actual go.Quick, easy to use, polished interface- Wireless streaming works really well.  I have 802.11ac and this is on a separate network to optimize as well.- Amazon Instant is just that.- Best of the Prime Menus that Amazon offers across their devices in my opinion.- Unlike Chromecast, the Fire TV Stick includes a remote- I got it for $19 during the two day sale as a Prime memberCons - My biggest complaint I have right now is that there is the need for constant power.  There is no mention of this in the quick start guide or in the actual full guide.  I went through a few times and nowhere does it state it needs constant power, and if so, it should be out of the box capable not having to purchase accessories.In talking to support they state that you have to have micro usb to the wall (not happening in a mounted TV over the fireplace that has a run 16 feet from where power is) or plugged into a usb port on the TV drawing power.Spent 30 minutes with support to find out that they do not have a microUSB to USB on the TV adaptor like other manufacturers.", "verified": true, "helpfulness": "0/0", "author": "LuckyLuc"}, {"rating": 5.0, "review": "Great item, I love my Fire TV Stick!!", "verified": true, "helpfulness": "0/0", "author": "Ryan Witt"}, {"rating": 5.0, "review": "Easy to install, quick streaming and provides quality video.", "verified": true, "helpfulness": "0/0", "author": "Robert D."}, {"rating": 5.0, "review": "Works great!  The Chromecast never really worked correctly, but this brand does.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth B. Warner"}, {"rating": 3.0, "review": "Got some question about Fire Stick...do I have to enroll in Netflix with you all. I am already a Netflix member. If so;  that will cause me to pay 2 Netflix bills. not sure i want to do that.", "verified": true, "helpfulness": "0/0", "author": "Betty J. Tyler"}]