[{"rating": 2.0, "review": "While the Fire Sticks works as advertised. It is difficult to navigate the system. i have it I will us it but if I had bee able to see the system first I would not have made the punches.", "verified": true, "helpfulness": "0/0", "author": "CV Wood"}, {"rating": 5.0, "review": "So easy to install.  Works as advertised.  Cost is reasonable.", "verified": true, "helpfulness": "0/0", "author": "Diane Heath"}, {"rating": 2.0, "review": "I am not complaining about the firestick at all I am sure it works fine but where we live we have very few choices for internet providers (ISP) and the only one that might provide a strong enough ISP to get the firestick to work as is should is very high priced and so we can not use the firestick. However we decided to keep it for use when we go on vacation at our daughters house since she has much better ISP. I cannot comment on the firestick at this time due to this situation, Thank you.", "verified": true, "helpfulness": "0/0", "author": "Mark Mitchell"}, {"rating": 5.0, "review": "Love the variety of things you can do with The Firestick. There are way more things you can do then I expected. From music, photos to watching our favorite shows and movies. It was so easy to set up. I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Genah King"}, {"rating": 1.0, "review": "stopped working after a month...when it worked it was great, now for some reason it will not let me log into my home network. I was considering getting more amazon media products now I am not too sure I will.", "verified": true, "helpfulness": "0/0", "author": "Lourdes Bobadilla"}, {"rating": 5.0, "review": "Love them as always... My favorites!!!", "verified": true, "helpfulness": "0/0", "author": "debasher"}, {"rating": 4.0, "review": "Pros- Great entertainment if you have amazon prime. A ton of free shows and movies that are definitely worth watching and rewatching. HBO shows alone make the stick worth the price to me. They don't have all the newest shows, like Game of Thrones for example, but getting to watch Oz, Carnivale, Band of Brothers, and many more, makes it worth buying. Plenty more shows and movies as well, just using HBO as an example. Pretty nice selection of free music too. Entertainment it's well worth it.Con- Not so great at mirroring my cell phone. This is why originally bought it, and figured the free entertainment would be a bonus. It turned out not to work to well for it's intended purpose, but it won me over with all the stuff you do get if you have Amazon Prime. I'm not sure how it rates without Prime as I intend to keep it.I'm very happy as a whole with this product. I'm going to keep it upstairs in my room, where I watch most of my TV. I'll look into buying another casting device. But, if you have Amazon Prime this thing is well worth the 39 dollars or so for entertainment. No regrets.", "verified": true, "helpfulness": "0/0", "author": "Jason Knott"}, {"rating": 2.0, "review": "I really don't get into leaving reviews because I know most folks that leave them have agendas...and I don't... I just have to say that this thing has been a huge disappointment. The content offering is great and the fact that it has a dedicated remote is great. But this thing sports some major lag. It's probably got a lot to do with my laziness, but I like to crawl in bed and watch a movie off of plex without having to get up and reboot equipment every time I go to use it... I could go back to 2005 and pop in a dvd before I get in bed but I don't really want to. I have many other appliances running plex all over my house and none of them ever have an issue but not this... Noooooo... She'll lag if it kills her. I push a button on the remote and it just sits there... For like a minute... Then it goes ape dung running all of the other commands I pushed while waiting... Then it just gets overwhelmed and stops. Well, enough about me, hope yours works out better.", "verified": true, "helpfulness": "0/0", "author": "Todd R."}, {"rating": 5.0, "review": "I love the Fire TV Stick; I am thinking about buying another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Takes a lot of clicks to enter network name and passwords but otherwise great", "verified": true, "helpfulness": "0/0", "author": "Allan B. Gates"}]