[{"rating": 5.0, "review": "Had to order from Best Buy and it arrived yesterday.  I was concerned that the upstairs TV might be out of the range of my router which is in the basement.  In fact I was able to get some very helpful suggestions on line to resolve the problem if that were the case.  As it turned out, this little device works great and connected to my Netgear 300N perfectly.  I already have Amazon prime and Netlex accounts and all I had to do was enter the password.  The buttons on the remote are easy to use.  Easy hook up.  This is a great device and I can see why there has been a delay in ordering them.  I noticed recently that even Best Buy was on back order.  It is worth the wait.", "verified": true, "helpfulness": "0/0", "author": "Pat Shannon"}, {"rating": 4.0, "review": "Can be little difficult to setup, but once you get hang of using it remote it be a breeze. It have more games than the roku.", "verified": true, "helpfulness": "0/0", "author": "cdm"}, {"rating": 5.0, "review": "By far better than any other type of Internet TV.", "verified": true, "helpfulness": "0/0", "author": "Tactical Keychains"}, {"rating": 5.0, "review": "WAY better than the Apple TV. The UI is snappy, the video library is excellent thanks to our Prime subscription. And I love that I can load normal Android apps on it. The only thing I dislike is the lack of native support for local media, such as the Plex server. But obviously the Plex app is available.", "verified": true, "helpfulness": "0/0", "author": "B. Doctor"}, {"rating": 3.0, "review": "This little stick is awesome for the amount of content you can store, application options, etc.  I would say it goes toe to toe with my Roku 3.  However, I gave this 3 stars because the wifi range seems to be very short (and if you can't connect from 20 feet away, you can't use this).  I bought this for a TV that sits about 20 feet away with just one wall between the firestick and the router.  If I bring it closer, say by about 5 feet and plug it into my other TV, it works just great.", "verified": true, "helpfulness": "0/0", "author": "AnimalMotherFukah"}, {"rating": 3.0, "review": "It Freezes sometimes.", "verified": true, "helpfulness": "0/0", "author": "KEV"}, {"rating": 5.0, "review": "Works great, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Harold Spankus"}, {"rating": 2.0, "review": "Feature wise and potential value this is a 5 star device. The video quality makes it a 1 star. The video is pixilated.My test and verification of this was done using the same TV, within 15 min of each other using the flixster app and same video. I tested using my Chromecast, my computer connected to the TV via hdmi and the Fire Stick. The Chromecast and computer had equally good picture comparable to 1080P. The Fire Stick had a poor picture quality which I would compare to a old YouTube video. I switched back and forth  between devices to make sure it wasn't a buffering/bandwidth issue but no matter the switching done, the video did not improve on the Fire Stick. Note that I did confirm in the settings that the fire stick was set to 1080P.In all, the stick is great for the children's room but I'm keeping it away from my main TV. I would not buy it at $40 and would just suggest another Chromecast. More power is great, but what good does it do if you \"just spin the tires\"?", "verified": true, "helpfulness": "0/0", "author": "MR B"}, {"rating": 5.0, "review": "Really cool product. Amazon is doing a great job with innovative market setting products. This is one of them. Easy to set up.  Easy to navigate. Keep it up amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It just works!  The highest compliment I can pay to a gizmo like this.Compared to the Chromecast I own, this thing does not need me to power it off/on each time I want to use it.I'm considering buying 2 more of them.Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Kris G."}]