[{"rating": 5.0, "review": "Bought this for my sons room. Works very well. He has been very happy.", "verified": true, "helpfulness": "0/0", "author": "Joe Kampman"}, {"rating": 5.0, "review": "Love, Love, Love it!", "verified": true, "helpfulness": "0/0", "author": "jennifer manno"}, {"rating": 4.0, "review": "Didn't have quiet as much as I thought it would.", "verified": true, "helpfulness": "0/0", "author": "Jamie Cross"}, {"rating": 5.0, "review": "Amazon nearly hit a home run with the Fire Stick. I love that I can link it to my phone or tablet and have a full keyboard to input searches. I love that it has a remote, too. It's blends the ease of use of a Roku with the portability of a Chromecast. I think Amazon looked at the best features of the other streaming sticks, combined them, and threw in a few neat tricks of their own.My only complaint is that I wish I could browse and select Prime Music from the device, rather than having to add playlists from the PM page.Overall, it's definitely a winner, and I'm glad I bought two. One for home, and one for travel.", "verified": true, "helpfulness": "0/0", "author": "Captain Ducttape"}, {"rating": 5.0, "review": "Haven only used it for 2 days so far, but for Prime members at least, there's no way you can go wrong wtih this. Picture quality has been superb.", "verified": true, "helpfulness": "0/0", "author": "Ruprecht"}, {"rating": 5.0, "review": "Its a device that is easy to move around in.  Its quick with no stutter", "verified": true, "helpfulness": "0/0", "author": "Tracey Hardaway"}, {"rating": 1.0, "review": "I am using it out side of USA so I cannot use it!!!!! Just netflix.", "verified": true, "helpfulness": "0/0", "author": "ADRIAN SOTO CARBALLO"}, {"rating": 5.0, "review": "it did exactly as promised and it worked right out of the box.  It is great.", "verified": true, "helpfulness": "0/0", "author": "Craig Rothwell"}, {"rating": 5.0, "review": "Snagged it for $20 on a one-day special pre-order.  The set up, while easy, took a couple of tries in the downloading update.  Once setup, it's awesome.", "verified": true, "helpfulness": "0/0", "author": "Cecilia Wong"}, {"rating": 3.0, "review": "It works fine, nothing exceptional.  Relatively easy to set up.  Probably a bargain for the price.  It struggles a bit with Watch ESPN, holding the games for the duration without needing to restart.", "verified": true, "helpfulness": "0/0", "author": "Robert S. Bires \"Tennesseebob\""}]