[{"rating": 5.0, "review": "PRODUCT AS PROMISED.", "verified": true, "helpfulness": "0/0", "author": "paula busse"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "andre jackson"}, {"rating": 1.0, "review": "Always freezing up. Streams for about two minutes and quits. Every app I use. I would not recommended it at all. Amazon needs to stand behind this and recall them and redo it. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "joseph douin"}, {"rating": 5.0, "review": "Easy to install and use.  Works like a charm", "verified": true, "helpfulness": "0/0", "author": "Dawn S. Spilky"}, {"rating": 5.0, "review": "It was easy to install and I had no problem in figuring out how to use it.  I had planned to use my computer hooked up to my TV to enjoy my movies.  But the fire stick works so much easier..  The only item they need to tell people about is the filter.  They did not state what it was in the instructions.", "verified": true, "helpfulness": "0/0", "author": "RP"}, {"rating": 5.0, "review": "I just got one this week and absolutely love it!  I had already had a smart tv, but no access to my Amazon Prime videos, so I decided to purchase this.  Have already watched and fallen in love with one of the shows created by Amazon (Alpha House) and can't wait to watch movies and more shows created by them.  I suggest this for anyone that wants the smart tv experience without buying a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Del \"Del\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Tifani Dulaney"}, {"rating": 5.0, "review": "great addition to watching the TV", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 1.0, "review": "I am so disappointed with the Fire TV Stick.  I have two Fire TV's, a Fire Phone (which, in fact, I have promoted to the hilt...I have talked 8 people out of IPhone 6 phones and into Fire Phone because I believe in it so much...I should get commission!) and now I ordered 2 Fire Sticks...one for me and one as a gift for my father.  I couldn't believe it when it arrived...I thought it was so cool.  Then my opinion quickly changed.  My dad had been waiting since Christmas for me to install his for him.  He is very particular when it comes to tidiness.  He had a company come out and mount  his tv on the wall so that no cords...and I mean NO cords showed whatsoever.  My dad was excited and that made me so happy...he is so hard to buy for!I have a spinal cord injury and can barely walk (I use a walker or wheelchair) and can't drive at all so we had to arrange a time when he was in town and I wasn't in too much pain to travel to his house.  Last night the stars aligned and I was able to go.  I couldn't wait to install it for him because he was soooooo happy and couldn't wait to see what all it did.Then came the \"unboxing\" and reading of the directions.  I couldn't believe my eyes when I read the fact that it had to be plugged into the wall...which meant a cord hanging from up where the the tv was, down the wall and into the outlet.  My dad simply (well, not so simply and definitely not toocordially) refused to do it.  I cried...I thought I had finally gotten a present right and I failed again.  He is so mad that he won't even return it to get something else.  So, it is not really him that's out 40 something dollars...it's me.  I am still so upset!  What was Amazon thinking with the design of this thing.  In a day and age where people are mounting their TV's on their walls with nothing showing like works of art.  And some of these Smart TV's (like my father's) are, indeed, works of art.So, here I sit, so disappointed.  And I am such a loyal Prime Member and talk people day in and day out into buying your products...and rave about your customer service...but now, I am questioning all of that.  I mean, when you have to live on disability insurance, 40 something dollars is quite a bit of money.  I am seriously considering doing business elsewhere...and before you just write me off, take a look at my account and the sheer volume of business I do with you.  I don't have much money to spare, but what I do have almost always goes to Amazon.I think that the right thing to do would be to show me that I do matter to Amazon and you do care that I am truly upset to the point of tears over a product of yours.A loyal customer,Deana Bell", "verified": true, "helpfulness": "1/4", "author": "HonestReviewer \"HonestReviewer\""}, {"rating": 1.0, "review": "Garbage.I have a relativly new top-of-the-line Sony TV and no matter what I do the fire stick does not work.Have spent much time on the phone with Amazon customer service and they seem to know no more than I do.Product has been a nightmare. Would rate this is zero stars", "verified": true, "helpfulness": "1/3", "author": "Kevin Patterson"}]