[{"rating": 5.0, "review": "The Fire HD stick just opened up one of our viewing areas to FABULOUS New choices! Earlier this year we purchased a Smart TV to replace one that went out. As one of the features we had access to Amazon Prime Videos. I have had a Prime account for many years but never used any other aspects or features available besides the 2 day Free shipping. When we realized how beneficial the Amazon Prime viewing was I immediately purchased the Fire stick for a different TV in our main viewing area. Besides having access to movies-galore there is a plethora of TV shows to watch especially ones for the Kids. This device , literally, can replace paid broadcasts and programming.It connects quickly and there are absolutely NO complaints from me or my Family.", "verified": true, "helpfulness": "1/1", "author": "Brent Dalton"}, {"rating": 5.0, "review": "More than I expected!", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "Awesome!!  If you don't have a smart TV this will bridge the gap.", "verified": true, "helpfulness": "0/0", "author": "SEVER2"}, {"rating": 5.0, "review": "Great value.  Works on the same scale as my Apple TV which cost 5x the price.", "verified": true, "helpfulness": "0/0", "author": "matt altman"}, {"rating": 5.0, "review": "Bought this at the intro price which makes this a great deal.  Otherwise, setup is simple and the fact that it is basically always on, once you change the input on the TV to the HDMI, boom, it's there.  I got this for a TV on my porch that didn't have wireless capability, so couldn't watch Netflix or anything, so really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Ga Boy-n-FL"}, {"rating": 1.0, "review": "Bought a pair of these for my two kids for Christmas, to go with new Samsung TVs. These were located in upstairs bedrooms near the wifi router (about 20 feet away). During setup, my wifi signal displayed on the screen as very good strength - maximum 4 bars. These would sometimes connect and work for a while. Other times they would say \"connected with problems\" and not work at all. I used the HDMI extender and USB wall adapter as recommended but that didn't help. My wifi router (Comcast) is about a year old and other devices in these bedrooms work fine. Went into settings to reset one of the Sticks but that didn't help. Managed to get both of them to connect long enough to update the software but that didn't solve the connection problem either. Returning these today.", "verified": true, "helpfulness": "0/0", "author": "K. Smith"}, {"rating": 5.0, "review": "Every prime user should have one.", "verified": true, "helpfulness": "0/0", "author": "Mike M"}, {"rating": 5.0, "review": "Works like a charm. No lagging or buffering. Allows me to take advantage of Amazon prime videos way easier than Apple TV does.", "verified": true, "helpfulness": "0/0", "author": "VA Gator"}, {"rating": 1.0, "review": "I have 2.  they were working beautifully until recently.  now, some of the apps constantly freeze (i.e. hulu plus and slingbox).  is there some update out there that I missed?", "verified": true, "helpfulness": "0/0", "author": "Carol Mae \"Carol Mae\""}, {"rating": 3.0, "review": "Seems to buffer more than I expected", "verified": true, "helpfulness": "0/0", "author": "Gilbert J Stringer"}]