[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Donald Hoskins"}, {"rating": 5.0, "review": "Amazon Fire TV Stick did everything I expected. I'm very satisfied with my purchase.", "verified": true, "helpfulness": "0/1", "author": "Barbara Skeans"}, {"rating": 5.0, "review": "Zippy, portable, works in hotels.  Pretty happy.", "verified": true, "helpfulness": "0/1", "author": "B. Badalucco"}, {"rating": 1.0, "review": "Broke after several months usage.  For what is supposed to be a very slick device, it needed an HDMI adapter and power adapter adding to the bulk and cables.  Amazon did refund but charged a restocking fee.  There are much better options available in the stand alone smart tv category.", "verified": true, "helpfulness": "0/1", "author": "jess&alex"}, {"rating": 5.0, "review": "Love it! So easy. I've bought a couple for my parents home as well", "verified": true, "helpfulness": "0/1", "author": "MICHELLE ARAGON"}, {"rating": 5.0, "review": "Everything I wanted and more!", "verified": true, "helpfulness": "0/1", "author": "Amy R"}, {"rating": 4.0, "review": "enjoy using the stick", "verified": true, "helpfulness": "0/1", "author": "DJ"}, {"rating": 3.0, "review": "I bought this in order to MLBTV streaming. There is a serious problem with the app that makes it unwatchable because of constant buffering. Neither Amazon nor MLB have dealt with the issue.  Otherwise the performance is good and I do not have similar problems with any other apps. It's well worth the money unless you want to watch baseball.", "verified": true, "helpfulness": "0/1", "author": "Carey Rogers"}, {"rating": 5.0, "review": "Great product label me to get rid of my cable some of the movie channels less expensive works great", "verified": true, "helpfulness": "0/1", "author": "Reggie kitchen"}, {"rating": 5.0, "review": "This is super easy to use. I had no issues with the setup- it took just minutes and walks you right through. Love having my Netflix and Prime all in one place.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]