[{"rating": 5.0, "review": "I love it! Streaming video and audio quality is great, and the interface is pretty fast compared to my 'smart' blu-ray player. Highly recommended if you already are a prime subscriber.", "verified": true, "helpfulness": "0/0", "author": "C French"}, {"rating": 5.0, "review": "I pre-ordered the Fire Stick not honestly expecting much for the price, but it totally exceeded my expectations - so much so I bought another one when they were on sale over Christmas. With the $5 AirPlay app and Plex the Fire Stick becomes the cheapest most functional streaming device on the market today, handling local streaming plus Android, Windows, and Apple mobile devices very well. I imagine that over time the library of streaming services grows, but with Netflix and Amazon Prime available from the get go, all my needs are covered.", "verified": true, "helpfulness": "0/0", "author": "TSG \"TSG\""}, {"rating": 4.0, "review": "Easy to use with a great connection to the wifi.", "verified": true, "helpfulness": "0/0", "author": "Rick Fisher"}, {"rating": 5.0, "review": "I love the simplicity of the interface.  I also like that i can access my Amazon Cloud photos directly on my TV!My only gripe is: I wish it remembers my previously watch Prime Shows and placed it in the Root menu system.This way I can resume my previously watched shows without having the Search them again.Netflix is best when it comes to navigating your previously watch videosAmazon Prime Video isn't too far behind. They just need to polish up the interface more.", "verified": true, "helpfulness": "0/0", "author": "John Kim \"Johnny88\""}, {"rating": 5.0, "review": "So, so easy to install.  And it works 100x better than trying to stream off of our Wii.  <--No idea why, but it does.We will drop our cable and keep this bad boy!!OH!  But do know, the cable is SHORT!  So you'll need an extension of some kind if you have your giant flat screen up on your wall and the only plug in is towards the floor.", "verified": true, "helpfulness": "0/1", "author": "Leah D"}, {"rating": 2.0, "review": "I own a chromecast, roku and fire stick.  I would have bought another chromecast but I am a prime member and it won't stream from amazon.  The first thing that I did not like about the fire stick is that you have to connect it to a power outlet.  So here we go with the cards hanging again.  The second HUGE thing is it loses wifi every 30 minuets! I have to turn it off then on again and go back to the show I was watching. It really is ridiculous.  I knew it had a remote and I was and am fine with that but you don't need that for the chromecast either.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"LibertysTicked\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Loftus"}, {"rating": 5.0, "review": "So far my experience with the Fire TV Stick has been great. UI is repsonsive and easy to navigate, the Netflix app works well and have no complaints.", "verified": true, "helpfulness": "0/0", "author": "Nathan Totura"}, {"rating": 4.0, "review": "Great addition to tv watching!", "verified": true, "helpfulness": "0/0", "author": "M. Faulkenberry"}, {"rating": 3.0, "review": "It works well to play Amazon prime content, but it would sometimes lock up or has wifi issues, both of which require rebooting. Amazon needs to improve the software reliability.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]