[{"rating": 5.0, "review": "Holy cow, I love this device. So quick and easy and it works with all of the popular online streaming services I use: netflix, amazon, and hulu!", "verified": true, "helpfulness": "0/0", "author": "Microondas"}, {"rating": 2.0, "review": "I did not pay the full $39 for it, but since it is mostly really useful when you subscribe to some content service, it is kind of useless.  My Blu-Ray player does most of those content sites, so what is the appeal here?  Not much for me I guess.  Unless I am missing more of what you can do without spending more money or on an existing device?", "verified": true, "helpfulness": "0/0", "author": "Glenn C. Hofmann"}, {"rating": 3.0, "review": "There are pluses to this device. Easy to set up good format. While we used it we noticed several things happening during viewing. Frequent buffering, pixeling, connection difficulties. We also noticed some pretty frequent sounds that we could not account for. In view of the warnings of hackers being able to view inside our home through our devices. We had tech support check out our t.v. Service the problem was not there. We reconnected our roku device, all problems stopped. Amazon has been ahead of everyone else in Internet inovation for sales. We just thought we would wait and see. The 3 was given because the device is well made and seems to be of high quality.", "verified": true, "helpfulness": "0/0", "author": "Dona Lee Roby"}, {"rating": 5.0, "review": "Initial use has been very pleasing.  Out of the box to operational in minutes.  It found my wireless network connections and was up immediately.  It had access to all of my Amazon content as pre-configured by Amazon - good job Amazon.  I was able to load a few apps and got YouTube operational with no challenges.Streaming is excellent - no lags in movie streams.  I have streamed Amazon, Lifetime, and YouTube flawlessly.  It provides 1080p level output to my TV.I will update after more usage.", "verified": true, "helpfulness": "0/0", "author": "LinuxGuy"}, {"rating": 3.0, "review": "As others have reported, some Samsung tvs and the Fire Stick do not get along, resulting in image problems, such as a vertical doubling of the image, a green bar at the bottom, and possibly others. On our H6201, we were able to fix the problem by turning on Game Mode on the tv. It is found under the Setup --> General menu.This works both with the stick plugged directly into the TV and also through our Onkyo receiver. (The image doubling was the same in both inputs, too)", "verified": true, "helpfulness": "0/0", "author": "EG"}, {"rating": 3.0, "review": "When it works it is great.  Loses internet connection often and ESPN freezes constantly.  Do not know if I received a bad one or if it is just the way it works.  Hulu and Netflix work well as long the internet stays connected.  The internet issue is unique to the fire stick as it  is not an issue with the roku box or any of our lpatops.", "verified": true, "helpfulness": "0/0", "author": "D. Ash"}, {"rating": 4.0, "review": "Great product with lots of options, especially with the android app.", "verified": true, "helpfulness": "0/0", "author": "Toot \"Toot96051\""}, {"rating": 5.0, "review": "I was fortunate to pick this up during the prime member pre-sale.  I've had it for a little over a week now.  I have no complaints.  It is much faster than my Blu-Ray player that is streaming capable.  Installation was very easy.  I was able to download the remote app on my phone so I can use the voice control.  Definitely a must have if you are a prime member.", "verified": true, "helpfulness": "8/9", "author": "PABooklover"}, {"rating": 1.0, "review": "I placed the order in late October and have been anxiously waiting for the product to arrive since it was going to be a gift... I have to say I am very disappointed... I own quite a few electronic devices (including the Chromecast)  and none of them have given me as many connectivity problems as the firestick.The router is only 10-15ft away from the device yet  It constantly drops the wifi signal . When it does work (which is for a few minutes) the video quality is horrible due to the \"poor connection.\" My Chromecast which is located in a room further away from the router works perfectly fine as do my other devices ( tablets, laptops, cell phone, etc).Ive tried using the HDMI extension, restarting the router, restarting the fire stick, disconnecting other devices from wifi, repositioning my router but Ive had no luck so far.. There are several discussion boards in which customers complain of the same problem. I was surprised that the fire stick which costs more and has much better specs than the Chromecast has such poor performance... I guess I might have just received a defective item?As a Prime member, their are many benefits of the fire stick that you do not get from the chromecast which is why I was really looking forward to using it. I will keep it for a few more days and see if there are any improvements.. hopefully and update addressing the issue is released...", "verified": true, "helpfulness": "0/1", "author": "Jen"}, {"rating": 4.0, "review": "Got this during the pre-order sale for $20 or $25 (can't recall off the top of my head). Been using it for almost a month and so far I'm very happy with it. Setup was easy breezy. Navigation is relatively simple, although I'm not a huge fan of the way Amazon's flavor of Android organizes content. The categories don't distinguish between free (with Prime) and paid content, and on more than one occasion I've almost accidentally purchased shows when I was clicking over ambitiously.The OS is smooth enough 80% of the time, but there are lags when switching between applications on occasion. And browsing titles is sometimes jerky or laggy. When I first connected it to the rear of my TV, the remote had major interference issues for some reason so the remote didn't register clicks or it would think a button was being held down. I moved it to a side port and haven't had issues since. It also comes with a short HDMI extension cable that is supposed to help if you encounter issues with the remote.For the price, this thing is fantastic, especially compared to other similar devices at higher price points. I use it to stream plex from my computer and I'm able to watch 1080p at maximum bitrate (no-conversion) on-the-fly without problems. Netflix and Amazon Prime video both work fine, although I prefer the built-in Netflix app on my TV since it works with a qwerty remote. I tried out the Fire TV box before this, and functionally they're nearly identical as far as my usage goes (didn't use the voice commands). This is slightly slower than the box version, but it's a fraction of the price and totally worth it. I haven't really played any games, but I assume they probably work well enough if you are willing to buy the gamepad.The Android Fire Remote app on the phone kind of sucks. I wish it had keyboard support and a simple directional pad since I find the swipe pad really annoying to use. But this isn't a review about the app, and I digress.", "verified": true, "helpfulness": "0/0", "author": "km"}]