[{"rating": 4.0, "review": "Good product.  I which you could modify the menu options a little more.  I bought it to use Sling TV and Netflix.  I'm not an Amazon Prime member, nor to I plan on being, but most of the menu options are for purchasing things though Amazon Prime.  Other than that its a cool little device.  The remote works wonderfully.  There are available Apps, including YouTube and Spotify (for Spotify premium subscribers only...which is annoying).", "verified": true, "helpfulness": "0/0", "author": "Joseph Chaumont"}, {"rating": 3.0, "review": "The Fire TV Stick is a good device that has been cheapened by the remote provided.", "verified": true, "helpfulness": "0/0", "author": "D. Abrahams"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Wannette Crumiel"}, {"rating": 2.0, "review": "I purchased this in December when it was on sale for $25 from my local Best Buy. The thing worked really good for a few months but all of a sudden it stopped working. The power will not even turn on. I contacted Amazon but not warranty on this thing or at least one that last 6 months kind of pissed. although now I'm debating purchasing another one....the kids use it for their streaming of shows.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "WOW, this turns a regular TV into a Smart TV.  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "David Redfield"}, {"rating": 5.0, "review": "Really like this thing! Super cool. Haven;t had it long so I don't know all the limitations and such but so far it's great.", "verified": true, "helpfulness": "0/0", "author": "Rose Conley"}, {"rating": 5.0, "review": "it is a great item", "verified": true, "helpfulness": "0/0", "author": "Dean Groff"}, {"rating": 5.0, "review": "The minute this black box showed up, I knew this was going to be a truly enlightening experience. Then I opened the box, and let me tell you, it was beyond enlightening. The inside of the box is coated orange, but not just orange, I mean orange with the brightness of a thousand suns. Years ago I went camping and I got lost in the middle of the woods. Now I'll never go camping without this box - it could light the Valley of the Shadow of Death with it's supernova luminosity.Besides the intensely awesome colors, the FireStick performs wonderfully - especially with the iphone remote control app. I didn't tell my wife about the iphone app right away. I kept telling her she was pressing the wrong button when she asked me how to use the included mini-remote. Even though there's only like 6 buttons. Meanwhile I was secretly controlling things with my iphone just to mess with her. So I'm not sure if the app was designed purely for entertainment purposes or not, but I must admit that it was insanely awesome to watch the resulting confusion.", "verified": true, "helpfulness": "0/0", "author": "TWS \"LH\""}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "shanda"}, {"rating": 5.0, "review": "Compared to that Chromecast we got that broke within a month, the Fire TV Stick fantastic.  Remote is awesome, interface is really fluid and easy to use...great product.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Justin Cook"}]