[{"rating": 3.0, "review": "It has a lot potential, but also does quite a few simple things wrong to annoy the consumers.1. Why can't you have the power cable plug at the end, instead of on the side, in the way of other power cord or plugins2. Relying onscreen menu to do configuration and search is soooo yesterday.  Very user unfriendly.  In this aspect, Google got it right.3. Documention is spotty.  You claim YouTube is supported, in the demo video is there, but not on my stick.  I had search online and manually install itThe good things include all the Prime videos, support of Netflix, ESPN, Showtime app, etc.  And games.", "verified": true, "helpfulness": "1/1", "author": "EZ rider \"gadget guy\""}, {"rating": 5.0, "review": "Works very well.  The picture quality is excellent.  It's the first steaming gadget that I have owned which actually produces a high definition picture.", "verified": true, "helpfulness": "0/0", "author": "William A. Ruzin"}, {"rating": 3.0, "review": "set up was a breeze. very intuitive. my problem has been connectivity issues. losing connection every 5-10 minutes became frustrating. my router is less than 20ft away. I gave up after about an hour. will try again in a day or two. i really want to like this thing.", "verified": true, "helpfulness": "1/1", "author": "chazz \"motown freak\""}, {"rating": 5.0, "review": "So far we have only used it once.  Set up was easy and it works great.  Bought it to replace a Dish box in my office.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Livengood"}, {"rating": 4.0, "review": "Awesome little thing!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works exactly as described.  I would have given it 5 stars if it worked fully with Amazon Prime Instant Videos.  While it does stream Prime Instant Videos, Amazon selects a VERY limited number of \"Recommended\" videos - you do not have full access to the Instant Library.  The irony is that Netflix figured a way to stream their full library!", "verified": true, "helpfulness": "1/1", "author": "Ned"}, {"rating": 5.0, "review": "Works excellent, very easy to install and you can access Netflix with no problem. Amazon Prime offers a good variety of movies on demand.", "verified": true, "helpfulness": "0/0", "author": "EE"}, {"rating": 4.0, "review": "I have not had much time to test this unit, but so far it seems very responsive.  I'm looking forward to learning more.  So far, so good!", "verified": true, "helpfulness": "0/0", "author": "WFG Topeka"}, {"rating": 1.0, "review": "have been unable to get it to work", "verified": true, "helpfulness": "0/3", "author": "Robert Rhodes"}, {"rating": 3.0, "review": "Interface is good, but performance is a little lacking. Streaming over wifi not smooth on my network (Comcast 105gbps wired, but wifi considerably slower).  Does not rival my TiVo Premier, which has all the same features. I bought this half price as an experiment. I will keep it, but probably not use it much.", "verified": true, "helpfulness": "2/2", "author": "R. Jones \"R.Jones\""}]