[{"rating": 5.0, "review": "Made my regular flatscreen tv smart. Excellent value. I no longer have cable since purchasing this.", "verified": true, "helpfulness": "0/0", "author": "Korey"}, {"rating": 5.0, "review": "I love it.  It is easy to use and my amazon prime account gives me a great selection to watch.", "verified": true, "helpfulness": "0/0", "author": "Carol Hewitt"}, {"rating": 5.0, "review": "Love this!!!  I think we are even going to cancel our satellite package it's so great!", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Love it it is definitely a must have if you have Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "Linda Matchett"}, {"rating": 5.0, "review": "easy to install and setup", "verified": true, "helpfulness": "0/0", "author": "E. Zeisweiss \"eddert\""}, {"rating": 2.0, "review": "It is nice, because you can watch programs in Hulu, Netflixs and Amazon prime. I do not like that it has to be plugged into an electrical outlet....", "verified": true, "helpfulness": "1/1", "author": "Danielle"}, {"rating": 5.0, "review": "LOVE LOVE LOVE this!!!  We use it every day", "verified": true, "helpfulness": "0/0", "author": "B. D. Iverson"}, {"rating": 5.0, "review": "LOVE the Fire TV Stick! It's like having a blu-ray player (minus the blu-ray part) or a smart tv, but for a fraction of the cost. It runs well and is very fast. The remote works great, and I love that it learns what you like to watch, so the shows/movies start up faster. It's like a chrome cast, but so much better since everything runs directly from the stick, there's no need to play it on a separate device and  \"cast\" it. Can't say enough good things!", "verified": true, "helpfulness": "0/0", "author": "A. Tango \"book and movie junkie\""}, {"rating": 5.0, "review": "The Fire TV Stick was better than i expected.  We just purchase a large LG TV and connected the Fire Stick to it.  We have watched more stuff on the Fire than the regular TV.  It was very easy to install and we have had no problems at all.  We have the voice activated remote and works great!  So don't hesitate to purchase this great piece of technology.", "verified": true, "helpfulness": "0/0", "author": "Carl A. Dixon"}, {"rating": 5.0, "review": "I was really excited when I ordered this, thinking of all the times I'd get to play catch with the dog, using an actual stick on fire! Little did I know about my terrible reading comprehension skills. This finally convinced me to go back and get a GED. And with GED in hand, I can finally write a review! 10/10!", "verified": true, "helpfulness": "1/2", "author": "Igor Pe"}]