[{"rating": 5.0, "review": "Definitely recommend it. I have both Fire TV stick and an Apple TV. Both have basically the same concept. Only reason I have Apple TV is for the AirPlay feature. Other than that fire TV stick is a lot better", "verified": true, "helpfulness": "0/0", "author": "Nabegha"}, {"rating": 1.0, "review": "I bought the FireTVStick after using ChromeCast for a few months. For me, the attraction was that it has its own remote. ChromeCast requires you to use your iPhone which tends to either go to sleep or lock so that when you want to pause the video play, it can take up to 20 seconds before you can get it to respond.The Firestick does solve this problem but adds quite a few of its own. The interface is clunky at best and at least the Netflix app is pretty weak. You cannot even search for a movie by its title. The interface seems to exist primarily to sell Amazon Prime.In addition, the Firestick firmware is not very stable. For example, I installed the Airplay app they sell to allow you to play videos from your iPhone. Not only would it not play sound from iPhone videos, it crashed the Netflix app and I had to uninstall it their AirPlay app.Probably not ready for prime time.", "verified": true, "helpfulness": "0/0", "author": "Richard S."}, {"rating": 2.0, "review": "It is a nice device fast smooth simple but it seriously lacks in app especially the fact that it doesn't support vudu...", "verified": true, "helpfulness": "0/0", "author": "armando"}, {"rating": 4.0, "review": "I like the stick, however, I can get most of the same movies on my kindle. Still have to purchase some movies. I had to Google how to open the controls to insert the batteries. And I googled instructions. I will get my money's worth.", "verified": true, "helpfulness": "0/0", "author": "Arlene A. Fortune"}, {"rating": 5.0, "review": "Awesome love it. The pictures are so clear", "verified": true, "helpfulness": "0/0", "author": "nadine petit"}, {"rating": 1.0, "review": "Poor wifi reception (no other issue with any devices in the same room).  General slow performance.  When it was working I liked the UI - nice and simple to operate.  But overall very disappointing.", "verified": true, "helpfulness": "1/1", "author": "Mr. R. J. Stew \"rob london\""}, {"rating": 5.0, "review": "Just fabulous!!!It resolved several issues I was having attempting to watch movie channels in rooms where there was no cable.", "verified": true, "helpfulness": "0/0", "author": "Tony S"}, {"rating": 5.0, "review": "I love the fire stick, i have the amazon fire tv and it's amazing.", "verified": true, "helpfulness": "0/0", "author": "José"}, {"rating": 5.0, "review": "Love ❤ it", "verified": true, "helpfulness": "0/0", "author": "MALCOLM HAMBY"}, {"rating": 5.0, "review": "yes so good oh lovin it", "verified": true, "helpfulness": "0/0", "author": "james klanke"}]