[{"rating": 5.0, "review": "I love the Fire stick, its sleek, compact, never had a problem with it, Loading and streaming is fast and I have never had a with streaming any video. You can use it for games, apps, videos, movies. Love it. If there was 2 things I would correct, the battery cover on the remote, can be extremely difficult to remove to replace the battery. And the remote itself is so touchy. The slightest touch almost by anything will send you to the fire tv screen, which then  you will have to find your tv remote and change it back to previous setting. Other than that though. I am a big fan. And you cant beat the price really. But I would say, the Fire Stick or Fire TV is only worth it if you are a Amazon Prime Member, because with that you have access to Prime Video and Music.  This is actually my 2nd Fire Stick. Thats how much i like them,", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 5.0, "review": "Works awesome and a great price", "verified": true, "helpfulness": "0/0", "author": "Bryce Thompson"}, {"rating": 5.0, "review": "In my opinion, this is better than a Roku because of the size, price, and easy of use.  Definitely buying another one..", "verified": true, "helpfulness": "0/0", "author": "Dexter"}, {"rating": 5.0, "review": "Great product works well does everything it suppose to and more. Great for prime members.", "verified": true, "helpfulness": "0/0", "author": "Orlando Alaniz"}, {"rating": 2.0, "review": "I dont like that NOTHING IS FREE WITH THE STICK. EVERYTHING I would like to watch must be purchased", "verified": true, "helpfulness": "0/0", "author": "jewells"}, {"rating": 5.0, "review": "Ultimate entertainment", "verified": true, "helpfulness": "0/0", "author": "Cantrice Timmons"}, {"rating": 3.0, "review": "Overall, I think this is an ok product. I own the Roku, Roku 2, and Chromecast. I no longer use the Roku and only use this and the Chromecast. I was looking for something that has a remote so I can watch Netflix, Hulu, etc, without me downloading a bunch of apps like the Chromecast. The issue I have with this is that the stream quality is very bad compare to Chromecast. With the Chromecast, once you stream it, it almost flawless with very little to no lag. With the Amazon Fire TV, There is always a lag or buffering issue.Chromecast advantage over this: Better stream quality, can stream anything from your web browser. Work flawlessly with Youtube and Netflix.Chromecast disadvantage over this: Requires a phone/laptop/ etc to cast. Need to download individual apps, if you want to stream it from your phone or tablet.", "verified": true, "helpfulness": "1/1", "author": "K.D"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "James burchett"}, {"rating": 5.0, "review": "Awesome!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Joseph Romero"}, {"rating": 5.0, "review": "Perfect! I love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "larry hawkins"}]