[{"rating": 5.0, "review": "This only thing I would change is to be able to sync spotify other then that I love the product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought one for my son for his birthday, and he loves it!!!! He even got his Dad hooked on it, and we ended up buying one for his birthday, as well! So easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Barbra A. Burns \"barbra78\""}, {"rating": 3.0, "review": "Very slow with many stoppages.  I also have an Apple TV and a Roku both of which far outshine the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Duane Ferchen"}, {"rating": 5.0, "review": "i love this device defintely worth paying the amazon prime membership for a year for all the extras you get.", "verified": true, "helpfulness": "0/0", "author": "bethany carroll"}, {"rating": 2.0, "review": "Continues to disconnect itself from the internet every hour or so, despite the WiFi working perfectly on all my other devices. Pretty much forces you to maintain a Prime membership, but that was expected. Overall okay, but technical issues make me wish I had gone with Roku.", "verified": true, "helpfulness": "0/0", "author": "Amber Beattie"}, {"rating": 3.0, "review": "Needs a router near it or it doesn't work", "verified": true, "helpfulness": "0/0", "author": "Gregory Schwartz"}, {"rating": 2.0, "review": "It only worked for two hours then couldn't  get a picture.  When it worked picture was great.", "verified": true, "helpfulness": "0/0", "author": "S. Brannon \"Mailladyfmb\""}, {"rating": 1.0, "review": "I've had this for about six months now and it's just gotten worse.  I use it every day mostly for Netflix and Hulu, but have also used Pandora.  I'm officially sick of the freezing, crashing and general complete unreliability of this thing. Hulu is the worst, but Netflix and Pandora also skip and have interruptions in the content. And it's not my internet connection. When I watch Netflix shows on my wireless Blu Ray player, the content plays seamlessly.I'm glad I didn't spend much money on this stupid stick. I don't expect the Fire TV box to be any better so I guess I'm going to Apple TV. **sigh***", "verified": true, "helpfulness": "1/1", "author": "discofan"}, {"rating": 5.0, "review": "Awesome, works better than the smart blu-ray player I bought for another TV, doesn't buffer in mid movie.  Absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Judith Erdahl"}, {"rating": 5.0, "review": "I love it! It's exactly what we needed to stream all our channels (Netflix, Hulu, Amazon Prime Video! And more!)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]