[{"rating": 1.0, "review": "Setup was not as easy as Apple TV.  I set it up and the sound didn't work.  Finally figured out how to adjust the sound settings and got it working but it was not intuitive. The instructions are very poor. I was a disappointed.  Now that it's setup I'm using it only for content not on Apple TV which isn't much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"patricks9\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Virgil Williams"}, {"rating": 5.0, "review": "Makes any tv with usb input a smart TV.  Super easy to set up. Im glad I made my purchase.  I really only use it for Netflix and amazon prime videos but it is much faster  and intuitive than my smart bluray player with same functions.", "verified": true, "helpfulness": "0/0", "author": "Coldani M. \"cstar\""}, {"rating": 4.0, "review": "This worked great when I initially purchased it.  Then other things (life in general) took me away from TV for awhile.  When I tried to use this last evening, I couldn't make it work and became very frustrated.  The instructions seemed simple, but I couldn't get it to work.  I gave this a negative review.  Amazon support noticed and sent me some links to try and troubleshoot my problem. They worked, and I discovered a lot of features I didn't know exited, like being able to use my iPhone to control it.When I looked for help, all I seemed to be able to find was marketing info about why I should by this.  I would give it 5 stars if they made trouble shooting links easier to find. I do really appreciate Amazon reaching out in my frustration.", "verified": true, "helpfulness": "0/0", "author": "Sirtenly \"A CPA\""}, {"rating": 5.0, "review": "Not enough documentaries though", "verified": true, "helpfulness": "0/0", "author": "Linda Bryant"}, {"rating": 2.0, "review": "Hicups while playing way more than the Chromecast...for $19 bucks it wasn't bad", "verified": true, "helpfulness": "0/0", "author": "Baseball69"}, {"rating": 5.0, "review": "Fire TV stick is cool for the price point as other reviewers state..  great to turn a dumb TV into a smart TV etc, but I wanted to share a couple of additional points. I was in the market for a projector style home theater system and had been doing a ton of research. There are hardly any \"smart\" HD projectors, so was curious, could the stock solve for that. Short answer: yes... and it's so cool. Imagine having a theater room where there are no cables to run from the projector yet you have Netflix, Prime content, music and more. We are also avid campers and I got to thinking, man how fun would it be to use this for an outdoor movie night?  I picked up a cheap $46 mini projector to see how that would go and same result as far as function, albeit picture quality is not as high end as a true home theater projector.  Still quite the novelty at the campground... a real crowd pleaser and keeps the kids entertained.Only peeve I have with the sick is that it doesn't charge via the HDMI port and you must give it a secondary power supply. So you hsve the elegant stick, but tgen a power chord sticking out of it which takes away from its simple charm.  This is a limitation of HDMI ports in general, though and hopefully someday they will make HDMI more like USB from a charging standpoint.", "verified": true, "helpfulness": "0/0", "author": "Tiffanitza"}, {"rating": 5.0, "review": "A big difference in movie watching......You can view the movie trailer before seeing the movie. A great selection of movies, music and games....", "verified": true, "helpfulness": "0/0", "author": "Charles Riley"}, {"rating": 5.0, "review": "My dad got this for me during the Prime member pre sale.  I think it was $19.  At first it was little disappointing, but when Amazon added HBO Go and they added the interface for signing into hotel Internet, it became the greatest thing on earth. I'm a flight attendant and its saved me so many nights of mindlessly watching the Weather Channel or HGTV.  I highly recommend this for frequent travelers.", "verified": false, "helpfulness": "0/0", "author": "Deborah Goldin"}, {"rating": 2.0, "review": "We have great signal in our house and it doesn't seem to make a difference if it's been on for a long time or just turned it on it glitches constantly, sometimes we can watch movies with no issues and other times it doesn't work at all... very frustrating", "verified": true, "helpfulness": "0/0", "author": "Kat"}]