[{"rating": 3.0, "review": "I am still having problems with the amazon fire stick. This is the second one sent to me after the first one didn't work well.I believe it gets too hot, so now I have taken to unplugging it from cord and TV and letting it cool down totally before trying to use it again. Often it pauses and you get that annoying circle thing (loading!).  Can't seem to watch it 2 days in a row without those problems. Glad I paid only $19.99 for it as a promotion instead of $39.99. On the plus side I like the offerings that are free, but I hesitate to purchase a netflix subscription until the stick works 100% of the time.", "verified": true, "helpfulness": "1/1", "author": "julie g. cooper \"highland lass\""}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Chris Simmons"}, {"rating": 4.0, "review": "I really like the Amazon stick,it's very easy to use. It offers many movies and tv shows. It arrived early and packed very well.", "verified": true, "helpfulness": "0/0", "author": "Randee Osgood \"book queen\""}, {"rating": 4.0, "review": "Still test driving, but,. liking what I see so far.", "verified": true, "helpfulness": "0/0", "author": "Christopher Smith"}, {"rating": 4.0, "review": "Be warned - HBO Go sucks. I have FIOS 75/75 mbps up and down. Lagging big time which is really frustrating.", "verified": true, "helpfulness": "0/0", "author": "SC"}, {"rating": 3.0, "review": "I love the fire stick BUT my TV screen will just blackout when watching it ALOT. It has potential to be awesome, but this is very annoying, and has become more annoying in time. That is why I'm writing a review! Anyone else have this problem that could offer me any tips or resolutions?", "verified": true, "helpfulness": "1/1", "author": "shanda hoffman"}, {"rating": 4.0, "review": "Came very fast .Have to download apps to use.Has mostly Prime movies ..have to join to get.Like the  photo and music capability..Has some nice screensavers", "verified": true, "helpfulness": "0/0", "author": "Arthur Renna"}, {"rating": 3.0, "review": "I would love this except for one thing. It seems it needs an excellent wireless connection to work properly. My wireless service is mediocre (I have a great router, just crappy comcast) It does not have a lot of buffering, so it stops and pauses a lot. I mean, a lot-a lot. Unless you have a fast and steady wireless service, I recommend getting a more powerful box with memory room for buffering.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick was so easy to install  We love it!  So easy to use with Amazon Prime as well!", "verified": true, "helpfulness": "0/0", "author": "Stephen Ward"}, {"rating": 5.0, "review": "I was very satisfied with my Fire TV Stick. It was very easy to hook up now enjoying Netflix..", "verified": true, "helpfulness": "0/0", "author": "Jean Spearman"}]