[{"rating": 5.0, "review": "Work great for streaming Netflix, Hulu.  Remote control makes it way better than Chomecast", "verified": true, "helpfulness": "0/0", "author": "HTran \"HTranMD\""}, {"rating": 5.0, "review": "Best money I have spent this year.  The Fire TV Stick is way better than Chromcast.  Good job \"Amazon\"", "verified": true, "helpfulness": "0/0", "author": "steve mccord"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "JamminSpacey"}, {"rating": 5.0, "review": "Love this!  I dropped cable and never going back! I'm able to watch all the shows I was watching on cable at a minimal price.  Quality is great, options for TV shows or movies are great, especially for kids.  Easy set up, remote is user friendly.", "verified": true, "helpfulness": "0/0", "author": "Angela E"}, {"rating": 4.0, "review": "Love it.Waiting until football season though to see how well the games will stream..Then might hate it.", "verified": true, "helpfulness": "0/0", "author": "Krista Ruth"}, {"rating": 1.0, "review": "I purchased the device to use in hotel rooms. The meager instructions say simply to plug in the device and begin using it. I tested it on my home system and it worked nicely. However, when I tried it on a hotel system it did not work at all. I was able to insert it into the appropriate tv port but nothing happened. The tv operated the same as before with no new access to Internet . I suspect the hotel tv system was designed to prevent guests from by-passing their pay per view system.", "verified": true, "helpfulness": "0/1", "author": "Curt"}, {"rating": 5.0, "review": "How did we live without this??? Ready to get rid of our satellite!", "verified": true, "helpfulness": "0/1", "author": "Andrea Sergent"}, {"rating": 2.0, "review": "I would like to trade in the fire Stick for my old Roku. With the Fire Stick I can access  programs only that Amazon allows. Otherwise I have to pay to watch programs that the Roku allowed for free. I would never recommend it to anybody.", "verified": true, "helpfulness": "1/2", "author": "Ricegirl"}, {"rating": 4.0, "review": "I really enjoy the amazon fire stick, however, my hulu always lag. I know it isn't amazon's fault but does anyone has that issue?", "verified": false, "helpfulness": "0/0", "author": "Raynelda Salters"}, {"rating": 4.0, "review": "Worked really good for first four months and but now it freezes every few minutes and needs to be re-booted over and over. I paid only 20$ so no regrets.", "verified": true, "helpfulness": "1/1", "author": "Moiz Bohra"}]