[{"rating": 5.0, "review": "Really great unit!!! Easy setup and very user friendly", "verified": true, "helpfulness": "0/0", "author": "Roger A. N Robotham"}, {"rating": 3.0, "review": "I bought the Fire TV Stick when it was on sale for Prime members.  I was really really stoked to be able to watch Showtime Anytime AND HBO Go on my TV.  I was using Chromecast for about a year before I made the switch, and I'm ready to go back.  I attempted to set up Showtime, only to find out I can't use my Xfinity login.  This is probably Comcast's fault, not Amazon's, but now I cannot use this device for the sole reason I bought it!  HBO Go is STILL not available, and when it is, who knows if I will be able to use it with Xfinity.  I have to hook the Chromecast back up to watch this season of Girls, which is really disappointing.Overall, the GUI is OK (not great, but it's not BAD) and the performance is alright.  I hate the android remote app though.It does its job with Prime, Netflix, and Hulu, which means the device works for me 9 or so months out of the year (when I don't need to use Showtime or HBO on it), but I'm still disappointed.", "verified": true, "helpfulness": "1/1", "author": "Lizz"}, {"rating": 5.0, "review": "Works great!  Almost went out to buy a TV with WiFi.Works like Roku only cheaper!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Nice product just having an issue with it losing connection occasionally to wifi when all other devices that use wifi aren't having issues.", "verified": true, "helpfulness": "0/0", "author": "shawn bollinger"}, {"rating": 4.0, "review": "Great product. A little glitchy when streaming from your smart phone through the YouTube app. Have to restart with every new video launch.", "verified": true, "helpfulness": "0/0", "author": "MJO \"MJO\""}, {"rating": 3.0, "review": "Great if you got it for $19 but only so-so if you had to pay full price for it. I find that most everything I like on it cost something for it. I had a roku that crapped out on me but while it was working it was much more user friendly. My chromecast is very good but limited in it's usefulness.", "verified": true, "helpfulness": "0/0", "author": "Big Ben"}, {"rating": 4.0, "review": "I really love the Fire TV stick.  I have been able to catch up on shows and discover some new ones.  I do wish they had HBO Go on the list and more current \"free\" movies for Prime.", "verified": true, "helpfulness": "0/0", "author": "LindaN"}, {"rating": 3.0, "review": "Luckily i got it really inexpensivly, Roku is more intuitive", "verified": true, "helpfulness": "0/0", "author": "Devin Garrity Jr."}, {"rating": 5.0, "review": "Great deal of $19.", "verified": true, "helpfulness": "0/0", "author": "Rdwo"}, {"rating": 4.0, "review": "Better than the FIreTV IMHO. Does the trick, we mainly uses it for Plex, but at the price, it's well worth the investment to make your TV smart.Sometimes it stutters for no reason even when the rest of the network is working smoothly.", "verified": true, "helpfulness": "0/0", "author": "M. Buckman \"Internet Producer\""}]