[{"rating": 5.0, "review": "Works great. My smart tv isn't all that smart and looses connection. Now that we've got the fire stick I don't have to worry, it always works.", "verified": true, "helpfulness": "0/0", "author": "Robyn Schlabach"}, {"rating": 5.0, "review": "Easy to use. Great addition to media room.", "verified": true, "helpfulness": "0/0", "author": "C. Miller"}, {"rating": 5.0, "review": "I really love this thing. At first I was having a few issues with it and I still have a few qualms with the design. When the internet hangs or Netflix decides not to buffer, I have to unplug the stick and plug it back in. Syncing with my Amazon music took FOREVER for some reason. I don't like that I can't just plug the usb into the TV usb port for power. I am assuming it's that TV just not made to power that jack but it would shave a cord off of my power strip if I didn't have to plug the TV stick in. Oh well.I love that it goes to screensaver if idle too long and that I can define a library from my Amazon cloud. The interface is easy to navigate. I love having access to my Amazon cloud. I think it would be cool to set some kind of visualization other than screen saver where the music is concerned.Overall I am satisfied. The price for prime members at 20 bucks was just too good to pass up. I'd been wanting to try Roku or Google but the cost wasn't worth it when I can access all the same stuff from my computer and display on my TV.", "verified": true, "helpfulness": "0/0", "author": "ttbloodlusttt \"Angie\""}, {"rating": 5.0, "review": "But need more Apps", "verified": true, "helpfulness": "0/0", "author": "Fidel Francisco Aquino"}, {"rating": 5.0, "review": "Works just as stated. It installed easily and works well on every site I've tried streaming from.", "verified": true, "helpfulness": "0/0", "author": "Abby Normal"}, {"rating": 5.0, "review": "Very easy to use; I love it!!", "verified": true, "helpfulness": "0/0", "author": "C. Santos"}, {"rating": 5.0, "review": "Love it, it was so easy to hook up and use plus everything needed was in the box, so cool", "verified": true, "helpfulness": "0/0", "author": "Edwin Burkhart"}, {"rating": 2.0, "review": "When I was considering buying the Fire TV Stick, my usage model was that I would be able to take it with me on the road and get streaming in hotels.  I did a chat session with an Amazon pre-sales rep and he assured me that it worked.  I asked about how the Stick connects to hotel WIFI since they almost all require you to accept terms on a website and enter some information.  He said the WIFI login screen would come up on the TV and you enter information using the remote.  That has never happened and I had not yet been able to connect to a hotel WIFI so I reached out this time and got through the second level tech support.It turns out that this is not true and the Stick doesn't work if you have to enter information on a webpage to connect to the network.  So, it really only works on your home network and just about no hotels.  Getting Amazon content at home is relatively easy and I have numerous devices that already provide me with that capability to this is a useless device for my needs.  Too bad - it would have been great if it worked as their support people described when I was considering buying.", "verified": true, "helpfulness": "4/4", "author": "Marc Dulude"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "tracey cox"}, {"rating": 5.0, "review": "The quality of pictures through Fire Stick is amazing .. much better than chromecast. The picture quality is also better than my Sony home theater, truly high definition.", "verified": true, "helpfulness": "1/1", "author": "MB"}]