[{"rating": 5.0, "review": "Best purchase ever! I pay 1/3 what my cable used to be and I get customized content. The set up was simple and the picture is great.", "verified": true, "helpfulness": "0/1", "author": "john hubbard"}, {"rating": 5.0, "review": "Love it, had Chromecast already. The interface is nice, very easy to navigate. The remote is a huge plus. I would say this is better than Chromcast due to that interface and the integration of Prime movies, tv, etc. Only function I like from Chromecast that I miss is being able to stream content from my phone directly to the TV. Still, very happy with the purchase", "verified": true, "helpfulness": "0/1", "author": "J. Forsythe"}, {"rating": 5.0, "review": "Hello i am really empress what this little device can do. Very happy and satisfied.Thank you", "verified": true, "helpfulness": "0/1", "author": "george donate"}, {"rating": 5.0, "review": "love my fire tv stick, have 2 because we use them so often, haven't had any issues", "verified": true, "helpfulness": "0/1", "author": "aholly"}, {"rating": 5.0, "review": "I love it it is easy to use", "verified": true, "helpfulness": "0/1", "author": "debby howard"}, {"rating": 5.0, "review": "No complaints. Works great.", "verified": true, "helpfulness": "0/1", "author": "Terri D. Crosetti"}, {"rating": 4.0, "review": "A lot in a small package. We really like being able to sync our Fire phone and Fire tablet with the television screen to view pictures we've taken. I would have given 5 stars if it had On and Off on the remote. That would have worked better with my multi-HDMI device setup.", "verified": true, "helpfulness": "0/1", "author": "rtclark"}, {"rating": 5.0, "review": "Most excellent amazing what you can do with this", "verified": true, "helpfulness": "0/1", "author": "josephine m. hill"}, {"rating": 3.0, "review": "wifi connection seems to suffer from size.  It lacks vudu which is kind of big for me.It does seem to perform OK.Aside from that its actually not bad.  Definitely worth taking with you on work trips", "verified": true, "helpfulness": "0/1", "author": "Henry Torres"}, {"rating": 1.0, "review": "It does not work. Seven days with the same problem. Lousy product. Poor customer service. Harmful and unpleasant experience. NOT RECOMMENDED.", "verified": true, "helpfulness": "1/3", "author": "Ar"}]