[{"rating": 4.0, "review": "I like the Amazon TV I bought at the same time but for less than half the price, this is a steal for TVs that don't see the same kind of usage.", "verified": true, "helpfulness": "0/0", "author": "Ops Guy"}, {"rating": 1.0, "review": "Netflix and sling TV are barely usable. There are constant buffer underruns. Netflix runs fine on the chromecast.", "verified": true, "helpfulness": "0/0", "author": "J. Chang"}, {"rating": 4.0, "review": "Easy to install and use. You have to download each App tho that u want and make sure ur 1 click settings are set up on your Amazon account. My 8 yr old uses it.", "verified": true, "helpfulness": "0/0", "author": "Candace"}, {"rating": 4.0, "review": "It works amazin!", "verified": true, "helpfulness": "0/0", "author": "Amit"}, {"rating": 5.0, "review": "I love my Fire TV stick. I have not watched anything other than my prime tv and movies since I got it.", "verified": true, "helpfulness": "0/0", "author": "gustafason"}, {"rating": 5.0, "review": "Works like a charm", "verified": true, "helpfulness": "0/0", "author": "E. Sostack"}, {"rating": 2.0, "review": "May allow you to view over 200,000 movies and tv episodes as it states on box,problem is you need to subscribe or rent to see probably 199,000 of them. Works great just not happy with the lack of fine print explaining the issues with it.", "verified": true, "helpfulness": "0/0", "author": "Bob Thomas"}, {"rating": 4.0, "review": "I love that I can move this TV to TV and not have to reset everything!  The only thing I find annoying is that the stick has to not only be plugged into a TV, but also a power source :(  I guess I missed that in the description.  I thought it would just pull its power from the TV.", "verified": true, "helpfulness": "0/0", "author": "Candice S"}, {"rating": 1.0, "review": "setup is easy/quick and intuitive. However buffering is a killer. Every 30 seconds it pauses for at least a minute sometimes longer. Impossible to watch anything. Roku works much better", "verified": true, "helpfulness": "0/0", "author": "Kate H"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "Norris Harvey"}]