[{"rating": 5.0, "review": "This is so easy to install ! I compared lots of streaming devices and decided on the Firestick because it's small and quickly installs . I have no complaints about the remote it works well also.", "verified": true, "helpfulness": "0/0", "author": "G.MA"}, {"rating": 5.0, "review": "This is so much easier than chromecast.  I am really enjoying the prime selections.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Stupidly simple to install and initialize, great quality, no buffering interruptions", "verified": true, "helpfulness": "0/0", "author": "Brad Snyder"}, {"rating": 5.0, "review": "I had to purchase a WiFi Extender to get the good signal to my TV to work but once I did it performs great.", "verified": true, "helpfulness": "0/0", "author": "Jim Quinn"}, {"rating": 4.0, "review": "The fire stick is smooth. I also have an older Roku, and frankly the Roku is easier to operate for two reasons. 1) you can read the font, whereas the Fire Stick has a very small light font and you can not change that. 2) The Firestick app is a little harder to backtrack on, ie: go back and tell me what I just watched. I previously tried the ChromeCast and I have to say that is my least favorite. In the Firestick, as in Roku you can pause and go back scenes using the remote, however in the awful google version you can not do this. Firestick is much less expensive than the Roku, so I'm very happy with this purchase. I only wish that Amazon would understand that some people wear glasses and dont want to wear them in bed while watching tv.", "verified": true, "helpfulness": "0/0", "author": "Mark Twain IV \"Mark Twain IV\""}, {"rating": 5.0, "review": "We have both an Amazon Fire TV, and this Amazon Fire TV stick. If you have a Prime membership, you are doing yourself a disservice by not owning one of these products. The amount of content available to Prime members is astounding. The layout is a bit wonky and not as intuitive as other platforms, but you get used to it.", "verified": true, "helpfulness": "0/0", "author": "KP"}, {"rating": 5.0, "review": "Fantastic....should have bought it sooner", "verified": true, "helpfulness": "0/0", "author": "Stephanie Houchins"}, {"rating": 4.0, "review": "the firestick works well and the selctions are great, but our internet speed turned out to be to slow to make this a goodchoice", "verified": true, "helpfulness": "0/0", "author": "Retired Army"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "beverly woodward"}, {"rating": 5.0, "review": "I'm new to the advances in TV technology...never had cable in my life and after 25 years of living on my own, I recently decided to get wireless internet...I know, right? I can't tell you enough how amazed I am at the diverseness of this device and how easy it is to use. I'm simply amazed at all the programming and wonderful music that is available for FREE through the amazon prime service! Definitely worth the $99 yearly fee and in my opinion beats -any cable service. Thoroughly pleased and would highly recommend to anyone out there who doesn't have or want cable, but is interested in streaming a plethora of TV shows, movies and music. Yes! Yes! Yes!", "verified": true, "helpfulness": "0/0", "author": "Laura Polhill"}]