[{"rating": 2.0, "review": "I'm not happy with it. It stopped working", "verified": true, "helpfulness": "0/0", "author": "terreva arrington"}, {"rating": 5.0, "review": "Awesome product with Amazon Prime! And lots of Closed Captioning for hearing impaired people like me!", "verified": true, "helpfulness": "0/0", "author": "Courtney M."}, {"rating": 3.0, "review": "Freezes more than the amazon box. It had a glitch (acted jittery 2-3 times in one episode). It doesnt last long but still the program is running as smooth as our amazon box. it is still convienient for our guest room. We only tested it out for a day or two. So we'll see how it holds up. I was lucky enough to get it at the promotional price.", "verified": true, "helpfulness": "0/0", "author": "Amazonian"}, {"rating": 5.0, "review": "Excellent.. Very easy to install and I am not a tech person.  Very good purchase at a good price.", "verified": true, "helpfulness": "0/0", "author": "Margaret Ahearn"}, {"rating": 5.0, "review": "Love my Firestick!  What more can I say?", "verified": true, "helpfulness": "0/0", "author": "Mamapajama \"often confused\""}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "laura crossman"}, {"rating": 5.0, "review": "I absolutely LOVE my Fire TV Stick!  I have a Chromecast and a Roku as well, but the Fire TV Stick is the best one.  The best part is that it keeps getting better as they add new apps.  I honestly never thought I would care about the games on this, but there are some excellent party games (Jackbox Games) that I put on whenever we have people over and they are a big hit! The only thing I'm missing is my Disney Anywhere movies and Spike TV (for Lip Sync Battle), if it had those, I wouldn't need any other devices!", "verified": true, "helpfulness": "0/0", "author": "Craig Pettitt \"technophile\""}, {"rating": 5.0, "review": "love it..easy to use", "verified": true, "helpfulness": "0/0", "author": "Melanie Pendleton"}, {"rating": 2.0, "review": "It loses my internet connection before I can even pick something to watch.  I haven't been able to use it at all.  My internet is very solid and I don't have problems with it.  It is up and running each time the Fire TV loses track of it.", "verified": true, "helpfulness": "0/0", "author": "P. Plante"}, {"rating": 4.0, "review": "All is well", "verified": true, "helpfulness": "0/0", "author": "Partick M McKenzie"}]