[{"rating": 4.0, "review": "Overall happy with the Fire TV Stick. Plugged in in and was ready to go. We have a slower DSL internet connection, but it still works pretty good. If it is too slow I just pause a little and let it buffer.", "verified": true, "helpfulness": "0/0", "author": "Will in Michigan"}, {"rating": 5.0, "review": "I really like being able to watch my movies on the TV instead of the computer/Kindle/phone screen.  We mainly uses this to watch Amazon Prime Video and Netflix, although it has many more features/programs available.  Extremely easy set up and very easy to use.  The first time I let it sit idle, I was surprised to see the beautiful \"screen savers\".  Very good buy, very good price.", "verified": true, "helpfulness": "0/0", "author": "Meredith"}, {"rating": 5.0, "review": "Great!!! Going to get 2-3 more.", "verified": true, "helpfulness": "0/0", "author": "Steve F."}, {"rating": 1.0, "review": "I give up with this! can't see any app in the library, there's no way to download nothing (my connection is ok, my one click is working) How I'm supposed to watch Netflix Hulu HBO ????", "verified": false, "helpfulness": "1/1", "author": "Oliver"}, {"rating": 5.0, "review": "overall, works great and is very easy to use! I would recommend this to every one.  I will add that our son lost our fire stick remote.  I was so thankful when I found you can order a replacement.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 4.0, "review": "Much easier to use then other products.  Even the picture seems better.", "verified": true, "helpfulness": "0/0", "author": "KAT"}, {"rating": 5.0, "review": "Wow.  What a great product for the price!  I love my Fire TV stick.  I wasn't sure I wanted to get one due to some of the negative reviews on here, but decided to purchase it anyway. I watch programs on this all the time since I got rid of my cable TV.  However, you do have to have a pretty good internet speed to stream the programs.  I do get freezes and blips sometimes, but largely due to the internet. The Fire App they have for smart phones works great--you can use that to say what program you want, and it will find it from the voice recognition software.  I am quite impressed.  Great product, Amazon!", "verified": true, "helpfulness": "1/1", "author": "Cocoa's Mom"}, {"rating": 3.0, "review": "I just bought it. It is working. However, it gets hot even after a few minutes of use.", "verified": true, "helpfulness": "0/0", "author": "Mama \"Mama\""}, {"rating": 1.0, "review": "I'm amazed that Amazon would allow Sling TV to tarnish your image. I thought Sling TV would actually work better on a fire stick but I was wrong. I bought the fire stick primarily to convert my dumb HDTV to a smart one and it works well. I believed that Amazon has a good reputation and they work with their supplies to deliver the best product. I was depending on the fire stick to deliver Sling TV without disruptions because of their association with you. Netflicks delivers movies without issues why can't Sling TV deliver?", "verified": true, "helpfulness": "0/0", "author": "Tom Marshall"}, {"rating": 5.0, "review": "LOVE AMAZONE PRIME AND FIRE STICKS ARE EASY TO USE.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]