[{"rating": 5.0, "review": "Couldn't wait for the Directv contract to end.  This is awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Wilford Schreiber"}, {"rating": 5.0, "review": "Good bye cable TV!!  I went from no choices to too many choices at less than half the cost.  If you miss local & network cable programming, buy the discounted antenna and subscribe to an app like sling", "verified": true, "helpfulness": "0/0", "author": "Rich Fall"}, {"rating": 5.0, "review": "It works very well! Fast and simple! Great buy!", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "iam not a gamer so this does every thing I wanted", "verified": true, "helpfulness": "0/0", "author": "Larry Morley Jr."}, {"rating": 5.0, "review": "I have the chrome and now the fire stick.  This is by far the better of the two.  I don't have to control the tv with my phone or laptop.  I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Mark H. Hollingsworth"}, {"rating": 5.0, "review": "Easy hook up.  Great little streaming device", "verified": true, "helpfulness": "0/0", "author": "mary mendez"}, {"rating": 5.0, "review": "I love it. Its very easily set up and easy work. I actually bought two. One for my bedroom and one for my son's bedroom.", "verified": true, "helpfulness": "0/0", "author": "Holly Lomprez"}, {"rating": 5.0, "review": "put xbmc on there and wow....", "verified": true, "helpfulness": "0/0", "author": "Hindean"}, {"rating": 3.0, "review": "You still need a cable provider for most apps that are advertised.", "verified": true, "helpfulness": "0/2", "author": "Kristin"}, {"rating": 4.0, "review": "While it met most of my expectations I am somewhat disappointed with the apps that are not compatible with it and with the frequent buffering even with High Speed internet and cable. APP like Youtube tned to freeze and I find that the unit gets very hot and has to be unplugged, cooled, and rebooted often. I am thinking of moving up to the FireTV.", "verified": true, "helpfulness": "0/0", "author": "Jackio"}]