[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 4.0, "review": "I have both a Chromecast and Fire TV stick, and I honestly prefer my Chromecast over the Fire Stick.  Chromecast has a much more intuitive and integrated user interface, which allows me to launch from in the apps themselves and not Amazon's Fire TV app.  I don't care for the Fire TV app, it is clunky and hard to use (do I swipe left to right or right to left to make the selection move right???).  The little track pad in the Fire TV app would be much better as a D-Pad instead.  Then I could just arrow up and down, left and right as many \"clicks\" as I want.  I guess, let me pick if I want the touchpad or the d-pad.  Give me the d-pad option and I'd rate it 4.5 stars.One big advantage of the Fire Stick over Chromecast: Prime Instant Video (90% of the reason I got the Fire Stick).Both work great, just wish Amazon didn't force me to use their app to watch videos or do anything else.", "verified": true, "helpfulness": "0/0", "author": "Adam KM"}, {"rating": 5.0, "review": "Works great! I love that I can watch Amazon Instant Video, YouTube, Netflix, Flixster, and more on our tv--instead of on the iPad. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Shannon Hunsberger"}, {"rating": 5.0, "review": "With the Fire TV Stick and Roku the cable and Netflix ties will be history.", "verified": true, "helpfulness": "0/0", "author": "moc"}, {"rating": 5.0, "review": "This is a great product and much better than others that require a computer hookup. No issues so far. Hookup was easy and it is speedy over my internet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Honestly, within minutes of connecting to my WIFI it commenced to disconnect from it...over and over and over again.If my iphone 6 disconnected, then it would connect easier, but still was slow.My media PC streams movies and live TV flawlessly, so I am 100% confident it's not a network speed issue.", "verified": true, "helpfulness": "0/0", "author": "Clint"}, {"rating": 5.0, "review": "Great buy, this basically turned my old tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 4.0, "review": "Everybody, if you are looking for a live TV feature, it doesn't come with the box. Go to the App Store and download Sling TV. It's basically like Netflix, except it's live TV. It is $20 a month, which is the only downside.", "verified": true, "helpfulness": "0/0", "author": "Drake Vostrejs"}, {"rating": 1.0, "review": "It is taking wayyyy too long to ship I ordered this product 3 days ago", "verified": true, "helpfulness": "0/0", "author": "kaleb"}, {"rating": 1.0, "review": "DIRECT TV subscribers BEWARE!  Cannot activate premium Fire TV Apps for easy viewing.  Amazon Fire TV does not recognize DIRECT TV customers. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Todd Carlin"}]