[{"rating": 4.0, "review": "Needs a usb port then I would be a great buy.", "verified": true, "helpfulness": "0/0", "author": "Jason W."}, {"rating": 5.0, "review": "Great product!!! Use on any TV and take it with you on trips.", "verified": true, "helpfulness": "0/0", "author": "Septy"}, {"rating": 5.0, "review": "I really like this thing. I also have the Google one, a ROKU and AppleTV. Personally I found the the Fire TV Stick the easiest to set up, and the interface is nice. I particularly like watching YouTube videos with it. Of course, it's also good with Amazon Prime -- no surprise there. Though I'm not a big game player, I messed around with one of the Slot Machine apps and it was pretty fun. It's got a lot of entertainment packed into a tiny device.", "verified": true, "helpfulness": "0/0", "author": "Tony Caravan"}, {"rating": 5.0, "review": "Better than Chromecast!  Im buying another stick to replace my chromecast that only sometimes works", "verified": true, "helpfulness": "0/0", "author": "Cel Lud"}, {"rating": 5.0, "review": "Chrome Cast has one trick, broadcast on you TV what you have on your phone or tablet.  The Fire Stick has tons of features, no phone or tablet required AND for about the same price!", "verified": true, "helpfulness": "0/0", "author": "CraigBag"}, {"rating": 4.0, "review": "It works great. If only the direct streaming from Apple and android products would be easier!", "verified": true, "helpfulness": "0/0", "author": "BELEN H."}, {"rating": 5.0, "review": "Very nice device that enables you to become independent of cable companies at a very reasonable price. It has all the power you'll need.", "verified": true, "helpfulness": "0/0", "author": "Meskerem Gebretsadik"}, {"rating": 1.0, "review": "These did not work reliably on any of our TVs.  They kept dropping the WIFI signal.  We tried talking with the internet provider to boost our speed, moving the modem and router, and buying a signal amplifier.  After wasting a week, we replaced them with ROKU boxes and they work with no problem.  Our Apple TV box also works with no problem.", "verified": false, "helpfulness": "0/0", "author": "mp5464"}, {"rating": 5.0, "review": "Everything I could ever want in a TV just was made possible by my fire stick", "verified": true, "helpfulness": "0/0", "author": "Philip"}, {"rating": 5.0, "review": "Easy to set up. I use it for Netflix and Pandora only but so far it works great. Just plug it in and go. Exactly what I wanted!", "verified": true, "helpfulness": "0/0", "author": "Alayna Gillespie"}]