[{"rating": 5.0, "review": "I love how easy the Amazon Fire TV Stick is to use.  It is very intuitive and just a delight!  I have really enjoyed all of the apps that are available and I love that the apps stay current and the programming is quite entertaining.  I love having so many options!", "verified": true, "helpfulness": "0/0", "author": "Infinity"}, {"rating": 4.0, "review": "I had put in a return request on the Fire TV Stick, with a scathing complaint about its inability to hold a wifi connection that it rated Very Good one second, nonexistent the next. I worked my Internet provider over pretty hard (and there were issues there as well), but still no joy with the Fire Stick. Finally, in sheer exasperation with the whole situation, I took the advice of one of the Verizon techs - try a wifi range extender! So I spent another $35, and guess what - now the Fire Stick works like a champ. I'm not giving 5 stars, because I feel Amazon has been less than forthcoming in not warning that it's likely some users will need to double their investment before getting satisfactory performance. That said, I also found the search function somewhat lacking. I went looking for Sling Player for Fire TV, and got no results on the search. Really, Amazon? It was only upon lengthy clicking through the Apps menu that I finally found it. Once found, it works great. So I cancelled my return request and post this caveat for future buyers.", "verified": true, "helpfulness": "0/0", "author": "Karen M. Nash"}, {"rating": 5.0, "review": "This gift was much appreciated", "verified": true, "helpfulness": "0/0", "author": "cliff b"}, {"rating": 2.0, "review": "I will probably send this product back. It is slow and it glitches all the time. I had the Apple TV before this, and my 2011 version of the Apple TV is exponentially faster. That is saying a ton, that a 4 year old device is way faster than a brand new one. This was a complete waste of money. I'm sure the fire TV is a lot better, but the stick is worthless. You might as well get the Chromecast for $10 cheaper.", "verified": true, "helpfulness": "0/0", "author": "Dylan Barnard"}, {"rating": 5.0, "review": "I love it. Great buy.", "verified": false, "helpfulness": "0/0", "author": "midnight1"}, {"rating": 3.0, "review": "I am sure we would like it better but we have slow internet.", "verified": true, "helpfulness": "0/0", "author": "LaLa"}, {"rating": 5.0, "review": "Nice and simple!!", "verified": true, "helpfulness": "0/0", "author": "Jaime González Canet"}, {"rating": 4.0, "review": "There are a few issues I have with the Firestick. Most involve the interface and the inability to create what amounts to a 'favorite' menu so you don't have to scroll through so many things. It's hard to complain about the functionality of the unit though - it does everything well. Although we are Prime members we use the Fire Stick mostly for Sling.If Amazon would allow Kodi to be installed via the FireTV apps store, it would be a complete unit. But for now, Kodi must be sideloaded, just as it is in the Fire TV box, and found through a rather convoluted menu process. IF Kodi were easy to use with this device it would be a complete product and we'd give it 5 stars. For now, we have to use a media server to interface with Kodi and our media storage.", "verified": true, "helpfulness": "0/0", "author": "A. Ferrin"}, {"rating": 1.0, "review": "not good.", "verified": true, "helpfulness": "0/1", "author": "Richard"}, {"rating": 5.0, "review": "Fantastic, plug and play. Great reception.", "verified": true, "helpfulness": "0/0", "author": "Cathy H."}]