[{"rating": 2.0, "review": "Fun to use, but often lose signal... Not compatible with crunchyroll.com app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Still trying to determine if it is worth it. The streaming sometimes falls down in the program or movie pauses. sometimes it's only a couple times during the program and sometimes it several times right in a row. It can get very annoying. We have the best time warner Internet service, so thst should not be the Problem.", "verified": false, "helpfulness": "0/0", "author": "Michelle D'Angelo"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Paula Stewart"}, {"rating": 4.0, "review": "This is the only way we watch movies at home, now.  Having the app on our smart phones allows us to play multiple player games with ease and use voice search as well.  Even if you type a search, it's so much faster than other programs.", "verified": true, "helpfulness": "0/0", "author": "Beeger"}, {"rating": 5.0, "review": "I had so many problems loading it the first day i gave up. Well kind of I contacted customer support and they did some trouble shooting and was not able to fix it. So they sent me a replacement and the new one works great. Been streaming everything. Very easy to setup when you have a working one :)", "verified": true, "helpfulness": "0/0", "author": "Carrie Lyn"}, {"rating": 5.0, "review": "Fast, easy, minimalist approach to home entertainment.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "easy setup, nice price (more useful than the chromecast unit i own) netflix, hulu, pandora as well as amazon prime instant video works great via my wireless router ... good price", "verified": true, "helpfulness": "0/0", "author": "Leanne Solomon"}, {"rating": 4.0, "review": "Today was the first time this item was used. Somehow there was a problem with \"band width. I was quite pleased with the many choices of films and the ease of use once I installed the WI-FI Range Extender and was acclimated to maneuvering my TV to the proper position to be able to use it. I do  think that the instruction book  I purchased should be included in the main package. We all are not as adaptable as the 12 year old child seems to be with electronics.", "verified": true, "helpfulness": "0/0", "author": "bud dixon"}, {"rating": 4.0, "review": "Great I Love it still learning all its uses", "verified": true, "helpfulness": "0/0", "author": "Tori T."}, {"rating": 4.0, "review": "I gave up \"regular TV\", cable or satellite, some time back. I began with Apple TV which I still use, though it offers far less, I have a Roku streaming projector, which is much fun watching movies on the wall and a nice selection of app. Yet the remote with the Roku is absolutely clunky, difficult to use. The Amazon fire stick wins out. I got mine for 19.99 on a promotion for Prime members and really expected it to be shoddy  instead, if is, hands down, the best streaming device. The remote is smooth and there are many apps to choose from. Once you realize there are worlds of viewing choices from Netflix, Amazon, and apps that offer more movies, Internet channels (the little ones enjoy the cartoon channel on the Pluto app) --there is no reason to continue paying pathetic satellite or cable bills. I would rather use my money for something important like helping to provide clean drinking water to children in Uganda and elsewhere. Thanks, Amazon for a winner--now offer it on sale again. I would purchase for my older kids.", "verified": true, "helpfulness": "0/0", "author": "kargoforth \"Perfection, in a Christian sense, means becoming mature enough to give ourselves to others.\""}]