[{"rating": 4.0, "review": "Works quite well and was easy to set-up.", "verified": true, "helpfulness": "0/0", "author": "EJK"}, {"rating": 5.0, "review": "This device made the whole process of streaming programs as simple as using a normal remote. Prior to using the Fire stick I avoided the complicated process of going online and attempting the slow process of accessing programs. Great buy and even greater tool for the less tech savvy folks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome product! I have been very pleased so far. Great streaming video and many fun features!", "verified": true, "helpfulness": "0/0", "author": "Ryan Dunham"}, {"rating": 4.0, "review": "Pretty good...some connectivity issues...using the Mission Cable.So far I am happy with it.Good price point.", "verified": true, "helpfulness": "0/0", "author": "Michael Weiss"}, {"rating": 5.0, "review": "Now my TV is like a SMART TV. Easy to use, easy to install. First time requires some time to load apps but then it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Jorge R"}, {"rating": 5.0, "review": "Absolutely love my fire stick", "verified": true, "helpfulness": "0/0", "author": "TAYLOR"}, {"rating": 2.0, "review": "Received the fire stick almost two weeks after ordering.  We have trouble maintaining a good connection with the internet even though we have wireless and the fire stick is close to the modem. It also lists many good programs that are available but cannot receive them unless we purchase more through our cable provider.  If I had to do it all over again, I would not purchase.", "verified": true, "helpfulness": "0/0", "author": "Debra"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "Raquel Ransom"}, {"rating": 5.0, "review": "this is great. getting caught up on TV shows and movies.", "verified": true, "helpfulness": "0/0", "author": "lag"}, {"rating": 5.0, "review": "Needed this to watch Netflix on our TV.  Haven't done that yet but watched a couple of Amazon Prime shows.", "verified": true, "helpfulness": "0/0", "author": "Troy B."}]