[{"rating": 5.0, "review": "like it", "verified": true, "helpfulness": "0/0", "author": "Ewald Landmann"}, {"rating": 5.0, "review": "Great! Love to watch Netflix on here! I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Mrs. Gable"}, {"rating": 5.0, "review": "I love this thing! It's so easy to use, my 4 year old used it the most. We recently took it on our road trip and it connected just fine with the hotels wifi. It is so much faster and better than our chrome cast. We have never had a problem with it continually loading and buffering like we do with the chrome cast. I would recommend it for everyone.", "verified": false, "helpfulness": "1/1", "author": "W. Arnold"}, {"rating": 4.0, "review": "Impressive product. Super easy to set up. The hardest part was typing in my wifi password. The UX is good and remote does its job. I purchased this with Sling TV service and the whole experience is really good with Fire TV - watching channels like ESPN, HGTV, etc. streaming smoothly in high definition, feels just like cable. On my PC Sling TV did not work quite so smoothly. What I loved most though is the ability to play Amazon Prime music in the background and view slideshow of my photos from Amazon Cloud Storage (which is free for photos to boot). Really nice!Edit 2/28: Unfortunately the screen mirroring on Fire TV stick does not work with Windows 8.1 nor Windows Phone. Unfortunate! It would have been really good. Demoted to 4 stars.", "verified": true, "helpfulness": "1/1", "author": "T. Alex"}, {"rating": 4.0, "review": "So far the Fire TV Stick is all that I expected it to be but the learning curve is greater that I thought it would be, but sure am having a lot of fun learning all of the curves, in and outs that there are with this Fire TV Stick.  Have found that you do not want to leave it plugged in to power when not in use.  The stick seems to get warm.", "verified": true, "helpfulness": "1/1", "author": "Ken Reichert"}, {"rating": 4.0, "review": "Works well,  some glitching. I only have Internet,  no cable TV. Using Amazon Prime makes it even better, because it increases your choices and speed.  I am the luckiest mother.  My sweet son sent a huge TV and the Fire Stick as a surprise.  Quick, simple set up and I was enjoying it within minutes.My yearly cost for cable and Internet would surely add up much more, even counting his outlay for the TV and Fire Stick.Thanks,  Mario", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Delay in connection", "verified": true, "helpfulness": "0/0", "author": "Stephanie Sifuentes"}, {"rating": 5.0, "review": "I love my fire stick. It took me a bit to get used to it and I am still learning. But as of now, I am diggin it.", "verified": true, "helpfulness": "0/0", "author": "the heat \"the heat\""}, {"rating": 5.0, "review": "Freaking love this thing. Super small and doesn't add anything to my entertainment center, just plugs into the tv and that's it. I showed it to my grandparents and parents and they loved it. I bought then one also. I'll be buying one for my master bedroom and my kids room also. It's great once you install kodi on it.", "verified": true, "helpfulness": "1/1", "author": "carlos"}, {"rating": 4.0, "review": "This is really easy to use and works really well for the price. The interface is a little confusing and definitely showcases amazon over all of the other channels, which may be annoying if you don't have the amazon prime video service. Great if you do have prime though, as you can see all of the videos you can watch for free. I don't really like that you can't power it just with the usb plugged into the tv and that you have to plug it in to an outlet but it's not that big of a deal. I really appreciated that it came with batteries for the remote and the remote is really easy to use.The quality of the video is pretty good but it requires a really strong, reliable wifi source. That may mean that you need a wifi extender even if you can connect your computer or phone to your wifi without it. I'e found that this is true of other streaming devices too though, roku, google stick, etc. so maybe that's just how these things work. If you have trouble connecting this to your wifi or keeping it connected, I recommend changing your wifi channel and/or buying a wifi extender.", "verified": true, "helpfulness": "0/0", "author": "meg"}]