[{"rating": 5.0, "review": "Very useful tool to access so much media.  We are happy with our purchase.", "verified": true, "helpfulness": "0/0", "author": "Jacob W. D."}, {"rating": 5.0, "review": "Bought this for my daughters room so she could get Netflix.  It allows you to password protect it so that they can't download or purchase anything in error.  She enjoys that she now has game apps in her room that I can download for free.  It was a simple walk through set up to get is all started.  The remote is tiny.", "verified": true, "helpfulness": "0/0", "author": "Momma of 4"}, {"rating": 4.0, "review": "Interface for frequently used items is good. Casing anything but pictures is about impossible.", "verified": true, "helpfulness": "0/0", "author": "Grant Baker"}, {"rating": 5.0, "review": "one of my new favorite technology items.  Strongly considering dropping cable.", "verified": true, "helpfulness": "0/0", "author": "David Bouse"}, {"rating": 3.0, "review": "I like it a lot. The only thing keeping me from giving it 5 stars isn't even Amazons Fire Stick TVs problem. The issue lies within the SLING TV player included in the fire stick. The sling tv is still a little glitchey. even with a great Internet connection on other WiFi devices, the sling player needs to buffer a lot. The picture does get really pixelated once the picture does finally come back. It plays the Amazon Instant Videos perfectly fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than I thought it would be", "verified": true, "helpfulness": "0/0", "author": "370378"}, {"rating": 5.0, "review": "Compact, works great on my tiny kitchen TV that didn't have a cable box attached!", "verified": true, "helpfulness": "0/0", "author": "Major Rips \"Major\""}, {"rating": 3.0, "review": "Movies should be accessible outside of the U.S.  Apple TV allows it. Why Amazon can't get into the market.", "verified": true, "helpfulness": "0/0", "author": "Cado"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Duchatellier \"JMD\""}, {"rating": 4.0, "review": "It works pretty good.  The downside is that even when it's receiving a strong signal.  Four to five bars it's ability to send back ( it's radio) is not very strong.  Placement is critical. You do not want to be far from the router, and you want the stick unobstructed. An hdmi extender is almost a given.  However its functionality is great overall.", "verified": true, "helpfulness": "0/0", "author": "Rob"}]