[{"rating": 4.0, "review": "The fire stick works well. It's easy to install and not too bad to navigate. But I wish there were more apps that I could download for sports and live tv.", "verified": true, "helpfulness": "1/1", "author": "daniel"}, {"rating": 1.0, "review": "Keeps losing internet connection with computer 15 feet away.", "verified": true, "helpfulness": "1/1", "author": "Stephen Kirchner"}, {"rating": 4.0, "review": "The fire stick has been very good and improved our TV viewing. We have very slow network connection and previously every show buffered thoughout. We have a lot more uniterupted viewing now. But I'm still waiting for it to anticipate and have something else ready to go. I find that if I select a movie, get it started and then pause it for a few minutes we have very little buffering.", "verified": true, "helpfulness": "1/1", "author": "Lori Wetzel"}, {"rating": 5.0, "review": "Very good product.", "verified": true, "helpfulness": "1/1", "author": "IVIO L PEREZ-BORROTO"}, {"rating": 5.0, "review": "Everything I wanted. Thank you it was perfect.", "verified": true, "helpfulness": "0/0", "author": "Penny"}, {"rating": 5.0, "review": "I was using a blue ray player to access Netflix and Amazon, etc. and it always took a long time to load up.  We just hooked up the fire stick and it is so much quicker and easier to navigate.  It's probably my imagination, but the picture seems sharper as well.", "verified": true, "helpfulness": "0/0", "author": "Healthy Lady"}, {"rating": 4.0, "review": "Great product for our cableless household. Only downfall is within time it has become\"glitchy\" and it will freeze.", "verified": true, "helpfulness": "0/0", "author": "Vicky Pena"}, {"rating": 1.0, "review": "Turns out Fire Stick is not compatible with my cable Arris 628 Modem. Customer service sent me a Neatgear router but I have had problems with using 2 routers. Has been very frustrating. No number for Neatgear support.", "verified": true, "helpfulness": "0/0", "author": "James Troutman"}, {"rating": 5.0, "review": "Absolutely the best purchase I've ever made in a long time. It's so easy to use and set up. It took me I think not even 10 minutes to set it up and watch something. If I can recommend one thing it would be to buy the power cord that fits in you usb in your tv to get rid of some of the wires cause the plug it comes with isn't the longest but it depends how your TV and everything is set up. I mean what else could you want. You can play games watch Netflix listen to spotify and so much more. I definitely recommend this to anyone", "verified": true, "helpfulness": "0/0", "author": "Casey Pietro"}, {"rating": 5.0, "review": "I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Daniel O'Donley"}]