[{"rating": 5.0, "review": "It's a grest item I recommend for anyone...", "verified": true, "helpfulness": "0/0", "author": "Brandon Bookert"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Aurora Encinia"}, {"rating": 4.0, "review": "Very easy to use and much more convenient than other devices.", "verified": true, "helpfulness": "0/0", "author": "Cynthia B Petitt"}, {"rating": 5.0, "review": "I love the Fire TV Stick! The picture quality is great, the set up was easy and the menus make it easy to use. For the time being I use it at home through my home wireless, but I travel quite a bit during the summer and plan to use the Stick at RV Parks with good Wi-Fi or cell phone hot spot. Digital TV on antenna is not dependable and Fire TV could be the answer. If it works as well on the road as it works at home, I may never get a satellite system for my RV!", "verified": true, "helpfulness": "0/0", "author": "Roger Tetrault"}, {"rating": 5.0, "review": "I love my fire TV stick, it work well with my 29in because it a smaller TV. I will be getting the fire box for the big 50 in I have.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"NYM\""}, {"rating": 3.0, "review": ".Needed to buy other equipment in order to hook it up as I did not have enough HDMI slots on the tv. I also cannot access some of the programs listed. It will say Unavailable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far, we love the Fire Stick.  We do experience times where the Stick is unable to connect to our wifi for no reason.  But, it's a wonderful edition to our outdoor antenna for our entertainment needs.  Tons of movies, TV shows and even games.  I highly recommend giving it a try.  Ditch your overpriced cable or satellite!!!", "verified": true, "helpfulness": "0/0", "author": "bridg47923"}, {"rating": 4.0, "review": "the volume from the amazon video is too low so I can not really watch because I can not hear what is being said in movies, however on Netflix the volume seems to work properly. So I do not really use it with the amazon video I use My rokku instead.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "After months of waiting on back order, I finally got it.  These things are fantastic and basically have replaced my apple TV.  I have been a long time prime member but never really used the movie or TV episode function.  I have and love it.  This thing just works seamlessly and even though it is VERY portable and easy to use, I will now have to buy no less than 5 more for additional TVs.  Darn you amazon.  You can not equal the power and functionality of this thing for the price.", "verified": true, "helpfulness": "0/0", "author": "Crackin4 \"Paul\""}, {"rating": 3.0, "review": "Always freeze in the middle watching this not happened with chromecast but chromecast can't stand alone and no remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]