[{"rating": 5.0, "review": "Love it, love it, love it!!  Setup was so easy and we are enjoying our Prime Videos.", "verified": true, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "Advantages vs. Chromecast:* Actual remote. Chromecast uses your phone. If it disconnects from the WiFi for any reason, you're left without any way to control content. Not a problem with this device.* It includes Amazon Prime as well as pretty much all the services included in Chromecast.* It was 1/2 price when I bought it.Disadvantages vs. Chromecast:* No Comedy Central casting via app. Need to use Hulu Plus (add'l $$)", "verified": true, "helpfulness": "0/1", "author": "Menashe"}, {"rating": 5.0, "review": "LOVE my Fire TV stick.  I turned my dumb TV into a smart TV instantly. And the stick is small, like the size of a regular USB drive.  It doesn't stick out at all or get in the way. No one even know's its there. The remote comes with batteries. It comes packaged in a great little box. This was such a great deal. You can give it as gifts!The stick itself works great so far. I love the easy to use/navigate user interface. When I plugged it into the hdmi input on my flat screen tv and powered it on, it was already linked to my Amazon Prime account. I guess it came that way and it made set up even easier for me. I can access and stream all the digital media that I bought on Amazon, even play my music on my TV. It was also simple to log-in to my other accounts (Netflix, Youtube, etc.) I was up and running in less than 5 minutes.I get great streaming when my internet is working well, but where I live, I'm only offered Time Warner wh ich is not that great. But that is not the Fire TV stick's fault at all. I would get more to upgrade my other TVs. Just make sure the TV you want to install this on has a HDMI input.I haven't tried to use the other capabilities just yet (like \"flinging\"). I can't wait to try. However, I will say that the Fire TV Stick is already a great deal for what I'm using it for. I would recommend this and buy more.I would recommend this.", "verified": true, "helpfulness": "1/1", "author": "molu"}, {"rating": 4.0, "review": "The only issue I have is it doesn't work if my internet is running slow. I know that is not a Amazon Stick problem and it's a internet issue but that is the one draw back to the stick.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 3.0, "review": "It has locked up on multiple occasions, and has lost connection requiring it to be rebooted, this in the first week.", "verified": true, "helpfulness": "0/0", "author": "michael p walsh"}, {"rating": 5.0, "review": "After reading all the reviews I was skeptical about getting the Fire TV Stick. Many people said that they could not connect to their internet router. Plugged everything in per the instructions and got to the point where you choose your internet and it froze up. Not knowing what to do, I unplugged the fire stick from the TV and plugged it in again. Presto, it had all the available networks including mine. Chose my internet connection and it worked perfectly after that. I have a Samsung TV with three HDMI connections and one was being used so just connected it to the number two slot. Pretty easy to get things going. I am sure that others had the problems they described, but I didn't experience any. Not sure if that was because it was the latest version of fire stick, or maybe the TV, but everything is working and it is great to watch some of the old Syfy movies I enjoyed as a kid. I think that if you get the latest version of fire stick and have a fairly new TV (mine is five years old), you shouldn't have any problems. Love it.", "verified": true, "helpfulness": "0/0", "author": "Robert A \"You can't think outside the box if you don't know what's in the box\""}, {"rating": 5.0, "review": "We love it of course it will take some time getting use to it but so far its been a great experience!", "verified": true, "helpfulness": "0/0", "author": "Maria I. Robles"}, {"rating": 5.0, "review": "amazing small and super easy and fast. remote is great", "verified": true, "helpfulness": "0/0", "author": "amit"}, {"rating": 2.0, "review": "It works - right up until you pause or resume a stream - then the audio sync is ALWAYS off and I have found no way to correct it.In short - I would have passed on this had I known.", "verified": true, "helpfulness": "0/0", "author": "Michael Hassey"}, {"rating": 4.0, "review": "This has everything you need. My only complaints are that you have to plug the stick into the tv and then there is a cord that attaches from the stick to an electrical outlet. It's very misleading because the visuals do not show you plugging it into electric...so if you have wall mounted your tv, you will have to feed the cord thru the wall or leave it hanging. Secondly, like every technical device, the stick will freeze on an app occasionally and needs to be rebooted by unplugging and plugging back in. I have a roku 1 as well on another television and have never experienced it freezing up.", "verified": true, "helpfulness": "0/0", "author": "Jenst"}]