[{"rating": 5.0, "review": "Initially ordered from Amazon.com but ......have to wait until January !!!!!, bought from BestBuy....and I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kabelek"}, {"rating": 5.0, "review": "Set up was easy. It does all the functions that are advertised and then some. The picture quality is amazing. I highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "DR Count"}, {"rating": 2.0, "review": "While it is nice to have access to Youtube and Netflix without using a laptop, support for some of the apps is missing from Xfinity.  The device has a habit of losing the network connection requiring a reboot and occasionally loses the login credentials for some apps.The combination of the user interface and limited remote control means that you will spend a lot of time navigating to what you are looking for.", "verified": true, "helpfulness": "2/2", "author": "Broward"}, {"rating": 1.0, "review": "I am a big Amazon customer, Amazon Prime member, owner of two Kindles and just about everything I purchase comes from Amazon.  At $19 I have never been so disappointed in an item.  It just plain does not work.", "verified": true, "helpfulness": "2/3", "author": "Lisa PM"}, {"rating": 3.0, "review": "The firestick itself is a decent product, but I'm really finding out that Amazon doesn't really have the content that I want, so am spending more time on YouTube watching the shows that are posted there legally, for free.  amazon, apple, netflix, hulu all need to get the content straight or your paying as much for 5 different content providers as you are for regular cable and still have to wade through a clunky UI to even find shows.These companies really need to get it together.  Glad this only cost me $20 or I would be very upset.", "verified": true, "helpfulness": "0/0", "author": "HoustonTexansfan"}, {"rating": 4.0, "review": "I like it so far. The interface is pretty slick and I was surprised at how responsive it is. I do find it laggy at times but that is only because my wifi source has to pass through a room. I feel a wifi booster may help solve that but I'm not knocking the fire stick because of my lack of bandwidth. Would love to see some others popular apps namely HBOGo but that's a whole different convo. Haven't tried some of the device streaming features yet but I have noticed my family using it more over our actual cable tv which is a good sign for the cord cutting later.", "verified": true, "helpfulness": "0/0", "author": "Andre Brown"}, {"rating": 4.0, "review": "Compared to Chromecast, I love the Firestick more. It's a much more enjoyable experience and the navigation is much easier, especially within apps like Netflix. If possible though I'd like to customize my menus.", "verified": true, "helpfulness": "0/0", "author": "techgirl"}, {"rating": 5.0, "review": "very easy to set up and use. I like it as much as my ROKU that I am  using on bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "Louis"}, {"rating": 5.0, "review": "Great device, HD quality,super fast. And the still pictures are phenomenal. Amazon great product, very happy with. I give it a AAA+++ still wish i could search the google internet with it though. The game are a nice touch too...Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "shannon thomas"}, {"rating": 5.0, "review": "Absolutely amazing.  Before I got the fire stick, I was using an Xbox360 for streaming.  The experience with the stick is so much better, and it was so cheap!  Holds a network connection like a champ, awesome picture, huge variety of apps, and both remote experiences (physical and phone-based) work great!  I can't imagine going back to any other streaming device now!", "verified": true, "helpfulness": "0/0", "author": "Yarharhar"}]