[{"rating": 5.0, "review": "YES! I have two flat screen TV's in our home, neither is a \"Smart TV\", as they were bought in 2009, before they started building \"Smart TV's\".  I already have another device to stream all that the \"Fire Stick\" can bring to our Flat Screen, in our den and I'm using the \"Fire Stick\" for a smaller flat screen in my home office! It was a great buy!", "verified": true, "helpfulness": "0/0", "author": "JIM"}, {"rating": 5.0, "review": "Fire stick works well in first week. Easy, problem free setup is even quicker for existing Prime customers, as the fire stick is already registered. Replaced a Roku 3 with this smaller, compact HDMI plugin. Receives a router signal just as well as Roku 3 and included internal memory must buffer better than Roku 3 because we have fewer \"catch up\" interruptions with the fire stick. Can't beat the promotional price, pleased with purchase.", "verified": true, "helpfulness": "0/0", "author": "Dejavuduck"}, {"rating": 1.0, "review": "Amazon is advertising this product heavily, and I'd like to get one, but it is out of stock until Jan. 15. That's odd.", "verified": false, "helpfulness": "0/24", "author": "milo \"milo\""}, {"rating": 3.0, "review": "My only point of reference is the Apple TV I own. I don't know how this compares to Roku or Chromecast. But slightly disappointing overall although super cheap. Setting up was not plug and play simple. I didn't like how I needed to plug into HDMI port and also have a clunky electrical plug to connect to as well. Immediately I needed to install a software update that took over 10 minutes to load. I bought this the first day it was available so they certainly shipped without the firmware complete.I couldn't get the audio to work. I have a soundbar connected to my TV and audio would not come out. Got on the phone with Amazon support and they were able to hack a temporary solution by disabling surround sound. So I only have stereo sound coming through. Not a huge deal as I have a soundbar and the surround performance isn't exactly real. But this would be a deal killer if connected to my home theater. Hopefully they will fix this in a future firmware update.Lastly lots of seemingly unfinished details. Video resolution doesn't seem to be quite HD. Just a bit blurry. It's not my bandwidth. Virtual keyboards to enter passwords are inconsistent. Keyboard for putting in wifi password is that annoying sequential type. Then keyboard for entering Netflix password is qwerty. Then getting access to Hulu is a totally different procedure where you need to log in via a computer and then enter a passcode there.User interface so far is nice and relatively easy to use. A little confusing when you find a show and determining if you can watch for free or if you need to buy. But not a huge problem so far.All in all I like this. I might up my rating as I use it more. But setup and initial audio issues are a downer right now.", "verified": true, "helpfulness": "0/0", "author": "Dan Chou"}, {"rating": 5.0, "review": "Clever idea and works great!  I have moved all over the country and found great memories in the live streaming radio stations from the different areas where I have lived. I \"cut the cord\" several years ago, but found myself missing ESPN. There is a live ESPN streaming app that looks just like HD cable!  There is occasional buffering during peak periods, but I have a dozen devices running all of the time.  I watched the Iron Bowl (Alabama vs Auburn) on the Fire stick last night and it was crystal clear high def!  I appreciated it even more because the game was not on broadcast TV (remember, no cable at my house), only ESPN. There are some fantastic interactive weather apps as well. Actually, there are a TON of cool apps, I just found a few that I really liked and downloaded.  I didn't see anything about memory use, so it must use cloud storage. I didn't really read up on it too much before buying it; once I saw the \"mirror display\" feature, I just ordered it.Cool feature is the \"mirror display\" with my Kindle Fire HDX.  ANYTHING that is on my Kindle (feature only works with certain Kindle models, read up about it) will now show up on my big screen TV: books, games, apps, pictures, videos, web surfing!  This is a really neat gadget!  The mirror display took about 20 minutes to figure out, but once you get it, it hooks up afterwards within 10 seconds. The key was going to my Fire HDX Options screen for Display and making the Kindle \"Discoverable.\" Once I did that, the Fire TV Stick recognized it and \"paired it\" to the stick.  I moved it to different TVs and it worked right away without any extra steps needed for it to function.The remote is fairly simple, but works like a champ!  I've been using this for about a week and it's been flawless. Best $20 I've spent in a while. I've heard others say the Fire TV Box ($100) is better, but I have ZERO complaints with the Stick.Important Note - the range of the stick is perhaps the only weak link.  It is 25 feet from my router with a clear line of sight.  But, if I open the refrigerator door (it's between the two), the signal drops until the door is closed again.  I'm not bothered by it, but some probably will see it as a negative. Maybe the Fire TV Box has a more robust receiver. But really, whaddaya want for $20?", "verified": true, "helpfulness": "0/0", "author": "DeeJay Dude"}, {"rating": 5.0, "review": "I love Fire TV, it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Danilo"}, {"rating": 4.0, "review": "I've had a Roku for a few years on my living room TV. The Fire Stick seemed perfect for the bedroom TV. initially couldn't get the Fire Stick to work. i took it out of the box and tried setting it up without reading the instructions. All I would get is the Amazon logo. Then I moved the stick to the HDMI 2 slot and used the extension. Then it picked up my wifi and started installing.  Took awhile for the update. Once it got going, the only problem I had was the remote not responding properly when I logged into Netflix. Once I got logged in, everything else when smoothly. I was able to install several apps. Only one I wish Amazon offered that it doesn't was HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Julia \"books are my crack\""}, {"rating": 3.0, "review": "Setup required a few tries to get it working. Frequent interruptions due to claimed signal loss represent a recurring problem. The WiFi is producing a steady 40 Mpbs at the Amazon device and the Fire stick also reports a very strong signal, but the buffer runs out and a connection problem is reported.  Rebooting the stick has helped but it should not be required.  It would appear that I am not the only one experiencing this problem.The device shows promise and offers a good variety of programming and when it works, it works well. The last reboot (accomplished by unplugging the power cord then reconnecting) appears to have resolved the problem for almost two hours and during that period it performed flawlessly.  I may be revisiting this review if the device continues to perform solidly.", "verified": false, "helpfulness": "0/0", "author": "dan k."}, {"rating": 1.0, "review": "I can't watch Netflix or stream Amazon prime content on the amazon fire stick because it keeps popping up a window saying network connection lost and the streamer is 3 feet away from the router. And I have no problem streaming(watching Netflix, YouTube) content on my smart TV, phone or tablet 30 feet away, three rooms apart from the router in HD.", "verified": true, "helpfulness": "1/2", "author": "Exilio"}, {"rating": 5.0, "review": "Works great and loads quickly. Small size and good quality cords. This is an awesome, low cost streaming device. I have this upstairs in our bedroom where wifi is somewhat weak. I see no performance difference between it and my Apple TV in my living room hooked up with Ethernet.Great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "Dillon Shaw"}]