[{"rating": 1.0, "review": "This is the worse streaming tool I have ever used. It constantly forgets the wifi network. Once you try to select your wifi it won't even recginize your password. It constantly saying it it incorrect. Even once you get pass the wifi issues, once your streaming the apps bug out. The Hulu app will continue to play sound but picture will freeze. The YouTube app will glitch for a second and the sound and video will not line up. And the cbs news app will load be fine for a few minutes. Then it will try to buffer and continue to try to buffer for hours. This is a super cheap stick and you get what you pay for. It is super cheap and very very unreliable", "verified": false, "helpfulness": "1/1", "author": "Matthew Dimery"}, {"rating": 3.0, "review": "The fire TV  was given to me as a Xmas present. It is attractive and compact and has a good selection of Apps to choose from. The main problem is I only have 1.5Mbps download speed in my apartment. The Fire TV stick streams only HD video content which requires higher than 1.5Mbps download speed, probably around 5 or 6 Mbps. I can stream 480P content thru Vudu and Amazon prime on my Samsung and Sony Blu ray players with 1.5Mbps download speed without buffering and watchable quality. However with the fire TV stick I had excessive buffering on video downloads, and no options to stream SP or 480P quality. So if you have relatively fast internet it probably works great. Otherwise use a blu ray player, Roku or a smart TV app that allows you multiple streaming options.", "verified": true, "helpfulness": "0/0", "author": "Rick L"}, {"rating": 5.0, "review": "i like it", "verified": true, "helpfulness": "0/0", "author": "sam"}, {"rating": 2.0, "review": "Laggy.  Netflix is laggy and stutters.  Vevo stutters. HBO now stutters. The main amazon menu and the remote operation isn't smooth and jumps ahead many options when scrolling through.The chromecast does not.Do not recommend.", "verified": true, "helpfulness": "1/1", "author": "Jimmy \"Jimmy\""}, {"rating": 1.0, "review": "I've had this item since mid December and have had nothing but problems with it .It sees my networkand says the strength is excellent butit won't connect most  of the time. I was told to unplug my router and the fire  stick and then reconnect them both. that worked a few times but  I can't always do that. So most of the time when  I go to use it, I'm out of luck. I've tried to stick with all Amazon products so there would be fewer issues but it doesn't seem to be working. Thankthfully I only paid $19. for it.", "verified": true, "helpfulness": "2/2", "author": "fla-gal \"Louiesmommie\""}, {"rating": 5.0, "review": "We love it, it was very easy to set up and use", "verified": true, "helpfulness": "0/1", "author": "Roxy"}, {"rating": 2.0, "review": "When I ordered this, there wasn't any indication that it was on such a long backorder status. Also, I suppose I have only myself to blame, but I was expecting the Voice activation to be standard, which it isn't. I cancelled my order and grudgingly ordered the $84 upgrade, but feel a bit like I was bait and switched...I love Amazon Prime programming, but I'm not likely to buy any more of these \"extenders\" for the rest of the house....", "verified": true, "helpfulness": "0/0", "author": "GLenn Long"}, {"rating": 1.0, "review": "AWFUL.I've never been less satisfied with a product/service.First off, the fire stick always has to be plugged in. You can't charge it and use it wireless. I paid my electrician to run my cable box and all wires from another room and the fire stick has now made that pointless.On top of that, streaming video always pauses. It often says there's no internet connection while saying the connection is strong (the wifi is 10 feet from my tv).\"Free\" shipping: Free two day shipping is great around Christmas but otherwise it's unnecessary. I will often find items cheaper for non-prime customers. I'll then log in and the price is higher for a prime member.Streaming video: the movie selection is God awful. They claim there's so much of a selection but they design the service so you can't browse the entire collection. TV show selections are great.Kindle library: you can't use this service if you're an ipad owner. I'm not going out and buying a kindle.I'd advise to choose another streaming device like Apple TV or chromecast although I have no experience with either.", "verified": true, "helpfulness": "3/4", "author": "Ea$y \"S\""}, {"rating": 5.0, "review": "Good price!", "verified": true, "helpfulness": "0/0", "author": "DANIEL T."}, {"rating": 4.0, "review": "Wors great should have come a book of instructions.", "verified": true, "helpfulness": "0/0", "author": "francis kubecka"}]