[{"rating": 2.0, "review": "I love the concept of this. Not a huge fan of the results of search when searching for apps but the worst part for me is what I paid for and the quality. When I plug it in I have to mess with the cord over and over just to get it to turn on and sometimes it will just stop working in the middle of a show. Also, the down button of the remote won't work unless you push super hard with your finger. I use it and stick it out because my kids like having all the apps on one device, but I'm definitely disappointed with what I expected granted it's an actual Amazon item.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "great for any prime member with hd tv", "verified": true, "helpfulness": "0/0", "author": "Thor"}, {"rating": 5.0, "review": "best gadget in the household", "verified": true, "helpfulness": "0/0", "author": "LUCY C YOUNG"}, {"rating": 5.0, "review": "Absolutely love it. Easy to set up and use for people like that are not tech savy.", "verified": true, "helpfulness": "0/0", "author": "Sam M."}, {"rating": 5.0, "review": "Magnificent... I enjoy it to the fullest thinking of purchasing another one!!!!", "verified": true, "helpfulness": "0/0", "author": "Brian Davis"}, {"rating": 5.0, "review": "We are really in love with this fire stick", "verified": true, "helpfulness": "0/0", "author": "Kaushalya Narayan"}, {"rating": 4.0, "review": "LOVE IT! We gave up cable and use our Fire Stick for all our TV viewing", "verified": true, "helpfulness": "1/1", "author": "Diana L. Swank"}, {"rating": 5.0, "review": "The fire stick got here the next day and it was super easy to install. My Dad (in his 70's) could have done it himself.I would highly recommend it to everyone. I think it is a great price for all that you get with your amazon prime membership.My son (in his 20's) loves the Fire box so much he doesn't want cable in his room anymore!", "verified": true, "helpfulness": "0/0", "author": "Mish"}, {"rating": 3.0, "review": "Very sad that TWC app did not work (even after side-loading) - trying to get TWC to work with this was a trip down the rabbit-hole of frustration.  In the end, I bought a Roku for the tv I wanted the TWC App for (no issues here, quick setup & dl then it just *worked*) and threw the Fire Stick on my tv already hooked up to the cable box just so I could get Netflix without having my Wii hooked up.", "verified": true, "helpfulness": "0/0", "author": "Terrie"}, {"rating": 5.0, "review": "Awesome. Love the interface and the apps", "verified": true, "helpfulness": "0/0", "author": "Bryan A. Ramirez"}]