[{"rating": 5.0, "review": "Easy to install and set up. Have only used it a couple of times, so far so good !", "verified": true, "helpfulness": "0/0", "author": "cherry b dudley"}, {"rating": 5.0, "review": "I really love this product.Having fun with it!", "verified": true, "helpfulness": "0/0", "author": "chiquita"}, {"rating": 5.0, "review": "It works perfectly on my Samsung Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Juffrey Yanis"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "don ho"}, {"rating": 1.0, "review": "Does not stay connected to the Internet. Says connected but with problems", "verified": true, "helpfulness": "0/0", "author": "connie carter"}, {"rating": 5.0, "review": "Great product. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Samuel Gomez"}, {"rating": 4.0, "review": "at first it wasn't working all to well, but I got the internet in the right spot and this baby is great. two downsides... NO HBO GO and it doesn't like apple.... WTF! get with the program and you will be loved by all.", "verified": true, "helpfulness": "0/0", "author": "Anon \"Anon\""}, {"rating": 5.0, "review": "Love this lil thing", "verified": true, "helpfulness": "0/0", "author": "monette"}, {"rating": 5.0, "review": "First off why a five well I read the reviews and found most of them wanting I think maybe one of them was helpful. The reason I bought the Fire Tv Stick is simple I have a blue ray dvd player that  is suppose to give live streaming of Netflix, Amazon etc. well it would be a real plus if it did the job so I decided to look at the fire stick reading reviews and such. I am a prime user so that gives the fire stick a plus! I have bought amazon fire kindles and purchased the fire phone as well so I know a little about the products love them all.Ok package came when they said it would arrive. Opened package and the contents was all perfect read the directions plugged it in and away we go set up a child could do that means so easy even if I hadn't read the directions I would be able to do it. Watched the tutorial a bit cheesy cartoon but it makes the points needed surfed all the apps available nice choice opened Netflix and wow it loaded fast picked a movie and watched it no interruptions or buffering that is wonderful hooks so fast all I have to do is pick and it plays the movies I select fast. For those folks who may wonder what kind power source is needed or do I just plug it in to my TV and it will run. The Stick comes with everything you will need including a plug for and outlet and an extension for the stick itself. Why have a need for an outlet some may ask well it takes a bit of common sense to tell you it will need to be powered and no you TV is not a power source  so please do not think it is. As far as using the stick well my TV has a remote and I do have to select the source with the source button an there it sits waiting to be used! I so far have only downloaded a couple things which I use on my kindles and computer the load within seconds. I will say the one thing or maybe two things I would like to see will be a browser and maybe a the vudu app as I am always doing something on the net or looking something up!!1. Great value the price is perfect! yes2. Ease of set-up -  Yes3. Ease of use - yes4. Prime users -  yes5 Non - Prime users - yes it carries the music apps such as Pandora.User can easily flip a movie from Netflix onto the TV screen from their IPhone, Kindles and Fire phone this didn't need and app to do it! Yes I tried them all as my husband has an IPhone so I know this works. Well if this don't give you a reason to go with a Fire TV Stick then you are not ready for an awesome time!", "verified": true, "helpfulness": "0/0", "author": "SEvans"}, {"rating": 5.0, "review": "If it had local channels, I wouldn't need anything else!", "verified": true, "helpfulness": "0/0", "author": "Rashad Roberts"}]