[{"rating": 5.0, "review": "As described with quick delivery!", "verified": true, "helpfulness": "0/1", "author": "Lisa"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/1", "author": "Quade Allen Richardson"}, {"rating": 4.0, "review": "All is good..........", "verified": true, "helpfulness": "0/1", "author": "Donna Baron"}, {"rating": 5.0, "review": "Awesome stick. Between the Roku and the Amazon, I prefer the Amazon remote for simplicity. I grabbed a gaming controller as well, so in the rare occasion that I can't find something to watch or just don't want to, I can play games.The only issue I've had is that both of the Amazon sticks in my house lost connection with my Amazon account. I had to unplug the sticks for a while (I left them overnight), and plug them back in. I haven't had any issues since.", "verified": true, "helpfulness": "0/1", "author": "Michael McCrae"}, {"rating": 4.0, "review": "fire stick streams netflix, hbo go, etc. on my smart tv much better than the smart tv hardware.easy to install.searching for shows is cumbersome with the remote.", "verified": true, "helpfulness": "0/1", "author": "Ben Bloom"}, {"rating": 5.0, "review": "What s great tool!!! Everything in a tiny remote!!!!!", "verified": true, "helpfulness": "0/1", "author": "Glen Wachtel"}, {"rating": 5.0, "review": "Great device!  Easy installation, was up and running in minutes.", "verified": true, "helpfulness": "0/1", "author": "Lois S. Flederbach \"MomofG&E;\""}, {"rating": 5.0, "review": "Awesome.  Perfect for a cord cutter especially if you have prime", "verified": true, "helpfulness": "0/1", "author": "Patrick S. Keeley"}, {"rating": 2.0, "review": "WARNING: It may sound naive of me, but you should say your T.V. must already be connected to the internet. So if you have internet, and your modem/router is connected to another T.V. and you don't have a way to connect the set you want to watch on, don't think this is going to work on your T.V. This is the same as having a Blue Ray Player, almost all come with this capacity, or a smart T.V., they come with all the apps.I don't see the value of this, feel free to let me know how this differs or augments in any way, if your T.V. has a HDMI port to stick this in, then it probably is already loaded with the apps., if you have a DVD player, that's Blue-Ray, then you have the apps.loaded already.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "so easy to set up and use...sure beats the google tv we had", "verified": true, "helpfulness": "0/1", "author": "mw"}]