[{"rating": 1.0, "review": "Absolutely sucks. Will not connect to the internet any longer. When it was working, the remote lagged terribly and you would end up in the main menu repeatedly. It doesn't turn off easily and it doesn't even have a display clock unless you download one as a separate app. I called customer service and they told me I was just out of luck and gave me a 5 dollar credit. I want my money back and I will never buy another Amazon brand item again I will put this in my pile of broken junk with my dead kindles.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The Firestick is OK, but not sure why Amazon would release something that could not cast from a computer, like the Chromecast.  Doesn't make much sense to buy this when the Chromecast does more for less money.  Not being able to cast is a huge loss of a feature, so I don't recommend until Amazon adds this functionality.", "verified": true, "helpfulness": "0/1", "author": "Sledhead"}, {"rating": 4.0, "review": "User friendly in setting up.  My only problem was not a strong enough wifi signal.  After boosting my wifi signal, everything went as expected.", "verified": true, "helpfulness": "0/0", "author": "dave c,"}, {"rating": 5.0, "review": "Love it! Easy to set up, and easy to use! I bought 2 of them.", "verified": true, "helpfulness": "0/0", "author": "David A. LaFlair"}, {"rating": 5.0, "review": "Easy to install and use. We are really enjoying the Harry Bosch series.", "verified": true, "helpfulness": "0/0", "author": "Nursey"}, {"rating": 1.0, "review": "Very bad. Poor wireless reception. Extremely slow when you navigate between apps. I do not recommend this device.", "verified": true, "helpfulness": "0/0", "author": "DesertIce \"DesertIce\""}, {"rating": 5.0, "review": "I signed up with Sling for $20 per month.  I was looking for a service that supported Sling and found that if I paid for three months of Sling, I would get a free fires tic.  Set up was easy and it makes watching sling enjoyable.  Goodbye satellite tv, hello sling and firestick.", "verified": true, "helpfulness": "1/1", "author": "D B Gudmundson"}, {"rating": 3.0, "review": "I am very unhappy with it.  Learned the hard way this evening if you want to watch WWE network, you have a hard time accessing it. I had to unplug it for it to reset, and then it froze up and lost the sound.  This is not a happy report from me.  Watched movies with it and it was ok. Picture was really good but again, it at times would freeze up.  Not the best purchase for me.", "verified": true, "helpfulness": "0/0", "author": "Anna Saettel"}, {"rating": 1.0, "review": "This device worked really well for about a week. Then, I started to have streaming issues with the hulu plus app (freezing, playing audio, but no video). Then Amazon music started to not load, or would play for a few songs, and then get stuck on the loading screen. Now, none of the apps work (hulu, Netflix, YouTube, prime video, prime music....). If they even load at all, I get error messages, or playback issues. I have tried all of the troubleshooting steps, and even worked with my internet provider to make sure that the issue wasn't on their end. So far, Amazon customer service hasn't done much to help. I'm so disappointed.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "One of my best purchases yet from Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Harper"}]