[{"rating": 4.0, "review": "I hope Amazon reads this! This is a great item, it makes watching movies and streaming video very easy. The one thing that disappoints me is the description stated that HBO Go would soon be available and it still is not. When are you going to get on the ball with this Amazon??!! This would make the Fire Stick complete.", "verified": true, "helpfulness": "0/0", "author": "Andy H."}, {"rating": 5.0, "review": "So far the Fire Stick is working great, I picked it up for free when I signed up for Sling TV, I can do without cable with Sling TV and Amazon alone but I also picked up an HDTV antenna and now I get local stations as well. I was also able to download the remote app on my phone so I can use the voice control, Set up was about as easy as plugging your TV into the wall although the battery cover can be a bit difficult to remove it does come off if done correctly... I quit cable TV years ago and this Fire Stick just makes it so much easier to get what I want to watch on to my TV without having to plug my laptop into the TV. Some people say they have problems with HBO go but that is something you have to have cable to get in the first place, HBO Now will be available around June as a stand alone station but I am not going to pay the 15 bucks for it myself.", "verified": true, "helpfulness": "0/0", "author": "gutterbanger"}, {"rating": 5.0, "review": "It is great to be able to watch my prime videos on the TV rather that watching them on my tiny Kindle screen!", "verified": true, "helpfulness": "1/1", "author": "Wanda johnson"}, {"rating": 1.0, "review": "The battery cover on the remote could not be removed in spite of the attempts of four different people.  Given that there are multiple youtube videos on how to remove it (all showing different levels of difficulty) there is clearly an intrinsic flaw in the design.  I had to return this item due to complete unusability.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer \"p_hall\""}, {"rating": 5.0, "review": "Very easy to install and use / liking it so far!☺️", "verified": true, "helpfulness": "1/1", "author": "joanne owens"}, {"rating": 2.0, "review": "I have a few issues with the Fire Stick and I'm not completely happy with my purchase.1. Amazon promotes \"fling\" which allows you (with an app) to transfer whatever you are watching on your tablet to your TV. They fail to mention that it only works with Amazon Prime Videos. Even though I have Prime I wanted to use the \"Fling\" feature with other streaming services like Showtime anytime and HBOGO.2. HBOGO and Showtime Anytime apps work fine on my Kindle Fire 7HDX but does not work with the Fire Stick. It will work with every cable provider on the planet EXCEPT Comcast. I cannot understand why it works on my Kindle Fire but not on Fire Stick. Amazon's answer to this issue is to tell me to petition Comcast. It's inconceivable that Amazon and Comcast cannot work out a deal to have HBOGO and Showtime Anytime work across all Fire platforms.3. Mirroring to TV does not work. I can get it work for 2 minutes and then it blacks out. I have tried restarting my Kindle Fire and rebooting the Fire Stick but I still get the same result. I tried mirroring an HBOGO movie playing on my Kindle Fire to the Fire Stick. As soon as I start mirroring, the movie keeps pausing and buffering on my Kindle. The picture on the TV is grainy and pixelated and then it blacks out and stops mirroring.4. Amazon promotes that HBOGO will be available on the Fire Stick Spring 2015 but this does me no good if Comcast subscribers are blocked.Amazon and Comcast need to work this out. Also, Amazon needs to make it clear that Fling only works with Prime videos and they need to make mirroring more stable.", "verified": true, "helpfulness": "0/0", "author": "musclegirl"}, {"rating": 5.0, "review": "simply the best", "verified": true, "helpfulness": "1/1", "author": "mandy butler"}, {"rating": 5.0, "review": "Love it, removing cable!!!", "verified": true, "helpfulness": "1/1", "author": "jennifer burns"}, {"rating": 5.0, "review": "very easy to use and set up.  Far less complicated than I expected and does quite well even with our rather slow DSL", "verified": true, "helpfulness": "1/1", "author": "Starr Cruise"}, {"rating": 4.0, "review": "Just getting to know it! Looks good so far!", "verified": true, "helpfulness": "1/1", "author": "Mary E Kinsman"}]