[{"rating": 5.0, "review": "Exactly what I expected. Love it. Ended up buying 2. Its like it turned my tv into a smart tv and love the available apps and such on it. YAY for Amazon for this!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far the Fire Stick is excellent and we really love it.....", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Woolery \"woolybully\""}, {"rating": 5.0, "review": "This is a great item.  Easy hook up, less than 5 minutes.  Received the item in perfect condition and nearly a week before original scheduled  date.  I had to tweek the router a bit to get continuous streaming, however this is not a problem with the fire stick.  This thing blasts through three internal room walls, a large stone fireplace and a connection on the far side of the TV.  About 60 feet if it were a straight line. I may move it to a TV in the family room (Which is even a greater distance and more walls), just to see if it still works as good.  My neighbor has a Google something or other and is going to replace it with a Fire TV Stick.  Amazon Prime is the way to go!  Plenty of movies for the entire family.  Never had a problem with anything ordered from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Lee G. Basnett"}, {"rating": 4.0, "review": "Easy to install.  Works well.  Very nice...", "verified": true, "helpfulness": "0/0", "author": "walter h schuller jr"}, {"rating": 5.0, "review": "Great product, came in sooner than expected and performs as advertised, I recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "I love it!  Plugged it into my TV and it started its magic immediately.I only wish I could use it in Mexico:(", "verified": true, "helpfulness": "0/0", "author": "ME"}, {"rating": 5.0, "review": "Pretty cool device.  Very easy to set up.  When I first hooked it up, I used the USB port on the back of my TV to power it.  I kept getting \"insufficient power\" until I plugged it into the wall using the included adapter.  Apparently the TV just doesn't supply quite enough juice.  I use it often and it works great!  I'll be getting another when they go on sale again for $19.99.", "verified": true, "helpfulness": "0/0", "author": "Bradley B."}, {"rating": 5.0, "review": "It hasn't made fire yet. Maybe I need two sticks to rub together.", "verified": true, "helpfulness": "0/1", "author": "Patricia Wilson"}, {"rating": 5.0, "review": "I'm loving it.", "verified": true, "helpfulness": "0/0", "author": "J. Sharp"}, {"rating": 1.0, "review": "There are constant issues with audio irregularities (cracks, pops, etc).The Plex and Netflix apps are barely usable, with frequent buffering/stuttering issues as well as the audio issues noted above. Hulu and Amazon prime apps don't have the same issues.I am able to immediately switch to the Chromecast or Roku stick and the issues go away; so I am attributing this to the device. I purchased my Fire TV stick in the first wave of preorders.", "verified": true, "helpfulness": "2/3", "author": "Brendan R Clemmer"}]