[{"rating": 5.0, "review": "Why use a different device. I am blown away by how easy this is to configure and how good the customer experience is. I have an Apple TV as well, and I just like the Fire TV stick better. Other than AirPlay, which is a really neat feature of Apple devices, the Fire TV Stick feels a bit more fluid. And the ability to access Netflix and Amazon Prime without headache is just fantastic.I hate to sound like a fanboy, but I am delighted that Amazon has released a stable, easily portable, and highly enjoyable device for such a low price.", "verified": true, "helpfulness": "1/1", "author": "JD \"When I Paint My Masterpiece\""}, {"rating": 4.0, "review": "Awesome device but it freezes from time to time.", "verified": true, "helpfulness": "0/0", "author": "Philip Montevirgen"}, {"rating": 3.0, "review": "Great! Except it doesn't stream in HD. Video starts in HD, but is then down sampled to something less in ~10 seconds. Sometimes the HD comes back in, but then quickly down samples again. I have a fast internet connection with no issues on other devices (incl Apple TV, which is hooked up to the same TV). Tried watching the same show on Fire Stick and Apple TV and the difference is obvious. Amazon, please update!", "verified": true, "helpfulness": "1/1", "author": "Glenn \"Glenn S.\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lori Prucha"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Sherry Shumate"}, {"rating": 5.0, "review": "I love my Fire stick! I replaced my Roku and the buggy apps on my smart tv.", "verified": true, "helpfulness": "0/0", "author": "K. Wong \"superkat\""}, {"rating": 5.0, "review": "Have only had this a couple weeks but so far ..LOVE! More than worth the money.", "verified": true, "helpfulness": "0/0", "author": "hoffysgirl"}, {"rating": 1.0, "review": "Bought it as a prime video streamer for the secondary TV....regret the purchase citing bad wireless performance....I have an older Logitech revue on the same TV and the wireless connectivity is a charm.....wish amazon would sdo something about it....", "verified": true, "helpfulness": "0/0", "author": "Immanuel Samuel"}, {"rating": 4.0, "review": "I regret buying this device!  It does not consistently work with Netflix.  When it does work it is great but most of the time it will not load Netflix selections.  We have given up using it and went back to our old Roku.  We tried the various \"fixes\" and even replaced the unit.  A waste of time and money - if you want to access your Netflix account.UPDATE:  The unit was upgraded on 4//10/15 to version 54.1.1.0 and appears to work with Netflix - so far.  Hopefully the upgrade took care of the issue.  I like to use it when it is working correctly.UPDATE #2:  The upgrade did not fix the problem.  Can't consistently load Netflix.  Back to the Roku..", "verified": true, "helpfulness": "0/0", "author": "Kent Smith"}, {"rating": 1.0, "review": "technically it works as advertised; but, and this is a big but, it only serves any use if you have a paid subscription service--like amazon prime, hulu, nexflix, etc...... without those it dont work any better than a sea shell", "verified": true, "helpfulness": "2/6", "author": "Amazon Customer"}]