[{"rating": 5.0, "review": "Great experience so far. Had it for about 2 weeks now.", "verified": false, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "I just received my Fire TV Stick yesterday and have to say I am thrilled. It was super easy to set up; just plugged it in and followed the onscreen directions. It took only minutes.  It is so nice to have everything in one place.  My Amazon Prime and Instant Video streaming, Hulu, Netflix and Prime Music, Pandora and my photos are all at my fingertips! The apps for Food/Recipes, Photography and Travel are a nice bonus.  No more \"buffering\" when trying to watch my Amazon Prime Travel videos, which is really the reason I purchased this.  Everything is nicely organized and easy to find. Love the voice activated app for my iPhone too.  I count this as one of my best Amazon purchases to date... and you just can't beat it for the price.", "verified": true, "helpfulness": "0/0", "author": "Shelly Morgan"}, {"rating": 5.0, "review": "Easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Joseph L VanderMolen"}, {"rating": 5.0, "review": "it's good does everything I expected.  It took a long time for delivery (weeks)", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "After I got it to work ( had to re-boot it, just unplug & re plug ) it's worked fine. I was just using it moments ago to watch BROADCHURCH.", "verified": true, "helpfulness": "0/0", "author": "David Antoninich"}, {"rating": 3.0, "review": "Isn't as good as Roku yet needs frequent reboots", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"GCH\""}, {"rating": 2.0, "review": "I have owned this fire stick for a few months now and am ready to write my review.  The most glaring issue for this device that cannot overcome any positives about it is its terrible wifi performance.  I have this and a chromecast device in the same room and they are right next to my wireless access point.  I have used speedtest to check my wifi speed and get over 10 megs/sec.  The google chromcast can stream content without buffering.  The fire stick buffers constantly and looses connection on a regular basis.  No other wireless devices I have in my house (over 10) have any problem with speed except this device.  I did get this device for a great price, $25, but it is almost worthless to me because of its connection issues.  Too bad, I really want to like this device.", "verified": true, "helpfulness": "1/1", "author": "Robert W Grubbs"}, {"rating": 5.0, "review": "my 6 yr old grandson and I set it up together ...too easy to assemble and great so easy to navigate...worth the wait ...", "verified": true, "helpfulness": "0/0", "author": "michelle d. adams-rivera"}, {"rating": 2.0, "review": "Substandard offering: plex stutters, no volume control. Forgets some settings if it loses power. The sole reason to use this is to go have a better amazon prime tv experience.Better to buy chromecast.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Dave Young"}]