[{"rating": 5.0, "review": "navigation and keypad are a little bit difficult but after you get used to it works nice.", "verified": true, "helpfulness": "0/0", "author": "robert peters"}, {"rating": 5.0, "review": "I am enjoying its ease of operation and the many features it brings!", "verified": true, "helpfulness": "0/0", "author": "James Brassil \"Jim from Manchester, NJ\""}, {"rating": 5.0, "review": "the only little problem the remote is a slick..but overall very please with it!! it's very fun to use", "verified": true, "helpfulness": "0/0", "author": "tracy myers"}, {"rating": 4.0, "review": "I used the Fire TV stick on my projector while using Comcast.  The picture was great. However, I couldn't use my surround system with the Fire TV stick and could use only the projector speakers. Otherwise I would have given it a 6 our of 5.", "verified": true, "helpfulness": "0/0", "author": "D A Toler"}, {"rating": 1.0, "review": "it can`t keep dropping and reconnecting to wifi. I`ve tried muitple wifi same problem. makeing it unwacthable", "verified": true, "helpfulness": "0/2", "author": "Mark D Jackson"}, {"rating": 4.0, "review": "So far it's pretty good. I don't like that it shuts down on is own during the screen saver . Miracast doesn't always work . For the cost it's not bad . We have prime so it's been great for that .", "verified": true, "helpfulness": "0/0", "author": "Todd Rothschild"}, {"rating": 5.0, "review": "Love the simplicity of it and how fast it streams videos.", "verified": true, "helpfulness": "1/1", "author": "James"}, {"rating": 2.0, "review": "Firstly, it doesn't work outside the US. Secondly, it is very restrictive to Amazon contents; it makes it hard to stream/play other things.", "verified": true, "helpfulness": "0/2", "author": "JM"}, {"rating": 3.0, "review": "I've had high hopes the unreliable network connection makes this more of a hassle to use than my Roku boxes and sticks. There are many things I want to live about the Fire, but the only Amazon recommended support I can find for my issue, and that of many others, suggest putting the stick on an go I extension cable. OK. But with the extended cable, the 2 nd cable running in to power this from a USB port plugged into a wall plug, thenFire stick is like a mcguyvered version of its larger brother and in a nice little box.", "verified": true, "helpfulness": "0/2", "author": "Ted Domurat"}, {"rating": 5.0, "review": "Works awesome, and easy  to set up and use. I haven't had a problem with it at all. :)", "verified": true, "helpfulness": "1/1", "author": "Joy"}]