[{"rating": 5.0, "review": "Excellent product.  It was easy to connect and was shipped timely.", "verified": true, "helpfulness": "0/0", "author": "D. Heard"}, {"rating": 5.0, "review": "Awesome! !", "verified": true, "helpfulness": "0/0", "author": "Maddrika Pyron"}, {"rating": 5.0, "review": "I love that I can watch the show and movies from Amazon Prime on the TV instead of my Kindle and I can still use my Kindle to read my e-mails or play my games at the same time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire stick is easy to use and to set up. I am very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 5.0, "review": "I have never written a review before, but always read them to make a purchase.If you are a amazon prime member, then this is the best money spent to watch movies, catch up on TV shows with ease, also best way to surf YOUTUBE in full screen. Most of movies and TV shows are free with prime, but new releases are charged a small fee. Amazon will double confirm before purchase is made that no accidental billing.. TV shows that have seasons active still on live TV have option to buy episode or whole season.Its great if you missed an episode of your favorite  TV show. NO commercials, Love it. Past seasons of your favorite shows usually are free.Best money spent for entertainment", "verified": true, "helpfulness": "1/1", "author": "edith szabo"}, {"rating": 5.0, "review": "Love the Firestick. This is my number 2. Don't have to switch from Livingroom to bedroom now!", "verified": true, "helpfulness": "0/0", "author": "STEVEVR BEAVERS"}, {"rating": 1.0, "review": "So from what if read this is just another gimic to get more money? It's been sitting around in the box almost a year now. Finally set it up. I had thought to just throw my fire stick in the garbage after reading all the reviews but can anyone tell me if it's any good for things like photos and using your iPad with it? If I block everything that will cost money will I be okay? Or should I get Apple TV? Any suggestions?", "verified": true, "helpfulness": "1/1", "author": "Bird_Lady"}, {"rating": 5.0, "review": "Just what I expected a great product and does everything I wanted it to do", "verified": true, "helpfulness": "0/0", "author": "Bruce Symons"}, {"rating": 5.0, "review": "The Fire TV Stick was recommended to us by our daughter.  The Fire TV Stick has exceeded our expectations.  We will be scaling back on our cable TV.", "verified": true, "helpfulness": "0/0", "author": "Beverley Hilton"}, {"rating": 5.0, "review": "Great value! I would recommend this product to friends.", "verified": true, "helpfulness": "0/0", "author": "Ana"}]