[{"rating": 4.0, "review": "Great item! Turns your basic TV into a smart TV", "verified": true, "helpfulness": "0/0", "author": "Jermaine V"}, {"rating": 1.0, "review": "not as expected", "verified": true, "helpfulness": "0/5", "author": "DAVID M. LINDSEY"}, {"rating": 5.0, "review": "Not much to say really. Does its job and does it welll, especially for the price. I chose this for the price and the fact it had Amazon prime and Vimeo.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 1.0, "review": "i was so hyped about using it for few times, but now its dying on mi...it wont connect to my wifi and i have tried many ways to solve the issue but no use...now i wanting to return it", "verified": true, "helpfulness": "2/3", "author": "Happy Monday"}, {"rating": 5.0, "review": "Great device in a market of mediocre, misleading and poorly executed technology. I have been a fan of Amazon products and service since their start as a  bookstore  site. It is no surprise to me that they have delivered a great product for TV. i own a tivo, roku, chromecast and other devices. i remain a roku fan. But the other devices disappointed. Fire TV delivered on the promise. exceeded expectations. And didn't give me a headache by espousing undefined tech terms. or, instructing me to loop through a help menu that provides no help. great product! i will be looking for more Fire TV apps and products.", "verified": true, "helpfulness": "0/0", "author": "Thomas Mccraw"}, {"rating": 3.0, "review": "Edit: removed two stars because with more extended use I discovered that the volume is substantially less than what I can get through the Roku 3 (both playing through a soundbar hooked to the TV). The loss of volume is a deal breaker for me. The rest of the functions are good, and it is worth having if you want to watch Amazon Prime videos while traveling.I have a couple of other streaming video devices and like having the Fire Stick for its portability and dedication to the Amazon media ecosystem. I have a Roku 3 on one HDMI input and the Fire Stick on another. I just switch inputs rather than having to navigate though a bunch of menus, to get to my library of Amazon media.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 3.0, "review": "So, I got in on the pre-purchase and bought one unit for $19.99.  Within a few hours of toying around with it, I wish I had just bough the limit of 2!Right now, I have 2 Chromecasts, a Roku 2, and 2 PCs hooked to 2 TVs, in addition to the FireTV Stick.  Each device seems to have one thing that the other does not.PC:  You have it all, but with the drawback of significant power (Watts) useage.The Roku 2, Chromecast and FireTV Stick all have access to the same popular streaming apps (except for YouTube on Stick?).  Here is what stands out, to me, from each unit:Roku 2:The headphone jack, in the remote.  My favorite feature of the Roku 2.The interface for apps is also seams to be easier on the  eyes (such as bigger text and movie images).Does have analog video/audio out.Chromecast:Extremely portable and can be shared among multiple people.  Runs off pretty much any USB port and USB to Micro USB cable.Cheapest streaming device out there, $35 or lower during specials.FireTV Stick (paired with Fire Phone):This seems to be the fastest loading device out of the bunch.Also very portable, like Chromecast, though you really need to have the 5W USB adapter AND the supplied USB cable to have full power.Good device for seamless Amazon content playback, whether it's music (X-Ray on big screen is nice), video or photos you have in your cloud.The voice search feature is convenient, using the Fire Phone as a remote in my case.You can also mirror some devices to the FireTVStick. I've only done it with FirePhone, though I may see if Kindle HDX can do it.You may be able to use it on a hotel TV but haven't confirmed yet.  I've heard Chromecast  is a no-go.Cheaper than FireTV with most of the same functionality.I can't say FireTV Stick is a \"Standout\", but it is a pretty solid product.  One possible limitation (I haven't checked) is no YouTube, but I can mirror the website from my phone, so it's not a huge issue for me.I will say this...If I could throw some headphones into my Fire Phone, I would probably buy another one @ full price right now and let my kids have the Roku 2 and donate my Chromecasts to charity.UPDATE: 12/11/14The internet connectivity keeps going out, with a \"Connected with Problems\" error.  Unsure if it is my Modem/Router changing device IP address or if the FireTV Stick has an issue.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "All I can say is Wow!  Better than expected and the Prime interface is the best I've seen.  Only tested it with Amazon and Netflix, which worked well.  Blows my parents Roku (2nd gen) away.Will buy more for gifts!", "verified": true, "helpfulness": "0/0", "author": "Jacoby Y. Wilson"}, {"rating": 5.0, "review": "LOVE, LOVE, LOVE this!!!  WAAAAAAAYYYYYY better than Chromecast!  So happy I bought it when it was offered at a discount for Prime Members.", "verified": true, "helpfulness": "1/1", "author": "Kate Astrakhan"}, {"rating": 5.0, "review": "12/11/2014We are Prime Amazon members and pre-ordered the New Amazon Fire TV Stick and it finally came yesterday 3 weeks earlier than expected!We have been using the ROKU 1 for the past year which we love...or thought we loved until I watched my 1st video via the Fire Stick. The quality of the video is 100% better with the FS and we finally can experience what our new HD TV can do!Installation took less than 5 minutes. I have paired with our lap top and my Note 3 which I can control the Fire stick from my Note!!!!We also pre-ordered a Amazon Fire TV Stick for our son and his family, they are so excited for it's delivery in Jan. 2015 to work with the Amazon Kindle we got them last year.I am so looking forward to listening to our Prime music and watching Prime Videos. So fun to watch You Tube videos I have uploaded of our children and be able to watch on the Big Screen!Only wish Amazon Prime would have a wider selection of videos like Net Flix. Happy Holidays to all, Heidi", "verified": true, "helpfulness": "0/0", "author": "hdiho \"The Best is yet to come!\""}]