[{"rating": 3.0, "review": "I like almost everything about it. ALMOST. The interface is really simple and looks nice. It does what it's supposed to so I'm happy about that. However, it doesn't have HBO GO which would have been nice. Also, I don't know if it's just the one I received or if it's that way for everyone, but the remote is very finicky and doesn't work properly. It gets stuck or it moves at lightning speed even though I only pressed it once. If they fix the remote and add HBO GO, this would be a very competitive product!", "verified": true, "helpfulness": "0/0", "author": "Shruti"}, {"rating": 5.0, "review": "Great product. Very fast and responsive, yet small enough to hide behind the TV. Remote is handy too, doesn't require a smartphone like Chromecast.", "verified": true, "helpfulness": "0/0", "author": "gwgiesler"}, {"rating": 5.0, "review": "Works great!  It was also fun to see Hill Climb Racing on our 55\" TV!!", "verified": true, "helpfulness": "0/0", "author": "D.Johnson"}, {"rating": 5.0, "review": "So far it works great especially with the smartphone app.", "verified": true, "helpfulness": "0/0", "author": "Doug from Tampa"}, {"rating": 4.0, "review": "Pretty good deal for the price.  A little disappointed at the \"works best when powered\" optional feature.  Because it really is not optional.  Without it, the stick does not work for me.Plus, the cable for the power adapter is a wee bit short.Other than that, very easy setup, already preconfigured for your Amazon account, simple navigation, and functions as advertised.Of course, the above review might be premature given that only a day has transpired.", "verified": true, "helpfulness": "0/0", "author": "Shri"}, {"rating": 1.0, "review": "So far it has been a paid to download updates, we can't stream without buffering, the picture quality is horrible and if we need tech help we have to call in and talk to someone. I will probably return it.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 4.0, "review": "Works great as advertised.", "verified": true, "helpfulness": "0/0", "author": "D. L. Moss \"oldcol\""}, {"rating": 5.0, "review": "We are very pleased with the Firestick. Had a little trouble the first time we tried to use it, but all has been resolved. Must point the remote in a direct line with the Firestick.", "verified": true, "helpfulness": "0/0", "author": "Frac Daddy"}, {"rating": 5.0, "review": "Love it!", "verified": false, "helpfulness": "0/0", "author": "Keshonda Harley"}, {"rating": 5.0, "review": "Yo this thing is really awesome. It's like chromecast meets apple tv for the exact right price point.", "verified": true, "helpfulness": "0/0", "author": "M. Kravitz"}]