[{"rating": 1.0, "review": "I'm not impressed with-it sorry I purchased it", "verified": true, "helpfulness": "0/1", "author": "Douglas P. Ford"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "CNabong"}, {"rating": 5.0, "review": "So easy to assemble and so many different apps to choose from. Love My Fire Stick:)!!!", "verified": true, "helpfulness": "0/0", "author": "dtabi"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Robert Flora"}, {"rating": 5.0, "review": "One of the best wish it had twc app support", "verified": true, "helpfulness": "0/0", "author": "kdogg"}, {"rating": 5.0, "review": "Good value for the money.", "verified": true, "helpfulness": "0/0", "author": "Bart"}, {"rating": 4.0, "review": "Works great. Wish they had a few more apps like nbc sports.", "verified": true, "helpfulness": "0/0", "author": "C"}, {"rating": 5.0, "review": "Awesome! A must have!!!", "verified": true, "helpfulness": "0/0", "author": "Erick Nila"}, {"rating": 5.0, "review": "Excellent device. I bought this for an old TV when the Roku finally gave out after years of service.There are lots of great reviews here so I won't duplicate all the details about what channels you get. My favorite features: - Amazons programs in the email address for your account so you can immediately start watching/buying movies once you connect to your wifi (which went smoothly). - Voice recognition is excellent. Before you buy the voice-enabled remote check to see if the app works on your cell phone (phone must have an IR blaster). You don't have to search all the channels for a specific video. Just say the name of the movie/show and it shows you what services (Amazon, Netflix, etc.) are offering it at that moment.These little features save a lot of frustration and time - good job Amazon!", "verified": true, "helpfulness": "0/0", "author": "NHShopper"}, {"rating": 5.0, "review": "I love it. It is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "PeanutsMommy"}]