[{"rating": 3.0, "review": "Very nice for an introduction to streaming, but for the serious cord cutter (person who drops cable ) I would have to go with ROKU for its channel options.  Still, Amazon is catching up and is better in response time than the other \"sticks\" out there.", "verified": true, "helpfulness": "0/0", "author": "J.H.T."}, {"rating": 3.0, "review": "As much as I like to watch amazon video and play games, this is truly inconvenient in terms of connecting my android tablet. It failed multiple times even I followed the instruction to connect. I have NO WAY to use TV mirror my tablet or phone.  The menu design is OK.  I wish it has built-in keyboard so can type to search.The set up is easy, and it is convenient to use. Just wish the connection with tablet can be really delivered as promised.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Cherry\""}, {"rating": 1.0, "review": "DO NOT RECOMMEND!!!  ONly has lying democRAT new channels!!!  Does not have Fox News or Fox Business!!  Does not have other channels I watch!!!!  Useless until it has the channels I want!!!  Instead of the channels Amazon (democRATs) think I want!!!", "verified": false, "helpfulness": "2/9", "author": "Johnny Conservative"}, {"rating": 1.0, "review": "I bought a Fire Stick for my husband for Christmas.  It seemed to work fine for a day or two and then kept saying the network connection was unavailable and buffered constantly.  I have FIOS internet and NO problems with other wireless video devices.  Customer Support told me to return the Fire Stick.  I talked at length with Customer Support about how disappointed I was.  They promised to call back...I never heard from them.  Now I have my 2nd Fire Stick and it is doing the same thing.  I kept Amazon Prime specifically to watch TV shows with the Stick.  What a disappointment.", "verified": true, "helpfulness": "0/0", "author": "Wade"}, {"rating": 1.0, "review": "Sadly the fire stick doesn't fit in our Samsung TV!", "verified": true, "helpfulness": "0/1", "author": "Nicola"}, {"rating": 1.0, "review": "This is false advertising. I got this item more than a month ago and Netflix app appears as unavailable since the first date!", "verified": true, "helpfulness": "1/2", "author": "Joe"}, {"rating": 5.0, "review": "This is easily the best $40 I have EVER spent in my life!! Easiest device I have ever dealt with, literally no set up, no hidden fees or charges. Best product I have ever gotten from Amazon or any other company. Excellent.", "verified": true, "helpfulness": "0/0", "author": "Saige Salazar"}, {"rating": 5.0, "review": "cool", "verified": true, "helpfulness": "0/0", "author": "Steve Sisler"}, {"rating": 5.0, "review": "Exceptional surpasses a wifi TV system, and its mobile if needed.", "verified": true, "helpfulness": "0/0", "author": "ajaxtalk"}, {"rating": 5.0, "review": "bought this during the initial promotion days when I got it for $19. Definitily worth the money.", "verified": true, "helpfulness": "0/0", "author": "Kiran"}]