[{"rating": 1.0, "review": "This may well be the most disappointing piece of technology I've ever bought.  Thank god I only paid the $18 preorder, but even that was $20 too much.It's constantly having wifi connection problems, which is odd as my router is about 3 feet from the TV.When it is \"working,\" it's really glitchy, buffers a lot, and has just flat-out stopped playback several times.  Sometimes it glitches longer than usual (like a half second) and makes a super loud chirp.  That's really fun.But it's really the constant \"loading,\" \"home not available,\" and bad connection messages that make me crazy.Lack of global search sucks, too.Oh, and the play button often doesn't work in Netflix.It's really just a poor experience.  I'm bummed, because I was really looking forward to this.  We watch a lot of Amazon Prime and rentals, so I like the top-level of Amazon in the UI, but man... The performance is killing me.  I'll be hooking the Roku back up.", "verified": true, "helpfulness": "1/1", "author": "Mikel Zwissler"}, {"rating": 5.0, "review": "Easy to set up and use and great to have a streaming device with Netflix, Hulu, AND Amazon instant video at a good price! The fire tv remote app with voice recognition is also cool, just wish it was available in the Apple Store.", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 1.0, "review": "Even for Plex you have to buy the app and TV stick does not come with it!", "verified": true, "helpfulness": "0/4", "author": "Max"}, {"rating": 4.0, "review": "I have 2 Roku 3's and a Chromecast. The Firestick isn't nearly as responsive as the Roku 3 but performs about the same as the Chromecast. For the money it's fine and since I primarily watch Amazon it was a good buy because it makes Amazon Video the center of attention. Hopefully they can push out an update that will make it a little snappier.", "verified": true, "helpfulness": "0/0", "author": "xman"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Darell Connor"}, {"rating": 5.0, "review": "So much easier to use than Chromecast", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 1.0, "review": "Still in the beta testing. I keep losing connection to my home network with 45 Mbps. I will call amazon again for the 3rd time. They are all pleasant in the trouble shooting process. 2 calls is enough for a follow up 1 star. I will keep trying to problem solve it with their tech team. Maybe I will make product better.", "verified": true, "helpfulness": "1/1", "author": "Ready"}, {"rating": 1.0, "review": "It won't let me log into my account and says it's doesn't match an Amazon account. I tried it several times and logged on just fine on my phone using the same info. It's driving me f***ing nuts that it isn't working", "verified": true, "helpfulness": "1/1", "author": "Tony"}, {"rating": 5.0, "review": "Great Product. so excited to get it. it works as it described. Plus point of this product is it comes with a remote. i like this much more than chromecast", "verified": true, "helpfulness": "0/0", "author": "subid"}, {"rating": 4.0, "review": "I purchased this as soon as it came out. Amazon delivered a great product. The only real reason I gave it a four is because there is no apple iTunes app.  It is odvious that there is legal issues and apple  is jealous of amazons competitive products, but at some point these corporate giants have to focus on the customers needs .  User friendly, easy to install, recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Mirna Chavarria"}]