[{"rating": 4.0, "review": "Would like a better selection setup for the music selection instead of having to scroll all the way through the artists everytime to choose songs.", "verified": true, "helpfulness": "0/0", "author": "Jason M. Wallace"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Maudi O"}, {"rating": 5.0, "review": "We have purchased six and we are utilizing four with two more for Christmas presents. We love what they do and how easy they were to set up.", "verified": true, "helpfulness": "0/0", "author": "C. Herring"}, {"rating": 5.0, "review": "Product works great and is very simile to operate. Very small and great for taking with you to a friends house or even to a hotel. Not to happy about being offered a free 30 day trial. And then 3 days into being charged for it. And after a week and a half of getting the charges reversed. Losing my free trial membership.", "verified": false, "helpfulness": "0/0", "author": "Ryan Kelley"}, {"rating": 5.0, "review": "Love it works great for entertainment", "verified": true, "helpfulness": "0/0", "author": "hugo"}, {"rating": 3.0, "review": "User interface can be improves especially mobile app. Its Slow compared to Chromecast. With release so later than Chromcast I was expecting other way around.", "verified": true, "helpfulness": "1/1", "author": "P. Jain \"PSPJAIN\""}, {"rating": 5.0, "review": "I really like the instant streaming for amazon content.  At first it was unnoticeable until I went to use netflix on the apple tv, and the buffering seemed really, really, slow..The voice search is nice if you are looking for content on Amazon, it doesn't check Netflix which would have been perfect.Cons:With the instant streaming sometimes there is a stutter here and there for a few secondsThe menus feel odd, it may be the lack of wrapping when scrolling up and down at the top/bottom of the list, or maybe the number of pre-selected not-installed applications in the menus.  I find myself using the voice search a lot, this has become less of an issue for me.", "verified": true, "helpfulness": "1/1", "author": "Larry Jones"}, {"rating": 3.0, "review": "I was also one of those that purchased the Stick for $19. Although back ordered by the time I placed the order, Amazon sent the device ahead of scheduled ship date. The usual fantastic Amazon service.The setup was quite quick and easy. A video played prior to setup going over the basics of the installation process.The Stick performs well. Somewhat disappointed in the menu system, not as intuitive or as well laid out as the Roku. Also a few of my favorite channels: WeatherNation & Sky News are not available on the Stick. Not a big deal as the stick will be used to primarily watch NetFlix or listen to Pandora on the spare TV. Have noticed a significant delay from the time a button on the remote is pushed until the desired action takes place.For the price I am satisfied with the Stick. Hopefully Amazon adds more of the available free channels in the near future as they certainly have an over abundance of games available for the Stick.", "verified": true, "helpfulness": "0/1", "author": "I. Stevens"}, {"rating": 4.0, "review": "I love the fire stick, but am giving it a 4 simply because I felt commercials were misleading. It seemed simple enough to pop the stick into the TV, but what was left out was the fact that it needs a power source and therefore has a cord plugged into it and needs to be very near to an outlet.", "verified": true, "helpfulness": "1/1", "author": "miskenzie"}, {"rating": 5.0, "review": "It works great, love it!", "verified": true, "helpfulness": "1/1", "author": "Jeff"}]