[{"rating": 5.0, "review": "I like it. Fire TV Stick installed easily and works as described. With this, I won't need to use similar functions built into my Blue-Ray player, which connected and buffered slowly. With the Stick's slick interface, I can find content I want and watch it very quickly.", "verified": true, "helpfulness": "0/0", "author": "DonC"}, {"rating": 2.0, "review": "I got my stick and set it up at home without any issues.  Then I went on a business trip so I can use it at the hotel. That is where I realized this stick was not usable with any wifi that requires authentication via a website since the stick does not have a web browser. I loved the portability of this stick and being a frequent traveler, I thought this would be useful for my trips. Please add a web browser to be able to use this on the road.", "verified": true, "helpfulness": "20/23", "author": "Paul \"paulwpark\""}, {"rating": 5.0, "review": "This is GREAT!  Super easy to install and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Maria Corby"}, {"rating": 5.0, "review": "Set up took just minutes.  Now I can enjoy my favorite shows while snuggled in bed.", "verified": true, "helpfulness": "0/0", "author": "Annette Fritz"}, {"rating": 2.0, "review": "Remote doesn't turn on the TV and can't control it. Appd are limited. Too Amazon centric.", "verified": true, "helpfulness": "2/4", "author": "mustang98"}, {"rating": 5.0, "review": "It's awesome. When you play music from the Amazon prime free music, most of them show lyrics or cool imagery of the band while music is playing. Everything is organized and categorized well. you can switch from music and movies in an instance. When I use my phones You Tube app to look something up it gives me the option to sync it to the fire stick. Same for the Netflix app. The only thing I'm disappointed about is that my friend came over so we could watch a show together and she couldn't sign in to the showtime app with her xfinity account. I don't know if it's cuz i have wifi set to a diff cable provider or if it's one of the other 22 options I'm not aware of.", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 5.0, "review": "Before getting the Fire Stick, I had to connect with Netflix and Amazon Prime videos through my BluRay player.  The interface with Netflix was okay, but the navigating the Amazon screen was a nightmare!  What I see when I connect using the Fire Stick is so much better, especially for Amazon videos.  Using the BluRay connection, I was unable to get the captions.  With the FireStick, navigation is so much easier and I can access all of the features.  Control of the videos is great, and there is no delay when you pause, restart or push the \"Home\" button.  There aren't too many buttons, (six plus the navigation wheel with the large select/enter/ok button in the middle)  and their functions are clear and intuitive, and easy to use.  We're very happy with the Stick!  My BluRay player will now only be used to play video discs.  Thanks also to Amazon for offering pre-order at a discount to Prime members.  My Prime membership is one of the best online subscription investments I've made.Minor negatives - the remote is small, and the back of it is curved, and it's a bit hart to keep track of.  It falls off of my chair arm and gets stuck in the cushion.  I'm also not impressed with the game play.  Perhaps it would be better if I purchase the game controller, but play is clumsy using the FireStick remote.  Not that this is really important, though.  For games, I have my Kindle Fire tablet, and my smart phone.  I've experimented controlling the FireStick with the Kindle fire app, but I won't rate that interface until I've had more time to get used to using it.", "verified": true, "helpfulness": "0/0", "author": "James T. Jacobs"}, {"rating": 4.0, "review": "Works well, easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Brian Oikarinen"}, {"rating": 4.0, "review": "Works really well, like it more than chromcast but it does not have HBO go.  Hopefully they will get it.  Then it will be 5 stars!", "verified": true, "helpfulness": "0/1", "author": "Kevin"}, {"rating": 5.0, "review": "This is a great product.  Setup was easy and the thing is nice and small.  Navigation is fast and intuitive.", "verified": true, "helpfulness": "0/0", "author": "kpsmith"}]