[{"rating": 4.0, "review": "Before buying the Fire TV Stick, I had been streaming Netflix from my Wii game console. (Lol, sad, I know). I was unemployed for a time and had decided to cut the cord to save money. Got Netflix and the only device I had for streaming to my TV was my Wii. I was actually content with that, I found out that I loved Netflix and did not miss cable TV at all! So now I have a great job but have no desire to go back to cable. I became an Amazon Prime member for even more viewing content. I got the Fire TV stick for the 19.00 deal. And I love my Fire stick! I mean now I can watch my shows in HD, which of course the Wii was incapable of. I had been considering the Google chromecast but when I saw the 19.00 deal for the Fire stick and read about its features (along with comparisons to Chromecast  and Roku) I had to go for it. I did have some issues downloading the software. The stick recognized my account but then gave an error. I had to call tech support and they had me unplug the stick from my TV and the outlet and plug back in after ten seconds or so. Then it downloaded extremely slowly. I thought this thing is never going to work. But it did. I do have some issues every once in awhile where it will pause and reload. But most of the time I can watch for hours with no issues. And a few times I had to unplug and then plug in the power adapter for the stick before my TV got a connection.  But once I do that it is fine for the night. Luckily I have easy access to the power outlet. So no biggie for me.I do have a really old router that I have been using since 2006 so that might account for some of the issues. For me the issues are so minor, I mean for 19.00 I can now watch in HD and I also can watch Project Runway on the Lifetime App. Yay, I used to have to watch it on my iPad. And there are other apps that I have not tried yet. I have not done much with the games either. Too busy binge watching all the great shows! I also like the little remote that comes with the stick. Much rather use that than a phone or tablet.So all in all, the stick may not be perfect every time, but for the most part it works just fine. Maybe I would not be so nonchalant if I had paid 39.99 for it instead of 19.00. I am very happy that I bought the stick and for me it has made my TV experience even better and I don't see myself ever going back to cable TV.Thank you Amazon and Netflix!", "verified": true, "helpfulness": "0/0", "author": "difrei \"difrei\""}, {"rating": 5.0, "review": "I was amazed at easy to install and start operations.  The quality of the picture was outstanding.  Everyone should have one.", "verified": true, "helpfulness": "1/1", "author": "Joseph H. Macmillan"}, {"rating": 1.0, "review": "Shame on you Amazon! We pre-ordered two of these because we got a deal being prime members. I was excited how small and portable these were! A month later we got them when they rolled them out! Nowhere in the commercial did it say you need to ALSO plug it in to a power source and that it cannot draw power just through the TV! This wouldn't be such an issue, but of course the cord they give you is short! I wish Amazon wouldn't have advertised a \"smaller\" alternative to Fire TV, when really it's a BIGGER pain in a SMALLER package!", "verified": true, "helpfulness": "1/9", "author": "Clownbus"}, {"rating": 5.0, "review": "Love the Fire TV Stick!  We can stream all of our favorite videos and even play some cool apps.", "verified": true, "helpfulness": "0/0", "author": "Carmen McCoy"}, {"rating": 5.0, "review": "So far so good, quite powerful and has the Bluetooth remote over the chromecast for the same price. Plex is awesome on it, most of the apps are great as well, I can honestly say I never run out of things to watch. WiFi range is good and it is fast as well. Wireless dispay mirroring for Intel based laptops as well as any android phone is a plus. Did I mention it's at a better price point than the chromecast?", "verified": true, "helpfulness": "0/0", "author": "bloop"}, {"rating": 3.0, "review": "I like the size the the cost (introductory offer of $20) of the device. Have used it for a month now and I am probably not so happy as I hoped for.Cons:- There are additional clicks and screens when opening/streaming the apps.- Asks me to key in the passcode even for prime videos and for videos that I have already purchased, this just doesn't make sense. When I use the amazon instant watch app on my PS3, it only asks me to key in the passcode only when buying movies/episodes.- Biggest disappointment for me is that the \"search\" only searches within the amazon content. I remember reading that fire tv (bigger device) searches across the apps, guess the fire tv stick does not.I think the device still needs improvement. I would have returned if I hadnt paid just $20 for the device.", "verified": true, "helpfulness": "0/0", "author": "Deeps"}, {"rating": 3.0, "review": "Supposed to be competitor to ChromeCast but how do you show web browser on your tv?", "verified": true, "helpfulness": "2/2", "author": "Ann Peterson"}, {"rating": 4.0, "review": "Beautiful visual of all apps and movies and TV shows. I did not give it 5 stars because I have to pay for some seasons of shows that are on this. With Apple TV I do not have to pay to watch seasons and it gives me more options like HBO 2 Go and Showtime, both which are not available for the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 4.0, "review": "Great unit for Prime Instant Video. I watched True Blood for the first time and the surround sound was as good or better than a DVD.", "verified": true, "helpfulness": "0/0", "author": "Jim Brychka"}, {"rating": 5.0, "review": "Does everything they said it would and does it well. Thousands of movies and TV shows to choose from plus Apps like Netflix. Also, Amazon says it is not through adding more things to entertain you!", "verified": true, "helpfulness": "1/1", "author": "Rob"}]