[{"rating": 4.0, "review": "Great device, I am online from this device to watch Netflix and Hulu Plus. Unfortunately; No Vudu is on this device but that's okay still a great device for the sales price I paid for this. I wish it would play through my surround sound that is something I am still working on. But still a work in progress, this Amazon stick will work on any television so I am not restricted to just one TV in my home. Love, Love , Love this Device!!! Way to go Amazon Fire Stick", "verified": true, "helpfulness": "0/0", "author": "BatteryHappy"}, {"rating": 5.0, "review": "Love it!!  once I figured out how to get some of the additional apps on there, specifically YouTube, I was good to go.  Sleek design.  Fast speeds.  Good graphics.  Get yourself one.", "verified": true, "helpfulness": "0/0", "author": "Christopher R. Null"}, {"rating": 4.0, "review": "It's a neat little device.  I find it a great compromise between the chromecast and the roku stick.  The chromcast is hugely versatile since it's controlled via your phone and any app can control it.  It has no real common user interface.  The Roku stick has no real expandability (I haven't tried the more recent ones, I might be wrong), but that allows the user interface to be well designed and well tested.  The Firestick fits nicely in the middle.  It has a decent user interface that the chromecast lacks, but allows for app installation from the amazon app store.There is usually a two level menu and then you scroll left and right to see all the media choices similar to the netflix UI.  It will provide you with recommendations.  Most importantly, you can view the Prime library.  The UI while watching was pretty well thought out.  If you press left or right once, you get a 10s skip.  It's useful when you miss a line of dialog.  One press to the left and it skips back.  If you hold left or right you FF/Rew.All in all, I'm happy with it.At this time, I've found one small bug.  While quickly scanning through media choices, it can freeze up for a second.  It will buffer any input and catch up when it continues.  This has the effect of you pressing right and not seeing anything, so instinctively trying again and again.  Once the device unfreezes, you're three choices along.  It isn't anything huge.", "verified": true, "helpfulness": "0/0", "author": "Bhroam Mann"}, {"rating": 5.0, "review": "Being a Prime Member, I got the Fire TV Stick for  $19.99, best thing I've bought in a long time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to Set up, intuitive interface.  I was impressed with its responsiveness when entering commands onto the remote.  Great value in a small package !!!", "verified": true, "helpfulness": "0/0", "author": "James A. Smith \"Taystee\""}, {"rating": 4.0, "review": "My husband loves the stick because it has ESPN, and he watches it everyday since we received it.The reason why I take out one star is because of the remote controller. First, the battery pocket is very difficult to open. It does not have a place for your fingers to hold and slide open the pocket cover. It took us a long time to open up the battery pocket cover. It was not a pleasant open box experience when you have your finger turn red from trying to open the cover.Second, the remote controller is difficult to use, especially when you have an impatient family member. You have to press every button carefully and wait until the screen reacts. The remote control has a flimsy plastic feeling, and there is no feedback ( light or sound) after you press buttons, but only the plastic \"click\" sound like an old style toy. The circle button is very confusing since I have no idea if I pressed the right direction and have to wait a while for the screen to react to know if I did it right. During my hubby's first use of the controller, he pressed the buttons many times without waiting for the screen to react, then the button stuck. The TV starts to make funny clicking noise and the whole screen froze. In the end, he download the Android remote controller to the phone to control the screen.Other than the controller, everything works great. Now we do not use the controller and feel happy about it.", "verified": true, "helpfulness": "0/0", "author": "Susan. W. \"sunnysmom\""}, {"rating": 5.0, "review": "Simple and easy to hook up. Excellent Christmas stuffer!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Mostasa"}, {"rating": 3.0, "review": "I used the fire tv stick the first dayand I thought it was really nice and easy to use. Setup to my wireless network went smoothly and the firmware update completed succesfully (took a bit of time but was successful).  I watched several shows without any freezing the picture quality was very good and the sound was good.  on the thrid show I tried watching via the 'History Channel app' ended up freezing on me several times.  I'm not sure if this was an issue with the fire tv stick or my wifi/internet connection.  I marked it up to a internet/network issue.  The following day I got new internet service (switched from Century Link to Comcast) and now I cannot get my fire tv stick to connect to the internet.  I know the fire tv stick works, so it has to be an issue with my moden/router configuration with Comcast/Xfinity.  However I have not been able to find any help on either Amazon or Xfinity to fix the problem therefore I cannot use the fire tv stick I purchased so I'm giving it 3 stars.  I believe this is an issue with my Router not the fire tv stick but I cannot rule anything out yet.", "verified": true, "helpfulness": "0/0", "author": "rider"}, {"rating": 3.0, "review": "It has a lot of great features, but the interface is clunky and I HATED the unskippable into video. If you aren't deep into the Amazon ecosystem, you're probably better off with a chromecast.", "verified": true, "helpfulness": "0/0", "author": "Steven Rider"}, {"rating": 5.0, "review": "Amazingly easy to install - true plug-and-play. Very glad I bought it!", "verified": true, "helpfulness": "0/0", "author": "Sujata Subramanian"}]