[{"rating": 2.0, "review": "I love this product. It is fast and always on unlike my blue-ray player where it takes a few mins to get on to netflix or amazon prime.The problem I have is, when this is connected to HDMI port on TV it interferes with programs I get on air using TV antenna. So when I  want to watch TV programs, I have unplug this from TV. I don't know if I am the only one with this problem!", "verified": true, "helpfulness": "1/1", "author": "Shyam Kumar"}, {"rating": 2.0, "review": "i even ordered a replacement and it still constantly buffers. nothing else I own buffers this bad, even my old vizio smart tv. maybe Its a router settings issue.", "verified": true, "helpfulness": "2/2", "author": "Adam Yeager"}, {"rating": 5.0, "review": "Buy it! It is easy and convenient and you can do so much with it.", "verified": true, "helpfulness": "0/0", "author": "Rie"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Andie"}, {"rating": 5.0, "review": "\"Love ❤ It\"", "verified": true, "helpfulness": "0/0", "author": "Sharon Martin"}, {"rating": 4.0, "review": "I bought this instead of the Fire TV as I didn't need the gaming features.  The Kindle Fire Stick is easy to install and setup.  Takes just a few minutes.  I have 30MB internet download broadband speed with a 5G wireless connection going and it is working great for movies, shows, etc.  Easy to operate and the apps are great.  Highly recommend.  If you don't need the gaming, save yourself the $60 difference in price and you should be happy.", "verified": true, "helpfulness": "0/0", "author": "R.L.W."}, {"rating": 5.0, "review": "Easy to set up and use. We absolutley love it!", "verified": true, "helpfulness": "0/0", "author": "Pat C."}, {"rating": 5.0, "review": "Wonderful device", "verified": true, "helpfulness": "0/0", "author": "Bonita L Howard"}, {"rating": 5.0, "review": "Great. It has a lot to offer", "verified": true, "helpfulness": "0/0", "author": "Patrick Ingram"}, {"rating": 1.0, "review": "Absolute piece of crap!  Customer service was so horrible had I been a first time Amazon customer I never would have bought anything from them again.  These units are defective.  I bought this before the holidays hoping to have an easy way to access Amazon Prime through my TV.  Wrong.  All you have to do is do a google search on Fire Stick doesn't work and you'll find plenty of customers who are probably too pissed off to bother writing a review.  I tried all the fixes suggested.  Finally I thought I would exchange it for one that worked (if that was even possible).  I got transferred  to 5 different people and was told to wait on hold by each of them... each one telling me they weren't authorized to exchange my product.  What a time sink!  Unless you're looking for a new hobby ... you should definitely pass on this unit!!!", "verified": false, "helpfulness": "1/2", "author": "Naomi B Duane"}]