[{"rating": 4.0, "review": "Weak Wify CD roku", "verified": true, "helpfulness": "0/0", "author": "Luis M. Viera"}, {"rating": 5.0, "review": "Just Love it...easy to use and no commercials", "verified": true, "helpfulness": "1/1", "author": "Debra Martin"}, {"rating": 4.0, "review": "It's pretty fast when browsing which I like, but there's no easy way to switch between my TV and the Fire TV stick.  Otherwise I would have given it 5 stars.", "verified": true, "helpfulness": "0/1", "author": "Theresa Preston \"Theresa Preston\""}, {"rating": 5.0, "review": "I have to say I love this thing.  Initially I thought you just plugged it into the HDMI jack, but I quickly learned that there is power as well (DUH).  It worked out well for me though since I can plug the power into the USB in the back of the TV.  The Content is perfect, as is the menu setup.  I have a Roku as well, and I definitely prefer the Fire TV.  Honestly, the only complaint I have is that you can't get rid of cable completely and go to this.  Maybe someday.  For the money, you can't beat.  Buy two......I did.", "verified": true, "helpfulness": "2/2", "author": "midwest golf guy"}, {"rating": 5.0, "review": "Maybe Amazon didn't did great with the fire phone, but they certainly did an awesome job with the fire stick! Bought one with the half price Prime offer, bought the second for the regular price. The only reason I keep the chromecast is because of the mirror screen functionality I have with my android phone.", "verified": true, "helpfulness": "1/1", "author": "StevenL"}, {"rating": 5.0, "review": "Clever little device, the kids love it on their TV's (yes we are that kind of family). I love Google TV but this is a slicker interface.", "verified": true, "helpfulness": "1/1", "author": "idomagic"}, {"rating": 5.0, "review": "The Fire TV Stick is a neat product that was very easy to set up and use. I enjoy the fact that I now have 1 device to get all of my streaming media that I use instead of having several units that I need to do the same thing.", "verified": true, "helpfulness": "4/4", "author": "The Photographer"}, {"rating": 3.0, "review": "I have, Roku, Apple tv, bluray/wifi and a smart TV. Now Fire stick. I found the navigation of the fire stick confusing. Also, installing the batteries in the remote is a challenge. I bought this on sale other wise I would return it for Roku which is the best in my opinion.I was surprised that Amazon had not perfected this device more. Disappointed with this.", "verified": true, "helpfulness": "1/3", "author": "LMFAN \"lmfan\""}, {"rating": 4.0, "review": "limited and gets hot fast which tells me it is more apt to burn out some day.  definitely could be better.  since i got it at $20 i cant complain at all.  Also requires usb power but wont work on tv supplied power (at least in my case) must use power outlet to plug in usb transformer (supplied).  also firmware offers channels that this device will not work with.  you try to use it just to discover that you need to buy a different product.  if the frigin thing doesn't support it - it should not tease you with it.  just another up sell attempt.  For $20 buy it just to throw into your travel bag but don't waste your time if this is going to be your primary device.  Buy a Roku or similar.", "verified": true, "helpfulness": "1/2", "author": "Rick Burks"}, {"rating": 5.0, "review": "Unbeatable for the price. Got it on sale at brick and mortar store. Nice to have it as secondary unit on upstairs tv.", "verified": true, "helpfulness": "2/2", "author": "nrn"}]