[{"rating": 3.0, "review": "Im a college student who ordered this for my on campus apartment I was so excited for it to come in. When it came in it was working well BESIDES the fact that it doesn't work with college internet logins. It doesn't let you use the username and password interface to log on so it doesn't work with college or hotel wifi. They should have fixed that from the beginning because most college students are the ones who want this device to be able to stream to their tv. there saying there making an update for it soon hopefully they mean it.", "verified": true, "helpfulness": "0/1", "author": "GN"}, {"rating": 3.0, "review": "At first, I was extremely happy with this little device. Very easy to install and set up. However, a few months in, I am having a problem with error messages with it. Oftentimes, I will be in the middle of a show and it will boot me back to the home page, at which point it will freeze up and tell me I am having connectivity problems with wi-fi... However, when it does this, I have no trouble with the wi fi on other devices. So often I will start a show on the TV using the stick, and then have to go finish the episode on my computer. Then several hours later, I will come back to it, and it will be fine...  Sometimes when I unplug it and let it reboot, it works fine again moments later. Unpredictable.", "verified": true, "helpfulness": "0/0", "author": "Eric Rufa"}, {"rating": 5.0, "review": "Love having amazon prime on my tv downstairs I use it all the time", "verified": true, "helpfulness": "0/0", "author": "Jamin"}, {"rating": 4.0, "review": "I would give it 5 stars if you didn't have to pay extra for the voice remote or the gaming controller. I would've paid a little more up front for those things. Other than that I love this little bit of tech. It runs seamlessly with no lagging, and the best part is it brings my older T.V. into the new era.", "verified": true, "helpfulness": "0/0", "author": "Kamara32"}, {"rating": 3.0, "review": "I thought there would be more selections and more without being charged for having.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Demers"}, {"rating": 4.0, "review": "Yes I love it. Now you could get ESPN and BTN I would seriously consider ditching cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Worked great the first time I installed it.  Love It!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Has eveything that I was looking for!", "verified": true, "helpfulness": "0/0", "author": "Casey Carden"}, {"rating": 4.0, "review": "Should have probably upgraded to next price range. While it performs as we hoped, Netflix, etc., the remote is fairly limited. Often skips episodes, starts without \"being told to\" and difficult to backtrack to episode we wanted. Usually have to go back and start the process over.", "verified": true, "helpfulness": "0/0", "author": "Saundra Lawson"}, {"rating": 5.0, "review": "Loved it!!!!", "verified": true, "helpfulness": "0/0", "author": "Patricia Cecchi"}]