[{"rating": 4.0, "review": "I like it very much, I can see good quality movies and even my Hulu.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 4.0, "review": "Is a great substitute for a roku. Easy to hook up, and also is a really smooth UI. Only downside is needs a power outlet.", "verified": true, "helpfulness": "0/0", "author": "VanHow10"}, {"rating": 5.0, "review": "Fire TV Stick totally met my expectations! We were very frustrated by the fact that we were paying for Amazon Prime but unable to access the free movies/TV shows because our TV's were not compatible (too old) with the newer technology.  Fire TV Stick to the rescue!  It makes every TV with the proper plug-in feature compatible and the installation/set-up was simple, too.  Now we can enjoy the full spectrum of what Amazon Prime has to offer and then some.", "verified": true, "helpfulness": "0/0", "author": "STEVE J CLAYTON"}, {"rating": 3.0, "review": "After the 2nd one developed the same glitchy functionality within days of replacement I'd have to say there are more than just a few software related bugs and perhaps some hardware related limitations.Having smart tv's and smart devices already, the Amazon account integration for auto sync to see content from my account that was synced from my phone made the idea worth while to order. At the promotional price it was a no brainer. In practice the extra RAM still wasn't enough.It is still a far stronger experience than an EZ-Cast device but not the top flight experience I was expecting.Started out good and then crumbled in video and responsiveness. Nice interface and solid integration but doesn't handle the personal content demands for photo and video to the point where those impede the quality of the rest of the services.I can't say for certain that it is the 43,000 plus photos and videos that I've cached through or the circuitry not holding up.It had minor hesitations from the beginning that got more frequent and freezing up for longer periods. Network tests on my home wireless and service provider showed now issues.YMMV.", "verified": true, "helpfulness": "0/0", "author": "J. Silberman \"jsmail951\""}, {"rating": 5.0, "review": "Enjoy the free items to watch!", "verified": true, "helpfulness": "0/0", "author": "T. Allen"}, {"rating": 5.0, "review": "Plugs into the HDMI port, hooks up to our WIFI network. Plays Prime Music, Videos, Games, and Apps like Pandora and Netflix. Greatly expands our entertainment choices without having to figure out how to stream from our iPad.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great and as expected!", "verified": true, "helpfulness": "0/0", "author": "Merrill Prazenka"}, {"rating": 5.0, "review": "I absolutely love the Fire TV stick!!!  I was able to connect it to the TV and get started with ease.  Browsing the home screen and other menu options was simple.  I am so glad I made this purchase!!!!  THANK YOU AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Lady V"}, {"rating": 5.0, "review": "Easy to set up & navigate", "verified": true, "helpfulness": "0/0", "author": "Mary Cassaro"}, {"rating": 1.0, "review": "It worked good for about 30 minutes.  Now it won't stay connected to my wifi.  I constantly have to power cycle it and reconnect.  Don't waste your time.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}]