[{"rating": 5.0, "review": "I like it, it's easy to use.", "verified": true, "helpfulness": "0/1", "author": "silavy"}, {"rating": 1.0, "review": "I was using the HDMI extender that comes with it, and it was plugged into the back of my tv literally about 12 inches away from my router. It kept dropping the network. It would stream video from any app for more than 1 minute before it would drop the network. I looked around online for possible solutions and found a lot of people had the same issue. Couldn't figure it out, everything I tried didn't help. Amazon themselves said that this has been a problem. Looks like I'm going with Roku.", "verified": true, "helpfulness": "0/0", "author": "Jared Crossley"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "Johnny2177"}, {"rating": 1.0, "review": "Doesnt pick up my wireless in the next room. My phone does more than a half a block away.", "verified": true, "helpfulness": "0/1", "author": "Gregg Juleen"}, {"rating": 2.0, "review": "Graphics are amazing and device is very functional. Amazon and Netflix work really well but Hulu always buffers and misbehaves, something it doesn't do with my Roku. I've quit using the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Scott A Beck"}, {"rating": 5.0, "review": "Fantastic!!!", "verified": true, "helpfulness": "0/0", "author": "poppy \"lynn Sweikhart\""}, {"rating": 5.0, "review": "It works like a champ! Great price!", "verified": true, "helpfulness": "0/0", "author": "arthur g ruiz"}, {"rating": 5.0, "review": "Awesome.  Works like a champ and getting all app content like hbo now, Netflix.", "verified": true, "helpfulness": "0/0", "author": "K. Liu"}, {"rating": 5.0, "review": "Love it. Wish Amazon had a larger movie selection but the Prime Original Series are proving to be good so far. Also HBO and others jumped on board and it makes it really nice to watch. I like to use this device alot. It is super easy and quick to pick up...auto shutoff makes it nice at bed time, turns back on instantly after pressing any key. It relocates easily and never loses memory that I can tell. I move it room to room often it is so easy no need for multiples. What can I say? Its great.", "verified": true, "helpfulness": "0/0", "author": "J.Wick"}, {"rating": 5.0, "review": "Works great. Fast connection", "verified": true, "helpfulness": "0/0", "author": "Ruth Whitted"}]