[{"rating": 5.0, "review": "You need this!Even if you don't have Amazon Prime, you can still use it for all kinds of video and music streaming.It's an amazing value for what you get, even if you already have a HTPC setup, the menu system & simple remote will have you going back to using this as your main viewing device.It also works great with the newer style Computer monitors that have a HDMI port and an Audio out port built in, so you can turn your monitor into a streaming TV to save space in a smaller room.", "verified": true, "helpfulness": "0/0", "author": "N. H."}, {"rating": 3.0, "review": "Only worth it if you have the ability to log into apps like HBOGO and ShoTime... Some apps, like History Channel, have a limited number of ways to sign in, so if you have DirecTV, you can't use the full History Channel or A&E; App's... Keep that in mind when ordering them. I honestly don't think this would be worth even $39 if you can't sign in to get full access to these apps.The only thing I wish I could have is access to the WD My Cloud App so I could stream audio/video from my 2tb WD My Passport Wireless Hard Drive. It lets you download the VLC Player App, but I can't figure out how to import any .mp3, .avi, .mp4, or .mkv files from my personal library.If I could get rid of my WD My TV Live and use the Fire TV Stick as my only media player, I'd give this a 5 star review.", "verified": true, "helpfulness": "0/0", "author": "ShojoBakunyu"}, {"rating": 5.0, "review": "It works great with perfect mirroring!", "verified": true, "helpfulness": "0/0", "author": "Adonas"}, {"rating": 4.0, "review": "It's ok. It's growing on me. Wish the apps already came pre downloaded like the Apple TV...", "verified": true, "helpfulness": "0/0", "author": "Rochelle"}, {"rating": 5.0, "review": "Everything I had hoped for.  Bring the good stuff of Amazon to my best TV.  I am NOT fussy.", "verified": true, "helpfulness": "0/0", "author": "Localhostess \"Audio is a different animal from print books.  Especially if your genre is Mystery.\""}, {"rating": 5.0, "review": "Works great. I would recommend to a friend.", "verified": true, "helpfulness": "0/0", "author": "John A. Smith"}, {"rating": 5.0, "review": "Love it! Portable and I can watch all of my shows anytime and anywhere!", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 3.0, "review": "a lot of stuff charging a fee, not much free available.", "verified": true, "helpfulness": "0/0", "author": "Madeline West"}, {"rating": 2.0, "review": "very sluggish interface, I don't know whether it's underpowered or whether the OS is rubbish but it's not a pleasant experience.", "verified": true, "helpfulness": "1/1", "author": "JL"}, {"rating": 2.0, "review": "This device works well but needs  a Very High Signal from the wireless connection to work acceptably. This is 1 foot from my wireless router and my connection is very fast. Some Apps like Sling TV are terrible on this device. Other devices like XBOX One and Roku have no issues with Sling TV.", "verified": true, "helpfulness": "0/0", "author": "Dave"}]