[{"rating": 1.0, "review": "Didn't realize I had to pay for everything", "verified": true, "helpfulness": "0/0", "author": "delleah cervelli"}, {"rating": 5.0, "review": "We absolutely love the Fire stick! We are ordering three more for another room and the kids' rooms. It works great and seems to not lag while playing. The games section is impressive and we are debating ordering a couple controllers. Awesome buy, no regrets here!", "verified": true, "helpfulness": "0/0", "author": "Nicholas McIntyre"}, {"rating": 2.0, "review": "All was good, but haven't able to get costs factors involved....  I had funds withdrew from my acct without notice.  So, I now know the membership costs, but not how often membership costs will be deducted, nor other costs involved.  Therefore, I rated a 2 star.", "verified": true, "helpfulness": "0/0", "author": "darrell"}, {"rating": 2.0, "review": "Comcast doesn't recognize it.", "verified": true, "helpfulness": "0/0", "author": "John Stackhouse"}, {"rating": 4.0, "review": "I already own an Apple TV and was hesitant about this initially however the cost factor was tempting so I went with it. Performs really well. Pleased with this purchase. Have not had any major issues with this. Didn't realize that purchases could be restricted with pin but daughter had already bought some tv episodes. Simple remote and interface.", "verified": true, "helpfulness": "0/0", "author": "pradeep prabhakar"}, {"rating": 5.0, "review": "Love it, only streamer I use.  I have Amazon Prime and Netflix, and haven't experienced any problems with buffering or slow streaming. I cut the cable cord 4 years ago, and this is my first intro to streaming, and the first time I've used television since then. Easy easy easy to set up, but I had a LOT of trouble opening the battery compartment in the remote. Other than that, totally satisfied.  So good not to have to listen to the incessant jabbering noise of television and the assault of the constant commercials.  I'm recommending Firestick to all my friends who are sick of cable TV.", "verified": true, "helpfulness": "0/0", "author": "S. Carney \"Suesista\""}, {"rating": 1.0, "review": "if your looking for free content this isn't the way to go", "verified": true, "helpfulness": "0/0", "author": "paul karpenko"}, {"rating": 2.0, "review": "Works pretty much like a roku but doesn't have time Warner app which is a deal breaker for us. Didn't know that so are stuck with it now. But does work nicely and has an app.Update: i dont think the interface itself is bad but Amazon servers certainly are. All movie streaming services are buffering all the time. Netflix, Hulu and even Amazon Prime. I switch over to my old PS3 and no problem. Same wifi connection etc... If Amazon wants to get into Apple land and compete they better get their servers in order. I unplugged this POS as it also changes the tv source input so my wife and kids dont know how to get it back to HDMI 1 which EVERYTHING else is on. Wish my ROKU hadn't died and didn't replace with this. Didnt return it as Amazon would charge $8.95 to return.", "verified": true, "helpfulness": "0/0", "author": "Stingray240"}, {"rating": 3.0, "review": "I like the price, I like the flexibility. However I just am unable to look past how choppy the video is, tickers stutter, frames are consistently lost. I have had several months to compare devices, and have hoped maybe an update would correct this as fire TV is relatively young, but not yet and maybe not ever. Image quality on roku is much more detailed and color is much more accurate vs. Fire TV.  And when there is motion like sports or action sequences, so many frames are lost it is almost a bit disorienting. And with Sling Television, Roku supports 4.7mbps where fire TV caps out at 3.7.  When watching sports the difference is astounding. The roku stick is smooth, colorful with bright whites and deep blacks. By comparison the fire stick is choppy, washed out and generally bad with colors. Why? Everything spec wise should suggest the opposite. I hope that it is software/codec issue and will be remedied soon. Honestly a bit disappointed.", "verified": true, "helpfulness": "0/0", "author": "joque pickytech"}, {"rating": 5.0, "review": "Love this little gadget!!! Perfect for traveling!!", "verified": true, "helpfulness": "0/0", "author": "Alynn Terry"}]