[{"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "amazonprimer"}, {"rating": 5.0, "review": "Very easy to set up, with the free aps you get a great selection of tv, movies or games. I have not gotten through all it has to offer yet.", "verified": true, "helpfulness": "0/0", "author": "RLN"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "james a shuping"}, {"rating": 3.0, "review": "I got this for the sole purpose of watching Sling TV on my TV. It's good for what it is, but is functionally no better than Roku or AppleTV, unless your goal is to watch Amazon Video. So for Sling TV and Amazon Prime, it's great, but that's it. The physical remote and the need to download specific apps to Fire TV are so last decade. The Fire TV Remote app for Android makes navigating even more difficult than the physical remote. Finding content to watch or listen to is not an easy task. And even if I start watching Amazon video on my phone, I can't easily send it to the TV. Amazon needs to take a cue from Google's Chromecast. And if Sling TV and Amazon Prime worked with Chromecast, I wouldn't have this.", "verified": true, "helpfulness": "0/0", "author": "J. Caprioli"}, {"rating": 5.0, "review": "Best Purchase I made in a long time!!", "verified": true, "helpfulness": "0/0", "author": "MsTeeta"}, {"rating": 5.0, "review": "It really great!!!", "verified": true, "helpfulness": "0/0", "author": "julitza rendon"}, {"rating": 5.0, "review": "Very easy. Nice to not have to use your iPhone to stream you can see it all on the TV. There is the option to use your phone as the remote but the remote is nice. Would choose this over google chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ashley B."}, {"rating": 4.0, "review": "It was easy to install and it's easy to navigate through. I'm not real crazy about the movie selections though. I'm not into all the TV series, I just want to watch good movies. It would be nice if there were classic movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "jph"}, {"rating": 5.0, "review": "I love it. It makes my prime instant video super.", "verified": true, "helpfulness": "0/0", "author": "laura coleman"}]