[{"rating": 5.0, "review": "Easy to watch and interfaces well with our Prime membership. I also like using it to listen to my Pandora station.", "verified": true, "helpfulness": "0/0", "author": "Erica Wood"}, {"rating": 5.0, "review": "Very happy, we purchased two of them.Works great, no issues at all.", "verified": true, "helpfulness": "0/0", "author": "Nashawnya L  McCray"}, {"rating": 3.0, "review": "I love the fire stick.  It is very easy to use and opens up your TV to all of Amazon Instabt Video.  Which is amazing.I went from using the Google Chrome Cast stick.  I had planned to just throw that stick away but then I found that there were things that Amazon's Fire stick does not do.Disney has a program called Disney Movies Anywhere.  This goes through Vudu, Google Play or ITunes.  I buy Disney Digital copy videos a lot.  I can't play them through the Amazon Fire Stick because the stick doesn't access these aps.Also, for some reason, the Hulu Ap doesn't notify me when one of my regular programs I'm watching, has come out with a new episode.  It does if I log in to the Ap on my phone.  Seems like a small feature but I don't have cable so waist time looking through each show to see if there's anything new.They recently handled their YouTube ap so I can use the ap from my phone so that works well now.But overall, the fire stick seems faster.  I also like working with a remote witch the Chrome stick doesn't offer.I would recommend this and hopefully they sort out the Disney thing*also HBO Now needs an ap because it's not currently working through The Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Meg"}, {"rating": 1.0, "review": "Won't stay connected to wifi. Streaming videos freeze. Miracast has yet to work with kindle fire hdx. Some days it won't turn on at all.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Hunt"}, {"rating": 5.0, "review": "Love this stick. Its like falling in love with television all over again. Thank you amazon.", "verified": true, "helpfulness": "0/0", "author": "Devlin R. Idell"}, {"rating": 5.0, "review": "Great product and so glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Wes BUY$  Tampa Houses 813-444-8989 \"Wes BUY$ Houses - CA$H\""}, {"rating": 5.0, "review": "Perfect addition to have.  Much more portable than the Apple TV and easier to function.", "verified": true, "helpfulness": "0/0", "author": "KyLo"}, {"rating": 5.0, "review": "Best purchase all year!", "verified": true, "helpfulness": "0/0", "author": "Araley"}, {"rating": 5.0, "review": "It's All Good~", "verified": true, "helpfulness": "0/0", "author": "Sam Gracia"}, {"rating": 5.0, "review": "Love it!! Works perfectly... Much faster than our Apple tv. Just wish more networks like Fox Sports1 and 2 were on here...", "verified": true, "helpfulness": "1/1", "author": "CHAD DEHOOP"}]