[{"rating": 5.0, "review": "I never thought I would buy this item. Now that I have there are so many things I have available to see in the comfort of my home.", "verified": true, "helpfulness": "0/0", "author": "Patricia P. Boone \"Living Life\""}, {"rating": 5.0, "review": "Love the stick.", "verified": true, "helpfulness": "0/0", "author": "BuckyB"}, {"rating": 2.0, "review": "So I really want to like my fire stick because I wanna watch Amazon Prime Video and use Plex on my TV but it freezes all the time no matter if it's in Youtube, Prime Video, Netflix or Plex! It is also constantly dropping the network and I have a really nice router where my Chromecast and Apple TV have never had a problem. I honestly want to return my Fire Stick and hope that Amazon fixes these bugs because I don't even use it anymore I've had to go back to the Chromecast or ATV.", "verified": true, "helpfulness": "0/0", "author": "Jim Bob Barnett"}, {"rating": 5.0, "review": "Awesome easy to setup. Enjoy it very much!", "verified": true, "helpfulness": "0/0", "author": "Christian Franco"}, {"rating": 1.0, "review": "I bought this for my daughter, so she could watch Amazon Prime and Netflix, and it worked great for a day. The second day she turned on the tv and it required me to input my router password again. The third day it kept displaying cant download, despite having a great network  connection. The unit also asked me to check my settings, and wanted the password again. Did I mention, the TV was sitting next to the router and the Firestick was plugged in? I am always satisfied with Amazon and use them all the time. I don't  consider this one disappointment a problem as Amazon is a great company with great service and products, expect this one. I will be returning this and looking for an alternative.", "verified": true, "helpfulness": "1/1", "author": "Swell"}, {"rating": 5.0, "review": "I've had it for a month now and like. Think about getting over the air HD antenna for local channel and use the fire stick as main TV program and movie programming.", "verified": true, "helpfulness": "0/0", "author": "John Warterfield"}, {"rating": 5.0, "review": "This is a great gadget. It worked first time and brings in wonderful tv choices.", "verified": true, "helpfulness": "0/0", "author": "R L Gans"}, {"rating": 2.0, "review": "I love the concept. The dashboard/UI is good.  The device constantly freezes and has to be power cycled even though it has adequate ventilation. Hopefully the app list increases.  The remote is so small, constantly gets lost in our couch.  At this point unless something improves I still like our Roku better.", "verified": true, "helpfulness": "0/0", "author": "Dustin Fejfar"}, {"rating": 3.0, "review": "Generally good, but the main reason I purchased was for the pending feature to connect to hotel wifi access points.  That feature is still pending.  Deserves another star if that comes through.", "verified": true, "helpfulness": "0/0", "author": "jtvarkey \"jtvarkey\""}, {"rating": 3.0, "review": "Updated Review:  After attempting to use this for months, I'm disappointed in it's performance.  I'm not a technical person, but after reading reviews, this product seems to have issues connecting to the internet.  Our Fire Stick is almost useless, as it can't go more than 30-45 seconds without buffering for over a minute, then continuing to drop signal.  My daughter streams content from her Kindle all day without any issues and we've had a professional come out to review our internet set up, ruling that out as the issue.I wanted to try the Fire TV for a while, but our internet can be spotty so I didn't want to waste the $99 if we couldn't stream.  I pre-ordered this for the $19 introductory Prime price; it was too good of a deal to pass up and I'm so happy I did.  Not only was I surprised to find that most of the time we have no issues streaming content, but I'm so impressed with the interface.  This is really easy to use and setup.  The parental controls are a great feature and easy to setup.  I am disappointed that Free Time Unlimited is not available with the Fire Stick (I thought I read it was, but it must have just been for the Fire TV) this would have been a really good feature to have since we subscribe to it already.  I also wish there was a second option to purchase this with the voice remote.  The amount of free content is amazing and the selection and quality of movies is good.  This really makes the most of our Prime Membership and may be the push we need to ditch our satellite plan.  I do think I'd upgrade to the Fire TV, but for the $19, I couldn't pass this up.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}]