[{"rating": 4.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "James Wilson"}, {"rating": 3.0, "review": "We cannot use it.  Our internet is not robust enough to download anything (satellite) from Amazon.  I wish we had know that before we purchased the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Arlene Jenkins"}, {"rating": 5.0, "review": "absolutely a great device if you re an amazon prime member,pays for itself in a month", "verified": true, "helpfulness": "1/1", "author": "AARII"}, {"rating": 5.0, "review": "I absolutely love it. Streaming is so fun, but there could be more apps.", "verified": true, "helpfulness": "1/1", "author": "ladymom \"Love reading anything with a complicated and twisted, books are my life, I write poetry,and love the outdoors, from fishing to camping.\""}, {"rating": 1.0, "review": "It was easy to install but it was also our 2nd one but terrible streaming.  Will select, stream for 5 mins max, then cut out to build then same process over again.  Don't evan try to use now!!!", "verified": true, "helpfulness": "0/0", "author": "Patricia Yankovich"}, {"rating": 5.0, "review": "For something so small, this works great.", "verified": true, "helpfulness": "0/0", "author": "ML"}, {"rating": 5.0, "review": "Easy to install.  It made installing Netflix simple.  A friend also has Fire stick and loves it.", "verified": true, "helpfulness": "0/0", "author": "Kay F. Dooley"}, {"rating": 3.0, "review": "Set-up was easy. I could not get HuluPlus or Netflix to work with my TV. No problem with either Netflix or HuluPlus on my laptop or tablet.", "verified": true, "helpfulness": "1/1", "author": "Stephen J. Meyer III"}, {"rating": 5.0, "review": "I LOVE the Amazon Fire TV Stick! So simple to set up and get going and it works beautifully! Because of where my TV is located in the house I was unable to get any local reception and the game box I was previously using to stream Netflix was no longer working consistently so I was out of luck when it came to watching movies or shows... and now it's all back! No buffering, no error messages, no fuzzy picture. Thank You!", "verified": true, "helpfulness": "0/0", "author": "Mary K. Weinhagen"}, {"rating": 5.0, "review": "Works excellent. VERY FAST AND FLUID. I want more popular apps (YouTube Oficial and Social Networks apps)", "verified": true, "helpfulness": "0/0", "author": "Jeffry Guillen"}]