[{"rating": 5.0, "review": "This product does exactly what it says it does, easy to install and get up and running. Big Fan!", "verified": true, "helpfulness": "0/0", "author": "Betty T. Jimmo"}, {"rating": 5.0, "review": "Wow wow wow! What an amazing piece of technology. Easy set up and simple to use, which is right up my alley. Super fast I thought like my netflix you choose you wait maybe it freezes. I've come to accept that but all those glitches seem to be gone with the fire stick. Super fast! And no freezing. This is the way the technology was meant to be. I down loaded the voice activated remote to my I-phone and even that actually works the way the commercial says it does. This is a no brainer get this product and you won't use another. The only issue is now my 3 kids all want one.", "verified": true, "helpfulness": "0/0", "author": "big mike"}, {"rating": 5.0, "review": "I love this thing! We have an Apple TV and a PS3 that we also use to access Netflix/online content from our televisions. The interface on the Fire TV Stick is my favorite. I also really love having access to Prime video. There is a lot of included content that isn't available elsewhere. It's really a fantastic deal, especially if you're already an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Sandra B."}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tricia Bazzey"}, {"rating": 5.0, "review": "The stick came packaged very well and arrived ahead of the expected delayed delivery date.  It was easy to install.  The instructions do not state the first thing you see on your screen is that you have to select your modem.  When the screen comes up all it says is that you need to select your wi-fi (which is your modem) so have your pass word ready.  That being said I called fireTV tech support and they walked me through the confusion.  They were very helpful and stayed on the phone with me to make sure my fire stick TV was on the screen and ready for me to use.  In fact they stayed with me thru the intro video in case I had any questions.  Great job Amazon tech support.  The fires stick is easy to use when program searching.  I down loaded the app so that I could use my kindle and phone as voice command for the fire TV program selection (this I liked).  The selection of programs and movies is vast so that there is something for everyone.", "verified": true, "helpfulness": "0/0", "author": "rlinton"}, {"rating": 4.0, "review": "Love it. Simple to use.", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "Great for a guest room that isn't connected to a cable box. Very impressive. I have the Fire TV too and this is almost as good. No voice control on the remote, but for the price it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 1.0, "review": "You have to be so close to your router or you get no signal at all. I wanted it for my bedroom, but the router in the dining room (separated by just a bathroom). Not a big house, not a big separation, but it did not work at all.", "verified": true, "helpfulness": "0/0", "author": "CoffeeCrazyPhD"}, {"rating": 5.0, "review": "Awesome!! Love it", "verified": true, "helpfulness": "0/0", "author": "Vanity Tuquero"}, {"rating": 5.0, "review": "Works great!  Easiest internet tool I have ever set up!", "verified": true, "helpfulness": "0/0", "author": "zip31"}]