[{"rating": 5.0, "review": "works great and family loves it as", "verified": true, "helpfulness": "0/0", "author": "george little"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "Anand Sircar"}, {"rating": 5.0, "review": "It's awesome and lets me access all my Amazon content.  The only thing I wish they would do is allow you to use the amazon prime music stations on it like you can do on the website.", "verified": true, "helpfulness": "0/0", "author": "arturo jacinto"}, {"rating": 5.0, "review": "Wow. Can't believe I waited this long to finally get a streaming device of any sort period.  I'm an Amazon Fan-boy, so of course I gravitated towards this versus Chromecast. Plus, Chromecast is more limiting and less capable.I haven't had a chance to go through everything yet, but so far what I can say is that the interface is extremely clean, capable, and easy to navigate. The picture is super-crisp, and this thing is about as easy to use as an ice cube tray. Hoping that YouTube comes out with an app soon though.Get this. You won't regret it, and it is better than Chromecast (we tried it side by side with my buddies and this thing smokes it.)", "verified": true, "helpfulness": "0/0", "author": "Robert W Metcalfe II"}, {"rating": 4.0, "review": "It is a very good product, it was very easy to install.  Works very well. Have only had this item for 1 week, used it 3 times, no problems.", "verified": true, "helpfulness": "0/0", "author": "Del Brewer"}, {"rating": 5.0, "review": "Awesome device. I rank it above my chromecast.", "verified": true, "helpfulness": "0/0", "author": "Joseph O. Elmore (JOE) \"J.O.E.\""}, {"rating": 3.0, "review": "Was super excited about this but had a few issues.  Let's list the pros first:Easy set upEasy Home page to navigateGreat appsNow, for the cons...DO NOT BUY THIS IF YOUR INTERNET SOURCE IS MORE THAN FIVE FEET AWAY. I was having problems opening apps and starting shows. When I contacted customer service they told me that the fire stick had to be no more than five feet away from our internet source. Bummer! I purchased a internet signals extender and it helps but I think it would work better if our router was near our TV (this isn't an option for us)Other than that, really like this. Just wish it would work further away from internet source.", "verified": true, "helpfulness": "0/0", "author": "Jessica Littleton"}, {"rating": 5.0, "review": "Love this gadget!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"JOCELYN BROCK\""}, {"rating": 3.0, "review": "wanted live steaming tv programs and FS-1", "verified": true, "helpfulness": "0/0", "author": "Sandra Swift"}, {"rating": 4.0, "review": "Everything that I expected. Very easy to  install, only took minutes and it was up and running.", "verified": true, "helpfulness": "0/0", "author": "Mary Dahl"}]