[{"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "kenneth peaden"}, {"rating": 5.0, "review": "I will expand only a little on my review of the FireTV. I took advantage of the $19 special for Prime Members and bought the FireTV stick as one of two presents to myself for Christmas. It came attractively and professionally packaged a la the fruit company. In addition to the stick you get the non-voice remote, power connector and cable with HDMI extender as well as batteries for the remote.I didn't opt for the voice remote as I rarely use it on my FireTV. I had it installed and updated in less than 10 minutes. Given I bought it from my Amazon account it was already registered to me. At start up it asks if you want to register as yourself or add a new account. The intro video was changed to reflect the FireTV stick and nowhere did they say FireTV incorrectly. It is a very good intro video BTW so pay attention. It's a nice touch that you can watch it again if need be. The set up also prompts you to connect to your WiFi network which it did without fault.I tried a few apps and installed Plex which works wonderfully with FireTV/Stick. I run a server with most of my media and my old AppleTV was beginning to struggle with these duties. Speaking of media if you upload all of your pictures to Amazon for free you can see them on the FireTV devices.To me the performance was as good as the full FireTV box for a lot less money. I don't play games so I can't comment on that type of performance. It can use a remote or game controller just like the FireTV. You can buy the voice remote, but that is more than the special $19 price for the stick so I opted out.I won't repeat the interface review like I did on the FireTV. It is a bit busy, but you get used to it. My thought are otherwise the same. Good performance at a good price. If you are heavy into the Amazon service this is a no brainer as it lets you easily cruise the Amazon ecosystem such as Prime Videos, Prime Music, Photos or other media you have on Amazon. I do have all my  mp3's on Amazon so I can listen to them through the FireTV/Stick. Other similar devices list over 1500 apps, channels, etc. I only use a few and FireTV/Stick has all of them and so far I am pleased with both devices.", "verified": true, "helpfulness": "1/1", "author": "awraynor \"awraynor\""}, {"rating": 1.0, "review": "Slow and buggy. Remote keeps locking up. Can't get the Kindle Fire HDX 8.9 to cast the display, but will display from my Galaxy S4 Active. Quality of picture from casting is horrible, jerky and freezes. Don't see how this is Miracast compatible if that won't work from their own device. Glad I only paid $20 for it.", "verified": true, "helpfulness": "0/0", "author": "w.sawyer"}, {"rating": 5.0, "review": "When this was released just before thanksgiving, I didn't see the value in the product.Just before Christmas I realized that I wanted a tv in front of the treadmill.  I didn't want a set top box, I wanted something clean taking up as little space as possible.I bought this, plugged it into my (unused/idle) flatscreen 26\" Sony, and I was watching movies and recorded news in minutes.  Then I sideloaded the Dish Anywhere app and was watching any channel with just my flatscreen and an hdmi stick.  I can't even tell you how impressive this is.  I have a flatscreen on a tripod in front of my treadmill and can watch any channel now without any clutter!  Best $39 I've ever spent.", "verified": true, "helpfulness": "1/1", "author": "Arielle T Li"}, {"rating": 5.0, "review": "Very very easy", "verified": true, "helpfulness": "0/0", "author": "beep640"}, {"rating": 5.0, "review": "For $19 my daughter loves watching movies in her room.", "verified": true, "helpfulness": "0/0", "author": "jennifer"}, {"rating": 5.0, "review": "We are going to enjoy the fire stick to the fullest!!!!! Great!!!", "verified": true, "helpfulness": "0/0", "author": "Eviebo"}, {"rating": 5.0, "review": "Amazing addition to our family entertainment time.  Fun to share videos listen to music and watch shows.", "verified": true, "helpfulness": "0/0", "author": "Heather Taylor"}, {"rating": 4.0, "review": "So far so good. I will come back and update this should things change. The four stars are because initial setup was a bit of a pain. I easily connected it to my wi-fi network. As soon as I did that the stick required me to download updates. I tried and tried to get the updates to download. It would get maybe 10% of the way through downloading updates and then it would fail and tell me I had to try again. I would try again and get the same result. Making it extra annoying is that I had to unplug the power source each time.After trying to download updates five times I got the idea that perhaps the throughput on my network wasn't sufficient since it was being used by my PC, laptop, phone, and my son's Kindle. So I reset the stick and connected it to the 5G network in my house (I have a dual-band router). As soon as I did that it, success!  The updates downloaded in 3-4 minutes and then the install went easy. As soon as all that was done it was up and running. I like it so far.. Netflix comes through great, Amazon streaming works great, hoping HBO streaming is featured once that comes live.", "verified": true, "helpfulness": "0/0", "author": "Todd Mandel"}, {"rating": 3.0, "review": "I had high hopes for this device.  It stated that the performance is above other similar devices, but I didn't see it.  I use an old Wii device to watch NetFlix and the connectivity (slightly further away from my router than the fire stick's placement) is consistent...no buffering.  I was constantly bombarded with buffering using the fire stick.  Even the fire stick said the connectivity was \"very good\", it's performance said otherwise.  Maybe some trick or some upgrade will fix this, but out of the box this Christmas...very disappointed.Also, just something to point out when setting up the original connectivity to my router.  I had my router on channel 6, but it wouldn't connect and kept kicking me back to the password screen for the wireless configuration.  After about 5 or 6 tries, I went and changed my router's channel to \"auto\" and the fire stick picked up the router.  Odd, but it worked.UPDATE:  I rearranged a room and now have line of sight almost to the router (even though I had \"very good\" connectivity before).  Working fine now.  No other device I own needs to be this close to the router, but that's what it took to work.  If the connectivity was better I'd give the stick a 5 star rating.", "verified": true, "helpfulness": "3/4", "author": "asiasoon"}]