[{"rating": 1.0, "review": "I wanted to like Amazon Fire Tv Stick, but it doesn't live up to Amazon's usual quality.The Android app is clunky. The screen is cluttered. There are no volume or power controls. And in under a day,  I've already run into a bug trying to watch Amazon's own Prime video. (Sound plays, menu and controls are visible,  however there is no picture.)I'm not impressed.", "verified": true, "helpfulness": "1/3", "author": "Ashley Parker"}, {"rating": 4.0, "review": "I would have loved it if it would mirror my Nexus 7. It only mirrors some Kindle tablets.  Everything else works great.", "verified": true, "helpfulness": "0/0", "author": "Bill Baehr \"whipperin1\""}, {"rating": 5.0, "review": "This is a great casting device.  I really like the on screen menus/choices.  It makes it very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Thomas L. Dooley"}, {"rating": 5.0, "review": "Very nice.  It's easy to install (plug one end into an HDMI slot and the other into a power source, then connect to the internet).  The cartoon intro video is quick.  The remote with the clickable (outside) directional wheel is easy to use and the android app (ff, rewind or pause anywhere in the app's grey box) is great too.  Prime videos stream easily and quickly.", "verified": true, "helpfulness": "0/1", "author": "PPosey"}, {"rating": 5.0, "review": "I love this little thing. I have Amazon prime so this is like a great add-on. I can easily play spotify on my TV for a little in-house party or play some shows I didn't know existed. It would be great if there is a mac app so I can control the TV from my laptop too.", "verified": true, "helpfulness": "0/0", "author": "Bernard Wong"}, {"rating": 1.0, "review": "You would think that Amazon would at a very minimum pair its FireTV with its existing products that are capable of behaving as remotes.  There is no reason why they couldn't make a remote app for the Kindle Fire except sheer arrogance and laziness.  I'm really having a hard time understanding this.  I can't rate this any higher than one star because I think this is just as ridiculous omission as when they failed to have an iOS app at launch time!", "verified": true, "helpfulness": "0/0", "author": "Frank Z \"frankz00\""}, {"rating": 5.0, "review": "I love it! Such a nifty gadget, I have XBMC running on it and it works wonders. I prefer XBMC over Plex and Amazon fire stick allows side loading of apps without the need to root. I'll be ordering a few more as gifts, only unfortunate thing is it seems to be out of stock until January meaning no fire stick chimney stocking stuffers.", "verified": true, "helpfulness": "0/0", "author": "Phong Nguyen"}, {"rating": 5.0, "review": "The smooth and nice interface with no lag. Crystal clear picture quality and get this IT EVEN WORKS IN YOUR CAR! (HDMI PORT AND AT LEAST 5WATT OUTLET REQUIRED)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Small yet capable.  No problems.", "verified": true, "helpfulness": "0/0", "author": "Linux Administrator"}, {"rating": 4.0, "review": "This is a great streaming product, Amazon has really improved on the basic streaming stick. The companion app, and remote make watching content easy and almost effortless.Pros: Content, with the entire Prime library this has a huge amount of content.  The added flash memory is great for downloading apps.  Fast boot up, once I turn on the tv the fire stick immediately loads.Con: The usb power location is a little awkward, it's right in the middle of the stick, so if you have multiple hdmi plugs in your tv you might need to rearrange the placement of a few.", "verified": true, "helpfulness": "0/0", "author": "Ben W"}]