[{"rating": 5.0, "review": "This is a Great product! I have ordered a second one for my other child. Plays very crisp and can access everything from the Kindle fires we bought two years ago and still use to this day. Amazon customer service is matched by NO other company!", "verified": true, "helpfulness": "0/1", "author": "molly7475869644"}, {"rating": 1.0, "review": "I don't even want to talk about it.", "verified": true, "helpfulness": "2/8", "author": "G. Freeman \"Warrior Supporter\""}, {"rating": 5.0, "review": "Love it.  Much better watching Netflix on the tv rather than my laptop", "verified": true, "helpfulness": "0/1", "author": "kathi meyer"}, {"rating": 3.0, "review": "I was surprised at how little information was given about product when purchased. The product itself is okay but the marketing fell short. At this point I feel that any of my gaming systems can do the same thing. Of coarse I have to take my part of the blame for not be more through all before the purchase.", "verified": true, "helpfulness": "1/3", "author": "Joseph La Bate"}, {"rating": 5.0, "review": "Works great! Wife and I both love it, Grandkids get their favorite shows without big cable bill every month.", "verified": true, "helpfulness": "0/1", "author": "Earnest Grimes"}, {"rating": 4.0, "review": "I would of given this 5 stars for ease of use and quick response to searches but it suffers from the same issue as the Fire TV. Voice search is only available for shows on Amazon and not Netflix. If Amazon corrects this flaw and makes voice search available for all the streaming services they cover this will be the perfect tool. Make it happen Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jeffery A Dolan"}, {"rating": 4.0, "review": "The stick pretty much works as described.  I bought the stick specifically because it says it will soon have two important features:  1.  Coming soon--take Fire TV Stick with you to use with HDTVs in hotels, college dorms, or anywhere with captive portal Internet access that requires entering a password or a log-in.  2.  HBO GO - Coming spring 2015I wonder when these features will happen.  Soon, I hope.========================Well, progress by baby steps.  The HBO Go (item 2 above) became available on the Fire TV stick on March 18, 2015.  I downloaded and installed the app and it works.Not that Amazon did anything to let me know of its finally supporting the HBO Go feature on the stick.  I learned about it completely by accident.But as of right now the \"log in at a hotel\" feature that was promised (item 1 above) is still not available.  This despite the false claim as of today that the feature is available on the Fire TV Stick.", "verified": true, "helpfulness": "1/2", "author": "carl oppedahl"}, {"rating": 5.0, "review": "I use this on the bedroom TV.  I like that it is small and compact.  I have noticed a difference is speed loading.  It is a little slower than the fire box.  I don't mind it at all.  It doesn't have the apps available as the fire box, however, it is just what I was looking for.  I have had to reset it a few times, however, I think that is because of our internet.  Good value, highly recommend", "verified": true, "helpfulness": "0/0", "author": "mdr"}, {"rating": 5.0, "review": "It's wonderful..... I love it!", "verified": true, "helpfulness": "0/0", "author": "Charlene"}, {"rating": 5.0, "review": "We love it... Easy to run.. Kids have had a blast...", "verified": true, "helpfulness": "0/0", "author": "Ralene Carter"}]