[{"rating": 4.0, "review": "I love it, so easy to install and set up I didn't even need my kids to help.  Rating it high for the product, not the shipping. Was supposed to be free two day shipping. Ordered on Thursday, arrived on Tuesday, I would usually get things on Saturday from a Thursday order, out even said that when I first looked at it.", "verified": true, "helpfulness": "1/1", "author": "Liz"}, {"rating": 2.0, "review": "This product has one important limitation--it does not work if it is more than 15 feet from the wireless router. What was especially annoying and frustrating for me is that this limitation is not mentioned upfront when purchasing the device online (which is how i purchased it). My house has several TVs and only one wireless router. I had planned to move the firestick around so I could watch it on any of my TVs, but only one set is close enough for it to work. Effectively you can only use the firestick if your wireless router is in the same room or the room next door.This distance limitation should have been disclosed upfront, but was not, Moreover, it is not mentioned anywhere I could find including the online tutorial, the instructions that come with the unit, and the troubleshooting section of the Amazon website. As a result I spent over two hours trying to set the firestick up on several TVs and combing through the online help area of the Amazon website. Note the problem was not obvious because the firestick immediately found my home wi-fi network during the setup operation, but it apparently requires a very strong signal to connect and had to be closer to the router. I only fiqured out the issue after finally getting a customer service person on the phone, which itself required me to navigate through multiple levels of dropdowns.So far the product works fine on my TV close to my wireless router.", "verified": true, "helpfulness": "6/6", "author": "Abigail Maddi"}, {"rating": 5.0, "review": "Love the programs available and so easy to use.", "verified": true, "helpfulness": "1/1", "author": "Corrinne Davis"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "brandon w hahn"}, {"rating": 3.0, "review": "My fire  tablet connects to my Wi-Fi better", "verified": true, "helpfulness": "0/0", "author": "neil crammond"}, {"rating": 5.0, "review": "My family truly loves this product. It is absolutely user friendly, the children are able to find the program or movie they were actually looking for and other subjects, such as movies their parents told them about. Being a member of Amazon Prime pays for itself in no time. The price is unbelievable and it comes with its' own remote control, batteries included. You cannot go wrong with this product.", "verified": true, "helpfulness": "0/0", "author": "Deborah Bottai"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Carri"}, {"rating": 5.0, "review": "Haven't used it much yet, but seems to work well", "verified": true, "helpfulness": "0/0", "author": "Bret D"}, {"rating": 4.0, "review": "Works well at home. We'll see how it works on the road.", "verified": true, "helpfulness": "0/0", "author": "gcoug"}, {"rating": 5.0, "review": "I love Amazon and the fire stick. The fire stick is very responsive and connects to the Internet extremely well. We use ours in a upstairs bedroom and our router is downstairs. Thanks Amazon.com", "verified": true, "helpfulness": "1/1", "author": "Jeff"}]