[{"rating": 4.0, "review": "Im loving it, just wished amazon would've explained that it requires an account for Netflix, hulu and all the others to see the features, other that it great!!!!", "verified": true, "helpfulness": "0/0", "author": "kwame ballard"}, {"rating": 5.0, "review": "very easy to use. bought a second one.", "verified": true, "helpfulness": "0/0", "author": "Agnes Cohea \"jeri\""}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "rosemary white"}, {"rating": 5.0, "review": "I really appreciate the versatility of this tool and enjoy all the \"little extras\" that you can get with Amazon coins.  The fireplace and aquarium are favorites.  I have a prime membership; I don't even watch live TV anymore.  I rely completely on the Fire stick and am never disappointed.  I also subscribe to several series shows and get the commercial free versions the morning after they are aired on TV.  We could get rid of cable entirely if my husband could get sports games live on the stick.", "verified": true, "helpfulness": "0/0", "author": "schnoop \"eBook Fan\""}, {"rating": 5.0, "review": "Awesome! Super", "verified": true, "helpfulness": "0/0", "author": "KC."}, {"rating": 5.0, "review": "It is really great .I play it almost every day. thank you fire tv stick.", "verified": true, "helpfulness": "0/0", "author": "james paul anvia"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love our Amazon Fire TV Stick!  We're hooked on Netflix and Amazon Prime tv/movies and the Fire Stick makes everything easy to access from any tv in the house.  Fairly simple to install and we had it setup in about 10 minutes.  What a great little device!  I can't believe we were living without it!", "verified": true, "helpfulness": "0/0", "author": "TG Amazon Fan"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "MARY JO NICKLAY"}, {"rating": 5.0, "review": "SO far so good!  I love it", "verified": true, "helpfulness": "0/0", "author": "Kim"}]