[{"rating": 5.0, "review": "this thing is great! easy set up and moves from tv to tv easily. got more on my list!", "verified": true, "helpfulness": "0/0", "author": "stacie"}, {"rating": 5.0, "review": "Really enjoying this fire stick great item", "verified": true, "helpfulness": "0/0", "author": "Sheila A DelVal"}, {"rating": 1.0, "review": "I was very disappointed with the Fire TV Stick.I bought it to use for traveling and to watch in hotel rooms. You can not sign-in to hotel wifi because you can not access a web browser which is required to log-in to hotel wifi before connecting the Fire TV Stick.Also, I subscribe to HBO and Showtime on my Comcast/Xfinity cable, but it's not available on the Fire TV Stick.This is something that should be mentioned in the product description, as this would have been a deal-breaker for me.This product is basically worthless to me.Though I am a big fan and faithful customer of Amazon's for the past 10 years .... they dropped the ball ... big time ... with this product.", "verified": true, "helpfulness": "2/2", "author": "Ed Lohrer e3_prog \"progressive music fan\""}, {"rating": 5.0, "review": "I am enjoying my fire stick. The only problem I am having is when I go on HULU it continues to buffer.", "verified": true, "helpfulness": "1/1", "author": "Rosemarie Hudson"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Sonya sides"}, {"rating": 5.0, "review": "It is so easy to use. Plugged it in and away it went. Was so happy with it.", "verified": true, "helpfulness": "0/0", "author": "Lachelle Yoder"}, {"rating": 3.0, "review": "The overall experience it's a bit slow if you are used to other streaming devices like the Apple TV. The menus also are not as clean, but overall it does it's job. I would not buy another one though.", "verified": true, "helpfulness": "1/1", "author": "Matteo"}, {"rating": 4.0, "review": "Wish I could access the internet to stream online if not would be a five star product.", "verified": true, "helpfulness": "0/0", "author": "Daniel macias"}, {"rating": 5.0, "review": "The Fire Stick is absolutely wonderful. It is a perfect addition and easy to navigate. Thank you Amazon for another fantastic product.", "verified": true, "helpfulness": "0/0", "author": "ciellalv"}, {"rating": 5.0, "review": "I'm enjoying the Fire TV stick and Amazon Prime Videos. It's easy for me to use.", "verified": true, "helpfulness": "0/0", "author": "J. W. Carney \"Sewing Fun\""}]