[{"rating": 5.0, "review": "Almost the same as the tv box. Great for second tv. Allows me to take full advantage of Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "joseph s. chizik"}, {"rating": 4.0, "review": "I love using it. I got it for the promotional price at launch.The WiFi reception is a little under my expectation compered to surrounding devices.Another issue is how it wouldn't pre download any movie.It wouldn't even download much a head when the internet is slow.Every time it looses the WiFi signal it will interrupt the movie and take you out to the home view/page.It's not possible to change the WiFi connection with out leaving the movie and home page.Prime movies suck and all good movies are for rent at high price or are on Netflix, lol.", "verified": true, "helpfulness": "0/0", "author": "Abdullah K Aldobaie"}, {"rating": 5.0, "review": "Very cool!  Especially love that I can carry it around and plug it in anywhere.Remote for it is rather annoying..in my opinion anyway.  Load the app. to control it with your phone..you'll be glad you did.", "verified": true, "helpfulness": "0/0", "author": "Nana Heather"}, {"rating": 4.0, "review": "Directions very clear to install and ready for viewing.  Opening remote to install batteries was a bit of a challenge but task was accomplished.", "verified": true, "helpfulness": "0/0", "author": "KAREN Neely"}, {"rating": 4.0, "review": "The fire stick allows us to access more than chromecast did. The ability to access Prime is why I bought this, and I am happy with that. However, we are disappointed that we cannot stream from our laptop computers like we could with the other. That is an important element that would greatly improve the device.", "verified": true, "helpfulness": "0/0", "author": "nicki"}, {"rating": 5.0, "review": "Easy to set up and even easier to use. Great product. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "matthew deboutez"}, {"rating": 4.0, "review": "We love our fire stick. We use it for prime, netflix, hulu, and pandora. Even Youtube sometimes. A great little device. The only complaint is that it wasn't apparent that this has to be plugged in to a power source other than the tv", "verified": true, "helpfulness": "0/0", "author": "cjn \"cjn\""}, {"rating": 5.0, "review": "I got this for a bedroom tv where I didn't want a blue ray player or any other cumbersome apparatus for picking up Amazon Prime and Netflix.  I haven't really explored any other options since I got hooked on Orange is the New Black.  Maybe when I finish up with that I will explore some more but for my purposes it is perfect!  Wi-fi signal in this bedroom is fairly weak compared to the living room but it picks up just fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What a great product!  This does everything that a roku does but with much more ease of use and has so much more to offer as you can stream to this device also!  I am slowly buying enough of these to replace all of our roku devices!  Great job on this Amazon!", "verified": true, "helpfulness": "0/0", "author": "Coxxy8"}, {"rating": 1.0, "review": "Unfortunately, the connectivity issues are ever present. I was hoping that the update would help, and it did for a bit, but now I'm back to watching a show 30 minutes at a time. Bit annoying when it comes to movies. Sadly, the stick disconnects from my wireless repeatedly and once it start, it does so at more frequent intervals.When it works it's great, but be prepared to be constantly frustrated and having to restart your device frequently.", "verified": true, "helpfulness": "0/0", "author": "Irene Sakellarakis"}]