[{"rating": 5.0, "review": "I love this and with Amazon prime you get the works with Fire TV and Fire Stick. I have the fire TV upstairs and the stick in my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Greeneyes"}, {"rating": 5.0, "review": "Easy to use. Good purchase and addition to the family's electronics.", "verified": true, "helpfulness": "0/0", "author": "Sassy Curls"}, {"rating": 5.0, "review": "easy to use.  performed as advertised", "verified": true, "helpfulness": "0/0", "author": "Desi \"John DeSimone\""}, {"rating": 4.0, "review": "Set-up took 90 seconds.  Essential functions performed by my Sharp Aquos TV remote.  Small item:  not impressed with the mostly black and white background screen images for music.", "verified": true, "helpfulness": "0/0", "author": "WH"}, {"rating": 5.0, "review": "Bought it as a gift for relatives who travel. They love being able to watch there shows wherever they are", "verified": true, "helpfulness": "0/0", "author": "Raymond"}, {"rating": 5.0, "review": "We had a Chromecast before we ordered the Fire Stick. I haven't used the Chromecast much since we got the Fire Stick. We are very happy with the Prime movie service and the stick delivers. I like the games and apps option and the dedicated remote. It seems very fast and responsive. Now that they have the iOS app out...its even better. I have already had other people purchase them based on my experience. I wish the Mira Cast was a more stable protocol, but that seems to be a common problem with most devices that support it.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 3.0, "review": "It is a good product the interface is easy to navigate. Setup was easy once I connected the HDMI extender. Before then, it was stuck on it initial \"checking for updates\" stage. After downloading the TV apps (History, Lifetime, Showtime), I found out that the Fire TV Stick does NOT support DIRECTV customers. This was a major disappointment. Had I known this, I probably would've ended up buying a Roku stick instead. Every other streaming players such as the Roku, Apple TV, and even Xbox supports DIRECTV customers. Because it does not support DIRECTV customers, I will miss out on many of the great features that come with buying a streaming player. Amazon needs to negotiate with DIRECTV so as to gain more customers and keep from losing current customers.On the bright side, Netflix, Pandora, and any other app that does require a TV subscription work great for me.", "verified": true, "helpfulness": "0/0", "author": "USAF pilot"}, {"rating": 5.0, "review": "Seriously the best investment I've made", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 3.0, "review": "Really have not had it long enough to give a review.", "verified": true, "helpfulness": "0/1", "author": "C. Torr"}, {"rating": 5.0, "review": "Easy way to view all!", "verified": true, "helpfulness": "0/0", "author": "Nada Green"}]