[{"rating": 3.0, "review": "The Fire Stick had promise, but falls short in many ways.  I'm almost tempted to give it two stars.First of all, I really thought it had an option to stream from any DLNA source, but it doesn't.  So, if you have videos on your computer you're hoping to watch via the Fire TV Stick, forget about it.  Furthermore, the device is just too Amazon-centric for my liking.  Sure, it's not hard to go to Netflix or Hulu, but on a number of occasions I've been fooled when I thought I was looking for content on one of the supported services.  Lastly, and most frustratingly, I have to reboot (the darn thing every couple of days or suffer through stuttering video playback.All in all, it's functional, but not outstanding in any way.", "verified": false, "helpfulness": "0/0", "author": "Nicco"}, {"rating": 5.0, "review": "I freaking love this thing! This is probably the best purchase I've made with so many great features! Sorry Google Crome, you just aren't the winner in this category.", "verified": true, "helpfulness": "0/0", "author": "Tomika Butler"}, {"rating": 5.0, "review": "My tv is now pritty much a \"smart tv\", love it.love it.love it..", "verified": true, "helpfulness": "0/0", "author": "Richard."}, {"rating": 4.0, "review": "Great product!! You need to have good bandwidth to stream, just remember.", "verified": true, "helpfulness": "0/0", "author": "Alberto Aguirre"}, {"rating": 5.0, "review": "Love this! Works like magic!! I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Abraham Marquez"}, {"rating": 4.0, "review": "Excellent streaming device.  Not quite as versatile as a Roku box, but was simple enough for my mother in law to learn in just a few minutes.  Great wi-fi reception for such a small device", "verified": true, "helpfulness": "0/0", "author": "Joseph Vaccaro"}, {"rating": 3.0, "review": "Its great to have  the fire stick. We have two. I hope we aren't charged twice for them. We have them in the living room and bedroom. It's nice to go from one room to another and pick-up where you left off with a show.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Swalm"}, {"rating": 5.0, "review": "Am excellent device. It connects quickly and comes with many options as well as a startup walkthrough.", "verified": true, "helpfulness": "0/0", "author": "Sieglinde Dusenbery"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "enrique paz"}, {"rating": 5.0, "review": "Easy nice n a good deal", "verified": true, "helpfulness": "0/0", "author": "bob"}]