[{"rating": 5.0, "review": "Love it! Glad I went with this over the other options.", "verified": true, "helpfulness": "0/0", "author": "Darin Zaugg"}, {"rating": 5.0, "review": "Really enjoy the options. Haven't tried but a few, however it meets all expectations I had for sure... Just make sure your internet is pretty fast.. Even tho ours is crummy... Fire stick works great!", "verified": true, "helpfulness": "0/0", "author": "plm6846"}, {"rating": 5.0, "review": "Really enjoy my fire stick. I can always find something worth watching. Love revisiting old favorite shows.", "verified": true, "helpfulness": "0/0", "author": "James Jauregui"}, {"rating": 5.0, "review": "I picked this up this morning and am thoroughly impressed with how easy set up was! Plugged it in, grabbed the remote, and laid on the couch while I browsed movies and TV shows! Now, the movie rentals I wouldn't bother with if you got redbox near by. Triple the price on Amazon. Everything is working perfectly and all the apps will keep me entertained since I don't have cable :)Which is the whole point Eh?", "verified": true, "helpfulness": "0/0", "author": "tiffrenee"}, {"rating": 5.0, "review": "Amazon absolutely hit it out of the park with this product.  Netflix + Youtube + HBO + Amazon Prime, needless to say we cut the cord on Time Warner Cable.  We have a chromecast that is collecting dust.  This is the way to go if you want to smarten your television set.", "verified": true, "helpfulness": "0/0", "author": "Youngrin L. Kim"}, {"rating": 5.0, "review": "unit used on bedroom TV and we can watch  Prime videos whenever we feel like it.", "verified": true, "helpfulness": "0/0", "author": "guytok1"}, {"rating": 3.0, "review": "It's easy. Amazon does all the work just by clicking a button. It's different and most of all fun.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "I thoroughly enjoy the easy installation and operation of unit", "verified": true, "helpfulness": "0/0", "author": "James Fisher"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "michelle l graham"}, {"rating": 4.0, "review": "CONTROLLER DIRECTION DIAL A LITTLE SMALL", "verified": true, "helpfulness": "0/0", "author": "ASE1950"}]