[{"rating": 4.0, "review": "I was looking for a simple interface that my wife could use to enjoy programming. She is not comfortable with computers and tablets, but found this to be a very easy way to expand her programing choices in an easy fashion.", "verified": true, "helpfulness": "0/0", "author": "Mike Coppock"}, {"rating": 5.0, "review": "As of right now, this product is great! I have had no connection issues, connected easily with minutes, and signed into my accounts easily. It is a great product if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The remote is the most horrendous thing ever. I needed to enter my wifi password and I press up to click on a letter and it goes to the right. I click down and it goes up. I click on a letter and it clicks the one next to it. Can you imagine how frustrating it was to sit there and keep clicking and not get the letter you want. After about an hour I gave up. I couldn't even use the firestick because I couldn't enter my password because the remote wouldn't work properly!", "verified": true, "helpfulness": "0/0", "author": "Ronald Swingle"}, {"rating": 5.0, "review": "Love this product, have been watching shows on Netflix, Amazon Prime etc on my TV set, easy to set up and easy to use. Would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "C. Bonham \"Transman book demon\""}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "Ben A."}, {"rating": 5.0, "review": "Super easy to install and use, have access to so many more.shows and movies!", "verified": true, "helpfulness": "0/0", "author": "Bonita Haines"}, {"rating": 1.0, "review": "Good luck trying to get the batteries into the remote!  None of my neighbors and friends could figure out how to open the remote and put in the batteries.  And the firestick has to be plugged in to an electrical socket, so it's not like just inserting a memory stick into the back of the TV.  The stick sticks out from the back of my TV, is visible when looking at the TV screen from the front, and I have an extra cord dangling from it.  Hmmpf!  I will be returning it.", "verified": true, "helpfulness": "0/0", "author": "Annette Montez \"iPod lover\""}, {"rating": 5.0, "review": "It's nice to have. Still trying it out", "verified": true, "helpfulness": "0/0", "author": "Wes"}, {"rating": 5.0, "review": "Absolutely love it! Exactly what I was looking for!", "verified": true, "helpfulness": "0/0", "author": "Melissa Dunn"}, {"rating": 1.0, "review": "No offense - but this is the most hyped waste of money since Kim Kardasian's ass shots.Unless you pay everyone on Earth user fees - there is absolutely nothing anyone would want to watch.It is really clean looking and the BOX it comes in is astounding..After it's opened the disappointment begins and never ends until you send it back& the weight of yet another money hemorrhaging scheme re-enters it's non existence &you begin to feel really good about yourself again.So as therapy it is an invaluable tool. And once you have installed it - so are you.They returned my money forthwith.So PRIME's return policy is good.", "verified": true, "helpfulness": "0/1", "author": "James Lawless"}]