[{"rating": 5.0, "review": "simple anyone can do it.", "verified": true, "helpfulness": "0/0", "author": "Nancy S. Soffos \"Nancy3dogs\""}, {"rating": 5.0, "review": "Good item, definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 1.0, "review": "I had a hard time connecting it to our television.  We went to another television and it worked, but not on the television I wanted it to show on.", "verified": true, "helpfulness": "0/0", "author": "Diane DesPlantes"}, {"rating": 5.0, "review": "I didn't know what to expect with the Fire TV stick compared to others. All I can say is WOW! It's far better than I thought and there is a multitude of apps to download and content to access. If you're asking yourself which HDMI TV smart stick this is the one. For the money and features it can't be beat!", "verified": true, "helpfulness": "0/0", "author": "Bryan Whitson"}, {"rating": 2.0, "review": "We bought a fire TV stick so we could get our favorite american movies and TV while stationed in Europe.  We are VERY disappointed to learn that it does not even though we have the Internet because Amazon doesn't have licensing agreements with European countries.  Buyer beware.", "verified": true, "helpfulness": "0/1", "author": "Mtreiner"}, {"rating": 3.0, "review": "I bought the fire stick because I am a member of Amazon Prime , but as I live in Guatemala can not use more than the same you could use  using the google Chromecast . Perhaps the only advantage is the remote. At least for me.", "verified": true, "helpfulness": "0/0", "author": "Lourdes"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Nicole Beutler"}, {"rating": 1.0, "review": "The good news is that the Amazon Fire Stick was very easy to install.  We bought it to replace our several year old Apple TV box.  The second bit of good news is that I did not toss my vintage Apple TV box, that we use to watch Netflix and other entertainment including standard Apple TV entertainment offerings.Unfortunately the Amazon Fire Stick signals can't keep up with real time and we are constantly watching frozen screen events. Our Internet service is provided by Comcast and we have no service issues with Cable TV entertainment or with Apple TV.  In my area Amazon Fire Stick can't keep up with real time for regular Netflix entertainment offerings.  I am going back to watching Amazon Prime entertainment from my iPad through Apple TV via AirPlay onto my TV screen (or on my iPad).  Maybe the day will come when Fire Stick will command the same bandwidth from Comcast Internet services as Apple TV does so we can use it to replace Apple TV and gain single remote access to Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "NickJ"}, {"rating": 2.0, "review": "Didn't work, kept saying that it wasn't able to connect to the internet while several other devices in the house were on wifi and working well.", "verified": true, "helpfulness": "0/0", "author": "NYmom"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "kaleo"}]