[{"rating": 5.0, "review": "Amazon Fire Stick TV came in on Friday, didn't get a chance to play with it until yesterday.  Much quicker than my Roku 2.  As expected the remote is RF instead of IR so it doesn't have to be pointed at the stick.  The stick comes with a 4 inch HDMI cable so it can be put in a few more positions.  It does require USB power with the adapter that it comes with.  Sets up pretty quickly.  Netflix has the same updated interface as on my XBOX 360, so that is a great improvement over the Roku.  Amazon Prime stuff is on the main menu and is easy to get to.  I ordered the stick up for $20 when it was offered a few weeks ago.  As all the Amazon Fire/Kindle stuff, it came pre-registered to me so the setup was even quicker than if not.It did find my 5.0gig N band wifi channel so the connection is great in my house.For the current price of $25, no reason not to get one.", "verified": true, "helpfulness": "1/1", "author": "Joe Blevins"}, {"rating": 5.0, "review": "Works Great", "verified": true, "helpfulness": "1/1", "author": "CARL D. BOTTOMS"}, {"rating": 4.0, "review": "I like this a lot even though I had some trouble with the initial setup. It would not work with my Centurylink wireless router. I had another router that I was not using and set it up with it and it works fine. I is fast and very responsive. I would recommend this to anyone who need a streaming device", "verified": true, "helpfulness": "0/2", "author": "Ben Alexander"}, {"rating": 5.0, "review": "Perfect product at an unbeatable price. Love that apps are accessible on the device and it's a small form factor.", "verified": true, "helpfulness": "1/1", "author": "Mark Neil"}, {"rating": 5.0, "review": "Better than expected", "verified": true, "helpfulness": "1/1", "author": "Gary Luksha"}, {"rating": 4.0, "review": "This device will save me loads of money on cable!! I Was sick of paying so much money for channels I didn't watch anyway, so I decided to try this device. Now I get to see what I want and don't have to pay an arm, a leg, and a foot. So far I am happy with this device. I just plugged it in everything else was already setup.", "verified": true, "helpfulness": "1/1", "author": "Yolanda L. Winfield"}, {"rating": 5.0, "review": "I have been a Roku owner since they came out.  This seems to be just as good but what I really like is the size of it.  It doesn't have as many channels available as my Roku and the menu is not as easy to navigate but now I can take my Prime Videos with me when I travel! (assuming you have wi-fi access at your destination)  The introductory price of $20 was too good to pass up and even at regular price would be a great deal.", "verified": true, "helpfulness": "1/1", "author": "CW in AZ"}, {"rating": 3.0, "review": "It's fast, but that is about all it has going for it - disappointed by poor selection of \"included with Prime\" selections and apps in general.Worth $19? Yes. Worth the $99 Prime subscription? No.", "verified": true, "helpfulness": "0/0", "author": "David I."}, {"rating": 4.0, "review": "The only thing that isn't clear is that you pretty much HAVE TO use the A/C power.  It doesn't suggest that you could use the USB port on your TV.  I guess I could try it but again - its not even a suggestion.", "verified": true, "helpfulness": "0/0", "author": "nh_handyman"}, {"rating": 5.0, "review": "My review may be a little biased as I got in on the $20 offer, so \"free star\" for that. As for the product itself, it's great but it's missing a couple of things. One, it's only power option is the included AC adapter. That takes away some of the convenience of the product. Two, you can't \"cast\" like you can with Chromecast. Not a dealbreaker, but it would have been nice to have. On the plus side, it's great everywhere else. Easy set up and decent enough UI. The included remote is super great (and could only be made better if there was some way to control the volume on the TV). If you've \"bought in\" to the Amazon ecosystem, you'll love this as all of your Prime, Cloud Drive, Prime Music, and Prime Video preferences show up and are easily accessible.", "verified": true, "helpfulness": "1/1", "author": "Terence Polk"}]