[{"rating": 3.0, "review": "The Fire Stick is a great concept and a nice alternative to the expense of cable television. The only ongoing issue that we seem to be suffering from is that Sling keeps prompting for the software to be updated but it says it has the latest version. The software has not been updated since (I believe March) and Sling TV keeps locking up and/or crashing. This has been rather irritating and I am hoping the software is updated soon so eliminate this problem. Other than that, it's great. There are new shows being added regularly to diversify viewing options for every kind of taste. I see this as being the future of television.", "verified": true, "helpfulness": "0/0", "author": "Tanya"}, {"rating": 5.0, "review": "It really works great. My only complaint is why do I have to pay for the final season of \"Justified\"?", "verified": true, "helpfulness": "0/0", "author": "Robert M. Squier"}, {"rating": 5.0, "review": "Excellent video streaming device!!", "verified": true, "helpfulness": "0/0", "author": "WIL RIVERA"}, {"rating": 5.0, "review": "Great product,  arrived as requested", "verified": true, "helpfulness": "0/0", "author": "Doug Needham"}, {"rating": 2.0, "review": "Jumps a lot seams to be slow.", "verified": true, "helpfulness": "0/0", "author": "kenny boone"}, {"rating": 5.0, "review": "Runs all programs just as well as the big brother except a lot warmer.That said, it's the best device out there at this price point.", "verified": false, "helpfulness": "0/0", "author": "Thang T."}, {"rating": 5.0, "review": "Absolutely live this!  It is so easy to use!!", "verified": true, "helpfulness": "0/0", "author": "fred burningham"}, {"rating": 1.0, "review": "Horrible picture quality.", "verified": true, "helpfulness": "0/0", "author": "Eric Duvall"}, {"rating": 5.0, "review": "Does the job and does it well. No lag that I notice. Menu is as good or better than AppleTV. I refer this over AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Huther"}, {"rating": 5.0, "review": "Love it! So much better than a Chrome (stick?) and less expensive than an Apple TV. If you want to make your TV smart...use this! If you want to make it smart AND incorporate it into your Mac Household, go with the Apple TV. BUT I will NEVER say go buy a ChromeStick...I just can't. It's a terrible piece of equipment, while your other less expensive or more useful products put out by Amazon and Apple are must haves!", "verified": true, "helpfulness": "0/0", "author": "Jacob Stanfield"}]