[{"rating": 4.0, "review": "I like the Fire TV stick overall. The remote is a nice relief because I don't always love grabbing my phone or tablet to switch something on the program I'm watching. I'm giving it a 4 because it's a bit wonky (like Roku, which is to say sometimes it works well and other times not so much, unless I unplug it and start all over) and therefore less stable than Chromecast. Whereas I get the added advantage of Amazon Prime shows and a few of my vital \"go to\" apps like Netflix and YouTube, I miss HBOGo. That has more to do with HBO and Amazon than with the stick but it would be nice to have one streaming device to control them all. Overall, I like the stick but think it needs work in terms of stability. I switched to Chromecast to avoid the whole unplug, reset drama I encountered with Roku. And YES, I use the USB cable and it's still not that stable and I would blame my tv but for the Chromecast working without incident.", "verified": true, "helpfulness": "0/0", "author": "Kidada E. Williams"}, {"rating": 5.0, "review": "Very easy to set up and use, only in use a few days but everything is working fine.", "verified": true, "helpfulness": "0/0", "author": "Joan M. Taylor"}, {"rating": 4.0, "review": "excellent performance but does no close caption. Since I am hard of hearing that is a problem", "verified": true, "helpfulness": "0/0", "author": "Ralf Kraemer"}, {"rating": 3.0, "review": "Parental controls need to be better. Wish it was my amazon password to purchase something not a  four digit code. That my son can read as I type it in. Because now you have to type it eveytime you watch something including prime shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The device works well.  The remote is simple and easy to use.  It can also be run off a mobile phone application. Set up was simple.", "verified": true, "helpfulness": "0/0", "author": "bookreviewer"}, {"rating": 5.0, "review": "use it daily for prime movies. Easy to set up, easy to use, remote works great without missing a beat. I also have the google chrome, which is difficult to set up.", "verified": true, "helpfulness": "0/0", "author": "Den \"Spoke and Strings\""}, {"rating": 5.0, "review": "Set up was super easy. Streaming is flawless with no buffering. ( Note: I have a robust, better quality Wi-Fi router which absolutely makes streaming a better experience).As an Amazon Prime member we now have access to a vast library of content. The remote control is a major plus and it works great.Ready to roll !", "verified": true, "helpfulness": "0/0", "author": "RICKVOO \"Mr Handy\""}, {"rating": 5.0, "review": "Very easy to install, you just plug it in and follow the easy instructions on you TV.", "verified": true, "helpfulness": "0/0", "author": "Phyllis S. Beidler"}, {"rating": 1.0, "review": "If you do not live in the USA, DO NOT BUY!!!! Not only you can't see ANY movies, you also aren't allowed to load the YouTube app or the Crackle app o most any app, even though I have them on my computer and smartphone. The most you can do is load the Netflix app and a couple other apps that aren't really very exciting. I AM FRANKLY VERY DISAPPOINTED WITH THIS PRODUCT AND WITH AMAZON!!!I recommend you buy a Mini PC Google Android TV Dongle instead of the Fire TV Stick, it is a much, much better product!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"interested reader\""}, {"rating": 4.0, "review": "Works great for Amazon. Wish other channels shared features like voice search.Needs multi channel search like Roku.Better picture then my Roku.", "verified": true, "helpfulness": "0/0", "author": "MightyMike"}]