[{"rating": 1.0, "review": "I purchase this to watch Amazon prime, but even thought my wireless AP is literally 30 feet away, this fire stick keeps dropping the wireless connections. This doesn't not happen with other wireless devices we have (Apple TV, Roku, Laptops, Smartphones, etc) but happens constantly with this one.", "verified": true, "helpfulness": "0/0", "author": "M. A. Martinez"}, {"rating": 1.0, "review": "It needs to ne compatible with Software such as local cast, playto and other software within this category.  It really deserves the 1 Star rating because of this fact", "verified": true, "helpfulness": "0/0", "author": "PovertySucks \"PovertySucks\""}, {"rating": 5.0, "review": "Works amazingly.", "verified": true, "helpfulness": "0/0", "author": "Carol M. Gearhart"}, {"rating": 5.0, "review": "Amazon is pro-leet as usual, slappin' me upside the head with this new awesomeness, the fire tv stick.I wanna stick it in my face and enjoy it everywhere.  It makes my not-so-smart HDTV an actual platform worthy of my attention.Get one, it's the best money you'll spend this year.  Oh, and while you're at it, get Prime, it could cost twice as much and I'd still get my money's worth.Have a wonderful day, make the world more wonderful for your choices in it.Adam", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "tyree hernandez"}, {"rating": 5.0, "review": "Works great. Enjoying Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Rosemary Farrell"}, {"rating": 5.0, "review": "GREAT INSTRUCTIONS AND EASY INSTALLATION", "verified": true, "helpfulness": "0/0", "author": "BERNARD SILER"}, {"rating": 5.0, "review": "I absolutely love love love my fire stick!", "verified": true, "helpfulness": "0/0", "author": "Stephanie McNeil"}, {"rating": 4.0, "review": "Nice technology that allows you to utilize your Prime membership for Movies, TV Shows and music.  Relatively easy to install and use.  I would recommend for any Prime user.", "verified": true, "helpfulness": "0/0", "author": "Ed \"Slick\""}, {"rating": 3.0, "review": "I live outside US and practically the only conection I can received is Netflix (not even Crackle) and music from Amazon", "verified": true, "helpfulness": "0/0", "author": "Ileana Esquivel Pla \"Ileana\""}]