[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Kandice"}, {"rating": 4.0, "review": "I love this it's great because I have a bedroom that I don't have cable in and this works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Kristine"}, {"rating": 1.0, "review": "This really is a piece of useless junk!  The first one never worked.  That brand new unit was replaced with a refurbished one that also had problems.  It was replaced again, this time with a new one, but it also came with a bill for the full purchase price.  More frustration getting that straightened out.  Finally, I have a working unit right?  NOOO!  It turns out that even though it's advertised as being capable of streaming HBO GO, it doesn't.  Not yet anyway.  I'm told that's two weeks away.  Three months later they finally have the HBO app ready for it.  Right?  NOOO again!  But it gets even better, they do actually have the HBO app that works, it just will not work with the largest cable provider (comcast) in the US.  All the other streaming devices work with Comcast, why not the Fire Stick?  This is what happens when you rush a product out to the public before it's ready.  I will remember this and shop elsewhere for new technology in the future.  You really blew it on this one Amazon!", "verified": true, "helpfulness": "1/1", "author": "jeffrey Blakeley"}, {"rating": 5.0, "review": "Fire TV Stick was the perfect solution for us. We recently moved and our internet connection was no longer near the entertainment center so I could not hard wire the blue ray to connect to Amazon, Netflix or other things.  Fire Stick came pre-programmed with my account and it is SO easy to hook up to the things we want to watch and rent.", "verified": true, "helpfulness": "0/0", "author": "J. Franks"}, {"rating": 5.0, "review": "Love it.  Easy to use and install and very economical.", "verified": true, "helpfulness": "0/0", "author": "anonymous 123"}, {"rating": 2.0, "review": "I hope further use will prove it's hype.  Customer support is nill at best and if they spent less money on the box and more on an instruction manual perhaps less calls to a foreign land for help.", "verified": true, "helpfulness": "1/1", "author": "TM"}, {"rating": 5.0, "review": "Awesome, just wish there were more current movies with prime. Also rental prices are expensive.", "verified": false, "helpfulness": "0/0", "author": "Emilie farris"}, {"rating": 5.0, "review": "Love it so much!", "verified": true, "helpfulness": "0/0", "author": "Busy bee"}, {"rating": 5.0, "review": "Works great for me. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "David Krempa"}, {"rating": 5.0, "review": "Extra  TV not connected to cable, works great.", "verified": true, "helpfulness": "0/0", "author": "Carol Sundqvist"}]