[{"rating": 5.0, "review": "Great.  Really enjoyable.", "verified": true, "helpfulness": "0/0", "author": "Jim Branch"}, {"rating": 5.0, "review": "I'm glad i got these fire stick, I'm loving it and rely recommended to those who don't like paying much money for TV channels or any TV shows, no adds and no commercials. i got 2 of them and got rid of cable.", "verified": true, "helpfulness": "0/0", "author": "MANNURC"}, {"rating": 5.0, "review": "I was very happy with the fire stick the access is very quick and the extender was needed in my installation and seems it would help in many others", "verified": true, "helpfulness": "0/0", "author": "John Parlee"}, {"rating": 5.0, "review": "Works perfect with good wi fi", "verified": true, "helpfulness": "0/0", "author": "Valerie Hockert"}, {"rating": 5.0, "review": "It was a breeze to hook up! Spent a while just cruising looking at all the features!", "verified": true, "helpfulness": "0/0", "author": "LilahLeigh"}, {"rating": 4.0, "review": "Simple. Good movie selection, more options than Netflix. Prime Music feature and Kindle remote app are great, too.", "verified": true, "helpfulness": "0/0", "author": "UserA"}, {"rating": 4.0, "review": "interface is a little clunky in places, but overall this is a good streaming option.  remote is a little too sensitive.  the littlest bump and everything is stopped or messed up somehow.", "verified": true, "helpfulness": "0/0", "author": "Levis_mama"}, {"rating": 5.0, "review": "Recommend kodi, that's how u get everything!", "verified": true, "helpfulness": "0/0", "author": "Kijafa Burgie"}, {"rating": 5.0, "review": "Absolutely perfect for our travel needs.  Bought this so we could insure we'd have access to Netflix for family travel at hotels and rental condos.  Not only did it work flawlessly, the additional features like games worked out very well for our children.  This is a wonderful travel backup plan for electronic needs.", "verified": true, "helpfulness": "0/0", "author": "Paul Vail \"afterhoursconsulting.org\""}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "kayla steed"}]