[{"rating": 5.0, "review": "For the pricing point it delivered beyond my expectation. It would be nice to get old  seasons of Nashville and Suits free, also if you can add ABC/NBC to the line up", "verified": true, "helpfulness": "0/0", "author": "Mo"}, {"rating": 1.0, "review": "Need to return. corder gets hot before movie is over. Not able to use.", "verified": true, "helpfulness": "0/0", "author": "Mary Hammonds"}, {"rating": 4.0, "review": "Very good. I gave it as a gift and was well received.", "verified": true, "helpfulness": "0/0", "author": "Ralph \"Photonracer\""}, {"rating": 2.0, "review": "So disappointed in the Fire TV Stick. I have  Roku Stick that works great with no connectivity issues. I've had the Fire Stick for a couple of days and I've had issues since I installed it.", "verified": true, "helpfulness": "0/0", "author": "AJohnson"}, {"rating": 3.0, "review": "Gives feedback to my antenna.  Have to unplug it to watch over air TV.", "verified": true, "helpfulness": "0/0", "author": "Nick Osborne"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Robin Poole"}, {"rating": 3.0, "review": "For the most part I love my Fire TV Stick. Coming from a Chromecast it sure is nice having a remote and not having to stream from my phone. It has plenty of good apps that most people are already familiar with. The interface is fantastic and a lot nicer looking than Roku.I do have a few complaints though. It disconnects from the Internet quite often and requires unplugging the power from the Stick to reconnect. Not a huge deal but can be VERY annoying when it happens multiple times per movie. Never had the problem with Chromecast. The remote is sometimes unresponsive and again could require an unplugging. Sometimes though it randomly starts working again without having to do so.All in all I would give this 3.5 stars if I could. I will say I am glad I paid only $20 for this during the promotion otherwise I would probably purchase a Roku if I had to do it over. I bought my parents one a couple years back and they've had no issues with it. At $40 this would be a 2 star for me, however.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "It works great! However, it does not a real TV, it will be great if the main television stations are available via Fire TV.", "verified": true, "helpfulness": "0/0", "author": "jun hang"}, {"rating": 4.0, "review": "Took less than 5 minutes to install. Turned an old flatscreen with an HDMI input into a smart TV.  Very user friendly remote-  intuitive layoutGreat value for the price.Would have given 5 stars if  it didn't require a power outlet.", "verified": true, "helpfulness": "0/0", "author": "Howard JG"}, {"rating": 5.0, "review": "Response is quick, video loads quickly, UI is great. The stick is an awesome value. I was a bit skeptical that such a small, inexpensive device could deliver such a good user experience. Love the Amazon prime instant video, the Netflix app, and Sling TV. Can't wait for the HBO Go app. Highly recommend to other cord cutters.", "verified": true, "helpfulness": "0/0", "author": "Andrew R."}]