[{"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Joyce"}, {"rating": 5.0, "review": "Perfect. Thank you for taking the time to resolve our issue. Excellent customer service", "verified": true, "helpfulness": "0/0", "author": "Mildred Valdes"}, {"rating": 5.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "CHENG CHIAO-WEN"}, {"rating": 1.0, "review": "This is a severely handicapped Android based Media Streaming device, designed to create dependance on Amazon's Cloud  services.  Regretfully, Amazon didn't have the insight to offer this device for free for its $99/year Prime membership signup. Not only is the device feature-limited, you have to buy the same apps you bought on Google play for your other android devices, again - from Amazon's so called app store. The UI and remote is a copy-cat of Apple's elegant minimalism, however very inadequate and built on borrowed technology - proving that not every Bozo is as creative and original as Steve Jobs. If anything, the features, borrowed technology, entrapment policy and pricing strategy shows the culture of Amazon's leadership, greed, desperation and poor management strategy. I have decided to pay the $6 return shipping penalty and rather contribute my $35+ to Raspberry Pi.", "verified": true, "helpfulness": "1/1", "author": "Maroof Choudhury"}, {"rating": 3.0, "review": "Needs ui improvement", "verified": true, "helpfulness": "0/0", "author": "Stephen Jr"}, {"rating": 3.0, "review": "We have had a number of issues where the Fire Stick will lose connection with the wifi or say there is not enough bandwidth.  I can look at my phone or any other device and the wifi is working with a high strength in the same location as the Fire Stick.It also is slow to load some of the apps.Not too impressed with the app options compared to Roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"luna1174\""}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Gwen Queen"}, {"rating": 5.0, "review": "Easy to set up- easy to use!", "verified": true, "helpfulness": "0/0", "author": "Jessica Blitz"}, {"rating": 5.0, "review": "Incredible!", "verified": true, "helpfulness": "0/0", "author": "Kevin Fitzpatrick"}, {"rating": 4.0, "review": "Great little addition to my TV.", "verified": true, "helpfulness": "0/0", "author": "Jedika"}]