[{"rating": 5.0, "review": "Love it!  I picked it up on the two day special for Prime members for $20.  I've been waiting to pick up something for streaming without paying a lot for it.  Cannot beat $20.  Like a few others I was slightly disappointed that the stick needs power, especially seeing I am planing on using this in my RV sometimes too.  But not a deal breaker, especially for what I paid.  I added a digital optical audio cable to connect the audio through my Bose (picked up that idea from searching YouTube how to videos) because I need more out of my audio than TV speakers.  The remote is a huge plus, especially for this price, even at the regular $40 it's well worth it and I recommend it.  Games and other apps are nice too.  Hoping to get Show Box on there somehow too.", "verified": true, "helpfulness": "0/0", "author": "J. Leonard"}, {"rating": 1.0, "review": "Very disappointed this is not as \"portable\" as they make it out to be.  Looking at the pictures in the general description it does not show a plug.  Thought I would be easily able to move this from one TV to the next but it must be plugged in at each TV.  Need to make it clear in the general description and pictures that this needs a power cord and is not powered by the TV!  Why have all the pictures without a cord unless you're trying to mislead people into thinking it's actually portable?", "verified": true, "helpfulness": "1/2", "author": "Beth"}, {"rating": 3.0, "review": "Unable to switch back to FIOS after using the fire stick. I have to turn off the entire system and turn back on after using the fire stick. Searching for movies is a little difficult. When I have found something to watch, it's been great. Great potential for a great product.", "verified": true, "helpfulness": "0/0", "author": "peach257"}, {"rating": 1.0, "review": "Sluggish performance. Some apps, namely Hulu do not function well on it. The streaming pauses frequently. I have Roku devices on wifi in the house that don't have any issues with Hulu. I tried the Fire Stick from multiple locations and had issues from every one. Upon searching, it seems others had issues as well. The voice search worked well on it, but I ended up returning it and purchasing another Roku. Can't deal with the constant streaming issues with the Fire Stick. I'm sure it will get better as they update the device, but it's just not ready for prime time right now.", "verified": true, "helpfulness": "0/1", "author": "M. Shiffer \"Mark\""}, {"rating": 5.0, "review": "Great product with effortless programming. Very Satisfied", "verified": true, "helpfulness": "0/0", "author": "David A. Kenney \"FAA ATC\""}, {"rating": 5.0, "review": "Works just as described.  I have an Apple TV and a Roku and I feel like this little guy basically does the exact same things you'd want out of the Apple/Roku at a fraction of the price.  Very happy customer.", "verified": true, "helpfulness": "0/0", "author": "NikGinKC \"*NikG*\""}, {"rating": 5.0, "review": "very satisfied", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little guy is awesome, brought everything I did on my computer to my living room TV where I can sit on the couch and enjoy.", "verified": true, "helpfulness": "0/0", "author": "fUji™"}, {"rating": 1.0, "review": "does not support all of my apps!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a great product. Works as expected. I only gave it five stars because I couldt get Acorn TV as an option. Except to pay for the programs I already pay for thru a subscription. That was disappointing.", "verified": true, "helpfulness": "0/0", "author": "Janet Allan"}]