[{"rating": 5.0, "review": "Love it.  Soooo many options.  Sideloading apps is a must!", "verified": true, "helpfulness": "0/0", "author": "J. Ridgely \"crassh76\""}, {"rating": 5.0, "review": "Have'nt  got to use it yet but the posibily are wonderful", "verified": true, "helpfulness": "0/0", "author": "Rudolph Pickering"}, {"rating": 5.0, "review": "Amazing what this little device can do! Makes any TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Edward R. Marton"}, {"rating": 5.0, "review": "Well worth the coin for systems not already on WiFi, or without an AmazonPrime connection...", "verified": true, "helpfulness": "0/0", "author": "TiggerBones"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "mary garcia"}, {"rating": 5.0, "review": "Love this product! Perfect for living in an apt complex this is the only device that will work! Love it!", "verified": true, "helpfulness": "0/0", "author": "als8830"}, {"rating": 5.0, "review": "A while back I got totally fed up with my cable service and went pure internet with my tv.  I bough the larger Fire Box and an Apple Box for my big screen and then bought a fire stick for my bedroom.  I am so happy with it.I also have an outdoor projector and used to mirror my kindle to it.  Now with this, I just plug it in and go!  So much easier!", "verified": true, "helpfulness": "0/0", "author": "MeAmazon"}, {"rating": 4.0, "review": "Still early to tell so far so good", "verified": true, "helpfulness": "0/0", "author": "Art Plummer"}, {"rating": 5.0, "review": "We have a home in a remote location, and we worried that the internet connection would not be strong enough.  Not the case!  We are thrilled to have access to our Amazon account, Netflix and Pandora for a start!", "verified": true, "helpfulness": "0/0", "author": "Sharon M. Campbell"}, {"rating": 5.0, "review": "I love my new firesticks.  So glad I got them.", "verified": true, "helpfulness": "0/0", "author": "Nancy Lee Holmes"}]