[{"rating": 5.0, "review": "Love it. Easy set up as well.", "verified": true, "helpfulness": "0/0", "author": "Happy pet owner!"}, {"rating": 3.0, "review": "Ok product, but has connectivity issues frequently", "verified": true, "helpfulness": "0/0", "author": "S. Johnson"}, {"rating": 3.0, "review": "I have both Chromecast and FireTV Stick now and it certainly does not beat Chromecast. Chromecast lets you play local media without having to upload it to the web via Real player App. Also, the amount of apps on the Android Market that now have Chromecast capabilities are so much more then Amazon and lastly you don't have to be hooked up to the internet to use Android Apps. Those things make the lesser Chromcast a better buy. When i can cast my computer tabs or phone screen or whatever i want to Chromecast, its just so much more versatile, that puts it ahead of Firestick. For now Chromecast is still the winner. I am waiting for Matchstick to come in the mail and then i will see who wins that three way battle. Hopefully by that time FireTV stick has done somethings to make it better then Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Max"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/1", "author": "E.L."}, {"rating": 3.0, "review": "Great interface which operates smoothly.  However, the device apparently doesn't buffer as well as my Apple TV:  I haven't been able to watch anything because it keeps pausing to download, and after a few pauses tells me my connection is too slow.  I've got a 6 MBPS connection, which isn't super fast but it works just fine for my Apple TV and my Samsung smart TV.  I also haven't had time to futz with it (and ideally, shouldn't have to), but if I can't watch anything it's going to go back to Amazon.", "verified": true, "helpfulness": "0/0", "author": "A. Mayer"}, {"rating": 5.0, "review": "I got this when Amazon offered it to Prime members for $20. For $20 it was a great deal. I already have an Apple TV, and the only thing it didn't have that I wanted was Amazon Prime Video. Now I have it. I also received this week a Roku 3, and hate it. Horrible interface and a ton of crap channels that I'll never watch. Apple TV and a Fire TV Stick is your best combination.", "verified": true, "helpfulness": "0/0", "author": "Ronnie in San Diego"}, {"rating": 3.0, "review": "Wish it had more apps", "verified": true, "helpfulness": "0/0", "author": "ANAYAS PITS"}, {"rating": 5.0, "review": "I must say that the fire stick exceeded my expectations.  Easy to navigate,  great Android app which allows for voice commands.  Music and games are an added bonus.Easy to set up.I use it every day.", "verified": true, "helpfulness": "0/0", "author": "M. Gordon \"throtol\""}, {"rating": 4.0, "review": "I like the streaming much better than using the WII!", "verified": true, "helpfulness": "0/0", "author": "Marilyn Reece \"MLDR22\""}, {"rating": 1.0, "review": "I think this has the potential to be AWESOME but mine, right now, is anything but. I love the design and the packaging. I plugegd everything in and attempted to begin setup. Immediately, I was told that it was not connected to the power supply even though it was. I unplugged and replugged several times until I finally took off the extender and plugged directly into the tv. When it came time to connect to my network, I had to walk through these steps 5 times before it finally established a connection. The entire setup process took over 45 minutes before I could even get to the point of the welcome video.I began signing into my accounts on the Netflix and Hulu Plus apps and it seemed to be working ok for the first 5 minutes but then the remote started flipping out. Sometimes it would lag a few seconds before responding; other times just one click would send the cursor darting wildly in every direction for several seconds before finally stopping clear across the screen. I removed and reinserted the batteries hoping to reset their connection, but no luck.The following night, and the two nights since, I cannot even get the FireTV stick to connect or maintain a connection with my network. If I use the extender, I'm warned that it is not connected to the power supply (even though it is). I don't know if I just happened to receive a faulty device or if this is what to expect will any of this first iteration. I will be sending it back and asking for a replacement. I'm really hoping that resolves my issues because I think, if working properly, this will be a fantastic device.", "verified": true, "helpfulness": "0/0", "author": "*Shannon*"}]