[{"rating": 3.0, "review": "First off, I was one of the lucky Prime members who preordered this device for $19. I was super excited to get it and streamed on it the whole first day I had it - Hulu, Netflix, Crackle, I tried it all, and it was great. Then later that day, it suddenly refused to connect to any wifi. Even wifi that had great signal strength. I had to reset the stick, and it all worked again. This whole reset issue happens pretty regularly (I've had it for a month now and use it almost daily). If I had paid a full $39 for it I might be pissed, but for $19 I'm willing to play the reset game I guess.", "verified": true, "helpfulness": "0/0", "author": "sjm"}, {"rating": 5.0, "review": "Easy to use, clear picture, great price", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Extremely surprised at the ease of setting the Firestick up.Effortless and amazing technology!!!!", "verified": true, "helpfulness": "0/0", "author": "Patrick R Law"}, {"rating": 3.0, "review": "I'm a little disappointed in the Fire TV Stick. It has numerous viewing options, but almost everything cost per view. I just wish It had a place, or icon, to view FREE TV OPTIONS.  You can find them, but you have to drill down to what seems like endless menus. I like Pluto TV and Docudrama TV (Not the best, but they are FREE!)If you are wanting to kill your cable and watch the same shows, well that is possible, but I don't think I would save any money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "OUTSTANDING!!!", "verified": true, "helpfulness": "0/0", "author": "michael roche"}, {"rating": 5.0, "review": "Works great, thanks to my son as I got it for Christmas as I love to watch Amazon prime", "verified": true, "helpfulness": "0/0", "author": "ella"}, {"rating": 4.0, "review": "Good product, will be ordering another one .", "verified": true, "helpfulness": "0/0", "author": "KIRK BRAYSHAW"}, {"rating": 4.0, "review": "So far we love it!! We've had no issues & it's so easy to use!:)", "verified": true, "helpfulness": "0/0", "author": "Anna K"}, {"rating": 2.0, "review": "After giving the Fire TV Stick an honest try for the past month, I can safely confirm that it's a nice idea with poor execution. It's a nice device that can act as a hub for all of the streaming services and the remote made it more appealing than a Chromecast at the time. With that said the built in WiFi is garbage. Over the past month it dropped my connection and forgot my WiFi password on 3 separate occasions and every time I tried to reconnect the signal dropped from full strength (my router is in the same room) to 1 bar. Meanwhile I was able to fluidly browse the web on my laptop indicating to me it wasn't a problem with my ISP or my router.The first two times I was able to get it connected with A LOT of perseverance (i.e. unplugging it and putting in the password again and again until it stuck), but this time I can't be bothered. It's unacceptable that a dongle built to be an always on streaming device fails weekly. I either received a faulty Fire Stick or Amazon's testing department woefully underperformed on this device. Until Amazon releases a firmware update to address the WiFi problems, I'll be using my Chromecast.tl;dr Stick often drops connection rendering it useless. Powerful hardware doesn't mean much if it's less reliable than the competition.", "verified": true, "helpfulness": "0/0", "author": "Michael O."}, {"rating": 5.0, "review": "Wow this is excellent. Regular Lcd tv  went to smart tv. So amazing! !!", "verified": true, "helpfulness": "0/0", "author": "Gregary V. Floyd"}]