[{"rating": 4.0, "review": "I enjoy it very much.. the remote however could use a little more functions added other than that it's great.", "verified": true, "helpfulness": "0/0", "author": "tonia smith"}, {"rating": 4.0, "review": "It works just fine and is a great addition for the second bedroom. I took one star away because the adds on TV are misleading. It doesn't just plug into the HDMI port, it also requires a power supply - extra cable and extra power socket. If your TV in on the wall and you only have one power outlet, you are out of luck.", "verified": true, "helpfulness": "0/0", "author": "Bubba Kastorsky"}, {"rating": 4.0, "review": "Its Great!! Love the ease of the remote.  One thing to note is to let everyone know you have to plug it in.  From the looks of it and from the Amazon page it looks like it just goes in HDMI slot and poof ready to go.  I did not know it had to be plugged in which was a hassle but needless to say I got it arranged and it works great!!", "verified": true, "helpfulness": "0/0", "author": "Brian St.Onge"}, {"rating": 3.0, "review": "I'm a home theater and technology enthusiast trying to simplify my TV and media setup, so keep in mind that bias in the review.  The main reason I purchased the Fire TV Stick was the sale for Amazon Prime users, and my frustration at my setup for the TV in the bedroom.  It works \"OK\" for the bedroom, but was miserable when I tried it in the Living Room.  I *REALLY* wish Amazon would stick to content delivery and just focus on making sure I could access their content on all devices (Like the Nexus Player, and my Android Tablets).  I haven't been excited by any of their electronics beyond the eInk Kindles, and their insistence on controlling the platform and the content pushed me towards more open platforms.Pros:* Cheap, convenient* Fast interface* Graphically rich interface* Convenient for Prime subscribers* Has a Plex client which looks really goodCons:* Forces you to have multiple remotes.  The included remote is only for the stick, and the stick does not work with IR universal remotes.  For the first time in a LONG time I can't use a single, simple universal remote to control the TV in the bedroom.  In order to get a remote compatible, you'd have to spend >$100 for a Logitech Smart Home Hub setup that supported Bluetooth.* Audio issues with 5.1 or better audio in Plex.  Basically, I can't get it working and the forums are full of complaints.  In contrast, the Audio playback on a Roku is perfect, and almost never needs to be transcoded.* Amazon pushed their content so aggressively it's harder to use for anything else.  So many sections devoted to so much different Amazon content make it cluttered and chaotic.* There is no way to \"pin\" apps like Netflix or Plex at the top of the home screen, for quick access.  If you watch a lot of Amazon media your other apps will get pushed off of the top of the home screen and you'll have to scroll down and over many clicks to get to the apps again.* While you can sideload other apps, accessing them requires entirely too many clicks to get to a buried menu.* The WiFi prefers 2.4GHz over 5GHz.  Playback was crap until I create a wireless network that was only 5GHz to Force the Fire Stick to use 5Ghz.  Much better performance now, but kind of a pain.* The Amazon Music interface was so inconvenient I stopped even trying to use it.* Limited Apps - No HBO Go (yet - coming soon), no access to Google Play or Google Music.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product... Still finding out all he great things that it can do..", "verified": true, "helpfulness": "0/0", "author": "Rommerome"}, {"rating": 5.0, "review": "Love my new fire tv stick! User friendly and awesome quality. Has everything as promised by amazon!", "verified": true, "helpfulness": "0/0", "author": "S. Mccloud"}, {"rating": 5.0, "review": "LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "Priscilla Whitaker"}, {"rating": 4.0, "review": "The stick is fine. The motion pictures being offered to Prome users  are inferior.", "verified": true, "helpfulness": "0/0", "author": "C. Debrovner"}, {"rating": 5.0, "review": "Really like it!!!  Very user friendly, set up so easy and provides alot of options in one little stick/", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent!  Easy to install, great viewing options and well worth the cost.", "verified": true, "helpfulness": "0/0", "author": "Nav6770"}]