[{"rating": 3.0, "review": "Slow and lags.", "verified": true, "helpfulness": "0/0", "author": "raygin"}, {"rating": 4.0, "review": "I would have to say this is my favorite of the \"Stick\" TV products such as the Roku Stick and such.  It still has it's bugs though.  Typically when watching Netflix for a long while I can have some kind of error from the sound dropping out for a few seconds or not syncing with the video to playback difficulty.  Usually if I fully restart the device it seems to clear the problem.In the future I would just spend the money to buy the full box rather than the stick styles unless I really moved it around a lot.  I was just trying to save a little money and I think it would be worth just spending the extra to get the faster product.  This is still a worthy product though and I will continue to use it.", "verified": true, "helpfulness": "1/1", "author": "Dave"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick does exactly what it is supposed to, and thats great. The fact that it allows for \"captive portal\" wi-fi networks is unique to Fire TV, and has proven very useful. I don't use many different web streaming services, but the two which I do, Netflix and Prime Instant Video, are easy to access on this device. I would like if the \"apps\" section was somewhat closer to the home screen, or if I could have a personalized favorites menu. This is a minor detail, but I mention it because if Netflix (or any \"app\") isn't in your \"recents\" menu, then the process of finding apps is more involved than it should be. Even with this being said, I am extremely happy with the Fire TV Stick. It works very well, has lots of great features, and is  definitely the best buy in terms of streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Paul D."}, {"rating": 5.0, "review": "Excellent. I previously accessed Netflix through my WII wi-fi connection, but this is awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Ely Ortiz"}, {"rating": 5.0, "review": "Fabulous product.  Works exactly as expected.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 5.0, "review": "Works like a charm!", "verified": true, "helpfulness": "0/0", "author": "HappierThanMost"}, {"rating": 4.0, "review": "Just one Word. AMAZING!!.I bought this one on Prime Day Deal. The Picture Clarity and the Number of Apps makes it worth a buy.Its much better than Chrome Cast in many aspects ( I already have a Chrome cast with me).I would definitely recommend the Fire Stick to my friends.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "This replaced the other brand that I was using and Fire Stick is fantastic.  Easy to set-up and use.  Love it.", "verified": true, "helpfulness": "0/0", "author": "John Leahy"}, {"rating": 5.0, "review": "Very nice, access to Prime is nice, I enjoy using the iHart radio app on my TV.", "verified": true, "helpfulness": "0/0", "author": "Coach_A"}, {"rating": 4.0, "review": "The only way this product could get better was if the maker's had included a way the buy a season of the show you want to watch instead of having to buy individually when purchasing via TV.", "verified": true, "helpfulness": "0/0", "author": "Emily York"}]