[{"rating": 4.0, "review": "Sometimes the wireless devices a bit when using it because it slows the buffering.", "verified": false, "helpfulness": "0/0", "author": "Rosena Robinette"}, {"rating": 5.0, "review": "Awesome! Met all of my expectations!", "verified": true, "helpfulness": "0/0", "author": "Jason Foster"}, {"rating": 5.0, "review": "Working good", "verified": true, "helpfulness": "0/0", "author": "Emilio Cortez"}, {"rating": 5.0, "review": "Works great!!! Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "J.M."}, {"rating": 5.0, "review": "best stuff ever!!", "verified": false, "helpfulness": "0/0", "author": "Siviany"}, {"rating": 1.0, "review": "We were unable to use the stick.  It would not load.  I think it will be returned.", "verified": true, "helpfulness": "0/0", "author": "Linda S. Hames"}, {"rating": 4.0, "review": "I have amazon prime and it is a great way to take advantage and watch the movies available.  I am planning on taking it with me on trips be able to watch what I want while I am away.  I have grandchildren and it is very handy to have shows and games available when they come over.  I like that the remote is a good size.  I have also apple TV and their remote is so tiny it is easy to misplace, especially when little ones are around. If you have amazon prime it is a great investment!", "verified": true, "helpfulness": "0/0", "author": "SW"}, {"rating": 5.0, "review": "The first real Amazon product I have owned that is part of the ever-growing Amazon environment. I got mine for the promo price to Prime members last January I believe. It has worked very well for me in every way so far. It streams cleanly and clearly, works pretty quickly and has loads of applications, netflix, hulu, plex. I use plex for my home media server, and the fire stick is by far the best Plex UI I have used. Now I know that is the app and not the Fire Stick itself, but I felt like that would be good to mention because it is what I use the stick most for. That and Prime streaming.Let me also point out that, aside from my smart tv, this is the first ever streaming device I specifically purchased. And I can say that this is the first one I really ever took advantage of. I had the tv but used its \"smarts\" rarely. This stick is small, portable, well made, and simple to setup. Really an excellent buy as compared to the other competing devices out there. Not to take anything away from a Roku because I have used those before with other people, but this stick is just as good, as those an compared to the roku stick, better. When I say better I mean that the UI is solidly on par with or better, and the speed is much better in my experience.----Breakdown-----Pros:- Small- Solid UI- Works fast- Setup is cake- Has many apps available and gets more all of the time- Great Price- Portable- Can sideload apps ( I used an snes emulator that worked well enough on it)Cons:- Needs a separate cable for power (however all of the sticks seem to)- Not as robust as the Fire TV (slower, no voice control out of the box)  Sub point- If I wanted those things I would have spent the $60 more and got a Fire TVI cannot recommend this product enough. The function that it has. especially for the price, is really unmatched.", "verified": true, "helpfulness": "0/0", "author": "aivanov"}, {"rating": 5.0, "review": "Bought since my smart TV is not compatible with Instant Video. I also like the mobility option so i can take it with me and watch movies or listen to music when I travel for work or vacation.", "verified": true, "helpfulness": "0/0", "author": "Maribel Padua"}, {"rating": 2.0, "review": "It played excellently and clearly but the remote broke almost immediately, for no apparent reason.  When I read that others' remotes were breaking easily also and they had to buy new expensive replacements ones, II decided to just get a Roku 1 instead (and it's just as great and with a durable remote also)", "verified": true, "helpfulness": "0/0", "author": "John Karl Reynolds"}]