[{"rating": 5.0, "review": "My main streaming machine is my upper mid-range Sony BD, and I also have a Roku 3 on my other TV, and a Chromecast.  I got the Fire Stick during the two-day sale because \"I gots to know.\"  Performance-wise, it actually does a better job of streaming than my Sony, especially on Amazon Video.  The only drawback for me, as with other Amazon products, is that it can't do Vudu.  But I'm actually keeping it plugged into my main TV because of the better performance of Fire on networks it can handle.  I'm impressed enough to spring for a Fire box when time to upgrade.  Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Jon D \"Combat journalist, media consultant, goatherd\""}, {"rating": 5.0, "review": "Just got my fire stick, it works as good as my apple tv, I bought 2 at $19.00 when it went on sale, wish I wold had bought 5 at tat price, easy to install, works great, it is wonderfull, please have it at 19.99 again, I will buy more. VERY EASY", "verified": true, "helpfulness": "0/0", "author": "R. Monestier \"bathroom tv watcher\""}, {"rating": 4.0, "review": "Good so far - still exploring.", "verified": true, "helpfulness": "0/0", "author": "Michael McBride"}, {"rating": 5.0, "review": "First, just let me say I never write reviews because I find that not many things ever live up to their claims. Well this little stick is a whole different story. It does everything it claims to do with more speed and grace then its current competitors. So I kind of feel I am connoisseur of streaming players. I own a Roku 3, Vizio Smart Tv, Xbox one, PS3, Apple TV and a few others through the years and will have to say this one finally got something right. It is user friendly and fast. When I say fast I'm talking this little stick makes my Roku 3 feel like waiting on a slug. You click on a video to watch and its just there almost instantly. The design of the menus are clean and if you want to get real fancy you can put it into developer mode and add all kind of 3rd party apps. I can already tell you the Roku is going up on Ebay and I'm ordering another Fire Stick for the bedroom. It has basically every channel Roku has minus HBO Go but they say that's coming soon and if you have prime you can watch most of the HBO shows anyway. So that's not a issue for me. This thing really won me over in the first 5 Min with its easy setup and fast Wifi ( plus the little video showing you how to work it was a nice add-on). I had bought my father in law a Roku stick about 2 months ago. I spent 4 hours trying to get it to work. The Wifi sucked so bad on it I couldn't keep it connected to the router 5 feet away for longer then a min. Needless to say it went back to the store. The Fire Stick was also boxed nice. I liked the little extra HDMI extender cord it came with. It repeatedly ask you to use the power block it came with for best results but I just have mine plugged into my TVs USB and it powers it just fine with no wires showing. So in saying all that my thought is if your looking for a great little streaming device I really don't think you have to look any farther ....... The Amazon Fire TV Stick is where its at.", "verified": true, "helpfulness": "0/0", "author": "Chris Collett"}, {"rating": 5.0, "review": "Works fast, easy to setup, and quality is great.", "verified": true, "helpfulness": "0/0", "author": "Nathan Printz \"Wired for Life\""}, {"rating": 4.0, "review": "Just had this a couple days.  It was easy to set up and use.  A couple times it has strugged to find the internet connection, while other devices run just fine.  Overall I'm happy I purchased the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Some minor issues", "verified": false, "helpfulness": "0/5", "author": "Mike Abrego"}, {"rating": 5.0, "review": "Very good product. I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "keith thomas"}, {"rating": 5.0, "review": "Love it!!!!! I rented my first movie this past weekend and it was so easy to use! I can hardly wait to get Netflix and have many more possible shows to watch.", "verified": true, "helpfulness": "0/0", "author": "M. Trexler"}, {"rating": 5.0, "review": "I Never write reviews because I have 3 kids and finding time is a kin to finding palladium in my yard...  That being said, I just received my fireTV stick today and after a very fast setup procedure I was up and running!  Folks, I've had them all.  Roku(several models), ChromeCast, AppleTV(2nd gen), and even an Original Xbox with XBMC!  I've loved each of them for various reasons.  I won't go into reviews of any of those to save time.  Speaking of saving time, I plugged my fireTV stick in and magically it had already been setup with my Amazon Prime account which made initial setup such a breeze!I should mention that it worked wonderfully plugged directly into my AV receiver rather than the setup I believe most of you will have of plugging directly into your TV.  It was rather seamless and I have to mention here too that you'll want to use the included USB power adapter for best results.  Easy for me because I have a remote AV closet that everything gets plugged into so that my TV can just be beautiful hanging on the wall in my living room without all of my components and their wires all over the place!  That being said, the remote communicates flawlessly without lag with the fireTV stick through the wall!  I've had some lag issues and even issues where the remotes didn't respond at all through the wall so this was awesome to just have work!Like Roku, there are on screen apps which I love.  Being able to have apps on the actual device has always been nice compared to the Chromecast which literally requires you to use your phone or tablet.  I have a very nice remote that simply works as it should.  Nothing complex.Load times are faster than my latest gen Roku, which honestly really surprised me a lot seeing that it's just a stick.  Amazon Prime Video probably loads the fastest and that shouldn't come as a surprise :)  It was nice to have Amazon videos continue similar to what I'm used to with Netflix on my Roku.  I can now leave the room for longer than 20-30 minutes which is the average length of a kids' educational program, because they play back to back.  Bottom line here is that the device works better than advertised!Bottom line, if you need media on a TV, then this is an amazing choice to say the least.  It meets the competition in most and even steps up and beats the competition in some tasks.  If you need USB input, a card reader, IR-remote capabilities, or some of the other fancy functions, then look elsewhere.  However, consider this for all your needs otherwise.  I was able to get this for $20 early and that was an insane value!  It's clearly worth more than the $40 Amazon wants for it though to be honest.  Chromecast is $35 and doesn't hold a candle to the speed alone that this stick has.", "verified": true, "helpfulness": "2/2", "author": "Nic H."}]