[{"rating": 5.0, "review": "Awesome entertainment addition. Easy to use and is great if you do not have a smart tv. Absolutely the only decent thing purchased on prime day...", "verified": true, "helpfulness": "0/1", "author": "Mike"}, {"rating": 5.0, "review": "This product exceeded my expectations.", "verified": false, "helpfulness": "0/1", "author": "rory29"}, {"rating": 2.0, "review": "Almost a year since I bought it but haven't used it much due to inconsistent performance. It has a hard time staying connected or finding my wireless router. The router is in the room above and my other products have no problems connecting to it. Its the wireless cable/router provided by Comcast. 2nd gen Apple TV which is further away has no issues connecting as well as my 2006 Macbook. When it does connect and stays connected it is fine but it is a hassle waiting for it to connect and stay connected. Much easier to use the Amazon prime app on the iPhone and send it to Apple TV to watch movies/shows.", "verified": true, "helpfulness": "0/1", "author": "CeDe"}, {"rating": 4.0, "review": "Needs more instructions", "verified": true, "helpfulness": "0/1", "author": "S.E. Welles"}, {"rating": 4.0, "review": "Even someone as electronically challenged as myself had the stick installed, up and running in 10 minutes.I love the tons of selections and will probably save some money on my cable bill too.Only gave it four stars because frankly I am annoyed about their Amazon day on July 15. I was all hyped up to buy the stick for $24 and a savings of $15.The waiting list tried to stick for $24 was full??Yet they had one for me at $39, the regular price. Oh please!I would expect Amazon to refund all of us $15 each for everyone Who paid regular price on July 15.Shame on you Amazon!", "verified": true, "helpfulness": "0/1", "author": "Susan Lynn \"cat lady\""}, {"rating": 5.0, "review": "Awesome device for Prime members!", "verified": true, "helpfulness": "0/1", "author": "Felix Reznitskiy"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "jamie l everts"}, {"rating": 5.0, "review": "Clear picture. Easy setup. Remote is small, but few buttons anyway. Pics up wireless signal from two rooms away without issue. Great device!", "verified": true, "helpfulness": "0/1", "author": "Robin Grondin"}, {"rating": 4.0, "review": "Definitely what I expected, just wished that Amazon prime had more shows and movies.", "verified": true, "helpfulness": "0/1", "author": "Vera L Chacon"}, {"rating": 5.0, "review": "Great alternative to cable", "verified": true, "helpfulness": "0/1", "author": "Christopher Whitley"}]