[{"rating": 5.0, "review": "This has made my life so much easier when it comes to finding movies easily.  Love it.  So easy to connect to TV", "verified": true, "helpfulness": "0/0", "author": "Vivian Fuller \"Valentine\""}, {"rating": 5.0, "review": "Absolutely love Amazon Prime and my firestick", "verified": true, "helpfulness": "0/0", "author": "Chassie"}, {"rating": 2.0, "review": "I own three (gifts) never use them, works but not that great.", "verified": true, "helpfulness": "0/2", "author": "Terry King"}, {"rating": 5.0, "review": "Easy to set up and use. Recommend it to all my friends.", "verified": true, "helpfulness": "0/1", "author": "Allan Bregman"}, {"rating": 4.0, "review": "I have noticed that sometimes it deletes items from my watchlist. BUT I LOVE IT!! We are probably going to get rid of our cable soon. It has everything we need.", "verified": true, "helpfulness": "0/0", "author": "Jamianne Velosa"}, {"rating": 5.0, "review": "I love it. Love that I can watch Netflix in my room now.", "verified": true, "helpfulness": "0/0", "author": "Stacy Angley"}, {"rating": 5.0, "review": "Great. Have it now in two rooms in my house sans the huge cable bill. View different streaming services (Netflix and Sling) and my son doesn't even realize we no longer have cable. Saving over $90 a month!!", "verified": true, "helpfulness": "1/1", "author": "Amanda Carriere"}, {"rating": 2.0, "review": "I like it but using Netflix and Youtube it keeps stopping and having to reload. I could just hook up my HDMI wire to my laptop with better results. It was supposed to make my life easier but it doesn't. I can't watch anything on Netflix for more than like two minutes without it stopping to reload. I didn't think I needed to pay 99 dollars for the box which I'm not doing. So i'm very agitated with the product in that regards. It has made streaming like AOL dialup in the early 2000sAlso, Hulu Plus NEVER streams right on the fire stick. I still have to use my laptop to watch it. It is steadily becoming a waste of 40 bucks. With Amazon you have to pay the 60 dollar difference I guess it you want things to stream correctly.", "verified": true, "helpfulness": "1/1", "author": "kia"}, {"rating": 4.0, "review": "Product works very well, easy to install and setup... unfortunately a large number of shows require an additional subscription or a small fee... even for prime members. .", "verified": true, "helpfulness": "0/0", "author": "Jeff Arnold"}, {"rating": 4.0, "review": "Took over an hour to initalize, then failed to see any wirless networks. Finally it popped to life and I can stream netflix.Turns your \"not smart\" TV into one.", "verified": true, "helpfulness": "1/1", "author": "dcjg"}]