[{"rating": 3.0, "review": "I have had the full Fire TV box since it's initial release.So far, it has been a strong performer, and I couldn't be more happy.I've used it wirelessly for many months, without issues.Recently, I purchased the Fire TV Stick for an extra TV in my home.Since the extra TV was very close to my router,I moved my Fire TV box over there, to take advantage of the wired Ethernet connection.I installed the new Fire TV Stick on my big screen TV in the living room,approximately 25 feet away from the router.From a line-of-sight standpoint, there is a single wall, and a closet door in between.The Fire TV Stick seems to handle most of the standard-def applications just fine.Watching standard def on Netflix and other apps streamed smoothly,with no noticeable interruptions.However, it fails miserably watching high-def via the HBO GO app, Prime Video, and Netflix.With HBO GO, The picture quality is adequate,but it is plagued by buffer, after buffer, after buffer.It would pause as frequently as every 15-20 seconds during play,making it totally unwatchable.For Prime video/HD and Netflix/HD, there were no buffering issues,but the picture quality was poor -- watery distortion in many scenes.Overall, I'd consider the picture quality poor.For testing, I immediately unplugged the stick, and re-installedthe full Fire TV box in it's place, in the same location.I ran HBO GO in high-def for about 10 minutes, without a single buffering issue.I then turned it off, and re-installed the stick,and it was back to buffering again.Re-orienting the stick, and extending it away from the TV made no apparent difference.I even went to far as to extend it a full 5 feet closer to the router, with no effect.Changing the position of the antennae on the router made no apparent difference either.I moved the stick to the TV that is only a few feet away from the router,and that seemed to clear up all of the buffering issues.Note:  WiFi status on both the Fire TV box, and the Fire TV Stickat this location both showed up as \"Very Good\" during testing.My conclusion is that the WiFi on the Fire TV Stickis somehow inferior to the WiFi on the Fire TV box.If distance is a factor for you, I recommend the box, over the stick.", "verified": true, "helpfulness": "1/1", "author": "Tim"}, {"rating": 4.0, "review": "Eas operating", "verified": false, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "Does not make fire, but burns well enough.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Cossey"}, {"rating": 5.0, "review": "Love love love it honestly we are going to do away with all our TV programming the prime videos and netflix are awesome this is the best 40.00 I have ever spent !😃😃", "verified": true, "helpfulness": "0/0", "author": "karen waites"}, {"rating": 1.0, "review": "very angry with this. it worked the first day and now it will not connect at all.", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 1.0, "review": "This is absolutely the worst thing and i would not recommend it to anyone. It doesn't even work 90% of the time, it is very frustrating. I constantly have to keep resetting it.", "verified": true, "helpfulness": "0/0", "author": "Emily Burningham"}, {"rating": 1.0, "review": "Has a hard time playing on our tv.  Keeps droppinv signal.  Wifi box is in the next room.  Customer service is a joke.  Told me to take the wifi tower into the room I was watching the tv.  Does not work on the second floor.  Just threw the money out the window.  Told to me to ask my wifi carrier to extend the signal strength.  Very disappointed.  Can't hardly use it..", "verified": true, "helpfulness": "0/0", "author": "Royia"}, {"rating": 5.0, "review": "Great with lots of unique features.  All of the CDs I've bought are accessible  through the Fire Stick.  Didn't know to expect that.", "verified": true, "helpfulness": "0/0", "author": "Dr. Tim Wilson"}, {"rating": 5.0, "review": "Best product than chrome, Apple TV and Roku", "verified": true, "helpfulness": "0/0", "author": "Chandu"}, {"rating": 5.0, "review": "Super great value! $40 and this thing does all kinds of stuff.", "verified": true, "helpfulness": "0/0", "author": "James Walsh"}]