[{"rating": 5.0, "review": "Great gift and almost a nessecity to your tv. By simply buying this device you can make any tv into a smart tv. The video quality is excellent as expected with an amazon product.", "verified": true, "helpfulness": "0/0", "author": "Unhappy customer"}, {"rating": 1.0, "review": "Would be great if it worked – but it just sputters and stops and starts. I've definitely not ever watched even a sitcom all the way through without it stopping or losing audio sync. Or just freezing and playing audio only. The stick is about 3–4 feet from the very fast Wi-Fi router.", "verified": true, "helpfulness": "0/2", "author": "P. Horne"}, {"rating": 5.0, "review": "My husband and I absolutely LOVE THIS PRODUCT! The menu is SO EASY to navigate and it is SO much easier than using the \"SMART\" feature on our TV. WE LOVE AMAZON FIRE STICK!!!!!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Piekarski"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tina Helsinger"}, {"rating": 2.0, "review": "It's \"interesting\" that the Fire Stick features Netflix heavily in its advertising and menu, yet I cannot play Netflix on it - I get \"this item cannot be streamed right now, please try again later\". This happened for every item I tried earlier. Tonight it happened when trying to watch something on Netflix right after streaming an entire film at high quality... from Amazon Prime. I'm not streaming the exact same thing at high quality from my old Roku, attached to the same TV and the same wifi connection.Conclusion: Fire Stick works great - if you ONLY want to watch Amazon. Featuring Netflix in the Fire Stick advertising and UI is misleading and false.", "verified": true, "helpfulness": "0/0", "author": "Deirdre Straughan"}, {"rating": 5.0, "review": "Amazing and love it", "verified": true, "helpfulness": "0/0", "author": "Gabriela N Wardell"}, {"rating": 5.0, "review": "I am finally about to figure out how to use it and I love it-My daughter go it for me for christmas and it has been a wonderful gift!", "verified": true, "helpfulness": "0/0", "author": "Nana"}, {"rating": 5.0, "review": "It's awesome!", "verified": true, "helpfulness": "0/0", "author": "Alexandra Fleites"}, {"rating": 5.0, "review": "I have been very happy with the fire stick. I would like to see more live TV shows in the future.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "We've been very pleased with it, and especially that we got it quicker than anticipated.  Lots of choices, some really cool channels.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Doering"}]