[{"rating": 5.0, "review": "I love the fire stick. I'm a tech guy who's owned a tech company. This is so much better than the chromecast and it's not even close. The fire tv stick is literally a computer (htpc) that's the size of a chromecast. The chromecast is just a mirror receiver for your Android device. Everything plays on another device and is ported to the chromecast (and it's very buggy). The Fire TV Stick provides you with the entire Amazon Fire OS complete with some (but limited) storage and an app store. In fact, there is a way to install a popular home media center software. The Fire TV stick effortlessly streams 1080p quality to my HDTV and doesn't even stall.The remote that it comes with looks cheap, but is actually very comfortable and useful. You can download a remote app on your Android phone that allows you to type with your smartphone keyboard. **Be Careful : You cannot plug the power source into the USB input on your television. The USB port doesn't have enough power to run it and you must plug it into the provided wall adapter", "verified": true, "helpfulness": "0/0", "author": "Matt Hertz \"Matthew Hertz\""}, {"rating": 4.0, "review": "Nice format and performance. I have not finished fully exploring it's features, but it appears that unless you are an Amazon Prime subscriber the content is very limited and the advertised \"over 200,000 Movie and TV episodes\" advertised are not available. In fairness, there is a fine-print description on the bottom of the box indicating \"Certain services...may require separate subscription.\"", "verified": true, "helpfulness": "0/0", "author": "C. Locke"}, {"rating": 5.0, "review": "I am so glad I bought this.  I got sick of being overcharged by my cable company. So, I went with AT&T; just to have some internet access.  (AT&T; sucks royally, but doesn't overcharge and doesn't pretend they are doing you a favor like Comcast/Xfinity--our only 2 choices.)  I have an over-the-air receiver which provides more choice than X-finity for WAY less $$.  In fact, the receiver cost less than one month of cable.  I also have Amazon Prime and Netflix.  I figured our internet would be too slow, but was REALLY REALLY surprised and pleased that it worked.  Super easy to use.  I wasn't clear on how to get Netflix to work. It seems as though it's installed, but you have to sort of download an app.  I did an online chat & it took about 5 minutes to get it working.  Easy breezy.  I highly recommend the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "MadamL"}, {"rating": 5.0, "review": "AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "ALMO"}, {"rating": 5.0, "review": "It worked as advertized!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "My son loves it  !!!", "verified": true, "helpfulness": "0/0", "author": "Wendy roberts"}, {"rating": 5.0, "review": "Love our Fire Stick! Great compliment to Prime subscription. Some much better than running a cable from out laptop to the TV.", "verified": true, "helpfulness": "0/0", "author": "nateysmom"}, {"rating": 5.0, "review": "Excellent device simple to use", "verified": true, "helpfulness": "0/0", "author": "ashok kapoor"}, {"rating": 5.0, "review": "I love using this compared to the Roku we have on a couple of tv's.  The Roku doesn't let one turn off the unit when not in use...I checked their website too!  This Fire stick I can let it sleep and save energy.  I like the smaller format and controller also.", "verified": true, "helpfulness": "0/0", "author": "Momma Long"}, {"rating": 5.0, "review": "Was everything it said it would be. Very satisfied with the item. Easy to install, easy to use. May purchase more later.", "verified": true, "helpfulness": "0/1", "author": "Rodney Burris"}]