[{"rating": 5.0, "review": "Super easy to install. Awesome addition to my tv movie experience. Already preloaded with my Amazon Prime account makes it super easy to rent and purchase movies. I spent my first Saturday watching movies all day. The only negative is the flash drive that connects to your tv needs to b plugged in also vs using tv as a power source. But other than that...worth it.", "verified": true, "helpfulness": "2/2", "author": "N. Salas"}, {"rating": 5.0, "review": "It arrived beautifully packaged and worked with no setup hitchs whatsoever.  It automatically did a five minute firmware update right off the bat, then, voila, all set up to my Prime account.  These devices are a great value, even at the everyday price, and perform in a very similar way to the Fire TV box.  Only in high action games would a difference in speed be noticeable.  As I'm not really into that genre, the difference in performance.is nil.  The Bluetooth remote is great, so no pointing at box, like with  Apple TV, which I also have only so I can AirPlay  from iPad to TV, which this can't do.  All needed pieces were thoughtfully in the box.  Prime membership really is great, what with the movies, streaming music, unlimited photo storage, Kindle books lending, and of course the free shipping.  All in all I'm very happy, plus, no extra box to have hanging around as the stick dangles invisibly behind the TV.  Bravo, Amazon!", "verified": true, "helpfulness": "1/1", "author": "JohnMac"}, {"rating": 4.0, "review": "Overall, it's absolutely great for the price.  It's fast, too -- virtually zero lag when jumping from one menu item to another.  Picture quality is great and I'm happy that they include a short HDMI extender.Also, I've just recently received the Fire Stick but I can't seem to access Amazon Prime Music -- I just get a blurb telling me about it (I'm a prime member).", "verified": true, "helpfulness": "0/0", "author": "Jhon"}, {"rating": 5.0, "review": "Nice. Gives great access to prime videos and music, which is of course the main reason for buying it. Can control it from the controller or the Android app.", "verified": true, "helpfulness": "2/2", "author": "ProgMan"}, {"rating": 5.0, "review": "Great product. Super easy to install.", "verified": true, "helpfulness": "1/1", "author": "Hugh Le"}, {"rating": 3.0, "review": "No HBO Go and no Sunday Ticket apps", "verified": true, "helpfulness": "0/0", "author": "Brian W. Kedersha"}, {"rating": 5.0, "review": "I really enjoyed being able to use a remote instead of a smart phone to navigate.", "verified": true, "helpfulness": "1/1", "author": "Leonard Haile"}, {"rating": 5.0, "review": "Love it.  Easy to navigate and lots of features.  Totally recommend.", "verified": true, "helpfulness": "1/1", "author": "Brian Floyd \"bfett18\""}, {"rating": 5.0, "review": "So far so good, xbmc works great too", "verified": true, "helpfulness": "1/1", "author": "Luis Anguiano"}, {"rating": 5.0, "review": "Fire TV Stick works as well as the Fire Box. It's a lot less expensive, less than half the cost, and does the same job. I believe you may still need Wifi for it to work, and it comes with it's own remote, adaptor, and plug in cord. I love it, I wish I could have had this available to me before I got Fire Box.", "verified": true, "helpfulness": "1/1", "author": "Jean Phoenix"}]