[{"rating": 5.0, "review": "This is a vary good product for us to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Bill Naugle"}, {"rating": 4.0, "review": "Good quality. No problems with it. User friendly", "verified": true, "helpfulness": "0/0", "author": "Rocio Quiroga"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "David Smalley"}, {"rating": 5.0, "review": "Worked like a charm.  Easy to setup.", "verified": true, "helpfulness": "0/0", "author": "DanTheMan"}, {"rating": 4.0, "review": "Works great. A lot of varieties of shows/movies. It does not reach signal  if it  far from the router so only can use it on tvs closest to router. I wish it could get a better signal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing", "verified": true, "helpfulness": "0/0", "author": "matt parmer"}, {"rating": 5.0, "review": "Worked out Fantastic! Wish I would not have hesitated so long!", "verified": true, "helpfulness": "0/0", "author": "Duana"}, {"rating": 3.0, "review": "Took awile to get working, customer service was slaow as the proverbial boat to China.", "verified": true, "helpfulness": "0/0", "author": "john trimmer"}, {"rating": 5.0, "review": "Super easy to install!  It was hooked up and I was watching a movie in less than 15 minutes. We have Apple tv hooked up in the the living rooms, they always have to be rebooted and can't easily be moved to another tv, also the remote is so small and awkward to use. I have moved the fire stick 3 times with absolutely no issues. I even took it to the neighbors house and used it. I have Amazon prime and Netflix, both stream flawlessly.", "verified": true, "helpfulness": "0/0", "author": "ROBIN L PIPER"}, {"rating": 5.0, "review": "We bought two of these, one for each of the bedrooms in the house. I put one in my son's room because he loves Thomas, and Prime has tons of Thomas movies. My husband and I use ours for Hulu and Netflix, mostly. We have a Fire TV box in the living room, too. We love them. It's much nicer than having to go through a gaming console like we used to. We'd definitely recommend them, and we use them mostly just for the basics. There's also games and music and things like that, so these things are pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Stef&Shane"}]