[{"rating": 1.0, "review": "when I cancelled the Amazon video for $99.00 They also cancelled my free shipping I had for years.", "verified": true, "helpfulness": "0/1", "author": "Steven C. McMillan"}, {"rating": 2.0, "review": "I thought this was a good way to replace cable but found that if your not a prime member it doesn't pay or don't want to buy different apps/movies/games then it's better to stick with cable.", "verified": true, "helpfulness": "0/0", "author": "Latesha Harris"}, {"rating": 1.0, "review": "Sorry, this did not work.  Kept dropping the wireless connection though it indicated a very strong connection. (Was only 6 feet from the router.)  Had been successful with Chromecast so I expected the fire stick to work as well.  I have returned the firestick and purchased the Roku device so I can watch Amazon prime.  The Roku works just fine with our wireless connection.", "verified": true, "helpfulness": "0/0", "author": "J. A. Ford"}, {"rating": 1.0, "review": "This is simply the worst execution of technology that I have used.  Period.  I think it has a lot of potential but the programs constantly freeze, fail to load, or play with a frozen image while the audio continues without an issue.  I am using the Fire Stick with the supplied signal booster and it is located just 20 feet from my wireless modem.  Oddly enough, I can stream the exact same program through my XBox 360 without a single issue and in HD.  My internet connection is therefore more than sufficient.  The Fire TV Stick is, without a doubt, the biggest waste of money I have spent to date.  I'm looking for the box now because I can't get this stupid device out of my possession quickly enough.  Epic fail, Amazon.", "verified": true, "helpfulness": "0/0", "author": "B-Money"}, {"rating": 5.0, "review": "Super awesome!", "verified": true, "helpfulness": "0/0", "author": "Alexander Warner"}, {"rating": 5.0, "review": "I actually prefer the stick over the Smart TV I purchased for my family room. I don't allow my kids to have cable in their rooms, but this weekend my daughter had a sleep over... unplug the stick from my bedroom, plug it into her TV and they were watching Disney and out of my hair for the entire night. I actually bought 5 of these when they were on sale for $24.99. Can't beat this for yourself or a gift.", "verified": true, "helpfulness": "0/0", "author": "James Baxter"}, {"rating": 3.0, "review": "The remote is not very user friendly :( wish I would have looked at other brands first", "verified": true, "helpfulness": "0/0", "author": "Sheila Sauceda"}, {"rating": 1.0, "review": "Not what I expected  seems like I have to pay for everything", "verified": true, "helpfulness": "0/1", "author": "Alexander"}, {"rating": 4.0, "review": "love this!", "verified": true, "helpfulness": "0/0", "author": "Sarah Bate"}, {"rating": 5.0, "review": "Easy setup ..great product.", "verified": true, "helpfulness": "0/0", "author": "riz"}]