[{"rating": 1.0, "review": "From the reviews I had high expectations of this device but was so disappointed. Every other device has no problem picking up the signal  but could not get this to stay online. It was set up in direct view of the router, I moved the TV several times, rebooted it and the router. I finally gave up and got a Roku, which is okay but I think I would have liked the Fire TV stick better, if had functioned as advertised.", "verified": true, "helpfulness": "1/1", "author": "Matoaca Girl \"MG\""}, {"rating": 5.0, "review": "After six months of use, I am still very happy with the devices. I also have a console type Fire TV that I also love. The Fire Stick is great, the UI is excellent, it is easy to add apps, and video starts almost instantly and rarely buffers once started.My family has tried Chromecast and Roku devices as well, with very mixed results. The Chromecast was fine for some things, but not very good for a lot of things. If you are interested in a Chromecast do your homework, find out if it will do what you want it to do before buying it or you may get a nasty surprise and unpleasant experience. Roku on the other hand is great, and actually has a few advantages over the Fire TV devices, mainly in the wide selection of channels, but the Fire TV was a much better fit for my family, and not just because of our extensive use of Amazon services. Once again, do your research, the Roku may be the perfect device for you, especially if you really enjoy fiddling with settings and setting up servers.The Amazon Fire Stick (and console type device as well) just work, and work well. The UI is simple and easy to navigate, there isn't too much of a learning curve. We have Smart TV sets, and several Blu-Ray players and gaming consoles that have online and streaming features and apps, the Smart TVs are great if you have no other device that provides these features, but once you plug in a Fire Stick, you will likely never again bring up their app menus, the same goes for the Blu-Ray players. Our Xbox One and PS4 are now pretty much dedicated to playing games, not that the Fire Stick is so much better, just a little easier to use.The one option I would really like to see offered with the Fire Stick is the voice control remote that the console type device comes with. You can purchase the voice remote separately and it works fine, but that costs $30, what I would love to see is an option to spend $10-15 more on the Fire Stick and get the voice remote instead of the basic remote.", "verified": true, "helpfulness": "0/0", "author": "Cecil B"}, {"rating": 1.0, "review": "I bought this in hopes of catching all the boxing matches I normally miss or my crappy cable connection prevents me from seeing. However to use streaming TV apps such as HBO Go or Watch ESPN you need to have a personal cable account with a subscription to HBO, Showtime etc. Those of us living in apartments that provide basic cable as a service, lack such accounts. Making this product useless.The product description is misleading as it promises you access to the above services just by purchasing the Fire TV Stick.You can watch Netflix and all other streaming services by connecting your laptop or PC to your TV, using the same HDMI connection required by Fire TV.", "verified": true, "helpfulness": "0/1", "author": "AtomicP"}, {"rating": 5.0, "review": "100 times better than using my blue ray player. Best electronics purchase I've made since getting a smart phone 5 years ago", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Loving it", "verified": true, "helpfulness": "0/0", "author": "Ryan Farrier"}, {"rating": 4.0, "review": "I really do like it, although there are a lot of shows that require a payment.", "verified": true, "helpfulness": "0/0", "author": "pamela brule"}, {"rating": 5.0, "review": "better than I expected.  I got it for a tv in my office where there was no cable hook ups.  Lots of free options and perfect with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 2.0, "review": "Comparing this to Google chrome. Google I like the convience of using the tablet. Amazon tabletApp is horrible. Fire stick is constantly freezing I never had this problem with google. I'm thinking of returning and trying roku.", "verified": true, "helpfulness": "0/0", "author": "shermaine green"}, {"rating": 5.0, "review": "Love it!  So easy!!!  Good bye CABLE!", "verified": true, "helpfulness": "0/0", "author": "Marnie Whitehead"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "VH"}]