[{"rating": 5.0, "review": "I find myself boycotting the outrageous prices apple commands for its hardware and have steadily changed over to kindle fire tablets, amazon prime, and now fire tv. This little device is a must have for anyone with prime and / or amazon content. The included accessories look and feel high quality and I've found them completely interchangeable with other Amazon products I own.My tv was able to power the Fire Stick solely from the usb port (despite the Fire TV Stick's warning) with no noticeable problems. The initial download was quick and from unboxing to watching a move took about as long as it took to make the popcorn and get the drinks.I was fortunate enough to get the $20.00 pre order but even at the current price the fire stick is a great deal.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 4.0, "review": "I purchased this already having a chromecast for another set in the house.  The fire stick does everything it can do and more.  Obviously, you get the advantage of Amazon video and music, but you also get the remote.  I love the fact that I dont always have to have my phone/tablet on me to be able to watch TV.  Which brings me to the one thing I don't like.  The remote is bluetooth.  This is great for no interference and no need for line of sight, but there is no way to use a universal remote with it.  I still need my other remote for volume control.", "verified": true, "helpfulness": "0/0", "author": "h2oskierfl"}, {"rating": 2.0, "review": "you guys really need to redesign the battery compartment in the remote.  impossible to open without a small sharp knife for prying it loose.  i had to goggle the problem to seek tips from other sufferers.", "verified": true, "helpfulness": "1/5", "author": "rwcbrd"}, {"rating": 5.0, "review": "So much easier to work with installing the Fire TV stick than messing with Chromecast to get Amazon movies and TV!  Installation was a snap and we were ready to watch the offering within minutes.  Biggest hurdle was trying to get the remote battery compartment open!", "verified": true, "helpfulness": "0/0", "author": "JBrun"}, {"rating": 5.0, "review": "You just can't beat the new Amazon First TV Stick for the price.  Simply AMAZING!!!I have had or currently have all of the streaming devices available today.  My favorite until this precious gem arrived was my Apple TV.  There are some advantages and disadvantages of each device and I'll summarize them below.- Google Chromecast:  You need a laptop, tablet or phone to operate this device.  Which can cause all kinds of frustration.  Recently I was watching Netflix through my phone on my Chromecast.  I got a phone call from a bill collector right in the middle of a movie we were watching.  Totally killed my Friday night.  For $35 it's a great deal but it is not as easy to use as people think.  And it is not a stand alone device.- Apple TV:  Apple TV is great but I really wish Apple would update this unit.  I wish it had more of an IOS 8 look to it.  It is super easy and it works great.  But as a person who really is a tech head I wish Apple would keep adding more to this.  Maybe games, CBS TV App, etc.  But overall it's an excellent device.  At $99 I think Apple should lower the price to $79 or $49.- Roku:  After the latest update it looks way better.  If you want tons of channels and never want to leave the couch this is a great item.  But it's almost information overload.  They are too many weird apps and channels.  I think they should actually limit some.  But for the price it's great.- Fire TV Stick:  This is great.  It's not just a dongle.  There is an actual computer on this stick which is amazing.  It's a stand alone device that doesn't need anything else to make it work.  Video streaming has excellent quality.  With Amazon Prime this thing is incredible.  For $39 it is the best deal right now.  It's got everything I love; Movies, TV Shows, Apps, Games, iHeart Radio, Tune In Radio, NFL Now, Watch ESPN, and more.", "verified": true, "helpfulness": "0/0", "author": "Docintherock \"Doc\""}, {"rating": 1.0, "review": "This Amazon Fire TV Stick has some serious wifi connectivity issue! The wifi connection interferes with cell phone mirroring to TV, and it's almost impossible to have both wifi connection and mirroring at the same time. If I have mirroring on, then the wifi network doesn't work.  I am going to buy Chromecast to compare the network performance.", "verified": true, "helpfulness": "1/3", "author": "Yu \"TV_fans\""}, {"rating": 1.0, "review": "Piece of junk.  I could not get it to connect to our wifi, but my daughter was right next to me watching videos on amazon prime through our kindle fire hd.  I had to constantly disconnect the power cord and reset the router until I finally got it to connect to the wifi long enough to do the software download.Then it loaded my prime account, but it would not let me watch videos.  It wanted me to pay to watch prime videos that were on my watchlist.  So I know it had my account information loaded.  So I figure I would de-register and log back in with my amazon prime account.  That was a mistake.  Now it's not recognizing my amazon account password.I'm very disappointed.", "verified": true, "helpfulness": "1/5", "author": "CJH"}, {"rating": 5.0, "review": "Arrived sooner and was everything I expected and more", "verified": true, "helpfulness": "0/0", "author": "Larry Kinyon"}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Jacek"}, {"rating": 5.0, "review": "Setup was so simple! Works much easier than built in apps in my old Sony TV. Which by the way was 100% of my reasoning for getting this. Very happy with product.", "verified": true, "helpfulness": "0/0", "author": "Michael E. Nicholson"}]