[{"rating": 5.0, "review": "I really like the amazon fire stick . i m planning on canceling my cable", "verified": true, "helpfulness": "0/0", "author": "Wesley tocio"}, {"rating": 5.0, "review": "I love this thing!!!!", "verified": true, "helpfulness": "0/0", "author": "nicola logan"}, {"rating": 4.0, "review": "Easy to install and use. Even my daughter knows how to operate it.", "verified": true, "helpfulness": "0/0", "author": "Chicago Girl \"Chicago Girl\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Joe Lally \"Joseph J Lally\""}, {"rating": 5.0, "review": "There are a few aspects of the Fire Stick that make this my favorite purchase of the year to-date.When you sign into your NETFLIX account to watch shows it is cross compatible and starts an episode where you left off from any other device.The games are fun and most of them have at least a few levels that are free to play so you can test them before purchasing the full apps. And since the Amazon Fire Stick comes loaded with 18 times more games than ANY other device of this type, my next purchase will be the Amazon game controller.In an era where we are giving up cable and signing up for services such as Netflix, Hulu and HBO Go, it's absolutely imperative that a service combine all of these outlets, and the Amazon Fire Stick does just that, not to mention it is best way to watch Amazon Instant movies and TV. Don't forget that Prime subscribers can stream thousands of titles at no additional charge.I couldn't be happier. What a great device at a solid price. If you buy the Amazon Fire Stick, you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Kyle Willis"}, {"rating": 4.0, "review": "I really like the Amazon Fire Stick and the remote is a big plus (especially over Chromecast) but I will say the number one flaw is that it disconnects from the network so often if you go more than a few hours without use. Its like every time I want to use it I have to unplug it from the power source then re-insert it. Never had that issue with my chromecast. I hope this is just a bug and they will eventually send an update to fix this.", "verified": true, "helpfulness": "0/0", "author": "abiddings"}, {"rating": 5.0, "review": "This thing really works", "verified": true, "helpfulness": "0/0", "author": "Raymond M. Ignacio"}, {"rating": 4.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Hicham mebrouk"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Bob Rabideau"}, {"rating": 5.0, "review": "Excellent product! Love the convenience and app is very handy!", "verified": true, "helpfulness": "0/0", "author": "shauna"}]