[{"rating": 1.0, "review": "Choppy no where near the quality of the Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 5.0, "review": "Love it, love it, love it", "verified": true, "helpfulness": "0/0", "author": "Kristal Adams"}, {"rating": 5.0, "review": "This stick is much more user friendly than using an android tablet as a streaming device.", "verified": true, "helpfulness": "0/0", "author": "phil samuelson"}, {"rating": 5.0, "review": "great product east to set up and use", "verified": true, "helpfulness": "0/0", "author": "larry adams"}, {"rating": 5.0, "review": "Fire Stick is great!  My wife loves it.", "verified": true, "helpfulness": "0/0", "author": "mario"}, {"rating": 4.0, "review": "Most of the time, however I find if I pause for extended period, and go back it will freeze up. Then I have to re-boot by holding center button and (Play-Pause Button) That is frustrating. Other than that, it works the way I want it to with my \"Prime\" movies and Netflix. I'm glad you have the trouble shooting available so many of these problems are easily solved.", "verified": true, "helpfulness": "0/0", "author": "Bonnie \"BJS\""}, {"rating": 5.0, "review": "Love!", "verified": true, "helpfulness": "0/0", "author": "Christina ann kidd"}, {"rating": 1.0, "review": "I'm not really inpressed at all with the fire stick.  I have a roku as well and I have found the fire stick more complicated with less viewing content.  I have it stored in a box.", "verified": true, "helpfulness": "0/0", "author": "B. Armstead \"keyrup\""}, {"rating": 5.0, "review": "Very very good. I love it. I Recomend it. Sometimes Fire TV stick loss the conexion in Netflix and I conversed with a good friend who told me that the problem is the internet conexion.", "verified": true, "helpfulness": "0/0", "author": "pink mother \"Bony\""}, {"rating": 4.0, "review": "I have the amazon fire box and purchased for another room, so I could access programs in my bedroom as well as the front room. It works great,( as well as the box does). It is nice not having to use a game box to access Netflix etc. and I am able to play some games through this as well.", "verified": true, "helpfulness": "0/0", "author": "donna beaudry"}]