[{"rating": 5.0, "review": "So far...ok.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Fire Stick is cool. The apps are not bad either. The only issue I have is that the stick gets too hot. When that happens you have to disconnect it from the power cord for a few seconds for reboot and keep the apps/movies from buffering. Another option is to disconnect until its time use. Why should I have to? Because the fire stick will always get too hot, there should be some R&D; for a newer type in the works.", "verified": true, "helpfulness": "1/1", "author": "DFW0913"}, {"rating": 4.0, "review": "It's better than the apple tv", "verified": true, "helpfulness": "0/0", "author": "Mr. L"}, {"rating": 1.0, "review": "My husband and I found it user-unfriendly, from the necessity at the beginning to have to register with Amazon to the difficulty of getting it to respond to our commands.  We returned it for a Sony, with which we are much happier.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 2.0, "review": "I like the device's design including the user interface.  It worked well for a few months.  All of a sudden, it started buffering every ten minutes or so.  I thought maybe it was the Internet connection but my other streaming devices don't have this issue.  I tried to reset it to factory settings and see if it was updating to the latest firmware and still the same issue.", "verified": true, "helpfulness": "1/1", "author": "Fed"}, {"rating": 5.0, "review": "A very useful tool for watching Kindle Prime and Netflix on your TV.  Easy to operate and inexpensive for its purpose.  I would buy it again without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "amazing product", "verified": true, "helpfulness": "0/0", "author": "Charol Riedel"}, {"rating": 4.0, "review": "Awesome! Highly recommend this streamer.", "verified": true, "helpfulness": "0/0", "author": "andre green"}, {"rating": 4.0, "review": "I love it and i got it for $25 on the one day sale. Very easy to root and install all the extra movie add on . Lots of YouTube videos on how to install out source apps. I give it 4 stars and not five because it does drop the Wi-Fi signal a lot it seems like other reviews say.", "verified": true, "helpfulness": "0/0", "author": "Barrioscriptures"}, {"rating": 4.0, "review": "Good fun. Easy to install. Little buttons.", "verified": true, "helpfulness": "0/0", "author": "Frediwar \"w.a reed\""}]