[{"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "J. S. Hughes \"Jackie\""}, {"rating": 2.0, "review": "It worked for a few days, and then, it stopped.It would say I wasn't connected to the Internet or Wi-Fi or something.  It found my router, connection shows up as FAIR even though the router is right next to the TV.  But it also shows as disconnected.  So, it sees the router but won't connect to it.  I enter the password to the router but the Firestick never connects.  Is there a trick to this?  Why would it work one day, and stop working the next?Usually happy with Amazon offerings, whether it's cables or some other Amazon brand item.  When it worked, this item was okay.  Easy setup, easy interface, and served it's purpose of watching Amazon Prime offerings.  But then it stopped.  Very disappointed, Amazon.", "verified": true, "helpfulness": "1/2", "author": "robk64"}, {"rating": 4.0, "review": "Really love it. Each time I use it I love it more. Everything in one place and a lot of choices in media. (movies, TV, music etc.) Some of the rentals are a bit pricey but still a lot of choices with my extra prime.", "verified": true, "helpfulness": "0/0", "author": "M. Markward"}, {"rating": 5.0, "review": "So far I have two of these and they are amazing.  Plug it in, it connects to your wi-fi.  Amazon Prime and your other entertainment apps are there.  The only negative I can find is I have been unable to download VUDU, but this is ok because most of my VUDU movies are in flixter.  Fire TV stick is portable, so its great .  Comes with a remote, and your phone can also be used as a remote.  Setup is so easy, it's ridiculous.", "verified": true, "helpfulness": "0/0", "author": "ct_nite"}, {"rating": 5.0, "review": "Pretty Cool device, really liked that it was ready t go out of the box! The App for my tablet is useful and so far Love this stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it, I'm having so much fun with it!", "verified": true, "helpfulness": "0/0", "author": "Connie Staley"}, {"rating": 1.0, "review": "At times problem connecting to internet, requiring removing device from TV  and reconnecting.  Happens despite the fact that the internet networkis working properly.", "verified": true, "helpfulness": "0/0", "author": "Catherine Fuchek"}, {"rating": 4.0, "review": "Love it - it doesn't get much simpler than this! And the app to control from your smartphone is the bomb too!", "verified": true, "helpfulness": "0/0", "author": "DAB"}, {"rating": 5.0, "review": "I bought two of these when they were on sale.  Does a great job streaming the Amazon Prime.  No problems for me with the device.", "verified": true, "helpfulness": "0/0", "author": "Chris Waggoner \"waggs\""}, {"rating": 5.0, "review": "The best purchase ever, plus you won't get bord.", "verified": true, "helpfulness": "0/0", "author": "Artur semedo"}]