[{"rating": 3.0, "review": "The product comparison page states this is MiraCast Certified, but I just got an e-mail from support that it is NOT certified. Nor can I find any certification status on the Wi-Fi Alliance page for this or any Fire TV product. This needs to be addressed, and the bug I noted should be fixed as well (using 2 devices, it connects, the Fire TV updates to show the remote device connected, but it never displays the screen from the remote device - tablet or phone).Otherwise, this is a nifty little device. It gives me an inexpensive way to put Amazon Instant Video, Netflix, and my other streaming services on any TV in the house (hence why I ordered 2 - the other TV uses a Roku stick (which MiraCast works correctly on it).  Overall, I do like the Amazon one better simply because the interface is easy to understand for anyone. My parents, who are not tech-savvy, took to it like it made sense out of the box. They prefer it to the Roku interface. And since I use MiraCast a lot but my parents don't, I am going to give these to them, and take the Roku sticks instead.On a side note, the AC adapter is 1 Amp. If you have a TV that has a specific \"USB Power-only\" port (not service port) that supplies 1A or more, you can bypass using the AC Adapter and still have it run at full power, and use a much shorter USB cable. I like that the remote is RF, not IR, which means you don't have to point it at the stick or have the stick visible, too.If you want something simple and easy to understand for most anyone and don't need the 'geeky' support, then it's a great device. If you want something for the technical people, or use the more advanced features, this isn't the best device to get at this time. If Amazon addresses a few bugs, this could easily become a very popular option for many.", "verified": true, "helpfulness": "10/10", "author": "J. Lockridge \"GadgetMonster\""}, {"rating": 5.0, "review": "Love this thing!  It's supper easy to install and use and very snappy.  It expands the usefulness of your Amazon Prime membership.  Once you plug the stick behind your tv, all you are left to interact with is the little remote and I think Amazon got this right.  It has just the required number of buttons and isn't overcrowded with stuff you'll never use.  The onscreen interface is intuitive and fast.  Prime shows and movies look great, but I haven't tried other services yet.  The smartphone app (allows you to use the phone as the remote) is less refined than the physical remote.  It does allow you to use your phone's voice recognition to search for movies and shows onscreen and it's surprisingly fast at doing this.  I do wish that the remote came standard with voice search, since I'm not convinced that $29 for the upgrade is worth it.  I paid $24.99 at the yellow and blue big box electronics store for the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "JoseAntonio \"joseros\""}, {"rating": 5.0, "review": "Easy to set up and figure out.  I find getting on my laptop to view more of the selections, then putting them on my watch list so I can get to them easier on the TV.  I'm happy to get to my Prime on my TV.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 4.0, "review": "As a frequent viewer of digital content, I have used several streaming media devices including the Apple TV, the Roku and Chromecast. When the opportunity came to purchase the Amazon Fire TV Stick for $19, I took the plunge.The device was simple and straightforward to set up. On my first try, I could not get it to connect to my 5Ghz WiFi connection and had to resort to my slower and more crowded 2.4Ghz band. But - after a quick system update, it connected to my 5Ghz connection fine. I then proceeded to check out the features and channel offerings. I installed several additional channels including Netflix, YouTube, A&E;, History, NatGeo, etc. I tested each and they worked fine - good quality video and quick to load.Having never before used the \"Fire\" interface, I find it a bit confusing to get to channels other than Amazon offerings. I realize that it is geared towards steering me to Amazon content but an easier to use interface might be nice.I have only had the device for a few days and have not had a chance to really give it a good, thorough run but it looks like a great value.I'm hoping that with time, more channel providers will climb on board. There are not many tech offerings for example and it would be nice if the Fire line of devices had more available providers like Roku and Apple's selections...", "verified": true, "helpfulness": "0/0", "author": "Bill Langton"}, {"rating": 1.0, "review": "Purchased 4 for X-MAS gifts wow WASTE i have Rokus and they are much better... first night it was great then in the morning i had to HARD reset it... then spent 30 minutes re loging into all services then no wifi issues and i was 20 ft from router my roku about 50 ft away connects fine and doesnt have issues i returned ALL 4 and I bought more Rokus as gifts this thing is JUNK save your money buy a Roku stick if need be you will be glad you did...........", "verified": false, "helpfulness": "19/25", "author": "DwightMStone \"Dwight Stone\""}, {"rating": 3.0, "review": "Love the quality, love the speed, and love the clarity. Hate that it needs to be plugged in with its adapter directly to an outlet. The tv in our room is mounted on the wall and it's such an eye sore to have the cable just dangling there. The cables length is very comparable to that of a phone charger. But hey can't beat the price of $19.99 gonna go and grab an extension cord and get creative. Yeah I know more cables!", "verified": true, "helpfulness": "1/1", "author": "Chrystal Valerie"}, {"rating": 5.0, "review": "Love it.  Super fast and responsive", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "The control it self makes it that much better than chromecast.Software wise its still a bit raw but definitely full of potential!Looks like this one will replace all my chromecast devices at home.Great job amazon!", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 5.0, "review": "Ok.", "verified": true, "helpfulness": "0/4", "author": "Ralf Pais T. Furtado \"rockrocha\""}, {"rating": 5.0, "review": "I am impressed by its streaming capability. Its better than some of wired devices I have used. User interface is simple to use.", "verified": true, "helpfulness": "0/0", "author": "yogesh \"yk\""}]