[{"rating": 4.0, "review": "I have had a Roku for several years and really enjoyed it so I was hesitant to change products. However this was included in the Amazon sale and I figured for the price it was worth trying. I am SO glad I did. I really like all of the different types of apps (games, yoga, music, etc) you can use with it and as well as the remote app for your phone. It is a little slower than my Roku box but nothing that gets in the way of binge watching. It is geared toward Amazon Prime TV/videos/music so if you are not an Amazon prime subscriber this might not be the best product for you.", "verified": true, "helpfulness": "1/1", "author": "Priscilla Page"}, {"rating": 4.0, "review": "I did not have a large bases to refer from. We did our research comparing and it is sufficient. Our internet provider is half the problem. If our provider was older then my rating would be even higher. If you have an option, I think I would chose the box. The direct connection versus the wifi would be a positive. I do like the option of taking the stick with us. There are many apps-that was a surprise. We have Netflix, Sling, hulu, and 30 days on HBO. This is still 100$ less than what we paid AT&T.;", "verified": true, "helpfulness": "1/1", "author": "Nicki d"}, {"rating": 5.0, "review": "good for price", "verified": true, "helpfulness": "0/0", "author": "vannguyen"}, {"rating": 5.0, "review": "I subscribe to SlingTV and it is so much easier to watch my shows and use my computer at the same time!", "verified": true, "helpfulness": "0/0", "author": "dcarter"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "VICTORIA"}, {"rating": 5.0, "review": "I am so ready to dump cable. The Fire Stick is great", "verified": true, "helpfulness": "0/0", "author": "Elizabeth  Spearing"}, {"rating": 5.0, "review": "Just terrific!", "verified": true, "helpfulness": "0/0", "author": "Christopher Mellor"}, {"rating": 1.0, "review": "I Bought the Fire stick and initially loved it. However, after using it for a month it stopped working so amazon replaced it with another fire stick. A month after using the second one it stopped working again. I requested a refund b/c it doesnt see to work. Waste of my time!", "verified": true, "helpfulness": "0/1", "author": "Kayla"}, {"rating": 1.0, "review": "I thought It could be more accessible to other apps. Just only apps preloaded are available and there are no options for more apps", "verified": true, "helpfulness": "0/1", "author": "VICTOR A. GOMEZ"}, {"rating": 5.0, "review": "I was especially pleased to find that when I stayed at a Coast Plaza hotel in Canada the Fire tv stick had no difficulty in connecting to the hotel's wireless network!  Unfortunately, since I was out of the country much of the programming wouldn't work for me. (not licensed in Canada!)  I will have to set up a VPN to route through my home network so I can watch those programs.  The fire stick worked flawlessly, though!", "verified": true, "helpfulness": "0/0", "author": "Richard Wooldridge"}]