[{"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Shirley  Davis"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "grannyx8"}, {"rating": 5.0, "review": "It's working fine and I love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far, I have enjoyed having the Fire TV stick. I was a little disappointed with how many things you have to pay for with the Fire Stick. I planned on cancelling my pay channels with DirecTV and using the Fire Stick for movies, but after using it for a week I think I may keep my movie channels and use this occasionally when new movies come out. All in all I like the product but was hoping for more movies and shows to be included with my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "The voice recognition feature is especially amazing!  Not just a novelty, it is a very useful feature.  It is uncannily accurate.", "verified": true, "helpfulness": "0/0", "author": "Michael \"Kindle enthusiast\""}, {"rating": 5.0, "review": "Beats paying for all of the movie channels on my Uverse.", "verified": true, "helpfulness": "0/0", "author": "roger pethtel"}, {"rating": 4.0, "review": "like it very much ;has solved a lot of problems..it does however have one big problem,When playing music ,for some reason, it does not allow my TV to go into screen saver mode.", "verified": true, "helpfulness": "0/0", "author": "D. F. Ford \"deanable\""}, {"rating": 5.0, "review": "What an awesome gizmo!  Outstanding product at a great price.", "verified": true, "helpfulness": "0/0", "author": "Christal"}, {"rating": 5.0, "review": "Works great. Easy to set up, great wifi reception.", "verified": true, "helpfulness": "0/0", "author": "W Smith"}, {"rating": 2.0, "review": "Wish it was easier to filter and show only free content. It often seems like everything is paid content, even with a prime account.Wish I could browse and select content to view from my web browser ( I know I can browse, but I can't choose - play now on my FireTV )", "verified": true, "helpfulness": "0/0", "author": "Christopher Young \"geek\""}]