[{"rating": 5.0, "review": "I have all the smart phone plug ins and this is  by far is the best value. It blows away the chrome cast and the Roku too. It is very close to Apple tv but it is so much less expensive that the fire stick is the one I would recommend especially to someone that is budget minded.", "verified": true, "helpfulness": "0/0", "author": "John D."}, {"rating": 3.0, "review": "The set up was pretty simple. It randomly shuts down pretty often, which is very frustrating. I would not order again.", "verified": true, "helpfulness": "1/1", "author": "AMBER STYRON"}, {"rating": 4.0, "review": "I'm still learning about all its features...so far so good.", "verified": true, "helpfulness": "0/0", "author": "R. B. Eveslage \"Yankee Woodworker\""}, {"rating": 4.0, "review": "Love that it's a smaller version of the Fire TV.  Have had issues with the Fire TV video freezing in a few apps, but so far the first stick is working perfectly.  My only complaint so far is that the remote feels cheap and uncomfortable in your hand.  The Fire TV remote has a great feel to the plastic material and is shaped/curved to fit really well in your hand.  I know the Fire Stick remote doesn't have the voice microphone ability and is smaller, but it could have been shaped similarly to the other.  The squared off edges aren't very nice.", "verified": true, "helpfulness": "0/0", "author": "Philip"}, {"rating": 4.0, "review": "Great product for the price. Just wish it would have Dolby 5.1 sound.", "verified": true, "helpfulness": "0/0", "author": "Paul H."}, {"rating": 5.0, "review": "Love it!  It's perfect!", "verified": true, "helpfulness": "0/0", "author": "Mark Moreno"}, {"rating": 5.0, "review": "Love it but can't figure out how to use showtime and the others items available. Loved it when I saw that I could play my games that are on my kindle on the TV.", "verified": true, "helpfulness": "0/0", "author": "angelgirl"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "ctrgirl"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jack Gross"}, {"rating": 5.0, "review": "I received my Fire Stick earlier than was reported to me when I purchased it!  I was so happy! I tried to connect it to my router but had trouble. I called my internet provider's helpdesk and they helped me to get connected. Since the first day of being connected, my family hasn't been watching cable! We've been catching up on shows we've never watched on cable. We have watched some very good shows and movies that we've never seen. Love the foregone films and cartoons that wehaven't had the opportunity to watch before.  We have a prime membership so there is a lot of movies and games that we can access for free. I'm thinking of signing up for Netflix to expand our viewing selection. I would like to get rid of my cable, but we like to watch up to date episodes of our favorite shows. So we willkeep our cable and continue to love the Fire TV Stick.The stick plugged right into our HD TV. We did use the extender that came I to the package with the stick. I got the stick on sale. I'm going to wait for it to go on sale again before I buy another.", "verified": true, "helpfulness": "1/1", "author": "G. Crews \"Ms. Compton\""}]