[{"rating": 5.0, "review": "So far, very pleased.  Straight forward setup & functionality.", "verified": true, "helpfulness": "0/0", "author": "JerryK"}, {"rating": 1.0, "review": "This is the second piece of Amazon hardware I wanted to work that didn't. Our Kindle Fire also disappointed. This thing wouldn't keep a WiFi connection. I spent several hours on chat with Amazon trying to fix it. I did everything the asked. They said it was faulty. Sent me a new one, did the exact same thing. I use my Blu-ray player and Apple TV with WiFi and neither have had sustained issues. They thing wouldn't work.I wanted this to work so bad, but it just didn't. I sold it.", "verified": true, "helpfulness": "1/1", "author": "Philip Dosa"}, {"rating": 5.0, "review": "I bought this  item from amazon and so far its turned out to be really good, they offer u a wide range of apps and movies, I'm very happy that I bought it.", "verified": true, "helpfulness": "0/0", "author": "Maria Santiago"}, {"rating": 2.0, "review": "The fire stick has crashed twice, and I have had to reset it and put all the information in- google chromecast is much more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Pete Crippen"}, {"rating": 5.0, "review": "Yes it's great!!", "verified": true, "helpfulness": "0/0", "author": "Greg Stephan"}, {"rating": 5.0, "review": "Works great better than anticipated!", "verified": true, "helpfulness": "0/0", "author": "Larry Sopczynski"}, {"rating": 3.0, "review": "It only works in the room where the wifi box is directly located/  Even when I plug it into televisions in neighboring rooms, and my wi-fi signal strength says strong, the Fire TV stick will not load.", "verified": true, "helpfulness": "0/0", "author": "nicole"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Billy Earney"}, {"rating": 5.0, "review": "very nice indeed..", "verified": true, "helpfulness": "0/0", "author": "Gaye Bradley"}, {"rating": 3.0, "review": "Unfortunately I can't review the stick itself as it doesn't work where we wanted to use it.  Make sure if you are getting this you have a internet connection that can handle it.  Bought for a birthday present for my son's room, but it just constantly loses signal so you can't use it.  It looks like it would have been great if we could get it to work.", "verified": true, "helpfulness": "0/0", "author": "Dawn Rose \"Dawn\""}]