[{"rating": 4.0, "review": "Excellent product with a great price.  Definitely the choice if you are looking for an inexpensive media streamer.  The Stick is very small and unobtrusive; plug it into an HDMI port on your TV and you will hardly even notice it is there.  It is very fast and has excellent video; no lag at all.  However, I have noticed some issues with the audio skipping/cutting out.  This was especially bad when I first started using the unit and there was also some loud buzzing; with continued use this has gone away and it is now hardly noticeable.  Also, the remote control is a bit small and difficult to use; you will have to get used to that.  If these issues sound like too much to you, you may want to consider paying more for the full size (and more powerful) Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "PS Player \"Al\""}, {"rating": 5.0, "review": "This is a great little device.  I use mine for Prime Video/Music, Netflix, Pandora, and some games with the kids.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "Easy to use and navigate even for those of us that are tech phobics!", "verified": true, "helpfulness": "0/0", "author": "Lynn Austin"}, {"rating": 4.0, "review": "Still learning about it, but so far I am very pleased with my purchase", "verified": true, "helpfulness": "0/0", "author": "Sheila K Linder"}, {"rating": 5.0, "review": "Works great!  Love that my TV is now \"smart\"!", "verified": true, "helpfulness": "0/0", "author": "Samantha Brown"}, {"rating": 5.0, "review": "I love it that is all I can say it was easy to set up and it works very well.", "verified": true, "helpfulness": "0/0", "author": "Jean Straub"}, {"rating": 4.0, "review": "I am now addicted to several series that I didn't even know existed before the Amazon Fire stick!", "verified": true, "helpfulness": "0/0", "author": "All-access Customer"}, {"rating": 5.0, "review": "the fire stick is simple to use I just plugged it in and found my net work and started using it.", "verified": true, "helpfulness": "0/0", "author": "David Hogan"}, {"rating": 4.0, "review": "Easy install Works as promised.  Make sure you have a fast wireless it needs a lot to run smooth", "verified": true, "helpfulness": "0/0", "author": "Laura Gibson"}, {"rating": 5.0, "review": "Missed out on the introductory price by one day when they first offered Fire TV stick for $19 and am kicking myself now because it is very good product for the money.  I always heard my friends tout their RoKu and since I had an amazon prime account figured I would give this a shot since it said it had more choices than Roku.  I have been very pleased at the ease of use and choices that are on my fire tv stick.  I really like the fact that I can use it on our outdoor patio or in the living room or anywhere else so easily by just plugging and playing.  The extra $20 bucks I spent to get this was worth it.  all my prime music and movies Netflixs kids stuff like pbs kids and Disney is great to entertain the kids for a while.", "verified": true, "helpfulness": "0/0", "author": "dschmidt74"}]