[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Trevor Garrett"}, {"rating": 1.0, "review": "Junk! Remote control does not work properly.", "verified": true, "helpfulness": "0/0", "author": "B  MILLER"}, {"rating": 4.0, "review": "Works well. We need Amazon news, local, national, international.  Frank", "verified": true, "helpfulness": "0/0", "author": "Frank D Imbrie"}, {"rating": 5.0, "review": "So far it's perfect. thank you amazon.", "verified": true, "helpfulness": "0/0", "author": "Jared I."}, {"rating": 4.0, "review": "Works great. easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Blue"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Completely changed my viewing experience!", "verified": true, "helpfulness": "0/0", "author": "bryant mccann"}, {"rating": 5.0, "review": "We are very satisfied with the fire stick, frees up quite a bit of space. Works great!!", "verified": true, "helpfulness": "0/0", "author": "Catherine Alden-Thomas"}, {"rating": 5.0, "review": "I have never written a review on Amazon. But this product is worth it. I have only had it a short time so am not that familiar with everything it can do. What I am amazed at is how easy it is to install. I am not at all skilled in technology and remember having had a terrible time installing a dvd player just a few years ago. I thought(no matter what the product description said)that I would not be able to do it without help. I was actually nervous. Well, it took all of 5 minutes.Could not be easier! And works perfectly. I would encourage others who, like me, are older and not well versed in the tech world not to hesitate to try it--", "verified": true, "helpfulness": "0/0", "author": "Bruce Mintz"}, {"rating": 1.0, "review": "Disappointing.I live in Uruguay and have Netflix. I bought a Fire TV Stick only because I needed to watch Netflix in some of my devices but I cannot.Fire Stick does not work with Netflix outside USA but it is not stated anywhere. I only found out after I had already bought it.Please, only buy Apple TV. This was is not good at all.", "verified": true, "helpfulness": "1/1", "author": "fab"}]