[{"rating": 5.0, "review": "Can't believe we waited as long as we did to pick one up. It's great for the bedroom t.v. to use our Prime membership as well as Netflix and Hulu. We quit cable a long time ago so some of the free offerings on it are fun to have as well. The remote is so simple that even my technologically challenged wife finds it easy to use. We'll definitely give the voice remote a try when we get our next Stick for our other t.v.", "verified": true, "helpfulness": "0/0", "author": "Mopjockey"}, {"rating": 3.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "HERNAN"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Darrell Sheetz"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Seeshe"}, {"rating": 5.0, "review": "It's just like they said, very easy to set up, it is a great item", "verified": true, "helpfulness": "0/0", "author": "Randy Zimmer"}, {"rating": 5.0, "review": "Although it took forever to get to us. (ordered in dec got it in march) this thing is perfect! Hit the home button and it will automatically switch my tv over to the correct HDMI channel. We use this thing more then we watch cable at this point! I really like that it has a remote, coming from a chromecast and all the BS that goes along with connecting to the wifi, trying to get the phone and unit to synch, having the program crash the phone etc. This allows me to just use the remote and avoid all that!", "verified": true, "helpfulness": "0/0", "author": "James E. Ross"}, {"rating": 5.0, "review": "I use mine a lot. The interface is easier than the one that came with the TV. I might be buying another for the other set I like it so much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Delivered on time and I was skeptical at first but after an easy set up it works great I love it. Great product!", "verified": true, "helpfulness": "0/0", "author": "Timothy"}, {"rating": 1.0, "review": "this is definitely crap. I ordered both the fire stick and the roku stick and the roku stick definitely wins. the fire stick does not have all the apps that the roku does and it doesn't stay charged while being hooked up to the USB charger attached to the tv. the only way it stays charged is if you plug it into an actual wall, w/o doing that it will continue to shut off and reboot itself. I will definitely be sticking with my roku stick :(", "verified": true, "helpfulness": "1/1", "author": "Adrienne stone"}, {"rating": 2.0, "review": "This unit does not work if your wifi requires a web-based login.  It's useless to me.", "verified": true, "helpfulness": "0/0", "author": "Doug"}]