[{"rating": 5.0, "review": "I'm now canceling my cable. I bought 2.", "verified": true, "helpfulness": "0/1", "author": "Matt"}, {"rating": 5.0, "review": "Lots of free content and Prime is awesome with the Amazon Fire Stick!", "verified": true, "helpfulness": "0/1", "author": "J. CASTONGUAY \"Jonny C\""}, {"rating": 4.0, "review": "Overall it's a pretty good device. Although as far as I can tell, with the Amazon music there's no way to just search for a song and have it play, you're stuck with preset playlists.", "verified": true, "helpfulness": "0/1", "author": "Daniel M."}, {"rating": 5.0, "review": "Changed my life!", "verified": true, "helpfulness": "0/1", "author": "Nick"}, {"rating": 1.0, "review": "Every single app I have crashes. And I don't mean once or twice. I mean every 1-5 minutes. Definitely returning. When I called customer service they told me it wasn't normal and to reset the device. Guess what? Still does it. And there are tons of reviews of the apps that show I'm not the only one having this problem.", "verified": true, "helpfulness": "0/2", "author": "Carly Zeh"}, {"rating": 2.0, "review": "i had high hopes for the Amazon TV stick, I had a chromeCast, and Amazon is pitching this product specifically as a competitor to the Chrome Cast.Now both are not alike at all, this is supposed to be much more than a casting device, and it fails miserably in each additional function, and it does not have the casting functionality.here are my reasons:- WiFi issues, humungous issues, I have this and the WiFi router spaced by 2 meters of thin air, yet the wifi connections keep dropping, and the worst part? it does not work unless you RESTART the Amazon TV Stick- remote is ok, until you try to enter text, phone app works, until you want to copy and paste text, very bad experience- games start, until you start playing, then they start hanging and stuttering- applications start, like for example youtube, but it was as slow and stutterry as it could be,  and there is no option to control the quality of the video- screen mirroring starts, then stops without warning, and even worse, while it is working, it is like screenshots, not like video streaming , useless- i tired the mic in the app in my house, without any sound around me, yet it was not able to hear me at allmy case could be an extreme, but i can see a lot of people complaining about wifi in the reviews. i thought this was due to distance, but my router is literally 2 meters (6 feet) apart from the stick, and I really hope amazon fixes this H/W related issues, the first wave of devices don't seem to have any problems, all earlier reviews are extremely good, but it suddenly gets bad, seems like a manufacturing issue for me", "verified": true, "helpfulness": "2/3", "author": "islam ahmad"}, {"rating": 5.0, "review": "This is a great device for streaming Prime Video without having to airplay from an iPhone or iPad or connect via AV Adapter and lose all the battery. Great price too!", "verified": true, "helpfulness": "0/1", "author": "Sophia Weiner"}, {"rating": 3.0, "review": "It's great, when it works properly. There is a constant buffer (from netflix) when I put it in my girls room, which is only 20 feet (or less) away from the Internet connection. However, I bought it for $25 on prime day so for the price I paid it was worth the buy. The saying is true \"you get what you pay for.\" I recommend if you have patience!", "verified": true, "helpfulness": "0/1", "author": "Jerica Russell"}, {"rating": 4.0, "review": "I LOVE my amazon fire tv stick. I had originally be looking to buy another ps3, but that was costly so a friend recommended I check out the amazon fire tv stick. I did and I am so happy! This not only saved me hundreds of dollars, but I get to use a real remote instead of a game controller. With decently small hands I love the little remote. \"It's the little things....\"  I will say that I have a problem with it cutting out for about 10 seconds every once in a while, but I attribute that to my router and modem as I've been meaning to upgrade them too due to issues with them", "verified": true, "helpfulness": "0/1", "author": "Chrissey"}, {"rating": 5.0, "review": "Fantastic ,no issues at all, right out of the box , hooked the stick right into an available HDMI slot, plugged it in and logged in to my wifi network , It even knew my name , watching prime in HD within 10 minutes", "verified": true, "helpfulness": "0/1", "author": "rick chavez"}]