[{"rating": 4.0, "review": "So far so good after a week....easy to set up then just input password for router....", "verified": true, "helpfulness": "0/0", "author": "1500runner"}, {"rating": 4.0, "review": "I'm happy worth it.  Worth the money", "verified": true, "helpfulness": "0/0", "author": "Mark Lokuta"}, {"rating": 5.0, "review": "Great deal and super easy to set up. I also have a Roku, and I love that there are no cords with the Fire Stick, and that it is basically just \"plug and  play\".", "verified": true, "helpfulness": "0/0", "author": "pdizzleforizzle"}, {"rating": 4.0, "review": "The Fire Tv Stick has the features I was looking for and was affordable and easy to set-up.", "verified": true, "helpfulness": "0/0", "author": "R. Keating-Aupont \"Katrina5050\""}, {"rating": 5.0, "review": "Well worth the $39.99 we spent on it. The easiest set up I've ever experienced. We use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Donna R."}, {"rating": 1.0, "review": "I am totally disappointed.  I have an Apple TV box but wanted the Amazon app and it seemed like it would be great because it is portable and has games.  But it is just plain confusing.  I truly dislike the way the programs are organized.  I expected so much more from Amazon,  If you have Apple TV, use it with Airplay and your phone -- much easier than trying to find what you want to watch on this useless stick. I don't know, maybe I'll like its portability,.  Surely it must have one good point,", "verified": true, "helpfulness": "0/0", "author": "Jane M. Rhoades \"PlainJane\""}, {"rating": 1.0, "review": "Bought from Staples. Hard time setting up with my Sony tv. Took 15 minutes to connect to my network and register. Got to home screen and network kept dropping. Reset device and router and this time could not even log in. Spent 1 hour on the phone with Amazon support trying everything. At this point couldn't even get past the registration screen so gave up an returned the stick. Ordered one thru amazon as I heard they will be pre registered with your Amazon acct info. Unit arrived and setup this time was a breeze. However I had the same original problem of the network constantly dropping when watching videos. Had no problems doing this in my Kindle Fire. Gave up and returned product againM", "verified": true, "helpfulness": "0/0", "author": "NCMan"}, {"rating": 4.0, "review": "Easy even for grumpy seniors.", "verified": true, "helpfulness": "0/0", "author": "Thomas J Kronenwetter"}, {"rating": 3.0, "review": "There's a lot of stuttering/framerate issues.  I need to restart it every couple of weeks because it loses the connection to the router and the access point is no longer on the list of connection options.There are banner ads at the top of the home screen that seem to gain focus whenever I go back to home.  It's the only place you can't go \"left\" so I'm often trying to figure out why I can't get to the left menu of options before realizing what's happening.I wish you could selectively search for different types of things (prime only videos, apps, games).  Universal search sounds cool but can be a pain.The UI is very clean and easy to use otherwise.  It integrates with my TV remove so I only have to use the remote that came with my TV -- it's the only device I own that doesn't require me to have another remote sitting out.Unless the playback issues are addressed, it's not worth it unless you have no other streaming options.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "great item", "verified": true, "helpfulness": "0/0", "author": "Keith Matott"}]