[{"rating": 5.0, "review": "small yet packs a great many option,easy to install.", "verified": true, "helpfulness": "0/1", "author": "tc"}, {"rating": 5.0, "review": "Easy and we love it", "verified": true, "helpfulness": "0/1", "author": "feverpitch"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "H. G. forwarding  Maca Romo"}, {"rating": 5.0, "review": "This is the perfect companion to every traveler!It works on Amazon, Hulu, Netflics, and hundreds more.And it works with the hotels captive portals. So you can go right online and watch whatever you want without cloning your IP, standing on one leg, or waiting for the wind to blow from the South.A couple of issues to be aware of though.One:The product looks like you can plug it into the back of the TV and it just works. You have to plug it into a power source. So, either carry and extension cord or a long USB micro-B style cable. Many hotels have power easily accessible but, you will find many that do not. I was at a Holiday Inn Express recently that bolted the TV stand to the floor. Not the TV, just the stand! LOL I do not know why. I could not reach the outlet behind the TV.**** Two: Some hotel employees are not aware of the captive portal and have no idea that it can be turned on and off. So, if the captive portal does not pop up on your other devices, it may not show up on the Fire Stick either. On your tablet, you would simply try going to a web site and it generally appears but, you can't do that on the Fire Stick. In those cases you will have to call the front desk and ask them to contact their provider and turn the captive portal on. Be prepared to hear a long blank pause on the other end in some cases. LOL", "verified": true, "helpfulness": "0/1", "author": "Soundaround"}, {"rating": 4.0, "review": "Very handy for vacation with grandkids. Games and online video equals happy campers.", "verified": true, "helpfulness": "0/1", "author": "Tim"}, {"rating": 2.0, "review": "Was great at first. Then slowly things started to go sideways. Now every single time I start any video there is 2 mins of video, a lock up of the video while the audio keeps rolling and then the video catches up 30 seconds later. This is just an annoyance, but it means that this product wasn't ready for prime time when it was released. Also I get lock ups that kick me home fairly regularly and an inability to connect to the network occasionally when other devices are ok. I restart both and it works, but just another little annoyance to handle.I would think that the bigger Fire TV would handle the heat being generated better but maybe this is a software issue. I haven't found the perfect solution for streaming only, but my game consoles work flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 5.0, "review": "great product great price", "verified": true, "helpfulness": "0/1", "author": "William Dennison"}, {"rating": 4.0, "review": "Having some  trouble learning to use it, Do you have to be attached to a cable company to use completely? Wish there were more instructions .", "verified": true, "helpfulness": "0/1", "author": "JEWELL HALLA"}, {"rating": 5.0, "review": "I'd been accessing Amazon instant video through my PS3, and lately using the PS3 only for that, which was fine, but always a chore to switch over from cable and get into the videos.  I got the Fire stick free with Ooma phone service, and honestly didn't expect much difference in using it compared to the PS3, but, yeah, there were a lot of differences.  First, set-up was a breeze.  The stick comes with an extender that made it easy to reach those cramped HDMI ports on my TV.  The stick arrived already activated, and after a short video introduction, I was ready to go.  The remote control is one of my favorite things.  There are just a few buttons, laid out intuitively, and after just a couple of uses, it's easy to remember the button placement without looking at the remote each time.  If I'm watching cable, and want to switch over to the Fire stick, I just push any button on the remote, and Fire stick activates & automatically switches the TV input for me.  Rather than all the steps it took to switch to my PS3, just pressing one button takes me right to Amazon.  The ease of use, along with the top-quality sound & video make this a great device.", "verified": true, "helpfulness": "0/1", "author": "Michael Vaughan"}, {"rating": 5.0, "review": "Love the ease of setup.  And though watching on my kindle fire had  seemed perfect, I must admit seeing the video's on my large screen tv has added  an element of enjoyment I did not expect.  I love it.", "verified": true, "helpfulness": "0/1", "author": "dotla"}]