[{"rating": 5.0, "review": "The fire stick works really nice in my kitchen. I am disappointed that I cant get the Time Warner Cable App on it like I can my ROKU, but other than that, I think it works as well if not better than the ROKU I currently keep in my office. Its very easy to move around the house with.", "verified": true, "helpfulness": "0/1", "author": "suzie"}, {"rating": 5.0, "review": "Works better than I expected, very easy to set up.", "verified": true, "helpfulness": "0/1", "author": "John M Brenner"}, {"rating": 1.0, "review": "It does not work for a Kindle Fire", "verified": true, "helpfulness": "1/4", "author": "D. Bailey"}, {"rating": 5.0, "review": "Goodbye cable and long commercials! Hello wider choices and more savings. Thank you Amazon, for making this available. Easy to use and I am of the pre-tech age.", "verified": true, "helpfulness": "0/1", "author": "Lucy Roper"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/2", "author": "David"}, {"rating": 2.0, "review": "Bad", "verified": true, "helpfulness": "1/4", "author": "antonio rodriguez"}, {"rating": 5.0, "review": "All things should work with the ease of the fire stick, nothing could have been simpler. Just perfect, select with ease the almost infinite choices of prime. Better than cable!!!!! Finally instructions that really worked. You will not be disappointed one bit.", "verified": true, "helpfulness": "0/1", "author": "screwed consumer"}, {"rating": 5.0, "review": "This stick is awesome! Can't recommend it enough! So good I bought another one!", "verified": true, "helpfulness": "0/1", "author": "David"}, {"rating": 5.0, "review": "I bought this for the little TV I just got for my kitchen so that I could binge watch Netflix while cooking and cleaning.  I already had a Google Chrome for another TV in the house and decided to give this a try, because you don't need to always have your mobile device on hand to use it.  I am liking using the remotes for this much better than my mobile devices for Chrome.  However, I have not yet tried it out with anything other than Netflix.", "verified": true, "helpfulness": "0/1", "author": "Jamie"}, {"rating": 5.0, "review": "Love it, so much to watch and do. My grandchildren love the games.  Need the controller now!", "verified": true, "helpfulness": "0/1", "author": "Karen Kup"}]