[{"rating": 5.0, "review": "This is great. I originally purchased CromeCast, and it downloaded a lot on my laptop, and slowed it's response time. Fire TV Stick was easy set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Pammy \"Pam Emerson\""}, {"rating": 5.0, "review": "So in the portable media market you have three big players...  The Google Chromecast, the Roku Stick and the Fire TV Stick.  I happen to own all three and travel 3 our 4 weeks a month.  I'll run down the pros and cons of each.Chromecast:-Pros Smallest \"package\" (due to the lack of a remote) Works with just about anything you can view on your phone or PC-Cons Doesn't have a remote, you'll have to use you phone / PC and heaven help you if you are in a hotel with several WIFI hotspots and your phone hops over to another one. You have to find the media first and then send it to the device Doesn't have a browser, so you may want to bring a wifi router to get around sites with landing pagesRoku Stick:-Pros Has a remote Has a store for finding channels Has a ton of channels for just about every taste Netflix, Amazon, VUDU, HULU, Crackle, HBO GO, Google Play, DishWorld, NBA, MLB, ESPN, etc Can search across most of the main providers Some content is ad supported for free or pay a nominal amount to view it ad free-Cons The interface can freeze on occasion Finding channels can be a daunting task Many channels have OLD content Some content is ad supported for free or pay a nominal amount to view it ad free Doesn't have a browser, so you may want to bring a wifi router to get around sites with landing pagesFire TV Stick:-Pros Has a remote Has a store for finding channels / apps The initial offers of channels / apps seems limited, but it's all wheat, no chaff Netflix, Amazon, Twitch, HULU, Crackle, HBO GO (coming soon), NBA, ESPN, Flixster, Showtime, PLEX, etc The interface seems smoother and faster than the Roku Stick-Cons Finding channels can be a daunting task The initial offers of channels / apps seems limited Doesn't have a browser, so you may want to bring a wifi router to get around sites with landing pagesSo what do I use?I have been mainly using the Roku Stick, but the Fire TV Stick just became my favorite.", "verified": true, "helpfulness": "0/0", "author": "Brian Paige"}, {"rating": 5.0, "review": "this product is great", "verified": true, "helpfulness": "1/1", "author": "Clifford Johnston"}, {"rating": 4.0, "review": "I confess that the price discount hooked me.  I got this for about $20.00 and for that price how can you go wrong?  That said I do encounter buffering delays from time to time.  I also wish there were apps available for some of my other services.  For example, I have some movies on my Google Play account that I can't watch with this.  However, Netflix, Flixster and a host of other apps are readily available.For some reason I had a bit of difficulty getting the HDMI plug to plug into my TV.  I thought it might be defective but eventually I got it to plug in.  The set up was super easy as the Fire Stick was purchased through Amazon so it was already configured to my Amazon account.  The rest of the time was spent configuring the other apps.I guess I'm typical of most end users.  We buy our digital movies from various vendors based on sale price and with all too little regard for whether the vendors are competing with one another.  Not being able to get at my Google Play movies is a minor annoyance and I can see all of my Ultraviolet library together with my Amazon instant video library.  All in all, happy I bought it.", "verified": true, "helpfulness": "0/0", "author": "Melvin K. Patterson \"Warlock_Lord\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Joe bovenzi"}, {"rating": 1.0, "review": "I wasn't aware of the fact that you have to have Prime in order to access the free shit. I think it's crap that I paid $39 for something that still requires me to pay $50 a month to use?! Ridiculous! Don't buy this unless you want to pay the monthly fee for Prime.", "verified": true, "helpfulness": "1/4", "author": "amber"}, {"rating": 4.0, "review": "So far, so good. Easy to hook up, easy to use!", "verified": true, "helpfulness": "0/0", "author": "KravGHOAT"}, {"rating": 5.0, "review": "If you've got one, you already know how fantastic this device is.  If you don't have one, get it.  You will not be disappointed.  Plenty of tutorials/help on youtube.", "verified": true, "helpfulness": "0/0", "author": "Charles Enderle"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "ipadder"}, {"rating": 5.0, "review": "A++++", "verified": true, "helpfulness": "0/0", "author": "Joanne D."}]