[{"rating": 4.0, "review": "Really liking this so far. Previously we only used Amazon Prime on the computer, which meant we'd have kids clustered around a laptop to watch a movie. Once these came out, the price was basically in \"impulse buy\" territory so we pulled the trigger. Now they can watch movies on the TV, which is a huge improvement. Live streaming of other services (i.e. from an Android phone, or even over AirPlay from OS X via an app you can buy) is also possible, which I didn't expect and which is pretty cool. Overall I'm really impressed and quite glad we bought it. Amazing how far this technology has advanced", "verified": true, "helpfulness": "0/0", "author": "David L Mobley"}, {"rating": 5.0, "review": "This arrived earlier than expected, was easy to install, and works great!  I love it.", "verified": true, "helpfulness": "0/0", "author": "June"}, {"rating": 5.0, "review": "Works perfect and great price!", "verified": true, "helpfulness": "0/0", "author": "Austin Scheidemantel \"AU5T1N\""}, {"rating": 1.0, "review": "it cost way too much to watch movies you could at least be competative with redbox or family video.", "verified": false, "helpfulness": "0/1", "author": "joe dibella"}, {"rating": 5.0, "review": "Purchased this around the holidays and am extremely happy with how it is working.  I also have a Chromecast, but I would struggle to cast here and there.  With the fire stick, the integration to prime or netflix, and other apps is so much better.  I also LOVE that I don't have to have a phone/ tablet to make this work.  The remote is nice and easy AND if you would like your phone/ tablet as a other remote, there is an app for that.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Flatliner \"Flatliner\""}, {"rating": 5.0, "review": "Just perfect for HDTVs that were purchased before they started making internet ready TVs a standard. My 48 inch vizio is still in good shape but I wanted to get rid of the cable box. Getting the Fire TV Stick worked very nicely. Was initially concerned with whether it turns off and stops drawing power...it is off when I get up in the morning, but I wonder if I can turn it off without unplugging it? Or does it go off with the TV?", "verified": true, "helpfulness": "0/0", "author": "Cynthia in Elkton MD"}, {"rating": 5.0, "review": "The Fire TV Stick is everything and more than I expected.  I have cable in one room and wireless which makes the Fire Stick a savings tool.  My son will have only Wifi when he moves here and I have a Fire Stick to give him as a gift for the family.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Joanne Cardinal"}, {"rating": 4.0, "review": "Very easy to install; works perfectly and does everything I wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "Cathy Murdock"}, {"rating": 5.0, "review": "Got it for $20 when it first came out thru their Promo! Beats the socks of the Google ChromeCast stick!", "verified": true, "helpfulness": "0/0", "author": "Heroe Rodriguez"}, {"rating": 5.0, "review": "Awesome. Simply awesome.", "verified": true, "helpfulness": "0/0", "author": "Buyer \"Buyer\""}]