[{"rating": 5.0, "review": "Best thing ever!!!", "verified": true, "helpfulness": "0/0", "author": "Russell Vidal"}, {"rating": 4.0, "review": "Plex is clunkier on the Fire TV stick than it is on the Roku 3. That might be a plex problem and not so much an Amazon Fire TV stick problem. I'm not such a fan of a long USB cable having to hang off the stick and be tied together to plug into the nearby USB port on the TV. I think it should come with two cables, one short cable for the TV's USB and one long cable for when you need to use the USB power supply.", "verified": true, "helpfulness": "0/0", "author": "SB"}, {"rating": 5.0, "review": "It is awesome! It works great. We'll probably be signing up for Amazon prime before long.", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Brittany Smith"}, {"rating": 1.0, "review": "My fire stick sucks. Turns off during shows so much it's unbearable. Probably turns off like 10 times every 30 minutes.  I contacted Amazon and they offered to send me a new one. They sent me just the stick - no plugs or cords - and that one does the same thing, leading me to believe the issue is likely the power source. Why the wouldn't replace the whole thing is beyond me. Now they will only offer me an 80% refund if I send both of the sticks back and I've spent HOURS on phone and chat support. Boo to Amazon.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 3.0, "review": "It's ok.", "verified": true, "helpfulness": "0/0", "author": "socalitman \"socalitman\""}, {"rating": 5.0, "review": "I have owned the Fire TV for over a year and I wanted the same experience on another tv in my house. I can't complain as it seems to be the same! I am even considering the game controller now!", "verified": true, "helpfulness": "0/0", "author": "Earpleaser"}, {"rating": 5.0, "review": "Money saver!  Who needs cable anymore?", "verified": true, "helpfulness": "0/0", "author": "eyezonme"}, {"rating": 4.0, "review": "Love it! Meets all my streaming needs - does freeze at times with the Hulu app, sometimes so much that I can't get through an episode. But it works with my Netflix and pandora so I'm good.", "verified": true, "helpfulness": "0/0", "author": "kvjones"}, {"rating": 5.0, "review": "Was simple to set up and use.  Would recommend highly!!!", "verified": true, "helpfulness": "0/0", "author": "Fran Cohen"}]