[{"rating": 5.0, "review": "We are still learning the ins and outs.  But its wonderful.  So wonderful my sister bought one and so did my friends.", "verified": true, "helpfulness": "0/0", "author": "J. C. Nardiello \"goldengirl50 pattern seeker\""}, {"rating": 5.0, "review": "Very easy setup and navigation. It is also fast and I have access to virtually any streaming service. Much better than the 'Smart' Blu-ray player I bought. This was only $39.99 and does a much better job at streaming various content. Basic remote is not bad, either. You can certainly upgrade the remote or download the remote app to your smart phone, but I haven't even felt the need to do that yet.", "verified": true, "helpfulness": "0/0", "author": "tomvargo"}, {"rating": 5.0, "review": "It is amazing what this little thing can do.", "verified": true, "helpfulness": "0/0", "author": "Javier  Valle"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Osvaldo Vasquez M."}, {"rating": 5.0, "review": "Amazing all around", "verified": true, "helpfulness": "0/0", "author": "thomas"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "aaron stevens"}, {"rating": 4.0, "review": "I have on our TV in the den the Amazon Fire box. That remote comes with voice search. That is great. I assumed the fire stick had the same remote. No. Similar but without voice search. Other than that we really enjoy having the Fire Stick in the bedroom without having to move the box from room to room.", "verified": true, "helpfulness": "0/0", "author": "Jan Barron"}, {"rating": 5.0, "review": "Love this!!", "verified": true, "helpfulness": "0/0", "author": "Cassalee Orgill"}, {"rating": 3.0, "review": "I found the Fire TV Stick did not compare to my existing Apple TV.  I planned on moving my existing Apple TV to another room and replacing it with the more affordable Fire Stick.  Unfortunately, the Fire Stick didn't have the signal range as compared to the Apple TV.  When watching shows on Netflix, I had to deal with constant buffering issues and the picture quality was lower.  I also had an issue locating the ESPN app on the Fire TV Stick.  I believe the ESPN app was hidden under the listing of \"Baseball.\"  For an app that's called out on the main page on Amazon, I found it odd that it was listed as a top app.", "verified": true, "helpfulness": "0/0", "author": "S. J."}, {"rating": 5.0, "review": "Great product.  Very easy to set up and use with Netflix and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]