[{"rating": 5.0, "review": "I love the Fire TV Stick. Your original Prime programming is excellent. The selection of movies is very good. It is easy to set-up and use out of the box.  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Dan McGuire"}, {"rating": 4.0, "review": "Loses the network from time to time, that's the only thing keeping it from getting a 5 star rating.I paired it with a Netflix subscription $8.99/month) allowing the Fire TV Stick to show 1 show/movie on the TV while my pc or tablet can play a different one.Look out cable and satellite... Internet and On-Demand are growing... and I never see commercials!", "verified": true, "helpfulness": "0/0", "author": "Dan Racette"}, {"rating": 4.0, "review": "This is a terrific product, but unfortunately my high speed internet connection wasn't consistently fast enough to stream movies without interruption. I had to return it for that reason, but if I have access in the future to a faster connection, I will re-order this item. I live in a rural area and do not have access to cable which would provide a sufficiently high speed hook up.", "verified": true, "helpfulness": "0/0", "author": "NevadaStu \"Hayley's dad\""}, {"rating": 5.0, "review": "just wish you did not have to scroll through everything to find a movie, I would like a list of whats available.", "verified": true, "helpfulness": "1/1", "author": "Barb"}, {"rating": 4.0, "review": "Easy to install and operate", "verified": true, "helpfulness": "0/0", "author": "Suzann M."}, {"rating": 4.0, "review": "Easy to use and set up", "verified": true, "helpfulness": "0/0", "author": "Colleen Sullivan"}, {"rating": 5.0, "review": "It is awesome.", "verified": true, "helpfulness": "0/0", "author": "Randi McManus"}, {"rating": 5.0, "review": "As a past user of Roku, Chromecast, and Apple TV, must say that the Fire TV Stick's combination of easy setup and ongoing ease-of-use have been very pleasant surprises!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wish I would have discovered this earlier!  We love playing all our apps, watching movies and listening to music!  If it goes on sale again  I am buying several!", "verified": true, "helpfulness": "0/0", "author": "gadgetrn"}, {"rating": 3.0, "review": "I am mostly satisfied with this product, it is easy to install and use.  However, I am disappointed that it is not compatible for screen sharing with my Kindle Fire HD.  While reading about the product I was of the impression that I would be able to mirror my Kindle Fire HD's screen to the TV using the Fire TV Stick.  I have a Kindle running Fire OS 2.0 or greater, however it still somehow is not compatible.  I don't believe that was clear in the Fire TV Stick description.I am also disappointed that I asked for the product with the belief that it included a HBO GO app, however upon reading more realized that it will not be available until Spring 2015 (a specific date would be nice).  This is another major reason that I purchased the stick, as my smart TV does not include a HBO GO app either.  I'm sure it will be worth the wait once the app is released, but I'm still disappointed that I missed the fine print about having to wait.", "verified": true, "helpfulness": "0/0", "author": "ASP419"}]