[{"rating": 5.0, "review": "I really like this", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 2.0, "review": "My husband and I bought one for the New TV.  I can't even come close to have actually paid money for it.  They don't separate the ones you pay for (Which is most of them)  so you get to channel surf whether you want to or not", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I thought this would be better than our Roku.  Boy was I wrong! When we first set it up, it wouldn't connect to our router. Then, when we went to watch ANY movie, it buffered every 30 seconds. Also, it didn't have all the channels that the Roku has. The Fire Stick still needs a lot of work.", "verified": true, "helpfulness": "0/0", "author": "Tom Marshall"}, {"rating": 5.0, "review": "Use it everyday and love it.", "verified": true, "helpfulness": "0/0", "author": "Ryan Ostler"}, {"rating": 5.0, "review": "I like it , good so far with light use !", "verified": true, "helpfulness": "0/0", "author": "harvey alien"}, {"rating": 5.0, "review": "Great product and affordable way to watch so many movies etc!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Carole B"}, {"rating": 5.0, "review": "This is a lightweight portable tv option and it makes the prime movies even more worthwhile.", "verified": true, "helpfulness": "0/0", "author": "Nicholas"}, {"rating": 5.0, "review": "If you are a prime member then this is a must have.  If not, then become one!", "verified": true, "helpfulness": "0/0", "author": "C. Snyder"}, {"rating": 4.0, "review": "A great convenience.", "verified": true, "helpfulness": "0/0", "author": "Chris Durnan"}, {"rating": 2.0, "review": "If I had done this review sooner I might score it higher, but it doesn't last. For a Wi-Fi only device the Wi-Fi needs to be able to last more than a month.PROS:-I really liked being able to not have my noisy game system on to watch Netflix and Amazon Prime content.-Had some casual games that were mildly entertaining as well that were available in the marketplace.-Was easy to setup and connect to my wireless, downloaded update just fine and was watching movies soon after unpacking it.-Portable, was great to take to the in-laws over Christmas break and have easy access to my content on their large TV.CONS:-Wi-Fi chip doesn't last, reading others reviews many of us might be \"too close\" to our routers so the strong signal could be damaging the chip. Wish I had known this was an issue with the fire sticks, I fear its too late now though, the damage is done. It's constantly dropping and has been getting worse and worse. Disconnecting the power then plugging it back in used to work for a little while, but last night was so bad I couldn't watch more then a minute or two, kept disconnecting then connecting back up, I unplugged the power and turned my game console on to finish watching a show. My router isn't the issue, every other device I have works fine, both on the 2.4 and 5GHz ranges.-No off button/switch/setting. It goes to sleep sure, but if you want it off you'll have to unplug it. Probably doesn't help the Wi-Fi last longer if it can never turned off.-Not very many apps/games. Typical Amazon product locked into the Amazon approved apps, but this has even less. To be fair it is a new product and the list has grown since I received mine.All in all it was a good unit that I used a lot while it worked, but 1 month is way to short of a life that I can't rate this higher then 2 stars. I haven't called Amazon support yet and many say they will replace it if it is faulty, but is the phone tech stress and time worth it for a $20 item? I haven't made up my mind on that yet.", "verified": true, "helpfulness": "0/0", "author": "Also-ran"}]