[{"rating": 5.0, "review": "Best thing since sliced bread! I use it ALL the time!", "verified": true, "helpfulness": "0/0", "author": "Andrew Fraczak"}, {"rating": 4.0, "review": "The Fire TV Stick is \"not compatible\" with my older TV -- I get video, but no audio. I plugged it into the HDMI port as instructed, but neither of the two Sticks I ordered had audio. Amazon customer service was extremely helpful -- couldn't have been better -- but there is nothing I can do about this issue. Amazon should tell people that the Stick might not work with older TVs, even if they have HDMI ports. Bummer.UPDATED: I finally figured out that I had to change a sound setting on the TV itself to get the Fire Stick sound to work. Amazon never suggested this, even though I was on the phone with them for 2+ hours. Hopefully they will train their tech staff more completely in the future. Now that I can hear the programming, it works great so far.", "verified": true, "helpfulness": "0/0", "author": "Mom in Phoenix"}, {"rating": 3.0, "review": "WARNING : It does not work with HDMI extenders.I purchased a 8\" HDMI female to male extender. No big deal right.About 10 minutes into a stream, you will get a \"HDCP unauthorized. Content Disabled.\"", "verified": true, "helpfulness": "0/0", "author": "philip"}, {"rating": 3.0, "review": "I'm disappointed in the Fire TV Stick. It works great and I have no complaints in that regard.  But as an owner of four Rokus and an Apple TV, I find the screens much more cluttered.  I honestly would prefer less promotion of movies and TV shows in my face on the home screen.  If I want hints on what to watch, just give me one space below the home screen to get those.  I also don't like the scrolling across long rows of apps.  I much prefer the grid layout of the Roku and Apple TV.  Roku abandoned the scrolling interface quite awhile ago.  I felt I was moving backwards as regards the interface.I haven't used the games much yet, but I suspect my sons will enjoy those apps.In sum, the device works great right out the box, but the interface is atrocious and needs a lot of work.", "verified": true, "helpfulness": "1/1", "author": "Gregory K. Laughlin \"GL\""}, {"rating": 5.0, "review": "What can I say? Plug it in and it just works!  It immediately found my network and connected.  Now I have Netflix, Amazon Prime and a whole host of other sites available at the click of a remote. Absolutely a must for Cord Cutters!", "verified": true, "helpfulness": "0/0", "author": "38ChevyGuy"}, {"rating": 5.0, "review": "I love this product!  It was super easy to install and works just as described.  Previously, I had ordred Chromcast and it didn't work on my tv because it is an older model plasma that isn't a \"smart tv\".  I took a chance on the Fire Stick and I was delighted when it worked.  It literally took 5 minutes for me to set this up and have it running on my tv.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Barbara J Brown"}, {"rating": 2.0, "review": "not a fan of the interface.. Roku is much faster to navigate despite the processor being slower..  Fire compensates for the faster processor with having to go through around 2-3 more steps to achieve what roku does.  Unplugged it and will use it on an extra device or use it as a bookmark.  This also gets hot.. really hot.  I made the mistake of having it too close to my roku stick and it made the roku glitch from the heat (which is how I noticed it).  having to have external power rather than taking advantage of mhl seems like a step back also.", "verified": true, "helpfulness": "1/1", "author": "gabriel hebert"}, {"rating": 5.0, "review": "I'd like to say I rarely ever write reviews, but everyone needs to buy a Fire Stick asap!!! I pre-ordered 2 of them a month ago at the unbeatable price of $19/stick, and it is nothing short of AWESOME.The setup was a breeze, and I've had no streaming problems thus far. Great job Amazon!!!My only complaint is that they're on backorder until January!!! My parents saw mine and my brother's, and now they wanted one...", "verified": true, "helpfulness": "0/0", "author": "Thu-cuc Nguyen"}, {"rating": 3.0, "review": "Buffers a lot on netflix", "verified": true, "helpfulness": "0/0", "author": "mac"}, {"rating": 5.0, "review": "I really enjoy this Fire TV Stick. My Amazon Prime and Netflix movies work great with it.", "verified": true, "helpfulness": "0/0", "author": "Matthew Smiriglio"}]