[{"rating": 5.0, "review": "This product is worth every penny. If you want instant access to Netflix, Amazon Prime and many other streaming choices, the Amazon Fire TV Stick is the only choice. I have other bulky options, but chose to buy the Fire TV Stick and give it a try. I couldn't be happier with my purchase. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "GradyMay"}, {"rating": 1.0, "review": "The Fire Stick works great, but customers should be told that unit uses huge amounts of Bandwith per day.  My normal use is 5 to 7 MB per day.  The first day the Fire Stick used 40 GB.  I do want to watch more than 7 days per month.", "verified": true, "helpfulness": "0/1", "author": "larry w moore"}, {"rating": 5.0, "review": "This works perfectly in our workout room and prevented us from having to add another DirecTV box.  We don't have those stations but this is better anyway for working out - no commercials on Netflix and Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Anna Martha \"Love Deals\""}, {"rating": 1.0, "review": "I had to wait a month for this piece of junk.I currently had a Roku stick and was considering a second one for the family room. I saw the Fire stick and noticed the specs were much better than the Roku or Cromecast. So I ordered the Fire stick. A month later I received it and tried it out for a few minutes, it seemed to work fine. When I tried to watch a movie that night with the family it only played for a minute and kept freezing up every few seconds. I hooked it up to our other TV (with the supplied power supply) and still the same thing happened. It was very annoying and frustrating.VERY DISAPPOINTED! !", "verified": true, "helpfulness": "0/0", "author": "MinkaMink"}, {"rating": 5.0, "review": "I own the Kindle Fire TV box and have enjoyed it so much, when this came out I knew I needed it for traveling.  Most TV's in hotel rooms any more have HDMI inputs on them and most hotels offer wifi, so now I can take my Amazon with me!  It has a few less features than the box, but for traveling it is perfect.  I would not be without either.", "verified": true, "helpfulness": "0/0", "author": "TK"}, {"rating": 3.0, "review": "It does not tell you that you must use a secure wifi connection. I travel  quite often. Useless when I'm on the road.", "verified": true, "helpfulness": "0/0", "author": "mykeens"}, {"rating": 1.0, "review": "It was working fine an now it will not connect to my internet.", "verified": true, "helpfulness": "0/0", "author": "Terri L. Daniel"}, {"rating": 5.0, "review": "Absolutely love it, so easy!  I could not believe how many apps were available. I ordered it for my bedroom tv and within a week I purchased another for the living room tv. I bought one voice remote , which I love, but for the other tv I just downloaded my iPhone with the app which allows you to use it as a voice remote as well.", "verified": true, "helpfulness": "0/0", "author": "Pamela Reed"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Philip Streib"}, {"rating": 3.0, "review": "So far I've had it for a week and a half.  I searched for a couple of movies that were not list in the guide and all three of them were available at a price of 3.99.  Now that's not a lot of money, but....So I'm not that impressed at this point.  Perhaps as I get to use if more, I may enjoy it more.", "verified": true, "helpfulness": "0/0", "author": "Carmelo Assenza"}]