[{"rating": 2.0, "review": "I would rate the roku way over the fire tv stick. Roku is easier to use. Lots of work to be done on the fire tv stick.  I hope it improves as time goes on.  My verdict is out on the fire tv.", "verified": true, "helpfulness": "0/0", "author": "Dedsey"}, {"rating": 5.0, "review": "Wonderful!Works great as promised.  So much better watching Prime & Netflix with the fire stick - using the Wii was slow and so inconsistent - I thought Prime and Netflix had the problems.  Very quick connection with Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "ks_colorado"}, {"rating": 5.0, "review": "Love being able to stream to my TV. Easy installation. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Charmor"}, {"rating": 5.0, "review": "I got the fire TV stick it was i was surprised. Took it out of the box took all of 2 minutes to install signed in to and to my surprise I have every thing from net flix to games. Buying one for all my TV's good buy cable", "verified": true, "helpfulness": "0/0", "author": "Wayne Soares"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Alex Hamm"}, {"rating": 5.0, "review": "Thoroughly pleased.", "verified": true, "helpfulness": "0/0", "author": "ayegeebe"}, {"rating": 1.0, "review": "I couldn't watch anything or browse, every time it would tell me that I was not connected to the internet and all my other devices were working fine because I have a very strong internet connection.", "verified": true, "helpfulness": "0/0", "author": "Rhonda L. Mazariego"}, {"rating": 5.0, "review": "i love the choice of movies, and all the other options. very resonable prices", "verified": true, "helpfulness": "0/0", "author": "rusty tallant"}, {"rating": 2.0, "review": "Netflix works fine however amazon Prime is very slow . It loads more than it plays. I won't recommend it . Also , package came only with 1 battery for the remote  .Made me think if it was a return and repackaged !!! .", "verified": true, "helpfulness": "0/0", "author": "SAL"}, {"rating": 3.0, "review": "This item seemed like the best thing since sliced bread. it has awesome stuff like Netflix, games, movies, photos right from your smart phone and more!! But then it started freezing during Netflix shows and had to reload several times. I thought it was my internet.... So I doubled my speed to 30mbps and even a week later it still can't watch a show all the way through.  And in case you figured I have too many devices on the network, I shut the wifi off on all devices.  Still doesn't work right. It feels like it's 500 degrees on the stick too.", "verified": true, "helpfulness": "0/0", "author": "michael j keegan"}]