[{"rating": 1.0, "review": "I pre-ordered this product although I like the Roku a lot.  It arrived on time, setup was easy, and it worked - once.  Since then I get a message that it cannot connect to the internet and to check my settings.  Since my iPhone, iPad and iMac and Roku are all connected to the internet, the problem is with the Firestick.  I'll try again for a few days before I return it.  In the meanwhile, I remind myself to never buy anything with a low serial number.Update sometime later that same day - finally got this thing to connect to the internet, and it even said the signal was strong, but with \"problems.\"  Kept messing with the remote, went to settings, and my network was there, but then I got a message \"out of range.'  Really? 20' is out of range?  If I place the TV next to the router, its also next to my Mac with a big enough screen to watch what I thought I'd be watching with the Firestick.  So I'm returning it lock stock and stick tomorrow.My techno consultant, aka son, tells me the Fire TV is great with no range problems, so I've ordered one.  After paying the sale price, using a credit card cash back, and the return on the stick, I'm only paying the price of a decent wine for the Fire TV.", "verified": true, "helpfulness": "1/3", "author": "John Robinette"}, {"rating": 1.0, "review": "It's not worth its money.", "verified": true, "helpfulness": "1/7", "author": "Mike"}, {"rating": 1.0, "review": "I got my stick when they first came out. Fast forward a few months and I needed to change my wifi name and password. All our household electronic devices found the new network immediately, except for the Fire TV stick. It won't find it at all. It still finds the old name, but you can't change the password. I unplugged it and tried again and again. I even tried adding the new network all to no avail.I called Amazon help and they walked me through the same procedures. Then they deactivated the stick and reactivated it. After it still wouldn't find the new network, I reset the stick (you hold down the right side of the circle and the return key on the remote). It still only finds the old network. And, even though I put in the new password, it won't take it. I also tried adding the new network at this point. Again, no dice.Basically, it's become a useless piece of plastic because I had the nerve to change my internet password. You would think that Amazon would have thought of that.This is exactly why I refuse to buy another Amazon Fire Tablet - they're made to break down and become unusable quickly. Never again. I cancelled my Prime membership and me and Amazon's electronic devices are over.", "verified": true, "helpfulness": "1/2", "author": "Sadie"}, {"rating": 4.0, "review": "It's a really awesome device, however it doesn't do much of what Apple TV does. I did know this before I bought it, but overall it's a good buy for $20 with promotional offer", "verified": true, "helpfulness": "0/0", "author": "Jorge"}, {"rating": 5.0, "review": "The Fire TV Stick is perhaps the easiest and definitely the smallest streaming device I've tried.  It comes pre-loaded with your Amazon account number, although, as with the Kindle, that can be changed by a gift recipient.  All you need to do is insert it into a HDMI port on your TV, plug it in (more on that later), and connect to your home network. You're instantly connected to Amazon content.  Other media sources such as Netflix, Hulu Plus, and Classic TV need to be downloaded, signed into if applicable, before use.I ordered the Fire Stick when it was first announced so I wasn't entirely clear on how it worked.  The page said that for best results, I would need to plug it into a wall outlet.  Since I was trying to minimize wires in a guest room to make a non-smart TV wireless, I figured I could deal with degraded speed.  When I received the Stick, however, it quickly became apparent that it requires power to work.  The problem is that the power cord is short and would need an extension cord.  Plus, I had yet another black cable running down the wall.  I tested it first plugged into the wall outlet.  The streamed video was crisp and lag-free.  So then I plugged the USB end of the Stick into my LG TV.  Surprise!  The TV supplied enough power to run the Stick without any noticeable degradation.  Note:  Not all TVs will necessarily have enough power or even a USB port.Due to its thickness, inserting the Fire TV Stick directly into an HDMI port can be tricky, if not impossible.  For that reason, Amazon includes a dongle that hang off the port and connect to the Stick.  The included remote (non-voice activated) does not need a line of sight to reach the Stick.  The remote works perfectly, even with the Stick completely obscured by the TV screen.If your TV already has internet-connectivity and the apps to support streaming, then there's no reason to get the Fire Stick.  It has basically the same functions as a Roku but in a smaller, less obtrusive package.  I find that it's a great way to convert a TV without built-in WiFi to what resembles a Smart TV.-- Debbie Lee Wesselmann", "verified": true, "helpfulness": "7/7", "author": "Debbie Lee Wesselmann"}, {"rating": 5.0, "review": "I love the quick loading of Prime shows. It has only been installed two days, and I've yet to explore many other features.", "verified": true, "helpfulness": "0/0", "author": "Richard K Whiting"}, {"rating": 4.0, "review": "I'm enjoying my fire stick. It's fairly intuitive and a very quick way to navigate Amazon Prime. I would definitely suggest this to others.", "verified": true, "helpfulness": "0/0", "author": "KKruse"}, {"rating": 5.0, "review": "I have had a fast internet connection for many years and wondered why I wasn't using it for streaming videos.  The Fire TV stick is the answer.  It is a must see.  I am a comcast xfinity user so right away I noticed a couple of the pre-loaded apps didn't work/did not apply.  No matter as I am stunned by how well this works and by how many good quality shows are available.  Plug it in and start watching.  Super simple set-up.  Super simple intuitive remote also.", "verified": true, "helpfulness": "0/0", "author": "Dale Daugherty"}, {"rating": 5.0, "review": "i love it but the darned setup requires hdmi 1 -so i had 2 change my other inputs ; otherwise its works as advertised.now i can finally watch amazon tv on a screen larger than my tablet.it would have been nice it it was powered by the tv's hdmi port -- oh well i had 2 setup an extension cord -unsightly cords .", "verified": true, "helpfulness": "0/0", "author": "JmC"}, {"rating": 5.0, "review": "...wish I had purchased a 2nd one when the promotion was offered!", "verified": true, "helpfulness": "0/0", "author": "Sandy Allen"}]