[{"rating": 1.0, "review": "Search does not search for content within apps - makes it difficult and very clunky to find content. interface is slow. streaming generally works OK.  Android app takes ~45s to connect every time the phones screen powers off! I think its too late for me to return this, but i will be replacing it with something else soon", "verified": true, "helpfulness": "1/1", "author": "Zachary Rubin"}, {"rating": 5.0, "review": "Amazon fire stick and Amazon prime THE PERFECT COMBINATION.", "verified": true, "helpfulness": "0/1", "author": "POOKIE D"}, {"rating": 5.0, "review": "Awesome!!  I'm glad I have it and also that I signed-up for Netflix and YouTube.", "verified": true, "helpfulness": "0/1", "author": "Kristina L. Luttrell"}, {"rating": 5.0, "review": "its really cool. so easy i caught my dog using it", "verified": true, "helpfulness": "0/1", "author": "robotjones"}, {"rating": 5.0, "review": "THE FIRE TV STICK IS EASY TO INSTALL AND IS SO EASY TO OPERATE.  IT IS WELL WORTH THE MONEY.  I AM NOW ENJOYING PANDORA'S MUSIC AND NETFLIX MOVIES JUST TO MENTION A FEW OF THE GOOD SHOWS AVAILABLE.", "verified": true, "helpfulness": "0/0", "author": "opinionsplus"}, {"rating": 5.0, "review": "Works great.  Highly recomended for a simple solution to make a TV smart.", "verified": true, "helpfulness": "0/0", "author": "gnome"}, {"rating": 5.0, "review": "Way better than the chromecast it replaced.  It's almost perfect.  If only I could let my son use this with my prime streaming and prevent him from inadvertently purchasing things on my account it would be much better.  Still, it is great with netflix even though I had to remove the amazon prime streaming account.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "First of all, this is a great product for the price as a prime member. I have bought the Y-cable, similar to this http://www.amazon.com/StarTech-3-Feet-Cable-External-Drive/dp/B0047AALS0/ref=sr_1_9?ie=UTF8&qid;=1426642915&sr;=8-9&keywords;=y+cable+usb+a+to+usb+b to supply power to the TV stick and it works. The normal single USB cable is not able to supply enough power to the TV stick! Don't buy it from StarTech on amazon as I got it for less than $5 from a local store.", "verified": true, "helpfulness": "1/2", "author": "Tan Choon Seng"}, {"rating": 1.0, "review": "You tube no longer works on the firestick. If you play videos it cuts off at least of screen in blackness.", "verified": false, "helpfulness": "0/1", "author": "Matthew Lyons"}, {"rating": 5.0, "review": "It's really fast for what u pay", "verified": true, "helpfulness": "0/1", "author": "CS"}]