[{"rating": 1.0, "review": "Never turns off", "verified": true, "helpfulness": "0/1", "author": "kenneth c. hayes"}, {"rating": 1.0, "review": "Stick will not connect to WiFi if you have AES encryption. The initial setup connecting to WiFi connects without any issues. Once it connects, stick will download and install software. After the software installs on the stick, it will no longer connect to WiFi. I have tried 2 sticks both had the same results.", "verified": true, "helpfulness": "3/4", "author": "G"}, {"rating": 5.0, "review": "I love this. I bought it for my parents' tv as they don't have any devices that allow them to stream their Amazon Prime videos. Way simple to set up, and within about 5 minutes I was showing my mom how to navigate it. The only things that caused any issues were that I wanted to use the power cord and we had to find an outlet multiplier, and the little mandatory goofy intro video took a couple of minutes to sit through. I also discovered that my folks' Sony remote will control the Fire TV stick for navigating the menus. You need to hit the button on the actual Fire Stick remote to 'wake it up', but after that it doesn't necessarily add another remote to your pile. Having said that, it is a nice small, and well shaped remote. The buttons are crisp, and easy to use, and it's a very simple and pleasing design.I like this enough that I intend on purchasing one for myself for my basement tv that I do local broadcast with. With this, I can access a ton of things to watch, and I don't have to invest any more in av equipment. Also, I look forward to being able to pause or stop a program on the main large tv (which accesses Prime Video by itself), and then pick up in the same place downstairs. Cool.", "verified": true, "helpfulness": "0/0", "author": "Holly J"}, {"rating": 5.0, "review": "I Love,Love,Love My Fire TV Stix! I get SooooMany Movies", "verified": true, "helpfulness": "0/0", "author": "Kathee"}, {"rating": 5.0, "review": "Fire TV Stick worked very good for all movie.", "verified": true, "helpfulness": "0/0", "author": "Eddieharper"}, {"rating": 5.0, "review": "The fire stick is all it is promised to be. I have both an Apple tv and Chromecast. The chromecast is slow, not an easy device to use, dare I say not ready for primetime. The apple tv is great device and works well but will cost you $100. The fire stick does  everything the apple will do at a fraction of the price. What I like most about the FireStick is its ability to download apps and using your smart phone as a remote that you can use voice commands.", "verified": true, "helpfulness": "0/0", "author": "M. Fischetti"}, {"rating": 4.0, "review": "SO FAR WE REALLY LIKE IT. EASY TO SET UP USE.", "verified": true, "helpfulness": "0/0", "author": "lumberman"}, {"rating": 5.0, "review": "Had this up and working in about 5 minutes. Works perfectly with Netflix and all of the apps run well. I haven't tried Hulu yet, but so far, it's great!!I bought the Calm fireplace app and it looks great on our tv screen.My husband likes the NFL app on the big screen.It's great for sending shows from my Kindle fire hdx 7\" to the tv.I got this when it was on sale for $19, but it's worth the full $39 and then some.", "verified": true, "helpfulness": "0/0", "author": "wanda"}, {"rating": 5.0, "review": "Amazon's Fire Stick exceeded my expectations. It is small, immediately responsive to the remote and very fast for streaming content. I ordered it on a whim as a Xmas present for my wife and we are both amazed at its performance.Five Stars, absolutely.", "verified": true, "helpfulness": "0/0", "author": "Craig Balthrop"}, {"rating": 5.0, "review": "I LOVE this thing! Works flawlessly with my Prime Membership. It was easy to set up, and the menu system is straight forward.  I really enjoy the Bluetooth remote, why aren't ALL remotes Bluetooth? We use it for watching free prime movies and listening to prime music collections. The screensaver has some nice pictures.  You can tell the pictures have a Seattle area influence. I got a Fire TV for Christmas, but as we aren't gamers, we kept the Fire Stick. Overall I would definitely buy again.", "verified": true, "helpfulness": "0/0", "author": "Dthraco"}]