[{"rating": 5.0, "review": "Easy to install, works great", "verified": true, "helpfulness": "0/0", "author": "Fashanta"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 5.0, "review": "I own three fire tv sticks and I just love them, got this one when it first came out at a great price for prime members and the other two I bought them at Best Buy. Before I was about to get me a smart tv which I know now that would of just limit what I can do.  Love that I can mirror my phone to the screen and that I can just take it anywhere I go. Have use chromecast and roku and I can assure you that the fire tv is way better.I don't like the interface, but that's a software issue, hopefully Amazon will change it to make it easier to navigate.Totally recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "J Rodriguez"}, {"rating": 5.0, "review": "I don't really like the fire tv user interface but it's pretty simple to get used to.  Being an Android system It's just not what I expected.  I bought this with the intent of using it as a secondary XBMC player for smaller rooms around my house.  It's very powerful for such a tiny device and is great for a networked media player.  I no longer need my Western Digital media players that were solely used for local files and were total junk for streaming content.I have my fire tv stick setup to boot into XBMC and I was plesently surprised that XBMC automatically recognises the Fire TVs apps under programs.  I can easily access any native Amazon app without ever leaving the beauty of my custom XBMC user interface. The FireTV has great content with a lot of flexibility, truly something for everybody. Bluetooth functionality is cool and I like that I have a lot of freedom in the future to add keyboards or game controllers.I have a top of the line wireless router and my Fire TV Stick works great on my home network.  I've experienced much slower load times while at a friend's house because of a slightly slower network and very poor connectivity at hotels where network speeds are slow during peak times.  These are about the only negative experiences I've had but I can't blame the fire tv stick for a slow network,  it does what it's suppose to do. However, I do wish that I had the option to directly connect my Fire TV Stick to the internet using a cable. But there's the full Amazon Fire TV for that.", "verified": true, "helpfulness": "1/1", "author": "Fully Completely"}, {"rating": 5.0, "review": "We tried connecting the laptop to the TV, didn't work, called tech support, bought a new cord, still didn't work. Bought the Amazon Fire TV Stick and instantly we had a whole world open up to us. Amazing!!!!", "verified": true, "helpfulness": "0/0", "author": "Linda C"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "CHRISTOPHER TOWNLEY"}, {"rating": 5.0, "review": "Really enjoy it!", "verified": true, "helpfulness": "0/1", "author": "Allen S. Faircloth"}, {"rating": 5.0, "review": "Very easy to useWith a Prime membership there are gazillions of movies to watch and enough games to choke a horse.YEEEEE-HAAWWWWW", "verified": true, "helpfulness": "0/0", "author": "Jeri"}, {"rating": 5.0, "review": "Love this so much easy to install and work just love it", "verified": true, "helpfulness": "0/0", "author": "judy manzoor"}, {"rating": 5.0, "review": "Phenomenal gadgetGreat purchase ... Was setup and in use within minutesPicture quality is excellent", "verified": true, "helpfulness": "0/0", "author": "Irie Living"}]