[{"rating": 4.0, "review": "Love this little Fire stick. It connects up easily and is not too difficult to find what you want to watch. Sometimes I get bumped off my viewing, but I feel that it's the fault of my internet provider. I would like to be able to access my VuDu account since it has a lot of my ultraviolet copies. The price is very reasonable and I trust Amazon to produce a quality product.", "verified": true, "helpfulness": "0/0", "author": "L. Stephens"}, {"rating": 3.0, "review": "Does the trick but is buggy and still needs a LOT of work. Has to be reset often since it freezes. Why don't we have access to common apps such as YouTube??", "verified": true, "helpfulness": "0/0", "author": "proudnlazy"}, {"rating": 4.0, "review": "Great! More channels coming I hope!?", "verified": true, "helpfulness": "0/0", "author": "C'Uda"}, {"rating": 1.0, "review": "THE CONTROL REMOTE DOESNT WORK VERY WELL", "verified": true, "helpfulness": "0/1", "author": "gustavo leal"}, {"rating": 5.0, "review": "Super!!", "verified": true, "helpfulness": "0/0", "author": "Brandon L. Torres"}, {"rating": 5.0, "review": "Works perfectly. We did not want another box in the house so went for the Fire Stick instead of the Fire TV and it has been the best decision ever. Very simple setup and everything is easily accessible.", "verified": true, "helpfulness": "0/0", "author": "DABSHAB \"DAK\""}, {"rating": 5.0, "review": "We wanted to \"cut the cord\" at our second home. We got a Slingbox M1 for our full time home, added a wireless connection along with the Fire TV Stick at our second home. Our internet speed at the second home is just 3 mbs down and there is no lag or buffering. Running full HD.  We get all our regular programming, plus sports (NY area teams).  Freaking awesome little device.One warning:  Amazon has an app called Sling TV. This is a subscription service (20 bucks a month). Do not confuse this with Slingbox.  Once you have a Slingbox (I paid $150 for the M1) running with the stick, there is no cost to you.", "verified": true, "helpfulness": "0/0", "author": "Front4"}, {"rating": 5.0, "review": "I love the Fire TV. Better selection of videos and movies than NetFlix, in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Anne C Smith"}, {"rating": 4.0, "review": "Good REmote.", "verified": true, "helpfulness": "0/0", "author": "L. Cole"}, {"rating": 3.0, "review": "I really wanted to love the heck out of this, however, there are some significant problems. We bought the Fire Stick to avoid having to hook up my laptop every time we wanted to watch Amazon and other streaming movies. The set up was fine. However, it drops the network connection constantly and sometimes the buffering makes watching impossible. It happens so frequently, that every time we have rented a movie from Amazon, they have automatically refunded our rental price (without us having to ask), as they obviously detected the issues we've had. And forget about using your iPad or other wi-fi device while using the Fire Stick.Pandora is okay - Youtube is hit or miss.When I hook up my laptop, we do not experience this at all, so my only guess is that the network device in it is very weak.UPDATE: 4/14/15: Signed on to HBO stand alone service. Saw that Fire Stick had the app - downloaded the app only to discover that Fire Stick does not support HBO GO/NOW unless you have a cable subscription (which kinda defeats the whole purpose of a stand alone service). Seems HBO has an agreement with Apple, so I can watch it on my iPad, or laptop, but not FS.  Broke down and got an Apple TV receiver for HBO. Will use the FS for Amazon.", "verified": true, "helpfulness": "1/1", "author": "Laura M. Collins \"Lures Vegetables into Puff Pastry\""}]