[{"rating": 3.0, "review": "What's with the screensaver activating while I am watching a movie???", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 5.0, "review": "great way to view prime video, digital purchases, and listen to music via amazon music", "verified": true, "helpfulness": "1/1", "author": "jt"}, {"rating": 4.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "D. Berger \"BikeRider\""}, {"rating": 4.0, "review": "I have Fire TV and wanted to add two Fire Sticks for our other rooms. I think because I now have so many devices hooked up, the system gets confused and it takes a bit of time to sort it all out. But the good thing is that more than one person can use the AMAZON Prime viewing at the same time (different shows, different viewing pleasures). That was my overall goal, so these Fire Sticks have been a very nice addition.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Got this as a \"surprise\" gift for my bf who loved it!!! He had been wanting one so I got it. Great price!! I think it was $39. We have been able to see movies with great clarity and saved so much money!! You can do a lot with your fire stick if you know what you're doing ;) :)", "verified": true, "helpfulness": "0/0", "author": "Shal"}, {"rating": 4.0, "review": "Love the fire stick it's awesome no trouble connecting", "verified": true, "helpfulness": "0/0", "author": "jessica"}, {"rating": 1.0, "review": "it was a challenge getting the back off to insert the battery. I would not buy this product again.", "verified": true, "helpfulness": "1/2", "author": "Renee"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Melissa Maier"}, {"rating": 5.0, "review": "The TV in the spare room doesn't have a cable box so I plug in  the fire stick and get to watch all the shows I want on Netflix, you tube and amazon. Well worth the money. Just buying another one for my daughter in--law.", "verified": true, "helpfulness": "0/0", "author": "Anna Turner"}, {"rating": 4.0, "review": "After two months of minimal use, my FireTV stick has stopped working. It tries to load but constantly resets over and over again. I called customer support, and after numerous attempts of trying to get it to work, they are sending me a new one. Well, I think it's new. Kind of weird that I will only get the actual stick- not a whole new package. I hope I don't get a refurb considering the one I have is basically brand new. Regardless, customer service was nice to deal with. Looking forward to getting my FireTV stick back and in working order.", "verified": true, "helpfulness": "0/0", "author": "Cat M"}]