[{"rating": 5.0, "review": "Great product that is good for the family on the go!  We use this at home and take it with us to use at hotels when we are out. Nice to keep the same access to shows all the time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Both of my TVs are capable of streaming Amazon Prime, Netflix, etc.  Both performed better in native mode than with the Amazon Fire TV Stick.  The TV Stick very frequently lost contact with my router and each time it would stop with a message instead of buffering.  I sent if back and would not recommend it.", "verified": true, "helpfulness": "0/0", "author": "William T Fleshman, Jr"}, {"rating": 5.0, "review": "Love it, much better than the 'internet ready' Vizio TV I purchased which limited the apps you were allowed to use.", "verified": true, "helpfulness": "0/0", "author": "Carmen \"southerntransplant\""}, {"rating": 5.0, "review": "The best investment you will ever make; easy to install and use.  And with Netflix at only 7 bucks a month and lots of freebies it is worth it!!!", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 1.0, "review": "I returned this item .I was on phone with tech person for almost 2 hours to get it connected and then next day it would not work and one of your techs told me there was a network virus and was charged 50 dollars to clear it which di not help ,so I got ripped off for 50 dollars,I warned all my friends to beware.", "verified": true, "helpfulness": "0/1", "author": "ann"}, {"rating": 5.0, "review": "OMG.  I love this little contraption.  I can watch almost everything.  I have been without cable for the past 2 years and subscribe to Prime, Netflix, and Hulu and pay less than $30 a month and can watch almost everything I used to.  I have realized that watching TV can take up a lot of time that could be spent living a real life instead of watching others live theirs.  This helps me save money and streamline my tv time!", "verified": true, "helpfulness": "0/0", "author": "Tiffany Pargo"}, {"rating": 3.0, "review": "hard to navigate and most of the links you will have to pay for", "verified": true, "helpfulness": "0/0", "author": "Steven Douglas"}, {"rating": 1.0, "review": "Worst product ever .. Amazon customers since 2005 and never since Amazon not standing behind the product. The device keep rebooting many times in a day but no support from Amazon", "verified": true, "helpfulness": "0/0", "author": "VM"}, {"rating": 5.0, "review": "This has been a nice addition to our bedroom TV for watching Netflix and listening to music on Pandora.  I would recommend it for any TV that does not have a wireless attachment such as a Blue-ray player or video system.", "verified": true, "helpfulness": "1/1", "author": "Ellen Duman"}, {"rating": 2.0, "review": "Wasn't impressed. Firestick didn't perform how I anticipated it would.", "verified": true, "helpfulness": "0/0", "author": "thebottomdollarbiz"}]