[{"rating": 5.0, "review": "Had problem connecting on the first try, but a call to customer service was very prompt and very helpful.  I turned out that the HDMI 1 on my TV was not functional.  I got it to another HDMI and it has worked fine.  I do have a little problem when I choose that HDMI port with my TV remote.  When I then pick up the Fire Stick remote and click OK, the input returns to Cable and I have to repeat the process.  It works fine the second time.  I may be doing something wrong or my TV may be the problem.  No big deal.  The Prime programing is free and I am finding new things to watch.", "verified": true, "helpfulness": "0/0", "author": "N. Haynes \"Outdoor Pal\""}, {"rating": 4.0, "review": "My primary interest in the Fire TV Stick was to view YouTube videos. So far, I am pretty disappointed. First of all, searching YouTube from the YouTube Fire Stick App is horrible. In fact, it suggests searching from your mobile device and pairing that device. Did that, but even though the device connects, it won't play the YouTube video (connected to Xoom 2 or Samsung Avant).Secondly, I attempted to mirror the screen on my Samsung Avant and my Samsung 12.2 tablet. Both devices are new and offer screen mirroring. Was only successful one time. Other times, the Fire Stick TV reports it is mirroring to the device, but never shows the device screen and eventually shuts Fire Stick mirroring off.UPDATE 6/13/2015: WIth latest firmware update AND my tablet upgrade to Lollipop, mirroring (for the most part) works. I say for the most part as it drops audio periodically. NEW ISSUE:. Using the YouTube app on the Fire TV Stick, I can only access the most recent 30 of my 180 YouTube uploads. That's pretty aggravating. Where are the other 120? I can find them on my desktop or tablet in YouTube.", "verified": true, "helpfulness": "0/0", "author": "Buzzard #1"}, {"rating": 5.0, "review": "i love this thing.  My kids and I spent the first evening we used it binge-watching Kung Fu Panda and Penguins of Madagascar cartoons. So much fun, and easy enough that even I could set it up!! :)  WINNING!", "verified": true, "helpfulness": "0/0", "author": "J. Steiner"}, {"rating": 5.0, "review": "Love the Fire Stick.  Makes any TV a smart TV. \"Death is but a door. Wonderfully convenient and resourceful tool.  Best purchase!", "verified": true, "helpfulness": "0/0", "author": "Mahmoud"}, {"rating": 4.0, "review": "Couldn't be more happier", "verified": true, "helpfulness": "0/0", "author": "Anna Cohen"}, {"rating": 3.0, "review": "It's wonderful as we don't have cable, but it is glitchy.", "verified": true, "helpfulness": "0/0", "author": "Taylar"}, {"rating": 5.0, "review": "Great buy!!!", "verified": true, "helpfulness": "0/0", "author": "James Cook"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Patrick Guenthner"}, {"rating": 5.0, "review": "Quick easy set up and simple to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"luvs 2 shop\""}, {"rating": 5.0, "review": "Love this thing!!!  Now I just have to replace all my Chromecast units with these.", "verified": true, "helpfulness": "0/0", "author": "Robert Aguirre"}]