[{"rating": 1.0, "review": "Rarely works, other devices in the same house have no issues.", "verified": true, "helpfulness": "0/0", "author": "Chad Meyers"}, {"rating": 5.0, "review": "We loved our first one so much that we bought a second one.  It was absolutely a plug & play with our Samsung SmartTv's.", "verified": true, "helpfulness": "0/0", "author": "PatRonHelm"}, {"rating": 1.0, "review": "Very surprised that I didn't like this product. Seems very rushed. No app search function. UI is garbage for trying to find anything. The Search that they give you appears to be for shows across all apps except Netflix. Netflix app doesn't have a browse feature or a \"my list\". So I end up using my phone to find something I like and start watching it so I can find it under \"recently watched\". There is no power button so when it crashes or freezes you must get up and unplug it. And also when purchasing keep in mind that you will still need the stick plugged into the wall so have another outlet ready.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 2.0, "review": "Its okay, but I already had a first-generation Roku that performed many of the same functions that I wanted.  I had gotten the Fire Stick as a gift, primarily as it was marketed as supposedly having mirroring functions with my Fire HDX (so that I could send to TV thru Fire Stick; only to find out through various email contacts and Amazon tech reps, that MY Fire HDX is not compatible with mirroring.  Disappointing since I could not find any literature to state this  .", "verified": true, "helpfulness": "0/0", "author": "Eric B. Persson"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "patrick muir"}, {"rating": 5.0, "review": "Love, love, love it !!!", "verified": true, "helpfulness": "0/0", "author": "Sue Reed"}, {"rating": 4.0, "review": "A few glitches but mostly great.  Needs to be power cycled sometimes because it stops connecting to wifi.  Doesn't remember Netflix account credentials when the TV is the power source for the stick.  But otherwise a great device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Yes - love it - wanted it primarily to access my Netflix account - looking forward to exploring other features.\\", "verified": true, "helpfulness": "0/0", "author": "Dianna"}, {"rating": 5.0, "review": "Arrived on time.  Extrememly easy to install-instructions were easy to understand and accurate.  Works just as advertised.", "verified": true, "helpfulness": "0/0", "author": "Kay"}, {"rating": 1.0, "review": "my first venture into streaming media devices. I was completely dissatisfied in the Amazon Fire TV Stick. I immediately realized I did not care for the \"way too small remote\". also, I immediately realized I did not care for the on screen menu nor its functions. and it seemed everything offered revolved around Amazon Prime!to further my disappointment, as I moved thru the on screen menu, in several cases, the screen froze up on me. also the Fire TV Stick got very \"hot\" while plugged in to my HDMI port...........now there is nothing wrong with my TV or my Wi-Fi cable connection.very simply....I did not like it!I returned this Amazon TV Fire Stick back to Best Buy where I had bought it. now i have done a lot of research or investigation on streaming media devices...rather than exchange for another Fire TV Stick to see if it might work better. I decided to go for the ROKU 3!the ROKU 3 works perfectly. as of now I am very happy with the ROKU 3 in every way. to me there is no comparison what so ever between the two. the ROKU 3 blows away the TV Stick in every way!", "verified": true, "helpfulness": "0/0", "author": "john f. clifford \"clark case\""}]