[{"rating": 4.0, "review": "Have had my Fire TV Stick for about a week. I do love it. It's got a crisp, clear image. I can stream my American Horror Story purchases (Can't do that with the Chromecast and Wii streaming is fuzzy).Seems like a great little tool. The other night I turned on the TV and it the Fire TV Stick wouldn't power up, so I just used my Chromecast, and the next night the Fire TV Stick was fine.Glad I jumped on the $19 deal. Worried that I might lose the tiny little remote though and there's no app for my iPhone yet.Only one complaint- HBO Go is an optional app in the stick, BUT not if you are a Comcast/Xfinity customer, which kind of stinks. I have to use the Go app on my iPhone and stream it through my Chromecast, which is a little annoying.", "verified": true, "helpfulness": "0/0", "author": "MomTo2"}, {"rating": 5.0, "review": "This is an awesome product! I have 4 TVs in my house. 2 Google Chrome, 1 Roku 2, 1 Apple TV and now 1 Fire TV Stick. I can tell you the remote control is pretty cool. Some people prefer to control from their phone, but since I have found my iPhone 6 gets stuck at least once per day with the Chromecast, being able to manage with not phone is pretty good. Quality and Speed is amazing and the UI is really good. I can do a search and will send me to the streaming service that has the content and you can go from there. Highly recommended. BTW, I also have Netflix, Prime and Hulu.", "verified": true, "helpfulness": "1/1", "author": "LGuiriga"}, {"rating": 1.0, "review": "I do not like this product.  I will not sink with my router and can not find a help number to call.  It is a good thing it was received as a gift so MY money was not wasted.  I will not recommend this product to anyone.", "verified": true, "helpfulness": "2/5", "author": "Roger Blanton"}, {"rating": 4.0, "review": "Good.Met our expectations. Different in the beginning but little by little we are learning. Still sometimes we miss to review the movies.", "verified": true, "helpfulness": "0/0", "author": "Ketty"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "petra vinas"}, {"rating": 1.0, "review": "It loads very slowly if you don't have super fast internet. We thought this would be our solution to no cable access where we live, it was not. Our kindle can load fine but it takes days to load on the tv fire stick", "verified": true, "helpfulness": "2/4", "author": "Kindle Customer \"I love to read, and listen.  I listen to all types of things as well: fiction: romance, thriller, mystery; non-fiction: biographies, leadership, etc\""}, {"rating": 5.0, "review": "Amazing.  Everyone should have one!", "verified": true, "helpfulness": "0/0", "author": "Edward N. Schweitzer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "greg dumorne"}, {"rating": 1.0, "review": "The Fire TV Stick was easy to set up and I like the interface. It's about as navigable as Apple TV. I don't like the separate power supply - the \"wall wart\" is small but it's still a separate power supply. The Fire Stick worked great for the first few weeks but in the past week it has begun to lose the wifi connection and locking up on movies (Netflix). While watching one movie today, I rebooted the unit (unplugging its power supply and reconnecting) twice to get through it. For this alone give it one star since my Apple TV, Samsung Smart Hub, and other wifi-connected devices (iPad, iPhone, computers) aren't having any wifi woes.", "verified": true, "helpfulness": "3/4", "author": "New Castle K. \"Gadget Geek\""}, {"rating": 4.0, "review": "I have a modern, Internet-enabled TV... but I also have an early, first-generation 24\" Sharp digital TV that has HDMI inputs, but no Internet capability, and that's why I bought a Fire TV Stick. The good news: The Fire stick not only works better than my Roku box, it's better at streaming digital content than my 55\" LG TV. I've had many problems streaming Amazon content with my LG, but the Fire Stick seems to handle it effortlessly, with no waits while the TV stops and fills the buffer again. All in all very well engineered product. But it does have a few flaws. As others have noted, the small size is a bit misleading, as the Fire Stick needs an external USB power supply- which is included.The bigger problem is that it doesn't work with my Sharp old TV. It took me a while to figure out that there was an incompatibility problem, and that I wasn't just dealing with a defective Stick. After a half hour of restarting, plugging and unplugging, changing batteries and pushing buttons, I switched TVs... and it started up right away. So while it's a great unit, be aware that it may not work with your older TV. Having an HDMI input is no guarantee of compatibility.Two month update:I have been very pleased with the performance of the Fire Stick for the past two months. It's far better at streaming Amazon video than is my Internet-ready LG TV- no pauses for buffering, sound synch errors, etc- and better at You Tube and Netflix streaming, too. It works better than the Roku boxes I've owned in the past, too. But tonight it suddenly quit working after only two months. I put in a warranty repair/replacement request, and I'll report back here how long it takes to get a replacement.", "verified": true, "helpfulness": "1/1", "author": "Michael J. Edelman"}]