[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rickena Benning \"Book-a-holic\""}, {"rating": 5.0, "review": "This is the best 30 bucks I ever spent!! Heck I couldn't even go to the movies with my husband for that amount yet with the fire stick I can watch pretty much any show or movie anywhere at home or on the go...and this is the best part....totally free!!! Its not just hulu and netflix either. Instead of having to do individual searches on hulu or netflix or any other movie/tv site, I can simply click and search all sites at the same time for whatever movie I had in mind and the fire stick device takes me right to whichever app has it. Lets not forget the free video games for the kids...again at home or on the go....and then we also have the cloud built right in!!! This is like a memory stick all jacked out with the best of everything.  Once we got this lil piece of heaven we didnt even need our cable anymore. We have everything we could ever want to watch...when we want it and where we want it...all built into this amazing lil stick. You rock amazon!!!!!", "verified": true, "helpfulness": "0/0", "author": "Dr. Andrew byrne"}, {"rating": 4.0, "review": "Great price.  Easy install.  Slippery n small remote.", "verified": true, "helpfulness": "0/0", "author": "Goggie Guru"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "yvonne"}, {"rating": 5.0, "review": "Good product. Requires more.bandwidth than I have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very happy with it", "verified": true, "helpfulness": "0/0", "author": "Philippe Eustache"}, {"rating": 2.0, "review": "I have the stick but only works all the programs in the united states, why the advertisment say that?", "verified": true, "helpfulness": "0/0", "author": "Richi"}, {"rating": 5.0, "review": "The  Amazon Fire TV Stick is great and I love it because it gave me a full picture with total control remote on HDTV. I was usingmy conputer plug in to HDTV and the picture was narrow and the sound hummed. Also I didn't have the control I have now. I wastedmoney on monitor cable and didn't get the results I get with the Fire Stick. This thing is amazing and It made my HDTV in to a smart TV.Thank you and thank you again. M. Hager", "verified": true, "helpfulness": "0/0", "author": "M. Hager"}, {"rating": 5.0, "review": "Great deal", "verified": true, "helpfulness": "0/0", "author": "Peter Galvin \"Pete G\""}, {"rating": 5.0, "review": "Amazing little piece of technology.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Karen Creech"}]