[{"rating": 4.0, "review": "Seems like there are several reviews of the product already so i'll keep this short. My review is more on the FireTV stick Vs Roku Stick. I have the regular fireTV as well and the user interface / GUI is almost identical. the FireTV and the FireTV Stick looked very smooth when navigating through the menus. Its actually hard to tell the two apart based on the user interface. I use PLEX heavily on both the FireTV stick and the Roku Stick. I think this is  where is where the FireTV Stick falls a little short of the Roku stick. I am able to stream uncompressed 1080p bluray mkv using the Roku Stick. On the FireTV stick, I cant. it starts to stutter. I also tested using a 2.4ghz wifi (which was literally right next to both the Roku Stick and the FireTV stick) and a dual band 5ghz wifi access point. The only time I can stream the 1080p uncompressed mkv file smoothly on my firetv stick is if I put the 5ghz wifi access point i have right next to my FireTV stick. I tried streaming that same uncompressed 1080p mkv using a 2.4ghz accesspoint and it couldnt keep up even if the access point was right next to the FireTV stick. I am however able to stream other 1080p MKV's thats been compressed to about 10 to 15gb to my FireTV stick with out a problem. On the other hand, the Roku Stick was able to stream ALL my 1080p mkv's with no issues. uncompressed, compressed, on 2.4 ghz or on 5ghz. i'm guessing it the Roku stick does a better job at caching / buffering the videos..Hope this helps others out who intend to use PLEX to stream mkv videos to their FireTV stick", "verified": true, "helpfulness": "3/4", "author": "Charlie C"}, {"rating": 5.0, "review": "I love it!  Easy to configure.  Easy to use.  The Android app works great.  Very glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Aaron Champagne"}, {"rating": 3.0, "review": "Amazon fire TV stick is better than Chromecast in many ways. The wireless is fast, almost bluray quality HD videos.Though, the description says free Netflix membership for eligible customers, let me clarify, it has nothing to do with Amazon. You have to register to Netflix with an account which was never activated before. Same for Amazon prime. You won't get any promo code to be used for your existing Netflix account to get 30 days free membership.The android based voice search works as expected, android based remote works great too without any lag.", "verified": false, "helpfulness": "0/2", "author": "SdS"}, {"rating": 5.0, "review": "It slow to boot up on the initial start up, but after that it works flawlessly.", "verified": true, "helpfulness": "1/1", "author": "NYCeltics24"}, {"rating": 5.0, "review": "Worked right out of the box.  Somehow it already was configured with our account information (we have Amazon Prime)  or figured it out from our IP address- I am not sure how it knew.  But the access to Amazon content was immediate. The interface is a lot cleaner and faster than found in net-enabled appliances.  That was my original impetus to purchase the unit and I was pleased with the results.", "verified": true, "helpfulness": "0/0", "author": "Cory Momany"}, {"rating": 1.0, "review": "Not user friendlyYoutube app hangsPoor wireless connection", "verified": true, "helpfulness": "0/1", "author": "rc"}, {"rating": 5.0, "review": "super!", "verified": true, "helpfulness": "0/0", "author": "marie"}, {"rating": 5.0, "review": "My only disappointment,  I should have ordered more when they were on sale!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fastest streaming stick I've seen hands down.  Menus fly by as fast as you can click the remote.  I have a Roku Stick as well and it's going to be handed down to someone because the Fire TV Stick blows it out of the water.  I'm thoroughly impressed!  Plex works great, Netflix works great, haven't met any stuttering video or choppy sound.  It's amazing they have this kind of processing speed in such a small streaming stick.  Comes with a power adapter and a 2-3\" HDMI extension dongle so that the Fire TV Stick isn't sticking straight out of the back of your TV if it's wall mounted.  Near-perfect device!  Don't bother with the other streaming sticks out there, this thing will blow them away.", "verified": true, "helpfulness": "1/1", "author": "Spliner"}, {"rating": 4.0, "review": "Very Easy to set up and use! I Love it! The only reason I gave it 4 stars is because it doesn't have HBO GO yet..but hopefully soon.", "verified": true, "helpfulness": "0/0", "author": "Sara Mason"}]