[{"rating": 5.0, "review": "We are cutting our cable and already had Netflix and Amazon Prime.  I bought this for a TV that was not a Smart TV.  This works great, and where our Smart TV buffers quite a bit, there are no buffering issues with the Fire Stick.  I have just ordered a 2nd one for the Smart TV.  Best purchase I've made in quite some time.", "verified": true, "helpfulness": "0/0", "author": "Mellie2u"}, {"rating": 5.0, "review": "It is a new experience and I like it.", "verified": true, "helpfulness": "0/0", "author": "Blaise J. Lombardi"}, {"rating": 1.0, "review": "It doesn't connect as awesome as it advertises.:(", "verified": true, "helpfulness": "0/2", "author": "Ryan Moulden"}, {"rating": 5.0, "review": "I purchased the TV stick because I use my instant video on another TV without using a game console. Very easy to setup and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Maureen"}, {"rating": 5.0, "review": "Delivered when stated, easier to connect than a dvd player with unlimited selections of different gendre... I'd recommend the fire stick to anyone who wants to save a bundle on cable bills!", "verified": true, "helpfulness": "0/0", "author": "TheColonel"}, {"rating": 1.0, "review": "Did not have enough range. Trying to return it.", "verified": true, "helpfulness": "0/2", "author": "Nabeen Hussain"}, {"rating": 3.0, "review": "Only some apps are free...wish more was free.", "verified": true, "helpfulness": "1/1", "author": "dave leite"}, {"rating": 5.0, "review": "It is so easy and nice to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I got this as a result of pre-paying for 3 months of SlingTV as Sling TV was not available on xbox at the time. There is nothing this device does that the combination of my Xbox and AppleTV do not do. However if you don't have one of these devices, the Fire TV Stick may be a decent option for you. I found the interface to be worse than other streaming devices but since I only use this for Sling TV that didn't bother me much.There seems to be some sort of timer that I haven't figured out how to turn off. While watching TV for a few hours or so the Fire TV stick will decide to activate its screen saver even though I am using the device. Sometimes the app would crash which would be extremely annoying if I was watching a game.Please note that this review is coming from somebody who already owns multiple streaming devices and had no real need for this one.", "verified": true, "helpfulness": "0/0", "author": "Phillip Pennington"}, {"rating": 4.0, "review": "Only thing I did not like is that I couldn't make Netflix my home page - besides that I like it.", "verified": true, "helpfulness": "0/0", "author": "Rachel Wallace"}]