[{"rating": 5.0, "review": "so many things to do with such a little device, amazing!!", "verified": true, "helpfulness": "0/0", "author": "Chun H Tein"}, {"rating": 3.0, "review": "This is a good product if you're looking to take advantage of Amazon Prime instant videos on your TV (especially if you don't have a smart TV).  I don't want to knock it as a product, but I just think it could have been done a little better.  The interface works well, but can be tasking to navigate through all the options.  The biggest annoyance is the remote it comes with.  It's small and easy to misplace and the buttons seem unresponsive at times requiring multiple presses before the stick seems to get the message.There also seems to be some lag/buffering issues at times with the wireless.  I have a very strong connection as my wireless router is maybe 20 feet away from the Fire Stick, yet there are many occasions where I see buffering that I don't see when compared to using my Netflix app on my Chromecast.  Overall it's a pretty solid device, but could use a better remote and perhaps better internet connectivity.  I'm sure the Amazon Fire TV box probably works much better in those areas, but costs nearly 3 times as much for basically the same services.", "verified": true, "helpfulness": "0/0", "author": "CAL_08"}, {"rating": 5.0, "review": "I like this item.", "verified": true, "helpfulness": "0/0", "author": "Antonette Appling"}, {"rating": 5.0, "review": "Works very well.  Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Sybil M. Goodman \"Thunder fan\""}, {"rating": 4.0, "review": "Firestick performed well.nothing fancy but easy to use.I would recommend.", "verified": true, "helpfulness": "0/0", "author": "steve patterson"}, {"rating": 5.0, "review": "Easy hookup & good customer interface. Great way to take advantage of Prime benefits!", "verified": true, "helpfulness": "0/0", "author": "HOLLI  MCKINNEY"}, {"rating": 5.0, "review": "It's fantastic! !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "NIce, it makes accessing Net Flix so much better.", "verified": true, "helpfulness": "0/0", "author": "Patrick McGowen"}, {"rating": 5.0, "review": "I love it !!!", "verified": true, "helpfulness": "0/0", "author": "Theda Moore"}, {"rating": 4.0, "review": "Works great but the newer movies are at a cost that are not all that cheap. For older movies it is fine, and netflix is not a smooth stream have to have a good WiFi.", "verified": true, "helpfulness": "0/0", "author": "Gordie"}]