[{"rating": 1.0, "review": "I was able to set it up, but after a few minutes it started to stick and it does that a lot, I get very frustrated when I put it on so I don't use it anymore.", "verified": true, "helpfulness": "2/3", "author": "shelly"}, {"rating": 4.0, "review": "We had a problem initially with the audio. Amazon walked us through a quick fix and are working on a permanent solution we were told in approximately two weeks. We were told it was a soft-ware issue which has been reported by others also.", "verified": true, "helpfulness": "0/0", "author": "Lois C. Kirby"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Linh Nguyen"}, {"rating": 2.0, "review": "So so used better not bad foe 25.00 that's all its worth", "verified": true, "helpfulness": "0/0", "author": "george"}, {"rating": 4.0, "review": "It's great...easy to use and set up...", "verified": true, "helpfulness": "0/0", "author": "Tripp Rogers \"Radiodude\""}, {"rating": 5.0, "review": "Awesome device. Wish I had bought two.", "verified": true, "helpfulness": "0/0", "author": "Brian C."}, {"rating": 5.0, "review": "Got it on sale at best buy for 25 bucks and it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Ramos"}, {"rating": 4.0, "review": "Netflix through my receiver is crystal clear, quality is on par or better than bluray - 1080p sharp, Dolby Digital II plus sound.I tried to play two racing games - super choppy and unplayable, maybe the CPU is too weak. On comparison games on the Fire TV /not the stick/ are with PS3 performance.Wi-Fi is stable, it takes around 20 seconds to start the device upon power up, there are numerous software apps and channels for media consumption. Interface is not bad, but not great either - quite puzzling, with HEAVY emphasize on Amazon media purchases...It is an OK device in general, I would not buy it again though, in my opinion is worthless unless you want Amazon video and quality Netflix streaming.", "verified": true, "helpfulness": "0/0", "author": "Ananke"}, {"rating": 5.0, "review": "Amazing! Great device and easy hookup!", "verified": false, "helpfulness": "0/0", "author": "Derek M."}, {"rating": 4.0, "review": "Works good, the remote could use a little help...not as good as the remote for my Roku.", "verified": true, "helpfulness": "0/0", "author": "Jose Limon"}]