[{"rating": 5.0, "review": "It was a little hard to set up, I think because I need a new router, but when I got it set up and figured all the apps out that needed downloaded, it worked great. I am very happy with it.", "verified": true, "helpfulness": "0/1", "author": "Linda P. Harris"}, {"rating": 5.0, "review": "If you have prime, Wi-Fi and a TV then buy this today. You already paid for the free movies why not what then on your big screen.", "verified": false, "helpfulness": "0/1", "author": "Bill Reviews"}, {"rating": 5.0, "review": "I had some misgivings when I saw how simple the remote looked - almost like a kid's toy. While I went on-line to read the instructions, my husband got everything set up. We have some familiarity with tech products (computer, cellphones, tablet) but I found it easy to get the hang of using the product, finding it pretty intuitive. It's opened up a wonderful alternative to cable without the high price.", "verified": true, "helpfulness": "0/1", "author": "Tina"}, {"rating": 5.0, "review": "Beautiful picture and awesome quality!", "verified": true, "helpfulness": "0/1", "author": "Kristin"}, {"rating": 5.0, "review": "I didn't think I would like it, but I have been pleasantly surprised with how muck I do enjoy it.", "verified": true, "helpfulness": "0/1", "author": "John H. Barr"}, {"rating": 5.0, "review": "I wasn't sure what to think about this when ordering, but after using it, I love it!  We don't have satellite/cable service in our younger children's bedrooms or on my TV at my office.  We simply use DVD players to allow them to watch movies.  Now, I can use this and they can watch some more of their favorite shows or movies, without the added cost of the extra DVR boxes or paying for service at my office!  You definitely need a good internet connection, as it streams via the internet, but it's definitely worth the investment.  I love the portability of it, as well!  I take it from home and to work, so it can be used in both places.  I've only had it for a few days, now, but so far it's been great and I'd definitely recommend buying it!", "verified": true, "helpfulness": "0/1", "author": "Marie V. Carter"}, {"rating": 5.0, "review": "Best thing ever!", "verified": true, "helpfulness": "0/1", "author": "alpo"}, {"rating": 3.0, "review": "I was torn between buying the Fire Stick or Roku. I bought the Fire Stick because I could get a free Roku Stick with my Sling TV subscription. I love Amazon products and their whole shebang but the Stick seems to be lacking. There should me more apps available than what they have. I know I have to mess around with it some more, but for 40 bucks I am not impressed.", "verified": true, "helpfulness": "0/1", "author": "Bryon"}, {"rating": 5.0, "review": "So easy to setup, the apps, games all seem pretty easy to use.  Its nice you can be on Amazon and also send apps to the device.", "verified": true, "helpfulness": "0/1", "author": "JoeSkate"}, {"rating": 5.0, "review": "Smartest media player purchase I've ever made.", "verified": true, "helpfulness": "0/1", "author": "Motenai Ronin"}]