[{"rating": 5.0, "review": "I've had this for a couple of days now. Easy set up and sync with the wireless.  So far so good", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 4.0, "review": "My first product of this type, Works well for me. Takes some practice using buttons. Get Prime if you plan to use it for movies. I wish it had access to TED content.", "verified": true, "helpfulness": "0/0", "author": "john97202"}, {"rating": 5.0, "review": "I was watching shows within ten minutes of opening the box. It works as advertised and is very easy to navigate through the menus. My only negative is that the app store isnt really what I took it to mean. Overall it's well worth the $40.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "sound is not up to snuff I was impressed with the simple easy installation.ilike the watch list feature.", "verified": true, "helpfulness": "0/0", "author": "James Trier"}, {"rating": 1.0, "review": "thats crazy! I cannot open battery cover!!!! I don't want to use remote,okay? I just want to use fire tv. What's your remote design?", "verified": true, "helpfulness": "0/0", "author": "Carven"}, {"rating": 5.0, "review": "I'm enjoying it but I wish the printing was larger on the screen where PRIME is written above the movie", "verified": true, "helpfulness": "0/0", "author": "Judy Antonelli"}, {"rating": 5.0, "review": "I wanted to get Prime access on TV and this does work for me.  Internet is lost occasionally and I just remove stick a few seconds and it returns.  I use HDMI extender sent in box and helps with staying connected.  Package intact and easy to open.  Several apps to choose from and enjoying those too.", "verified": true, "helpfulness": "0/0", "author": "KM"}, {"rating": 5.0, "review": "This is a great product.", "verified": true, "helpfulness": "0/0", "author": "Hubert Preston Davis"}, {"rating": 5.0, "review": "I love this device.  so simple to use and gives me access to Netflix and other aps on my TV through the HDMI port.  For the price it is AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "Sharon Gregory"}, {"rating": 3.0, "review": "Works fine.  Wish there was a better Amazon Prime selection.", "verified": true, "helpfulness": "0/0", "author": "Sally W"}]