[{"rating": 3.0, "review": "WiFi, buffering issues due to low memory and bloated preloaded apps", "verified": true, "helpfulness": "0/1", "author": "Eric H."}, {"rating": 5.0, "review": "Great especially if you don't have a smart TV. Love the fact that it has a remote control but if you misplace it you can use the app to control it. You definitely need to be a prime member to make the most of it.", "verified": true, "helpfulness": "0/1", "author": "Brooklyn79 \"Ricardo R\""}, {"rating": 5.0, "review": "Worked like they said.", "verified": true, "helpfulness": "0/1", "author": "Martin Pitsitck"}, {"rating": 5.0, "review": "Not sure don't know how to use it", "verified": true, "helpfulness": "0/1", "author": "june  heefner"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/1", "author": "dk"}, {"rating": 5.0, "review": "Bought this on Prime Day with a deep discount.  Extremely easy connection and set-up and adds tons of access to a non-smart TV.  I'm on a 30-day trial Prime membership and the free Prime Instant Video sealed the deal.  I'll be buying a full membership for sure.We have a smart TV in the living room but this makes our second set so much more useful.  Navigation through Amazon and non-Amazon apps is easy enough.  A full keyboard would be nice for searching titles but at this price-point that's an unreasonable expectation.If I was a gamer, I'd look for a more high-end device.  This fits my needs nicely, for streaming video.", "verified": true, "helpfulness": "0/1", "author": "Mick"}, {"rating": 1.0, "review": "I have time to write this review while I restart my Fire TV stick for the third time in 10 minutes. It is tough to watch anything when the device drops the wireless network frequently. No matter what I do this keeps happening and Amazon has no solution.We have two Roku boxes that never fail. I would rather pay for a Roku than accept a free Fire TV Stick.", "verified": true, "helpfulness": "1/2", "author": "bwholst"}, {"rating": 5.0, "review": "Best ever investment", "verified": true, "helpfulness": "0/1", "author": "John E. Varga"}, {"rating": 4.0, "review": "I love it! The only downfall to me is how to get to music stations.", "verified": true, "helpfulness": "0/1", "author": "nurseynurse88"}, {"rating": 4.0, "review": "Very good.  A little bit slow once you add many apps.", "verified": true, "helpfulness": "0/0", "author": "Enmanuel"}]