[{"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Edward N Collins"}, {"rating": 3.0, "review": "Having trouble connecting to a wi fi extender", "verified": true, "helpfulness": "0/0", "author": "Stephen Coccarelli"}, {"rating": 5.0, "review": "Yes it worked easily, instructions are very simple. I just had a little difficulty to open the battery compartment, but finally I opened it.", "verified": true, "helpfulness": "0/0", "author": "Eduardo Saleh"}, {"rating": 1.0, "review": "This thing buffers more than it played video. Returned it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!! Great product and great price. Wasn't priced as promised with the \"Amazon Prime Day\" pricing so I had to pay full price for it but still a great product.", "verified": true, "helpfulness": "0/0", "author": "Vito Pecoraro"}, {"rating": 5.0, "review": "Gee", "verified": true, "helpfulness": "0/1", "author": "Charles Miciotto"}, {"rating": 5.0, "review": "I am not a heavy user of Fire TV Stick, but I have been satisfied with it.I use the stick on the opposite end of the house from our ISP provided router w/ wireless. Needless to say, it is not the strongest.The stick has worked as well if not better than my older Roku I use on with an older TV and RCA type connections.As a non-power user, I would not personally say Fire TV is better or worse than Roku, both have been satisfactory for my use watching Amazon Prime and YouTube.Primary use: Amazon Prime/Instant video and YouTube, occasional Plex streaming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 5.0, "review": "This was easy to set up, and the menu is intuitive. I have not yet tested this in a hotel, which was one of the reasons I chose this unit as it is supposed to be able to work on hotel systems. meanwhile, does what it says it should.", "verified": true, "helpfulness": "0/0", "author": "Tom Paine"}, {"rating": 5.0, "review": "I love amazon fire stick", "verified": false, "helpfulness": "0/0", "author": "Karla H"}]