[{"rating": 5.0, "review": "I have a brand new Samsung smart TV with Amazon Prime app included.  I also have high speed fiberoptic Fios service (75/75) and a strong wifi signal.  Therefore, I should not have needed the Fire TV stick.  Unfortunately, the smart TV does not stream well through the apps for reasons I do not understand.  I was able to log in and even start watching shows, but it was very choppy.That lead me to purchase the Fire TV stick, hoping that because the stick is plugged in it would boost my signal.  The answer is YES, it did work, and now I can watch Fire TV with an outstanding picture and no delays.  Very easy to set up, the remote works well, and overall I am very happy.  Although I should not have had to pay $39 given that I bought a smart tv, it's not amazon's fault, and this product is worth every penny. 5 Stars.", "verified": true, "helpfulness": "0/0", "author": "One Man's Opinion \"Scott in Tampa\""}, {"rating": 5.0, "review": "I love it! Before the fire stick, I had to connect my laptop to tv. What a pain. There is no learning curve at all. Streams great without interruption. So glad I made this purchase. I was able to get it for the lower price when Amazon was running  its promo for prime customers", "verified": true, "helpfulness": "0/0", "author": "Jo"}, {"rating": 5.0, "review": "I really like the Fire Tv Stick. It's easy to use and has everything on it my family likes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "User interface is just ok.  I would reccomend the roku products over this.  pretty lackluster in my opinion, with the (naturally) heavy focus on amazon prime television, and making the other apps a secondary part of the product that don't seem to be very well supported... Twice in the 2 months of use I had to completely reinstall the netflix app which just stopped working, and I think I had to resign into it 4 times as well... also on that subject, (as of 1/1/15) there are also still some apps that have not made it to the fire TV yet that I use, such as simpleTV, making it hard to use this product daily.After 2 months I demoted it to guest bedroom tv duty, never to be seen again by my eyes.", "verified": true, "helpfulness": "0/0", "author": "E. Johnson"}, {"rating": 4.0, "review": "Fire stock works great, padrino with my iPhone doesn't work at all. The phone wont see the fire stick", "verified": true, "helpfulness": "0/0", "author": "Ron Martinez"}, {"rating": 5.0, "review": "I bought one of these for my husband for Christmas because he had been talking about buying a SmartTV.  I thought this might be a cheaper option.  It turned out that that the Fire Stick met all our expections. In fact, a month later I got one for my birthday so I could enjoy it on my TV!", "verified": true, "helpfulness": "0/0", "author": "Phyliss"}, {"rating": 1.0, "review": "Bought this back in October. When it first came it was amazing for about a month. Than as time progressed it seemed to drop the signal. When trying to watch Netflix I would get an error message about my connection. I would back out and go back to Netflix only to get a totally different error message. Now for the last month Hulu and Netflix skip or freeze. It's so annoying. Sometimes it signs me out of the apps and I have to sign back in through the websites. Again annoying.If you ask me, coming at you about this product from the future, I would skip this purchase. Buy a media player over this. Don't waste $40 on something that is only going to work sometimes.I also added a video so you can see what it does. So annoying.", "verified": true, "helpfulness": "3/4", "author": "Meigz"}, {"rating": 5.0, "review": "The best gift I could have ever bought for myself. I love it! It took less than 5 minutes to install.", "verified": true, "helpfulness": "0/0", "author": "Odette"}, {"rating": 5.0, "review": "Very good purchase . Quite easy to use . I am very happy with it .", "verified": true, "helpfulness": "0/0", "author": "Deb Chickering"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Freida"}]