[{"rating": 4.0, "review": "It works!  The Amazon Prime Videos app works as well as the Amazon App on my Roku.  This is a WiFi only device, I have good WiFi at home and it works without any glitches.  I can't say how well it will work in a hotel room w/crappy WiFi.  But, I'm anxious to try it on my next trip.  My nephew says he likes it way better than his Chrome stick.If it works as well in hotels, I'll bump this to 5-starsIf you don't have Amazon Prime, I'm not sure I'd recommend this, but for the price, it's still a bargain.  Depends on how you plan on using.  You get what you pay for, The Roku & ATV are more full featured, more apps, ethernet; but, there're also more for an entertainment center setup.  The Fire Stick is pocketable for travel, use in many places.", "verified": true, "helpfulness": "0/0", "author": "Gadget Freak"}, {"rating": 3.0, "review": "It's a bit misleading because the unit has to be plugged into an outlet at all times when in use.  Other than that, no complaints.", "verified": true, "helpfulness": "1/1", "author": "Sabrina B"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Liz L"}, {"rating": 5.0, "review": "excellent product! fast shipping! great communication! asset to amazon! thank you!", "verified": true, "helpfulness": "0/0", "author": "Kerry Bardell"}, {"rating": 5.0, "review": "Solid unit. Very simple to set up. Smooth streaming. I have not found any CONS that have anything to do with the unit itself.My only problem has been with MY Cable Service Provider: Comcast/Infinty.They don't allow access to many of the Apps available on the Firestick. (History Channel, Showtime, etc.)Since you pay for these thru your Cable Service Provider, when you try to access these apps, they ask you to sync/activate with your service provider via computer. There's a large list (drop down menu) of service providers. Unfortunately, Comcast/Infinity isn't one of them.Again, not an Amazon problem ... I blame Comcast.But if you are a Prime Member, you can't go wrong with this item. My library comes right up. The remote is simple yet effective.", "verified": true, "helpfulness": "4/4", "author": "Wink \"Wink\""}, {"rating": 5.0, "review": "Turns your TV into a smart TV and saves a ton of money.  Awesome for when I travel too because it is so small.", "verified": true, "helpfulness": "0/0", "author": "Brandon Schoeppner"}, {"rating": 5.0, "review": "Amazingly easy and fast to setup, will be buying more soon.", "verified": true, "helpfulness": "0/0", "author": "Jason Clark"}, {"rating": 5.0, "review": "Wee were so stoked to get this, since we've been Prime members for years, but, since our Clearwire High Speed is so insanely slow, ( when it actually works) we simply cannot use this module yet, we need a faster connection, thank goddess we're changing providers asap, can't wait to try it!!", "verified": true, "helpfulness": "0/0", "author": "salmonking"}, {"rating": 5.0, "review": "Pre ordered this when it was on sale for Prime members.  Best $19.99 I ever spent!  Hubby loves it and we are excited to watch our AIV on our big screen.", "verified": true, "helpfulness": "0/0", "author": "Love My Amazon"}, {"rating": 5.0, "review": "Love it, works great!", "verified": true, "helpfulness": "0/0", "author": "HowDo"}]