[{"rating": 5.0, "review": "Kids love it", "verified": true, "helpfulness": "0/0", "author": "Hahn"}, {"rating": 4.0, "review": "Not as zippy as some claim. Great for $19.99, but not $40. Voice control dicey, as you still have to click OK to launch request. Seems to be an Amazon-o-tron machine for all things Amazon. Does not remember for long, pairing with the Amazon bluetooth controller. A lot of unexpected extra costs for apps and services. But otherwise, a potentially great value.", "verified": true, "helpfulness": "0/0", "author": "Madfranklin"}, {"rating": 1.0, "review": "VERY Disappointed with this product.  Remote would not work properly, even after changing the batteries.  Wifi kept disconnecting, even with a strong signal.  There's a reason why Apple products are twice the price - they work!", "verified": true, "helpfulness": "1/1", "author": "M. Fox"}, {"rating": 5.0, "review": "The stick allows for HD watching of prime which the apple TV was struggling with.Android app lets you voice search for videos which is slick.", "verified": true, "helpfulness": "0/0", "author": "w"}, {"rating": 5.0, "review": "I love this thing.  I bought it during the initial promotional launch targeted at Prime members.  I paid half price and I use this all the time.  Much better than my Chromecast since it doesn't require screen casting from my laptop and it has many more built in apps.I use it to access Espn to Go, Amazon Prime Videos, my Amazon Music, my prime photos, Netflix, and much more.  I would recommend this to anyone who wants a steaming device, especially those who have Amazon Prime memberships.", "verified": true, "helpfulness": "0/0", "author": "Pewaukee Ironman"}, {"rating": 4.0, "review": "Nice product.  Sometimes it takes a while for the TV's HDMI port to reconnect once the T.V. is off.  The games are mediocre.", "verified": true, "helpfulness": "0/0", "author": "A.L.Shep"}, {"rating": 4.0, "review": "Works well, but pushes Amazon streaming services way to hard. I'm a prime member who also has Netflix and Netflix is pretty much all I use. The UI of the firestick is beautiful, but it only focuses on Amazon content.Of course, none of this comes as a surprise since its an Amazon branded device but unless you LOVE Amazon streaming services you're probably better off getting a Roku.", "verified": true, "helpfulness": "0/0", "author": "Mark Twain \"Tony\" \"Tony\""}, {"rating": 5.0, "review": "easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Kimberly Burts"}, {"rating": 5.0, "review": "Love it! Wasn't sure what to expect since the stick is lower specs but it has been as awesome as my fire tv, absolutely recommend this!", "verified": true, "helpfulness": "0/0", "author": "Paddle Geek"}, {"rating": 2.0, "review": "tried to watch netflicks but the sound was really bad . If I went through my smart tv it was OK??", "verified": true, "helpfulness": "0/2", "author": "Bobby B"}]