[{"rating": 5.0, "review": "Getting this stick inspired me to get a GaiamTV subscription because it was featured on only the Fire Stick! I've never been so healthy since, and I absolutely love all the features on the stick. I also have AppleTV. I find that the Fire Stick tops AppleTV with all of the available apps. Redbull TV I noticed popped up on there, Pilates apps, GaiamTV, there's so much! Now, if I could just figure out how to \"AirPlay\" on to my fire stick using my iPad 😁", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 1.0, "review": "So far, i have not been able to play anything through it, but it for my girlfriend and every time we give it a chance, it fails.", "verified": true, "helpfulness": "0/0", "author": "Luis Acevedo-Cervantes"}, {"rating": 5.0, "review": "Best thing to get if you have cable wifi, get rid of the extra boxes and finally start getting your $ back from the Cable Companies!!!", "verified": true, "helpfulness": "0/0", "author": "Christopher Fay"}, {"rating": 5.0, "review": "Set up was a breeze... Easy to use... Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I am highly disappointed with this purchase. I bought it to stream MLB.com mostly as well as some other apps. It streams so slowly, pauses every 10 seconds to buffer. I have a chromecast the streams these same apps fine, I bought this because I liked the remote and user interface. Beware anyone who plans to watch MLB.TV with this, it does not run well at all", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 2.0, "review": "if u have a ps4 just get the App is the same thing", "verified": true, "helpfulness": "0/0", "author": "Jesus A. Espinoza"}, {"rating": 5.0, "review": "Excellent device!  Easy set up", "verified": true, "helpfulness": "0/0", "author": "Roy Webb"}, {"rating": 5.0, "review": "So easy to set up and the picture is so much better than my passTV streaming device.  Have only used a couple of times, but so far I am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Wixie J Skellett"}, {"rating": 5.0, "review": "I think it's great. I should take it camping when they give wifi", "verified": true, "helpfulness": "0/0", "author": "Lisa A. Haas"}, {"rating": 3.0, "review": "Great device, works great but installing the TVMC add on Application required manual intervention.  Once done it all works Great.", "verified": true, "helpfulness": "0/0", "author": "Lyudmila L Parker"}]