[{"rating": 5.0, "review": "More than met my expectations!  Easy to navigate and thoroughly enjoy the Prime videos and series!!!  Would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 2.0, "review": "I bought a fire TV stick for my husband at Christmas. Figured it would be nice for him to use on the upstairs TV as he always wants to watch something and it gave him a few more options. It sounded easy enough to install so when he said that it didn't work I thought maybe it was due to our internet being so great upstairs.Last week I finally got around to setting it up myself on our downstairs TV. It was easy enough to do I had a very good signal strength but it also showed 'Connected with problems'. No idea what that meant but I opted to carry on regardless. Anyhow sadly it was not to be. I would start to load a video and the next thing it would read 'Player Error - An internet connection is required...' or \"Network Connection Lost' and the most annoying one 'Slow Internet Connection'. I finally gave up but have since tried a few more times. Today being the latest. Not sure at this point if it's the Fire TV stick or if my internet is not what it might be. Maybe a combination of both. If I ever get it up and running I will add an update to my experiences. I'm still hoping for great things.", "verified": true, "helpfulness": "1/2", "author": "M. Kerr"}, {"rating": 2.0, "review": "The device works ok, however the primary reason I purchased it was because it supported Miracast. Unfortunately it only works from Kindle and android devices, you cannot use the fire stick from other devices which support miracast.So it's now another item on the \"big pile of hardware that didn't live up to its promises\".Fortunately it was cheap.", "verified": true, "helpfulness": "0/1", "author": "Larry Osterman \"Larry Osterman\""}, {"rating": 5.0, "review": "I haven't used it extensively yet, but it was very easy to install and set up, It was programmed with my user information from Amazon, so I didn't even have to mess with that part of setup. Browsing for content was fairly simple, and no issues with loading or watching TV/Movie. Well done.", "verified": true, "helpfulness": "0/0", "author": "William P Halvorson"}, {"rating": 5.0, "review": "This is a great device.  The best solution I've used for streaming.  I piece of cake to set up.  Much easier to use than our \"smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "George Devereux"}, {"rating": 5.0, "review": "I love my Fire TV Stick.  I also have a Roku Stick, but Fire TV Stick is faster.  It loads apps much quicker.I use it on my Guest/Exercise room TV and play Netflix and my PLEX movies and music on it.", "verified": true, "helpfulness": "0/0", "author": "R. Juarez \"Amazon Man\""}, {"rating": 5.0, "review": "Worked great right out of the box.  Easy setup.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Great product I bought one and then was so pleased I got another", "verified": true, "helpfulness": "0/0", "author": "Diana Brown"}, {"rating": 5.0, "review": "WOW!!!!  it is working great and i have already recommended it to a few people that do not have a smart tv.  great invention.", "verified": true, "helpfulness": "0/0", "author": "Nellie Lyle"}, {"rating": 5.0, "review": "Have only had it a couple of days but have really enjoyed it so far.", "verified": true, "helpfulness": "0/0", "author": "Patricia Campbell"}]