[{"rating": 1.0, "review": "Very disappointed, lost money.After I configured WIFI connection correctly, I could not make it work, just says: \"We are not unable to connect to Amazon services. Please check your Internet connection or try again later. [Go to Network Settings]. I feel cheated! Do not waste your money!", "verified": true, "helpfulness": "0/0", "author": "Edwards Ortiz"}, {"rating": 5.0, "review": "HI, VERY satisfied with my orders, thanks very much", "verified": true, "helpfulness": "0/1", "author": "Maria Cabral"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 5.0, "review": "The simplicity of the Fire Stick is a joy.  Remotes have become absurdly complicated.  I find it a relief to pick up the Fire Stick and go through the options to rapidly find what I want.  I am very pleased", "verified": true, "helpfulness": "0/0", "author": "Sonnig Freitag \"Sonnig\""}, {"rating": 4.0, "review": "Easy-to-use, easy to connect, easy to watch", "verified": true, "helpfulness": "0/0", "author": "Robert W. Marki \"Movie Nut\""}, {"rating": 2.0, "review": "I bought it mainly to watch youtube. And guess what... It's not available. Thank's Amazon...", "verified": true, "helpfulness": "0/0", "author": "Matias"}, {"rating": 5.0, "review": "Turns any TV (with HDMI port and wifi available) into a smart TV !", "verified": true, "helpfulness": "0/0", "author": "Chelsey fernandez"}, {"rating": 2.0, "review": "the picture was extremely blurry.  Had to purchase a new modem and have our internet increased.  A lot of extra cash I wasn't looking forward to laying out. The chromecast stick that we already owned is by far the more superior.  Had it not been for the fact, that Amazon prime cannot be accessed with chromecast, I would have never purchased the Fire Stick.  When my membership with Amazon Prime comes to an end the Fire Stick will go back into the box.", "verified": true, "helpfulness": "0/0", "author": "Janae jones"}, {"rating": 5.0, "review": "Super.", "verified": true, "helpfulness": "0/0", "author": "KDOK"}, {"rating": 5.0, "review": "Love this thing. I added a few of my special touches and now it's absolutely perfect! Any show. Any movie. Any time. Best of all......NO COMMERCIALS!", "verified": true, "helpfulness": "0/0", "author": "Johnny Appleseed"}]