[{"rating": 2.0, "review": "The fire stick is not bad just wish they had more TV shows attached that were free or for a prime member without having to join Hulu or Netflix flicks", "verified": true, "helpfulness": "0/0", "author": "joanne l. johnson"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "CAROLINE MORALES"}, {"rating": 5.0, "review": "Ready to go out of the box. No set up needed. We love this for our Netflix and sling TV. I am in love!", "verified": true, "helpfulness": "0/0", "author": "myndee sprague"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Terrance McCalla"}, {"rating": 5.0, "review": "Great streaming device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this is the best", "verified": true, "helpfulness": "0/0", "author": "Kimberly Grissom"}, {"rating": 5.0, "review": "Great product. Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Dale E Szymanski"}, {"rating": 5.0, "review": "Just  love  it ,  one of the  best  purchase  I  ever  made .", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Well worth the money!  Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "DAVID KANASZKA"}, {"rating": 1.0, "review": "Really poor customer service for the Amazon Fire Stick, unbelievable for Amazon, extremely disappointed.  I spent lots of time on the phone with South Africa and even more time on the phone with the fine people in the Philippines.  Unfortunately they didn't seem to understand the term \"Aspect Ratio.\"  They had no answers with regard to billing and they couldn't seem to provide any answers about the Wi-Fi password.  I had been put on hold for about 25 minutes by a supervisor before I was conveniently disconnected.  I won’t say hung up on but we’ll just keep it at disconnected.  I did get really familiar with the piano hold music.  After I called back, another one of the fine Customer Service / Support representative asked me to check one of the settings in the Amazon Fire Stick Menus but when I came back to the phone they were also gone, disconnected again.  The lady in South Africa was nice, she said she’d check on the Aspect Ratio issue and give me a call back but that was two days ago and I haven’t heard back from her.  I kind of feel like if Amazon is going to manufacture products and they are going to have support for said products, perhaps they should at least show the customer service representatives the products and let them know how they work.  I also noticed there isn’t much content unless you sign up for “Prime” or add other services like Netflix.  Overall this was not a good customer experience.", "verified": true, "helpfulness": "0/0", "author": "S. Graves"}]