[{"rating": 4.0, "review": "This is a great device to have in your household if you are looking to move away from cable. With the Sling TV app, you get a very good selection of major cable stations plus news and the ability to watch HBO. I'm also a Prime member so I have easy access to TV shows with the Fire TV. It easily buffers what it thinks you are going to watch so you have instant access to you video. I took one star off because it can be easy to accidentally press the wrong button while watching something and end the video. Also, if you are streaming Sling TV for a few hours, it will go to sleep on you and can be a slight hassle getting back to your channel. Don't buy the Roku when you can get this for less and have virtually the same apps and videos plus its more powerful in hardware.  Easy $40 i ever spent without any regrets. Can't wait to try it out in a hotel!", "verified": true, "helpfulness": "0/0", "author": "Eric J. Holland \"bokeypunk\""}, {"rating": 5.0, "review": "I have two Apple TV's that are collecting dust now.  I'm so impressed and happy with my Amazon Fire TV Stick and Fire TV (I have both).  It streams flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Amanda Jefferson"}, {"rating": 5.0, "review": "Ease of use and setup is great!", "verified": true, "helpfulness": "0/0", "author": "Jesse Solis"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jacob Floyd"}, {"rating": 5.0, "review": "Amazing! My husband, son, and I can all enjoy TV and movie viewing. Super easy set-up, user friendly, and COMPLETELY worth the money. I even bought one for my Daddy to enjoy.", "verified": true, "helpfulness": "0/0", "author": "Lauren fleming"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Lori A. Quin"}, {"rating": 5.0, "review": "Absolutely love my firestick!!!  No need to pay a cable bill anymore... just get Netflix!", "verified": true, "helpfulness": "0/0", "author": "Patricia Sharp"}, {"rating": 5.0, "review": "Great, easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Patricia Colavito"}, {"rating": 1.0, "review": "Will not work if your TV is hooked up to a reciever", "verified": true, "helpfulness": "0/0", "author": "D Grant Hewitt"}, {"rating": 5.0, "review": "I was blown away when I connected my Firestick and realized my full potential as an Amazon Prime Member. I don't need Netflix or Hulu with my Prime membership. Through the Firestick my entertainment media is fully content. I was so over whelmed that I bought another one and plan to order more to give as Christmas gifts. I can go from room to room, on trips and everything. It's an awesome product.", "verified": true, "helpfulness": "0/0", "author": "Butch Mose"}]