[{"rating": 5.0, "review": "Great little device, it works fantastic and you can take it anywhere you go. I gave one to my friends for Christmas because they liked so much. Awesome!! :-)", "verified": true, "helpfulness": "0/0", "author": "francisco"}, {"rating": 3.0, "review": "Made a mistake of believing in one review that this can be used to mirror my PC to my TV to play movies from my PC. Anyway I'll just use it for my Android phone.", "verified": true, "helpfulness": "0/1", "author": "Josito Javier \"josirine\""}, {"rating": 2.0, "review": "I own many similar devices - Chromecast (3), AppleTV, GoogleTV, VUDU boxes (4 of the original), many smart TVs with built in streamers, Roku3, WD Live, MythTV (built myself 2), PS3 (2), PS4, Wii and many more obscure video streaming devices.  It's due to my working in video streaming tech arena for many years.I was excited to pick the FireTV stick up for $19 as an early customer.  Glad that's all I paid.  I have been using it for a few weeks now, and I am not all that thrilled with it.  The menus are slow, there is a lag from me clicking remote and the onscreen udpate.  I've accidentally clicked on wrong choice quite a few times.  Very frustrating.  I have already updated FW to latest.There is a lack of integration for searching across content.  It's (obviously) geared toward Amazon Prime, but I also subscribed to Netflix, Hulu, Crackle, VUDU, Amazon Prime, Crunchyroll, HBO, ESPN, Apple Store, Google Play and various other services (yes, really, I need to be able to test among all the major streaming services).I like the Chromecast, especially now that it has integration and abilities to \"cast\" content from other devices.  My kids love it, and we travel with several for use in hotel room TVs.FireTV stick seem to be geared toward Prime only and everything else is second thoughts.  I really like GoogleTV's ability to search across all streaming services that the box has installed and you are signed into.  Very nice integration.  Too bad it's not updated anymore.I would not paid more than the $19 I got this for.  It's disappointingly slow and clunky, slow menus.  Does not support as many streaming services and the apps are only from Amazon store, which is not as good as Google Play store.", "verified": true, "helpfulness": "5/6", "author": "Amazon Customer \"tin man\""}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/0", "author": "Peter Sills"}, {"rating": 5.0, "review": "It is awesome well worth the $39.", "verified": true, "helpfulness": "0/0", "author": "melody needham"}, {"rating": 4.0, "review": "One complaint. The base of the stick is wide. The two HDMI ports on my tv are next to each other and with this plugged in, another cable won't fit. I had to go out a buy a splitter, which makes this less of an inexpensive option.", "verified": true, "helpfulness": "1/1", "author": "Cynthia"}, {"rating": 5.0, "review": "Love it! So easy to use!", "verified": true, "helpfulness": "0/0", "author": "ashlee"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "belle udes"}, {"rating": 5.0, "review": "We use it for Amazon Prime Video and NetFlix.  It works great!", "verified": true, "helpfulness": "0/0", "author": "J B \"J B\""}, {"rating": 5.0, "review": "Brilliant when combined with Prime. No commercials and great quality streaming", "verified": true, "helpfulness": "0/0", "author": "Alfontso"}]