[{"rating": 5.0, "review": "Seems to be easy to use. Perfect for watching Netflix, HBO Go, etc. We have enjoyed using it so far.", "verified": true, "helpfulness": "0/0", "author": "Seandsand"}, {"rating": 4.0, "review": "Excellent value. Not as powerful as full FireTV but worth it for a second TV. My only issue is the USB power adapter is too wide for a standard power strip. Would have made 5 starts if not for the power adapter.", "verified": true, "helpfulness": "0/0", "author": "MatthewFF \"thewebbie\""}, {"rating": 1.0, "review": "Unusable. Had to switch back to using a big PC connected to the TV to watch Netflix.", "verified": true, "helpfulness": "0/1", "author": "Steakman"}, {"rating": 5.0, "review": "Fast and smooth.  Works better than expected!  Easy setup and usage.", "verified": true, "helpfulness": "0/0", "author": "Bob \"Bob\""}, {"rating": 5.0, "review": "Love this. Best thing I have bought since I don't know when. Literally plug it in and it works. Could not be easier. I don't have a smart tv so I thought I would have to get a Roku and they work \"okay\" but this thing is FABULOUS!!!", "verified": true, "helpfulness": "0/0", "author": "Barb"}, {"rating": 5.0, "review": "Its Amazon , trust , buy and your eyes are closed.", "verified": true, "helpfulness": "0/0", "author": "Bin"}, {"rating": 4.0, "review": "Works Great. Setup was very easy except for the last step. Last step is to put batteries into remote. I could not get the battery cover off. Tried every which way, even prying with a knife. I gave up and brought it to a friend figuring i was doing something stupid. Not true! he finally pried it open & we put the batteries in. WORKS GREAT !!!!  I hope the batteries last a long time because I tried to re-open the battery compartment and had NO luck. I hope I don't break it when the batteries run low.", "verified": true, "helpfulness": "2/3", "author": "s. jakiela"}, {"rating": 2.0, "review": "Have a Sonny smart TV.Wi-Fi signal is lost so often, three quarters of the way through the movie, sometimes no signal during start up,ect,ect. love it when it's working.where can I get some tech. help?", "verified": true, "helpfulness": "0/1", "author": "joseph cahill"}, {"rating": 5.0, "review": "I tried this unit the first time, actually I liked it.  Compared with the Roku, it is superior.  I wish I can get the same deal again, then I can buy another unit.", "verified": true, "helpfulness": "0/0", "author": "Anti-Communist"}, {"rating": 1.0, "review": "This is a great idea, but ... terrible product.  Every few minutes it hangs up (freezes).  This thing should be given to heart physicians for putting people through a stress test.  Why on earth produce a product that has such poor quality and then sell it!  And by the way, it is right next to the router - also, other devices have no problems in the same network.  One lousy, lousy, rotten, useless product.  Thanks Amazon.", "verified": true, "helpfulness": "2/7", "author": "J. Stanton"}]