[{"rating": 5.0, "review": "Love this!! Makes my subscriptions to Netflix, Hulu and Amazon Prime well worth it!", "verified": true, "helpfulness": "0/0", "author": "Pamala Monroe"}, {"rating": 2.0, "review": "Video playback buffers occasionally.  It blames it on my internet connection, but my chromecast on the same TV works flawlessly.  If it weren't for this fatal flaw I would give it five stars.", "verified": true, "helpfulness": "0/0", "author": "Daniel Wilson"}, {"rating": 5.0, "review": "An excellent buy.  You get more than your money's worth with this portable gizmo.  You definitely need this.  I have this as well as the original Amazon tv.  The only drawback is that this doesn't have a microphone for easy movie searching like the full/original Amazon tv, but what a great buy! Totally impressed !", "verified": true, "helpfulness": "0/0", "author": "Sandra M \"code3sandra\""}, {"rating": 5.0, "review": "I usually do not write reviews but this Fire TV Stick is great.  I am able to access all of my prime videos and cloud pictures with ease.  My Wife and Children are able to get onto NETFLIX and watch all there favorite shows and it is so easy to use.  I gave it a 5 Star because it is well worth the price.  I will recommend this to my family and friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far, so good.  Kind of disappointed in the offerings, but I'm a old lady &  like mega-retro!  It was easy to set up even for me.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth D"}, {"rating": 4.0, "review": "Very easy to set up and use. Simple and intuitive interface.", "verified": true, "helpfulness": "0/0", "author": "Erik McCullen"}, {"rating": 5.0, "review": "Best thing ever! My kids love it and easy to use!", "verified": true, "helpfulness": "0/0", "author": "vjhyd th jhh"}, {"rating": 5.0, "review": "Easy set up and great quality pictures, love this", "verified": true, "helpfulness": "0/0", "author": "Margarita \"tanker boy\""}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Paul G. Lasko"}, {"rating": 5.0, "review": "It's Fast and works great. So satisfied I got a second one for another room.", "verified": true, "helpfulness": "0/0", "author": "2DogFamily"}]