[{"rating": 2.0, "review": "Worst of all is the video playback. Video is often times choppy, whereas I don't have this issue when I switch over to my ROKU (not my internet connections problem). Also, content is confusing to navigate. after a couple months, I still don't know how to fully access certain features. An interface re-think/re-design should be considered by the Amazon Fire team.", "verified": true, "helpfulness": "0/0", "author": "Hanna"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "K z"}, {"rating": 5.0, "review": "Wife loves it.", "verified": true, "helpfulness": "0/0", "author": "w wright"}, {"rating": 5.0, "review": "It's awesome. Easy to set up. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Bryan Brown"}, {"rating": 3.0, "review": "I wanna like this more, I can see it's potential, but as of right now the only advantage it had over the competition was the $19 price point.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing product! So convenient, portable, easy to use and my proudest purchase.", "verified": true, "helpfulness": "0/0", "author": "Ms. Becky J. Hollis \"humblewannabe\""}, {"rating": 5.0, "review": "I bought my husband the Fire TV Stick for Christmas and he (great minds thinking alike) bought me a Roku 2. We both prefer the Fire TV Stick by far. It is much faster than the Roku 2, the remote is superior (more intuitive to use), and the user interface is much, much, much better and more pleasant to use. The only thing that my husband likes better with the Roku is that you can plug headphones into its remote and listen to the TV through the headphones at night and not disturb your partner. I particularly like this feature when he wants to watch a movie that I'm not interested in watching or even listening to in the background (super violent movies). It would be nice if Amazon would add this feature to future versions of the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "Great idea. Love it.", "verified": true, "helpfulness": "0/0", "author": "crafty granny \"MCM\""}, {"rating": 4.0, "review": "Works great, good picture and sound.  I just wish someone could come up with a on demand subscription that includes every movie and show for a monthly fee. Otherwise you piece together so many plans and pay per view ... It just seems to be getting a bit ridiculous.  If you combine this with TV or satellite programming you would have it all... Keep working on it, someone has to figure it out.", "verified": true, "helpfulness": "0/0", "author": "Ryan Doerr"}, {"rating": 5.0, "review": "Fast, responsive and with access to all of amazon prime content. great for the price, much better than alternatives.", "verified": true, "helpfulness": "0/0", "author": "Ike"}]