[{"rating": 5.0, "review": "This Fire stick is great. I purchased it when it was half off for $20. I plugged it in yesterday. It was very simple to install.  Everything loaded very quickly. There are a ton of TV and movies to watch on Amazon Instant Video. I see myself using this very often. I think it's great I can use my Prime membership on my TV now instead of just on the Kindle, so I'm really excited to catach up on some TV shows and movies! I would highly recommend this to any Prime member to utilize the membership even more. I'm glad I got it for $20 but I probably would've paid more for it.", "verified": true, "helpfulness": "0/0", "author": "CLM"}, {"rating": 4.0, "review": "Easy set up. Great picture. 1080 picture is nice and crisp. The only reason I give it 4 stars is the remote. First, the remote is extremely sensitive. So when you go to scroll for shows you may end up past where you want to stop. The second problem is you can not use any other remote. This one can not be \"learned\" by another so you are stuck with having to use this or the app ( which is a little bit of a pain to use as well, though the voice search is kind of cool.). I don't like having a bunch of different remotes and enjoy using a universal to control everything. Less to lose. Beyond that it was a steal at the promotional price and not a bad deal at the regular. It is not obtrusive and some of the newer TVs have a special HDMI port that provides power, so on those TVs you may not need the plug. It des include and HDMI extender cable in case the stick can't fit easily in TV. Use full if your HDMI is in the back and there is little clearance when hanging the television. You can stream anything from the cloud as well as the new Prime Music. ( Which you can also do from the Amazon App on the competitor's device.)", "verified": true, "helpfulness": "0/0", "author": "D. Brant"}, {"rating": 4.0, "review": "Great alternative to box top streaming sets. LOVE seeing Amazon shows on a TV screen and not just a computer!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"brianr007\""}, {"rating": 4.0, "review": "Nice and smooth UI...Had issue with remote not working. Amazon replace the remote with no problem.", "verified": true, "helpfulness": "0/0", "author": "Roy Johnson"}, {"rating": 5.0, "review": "Works really well, nice interface and remote works!Streaming quality is good.", "verified": true, "helpfulness": "0/0", "author": "Puneet Jain \"Puneet\""}, {"rating": 5.0, "review": "Faster than Roku, great channel selection, easy to use and I love the apps I can use on my phone like voice search.", "verified": true, "helpfulness": "0/0", "author": "Heidi Hill \"Heidi704\""}, {"rating": 1.0, "review": "This worked great for about a week, then quit working.  Error message saying it can't connect to the wifi, but when I go to network settings, it says it's connected and that the signal strength is excellent.  There's no other help or tips on-screen for getting it to work, other than to go to the website, which I haven't had time to try.  But it's frustrating - my daughter was very disappointed.  I wish I had gone with a different product.", "verified": true, "helpfulness": "1/1", "author": "J. Hunt"}, {"rating": 3.0, "review": "Overall a great product, very easy to use and plug into a TV. Slightly disappointed that some basic apps like Plex aren't free, even though I have a premium account and have already paid for the app on Android. The remote works OK unless you have to type anything in, I haven't had success getting the fire TV app to work from my phone yet. I wouldn't pay more than 30 dollars for it but for that price it is a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was given to me by my son for Christmas.  I love it.  I use it to watch Netflix movies.", "verified": true, "helpfulness": "0/0", "author": "Diane Baggett"}, {"rating": 5.0, "review": "The only thing that I think was a slight oversight on this product is that the micro USB power plug is on the side of the unit so if you don't want to use the included HDMI extension you are out of luck. You pretty much have to unless you have no other wires coming out of the back of your TV. I am not of those people. The HDMI extension fixes the issue and because it's behind my TV I really don't care that it is back there kind of hanging. The remote is awesome and really responsive. The channels come in clear and the load time is virtually non-existent. I also have the chromecast and for most streaming apps I would rate Fire TV above anything the chromecast can do. I haven't tried the screen mirroring function on the Fire TV Stick but I am optimistic that it will be superior as well.", "verified": true, "helpfulness": "0/0", "author": "B. Rockwood \"dasrockness\""}]