[{"rating": 2.0, "review": "I did not like the overall performance of the unit. I could not get it to connect to my wifi correctly. When it did the motion and screens were slow.", "verified": true, "helpfulness": "0/0", "author": "FloBoss"}, {"rating": 1.0, "review": "This thing is terrible!!! Everything in my house is running fine off the wifi...except this!!! It looks promising when its first plugged in. I downloaded a couple of apps...ones I use on my blu-Ray player all the time...keeps dropping the connection.  I've tried all the trouble shooting suggestions, and nothing improves this device. I'm glad I got it when it was $19, or I'd be even more pissed!!!", "verified": true, "helpfulness": "2/2", "author": "Grant_3"}, {"rating": 5.0, "review": "Better than what I expected. It streams seamlessly. Got it for $19.99 on sale. Bought it so my wife could stream on her tv...she is happy, so I'm happy.", "verified": true, "helpfulness": "1/1", "author": "DrTronco"}, {"rating": 4.0, "review": "I own a Google Chromecast and Apple TV so those are my comparison devices.At first this device blew me away. Amazon is really onto something. The ability to add apps and customize the experience is fantastic.  The only downfall is that it doesn't seem to consistently stream very well.  I use Plex media server to manage personal video collection.  The UI is fantastic through the Fire TV Stick.  Unfortunately, the streaming is not consistent.  Sometimes a movie would play completely fine. Other times the same movie would hesitate or freeze at various points. I tested this with a kids movie that my children regularly watch.  I have reduced the stream quality but that didn't seem to make a difference.At first I thought this might be my network but later determined it was not because I can play from my phone or tablet and then broadcast to my AppleTV or Chromecast without any issues.I feel it is a matter of time before Amazon addresses these issues.  Overall this is a great product and you really can't go wrong for the price.", "verified": true, "helpfulness": "1/1", "author": "Silicon Ghost"}, {"rating": 2.0, "review": "Would have loved this if it had a proper Twitch app, but as it stands it only plays in 480p and there is no way of increasing the quality. I purchased this primarily for watching Twitch on my TV. Can't believe Amazon would allow such disappointing Twitch functionality when they've just recently acquired Twitch. Works fine with Netflix.", "verified": true, "helpfulness": "0/1", "author": "laserz"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Leslie Mitchell"}, {"rating": 4.0, "review": "As a previous Chromecast User the Fire TV Stick is hands down the better option. With Chromecast you must have a PC to access YouTube, Netflix or other websites on the internet and then broadcast them wirelessly to the device. The Fire Stick is a stand alone device with a remote so no PC is required to access media. You do however need an internet connection with a wireless network. The Fire TV Stick also streams data much faster with fewer hiccups! Love it!", "verified": true, "helpfulness": "0/0", "author": "OCD \"Blues Addict\""}, {"rating": 4.0, "review": "Nice device.  Works well right out of the box.", "verified": true, "helpfulness": "0/0", "author": "Harold Muetzel"}, {"rating": 5.0, "review": "love the.ease.of using this fire stick...i might just cancel my cable service now an just watch what i want ,when i want!!!...its easy to set.up..loads very.fast...even has the game play feature...so far we love it!!!", "verified": true, "helpfulness": "0/0", "author": "william costello"}, {"rating": 1.0, "review": "1 star rating.well, after having the fire stick for about a week I find that it doesn't work as well as they promote it to be.when I tried to hook it up to my TV it would not work through the sound system.I contacted Amazon and they said to check with they manufacture which I did and they said it was a problem with the fire stick. I guess no one wants to own up to the problem.", "verified": true, "helpfulness": "0/3", "author": "Glen smith"}]