[{"rating": 5.0, "review": "This is life-saving. I live in an area where there are no TV satellite signals at all but I also do not want to pay for the expensive cable. By getting this amazing little thing, I am now able to watch BBC and NBC news live. Now my life can't be better!", "verified": true, "helpfulness": "0/0", "author": "FROMCA2VA"}, {"rating": 5.0, "review": "Love that I can put Amazon music on it. Lyrics on screen great for the kids! Hours of endless fun while learning to read too. Great bonus.", "verified": true, "helpfulness": "0/0", "author": "Busy mom"}, {"rating": 5.0, "review": "Love this thing", "verified": false, "helpfulness": "0/0", "author": "Marisa Lizarraga"}, {"rating": 5.0, "review": "It does everything I was looking for and more. Easy to set up and get started. I have really been enjoying the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Steven Ihde"}, {"rating": 5.0, "review": "Everything is awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Frankie"}, {"rating": 2.0, "review": "It works for a while then just stops. I rebooted a few times but nothing changed as far as access. It did finally (after a few re-boots) come up with an error message that said that my wi-fi was too slow. I ended up going to my laptop to finish an Amazon Prime movie series without any problems. It didn't make any sense since my laptop had no problems on the same network and was in a different room to boot. The stick is right next to the wi-fi so I think that it might be that there is something to do with the stick's processor itself and it might be heating up with extended use ... hence failure. If you are getting off paid programming (like I am); I suggest that you look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "thumb1999"}, {"rating": 4.0, "review": "It works and travels well.", "verified": true, "helpfulness": "0/0", "author": "James Walter"}, {"rating": 4.0, "review": "It seems to run well on our TV and internet. I like the remote and the fact that the unit of the firestick itself is small. It would be better if it charged while it was plugged into the TV rather than having to have an external charging source. However, it overall is very well made and put together.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! We have one for every tv!", "verified": true, "helpfulness": "0/0", "author": "Glm"}, {"rating": 5.0, "review": "Easiest installation of any electronic product I've ever done.  I had this hooked up and was watching programming within minutes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]