[{"rating": 5.0, "review": "Excellent product.  Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "WT \"WT\""}, {"rating": 5.0, "review": "Simple to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Gary Green"}, {"rating": 4.0, "review": "Works perfect!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Simple, and easy to install.  The Wi-Fi strength isn't quite as consistent/strong as I would like, but for the price, this works great!", "verified": true, "helpfulness": "0/0", "author": "Allison Griffith"}, {"rating": 5.0, "review": "The Amazon Fire stick was so incredibly easy to install and also set up! I am so pleased with how it works I would recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "Morgan A. Werner"}, {"rating": 5.0, "review": "Amazing product ... and so easy to install too!  I recommend buying through Amazon so it's already registered to your account when you order.  LOVE it!!!", "verified": true, "helpfulness": "0/0", "author": "Trina D. Beumer"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Wanda Buck"}, {"rating": 4.0, "review": "Too early to tell over the long term, but for my family it's been great.  We had Amazon Prime and have been sending it to the TV via an iPad and Apple TV.  The picture quality looks great, it's easier and doesn't rely on two other devices which have had problems in the past.Overall, good value", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The Fire TV Stick is only good if you want to watch older movies. I am disappointed because I thought that you would actually be able to watch shows from A & E or Showtime but you have to be a subscriber to these channels. Also, the channels mentioned requires that you register at their website and enter your satellite carrier. Turns out I have DIRECTV and it is not one of the available carriers that can be registered. So really, I can watch a bunch of outdated movies and just clips from A & E and Showtime shows. I had hoped to replace DIRECTV with the Fire Stick to cut down on a monthly bill but I will be keeping DIRECTV. Even with Amazon Prime, you have to pay for rentals so there is the convenience of renting from your home TV or your computer, smart phone, etc. but if you are looking for a wider variety of newer releases, be prepared to pay.", "verified": true, "helpfulness": "0/1", "author": "Alexander-Duchesne \"queenofhwy\""}, {"rating": 5.0, "review": "Amazon Fire TV Stick has an incredibly easy set up and user interface for a great price! It's the perfect solution for a smart TV like my Sharp Aquos that comes with a limited list of apps that doesn't include Amazon. I checked into adding apps to my Sharp Smart TV but found out that it was impossible after calling their customer service.  I was so excited when I found out about the Amazon Fire TV Stick that would give me access to the apps I have wanted on my TV. THANK YOU AMAZON!", "verified": true, "helpfulness": "1/1", "author": "Mark"}]