[{"rating": 5.0, "review": "Pros:  It's fast, gui is smooth, has its own storage, run on 5hz Wireless band, Amazon Prime Video / MusicCons:  Android App could be better; maybe show your apps , video , etc instead of being a remote only.  Works well though.I find myself using it more than my Chromecast, though they are slightly different and offer a different viewing streaming experience.", "verified": true, "helpfulness": "0/0", "author": "Essef Vilton \"§\""}, {"rating": 5.0, "review": "This is amazing, I love it.", "verified": true, "helpfulness": "0/0", "author": "amare d kabtimer"}, {"rating": 5.0, "review": "I got this because the chromecast wouldn't support amazon video very well. This does that job as well as the youtube surfing I did on the chromecast. I will say I got it for $20 on the promo, but I think I would pay $40 for it, just for being able to watch prime video conveniently.", "verified": true, "helpfulness": "0/0", "author": "John \"computer geek\""}, {"rating": 5.0, "review": "easy setup. responsive.", "verified": true, "helpfulness": "0/0", "author": "Harold Hawes"}, {"rating": 1.0, "review": "I just got the stick and after spending hours trying to get it to work over two evenings (obviously doing other things at the same time so I wouldn't lose my mind) it still doesn't function properly. The first night I could get Amazon prime to load quickly nothing else would. Since I no longer have prime I didn't watch anything but noticed how rapidly it loaded compared to Netflix. Hmm....interesting.I could never get Netflix or anything else to work, even though my internet connection was fine on my computer and phone.  Tonight I was able to go to Netflix and tune in radio but could not even watch or listen to one program due to the constant buffering. I can watch Netflix on my computer with no buffering so it's not a WiFi issue on my end. This stick is crap and I'm returning it.", "verified": true, "helpfulness": "1/2", "author": "avid reader"}, {"rating": 4.0, "review": "Super great for Prime members. HBO collection alone is worth it. Only problem is a green flicker that occurs every couple minutes. Makes it unwatchable. Have to turn everything off and then back on, only to have the green flicker return after a couple minutes. After a little research, find a work around by turning off \"pixel orbiter\" on my Panasonic ST50 tv. Have not had the problem since, at the expense of rising plasma \"burn in\" with pixel orbiter turned off.", "verified": true, "helpfulness": "1/1", "author": "bynum1420"}, {"rating": 4.0, "review": "Solid product but no internet browser.  you are locked in with whatever shows (netflix, hulu etc)/apps available.  Good selection though.  I wish it has a browser so that my TV can be a smart TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"wireless\""}, {"rating": 5.0, "review": "Better than chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jeremy B."}, {"rating": 5.0, "review": "Obsessed. I like it better than Chromecast. I like the little remote and that there is an app. This is amazing. SO awesome. Use this to watch TV in one room of the house, we use XBOX one in the other. The Fire Stick is much easier to use for hulu/netflix/prime etc than xbox. I love the ease of the remote. It's a great product.", "verified": true, "helpfulness": "1/1", "author": "MargaretShops"}, {"rating": 5.0, "review": "Love it. Wish my TV's USB port had enough power but I already have a chase in the wall for wiring so not a big deal. I have DSL and have no buffering issues with it.", "verified": true, "helpfulness": "0/0", "author": "Phillip C. Pierrard"}]