[{"rating": 5.0, "review": "Awesome for streaming video. ... love it", "verified": true, "helpfulness": "1/1", "author": "Devon Alexander"}, {"rating": 1.0, "review": "Won't buy this until it supports VUDU.  It's also missing support for HBO Go and Rdio.  Roku stick still wins hands down for supporting the most services out there.", "verified": false, "helpfulness": "0/2", "author": "Michael P Rieth"}, {"rating": 4.0, "review": "Great device.", "verified": true, "helpfulness": "0/1", "author": "Mike Miller"}, {"rating": 5.0, "review": "Love it! Plug it in and go. Very simple, user-friendly device. Also have google chrome. Never did figure out how to use it. Well, we did once but not easy. Ended up ordering a second Fire TV Stick.", "verified": true, "helpfulness": "1/1", "author": "lynn m"}, {"rating": 5.0, "review": "I have a smart tv with amazon prime app, but access is slow and clunky. Fire stick is so fast and easy. With remote app that lets me use my phone as remote, I simply ask for what  I want and it's on. Love it!", "verified": true, "helpfulness": "1/1", "author": "K. Steckler"}, {"rating": 3.0, "review": "I bought this device primarily to watch Sling TV. It does an OK job once you have a channel selected. The stream gets choppy and quality is poor when browsing channels though, this is not the case with my Fire TV. The Fire TV stick is noticeably slower in every aspect than the Fire TV, which I guess is to be expected. I would fork out the extra money and get the full Fire TV, or maybe a Roku.", "verified": true, "helpfulness": "1/1", "author": "Cassidy Hallesy"}, {"rating": 3.0, "review": "I rate a 3 star because it has NBA app and MLB App but not NHL app.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very highly recommended", "verified": true, "helpfulness": "1/1", "author": "Rhonda"}, {"rating": 5.0, "review": "👍👍👍 works great", "verified": true, "helpfulness": "1/1", "author": "missnalie"}, {"rating": 5.0, "review": "it was easy to use easy to install and saves a great deal of money if you want all the convenience the stick has to offer providing that you don't want your TV to turn into a huge laptop", "verified": true, "helpfulness": "1/1", "author": "Jennifer C."}]