[{"rating": 5.0, "review": "easy to set up.  I have a Leaf so I do not have cable. this gave me access to so much!  love the Pandora, get my Prime movies, Hulu and Netflix without having to bring my laptop down from my office to the tv.  If you do not have \"cable\", or a smart tv this is the way to go!  I added the app to my phone and can request movies or items by voice.  Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Denise Davis"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kirsten Megginson"}, {"rating": 5.0, "review": "as usual Amazon products meet and exceed expectations.", "verified": true, "helpfulness": "0/0", "author": "Michael Frey"}, {"rating": 5.0, "review": "Well worth the money. I have both the stick and the box and both are the best devices on the market.", "verified": true, "helpfulness": "0/0", "author": "Shawn A. Stritz"}, {"rating": 5.0, "review": "I always wanted to be able to watch TV on a machine that is far from the cable in the nether regions of my house.  I hate regular TV with commercials, and I get too many cable channels with not enough variety. Problem solved!I can view my favorite Amazon prime shows like Banshee which I'm totally addicted to,  listen to music, watch Netflix, and many many more options, some of the best $24 I've ever spent .  I bought it on prime day when it was $24, on a whim really wasn't looking for it, but so happy! Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Melissa Contreras"}, {"rating": 5.0, "review": "Great worth the price", "verified": true, "helpfulness": "0/0", "author": "jk"}, {"rating": 4.0, "review": "I bought this instead of the Chromecast stick because it said it had 2x the capacity, etc. However, it doesn't allow me to add movies to the 2x capacity sized stick,  so it's somewhat of a let down. Plus, several if the preset apps on the stick do not work. Wish i would have stuck w the Chomestick", "verified": true, "helpfulness": "0/0", "author": "MaryLee Huerta"}, {"rating": 5.0, "review": "Great buy!", "verified": true, "helpfulness": "0/0", "author": "Dawson"}, {"rating": 3.0, "review": "It's good but it keeps loosing connectivity every an hour so.", "verified": true, "helpfulness": "0/0", "author": "Tomi"}]