[{"rating": 1.0, "review": "Disappointed  seems like videos. I wanted live tv", "verified": true, "helpfulness": "0/3", "author": "true crime reader"}, {"rating": 5.0, "review": "we are happy with the stick. Honestly I don't watch tv, but as far I can tell my kids are very happy, I rate it as 5 stars", "verified": true, "helpfulness": "1/1", "author": "Luna \"Elena Soto\""}, {"rating": 5.0, "review": "Does everything I want and more. Love that all my accounts are one easy click.", "verified": true, "helpfulness": "1/1", "author": "J. Best"}, {"rating": 1.0, "review": "This device is buggy and slow.  It lags a lot more than I had expected coming from Amazon.  I activated the Plex app for 500 coins (one-time activation) however it is trying to make me activate it again.  I looked into this issue and the problem isn't with the Plex app itself but due to Amazon's activation failing.  Until this issue is resolved I cannot give this product more than 1 star especially since Plex works so well on all my other devices.", "verified": true, "helpfulness": "1/3", "author": "Daniel"}, {"rating": 5.0, "review": "Love this!! I am trying to convince my husband to cut back our cable so I ordered this. It is great. I can always find something to watch and I love that it is easy enough for my five year old to operate. I believe we will be purchasing another.", "verified": true, "helpfulness": "1/1", "author": "Momoftwo"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "Jennifer Murphy"}, {"rating": 5.0, "review": "Very impressed with the FTVS, much better than the Chromecast!", "verified": true, "helpfulness": "0/0", "author": "CTB"}, {"rating": 5.0, "review": "Love this little gem. It runs smooth and even allows apps to be side-loaded. There is the free application manager app from amazon you can use to manage all applications instead of going to the system menu. It'll list all the side-loaded apps too.", "verified": true, "helpfulness": "1/1", "author": "Andras"}, {"rating": 4.0, "review": "The Fire TV Stick does what it sets out to do, efficiently, effectively, and (mostly) painlessly. It won't get you to any new content, but it will make Netflix and Amazon Prime stream conveniently, for a very reasonable 40 bucks.Two minor comments: the remote is poorly designed, and getting the batteries in was like the old SNL skit, \"Triopenin.\"Fortunately, everybody else has had the same problem, and the Internet is full of helpful advice. There is also a downloadable app for various phones and tablets that can be used to control the Stick.Second, I haven't really found any Fire Stick apps that seem worthwhile; most of them are just \"free\" invitations to subscribe to another service. There are some free games, but, in general, Fire TV Stick streams content from services you already subscribe to, and not much else.", "verified": true, "helpfulness": "1/1", "author": "John I. Hamilton \"casual gamer\""}, {"rating": 3.0, "review": "Its OK", "verified": false, "helpfulness": "0/2", "author": "E A 3000"}]