[{"rating": 5.0, "review": "Very happy with the way fire stick works.", "verified": true, "helpfulness": "0/0", "author": "barbara schmitt"}, {"rating": 3.0, "review": "We keep having trouble with our remotes, on 2 different sticks - we ended up putting the app on our phones and exclusively using that.", "verified": true, "helpfulness": "0/0", "author": "C. Pyle \"urbanzero\""}, {"rating": 4.0, "review": "Works perfect for streaming. It is easy to use and understand. My one minor complaint is that the remote control is too small. We are always losing it, usually deep into the sofa. We do not lose are larger remote controls.", "verified": true, "helpfulness": "0/0", "author": "Dave \"Mad 4 Hemingway\""}, {"rating": 5.0, "review": "Great gadget - easy to use. Took a little longer to be mailed than I would have expected - without explanation - but apart from that a great little addition to the TV", "verified": true, "helpfulness": "0/0", "author": "Garrett Hogan"}, {"rating": 5.0, "review": "Goodbye Dish!", "verified": true, "helpfulness": "0/0", "author": "Brian W."}, {"rating": 5.0, "review": "Every thing as advertised and expected. More than worth the money, especially if you are an Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Gloria Chunn"}, {"rating": 5.0, "review": "It skips on the left to right and up and down arrows  but I can get use to this.", "verified": true, "helpfulness": "0/0", "author": "Bea"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "maria"}, {"rating": 4.0, "review": "Faster and more reliable than Google Chromecast. I have both. The remote control is a must!Otherwise, I coudn't have access to Amazon content, like Amazon Video, because I live abroad (Brazil). Shame on you Amazon!", "verified": true, "helpfulness": "1/1", "author": "Leandro B. Carvalho \"Leandro B. Carvalho\""}, {"rating": 3.0, "review": "Did not realize that I had to purchase Prime to get something on my TV...even after purchasing Prime I have to purchase Hulu Plus to get the Network TV shows offered for free on internet.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]