[{"rating": 1.0, "review": "I keep getting a microstutter while watching videos. I tried everything to get rid of it with no success. I've come to the inevitable conclusion that this product simply doesn't work very well. Disappointing and a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Scully"}, {"rating": 4.0, "review": "This device works well", "verified": true, "helpfulness": "0/0", "author": "Ronald Beer"}, {"rating": 5.0, "review": "Better than a Roku. Takes up no space at all.", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 5.0, "review": "We took this with us on a vacation to Chicago and we watched shows as a family in our hotel.  This was worth every penny.  Use it at home too.  Easy to use and set up.  Just be careful about accidentally ordering a movie.", "verified": true, "helpfulness": "0/0", "author": "Scorpio"}, {"rating": 4.0, "review": "Love it!! Easy to install and easy to use. Now if my husband would stop losing the remote it would be awesome!!", "verified": true, "helpfulness": "0/0", "author": "Mayce Blackmon"}, {"rating": 5.0, "review": "Absolutely loving it!", "verified": true, "helpfulness": "0/0", "author": "Annette Fuller"}, {"rating": 4.0, "review": "Great so far! love that it will start a new episode without me having 2 tell it 2.. do wish the golden girls was included in the prime. Love that show", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 3.0, "review": "Bought this to replace an Apple TV I had borrowed. I wanted to be able to watch Hulu, Netflix, and Amazon Prime (no Amazon on Apple TV). It works ok. Sometimes it has a weird skipping quirk. It also loses the connection regularly  (we are in a 900 sq ft apartment) which could be the Internet provider but we didn't have nearly as much of a problem with the Apple TV.  Ultimately it is ok since this is just for the TV in our bedroom. However, if it was for our main TV I would probably try Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 5.0, "review": "I am really enjoying it. A must if you are an amazon prime member.", "verified": true, "helpfulness": "0/0", "author": "Patricia Balcziunas"}, {"rating": 5.0, "review": "Easy to install and so far works well with the TV and does what it is supposed to do!  Enjoying it.", "verified": true, "helpfulness": "0/0", "author": "C. G. Francis"}]