[{"rating": 5.0, "review": "Definitely enjoying it.  Yea! no commercials.  I watch when i want to and do not worry if I get interrupted.", "verified": true, "helpfulness": "0/0", "author": "IJK"}, {"rating": 5.0, "review": "Referred to me by a friend and I am very happy he told me about it. There are so many apps and movies that this could definitely turn you into a couch potato. Only wish I had brought this sooner during the winter when NYC got all its snow.", "verified": true, "helpfulness": "0/0", "author": "mike \"mike\""}, {"rating": 5.0, "review": "Great addition to our Prime", "verified": true, "helpfulness": "0/0", "author": "Patricia Schrimpe"}, {"rating": 5.0, "review": "Works perfectly. I'm very satisfied with its performance.", "verified": true, "helpfulness": "0/0", "author": "Horace Andante"}, {"rating": 5.0, "review": "the subject is enough :)", "verified": true, "helpfulness": "0/0", "author": "Michael H"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Rogelio Lazaro"}, {"rating": 2.0, "review": "The device is easy to setup.  The FireStick is a small device and therefore it is not intrusive to your TV setup.  The USB port option eliminates the need for a 120 volt outlet to power the device.  So as long as you have a USB port on your TV set, this is a convenient feature.The FireStick keeps rebooting and to date, I have not been able to find a solution online for this problem.  So I may be sending it back to Amazon.  I am clearing not the only individual experiencing the problem.  The primary reason I brought the device was to run the Plex application so I could connect to my Plex Server.  You can load the free Plex app, but you can't watch any content until you pay $4.99.  The problem is, the process for making a payment is convoluted and I've yet to figure it out.  I'm trying to give you my money, you can't make this hard.  So I've tried once and I've yet to try again.  No VUDU application for the Firestick.  I can only assume this is because VUDU and Amazon compete.  Part of my movie library is with VUDU/Ultra Violet, not by choice, that's the only option I had.  Preventing me from viewing that content isn't going to make me switch, it will simply force me to the first product that supports multiple vendors and multiple solutions.  Which looks like RoKu.The potential is there, but a key capabilities are missing and there are some product stability issues.", "verified": true, "helpfulness": "0/0", "author": "joseph"}, {"rating": 5.0, "review": "Amazing product.  If you're deciding between this and a chromcast, look no more.  I have both.  This is way better than chromecast in every single metric possible.  It costs the same as a chromecast.  I can use this easily in hotel rooms (unlike the chromecast, where you're resorting to MAC spoofing to even use it).Since I have prime, I can access all my documents and pictures anywhere I carry this as long as there's a TV and wifi.  It's great.", "verified": true, "helpfulness": "0/0", "author": "Daniel Yang"}, {"rating": 1.0, "review": "Its ok when it works.  I will be watching and 30 minutes later I get sound but no picture. Sometimes it takes me hours for it to come back.  Sometimes the next day.  I wish I could call someone but can't seem to find a telephone number.", "verified": true, "helpfulness": "0/0", "author": "J. Edwards"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. Will get one for my other televisions because the price is so reasonable and it makes streaming video so much better than watching on my I-pad.", "verified": true, "helpfulness": "0/0", "author": "Lulu"}]