[{"rating": 5.0, "review": "Love these sticks have 2 now.  Use prime account with them and Kodi side loaded as my media player.  Installed firefox browser and my email app from my cell works great.", "verified": true, "helpfulness": "0/0", "author": "milladog"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Rika D Dow"}, {"rating": 5.0, "review": "Love the network access & streaming capabilities added to our non-\"Smart\" TVs.", "verified": true, "helpfulness": "0/0", "author": "exploring the rainforest"}, {"rating": 5.0, "review": "The installation was very easy, but after the installation, we had difficulty actually getting to any Apps.  It took 55 minutes on a frustrating call to technical support (outsourcing is a real bummer) with the customer service agent unable to assist us, and finally only after insisting upon speaking to a Supervisor, did we solve the problem.  It took her only about 3 minutes to recognize the problem, and we are up and running.  Easy to operate and speedy.  We like this device very much, and are considering purchasing a second one for another room.", "verified": true, "helpfulness": "0/0", "author": "Barbdin"}, {"rating": 3.0, "review": "Even though there is a strong Wi-Fi signal to it, the Fire TV Stick loses lock on Wi-Fi signal.  Not many choices for news or Public TV stations.", "verified": true, "helpfulness": "0/0", "author": "Fran Velez"}, {"rating": 5.0, "review": "Love it!  Kids love the games and I loved the easy setup!!", "verified": true, "helpfulness": "0/0", "author": "Christine D"}, {"rating": 5.0, "review": "I ordered the Fire Stick not knowing what to expect but since I subscribed to a few of the apps/services supported thought I'd give it a try. Bottom line it arrived and after we activated it it worked Great, even easier than I had hoped for. Even a better a better deal if your a Prime member.... Not only does it have a lot of content to watch but games for my children too, I may have to invest in the controller.... I may be ditching my expensive cable package and just get Internet from my provider.Fire Stick has something for everyone & easy to use, Highly Recommended.....", "verified": true, "helpfulness": "0/0", "author": "M. Redding \"Like to Read\""}, {"rating": 5.0, "review": "It works fine. Somehow I thought it would download to kindle fire, It does not. And why would you down load from kindle fire to the fire stick  when  the fire stick already in the TV . It does the same exact thing . I think it is amazing amazon prime is free sometimes, and when you go back its $1.99 or higher for the same TV shows you started watching for free. Give me Netflix  over amazon any day. I will not renew when year  ends but the fire stick does work .", "verified": true, "helpfulness": "0/0", "author": "roger"}, {"rating": 5.0, "review": "This item has exceeded my expectations & family , very easy to setup and used. The only thing I wish the remote was a little bigger", "verified": true, "helpfulness": "0/0", "author": "ray herrera"}, {"rating": 5.0, "review": "This is pretty cool, really like it..fast shipping too!", "verified": true, "helpfulness": "0/0", "author": "Vero-y-Jo"}]