[{"rating": 5.0, "review": "Coolest thing ever.  Everything I need.", "verified": true, "helpfulness": "0/0", "author": "Dominique Knaus"}, {"rating": 5.0, "review": "Very simple to install and use. You  plug it into your HDMI port then plug the power cable into the stick and the other end into a USB port or a wall outlet. Plug it in then go to your TV's input button on your remote, select the location where you plugged it in and follow the promopts. You put in your wifi password and you're done.  The fire remote is easy to use. We were using our wii box to watch Netflix but the controllers are a pain for that. The Fire stick is much better for our Amazon Prime and Netflix. It's so great, I'm thinking about dumping cable and subscribing to Hulu.", "verified": true, "helpfulness": "0/0", "author": "Ipodcrazy"}, {"rating": 5.0, "review": "LOVE THIS PRODUCT! No joke. I was hesitant at first, but its gone beyond my expectations. The quality is PERFECT on the tv. Its very clear and just great. I am so happy I got this product. Now I can enjoy everything again all on one hdmi channel!", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 5.0, "review": "Hooked up easily, use every night a real joy and easy to use...have 2, only one now works.", "verified": true, "helpfulness": "0/0", "author": "Jimpasz"}, {"rating": 4.0, "review": "Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Peggy Lam"}, {"rating": 4.0, "review": "The one thing I do not like compared to Chromecast is that, the Fire Stick does not continue to play if you switch HDMI outputs. Every time you leave the signal you have to restart what ever you were watching.", "verified": true, "helpfulness": "0/0", "author": "Mike Henson"}, {"rating": 5.0, "review": "I received this as a gift from my daughter and son in law.  I love it. Simple to install, sime remote.  Fantastic apps. I found many awesome programs, including classic TV and movies.  Space 1999!!  And I also found out that watching game streamers is so much fun!  Seriously, I love it.", "verified": false, "helpfulness": "0/0", "author": "Mj"}, {"rating": 1.0, "review": "I bought 2, one for me, one for my father, his works fine, mine connected once, now won't connect @ all.  Spend the extra twenty bucks and buy a Roku.  All my laptops, tablets, smartphones, smart tvs connect just fine in the house-total boner.", "verified": true, "helpfulness": "0/0", "author": "Stockwiseauto is no good"}, {"rating": 5.0, "review": "Love this!! We have a smart tv but to get Amazon video, we had to hook up the laptop. This just stays attached. Netflix picture is grainy, but I can deal with that.", "verified": true, "helpfulness": "0/0", "author": "Lainee Ropon \"lainee715\""}, {"rating": 5.0, "review": "Works great and you can take it anywhere!", "verified": true, "helpfulness": "0/0", "author": "Tom"}]