[{"rating": 4.0, "review": "This Fire Stick is awesome. A great lineup of apps and more are on the way. With Netflix, Plex, Hulu Plus, and now Sling TV available, I cancelled my cable subscription. I did notice it was hot after a few hours of use.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "Overall, very pleased with the product.  There have been some connectivity issues and some buffering during the movies, but for the most part operation is satisfactory.", "verified": true, "helpfulness": "0/0", "author": "Philip Halpern"}, {"rating": 3.0, "review": "Netflix skips and stutters.", "verified": true, "helpfulness": "0/0", "author": "Paul Kakanis"}, {"rating": 5.0, "review": "Bought this hoping it would handle Netflix better than our Wii u system.  We pretty much replaced the Wii u (with probably a thousand dollars worth of accessories and games) with just this little thing.  The free games are great for a 5 year old, and Netflix supports profiles (unlike the horrible Wii u app that somehow does not).", "verified": true, "helpfulness": "2/2", "author": "Davebrah"}, {"rating": 5.0, "review": "Easy set up, works great so far.", "verified": true, "helpfulness": "0/0", "author": "kansasmike"}, {"rating": 4.0, "review": "I like it. It was easy to install and get up and running and is easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Richard Sackerson"}, {"rating": 5.0, "review": "So far this unit has been working fine and I have been very pleased with it !! Thank you.", "verified": true, "helpfulness": "0/0", "author": "Stotz44Jackie#"}, {"rating": 5.0, "review": "Love it! I'm having so much fun with it! So much I want to watch.", "verified": true, "helpfulness": "0/0", "author": "Linda VandenBergh"}, {"rating": 4.0, "review": "It works as expected. 3 minutes from box to hooked up and connected, seems very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Shadowluck"}, {"rating": 5.0, "review": "I love the fire tv stick,its so much easier than the Chromecast. after I learned how to get the apps I wanted ,(NEXFLIX of course) everything else was easy.", "verified": true, "helpfulness": "0/0", "author": "lynn bennett"}]