[{"rating": 1.0, "review": "Not user friendly. Couldn't get the sports we wanted", "verified": true, "helpfulness": "0/0", "author": "Jane Connolly"}, {"rating": 2.0, "review": "My intention was to buy it and use Amazon Instant Video and other Amazon Prime content. Well, it only works if you're in the US, not my case.Also installing apps outside the US is a real pain, you cannot install through the device (???).After hours and hours trying to get a good connection (did not work on my ASUS Dual-Band Wireless-N 600 Router RT-N56U, had to enable my ISP router, awful) and a few more hours trying to install some apps, I finally got a Netflix Streaming Device, 'cause it's basically all I can use it for.Other than that, it's fast and the controller is good, makes it easy to navigate. If you need to use the search function, you can use the phone app, which makes it a lot easier (nice feature).", "verified": false, "helpfulness": "0/0", "author": "Felipe Sales Cochi"}, {"rating": 5.0, "review": "It's like a traveling Kindle Fire TV.  I take it in trips here in the US and plug , it into the hotel's TV. The remote ok s on my phone an I'm set. I haven't tried it outside the US yet. I expect I'll get the message that apps won't display movies or tv. Then I'll mirror my movies on my Fire HDX. It's a win-win.", "verified": true, "helpfulness": "0/0", "author": "The Dude"}, {"rating": 5.0, "review": "Easy to use with the prime account. Great purchase and would buy again in a heartbeat.", "verified": true, "helpfulness": "0/0", "author": "Nebula77"}, {"rating": 1.0, "review": "Bought the stick for prime.  Works for a few minutes then buffers...buffers...buffers.  Eventually it tells me there is no internet connection.  I used my broadband speed check on my iPad and saw I've got over 20 Mbps.Tried the stick with Netflix same problem.Netflix works fine on my Samsung bluray.Not happy.", "verified": true, "helpfulness": "0/0", "author": "Doug Braa"}, {"rating": 5.0, "review": "What an awesome product!  I may even drop cable.  This is a money saver!", "verified": true, "helpfulness": "0/0", "author": "Jan Brizee"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "0/0", "author": "Raye"}, {"rating": 5.0, "review": "So easy to use!  Near instant playing of videos!", "verified": true, "helpfulness": "0/0", "author": "B. J."}, {"rating": 5.0, "review": "It arrived and installed with no problems. You need to follow the installation instructions because I believe the power up sequnce needs to be followed. Beyond at that it was really easy to use . Wish prime had more movies. I have enjoyed it.", "verified": true, "helpfulness": "0/0", "author": "mtnrchuck"}, {"rating": 5.0, "review": "By Far  the Best remote I have  ever used period. Why can't Cable Companies do this ? . Simple set up 5 min... maybe  Didn't watch network TV or Cable for 2 weeks while home recovering from surgery. I am a Prime member which I highly recommend and i have an endless supply of fascinating  proframming You cant get  any where else. My only complaint is the pricing in some rentals or the option to only buy", "verified": true, "helpfulness": "0/0", "author": "DBK"}]