[{"rating": 5.0, "review": "Easy install and setup, instantly streaming movies and more.", "verified": true, "helpfulness": "0/0", "author": "ljm"}, {"rating": 4.0, "review": "It's very useful since I don't own a smart TV but I wish it had more apps like HBO", "verified": true, "helpfulness": "0/0", "author": "Sage"}, {"rating": 3.0, "review": "The Fire TV Stick works fine but it works very slowly.  Not very practical for flipping channels or even for perusing the TV guide channel that comes with our cable system, because even scrolling through the guide is very slow, but it is great if you know what you want to watch.  Much better than paying for an extra cable box every month.", "verified": true, "helpfulness": "1/1", "author": "Helgo Jacobitz \"HJ\""}, {"rating": 5.0, "review": "Really cool. Stuck watching The Americans.", "verified": true, "helpfulness": "0/0", "author": "John O'Toole"}, {"rating": 5.0, "review": "The streaming is great, small glitches here and there but NOT enough to keep from watching. The first set up download time took a while but afterwards the apps were all working smoothly and without any problems. Internet browsing is slow due to the remote and inability to click links, so the internet browsing is a bit pointless to do otherwise being there all day to just browse one subject. We use the Fire Stick for our TV in the basement so that we are able to watch workout videos, play music, or watch movies while working out. Amazon Prime movies are easy access and the picture image is crisp & clean. -unless it's a really old movie.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"whatchawant\""}, {"rating": 5.0, "review": "Great service with my prime membership using prime instant video. Like having access to Flixter and other services.  Would also like access to Disney Movie Anywhere--and/or Vudu (they're connected.)", "verified": true, "helpfulness": "0/0", "author": "Joan-11"}, {"rating": 5.0, "review": "I had no idea that there were so many choices and apps available. It is better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Tisha Walker"}, {"rating": 5.0, "review": "Received the Fire TV Stick promptly and had it up and running in about 15 minutes, 5 of that was getting the back off the remote to install the batteries. (indicates my tech level, ha-ha) Saw some reviews that said they had trouble with older TV's, but had no problem with my 4 yr old Panasonic Plasma. I'd say this was one of my best purchases for home entertainment. Every step went smoothly and the selection of things to watch makes our cable on-demand movie choices look really pathetic. Probably won't give the Netflix up when the 1 month free is over, and probably won't give up the Prime either, but even without these there is a lot of content, PBS, etc.", "verified": true, "helpfulness": "0/0", "author": "Pianoman"}, {"rating": 5.0, "review": "Love it.  Goodbye direct TV", "verified": true, "helpfulness": "0/0", "author": "O'Neil Campbell"}, {"rating": 5.0, "review": "Super easy set up working great", "verified": true, "helpfulness": "0/0", "author": "Robert McCall"}]