[{"rating": 5.0, "review": "I LOVE IT AND SO DO MY GRANDKIDS.", "verified": true, "helpfulness": "0/0", "author": "Anita Kelly"}, {"rating": 5.0, "review": "Love, love, love this device...it is has all the apps (Amazon video, Plex, Netflix, HBOgo, and Sling) I need in one spot and the remote is so much easier to use than the Apple TV one!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It doesn't work that well.  As a baseball game goes on, it gets slower and slower.  I know you will say it is the internet connection, but it is broadband the desktop and laptop in the house are super fast.  And we make sure they are not on the internet while we watch the game.", "verified": true, "helpfulness": "0/0", "author": "Scott Highfill"}, {"rating": 4.0, "review": "I purchased a Fire stick before and I loved it so much that I got it as a gift for a friend. The Fire Stick is so very easy to use and install that a 65 year old was able to get it up and running in 15 minutes. I also have the other service, Ch....cast on one of my TV's. It is not as convenient because it has to be attached to a tablet or laptop. With the Fire Stick I simply connected it to the TV port, went through a quick tutorial, and started watching. Also if you are a PRIME member the options offered by the Fire Stick are even better.  Not only would I recommend this item to others, I will be giving away some more as gives to family and friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it is exactly what I needed for my bedroom tv..as I slowly unhook form cable systems.. i needed a solution for my small tv.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Wilson"}, {"rating": 4.0, "review": "good morninglast month buy this device and so far I can only indicate two weaknesses , 1 should come with Spanish, among other languages.2- I happened on 4 occasions that your host device loses internet connection , although this has problems and does not exceed 25 % of the burden of the movie or program , what I do is that I disconnected and reconnected and works again , however it is a good team I feel good with it and understand that these faults can be corrected with an update of the same operating system.thanks", "verified": true, "helpfulness": "0/0", "author": "Do"}, {"rating": 5.0, "review": "The remote is a very handy addition to the fire stick. I attach the unit to a projector with the only drawback being volume control.", "verified": true, "helpfulness": "0/0", "author": "Acts28brian"}, {"rating": 1.0, "review": "I purchased this with the pre sale back in October, broke only after a few uses and was not issued a replacement product, only a credit of my money, was told I'd have to repurchase at the higher price, considering this is my 3rd Amazon product to fail on my in the past 6 months (broken Kindle and my replacement sent to me was also broke) I don't think I'd purchase Amazon products again", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have no further need for cable. My five year old mastered the fire in a few minutes and her and her brother love it. I love the parental controls. She loves the PBS shows and he loves playing his video games on the TV.", "verified": true, "helpfulness": "0/0", "author": "Katrina D. Linning \"Claflinite\""}, {"rating": 5.0, "review": "what a great value for the money! such a huge variety of recent movies great TV shows and games to play and so easy to control from my mobile phone. it was simple to install I mean really simple the on-screen directions were really simple and anyone could do it even the person who is the most technically challenged \"un computer\" type person. don't be afraid! It is an excellent value! 5 stars plus! I'm almost ready to get rid of my dish!", "verified": true, "helpfulness": "0/0", "author": "judith c leonard"}]