[{"rating": 5.0, "review": "I haven't had much time to mess around with it, but I have to say, the times I have, have really impressed me. I also have a roku, and don't get me wrong, I absolutely adore my roku, but this has free games on it and you can get a game controller for some as well. It has some apps that my tiny doesn't , and I just really like this.", "verified": true, "helpfulness": "0/0", "author": "Natalie Lund"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Bebe"}, {"rating": 5.0, "review": "Easy to use and I like it better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Larry Bonneau"}, {"rating": 5.0, "review": "Wife loves the convenience.", "verified": true, "helpfulness": "0/0", "author": "Keith Rhodes"}, {"rating": 5.0, "review": "I absolutely LOVE the Fire TV Stick!  I still have a Roku box in the living room, but the Fire TV Stick is more reliable, has less interruptions even during a bad storm, and I prefer the layout.  I highly recommend to anyone looking for their first or a new streaming device!", "verified": true, "helpfulness": "0/0", "author": "Patty Summers"}, {"rating": 5.0, "review": "Better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Nick MacDonald"}, {"rating": 5.0, "review": "Great!!  I need to buy another one for a second TV.", "verified": true, "helpfulness": "0/0", "author": "Sandra F. Gerner \"stretch13666\""}, {"rating": 1.0, "review": "Can't get vudu on the device,  you can't use Bluetooth headphones unless you buy the more expensive one. It is faster and works better than the roku stick does", "verified": true, "helpfulness": "0/1", "author": "matthew"}, {"rating": 2.0, "review": "It should be stated that popular channels like HBO GO and ESPN Watch are not available on Fire TV through many cable carriers. Also, doesn't mirror the iPhone. I returned it. Going to stick with Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Cedotal"}, {"rating": 5.0, "review": "We bought this for our television in our living room but it seems to have found it's way into the daughter's bedroom. Works great and have to problems.", "verified": true, "helpfulness": "0/0", "author": "Patrick Flynn"}]