[{"rating": 5.0, "review": "i just wish it could play movies from my google acct.", "verified": true, "helpfulness": "0/0", "author": "MonkeyWithAGun"}, {"rating": 1.0, "review": "Apps are slow and amazon prime vedio is a waste as almost all good stuff is not free.", "verified": true, "helpfulness": "2/5", "author": "Sindhura R"}, {"rating": 3.0, "review": "The power plug requirement is cumbersome and when I tried to watch SKYFALL last night, there seemed to be weird video acceleration that made people move to quickly and the quality was not in HD even though it was an HD movie. Further, what is the aversion to a QUERTY keyboard for text entry??? Finally, the organization of the content is less than intuitive....Why cant we browse PRIME movies by genre and new releases like the \"other\" guys.....cool gadget...not much fun to use.", "verified": true, "helpfulness": "0/0", "author": "Matt Becklin"}, {"rating": 5.0, "review": "Great product, I use to watch my Netflix and Hulu movies from my computer which can become uncomfortable but now I can watch my movie from anywhere in my room, great to have options.Regina", "verified": true, "helpfulness": "0/0", "author": "R. Medina"}, {"rating": 5.0, "review": "Love it.  This is a great gizmo !", "verified": true, "helpfulness": "0/0", "author": "Darlene Jones"}, {"rating": 5.0, "review": "This was a fantastic purchase. I have been watching movies on my kindle and enjoying them for a while. Now my family can watch them with me. We have binge watched Downton Abby. With do many choices including Netflix we are stumped. A nice problem to have.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Great item. Enjoy the Amazon programming. Highly recommend getting one. Get to see hundreds of show for pennies a day.", "verified": true, "helpfulness": "0/0", "author": "BOBS"}, {"rating": 5.0, "review": "Love it! All my Amazon Prime content write on my TV any where there's WiFi!", "verified": true, "helpfulness": "0/0", "author": "Lawrence Grimmett"}, {"rating": 3.0, "review": "Generally pretty good. Having a couple of problems:- text in the apps is pretty small, at least on my fairly small TV. The text is sharp, but in the body of a movie description, for example, I cannot see it from across the room. Maybe I'm just the wrong age :-) Of course, there is a nice big picture of the advertising graphic - which is of zero informational value...- there is a Spotify app, but you have to use a smartphone app to drive it - and, at the moment, that works about 2% of the time. The android app spent see the fire stick app. Mostly, it's useless.", "verified": true, "helpfulness": "0/0", "author": "D. Kronstadt \"kronhead\""}, {"rating": 5.0, "review": "Easy install and works perfectly for a 2nd TV", "verified": true, "helpfulness": "0/0", "author": "Kathleen Santelle"}]