[{"rating": 5.0, "review": "It arrived a week earlier than expected, is easy to install, and does more than I expected. I look forward to Mirror working with my iPad in future.", "verified": true, "helpfulness": "0/0", "author": "Laura Hardy Norman"}, {"rating": 5.0, "review": "Love it!  Prime, Espn 3, Netflix. Enough said", "verified": true, "helpfulness": "0/0", "author": "Harry Swartwood"}, {"rating": 4.0, "review": "Great device. Loaded XMBC and now I can take it anywhere.", "verified": false, "helpfulness": "0/0", "author": "Bon N."}, {"rating": 5.0, "review": "i bought it preorder with the amazon prime discount.  it works great, i also have the roku stick and the firestick is a lot faster and the mirror feature works pretty good with a little lag. i like that you can download apps and play them with the remote that comes with it.", "verified": true, "helpfulness": "0/0", "author": "mike johnson"}, {"rating": 5.0, "review": "I love Amazon Fire! I wish there was a better way to filter by free Prime Movies only, but I think that is an Amazon issue, not a hardware issue.", "verified": true, "helpfulness": "0/0", "author": "sarahe"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Susan C. Waters"}, {"rating": 4.0, "review": "Like to see more current tv.", "verified": true, "helpfulness": "0/0", "author": "pat"}, {"rating": 3.0, "review": "Not all I expected but its ok I should have done more research.I have charter for tv and thought i could use the showtime HBO AMC ect...apps with the stick like I can with my fire tablet but I cant.", "verified": true, "helpfulness": "0/0", "author": "g161607"}, {"rating": 5.0, "review": "Love it. So worth the price.  Especially if you have a prime membership.", "verified": true, "helpfulness": "0/0", "author": "AMelia Turcotte"}, {"rating": 5.0, "review": "I have two fire sticks and love them both.  Far better than Google chromecast.  Having even a basic remote is 1000x better than dealing with using your phone or tablet as a remote like with chromecast.  I dig it, and got them on the pre-release sale for 20 bucks.", "verified": true, "helpfulness": "0/0", "author": "bigdogdeee"}]