[{"rating": 4.0, "review": "Love the Fire Stick. Easy to install and fairly easy to use. Some of the menus are a bit confusing, but I am starting to get the hang of it.", "verified": true, "helpfulness": "0/0", "author": "J. Gracey \"born again' Catholic\""}, {"rating": 1.0, "review": "I ordered this awhile ago but waited until I bought a new tv. When I tried to set it up it kept telling me to put in wifi password which I did at least 20 times! The it would sometimes come up saying Amazon.com not able to connect or something like that. Finally gave up! Even someone tried it and it didn't work! I even tried my kindle fire in the house and it asked for wifi password and connected first time", "verified": true, "helpfulness": "0/0", "author": "Jane Dear"}, {"rating": 4.0, "review": "Easy set up works great luv it so far", "verified": true, "helpfulness": "0/0", "author": "doug"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "This was such an easy fix!  Plug it in and go.  I'm thinking of adding it to my smart TV because it is so much easier to use than all the jumping around with the already loade apps on the TV that take forever to download before you can find your program..", "verified": true, "helpfulness": "0/0", "author": "vicki laue"}, {"rating": 5.0, "review": "Love my fire stick. It is so radi to use.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "it is great works just fine and i love it for the price", "verified": true, "helpfulness": "0/0", "author": "john samberg"}, {"rating": 4.0, "review": "Getting used to it.  Like it..", "verified": true, "helpfulness": "0/0", "author": "Caryl Chrisse"}, {"rating": 5.0, "review": "Great product, working really well. Only if it cud have had a volume button too.. Else it's super", "verified": true, "helpfulness": "0/0", "author": "Saurabh"}, {"rating": 1.0, "review": "This didn't  operate as expected.", "verified": true, "helpfulness": "0/1", "author": "Ronco"}]