[{"rating": 5.0, "review": "Love it!  Can't say more!  Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Michell P."}, {"rating": 5.0, "review": "Kick ass !", "verified": true, "helpfulness": "0/0", "author": "Wylie thornton"}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "Alan in the south"}, {"rating": 5.0, "review": "This has changed the way we watch tv completely. no more commercials, an amazing variety to choose from, I feel like we haven't even scratched the surface of what's available to us through the Fire Stick. It's pretty much the only way we watch tv now.", "verified": true, "helpfulness": "1/1", "author": "Mom"}, {"rating": 4.0, "review": "Easy to install and access to so many shows. Love how when you are watching a TV series it just goes from episode to episode without hesitation. Makes it super easy to binge watch your favorite shows. Just wish there were more hit shows available.", "verified": true, "helpfulness": "1/1", "author": "Crystal Peterman"}, {"rating": 3.0, "review": "It works. Better than the apps on my blu-ray player. My biggest con would be the Amazon centric interface. I understand that it is an Amazon product and I dont believe it is a fault. It's just annoying when wanting to play the other streaming services the extra steps needed to get there. It does have Hulu, Netflix and Am. Prime on one device which was my main goal.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Rydman"}, {"rating": 4.0, "review": "After spending several days reading reviews on various streaming media players for my family (single mom with a 12 and 7 year old), I decided the Fire stick was the device for me.  I have not been disappointed!  Upon initial start-up I did have to go into Settings and choose to update in order for the Netflix and Sling apps to work.  Once I did, everything has worked smoothly.  Transitioning between various apps is seamless.  I was a little worried about the size of the remote and whether my son would have difficulty using it...I'm not sure what I was thinking.  Of course, at 7, he had NO problem!  I am planning to get the controller remote also, since he does play some games on there.  I am a Prime member, and I use Amazon music a lot, so this works really well for me!  I love the Amazon music playlists...so whatever I'm in the mood for, I can stream through the TV...WITH lyrics.  If I was inclined to have a karaoke party in my living room, I could!I chose not to get the Fire TV because it would not have made much of a difference for me based upon my current internet connection.  The Chromecast was a no go, because it lacked an actual remote.  I thought about a Roku but the reviews for the speed and content available for such a portable device as the Fire Stick seemed like a no-brainer.  Better yet, I can take it with me while visiting family and plug it in and access my stuff.  Perfect!  I highly recommend!!The one negative is that Amazon does not carry Kodi in the app store.  I'm pretty disappointed about that.For comparison, I have used the following for my streaming media:  Wii, Raspberry Pi, Apple TV and years ago some generic box.", "verified": true, "helpfulness": "1/1", "author": "Melissa C. Carter"}, {"rating": 5.0, "review": "awesome device", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 5.0, "review": "Works great..love being a cord cutter.", "verified": true, "helpfulness": "0/0", "author": "Bob J."}, {"rating": 5.0, "review": "Awesome!! I had it for about a week. It is really easy to use. My kids use it all the time to watch their shows and play games. Prime is a good option to have with this product. No complains for far. I will be getting 2 more Fire Sticks in the near future.", "verified": true, "helpfulness": "0/0", "author": "Salvador DelaFuente"}]