[{"rating": 4.0, "review": "I signed up for the original Prime Member offer for $20.00. It is a very good deal even at the regular Amazon price. It came  registered to my account and the only thing I had to do is plug it in turn in on and enter my WiFi's password. The top speed I get on my Internet connection is about 5 Mbits. I have watched several Prime movies without noticeable delays or interruptions.  This would be a five star rating if it were not for the inability to change NDS servers. However, this would be irrelevant to most users. If you are one of those consider this to be  a five star rating.", "verified": true, "helpfulness": "0/0", "author": "Spiro C. Manolis"}, {"rating": 5.0, "review": "This is an amazing little streaming stick. Look up a program called \"Kodi\" formerly \"xbmc\" and never have to pay to see another movie or TV show again. Its easy to install on the Amazon TV stick and will change your life!", "verified": true, "helpfulness": "1/1", "author": "Fernando P."}, {"rating": 4.0, "review": "I purchased two of these, one for my house and one for a siblings house back when they were on sale for $19 each for prime members. The TV sticks themselves work great, but my only complaint is with the remote. Neither me or my sibling have enjoyed using the remote, as occasionally it will ignore arrow presses, or pretend that you're holding down the arrow and go flying across the page. Aside from that one con, which can make this product rather frustrating to use, the TV stick works fully as advertised and is a joy to have.", "verified": true, "helpfulness": "0/0", "author": "Hayden"}, {"rating": 5.0, "review": "I love it. It is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire stick goes way past my expectations! I haven't used my cable for 3 days! Beautiful picture quality. Great selections with prime! Love the screen saver! Will most likely cancel my cable in the next month or so!!", "verified": true, "helpfulness": "0/0", "author": "mary core"}, {"rating": 5.0, "review": "Super item for home entertainment! Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Edie"}, {"rating": 4.0, "review": "Like the option to rent or buy", "verified": true, "helpfulness": "0/0", "author": "leslie"}, {"rating": 4.0, "review": "I used to use PS3 to play netflix and amazon content before I got this device. The tiny remote is so much better than the PS3 controller! The only problem i have with it is that every once in a while, the wifi drops and the apps fail to connect to the internet. The only way i can get them to work is if I factory reset the device. Have done this twice in a month that I have had the device. But still I do use it everyday and I like it. I am hoping that the bug is resolved in future firmware updates.", "verified": true, "helpfulness": "0/0", "author": "Xen"}, {"rating": 5.0, "review": "This beats the Google chrome by a long shot!", "verified": true, "helpfulness": "0/0", "author": "Drew Simon"}, {"rating": 5.0, "review": "We purchased this item for our christmas present to ourselves.  I love this item.  No complicated set up and once plugged in it lites up your tv screen with sharp clear movies.  What a treat!!!!! I would recommend this to all of my friends.  I hope this item replaces cable absolutely.", "verified": true, "helpfulness": "0/0", "author": "Y.M. Fonville"}]