[{"rating": 2.0, "review": "I'm quite disappointed with this. I have a 1 megabyte download speed with my ISP, yet this isn't enough to stream anything from the Amazon servers. Glad this was only $40 because it was a complete waste of my money.(a few days later) I went ahead and got a new Samsung smart tv.I had no trouble streaming Amazon shows with my new TV's built in app for Amazon.So it is probably very likely my old tv (2013 Toshiba) that claimed to be smart, just isn't smart enough to stream with the fire stick. I still find it hard to accept using the stick on my old tv would constantly drop the connection. That same Toshiba had some apps too, and it streamed just fine using the built in apps on it.", "verified": true, "helpfulness": "1/1", "author": "James B. Holland \"cadman013\""}, {"rating": 5.0, "review": "It really works as expected and is fast for its purpose.", "verified": true, "helpfulness": "0/0", "author": "Odlanier Silva"}, {"rating": 5.0, "review": "Excellent, this item has so many features, it blows the chromecast  out of the water. i even took it with me on vacation and it work perfectly. amazed other family members and friends that they also have purchased sticks.", "verified": true, "helpfulness": "0/0", "author": "joel maldonado"}, {"rating": 5.0, "review": "App count keep growing. love it!", "verified": false, "helpfulness": "0/0", "author": "Sophia Ruffus"}, {"rating": 2.0, "review": "my Fire stick for 3 weeks and I would say at least 40 percent of the time, its broke.", "verified": true, "helpfulness": "1/1", "author": "David Michael Greco"}, {"rating": 4.0, "review": "Does it work with Tivo?", "verified": true, "helpfulness": "0/0", "author": "Randy L. Robinson"}, {"rating": 5.0, "review": "This little gadget is wonderful we all love it", "verified": true, "helpfulness": "0/0", "author": "JEFFREY D CHAMBERS"}, {"rating": 5.0, "review": "Very pleased!!!", "verified": true, "helpfulness": "0/0", "author": "Rando"}, {"rating": 5.0, "review": "Great", "verified": false, "helpfulness": "0/0", "author": "Tiese Lopez"}, {"rating": 4.0, "review": "Works great once you figure out how to install it!", "verified": true, "helpfulness": "0/0", "author": "Gayl Ring"}]