[{"rating": 5.0, "review": "Easy set up and great customer service when you need it. I'm thinking of getting another one.", "verified": true, "helpfulness": "0/0", "author": "Kathi"}, {"rating": 5.0, "review": "Easy to navigate. Good picture quality and fast response. Replaced my laptop connected to my TV.", "verified": true, "helpfulness": "1/1", "author": "Squeemey \"runchummey\""}, {"rating": 4.0, "review": "Had it for only a month, still not sure if I like it...", "verified": true, "helpfulness": "0/0", "author": "James D Cochran"}, {"rating": 5.0, "review": "I think it's the perfect compliment to my Roku. The only thing about the stick I find a little bothersome is the remote. It is a littlesmall and lacks a headset plugin, otherwise it's a dandy device.", "verified": true, "helpfulness": "0/0", "author": "Boggie \"Bogwan\""}, {"rating": 3.0, "review": "It's just the Amazon Fire in a smaller package. Not promoted that way, the advertising made it seam like it was going to be more portable and something I would want to use on a iPad or Fire device. Really it's just the Fire TV in a small package to compete with the format of the Google TV device. If you have the Amazon Fire TV you don't need this.If you have not bought the TV version yet and want to have a small device that hides behind the TV this will work fine. Requires an HDMI input, no throughput from other sources. Also requires a powered USB port, or a/c outlet. Everything you need is included ant there is a lot fo fancy packaging ot make it seem more worthwhile and it's kind of clever but once you open it and toss the fancy wrappers it left me wondering why they bothered with all that.I do recommend the device if your interested in Amazon Prime TV access.", "verified": true, "helpfulness": "0/0", "author": "MMM \"MMM\""}, {"rating": 1.0, "review": "I purchased the FireTV Stick while it was discounted for Prime members, figuring, for $20, it might be nice to have a something from Amazon to stream Amazon Instant Video. I have a Roku, but thought the FireTV experience for Amazon would probably be the best.I was wrong. I haven't been able to successfully finish watching anything on this.Issues:1) Trouble connecting to wireless. It seems to disconnect, and for some reason I have to enter my WiFi password again. Currently, it won't reconnect.2) During playback, it stopped, saying I had insufficient bandwidth to watch. I watched the rest of the show on my Roku, without issue.3) Connecting to Netflix is painful. I have a long, complex password, and the entering it with the remote is very difficult. You cannot unhide the password to ensure you've entered it properly either. Using the app makes this no easier, which brings me to....4) The mobile app is horrible. It's little more than a trackpad on your phone, rather than giving you an actual interface with which you can interact.  Entering text, like in a password field, launches the keyboard, but no text field on your phone or tablet. I thought I could copy my Netflix password from my password manager, and paste it, but this is impossible, because there is no text box in the app to page it into.", "verified": true, "helpfulness": "3/3", "author": "Jon Knutson"}, {"rating": 3.0, "review": "Remote quality is bad - ofcourse its cheap; good way to see amazon prime videos", "verified": true, "helpfulness": "0/0", "author": "Naveen Puvvula"}, {"rating": 2.0, "review": "Product worked good on tv but nott mirroring to kindle tablet!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "My husband and I don't have cable, we watch most things via Hulu or Amazon Instant Video. So we were excited to try the Fire TV Stick instead of hooking up a laptop to the tv. We ordered it in October and the delivery estimate was for January-which was fine, we weren't in any hurry. A couple weeks later, I got an email update: the Fire TV Stick was being shipped sooner!It arrived on December 18th. But there was a problem: It wouldn't give any options for connecting to a wifi network, not even to manually connect to a hidden network or to rescan. Tech support went through a number of troubleshooting options (restarting the stick, rebooting the router, etc), and eventually decided to send another Fire TV Stick. The second one arrived on December 22nd, but it had the same issue: a blank screen that just said \"Connect to your network\" without listing any options.Tech support went through some of the same checks as before, but this time suggested making the network visible temporarily (we have a hidden network and live in a rural area so no neighbors with signals that reach our house). Instead of messing with our network settings, we made a cell phone into a hot spot.It worked! After making the hotspot, we restarted the Fire TV Stick, and suddenly had options for the network connections: the hotspot network, \"connect to another network\", and rescan. I was able to manually enter our wifi information, and now the stick works fine without the active hotspot.Using the Fire TV Stick is simple, too. Navigating through the menus and searching is easy with the remote, and I love that trailers are easily accessible for each movie. I've only had it (working) for one day so far; I'll update this review should anything change, but so far it's been a great item.", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 5.0, "review": "Worked perfectly once I found that I needed to plug it into my receiver INSTEAD of my TV. The instructions didn't mention that.", "verified": true, "helpfulness": "0/0", "author": "Brady F Smith"}]