[{"rating": 5.0, "review": "Great device. The remote app for your phone our tablet is awesome. Very happy with this product and the sling app is great!", "verified": true, "helpfulness": "0/0", "author": "peter orozco"}, {"rating": 3.0, "review": "The Fire stick works great yet not recommended for someone who uses an antenna for accessing TV channels....The Fire stick is somehow interfering with out antenna connection causing the TV channels to be blurry when Firestick is plugged in.  There may be a solution for having Firestick plugged in and the antenna at the same time without blurriness; however, I have not found the solution yet. Currently, we have to unplug the firestick to watch our antenna channels.", "verified": true, "helpfulness": "0/0", "author": "wendy"}, {"rating": 5.0, "review": "This does everything I hoped it would do!  It's fast.  It's efficient.  I can use sling box...  all around great compact device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"gophishhh\""}, {"rating": 5.0, "review": "Excellent product- very easy to setup & use.", "verified": true, "helpfulness": "0/0", "author": "julie reed"}, {"rating": 4.0, "review": "It's cool. ..", "verified": true, "helpfulness": "0/0", "author": "Angela mahome"}, {"rating": 5.0, "review": "Easy install, easy to use.", "verified": true, "helpfulness": "0/0", "author": "B from LA"}, {"rating": 2.0, "review": "The plug in play functionality of it is pretty cool. I like the concept of being able to stream to my TV with as little effort as this device would offer. However, it is absolutely horrendous and streaming content, which is its sole purpose in my household. The device sits no more than 50 feet from the router, yet it buffers an obscene amount. It is highly frustrating! I've read how some people try and solve this problem, but none of them are very viable options. The only one that seems to work (for about an hour) is to restart the device.Amazon needs to get its act together in this regards. The device is pretty cool, when it works.", "verified": true, "helpfulness": "1/1", "author": "Williams"}, {"rating": 5.0, "review": "I didn't mind watching Amazon Prime movies on my kindle, but this little device allows me to watch them on my TV--a very nice option!", "verified": true, "helpfulness": "0/0", "author": "home shopper"}, {"rating": 5.0, "review": "Great - Replaced a Roku - faster, cleaner, great reception - really the way to have entertainment in a house.", "verified": false, "helpfulness": "0/0", "author": "Jim Grevenites"}, {"rating": 5.0, "review": "Love it, so far that is.  I have not gotten to use it much yet, we have been very busy around our house and not a lot of TV time, barely catch the news except late night and early morning news reports. But I know that Amazon will come through for us and make this a worth while investment.", "verified": true, "helpfulness": "0/0", "author": "Randall Collier"}]