[{"rating": 5.0, "review": "i got it when it first came out on special for $19, i thought what do i have to lose? well its works great, the first night,i had to reboot it a few times because it said it had connection problems even thogh i said it was connected to my wifi but since then it works great, prob will have connection problems now and then but for $19 thats fine, i am a amazon prime member but watch netflix a lot more. even for $39 its a good deal", "verified": true, "helpfulness": "0/0", "author": "luis f"}, {"rating": 4.0, "review": "Its great! Including the remote is a really nice touch over the Google product. The Fire TV Stick runs much faster than my Sony DVD which also does Amazon Prime instant video. It also plays YouTube much faster than my Tivo that is a generation back.The one draw back is that it requires being plugged into a wall outlet to run. I was surprised by this as no tv adds or photos show the USB plug cord. I felt that was misleading and would have liked to see that included more up front.  Still knowing what I know now and seeing it perform, I am glad that I got one. Can't beat the fantastic Thanksgiving weekend pricing on the product as well. Thanks Amazon and Best Buy for the partnership! Keep developing that relationship.", "verified": true, "helpfulness": "0/0", "author": "Bill Hunt"}, {"rating": 5.0, "review": "I love it. It works great.Getting the remote open to install the batteries was a challenge because it took a lot of force to move the cover that I was concerned that I would break it. I ended up prying it open with a knife blade to get the battery cover to move and open.", "verified": true, "helpfulness": "0/0", "author": "JAMES P."}, {"rating": 5.0, "review": "A winner for Amazon's Prime subscribers. The Fire TV Stick was extremely easy to setup including pairing with the Fire TV remote on my GS4 and completed in about 6-8 minutes.The quality of the video and sound feed is excellent.", "verified": true, "helpfulness": "0/0", "author": "Cyhber Sr"}, {"rating": 4.0, "review": "Wish it had VUDU as an app.  Like it better than Chromecast though", "verified": true, "helpfulness": "0/0", "author": "John Crane"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Get this - a no-brainer", "verified": true, "helpfulness": "1/1", "author": "AdamArthur"}, {"rating": 5.0, "review": "It works great and was so easy to install. I am not tech savvy and I normally let my husband or teenager deal with electronics but I decided to install this on my own. It took about five minutes and I didn't need my geek squad to help.  I don't love the fact that it has a power cord but I guess that is necessary. Anyhow, we had a Panasonic Viera TV which was Internet ready and compatible with Amazon prime for about a year but then stopped connecting to our wireless network.  We tried contacting Panasonic several times but they were no help. We replaced the wireless network adapter  and that didn't work.  The fire TV stick gives us easy access to Prime and the Netflix app lets us do Netflix. I almost didn't download the Netflix app it after reading some the negative app reviews but it has worked just fine for us.", "verified": true, "helpfulness": "0/0", "author": "Delphinium"}, {"rating": 4.0, "review": "I would have given this 5 stars on first use. But then it started buffering and locking saying network was \"too slow\". There is nothing wrong with the network. I tried it with and without the dongle. I am going to assume a defective unit and get it replaced, hope for improvement.Update, after way to much time with \"customer support\" they finally agreed to replace the unit. New unit seems to be working fine. What it offers completely meets my needs and it is idiotproof (me-proof) to install.", "verified": true, "helpfulness": "6/6", "author": "R. Gordon \"LePin\""}, {"rating": 4.0, "review": "The Amazon Fire TV Stick works really well for the Amazon ecosystem. I really enjoyed the experience.The installation process is reasonable straightforward. After connecting the power, I plugged it to one of the HDMI ports on my Onkyo Receiver which is connected to the TV through HDMI cable. Installation on TV using the remote control is pretty straightforward except entering the network password using the remote, which failed numerous times because I was confused by one of the letters displayed on screen. It's annoying that it doesn't connect to the router by using WPS protocol. This is my first connected A/V device that doesn't allow WPS connection.It connects to the network and Amazon server in seconds. I used to take a break when connecting to Amazon server using my Samsung Blu ray player. So this is a big plus.  Thanks to its fast processor and the 8GB on board memory, the 10 sec fast rewind and fast forward buttons are very sweet, doing that on smart blu ray is nearly impossible. Slow connection to server, slow download, and poor response to remote control are the main reasons that I prefer local media over streaming. Amazon Fire TV Stick large takes care of these issues.Going through contents is smooth, thanks to the fast response to the remote control. Youtube works well. Currently there are not many Apps or subscriptions available, which doesn't bother me much because I don't use them. A major concern is that it doesn't play any local contents, such as photos, musics, and videos stored on a network drive. You need to keep your media player such as smart blu ray player.The hardware is pretty well designed with just a few minor issues. The USB power supply plug is a cool looking tiny box, but it's a bit too wide that it lands on the base of the adjacent plugs. Plug slots are typically precious near the entertainment center. There is no reason to have a USB power plug taking up 3 slots. The remote control is sleek and the minimalistic keys are easy to access by touch (i.e. I don't to look at them in the dark). The battery cover for the remote control is very hard to open. Hopefully I'll not need to be open it again. The remote control feels a bit slippery and cheap. A rubber finish or a texture  finish would help.Pros:1. Reasonably easy to install2. Very fast connection to server and download3. Fast and responsive remote control actions help the experience closer to local media play4. Fast 10s rewind and forward keys work wellCons:1. Lack of WPS router connection means you have to enter the network password with a remote control.2. USB power plug lands on the base of the adjacent plugs - would take 3 slots on a power strip.3. The battery cover for the remote control is very hard to open.4. It doesn't play any local media stored on network drives.Buying the Fire TV Stick is a very nice experience. I pre-ordered it for $19, which was a very sweet deal and I barely glanced through the feature listing before placing my order. It was originally scheduled for early January 2015 delivery. Amazon moved up the date twice so I received it on 12/12j, which means I can play with it and watch movies during the holiday season. I have to say Amazon really knows how to spoil their customers. Very pleased.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]