[{"rating": 1.0, "review": "Very disappointed that the Fire TV Stick doesn't do Miracast streaming from my Microsoft Surface Pro 3. Don't pick this up if you're planning on using this to do Miracast streaming from a Microsoft device. Of course, Android is working fine, but that's because Amazon needs to make sure it works with Kindle Fire and Fire Phone. \"Miracast certified\" is misleading.", "verified": true, "helpfulness": "3/4", "author": "Jay Hankins"}, {"rating": 4.0, "review": "Update: 4/11/15 after a few software updates the Fire TV Stick does not lock up.  Changed from 2 stars to 4.Pros: Fast, has apps for most streaming services, comes with HDMI extension USB power cable and wall wart.Cons: Locks up every few hours requiring usb cable to be disconnected to restart device.Other:  Remote is RF, so line of sight is not required.  It also means I can't use my logitech harmony remote.", "verified": true, "helpfulness": "0/0", "author": "Brother Cannon \"The things you own end up owning you.\""}, {"rating": 3.0, "review": "What a complete piece of trash......literally dozens of reboots...When watching netflix, when listening to pandora, when watching prime...just f'n awful!I paid 20 bucks for this, 19 dollars too much. Seriously when it works it's fine...not close to as workable as Roku, but fine.  However,  it never works. I just got the thing and already it's on the fritz. Good work Amazon. I will never buy another Amazon hardware product again. SAVE YOUR MONEY!!!!!!**Edit** Alright its been over a month with this thing and..I like it. The random rebooting and glitches seem to have gone away..mostly. Bizarre no? The channel selection isn't  nearly as robust as a Roku, but you have the big ones. What I'm really sweet on is the openness of the Fire TV stick. For example, I've sideloaded a couple of video game emulators, now I'm firing up the old Super Nintendo for some retro fun. Pairing a Bluetooth controller was a nightmare. I tried with a PS4 controller after reading it was compatible, no luck. I bought the Nyko gamepad for the fire..no luck. I had to side load android settings, finally I got the controller to pair. I know most people don't want this for games, but just thought id mention it. The actually device is snappy and does what it intended to. Sure its finicky at times, sure I wanted to throw it at the wall when I first got it, but its doing pretty well now. The ability to have Netflix, Prime, and Hulu in the form of a pocketable stick is nice. However, its that ability to side load android apps that really has me pleased. Hell I threw on XMBC on there and have a broader selection of content than any streaming device out there.Do I recommend it?... That's tricky. Out of the box, the Roku stick has more content available, its specs aren't as good but there are more channels, and  have yet to run into an unstable Roku. Fire is slightly cheaper, but is it worth saving a few dollars? Well, that depends.If you're the kind of person who likes to tinker a little bit you'll be greatly rewarded with the Fire TV Stick. Do a search for side loading fire TV, and you'll see exactly what I mean. However, if you just want hassle free plug and play, you're probably better off going with Roku and its ridiculous content catalog (though a ton it is crap). For me I'd go with the Fire every time.  Oh and I haven't mentioned the Chromecast...yea because ...why would I?", "verified": true, "helpfulness": "2/3", "author": "zerom13"}, {"rating": 1.0, "review": "My brother and I each ordered one when they were $19.My brother got his the day before me.  He called to tell me that it worked great for about 3 minutes, then it just died and he couldn't get it to come back on.  Amazon support was great and sent him out a new one.The next day mine arrived.  It wouldnt work at all.  I tried all 3 HDMI ports and multiple power outlets.  Nothing.  Completely dead.I already have the FireTV box, and just wanted this for a 2nd TV.  The FireTV is great, but it seems like they clearly had a bad batch of these Sticks", "verified": true, "helpfulness": "1/2", "author": "Longview"}, {"rating": 5.0, "review": "Easy to setup, great movies", "verified": true, "helpfulness": "0/0", "author": "CECIL S BERRY"}, {"rating": 1.0, "review": "One thing they forgot to mention...you must have a cable provider account for much of the content.  Don't think you can go cable free with this thing.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device is awesome!", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "So excited to have this!  What a bargain and now I can watch my amazon prime movies on my tv screen!  Awesome!", "verified": true, "helpfulness": "0/0", "author": "Donna H. Wells"}, {"rating": 4.0, "review": "I really like this portable little stick for Amazon prime.  The only concern I have is the amount of Apps is kind of limited.  Common Apps like VUDU don't seem to be anywhere.  Hoping it's just a matter of time?", "verified": true, "helpfulness": "0/0", "author": "Michael Smith \"Mike\""}, {"rating": 1.0, "review": "I have just started playing with this device and already I have to ask myself \"does this have a purpose\".You can play Amazon Prime but other than that I have found nothing it will do.To use some of the built in stations like Disney or ESPN you have to have a subscription through a provider.  No big deal except Charter Cable is not a valid choice so you can't watch it.I wanted to mirror my Galaxy Note 8 on my TV.  Not possible unless it is the most confusing thing in the world  I bought a cheap cable and that works great but doing it wirelessly to the fire stick not possible.You will find there are no directions with this device on what it can and can't do and Amazon is no help.I guess I can watch my Movies on Flixster but wish they had included VUDU as it is so much better.Luckily I got this as a prime member for 19.00 so I am not out a lot but Amazon really created a device with no use.I have not used other sticks so I cannot compare to them.Update 6/12/2015.  Fire TV Stick still worthless.  Amazon does not support Charter which is one of the top 3 cable providers.  Until they do this stick is worth nothing.  Having paid half price during the initial offering I still feel like amazon bent me over.  Alot of the apps that you can download do not even if they are not Subscription TV related.  Amazon has failed miserably!!!!", "verified": true, "helpfulness": "0/0", "author": "John H. Eickhoff"}]