[{"rating": 4.0, "review": "had Netflix,hated it!paid them for over a year,should of just drove down the street and threw that money out of the window!fire stick is really cool!easy to set up,remote works great!it would take a lifetime to watch all the programming on this little box!thanks jeff this is great!oh yeah,get prime with it,you get a lot of added features!thanks again jeff!", "verified": true, "helpfulness": "0/0", "author": "ronald phillips"}, {"rating": 2.0, "review": "Have 4 Roku units in my house, but as a Prime member had to give the Fire TV stick a try.  Not terribly impressed.  Seems like every \"app\" needs to be paid for.  Plex, for example, costs $4.  I have a Plex lifetime subscription and simply install the app on my Roku and log in.  Maybe there is some promise for this if they get some of the app availability/pricing stuff worked out.", "verified": true, "helpfulness": "0/1", "author": "JB14"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Shelby Allcorn"}, {"rating": 5.0, "review": "Amazing product I just wish I could turn it off when I'm done useing it", "verified": true, "helpfulness": "0/0", "author": "Edwin"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "DA"}, {"rating": 5.0, "review": "Opens up a whole new world of video options and was very easy to install.  I have had some trouble finding the movies I want.  There does not seem to be a search feature so I can look for a title.", "verified": true, "helpfulness": "0/0", "author": "John Lloyd"}, {"rating": 5.0, "review": "Terrific little product. Streaming Amazon tv shows is instantaneous; on my Smart TV the buffering takes a long time - not so with the Fire TV Stick. Haven't tried it with movies from Amazon Prime yet, but so far I am very impressed.", "verified": true, "helpfulness": "0/0", "author": "Santa Fean"}, {"rating": 5.0, "review": "Easy to install amd easy to use. I've used it every day since I got it.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 4.0, "review": "I really like it but I am wondering if new movies and shows will be added as they become available. I am wondering if I should cancel my netflix since I have this.", "verified": true, "helpfulness": "0/0", "author": "Myra Dorety"}, {"rating": 5.0, "review": "Works wonderfully!  My tv has every app except amazon. With this, I can watch my amazon content in my living room again!", "verified": true, "helpfulness": "0/0", "author": "Cindy Franks"}]