[{"rating": 5.0, "review": "We like it quite a bit. It was a nice update for us.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 1.0, "review": "I bought this months ago and finally gave up. It's great for prime video, and I'm guessing the other streaming services like Hulu and Netflix. But if you primarily use Plex like I do, it's virtually unusable. It freezes constantly and crashes. I don't know if Amazon is to blame or Plex for not updating and fixing these bugs, but until they do I'm back to using a Roku.", "verified": true, "helpfulness": "0/0", "author": "Officer Rando"}, {"rating": 5.0, "review": "Excellent, just as advertised. Sound could be better.", "verified": true, "helpfulness": "0/0", "author": "Kenneth O'Block"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ricky"}, {"rating": 3.0, "review": "I like the fire stick for the most part.  We only stream netflix or amazon prime  videos.  However when streaming one show through the fire stick, it buffers at least 4-5 times throughout the show.  This is frustrating because when we view it through our gaming system we don't have an issue at all.", "verified": true, "helpfulness": "0/0", "author": "angie gardner"}, {"rating": 5.0, "review": "A huge hit in our house. I love the ease of use and there is never not anything on. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "S. Allen"}, {"rating": 5.0, "review": "Works great and was easy to setup", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 4.0, "review": "Bought the Roku Streaming stick and google chromecast.  Roku went to my parents, and the chromecast went right back to Amazon (it is utterly useless).I planned on returning the fire tv stick, but I liked it so much I decided to keep it.  Yes, I could have used my Xbox, but honestly it is so convenient I use it all the time, and I think it is worth the money just for the convenience aspect.  I wouldn't pay more than the current price for it though.The only reason it doesn't get 5 stars is because you CANNOT stream local media from your laptop to the device.  The only way to do this is to use Plex, which requires more money and honestly has a really bad user interface.  So, I still have to use my old school hdmi cable for local media on my laptop.", "verified": true, "helpfulness": "0/0", "author": "lobi"}, {"rating": 5.0, "review": "So easy to use! Beautiful picture on TV. Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Mimi"}, {"rating": 5.0, "review": "Amazing device, the best in the market so far! The remote is excellent, you don't have to point at the TV or Device to manage it. The device is very intelligent, has an excellent processing speed, the device is beautifully designed, the cost / value of the product is unbeatable!", "verified": true, "helpfulness": "0/0", "author": "Oscar Wlls \"Oscar_Pzs\""}]