[{"rating": 4.0, "review": "I would have given it  4 1/12 stars if possible. The only complaint is the response to the remote. The TV doesn't always respond to the key that's pressed. There weren't instructions where to point it . I've aimed it in the direction of the fire stick, at the LED strip and all over the screen. It doesn't make a difference. It takes a looooong time to navigate because of this. Other than that, it's great!!!!", "verified": true, "helpfulness": "0/0", "author": "original shopoholic"}, {"rating": 5.0, "review": "So easy to set up only few steps no problem wit charger or stick lots of  room for stick even without extender ( thanks tho) doesn't not block other cords or slots like other reviewers mentioned", "verified": true, "helpfulness": "0/0", "author": "chevze sherwood"}, {"rating": 5.0, "review": "Love it! The only complaint that I could possibly have is that the black part of the stick made it slightly difficult to plug it into my tv because the port on my TV is recessed slightly. But other than that, I love all of the features, and that it works so seamlessly with the aps! Perfect, and I would say its better than the Google Chromecast (which I have one of, and have loved so much!). The remote is great, and I appreciate that I have the option to use my phone as a remote in case I lose mine. :). Very happy with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 1.0, "review": "HBO go is slow and barley works w wifi at 15. Yet prime TV works just fine. Funny how that works.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "I am so glad I purchased this device.  For weeks I was trying to figure out how to connect my computer to my tv, but my computer did not have an hdmi port.Well with the amazon fire stick, I don't need one. The stick makes my computer a smart tv. How awesome is that! I love this stick, my only regret is that I did not know about it sooner.", "verified": true, "helpfulness": "0/0", "author": "Latrina Briggs"}, {"rating": 4.0, "review": "Good, reliable, amazing", "verified": true, "helpfulness": "0/0", "author": "WYMS GUERRIER"}, {"rating": 5.0, "review": "Easy to use, great price, awesome product!!", "verified": true, "helpfulness": "0/0", "author": "Gilberto Jimenez"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Cathie S"}, {"rating": 2.0, "review": "It worked great for a while but now there are many times that the picture freezes and the sound continues. After 10-20 seconds the picture then runs at high speed to catch up with the sound.", "verified": true, "helpfulness": "0/0", "author": "rk"}, {"rating": 5.0, "review": "works great and has an awesome picture", "verified": true, "helpfulness": "0/0", "author": "hailly blood"}]