[{"rating": 5.0, "review": "Absolutely love it.  I've had a Roku for a few years now, but this is a great replacement for it.  Only bummer is no HBO Go app (yet), but they say it's supposed to be coming soon.  Can't be beat for the price.", "verified": true, "helpfulness": "0/0", "author": "Brian Rose"}, {"rating": 4.0, "review": "Love it, but it has buffering issues compared to Chromecast or my Xbox.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Was lucky enough to get it at $19 for Prime launch offer. What a deal, it works well even though it has a few bugs. Regardless I bought two of them and use one when I travel. Very simple format.Suggested improvements:IOS compatible airplayIOS appBetter App/Movie browsingBesides these little things you can't go wrong for the price!", "verified": true, "helpfulness": "0/0", "author": "Avi"}, {"rating": 5.0, "review": "Just received the Fire TV Stick today. So far, I LOVE it! So smooth and so fast and it has a remote. I am very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Janeen Porter"}, {"rating": 1.0, "review": "It's rare I have anything to complain about when it comes to Amazon but this product was not ready for release. The remote is incredibly glitchy. It either does not register you be clicked or it registers more than one click and will fly the cursor across the screen. Sometimes it's impossible to make a single click. Say I want to move Right one-time. I click Right and it goes two spaces. Then I try Left and it goes two spaces back. This was incredibly hard to set up my WiFi network when one click would send the cursor to the end of the keypad and it would wrap back around and continue sometimes. The WiFi is hit or miss and during streaming of movies like on Netflix it would skip/freeze and blast an incredibly loud screeching noise. I found this device to be more of a pain than the potential value over a roku and am switching back to Roku stick/chromecast.", "verified": true, "helpfulness": "5/5", "author": "Sam Antonio"}, {"rating": 5.0, "review": "Love the simplicity and the ease of adding apps and navigating thru the apps", "verified": true, "helpfulness": "1/1", "author": "Lisa Jensen"}, {"rating": 3.0, "review": "I was disappointed that I couldn't connect to HBO GO yet. I was told that it would be available by the end of the year.", "verified": true, "helpfulness": "0/1", "author": "Daniel Blocklin"}, {"rating": 5.0, "review": "Great product at great price.", "verified": true, "helpfulness": "0/0", "author": "H S. \"haschultz1\""}, {"rating": 5.0, "review": "Loved how I can used it for all the new apps.", "verified": false, "helpfulness": "0/0", "author": "Marlonde"}, {"rating": 5.0, "review": "This little devices is a joy to use. The remote works good. Netflix and Plex work good. Probably wont be using our chrome cast much anymore. The games work well too.", "verified": true, "helpfulness": "0/0", "author": "RobbAce"}]