[{"rating": 3.0, "review": "The Stick is a bandwidth horder. Whenever the Stick is streaming all other internet devices in my house come to a pitiful crawl. It's very annoying.", "verified": true, "helpfulness": "0/1", "author": "MauiMaine \"Unchiman\""}, {"rating": 4.0, "review": "You tube app is better in chrome cast. But fire stick had Amazon prime which is great. The remote is very use full.", "verified": true, "helpfulness": "0/0", "author": "N Satish"}, {"rating": 1.0, "review": "Sooooo disappointed. No AV receiver support? C'mon Amazon, I'm a hardcore Prime user and thought this would be the best way to enjoy Prime content.I took my Chromecast out of my Denon AV receiver and plugged in my new fire stick and it just won't display.I pluged in this POS into a TV directly and was able to connect right away.Does anyone just use a TV in the living room anymore? How about surround sound? I am switching back to Chromecast and will make sure I don't recommend it to anyone (I'm an IT guy).", "verified": true, "helpfulness": "2/3", "author": "Kevin-Kay"}, {"rating": 1.0, "review": "Before even plugging the device into my TV I experienced a problem. The battery cover for the remote was impossible to remove with my fingers. After a few minutes I eventually had to use a small screw driver to pop it off. Of course it slipped on the first attempt and scratched the cover. So before even using the device it is damaged. I will update again after I use it for a few days.", "verified": true, "helpfulness": "2/4", "author": "Scott Hillman"}, {"rating": 2.0, "review": "When it works it's okay. But it doesn't work half the time. The overall design is mind boggling. The USB port is on the side of the stick. So if there is an HDMI plug-in next to it your usb cable will be in the way. To \"fix\" this Amazon includes an extension adaptor. Then the usb cable isn't long enough to run down to the floor. When I finally got it down to the floor the wall plug is too large to use with a power strip. It's too wide and blocks ports next to it. Also I received a pop-up saying I would get better performance if I plugged it directly in the wall and not the TV. I'm going to try plugging it in the TV and see if there is a noticeable difference. Some times the device won't connect to the network for unknown reasons. Sometimes the remote bugs out and it takes 30 to 60 seconds for each button press to register. Hopefully a firmware update fixes the software issues. But there's no fixing the choices that were made for hardware.Overall the device really wants you to watch Amazon content which was expected but other apps are in a small section to their own. I think more attention could be made to these. They are well displayed on the box but almost ignored in the menu.I picked this up half off on a 2 day preorder sale for Prime customer. I wouldn't pay more than that.  I really think it should be that price for all Prime customers all the time. If you're not a prime customer then 90% of the menus are useless for you.On a last positive note, the device came preconfigured. So my Amazon account was already setup and I was able to start streaming Amazon Prime immediately.If you can get one cheap and your a Prime customer, it's worth getting. (Assuming the software issues are fixed)If you're not a Prime customer get the Roku stick.", "verified": true, "helpfulness": "1/1", "author": "A. Griffith"}, {"rating": 5.0, "review": "Works like a charm", "verified": true, "helpfulness": "0/0", "author": "khftak"}, {"rating": 3.0, "review": "You are forced to see banner advertisements at the top of the Fire TV Stick UI, regardless if you pay for Amazon Prime or not. I have spoken with Customer Service and they advised they have been getting a lot of complaints about it.Other than that, it's pretty decent.  I use it in the bedroom, while having the full Fire TV in my living room.", "verified": true, "helpfulness": "11/12", "author": "Baden"}, {"rating": 5.0, "review": "Awesome! I can take it with me when I travel and catch up on all the latest shows!", "verified": true, "helpfulness": "0/0", "author": "Mia Rothwell"}, {"rating": 4.0, "review": "Am still learning it but like it very much so far.", "verified": true, "helpfulness": "0/0", "author": "Lyla04 \"Lyla\""}, {"rating": 5.0, "review": "Works great after I got it connected to my router. Now I can have Amazon prime on my bedroom TV. Surprise, bought it at Best Buy for $ 25 VS $39 for Amazon and I got it now, VS Amazon Jan 15, 2015.Sure is better and cheaper than Chromcast, especially since the Fire TV stick comes with a remote and chromecast doesn't. The remote makes all the difference in the world. And now there's an app to use on my cell phone as the remote and the cell app has voice activation where the remote for the fire tv stick doesn't.", "verified": true, "helpfulness": "0/0", "author": "Kimi Kagome"}]