[{"rating": 5.0, "review": "The fire stick is amazing! Easy to use and understanding the set up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Easy way to make a plain tv, into a smart tv!", "verified": true, "helpfulness": "0/0", "author": "sierra nichole travis"}, {"rating": 5.0, "review": "The greatest purchase ever! I let my mom check it out and now she's buying one.", "verified": true, "helpfulness": "0/0", "author": "Lindsay Patton \"~Lindsay~\""}, {"rating": 5.0, "review": "Plug it in and start streaming!  Great product!", "verified": true, "helpfulness": "0/0", "author": "Elaine Samson"}, {"rating": 5.0, "review": "Great product!  Easy to use.  It's sometimes disappointing to follow a TV series and then come to the next season when they want to charge for viewing; but we just switch to a different series.  Great value!", "verified": true, "helpfulness": "0/0", "author": "pubkings"}, {"rating": 5.0, "review": "Very good device.  I enjoyed it so much I bought a second.  Everything on it works and works fast, doesn't get much better or easier.  I have two complaints that I'm sure could be easily fixed with a software upgrade.  The first being with my 2nd device I had to sit through the intro video again.  The second complaint is that it will often hang while verifying the pin to watch a show.  Having kids with access to the TVs this is something that matters a lot to me.  Only fix I've been able to find is disable the pin security.", "verified": true, "helpfulness": "0/0", "author": "Curtis Ashcroft"}, {"rating": 4.0, "review": "I like this but it is VERY hard to get the batter cover off the back.", "verified": true, "helpfulness": "0/0", "author": "Tami Taylor"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Thomasena"}, {"rating": 5.0, "review": "Quick and easy to set up! Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love I!!", "verified": true, "helpfulness": "0/0", "author": "Mert378"}]