[{"rating": 5.0, "review": "love it! Easy to set up, easy to use. Going to get another.", "verified": true, "helpfulness": "0/0", "author": "S. Brew"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "John A. Stayn"}, {"rating": 4.0, "review": "Works well with our TV. Easy to set up. Only downside is if you are not a prime member and you accidentally select a Prime movie it will, without warning, start it and bill your amazon account for a Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Kevin Ferguson"}, {"rating": 5.0, "review": "The fire stick is perfect for us! We love it. Its easy to use, tnere's terrific selections of things to watch & we can watch when WE have the time. Not that there was anthing wrong with Netflix, we just never got around to watching what we ordered & now anything we think we might want to see is always ready when we are. Loving my Fire Stick!", "verified": true, "helpfulness": "0/0", "author": "C. Bender"}, {"rating": 5.0, "review": "Wow!!! Just what I needed for my Netflix account. Much better watching on 55inch screen than on my tablet.", "verified": true, "helpfulness": "0/0", "author": "Ron Morrow"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "mandy"}, {"rating": 5.0, "review": "easy  to install, now I can watch Amazon prime shows and not have to sit through the commercials that cable tv has!", "verified": true, "helpfulness": "0/0", "author": "book reader \"wheres text to speech\""}, {"rating": 5.0, "review": "so simple to setup! Gre", "verified": true, "helpfulness": "0/0", "author": "Orville Burlison"}, {"rating": 5.0, "review": "This works a lot better with Amazon Prime, YouTube, Pandora and other streaming apps then our Samsung Smart TV. It also allows us to use our Prime Music on our TV. We love it and now watch a whole lot more Amazon Prime video because it does not bomb out at all.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 4.0, "review": "Better than the app on my TV", "verified": true, "helpfulness": "1/1", "author": "Michael McCarthy"}]