[{"rating": 1.0, "review": "Purchased the Fire Stick primarily so I could stream Netflix. After several unsuccessful attempts and much frustration, I gave up, thinking it was my wi fi connection. Just ordered and received a ROKU 3 and it works great. Naturally it's too late to return the Fire Stick so it will be tossed into a drawer. If you're after Netflix, don't purchase this product.", "verified": true, "helpfulness": "0/0", "author": "Leow"}, {"rating": 5.0, "review": "This is a nice little device for watching your streaming services on any device with HDMI in. The number of Apps available is steadily growing and the interface is easy to navigate.Side Note for Amazon: The device does seem to get quite hot while plugged in. I have been unplugging it when i'm not using it so it doesn't get damaged.", "verified": true, "helpfulness": "0/0", "author": "OrrBITS Services \"Orracle\""}, {"rating": 5.0, "review": "Works really great.", "verified": true, "helpfulness": "0/0", "author": "TBar2"}, {"rating": 2.0, "review": "The instructions for and process of opening the remote leave a lot to be desired.  It requires an external power supply, which was not evident from the ad photos, though it is supplied.  Only runs on Wi-Fi.", "verified": true, "helpfulness": "0/0", "author": "Michael Tubbs"}, {"rating": 4.0, "review": "seems slow to select sometimes, but may be my router.  I am lousy at remembering names of movies and when I watch half of one and go back to find it to pick up where I left off, I cant find the movie, and so the search is on......anyone else have this trouble?  Otherwise I Love my firestick.  I had previously bought a Roku and after one movie it never worked again.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 5.0, "review": "Great purchase.", "verified": true, "helpfulness": "0/0", "author": "Jam71"}, {"rating": 1.0, "review": "Amazon markets this product as so superior to Apple TV...quad core, ASAP, etc. It is far from it.  I have slow internet but Apple TV works fine with only very minimal buffering. Fire Stick, on the other hand, buffers every 15 seconds......for 15 seconds.  Try and watch a show like that!  Apple wins.", "verified": true, "helpfulness": "0/0", "author": "Jeff Slate"}, {"rating": 5.0, "review": "BEST BEST BEST 39$ I ever spent.  I tell everyone about it, does a lot, and does it easily!  I watch Netflix about 10 times more than I used to!", "verified": true, "helpfulness": "0/0", "author": "Ruth E. Jones"}, {"rating": 5.0, "review": "Great value and remote. It is seriously perfect.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 4.0, "review": "IT'S OK KINDA HARD TO INSTALL SO I BROUGHT THE FIRE TV BOX AND ONCE THAT WAS INSTALLED THAN MY SON INSTALLED THE STICK ON HIS TV.", "verified": true, "helpfulness": "0/0", "author": "Ms judy"}]