[{"rating": 5.0, "review": "User friendly, affords a variety of entertainment options.", "verified": true, "helpfulness": "0/0", "author": "kapaul"}, {"rating": 5.0, "review": "This piece of equipment is powerful and does exactly what it promises to do without any complicated installation. Bravo, Amazon! You have done very well by your customers on this one...now to offer more free viewing options... ;-)", "verified": true, "helpfulness": "0/0", "author": "F. Salvato \"FrankS\""}, {"rating": 5.0, "review": "It was so user friendly to set up and start enjoying.  We haven't had any problems and are so happy with all the viewing options it affords.", "verified": true, "helpfulness": "0/0", "author": "Linda D Davis"}, {"rating": 5.0, "review": "The Fire TV Stick is awesome.  Got it yesterday and watching a streaming basketball game on espn3 now.  Simple setup, and works so seamlessly.  Much better than the google Chrome stick.  I may order another for my other tv.  Get one.  You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "cbHoo"}, {"rating": 4.0, "review": "Good device.  Adds a lot of versatility to a TV.", "verified": true, "helpfulness": "0/0", "author": "R.J.P. \"spiderwebil\""}, {"rating": 4.0, "review": "Great for viewing missed programs", "verified": true, "helpfulness": "0/0", "author": "ann stacy"}, {"rating": 5.0, "review": "Two words,  LOVE IT. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Eugenia"}, {"rating": 4.0, "review": "So far I am pleased with the Fire Stick. It has all the apps we need for streaming shows and movies. Although I feel it tends to buffer more than other streaming devices I've used but this may just be a WiFi issue. Overall it was a good purchase.", "verified": true, "helpfulness": "0/0", "author": "Toni"}, {"rating": 5.0, "review": "Wicked awesome just replace my chromecast with the fire stick it is so much easier for my wife to operate and with me being a walking commercial for amazon all of my prime benefits makes it that much better. Wish it was available before I bought the chromecast. I would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Gym Shu"}, {"rating": 1.0, "review": "I cannot even rate the actual value of this item even though I have had two sent to me. The first apparently had an identical serial number as someone else's product and therefore could not be registered. It had to be returned. The reconditioned replacement would not even turn on because it had old software. It had to be returned too. I have spent two hours 'using' these two items and was never even able to get to the home screen. Incredibly frustrating. Would give 0 stars if possible.", "verified": true, "helpfulness": "0/0", "author": "Ann"}]