[{"rating": 2.0, "review": "I feel in love with it until today, about 2 or 3 weeks after purchasing. Out of nowhere it started freezing every time I tried to press a button. Is this normal? I've been struggling with this thing for a while trying to get it to work right and no luck. There's been no damage to the stick, cord or remote.  And the internet connection is fine so I don't understand why the apps are freezing. I can't even navigate through the home screen. Hopefully this problem doesn't last, then this would definitely be a five star purchase", "verified": true, "helpfulness": "0/0", "author": "Zhantinique F."}, {"rating": 5.0, "review": "Love it, works great!", "verified": true, "helpfulness": "0/0", "author": "Rich Smith"}, {"rating": 5.0, "review": "Absolutely love this. Im glad I added this to my collection along with my chromecast! Fixing to cut the cord with cable.", "verified": true, "helpfulness": "0/0", "author": "A.Taylor"}, {"rating": 5.0, "review": "Made my not so smart tv smarter and more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "scott a."}, {"rating": 1.0, "review": "This item not good put your money in a smart tv would. Not buy one again", "verified": true, "helpfulness": "0/0", "author": "fielding gantt"}, {"rating": 5.0, "review": "A++++ Product I highly recommend", "verified": true, "helpfulness": "0/0", "author": "Livingston Levasseur Jr"}, {"rating": 5.0, "review": "I am so in love with this item!!!", "verified": true, "helpfulness": "0/0", "author": "KERI L RAWLS"}, {"rating": 5.0, "review": "This little device has made me so happy. This just plugs into the usb port of your TV. No wires, no space needed. This was so easy to install and it has taken over my tv. Seriously Dish Network called to ask it we were having technical issues due to lack of use. Add a few apps and watch you TV bill drop. I am very happy with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Miranda N"}, {"rating": 5.0, "review": "I cannot give enough accolades to this Fire Stick.  SUPER easy to install.  Crystal clear picture.  The only \"thing\" that confused me was the APPS.  For example:  I watch a lot of YOUTUBE. Simply toggle down to the APPS,  search for YOUTUBE,  download it,  and you're on.  Most other streaming services are pre-loaded on the device.  GREAT, SUPER, FANTASTIC product.  I see NO downside:  other than if you're not an AMAZON PRIME member.  Still,  NOT having so much \"stuff\", physical discs and cases of DVDs,  in my home is another plus.  So, even if you're not an AMAZON PRIME member (although it is a GREAT DEAL),  you can still amass a great MOVIE LIBRARY store on Amazon,  not all over your house.", "verified": true, "helpfulness": "0/1", "author": "Stefan Hayes \"Stefan Hayes\""}, {"rating": 4.0, "review": "it works verry good slow but its ok", "verified": true, "helpfulness": "0/0", "author": "noel"}]