[{"rating": 4.0, "review": "A funny thing happened to me on the way to set up my \"Fire stick.\" Not ha, ha, funny, but weird. I spent an hour trying to sign in to sign in to Amazon with no luck whatsoever. After several calls, I decided to return the device. On a \"lark\" I went to my \"Content and devices\" page on Amazon. It was there I noticed that the device listed on that page had a different serial number than the one sent to me. Oh goodie, I get to make another phone call to Amazon. I was told that the SN listed on my \"Content and devices\" page was already registered to someone else...??? Anyway, no one knew what to do next. Eventually I received an email that someone would contact me in 24-48 hours.I have an idea... Jeff, why don't you spend as much time and effort making Amazon work properly, you know... kind of like the Washington Post does reporting with the news....just a thought.12/15/2014Amazon finally got the serial number mess straightened out. Since that time, the unit has worked quite well for Amazon Prime and Netflix videos. I am changing my review to 4 stars and the only reason it is not given 5 stars is due to the fact that the remote is not the least bit intuitive and is very difficult to operate.", "verified": true, "helpfulness": "1/5", "author": "Phasr \"phasr\""}, {"rating": 5.0, "review": "Easy set up, easy operation.  Does what it says it will do.  I have a couple of HDTV's without apps for Amazon Prime and a few other services.  For the low cost of this item, I was easily able to upgrade those TV's.  Clear picture and very fast operation.  My only issue is that there is no iOS app yet for iPhones so that I can use the voice command.  But they say it's coming soon.", "verified": true, "helpfulness": "1/1", "author": "berfab"}, {"rating": 5.0, "review": "Great little excellent device.", "verified": true, "helpfulness": "1/1", "author": "pivosguy"}, {"rating": 5.0, "review": "Love it! Easy to install and play my Prime videos and Netflix.", "verified": true, "helpfulness": "1/1", "author": "Meme"}, {"rating": 1.0, "review": "Piece of junk, stopped working after a day; I googled online and tried all suggested fixes -- unplug hdmi, re plug, unplug TV.... Nohing works, a waste of time and money. And then when I try to reset to factory setting, it forces me to watch the stupid cartoon intro again, I'm not kidding, there is not even a way to skip the intro! I have to sit through the annoying thing again! It's already wasted too much of my time, going back to the very old but reliable Apple TV.", "verified": true, "helpfulness": "4/10", "author": "Fay Zhao"}, {"rating": 5.0, "review": "I was fortunate enough to have received one of these at the promo rate of $19.  After about an hour of playing around with it, I quickly went to the local brick and mortar store where they were on sale for not a lot more than that and picked up a couple more as gifts.  Plenty of people have and will continue to make comparisons to all of the alternatives but, on a standalone basis for the price, this is a great value.As for the device, it is compact and well designed.  The remote is simple enough that less tech oriented folks won't be scared away.  Because it is a Bluetooth remote, it seems to work better than my infrared ones.  Almost no glitches with streaming, even in a room far from the router where the ipad struggles to hold a signal.So, well done Amazon.  In addition to the kindle I've had for the past 4 years which allows me to conjure up books into my hands in seconds in the middle of nowhere like a wizard, I can now pick and chose movies, tv and youtube clips to zap all over the place.  Can't wait to see what you all think up next.", "verified": true, "helpfulness": "1/2", "author": "Ken H."}, {"rating": 4.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "customer60"}, {"rating": 5.0, "review": "Exceeds my expectations.Setup was easy to my wireless network. Navigation is also easy at the top and at each level. Information is clear for me as a Prime member about Prime tv and Prime movie options. I installed, opened and used several apps and found that process to work well also. Movies stream without hesitation making our movie viewing experience one my wife and I enjoyed more than a couple of other services we used to use. The Fire TV Stick was a good choice for me and I primarily purchased it because I am a Prime member. I highly recommend it.", "verified": true, "helpfulness": "1/2", "author": "William Manns"}, {"rating": 5.0, "review": "Works better than I expected! Netflix, Amazon Prime, and Hulu Plus accounts work great! OS is very responsive to the remote control. So glad I purchased it.", "verified": true, "helpfulness": "1/2", "author": "Jose A Menchaca"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "1/1", "author": "Jacques St. Louis"}]