[{"rating": 5.0, "review": "I love this! Works great!", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 2.0, "review": "This is a fast device compared to others and it performs better and faster than the built-in apps on my new Sony TV. However, this device whose primary function is watching movies has NO 24HZ OUTPUT SO THE MOVIES LOOK LIKE CRAP VS. THE 24HZ OUTPUT MODE MY TV HAS.", "verified": true, "helpfulness": "0/0", "author": "Trace"}, {"rating": 4.0, "review": "We live in the country so our internet is slower than some.  We upgraded our router to make the Fire Tv Stick work.  It works ok for most programs but ESPN keeps loading during games.", "verified": true, "helpfulness": "0/0", "author": "Carla"}, {"rating": 5.0, "review": "Overall great product.  Lost internet connection when the internet was working properly.  The remote is very handy making the app not necessary.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Plugged it in and do to ordering from Amazon, account info was already there. Took a couple minutes to update. Connected to wi-fi without any issues. FYI, since I have a home entertainment center with receiver, I just plugged it into an extra HDMI port on receiver instead of TV and works perfect.", "verified": true, "helpfulness": "0/0", "author": "Jim White"}, {"rating": 4.0, "review": "The Remote Control for this unit leaves a lot to be desired. For starters,the battery cover was almost impossible to remove in order to install the batteries. The upper round selector is flimsy at best. I am a Prime member and bought this to watch free Prime media and for that,it does a reasonably good job.", "verified": true, "helpfulness": "0/0", "author": "Misteron"}, {"rating": 4.0, "review": "Wish It was easier to throw whatever was on my computer or tablet screen onto my fire tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I just installed yesterday.  It's an amazing piece of technology.  Very easy to install.  The directions are simple.  Works very well so far.", "verified": true, "helpfulness": "0/0", "author": "jbones"}, {"rating": 5.0, "review": "Easy to setup & works great!", "verified": true, "helpfulness": "0/0", "author": "Michael N Norman"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "david varnadore"}]