[{"rating": 5.0, "review": "Quick response time and upgradable.  Works much better than my smart dvr.", "verified": true, "helpfulness": "0/0", "author": "Kahoo5"}, {"rating": 3.0, "review": "Bought the device and it works as advertised...but so do Chromecast, Roku, Apple TV and others. What I find EXTREMELY irritating is that you are FORCED to watch a 5 minute \"dummies-level\" video about the product! No way to skip past or opt-out. Not cool, and negatively colors my attitude about the product before I even get a chance to use it.", "verified": true, "helpfulness": "0/0", "author": "E. Daniel Polanek"}, {"rating": 2.0, "review": "I.. bought the Fire TV stick to access Netflix from my HDTV. I use an HD DVD player for that now. The resolution of the Fire TV stick was worse than my HD DVD. The games on the Fire TV stick are not good.", "verified": true, "helpfulness": "0/0", "author": "Rick Panesi"}, {"rating": 4.0, "review": "Fire Stick TV works nicely except when it freezes, and then I have to start all over with my download.  That's the only frustration.  I like that I can see all the sports that are available and up to date Wall Street Journal.", "verified": true, "helpfulness": "0/0", "author": "Thomas R Hemphill"}, {"rating": 5.0, "review": "Great product! Recommend to anyone..", "verified": true, "helpfulness": "0/0", "author": "Thna Kop"}, {"rating": 5.0, "review": "Love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Jill Killeen (Jilda)"}, {"rating": 5.0, "review": "I wasn't sure what to expect with such a low profile device, but am very pleased with the Fire Stick. It was a very simple setup with a good tutorial.", "verified": true, "helpfulness": "0/0", "author": "Mark Galaydick"}, {"rating": 5.0, "review": "Easy to set up.  Works great with Netflix.  Also downloaded app for my iphone to use as remote with this and that works as well.  Great alternative to a laptop or netbook if you don't have a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Regular Amazon Customer"}, {"rating": 5.0, "review": "We love it so much we bought another one for a different TV.", "verified": true, "helpfulness": "0/0", "author": "Dawn Ortega"}, {"rating": 4.0, "review": "Amazing purchase", "verified": true, "helpfulness": "0/0", "author": "cmancusi"}]