[{"rating": 5.0, "review": "Good product --Good value", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "It was so easy to set up and works great! Such a great price too!", "verified": false, "helpfulness": "0/0", "author": "Alex C"}, {"rating": 4.0, "review": "Overall, I'm pretty impressed with the Fire Stick.  The remote is great and the browsing experience is pretty good.  App selection is pretty good and loading apps is really easy.The only problems that I have had are the occasional audio glitch during playback and that the Fire Stick sometimes loses or forgets the wireless connection/password when waking from sleep mode.  The wireless problem is really annoying when it happens (3 times in the first week of use), and is the reason I knocked the rating down. Hopefully, both of these issues can be fixed in a future software update.The one feature that I really find myself missing is the screencasting ability.  Hopefully, this is a feature that will be released in the future.Overall, I'm really happy with the Fire Stick so far, and would definitely recommend it for anyone looking for a good, cost effective solution for streaming.", "verified": true, "helpfulness": "0/0", "author": "Adam D."}, {"rating": 4.0, "review": "Love it. The images/playback is excellent. The interface and the remote is easy to use", "verified": true, "helpfulness": "0/0", "author": "Wing Chan"}, {"rating": 4.0, "review": "Great over all. Minor bug with stuttering but not that big of a deal. Will look into getting the full FireTV for sure. Phone app could use more work but thats a different review.", "verified": true, "helpfulness": "0/0", "author": "Derrick Doss"}, {"rating": 2.0, "review": "Easy to set up but unable to avoid buffering… Due to low bandwidth in the house.  However, banwidth works fine for all other applications.", "verified": true, "helpfulness": "0/0", "author": "Terry A. Hagan \"Terry\""}, {"rating": 2.0, "review": "The wireless is weak. Connection and streaming is much slower than our other streaming devices even when in the same room as the router. It's a great concept, but I wish I would have waited before purchasing.", "verified": true, "helpfulness": "0/0", "author": "TGreen"}, {"rating": 2.0, "review": "Had a helluva time getting Netflix.", "verified": true, "helpfulness": "1/1", "author": "Dennis Nocerini"}, {"rating": 5.0, "review": "Very satisfied with the Fire TV Stick so far", "verified": true, "helpfulness": "0/0", "author": "Patricia Chewning"}, {"rating": 5.0, "review": "It has a few glitches, BUT I am sure they will be fixed as time goes on. I love this little device and plan on replacing my Roku 3 with it.I work in the CCTV field and would love some of the more popular DVR and NVR apps to be ported to android stick.", "verified": true, "helpfulness": "0/0", "author": "Scott Ferguson"}]