[{"rating": 5.0, "review": "Very easy to install.....the content is great!", "verified": true, "helpfulness": "0/0", "author": "sean flynn"}, {"rating": 4.0, "review": "My first time using the stick was a little bumpy -- in fact, I was frustrated and angry because it kept dropping our wifi signal (which is very strong in the room).  I read a help forum and found out if you push the home and play button at the same time it will do a hard restart of the device and after that it worked well.  We've used it twice and I hope the wifi problem doesn't reappear.Aside from the wifi, the ability to view photos (I have most of our photo on the Clouddrive) and view tons of TV shows and movies is fantastic. This could be the future of cable-less TV.", "verified": true, "helpfulness": "0/0", "author": "R. Williams"}, {"rating": 3.0, "review": "MOST ALL OF THE MOVIES & TV SHOWS ARE REAL OLD UNLESS YOU PAY FOR THEM JUST LIKE YOU WOULD ON REGULAR TV", "verified": true, "helpfulness": "0/0", "author": "Sally B."}, {"rating": 1.0, "review": "This was the most annoying thing to set up.  I still don\"t know if I'm keeping it.  My HDMI is in the back of my plasma and even with theextender the stick does not stick out very far.  I could not figure out why I couldn't get it to work for the longest time!  All the new electronics Ihave the signal bounces around and connects and this thing bounced but was so slow it was CRAZY!  If your HDMI is in the back DO NOTBUY IT.  I have it taped so it barely sticks out.  If you have Amazon prime you'll get more use out of it than I am.  I mainly bought it for Netflixbut since its slow I don't know if I'll keep it. If you do want this device e prepared to wait.  Amazon is always fast with my deliveries, but itwill take awhile to get this device.  I waited almost 3 weeks, which is unheard of for Amazon.", "verified": true, "helpfulness": "3/4", "author": "Amazon buyer"}, {"rating": 5.0, "review": "It is amazing!!! I love it! I  am so happy I got it, totally worth the price! I can listen to my pandora, watch youtube,...it's very fast... IT'S AMAZING !!!", "verified": true, "helpfulness": "0/0", "author": "Anita Simic \"nitica\""}, {"rating": 5.0, "review": "Love the Fire Stick!.", "verified": true, "helpfulness": "0/0", "author": "russvmo3"}, {"rating": 5.0, "review": "Very easy to set up. Plug it in, register it to your account and your ready to go. Every show and movie streams smoothly and no bufffering slowing it down. Would recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Matela"}, {"rating": 5.0, "review": "Works great very easy to install and operate .", "verified": true, "helpfulness": "0/0", "author": "Joy Albert"}, {"rating": 3.0, "review": "Too soon to give an accurate review so far I like my Roku better.", "verified": true, "helpfulness": "0/0", "author": "George E. Dunn \"ED\""}, {"rating": 5.0, "review": "We love our Fire stick.  Easy to set up and use.  Good price too.", "verified": true, "helpfulness": "0/0", "author": "luvmydogs"}]