[{"rating": 2.0, "review": "Stick is nice, but it lacks some of the compatibility that its competitors possess. Not able to load apps that are already on my Kindle fire, in particular the JW app.", "verified": true, "helpfulness": "0/0", "author": "Larry Ray"}, {"rating": 5.0, "review": "I was able to install it myself and I am not handy with such things.  I did not realize that there was little I could see without subscribing to Prime or Netflix, but since getting the free trial of Amazon Prime, I have really been enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Bunny"}, {"rating": 5.0, "review": "Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Ike Oglesby"}, {"rating": 3.0, "review": "It is  OK. I usually use my Samsung smart apps over the fire stick. It has better pause and scroll features.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "stabtg"}, {"rating": 5.0, "review": "Absolutely love thus device,  can't wait until the update comes available to where u can screen mirror devices.  The first one had connectivity issues so I replaced it with a new one . This is working pretty good. Definitely would recommend to 9th ersion especially if you have amazon prime. Watch play and relate and also enjoy. Enjoy giving good reviews for good products. Keep em coming.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "DD"}, {"rating": 5.0, "review": "use this almost every night to miracast by kindle fire. this thing is AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "This thing is awesome. It has opened my eyes to many great tv series that I wouldn't have known existed! I went to Best Buy to replace my hdmi cable that I used from my laptop to stream movies. They recommended this instead. Now, if only I could get the internet  service (ATT) to fix the broadband so I can stream uninterrupted, that would be awesome.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Justin A."}]