[{"rating": 5.0, "review": "Best on the market!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Russell M. Cowley"}, {"rating": 4.0, "review": "Easy to set up and use. Does everything I need it to and then some. Only problem I had is the power cord is so short.", "verified": true, "helpfulness": "0/0", "author": "Chris Turner"}, {"rating": 2.0, "review": "It's practically unusable for me.Maybe my wireless adapter is to far away (roku works)The layout is lovely and I wish I could keep it. But it just doesn't work.", "verified": false, "helpfulness": "1/1", "author": "Lori Anna Epp"}, {"rating": 4.0, "review": "four", "verified": true, "helpfulness": "0/0", "author": "jean rockwell"}, {"rating": 4.0, "review": "Glad  a friend ordered the Fire TV Stick for me. I now watch Netflix from the comfort of my couch instead of watching it from my chair in front of the computer.", "verified": true, "helpfulness": "0/0", "author": "Darlene Hunter"}, {"rating": 5.0, "review": "I am not really very interested in all of the latest gadgets.  But the fire stick is so easy to use and is totally worth it if you're already a prime member, as I was.", "verified": true, "helpfulness": "0/0", "author": "Janet \"Janet from New Jersey\""}, {"rating": 5.0, "review": "Love it!  Wish I had ordered it sooner!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Got it for Christmas present and haven't had time to really enjoy it. Did watch Nebraska with my husband last weekend.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Joki"}, {"rating": 5.0, "review": "this was given to us as a Christmas present.....we couldn't be more pleased. It was very easy to set up and the availability of shows, TV and movies, is wonderful.  It is much better that the Chromecast we bought and pay for Netflix to see the same thing and more from Amazon.  If you live in an area without cable this is the best thing we have used so far.", "verified": true, "helpfulness": "0/0", "author": "Dianne J."}, {"rating": 5.0, "review": "This is a great streaming device.  Never goes into buffering mode and is super fast.  The content available for free to Prime members is outstanding.", "verified": true, "helpfulness": "0/0", "author": "T. Campbell"}]