[{"rating": 5.0, "review": "Love it! Makes my life so mush easier watching stuff on my TV instead of the tiny computer screen.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "Great product, really enjoying it, received it as a gift!", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 5.0, "review": "Easy to understand. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Joanna Prescott"}, {"rating": 5.0, "review": "Easy to set up. I love it!", "verified": true, "helpfulness": "0/0", "author": "chargers"}, {"rating": 5.0, "review": "I'm pleased but my internet connection is too weak most of the time and that makes me crazy.  Trying hard to correct that problem.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Kelly"}, {"rating": 5.0, "review": "Purchased this for my mother. For me the easier to set something up the better. This really is plug and play and is very easy to use. My mom has cable internet so no issues with buffering. She uses it to watch netflix and prime and does not use the other features. I also purchased a USB power adapter that is sold on Amazon so that I would not have to run another power cord from her TV. Good product. To be honest I think this ought to come with the USB power cord just so it is more tidy to set up.", "verified": true, "helpfulness": "0/0", "author": "David L. Johnson"}, {"rating": 5.0, "review": "This has movies and shows for the whole family.", "verified": true, "helpfulness": "0/0", "author": "D. White"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "No better way to consolidate all apps and TV, movies and music in one", "verified": true, "helpfulness": "0/0", "author": "Cameron Allsop"}, {"rating": 5.0, "review": "I don't know how we've gotten along with this thing! Just plug it in and go. We just went camping for a week and brought it with to plug into our camper tv for rainy days. Worked like a dream! I love that I don't have to tote our Wii all over the house just to watch Netflix and Amazon Prime anymore. Now we can watch them on any tv in the house! We may be buying another one :)", "verified": true, "helpfulness": "0/0", "author": "J. Rysdam (Mother of 5) \"Mother of 5\""}]