[{"rating": 5.0, "review": "Easy ser up and easy-to-use! Only issue so far is it said it was connected to the internet but had problems. Simply unplugged power cord and plugged back in and everything was good to go again!", "verified": true, "helpfulness": "0/0", "author": "ramsfan"}, {"rating": 5.0, "review": "It works really well. I have no problems with it.", "verified": true, "helpfulness": "0/0", "author": "Melvin"}, {"rating": 4.0, "review": "Works well.  With more apps such as Vudu and other streaming apps, I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just one word: Amazing! Excellent product from amazon. Easy to use and good looking build. The best product for the price.", "verified": true, "helpfulness": "0/0", "author": "Ricardo A. Vargas R. \"R. Vargas\""}, {"rating": 1.0, "review": "Didn't work for me.  I had to return it.  Kept losing connection.", "verified": true, "helpfulness": "2/3", "author": "Rachel L. Walker"}, {"rating": 5.0, "review": "Great quality!", "verified": true, "helpfulness": "0/0", "author": "Ricardo"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Rita Nesteby"}, {"rating": 3.0, "review": "Update: After numerous times of reset/restore, the stick is now functioning, still intermittent connection issues, but at least working.So I would give it a 3 star instead of 1.A couple of annoying things:  It often hijack the TV without me choosing the HDMI portal. I turn off TV on cable (connected to my HDMI 1) or on apple TV (HDMI 3) then later I turn TV back on, it is on amazon fire stick (HDMI 2), tried swapping HDMI hubs, still hijacking it.===========================================================================================================================================Since I got it, I had trouble with wifi connection.It can connect with my wireless but with problems. I had apple TV, fireTV stick both connected. FireTV kept getting connection problems.Stream stops seconds after playing. Can't watch at all.Try restart router, restart fire TV, reset everything. Didn't work. While apple TV at the same time had no problem streaming.", "verified": true, "helpfulness": "2/3", "author": "USC Trojan"}, {"rating": 5.0, "review": "We love it. It works so much better than I though is would!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "no clear instructions on line or in package on what all \"channels\" you can get for free or buy paying, I gave up and have not used it, very disappointed, I thought I would be able to get some channels without paying monthly premiums", "verified": true, "helpfulness": "0/2", "author": "penny trevithick"}]