[{"rating": 3.0, "review": "I like getting my prime video, but still have to use my Chromecast, and in fact my chromecast is used more. Since my TV only has one USB, the chromecast wins. Why? Youtube. Fire TV stick will not play it. I am a heavy Netflix user, light Prime User. If you are a heavy Prime Video User, this is 5 stars all the way for you. The setup is easy and intuitive. The device is sleek. Nice work Amazon. Great product. I bought mine on sale for $39 (pre-release I think). I would hate to pay more than that for this, but again, I like Chromecast better.", "verified": true, "helpfulness": "0/0", "author": "AMG Enthusiast"}, {"rating": 5.0, "review": "Excellent product!!!", "verified": true, "helpfulness": "0/0", "author": "JHAIR U. FOSSATTI E. PTY 41798"}, {"rating": 5.0, "review": "It's even more than I thought", "verified": true, "helpfulness": "0/0", "author": "Connie Federbusch"}, {"rating": 5.0, "review": "i like the ease of converting between tv & fire stick, 2 click switch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up and even easier to use.  Navigating from home screen to various options was also simple and intuitive.  We have a standard DSL and have not experienced any problem in streaming to our TV.  The fire stick has met all of our expectations and the price was right.", "verified": true, "helpfulness": "0/0", "author": "Roy Thomas"}, {"rating": 1.0, "review": "Please read before you purchase this item.  I have now owned this for 6 months and honestly have given up with it.  My wireless connection reads VERY GOOD..  no issues with any other devices in my house.  My wireless router is exactly 12 feet away.  Every time I attempt to use I get a connection error.  If it does work is very briefly before it timeouts.  This is NOT worth the price.  I would recommend other options, Cromecast or Apple TV.  Don't waste your money,", "verified": true, "helpfulness": "1/1", "author": "Jeffrey G."}, {"rating": 5.0, "review": "Awesome product! When you select one of your songs on amazon music it shows the words on the tv like karaoke and  can play your music while browsing  or playing video games. My children love it. I plan to order one for every room in the house.", "verified": true, "helpfulness": "0/0", "author": "Leslie N Horan"}, {"rating": 4.0, "review": "Perfect fit for people who have limited tv channels.", "verified": true, "helpfulness": "0/0", "author": "Craig T Ryerse"}, {"rating": 4.0, "review": "I like it accept my WiFi clicks in and out. Also", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Chromecast is no where comparable to.fire stick. Excellent product from amazon.", "verified": true, "helpfulness": "0/0", "author": "VM"}]