[{"rating": 5.0, "review": "Super easy set-up and even easier to use for Amazon Prime.  Well worth the money", "verified": true, "helpfulness": "0/1", "author": "Billy"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/1", "author": "Donald A. Korpi"}, {"rating": 4.0, "review": "Works much better than Chromecast.  Much faster than Roku and other products we have tried.  Successful!", "verified": true, "helpfulness": "0/1", "author": "Rachel Matthews"}, {"rating": 5.0, "review": "This product is badass. Simple to connect and now I'm on Netflix 24/7. I'm less productive than ever!", "verified": true, "helpfulness": "0/1", "author": "Dillion McCown"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/1", "author": "Steven M. Simpson"}, {"rating": 5.0, "review": "I am ordering my second one for the master bedroom!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I originally order the Fire stick for one tv but the cord would not reach the outlet. Instead of waiting to buy an extension we decided to use it for a different tv and so far it is great. The set up was so easy that my teen completed it and installed the app on the cell phone. My younger child also can use it easily. The only reason I gave it four stars is that it came with the cord which was too short for what we originally wanted and I feel Amazon should make the cord longer since I'm sure many users have a tv not so close to an outlet. Otherwise I love this device.", "verified": true, "helpfulness": "0/1", "author": "angela schroth"}, {"rating": 5.0, "review": "Works great for the cost", "verified": true, "helpfulness": "0/1", "author": "javier ortiz"}, {"rating": 5.0, "review": "The Fire TV stick is very sleek and easy to use. All of the popular apps are available (except HBO Now) and are in their most updated and visually impressive form. I recently cancelled my cable TV service and replaced it with this product and I am very happy. The one thing I didn't expect was to have to plug it in to a power source but it's no real issue since I have ample space on the power strip I use for the TV and it's not mounted on the wall. I also appreciate how portable it is (you can plug it in to a hotel TV and connect to the wireless there-as long as it's free); my boyfriend and I will be taking it on vacation and work trips now!", "verified": true, "helpfulness": "0/1", "author": "Monica"}, {"rating": 5.0, "review": "Setup was easy I'm happy with my purchase . Amazon.com is the best!", "verified": true, "helpfulness": "0/1", "author": "josephine rivera"}]