[{"rating": 4.0, "review": "Worked as advertised - easy set-up", "verified": true, "helpfulness": "0/0", "author": "David Clegg"}, {"rating": 5.0, "review": "Love this device!  If I could control the Stick's product managers, I would ask for two enhancements.1) Control volume from the Stick2) Draw power from its TV to avoid dangling cordsGood job!", "verified": true, "helpfulness": "0/0", "author": "John  James"}, {"rating": 5.0, "review": "It basically makes any TV a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Phil McLain"}, {"rating": 5.0, "review": "I am very happy with my recent purchase of the Amazon Fire Stick. I purchased it as a replacement for a last generation console system I used to stream content. Compared to other streaming devices I own, I don't have the issues with buffering or hanging. The picture quality is great and the interfaces with Netflix and Hulu plus are fluid and not clunky as with other device services. At the time of this review I have not fully explored all the potential within the product but I feel with what I've seen it is a welcome edition to our AV setup.", "verified": true, "helpfulness": "0/0", "author": "William Hampp"}, {"rating": 5.0, "review": "It's just what it was advertised to be, a portal into my Amazon world. Easy to use, straightforward and intuitive. Simple. I like simple.", "verified": true, "helpfulness": "0/0", "author": "R. Rhyne"}, {"rating": 5.0, "review": "I love it and its more than I expected!!! Great investment", "verified": true, "helpfulness": "0/0", "author": "Vanessa weaver"}, {"rating": 3.0, "review": "Very useful", "verified": true, "helpfulness": "0/0", "author": "brian l rappach"}, {"rating": 2.0, "review": "it is what it is..... was disappointed when I found out it has to be connected to a 110v outlet.... I wouldn't of bought it if I knew that... The reason I got it was so I didn't have to use my ps3 on the living room TV (less wires)", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 5.0, "review": "I love it! Easy to set up and easy to use. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Helen Grant"}]