[{"rating": 4.0, "review": "Faster than roku box and no buffering but amazons ad is misleading it does not come with voice search the remote is a $40 upgrade.", "verified": true, "helpfulness": "0/0", "author": "ben"}, {"rating": 4.0, "review": "Very nice, got it on sale and wish I had ordered a ton for gifts while it was on sale.", "verified": true, "helpfulness": "0/0", "author": "Shaun Knopf"}, {"rating": 1.0, "review": "not as user friendly as you claim. Not point and go at all.  Way to many hoops and bells to navigate, and not true about how much content is easy access and free. not impressed at all.", "verified": true, "helpfulness": "1/1", "author": "denny oneil"}, {"rating": 5.0, "review": "I had to wait a month to have it shipped. It's everything I was expecting. I'm looking forward to enjoying all the different programming it offers.", "verified": true, "helpfulness": "0/0", "author": "Craig Baader"}, {"rating": 5.0, "review": "very intuitive for older folks and something you can get as a gift for dear old mom or dad that they will not discard in frustration. All you need is active wi-fi and an open HDMI port and you are in business!", "verified": true, "helpfulness": "0/0", "author": "Scott C. Barbu"}, {"rating": 5.0, "review": "Best gift I have ever gotten!", "verified": true, "helpfulness": "0/0", "author": "Deanna V."}, {"rating": 4.0, "review": "Took a long time to receive it, but it works as advertised! Took off 1 star for the long wait.", "verified": true, "helpfulness": "0/0", "author": "teknut"}, {"rating": 2.0, "review": "Amazon's hardware is beginning to frustrate me.  This is a nice device, the price is good, but like with other Amazon hardware, like the Fire tablets and Fire Phone, Amazon is being heavy handed, yet again..  I have a Roku on another TV and I thought this Stick would be similar. Being I own a Fire Tablet owner I should have known better.  This Stick it's almost all or nothing with just Amazon Prime content. Finding and using other services isn't easy, and the Menu search function on the Stick only searches Amazon Prime for movies, TV shows, etc., not Netflick's, Hulu, etc.. If Amazon is going to stay in the hardware business I wish they would learn to play nice with other services and companies.  I do understand that they want to put their products and services up front, but to the point of excluding Google Play from their tablets and not having a menu search for all the services on the Fire isn't doing them any good and to be honest comes off as slightly childish.", "verified": true, "helpfulness": "1/2", "author": "Mr.Bill"}, {"rating": 4.0, "review": "Very seamless.", "verified": true, "helpfulness": "0/0", "author": "Erjb"}, {"rating": 5.0, "review": "Love my Fire TV Stick.  Always had trouble connecting through my DVD player.  My Fire TV makes it so much easier to enjoy my movies and Netflix!", "verified": true, "helpfulness": "0/0", "author": "Love to Read(er)"}]