[{"rating": 5.0, "review": "I bought the Fire TV Stick because I was sick and tired of my PS3 not logging into the PSN network, and not letting me watch my Netflix account.  It works great, early to use, and streams fast.  I'm happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "lizzygilly \"lizzygilly1128\""}, {"rating": 5.0, "review": "LOVE IT!!! So much better than having to use cable", "verified": true, "helpfulness": "0/0", "author": "nikkiwhy"}, {"rating": 5.0, "review": "Works great with Netflix, SlingTV, and Pandora. Very easy to use.  Just plugged it in and started watching.  Could not be happier.", "verified": true, "helpfulness": "0/0", "author": "Eugene K Getz"}, {"rating": 2.0, "review": "The main reason I bought this was to stream MLB.tv games.  Installation and setup was a breeze.  The menus were a little crowded for my tastes, but it was pretty easy to navigate around, even with the super-basic remote (no QWERTY keyboard?).  Tried streaming a few things on Prime, and they looked great.  And then came MLB.tv.  *Sigh*.  Buffering and buffering and buffering all day long, between every pitch.  Every... pitch!  I will be returning this for either Chromecast or Roku or Apple device.  Sorry little Fire Stick, but you don't hold a candle to the competition.", "verified": false, "helpfulness": "0/0", "author": "C. Roessler"}, {"rating": 5.0, "review": "Great product I'm very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Upateric"}, {"rating": 5.0, "review": "Super easy set up.  Was watching shows in a couple minutes.  Packaging was simple to unwrap.  Bought an extra one for my other TV.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Burnison"}, {"rating": 5.0, "review": "It's now so easy for me to control and watch many channels via this little device. Response very quickly to button click. The only bad thing I can think of for this is there are not many apps or games available. There are more apps for Fire TV but not this stick.", "verified": true, "helpfulness": "0/0", "author": "Shang Tseng"}, {"rating": 5.0, "review": "I bought this for a guest room and I love the convenience of it!  I wouldn't use it over satellite for one of the main TV's in my house, but it's perfect for a guest room that doesn't get used that often.  As a Prime member, I'm easily able to watch Prime content and listen to Prime music, but then I'm also able to log-in to my Netflix account too.  And when there's no one in the guest room, I can just unplug it from the guest TV and plug it into my main TV -- making it easier to watch my Prime content all the time!", "verified": true, "helpfulness": "0/0", "author": "A. Gant"}, {"rating": 3.0, "review": "I was really excited about this product, however I am disappointed with the connectivity.  My fire stick takes 5 attempts to connect to the wireless network even through it is next to the hub and the menu states that the network connection is very.  Once it is connected, I ALWAYS get a message saying that the connection is slow.  Then it will work perfectly until the next time that I use the fire TV stick.  I even contacted customer service and the problem still exists.  If this was fixed, it would be a 5 star product.", "verified": true, "helpfulness": "0/0", "author": "L. Herron \"quilt maker\""}, {"rating": 3.0, "review": "its od... my daughther loves it...", "verified": true, "helpfulness": "0/0", "author": "Margie Verdin"}]