[{"rating": 5.0, "review": "LOVE THIS THING!!", "verified": true, "helpfulness": "0/0", "author": "RD"}, {"rating": 4.0, "review": "If your a prime member this works good for Amazon content, but a gaming console has a lot of the same apps", "verified": true, "helpfulness": "0/0", "author": "fonzo"}, {"rating": 5.0, "review": "I find this very comparable to Roku. Easy to navigate. Allows you to watch from many different avenues (Youtube, Netflix, Hulu .....) Works quickly, very little lag.", "verified": true, "helpfulness": "0/0", "author": "JRope"}, {"rating": 4.0, "review": "Bought this to access shows from my Prime account. Product works great but free Prime shows are few and far between. Very disappointed in free selection. Most titles are are sale.", "verified": true, "helpfulness": "0/1", "author": "Lynn"}, {"rating": 1.0, "review": "I don't tend to write too many reviews, I do them when either I really like a product or really upset with a product or the service behind it.Lets face it, there are many streaming devices out there with very similar capabilities but this little guy held an interesting promise that other devices didn't promise - Miracast the ability to stream/duplicate your device screen on the TV. Very cool feature and as such its being advertised.Tried it out, it doesn't work with any of the windows devices. Looking on the web, searching twitter it seems I am not the only one who expected to get it and never did.Amazon advertisement is misleading - just don't buy this if this feature is important to you.Beyond that, tried the device on two TV's with only half success- I guess this is also a standard issue? 😉", "verified": true, "helpfulness": "2/2", "author": "Bird \"Not sure what I was thinking\""}, {"rating": 5.0, "review": "I enjoy how many things are on the fire sick. Easy to use. I like how my stuff was programmed on to it already.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"audioagirl\""}, {"rating": 4.0, "review": "This product is well worth the money paid for it .", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "We are really enjoying the Amazon Fire TV stick. Included a video to show what to expect when you receive the producthttps://www.youtube.com/watch?v=7G3bbz5C_mk", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to use.  Lots of choices.  I have Amazon Prime and Netflix accounts and the Fire Stick recognizes both accounts giving us more choices of what we can watch for free.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Larry Klutzke"}, {"rating": 2.0, "review": "It's fine if you only want Amazon Prime TV to work. Netflix and Hulu both have serious issues with buffering and freezing.", "verified": false, "helpfulness": "0/0", "author": "JUSTIN COLE"}]