[{"rating": 5.0, "review": "Much better than Chromecast.  I was able to use many more apps with the FIRE stick.", "verified": true, "helpfulness": "0/0", "author": "bulletbob"}, {"rating": 5.0, "review": "Works better than I thought possible.  I am on a slow DSL internet connection and movies still come across in full resolution without long pauses to buffer.  I dropped HBO and Stars once I had it a week.", "verified": true, "helpfulness": "0/0", "author": "Terry Jones"}, {"rating": 5.0, "review": "not single problem yet! amazing item and glad i got in at the intro price.", "verified": true, "helpfulness": "0/0", "author": "Tom mleko"}, {"rating": 5.0, "review": "The TV Fire stick is great.", "verified": true, "helpfulness": "0/0", "author": "Natalie Miller"}, {"rating": 5.0, "review": "Very pleased with this little stick.  Some non Amazon apps are hard to get to, but once you're used to it you're golden.  Kids love the games you can play with the remote (not paying for an over priced controller).At the $19 intro price this was a great deal and excellent purchase.Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "lostfan"}, {"rating": 5.0, "review": "This thing is amazing! A must for all Prime Subcribers!", "verified": true, "helpfulness": "0/0", "author": "Wounded Horse"}, {"rating": 5.0, "review": "This is an awesome product. I love it", "verified": true, "helpfulness": "0/0", "author": "janel wilkerson renner"}, {"rating": 5.0, "review": "For the price this is the best dongle on the market.  I also have the Chromecast and have used Roku.  Chromecast doesn't have a remote or user interface.  Roku is slower and costs more.  Only downside I would say is currently the search only checks Amazon Media and not other streaming Media.  The day it can also search Netflix, Hulu, etc. it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "jeff b"}, {"rating": 5.0, "review": "I got this on sale for half price during a pre-order special and don't know that I'd pay 40 dollars for it but at half price, it's worth it for sure. As a prime member without a device compatible with Amazon Video, this is exactly what I was looking for and we've watched around 20 prime movies with it. It plugged into our Sony tv and worked immediately and is pretty user friendly. I like that you can edit your Watchlist on the stick or on Amazon.com.", "verified": true, "helpfulness": "0/1", "author": "First Time Mom"}, {"rating": 5.0, "review": "Love it very easy set up", "verified": true, "helpfulness": "0/0", "author": "Steve Weber"}]