[{"rating": 1.0, "review": "Unfortunately,  I just cant stand the fact that it will constantly stop the playback, specially on Amazon Prime video saying my Internet Connection is too slow.... The router is giving me a 30MB of download speed, I have the router very close to the device and stop any other device connection, after 90 minutes of streaming it will stop... Then I have to restart the device or unplug it to have it back streaming... Very very slow also streaming music! In short, unusable! I'm really sorry about that because I'm very happy with amazon in general and their other devices. Tried the forums and technical support with no luck.", "verified": true, "helpfulness": "2/2", "author": "Jose A. Hernandez"}, {"rating": 4.0, "review": "Easy to access, plenty to watch.", "verified": true, "helpfulness": "0/0", "author": "Gary Johnson"}, {"rating": 5.0, "review": "Love it, I would not  need any cable", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very satisfied. And fast shipping", "verified": true, "helpfulness": "0/0", "author": "Victoria Sherman"}, {"rating": 5.0, "review": "Totally satisfied thus far.  Love having the capability of transforming any of my HD TVs to smart TVs.", "verified": true, "helpfulness": "0/0", "author": "Ned Hayes"}, {"rating": 5.0, "review": "Easy setup. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brandon O. Marvin \"Brandon Marvin\""}, {"rating": 5.0, "review": "Super cool", "verified": true, "helpfulness": "0/0", "author": "DAN ALLRED"}, {"rating": 4.0, "review": "I was avoiding streaming video until Netflix announced that only they would have the next season of Longmire, our favorite TV show.  Since I already had Amazon Prime, the Fire Stick was the logical streaming device to chose.  Of course, I had to wait for it, as Amazon kept running out of them.  When I got it, it worked fine, although it took several tries to put in all the various passwords required.  I also downloaded the remote control app for my Kindle, although I rarely use it.  The regular remote works fine, unless you have to type in a search string.  The stick is ideal for watching things on Amazon Prime, as long as Amazon has what you want.  Netflix works well, too, but we've had minor problems with buffering on Netflix when the source material is HD.  I like the fact that I can listen to all the music I have loaded on my Kindle Fire through my home theatre system using the stick.  I've been kind of disappointed by the limited selection of free movies on Amazon Prime and those available on Netflix, so I'll probably still use Redbox for newer movies, since the rental price is so high on Amazon.  Overall I've been pleased with the stick, but like all streaming devices, the content is limited.", "verified": true, "helpfulness": "0/0", "author": "D. Allin"}, {"rating": 5.0, "review": "Works great. Not as fast as the Fire TV, but faster than any other \"TV Stick\" I've seen/used.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 5.0, "review": "I had no issues at all.  Hooked it up, turned it on and the setup was cake.  I have only used it for Nefflix, but I am a satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Scott Thompson"}]