[{"rating": 3.0, "review": "This is fine as long as you are okay with slow and interruption buffer periods and Netflix working sporadically. Haven't made it through one full episode on Netflix yet... I've been trying for a month. The other services are okay most of the time. I would not buy again.", "verified": false, "helpfulness": "1/1", "author": "michael"}, {"rating": 5.0, "review": "Bought this for my 74 year old mother who does not have the money for cable. She was able to navigate and set up on her own, which is a feat. Works well, she never has any issues accessing what she wants to watch. Should have bought years ago!", "verified": true, "helpfulness": "0/0", "author": "Noell Jackson"}, {"rating": 2.0, "review": "I would spend the extra money and get an Apple TV. The price is great but waiting for it to buffer almost constantly is not. I also own an Apple TV that runs on the same connection and it runs smooth. It is double the price but what is your frustration worth", "verified": true, "helpfulness": "0/0", "author": "Jon Hunter"}, {"rating": 5.0, "review": "Absolutely love it! Easy to use...I replaced my Apple TV with this Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"reading teacher\""}, {"rating": 4.0, "review": "Got this for the WWE Network and it works just fine for that.  I haven't used anything else on it, only got it to watch the Network.", "verified": true, "helpfulness": "0/0", "author": "\"little_big_bob\""}, {"rating": 5.0, "review": "Love this but be sure to turn on parental controls because they aren't on automatically and my toddler bought the star wars collection just by chewing the remote a few times.", "verified": true, "helpfulness": "0/0", "author": "hdgolden"}, {"rating": 5.0, "review": "Don't know why I waited so long!  Our local cable company now requires you to have a box to receive their signal, didn't want to buy a box for every TV in the house, so this Fire TV Stick is the perfect solution.  I've been watching Netflix more than regular programming anyway and now we can watch shows on any TV in the house.  I love the fact that you program it ONCE for your wireless network, Netflix & other passwords.  Then transport it to wherever you want to watch - just plug it in to that set.", "verified": true, "helpfulness": "1/1", "author": "Cameron"}, {"rating": 4.0, "review": "Works great, but the menu layout is very sloppy and illogically laid-out.", "verified": true, "helpfulness": "0/0", "author": "Bhagwan Bill"}, {"rating": 3.0, "review": "The FireTV is a nice little streaming device, with a lot of potential if Amazon keeps releasing good firmware updates. The specs are fantastic on paper--1GB of RAM and a nice dual core CPU. In terms of price-to-performance ratio, it's hard to beat. Add in the great feature set--all the various streaming options that you'd expect (Amazon Plus, Hulu, Netflix, HBO, etc), and it's worth a purchase.The downsides: it has some major Wifi connectivity issues, that are well-documented. Mine cuts out regularly, despite being only 2-3 feet from the router. The UI can also be somewhat sluggish, which is sort of shocking considering how powerful this little device is. Another issue is the remote, which regularly registers a single click as two or more. So you'll be clicking through the menu and all of a sudden it jumps 2-3 clicks ahead. Very annoying.Hopefully, Amazon can resolve the Wifi, UI sluggishness, and remote issues through a firmware update. Until then, this device has great potential, but it's flaws show it's only half-baked.", "verified": true, "helpfulness": "0/0", "author": "SimiusRex"}, {"rating": 5.0, "review": "Great little piece of technology, we will finally be able to rid ourselves of the cable tv bill.", "verified": true, "helpfulness": "0/0", "author": "James and Janet Wartnaby"}]