[{"rating": 5.0, "review": "My family is absolutely in love with the Fire TV Stick. It's so easy to use and the remote is conveniently small enough that my 3 year old thinks I bought it just for her to enjoy some tv time in my bed.", "verified": true, "helpfulness": "0/0", "author": "BrittTB7"}, {"rating": 2.0, "review": "I only give this two stars because it gives me problems on occasion. I have two AppleTVs and although I know this is not meant to compete with the AppleTV, I invariably compare the two.The main problem that I have on a regular basis is it randomly tells me that it can't access the network (Internet). All my other devices remain connected without issue, including the AppleTVs. But for some reason my Fire Stick will on occasion stop accessing.The other issue is this device seems to have a weak processor. Shows often freeze or stick and the device itself is a little slow.It's a good deal for the money but when I have the option I use an AppleTV. Maybe I need to try the FireTV.", "verified": true, "helpfulness": "0/1", "author": "JayZP \"JP\""}, {"rating": 1.0, "review": "I thought it had built in wifi already smh , it's seems like u really need strong wifi in order to use this", "verified": true, "helpfulness": "1/1", "author": "jakiera"}, {"rating": 5.0, "review": "After some time and talking to Amazons support it turns out that the extenders are really boosters so even though the Wi-Fi signal was strong the device did not work correctly but after hooking the extender up to it it works like a charm now,  Needs a search feature but plays great otherwise.", "verified": true, "helpfulness": "1/1", "author": "RACoutu"}, {"rating": 5.0, "review": "This is worth every penny! I could not believe how easy it was to install. From the time I took it out of the box I had it running in less than 3 minutes.", "verified": true, "helpfulness": "1/1", "author": "Bruce Bourque"}, {"rating": 3.0, "review": "I purchased Amazon FIRE TV Stick and I'm disappointed because of how much buffering it does...  I have the Sling TV App and when I use it to watch live TV. It buffers allot!  Can't enjoy the app with buffering continuing, and having to restart app each time happens! I have a very very strong Internet connection as well!", "verified": true, "helpfulness": "0/1", "author": "scbrother979"}, {"rating": 5.0, "review": "Truly amazing it has better picture quality than was paying for with cable tv provider..fast downloads for new apps( depending on your internet speed of course but me running between 100-112mbps its lightning fast) best part was the Amazon fire stick was free to me...I just prepaid for 3 months on Sling TV which I had just gotten a free month from Xbox one and realized how great of a deal it was. I highly recommend anyone who has a high cable bill and wants to cut cost to jump over to slingtv and take advantage of their partnership with Amazon on this amazing product.", "verified": true, "helpfulness": "1/1", "author": "Christopher Brown"}, {"rating": 5.0, "review": "Easy to use and easy set up! Since I'm a prime member it came already registered with my information. Love it so far. So many of my shows, movies and kid shows to watch.Breaking up with cable was the best thing we've done!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "gmoney"}, {"rating": 5.0, "review": "Very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "tina moody"}]