[{"rating": 5.0, "review": "One of our families best purchases! we use it regularly with our amazon prime for movies and tv shows.  great for when we are traveling too!", "verified": true, "helpfulness": "0/0", "author": "N. Kulhawy"}, {"rating": 5.0, "review": "I love it! I got rid of cable and thought it would be a hard transition but I don't miss cable at all and I certainly don't miss the outrageous prices they want to charge after the promotion has ended. It was super easy to install, really just plug one end into a power source and the stick itself into the tv...that's it...it does the rest for you. I like this so much that I really regret spending the extra I did on another more expensive unit. I will definitely purchase again for the other tvs in my home.", "verified": true, "helpfulness": "0/0", "author": "Camille Gullap"}, {"rating": 4.0, "review": "While I haven't been able to fully delve into the capabilities of the unit, I must say that so far I have been very impressed with its speed, content, and overall performance.  Yes, it is true that the UI is specifically geared toward Amazon products.  However, I would say that with any Amazon product you need to be a Prime member in order to fully take advantage of how the unit (Fire tablet, Fire TV, etc).  That is why I have to give it four out of five stars.  If you are a Prime member than it would be five out of five.  Now, I also haven't explored the gaming aspect yet either.  I am hopeful to get a game controller so I can start to put on emulators and get my retro gaming on so that is something no other streamer, outside of the Nexus player, has.  May update my post if and when I can delve more into gaming with this.", "verified": true, "helpfulness": "0/0", "author": "Hwlngmad"}, {"rating": 5.0, "review": "Absolutely as easy to set up and use as the description said. I am completely satisfied.", "verified": true, "helpfulness": "0/0", "author": "cheryl marking"}, {"rating": 5.0, "review": "We like our Fire TV stick. We use it to view Amazon Prime and Netflix movies and TV series. Our cable package offered very little viewing other than reality and trash shows so we like this better. Had to increase our internet speed but it's worth it.", "verified": true, "helpfulness": "0/0", "author": "Ann Thompson"}, {"rating": 4.0, "review": "I would give five stars for this totally awesome device, but I have one complaint (that I hope will be remedied soon) I NEED HBO NOW! :)I can't use HBO Go, unfortunately because I don't have a subscription and was surprised to that HBO Now is not supported by this device. Otherwise this has been one of the best purchases I ever made. I've had it for a few months now and the quality is amazing. The steaming is fast and efficient and it was soooo easy to set up and use. AND saved me $50 on my cable bill plus the Prime membership, while not required, is worth every penny. Again, love, love, love this product but PLEASE hurry up with the HBO Now....Game of Thrones is on, man! lol :)", "verified": true, "helpfulness": "0/0", "author": "Lisa Fleener"}, {"rating": 5.0, "review": "free stick with the purchase of sling tv :) nices and hd tv !", "verified": true, "helpfulness": "0/0", "author": "andy a"}, {"rating": 5.0, "review": "Guest room alternative to cable", "verified": true, "helpfulness": "0/0", "author": "gr8day"}, {"rating": 5.0, "review": "love it... and customer support is wonderful", "verified": true, "helpfulness": "0/0", "author": "Karen Jaramillo"}, {"rating": 4.0, "review": "We love it only wish it had HG TV station.", "verified": true, "helpfulness": "0/0", "author": "william curtis"}]