[{"rating": 4.0, "review": "We had been using a computer hooked up via HDMI to watch Netflix, Hulu, and other streaming services. This worked fine, but we had not way to remotely control it and as much as I am a proponent of being active, it was a little annoying to always need to physically get up and go back and forth from the computer to pause, play, and other manipulations. So when we saw the Fire TV stick, we decided it needed to be tried.We have been mostly pleased so far. It has Netflix, Hulu, ESPN, and other apps which comprise most of our viewing diet. It is relatively easy to set up and get out accounts registered for each, the Amazon Prime being automatically registered upon ordering and making setup a little quicker.Our primary disappointment would be the WiFi receiver on the device. It does not behave the most reliably and has dropped our home network a couple times despite the network working perfectly. This did require a reboot via unplugging the power adapter and removing the stick from the HDMI port for a moment. But that has not recurred recently.All in all, a good value solution to bring streaming services to those who do not have a smart TV.", "verified": true, "helpfulness": "3/3", "author": "SeanDom"}, {"rating": 2.0, "review": "I really WANT to love this device.  It's serving as a replacement for our XBox, which had really become nothing more than a Netflix/Prime video utility. The interface is great.  The integration with the Prime services is fantastic.  I really like the mobile remote interface.  All around just great, BUT....My problem is that it just seem flake-y. nondescript i know.  I have constant buffering problems with the device.  Doesn't matter what service/app i'm using.  It's not consistent, some times i'll get 2/3s of the way through a show or movie.  Sometimes, i can get enough buffering to start a song in pandora or amazon prime.  Physically unplugging the device and then plugging it back in has worked every time.  I've done what i consider to be a ridiculous amount of troubleshooting including: different access points, different physical locations, different power cables, different network configurations, all to no avail.  I have zero problems streaming from other devices, like the xbox located ~2 feet away using the same access methods.Maybe it is just me.  There's some network configuration i've overlooked, or some really finessed interference that i can't find or 'see' with any other device or utility.  But to me and all who've helped me try to diagnose the issue it certainly APPEARS that the Fire TV Stick itself is the source of the issue.Maybe a software update is due, and it'll make the device as awesome as i expected it to be.  It'll be a 4, maybe 5 star-er if that ever happens.", "verified": true, "helpfulness": "2/2", "author": "Shea M Brennan"}, {"rating": 4.0, "review": "fire stick is extremely responsive, and i can watch my amazon prime!!", "verified": true, "helpfulness": "0/1", "author": "Antonio Sandoval"}, {"rating": 5.0, "review": "This is definitely worth it.  I used to watch Amazon Instant Video and Netflix through my Wii game system and it was soooo slow loading up.  The Fire TV stick is great.  I also purchased the voice activated remote and it also works wonderfully.", "verified": true, "helpfulness": "1/1", "author": "cbsully01886 \"cbsully\""}, {"rating": 5.0, "review": "I absolutely love this thing.  I caught a black Friday special on it, and it really was the only reason I go it, since I already had an Apple TV that I was happy with, and have bought a Chromecast that I gave to my Father last year.  This blows away both.First, the setup was stupid easy.  You plug in, login, and you are done.  Since it comes associated with your prime account, there is literally very little that you do to get it going.  Then you go add whatever apps you need, and you are in business.  Watching movies in Amazon Prime, Netflix, etc is just easy.  It follows the KISS (keep it simple, stupid) principle which makes it very valuable for everyone to be able to use.I'm waiting for the next special so that I can buy a couple of more for my teenager's TVs.", "verified": true, "helpfulness": "0/0", "author": "Carlos A. Barberena \"CB\""}, {"rating": 5.0, "review": "It does just what I hoped for. It was so easy to install and now I'm binge watching shows I've wanted to see.  \"Downton Abbey\" is my new favorite and \"House of Cards\" is next in line. Thanks Amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "Eth D"}, {"rating": 5.0, "review": "Didn't keep it, as I was getting a Smart TV.  Should have kept it for my bedroom TV.  Work well.", "verified": true, "helpfulness": "0/1", "author": "James J Lauer"}, {"rating": 4.0, "review": "It works good, just the internet connection constantly disconnects. Usually in the middle of something I'm watching. Just a pain to keep reentering the wifi password and reconnecting.", "verified": true, "helpfulness": "0/0", "author": "aimee hoschar"}, {"rating": 5.0, "review": "Love this gadget!!  Purchased another for bedroom.  Combined with indoor HD antenna I am FINALLY rid of Comcast.", "verified": true, "helpfulness": "0/0", "author": "Pleased in PA \"morning glory\""}, {"rating": 3.0, "review": "I was shocked to learn the VERY limited shows and movies on Amazon Prime. I thought you would not have to pay for so many shows on top of your Prime membership.The stick was easy to set up and use.It is misleading that there are apps on the stick like Showtime that you can not use without Showtime through your cable provider", "verified": true, "helpfulness": "0/0", "author": "Christina"}]