[{"rating": 4.0, "review": "Our first step in getting rid of cable. Nice interface for Prime and Netflix.", "verified": true, "helpfulness": "0/0", "author": "frank nance"}, {"rating": 4.0, "review": "Works pretty well. I'm on the other side of the house from the router. Some times it lags, but that is just the distance. I purchased a Firetv first and it had the same issue.  It works outstandingly when located closer to the router.", "verified": true, "helpfulness": "0/0", "author": "GreyBird4u"}, {"rating": 5.0, "review": "I love it.  So much to watch.  Glad to have Amazon shows", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just as advertised - great!", "verified": true, "helpfulness": "0/0", "author": "Mick"}, {"rating": 5.0, "review": "This item is great!  We were so tired of paying high prices to our cable provider.  I purchased 1 just to try it out.  I ordered three more after trying it.  Just make sure you have the right internet plan that can handle the number of devices you wish to connect at any given time.  We were not on the lowest plan, but had to increase our package a little.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "If I can figure it out anyone can.  My husband is housebound and he loves it.  Thank you", "verified": true, "helpfulness": "0/0", "author": "Linda N."}, {"rating": 5.0, "review": "Recommended to me by my Grandson, It has proved to be one of the best investments  ever. It works to deliver the best performance in streaming video which is what I bought it for. I like it very much and glad I got it. I recommend it to everyone.I had ROKU and it just didn't work so well. I thought that my internet connection wasn't fast enough, but the processor speed just didn't perform and was always loading. The Firestick processes faster and has eliminated the problem.", "verified": true, "helpfulness": "0/0", "author": "Christopher H. Wren"}, {"rating": 5.0, "review": "Easy setup.  Easy to navigate.  Bought a Roku last year and like it but the fire stick is better with more apps, games, etc. $39 for On Demand entertainment.  I fired my cable company and live by MY schedule.", "verified": true, "helpfulness": "0/0", "author": "JSS"}, {"rating": 5.0, "review": "Much better than the two other systems that I previously had.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Desch \"Celtic\""}, {"rating": 4.0, "review": "Great device at a very small price", "verified": true, "helpfulness": "0/0", "author": "Philw99"}]