[{"rating": 5.0, "review": "So far the family is very happy with the fire TV stick, we are able to watch almost all of the shows we all like. Paw Patrol needs to be added to the line up.", "verified": true, "helpfulness": "0/0", "author": "oilcan72"}, {"rating": 4.0, "review": "Worth the price.  Wish it had more apps.  Good enough for our third TV, without paying monthly for another cable box.  Kids like Disney channel.  Parents like YouTube, for exercise videos.", "verified": true, "helpfulness": "1/1", "author": "765 kV"}, {"rating": 5.0, "review": "It's very user friendly and has a ton of features!  My friend has Roku and I much more impressed with the Fire stick!", "verified": true, "helpfulness": "0/0", "author": "Kayla Broughton"}, {"rating": 4.0, "review": "So far so good!", "verified": true, "helpfulness": "0/0", "author": "Omari Baye"}, {"rating": 5.0, "review": "I just got it the other day. Very easy to use! So far so good.", "verified": true, "helpfulness": "0/0", "author": "carolyn owens"}, {"rating": 5.0, "review": "I purchased the Fire tv stick for an older smart tv. Though I was able to stream prime movies the software was running slow and was not getting updated. The fire tv stick is super fast, updated interface and remote that does not require direct line of sight. I love how it moves from episode to episode - perfect for binge watching. You can also play games if you're interested.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "So happy to cut the cord with cable!", "verified": true, "helpfulness": "0/0", "author": "Renae P."}, {"rating": 5.0, "review": "Awesome toy", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 3.0, "review": "Quite inconvenient to watch anything other than Amazon content.  For the price I shouldn't complain too much.", "verified": true, "helpfulness": "0/0", "author": "Matthew R Gaston"}, {"rating": 5.0, "review": "Awesome Price and Awesome Stick, does everything I need it to do and the price is great.", "verified": true, "helpfulness": "0/0", "author": "Jina West"}]