[{"rating": 1.0, "review": "I wasn't able to download Netflix... Going back!", "verified": true, "helpfulness": "1/1", "author": "Janett Rubio de Asaad"}, {"rating": 1.0, "review": "Mine worked for about a week or two then stopped.. hasn't worked since. I'll never buy again", "verified": true, "helpfulness": "1/2", "author": "Logan Carter"}, {"rating": 5.0, "review": "Best 30 (or so) bucks ever spent! No more watching Netflix on my computer screen!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It took a few tries to get it to connect to my internet but once that was complete it has been fabulous.  Highly recommend this for all you Hulu and Netflix binge watchers.  Plus it doesn't take up a lot of space on my tv stand!", "verified": true, "helpfulness": "0/0", "author": "Penny Brackett"}, {"rating": 1.0, "review": "Don't waste your money. Device does not properly stream netflix or hulu plus. Even amazon prime video and prime music only work with nearly constant removal of cache from every app. Do yourself a favor and do not buy this", "verified": true, "helpfulness": "1/1", "author": "Xyz"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Luanne Null"}, {"rating": 2.0, "review": "I bought this mainly to watch MLB.tv. True to a few of the other reviews, the quality of MLB.tv is pretty lousy. There is a significant amount of buffering -- a lot of buffering. So much so that you can't enjoy the flow of a game when the game is delayed every 20 seconds. If you're buying this to use the MLB.tv app, look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Turcotte"}, {"rating": 5.0, "review": "I bought one of these for my nephew when they first came out and it works great. I love how easy it is to watch Hulu and Netflix, and he enjoys Twitch and the games he can play. Right now I'm looking at buying another Fire TV Stick for myself. It's so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Harper Kingsley \"Harper\""}, {"rating": 5.0, "review": "It is very fast with virtually no lag. Great user interface. I debated between this and the Roku 3. I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "randy hayes"}, {"rating": 5.0, "review": "Easy to use, set up and installation took no time at all.", "verified": true, "helpfulness": "0/0", "author": "Mrs.Diane drew Langlais"}]