[{"rating": 4.0, "review": "It's small and compact. I love how you can connect it anywhere on any smart tv or HDTVs !", "verified": true, "helpfulness": "0/0", "author": "Fernando Uraga"}, {"rating": 2.0, "review": "Some of the features did not work as advertised.", "verified": true, "helpfulness": "1/1", "author": "Dr. Gactjens Saint-Hilaire"}, {"rating": 1.0, "review": "Got one of these during the $20 deal.  I have a chromecast and an older roku.  Mainly got it for Twitch.tv and the Prime movies.  Unfortunately, this is the laggiest of the 3 devices.  I can run chromecast off my phone and laptop to the TV just fine.  The roku runs everything I need just fine off of it.  The Fire TV stick LAGS for everything.  It constantly buffers and downgrades the video quality.  I don't know what the issue is, but all 3 devices are in the same place and my home wifi works for everything else just fine.Maybe amazon cheaped out on the range or wifi ability or something...but either way, it has become a $20 piece of garbage.", "verified": true, "helpfulness": "1/4", "author": "KnockKnock"}, {"rating": 4.0, "review": "like it better than my roku but the netflix app is kinda buggy.", "verified": true, "helpfulness": "0/0", "author": "grubgadget"}, {"rating": 5.0, "review": "I love it, great replacement for my WII (which was broken and I used only to stream Netflix)", "verified": true, "helpfulness": "0/0", "author": "Nolan's Mom"}, {"rating": 4.0, "review": "wont get til january, but I expect it to be goood", "verified": true, "helpfulness": "0/0", "author": "R. Berger \"rbn190\""}, {"rating": 5.0, "review": "This is great! Seeing the detail that Amazon put into the user interface and the so far flawless performance of this has made me want a full size Fire TV for the living room that much more.", "verified": true, "helpfulness": "0/0", "author": "NPR_Dan"}, {"rating": 5.0, "review": "The set up was very simple. It took only a few minutes to update after connecting to the WIFI. After canceling my cable, figured I would give this a shot. My whole family is very happy. The home screen is user friendly. Easy to search through the Instant Videos and to switch between apps. For the price, the promotion $19, it was well worth it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Sanders"}, {"rating": 3.0, "review": "Wish the movies were actually free.", "verified": true, "helpfulness": "0/0", "author": "M. Hopkins \"librarychic\""}, {"rating": 4.0, "review": "It is very handy device and worth for it's price.Pros : more apps, more games, fast downloadCons : Not the famous supporting device listed like chromecast, ROKU, etc, need game controller for lot of games.", "verified": false, "helpfulness": "0/0", "author": "sundaram"}]