[{"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "T. Clement"}, {"rating": 5.0, "review": "I love this. I bought this for my bedroom because my tv does not have the built apps like the other rooms in the house. I like this better than the apps that come programmed in my other TV's.", "verified": true, "helpfulness": "0/0", "author": "John D Forte"}, {"rating": 4.0, "review": "Works well and gives me access to Amazon Prime video and a lot more. I was able to connect to it from my Samsung phone and mirror the phone screen to the TV. That worked well for still photos, but HD video was not so good, with lots of jerking and pausing. But of course this \"dongle\" has many options for streaming high quality video and music from popular sources like Netflix, YouTube, etc.  I pre-ordered this before it was released to get the $20 promo price. It's Amazon's equivalent of Google's Chromecast and Apple's TV.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Wilson"}, {"rating": 5.0, "review": "I used the Fire TV stick for streaming, and it worked flawlessly.  The remote improves significantly its usability and the stick form factor saves a lot of space.  Keep it up Amazon!  Edit: For those who wondered why this isn't a verified purchase, I bought the Fire TV stick from my friend's account who's a prime member.", "verified": true, "helpfulness": "1/1", "author": "J W"}, {"rating": 2.0, "review": "It is good if you can get pass the constant buffering.  There are other products out there that can do same or more with full Google marketplace.", "verified": false, "helpfulness": "0/0", "author": "EV"}, {"rating": 5.0, "review": "It's pretty awesome!! It has everything. Extremely easy to set up. The only thing I had a difficult time with was opening the back of the remote to put the batteries in. Other than that it's pretty awesome. Also, one thing that might be helpful, is if they added seperate users for the account (like they do with Netflix) because I got it for my mom and I don't like her having all my info.", "verified": true, "helpfulness": "0/0", "author": "Marion"}, {"rating": 5.0, "review": "Love it...gonna buy another one soon", "verified": true, "helpfulness": "0/0", "author": "beckyguy"}, {"rating": 1.0, "review": "Not for me!", "verified": true, "helpfulness": "0/2", "author": "Samnieng J Nokham"}, {"rating": 4.0, "review": "It would be nice if Amazon played nice with Google.  The interface can be sluggish at times, but overall it is a nice product.  I think this is a better choice for people who can't get their mind around Chromcast (user interface is on phone/tablet).  Also, if you are an Amazon Prime subscriber Chromecast is going to disappoint with out an Amazon app.", "verified": true, "helpfulness": "0/0", "author": "Justin Frodsham"}, {"rating": 5.0, "review": "Got this when it was on sale during the rollout. I LOVE THIS THING. It's super easy to set up and has breathed new life into our tv. Our tv has 'apps' and stuff, but it's kinda slow and klunky. Enter the fire tv stick: snappy processor, bunch of content via Prime.", "verified": true, "helpfulness": "1/1", "author": "ryanemmm \"ryanemmm\""}]