[{"rating": 3.0, "review": "Is adequate", "verified": true, "helpfulness": "0/0", "author": "Patrick \"DryPenguin\""}, {"rating": 1.0, "review": "Complete deception with speed and iDevices mirroring capability. Wish I could return it.", "verified": true, "helpfulness": "0/0", "author": "Rafael H. Carelli"}, {"rating": 5.0, "review": "Very simple interface, very quick to respond and play your favorite media.Bought 2 more.", "verified": true, "helpfulness": "0/0", "author": "David Smith"}, {"rating": 2.0, "review": "The freezing & delayed reactions (lags) make it frustrating to enjoy what your watching. Also don't like that your credits go towards only music purchases.", "verified": true, "helpfulness": "0/0", "author": "Taylor Meek"}, {"rating": 5.0, "review": "Awesome especially if you are a prime member.  Thinking about dumping cable.", "verified": true, "helpfulness": "0/0", "author": "Brock Evans"}, {"rating": 5.0, "review": "Works amazing!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I have a total of 4 sticks, 2 for the bros and 2 for my apartment. I use them to watch favorite TV shows and movies on Amazon, Hulu, and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"princessofjade\""}, {"rating": 5.0, "review": "Excellent.  My  old Amazon fire tv did not last long.  I am using fire tv stick to watch Amazon movie and use Apple tv to watch netflex.  the apple tv is a year older.  It is still very easy to use.  The Amazon fire tv remote has problem.  We constantly has to unplug the wire to reset it.  Then the Fire tv remote is not working well either.  It seems the fire tv stick works better than the fire tv.", "verified": true, "helpfulness": "0/0", "author": "C. Wu"}, {"rating": 5.0, "review": "Perfect 🙌🏾", "verified": true, "helpfulness": "0/0", "author": "jamyia richards"}, {"rating": 5.0, "review": "Initially, I wasn't sure if the Amazon Fire TV Stick would be worth purchasing but when it went on sale for $24.99, I had to at least try it. The set-up was surprisingly quick and simple. The menu/interface was also easy to navigate through using the supplied remote. While the Amazon Fire TV Stick can be controlled using a mobile app, I love having the remote as an additional option. Also, the specs of this product exceed that of its competitors'. With its dual-core processor and 8GB of storage, I have yet to experience any lag or connectivity issues. One minor con is that I had to connect an Amazon account with a linked credit/debit card before I could download any FREE apps but other than that, this product is amazing. The streaming quality is very clear and I love that I am able to screen mirror my device to the TV. The Amazon Fire TV Stick is a great product that offers awesome app/streaming features without the need of a Smart TV or gaming console.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}]