[{"rating": 4.0, "review": "Awesome. Works better than my Chromecast", "verified": true, "helpfulness": "0/0", "author": "Jeremiah"}, {"rating": 5.0, "review": "So far we absolutely adore the Fire Stick.  I have a Smart TV and have always had trouble with the Amazon App never knowing for sure if it was the TV, my cable/internet, or Amazon.  It was such a pain to use that we got to a point where we were not using it hardly at all.  Then a buddy and his wife told us about this and we decided to give it a try.  Well, it's worked almost flawlessly and we are again enjoying movies.  I ordered the remote with voice and would recommend this option to everyone.  It makes everything even easier!  This has been a blessing and want everyone to know it is so worth the money.  I will not be buying a Smart TV again when I need to replace this one, you just don't need it.", "verified": true, "helpfulness": "0/0", "author": "Airborne Daddy \"Tommy Lane\""}, {"rating": 3.0, "review": "I have had similar issues to other reviews. Netflix seems compromised in some way.", "verified": true, "helpfulness": "0/0", "author": "Roger"}, {"rating": 5.0, "review": "This works awesome love it", "verified": true, "helpfulness": "0/0", "author": "Lana Kraus"}, {"rating": 5.0, "review": "Everyone should own one of these.", "verified": true, "helpfulness": "0/0", "author": "Gregory Bragg"}, {"rating": 5.0, "review": "quick & easy did what I was expecting", "verified": true, "helpfulness": "0/0", "author": "michael colbert"}, {"rating": 4.0, "review": "Little bit more of a selection would be nice and/or less $$$ to rent a movie-Cheaper to Rent from RedBox", "verified": true, "helpfulness": "0/0", "author": "Paul Myers"}, {"rating": 5.0, "review": "Arrived on time and insanely easy to set up.  Bye Bye Cable!", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 2.0, "review": "I've had the Fire Stick for about a week now. I already owned a Chromecast and wasn't too happy with how buggy the app could be, so the Fire stick's remote really appealed to me. Overall it's been pretty good. I have noticed it has a tendency to \"hiccup\" in the middle of streaming on Hulu, but nothing that drives me crazy. It sometimes freezes, but usually gets over it fairly fast. Overall, so far it's been a good deal for the money!Update: I've now owned the Firestick for a few months. The occasional hiccup with streaming has become more often than not. At least once every time I stream, whether it is Hulu, Netflix, or HBOGo, I can expect the stream to studded, stop for buffering, or flat out lose connection. I've noticed that when this starts to happen all the time, unplugging the Firestick and letting it cool off can help. Honestly, at this point, the only benefit this thing has over my Chromecast is that it has a remote. I'm very disappointed with this product.", "verified": true, "helpfulness": "0/0", "author": "Sasha Hutchins"}, {"rating": 4.0, "review": "I am still learning it but so far it is what i expected. Love it", "verified": true, "helpfulness": "0/0", "author": "eve"}]