[{"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "andy"}, {"rating": 5.0, "review": "My TV was not smart enough to stream Amazon Prime without a hassle. Fire TV stick made all the difference - instantly!", "verified": true, "helpfulness": "0/0", "author": "Richard T. Betz \"rosy50\""}, {"rating": 4.0, "review": "Great, still updating I guess", "verified": true, "helpfulness": "0/0", "author": "Francisco Reyes Alonso"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Nicolle Frisone"}, {"rating": 4.0, "review": "Amazon Fire Stick is a good value considering the price. Yet, it is not yet a full replacement for cable, even if you don't want all the 200+ channels they offer. The range of TV stations that one can get through the Fire TV Stick is fairly limited unless you are happy with some of the obscure stations that are provided by some apps that you can get through the service.I happen to like Amazon Prime and the movies I buy through Amazon.com. The stick makes it easy to access my account and play them. Contrary to my smart TV the Fire TV Stick doesn't have an issue with losing the Wi-Fi signal so I now use it exclusively for movies and series as well as Netflix.The setup is very easy since it comes pre-programmed for my Amazon account. Just plug it into an open HDMI port and it works.The only wish I really have is that the Fire TV Stick could be programmed so that it asks me if I want to log on with my account or somebody else's. That would enable me to offer smart TV functionality in my vacation rental units without buying new TVs.", "verified": true, "helpfulness": "0/0", "author": "JoGoSt"}, {"rating": 5.0, "review": "Fantastic.  Turned my 39\" bedroom Toshiba into a smart TV.  I stream Amazon Prime video all the time and can easily switch from my Fire tablet to the TV.  Or can just stream Amazon Prime without using my tablet.  So easy to set up and for $39, this is one of the biggest bargains of all time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have own roku, android box chromecast this is the best hands now. Simply cause you can add kodi to the stick", "verified": true, "helpfulness": "0/0", "author": "larry clark"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "jaime quintero"}, {"rating": 5.0, "review": "Worth every penny.........!!!", "verified": true, "helpfulness": "0/0", "author": "carl may"}, {"rating": 5.0, "review": "Have really enjoyed using the Fire TV Stick.  Easy to install and easy to use.  Really like to app that allows me to control the options from my phone.", "verified": true, "helpfulness": "0/0", "author": "J. Ross Iddings"}]