[{"rating": 3.0, "review": "So I've got a chromecast and I find the fire stick much simpler to use.  It's also much less glitchy than the chromecast. Not as easy as Apple TV and no HBOGo app which I knew going in. Also I was disappointed that the showtime anytime app only works with a limited number of providers and direct TV isn't one of them.But I do love that we can easily watch Amazon videos on the TV.  My kids both have kindle fires and I buy them movies for their kindles when we travel, so this gets them on the tv.", "verified": true, "helpfulness": "0/1", "author": "Minny \"mom of two\""}, {"rating": 2.0, "review": "The good (so far): Initial welcome video was cool.  Setup was simplified with the included remote.  Which was my dislike with the Chromecast.  The remote is radio frequency so don't have to point at the tv!The bad (so far): Gray and black setup menu seems old and cheap.  WiFi reception issues.  The Chromecast connected to the same TV(downstairs) connected to the router (upstairs) without problem.  Fire TV Stick connected to the same router shows good WiFi strength but once connected it has problem staying connected.  Moved Fire TV Stick to upstairs TV and everything was fine.  I thought basic function/apps like Netflix(since it was advertised to work with that as well as other streaming services) would already be on but nooo you have to download it.  Which is not a problem.  Decided to show off to the wife by launching Netflix and playing one of her Korean flix that current & in HD format.  Got audio and subtitles(in English - that's another story) but the video comes on and freezes.  Tried it again and does the same thing.  Switched to another Korean flix same thing.  Not a problem with WiFi speed cause I'm able to look at Amazon Pic and other Amazon related feature without a problem.  Connected the Roku 3 back in and that works flawlessly.  Also, could not get the Amazon Fire TV Remote App for Android to work.  It couldn't find the unit.By this time the wife said, \"Put my Ruku back on.  Return it!  I want my money back\".  I'm sure the Fire TV Stick needs firmware update to fix initial release bugs.  Did not get a chance to try the regular Netflix movies or other apps/services.  Hopefully Amazon will release a new firmware fix soon or maybe I just got a defective Fire TV Stick.  Did I mention I like the remote?", "verified": true, "helpfulness": "1/3", "author": "Amazon Shopper"}, {"rating": 5.0, "review": "Love it as soon as I get me a good tv antenna and a dvr I am ditching cable.", "verified": true, "helpfulness": "1/1", "author": "Jim McGraw"}, {"rating": 1.0, "review": "Took forever to setup. did not change my tv input on usage. stopped using it. If I started to use it again I will update this review.", "verified": true, "helpfulness": "0/5", "author": "Mike West"}, {"rating": 5.0, "review": "Love it. A snap to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Francine Ekstam"}, {"rating": 5.0, "review": "I have numerous Roku devices and was in the market to replace one of the original generation Roku boxes that doesn’t support all the channels currently available.  When I saw the special deal for the Amazon streaming stick its launch, it was too good to pass up.It is very similar to the Roku stick in setup and ease of use, but doesn’t have as many of the second tier channels as the Roku.  I assume this will improve over time.  The first couple of days it did need to be restarted several times when it froze adding a channel or game, but has been very stable ever since.All things being equal, I would probably choose the Roku stick because of my familiarity with it and the flow of the home page, but at the introductory price, the Amazon stick is a much better value and does everything I use my Roku stick for (primarily Netflix, Amazon, YouTube and Watch ESPN) equally as well and perhaps a bit faster.  Overall, I am very satisfied with the purchase.", "verified": true, "helpfulness": "2/2", "author": "jerlaul"}, {"rating": 3.0, "review": "I am going to go the other direction from the detailed reviews and try to be as brief as possible.The Fire TV Stick is a very capable device, similar to a Google Chromecast HDMI Streaming Media Player or Roku 3500R Streaming Stick (HDMI). The setup is plug and play. The interface is clean and easy to navigate with the included remote.Though the Fire TV Stick has applications for Showtime, Netflix, etc., one quickly realizes that it is primarily targeted to customers with an Amazon Prime subscription. There is no web browser nor any native applications for YouTube, HBO Go, Starz or Cinemax.Casting and Screen Mirroring is only supported for Android devices which further reduces usability. Chromecast supports both, Andorid and iOS, platforms.If you were lucky to get it for half-price and have an Amazon Prime subscription, this is a good way to access your content - especially with the easy to use remote. If not, I would recommend the Chromecast.Pros:* Attractive entry price* Easy to setup* Everything required for setup included in the box* Amazing picture quality - upto 1080P* Remote is a welcome accessory* Includes this $20, 1 Amp/5 Watt, wall charger - Amazon Kindle 5W USB Power AdapterCons:* Primarily targeted for Amazon Prime customers* Most audio/video/gaming content requires payment or subscription* No web browser* Casting and mirroring only supported for Android devices* Popular services like HBO Go, STARZ, Cinemax, etc. not supported* Power cable, due to a bad power slot design (on the side of the unit) interferes with other HDMI cables - especially when you have side-by-side HDMI slots. The included HDMI extension does alleviate this issue", "verified": true, "helpfulness": "1/4", "author": "Subir Singh \"Gadget Geek\""}, {"rating": 4.0, "review": "This is super great idea. Works better than I thought it would and all the different options to watch makes it even more awesome", "verified": true, "helpfulness": "0/0", "author": "debbiej32"}, {"rating": 4.0, "review": "I have been living with the Fire Stick for almost a week now and so far it is doing exactly what I need. It is like a Chromecast but better due to the remote, it has made watching old TV shows at night to unwind easier to do without the need to constantly wake up my phone to pause or go to the next episode. It loads all of my content quickly and I have had no picture quality loss or constant buffering to worry about.", "verified": true, "helpfulness": "2/2", "author": "Charles C Lowry Jr."}, {"rating": 4.0, "review": "I picked one of these up during the preorder sale for Prime members for $19.  I already own two Apple TVs, which are my primary streaming boxes for each of my televisions.  However, being a prime member, and the only real way to watch on Apple TV is with Airplay.  It works, but it also ties up power on your mobile device.  For $19, I figured why not.It arrived on Saturday and I had some real issues with initial setup, mostly related to WiFi reception.  I couldn't get a signal at all with the stick plugged into a side HDMI port, having 'Connect to your network' and a blank screen shown.  Eventually I brought it to my other television near my router, and quickly logged on, but then it took about 5 tries for the required software update.  After the update, the stick worked great downstairs, but still dropped reception upstairs.  FWIW, my Apple TV never has connection spots and my phone gets full WiFi in the same spot.Eventually I tried one of the back ports, and bam - working fine.  Probably some shielding of the signal on the side ports, so take that to heart.So, after jumping through some hoops on setup, I finally had it working, and overall, it's quite good.  The interface is clean, streaming quality is good, the remote works very well and there's a lot of great options.  Set up Plex and it works very well streaming my personal media to the Fire stick.Downsides are an inability to search just within Prime TV and Movies.  But for the price, it's hard to beat.  A very good streaming device, especially for the money.", "verified": true, "helpfulness": "3/3", "author": "Jordan S"}]