[{"rating": 5.0, "review": "I purchased the Amazon TV box for my living room TV first and loved it! I immediately hopped on to buy the stick for my TV in my bedroom. So easy to install and use. I am able to watch from my Netflix and Hulu accounts as well as HBO Go. There are also other great apps. to download for other stuff. BEST OF ALL, if you are an Amazon Prime member, you have instant access to so many free movies and TV shows on there!", "verified": true, "helpfulness": "0/0", "author": "Lisa Slotten"}, {"rating": 5.0, "review": "Easy to setup & easy to use.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Karen S Bergan"}, {"rating": 4.0, "review": "Amazing idea, improving, but needs more apps. Why not a Spotify full app?", "verified": true, "helpfulness": "0/0", "author": "Marcus Fenix"}, {"rating": 4.0, "review": "Setup was quick after input determined; instructions stating  determine input on TV would be very helpful.System loaded 1st time without any problem.So far we have enjoyed watching movies, listening to music & some TV shows.We are Prime members that has its own advantages.", "verified": true, "helpfulness": "0/0", "author": "Becky Stepps"}, {"rating": 1.0, "review": "Extremely disappointed with this purchase.  I am a prime member and there are hardly any free movies available.  We tried ordering African queen, platoon, and all of these you have to pay for so I am not seeing any benefit to having the fire stick versus cable television shows.  The free movies that they offer are movies that don't sound very appealing.  Also Amazon customer service sucks.  The person who tried to assist me spoke very broken English.  Then she transferred me over to another department after being on hold for over ten minutes I hung up.  Customer service called me back but it did not satisfy me. Their advertisement of being a prime member you get free movies is only partly true.", "verified": true, "helpfulness": "0/1", "author": "rochelle"}, {"rating": 3.0, "review": "I love:The fact that it has PandoraThe ease of set upThe interfacePasscode preventing accidental purchase of things that aren't on PrimeI am very disappointed by:-glitch: if I turn on the fire TV stick, which is plugged into hdmi2 on our Philips TV, it automatically switches the channel to hdmi1. Every time. Drives me nuts. Must have a similar signal?-network connectivity: spotty. Often it says it is \"connected with problems\" but no other devices have problems. It's ten feet away from the modem/router. Pandora and Netflix regularly stop working mid-use-remote: the buttons are raised and very, so they are easy to accidentally push. Apple TV remote is a better design.-Netflix app: impossible to see suggestions based on a title, which I like browsing. Prefer Apple TV interface.-pandora app: impossible to customize shuffle. I do it on my phone, then select shuffle to get the current mix going-physical: I think the concept of the stick is unwise. We used to have it in hdmi3, but I think it wide out the port somehow. We now have it in using the extender cable, so that it doesn't weigh down the port as much. If it gets jostled, it stops working. It has to be just right in the port. I haven't had this issue with any devices that support their weight on the shelf.", "verified": true, "helpfulness": "0/0", "author": "KelSzy"}, {"rating": 4.0, "review": "I bought 2 of these for $19 from Amazon during the preorder sale.  For the first few months I thought it was money down the drain cause I hate returning stuff.  It kept restarting out of nowhere every 5-10 minutes.  Not sure what the problem was.  Then there was a firmware update and all of a sudden it worked, so I'm glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "hi"}, {"rating": 4.0, "review": "Just received mine a couple of days ago as Step 1 of my \"cut the cord\" plan.  So far I like it, it's really fast, and simple to use.  I will be much happier with it when I can cast from my Windows tablet, and when HBO Go is available.  It is my own fault, I didn't read the details about compatible devices, so I expected to be able to cast from my tablet based on the product bullet points. I was going to return it for this reason, but I see that Windows 8.1 support is coming soon, so I think I'll hang on to it.  Maybe it will be available by the time I finish binge watching all the series available on Prime!", "verified": true, "helpfulness": "1/1", "author": "dw \"debbie@admin.usf.edu\""}, {"rating": 5.0, "review": "We love it. My son can't stop watching The Wild Thornberry's on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Sharmaine Bowers"}, {"rating": 4.0, "review": "I'd probably rate it at a 3.5 or maybe 3.75 if I could.  This is because though I like the Fire Stick a lot and am impressed with how many channels it pulls in, I don't like the it seems to freeze up or buffer quite a bit.  Sometimes I have to go back and select Sling again in order to keep watching a tv show which is frustrating.  Not sure what the problem is.  One other little problem is that I can't have both my Chromecast and Fire Stick connected to two different HDMI ports at once.  I have a 50\" Samsung smart tv on which the Chromecast worked fine before I got the Fire Stick.  I've spoken with Samsung tech. support and they have no idea what the problems is....", "verified": true, "helpfulness": "0/0", "author": "Gary Wayne Smith"}]