[{"rating": 3.0, "review": "Seems like might need some work.  More apps, etc.", "verified": true, "helpfulness": "0/0", "author": "Don D Bourque"}, {"rating": 4.0, "review": "Would get 5 star if the power came from USB, just a mini Fire TV, a little slower on the processor side but great for smaller rooms that you still want the Fire TV access to. I just don't understand why it still needs to be plugged into 110 power source, Most TVs now have USB and I would think there would be a viable way to source the power to the stick via USB to prevent unnecessary cords from hanging down, especially since it puts undue stress on the HDMI port. 5 start if this \"problem\" is resolved, at least provide us with a longer mini-power cable so the TV doesn't have to be 4 ft. from a power source.", "verified": true, "helpfulness": "0/0", "author": "Dadelous"}, {"rating": 2.0, "review": "This item definitely fell short of expectations.  We put the Fire Stick in the exact same spot as our Roku player, which worked great (we moved the Roku to another room to service another TV).  The Fire Stick immediately had trouble with the wireless network.  We experienced lag, buffering and screen freezes.  Yes, we unplugged the stick, rebooted the wireless router, moved the stick around hoping to pick up the signal better--nothing worked.  In the end we swapped the Roku back in and guess what--the Roku just flat out worked.  You press a button on the Roku and you get instant response.  The Fire Stick?  Not so much. The Fire Stick user interface is also a bit annoying.  Any apps that aren't Amazon-related (like Netflix, Hulu, etc.) require hitting multiple buttons to enter the app--this is after installing the app!  Look--when I click on the Netflix button, it's because I want to watch Netflix.  Why do I have to click another button to open the app?  The Fire stick isn't very friendly to non-Amazon apps.  Conversely, the Roku treats all apps the same--easy interface and instant feedback from the remote.One more thing--the remote is just too darned small.  A remote should fit comfortably in your hand an you should be able to navigate without looking at it.  It's too lightweight and pressing the buttons forces your thumb and fingers in awkward positions.  The surface of the remote is kind of slippery--it will slide around in your hand while you're pressing buttons.  Make the remote more ergonomic to the average hand.", "verified": true, "helpfulness": "0/0", "author": "Robert E."}, {"rating": 4.0, "review": "The only negative about the fire stick is the lack of apps available to download.  The apps that it has work great and I love the connection with my prime account", "verified": true, "helpfulness": "0/0", "author": "DGone"}, {"rating": 5.0, "review": "I purchased the FireTv the first day it came out. Although I like it, I was not happy with it for the $99 price I paid. It has too many limitations that don't make it worth it. However, the FireTV stick is less than half the price and does (In my needs) the exact same thing. I don't see any reason to spend extra on the full FireTV and I own both.", "verified": true, "helpfulness": "0/0", "author": "Matthew Balliet"}, {"rating": 2.0, "review": "When it works you could add a star to it.  But too often I get the blue screen of death which requires unplugging from power to reset it.  That said, the UI is still somewhat a mess.  It's really hard to find things to watch unless you know what you're looking for.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 4.0, "review": "Love this. Works good. easy to install with no problems.", "verified": true, "helpfulness": "0/0", "author": "annette"}, {"rating": 4.0, "review": "Ok this was my first HDMI entertainment stick and it was going pretty well. You can watch netflix, hulu and Showtime Anytime. At least for some. I have comcast and Showtime Anytime isn't available on this device. I was highly upset over this because that was one of the main reasons I got it. I am a college student and I access a lot of my family's premium channel content via my computer and now this device. When I discovered this, I also recently saw that Chromecast just got access to Showtime anytime. At this time I have two HDMI sticks and I would have to say I like the fire tv stick better if only Showtime Anytime was available I would prefer it over chromecast. To me its all down to operation and I hate having to operate my chromecast through my phone, wish it came with a remote.", "verified": true, "helpfulness": "0/0", "author": "devanb2012"}, {"rating": 4.0, "review": "Love the Fire TV stick! Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Abbie Coulson \"woodymama\""}, {"rating": 5.0, "review": "I didn't get cable when I moved to my new apartment and I don't even miss it. I like it better than the chrome cast because I don't have to use one of my devices as a remote. I even lost the remote control that comes with it for about a week and just used the app on my phone.", "verified": true, "helpfulness": "0/0", "author": "Julia Olienyk"}]