[{"rating": 4.0, "review": "Overall its a good product. I would say that there have been a few buggy problems I have noticed. Sometimes the sound will stop playing and you have to reset the device for it to work properly again. It will also freeze from time to time. It is a step up from the wii that I was using for netflix! I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Lindsey Currin"}, {"rating": 5.0, "review": "Waited about a month because it was on back order, but worth the wait. So easy to install and set up. I used the adapter to make it slightly longer, I don't think I really needed to but because my TV is wall mounted I figured it would be easier. I just needed a streaming device for my bedroom and didnt want to add another unsightly box so this was perfect.Also picture quality is awesome, super easy to navigate and a great price!", "verified": true, "helpfulness": "2/2", "author": "VanessaMW"}, {"rating": 5.0, "review": "I love it so much my family thinks I need an intervention!!!!", "verified": true, "helpfulness": "0/0", "author": "Kathy Shaver"}, {"rating": 5.0, "review": "Allows me to expand my television viewing exponentially.", "verified": true, "helpfulness": "0/0", "author": "SAUL NATHAN"}, {"rating": 4.0, "review": "I wish it had HBO go but all around it is great!", "verified": true, "helpfulness": "0/0", "author": "Kayla Hansen"}, {"rating": 5.0, "review": "Awesome product! Easy to work.", "verified": true, "helpfulness": "0/0", "author": "charlie foster"}, {"rating": 5.0, "review": "Easy install, works great", "verified": true, "helpfulness": "0/0", "author": "the shadowman"}, {"rating": 5.0, "review": "Love these. We've purchased three now, one for each room we have a TV.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Works great for Netflix and amazon prime my daughter loves it in her room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've researched a lot of streaming devices, for gifts and for myself.  I settled on a Roku for my roommate for Christmas, but for me I wanted something different.  The Chromecast wasn't an option, so I was down to AppleTV & Fire TV Stick.  The Fire TV won out by a long run.  You can't add apps to the AppleTV, nor play games on it, nor does it have a Prime app.  I got my Fire TV Stick today and absolutely love it!  It's faster with more storage (which helps with a lot less buffering), and is a breeze to navigate.  (I found the Roku navigation a bit jumbled.)  The remote reaction is a lot better than that of AppleTV or Roku, as well.  It's the best value for the power out there.", "verified": true, "helpfulness": "0/0", "author": "Ernest"}]