[{"rating": 5.0, "review": "I love this fire stick. It was temporarily out of stock when I place my order. It arrived earlier than expected. The setup was easy with that animated intro plus it was already connected to my account to watch my prime TV/movies. I own a Roku and Comcast but the Fire stick has lots of games for my grandkids. Its a knockout in my home!", "verified": true, "helpfulness": "0/0", "author": "Deboss"}, {"rating": 5.0, "review": "Love it. 100 times better than my chromecast. Bought it at the same time as Amazon prime subscription witch was also worth the $$$", "verified": true, "helpfulness": "0/0", "author": "anthony boremi"}, {"rating": 1.0, "review": "Used to watch MLBTV.  Only had issues.  Cancelled MLBTV and returned fire TV stick.  All I had was a week of aggravation, but at least I got my money back.", "verified": true, "helpfulness": "0/0", "author": "John D."}, {"rating": 1.0, "review": "Honestly, I love amazon. Buy way more than I should on here. But this thing is a piece of $h1t.... I have great Internet service and all of my other electronics have no problem but whenever I try to use Hulu, WWE, or MLB this thing lags, loses service or freezes! It's my fault for buying a cheap piece of crap  I guess. Lesson learned, buy items on Amazon, not by Amazon....", "verified": true, "helpfulness": "0/0", "author": "Robert Haney"}, {"rating": 1.0, "review": "Most of the apps don't work...freezes constantly...needs to offer more popular apps...please fix", "verified": true, "helpfulness": "0/0", "author": "ms marlene the cake queen"}, {"rating": 5.0, "review": "It took me awhile to figure out how to work it but I love it! Have to force myself to turn it off at night and get to bed. With the same movies and shows on TV all the time, it was a great addition to my TV watching. I find it to be worth the money right now.", "verified": true, "helpfulness": "0/0", "author": "Smiling"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "deviouse25"}, {"rating": 5.0, "review": "I love this Firestick!  I have access to so much on my non-smart tv!!  No problems!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product. It only took minutes to set up", "verified": true, "helpfulness": "0/0", "author": "Patricia Winters-Baker"}, {"rating": 5.0, "review": "It does it's job and my son loves watching cartoons on prime videos. Plus it's cheaper in price then other streaming sticks and does the same job.", "verified": true, "helpfulness": "0/0", "author": "Stanley Flores"}]