[{"rating": 5.0, "review": "Love my Fire TV stick. Easy to pack for family trips to ensure we have our must see tv and movies on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "R. T. Smith"}, {"rating": 4.0, "review": "Best thing for me is save me lots of cable bills. I have so many choices of TV shows; Movies and U-tube type scripts. I am missing two channel.FOX cable News Network and CNBC Money  news. I am watching now Bloomberg TV for Money but not same level.Overall Fire TV Stick is really great.", "verified": true, "helpfulness": "0/0", "author": "Ashok O."}, {"rating": 1.0, "review": "Unable to access Hulu......I keep getting messages that the content is prohibited. There is no technical help available on this, so the fire stick goes in the desk drawer never to return.", "verified": true, "helpfulness": "0/1", "author": "Robert N Breece"}, {"rating": 5.0, "review": "LOVE LOVE LOVE LOVE LOVE!!!!", "verified": true, "helpfulness": "0/0", "author": "staroklacity \"SeaJae\""}, {"rating": 5.0, "review": "Awesome device, easy setup, works flawlessly!", "verified": true, "helpfulness": "0/0", "author": "tamika"}, {"rating": 5.0, "review": "An impressive device. Not much larger than a USB stick it packs a lot of features. Looking like many others to cut the cord, this device moves me well down the path to that end. I have ordered two more for my children's TVs.", "verified": true, "helpfulness": "0/0", "author": "R. C. Kuerth \"R Kuerth\""}, {"rating": 5.0, "review": "Best thing ever had.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have both the stick and the box and they are both way faster than the Apple TV, which made me so happy, I tried to \"stick\" with Apple TV, and like many kept waiting and waiting and still no apple tv update, well after this past June where there was suppose to be an updated version of apple tv, I finally gave up...With that said, I first bought the fire tv box through the deal with sling tv, immediately I fell in love with it, from how fast it is, to the many options of apps and games. I then bought the fire tv stick for the kids room and was amazed on how fast this little stick is compared to the apple tv that I moved it to the livingroom. Sorry kids....I'm sorry that I am only comparing it to the apple tv, but that's all that I had besides my son's playstation 3.There is no lag in this little thing, it's fast, and consistently keeps a strong WiFi signal, and the remote is amazing, not better than the fire tv box remote, as this one does not have the voice option.What I love most about the stick is that I keep it plugged in a cabinet on the back of my dvdo edge not behind my tv, and even being stuck in the back of an entertainment cabinet with the cabinet door kept closed, it still maintained a strong WiFi signal and there was no problem controlling the unit with the remote as the remote is bluetooth.Now, how I compared this to the apple tv, I had them both on at the same time and used Netflix at the very same time and put on the same movie which was world war z with Brad pitt.I started the movie at the very same time and the movie started up right away compared to the 10 seconds that it took for the apple tv to start the movie.I then skipped the movie ahead and the movie once again started up right away while the apple tv took forever to start up again.This thing is fast and now my apple tv is catching dust.I was trying to figure out something negative for this review and I found one thing, instead of me using the wall outlet to power this thing I am using the USB connection on my tv which does power this unit, the only problem is that when the tv shuts off so does the stick, which means when the tv comes on the stick is starting up with the tv. Which may not be a problem to most, but if you have an hdmi switcher/line doubler it will automatically turn on the line doubler signal.That's really it, I love this little thing, I am not sure how much more they can improve it is they come out with a second generation model, but I look forward to seeing how they can perfect it.Oh, and one more thing, just in case... for the gamers, the ps4 controller does not work with the fire tv stick, it does however work for the fire tv box. And it works well for the box, much better buy... I am not sure why, but it will not recognize the ps4 controller.Thank you", "verified": true, "helpfulness": "0/0", "author": "Enrique Vargas \"E. Vargas\""}, {"rating": 4.0, "review": "Does as advertised, happy so far thinking about canceling cable/dish tired  big wigs getting  all my money", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "My daughter loves it, I think it would be more convenient if it also replaced the antenna on the tv like I thought it did.", "verified": true, "helpfulness": "0/0", "author": "Cynthia E."}]