[{"rating": 5.0, "review": "great and wonderful ever......wow product...!!!its worth it ---- just $35 bucks...wow its amzing.....i love it a lot....", "verified": true, "helpfulness": "0/0", "author": "Rajesh Rajput"}, {"rating": 2.0, "review": "I have a slow internet service (DSL) - though I liked the interface & remote control - when compared with my Google stick - no comparison. Not sure how Google manages it but I get no latency watching Netflix. Using Amazon stick - Netflix was constantly stopping & downloading. I am one of few that still uses DSL - it satisfies my needs at a very low cost!", "verified": true, "helpfulness": "1/2", "author": "Delal"}, {"rating": 5.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "Ginger Brimer"}, {"rating": 5.0, "review": "I absolutely just LOVE this device!! Best $40 ever spent. Love the fact that you can sideload Kodi on it. Would totally recommend this to everyone I know. Not only it turns any regular tv with a hdmi slot into a smart tv, it really turns it into a genius tv.", "verified": true, "helpfulness": "0/0", "author": "Doc"}, {"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "nancy bigelow"}, {"rating": 5.0, "review": "The best streaming device ever!!!!! I take it to the hotels and watching movies and tv shows. its the best!!!!!!", "verified": true, "helpfulness": "0/0", "author": "The Bossman"}, {"rating": 5.0, "review": "Just Awesome! Better than my Apple Tv's and Roku boxes....plus you get free movies for being amazon prime members....", "verified": true, "helpfulness": "0/0", "author": "R.B \"Robert\""}, {"rating": 3.0, "review": "Such a shame.  With this device Amazon has decided to place their Prime content in their own sandbox for which I must condemn their action.  Data needs to be free! I bought this because a member of my household doesn't want to start the PS4 to watch Amazon Prime, and Amazon Prime isn't available to be cast to Chromecast or AppleTV for some reason.So now I have a Chromecast that I use for everything and Amazon TV Stick that I use for Amazon Prime content.There is ONE good thing about this device.  When it is setup, anyone on the network can use it - thank you for not making us sign in to different account credentials from different devices.But, please start playing nicely with Google devices and Apple devices and Roku etc. I shouldn't need to own this, but alas I do.", "verified": true, "helpfulness": "0/2", "author": "Mizzle655"}, {"rating": 1.0, "review": "It never works, won't stay connected to internet and/or it constantly buffers while trying to watch a show or movie....$40 wasted", "verified": true, "helpfulness": "0/1", "author": "Angie Potraffke"}, {"rating": 4.0, "review": "It's good but no quality video for showbox.  Kinda wish it was a  little more powerful.  may have to add the fire box for 99.00", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]