[{"rating": 5.0, "review": "Everything OK", "verified": true, "helpfulness": "0/0", "author": "Sebastian Levis"}, {"rating": 4.0, "review": "We do not have cable and with the stick we are able to enjoy movies, without paying the high cost of cable.", "verified": true, "helpfulness": "0/0", "author": "Anne"}, {"rating": 5.0, "review": "The Fire TV Stick truly works better than Apple TV, Google Chrome, or any preloaded Blu Ray/DVD Player I've used. The Speed and Transfer rates give better consistency with apps like Netflix and HBO GO, and the streaming music choices suit our families tastes.", "verified": true, "helpfulness": "0/0", "author": "Jonathan De Carlo"}, {"rating": 1.0, "review": "Only really works with prime  all additional apps freeze up and laggy", "verified": true, "helpfulness": "0/0", "author": "Chris casey"}, {"rating": 5.0, "review": "My dad suggested that I get this fire stick because I wanted to stream Netflix. It works Amazing! I even like the little remote!", "verified": true, "helpfulness": "0/0", "author": "Misty Meegan"}, {"rating": 5.0, "review": "I've used the Chromecast for a few months but after using the Fire TV Stick for a day, the Chromecast went in the garbage! This is an amazing product and I couldn't be happier with.", "verified": true, "helpfulness": "0/0", "author": "M. Porter \"spikep\""}, {"rating": 5.0, "review": "Allows me to get all of the content from Amazon, Hulu, Netflix, Slingbox and many more. Easy installation.", "verified": true, "helpfulness": "0/0", "author": "Cathy W."}, {"rating": 5.0, "review": "My family bought 4 for each room and we could not be happier...easy set up and so easy to use that my 5 year nephew can find his shows...advise though that you buy Netflix and/or Hulu, or else you have to pay", "verified": true, "helpfulness": "0/0", "author": "blunttruths"}, {"rating": 5.0, "review": "Love my fire stick TV.  Easy set up,just plug in and go.  Now I watch all my Amazon prime movies, etc on large screen and also, can view my photos on big screen.  Great investment", "verified": true, "helpfulness": "0/0", "author": "GC"}, {"rating": 5.0, "review": "Works perfectly for my Westinghouse 1080p in my bedroom. Now I can enjoy my Amazon Prime videos in bed.", "verified": true, "helpfulness": "0/0", "author": "Graniz7"}]