[{"rating": 5.0, "review": "Just great for the money.", "verified": true, "helpfulness": "0/0", "author": "Steve Bernstein"}, {"rating": 3.0, "review": "I was excited about the Fire Stick but it's not that great....I've had it for a little over a month and I've had to unplug it 5+ times because it froze along with other errors.I don't think I would recommend it. The Roku Box is more expensive but I had little to almost no problems with it when I was using it. I wish I had just gotten another Roku box but I was trying to save money....", "verified": true, "helpfulness": "0/0", "author": "AshleyNR"}, {"rating": 5.0, "review": "DOES THE JOB. easy to setup.have apple tv, chrome cast and fire tv. apple tv is the most useful one by far. chrome cast is the most useless one. fire TV plays my amazon prime TV shows every night to help me fall asleep.", "verified": true, "helpfulness": "0/2", "author": "solopwang \"S.olo.P Wang\""}, {"rating": 1.0, "review": "They advertise it as a plug in stick and play. N different than the fire tv still needs to be plugged into an ac to power up. usb ports on tv will not power the fire stick. I was sold on it being a simple plug and play without the need of a wall connection figured the tv's usb port would suffice but no tv usb port will work.", "verified": true, "helpfulness": "2/2", "author": "Virjinio Hernandez"}, {"rating": 5.0, "review": "The fire stick is great, we used to view amazon prime shows/movies through our tablet, which required being at the tablet until we found what we wanted to watch. Also once you're watching from the tablet and wanted to pause you would have to get up and pause at the tablet. Now with the fire stick we can just relax from our seats while searching/watching shows/movies. When done using fire stick we just change our tv mode and watch regular tv without hassle. BTW the menu is a very easy to navigate with simple but intelligent features. Have to say the same for the remote as well, simple but intelligent.", "verified": true, "helpfulness": "1/1", "author": "jRunner"}, {"rating": 5.0, "review": "We are so glad we bought this when it was on sale for Prime members.  I didn't know much about it when I bought it, but we've loved it.  I wish I could mirror (Airplay) from my iPhone to the Fire TV Stick, but other than that, it's really nice to have and easy to use.", "verified": true, "helpfulness": "1/1", "author": "Matt"}, {"rating": 5.0, "review": "Set up was easy  Haven't watched any movies yet.", "verified": true, "helpfulness": "0/0", "author": "Catherine M. Harper"}, {"rating": 5.0, "review": "Good fast,  recommend it for customers who plan on sticking with Amazon and tend to buy movies from Amazon often", "verified": true, "helpfulness": "0/0", "author": "Alan Gomez"}, {"rating": 5.0, "review": "Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Thad J. Gulczynski"}, {"rating": 1.0, "review": "Has a hard time reaching wireless.  Almost haveto have router right next to stick.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}]