[{"rating": 3.0, "review": "it loses connection constantly, and the issue is not my router. I have to frequently unplug and replug the fire stick in. very annoying.", "verified": true, "helpfulness": "1/1", "author": "Matthew James Jimothy"}, {"rating": 5.0, "review": "Love this thing planning on buying one for each tv", "verified": true, "helpfulness": "0/0", "author": "Christopher T."}, {"rating": 5.0, "review": "An Instant Success.I've experience with other similar devices, such as 'Google's' Chromecast but the Fire TV Stick from \"Amazon\" is a step ahead and, with it's own remote, so very easy to use.A multitude of video and TV at my fingertips and coupled with Amazon Prime it's almost indispensable to the viewing experience. There is so much available, so much to view, to listen to. Plug it in, anything necessary is included, decide on a few options and it's done. Very much to my liking.", "verified": true, "helpfulness": "0/0", "author": "Bill Oterson"}, {"rating": 5.0, "review": "Love it!  Responds quickly.", "verified": true, "helpfulness": "0/0", "author": "An Amazon Shopper"}, {"rating": 1.0, "review": "I am a loyal user and fan of Amazon.com's model, but the device has way more problems than I would expect from a decent software company. I use the stick only with NetFlix and every 10-20 minutes it buffers, shows % of buffered data as it loads it, and gets stuck at %25. This is when all other devices, like laptops and Roku 3 on the same network works great right at that point (even if I run all of them at the same time).This is not the worse part: the worse part is that the only way to get it working again is power cycle, and every couple of times it loses all Netflix account data and, at least once, WiFi account data. My finger started hurting from constant re-logging in. Resetting the stick to factory defaults has not changed anything.Writing to Amazon.com support is not helpful: even though I followed any possible troubleshooting (I have spent decades in software development), they want me on the phone to spend more time...I hope they will eventually make it better, but, in the meantime, I will use Roku 3.", "verified": true, "helpfulness": "0/0", "author": "uniq \"uniq\""}, {"rating": 5.0, "review": "I love it I ordered one for our living room", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to use great content", "verified": true, "helpfulness": "0/0", "author": "B"}, {"rating": 5.0, "review": "Seems to works as well as it big brother, which is no mean feat.", "verified": true, "helpfulness": "0/0", "author": "Phil Neil"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "should have done more testing before release. picture is choppy, constantly catching up with itself. wifi not strong enough, even when only 20 ft from the wireless router. no vudu. remote is too sensitive, most times registering 2 clicks instead of 1 thereby making selection sometimes difficult. nice idea but needs to go back to the drawing board amazon.", "verified": true, "helpfulness": "0/0", "author": "SunShine \"SunShine\""}]