[{"rating": 3.0, "review": "Easy to connect. However when I moved it away from the modem (20 feet), the signal dropped. I have high speed FIOS and this shouldn't happen. The door to the other was open and it had a difficult time buffering. I was disappointed because I was thinking of getting another stick for the other room.  Now, I won't need to do this. I have to keep it near the modem.", "verified": true, "helpfulness": "0/0", "author": "n.e."}, {"rating": 5.0, "review": "Absolutely love my fire stick tv. I don't sub to cable anymore.", "verified": true, "helpfulness": "0/0", "author": "JAINA BORROMEO"}, {"rating": 5.0, "review": "Easy set up and a great way to add Amazon, Netflix and more to any tv with a HDMI port. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Mark H Schickman"}, {"rating": 5.0, "review": "Great product -- as long as your WiFi is good.", "verified": true, "helpfulness": "0/0", "author": "Dave Flannery"}, {"rating": 5.0, "review": "Buy it. Trust me. I'm a doctor. Works great. Okay, I'm not actually a doctor. But buy it anyway.", "verified": true, "helpfulness": "0/0", "author": "Just Some Dude Who Buys Stuff on Amazon. A lot."}, {"rating": 5.0, "review": "Long story short we only have DVRs in two rooms (living room and our bedroom) and NOTHING for our guests.  We don't have guests enough to pay for an extra DVR box through DirecTV so I got this.  I LOVE, LOVE, LOVE this product.  On days I feel like hibernating, I go into the guest room and watch all of my favorite shoes on my Fire Stick on the tv in there.  Hulu, Amazon, Netflix (I have them all), so it is worth it to me to have a product that let's me (but my guests) always have something great to watch.", "verified": true, "helpfulness": "0/0", "author": "Steph"}, {"rating": 5.0, "review": "Amazing product. Easy to set up and great price.", "verified": true, "helpfulness": "0/0", "author": "Chris \"Author of Love Hurts: A Spiritual Journey to Wholeness\""}, {"rating": 3.0, "review": "Disappointed in the number of recent prime free movies available.", "verified": true, "helpfulness": "3/3", "author": "E. Einsohn"}, {"rating": 5.0, "review": "Best Streaming  Stick Ever", "verified": true, "helpfulness": "0/0", "author": "Shadz"}, {"rating": 5.0, "review": "Superb!!", "verified": true, "helpfulness": "0/0", "author": "Suraj"}]