[{"rating": 2.0, "review": "This device is slow. I find that it sometimes takes 2 or 3 minutes for it to close an app or for me to put it in sleep mode. Theres really only one app I use and i cant see a find a good way to find any other apps that are good. I tried searching for a particular app that a friend of mine has but perhaps im searching wrong. Ill probably use this until the next black friday when I can purchase a roku.", "verified": true, "helpfulness": "0/0", "author": "Manuel Casas Jr"}, {"rating": 4.0, "review": "Bought this to use in our trailer. We use Roku in almost all the rooms in our house so we were a bit skeptical about trying a new device but we were pleasantly surprised. It did not work on one of our smaller tvs even though it had an HDMI port so we switched to another small tv and it worked perfectly after that. Connects easily to the internet even at campgrounds where WIFI is a hard thing to come by. Also connects easily to hot spots. Definitely recommend", "verified": true, "helpfulness": "1/2", "author": "Cynthia G."}, {"rating": 5.0, "review": "Love this!!!!!! We might cancel cable we love it so much.  And the fact its portable is awesome", "verified": true, "helpfulness": "0/0", "author": "Teresa S. \"Reese\""}, {"rating": 2.0, "review": "has serious buffering problems, cannot maintain a connection with the wifi source when all other wi fi  connections are solid.picture has a tendency to be garbled. unless you are directly next to a wi fi source, you are SOL", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Love this fire stick! Just wish you could get the cbs app on it. Other than that it's great. Oh and the remote is so tiny. I lose it all the time.", "verified": true, "helpfulness": "0/0", "author": "Chelle"}, {"rating": 1.0, "review": "Doesn't really work that well. Specially if you stream a lot", "verified": true, "helpfulness": "0/0", "author": "Lisa M. Font"}, {"rating": 5.0, "review": "None", "verified": true, "helpfulness": "0/2", "author": "tracy hart"}, {"rating": 5.0, "review": "I was very skeptical when purchasing this. I read reviews for days, researched the product and compared it to Roku before finally ordered it. As a prime member there is so much available that I haven't bought any subscriptions to any of the apps yet. New stuff is added all the time and my family loves it. I did buy an Ethernet cord and USB attachment to plug it into my TV. Now the internet keeps up. It's rarely spent time having to buffer like a lot of review said...people are so negative in reviews sometimes. Overall I recommend this to all. It saves a ton of $ and offers a lot to watch. Now I just need to figure out which apps to get to enjoy my local network shows and super bowl, then I can finally be done w/contracts for TV. YAY!", "verified": true, "helpfulness": "1/1", "author": "Loretta childers"}, {"rating": 5.0, "review": "This stick enables one to enjoy Crackle, Plex, Pandora, Hulo to name a few! The remote control is nicely laid out with menu, home, back, play, pause  and rewind. This stick does have a multitude of gaming choices while coming with a dual powered core processor. You have Dolby audio as well! If your TV has powered USB ports that's an option for you, however they provide a power adapter if needed.There are some Bluetooth options, 8 GB of internal storage, with video coming in with resolution @1080P. If you have Amazon Prime, buffer time is reduced and what your looking for is loaded quickly. If needed an HDMI extender is provided. There is a learning curve in terms of learning how media is characterized,but easily comprehended once you start playing around with it bit. As long as everything is  on the same network, you can use voice commands.It comes with a long USB cable facilitating setup without hassle,while providing plenty of choices as far as gaming goes. The remote is similar to Amazon Fire TV albeit a little slower. It comes with 2 AAA batteries so you can get rolling right away! All in all a great buy, user friendly, with extensive options for your entertainment needs.", "verified": false, "helpfulness": "1/1", "author": "Shopper"}, {"rating": 1.0, "review": "I purchased from Best Buy because I wanted to talk to a person and they said this product was easy to use and popular.  The plug and play was definitely easy for a novice such as myself.  For a month this worked great and then all of a sudden it stops working because it says my wifi signal isn't strong enough.  I have my phone, laptop and ipad picking up the signal just fine and the wireless router is less than 6 feet away from the TV.  I now have a piece of crap that I can't do anything with.  Don't buy this piece of crap.", "verified": true, "helpfulness": "0/1", "author": "Chaviva"}]