[{"rating": 5.0, "review": "haven't used yet. I'm sure I will love it.", "verified": true, "helpfulness": "0/1", "author": "Kona"}, {"rating": 5.0, "review": "So far I like it, i just installed and works just fine, downloaded Hulu Plus and was trouble free, Amazon Prime pictures also perfect, easy to navigate , image quality is perfect, looks like a winner for Amazon", "verified": true, "helpfulness": "0/0", "author": "Boris Milan \"borism\""}, {"rating": 5.0, "review": "great device, very pleased", "verified": true, "helpfulness": "0/0", "author": "Rm"}, {"rating": 4.0, "review": "Love this device.  The only thing it is missing is the VUDU channel.", "verified": true, "helpfulness": "0/0", "author": "Lynnie Rose Terry \"Lynnie Terry\""}, {"rating": 5.0, "review": "Love the fire stick! Great product.", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "Works great! I mainly purchased the fire stick to work with our living room television that is not a smart tv. Much more convenient than waiting for our PS4 to boot up and wait to access netflix app plus easy access to prime content. The fire tv stick performs beautifully with my LG tv. Thanks to the Simplink feature on my tv I can hit the home button on my fire stick remote and go straight to the menu no need to manually switch to the required input. No problems with the app so far.", "verified": true, "helpfulness": "0/0", "author": "Mayra T"}, {"rating": 5.0, "review": "Stable quality and good features.It is worth to purchase at 40USD.", "verified": true, "helpfulness": "0/0", "author": "Sang H Kim"}, {"rating": 4.0, "review": "Love it.  Easy to use and set up.  The Amazon Prime playback is much better than other streaming devices. My only compliant is that the power cord isn't very long", "verified": true, "helpfulness": "0/0", "author": "Jackie Murphy \"ivy813\""}, {"rating": 5.0, "review": "Finally hooked the Stick up a week ago.  Had absolutely no problem with wifi connection.  Select the input for the Stick and Amazon comes right up. Easy to use with great resolution and quality.", "verified": true, "helpfulness": "0/0", "author": "LesW"}, {"rating": 5.0, "review": "Wonderful!", "verified": true, "helpfulness": "0/0", "author": "stacy"}]