[{"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "Works ok.  Roku is probably better.", "verified": true, "helpfulness": "0/0", "author": "A. Jardina \"Unacceptable Amazon Behavior\""}, {"rating": 5.0, "review": "I bought this for my son's TV because he doesn't have one of those smart tv that you can have internet directly from the TV. So far so good. Very easy to use and pretty cheap too.. Same concept as Apple TV but I like this one better for him since he's only 6.", "verified": true, "helpfulness": "0/0", "author": "Kennellie"}, {"rating": 1.0, "review": "When on Netflix, the navigation buttons go haywire. When on Hulu, audio/picture does not sync and it 'skips' and lags. I have Google Fiber, so I know it is not my internet connection. When I try to connect to my 5ghz channel, it says the password is wrong (yes...I know my password and am CERTAIN I am entering it correctly).It's alright, but it's very frustrating.3 month update:Remote doesn't work at all and the remote app is ridiculous. Stick randomly shuts down and disconnects to the Internet, or freezes for 10+ minutes.Wish I had never bought.", "verified": true, "helpfulness": "0/0", "author": "Georgina Schade"}, {"rating": 5.0, "review": "The Amazon Fire Stick in my opinion is a great product, & is truly better than my expectations of it.For once I feel that I didn't waste my money on junk. This was a great investment in my opinion. 😃", "verified": true, "helpfulness": "0/0", "author": "David Mulliganl"}, {"rating": 4.0, "review": "I love the firestick it's fast and easy to use the only thing I don't like about it is when I use Netflix it logs me off and I have to keep signing in besides that I love it", "verified": true, "helpfulness": "0/0", "author": "miguel"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Daniel Holter"}, {"rating": 4.0, "review": "Delivered almost a week later than scheduled. Works great.", "verified": true, "helpfulness": "0/0", "author": "JoJo"}, {"rating": 4.0, "review": "Works great other than occasionally saying no internet connection and you have to unplug it. Happens about once every few days. Other than that for the price a great purchase!", "verified": true, "helpfulness": "0/0", "author": "Timothy T. Watson \"metalmanw3\""}, {"rating": 3.0, "review": "For what it is (a little stick), it isn't bad. It runs very slow to load main screens and freezes often. Coming from apple tv to this, I somewhat regret my decision and wonder if the fire tv is any better but don't want to throw any more money away towards it.", "verified": true, "helpfulness": "0/0", "author": "Cconklin"}]