[{"rating": 5.0, "review": "Love it!!!!  Super easy to set up and was working in minutes. I had tried achromecast stick and never for it to work so I returned it. Fire TV stick works great!", "verified": true, "helpfulness": "0/0", "author": "Bonnie E. Putt"}, {"rating": 5.0, "review": "Absolutely fantastic! We use it for beautiful quality HD shows, YouTube, and fun games for our son! We have an older flats screen TV and it allows us to stream everything right to our tv. Perfectly wonderful!", "verified": true, "helpfulness": "0/0", "author": "Amanda Yanik"}, {"rating": 2.0, "review": "Freezes and Crashes often", "verified": true, "helpfulness": "0/0", "author": "Krystal"}, {"rating": 5.0, "review": "This does everything it is advertised to do. Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Bob Scheetz"}, {"rating": 5.0, "review": "best investment I ever made", "verified": true, "helpfulness": "0/0", "author": "Dolores S."}, {"rating": 5.0, "review": "Simple installation (plug it in and it walks you through what to do, it's truly dummy proof) and super easy to use.  Also, I don't have the top of the speed line of wifi and I have had no problems with video streaming.  Tons of options (movies, tv shows and music).  I'm very happy with it and would recommend it!", "verified": true, "helpfulness": "0/0", "author": "Robyn Berger"}, {"rating": 5.0, "review": "This is a great alternative to satellite TV or cable", "verified": true, "helpfulness": "0/0", "author": "Brittney Chance"}, {"rating": 5.0, "review": "It's easy to use and works great! Everything you need!", "verified": true, "helpfulness": "0/0", "author": "Stephanie Schaub"}, {"rating": 3.0, "review": "It doesn't do all I thought it would.  I got it to supplement cable... turns out nothing works on it without having cable as well.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 1.0, "review": "I purchased it in the US in order to use it for Netflix in a non-smart TV.I knew that many features are region locked but I still wanted it because the control is easy to use for my parents in Mexico (they only wanted it to access Netflix which has international service).It worked great, fast and responsive for the first two weeks, but Amazon blocked it and we can not access Netflix using this device anymore in Mexico.I'm really sad that Amazon blocked Netflix service for Mexico via this device. It was a waste of money, and I don't recommend to purchase it for using in other countries.", "verified": true, "helpfulness": "3/4", "author": "alefitus"}]