[{"rating": 5.0, "review": "Very easy to install with simple instructions.  Great product.", "verified": true, "helpfulness": "0/0", "author": "bill"}, {"rating": 5.0, "review": "Awesome !!!  I have the Apple TV too.  That I like for streaming from my iPad.  This I like for everything else.", "verified": true, "helpfulness": "0/0", "author": "J. Bucci \"JerseyBooch\""}, {"rating": 4.0, "review": "Love love love it. Easy set up, easy to use/navigate.Only thing I don't like... I like leaving the tv on when not home, but it goes to sleep and can't change that, but that's my personal preferences.", "verified": true, "helpfulness": "0/0", "author": "rachelle l. barro"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Ian Pullen"}, {"rating": 5.0, "review": "Easy to set up and use !!!", "verified": true, "helpfulness": "0/0", "author": "Antonio Alvarez"}, {"rating": 5.0, "review": "Debated whether to give it 4 or 5 stars... Went for 5 stars. The fire stick works great, not only to view movies from Netflix and view shows with amazon prime but also screen mirroring. The fire stick is fast when streaming media and I was surprised with the number of apps that it had knowing that Amazon's app store is fairly new. There's nothing else to say just that it was a great buy.", "verified": true, "helpfulness": "0/0", "author": "Adrian"}, {"rating": 5.0, "review": "!LOVE !LOVE! I bought myself one ad then my mom bought one because she loved mine. Then my mine bought one for my brother. It's a family affair. I am canceling my cable bc I watched all my sitcoms off of Hulu on here, then other stuff on Amazon prime and Netflix. No need for TV because I don't watch sports. I am going to get a clear TV antenna to get news channels. But so many options! We love it!! it is soooo easy to use", "verified": true, "helpfulness": "0/0", "author": "becklnn24"}, {"rating": 5.0, "review": "I bought this for my Mom and it was very easy to setup and to download the additional apps she needed, She was extremely pleased with the simplicity of it and the use of the remote. I would definitely recommend this product. My Mom is recommending it to her friends.", "verified": true, "helpfulness": "0/0", "author": "SG"}, {"rating": 5.0, "review": "Little dongle with so much use. I am able to install Kodi (XBMC) by side loading. If you are Amazon Prime you will like this little product.", "verified": true, "helpfulness": "0/0", "author": "Perry Kethlaor \"SuperPerry\""}, {"rating": 5.0, "review": "This is great. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "roxy"}]