[{"rating": 5.0, "review": "My Fire TV Stick arrived earlier than original estimate, easy to unpack, install, operate. Does everything it is supposed to. I used it to view Netflix and Amazon Prime video within minutes (seconds?) of unpacking box - no problems.", "verified": true, "helpfulness": "0/0", "author": "todd lofton"}, {"rating": 5.0, "review": "got this as a Christmas present for my parents, I find the interface to be relatively easy to use and get through. The power cord is definitely lengthy  enough,  remote is sleek, perfectly sized, and the software is a blaze I didn't have any soft lag! the unit as a whole is very responsive  :]  would recommend", "verified": true, "helpfulness": "0/0", "author": "JesusAngel"}, {"rating": 3.0, "review": "Overall it is ok but round button makes cracking noises while using which is very irritating while using.", "verified": true, "helpfulness": "0/0", "author": "Lalit Malik"}, {"rating": 5.0, "review": "Slick interface, fairly easy to set up, all the apps I needed were available out of the box (Netflix, Plex, Pandora, Spotify). Especially dig the availability of the screensaver type apps - fireplace, snow scenes, an aquarium - as they help my son go to sleep.Will probably pick up another one to replace the Chromecast in the Master Bedroom.", "verified": true, "helpfulness": "0/0", "author": "Justin Dupree"}, {"rating": 3.0, "review": "I've had this 4 days now and already have had to unplug the power twice to reboot it because it wouldn't play any content - could still scroll through selections but got an error when I selected something to play. the reboot restored playtime. I took off a star for that and one for no iOS app.I bought this because I love Amazon, it's prime media content, the amazing discount offered during Black friday deals for PRIME members ($19?) and I am annoyed at my blue ray player's slooooooow and rude interface (demands tv source until it fully loads ~ 2-3 minutes!!). The fire stick is quick to load and scroll and I love how it keeps a feed of my most recently played content. With a toddler we watch THE SAME stuff over and over so its nice that its so easily accessible :) I am very happy with it but am impatient about the iOS app because I want the voice searching features. I don't mind too much that I have to keep rebooting the device, but I've yet to see if this will be an ongoing issue.", "verified": true, "helpfulness": "0/0", "author": "Carrie Staiger \"CS\""}, {"rating": 1.0, "review": "Bought to plug into my computer monitor and use when I shut the computer off (save power and get a remote) but since the monitor itself has no volume control and the stick has no software solution, it's unbearably loud.", "verified": true, "helpfulness": "3/5", "author": "Jordan"}, {"rating": 4.0, "review": "This was easy to setup and works well. The picture is very good, but I do fine that the stick doesn't always respond to the remote. In fact, one time, I had to unplug the power to the Stick to get the remote to work.", "verified": true, "helpfulness": "0/0", "author": "NaplesHow"}, {"rating": 4.0, "review": "If your TV doesn't have internet access the Fire Stick will provide it.  It provides access to Amazon Prime, Netflix, Hulu, and many other apps.  My only complaint is it disconnects from the wifi connection on a regular basis.  My network is strong and I don't have this problem with any other devices.", "verified": true, "helpfulness": "0/0", "author": "Jason L."}, {"rating": 5.0, "review": "i have an Amazon fire TV stick and xfinity cable with ESPN and the watch ESPN app no longer streams live TV like the app says. A week ago live TV was streaming just fine. I believe this is due to the new xfinity app; however, the xfinity app does not work on the Amazon fire TV stick.UPDATE 12/23:Overnight the issue was fixed!  I woke up this morning able to stream Mike and Mike with no issues.  I don't know what the issue was, but it is fixed now.  Adding to the review of the problem, I was able to stream the Monday Night Football feed through the same xfinity account on the watch espn app on an Xbox 360, so I know it wasn't a problem with the xfinity account.", "verified": true, "helpfulness": "2/3", "author": "George R. Harrum"}, {"rating": 5.0, "review": "Works like it should. I got it for the $20 pre-order price, is a great addition for my bedroom TV. I have AppleTV in the living room and this is as fast or faster. I downloaded the remote app for android - a great addition to this device.", "verified": true, "helpfulness": "0/0", "author": "M. Brady"}]