[{"rating": 2.0, "review": "Love the features. There's a lot of options that being said.  It freezes up a lot!  I have an old bluray that had less lag. I really wish this product was more efficient because I love the portability of it but I should have invested more money and went with the roku. My advice is to bypass this product.", "verified": true, "helpfulness": "0/0", "author": "Shiloh Worman"}, {"rating": 4.0, "review": "Great product got it for my father very simple to use. Could come with a longer power cord seeing that most TV is a are not strong enough to support powering the stick.", "verified": true, "helpfulness": "0/0", "author": "Stephen M."}, {"rating": 1.0, "review": "i received it only for it to work for a week and then starts to act up. my internet/wi-fi work great with everything except this product. i can get on my kindle and watch anything.i use the kindle fire stick and it takes forever to load then acts like the wifi is down then other times it loads and i can watch the show for a few minutes then in buffers and then drops it. i am more then furious with this product.", "verified": true, "helpfulness": "0/0", "author": "Evan M Thomas"}, {"rating": 5.0, "review": "easy to use, no issues with the wifi and excellent picture!", "verified": true, "helpfulness": "0/0", "author": "andrew gzibovskis"}, {"rating": 4.0, "review": "This is the second fire stick I have bought and I have been extremely pleased with them.  Easy to install and operate, looking forward to the HBO Go app.", "verified": true, "helpfulness": "0/0", "author": "Ronald Bailey"}, {"rating": 5.0, "review": "love having this to use to watch all my amazon shows!", "verified": true, "helpfulness": "0/0", "author": "bananna"}, {"rating": 5.0, "review": "Excellent couldn't ask or want anything more. Everyone should have.", "verified": true, "helpfulness": "0/0", "author": "Lettie Reinholtz"}, {"rating": 4.0, "review": "Amazingly easy to install and set up. Short tutorial video follows installation making navigation simple. Have had some trouble with movies stopping part-way through; then have to turn the device completely off to reset it. Following that I am able to turn it on again, find the movie I was watching and restart it right where it stopped. Not sure if it is the device or the streaming service or my ISP. Not having had the problem before, I tend to blame the Fire Stick. But since all the other devices I use to watch movies are hard-wired, it's hard to be sure. Would I buy it again? You bet.", "verified": true, "helpfulness": "0/0", "author": "Melanie Calder"}, {"rating": 5.0, "review": "Got this as a Christmas gift from my son who considers me \"electronically challenged'.  It works great -- no longer have to switch remotes or hook up my Kindle HD Fire to the TV.  I can watch everything from our regular channels, plus Amazon Prime and Netflix by using one remote.", "verified": true, "helpfulness": "0/0", "author": "Annie B."}, {"rating": 5.0, "review": "Great device!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]