[{"rating": 5.0, "review": "Just got the Fire TV Stick delivered and setup was easy. The remote app is a must for voice activated or text search. I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Van W. Padgett"}, {"rating": 5.0, "review": "wish I knew about this a long time ago. works great", "verified": true, "helpfulness": "0/0", "author": "hollymtx \"holly\""}, {"rating": 1.0, "review": "I never have a good internet connection with it. I have a Wii now and Netflix is streaming perfectly.", "verified": true, "helpfulness": "1/1", "author": "Nancy hanke"}, {"rating": 3.0, "review": "The fire stick is an easy little device, that has a great price point.  Buy it with the sling tv deal, and it pretty much is free! however, I already have a roku and got this for an additional tv.  The set up and everything is very easy to use - however i have to say i still prefer the roku.  i already noticed some of the apps are not available on the fire stick ( such as fox), which limits what you are getting right off the bat.  the navigation is decent on this thing, but roku's is still better.", "verified": true, "helpfulness": "0/0", "author": "Up In the air"}, {"rating": 1.0, "review": "Will not connect to my internet. Lots of people have had this problem. Should have read reviews first. Hopefully you will!!", "verified": false, "helpfulness": "1/1", "author": "kgreen"}, {"rating": 3.0, "review": "Has problems with  connection here and there,in an area of my home that has strong connection", "verified": true, "helpfulness": "0/0", "author": "Adam Wallander"}, {"rating": 4.0, "review": "Love it...' should have bought one earlier.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Stevenson"}, {"rating": 4.0, "review": "I've had it for a week and have enjoyed speeding to the shows I like. I have used the phone app too, it's a gem. To be able to just say a show name and it pops up on the screen, very cool! I would like to be able to edit my photos with the Firestick. Specifically delete what I don't want in my cloud. The stick also froze on my last night and refused to respond. Probably a one time issue. I'm excited to have this cool little piece of technology.", "verified": true, "helpfulness": "0/0", "author": "cavemom"}, {"rating": 5.0, "review": "Do u haVe to have internet attached to Ur tv. Or just WiFi, which I do have?? This site doesn't even mention how it works.", "verified": false, "helpfulness": "0/0", "author": "John Garten"}, {"rating": 5.0, "review": "Works great and has a ton of programing.  Easy way to add a TV with out the need for wires or a cable box!", "verified": true, "helpfulness": "0/0", "author": "Ryan L."}]