[{"rating": 2.0, "review": "Not worth $39 at allI was able to purchase it during promo for $19 and that's probably what it's really worthPROS:Screen MirrorRemoteCONS:Has only 2 ProsI guess I just was expecting more from thisIt's very Amazon based obviously and well I do have Prime so I get free access to some contentall the good content you have to PAY forNetflix and Prime pretty much have the same content so while I already have a Netflix account Prime offers me nothing newThis stick will become obsoleteNice try Amazon.", "verified": true, "helpfulness": "2/4", "author": "J. A"}, {"rating": 4.0, "review": "This is a great streaming product.  I'm very pleased with it's operation.  One downside was the setup of the device.  It was somewhat clunky since it appears that almost all the software necessary to run it must be downloaded from the Internet prior to use.  I was a bit surprised that it would be shipped without the vast majority of the software needed to run it.  The download took 30+ minutes to complete.Still, once it was set up it is phenomenal.  Great video quality, apps for other services besides Amazon run well, and the ability to play game apps was a pleasant surprise since I really didn't think I would enjoy using them.", "verified": true, "helpfulness": "0/0", "author": "WPM"}, {"rating": 4.0, "review": "Simple UI, fast search, cheap! Perfect supplemental device for cord-cutters.Con: Setup was kind of a chore, required login, long software update, second login (not a simple thing with a remote keyboard UI and long email/password combos) and a mandatory welcome video.", "verified": true, "helpfulness": "0/1", "author": "Andy T"}, {"rating": 5.0, "review": "Works better then expected so far. Browsing Amazon Prime is now a breeze with Fire stick,  the main reason to buy this product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I received this product a few days ago.Setting it up was simple.  Aesthetically it was great.  The remote is nice and easy to use.  Cheap at $19.However, minus the original setup, I have had nothing but issues with connecting to my wi-fi, maintaining the connection, and using the connection to stream.  I bought the stick with the intention of watching watchespn in a room with no cable box.  This was going to replace the chromecast which has worked flawlessly, but required me to either use my phone or laptop to cast watchespn over.  At no point was I able to watch for more than 5 minutes without having an issue.Discussing with tech support got no better results.  Read some reviews, and this appears to be a repetitive issue.I will be returning it and not purchasing it again in the future.", "verified": true, "helpfulness": "4/6", "author": "DG"}, {"rating": 5.0, "review": "Very nice little device for Amazon prime members!* Setup is a little slow ~ 15 minutes but it's worth waiting* you can sideload other apps(just google it) in addition to your some amazon apps* shows streams very fast (except for youtube app)* miracast works well for kindle fire tablet (Surface pro's connection not very stable)* interface is simple enough to navigate", "verified": true, "helpfulness": "1/1", "author": "Matt"}, {"rating": 3.0, "review": "So far it's three stars: I pre-ordered close to day one of availability, and received it today (Nov 26), so it's basically brand new.  I'm now sitting through what has so far been nearly a 15 minute process of \"Downloading the latest software\".  Call me crazy, but couldn't the first version have shipped with software that would, you know, work out of the box.Will update if it ever finishes downloading....***UPDATE***Oy vey, after three install screens,a restart, the need to re-enter the password to the network it just used to get the update, the blasted thing kicks into an instruction video that I CAN'T EXIT!!! Call me a grouch if you will, but I expect to be able to use the thing I just bought.  This is making me very sad....", "verified": true, "helpfulness": "1/2", "author": "Simon Jones \"Self-Professed Geek\""}, {"rating": 5.0, "review": "Just got my Fire Stick yesterday and plugged in. I bought this since I couldnt watch my Amazon Prime Video through chrome cast to my TV.  Works great and love the little remote that comes with - also can use my phone ( android) as a remote as well through the app. I will use with my Netflix accounts.  There is also an option to stream music or view photos too! Looks like you can play apps & games as well but I wll use it most for Movie & Prime Tv - now just need another season Transparent to come out - I watched that way too fast.", "verified": true, "helpfulness": "1/1", "author": "JX3"}, {"rating": 3.0, "review": "Got my Fire TV Stick on Nov. 24th.  I like the overall interface.  The UI is responsive.  However, I purchased two of these sticks to use primarily as a Plex client.  It doesn't support directplay for mkv files and the transcoded content stutters intermittently during playback.  I almost always get initial stuttering at the beginning and then sometimes it will stutter in the middle of the content I'm viewing.  I've tried both the 2.4Ghz & 5Ghz wifi bands.  Plugged it in directly to the wall instead of using my TV's usb as well.  My router is less than 5 feet away too.I have both chromecast and roku sticks as well and have no problems streaming .mkv files through Plex on those sticks.  So if you're getting this for Plex streaming - you will probably be disappointed.", "verified": true, "helpfulness": "2/2", "author": "A. Tran"}, {"rating": 5.0, "review": "I just received the Fire TV stick yesterday. My initial thought was how well it was put together in the box, and how clear the instructions are. I own the Google Chromecast; its a completely different device in its entirety, but it's still connected the same way into your TV. Plug the device into your HDMI output on your HDTV, and the start-up menu comes up immediately. The start-up time is very fast considering its size and internal components. The included remote is a very huge plus for me. The navigation through the menus is fast, simple, and easy. There's really not much else to say knowing that it's a media player, but it's completely different from any other. Buy it, and you won't be disappointed.", "verified": true, "helpfulness": "1/1", "author": "Ethan Davis"}]