[{"rating": 5.0, "review": "I am extremely pleased with Amazon Fire TV Stick. It has lived up to my expectations, and more. As a senior, I am not able to install, or understand many of today's technical items. The directions were very clear and easy to follow. Within ten minutes, the Fire Stick was installed, and working. Also, the content is incredible and I still haven't seen much of what the Stick has to offer. My music and photos stored on Amazon Cloud, are on the screen with the touch of a button. The Fire Stick is well worth the price Amazon is charging. Great buy.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "This was one of the best purchases I made this past year.  I was able to do it all by myself and it is everything I hoped for and then some!  I love this!", "verified": true, "helpfulness": "0/0", "author": "Sharon Glaze"}, {"rating": 2.0, "review": "I don't like that my movies have to load several times when watching them...this doesn't happen with any of my other brand streaming devices....", "verified": true, "helpfulness": "0/0", "author": "M. Foster \"kindle lover\""}, {"rating": 1.0, "review": "Many episodes of The Simpsons. For sale.  What a joke. Too much is for rent or purchase. This is a waste of time and money, why am I paying for Amazon Prime?  In no way do I recommend this money grab.,,", "verified": true, "helpfulness": "2/2", "author": "Dean Wilkinson \"DNO\""}, {"rating": 5.0, "review": "Good deal for a good streamer. One step closer to cutting the cord.", "verified": true, "helpfulness": "0/0", "author": "cawbob"}, {"rating": 5.0, "review": "Not as fast as the Fire TV Box - but definitely a great addition too our entertainment arsenal", "verified": true, "helpfulness": "0/0", "author": "Jack n Carol"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Amanda House"}, {"rating": 5.0, "review": "It's Great! I love it!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "anna60"}, {"rating": 1.0, "review": "WAY too complicated to get working. Had to enter an absurd amount of personal info.", "verified": true, "helpfulness": "1/1", "author": "Daniel Korte"}, {"rating": 5.0, "review": "I don't often write reviews but I felt this product deserved it. At $40 I don't think you can find a better streaming device.", "verified": true, "helpfulness": "0/0", "author": "greg hansen"}]