[{"rating": 2.0, "review": "Twitch.tv app only supports 480p quality.  I would not recommend this FireTV stick to any of my friends until the Twitch app supports high res streaming.  Considering Twitch is now owned by Amazon, I expected the Twitch app for FireTV to be much better quality.", "verified": false, "helpfulness": "0/0", "author": "Jordan Lantz"}, {"rating": 5.0, "review": "This was a Christmas gift from my daughter. It really works well for viewing Prime movies", "verified": true, "helpfulness": "0/0", "author": "David P. Lyle"}, {"rating": 5.0, "review": "Great value!!", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Lyne"}, {"rating": 3.0, "review": "VERY short wifi range.  Got this planning on using it on our secondary television (Roku 3 being on our primary), but unfortunately the wifi won't reach it.  We can watch the same videos in the same room on our laptop easily, but for some reason not on the fire stick. It is about 25 ft away from our router, with 1 wall in the way.  If you get this, plan on it being used right next to your wifi router, or go another route for your streaming needs.", "verified": true, "helpfulness": "0/0", "author": "W. Boots"}, {"rating": 5.0, "review": "So far great. Simple set up.  Enjoying the wide variety of movies", "verified": true, "helpfulness": "0/0", "author": "Michelle Campos"}, {"rating": 4.0, "review": "All in all the Fire Stick is great. Some apps have issues but I think that goes back to the App's company. I wish it allowed access to your home network but not a big deal. Prime always streams perfectly.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "Does everthing we want it to do, thinking about buying a Fire TV Stick for some of my other TVs. The menu process is quick, access to content is also very fast.", "verified": true, "helpfulness": "0/0", "author": "no$$sully3"}, {"rating": 5.0, "review": "Love the firestick! We have 2 of them! Easy access to Netflix and free prime movies! I even have photos downloaded for a slide show!", "verified": true, "helpfulness": "0/0", "author": "A.Speed"}, {"rating": 5.0, "review": "Easy to use. Great selection. Prime is the best. i puchased two for my home. One for my mother (in her 80's and finds it easy to use) and one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "Edward Fiscella \"stage3091\""}]