[{"rating": 5.0, "review": "Great device I'm glad I ordered it.  Thanls", "verified": true, "helpfulness": "0/0", "author": "Jerry Smith"}, {"rating": 5.0, "review": "I bought this to use at my parents house. I personally own several other \"stick\" style casting devices and I feel the Fire TV Stick has a level of ease that some of the others don't. For me, a tech savvy person, it doesn't really matter. But, for my parents, the easier it is to use the better and they are happy with this little stick.", "verified": true, "helpfulness": "0/0", "author": "R. J. Wilson"}, {"rating": 5.0, "review": "works better than my chromecast. I have a smart tv but the Amazon app sucks on it. Everything works better on the stick", "verified": true, "helpfulness": "0/0", "author": "Tryan42"}, {"rating": 2.0, "review": "I was really looking forward to this device, and will probably end up keeping it and hoping for a firmware upgrade.  I bought it because I liked the idea of having one stick that would let me cast my windows 8.1 tablet's screen onto a hotel TV, and let me use my Netflix and Amazon Prime accounts in hotels too.  It works great at home, but despite the labeling it is NOT Miracast capable at this point. It is also no good on any wifi account where you have to open a web browser and sign in (hotel rooms for instance).  It works great on a home Access Point where you simply furnish a password.", "verified": true, "helpfulness": "1/1", "author": "Bob Musser"}, {"rating": 1.0, "review": "I removed it from my tv because it conflicted with my Apple TV", "verified": true, "helpfulness": "0/0", "author": "DaKind"}, {"rating": 1.0, "review": "I just can't get the Fire Stick to maintain a wifi connection.  I think the Wifi sensitivity in the stick is very poor.  I have an Apple TV (under some shelving) within two feet of the stick and there have never been any problems with that device getting on either of my wifi routers.  For the longest time I couldn't get ANY wi-fi connection on the stick.  Finally, and intermittently, I got one of the routers to appear, but it lists the connection as \"Fair.\"  Also, the one time I was able to stream an Amazon Instant video the quality wasn't that good (probably because the wifi connection wasn't that good).  Considering this device is usually plugged into the back of a TV and has to stay there (because the included adaptor is only a few inches long) you would have thought that the wi-fi sensitivity would be much much better.  There are enough complaints on Amazon forums to make me realize that I don't think I just got a one off defective stick.  I was on a combination of Amazon customer chat, email, and phone calls and they couldn't help.  They basically kept telling me to reset it and unplug it.  None of which really helped.  I wish I hadn't bought it, but there's just not many accessories to get Amazon instant to your TV since Apple TV and Chromecast don't have the Amazon app.  But I'm surprised that so many people like this and have reported no problems.", "verified": true, "helpfulness": "1/1", "author": "Flatfooted"}, {"rating": 5.0, "review": "Amazon has really stepped up their game with the Fire Stick, always works better than my Apple TV", "verified": true, "helpfulness": "0/0", "author": "N. Serrano"}, {"rating": 5.0, "review": "For the cost, it does exactly what I need. My kids love it as it is easy for them to use and maneuver. I won't do  a technical review as I have nothing to compare it to, but the simplicity is a deal breaker compared to other products I've read review for. I'm very satisfied, and after the first one worked out so well, I bought 2 more for our other TVs.", "verified": true, "helpfulness": "0/0", "author": "Shannon McCarrick"}, {"rating": 5.0, "review": "I liked my Fire TV Stick so much that I bought the Fire TV. In fact, I liked them both so much that I ported one of my iPhone games so that it could be played using the remote. Feel free to download Lost Balloon for free after you get one of these cool devices.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Tony Kulla\""}, {"rating": 5.0, "review": "Great add on for your TV", "verified": true, "helpfulness": "0/0", "author": "Tisha Moon"}]