[{"rating": 4.0, "review": "Great product at a great price", "verified": true, "helpfulness": "0/0", "author": "Charles S. Probert"}, {"rating": 4.0, "review": "Plenty of options for TV viewing which will allow me to reduce my Uverse planm", "verified": true, "helpfulness": "0/0", "author": "John W. Thomas Jr."}, {"rating": 5.0, "review": "Had the Fire TV Stick up and running within minutes! Works great. Great price, too.", "verified": true, "helpfulness": "1/1", "author": "Seashores"}, {"rating": 5.0, "review": "Great......", "verified": true, "helpfulness": "0/0", "author": "Eduardo Lopez"}, {"rating": 5.0, "review": "Works great.  Couldn't ask for more for the price.", "verified": true, "helpfulness": "0/0", "author": "Veronica"}, {"rating": 2.0, "review": "Not connected to Xfinity Comcast so I can not connect to my cable registration to view certain apps such as Showtime, HBOGo, Disney and others. So it's a bit disappointing.", "verified": true, "helpfulness": "1/1", "author": "Judith Gates"}, {"rating": 4.0, "review": "Fun, easy to use! I'm still exploring, but so far, so good! I like the availability of quality games like bowling and pinball in addition to movies and TV, and the ease with which I can switch between them.", "verified": true, "helpfulness": "0/0", "author": "JeffL0719"}, {"rating": 4.0, "review": "This is great! Can't beat the price. Love the compact size. Couldn't get it to work on one TV, but worked on 2 others.", "verified": true, "helpfulness": "0/0", "author": "New Mom"}, {"rating": 5.0, "review": "Very happy with the Fire TV stick. Easy to set up, easy menu to maneuver. On line help answered all my questions and more. Love that I can use my smart phone to talk for searches, so much more convenient compared to typing in information. Best buy I made in awhile!", "verified": true, "helpfulness": "0/0", "author": "K. Palmer \"Sage Hen Designs\""}, {"rating": 3.0, "review": "Will give it 5 stars when they add a favorites bar so I can navigate to all apps like Netflix or plex easily, additionally if you child protect it, you have to enter a 5 digit pin for even free prime video content for every show, not good.  Amazon is close, but my original old Roku, still had a better interface.", "verified": true, "helpfulness": "0/0", "author": "Karobekian \"R. Bodoin\""}]