[{"rating": 2.0, "review": "I was very pleased with the firestick in the beginning but after only a month it freezes very bad", "verified": true, "helpfulness": "0/0", "author": "Dominiquie Celestine"}, {"rating": 5.0, "review": "Lovin the fire tv stick I got hulu netflix my grandkids can watch their favorite cartoons like spongebob dora and others plus I have a month of amazon prime free its all good!!!", "verified": true, "helpfulness": "0/0", "author": "t. gray"}, {"rating": 5.0, "review": "Great item. Easy install!", "verified": true, "helpfulness": "0/0", "author": "JFakes"}, {"rating": 4.0, "review": "EASY AND WORKS AS ADVERTISED", "verified": true, "helpfulness": "0/0", "author": "Charlie Allen"}, {"rating": 4.0, "review": "While I find the stick to be a lifesaver after the sad death of my Wii, I think that it has its faults. I love the apps and games that come with it and it makes having friends over even more entertaining but when it comes to internet connection, it lacks the range. Videos generally work but there are many times in which the internet is not connecting and it buffers for so long that I give up.", "verified": true, "helpfulness": "0/0", "author": "Michaela F."}, {"rating": 1.0, "review": "The stick did not work, couldn't get a wifi connection at all", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 4.0, "review": "Decent product for a decent price. We are in the process of getting rid of cable and wanted to test out this product prior to doing so. It was very easy to hookup and setup. The Fire stick is lacking in some areas... you can't access HBO-Go from it yet, I wasn't able to set up shortcuts for local stations that are options on other devices. Overall, I think it's a good device to have being an Amazon Prime member but I don't think this device alone will allow us to still have access to the shows we watch.", "verified": true, "helpfulness": "0/0", "author": "NLA"}, {"rating": 5.0, "review": "Amazing! Makes streaming easier than ever. I am going to buy another for my other TV!", "verified": true, "helpfulness": "0/0", "author": "Mel A"}, {"rating": 5.0, "review": "This thing is amazing... hands down better than my ChromeCast and outgoing Roku 2 XS!  Check out the XDA Forums for this (http://forum.xda-developers.com/showthread.php?t=2793823) there's so much you can do with this!", "verified": true, "helpfulness": "0/0", "author": "Matt C."}, {"rating": 2.0, "review": "The remote is quite light and cheap. The Firestick would not play Netflix even though that service workedperfectly on any of my other devices including a first generation Ipad. I spent a good 20 minutes on the phone with an Amazon techwho could not fix the problem. Was sent a replacement stick and that also did not work.", "verified": true, "helpfulness": "0/0", "author": "scenepainter"}]