[{"rating": 1.0, "review": "In general it works well for the purpose.  However, there are two things worth considering before you buy it:1. and the more serious one: The wifi connection is buggy.  I have use it just a week, and I have met a couple of wifi connection problems.  The thing is after wake up the fire stick saw my wireless router, and connected to it but complaining connection problem, while all my other devices worked well with the same router.  The only solution is to unplug the power of the stick and plugin again, because there is no reboot setting for the stick, this can be quite inconvenient sometimes.2. The power adapter for the stick is unusually big and take up the space for two outlets.Un the upside, it is fast and the remote is quite handy.  With the purchase of Plex app, it works nicely for me.", "verified": true, "helpfulness": "1/1", "author": "penpal"}, {"rating": 5.0, "review": "Awesome really cool", "verified": true, "helpfulness": "0/0", "author": "shashank"}, {"rating": 4.0, "review": "My review may be colored by the fact that I paid $400 a few years ago for a huge LG box that is supposed to do the things the Fire TV Stick does. They ceased production of the box and stopped making updates for it the following year. I can't tell you what a relief it is to have something that actually works. Set up couldn't have been simpler. Its cheap as heck. I've only used Netflix and Pandora, but the HD picture and streaming are flawless. The only drawback I see is that it requires a power cord. I don't know a lot about much, but it seems to me that nothing HDMI or USB should need to be independently powered.", "verified": true, "helpfulness": "1/1", "author": "Suzanne Starr"}, {"rating": 5.0, "review": "What a bargin,I got. Love the stick, I bought it for my older tv and now I can watch all my prime shows and movies. You cant beat amazon with the free shipping and all the prime viewing I never have to leave the house. THANKS AMAZON...", "verified": true, "helpfulness": "1/1", "author": "oldwiseone"}, {"rating": 5.0, "review": "Absolutely love it! We've used it for awhile now, and have never had a problem with it. It's easy to use and our kids love the selection of shows and movies. I wish there was a larger selection to pick from, but overall this is a great product, and I highly recommend it!", "verified": true, "helpfulness": "1/1", "author": "J Pottorff"}, {"rating": 4.0, "review": "It does everything I need it to do. Especially for the price! I'm very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Rhonda Washington"}, {"rating": 5.0, "review": "Total steps getting started.Plugged in the Fire Stick Changed tv input,Touched a button on the FS remote FS  found my networkEntered passwordVideo started.Interface is simple and easy to use. I've downloaded Netflix and Pluto TV for starters. Pluto can laggy at first, but it is loading HD content, so I'll get over it. Amazon instant is obviously built in, and had no lag when I used it. If you are an Amazon Prime user, this device is a no brainer. Get it.", "verified": true, "helpfulness": "0/0", "author": "jeff clements"}, {"rating": 2.0, "review": " I contacted Amazon Customer Support because my fireTV stick is severely blacking out and flickering on my Samsung P2770HD. I posted a video here. There were several other review complaints regarding the fireTV stick and certain Samsung HD televisions and so I decided to get to the bottom of it. After 1 hour and 20 minutes with two folks from Amazon tech support and two folks from Samsung tech support. The verdict is in. There is not a problem with my fireTV stick or my Samsung P2770HD. The problem is that the two products are not compatible. Simple as that folks. I am convinced that this Amazon's issue to solve in a future update after they have tested the product on certain Samsung HD tvs. This could be an issue with Onkyo and Yamaha as well because of several models in those brands not being in compliance with High-bandwidth Digital Content Protection (HDCP) protocols. Luckily, my fireTV stick works fine for my other television (or else I would have given 1 star), but I bought it specifically for the Samsung in my office so waste of money, luckily it was not that expensive. I hope other Samsung owners have better luck, but I'd advise testing it on your Samsung, Onkyo, or Yamaha Brand Televisions before purchasing.", "verified": true, "helpfulness": "2/3", "author": "Donnell Butler \"DJB\""}, {"rating": 5.0, "review": "The fire stick connected to the net very easily and I was streaming movies in no time. The remote is very responsive. I am able to surf movies without hesitation. It seems to be built well and has a good feel when I press the buttons on the control. I am satisfied with this unit at this time.", "verified": true, "helpfulness": "0/0", "author": "joseph pullano"}, {"rating": 5.0, "review": "Love the ease of use and versatility, as well as the number of shows/apps we're able to get!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]