[{"rating": 4.0, "review": "Awesome...4.5", "verified": true, "helpfulness": "0/0", "author": "Joe Brown"}, {"rating": 5.0, "review": "Great way to drop the cable!", "verified": true, "helpfulness": "0/0", "author": "Moon"}, {"rating": 5.0, "review": "This ews about the easiest installation and set up of any device I've ever purchased.", "verified": true, "helpfulness": "0/0", "author": "Orville T. Laughlin Jr."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "DKR41 \"butterfly queen\""}, {"rating": 5.0, "review": "Much more than I bargained for. It will take weeks to explore all this baby can do!", "verified": true, "helpfulness": "0/0", "author": "Langston A. Walker, Jr."}, {"rating": 4.0, "review": "It is great, took a few times to get it set up right, but seems to work fine.", "verified": true, "helpfulness": "0/0", "author": "Mary Paolozzi"}, {"rating": 4.0, "review": "It works pretty well, I have been using it to get access to Sling (ESPN, FoodNetwork, CNN). It is tough to plug into the HDMI port, the connection just doesn't seem to want to fit and I don't like the power cable that has to attach to the stick itself. It ruins the look of my TV so I end up taking it down and then have to remount it.The stick performs as it is intended.", "verified": true, "helpfulness": "0/0", "author": "Patrick Duff"}, {"rating": 5.0, "review": "This is the best thing ever. If you don't have a smart TV and have prime then this is a must. My grandkids can now find something they like to watch when nothing is on TV.", "verified": true, "helpfulness": "0/0", "author": "LifeInYukon"}, {"rating": 5.0, "review": "Works perfectly as promised.  A great compliment and frankly works even better than the google chrome cast because you have the ability to have apps on here.  My son gets on here and plays game using this all the time so I figured I would go ahead and invest in the joystick thats an optional accessory that can be purchased.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Feliz"}, {"rating": 5.0, "review": "I loved it until my daughter came home for Spring Break and took it.Now she loves it.", "verified": true, "helpfulness": "0/0", "author": "Terry Lynn Greene"}]