[{"rating": 5.0, "review": "I have Roku, Apple TV, smart TV's, but this Fire TV Stick is the best streaming device of them all!  Love love love it!  The remote is bluetooth, so you don't have to aim it at the tv, you can even use it under a blanket.  The interface is fast and fluid.  Streaming starts almost instantly.  What's not to love?", "verified": true, "helpfulness": "0/0", "author": "Cix"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "Adam Myers"}, {"rating": 4.0, "review": "For under $20 I gave it a shot.  Out of the box it wouldn't connect to my router despite an almost full signal.  Moved it to the living room and it connected, relocated back to original spot and still working.Navigation and playback along with Android app work pretty well.  I wish they would have included anytime of volume control as it requires fumbling with other remotes to just mute, but not a deal breaker.I've had Amazon Prime for years and rarely touched the video/music of Prime because they made it such a pain to use, this changes all that, selection of movies and TV was a nice surprise.Haven't tried the miracast yet, but if it works, this was a great deal.", "verified": true, "helpfulness": "0/0", "author": "Aj"}, {"rating": 4.0, "review": "Very pleased with my Fire TV stick.  It was very easy to setup , I had it working in about 10 minutes, however right after I got it installed it downloaded an update that took about 15 minutes.  Every time we wish to watch a movie the time between we order and it comes down to the TV in almost un-noticeable.", "verified": true, "helpfulness": "0/0", "author": "Robert J."}, {"rating": 5.0, "review": "Buy it...you will love it", "verified": true, "helpfulness": "0/0", "author": "Todd Kerns"}, {"rating": 5.0, "review": "Prime TV, Netfilx, Pandora, Hulu, Prime Music and so much more in one little, easy to install device. What more could you ask for?", "verified": true, "helpfulness": "0/0", "author": "Lee H."}, {"rating": 5.0, "review": "Several weeks ago I received a pre-release offer of the Amazon Fire Stick for $19.95 instead of the norm $39.95. I wasn't really looking into adding a digital Wi-Fi dimension to my TV viewing but at <$20 instead of the usual $50 to $100 it seemed just the thing. So I ordered one. It arrived on Dec 3rd, one day earlier than promised. The package included everything I needed to install it on my HD tv. In fact it took longer to open the package than to install. In a few minute I was able to watch all the videos I used to watch on my Kindle Fire. I must say I was impressed with the quality of the product, ease of installation and use. The download of videos is as quick or quicker than Xfinity \"On Demand\" and I have access to all Amazon Prime content. I am very pleased. I viewed one movie and now am re-viewing an old, British comedy favorite of mine, \"Red Dwarf\". Bravo Amazon an excellent buy @ even $39.95.", "verified": true, "helpfulness": "1/1", "author": "William A McLaughlin"}, {"rating": 5.0, "review": "Thank You Amazon, I tried the Roku  and it is not as good as the Fire stick TV , and I will let other know that the fire TV is much better . I like it so much that I bought another one. Thank You Amazon", "verified": true, "helpfulness": "0/0", "author": "Snickers"}, {"rating": 4.0, "review": "Better than Chromecast (more selections and remote control); however; either is enough", "verified": true, "helpfulness": "0/0", "author": "JET"}, {"rating": 5.0, "review": "Exceeded expectations, faster and easier to use than Chrome cast.  It learns preferences such as were to start on Netflix even!  Remote is a very nice touch.", "verified": true, "helpfulness": "0/0", "author": "J. Fegan"}]