[{"rating": 5.0, "review": "Best tv stick there is.", "verified": true, "helpfulness": "0/0", "author": "James&Heidi"}, {"rating": 1.0, "review": "Too difficult to operate! I seem to constantly press the \"enter\" button at the wrong time. Very difficult to use the \"alphabet\" for typing searches. The screens are a jumble and it is hard to find what you want. I do not recommend, Roku is much easier to use!", "verified": true, "helpfulness": "0/0", "author": "Rexford M. Ennis"}, {"rating": 5.0, "review": "Awesome I previously was using my laptops hdmi connection to view Netflix on my tv and now I can give my laptop a rest and view other programs also. I love it", "verified": true, "helpfulness": "0/0", "author": "Paula Culton"}, {"rating": 1.0, "review": "the unit show a strong signal but could not download anything in addition the unit got very hot soon after it was plug in.", "verified": true, "helpfulness": "0/0", "author": "J. West"}, {"rating": 5.0, "review": "Easy install and great features.", "verified": true, "helpfulness": "0/0", "author": "Dawn Meehan"}, {"rating": 5.0, "review": "LOVE IT! Easy to set up and use. Always something to watch now on TV. So glad I finally ordered it!!!", "verified": true, "helpfulness": "0/0", "author": "nolegirl"}, {"rating": 5.0, "review": "The Fire Tv stick worked great. I am not too impressed with movie and Tv options offered. To be perfectly honest I was planning on giving up Netflix in favor of Prime but not sure that will happen. We started watching the Downton Abbey series and got to series five and found out we had to pay for it, even thou we had prime, but were able to get it thruour NetFlix ???", "verified": true, "helpfulness": "0/0", "author": "Paul A., Curnalia \"Paul Curnalia\""}, {"rating": 5.0, "review": "Love it!  Really easy to use!", "verified": true, "helpfulness": "0/0", "author": "Lisa Ayala-Davis \"Lisa\""}, {"rating": 4.0, "review": "The stick is great, highly recommend this product.  Easy to use, and lots of movies and shows at your finger tips.  Only complaint is, Amazon Prime does not have over 1000 free movies, you have to pay for most of them.  The list of free movies it small.", "verified": true, "helpfulness": "0/0", "author": "Anastasia Coffin"}, {"rating": 5.0, "review": "I love it. I can use it to mirror my phone now. Watch YouTube again n Netflix all in one location. It's portable and convenient. Great!", "verified": true, "helpfulness": "0/0", "author": "W. Harris"}]