[{"rating": 3.0, "review": "The Amazon Fire TV Stick is really nice, and it will probably work well for most people. I currently have 5 Google Chromecasts in my home and I wanted to get the Fire TV Stick to test out and compare. I use the Chromecast and this device almost solely for Plex, and for some reason the Plex performance with the Amazon Fire TV Stick is very poor. Video will freeze and buffer constantly, the Chromecast (also connected wireless) works without issue, Roku works great, smartphones are great, web browser use with Plex is excellent, but the Fire TV Stick is unusable. This could be the fault of Plex (although the app seems well polished, compared to the Roku app which is terrible)Anyway, if you want this for Amazon Prime Video, Netflix or Hulu it's a great choice.", "verified": true, "helpfulness": "0/0", "author": "MarkoDaGeek"}, {"rating": 5.0, "review": "Awsome! So easy to use!", "verified": true, "helpfulness": "0/1", "author": "Lee Harward"}, {"rating": 5.0, "review": "Nice gadget", "verified": true, "helpfulness": "0/0", "author": "Allison"}, {"rating": 5.0, "review": "Works awesome. Much faster than the Roku box that is now in our bedroom and hasn't been used since the fire stick arrived", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 4.0, "review": "It was very easy to install. Once install it perfrmed effortless.  Aanyone can put it together and work it. It does all as promsed.", "verified": true, "helpfulness": "0/0", "author": "Don F. Forbes \"bossofnova\""}, {"rating": 5.0, "review": "For the $20 that was paid for this item, it is awesome. I like it over the Google Chromecast because it has a remote and a user interface instead of relying on using only your phone. Dolby Digital works with Netflix AND Amazon streaming.", "verified": true, "helpfulness": "0/0", "author": "Brad Nelson"}, {"rating": 5.0, "review": "awesome!  quick/easy set up and more content than i'll ever watch.", "verified": true, "helpfulness": "0/0", "author": "BARRY LANCASTER"}, {"rating": 5.0, "review": "Easy to install and works well.", "verified": true, "helpfulness": "0/0", "author": "Music Lover"}, {"rating": 4.0, "review": "Super cool & easy to use. Glad I bought!", "verified": true, "helpfulness": "0/0", "author": "Kiks"}, {"rating": 5.0, "review": "Easy to use and provides great access to shows and movies either free or at a very reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Cindy Douglas"}]