[{"rating": 3.0, "review": "its not that great", "verified": true, "helpfulness": "0/0", "author": "alexis"}, {"rating": 5.0, "review": "I love this tv console.", "verified": true, "helpfulness": "0/0", "author": "Patrick Duncan"}, {"rating": 5.0, "review": "we use this primarily for prime instant video and Netflix.", "verified": true, "helpfulness": "0/0", "author": "John S."}, {"rating": 3.0, "review": "I purchased this because the user interface on my Sony Smart TV leaves a lot to be desired.  I thought this would be better.  It's not.  I thought it would be similar to Roku.  It's not.  I use a Roku on another TV and when I travel.  The Amazon Fire TV stick interface wasn't very intuitive, and it was difficult to find \"channels\" that I wanted to reference often.  Maybe I'm spoiled by my Roku 3.  If you are looking for a streaming device, I recommend that you pay a little more and get a Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Beach Boomer"}, {"rating": 1.0, "review": "Run!  This is a poor product to say the least.  I'm now on my third stick.  Amazon just keeps replacing the defective sticks which will not maintain network connection.", "verified": true, "helpfulness": "0/0", "author": "Greg Jolly"}, {"rating": 4.0, "review": "If you are a Prime member of Amazon it is worth it, you get access to so many free shows that comes with your subscription to Amazon including a lot music, also this device is very portable so you can bring it with you anywhere, just be carful when you look at some shows as they mix the pay ones with free ones and one click and you did buy something you were just checking out, they should warned you like apple TV before you are going to buy something, but they don't. This is why I just give it four stars out of five.", "verified": true, "helpfulness": "0/0", "author": "N. Roman"}, {"rating": 5.0, "review": "I initially got it because I just needed something new to play Netflix on. I didn't even think of using it for games or other applications. Needless to say this has more than exceeded my expectations. My kids love the games and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Juan Hernandez"}, {"rating": 5.0, "review": "Easy, easy.  Plugged it in, registered on screen, went to the appropriate source on my TV and voila!!  Much more to see and watch than I imagined!!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "GramB3 \"GramB\""}, {"rating": 5.0, "review": "Simply, Amazing, I getting a second one for my daughter.  I own a Roku 1 and I prefer the fire Stick 100 times better", "verified": true, "helpfulness": "0/0", "author": "J. Zahra"}]