[{"rating": 5.0, "review": "Exactly as advertised. A \"no-brainer\" if you are an Amazon Prime member. Easy to setup and use. I am not a gamer, but for watching Amazon movies/TV and Netflix it works great.", "verified": true, "helpfulness": "0/0", "author": "Michael B. Menaker"}, {"rating": 5.0, "review": "Works great just as I expected it to.  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth VanValkenburg"}, {"rating": 5.0, "review": "As a Prime member, it was a no-brainer to order it when it was $19. I really don't need it as I have several Rokus and smart DVD players plugged into my TVs but I thought for the price, I would try it out. It is a great device, very easy to connect to your TV and get watching some content. I like the looks of it; it's small and sleek. The only gripe I have is that I had a difficult time opening the remote to put the batteries in. Overall, I would recommend it if you don't already have internet access with an existing device.", "verified": true, "helpfulness": "0/0", "author": "Boca Cat"}, {"rating": 5.0, "review": "Very easy to install and use", "verified": true, "helpfulness": "0/0", "author": "drconehead2000"}, {"rating": 5.0, "review": "Love it. It's so much faster than the previous streaming device I used and I love being able to watch Amazon Prime content.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Bird Lady"}, {"rating": 4.0, "review": "Pros:super easy set up.Fast streaming. ..very fast!Super clean picture quality.Cheap...err. inexpensive.Integration with prime us awesome.Easy setup for netflix.Cons.No separate digital audio out.Comcast wifi doesn't like it. I fault comcast.Free Prime movies seem very limited. The good stuff still costs you a few bucks. Prime issue but something to consider.", "verified": true, "helpfulness": "0/0", "author": "HMS"}, {"rating": 5.0, "review": "LOVE  IT !!  I no longer have cable or a dish and I don't miss it one bit and save so much money by having this device plus a prime membership !", "verified": true, "helpfulness": "0/0", "author": "sldak"}, {"rating": 4.0, "review": "The Amazon fire tv stick offers the menu on the left (search,home, prime video, movies, etc) in a list . On the right side, there are horizontal bar. Contained in home section, on top your recent activity use of the apps, followed by featured app and games, prime originals and exclusives.it is a well designed stick that gives you tons of options and lots of app. Including twitch netflix and more. One thing I noticed they didn't have crunchyroll app. Unless I missed. Other than that its worth the buy", "verified": true, "helpfulness": "0/0", "author": "Manjeet Singh"}, {"rating": 1.0, "review": "Showtime doesn't support xfinity!", "verified": true, "helpfulness": "1/1", "author": "Anju Vij"}, {"rating": 4.0, "review": "Works great. My chromecast didn't work well in the bedroom upstairs but the fire TV stick works great. The remote is a great convenience over chromecast. Amazon prime video selection isnt that great right now, however having netflix on it makes up for that. The only thing I really miss from chromecast is the ability to chromecast from my PC to the TV. With fire TV stick I am limited to the apps on the stick.", "verified": true, "helpfulness": "0/0", "author": "P. Jaaj \"Raptor Claw\""}]