[{"rating": 5.0, "review": "The Fire TV Stick - works.  Period.  We don't do any gaming so we wanted an inexpensive, simple solution for streaming Amazon Prime and Netflicks media - the Fire TV Stickes works well for less money than many other \"sticks\".", "verified": true, "helpfulness": "0/0", "author": "Rosie \"Rosie\""}, {"rating": 5.0, "review": "Works great. Very pleased. Will be great for traveling.", "verified": true, "helpfulness": "0/0", "author": "K. Winslow"}, {"rating": 5.0, "review": "Excellent reception. Quick and easy setup.", "verified": true, "helpfulness": "0/0", "author": "S. Jackson \"VO Artist\""}, {"rating": 5.0, "review": "excellent product that is easy to use.", "verified": true, "helpfulness": "0/0", "author": "James Knaus"}, {"rating": 5.0, "review": "awesome", "verified": false, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "I love it. Its the best", "verified": true, "helpfulness": "0/0", "author": "Suarez"}, {"rating": 5.0, "review": "I love it, easy to install, easy to use, but you won't get the full use out of it if you don't have an Amazon Prime membership. But if you do it's great. And very mobile. *****", "verified": true, "helpfulness": "0/0", "author": "Mary L Dunne"}, {"rating": 4.0, "review": "Just gave up satellite tv and opted to start with the fire stick since I'm already a prime member. Streaming is so easy and there is a good selection of shows. Could use more movies but I would imagine it will come with time. The Netflix and Pandora downloads made this even better! Love it so far.", "verified": true, "helpfulness": "0/0", "author": "Peck"}, {"rating": 5.0, "review": "Every bit of what was advertised and more!", "verified": true, "helpfulness": "0/0", "author": "DID IT!!! \"DID IT!\""}, {"rating": 5.0, "review": "The only thing that can make this install hard is if you don't have your router password.  If you have that, it takes just a few minutes to get working. One other thing, the remote works great! Better than my TV or DVD remotes. The Fire TV works better than the Fire Stick. The Fire TV has voice command to search for shows, the Stick needs you to manually enter your search with awkward keyboard on TV screen.  It works, just slower.I like this product, and have recommended it to friends and relatives. Amazon, this is a winner. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Reamo \"getalonglittledoggie\""}]