[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Was easy to install and is working great.", "verified": true, "helpfulness": "0/0", "author": "nutwic"}, {"rating": 5.0, "review": "Works great easy to install", "verified": true, "helpfulness": "0/0", "author": "Oscar W. Fender"}, {"rating": 4.0, "review": "The Fire Stick is easy to install, and simple to use. The hardest part is trying to decide what to watch with so many choices. I am very satisfied with this product!", "verified": true, "helpfulness": "0/0", "author": "Donna in Virginia"}, {"rating": 5.0, "review": "Unbelievably simple to setup and use, the first step in any review of a device.  Unbelievable, too, is the product it delivers.  My expectations were as low as its price, but it makes any TV with a HDMI slot a mini smart TV.  I use 'mini' with reservation because I can't see much difference between the two.  If your modem's strength reaches your TV, buy this.  You will be amazed.  You must also have Prime and a service agreement with an app, i.e., Netflix.  Amazon continues to expand the Internet's usefulness..thanks.", "verified": true, "helpfulness": "0/0", "author": "Jetjotjab"}, {"rating": 1.0, "review": "This product is totally unacceptable from a stellar seller like Amazon. Apple TV leaves it in the dust and so does Google's Chromecast. Amazon should redesign the interface from the bottom up to make it user \"useable!\" All I could easily find were Amazon Prime movies or pay per view. Just about everything else was not there. Perhaps if they included a usable manual one could discover the functions they tout?", "verified": true, "helpfulness": "0/0", "author": "Panmar"}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick. It is everything and more that was advertised. I am so glad we bought it. The ease of use is spectacular and the set up was a breeze.", "verified": true, "helpfulness": "0/0", "author": "MeMe \"MeMe\""}, {"rating": 5.0, "review": "So far so good it's awesome", "verified": true, "helpfulness": "0/0", "author": "Tanner Wyatt"}, {"rating": 2.0, "review": "I thought it would be more apps such as hulu and apps to watch more cable channels like the Roku stick", "verified": true, "helpfulness": "0/0", "author": "marquisha fleming"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Navarra Harris"}]