[{"rating": 4.0, "review": "Works great for streaming prime movies. Great picture. Also has all my phone and Tablet pictures on it that I can stream on all devices with HDMI INPUT ON THEM.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "no it hasnt. I bought it two weeks ago and have called amazon 5 times regarding the fire stick.  It wont connect to wireless.  Occasionally it will work if you do a hard rebot but then if you switch to TV and back to watching a movie you have to do a hard rebot everytime. Very frustrating.", "verified": true, "helpfulness": "1/3", "author": "Cathy Ames"}, {"rating": 5.0, "review": "good buy ruko!! solid design nice interface and very sexy remote. love at first sight :) considering the remote it is much better than the chrome cast. though i think i will still hold on to my chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Nitric"}, {"rating": 3.0, "review": "USER TIP - use the HDMI Extender------------------ORIGINAL REVIEW---------------------So far, this has been a piece of junk, but the repetitious nature makes me think that I have a lemon.First of all, it wouldn't connect to the remote.  Now you have to know, you have NO WAY of knowing if the remote is working or not.  You put in the batteries and press buttons.  If the stick responds, then you have a connection.  For us, it took 4 sets of batteries and multiple \"reboots\" before we got the connection.  Woo Hoo!  Note that set #1 was included with the Fire stick.  Sets 2 and 3 were found around the house, and set 4 is brand new from the store.So I get connection and find that the remote is a piece of work to negotiate the numbers for my net key.  Oh my goodness, it is horrible.  Click it once and it toggles over anywhere from none to 8+ numbers.  And with the 3 second delay, one never knows if it took or not... oops, it did!  Passed the number!Lastly, it won't connect to my internet.  Several minutes to negotiate the entrance of 10 numbers each time, and it fails to connect!  I have signal, don't know what is the issue.  After several tries, I'm done.And lastly, where's the customer support?  I will gladly update this review once I can get it working, but at this point, I'm an unhappy customer with a piece of junk electronic gadget.----------------------UPDATE---12/17/2014-----------------------So we got an email from ACS, and after those tips didn't work, I spoke with service rep, who after working through his tricks, agreed to expedite a replacement unit.  In the meantime, I noted a comment elsewhere that a trick or two worked for some folks - use the short HDMI extender / try a different HDMI port.  When the replacement wasn't connecting, I tried using the extender.  Oh goodness!  The Stick worked and recognized the remote.  The remote worked and only moved one number for each click (Hallelujah!!)  The unit connected to my WiFi.  And I was able to stream a movie on Prime without any issue!I'm going to give it a couple of weeks and then update the review and rating.  For now, today, it's a 5, which averages to a 3 with my original 1 rating!", "verified": true, "helpfulness": "1/1", "author": "D. Waterman"}, {"rating": 1.0, "review": "😡", "verified": true, "helpfulness": "1/2", "author": "Jennifer Lovelace"}, {"rating": 5.0, "review": "The Fire TV Stick is sweet.  It has turned my tv experience into a theater style screen.  Love it", "verified": true, "helpfulness": "0/0", "author": "Ruth Lucero"}, {"rating": 5.0, "review": "Perfect for my use.  I had been using my PS3 to watch Amazon Prime and this is a perfect alternative.  Start up is quick and streaming has been perfect.  Didn't have to setup my account, since I purchased it with my prime membership account it was already setup.  Plugged it in, it automatically downloaded the latest update, had to watch the mandatory 'welcome' video and then it was ready to go.  I'm really happy with this unit, and for the price it is completely worth it.  Now just waiting for the IOS fire tv remote app to be made available!", "verified": true, "helpfulness": "0/0", "author": "C. Morales"}, {"rating": 5.0, "review": "Best  New thing in the world today ! LOVE IT !", "verified": true, "helpfulness": "0/0", "author": "Huey Rogers"}, {"rating": 4.0, "review": "I have no problems with the stick. It's the remote with terrible buttons. Big fingers and little remotes don't mix well. Easy setup without problems.", "verified": true, "helpfulness": "0/0", "author": "Carol Senary"}, {"rating": 5.0, "review": "Fell in love with. Easy to customize and sideload APK (android software). Excellent package for a very low price. Very stable!", "verified": true, "helpfulness": "0/0", "author": "i-ha"}]