[{"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "Trina"}, {"rating": 5.0, "review": "The Amazon Fire Stick is amazing!", "verified": true, "helpfulness": "0/0", "author": "Bertrand Gor"}, {"rating": 5.0, "review": "loved it and I like the fact it can be moved from TV to TV easily enough to stream where ever I want to watch..", "verified": true, "helpfulness": "0/0", "author": "Sheryll Mitchell"}, {"rating": 5.0, "review": "This product is fantastic!  It was easy to install and to get working quickly.  I love the remote, but also the linkage to the ipad/iphone app!  I only wish I could cast my screen like on Googlecast.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Pretty pleased with the device.  Does just about everything my Roku 3 does but at half the price.  My only wish is that it supported bluetooth headphones.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Black"}, {"rating": 5.0, "review": "It works just fine", "verified": true, "helpfulness": "0/0", "author": "STEVEN ROUNTREE"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Jasmine"}, {"rating": 2.0, "review": "We recently got our free Fire TV Stick in a promotion with Sling TV, as we wanted to watch the NBA playoffs on ESPN and TNT, and weren't happy with cable TV.  I'm not sure if it's the Fire TV Stick or Sling's app on the stick, but we get frequent stalls, swirly circles and \"buffering\" problems... and while watching the playoffs it naturally happens during something important.  It happens on other channels too, it's just that we're watching mostly NBA right now.  I wish I could say it's the internet connection, but streaming on our laptop from Youtube, Amazon and Netflix are perfect, with good resolution.  Right now I wouldn't recommend to a friend, but I feel some of these problems may be worked out when we all get past the \"beta\" stage.  As for now... not happy.", "verified": true, "helpfulness": "1/1", "author": "Carole"}, {"rating": 2.0, "review": "It sometimes freezes and you have to go all the way out to the main menu to get it to work.  This does not happen with the Apple TV device.", "verified": true, "helpfulness": "0/0", "author": "VMO"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Rachel"}]