[{"rating": 5.0, "review": "Will give a review at a later date.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "You'll get 5 stars, as long as you don't lockup sideloading.", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 1.0, "review": "I am very upset now. I received this product on Feb. 24, 2015. Today, on May 3, 2015, this product is not working even though I rarely used it. This Fire TV Stick is not durable.", "verified": true, "helpfulness": "0/0", "author": "Ran"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Susan Yacapraro"}, {"rating": 5.0, "review": "The Amazon Fire Stick is amazing...I would highly recommend this product", "verified": true, "helpfulness": "0/0", "author": "Tomcdman"}, {"rating": 5.0, "review": "After deciding to purchase this product due to an upcoming move in which we are hoping to cut cable, I could not be more happy with the Fire TV stick. It is super easy to set up, very user friendly and the remote is possibly the most functional and comfortable to use that I've ever owned. I love all of the streaming options that are available with this product. The only con I can think of is not having one for each TV, so if we want to continue to watch a show in another room, we have to move the stick and power supply. But, we plan on getting a second stick soon since this one has worked out so well! Love our new Fire TV Stick!", "verified": true, "helpfulness": "0/0", "author": "Katie  Zink"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "Zenobia H Collins"}, {"rating": 5.0, "review": "love this and so does my wife!  easy to set up and easy to use[which means it is perfect for me!]", "verified": true, "helpfulness": "0/0", "author": "J. D. FISHER \"FISHBAIT\""}, {"rating": 4.0, "review": "Easy to install, great Fire TV content but I find the remote a little unfriendly and hard to maneuver around the menu.", "verified": true, "helpfulness": "0/0", "author": "Barb"}, {"rating": 5.0, "review": "Incredibly simple to set up and use", "verified": true, "helpfulness": "0/0", "author": "Lauren"}]