[{"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Hannah E Kimbell"}, {"rating": 5.0, "review": "Easily set up and it has better picture quality than the Roku I was using. Well worth the price!", "verified": true, "helpfulness": "0/0", "author": "RNDiverBen"}, {"rating": 5.0, "review": "Super easy to install and set up. Was up and running in less than 5 minutes.  Very impressed with the selection of programs on Prime.", "verified": true, "helpfulness": "0/0", "author": "Jodi White"}, {"rating": 5.0, "review": "So happy to finally be able to catch up on so many TV shows and movies I have missed! And at my command!", "verified": true, "helpfulness": "0/0", "author": "Ms Vicki J Larson"}, {"rating": 5.0, "review": "The Fire TV Stick has become my everything! It is an amazing piece of technology that works wonders. I watch just about anything with it. I love it and would strongly recommend it.", "verified": true, "helpfulness": "0/0", "author": "lovy"}, {"rating": 5.0, "review": "It's great way beyond what I expected. I can honestly say my money was well spent Amazon", "verified": true, "helpfulness": "0/0", "author": "Rasheen Smalls"}, {"rating": 5.0, "review": "Love this. I watch TV in my room now easily", "verified": true, "helpfulness": "0/0", "author": "Fuzzduck2001"}, {"rating": 3.0, "review": "I like the stick but the scroll gets stuck often, not pleased with that. Also why doesn't the Bluetooth feature work? Fix those two things and it would be awesome", "verified": true, "helpfulness": "0/0", "author": "damon etherudge"}, {"rating": 4.0, "review": "We are getting used to not having regular cable. Fire TV offers a great variety of channels, prime movies and content. We're enjoying all the movie choices, Hulu plus, Sling TV and music.  My only complaint is the remote and the difficulty switching between TV, apps, and favorites. The remote is impossible for my daughter with special needs to navigate through. Hoping you come up with a better design.", "verified": true, "helpfulness": "0/0", "author": "F.A.S.D.  Fighter \"Kimberlie Morris\""}, {"rating": 3.0, "review": "Works ok with netflix. Prime does not work outside of the US", "verified": true, "helpfulness": "0/0", "author": "hector"}]