[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "arresu \"arresu\""}, {"rating": 5.0, "review": "I love this thing. We were using Vizio Smart TV and it crashed all the time and was so slow, especially with stuff like fast-forwarding through Netflix. We switched out the Smart TV for our Sony non-smart TV and use this and we have been extremely happy. It's easily paired to YouTube which has made it even easier to navigate on our phones. We've only experienced a glitch or two, which was easily corrected by unplugging it and plugging it back in. I would recommend this to everyone.", "verified": true, "helpfulness": "0/0", "author": "MaijaPapaya"}, {"rating": 3.0, "review": "old movies", "verified": true, "helpfulness": "0/0", "author": "virgil bishop"}, {"rating": 5.0, "review": "It's really very cool and offers several suppliers on one screen. Easier than ChromeCast", "verified": true, "helpfulness": "0/0", "author": "Peter Spence"}, {"rating": 5.0, "review": "Have really been enjoying streaming videos from Netflix, Amazon, and more with the Fire TV Stick.  Much simpler than firing up the computer and connecting it to the TV.  It works great", "verified": true, "helpfulness": "0/0", "author": "Legal reader"}, {"rating": 5.0, "review": "So easy to use even I could do it! And now watching Netflix is doable without using my Wii. We're talking about getting a Firestick for each of our TV's.", "verified": true, "helpfulness": "0/0", "author": "Virginia R."}, {"rating": 4.0, "review": "so far, so good", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 4.0, "review": "Works as expected. It can be a bit finicky at times. Content doesn't always show up. You may need to unplug it from the HDMI slot and re-plug.", "verified": true, "helpfulness": "0/0", "author": "Mike L"}, {"rating": 5.0, "review": "Excellent !!", "verified": true, "helpfulness": "0/0", "author": "yogesh patel"}, {"rating": 5.0, "review": "As long as you are a prime member it is great", "verified": true, "helpfulness": "0/0", "author": "Les Horowitz"}]