[{"rating": 5.0, "review": "I love my Fire TV Stick.  Works great with my HD TV.", "verified": true, "helpfulness": "0/0", "author": "John L. Gossett"}, {"rating": 5.0, "review": "A real value for quality entertainment.", "verified": true, "helpfulness": "0/1", "author": "Kimo Sabe \"Kimo Sabe\""}, {"rating": 5.0, "review": "We have two of these in my house and love them. Very convenient and the whole family loves it. It gets a lot of use.", "verified": true, "helpfulness": "0/0", "author": "Nicole Marie"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "NIESHA A WHITTED"}, {"rating": 5.0, "review": "Awesome little device. Met all my expectations and more. Set up was simple and within 5 minutes we were streaming.I highly recommend the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Joseph Lopez"}, {"rating": 5.0, "review": "Great stick has everything I need and want!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Read the Amazon support forums before buying this product! Right out of the box, our Fire TV Stick it wouldn't work. It couldn't maintain an internet connection with our wireless router - even though all our other devices in the house have no problems. It would just keep dropping connectivity every 15 seconds or so.I wish I would have read the help forums first - this is a known problem with this device and there are literally hundreds of posts complaining about it.  I tried all of the simple fixes described in the forums but none of them worked. I was certainly disappointed at the poor quality of this device - not what I have come to expect from Amazon, and even more surprising to me that they continue to sell it when there is obviously a consistent problem.Needless to say, we returned the Fire TV Stick for a refund and just keep using our \"inferior\" Chromecast, which doesn't have the cool interface or remote control, but at least it works.", "verified": true, "helpfulness": "0/1", "author": "289cobra"}, {"rating": 4.0, "review": "like it", "verified": true, "helpfulness": "0/1", "author": "akwebtrader"}, {"rating": 4.0, "review": "You can't stream amazon prime videos outside USA.", "verified": true, "helpfulness": "0/1", "author": "Pedro Mottin"}, {"rating": 5.0, "review": "Works great lots of movies for amazon prime users.", "verified": true, "helpfulness": "0/1", "author": "Patrick C."}]