[{"rating": 5.0, "review": "I HAVEN'T USED IT YET.", "verified": true, "helpfulness": "0/0", "author": "Ricky King"}, {"rating": 5.0, "review": "Everything  I expected!", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "easy set up for the kids TV.  lots of channels.  perfect to binge watch shows-better than cable", "verified": true, "helpfulness": "0/0", "author": "Dbeautyangel"}, {"rating": 5.0, "review": "Better than Roku...easy hookup...reasonably priced.", "verified": true, "helpfulness": "0/0", "author": "royce johnson"}, {"rating": 3.0, "review": "It's not all it's advertised it should be. Once I finally received my long-awaited purchase, I installed it right away (of course). Then the problems began... ***(If you intend to buy one, read all of this)***1) It appears that my T.V.'s HDMI port does not provide enough power for the device. That's okay, the device comes w/its own cord and brick (nice and pretty/shiny).2) Device does not work, at all, with the HDMI extension cord included with device. This a big problem as the ports are recessed. The device was a very snug fit in order to plug directly into the HDMI port.3) When the T.V.'s USB port did not provide enough power to the device, I, naturally, used the brick that was supplied with, and recommended for, the device. All should be well, right?4) Using the included micro-usb cable plugged into the included \"Amazon\" AC power adapter I get the following message (paraphrased) when the device finally boots up, \"You do not have enough power for your device. Please use the power supply provided by Amazon. Press \"Select\" button to continue without it.\" So, I pressed continue.5) I have a 30Mbps service, yet this device spends a great deal of time caching. Sometimes, it crashes the program I am viewing (mostly: Hulu Plus). There is not a time/day/service/show that does not hesitate/stutter/stall. The only thing that does not hesitate are, naturally, commercials (imagine that).", "verified": true, "helpfulness": "0/0", "author": "ColoRad0 \"Honorous Supremous Omne - Honor Above All Things, ColoRad0 (since 1987)\""}, {"rating": 5.0, "review": "better than chromcast", "verified": true, "helpfulness": "0/0", "author": "Travis Frayard"}, {"rating": 5.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 2.0, "review": "Always freezing and flipping back and forth to home screen and whatever is being watched. Pretty disappointed the only reason I'm giving two stars is the packaging and the overall appearance everything else sucks", "verified": true, "helpfulness": "0/0", "author": "Holly Dray"}, {"rating": 5.0, "review": "nice product easy to install", "verified": true, "helpfulness": "0/0", "author": "TRENTON N GARTMAN"}, {"rating": 5.0, "review": "I have been using the original Roku for a loooong time, since it first came out.  It sort of works OK, but I had to replace the original power supply.  I got the Fire Stick when it was first introduced but had not hooked it up until now several months later.  Setting up was really easy.  I had to look up online how to find the device MAC address, but its right there, just not showing since its the last option at the right -- a suggestion to Amazon: move that option all the way to the left so that it appears when you need to connect wirelessly.  There is no ethernet hookup, but wifi seems to work very well.  It loads movies fast at our house just a few seconds, especially compared to the old first-gen Roku.  Its as easy to navigate the menus once you understand the basic scheme.  I use it for Prime movies and TV as well as Netflix movies.  If I had one complaint, its the alphanumeric text entry.  Its similar to the Roku in that you navigate letter by letter, but the layout seems less efficient.  I guess noone has solved this yet.  I plan to set up my watchlist on a computer.  Or get the fire tv voice input which should have been built-in.  For the price it does what it does (deliver movies and TV) very well.  I have not tried any games.", "verified": true, "helpfulness": "0/0", "author": "R. R. Ando \"compscinerd\""}]