[{"rating": 5.0, "review": "This item really was easy to setup and turn your TV Into a \"smart tv\".  Now access to amazon prime movies right from my chair or while in bed. The remote setup using my tablet or phone give me more options from just using the remote that came with.", "verified": true, "helpfulness": "0/0", "author": "diannmc"}, {"rating": 5.0, "review": "Nice addition for our television viewing!", "verified": true, "helpfulness": "0/0", "author": "Toni"}, {"rating": 5.0, "review": "i love it!", "verified": true, "helpfulness": "0/0", "author": "brian r."}, {"rating": 1.0, "review": "This Barely works and it is generations behind Apple TV.  But the people at Amazon customer service were understanding and I got my money back.  So I'm happy.", "verified": true, "helpfulness": "0/0", "author": "Pastor Eric"}, {"rating": 1.0, "review": "Bought the Firestick TV 5 days ago. Great on the install. But has Been FIVE days now on the hookup and STILL TRYING TO GET IT TO WORK RIGHT! Finally had a Wave Broadband Tech come out and he did things the average joe is not going to know.....for example, the Firestick kept trying to tell me I had a password on my home wifi....which I didn't ( I didn't have one when the first Wave Tech came out and installed broadband) so I kept trying a password because hey, maybe I did have one. I was locked out of using it til we reset my wifi with a password and Firestick STILL didn't get the message until he tweeked it again by changing the Wireless Network Name ever so slightly .  So, for all you who read the install and hook up are a piece of cake, beware.  It may not work out that way for you and you best have somebody with real knowledge on these things. Day six, Firestick has stopped working again.  I have to spend at least 30 minutes on hold for every call to Wave and emails take 24 hours for a response.....its not all its cracked up to be.  Install was easy.  \"THE HOOKUP IS WAY TOO INTENSIVE AND FRUSTRATING\" has been my experience.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Melius"}, {"rating": 5.0, "review": "Works well with the older non-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Bailey Partridge"}, {"rating": 3.0, "review": "Switched to the bigger one.  You need really good wifi for this to work well.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Works as advertised only better. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Jack H."}, {"rating": 5.0, "review": "Better than I anticipated. I bought mine for sling TV and found that I use lots of apps within the stick itself", "verified": true, "helpfulness": "0/0", "author": "Bradley Bowman"}, {"rating": 5.0, "review": "Love the fire stick.  Easy to set up and for the price, it's an awesome device.", "verified": true, "helpfulness": "0/0", "author": "P. Stevens \"Books = Knowledge and Power\""}]