[{"rating": 4.0, "review": "Freezes more than other's I have owned. But it serves it's purpose.", "verified": true, "helpfulness": "0/0", "author": "Nakia"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Patricia  Kelly"}, {"rating": 5.0, "review": "Very good Item", "verified": true, "helpfulness": "0/0", "author": "JV"}, {"rating": 5.0, "review": "Very happy with the Fire TV Stick!!  Set up was easy.  Everything works very well, no problems.", "verified": true, "helpfulness": "0/0", "author": "B. T. Painter \"Love my Kindle 2\""}, {"rating": 4.0, "review": "It works pretty well and for the price of $20, I'll take it! I am a cord cutter, so adding this to may arsenal of media streamers was a win. I needed something to add in a guest room. I have two Rokus, a couple of android boxes and a Sony media streamer. I like this because, the Netflicks app is current and shows all the individual profiles. My other streamers don't do that!", "verified": true, "helpfulness": "0/0", "author": "KS"}, {"rating": 3.0, "review": "I am very excited about the product and I think it will replace TV as we know it. However, I was very disappointed with the content not working with my HDCP challenged LNS4041S Samsung HDTV TV set. There has got to be a better way to secure content.", "verified": true, "helpfulness": "0/0", "author": "Sigurdur Petursson \"Sig\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Bill Pontrello \"vtywgp\""}, {"rating": 5.0, "review": "FANTASTIC!!!!!  Gives you more of your money's worth for PRIME.  Works well,  but the best to be said about it is the CONTENT it allows you to access.  Watching this more and more for free movies and programs on prime and less ordering from directv ant $3-5 a shot.  Even if you don't have prime,  there is some free content for you and you can purchase movies at a reasonable price.  Instalation is just about plug and play and easy to operate with remote", "verified": true, "helpfulness": "0/0", "author": "Mark Bretschneider"}, {"rating": 5.0, "review": "I used to stick in my HDMI slot.", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "The Fire TV Stick is great! I am technically challenged but was actually able to install all by myself, sign on and in, have been enjoying it more than I could have imagined. Still exploring all options with other subscriptions but use it for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Emily Lee"}]