[{"rating": 4.0, "review": "Quick and snappy controls, smooth playback, and no issues so far.  Beware of the unnecessarily long intro video to teach you all about the `new fangled' device, which you cannot skip or pause- I will be honest, the video detracted from the experience, and is the only fault that I have found, so far...", "verified": true, "helpfulness": "0/0", "author": "Sean Gokey"}, {"rating": 5.0, "review": "Quick easy set up. Easy to use. Got it when it was discounted to $19 and it arrived way sooner than expected. Would definitely recommend to others", "verified": true, "helpfulness": "0/0", "author": "Gwendolyn Garner"}, {"rating": 1.0, "review": "has Showtime Anytime app, need to activate the Fire TV Stick to use it, problem is Showtimeanytime.com/activate only lists apple tv, roku, and xbox 360 as options - there is no option to activate the Amazon Fire Stick.  And there isn't anyway to contact Amazon about this issue.  so, leaving negative feedback in hopes someone will figure this out and fix it so i can access full functionality on the device", "verified": true, "helpfulness": "3/4", "author": "Richard MacMillan"}, {"rating": 5.0, "review": "Roku has nothing on this little amazing entertainment controller. The user interface is rich vibrant and easy to navigate. If you have ever used a Roku you'll love this product. It improved on everything that was wrong with the Roku. The content menu is easy to navigate and understand. The Netflix app on it is awesome and resembles the game counsels Netflix apps. If your looking for a streaming network entertainment hardware look no further than this awesome little piece of hardware.", "verified": true, "helpfulness": "2/2", "author": "Michael Williams"}, {"rating": 4.0, "review": "I have a google chromecast and really like it, so I was excited to get to try this baby out to see how it compares. Let me start with what I didn't like. This took FOREVER to set up. I'm not sure why, but at first, my tv wouldn't recognize it, then once it would, it would not download the necessary updates for it to work. I was also super concerned because when I plugged it in and my tv would read it, there were these green lines across the screen.Finally after about an hour and a half of fiddling with it, it finally downloaded the update and started working. Overall I love the layout of all the apps and services available. Right now I don't have prime video, so I can't take full advantage of the video streaming from Amazon, but I love how easy it is for me to get to my Netflix and Hulu accounts.The remote is also another great addition that the chromecast doesn't have. I love that this is the only thing I need for all my streaming purposes.", "verified": true, "helpfulness": "1/1", "author": "Shannon Paul"}, {"rating": 1.0, "review": "It is not working, when I play a video from amazon prime or netflix the sceen turns blue and shows a screen message\"HDCP UNAUTHORIZED, CONTENTDISABLED\" , and what is more important to me the amazon stick installation caused trouble with other devices that are connected to the TV and not working anymore. The only port still workingis the dishnetwork receveir and even some channels not working and gives worning about the HDCP?I reported the problem to amazon customer service and I hope they will take care with both problem, the stick and the damage itcaused to the TV.The fire TV stick is an amazon production and I am sure they will take over the responsibilityJust now I discovered that with the only working HDMI port connected to the dish network receiver, that some channels is not working giving a message that this channel needs HDCP and your TV or a device connected to the TV  is not supporting this. The system information indicates that the TV support  the HDCP. I disconnected all the devices including the fire stick and I am still receving the same message. This never happened before installation of the fire stick.My impression that the installation of the amazon stick damaged this HDCP or somthing else?I am still waiting for the reply from the amazon technical support. They promised me to reply within 12 hours and  they did not since 5 days.Thanks God, I was able to know hardly the problem and solved.If you have a similar problem which is related go the HDCP error I can help. I did not write how to fix it because I do not want to help the amazon technical support because they were not helpful and till now they did not respond to my quiry.", "verified": true, "helpfulness": "1/4", "author": "Wagdi Dessoukey"}, {"rating": 3.0, "review": "The unit arrived today; so far I am not very happy with it.  First, I hate being required to watch a video to use something.  Next, the time it takes to switch between apps is incredibly slow for a dedicated streaming device.  Third, and I may chalk this up to being a new item and the network being bogged down, but app downloading is painfully slow compared to all of the other devices in my house.On the plus side, having Hulu in another room without having to by a $60 box or use a phone or PC with a chromecast is a big plus.I may update this review if the performance of the unit improves.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "What a disappointment!Had Chromecast for months now before getting this 'fire stick' and cannot even begin to compare how superior and better experience the chromecast offers....!!First.. nit-picking... The ac adapter looks nice but the way it is built - you loose at least two other, adjacent, outlet holes on a power strip when you plug it in. No fun. Then the remote is not clear on how to open... which side to slide it toward to open it. I was afraid to break it. Again... nit-picking.Another issue I had was logging into Netflix. Amazon fantastic support chat (didn't even wait for one second) - helped me restart, clear data, restart again, to get it to work... So nice support but why this issue?Second... The more important things:The remote is super slow. searching for something on netflix or youtube is significantly, and painfully, slower when compared to chromecast where you, and even your loved one, can scroll - each on his/her phone, at blazing speed to find something and then boom - play it on the tv.On the fire stick you feel like a grampa... h....o...u...s...e...o... f...c...a...r...d...s... takes eons!I then realized there is an app for the fire stick.. hooray, a savior!The app is useless. Literally. It basically lets you \"touch\" the screen using your phone. Good luck hitting where you want to.All in all - chromecast only downside is the lack of support for amazon stream. If it had that - then I would have given one star and would say - forget this fire stick. So until then... Fire stick you get two stars. \"Good job\"", "verified": true, "helpfulness": "1/1", "author": "uri"}, {"rating": 3.0, "review": "Pros:This device is good and powerful.Lot of movies and TV showsPrime members have lot of advantagesConsit is missing some very important featuresYou can't stream your laptop/pc web browser onto TV (where chromecast can stream entire browse tab using its chromecast extension of chrome browser). This is a big disadvantage with Fire StickAmazon has no official Youtube app. This is also a big disadvantage.Contacted Amazon and informed about its missing features.", "verified": false, "helpfulness": "0/0", "author": "Krishna Jaligama"}, {"rating": 1.0, "review": "I never got it to work.  It kept asking for Amazon account info and password, even thought it is supposed to be pre-registered when you buy it as a Prime member.  The help desk guy was helpful, but when I learned for him that you need to re-enter the WiFi Password whenever you turn it off, I decided to send it back.", "verified": true, "helpfulness": "2/4", "author": "studhilo"}]