[{"rating": 5.0, "review": "We absolutely love being able to stream prime movies as well as Netflix through this small device.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "These things are amazing I have one on every tv in my house good bye cable bill", "verified": false, "helpfulness": "0/0", "author": "Danny l York"}, {"rating": 5.0, "review": "Awesome!  It has Chromecast beat in ALMOST every aspect.  You gotta love the remote; it works great Eben with the Fire Stick plugged in behind the television.", "verified": true, "helpfulness": "0/1", "author": "mxwx"}, {"rating": 4.0, "review": "I love my new fire stick! I wanted it for an upstairs bedroom for when I wanted to watch netflix or prime upstairs. I like the trivia comes, like you don't know jack. The remote is sensitive and occasionally lags. Startup is fast and simple. I love that I have spotify but I think it's stupid that I still have to play it on my phone instead of logging into my account and syncing my account to the stick. But since I don't have a speaker doc for my phone, it works. For the price this works great for what I want. I can't say that it's probably much better than a roku 3 stick or anything, so it falls in line with all of those others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I liked Google cromecast better then this..., I like casting to my tv. Google has that ability to do from any kind of device like iPhone and Google. Where as, this fire is restricted.", "verified": true, "helpfulness": "1/4", "author": "Lalith Kumar Podduturi"}, {"rating": 5.0, "review": "My family and I are enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "Edna Dejesus \"ednas kindle\""}, {"rating": 3.0, "review": "The fire tv stick has Bluetooth for game controllers and other input peripherals but not for Bluetooth headphones. That was a disappointment because I want to listen with Bluetooth headphones at night. Other than that it is great.", "verified": false, "helpfulness": "2/2", "author": "Lynn Michael Wilde"}, {"rating": 4.0, "review": "It is all it should be. Love it. Easy to use", "verified": true, "helpfulness": "0/0", "author": "Patricia Faria"}, {"rating": 4.0, "review": "Had a hard time getting the remote open to put the batteries installed like the cost 😎", "verified": true, "helpfulness": "0/0", "author": "Dmdov"}, {"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Jose Antonio Prado"}]