[{"rating": 4.0, "review": "The stick seems to be working fine, but the instructions included to getting it to work were terribly lacking.  After fiddling with it for a long time, I finally got it to work.", "verified": true, "helpfulness": "0/0", "author": "jenene"}, {"rating": 4.0, "review": "Fire stick is fabulous. Opens an interface you've been waiting for. Only bad side is the remote. You practically have to smash it to get it open to insert batteries. In addition, no information tells you if you need to switch the usb back and forth with your cable or satellite.... You do!!!!", "verified": true, "helpfulness": "0/0", "author": "by Valerie Nixon"}, {"rating": 1.0, "review": "Doesnt let you connect to wifi that need a password at a hotel, the whole reason whyi bought this thing is so i can travel and watch movies. So no browser = no connection what the hell good is this thing.. I can connect to movies in my house with my dvd players", "verified": true, "helpfulness": "0/2", "author": "Catherine Tusa"}, {"rating": 5.0, "review": "This fire 🔥 stick TV 📺 is awesome everyone who is anyone should get this device, kudos to Amazon 🎆😊!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kenneth Yates"}, {"rating": 5.0, "review": "This little stick is awesome. I have been able to cut my Satellite bill by 70% by dropping all but local channels, and maintaining my \"International\" package. That is including the few subscriptions that I need to match what I was getting previously. So I might be a week behind on some shows, it really doesn't matter to me as I always DVR'd most of them anyway and would watch when I had a chance. Lots of Apps to choose from, unlike with \"Cable or Satellite forcing their choices on you. So many networks now have their own free apps it makes it even a better buy. No glitches with it after a few months, bottom line...I am one happy camper with this purchase.Only con I have found so far is the remote's awkward way to search on some apps. But that is of little importance compared to the money being saved!", "verified": true, "helpfulness": "0/0", "author": "Kevin \"kthinsa\""}, {"rating": 4.0, "review": "Nice Stick Not Enough App Support Though", "verified": true, "helpfulness": "0/0", "author": "Dan Hanson"}, {"rating": 1.0, "review": "What's the point????? It's small. Big Deal. You still have to plug it into an outlet via a USB cable. It's not like you  just plug in the stick into your tv and you're set like most people think. No way. YOU STILL NEED TO PLUG IT INTO AN OUTLET. So basically all you have is a small box with no option to plug in an ethernet cable when wi-fi signal is bad.", "verified": true, "helpfulness": "0/0", "author": "Achille Iolascon"}, {"rating": 5.0, "review": "Must have", "verified": true, "helpfulness": "0/0", "author": "jeff tucker"}, {"rating": 4.0, "review": "still working  with  it", "verified": true, "helpfulness": "0/0", "author": "rod"}, {"rating": 2.0, "review": "Totally interferes with HDTV Indoor antenna.  And it was buffering a lot on our network.  Returning for the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Sarah B"}]