[{"rating": 5.0, "review": "Why we waited so long to get this is a mystery to us. The remote is simple to control and the fact that we can sign into Netflix and Hulu with it as well, makes this a must have item.  There are many more bells and whistles, but we just wanted it so we could watch Prime on our TV easily. It works better than you could imagine.", "verified": false, "helpfulness": "0/0", "author": "Customer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Ben Pendergraft"}, {"rating": 5.0, "review": "Had Google Chromecast and switched out for the Amazon FireStick and it's 50x times better. Can get all the shows and apps I want and need. I am 100% percent satisfied. Oh! and, as a result ... ditched my Cable company with their ridiculously overpriced packages. Saving hundreds of dollars and viewing 100x better programs.", "verified": true, "helpfulness": "0/0", "author": "Craig Lowther \"Craig\""}, {"rating": 5.0, "review": "It's so easy to install, love it!!", "verified": true, "helpfulness": "0/0", "author": "Christina Deisler"}, {"rating": 5.0, "review": "Amazing.  A little sad it doesn't work with all my TVs but I can't complain about incompatibility with a 10 year old TV.", "verified": true, "helpfulness": "0/0", "author": "Ellie"}, {"rating": 5.0, "review": "Loving it!  Watching THE WIRE with no commercials!  Excellent !  Once the fire stick is set up it is easy to use and has improved my TV experience tremendously!  Soon to go to summer home...portability is a huge feature for me!", "verified": true, "helpfulness": "0/0", "author": "PatW"}, {"rating": 4.0, "review": "Met my expectations. Picture quality is great!!", "verified": true, "helpfulness": "0/0", "author": "Ron Jason Sprick"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Randy Xun"}, {"rating": 5.0, "review": "Just what I needed!", "verified": true, "helpfulness": "0/0", "author": "ivplai216"}, {"rating": 5.0, "review": "Amazon Fire TV and Fire TV Stick are the best thing going today.", "verified": true, "helpfulness": "0/0", "author": "kiddcage2010"}]