[{"rating": 5.0, "review": "I received this today and hook into my TV and amazed what it can deliver.  With prime, this is a must have and I can easily port in multiple TV's a and projectors .  Dual core and dual band is big plus.  I didn't try other apps yet, but I was blown out watching amazon prime movie.  The only issue I had is opening the battery cover on the remote, I have to watch an YouTube video to find out that I have to  press it hard to open the cover, hope I'm not alone :-)", "verified": true, "helpfulness": "0/0", "author": "Solaris \"SUN\""}, {"rating": 5.0, "review": "I bought this just to give it a look - what can I say, it exceeds my expectations.  Super fast loading, great quality, all my amazon prime stuff in there.  I'll probably buy a few more.", "verified": true, "helpfulness": "0/0", "author": "S. Ball"}, {"rating": 4.0, "review": "I already have a Roku and apps on my TV and Blu-Ray player... I picked this up for two reasons, the main one being Amazon has yet to update any of their apps for Roku or other smart media to listen to prime music. I was stuck having to link my tablet to my stereo or only listen to prime music on my phone or computer. I would have just gone on without the prime music if it wasn't for Amazon offering this baby for twenty bucks. My second reason, a good deal!Using this from the start was a breeze. I literally didn't have to do anything but plug it in to my TV and an outlet for power. Once it was on it knew already all about me and had all my info loaded. No running to the computer to enter a code to activate this or that. It was just that easy.Of course I do have to log into my own Netflix account and other apps aside from Amazon. No big deal.I'll start with what I like about it...I like that I can now access all the prime music I have saved. The best part is most songs that play will show lyrics, so I can do my own karaoke if I want to!I'm able to continue listening to music as I browse through Amazon.Also little did I know when Amazon sent me notice about unlimited photo storage; the pictures I uploaded to it could be used as a screen saver to the music I'm listening to. I thought this was cool. It's totally motivated me to upload more pictures that I'd like to see more often.This little baby is also much faster than my Roku Stick. I almost which I picked up 2 for the prime member sale price I got it for.What I don't like is...Well the main thing I don't like is the whole viewing screen. If anyone knows how Netflix used to be were you had a larger selection to view at once, rather than just the 5 or so movies at time you feel my sadness. It seems Amazon followed suit and only let you view less than that at a time. Let me give you an example. I have over 4000 music albums in my account. In case my husband is reading this; no honey I didn't purchase over 4000 albums they're part of prime music. It's free! ;-) So if I want to listen to an album but wish to browse first... forget about it. I'll never listen to anything. It starts with the numbers, then the alphabet and you can only scroll forward viewing less than a handful of albums at a time. This is a major drag. I can't even go left and start with Zs and work my way down. When I finally make it to an album I want to look at, not listen to just yet, but just look at. I can select it and the album will open up. If I then decide ehh I'm not in the mood for it and go back... you guessed it I have to start ALL over again.This whole viewing, browsing is the same for movies, tv, everything! View by artist I get the same dilemma. I either have to know exactly who I want to view/listen to and type it in the search or I'm left stuck browsing forever.Another thing is you can't add more prime music from the Fire Stick. If you can, I haven't figured it out.This will not be replacing my Roku 3 for now. There's no HBO Go app and others that I view on my Roku. I'm sure more apps will come, but until then I'm not replacing this with my Roku. Hence the 4 star rating, since I don't see it as a replacement at this time.Overall I'm pleased with this device and will be using it often.", "verified": true, "helpfulness": "1/1", "author": "Jen"}, {"rating": 5.0, "review": "This is an incredible device. I have used and still use many streaming devices. We have a Roku, multiple Chromecast devices, a Midnight MX2 android box, Apple TV2 and 2 HTPC units. I bought 2 of these Fire Sticks during the 2 day promotion. I just have to say I'm really blown away by how well it works. I side loaded XBMC onto the stick and it works amazing. I like the fire stick so much that I ordered the full Fire TV device to replace my main HTPC.Bottom line, make sure all your electronics are compatible and you should not have any problems. I was up and running within 12 minutes. These fire sticks are replacing the Roku and Apple Tv. Will be buying a few more.", "verified": true, "helpfulness": "1/1", "author": "mtlmn"}, {"rating": 4.0, "review": "Like it, the packaging it comes in is really nice, amazon thought it through.  They put EVERYTHING in the box you'll need to get it up and running also, which is huge.  I got this from best buy for $27 shipped as they are out of stock on here.  I would definitely recommend, the only reason I gave it 4 stars, is I like my Apple TV better still, but it's still worth the money!!", "verified": false, "helpfulness": "0/0", "author": "Greg Fridder \"Fridder\""}, {"rating": 5.0, "review": "I pre-ordered the fire stick when it was on sale for 2 days.  Wish I  would have ordered more than one.  I have the Amazon Fire Box and was pleased with the product. I was expecting the Fire Stick to work like Chromecast stick which I also have.I  was pleasantly surprised that the Fire Stick works like the Firebox. There is no need to cast the video from a mobile device or PC to the TV if there is  wireless internet connection.Since I already had Amazon Prime and Netflix accounts and a wireless network,  the install was simple.  It took only a few minutes.  Once setup, the Fire Stick can be moved quite easily to another HD TV if  you wish.  I am very happy with my purchase and the  delivery  of the product was a week earlier than projected.I love the voice search. It always seems to work well.", "verified": true, "helpfulness": "0/0", "author": "jacquelyn lescher"}, {"rating": 4.0, "review": "Being a huge chrome cast fan, this was better than I expected. It really opened my eyes to the good shows and movies amazon prime offers.", "verified": true, "helpfulness": "0/0", "author": "Kelly S."}, {"rating": 2.0, "review": "I had a Google chromecast but not being able to play Amazon Prime videos was a dealbreaker, so we picked this up when it was $19. So far I've been pretty disappointed in comparison.- The Chromecast took 30 seconds to set up. This took me over 30 minutes. It rejected my wireless password a dozen times before finally deciding to take it. Inputting information is enormously tedious.- Randomly it will stop playing video from Netflix. It will try to reload, it will only get to 25 percent and then it'll just time out. It's happened three times and I've only had it hooked up a few days. I googled a solution since it appears impossible to get anyone from Amazon on the phone to troubleshoot and the solution was suggested in 2011 to try removing Netflix and reinputing all of your login information. That worked, but again, it's insanely tedious to put stuff in like emails and passwords, and it takes ten minutes to do so. It's infuriating to have to keep doing this for no reason.- The little remote, an immensely loseable little device, is the only way to control it. It can't be controlled via your computer like Chromecast. So I envision the day we lose the remote and can't use the stick. Overall, not really happy with it. I guess for $19 I can't complain, yet, here I am, complaining.", "verified": true, "helpfulness": "0/0", "author": "Bethany S. Mandel"}, {"rating": 5.0, "review": "I got this TV Stick at $20 because I have the amazon prime. It took me about less than 3 mins to bring it up and running on my TV. This stick is doing all the things I needed. I can stream all the movie contents from netflix, amazon prime, hulu plus, youtube and even all my local movie files thru the plex server, which is running on my macbook... it's very responsive. it's worth every single penny which I paid for. I recommended this item to everyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Does what it says it dows and very simple installation.  I really don't use it much since I own an xbox one and can access most of the same programs.  My one complaint is that you cannot access your Prime Music account.  I would give 5 stars if this were possible.", "verified": true, "helpfulness": "0/0", "author": "Dragg \"MusicMonkey\""}]