[{"rating": 3.0, "review": "Great.  Will never buy a smart TV?", "verified": true, "helpfulness": "0/0", "author": "Frances Mason"}, {"rating": 5.0, "review": "So far I am very impressed. Would recommended for people to give it a try.", "verified": true, "helpfulness": "0/0", "author": "Shawn N Sharp"}, {"rating": 4.0, "review": "I am an apple TV guy, and was a little worried this wouldn't live up to what I was used to. For the most part I was proven wrong. The Fire Stick has pretty much all of the same apps as apple TV (although there are a few I still need to use my apple TV for), the system is just as fast, there are a lot of options this has versus apple TV, and all around I am very pleased. The free AirPlay app you can get for the Fire Stick is awesome too as it allows me to stream video and pictures from my phone just like the standard AirPlay.All around this is an awesome device especially at the price point. Would definitely recommend to anyone in the market.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Stephenson"}, {"rating": 4.0, "review": "Feature is nice. I wish newer content movies were available. A little clunky moving through Apps", "verified": true, "helpfulness": "0/0", "author": "Tribechic"}, {"rating": 5.0, "review": "Very easy set up. I purchased it to use on my boat house and it works like a dream. Most Cable companies provide an app if you have internet with them and it gives you a hot spot to use at no cost. Beware if you use your cell phone providers hot spot it will eat your data in two movies. I love that I can take it anywhere I go.", "verified": true, "helpfulness": "0/0", "author": "Tim Silvers"}, {"rating": 1.0, "review": "Seems like we keep having problems after problems. I don't want delays. I don't want to keep troubleshooting. Roku customer is way better and the product is to. I had a Roku for years and something broke they still sent a replacement even after warranty was up. My stick is still under warranty and I have to jump through hoops to try and get it fixed.", "verified": true, "helpfulness": "0/0", "author": "JENNIFER BLANKENSHIP"}, {"rating": 5.0, "review": "Better than Chromcast and supports 5G Wifi Networks for smoother / faster HD Playback.", "verified": true, "helpfulness": "0/0", "author": "Brian MacKenna"}, {"rating": 5.0, "review": "I absolutely Love it very easy to install & use well worth the money", "verified": true, "helpfulness": "0/0", "author": "Lorraine Schmitz"}, {"rating": 3.0, "review": "It would not maintain a constant wifi connection so I returned it to Best Buy.", "verified": true, "helpfulness": "0/0", "author": "Edgar Holguin"}, {"rating": 5.0, "review": "Awesome product. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Matthew"}]