[{"rating": 3.0, "review": "Can't understand why it stops working when there is no internet connection. I still want to use the PLEX app to access the movies in my PC when the internet is down.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The little brother to the Fire TV set top edition, however don't let the size fool you, these little guys are packed full of power. Streams in full 1080p flawlessly!", "verified": true, "helpfulness": "0/0", "author": "arsonone"}, {"rating": 5.0, "review": "I signed up for Prime and ordered the Fire stick. I did not get it when I thought was supposed to, contacted Amazon, they got right back to me, I did not see that the Sticks were on backorder. Amazon was able to get it to me much faster than expected I am real happy with the service and the Fire Tv.", "verified": true, "helpfulness": "0/0", "author": "riverstone"}, {"rating": 4.0, "review": "Excellent! very easy to install. Great for me that I am a traveller and I use it en every hotel. Very easy to carry on..", "verified": true, "helpfulness": "0/1", "author": "Gugusera \"AndreaPM\""}, {"rating": 5.0, "review": "Love this little device, and learning something new every day. Like, I saw Photos on the homepage but didn't open it for days. Then I did just to check it out. Every photo on my Kindle Fire tablet is right there on my TV! And my music Playlist,  yup, there also and yesterday I added to it. Today I'm calling my cable company to cancel the movie channels because I'm enjoying all the free movies and TV series. Ok folks, if you already have Prime this device is only $39.95; it costs more than that to go to lunch and a movie one time. And I'd much rather watch the Prime movies on my 46 inch TV than a tablet ant day. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jeri"}, {"rating": 5.0, "review": "I really love my fire stick, easy to install and easy to use", "verified": true, "helpfulness": "0/0", "author": "grimmersgirl"}, {"rating": 4.0, "review": "I really like how compact it is and how simple the remote is. Good value for the money. Very little hardware makes set up really easy. Could use a more detailed instruction manual though. I'm sure the fire stick does a lot more than I know.", "verified": true, "helpfulness": "0/0", "author": "hudsoncobra"}, {"rating": 5.0, "review": "I received this as a gift. It has been a great addition to my media experience. I have also been able to view my older movies that I had only on tapes.", "verified": true, "helpfulness": "0/0", "author": "James A Rainwater"}, {"rating": 5.0, "review": "Easy to install and use once you get used to the buttons.", "verified": true, "helpfulness": "0/0", "author": "M. L. Sherman \"Joeys Nana 99\""}, {"rating": 5.0, "review": "Fantastic item, I am almost considering cancelling my Comcast because of this. Lots of shows and movies to choose from, easy to use and easy to set up. Five stars all the way.", "verified": true, "helpfulness": "0/0", "author": "Mark"}]