[{"rating": 3.0, "review": "It is ok, I need more time to get used to maneuvering it and there should be a disclaimer on apps you can't use unless you have a subscription but we can stream netflix, and prime tv some sports so it is far better than nothing, and less expensive than cable.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "Wow! Great! I've been using this for months; it has turned my smart TV into a dumb TV. Using NetFlix and other apps is far faster than the smart TV firmware and the Chromecast (because of the on-board memory). Having a remote is more convenient as well. My Chromecast has been relegated to streaming vids from my computer to the TV (the only thing the Fire TV Stick doesn't do...yet, as far as I know). The remote is well designed and responsive.", "verified": true, "helpfulness": "0/0", "author": "A. GILBERT"}, {"rating": 1.0, "review": "When connected to the internet it still tells me there is no network available. Go into network settings to connect to wifi and it is already connected with strong signal strength. Have to unplug multiple times to get it to recognize it is already connected to the internet.", "verified": true, "helpfulness": "0/0", "author": "Theresa Begtson"}, {"rating": 5.0, "review": "I am going to buy an additional TV but do not need a smart TV because this product works so well.  It will save me a bunch of money.", "verified": true, "helpfulness": "0/0", "author": "Paula B"}, {"rating": 2.0, "review": "Like the concept but because of the power requirements I can't plug it into the TV or media receiver so it's plugged in all the time.  The stick gets \"stuck\" and I have to \"reboot\" it.  Pretty much makes it useless for me.", "verified": true, "helpfulness": "1/1", "author": "TrippMe"}, {"rating": 4.0, "review": "pretty decent for what it does. Definitely leaps and bounds above Chromecast.", "verified": true, "helpfulness": "0/0", "author": "rbx"}, {"rating": 5.0, "review": "Fantastic item , nothing beats it", "verified": true, "helpfulness": "0/0", "author": "Cast"}, {"rating": 1.0, "review": "This is the absolute worst. I purchased two and it was such huge mistake. The first day, everything was fine, they worked perfectly. After that, they stopped loading, both would freeze or just randomly shut off. Such a waste of money.", "verified": true, "helpfulness": "0/1", "author": "jessica"}, {"rating": 3.0, "review": "While some what better than the roku stick the roku offers more amazon has s few shows new but only a few any current shows require more money", "verified": true, "helpfulness": "0/0", "author": "drwho"}, {"rating": 5.0, "review": "It does everything and more than i need it to do. great product!", "verified": true, "helpfulness": "0/0", "author": "David DeMenge"}]