[{"rating": 3.0, "review": "The Fire TV Stick is well-designed and sells at a great price, but lacks a broad selection of Channels.  I cannot compare it to the Chromecast, but it certainly doesn't stack up against my Roku in terms of available channels.  It's a toss-up between the Fire TV Stick and my AppleTV.  The latter has a slightly broader channel selection but also sells at a premium price.Hopefully, more channels will be available soon.", "verified": true, "helpfulness": "0/0", "author": "Hal \"Hal\""}, {"rating": 4.0, "review": "Pre-ordered it when it was announced. I've had it for about a week and it's doing its job nicely. I only wish there were a solid way to cast from my Android device to it. The apps that are available either don't load all the way or are paid apps that have \"okay\" reviews. Plex is the only one of note, really, but I just don't feel that I should spend money to stream content that I can do for free otherwise.Kudos to Amazon having a successful product, although streaming from a mobile device is shaky at the moment. Still a good product overall.", "verified": true, "helpfulness": "0/0", "author": "M. Nobel"}, {"rating": 3.0, "review": "My fire stick worked great for 2 weeks but now it won't connect to my internet.  Says I have a poor signal.  I've tried it for 4 days now and just can't get it to work again :(  we haven't changed anything or added anything additional to my wifi.  Looks like it is back to watching tv through my wii which picks up my wifi with no problem.  I'm bummed I spoke so highly of the fire stick to so many people when I first got it.  I hope they don't have the same problems I am.", "verified": true, "helpfulness": "1/1", "author": "J. Terwilliger"}, {"rating": 5.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "Huckstump"}, {"rating": 5.0, "review": "Great device you should have one of these on every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Adrian"}, {"rating": 5.0, "review": "I have now been using this Fire TV stick for about 2 weeks and I am pleased. I had an older non-SMART TV in my bedroom and it's finally getting some use due to this stick. I got it for only $19 and ordered it despite having a Roku and a Chromecast and also a Belkin Miracast.Belkin Miracast was fussy though it works without internet connection, I never really used it much as it wasn't user friendly and had many limitations.Chromecast does not have a remote plus the wireless connection is not very strong. It also did not have Amazon Instant Video but it does have HBO GO.The Roku device had everything but it's not portable and needed ethernet cable for interruption free playback and I prefer the more portable sticks. I haven't tried the Roku Stick.This Fire TV stick plugs into an HDMI port on the TV and I am glad they gave the extender with it as the port was at a very awkward angle and would have required me to lift the whole TV to get it plugged in if it hadn't been for the more flexible extender. It also required a wall plug, no biggie at all.Set up was extremely easy, what a joy! I was watching Amazon Prime shows in a jiffy.What I like:- Super easy set up compared to Chromecast- Stronger wireless signal compared to Chromecast, videos load fast and shows keep playing one episode after another on Amazon Instant Video- Amazon Cloud Drive photos and videos (almost 60,000 that I have uploaded so far!) are available to watch on my TV. Makes such a difference over tablet viewing- Amazon Music can be played on your TV - if you have nice speakers connected to your TV this is a real plus as you can stream Prime Music- Love that a remote is included and I can put away my phone. Remote is very responsive.Some downsides:- Menu is just ok, could be more user friendly. You have to scroll through a lot of stuff.- HBO GO is not yet available, will come in Spring 2015It says that this stick is Miracast certified, does that mean it can mirror my tablet? I haven't tried that out yet but could be a nice feature.", "verified": true, "helpfulness": "0/0", "author": "ZenWoman"}, {"rating": 1.0, "review": "Recieved it two day ago....it worked for a few hours, then conked out... the stick just won't connect. My Roku3 works fine. Iasked Amazon to replace it, they put it off. Now I'm stuck with a defective Fire TV stick.", "verified": true, "helpfulness": "0/2", "author": "vic la madrid"}, {"rating": 5.0, "review": "When I first saw this I wondered, why in the world would I need this product?  Still, since it is from Amazon, I just had to order it and try it!!  Here is what I found:  1.  There is NO doubt that this makes it easier to see and to order videos from Amazon!!  I have four different SMART TVs and using this on any of them makes the print and the preview pictures much larger.  I can actually see what is available without having to walk up to the screen.  This may not be a big deal to you if you have excellent eyesight.  If, like me, your distance vision is not what it used to be, you will appreciate this device.  2.  I had never really thought about using Amazon to play my music with on a TV.  However, I must say that it is very nice to be able to do that when you are not at home (say a hotel somewhere) or when you want some music in an area that your TV is in and not your other audio equipment.  There are several options as to how to play your music.  Actually, this was another very nice feature that I had not thought about.  3.  Sharing pictures is also very easy with this.  I always hated trying to show pictures from my tablet to my in-laws when I visited them because it was so hard for them to see.  This is especially true for my 95 year old Godfather.  Now, I upload the pictures to my Amazon account and plug this device into a HDMI Port on their computer and instant LARGE SCREEN PICTURES!!!!  4.  The control works very well and I was quite pleased by the ease that I had connecting to my network and to networks on the road.  5.  There is an issue with HBO, but that is NOT the fault of AMAZON or this device.  This is because some companies do not believe in net neutrality and BLOCK things that compete with them.  We all need to write to our congress folks and Senators to demand NET NEUTRALITY!!!  NO Internet Service company should be able to block what you have access to!!!All in all, this is a Great Product and I am very glad that I ordered it!!", "verified": true, "helpfulness": "1/2", "author": "Ralph Furlong"}, {"rating": 5.0, "review": "Bought at sales price of $19. Tried on both monitor and TV. Easy access to Prime content, streaming HD content smoothly. Should have bought two instead.", "verified": true, "helpfulness": "1/2", "author": "KevinX"}, {"rating": 4.0, "review": "I really like the fire stick but it NEEDS to be able to control volume.  Not being able to control the volume is a huge negative.", "verified": true, "helpfulness": "2/3", "author": "Fr0ntSight"}]