[{"rating": 4.0, "review": "Difficult to navigate. haven't been able to research the free movie list with consistent results", "verified": true, "helpfulness": "0/0", "author": "Ronald M. Skudlarek \"Constant Reader, Hobbiest & Helper\""}, {"rating": 5.0, "review": "LOVE IT!!!!", "verified": true, "helpfulness": "1/1", "author": "Eddie"}, {"rating": 1.0, "review": "I recently just got my Fire TV Stick and I was very excited on having this device. I finally tested it for the first time today and I noticed that the charger port was loose and it popped out twice before I finally got it in and charging. I was getting disappointed at that point and worried that I have wasted my money on this device because I also have a chromecast and that one lags a bit but this is actually slower than the chromecast. Also the buttons are difficult to press. It gets stuck in the remote as I press to navigate. I don't recommend this product.", "verified": true, "helpfulness": "2/3", "author": "CHRISTOPHER UBANDO"}, {"rating": 5.0, "review": "Excellent.  Easy to set up and use.  No problems.  Had a chance to compare to ChromeCast device during the holidays -- easier to use Fire Stick remote than to require the owner's laptop/phone to be available for control as ChromeCast requires.", "verified": true, "helpfulness": "0/0", "author": "nevadagrammie \"desert_grammi\""}, {"rating": 1.0, "review": "Fire stick Internet connection is not stable(connected with problems error)so this device is use less and don't buy stick. And secondly require mouse button in remote controller.", "verified": true, "helpfulness": "18/21", "author": "Bhairav"}, {"rating": 5.0, "review": "Works great!  Very easy to install and get working.  I had it running in about 5 minutes or so.", "verified": true, "helpfulness": "0/0", "author": "LPadgett"}, {"rating": 1.0, "review": "It worked OK for a couple weeks. I did not use it extensively but it seemed fine.  It now will not connect to my Wifi. I have followed all the forum suggestions (use extender, unplug, reboot, etc) and NOTHING.  It appears that this is quite common and highly disappointing", "verified": true, "helpfulness": "1/2", "author": "Kyle R. Martin"}, {"rating": 4.0, "review": "Small and works well!", "verified": true, "helpfulness": "0/0", "author": "Ryan Shimada"}, {"rating": 5.0, "review": "I haven't had time to do much but a little bit I have done with this gadget is great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was skeptical when I picked up the Fire TV Stick during its initial promotion.  I've been impressed with the usability & responsiveness of the UI.  It's especially good for browsing & watching Amazon content, but even Netflix is quick and the video streams appear to be higher quality than the same streams on my Samsung smart TV.I would say the Chromecast is the best overall streamer at the moment, given the number of integrated apps.  But if you use Amazon video, it makes sense to own both.  I've been using Chromecast for Youtube & HboGO and Fire TV Stick for Amazon & Netflix.  Overall the Fire TV stick is a better at-home experience, but Chromecast fills in the gaps.", "verified": true, "helpfulness": "1/1", "author": "Tony M."}]