[{"rating": 1.0, "review": "I actually got to the point where I enjoyed the interface on this device, and had 2-3 days of really pleasant viewing experience.Now, my device will no longer connect to my wifi connection. Or it will connect and then say \"authentication problem\". Not sure why it just up and quit working after a few days. All other devices, including Apple TV, still connect perfectly.I bought this to be able to stream Prime video, so I'm pretty disappointed. Hoping for some sort of technical solution in the near future. Until then, I would NOT recommend purchasing this item.", "verified": true, "helpfulness": "0/0", "author": "Mary K. Baynor"}, {"rating": 1.0, "review": "Product does not work. The stick only dfisdplays the amazon logo, then the screen goes blank. I have reset it a million times with the same outcome. I will be returning this product to amazon. Extremely disappointed.", "verified": true, "helpfulness": "0/1", "author": "FreddieJ"}, {"rating": 5.0, "review": "I love my fire stick - easy to set up and easy to maneuver.", "verified": true, "helpfulness": "0/0", "author": "Jeanne Lovely"}, {"rating": 5.0, "review": "About sis months ago our Logitech Review simply stopped working after three years.  I was using my DVD player's klutzy Netflix app that had buffering issues. during heavy traffic periods.  The stick?  No issues at all, even on Saturday nights and Sunday afternoons.  I can access all my Amazon content whenever I want.", "verified": true, "helpfulness": "0/0", "author": "John D. Beatty"}, {"rating": 1.0, "review": "Miracast is garbage, and the only reason I purchased it was for miracast.", "verified": true, "helpfulness": "0/1", "author": "Sergio Gutierrez"}, {"rating": 5.0, "review": "Very easy to use. Combined with Amazon prime, there is more to watch then I can get through in a lifetime.", "verified": true, "helpfulness": "0/0", "author": "LINDA \"NutLover\""}, {"rating": 3.0, "review": "Love it but doesn't connect to my iPhone to be used as remote....super sad!", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 3.0, "review": "App selection is lacking. Casting is a headache and you can only cast certain things. Need separate game controller for games.", "verified": true, "helpfulness": "0/0", "author": "Robert Napper"}, {"rating": 5.0, "review": "Works with no problem and give great picture quality. A must have!", "verified": true, "helpfulness": "0/0", "author": "Luis rosado"}, {"rating": 4.0, "review": "When connected  directly into my smart TV (Samsung) it had trouble connecting to my network and could not find amazon.com.even though TV works fine as do other devices in this high level wi-fi.Connected it through an hdmi cable to get the stick away from the TV and it works GREAT....got better picture than through the cable system.", "verified": true, "helpfulness": "0/0", "author": "Maurice A. Henry"}]