[{"rating": 5.0, "review": "Awesome....easy....everything included!", "verified": true, "helpfulness": "0/0", "author": "d g"}, {"rating": 5.0, "review": "Easy to install and use. Love it...", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Better than cable", "verified": true, "helpfulness": "0/0", "author": "Duncan Peterson"}, {"rating": 5.0, "review": "There are some minor things with it that are a bit annoying(Netflix needs to be \"bought\" even if it is free) but it does not hinder on the overall satisfaction of the product.", "verified": true, "helpfulness": "0/0", "author": "Alexander Acosta"}, {"rating": 3.0, "review": "Installation was easy and pretty quick, and at first (the first day) everything worked fine. Then, came streaming issues.  The video quality went downhill and suddenly there were  buffering issues. Next, I got onscreen messages indicating that my internet speed was too slow, but that my WIFI connection was \"Very Good\". Okay, so I replaced my modem, which needed replacing anyway, thinking that would solve the problem. It didn't!Afterwards, ensuring that there were no technical impediments on my end, I started wondering if  there was a problem with the Fire stick. There was! I went to re-check the Fire stick connections and discovered that the stick was really warm. So, I disconnected it for a while so that it could cool down. Then, I re-connected it, and and everything worked as expected. Now, I just disconnect the Micro USB connector from the Stick when it's not in use, and just plug it in when I plan to use it. This has solved the problem for now, but it is an inconvenience. Oh well, at least I have a new Modem!", "verified": false, "helpfulness": "0/0", "author": "HPW"}, {"rating": 4.0, "review": "Great product!", "verified": false, "helpfulness": "0/0", "author": "steven coleman"}, {"rating": 5.0, "review": "love it  now i can watch movies that i want to", "verified": true, "helpfulness": "0/0", "author": "debora"}, {"rating": 5.0, "review": "Great tool,makes it easier", "verified": true, "helpfulness": "0/0", "author": "Adrian Sandoval"}, {"rating": 5.0, "review": "My new \"SMART\" TV is finally getting smart.", "verified": true, "helpfulness": "0/0", "author": "Jeff Grainger"}, {"rating": 3.0, "review": "I've been wanting this for ever and finally purchased it. Well, I got it and it kept disconnecting to my internet which is through AT&T.; After resetting it numerous times with is still not working, I decided to call Amazon. After a few min with them, the rep told me that AT&T; internet does not work with the Fire Stick and to get it to work, I would have to us it during non-peek times like early mornings, weekdays, mostly all the times that I am at work and cant use it either. So, I have this Fire Stick and can't use it because I have AT&T.; Future customers, if you have AT&T; as your internet provider, know that it will probably not work when you want it. I think it's a cool item just wish I could use it.", "verified": true, "helpfulness": "0/0", "author": "Rita"}]