[{"rating": 5.0, "review": "Works great!! I highly recommend! I watch Hulu Plus and rent movies.", "verified": true, "helpfulness": "0/0", "author": "Jacob R"}, {"rating": 5.0, "review": "It was very easy to set up as well as to navigate.", "verified": true, "helpfulness": "0/0", "author": "Kevin L. Dunton"}, {"rating": 5.0, "review": "it's great", "verified": true, "helpfulness": "0/0", "author": "Cornell"}, {"rating": 5.0, "review": "Picked up an Hdtv antenna and the firestick and canxed the 120$ a month cable bill.Firestick is amazing,. high quality picture and sound. Don't hesitate.", "verified": true, "helpfulness": "0/0", "author": "Badookan"}, {"rating": 5.0, "review": "Easy set up and excellent streaming capacity.  Definitely met and exceeded expectations.", "verified": true, "helpfulness": "0/0", "author": "Altrivice Revis"}, {"rating": 5.0, "review": "I have 2 kids 4 and 9 so i must have some thing easy to use and have a remote and can stream Netflix.this device have them all with a good price too.I know it could do much more but the only 2 things i use it for is Netflix and YouTube and  it handle both with no problems.One thing i wish amazon would work on is the remote it feel a bit cheap for an adult user it should last for ever but with children i know i will have to buy replacement sooner or latter.", "verified": true, "helpfulness": "0/0", "author": "Auras"}, {"rating": 5.0, "review": "Love it! We also have a PS3, Roku, and an Xbox, and the Fire TV Stick is our favorite to stream from. It has the best interface for streaming through Amazon Prime. The only thing I wished it did was have the ability to stream from a media server from a computer, and so we have to use the Xbox/PS3 for that, but otherwise it's perfect.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "This is my second fire product . The first was the amazon fire box . I am very happy with both.", "verified": true, "helpfulness": "0/0", "author": "fernando a. loera"}, {"rating": 3.0, "review": "Still trying to get familiar with online process ... an online tutorial would be extremely helpful", "verified": true, "helpfulness": "0/1", "author": "Kevin J. Clark \"Kevin Clark\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "arleen lopez"}]