[{"rating": 5.0, "review": "Works very well", "verified": true, "helpfulness": "0/0", "author": "Brian Rupert"}, {"rating": 2.0, "review": "the music still isnt working", "verified": true, "helpfulness": "0/0", "author": "KERM"}, {"rating": 5.0, "review": "This was a Christmas gift and I love it!", "verified": true, "helpfulness": "0/0", "author": "BP"}, {"rating": 2.0, "review": "Main reason for purchasing was to have easy access to both Prime video and Netflix account.  I watch considerably more Netflix than Prime.  When I stream Netflix through this, the video will freeze while the audio keeps going, then the video goes super fast forward to catch up with the audio. It's incredibly annoying.  I do not have this problem at all when I stream Netflix through my 5+yr old DVD player that's hooked up with a Wi-Fi adapter.  Also, the Fire TV Stick keeps saying the Home page is unavailable, that my network is connected \"with issues\", even though there are no issues with my other wireless devices connecting to my network.  When this happens I have to try to force it to connect to some random network that shows up on the scan list, then tell it to connect back to my network.  Needs improvement.UPDATE:  After a few months of using it, I have to knock the rating down another star.  Continual issues with it saying there's a problem with my network connection, when all my other devices work just fine.  Sometimes it won't even let me manually reconnect - I enter the password and it goes back to the screen that says \"disconnected\". I would return this item, but unfortunately it's already past the return date limit.", "verified": true, "helpfulness": "0/0", "author": "Wanda"}, {"rating": 4.0, "review": "So far very pleased wih the results of a very modest investment.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Love it. Connected the whole house.  No more cable!", "verified": true, "helpfulness": "0/0", "author": "Bryan Brown"}, {"rating": 4.0, "review": "This is a wonderful device!  Will definitely be purchasing another one for the bedroom.  I could only give 4 stars though since the remote control apps and stuff don't work on the iPhone platform. Hopefully this will be available soon.", "verified": true, "helpfulness": "0/0", "author": "colohiker1983"}, {"rating": 5.0, "review": "Great product! Just ordered another for my inlaws. Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Michael Nappa"}, {"rating": 5.0, "review": "its a ok product...", "verified": true, "helpfulness": "0/0", "author": "edison"}, {"rating": 5.0, "review": "I bought this when Amazon had the pre-release sale, and received it a few weeks ago. It's a nice way to have access to all of my amazon music, and the library of Amazon Prime shows, etc. I already have an Apple TV for Netflix/Hulu, but find the interface on this is actually pretty nice too, so I end up switching back and forth. I mostly use it now for Prime shows that aren't available on AppleTV but I may use it more in the future as they offer gaming and things that the Apple TV doesn't currently offer. The controller is a little easier to use than the Apple TV one as well. The actual stick itself is a little awkward, even though it is small I had a tough time finding a place to put it. It actually is connected to the back of my receiver (cord is really short), but it works...just a little wonky. Another thing I like is the remote does not have to be in line-of-sight with the FireStick to work, like the Apple TV does, so I can keep my hand under the covers on the couch and it still works fine. If you don't have a streaming media device, I'd recommend this one if it has the features you need as the price is great. The interface is also probably my favorite compared to Apple TV, Roku, Sony/PS3, etc. If you already have an Apple TV, you're not getting a whole lot of new features, but for streaming Prime or adding basic games to your home theater, it may be worth it.", "verified": true, "helpfulness": "0/0", "author": "Jules Fitzegibbons"}]