[{"rating": 5.0, "review": "Works great with Amazon Prime -- so nice not to have to hook up the computer to watch prime movies or shows. It didn't work well with Netflix (constant buffering), but my blu ray player doesn't work well with Netflix either so I think it's an issue with our TV or cable and Netflix rather than a problem with the fire stick. Still need to play with it more to see what else it can do, but so far I love it.", "verified": true, "helpfulness": "0/0", "author": "caryl"}, {"rating": 5.0, "review": "I was very surprised at how simple the set up was.  The results are simple and easy to use, however I would like to see a better explanation of  the controller button functions.", "verified": true, "helpfulness": "0/0", "author": "CW"}, {"rating": 4.0, "review": "All in all, very solid product!  Easy to use right out of the box.  Battery cover isn't the easiest to get off the remote... but that is minor.  The only reason I don't give this 5-stars is because I can't right off figure out how to get the other apps to work (meaning not Amazon Instant) and it isn't covered in the tutorial that runs on setup.  I am sure it is easy once I take the time to figure it out.", "verified": true, "helpfulness": "0/0", "author": "Matthew B."}, {"rating": 5.0, "review": "Very easy to set fast streaming very satisfied! !", "verified": true, "helpfulness": "0/0", "author": "jack catt"}, {"rating": 5.0, "review": "Yes it did and I am thinking about buying another one for my TV in our family room", "verified": true, "helpfulness": "0/0", "author": "Barbara T."}, {"rating": 5.0, "review": "So easy to use, a Marine could set it up and do it!", "verified": true, "helpfulness": "0/0", "author": "Paul Ringheiser"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Steveb299"}, {"rating": 1.0, "review": "It was very easy to set up the fire stick. Out of the box, most things worked very well. However, when starting actual playback of any video content, it seems to skip and stutter quite a bit. Our old original Roku box sitting next to it does not have the same problems. Our other two Roku devices stream just fine. This particular device just can't seem to quite keep up.Amazon has contacted me and confirmed that they have known issues with Netflix and other issues on the Fire Stick. No update yet from them - -  still having issues with the various apps.", "verified": true, "helpfulness": "0/0", "author": "Robert Porter"}, {"rating": 3.0, "review": "Needs a strong Wi-Fi signal to work, and does not have the range of offerings comparable to AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Robert Waterbor"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]