[{"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "Jo"}, {"rating": 5.0, "review": "Easy to configure, worked very simply. Only issue I thought was the how-to video that shows you how to connect, plays AFTER you get it all set up. the rest of the video was very informative", "verified": true, "helpfulness": "0/0", "author": "Ironmike68 \"Ironmike68\""}, {"rating": 5.0, "review": "I found this to work very well on an older TV that is not a Smart TV.  I am able to get many things including Netflix, Hulu, and Amazon Prime.  Plus many other programs and games.", "verified": true, "helpfulness": "0/0", "author": "Jerry D. Hapner"}, {"rating": 4.0, "review": "The fire stick is nice, especially for the price.  There is a lot you can view with the prime membership but I have found so much of what I want to view comes at an additional cost.  Was hoping to get rid of direct tv and just use this to save $$ each month, but I don't think that will be an option without subscribing to a few things on here and not sure that will end up saving me any money in the end.  It is really convenient for the kids though!  They love it!  Still come across a lot of things they want to watch that aren't free, but we just move them along until they find something that comes with Prime.", "verified": true, "helpfulness": "0/0", "author": "Katherine Brown"}, {"rating": 5.0, "review": "So easy to use", "verified": true, "helpfulness": "0/0", "author": "deb55"}, {"rating": 5.0, "review": "Once I determined that I need a splitter to use the Fire Stick with my TV I now can easily switch between cable, blu-ray, and Fire Stick. It's a lot easier to access all the streaming options so I'll take more advantage of them. It was easy to set up and it was operating in a few minutes. I am very happy with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Laura L. Cleveland"}, {"rating": 4.0, "review": "I am really enjoying my Amazon Fire TV Stick!  The only problem I am seeming to have is that I can't do other things, all I want to do is watch all the movies and television shows!  Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Alex52"}, {"rating": 5.0, "review": "Works good and just what I expected!", "verified": true, "helpfulness": "0/0", "author": "Jzim2448"}, {"rating": 3.0, "review": "It's a good product but it restarts often when I am using it. But other it works good.", "verified": true, "helpfulness": "0/0", "author": "Dexter R."}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "mandy"}]