[{"rating": 5.0, "review": "So I am an ex Apple employee and all of my products are Apple ecosystem friendly. The only thing keeping this from being perfect is AirPlay support (I know that will never happen). Outside of that the response from the remote/ app is perfect! The video quality is great! I have had zero lag while streaming (I can't say that about my Apple TV). Dolby Digital plus playback for most audio content which is impressive for a small dongle. This baby does require an AC outlet to get a little more juice but other than that there is nothing I can say to complain about this product. If I could use AirPlay on this thing I would literally smash my crapple TV with a sledge hammer.", "verified": true, "helpfulness": "0/0", "author": "Bryan P."}, {"rating": 4.0, "review": "Love it, very easy to setup and use. I wish I had learned about this earlier. My cable bill  will soon be a thing of the past. It does have a tendency to skip a bit not sure why. But overall it's great!!Thanks,", "verified": true, "helpfulness": "0/0", "author": "Frank Negrete"}, {"rating": 5.0, "review": "I'm loving this!! Super convenient access to redbox and my amazon prime and a ton more on my TV. While visiting family, I was able to bring this super small, ultra-convent little guy and plug it into their tv in the guest bedroom. A wifi password later and I had access to all my favorite show-watching programs.", "verified": true, "helpfulness": "0/0", "author": "Brittaney"}, {"rating": 5.0, "review": "Our new technology gadget ! OMG It's amazing. so worth the price and service.", "verified": true, "helpfulness": "0/0", "author": "Heather J. O'dell"}, {"rating": 4.0, "review": "The Fire TV Stick is a teaser if you are not a Amazon Prime member.  They allow you to view the first episode for free and then $.  Once you decide to become a AP member you will be a member for life.  Well worth it!!!!", "verified": true, "helpfulness": "0/0", "author": "kaden munsey"}, {"rating": 5.0, "review": "works great!!!! love it -- better than the chromcast -- only thing would change is the length of the cord -- since you can;t plug it into USB port for energy like the chromcast -- so needs a longer cord -- other than that great device!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the Fire TV Stick.  It's great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Thought it was a good deal until I plugged it in. The netflix app would not launch and that was the reason I bought it. Almost like they were trying to force you to buy Amazon prime. Enough of corporate crap. Just give me what I pay for. I insist.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Sherrie R."}, {"rating": 5.0, "review": "this is marvelous.  It workes even better than expected.  We love it and can't wait until it gets HBO too.  But this ismthe best ever.", "verified": true, "helpfulness": "0/0", "author": "Jan"}]