[{"rating": 3.0, "review": "I bought this product when it was a special price. If you do not have another product to compare it to you would like it . I have a roku and I prefer the roku. I just feel that amazon attempt to direct the user to amazon products. If I did not have the roku I would satisfied with the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Den"}, {"rating": 5.0, "review": "I bought  Chrome Cast and hate it. I replaced it with the Fire Stick and  that is the best thing I could have done. Easy to use and lots of options come with it.  I'm returning The Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "Robert Arsenault"}, {"rating": 4.0, "review": "It's been a great purchase for my dad and for my grand children .. I bought 3 sticks and we all love having it ...", "verified": true, "helpfulness": "0/0", "author": "Mechelle Burcham"}, {"rating": 5.0, "review": "what a great piece for the price! ihavent used any of the other web based TVs but this fits my needs exactly. love it", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Love it great deal my kids love it for the games I love it for the music and movies.", "verified": true, "helpfulness": "0/0", "author": "Ginger Hensley"}, {"rating": 5.0, "review": "Love it.  So glad it was given to me as a gift.", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 5.0, "review": "Easy hook up. The family loves them.", "verified": true, "helpfulness": "0/0", "author": "ELIZABETH SCRANTON"}, {"rating": 5.0, "review": "I like this product very attractive . Bye.", "verified": true, "helpfulness": "0/0", "author": "Kiseub Lee"}, {"rating": 2.0, "review": "I wanted to love this stick. Looking at all of the positive things it says it can do... and then finding out that it's a faulty device. First of all, I purchased this for cheap... so that was great, that's why I gave it an extra star. Other than that, the features are alright, but the constant freezing in video is horribly annoying. After feeling the stick (no pun intended) it was super hot... like hotter than it should be. I think it's an overheating issue... so I contacted Amazon and had them send me a replacement. After plugging in the replacement... I was hoping the first Fire Stick was just a lemon. NOPE... the second one did the same thing. By the way, my TV and cord is top notch, so it's not that. Also, it only happens when we watch shows, not movies? Don't ask me why, but it's either a horrible buffer system, or it's overheating... and since you can't turn the unit off, it stays on and heats away. Not happy... wasn't even worth the money I paid for it.", "verified": true, "helpfulness": "1/3", "author": "Tristan"}, {"rating": 4.0, "review": "If you only use this for Prime, there's no better \"stick\" on the market. Sadly, it doesn't work as well for Netflix, Hulu Plus or the other offerings. Still, it does suffice. If you're not a Prime member, I'd go with the Roku or Chrome stick, as they seem to be faster for non-Prime video, but for Prime, this thing is unbeatable. The only serious problems I've had with it is that it sometimes locks up entirely and will not work again until you unplug it for around 30 seconds and plug it back in (essentially rebooting the stick) and it absolutely has to be plugged in to a wall-socket to get video, which is slightly annoying. The games are a nice added benefit. Now, if there were just a way to stop losing the teeny, tiny remote control that is provided (which is otherwise very responsive and awesome). I'd also like the \"ten-second\" rewind and fast-forward to work with more than just Prime. It's an invaluable feature and I use it all the time while watching Prime videos.", "verified": true, "helpfulness": "1/1", "author": "Sloopydrew"}]