[{"rating": 5.0, "review": "I've entertained the notion of \"cutting the cord\" like so many other people, but I'm still not close to doing so. There are still too many TV channels that I don't want to give up. However, the Fire Stick makes me understand why people do indeed cut the cord.The device itself is slick, minimalistic, discreet and it works pretty well. Some individual apps (see: MLBTV) are absolutely useless, but I won't pin that on the Stick. We use it on our bedroom TV which only had an HDTV antenna at the time. Boy, we didn't realize how much we NEEDED this product. We've been a Prime family for several years now and the Stick just makes that $100 a year so much more worth it. We very much enjoyed watching Bosch and are knee deep in House of Cards now (via Netflix).There's just a ton of value here if you're a Prime member and you don't want to pay a monthly fee for an extra cable box in your bedroom.", "verified": true, "helpfulness": "1/1", "author": "KennedyX8"}, {"rating": 5.0, "review": "This is one of the best investments I have ever made in my life. It is very small as I have mentioned in the title. It goes behind your TV in the HDMI spot and is hardly visible at all after you plug it in.What makes this stick extremely useful are obviously the apps that can be downloaded from the amazon store. Also, since this is an open platform you can also install third party apps which is what makes this the most slickest product to own in my personal opinion.A small issue I have with the product is that the remote is too small and you can misplace it and lose it frequently. But even this is negated by the fact that you can download an app on your smartphone to function as a remote and this app also has voice search features with a keyboard as well (which makes it easy to search for titles).At the price of $25 for which I bought it, I would say it is undervalued. You can definitely pay $29 for this product without a single second though or regret. I can promise you that this would be the best product that you would have ever bought in your life once you know how to use it according to your needs.Lastly, the OS is very fast and this is a very capable stick to make your TV extremely smart (maybe even smarter than you ;) )A MUST BUY FOR EVERYONE WHO HAS A TV (Even if it's already a smart TV)", "verified": true, "helpfulness": "0/0", "author": "Nerukkadi"}, {"rating": 4.0, "review": "This works pretty well,  I can move it from one TV to another unlike the Mohu antenna that can hook up to only one TV at a time.  At first glance it appears there are a lot of choices, and even though there still is a lot of choices, some of those choices are not free, and some are available only if you have a subscription to a participating cable/satellite company (ridiculous since the main reason to use Amazon Fire TV Stick is to \"cut the cable\"), or maybe they are only available in a certain region, etc.  Also items are listed in more than one category, so, again, there are not as many choices as it seems at first glance. I guess I can't blame Amazon Fire TV Stick for this, but I have problems with slow streaming/buffering even though I have high speed Internet service (ATT).  I purchased Sling TV and I am somewhat disappointed with the picture quality on some of these channels, and, again, some listed are only available with participating subscription service or are regional.  Still, a one time purchase of this equipment along with an antenna for local programming and a subscription to Sling TV and Amazon Prime is still less expensive than a subscription to Cable/satellite TV and I get fewer channels I'm not interested in.", "verified": true, "helpfulness": "0/0", "author": "JessieJS"}, {"rating": 5.0, "review": "Neatest thing since the Kindle Fire that hooks up to your TV.The app for the phone allows voice search, So Cool.Wish it had a surf the Internet app.", "verified": true, "helpfulness": "0/0", "author": "Chris Zellner \"Lakedog\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Maria morford"}, {"rating": 5.0, "review": "Highly recommend if your looking for something that pretty much does it all", "verified": true, "helpfulness": "0/0", "author": "Saint719"}, {"rating": 4.0, "review": "still like my ROKU much better", "verified": true, "helpfulness": "0/0", "author": "SUNI ONE"}, {"rating": 3.0, "review": "compared to other devices i have, this seems to have a couple of bugs i have yet to figure out. One i noticed is when streaming its seems to freeze or pause on its own.  my other streaming stick devices, havent had the same issues at the same location in the same position etc.", "verified": true, "helpfulness": "0/0", "author": "Cusco"}, {"rating": 1.0, "review": "There's better out there shop around", "verified": true, "helpfulness": "1/2", "author": "malaina"}, {"rating": 4.0, "review": "I ve share the results of Fire TV with a lot of friends and they are all amazed the quality of the product!I recommended to everyone!!", "verified": true, "helpfulness": "0/0", "author": "Diego"}]