[{"rating": 4.0, "review": "We got this to take the place of streaming through our Wii... What a difference in picture and so easy to use.  the only reason it gets 4 starts is the it will not work with my BOSE Cinemate, the audio has to go throught the television.  If anyone has any way of troubleshooting i would love to hear it.", "verified": true, "helpfulness": "0/0", "author": "Bryan White"}, {"rating": 5.0, "review": "Fairly easy to install even for me:-)", "verified": true, "helpfulness": "0/0", "author": "J. McNeil"}, {"rating": 5.0, "review": "Great product for the price. Using it for Netflix, Amazon Prime, and HBO Go. Very portable and easy to use. I can imagine it is great for travelers as well. Or to take to grandmas house, etc..", "verified": true, "helpfulness": "0/0", "author": "Christine Gomez"}, {"rating": 4.0, "review": "Works well, but the picture comes in very pixelated and freezes every now an then due to slow internet connection if anyone else is using the internet at the same time.", "verified": true, "helpfulness": "0/0", "author": "Sarah Copeland"}, {"rating": 5.0, "review": "Think this is an excellent value. Easy to setup and great interface.", "verified": true, "helpfulness": "0/0", "author": "David Boyce Barnes"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Saeed Sassan \"SS\""}, {"rating": 5.0, "review": "Fire stick is great. If you love streaming get one.", "verified": true, "helpfulness": "0/0", "author": "Eric Debellis"}, {"rating": 5.0, "review": "What a great little device.  Plug and ang go with lots of things I did not know I could watch.  Great value for the money", "verified": true, "helpfulness": "0/0", "author": "Boo's Mom"}, {"rating": 3.0, "review": "I have had this firestick now for about 6 months. It was recently updated and mentions that you can take it anywhere with you (hotel/vacation) (as long as you have wifi/internet, obviously) but thats not the case. I have been to NY city for a conference and didnt work in my hotel. I recently just got back from Vegas, stayed @ the bellagio and did not work. Keep in mind both hotels are high class with free wifi from hotel (just need to sign in with their passwrd) The amazon fire stick says its connected (4 bars/excellent) but when you try to view anything , it just tells you not connected and sign in to another network. I had to download a wifi app on my samsung android phone to be connected but that only lasts a couple minutes as well before it crashes. Very frustrating because i wanted to catch up on some game highlights so, Im just getting the word out in case you plan on using it elsewhere besides your home!! Be careful or be warned u mite have issues connecting when staying at a hotel.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "This is seriously one of the greatest thing Amazon has come out with!  So easy to use and tons of great movies and TV shows!  Price point is amazing!  The could have charged more and I still would have loved it!", "verified": true, "helpfulness": "0/0", "author": "Christina Knapp"}]