[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Reinaldo collazo"}, {"rating": 4.0, "review": "This is a fantastic device. I've used it for a month now and the only trouble I've had from it is the Hulu app.Hulu will freeze shortly after it plays a commercial or start playing with only the audio. Overall a very disappointing app on a great device.", "verified": true, "helpfulness": "0/0", "author": "Jester In Courts of Chaos \"IneffibleMind\""}, {"rating": 3.0, "review": "Only benefits so far are access to Prime and I like Allcast. My TV keeps turning off while using Fire Stick, very annoying, and I am disappointed at how many things I want to watch cost additional money.", "verified": true, "helpfulness": "0/0", "author": "Robbin Benson"}, {"rating": 5.0, "review": "We love our Fire Stick. It is so much more reliable and easy to use than our Internet tv for accessing Wi-Fi applications plus there are many more selections. It was a smart purchase!", "verified": true, "helpfulness": "0/0", "author": "Alan Hodges"}, {"rating": 5.0, "review": "Works great.  Have 3 in the house so far.  Kids have the game controllers with theirs.  May buy another 2 for the other TVs.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey M. Andrikanich"}, {"rating": 5.0, "review": "I LOVE my Fire TV Stick. The packaging is sleek, the instructions are simple, it was ridiculously easy and quick to install. I'm ordering another one for the living room TV. I don't want to share with my Mom. If you love to binge watch, this is your product.", "verified": true, "helpfulness": "0/0", "author": "Jackie Renteria"}, {"rating": 5.0, "review": "the app really allows you to do with it what you want with ease, using voice commands or the screen.  Much easier than the remote, although the remote works fine as well.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "We got rid of cable and got 2 fire sticks. We love them. We can watch movies and shows on prime or netflix and the kids can play games.", "verified": true, "helpfulness": "0/0", "author": "elizabeth sylestine"}, {"rating": 5.0, "review": "I like the remote.", "verified": true, "helpfulness": "0/0", "author": "sandran"}, {"rating": 5.0, "review": "I just installed this 'fire stick.  It was very easy to install and am excited about using it.  I know I will enjoy it", "verified": true, "helpfulness": "0/0", "author": "rvlady"}]