[{"rating": 5.0, "review": "The Fire TV Stick is great. Now I can take my movies into another room to watch when my husband takes over the TV with sports.", "verified": true, "helpfulness": "0/0", "author": "Susan P Davis"}, {"rating": 5.0, "review": "I was confused by the instructions and believed it had to be \"charged\" up before use?", "verified": true, "helpfulness": "0/0", "author": "Allen L."}, {"rating": 4.0, "review": "It's a great item for watching hulu, netflix, and Amazon Prime. Few downsides: you can't Cast tabs like like you can with Google Chromecast and apps like Vudu are not available.", "verified": true, "helpfulness": "0/0", "author": "GameGenie"}, {"rating": 1.0, "review": "the stick worked fine at first .. after a couple of days the Netflix app started freezing..as if that wasent enough it started dropping connection after 15-20 minutes.. everything became unavailable. when i went and checked my network setting, my connection status had full bars but it said connectivity issues.. i went ahead and reboted the device  and it was fixed.. 20 minutes later connection dropped... I got the apple tv and it works perfect! havent had any issues.. It's true you get what you pay for.. Fire TV two thumbs down..", "verified": true, "helpfulness": "1/1", "author": "arash rohani"}, {"rating": 1.0, "review": "Having issues with Netflix and Plex buffering.  I replaced a Roku device with the Fire TV Stick (The Roku was moved to connect to a non HDMI television).  While the Roku worked flawlessly with both Netflix and Plex, the Fire stick is constantly buffering, sometimes after 10 to 15 seconds of playback.  I inserted the extension cable hoping to improve reception, but regardless of the position of the device the buffering remains the same.  I have tried everything I could find to try, clearing app data - power cycling the device, etc... but none of those fixes seem to get me more than 5 or 6 minutes of playback before it begins to buffer again.  Haven't suffered through trying to watch something this much since I was connecting with my 56k modem - extremely frustrating.", "verified": true, "helpfulness": "1/1", "author": "R. Hensel \"Ric\""}, {"rating": 5.0, "review": "Amazon didn't let us down here, quick HDMI stick with many features. Love it", "verified": true, "helpfulness": "0/0", "author": "joshmoulton"}, {"rating": 5.0, "review": "Works great. Did not have to plug it in into outlet.", "verified": true, "helpfulness": "0/0", "author": "JAFO2011"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "This little stick works great for us. We dont have cable or satellite but along with an HD antenna, it fits our needs. If you are subscribed to netfilx or prime you can still watch movies. There are a few apps that are free like PBS, History (with limited viewing), Crackel, A&E;,NFL & others. The only cons I have experienced is the loss of internet connection, which I have to unplug the stick & plug it back in to get back the connection & some apps tend to buffer quite often but it might be my internet connection & not the stick, since it's happened with other devices as well. The picture quality looks great, my family enjoys it, I would recommend it!!", "verified": true, "helpfulness": "0/0", "author": "j1374"}, {"rating": 3.0, "review": "Noticeably slower than the FireTV and with a much weaker wifi antenna. It was worth the promo price, but I gave one of these to a relative and they had to buy a wifi range extender to get enough signal to it (wifi on my phone at the same location was fine), so it ended up being quite a bit more than the cost of the stick itself.", "verified": true, "helpfulness": "0/0", "author": "Travis Prebble \"attention span deficient\""}]