[{"rating": 5.0, "review": "If you don't have a gaming console, smart TV, cable, etc. this is a great alternative! It's much cheaper than the full sized Fire TV but does practically the same thing! Watch/rent movies, even watch movies from Amazon Prime through it. You can also play various games as well as view photos that are linked to your account and listen to music.This is really a must have if you have Amazon Prime because it brings the Prime experience to your TV. I really suggest buying this product directly through Amazon because it will come automatically linked to your account so all you have to do it plug it in and start using it. It's really an easy set up and it doesn't take up much room at all.", "verified": true, "helpfulness": "0/0", "author": "Bellatricks"}, {"rating": 5.0, "review": "Very easy to use and have been enjoying watching the programs with Prime.", "verified": true, "helpfulness": "0/0", "author": "Kimberly White"}, {"rating": 3.0, "review": "Not as thrilled with it as I thought I'd be. It's for a guest bedroom that can't be put on our DirecTV system. It doesn't pull the wi-fi signal as well as I had hoped, which can cause jerky streaming at times. Sometimes it's fine.", "verified": true, "helpfulness": "0/0", "author": "Living The Dream \"Stitchintime\""}, {"rating": 5.0, "review": "So far, exceeds my expectations. Beats all, similar products.", "verified": true, "helpfulness": "0/0", "author": "Chiabuli"}, {"rating": 5.0, "review": "I received the Fire stick as a gift. I know nothing about any other streaming devices. The Fire does what it should. It brings together most streaming sources into one convenient location. You sign into your accounts and there is all the content available, no muss, no fuss. The only small glitches were a game or two that either didn't download or took a long time. I'd also like to see more free games, although the main purpose of this is not games, but media, they are a nice diversion. We are not big gamers in our house,(we own zero game systems) so  this is a way to at least have some options. The remote is perfectly sized and not hard to use, a big plus. All in all a winner!!", "verified": true, "helpfulness": "0/0", "author": "MKersey"}, {"rating": 4.0, "review": "I'm having difficulty with its wifi capability.  I've used a Roku and iPod touch while the router was on a floor above the television.  The Fire Stick periodically rebuffered, which was annoying! Otherwise, it's pretty simple to use and very portable.  Amazon needs to improve its wifi ability.", "verified": true, "helpfulness": "0/0", "author": "Philip A. Deluccia \"pdrph\""}, {"rating": 5.0, "review": "I'm very pleased with my Amazon Fire TV Stick. It is a great alternative for those who do not have a smart TV, and it is low cost. In a nutshell it allows you to stream content such as Netflix, VEVO videos, and much more. Simply plug it into your Tv's HMI port and access your internet connection.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 1.0, "review": "This remote is a piece of junk.  It is almost impossible to open.  I have ordered the voice one and hope it is an improvement.  Don't know how I'll like the Firestick  because I'm unable to use it until I get another remote and can register the product.", "verified": true, "helpfulness": "1/3", "author": "DeLois Fulfer"}, {"rating": 5.0, "review": "Very easy to set up. Easy to use. Set up Watch ESPN and Cloud photos/Videos in minutes.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Martin"}, {"rating": 5.0, "review": "Awesome for my tv without cable hooked up to it. Thinking of buying more and dropping cable all together.", "verified": true, "helpfulness": "0/0", "author": "Fan12HAWKS"}]