[{"rating": 4.0, "review": "Works well but has one quirk (actually, it's a BOSE quirk).  It doesn't always play nice with the remote for my BOSE Lifestyle V30 system.  The BOSE tech support contact told me that the BOSE remote uses RF not IR technology and it's getting WiFi interference from the stick.  BOSE is sending me a free remote antenna to rectify the issue.  In the meantime, I unplug the FireStick , use the remote and then plug in the stick.", "verified": true, "helpfulness": "0/0", "author": "RP"}, {"rating": 5.0, "review": "Brought new life and apps to an older smart t.v..... Now I can get all my prime videos without a tablet or computer!", "verified": true, "helpfulness": "0/0", "author": "A. Tutino \"TT\""}, {"rating": 5.0, "review": "I wasn't quite sure what to expect with the Fire TV Stick since I already have a Google Chromecast.  However, I was very pleasantly surprised when I installed it.  The process was relatively easy, although the instructions could have been a tad more explicit, especially about connecting to the Wi-Fi (it took me a couple of tries before I realized I had to highlight the connection first - my bad).  Anyway, its very easy to use, has worked flawlessly so far and, being a Prime member, I love the video selection.", "verified": true, "helpfulness": "0/0", "author": "John J. Kerkowski Jr."}, {"rating": 1.0, "review": "NO it did not meet expectations!!!  It connects to wifi but then claims no connection.  The connection is rated \"very good\" but I can't log on to my Netfix.  Useless so far!!!!", "verified": true, "helpfulness": "0/1", "author": "J. Hayden"}, {"rating": 4.0, "review": "Performance is good. Would be good to get features supporting Airplay as well as a browser", "verified": true, "helpfulness": "0/0", "author": "Ganesh venkatachalam"}, {"rating": 5.0, "review": "Great device if you have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "LLOYD KRUMM"}, {"rating": 5.0, "review": "Amazing product and convenient to set-up & use. This device and service are my primary  source of movie content now...KPS", "verified": true, "helpfulness": "0/0", "author": "KPS"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "latbat"}, {"rating": 5.0, "review": "Very easy to Set up and Great user experience!", "verified": true, "helpfulness": "0/0", "author": "John Clark"}, {"rating": 5.0, "review": "Was pleasantly surprised - it met all expectations as advertised.  It's a great extension of the Kindle my wife and I currently use daily.  We are still experimenting with it, but are extremely pleased.  Thank you for a great product.", "verified": true, "helpfulness": "0/0", "author": "MSig \"Rider\""}]