[{"rating": 5.0, "review": "great price, great features, i have the box and the stick and love both but if your'e budget is tight you have to go for the stick", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I would give it five stars but the connection always seems to fail. I enjoy all the features it has but the bad connection is a disappointment hopefully this would get fixed .", "verified": true, "helpfulness": "0/0", "author": "sandra"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Felipe"}, {"rating": 5.0, "review": "love it easy to install works great", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "I gave this to my teenage son as a gift and he and his brother love it.  They said they would give it 6 stars if they could.  We have DISH as well as access to Netflix and Hulu.  We have been able to avoid putting extra satellite receivers in the house because of the Amazon Fire Stick.  One of my sons is a senior in high school and is looking forward to taking it to college.  Great little device, easy to use.", "verified": true, "helpfulness": "0/0", "author": "scoutinghokie"}, {"rating": 5.0, "review": "Fantastic!  Must have for kids!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The kids love it, so users friendly", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to load and easy to surf channels. Waiting for your next sale.", "verified": true, "helpfulness": "0/0", "author": "Doug H"}, {"rating": 5.0, "review": "It's great for my grandkids", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to set up, but it gets confusing distinguishing between the tv and firestick and which controls to use.  Took a while to figure out how  to search and find stuff.  Oh, and I thought that having Prime gave you access to all movies, but you have to rent them like any other service.  Other than that, nice remote and great idea for  alternate TV", "verified": true, "helpfulness": "0/0", "author": "Susishoot \"susishoot\""}]