[{"rating": 5.0, "review": "Better than chrome, with more to offer and faster.", "verified": true, "helpfulness": "0/0", "author": "Brig5150"}, {"rating": 4.0, "review": "the stick gets hot and then stops working; cool it down and it is back working.", "verified": true, "helpfulness": "0/0", "author": "Katherine Krouch"}, {"rating": 4.0, "review": "I like the Fire TV Stick so far I will update in a few more weeks as I just got mines a few weeks ago", "verified": true, "helpfulness": "0/0", "author": "NDM"}, {"rating": 1.0, "review": "Netfix never loaded-constant server error, even when Netflix loads without any problems on Apple TV and Roku.  Hulu plus loads, but does not play.  Very disappointed.  Thumbs down! Would not recommend this product.  Requires too much troubleshooting to get the sound to play", "verified": true, "helpfulness": "1/2", "author": "Charle"}, {"rating": 5.0, "review": "Best deal ever. We are Prime members so we were able to preorder them before they were released for $20...so easy to use, my 4 and 5 yr old can find their own shows. I wish I would have gotten one for every tv we have!", "verified": true, "helpfulness": "0/0", "author": "amplutz"}, {"rating": 5.0, "review": "lOVE IT... AND THE DEAL I GOT ON THE DEAL OF THE DAY.  IT WAS WORTH THE WAIT!", "verified": true, "helpfulness": "0/0", "author": "Torres \"DT\""}, {"rating": 2.0, "review": "I am going to be honest, I really want to like this thing but it just feels like Amazon's attempt to get into your living room to nickle and dime you. I snapped one up at the $20 intro price with the hopes to either use it for it's intended purpose or to perhaps hack it and install Android on it. Unfortunately it turns out that Amazon has a security measure to physically burn a microfuse if the user attempts to hack it, rendering the unit 100% useless.", "verified": true, "helpfulness": "1/1", "author": "Thatoneguy"}, {"rating": 5.0, "review": "Very easy to use. Pass-thru HDMI port for the CD player would be nice but I leave this plugged in since I don't watch that many DVDs anymore.", "verified": true, "helpfulness": "0/0", "author": "Nelson Estes"}, {"rating": 5.0, "review": "For the price (got it for 19 dollars) it's perfect. I have an apple tv, and the fire stick may be slower, but it does the job well. No complaints here.", "verified": true, "helpfulness": "0/0", "author": "Tony Pham"}, {"rating": 2.0, "review": "Technology is great.  Movies are too expensive.  Why spend $10 on a movie when a full month of NETFLIX is less?", "verified": true, "helpfulness": "2/4", "author": "Bill Coffrin"}]