[{"rating": 5.0, "review": "Love it so far!  Trying to find more Christian movies and programs though.", "verified": true, "helpfulness": "0/0", "author": "Anne Johnson"}, {"rating": 5.0, "review": "I've only had it a couple of weeks but so far it's everything I need it for. I purchased it because I canceled my dish satellite contract and started using Sling TV instead to save some money. The fire stick was the best option for me to make Sling TV work.", "verified": true, "helpfulness": "0/0", "author": "Jordan Dean"}, {"rating": 5.0, "review": "It's pretty darn cool. In my opinion as a business traveler the ability to connect to Wifi networks that have a web-based authentication page, i.e. most hotels, is a key differentiating feature from Chromecast. Netflix and Amazon instant video work great. One caveat, this isn't the fault of the device, but your ability to use HBO Go or similar apps depends on the good will of your cable company. Comcast/Xfinity currently doesn't support HBO Go on Fire TV, to which I say \"Boo Comcast!\". Again, not the fault of the device but if support for HBO Go (or anything else that you will have to authenticate with your cable provider), then check first to see if your cable company supports Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome. Makes watching Prime easy.", "verified": true, "helpfulness": "0/0", "author": "Jo Mo"}, {"rating": 5.0, "review": "Love it! It was so easy to figure out and have been very happy with the remote.", "verified": true, "helpfulness": "0/0", "author": "E. Ruthstrom"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Homer F Cummings"}, {"rating": 5.0, "review": "Used it twice it Hampton Inn hotels and works great for Amazon Video and Netflix, now that web browser logon is available.  Great for traveling.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "The Fire stick is everything I wanted an more. I'm so happy with it!", "verified": true, "helpfulness": "0/0", "author": "AR"}, {"rating": 1.0, "review": "It keeps buffering", "verified": true, "helpfulness": "0/0", "author": "Gary Johnson"}, {"rating": 5.0, "review": "Worked as advertised...good stuff.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]