[{"rating": 5.0, "review": "I really am enjoying the Fire TV stick. it's fairly responsive. Very little if any buffering. The only downside is the not so well thought out power cord situation..", "verified": true, "helpfulness": "0/0", "author": "Witt Mason"}, {"rating": 5.0, "review": "Easy to set up. Still exploring", "verified": true, "helpfulness": "0/0", "author": "Ragu Raghupathi"}, {"rating": 5.0, "review": "I love it!  Better than Roku!", "verified": true, "helpfulness": "0/0", "author": "Keith R Dobbin"}, {"rating": 5.0, "review": "So far, so good. We've only had it installed about a week. The installation and setup were super easy and the operation of the program is unbelievably simple. We love it so far!!", "verified": true, "helpfulness": "0/0", "author": "Della Louque"}, {"rating": 5.0, "review": "I love it. I own a boxee, apple tv, and this does everything I need it to. I mainly use this for watching Netflix or Amazon Prime streaming video, and it works great. Remote is slightly larger, and I think better than the boxee or apple tv remotes. Setup and navigation is a breeze. Note, the Fire TV Stick is not powered by the TV's HDMI slot -- it needs to be plugged in.", "verified": true, "helpfulness": "0/0", "author": "Reggie Hammond"}, {"rating": 5.0, "review": "I have used every streamer.Western Digital TV Live, Roku, Chromecast, none come close to the FireTV stick.  It runs XBMC flawlessly, so playing movies from my NAS is a breeze.  The remote is very responsive. The mobile app is a must if you want to use the voice feature like the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Tarishma Bruster"}, {"rating": 5.0, "review": "I love using this stick to access the video and prime content that I can access on my kindles.  I have an older kindle and this keeps me from having to use the micro HD cable to hook my kindle to the TV.  I also have newer HDX kindles that allow you to \"fling\" what is playing on the kindle to the TV IF the TV has that capability, which mine do not.  However, with this stick the kindle simply asks me which \"Fire TV\" I would like to \"fling\" it to.  Once \"flung\" the kindle is free for use.  I have a Fire TV box and two of these Fire TV sticks.  Honestly, I can find no differences at all, except the remote that comes with the stick does not have the optional \"voice search\" that the remote for the Fire TV box has.  However, if you need that, you can download an app to your smartphone that is a \"remote control\" for these devices and it includes the voice search capability.  I should mention that I am not sure if these sticks support the game controller that the Fire TV box does.", "verified": true, "helpfulness": "0/0", "author": "ShellyP"}, {"rating": 5.0, "review": "should have purchased 2.", "verified": true, "helpfulness": "0/0", "author": "Frichard"}, {"rating": 4.0, "review": "The fire stick meets my expectations and some.  I'm happy with this product.  Since it is brand new it does seem to have some bugs, but still better than the google chrome AST.", "verified": true, "helpfulness": "0/0", "author": "Neil Patel"}, {"rating": 4.0, "review": "Very easy to set up and get started.  Very intuitive to use.  I have not had any problems so far.  Very happy.", "verified": true, "helpfulness": "0/0", "author": "s walcott"}]