[{"rating": 5.0, "review": "I love it now I can actually see all my german movies from u tube on my TV love it love it", "verified": true, "helpfulness": "0/0", "author": "Tanja Sieking"}, {"rating": 5.0, "review": "I love the product! It was easy to install and within 10 minutes, I was surfing through Amazon Prime Movies & TV. Setup was a breeze! Once the Fire Stick found our network on the router (have to enter your password), a little cartoon guy comes on to show you the features of the Fire Stick. Picture is excellent. For the price it is a great deal. I would highly recommend the Fire Stick. We have never had cable because of the cost but now have multiple shows, movies, tv, concerts and documentary's to choose from. It already knew I was an Amazon Prime Member and we watched Downton Abbey season 2 with no problems. VERRY HAPPY", "verified": true, "helpfulness": "0/0", "author": "Azure Pathways \"HJR\""}, {"rating": 5.0, "review": "Love the fire stick,", "verified": true, "helpfulness": "0/0", "author": "kevo rinehart"}, {"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Geoffery L. Gunn"}, {"rating": 4.0, "review": "It is a great item, less used by me because of multiple media sources", "verified": true, "helpfulness": "0/0", "author": "Clifton A. Wohlgemuth"}, {"rating": 2.0, "review": "Waste of money. It never stays connected to the wifi for more than an hour or two. Constantly unplugging it. I give up. Nothing is wrong with my wifi, no other devices have problems. The firestick is literally right beside the router.  Ugh.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am very please with the Fire Stick.  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Bruce Hoff"}, {"rating": 5.0, "review": "I love the way it connects so fast.  It does everything. You said thanks a lot", "verified": true, "helpfulness": "0/0", "author": "Doris"}, {"rating": 2.0, "review": "Out of the box it was fantastic. I don't like having to plug it into a wall outlet, but I've moved beyond that. After a couple of weeks, I started having playback issues. I moved the device to all of my TVs, and at different distances from my wireless access point. I have 3 network connections, one being a 5 GHz connection, and I cannot get a consistent signal from any of them. It's really day to day whether or not it's going to work properly. I have a Roku 2 and Apple TV that work fine in all the same locations. I think the issue is poor performing wireless connection in the Fire TV Stick. Overall I do like the user interface better than the competitors, but I would suggest spending the money on the box version rather than the stick version. I've heard similar issues with Roku's streaming stick, so I wouldn't be afraid of the Fire TV box.", "verified": true, "helpfulness": "0/0", "author": "R. Christie"}, {"rating": 2.0, "review": "Not enough free movies. Also, available movies to rent are available to me on demand with FIOS at the same cost. Of course there are other things available here that I have not yet investigated the might change my emediate evaluation of this purchase.", "verified": true, "helpfulness": "0/0", "author": "Edd Roberts"}]