[{"rating": 5.0, "review": "Wish I would have bought these before I wasted money buying the chrome casts. I bought 2 for my kids rooms; same price range as the chrome casts that were not compatible with my kids chromo tablets. The fact it comes with its own remote and we don't have to rely on compatibility with phones and tablets (even though we have that option) was a huge bonus. I have an Apple TV in my bedroom and I'm kind of thinking I may want one of these for my room. All the apps we want plus since I am a prime member all the tvs and movies on there and easy access to the digital movies and music I've bought on Amazon. We all love it and are very happy with this purchase. It's easy enough for my 10 and 6 year old to navigate by themselves and you can enable the parental controls with ease. Plus they will have the option of games soon and have a game controller for it; I will probably buy that with the money I get from selling my chrome casts on Craigslist. Set up took minutes and with free two day shipping we were up and streaming. I have blast! Internet with xfinity and there is no lag or buffering even when everyone in the house is online at the same time. I would without a doubt recommend this product to others.", "verified": true, "helpfulness": "0/0", "author": "C. Paul \"- Tina\""}, {"rating": 5.0, "review": "I bought this at launch so I got in on the $19 deal.  I bought 2 and couldn't be more happy with them.  I have a Sony Google tv and a chrome cast and this device gets the most use in my house.  Quick simple and easy we love it.  We run into some issues with on app Plex where for whatever reason some things play better on the chrome cast or subtitles are out of sync but this could certainly be an app issue.", "verified": true, "helpfulness": "0/0", "author": "Shaun"}, {"rating": 5.0, "review": "We have had the stick for a few weeks now. It works so, so well for our needs. We mainly needed something to stream shows for the kids upstairs and the box version just seemed like too much (we don't do gaming, at least not on the upstairs TV). What we got with the stick was more than we expected! The stick has intuitive and easy search options (which the app on our bluray downstairs doesn't have), you can stream music from prime, and there are a million apps on it (and some games you can play from the stick). We use the music every day with the kids for bedtime, we stream from Amazon and Netflix, and my husband can stream the WWE app there too. We are VERY pleased with the value offered here. Another great Amazon device!", "verified": true, "helpfulness": "0/0", "author": "S. J. Bice \"Mrs.Bice\""}, {"rating": 4.0, "review": "For someone looking for just the things offered through streaming this is pretty good.  Very easy to navigate and I had no problem plugging and playing with little set up effort. I hope people who purchase it understand that programming is not usually free.  You need to have Amazon Prime for some of the older things and to set up a watch list as well as Netflix or Hulu for some of the newer things.  Buying a show- episode by episode for 1.99 to 2.99 each- on Prime is ok for those who have a limited list of regular programs but for those who watch several in each season it can get costly. That applies to many past seasons as well as movies. I keep Prime for the shipping not the access to the shows.  But this is not a review of Amazon Prime.As a recent cable cutter, I use this as a complement to an indoor digital antenna and OTV Roamio from TIVO.  At 14.99 a month to TIVO I can set up and watch all of the ABC, NBC, CBS, PBS seasons (if you can get those in your area via the antenna.) on one TV, and streaming video through this unit that include Amazon Prime, Netflix, Hulu, etc.  I then use this Fire TV stick for the streaming video on my second TV.  Chrome and Roku can do the same thing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Doesn't work", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Fire Stick is one of the best purchases I have made in while. Very easy to use, streams well, and bonus, if you have little kids like me who sometimes lose a remote, you can easily download an app that allows you to use your iTouch or whatever as a remote. I also think the price makes it well worth it.", "verified": true, "helpfulness": "0/0", "author": "Susan McCord"}, {"rating": 5.0, "review": "This is great", "verified": true, "helpfulness": "0/0", "author": "Ruth Ann Cranford"}, {"rating": 5.0, "review": "It is everything I hoped it would be", "verified": true, "helpfulness": "0/0", "author": "Mae James"}, {"rating": 5.0, "review": "Works great! sometimes I have to unplug it to get it to turn on, but well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Albert A."}, {"rating": 5.0, "review": "Since I don't watch a lot of tv, this is the perfect streamer.  I enjoy having my favorite shows at my fingertips.", "verified": true, "helpfulness": "0/0", "author": "JoMildred"}]