[{"rating": 5.0, "review": "Easy to use! Got here fast!", "verified": true, "helpfulness": "0/1", "author": "kate"}, {"rating": 4.0, "review": "It's probably one of the best purchases I've made from Amazon.com.  My only gripe/concern is that sometimes (and it only happens when starting a movie) stutters/slowdown at beginning of movie.  Other than that it's a great item.", "verified": true, "helpfulness": "0/1", "author": "Chance \"chance\""}, {"rating": 5.0, "review": "Great way to watch tv and movies.", "verified": true, "helpfulness": "0/1", "author": "FSamuelu"}, {"rating": 5.0, "review": "Love my fire stick. I was afraid that WiFi vs hardwire would have a lot of lag, but this stream is so smooth. Love all the viewing options!", "verified": true, "helpfulness": "0/1", "author": "Antonio Alvarez \"Alfalfas\""}, {"rating": 5.0, "review": "I got the fire TV stick as a gift and I(we) really love it.  Have used it to watch Prime Movies, You tube videos and also  Picture albums I uploaded.It's much better than my old Roku.  Am surprised by how much we have used it since receiving it.", "verified": true, "helpfulness": "0/1", "author": "H. Meeks"}, {"rating": 2.0, "review": "This thing is constantly buffering.  I got it for a song on the Black Friday deals, it really does not work well. Despite the updates, resets, unpluggings, etc.  can't figure it out, not just the Amazon content, Netflix too.  My roku and xboxone, much better.  You'd think with the millions sold they'd have mastered how to stream with a supposed 100mb Comcast xfinity internet pipe.  Guess not.", "verified": true, "helpfulness": "1/2", "author": "fastrailer \"notagenre\""}, {"rating": 5.0, "review": "Great device, easy set up!! It has very clear HD image.  Great Purchase", "verified": true, "helpfulness": "0/1", "author": "Margarita Colunga"}, {"rating": 5.0, "review": "It's good", "verified": true, "helpfulness": "0/1", "author": "flylady"}, {"rating": 4.0, "review": "It's great when it works.  However, it has a lot of trouble connecting.  It's not my Internet.  I have a smart tv and it connects fine when the fire stick has lost connection.  I would rather use this for Amazon prime because the menu is more user friendly than my smart tv.", "verified": true, "helpfulness": "0/1", "author": "Melissa Dean"}, {"rating": 5.0, "review": "The Fire Stick has weaned my family from cable television. It has saved us money and  increased our family time because we watch television together", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]