[{"rating": 4.0, "review": "I love it for watching movies, but I can't leave it plugged in, because it makes my TV zip off, like there is a power surge.  It doesn't last much longer than a snap of the fingers, but very irritating when watching TV", "verified": true, "helpfulness": "0/0", "author": "luvs2read"}, {"rating": 1.0, "review": "If you're getting this to play movies in a hotel, for get it.  I've never been able to connect to my hotel network - period.  The device was a waste of money.  By-the-way, it won't connect to my Kindle fire either.  It seems that I need to go to the Home to do that, but the device won't go home because it can't connect to the internet.  What a waste of time and money!!!!  The device is worthless for the purpose for which it is intended, so now I'm watching my movies on a 7\" screen.  I'd give it a 0 rating if I could!", "verified": true, "helpfulness": "1/1", "author": "William J. Zimmerman"}, {"rating": 4.0, "review": "I like it, easy to use", "verified": true, "helpfulness": "0/0", "author": "davinsson nunjar"}, {"rating": 5.0, "review": "As good as advertised.", "verified": true, "helpfulness": "0/0", "author": "David Galvan"}, {"rating": 4.0, "review": "Turn any (dump) TV into a smart TV for $39.", "verified": true, "helpfulness": "0/0", "author": "nnnnn"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Regina maria aguayo"}, {"rating": 4.0, "review": "Works well.Good when traveling if you stay at a place with wifi and a HD TV.The bad: would like to have an app that works with my IPHONE so I don't have to worry about losing the remote. There are apps w other non-apple phones.", "verified": true, "helpfulness": "0/0", "author": "Stormy"}, {"rating": 5.0, "review": "Easy to set up and runs smooth. Great purchase!!", "verified": true, "helpfulness": "0/0", "author": "Laura Gonzalez"}, {"rating": 5.0, "review": "I have an apple tv and actually use this much more now since most of the shoes and movies I watch are on amazon prime. I love it!", "verified": true, "helpfulness": "0/0", "author": "Mayli"}, {"rating": 3.0, "review": "Struggled to work with Comcast wifi.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Schultz"}]