[{"rating": 5.0, "review": "We Love the fire stick! We watch it at home and my husband travels so he is able to take it on the road to use in hotels as well. Very easy to operate! My 5 year old can use it better than I can!", "verified": true, "helpfulness": "0/0", "author": "Lacie"}, {"rating": 5.0, "review": "Great product; really adds to our viewing, and listening options.", "verified": true, "helpfulness": "0/0", "author": "Jon B."}, {"rating": 4.0, "review": "Very nice", "verified": true, "helpfulness": "0/0", "author": "Ignacio"}, {"rating": 5.0, "review": "I give it 5 stars RJ", "verified": true, "helpfulness": "0/0", "author": "Rodney Jinks"}, {"rating": 5.0, "review": "Ver y good", "verified": true, "helpfulness": "0/0", "author": "Dianna Cruz"}, {"rating": 5.0, "review": "Works great really like CC option", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "My family loved the first one so much I had to buy another one.  It's used all the time, everyone really enjoys using it.", "verified": true, "helpfulness": "0/0", "author": "Magoo"}, {"rating": 5.0, "review": "I plan to use it for travel when staying places with wifi.", "verified": true, "helpfulness": "0/0", "author": "Susan Starr \"Cat lover\""}, {"rating": 3.0, "review": "For my uses it's ok. Thankfully it will connect to my travel router when the travel router doesn't get blocked at the hotel. Otherwise, the stick will see the hotel wifi and connects but then says there is a connection problem and won't bring up the hotel webpage so i can log in with it. I don't need it at home. I bought it to use when I travel. Some of the hotels I stay in for work have only analog signals for 'fancy' large screen tv. Not pleasant to watch all that static. When it works, it's nice. If I could get it to login to the hotel wifi it would easily be a 4 star device for me.Would I buy a second one? Right now no.", "verified": true, "helpfulness": "0/0", "author": "N. Chaudhari"}, {"rating": 5.0, "review": "works perfectly as described", "verified": true, "helpfulness": "0/0", "author": "Terry"}]