[{"rating": 5.0, "review": "It's nice. It just overheats when plugged in too long", "verified": true, "helpfulness": "0/0", "author": "James J."}, {"rating": 5.0, "review": "The fire TV stick works great! Easy to set up.  I bought one for myself and two as a gift.  No issues yet, its been the best thing that I have bought. Before I had to set up laptop to TV to watch Amazon prime or Netflix.  Now all I have to do is use the Fire stick remote and I can watch on TV instantly! Love it !", "verified": true, "helpfulness": "0/0", "author": "Melissa R Johnson"}, {"rating": 4.0, "review": "the first is the good: extremely easy to set-up and operational in literally 5-10minutes. the streaming is very fast and rarely will you notice any lag time during a show perhaps 1 sec. there is also a lot of content available and it links to things like your netflix and hulu accounts, it is making cable tv past basic local stations an obsolete waste of moneythe not as good: it is a little hard to access all the content and when you do for example movies, its hard to know which movies will cost you extra and how much they seem mixed together. perhaps that is because i am not used to using the system yet. another issue is movie loads quickly but if you want to skip the introductions you have to wait for it to load anyway so to jump a head 10 sec might take 3 second wait. not big deal and could have more to do with my internet speed than the product but it gets annoying none the lessanother downside there is so much available you can waist time just watching movies and series that you never needed to see before. too much time on our hands and now something to do with it I suppose.overall take: a really great product that will change peoples approach to watching TV and movies", "verified": true, "helpfulness": "0/0", "author": "b boy \"doc b\""}, {"rating": 5.0, "review": "The Fire TV Stick works perfectly for watching Netflix shows and movies.  We do not have a newer TV.  I hooked this device up to a second HDMI port.  I am not overly technically adept.  I managed to get this going relatively easily with no calls to support.  It has been a good purchase for me. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jan"}, {"rating": 5.0, "review": "This was given to me as a gift and I absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "Love the added features and screen layout compared to running Prime direct from TV.", "verified": true, "helpfulness": "0/0", "author": "Randy W."}, {"rating": 5.0, "review": "It is super easy to use and makes looking up movies, photos and music fun.  Great buy!!", "verified": true, "helpfulness": "0/0", "author": "Newday"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Suzanne Lanzilla"}, {"rating": 5.0, "review": "This is great for movies and more! With PRIME movies it gives me many more options than the others.", "verified": true, "helpfulness": "0/0", "author": "Discreet Shopper"}, {"rating": 5.0, "review": "We really are enjoying this item!!! I recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "sharron kaufhold"}]