[{"rating": 4.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "maria l orozco"}, {"rating": 5.0, "review": "Good streaming device.", "verified": true, "helpfulness": "0/0", "author": "Kumaran Subramoniam"}, {"rating": 3.0, "review": "Pretty nice features, reasonably fast.  Can install XBMC, which is great.  Easy to use, but may require some modifications.  Remote isn't compatible with most, but works with Harmony hub remotes(set up as a watch tv activity). Major issue- flickering green screen after 15 minutes with plasma.  Can be reset by disabling pixel orbiter, but it's a bug.", "verified": true, "helpfulness": "0/0", "author": "Stephen Charles Holme"}, {"rating": 3.0, "review": "Would be higher if had more Android apps. available and phone/tablet mirror mode.", "verified": true, "helpfulness": "0/0", "author": "jonathan russell"}, {"rating": 5.0, "review": "Very happy!", "verified": true, "helpfulness": "0/0", "author": "TERESA LEWIS"}, {"rating": 5.0, "review": "Easy to use - Installs very easy  - works great - instant smart TV for under $30.00", "verified": true, "helpfulness": "0/0", "author": "OCDaley"}, {"rating": 1.0, "review": "Sloooooowwwwwwwww. Buuuuuuffffffeeeeerrrrrrrrr all the time. I have a Roku 3 and it is 10 times better/faster than Fire TV Stick. In fact, I have the original Roku (Not the Roku 1, but the very first Roku ever made) and was hoping this Stick would replace it, but I just hooked the original Roku back up because it is 3 times faster than Fire TV Stick. I only paid $19 for the Stick and am still returning it, so that tells you how horrible it really is.", "verified": true, "helpfulness": "3/4", "author": "Honest & Real"}, {"rating": 5.0, "review": "This device is worth the money.  I use it for a television I mount in my kitchen and I love the great cooking app that lets me watch chefs making dishes.  Great for TVs or Monitors in area's that do not have the cable box in close proximity.", "verified": true, "helpfulness": "0/0", "author": "Scott Randrup"}, {"rating": 2.0, "review": "Lets just say up front that I am very disappointed that my Fire TV Stick arrived nearly a week After I was able to buy on in the store, when I ordered it only a day after it was announced.Over all, I think this is a very nice steaming stick for the price.  More versatile than a Chromecast, and much faster and more more powerful than a Roku stick, at a better price.  Performance is not up to par with a full Fire TV, Roku, Apple TV, Nexus Player, or other $100 streaming device, but this is just over 1/3 the price, with nearly the performance in streaming and navigation, which is very impressive.  The increased processing power, RAM, and memory are all very helpful in placing the performance of the Fire TV stick much closer to the likes of the Fire TV than that of the Roku stick or a Chromecast.On the Con side is the annoying instance of the device to complain it it is not plugged into the wall wart it came with (it cites that not enough power will be supplied with other chargers).  On close inspection of the supplied charger, it provides 5V at 1.0A, which is the normal output of the majority of USB wall chargers. The wall charger I have ( the Anker 40W 5-Port High Speed Desktop USB Charger with PowerIQ Technology) is able to output up to 2.4 amps per port, and yet the Fire TV continues to nag that it needs the correct wall charger to get enough power.  If this is not solved with some sort of firmware or software update, I will be returning the device, as this is inexcusable.", "verified": true, "helpfulness": "1/2", "author": "HI Soldier"}, {"rating": 5.0, "review": "When the chromecast came out I was a huge supporter of it. I loved not having to lose any precious space on my entertainment system. But quickly I got super tired of having to use my phone for every single thing, and soon I had switched back to watching content on my ps4 or Apple TV. The Fire Stick cures all those woes. It's small and unobtrusive. I love the remote. It feels more like an actual set top box than even my Apple tv does. I love being able to access prime content in an instant. You really get what you pay for in terms of content with it.", "verified": true, "helpfulness": "0/0", "author": "Brandon Farrington"}]