[{"rating": 2.0, "review": "I like the features of the Fire Stick, but I've had constant issues with connectivity. I have many other devices (eg cell phones, tablets, game systems) that never lose connectivity to the internet. However, the Fire Stick frequently has difficulty with the connection. If this is improved, the Fire Stick will be an excellent device due to the large number of apps available for download, the included remote control, and the Amazon prime content. In fact, you could get rid of cable if you also have Netflix and Hulu plus.", "verified": true, "helpfulness": "0/0", "author": "michael629"}, {"rating": 4.0, "review": "So, I have a Roku 3, an older Roku, Chromecast and Fire TV Stick in my home. In order of preference, the devices are Roku 3, Fire TV Stick, older generation Roku, Chromecast. Here is why the Fire TV Stick ranks second. I've had the Stick for around a month now.Pros:Modern version of Netflix, complete with profiles.Best Prime Instant Video browsing experience.Fully functional as a stand alone device.Allows reception of streaming signals from devices, though haven't used that functionality yet. It shows up along with ol' Chromy Dubois (my Chromecast) and Roku boxes from YouTube, etc.Cons:No Vudu, MGo, Play Movies, etc. By default this means I won't be using this in the main rooms of my home. We have a lot of digital movies which won't show up in the lone UV platform for Fire TV (Flixster). By choice of content provider, Fire is the worst of the platforms, even though it will be fine for most consumers.Streaming issues. Netflix is rock solid, Hulu and Prime Instant Video are extremely touchy. The Fire TV Stick is 10 feet from my router and is 5 feet closer to it than my computer in the same room. The Roku 3 is an additional 15 feet away through an additional wall, it can be playing videos from Amazon Prime Instant Video or Hulu with no issues, as can my computer. This is my biggest gripe with the unit. I have reset the cable modem and router and that has not helped the issue.Sometimes the signal from the remote to the Stick gets \"stuck\" for a second, pressing an arrow 3 or 4 times instead of once.Initial updates to software was annoying, especially reentering passwords. I think I spent about a half hour as it downloaded updates.Neither a pro or con:Allows app installation. So far haven't really needed to do so, installed a couple of things, but using the remote isn't ideal for most apps.Summary:If I had never had a Roku, I'd be blown away by the Fire TV Stick. I got it at the introductory price and for less than $20 it is a total steal, and I wholeheartedly recommend it over the Chromecast. If I need to buy another streaming TV device, it will likely be a Roku, I may pay $10 - $30 more for the box, but it is the better choice for me until Amazon fixes the buffering issues and let me access my content directly from the stick.", "verified": true, "helpfulness": "0/0", "author": "Matt Griffith"}, {"rating": 5.0, "review": "Wow..great product....connectivity is excellent, it is well though out..and easy to connect!", "verified": true, "helpfulness": "0/0", "author": "Keif"}, {"rating": 5.0, "review": "Awesome device with extras if you know what I mean ;-)", "verified": false, "helpfulness": "0/0", "author": "Fred carver"}, {"rating": 5.0, "review": "Very cool product... Works great!", "verified": true, "helpfulness": "0/0", "author": "ST Harris"}, {"rating": 3.0, "review": "one advantage of the PS4 is that you can use a PS Vita to stream a game while someone else uses the TV to watch live TV or do video streaming. Of course, any games running on the PS4 tend to use the entire CPU and GPU to do anything, so you can't actually stream video on a PS4 while the CPU is in use playing a game. The solution is a Fire TV stick, Chromecast, Roku Stick, or so-forth.Of the 3, Chromecast requires a phone or tablet, and doesn't really support Amazon Instant Video. Roku is the most versatile, but the most expensive. The kicker for me was when Amazon offered the FireTV Stick at $19 for Prime customers. That got me to buy pre-order it.Installing the device was a cinch. Plug in the HDMI extender, plug in the Stick, plug in the power supply that's a micro-USB port, and you're done! The device supports Amazon Music, TuneIn, Pandora, and Spotify, as well as playing back Photos and Videos from Amazon's cloud. This is a very nice setup, with the biggest disappointment being that there's no support for DLNA, which is what I actually use at home. There are various apps that claim to support DLNA, but what really happens is that they're really apps for throwing content over from the phone to the stick, rather than a full-on DLNA client, so this doesn't quite make up for the PS4 not being as powerful a media server as the PS3.The UI is fast, and better yet, you can pair your phone via WiFi to the stick and not have to use the remote for text entry. Voice search even sort of mostly works. Playing an Amazon instant video is smooth and quick, though there's missing support for VUDU.For me, the biggest problem is that there's no separate sound output, so you can't get surround sound if you the output from the TV downgrades surround to stereo, which is what most non-Sony TVs do.All in all, the FireTV Stick is a better device than the Chromecast, but not nearly as good as the Roku Stick or standalone players. This is disappointing because from the specifications, the stick is a far more powerful device than any of the other sticks.All in all, at $19 (cheaper than any of the other sticks by far), it's worth while to have as a backup for the scenario I mentioned in the first paragraph above. At full price, I'd give this a pass.", "verified": true, "helpfulness": "0/0", "author": "Piaw Na"}, {"rating": 3.0, "review": "Very good for the price and the content but very messy interface.  Please fix the interface and follow what apple does.", "verified": true, "helpfulness": "0/0", "author": "Boston Patriot"}, {"rating": 2.0, "review": "Doesn't work very well. We bought this to be a portable option for streaming shows throughout the house.  Unfortunately, it keeps getting network errors where it says it's connected to Wi-Fi, but problems exist.  Our two year old Roku XD outperforms the Fire TV Stick in every room in the house.  To me it seems like Amazon is still figuring it out where Roku has been doing it for years.  Even though we got the Fire TV Stick for only $20, we are going to return it and get another Roku.We were mainly plugging the Fire TV Stick in the USB ports on the TVs.  If it supposedly works better to plug it into a wall then to me that defeats the purpose of having a stick vs. a box.", "verified": true, "helpfulness": "0/0", "author": "mommy pick"}, {"rating": 5.0, "review": "So easy to hook up! Hardest thing was trying to get the remote open to put the batteries in. We cancelled our subscriptions to all the pay movie channels since we rarely watched them. We purchased Prime so we can watch movies that we want to watch and TV series.  Even the movies to purchase are cheaper than what we would pay through our satellite dish provider. Will have to purchase one for the other tv only because we watch different shows. Love it!", "verified": true, "helpfulness": "0/0", "author": "Cathy Lipscomb"}, {"rating": 1.0, "review": "this might work better for others than it did for us. perhaps if we had more bandwidth or a better wireless router it woinkuld work as intended.however, i was surprised that this did not work as we already have a smart TV, meaning it is hooked up to the internet on its own. i got this when it was on special for $20, thinking it would be worth that if it made it a little easier to navigate amazon prime videos. we don't have cable, just a little smart TV for whatever the digital bunny ears pick up and then whatever we can watch for free included in our amazon prime, mostly for our three kids. so we didn't even need the fire tv stick to pick up the internet wirelessly, i just thought it would be worth twenty bucks if it was easier to navigate and access the stuff the kids watch for free through amazon prime.our smart TV connects wirelessly pretty good. there are some times it takes a moment or two to \"load\", sometimes a bit more, but generally it is just a slight annoyance or it works just fine. we don't have issues with buffering, generally, but every once in awhile we might. so i also thought the TV stick would have better connectivity, quicker connecting time, and get rid of the minor buffering time issues we have.unfortunately, this thing would **barely** connect to the internet, and by barely, I mean, that it took repositioning the stick with the tiny extender to even be able to connect AT ALL, but then that was not enough to stream even a cartoon, ever. and i want to add it took a few solid minutes for it struggle to even connect to the internet, if it would connect at all, and then another few minutes to try, unsuccessfully, to load a video.  we have high speed internet but nothing really crazy, not like google fiber optic internet. but we have a tiny house, the router is like 20 or 25 feet from the TV (it is through a wall in another room), but like i said, the smart TV on its own was able to  wirelessly connect to the internet with no major problems, so i thought this amazon tv stick would be better, but it is worse.so maybe for some people with very high speed internet or a better router, or whose TV is really close to the router, this will work. for us, it seemed like a waste, and i will return it.", "verified": true, "helpfulness": "0/0", "author": "EB MamaBear"}]