[{"rating": 2.0, "review": "It works OK, but it is missing a lot of features and is very clunky.  The UI is extremely ugly/boring and lags often.  Many of the apps are unusable unless you already pay for a subscription, and even if you do pay for it they don't work for certain carriers (I.E. Charter).  My sister has both Roku and Chromecast and they work great.  I would suggest getting either one.  Miracast seems to work OK with it and that is the only thing I used it for.  Ultimately I found my old PS3 to be much easier to use and have lots more apps to choose from.", "verified": true, "helpfulness": "0/0", "author": "Alex Reese"}, {"rating": 5.0, "review": "I am very happy that I purchased this item and I cannot wait to cancel cable.", "verified": true, "helpfulness": "0/0", "author": "Roudina"}, {"rating": 5.0, "review": "Easy, quick and cheap with Amazon Prime - good selection and fast response.", "verified": true, "helpfulness": "0/0", "author": "SCS"}, {"rating": 5.0, "review": "Easy to set up and fast downloads of movies.", "verified": true, "helpfulness": "0/0", "author": "Mariann Hayes"}, {"rating": 3.0, "review": "Not as good as the Roku 3 we have.  Not bad, though.", "verified": true, "helpfulness": "0/0", "author": "Matt T"}, {"rating": 5.0, "review": "We love it!  Super easy set-up and the quality is AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Rachel A"}, {"rating": 2.0, "review": "I am very disappointed.  There are a few good points to the stick.  However, the main reason I purchased this was to watch movies.  Not interested in games.  The first video I loaded was an episode of \"Vikings.\"  Within 2 minutes, the playback started pausing to buffer.  Eventually, I got a message saying my bandwidth was insufficient.  Huh?!  Checked my bandwidth -- over 100 mps, which should have been more than sufficient.  Shut off everything else that might be using up bandwidth, but it made no difference.  Rebooted stick (twice), still kept telling me I had insufficient bandwidth.  (And, yes I had the annoying power cord connected for \"best results.\")  Disconnected stick, connected Apple TV and tried streaming the same episode.  It played without a hitch.  Tried it on several other devices and had no \"bandwidth\" problem.  (All were HD -- same as Amazon Prime version.) If it's really a bandwidth problem, shouldn't other devices have trouble streaming the same media?  I could look around on the web and try some of the troubleshooting advice that's probably out there, but I've had my fill of tinkering with tech devices to get them to work and, at this point in my life, don't have time, patience, or energy to deal with it.  Would just like something to work the way it's supposed to right out of the box!  I'll probably give the stick away.  Wish I had not purchased it.", "verified": true, "helpfulness": "0/0", "author": "SDB"}, {"rating": 5.0, "review": "I love it /it's  like having a whole  new tv", "verified": true, "helpfulness": "0/0", "author": "Michael morris"}, {"rating": 5.0, "review": "super jazzed about having this, a no-brainer purchase to go with a kick-down old plasma screen from my brother. for years now i've been exclusively on streaming media like Netflix and TED Talks etc. so this just extends my current watch sources to my bedroom. the selection is great, i scanned through the selection of the apps i haven't heard of or used before and i was surprised at the availability for no subscription.a side not: each tv episode will usually buffer once during play, cannot say whether this is my WiFi connection or the speed of the device, but it is so minimal as to be inconsequential. also every app uses fast forward and reverse searching differently. it is not uniform for the device, but proprietary for each individual service. for example, Netflix and Amazon video operate slightly different from each other but each works the same as they did on my PS3 and my internet browser.", "verified": true, "helpfulness": "0/0", "author": "Justin Boyle"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Chris Miskowiec"}]