[{"rating": 4.0, "review": "Could use newer movies....", "verified": true, "helpfulness": "0/0", "author": "Martin Sampson"}, {"rating": 2.0, "review": "It works; however for every 10 minutes of viewing time, there are 3 minutes of commercials, and these commercials repeat themselves, time after time!  In watching an hour TV show, I definitely have memorized those commercials, word for word.  For an Amazon product, I was really disappointed!", "verified": true, "helpfulness": "0/1", "author": "A. Wolfer"}, {"rating": 1.0, "review": "Great idea, but pretty useless to me right now. The stick has problems connecting to ANY wifi network near me, except an ad hoc hotspot on my mobile phone. I see on the internet that many others are experiencing similar issues. I'll give it a week to see if Amazon can produce an update. If not, I'm sending it back. My suggestion is to AVOID this product for now until they work out the kinks.", "verified": true, "helpfulness": "0/0", "author": "Keith Bagley"}, {"rating": 2.0, "review": "I am having a lot of network connection dropouts.  Chromecast works fine, Roku stick works fine, Amazon Fire TV stick not so good on my network.  When I try to do an update, it just barely starts the download then jumps to an Update Error.Search for Amazon Fire TV Stick problems, and you will see that many many people are having this same trouble.  I do not recommend this product at all.  Beware!A really sloppy job for Amazon to release such a poor product; I'm sure they will fix it in a future update, but right now it is useless.", "verified": true, "helpfulness": "0/0", "author": "Anya"}, {"rating": 5.0, "review": "So very simple to set up, and so easy to stream all the free movies and television shows available through Amazon.  We don't have a Netflix or Hulu account, but it we did I'm sure it would be just as simple to access.  Totally addicted to streaming media now after being a skeptic for several years.Great price -- we love this item.", "verified": true, "helpfulness": "0/0", "author": "My2Cents"}, {"rating": 5.0, "review": "Work Great! Amazon Got It To Me Fast, When It Was Sold  Out Everywhere Else.", "verified": true, "helpfulness": "0/0", "author": "Shining*Star"}, {"rating": 5.0, "review": "So far so good.  We are just learning how to use our fire stick and have experience using another brand.  We are happy that Amazon has this new ability and we plan to get plenty of use out of it.  Someday we are looking forward to eliminating our cable provider.", "verified": true, "helpfulness": "0/0", "author": "musicgenes"}, {"rating": 4.0, "review": "Do you need cable hookup for the device to work, or Wi-Fi?", "verified": false, "helpfulness": "1/1", "author": "Rhonda T. Dominick \"Rhonda Dominick\""}, {"rating": 2.0, "review": "The product page is misleading this is NOT miracast certified.  It will mirror with some very specific devices, but not Miracast devices.  If this is not important to you, this is a great device!", "verified": true, "helpfulness": "0/0", "author": "Patrick Anderson \"Patrick\""}, {"rating": 3.0, "review": "Great functionality not enough free content or apps such as HBO Go", "verified": true, "helpfulness": "0/0", "author": "Janet Antonecchia"}]