[{"rating": 5.0, "review": "Love the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Christopher Erickson \"xxtoon\""}, {"rating": 1.0, "review": "I have not received the product.", "verified": true, "helpfulness": "0/1", "author": "elizabeth"}, {"rating": 5.0, "review": "Gave this to my mom for Mother's Day for her room and she loves it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For prime members this is a must have!  As long as you have a WIFI connections you can say GOODBYE to BORING CABLE and say HELLO to AMAZON PRIME PROGRAMMING.  I’ve been a prime member for a long time – between holidays and birthdays the shipping savings pay for the membership – so as Amazon has added services I’ve  been looking for ways to use them.  Originally I used Amazon Prime on Roku.  This worked reasonably well.  But when I wanted to add Amazon Prime’s music service on Roku it wouldn’t let me use any of the free services, just purchased music.  The Fire TV stick not only is simple to install, it lets me use ALL of the services.  So I can put on one of the streaming channels when I want music or I can put on shows or movies.  Another feature of the Fire TV stick I wasn’t aware of was how the apps are differently configured.  For Netflix fan who want to do a marathon of their favorite show they need only leave it on and it will roll from episode to episode.  Which is perfect if you like to have programs running while you are on a cooking tear.", "verified": true, "helpfulness": "0/0", "author": "Val"}, {"rating": 5.0, "review": "We absolutely love our fire TV stick. It has all the streaming account apps that we use and a lot of child show apps for my kids.", "verified": true, "helpfulness": "0/0", "author": "Lauren Dewalt"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've only had this a weekend and I love it. I've also converted 2 friends to the Fire TV Stick now; one from Chromecast and another from Apple TV. For an Amazon Prime member, the Fire Stick offers more options for entertainment than the other 2. It may not be on the same level as say the Roku, but it also isn't at the same price point. But, for me, with so much of the programming overlapping from the more expensive devices onto this, I didn't feel it was worth it and I already feel justified in my decision.I primarily use the Amazon Prime Instant Video, Hulu Plus and Netflix. Amazon Prime Instant Video and Netflix have been great, no buffering issues, lag or resolution problems. Hulu Plus has given application/communication problems a few times, but only when trying to start up the app and never twice in a row. My internet connection is via Bright House wifi, 15Mbps.", "verified": true, "helpfulness": "0/0", "author": "jwperry"}, {"rating": 1.0, "review": "Ordered when it was on sale for $19. I don't feel like it's worth it even at that price point. Feels very underpowered, the remote is weak and wifi connection isn't consistent. This thing is just slow slow slow. Most of the time it takes over 5 minutes to just get started to watch something. Lots of freezing, going home, restarting etc. The Roku stick is better. Roku's UI is better and their remote is better. Love Amazon but I'll probably be putting this thing out of its misery.", "verified": true, "helpfulness": "0/0", "author": "Matthew Levitt"}, {"rating": 5.0, "review": "love it  easy to use", "verified": true, "helpfulness": "0/0", "author": "isabell tierney"}, {"rating": 5.0, "review": "I love the firestick. Wherever I go, I can take television with me and apps as long as there is a good wifi connection. I use it everyday. I subscribe to Sling TV, Hulu Plus and Netflix. I did order one movie from Amazon Prime, but I've yet to find out the value of instant prime video. I already have access to HBO Go and it's awesome watching Game of Thrones without actually having a cable subscription. With Sling, I am able to catch the NBA playoffs, which lead to my ultimate cancellation of NBA League pass. League pass was $33.00 month, but most of the games were blacked out, especially my local teams. Now I pay $20.00 month for Sling, and $16.00 for Netflix and Hulu. So, technically, I spend $36.00 month for all the channels and movies I need. Oh, HBO Go is free through my brother. Just think, Netflix allows streaming of more than one device simultaneously, so why not split these bills with family??? Anyway, Firestick turns your tv into a smart TV, but if you're not an avid Amazon user, be aware that it is Amazon interface based.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]