[{"rating": 5.0, "review": "I pre-ordered the fire stick as the Amazon prime customer the first day it was offered.  I didn't know what to expect although I am a true and loyal to Apple products, I want an inexpensive way for the rest of the family to have access to different apps on the television as well as something that we could travel with.  Receive the package on time & it was securely wrapped and it was a five-minute installation process.  The kids grabbed the remote and went to town... Fast download speeds (we have Verizon FIOS Internet with 75/75 speeds on best router they have to sell!  Fire Stick TV is lighting fast! For $19 ea (if you ordered in the first two days for Amazon prime customers only) it an awesome deal and high-quality product! All my kids we be happy and definitely will push this products limits & use especially my son in Army, they travel lots! THANK U AMAZON! KUDOS!", "verified": true, "helpfulness": "1/2", "author": "Luvshellokitty2"}, {"rating": 1.0, "review": "Pros:  Connects to 2.4/5.0 ghz Wi-fi, streams prime videos reasonably wellCons:  Interface is awful--clunky and slow; PBS \"app\" is virtually useless--can't select items; power supply takes up two outlets due to a poor design, Fire TV Stick goes to \"sleep\" for no apparent reason, battery door on remote takes two men and a boy to open it, very limited numbers of selections of video sources--no HBO to Go for example.  On hold to Amazon customer service for an extended period, finally gave up.  Huge waste of time.Pro/Con: I only paid $20 for this cheap contraption which is better than wasting $40 on it.  Maybe Amazon will take it back.", "verified": true, "helpfulness": "5/17", "author": "Mike D."}, {"rating": 5.0, "review": "This review will be primarily about the Fire TV Stick and PLEX.We use media players in our house extensively. Within the past year we’ve migrated our libraries out of various DLNA compliant servers and services and placed our faith in Plex. I was worried that with the limited power of the Stick vs some of the larger players in the market that Plex wouldn’t be available or would be severely crippled; boy was I wrong!Let’s start by answering a question that I had myself: A PlexPass is not required to use Plex on the Fire TV Stick.We have several TV’s in the home that require a media player to play any shared content. We have primarily used WD TV’s and Google Chromecast devices. Neither of which really supported Plex in all its glory. The WD TV’s used the DLNA compliant side of Plex to play the files, but was missing all the pizazz that Plex brings to the home theatre experience. Chromecast does support casting of shows from within the Plex app for various tablets and other devices, but again, the home theatre experience was lacking. The app designed for use on the FireTV and FireTV Stick puts your entire media library at your fingertips with cover art, intro music, and full show information.The best part of the Stick is that it’s tiny and doesn’t require much to function.. it’s the perfect way to take your media library with you and experience the full home theatre experience from your hotel room or your in-laws.I like that the Fire TV Stick has applications on it that run independently of your other devices. It’s competition requires that you be able to connect to content via a separate device and then cast that onto the TV. That functionality is around on the Fire TV Stick as well, they call it Flinging. They haven’t yet mentioned if there will be the ability to fling a webpage to the TV, but I hope that functionality exists as some web video content is not available through traditional video means (YouTube, Vimeo, etc.)I'm interested to see if Amazon plans to integrate the FireTV and Stick with their new product Echo. That could lead to some very intuitive recommendations for shows that didn't generate from shows being watched via the FireTV or Stick.", "verified": true, "helpfulness": "13/17", "author": "Eric Harris"}, {"rating": 5.0, "review": "Just got it tonight.  Easy to set up and works with my modem that Chrome didn't recognize.  The choices are huge and I can get my own music and photos.  I LOVE IT!", "verified": true, "helpfulness": "0/1", "author": "R. Nelson \"Sumner31\""}, {"rating": 4.0, "review": "Received the Fire TV stick today, a few days early, thank you Amazon.This is a pretty good streaming stick, with a smooth user experience and a great selection of movies and music. I'll keep my review short and try my best to touch on the pros and areas that (in my opinion) need improvement.Setup:Setup was pretty easy, you just plugged it into a HDMI port, connect to your wireless router, download the phone app (not required), and you are on your way. I did get an update prior to being able to launch the app, which took about 15 minutes for the download, install, and a couple of reboots. No opinion on areas for improvement here, just a normal setup like any other streaming device.User Experience:The app is very smooth, you can tell Amazon wanted to make sure things were working well before launching. App categorization is also well done, you can easily choose between things like Prime Movies, games for your particular controls, and music. So far I would rather use the provided remote to toggle through the app compared to the phone app. The app responds to every click on the remote, but the phone app only registers about half the phone clicks/taps.The phone app works very similar to a laptop track/mouse pad, you use the track pad on the phone and it then registers on the app. The voice search on the phone app works perfectly at this point, I tested it dozens of times and each time it understood my request.An area for improvement on the user experience would be to allow a user to see the content on the phone that you want to play or select. This way if you are playing a movie, video, and or music, you don't have to be directly in front of the tv to see what you are browsing, you can just select it from your phone and have it play on the tv. Along with the first point, it would be nice to have a notification on your phones drop down bar for when you leave the app, which would allow you to easily pause the movie, as of now you have to launch the app again just to pause or continue the movie. Also, there should be some game categories for paid and free apps, instead of having to click on every game to determine if its a paid or free game.Conclusion:This is a very cool streaming stick with nicely built hardware and a smooth interface. I would recommend for any Amazon prime member, which could take advantage of the prime movies and prime music.I don't have any cons for this streaming stick as of now, I consider a con as something wrong with the hardware or software, like if they didn't include your purchased music/movies or if the app continually rebooted. Of course there are areas I would personally like to see improved, but all in all, i enjoy it very much.", "verified": true, "helpfulness": "2/4", "author": "louiep"}, {"rating": 4.0, "review": "I have only spent a few minutes with the device. I have a roku in a bedroom that is far away from the router and streaming from it is problematic. The Fire TV stick has no problem. From the few minutes that I have streamed as a test, it kept up with HD. However, Crackle was buffering on both roku and Fire TV stick. I wish Fire TV stick has Vudu but I know it does not have it when I bought it, so that's ok. However, Fire TV stick remote app is not working for me. In fact, Play Store says it is not compatible with my Nexus 7. For $19, I would give it  5 stars. But since the regular price is $39, I am giving the rating based on this price and hence only 4 stars.", "verified": true, "helpfulness": "0/1", "author": "E. Cheng"}, {"rating": 4.0, "review": "I have a regular Fire TV and bought this stick for another TV. It works fine with simular functionality to its larger brother. My only complaint is the remote control. I knew it didn't have voice search and I was fine with that. However, the build quality of this remote isn't as nice as the regular Fire TV. They really went cheap when making it. Did they save a buck in manufacturing? Maybe. The remote feels junky and the buttons feel weak. If they hadn't have pinched pennies I'd really be happy. But....for $20 it's OK. Don't pay the $40 for it though until the guy in accounting is replaced by someone who values quality.", "verified": true, "helpfulness": "1/5", "author": "Harold Saxon"}, {"rating": 5.0, "review": "I was out of the box and fully set up with netflix and showtime anytime in under 20 minutes. I did have a slight issue with downloading the first update, but the third time was the charm. Once updates were completed it is very simple to navigate and use. My only complaint is I have no idea how to fling content from my phone and since it has only been out for a day now, no one has tutorials yet. I'm sure that once I learn how to do it, that it will be simple also.", "verified": true, "helpfulness": "0/1", "author": "Unholyhero"}, {"rating": 5.0, "review": "know I will like it.", "verified": true, "helpfulness": "0/1", "author": "Shirley M. Wilson \"grandmashirley\""}, {"rating": 2.0, "review": "UPDATE 11/27:The day after I shipped off my Amazon Fire TV Stick for a refund, I received a phone call from Amazon. They had read my original post and asked if I minded following up with them, which I was happy to do. They asked for my brand of television and the model number and explained to me that they were trying to figure out why I (and several other customers) were reporting that their televisions were not recognizing the HDMI input of the device. After relaying all of my information, the representative said that he would follow up with me once Amazon figured out the issue.Although that phone call 1) came too late for me (as I had already shipped back the device) and 2) did not give me a replacement device, I wanted to provide an updated assessment of my overall experience and felt that Amazon's follow-up was worthy of adding another star to my original review. Amazon DOES read user reviews and your input DOES matter, and that is why I will continue to do business with Amazon despite this one episode of dissatisfaction.OP:I ordered the Amazon Fire TV Stick the day I received an email stating that it was available for preorder for the excitingly low price of $19 for Prime members. After waiting for about three weeks, I was thrilled when I received my Fire TV Stick six days before the original estimated shipping date. I opened the package and inside the sleek black-and-orange box sat the stick itself with the minimalist remote right next to it. But then I noticed there appeared to be even more contents inside the box! So, lifting up the orange packaging that housed the stick and remote, I revealed the simple instruction booklet, and underneath that...more peripherals?Yes, indeed. Included with your Fire TV Stick is one (somewhat useless) HDMI extension that increases the connection distance between the television and the stick to almost three whole inches; one smooth-edged yet bulky power adaptor that takes up two outlet spaces because of its awkward size; and one USB-to-microUSB cord that is almost long enough to stretch from the Fire Stick attached to the back of the television all the way down to the outlet near the floor.Wait, what's that? The stick needs to be powered? Yes, it does. I admit this may or may not be a common and necessary feature of \"stick\" devices, it did take me by surprise that all of the promotional photos apparently leave out the USB cord that sticks out of the side of the stick, which makes the stick even more awkward to plug into the tight spaces found on the back of the television.I wish I could say that these were just cosmetic and design blemishes and that the functionality of the device was fantastic, but alas, I cannot, for after finally getting the extension plugged in to the HDMI port on the television, the Fire Stick plugged in to the extension, the USB cord plugged in to the Fire Stick and the other end of the USB cord plugged in to the power adaptor, when I turned the television on and switched to the proper HDMI input, all I was greeted with was a blue screen that screamed \"Not Support!\"As I pondered what I could have not plugged in correctly, suddenly the television sputtered to life in a great roar of static and green flickering lines, the faded logo of Fire TV fuzzily rendered behind. Then as quick as it came, the signal left again, only to leave me awash in the blue glow of a missing input screen. After trying all three HDMI inputs, attempting to use the stick with and without the extension, with and without the power adaptor, I finally gave up in defeat.I decided to ask for a replacement, saddened that my initial device was apparently defective but hopeful that Amazon would be able to soon lift my spirits once again. When I attempted to get a replacement, however, I was told first that Amazon couldn't replace the device because it was out of stock, so they would refund my money now and I could order a new one (at the now full price of $39!) and wait for it to arrive. After explaining that I preferred a replacement so I did not have to pay the difference in price, the customer service representative informed me that they COULD replace the device after all, but I would have to return it now and a new one would be shipped to me on or after January 15.Considering today is November 20, waiting nearly two more months for a device that has already been replaced once because it was defective out-of-the-box did not seem acceptable to me, so I reluctantly agreed to just take the refund. I am satisfied, of course, that receiving a refund is such an easy process, but overall I am greatly disappointed. I so wanted to love the Fire TV Stick and I could have even overlooked its somewhat odd design features. But to fail so spectacularly, so immediately, then to have Amazon so brazenly expect me to wait 1/6 of a year to replace THEIR own junk...that leaves me with no other choice than to write this review. Amazon Fire TV Stick...1 star.", "verified": true, "helpfulness": "127/163", "author": "J. Scherrer"}]