[{"rating": 3.0, "review": "disappointed with choice of movies. Most of the movies we were interested in watching are not in Prime. Most family oriented movies were PG13 other than some boring cartoon choices.  Definitely not what we expected.", "verified": true, "helpfulness": "0/0", "author": "LH"}, {"rating": 5.0, "review": "Getting rid of my Direct TV ( too many commercials- too spendy ) This fire tv stick fills the whole family's needs. So happy my son informed me of this option", "verified": true, "helpfulness": "0/0", "author": "Stacy L"}, {"rating": 5.0, "review": "Just as promised, A++ thanks", "verified": true, "helpfulness": "0/0", "author": "Fred J Prazeau"}, {"rating": 4.0, "review": "Works great, easy set up. I like that I can use my sling player on it, which I never could with my Roku.  Will be nice when more apps become available.", "verified": true, "helpfulness": "0/0", "author": "Mag"}, {"rating": 5.0, "review": "Got what i wanted and more...", "verified": true, "helpfulness": "0/0", "author": "Alex R"}, {"rating": 4.0, "review": "It's great!  I was expecting to get a little more free shows though. Even through Amazon prime- in order to watch a show like scandal it cost 2.99 but Netflix shows it so in order to watch shows you still need Netflix.", "verified": true, "helpfulness": "0/0", "author": "Nicole O'Neal"}, {"rating": 5.0, "review": "Love it. Brought the Box for living room and stick for bedroom and it offers the same service", "verified": true, "helpfulness": "0/0", "author": "Alonzo Geter"}, {"rating": 5.0, "review": "Works just fine. Only slightly slower than the firetv box.", "verified": true, "helpfulness": "0/0", "author": "natedog"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Erica Coller"}, {"rating": 3.0, "review": "Amazon fire TV stick works awesome however I do not like the way it scrolls through things or how it only lists one thing at a time. I feel like it should list a bunch of things and not have me scrolling through one line at a time I'd like to see more of a list in a format that I can choose. It also scrolls little too fast and kind of blures everything together and it kind of hurts my eyes when it does that.", "verified": true, "helpfulness": "1/1", "author": "Emma"}]