[{"rating": 5.0, "review": "Received my Fire Stick.  Set up was a breeze!  It blows my old Ruku away.  A great purchase.", "verified": true, "helpfulness": "0/0", "author": "sfm7361"}, {"rating": 5.0, "review": "The Amazon Fire TV Stick is A-MAZ-ON! It was so easy to get started. The box comes with everything you need. Even includes batteries for the remote and a USB wall adapter for people like me who have a HDMI port but don't have a USB port on my TV. If purchased with your Amazon account it is even already pre-registered. Seems like they thought of everything.  I was able to get everything up and running from taking it out of the box to watching videos on Hulu Plus and Netflix in under 10 minutes. Very happy with the purchase!", "verified": true, "helpfulness": "1/1", "author": "Kevin Duby"}, {"rating": 5.0, "review": "Started with the Chromecast and didn't like it. Finally got the Fire Stick and love it. I am a Prime member and the stick works great with my kindle and tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This thing is awesome.  It has so many really cool features.  I am 62 years old and find it very easy to use.  It does take a few minutes to load but who cares?  This is like the best Christmas present I have ever bought myself.", "verified": true, "helpfulness": "0/0", "author": "R. Reed"}, {"rating": 5.0, "review": "Love it! It's so cool and even i can understand how to use it. I'll be enjoying it from now on", "verified": true, "helpfulness": "0/0", "author": "jodie ritcheson"}, {"rating": 5.0, "review": "I really can't say enough about this great new product from Amazon. After almost a year and a half with the Chromecast, I was tired of its frequent unpairing and terrible connection quality, so I jumped right on the early purchase deal for the Fire TV Stick. While it's certainly in its infancy right now, the Fire Stick already far exceeds the Chromecast in its usability and functionality. It's a lifesaver and I'll be using it for a long time to come!", "verified": true, "helpfulness": "0/0", "author": "Harris Walker"}, {"rating": 5.0, "review": "Early review got it yesterday a n d watched content late last night.  Would like to use the fire t v stick to download content late at night go watch during day time.  Why, well we ha v e satellite internet and at night content is uncapped.  Very pleased my kindle video watch list comes thru to fire stick.  Never saw a buffer issue or quality problem.  Set up was a snap.  Packaging was well done.", "verified": true, "helpfulness": "0/0", "author": "john gibbons"}, {"rating": 5.0, "review": "Super easy to set up and use. The remote control works very well and has a nice, clean design. I immediately set up and used the phone app to control the TV Stick and it was super easy to do and to use. It works very smoothly and the user interface on the TV screen is idiot-proof; it's super easy to use.I also love how well Amazon is integrated - on my TV, the stick allows me to see movies/shows that I recently watched/added when I was on my computer. It's so easy to use from room to room, and I like that I can use my Pandora account and others through it.I just need to see how it works when I go to friends' houses and/or hotels, as I travel a decent amount. The only thing I haven't figured out - does it have a volume control? That is one thing that is lacking (to my knowledge), so I have to still have the \"real\" TV remote handy (like that's a real big problem?!).", "verified": true, "helpfulness": "0/1", "author": "Kristin Lee Sotak"}, {"rating": 5.0, "review": "I ordered this during the pre-order sale and it has been, thus far, worth every penny of the $19 I paid.The set-up process took us about 15 minutes or so, but went smoothly.  We have had, thus far, no issues with freezing or wifi connectivity.  We have used it to stream Netflix, YouTube, Pandora and multiple other things -- thankfully, we have had no issues.  We have paired it with our LG HDTV and we love it!I like that it comes with a remote, which makes things quite convenient.  The streaming is crystal clear and like I said, we've had no freezing issues so we are quite pleased.We look forward to seeing what else will be unveiled with the Fire TV Stick in the future but for now we are quite happy with everything!", "verified": true, "helpfulness": "0/0", "author": "Little Mama"}, {"rating": 1.0, "review": "I am really disappointed in AMAZON! I was so exited to get this. But When I got it. It didn't work. The FREAKING!! control was taking for ever... I change the batteries to see if it was that. But It wasn't... GRRRR,... very very disappointed!!!", "verified": true, "helpfulness": "1/1", "author": "Julio c, santana"}]