[{"rating": 5.0, "review": "AmazingThanks", "verified": true, "helpfulness": "0/0", "author": "rondoronnie"}, {"rating": 4.0, "review": "It is everything I expected  it to be.  It functions pefectly.  Easy to install and use.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super easy to install and I love the variety the Fire TV Stick gives.", "verified": true, "helpfulness": "0/0", "author": "Linette M Pustka"}, {"rating": 4.0, "review": "I have not had any issues with streaming shows from Amazon, but Netflix is a bit spotty. Other than increasing the selection of prime available shows I don't have any complaints.", "verified": true, "helpfulness": "0/0", "author": "Adam R."}, {"rating": 5.0, "review": "Works, Does as described.", "verified": true, "helpfulness": "0/0", "author": "Paul \"Paul Giller\""}, {"rating": 5.0, "review": "love the product and use it all the time for music and movies.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "I am very pleased with the Fire TV Stick.  It was so easy to hook up and Amazon already had my info programmed into it.  I started it up and everything from my Amazon movies, TV videos to music was all right there!  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "June"}, {"rating": 5.0, "review": "Excellent for the price. Especially if you have amazon prime.", "verified": true, "helpfulness": "0/0", "author": "JGOFAST"}, {"rating": 1.0, "review": "I received the Fire TV Stick. Installed it the same day. Fairly easy to install. All worked well. I was able to view Amazon Prime Movies and Netflix with it. I was very pleased with it until June 13 at which time it simply stopped playing the movies. When I tried to order a movie all seemed well until I hit the play button at which time I got a blue screen with the message HDCP unauthorized content detected. Tried everything but nothing has worked connected a Wii console and once again everything works so I know it is the Fire tv Stick that is defective. I would not buy this product. UNDEPENDABLE.", "verified": true, "helpfulness": "0/0", "author": "Terry Quintero"}, {"rating": 4.0, "review": "the apple tv interface is better, it keeps track of which episodes you have watched", "verified": true, "helpfulness": "0/0", "author": "Jdc"}]