[{"rating": 5.0, "review": "I love this thing and use it a lot.  I was a little confused at first since I didn't buy it off of my parent Prime account.  It kept telling me I didn't have prime so I finally switched the email and everything works great.  It's much more convenient than trying to hook up my laptop or xbox to watch netfilx or other shows.", "verified": true, "helpfulness": "0/0", "author": "Aaron Toop"}, {"rating": 5.0, "review": "Easy to use, works great too.  Thousands of movies and tv/cable shows at your fingertips!", "verified": true, "helpfulness": "0/0", "author": "Cathy Long"}, {"rating": 5.0, "review": "I really love how my TV is now a smart tv because of the Fire Stick. I mainly use this just for Prime videos and Netflix but still a fantastic product.", "verified": true, "helpfulness": "0/0", "author": "Garrett"}, {"rating": 5.0, "review": "Set up is easy. Streaming is near instantaneous. This is a much better option than using an x-box. Being an amazon prime member I get the full benefit of all the video access the Fire provides.", "verified": true, "helpfulness": "0/0", "author": "SimSalaBim"}, {"rating": 3.0, "review": "No Windows 8.1 Miracast support is a huge facepalm. People DO own laptops still, and they DO want to cast from them. Come on!", "verified": true, "helpfulness": "1/1", "author": "Gleb Holodov"}, {"rating": 1.0, "review": "It kept refreshing while I was watching (where you get that countdown number in the middle of the circle).  I finally had to take it back and it was not my internet connection because I replaced it with a Roku stick and I haven't had any problems with the Roku.  The stick and the remote feels as cheap as the price.  Just remember you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "I luv it. I was gonna go with the Chromecast but this one had more options such as the remote. It also has the option like the Chromecast to control and mirror as well.  The 5.1 audio option which the other sticks do not have was a big buying point. All in all alotta bang for $39 bucks.", "verified": true, "helpfulness": "0/0", "author": "William McDonough \"billman1205\""}, {"rating": 5.0, "review": "Works great just like advertisedEasy to install and directions were great", "verified": true, "helpfulness": "0/0", "author": "Blomdahl Donald L \"Don Blomdahl\""}, {"rating": 1.0, "review": "Don't waste your money.  Out of the box everything ran smooth in the setup, but once we tried to actually play a video it would not work. Fought with it for over an hour and would never load and play anything. So we boxed it up and sent it back.", "verified": true, "helpfulness": "1/1", "author": "cdmom2004"}, {"rating": 5.0, "review": "use it all the time.  I wish you could just select prime free only.", "verified": true, "helpfulness": "0/0", "author": "Glo"}]