[{"rating": 1.0, "review": "I was disappointed that it couldn't connect to 5ghz WiFi it would keep dropping.  Plus the Screen Mirroring doesn't work with Windows 8.1. The device has been returned.", "verified": true, "helpfulness": "3/3", "author": "Dave Westermann"}, {"rating": 5.0, "review": "Was not hard to set up, works great.", "verified": true, "helpfulness": "0/0", "author": "Ricardo_tpa"}, {"rating": 5.0, "review": "Works great! Fast and I use it with the remote app on my phone. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "David Park"}, {"rating": 4.0, "review": "Matches or exceeds my current experiences with Roku and other media players. I use it primarily for viewing media.Pros:App interfaces are well designed and intuitive, and the included controller is both comfortable and easy to use. No issues with dropping wireless connections that I've encountered with similar devices. Price is very reasonable.Cons:Stick has a required secondary power adapter that somewhat limits where it can be reasonably attached to a TV. It comes with an HDMI extension for harder to reach locations, but it won't afford you more then a few inches. Combined with the power adapter, this could limit where you can practically install it, though I didn't encounter any significant issues. The auto resolution feature caused significant playback issues jumping between various settings on my setup before I selected one manually.", "verified": true, "helpfulness": "0/0", "author": "Colin A. Weingarten"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Jen Combs"}, {"rating": 5.0, "review": "I've only had the fire stick for a week, but so far I love it. I have been using a chromecast and that worked well for me, but the stick is easier to use and I don't have the difficulty with pausing a movie that I have with the other device. So far, I  have used it to view amazon prime and netflix videos. The only downside is that the audio is coming through my tv rather than the sound bar, that isnt the case with the chromecast, I was able to send audio to soundbar w/o any problem.", "verified": true, "helpfulness": "0/0", "author": "Denton Connor"}, {"rating": 5.0, "review": "Great product!!!!", "verified": true, "helpfulness": "0/0", "author": "Tyrone McKay"}, {"rating": 5.0, "review": "I love it! Works great on HD Smart tv!", "verified": true, "helpfulness": "0/0", "author": "texasgirl \"swolf19\""}, {"rating": 5.0, "review": "The Fire stick has been the perfect addition to my TV. easy to use and seamless prime integration!", "verified": true, "helpfulness": "0/0", "author": "Riley-Rau"}, {"rating": 4.0, "review": "It works well...every now and again the menu will freeze so you will have to unplug the power and let it sit for a minute.  other than that, it makes a dumb TV a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Brandon R. Blauch"}]