[{"rating": 4.0, "review": "Love it, only wish I could get VUDU on it.", "verified": true, "helpfulness": "1/1", "author": "Melinda Miles"}, {"rating": 5.0, "review": "I love that it's exactly what I expected it to be. It's very convenient and easy to use. I am completely satisfied.", "verified": true, "helpfulness": "0/0", "author": "Noille Stewart"}, {"rating": 5.0, "review": "This stick works right out of the box! It's also PREPROGRAMMED to your account! So don't be a wise guy and resell it! Thus u will loose it all. Not to mention they charge all to your prime account etc.", "verified": true, "helpfulness": "0/0", "author": "sTaLwArT 420 \"sTaLwArT\""}, {"rating": 5.0, "review": "Plug in and go. It works great - no issues.", "verified": true, "helpfulness": "0/0", "author": "James D"}, {"rating": 1.0, "review": "Thought I could use this with with it being connected to my tv's usb outlet, as I can charge my tablet using that, or have it get enough power from my hdmi outlets as they are all MHL enabled. Although it powers on when connected to the MHL HDMI ports it complains that it doesn't have enough power & it tends to lag. When it's connected to the given USB adapter it works smoothly. Since the device I replaced also required an outlet this is just a major annoyance.As far as the interface goes, it is extremely confusing. Amazon shows their video content nearly front & center, no loading of an app, which I extremely like. I can get to watching Amazon content much faster. However they mix the \"store\" in with the app icons, the Amazon content, is then mixed in, both included content & purchasable content, which makes the interface just that more confusing. There are several great ways to improve the layout, but all of them would require moving \"store\" content out of the main part of the interface. I doubt Amazon will do this because I'm assuming their goal is not a great interface, but the selling of digital content.The reason other streaming devices like ATV & Roku are great is that all content is considered equal. I'd be ok with Amazon having a 'recently viewed prime video' section, a 'recommended prime videos' section that clearly shows a price or 'included' so that the price is clear. And then have an 'apps' section (or one for video & a separate one for games.) no matter what the interface needs improvement.Lastly the fact that there is a remote for android devices, but not for iOS tells me that Amazon released this before it was fully baked, in order to get it out before the holiday purchasing season.Am I using it? Yes to watch included prime content & Netflix. Doing more than that seems difficult. I was considering purchasing a game controller & trying out some games, but I'm going to avoid that, as given the interface so far, I expect it to not be simple.", "verified": true, "helpfulness": "2/5", "author": "Daniel B. Weber"}, {"rating": 5.0, "review": "Great price and works like a champ.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have the apple TV, chromecast, had a roku and now the firestick. This is the first device with connectivity issues. It drops the network consistently and will keeps giving an \"authentication problem.\" Apple TV and Chromecast are working just fine. Firestick is not ready for prime time.When it does work, it's just ok. Only a few apps show up on frequently used. For example, I was using Watch ESPN app and to get back to it I have to go to the apps page to open it. It would be easier if I could get to an app I use frequently in fewer then 15 clicks. The interface is easier on apple TV. Was hoping to use this instead of apple TV because I like the option of getting to use Amazon app, which apple TV does not have. But I will just stream amazon content from my phone TV. Also no HBO. Needs work, Amazon.", "verified": true, "helpfulness": "1/1", "author": "eltorre"}, {"rating": 3.0, "review": "Good hardware. The stick is fairly small and it fits well in my TV and the treadmill monitor. I used the USB port to power the stick. The software gave me a warning about it but so far I haven't seen any issues as far quality of the image and audio. Apps and content are the weak side of this device. Other competitors such as Roku and Apple TV have a much larger library of content to select from. This is an area Amazon should invest in to stay competitive. I have an okay size library of videos and music from Amazon and an Amazon Prime member, this device make sense for users like me; however; if you haven't made a large investment in Amazon content, you should consider other competitors since content and apps are the main reason for all us buying these devices. The good news here is Amazon can add content through software update and I am hopeful this will happen soon.", "verified": true, "helpfulness": "0/1", "author": "MaxSmith"}, {"rating": 5.0, "review": "Love my stick! Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Jonathan Yaskal"}, {"rating": 4.0, "review": "Wish it had Vudu", "verified": true, "helpfulness": "0/0", "author": "J. Giron \"D Thanatos\""}]