[{"rating": 5.0, "review": "My family like it all the apps , but i cant download Vudu please update that appI will gonna buy another one", "verified": true, "helpfulness": "0/0", "author": "ricardo  gomez"}, {"rating": 5.0, "review": "Very user friendly, great selection of apps. Really like that it does not require a device to mirror for use. Only complaints are that the keyboard is inconsistently QWERTY or alphanumeric, text is a little small on my 32in flatscreen, and would LOVE the ability to have a multi app search option for movies and tv shows. Overall, Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Best invention since sliced bread. Just ordered the second one. After 25 years of satellite tv, my Dish just might get broken. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Russell English"}, {"rating": 5.0, "review": "The Fire stick is working very well...the picture is good and the format is very easy to use.  I highly recommend it.  We travel for the winter and it's very easy to take back and forth.  Just plug it in!", "verified": true, "helpfulness": "0/0", "author": "Judith I Piland and Kenneth M. Piland"}, {"rating": 4.0, "review": "A good tool.  The movies occasionall get stuck in downloading but that may be my internet connection.", "verified": true, "helpfulness": "0/0", "author": "John S. Marr MD \"tgkameron\""}, {"rating": 5.0, "review": "I absolutely love it. So easy to connect. Once connected very easy to navigatr.", "verified": true, "helpfulness": "0/0", "author": "Linccow"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "LuJohn Lewis"}, {"rating": 5.0, "review": "Love that this gives me the ability to stream things to my tv without having to use a gaming device or having a smart tv!", "verified": true, "helpfulness": "1/1", "author": "Amanda Weiterman"}, {"rating": 5.0, "review": "Everything I wanted and more", "verified": true, "helpfulness": "0/1", "author": "Jerry Lee Bline"}, {"rating": 4.0, "review": "Although it's not as fast as the Full Fire TV console, this is perfect for taking on the road. I travel a lot and now I can easily take all of my Fire TV chanels with me. This stick is way better/faster then the Roku stick.", "verified": true, "helpfulness": "2/2", "author": "Brent G. Quinn \"New Mexico Husker\""}]