[{"rating": 3.0, "review": "I really don't see the benefit, because most of the movies you will have to rent on the Stick, which will lead you to spending a lot of money before you realize it.  You might as well just rent it from Red Box for cheaper.", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 5.0, "review": "All the fun of Amazon prime on a little stick", "verified": true, "helpfulness": "1/1", "author": "Phil M"}, {"rating": 5.0, "review": "Love it now I can catch up on my favorite shows", "verified": true, "helpfulness": "1/1", "author": "Patricia A. Graves"}, {"rating": 5.0, "review": "Eas to use", "verified": true, "helpfulness": "1/1", "author": "Stuart Gibbs"}, {"rating": 4.0, "review": "Works fine. Set up very easy. Only issue I have is the small size of the remote which makes navigation a bit dicey.", "verified": true, "helpfulness": "0/0", "author": "James N. De Stefano \"chisox4\""}, {"rating": 5.0, "review": "My streaming problems seem to have been solved by the Fire Stick. When watching movies before through the DVD software, films often stalled and stopped and had to be restarted. Working fine without such stops and stalls now.", "verified": true, "helpfulness": "1/1", "author": "David Paseo"}, {"rating": 5.0, "review": "Absolutely the easiest to install, setup and use device I've seen, and it delivers as advertised. The Fire TV Stick has opened up many more TV options, especially for those \"there's nothing on but reruns\" times of the year. Couldn't be more satisfied with this product!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Pastor Bryan\""}, {"rating": 5.0, "review": "I love this", "verified": true, "helpfulness": "1/1", "author": "Jason"}, {"rating": 3.0, "review": "It's ok. We bought it for a 2nd tv. It works fine, we just like the Roku better. It's more user friendly.", "verified": true, "helpfulness": "0/0", "author": "C_STEWART"}, {"rating": 3.0, "review": "Sometimes it connects to wifi, often doesn't.  Other things in same area have no problems connecting (printer, computer, Roku, etc.)  When it works, it's great!  Love the photos!", "verified": true, "helpfulness": "0/0", "author": "Debby Athearn \"nini.mv\""}]