[{"rating": 4.0, "review": "It would get 5 stars if u could fling showbox instead of mirroring", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love the Fire Stick.  We don't have Amazon Prime (are considering it) but are Netflix users.  This little gadget can be used on a whole host of apps for streaming.  We got it for the RV television which is not a \"smart\" TV and it's great.  It pulls the streaming sites right into the menu for you.  It's a bit tricky to get set up if you are not familiar, the directions leave a lot to be desired as what we were seeing on the TV was not the same as the instructions referenced, but we muddled through it.  Not that big a deal.", "verified": true, "helpfulness": "0/0", "author": "Yvonne C"}, {"rating": 5.0, "review": "Is like a huge tablet, depending on the size of your tv......absolutely recommend", "verified": true, "helpfulness": "0/0", "author": "esau talmadge"}, {"rating": 5.0, "review": "Easy set up, easy to use. Much more content than anticipated. Works very well. This product is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Love it.  Love remote.", "verified": true, "helpfulness": "0/0", "author": "Debra Martin"}, {"rating": 5.0, "review": "Love it....haven't used my cable since I've gotten it :)", "verified": true, "helpfulness": "0/0", "author": "Christine Matarazzo"}, {"rating": 4.0, "review": "It's a great product and mostly easy to use. It took a little time to set it up, but after that no problem. I do have to unplug my Blu Ray player from the HDMI port to use the stick, as my television only has one outlet. I figured it out", "verified": true, "helpfulness": "0/0", "author": "Diane A. Carenas \"diantenis\""}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "letznosh"}, {"rating": 4.0, "review": "Super simple to set up and very easy to use.  Love having the ability to stream multiple formats. Remote is very small.", "verified": true, "helpfulness": "0/0", "author": "hg"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ed Walsh"}]