[{"rating": 5.0, "review": "My kids enjoy it everyday, with Amazon Video Prime and others free video channels, my kids have more fun than the cable which was costing me a lot of money every month(I cut it by the way). I bought it  since it was release for the first time; and I had some WIFI connection problem because of the TV mount I had behind my TV; The Amazon extension was a little short to solve the problem. I bought a longer hdmi extension for about $10 on Amazon and the problem was solved. I can just ask Amazon to make a longer Extension for this since we have so many things behind the TV that can affect a WIFI connection. Thanks", "verified": true, "helpfulness": "1/1", "author": "PeaceMaker \"DOM\""}, {"rating": 5.0, "review": "Super fast shipping, easy to hook up, bow i have netflux and amazon instant video in my room!", "verified": true, "helpfulness": "0/0", "author": "a.diggs"}, {"rating": 5.0, "review": "Great product and price", "verified": true, "helpfulness": "0/0", "author": "Jake Moore"}, {"rating": 4.0, "review": "I love my Fire TV Stick! I use it mainly for watching Netflix and Amazon Prime.  The fact that it's portable and so small makes it perfect for traveling.  As long as you have wifi wherever you are you have your whole movie library with you, and in HD no less. My only issue which is kinda big to me (particularly in comparison to my Roku player) is that the rewind and FF feature isn't as smooth as it could be. I almost always over-shoot in either direction when trying to get to the point in the video that I want to watch.", "verified": true, "helpfulness": "1/1", "author": "Chuck from Middletown"}, {"rating": 5.0, "review": "I bought this for a Smart TV that actually had a built-in Amazon app, but the app started behaving strangely. The Fire TV Stick was worth its price simply for the improved interface and the portability (we can take it on vacations and use on TVs in hotels and rentals).But the biggest benefit: you can sideload XBMC/Kodi and stream local content to your TV. It's basically one of the smallest, cheapest home theater PCs you could buy or build. Plus is plays video games (though you need to buy a controller).", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "So much FUN🌻🌻🌻🌻🌻", "verified": true, "helpfulness": "0/0", "author": "Barbra Tucker"}, {"rating": 4.0, "review": "Great and the product allows me to stream and download movies, music and pictures.", "verified": true, "helpfulness": "0/0", "author": "Allen H."}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Kong Her"}, {"rating": 2.0, "review": "more expensive to use that expected almost everthing has an extra charge to watch", "verified": true, "helpfulness": "0/0", "author": "del"}, {"rating": 1.0, "review": "Amazon is GREAT, but someone flubbed on this....big time. I wish I had bought this just so that I could have returned it; but no, it was a gift. In it's non-working mode, it locks up when you request to watch something...anything. In it's \"working\" mode, you get 5 minutes of video followed by 1 minute of \"Loading\". Literally....5 mins, 1 min, 5 mins, 1 min. Do the math: IF you're patient enough to sit through a 2 hr. movie, that movie stretches out to 2 hrs. 23 min. The extra 23 min. is just for load times. Oh, and the 1 min. load time is constant, but the 5 min. of video isn't. Sometimes it's as little as 2 mins. video, but never more than 5 min. Is it a hardware issue or a software issue? I don't know and I just don't get it; everything else that Amazon touches turns to gold....except for this thing.  OMG, I getting more than 10 min. of video now. I better shut up and quit while I'm ahead. Good luck in whatever you decide to do.", "verified": false, "helpfulness": "0/1", "author": "Robert F. McQueen Jr."}]