[{"rating": 5.0, "review": "I REALLY LIKE THE FIRE TV STICK,I HAD THOUGHT ABOUT ORDERING FOR A LONG TIME. MY NEPHEW TOLD ME HE HAD IT & THAT IF I GOT I WOULD LIKE IT, AND HE WAS RIGHT I DO LIKE IT VERY MUCH.", "verified": true, "helpfulness": "0/0", "author": "Georgia N. Ward"}, {"rating": 5.0, "review": "my daughter loves it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Bryant J."}, {"rating": 5.0, "review": "Had to call amazon help because I am not all that familiar with my new tv. But all worked out easily and fire stick is attached  and running. Set up is easy. And so is the HDML once I knew where to find it on my remote. Like I said amazon was there for me very patient and very helpful. So glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Evelyn M. \"new at this\""}, {"rating": 5.0, "review": "So easy compared to Chrome!", "verified": true, "helpfulness": "0/0", "author": "Valerie"}, {"rating": 4.0, "review": "Nifty device. I didn't realize the stick itself plugged into the wall... which makes it less practical to move from TV to TV, as I had planned. But it works great!", "verified": true, "helpfulness": "0/0", "author": "Tiffany \"tifffanyd\""}, {"rating": 5.0, "review": "great product, really easy to operate and access to so many great shows!", "verified": true, "helpfulness": "0/0", "author": "janet padilla"}, {"rating": 5.0, "review": "happy hubby", "verified": true, "helpfulness": "0/0", "author": "sherry craig"}, {"rating": 5.0, "review": "Nice to do business with these people! Excellent quality product. A+", "verified": true, "helpfulness": "0/0", "author": "Shailyn"}, {"rating": 3.0, "review": "This is a good product, however, I get frustrated that it seems to want to cut out quite frequently.  I have a fast internet connection speed, my wireless router is within a few feet of my television, and I still experience a lot of buffering.  When I try to watch Netflix or Amazon Prime movies it buffers pretty frequently, almost to the point that I want to just stop what I am watching.I do enjoy the many applications that are available.  My son uses it to play games but also has the same problem with it cutting out at times.  It depends on what he is playing.  I have also noticed that when other devices are using my wifi, if we get a notification on that device, the Fire stick cuts out. If they could give it a little more power it would be fantastic.  Over all it's like having my Kindle Fire on my TV. If you have a slow internet connection or so-so wifi, this is not for you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Easy to install and operate - use it on my smart tv - without cable", "verified": true, "helpfulness": "0/0", "author": "Brigitte E Seier"}]