[{"rating": 5.0, "review": "Love the Fire Stick. Got rid of cable TV completely!", "verified": true, "helpfulness": "0/0", "author": "KT"}, {"rating": 5.0, "review": "Great solutions for our non-Smart TV. Very simple to set up and use", "verified": true, "helpfulness": "0/0", "author": "David P. Harvey"}, {"rating": 5.0, "review": "Got a Roku 3 and this amazing little stick!!!  Prefer the Fire Stick", "verified": true, "helpfulness": "0/0", "author": "Texxas Girl"}, {"rating": 3.0, "review": "The Amazon Fire TV Stick could be perfect if it were able to access the Vudu and Mgo movie apps. The fact that it doesn't was a great disappointment.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Clark"}, {"rating": 4.0, "review": "Only problem so far is a defective remote control. Also the stick seem to get hot when left on for long periods....I prefer the fire TV box...", "verified": true, "helpfulness": "0/0", "author": "Lee Maule"}, {"rating": 1.0, "review": "Everything I tried to connect to or watch cost additional money.  Sent it back.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "can't connect to IPhone", "verified": true, "helpfulness": "0/1", "author": "dalefonta"}, {"rating": 4.0, "review": "Excellent speed and access to almost everything I want. I travel a lot and am often at hotels, and, for me, the most outstanding feature which sets the fire stick apart from items like Roku or Roku stick is the ability to use Hotel Wifi with the firestick. Doing so with the Roku is problematic (although possible). With firestick, it is automatic. It gets you onto the hotel website where you can put in the access code, and it works! At home, I prefer the Roku (3 or stick). Although Roku is slower, it has CBS All Access, Vudu, a much better search engine that checks netflix and other websites, and its remote, although bulkier is easier to use which is great when you are tired. The fire remote, however, is also very good, just not as easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome product", "verified": true, "helpfulness": "0/0", "author": "marion everett"}, {"rating": 5.0, "review": "Love it! It's really worth its weight in gold! I'm enjoying so much more than I ever had with my expensive cable!", "verified": true, "helpfulness": "0/0", "author": "Marlene Marien"}]