[{"rating": 4.0, "review": "I have had my fitestick for about 2 weeks and it has worked well. I noticed that it was very hot last night and was having speed issues even though my phone showed 72 mbs WiFi. Did a power reset and that resolved the problem.", "verified": true, "helpfulness": "0/0", "author": "Gordon Neal"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "vernell"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Sebrenia"}, {"rating": 1.0, "review": "Started out halfway decent. Now i cant hardly watch movies or anything on it. Delighted that my job bought it and i didnt waste my own money on this thing. Seems to be constantly turning itself off and back on in the middle of netflix, loses signal on flixster, etc.", "verified": true, "helpfulness": "0/0", "author": "Clifford Hepler"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "scott sweredoski"}, {"rating": 5.0, "review": "Wish we had bought it sooner!!!", "verified": true, "helpfulness": "0/0", "author": "Christine Wallace"}, {"rating": 5.0, "review": "Simple to install, simple to operate. What else would you want?", "verified": true, "helpfulness": "0/0", "author": "Robert Lee"}, {"rating": 5.0, "review": "Worked right out of the box. No issues. Bought two.", "verified": true, "helpfulness": "0/0", "author": "_Ritch"}, {"rating": 5.0, "review": "I am very pleased with the Amazon Fire TV Stick.  I like that you can easily take it from TV to TV without a huge setup process.  It has more apps then my Roku like Starz which is the main reason I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Purchased the Amazon Fire TV Stick to turn my secondary dumb TV into a smart one.  Was simple and easy to set up and has worked flawlessly ever since.  Also, have used it in my large smart TV as it must have a weak Wi-Fi antenna and doesn't like connecting frequently.  The Fire TV Stick hooked right up and I used it to stream several movies with no circle of death incidences.  Also, took it on vacation with us and used it at other family members homes where it hooked up and played flawlessly.  Great device for getting and streaming digital services.  It's kind of like taking your home TV with you where ever you go...", "verified": true, "helpfulness": "0/0", "author": "tiv1"}]