[{"rating": 5.0, "review": "Love it! Works great. Works great with amazon prime. I get to watch my tv shows when I want to", "verified": true, "helpfulness": "0/0", "author": "Courtney B."}, {"rating": 5.0, "review": "Awesome for most parts. I've noticed issues with streaming Hulu. A friend of mine has identical problems. I'd imagine a patch is in the works.", "verified": true, "helpfulness": "0/0", "author": "GREGLIKEWHOA \"Slapahoe Tribe\""}, {"rating": 5.0, "review": "I shoulda ditched cable years ago!  Still can get most of what I what I want with this baby and basic cable.  Saving thousands.I had no idea what wide offerings I could access - all these Amazon shows, of course, and as a prime member, a zillion films and series, but many series that I thought were only on cable.  Plus any music you've ever purchased through Amazon, and all kinds of games, some that you can get on your phone (though playing them with the Fire remote instead of a controller can suck).  You can also access your Netflix, Hulu, etc., accounts.  I have a huge backlog of programs on my \"wishlist\" already!", "verified": true, "helpfulness": "1/1", "author": "Tiaza \"Tiaza\""}, {"rating": 4.0, "review": "The Fire TV Stick is nice piece of Hardware,  But I use it outside US. So the content like Amazon Prime or NETFLIX or HULU is practically not possible. I have MINIX android box as well, on which i have installed VPN to US, to watch these contents. However FireTV stick comes with VPN related codes removed and even on sideloading these apps, you will be not able use the content.Having said that, I use KODI aka XBMC a lot on this device, and ALSO use as SMB client and stream everything from my NAS using ES File Explorer. Thanks to the Sideloading capability of FIRE TV STICK and this has made FIRE TV STICK more useful and would say,its a Bang for the buck.Content streaming to FIRE TV is also very beautiful with the ALL CAST RECEIVER app. Overall I am happy with my purchase and for the users from US its definitely worth the buy and probably best Android/Streaming stick out there.", "verified": true, "helpfulness": "2/2", "author": "Ananthu Ramachari Barathan"}, {"rating": 5.0, "review": "I have the Chromecast but I use this more", "verified": true, "helpfulness": "0/0", "author": "Nigel Vaughan"}, {"rating": 5.0, "review": "Was easy to hook up to wifi. Navigation is smooth and quick except for choosing letters to type. No dropped signal that some others have reported. Likely their wifi settings are odd or there's been a patch since then. Apps work well but have limited selection. Mostly use the Amazon prime, pbs kids and prime music.", "verified": true, "helpfulness": "0/0", "author": "springn1"}, {"rating": 1.0, "review": "dosent work.  using wif, or even a wifi hotspot.  Talked to amazon and Netflix.  no help  very bummed out", "verified": true, "helpfulness": "1/1", "author": "Tyler Lavigne \"tylersaurusrex\""}, {"rating": 5.0, "review": "Love it. Talking to the app on my phone to search for shows makes it even cooler.", "verified": true, "helpfulness": "0/0", "author": "mike thompson"}, {"rating": 1.0, "review": "As with the voice control, it misbehaves badly. Spoke with a very nice agent early on with this problem.  It works then doesn't.  Scrolls then sticks.  Can't choose from the menu, it just plays the first selection.  I love the concept, and when it works , it is fantastic.  It just doesn't work consistently or even semi- regularly.  I spent the money for the voice remote, that gave me trouble and now I defaulted to the standard remote and use the system.  Tonite I was able to watch \"Jack Ryan\" because it was the first on the recommendation menu.  It also paused and played paused and played over and over.  It went into reverse 20 times during the viewing.  It paused and stopped dozens of times. I love the Amazon Prime movies and bought this system to take advantage of this benefit.  Maybe I can get a refund, maybe they will give me a system that works. It was delivered early December.  I hadn't used it since the holidays so It is probably beyond warranty.  I will keep everyone posted", "verified": true, "helpfulness": "1/1", "author": "Dennis M. Carr"}, {"rating": 3.0, "review": "Got a good deal on it hence bought it. besides netflix other options are some what limited. my biggest gripe is wifi connectivity. Fire stick loses connection at random or some times does not connect to wifi at all. I had to factory restore it once only for this issue. By the way, my tv has built in wi fi which NEVER loses connection and laptops/iphone/note 4 works just fine in the same area (meaning problem is with the stick and not the wifi). Since its not my major media dongle therefore I can tolerate it otherwise I would have been really frustrated. Honestly, had I paid 40$ for it, I might have had returned it by now.", "verified": true, "helpfulness": "1/1", "author": "Rem"}]