[{"rating": 5.0, "review": "I ABSOLUTELY LOVE IT!!!!For those who do not have a smart TV, this works wonderfully! First of all, the product was properly packaged and arrived the morning of the due date, which was great because I was leaving work early that day; therefore, I was able to take it home immediately. It only took me approximately 5 minutes to connect and load Netflix and HULU, and SHAZAAAAM!!! Plus, the Fire TV Stick makes it much easier to watch movies when at home on Amazon Prime than before. I purchased two, but will definitely purchase another.", "verified": true, "helpfulness": "0/0", "author": "Firemom94"}, {"rating": 5.0, "review": "Fantastic product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup!  Easy to use, and works exactly as expected and described.  It serves the purpose that I needed it for, and I've been using it daily since I received it.  I really only use it to watch Netflix and Amazon Prime.  I haven't tried playing any games, nor will I.  But the Fire stick is a great and inexpensive way to be able to watch Netflix and Prime on my TV instead of my iPad.", "verified": true, "helpfulness": "0/0", "author": "Khalidah Taylor"}, {"rating": 5.0, "review": "I love it it's great Chris fitzgerald", "verified": true, "helpfulness": "0/0", "author": "Chris Fitzgerald"}, {"rating": 4.0, "review": "I love it, I just wish I could of try amazon prime, It said free for one month but was not able to sign up for it. Still I'm considering buying another one as a gift for my son.", "verified": true, "helpfulness": "0/0", "author": "Maria Cisneros"}, {"rating": 5.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "joanne m. talone"}, {"rating": 5.0, "review": "very good one", "verified": true, "helpfulness": "0/0", "author": "Kenny Lieu"}, {"rating": 5.0, "review": "Best hardware including THE BEST wireless network card in any of my device... works in the farthest reaches of my home. Plus Amazon Fire is user programmable. Google, Roku, Apple TV, they all fall far short when compared to the Fire TV stick/box. I am dumping my premium channels from cable and have added 6 devices throughout my house. They will pay for themselves in < 6 months. Buy it you will not be disappointed and if you are a Prime member your wasting money by not having it!", "verified": true, "helpfulness": "0/0", "author": "Dion & Catherine Tsourides"}, {"rating": 5.0, "review": "Using the Firestick for Sling TV and it's great. I got the Firestick free by prepaying Sling and now have all the Disney, Espn, and primo cable channels for 25 dollars a month. With the Firestick you even get some on demand movies and shows on Sling (up to channel details). Having Prime also makes it a complete 'cut the cable's solution.", "verified": true, "helpfulness": "0/0", "author": "tgood"}, {"rating": 2.0, "review": "I did not think the quality was very good compared to the AppleTV.  I also didn't like the fact that it required a separate power supply after it was already plugged into the TV.With that said, it did work. . . just not to the standard I was hoping for.", "verified": true, "helpfulness": "0/0", "author": "Jason Meier"}]