[{"rating": 2.0, "review": "not as good as i thought for me i just wasted my money, chrome is much better", "verified": true, "helpfulness": "0/0", "author": "massawe"}, {"rating": 5.0, "review": "I've been using The Stick for about a week now and love it.  I use it only for Netflix so I can't attest to its other functions.  Setup was easy and I appreciate that it came linked to my Amazon account.  I am in Netflix about 15 seconds after pushing a button on the remote, light years quicker than my Xbox or PS3.  That remote is what I appreciate most, I don't need my phone to control what's on.  While it doesn't have the quality feel of say the Apple Tv remote it gets the job done.  No matter where you point it the signal always finds its way to the stick.  A couple of minor gripes though, I have noticed it stumble a couple of times while watching video and I would really appreciate control over the sleep timer (it goes to sleep after 30 min. of inactivity or by finding the sleep button in the settings menu).  Other than that I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "A. Montoya"}, {"rating": 2.0, "review": "Started out fine, with a relatively friendly interface and quick responsiveness. After the first few hours, it started developing constant connection problems with the router and now is unable to sustain a connection stating at first there were issues and now authentication problems. Only useful to display an HD Screensaver that was preloaded. Very disappointing.Edit: The solution was to reboot the Fire TV stick. It routinely has buffering issues in the Netflix and Hulu apps (when none of my other devices nor my computer has an issue with our 1MB+ connection) and occasionally go through short periods of times where it will emit (through the TV)  weird electronic/static sounding beeps/buzzes.After figuring out the reboot issue, it's been a livable problem, but still leaves me unhappy. I basically unplug/plug it in once every 2-3 days, because it will start lagging after being in use for a few hours. There are a lot of happy customers, so I'm not sure how isolated this is to my situation, but it strikes me as weird. An update to allow for a remote controlled reboot or off/on would be much appreciated.", "verified": true, "helpfulness": "6/7", "author": "Jennifer H Yang"}, {"rating": 5.0, "review": "Wow! That's all I can say. I can watch Amazon prime, prime music, photos. I love that I can pair my iPhone and watch YouTube on my big screen. Wish they made an app for the iPhone for the remote. I am uber impressed! Best gift I've gotten myself.  Picture quality is great! Can't wait to see what else this little gadget can do.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 1.0, "review": "every 30 mins it through s error please check your internet . I have chrome TV , apple tv and also roku running from years with out issues.I am not sure it that is with only my FireStick. Try to resolve the issue from 4 days , I am manually unplugging and plugin back it for restingits frustrating to use like this.", "verified": true, "helpfulness": "3/5", "author": "JRALL"}, {"rating": 3.0, "review": "I think its a good product. However when streaming Netflix  or prime videos the audio quite often lags behind the video. I have a chromecast that doesn't have this problem.", "verified": true, "helpfulness": "0/0", "author": "Mark Alice"}, {"rating": 2.0, "review": "Maybe I got a lemon.  For me, this was really 0 stars, but I give it 2 for potential.I pre-ordered the Fire TV Stick for cheap.  I've owned 9 dedicated media players (in addition to dvd and blu-ray players that also handle some streaming).  Using the Fire TV Stick, I was never able to stream more than 20 minutes of a movie from Netflix, Amazon, or local media via XBMC.  The Fire TV Stick would get crazy hot and then show a wifi error: \"Connected with Problems\".  I would turn it off, let it cool down for an hour, and then try again.  I tried connecting to two different wifi routers (2.4Ghz and 5Ghz).  Same issue.  In the end, I returned the stick because I just couldn't make it work.I was plugging the Stick into an HDMI switch (via the dongle) and not directly in the TV.  I'm not sure if that could have caused the issue.As a comparison, I give the full Fire TV a 5 star review.  The full Fire TV adds ethernet (no wifi issues), optical out (my receiver doesn't handle HDMI), and supports IR (with a USB IR receiver).", "verified": true, "helpfulness": "1/1", "author": "M. Sorensen"}, {"rating": 5.0, "review": "Good product", "verified": false, "helpfulness": "0/0", "author": "One customer"}, {"rating": 5.0, "review": "Got it in today, and connecting was a breeze.  Already preloaded with my prime, and the interface is intuitive.  Downloaded a couple of free games to play with my 4 year old, and Netflix account was easy to setup.  There's a ton of free stuff on Prime, and between that and Netflix, I'm good for about 15 years worth of stuff to watch.  Now I'm thinking about getting the more expensive Fire TV for the living room, and keeping the stick in the bedroom.  This is the death of cable TV!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works well, plays netflix and prime video just fine. i use kodi(xbmc) to play local media from my nas. if you are looking for an android stick to root and do what you want this is not it. if you are looking for a good device with good navigation and smooth media playback then this is for you. the ui for this and the apps for it are great, you dont need a kb and mouse to navigate apps like you do with other android sticks.", "verified": true, "helpfulness": "0/0", "author": "adam kennedy"}]