[{"rating": 5.0, "review": "I love the convenience of this.", "verified": true, "helpfulness": "0/1", "author": "Elvira"}, {"rating": 5.0, "review": "Works as advertised. Installation is fast and easy. With Prime everything is set for free viewing movies, TV series, Showtime Anytime, etc. I am going to purchase another one for a second TV in the house.", "verified": true, "helpfulness": "0/1", "author": "D. Wile"}, {"rating": 5.0, "review": "I love my fire stick! The apps that are free are awesome. I am very happy with the easy set up too!", "verified": true, "helpfulness": "0/1", "author": "Debbie Cluckey"}, {"rating": 5.0, "review": "So far, so good. It does everything I ask it to do.", "verified": true, "helpfulness": "0/1", "author": "John Lewis"}, {"rating": 5.0, "review": "I love it! we were using our old playstation to watch hulu netflix n amazon instant. Our fan was getting loud in the playstation it was dying on us and didnt really want to spend so much money on an apple tv so $40 very well spent! easy to use and install . We just love it !", "verified": true, "helpfulness": "0/1", "author": "Sylvia Truc Trinh"}, {"rating": 5.0, "review": "We love the fire stick. I'm also a prime member and there is a lot of free things to watch, and music is great.", "verified": true, "helpfulness": "0/1", "author": "Edie"}, {"rating": 4.0, "review": "Enjoing it so far", "verified": true, "helpfulness": "0/1", "author": "Gail R Sykes"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Sarah Berry"}, {"rating": 4.0, "review": "Like it very much but Prime day was a cancer. I hope they are embarrassed. I even bought this that day for $24.95 only to find the order never went through. A rep and supervisor said too bad so sad. It did not matter so I bought it anyway. Buyers Beware!", "verified": true, "helpfulness": "0/1", "author": "Carol"}, {"rating": 3.0, "review": "Fire Stick is currently not compatible with my cable providor, Charter, which is kind of frustrating since they are a major provider, so I've really only been able to use it for Netflix. The home screen takes some getting used to, you seem to have to do a lot of button clicking to find your favorite apps. These should be more easily accessible, or at the top of your home screen. The free games are a nice touch. Since my cable provider is not listed, my 8 year old and I have spend a lot of time playing games. Overall, not a bad deal for the price.", "verified": true, "helpfulness": "0/1", "author": "Kiel Lewandowski"}]