[{"rating": 1.0, "review": "Didn't work properly. Would always give us a notifacation that our internet was too slow. But we have a very good signal 65mbps. Could not get a responce from tech support", "verified": true, "helpfulness": "0/1", "author": "Nancy Smith"}, {"rating": 5.0, "review": "My husband received the fire stick as a Christmas gift from our kids and we love it! Already prime members just another thing to love about Amazon! I plan to buy a game controller, I didn't know it was for games too!", "verified": true, "helpfulness": "0/0", "author": "elizabeth martinez"}, {"rating": 5.0, "review": "I love it!!!! I use it more than I watch regular tv!!!", "verified": true, "helpfulness": "0/0", "author": "megan"}, {"rating": 4.0, "review": "Easy to use. Works as advertised. There does seem to be an issue with the NFL app, though this certainly isn't do to the hardware. Overall impression is very goo.", "verified": true, "helpfulness": "0/0", "author": "David L. Martin"}, {"rating": 5.0, "review": "Excellent Product. Well worth the money. Very quick loading speed for the size. The android app is very responsive. I would recommend this over chromecast.", "verified": true, "helpfulness": "0/0", "author": "Adam Martin"}, {"rating": 5.0, "review": "Love it, everything loads fast, couldn't be more pleased!", "verified": true, "helpfulness": "0/0", "author": "SteveK77"}, {"rating": 5.0, "review": "love it. can sideload apps like kodi (formerly xbmc), has a snappy response, almost no setup required. good stuff. admittedly, we got it when it was $20, so i can't speak for it at full price, but for what we paid, it's great!", "verified": true, "helpfulness": "0/0", "author": "S. L."}, {"rating": 5.0, "review": "The Fire TV Stick has been great for us.  We don't have cable or satellite, just antenna TV, so it has opened a whole new world of streaming entertainment. The Stick has worked flawlessly since we activated it.", "verified": true, "helpfulness": "0/0", "author": "David T Walker"}, {"rating": 5.0, "review": "I have had roku, apple tv, and i also have a smart tv.The fire stick is the best of all.The user experience is the easiest and most pleasant of all of them and picture, resolution, buffering...all excellent.Plenty of apps...games, too.Remote is simple (very), making it something even a non-electronic-savvy person can enjoy.The option of using any other device as a remote is great, too...especially if you are like me, and tend to lose remotes.I would definitely advise anyone looking for this type of entertainment to buy this product!", "verified": true, "helpfulness": "0/0", "author": "Mlowe"}, {"rating": 5.0, "review": "Awesome, love this thing!!!!!!!!!I have a (somewhat) smart TV but it is a pain to navigate when connected to the internet. This makes it super easy.Would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "ATCZERO"}]