[{"rating": 5.0, "review": "Very pleased with my purchase.  It is easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "SusanM"}, {"rating": 3.0, "review": "set up easily. does not interface with any apple products (ipad, iphone) so the ability to watch youtube, etc is pretty limited.  A big part of the draw was the ability to watch what was on the ipad on tv.. only works with their proprietary tablets", "verified": true, "helpfulness": "0/0", "author": "Gary Wahl"}, {"rating": 5.0, "review": "We love it. Very convenient.", "verified": true, "helpfulness": "0/0", "author": "CDymond7"}, {"rating": 4.0, "review": "This works very well!  Easy to install.  The only tiny complaint I have is that's it's very small - easy to lose and a little hard to read.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Sanders \"Kathleen\""}, {"rating": 5.0, "review": "Worked great out of the box. Love it!!!", "verified": true, "helpfulness": "0/0", "author": "R. Washington"}, {"rating": 1.0, "review": "Doesn't work with WiFi and doesn't buffer unless you are the most patient person in the world and have nothing else to do this is not for you.", "verified": true, "helpfulness": "1/2", "author": "Abby"}, {"rating": 5.0, "review": "I absolutely love My  Fire Stick !1 I can't get enough of it!  I can watch and listen to everything I have been missing!!", "verified": true, "helpfulness": "0/0", "author": "Carolyn D. Martin"}, {"rating": 5.0, "review": "Works perfectly, no buffering. I am using an internet service with 12mg. This thing works great.", "verified": true, "helpfulness": "0/0", "author": "rmaddtx"}, {"rating": 1.0, "review": "If I could rate no stars I would  please Google search this as to the many connectivity problems", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy breezy just love how simple and rewarding the technology is in the Firestick. I especially enjoy streaming with one remote vs two or three, I highly recommend this to anyone who enjoys streaming", "verified": true, "helpfulness": "0/0", "author": "karenne"}]