[{"rating": 4.0, "review": "The Fire Stick is easy to set up and put into operation. This was especially true in my case because of my internet provider connection. I tried another brand before going to the Amazon Fire Stick and it did not work with my internet provider. If you sign up for Amazon Prime there is more stuff there than you could use in a lifetime. A good buy.", "verified": true, "helpfulness": "0/0", "author": "Patricia Wojnar"}, {"rating": 3.0, "review": "Surprised at how many movies still cost money to rent, or buy, even with Prime.  Old old movies even, would have thought larger selection for free.  I don't subscribe to Netflix on the Firestick as that is just one more expense.  Glad this was a gift, wouldn't buy one.", "verified": true, "helpfulness": "0/1", "author": "Sandra V."}, {"rating": 5.0, "review": "Best thing I ever bought!", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 4.0, "review": "Does what it says", "verified": true, "helpfulness": "0/0", "author": "Skurdlybird"}, {"rating": 4.0, "review": "Sometimes freezes", "verified": true, "helpfulness": "0/0", "author": "G. McKinley Weaver Jr."}, {"rating": 3.0, "review": "It doesn't seem to have quite the horsepower to decode some videos without stuttering.  The hardware decoding seems to handle some codecs fine, and others it just doesn't have the horsepower to do it in software.  So it's fine with Netflix and YouTube, but with PLEX and higher quality video, you either get stuttering, or you transcode it to something \"friendly\" for the stick to handle.  There's extra horsepower required on one end or the other.  Right now, my computer is picking up the slack.It's bad enough that I've already ordered a different device with a quad-core processor and double the RAM for about the same price.  I get the added benefit of a wired network connection, so internet traffic doesn't have to fight local video traffic anymore.This is fine for internet streaming, but lacks oomph for locally streamed media collections without transcoding.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Easy to install. Easy to link to my phone and iPad for controls. Was upset though that the usb has to use the wall outlet. Neither my cable box nor tv had enough power output for it to even turn on which in today's technology era I found odd.", "verified": true, "helpfulness": "0/0", "author": "john hartley jr"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "elna"}, {"rating": 5.0, "review": "We absolutely LOVE love love our Fire Stick!!!!! So easy to use and operate, we got the cute little package which I should mention was not that crappy hard to open plastic that many things come in these days, rather this was a simple and clean presentation in a nice box- thank you for NOT putting this in plastic.We opened it right up and plugged it in and the rest is history! We started watching movies and playing games within 10 minutes (tops) of plugging it in; you do not have to enter all your Amazon info that was preprogrammed, it just took a few to enter our other logins for Pandora and Netflix but was easy to do and took no time.It's relatively bug free, we have speedy wifi so as long as it's up and running as usual the Fire Stick has no problem playing HD movies streaming over our connection and some times we have other things going at the same time (laptop etc).Way to go Amazon, this thing is killer and really the next cool thing!I loved our Kindle Fire but the stick takes it to a new level.Oh, it's great for traveling too, so portable and space saving that you could toss it in your purse/carry on and plug in at your hotel while vacationing, business etc.We have taken our cable down to bare bones because we use this so much we barely watch regular TV!", "verified": true, "helpfulness": "0/0", "author": "SKC"}]