[{"rating": 5.0, "review": "Convenient, easy set up, easy navigation. Will be buying another.", "verified": true, "helpfulness": "0/0", "author": "Lori Mallory"}, {"rating": 5.0, "review": "Love, Love, Love my new Fire stick. It turned our HD TV into a smart TV... It was super easy to install, and my son is loving the games. I can now watch some of my HULU shows in private. Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 5.0, "review": "Fantastic product. I got mine early for $19 for being a Prime member but would have no problem paying the $39 for it now. It solved one of the problems in my house with having 2 or my TV that only have DVD players on them. I can just take this plug it into the HDMI port on either then Netflix and Amazon Videos are ready to go plus many others. The best part about this is how quickly and easily it can be moved from tv to tv or be taken with you anywhere. I took it on vacation recently and plugged it right into the hotel tv and was ready to go. I used my phone as a hotspot and it still worked great with no lag.", "verified": true, "helpfulness": "0/0", "author": "Matt N"}, {"rating": 5.0, "review": "Excellent product, fast, simple,  effective. Amazing with five.", "verified": true, "helpfulness": "0/0", "author": "Michael DeHaven"}, {"rating": 5.0, "review": "Works great, easy to set up on my NON-Smart  TV.  Voice activated remote works like a champ.", "verified": true, "helpfulness": "0/0", "author": "patty"}, {"rating": 2.0, "review": "I have ordered the more powerful Fire TV .  Fire Stick has problems (buffering?)", "verified": true, "helpfulness": "0/0", "author": "RPick"}, {"rating": 5.0, "review": "It's wonderful!  Love that I can see movies that I haven't seen in a while when I want.  Also love that I can get Pandora!", "verified": true, "helpfulness": "0/0", "author": "Anabru"}, {"rating": 1.0, "review": "Got the stick for 50% off its regular price. Power cord is not long enough. Works terrible with our wifi. Streamed shows constantly buffer. Have a Roku on a second TV & never have any problems with it. Sorry, love Amazon, cannot stand the stick.", "verified": true, "helpfulness": "0/0", "author": "Jnikischer"}, {"rating": 1.0, "review": "Good idea, but too many frustrating bugs that need to be worked out.  I read other reviews before purchasing, and figured maybe those complaining about \"freezing\" and not working properly might be in a situation with low connectivity issues, but...  Well, they were right.  The design has too many flaws to be considered worthy of purchase.", "verified": true, "helpfulness": "0/0", "author": "Marty Straub"}, {"rating": 5.0, "review": "Shipping was EXTREMELY fast, love the product so far!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}]