[{"rating": 5.0, "review": "Awesome Sauce!", "verified": true, "helpfulness": "0/0", "author": "don s clements"}, {"rating": 1.0, "review": "The screen casting with 2015 galaxy tablet s 10.1 does not work.  very disappointing.  If I hadn't gotten at a huge discount I would return for chromecast", "verified": true, "helpfulness": "1/1", "author": "BRIAN F."}, {"rating": 4.0, "review": "I like the Fire stick, but find the Fire to be a better option over the stick. I have both. I've had the Fire for months on the living room tv and love how easy it is to use. My four year old can even operate it. So, when our Chrome device on my daughters tv when out I ordered the fire stick as a replacement. It's good. Still easy enough for her to use and if you aren't particular a great option for someone who doesn't want to pay the higher cost for the Fire. There are some notable differences between the two deceives,though.The remote is better constructed and more responsive on the Fire. Plus, the fire has HBOGO and the stick doesn't, which if I knew at the time of ordering, would have affected my decision to purchase it over the Fire. Overall both are good devices and I would recommend.", "verified": true, "helpfulness": "0/0", "author": "Peedelee"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Jenny Weaver"}, {"rating": 5.0, "review": "Fite stick works great.", "verified": true, "helpfulness": "0/0", "author": "Michael wilder"}, {"rating": 5.0, "review": "love the layout and the functionality.  Loads quicker than chromecast, looks better, and the fact that I don't NEED to use another device makes it a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Works exactly like it is supposed to included power plug is very long making it easy to find an extra power outlet and the actual part that plugs into the socket is small enough not to block the second socket (this is absolutely infuriating when it happens).No problem receiving HD signal through multiple walls without interruption. It is also VERY responsive (more responsive then my Smart TV in the living room).", "verified": true, "helpfulness": "0/0", "author": "Justin Grant"}, {"rating": 4.0, "review": "Would have been nice to know that you need to plug the stick in to electric.  So far it works well.", "verified": true, "helpfulness": "0/0", "author": "JMS"}, {"rating": 4.0, "review": "works great and easy to set upone exception--the back of the remote is very difficult to open to insert  batteries--this needs to be addressed!! people should not have to go find a tiny little slotted screwdriver to open the battery compartment for a cheap little remote!!", "verified": true, "helpfulness": "1/1", "author": "Howard Sherman"}, {"rating": 5.0, "review": "Very simple to install and use", "verified": true, "helpfulness": "1/1", "author": "MC"}]