[{"rating": 5.0, "review": "Love this thing.  Very easy to set up and the kids love being able to play their music.", "verified": true, "helpfulness": "0/0", "author": "Jack Bang"}, {"rating": 5.0, "review": "So far, so good! We have been using Chromecast for a couple years now. I like the layout and ease of use of the Fire TV Stick better.", "verified": true, "helpfulness": "0/0", "author": "WaterSki2011"}, {"rating": 3.0, "review": "The menu is great but streaming can be glitch even with great WIFI signal.", "verified": true, "helpfulness": "0/0", "author": "jeremy nelson"}, {"rating": 2.0, "review": "The fire TV stick seemed generally good in the begining but within a week the remote has started malfunctioning. The response time for remote is very bad now. I am managing with the mobile remote app. Lets see how reliable the fire stick is overall. If anymore malfunction I will return it.", "verified": true, "helpfulness": "0/0", "author": "Abinash Das"}, {"rating": 5.0, "review": "Easy installation and set up! It came a few weeks before I expected it! Next step...getting rid of cable!", "verified": true, "helpfulness": "0/0", "author": "Sue J"}, {"rating": 4.0, "review": "I like the Amazon fire stick because of the access to my Amazon prime movies and apps like Hulu. I gave it 4 stars because I expected an all one remote experience. I think that the remote should have quick buttons to maneuver to popular apps like Vudu. I was unhappy that Vudu wasn't available because I have so many movies on my account. Overall it loads faster then the Roku but lacks the apps most movies lovers like to view. Games are a plus and I'll eventually purchase the game controller.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Love it love it! Buying it for others for Christmas!", "verified": false, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "i love it", "verified": false, "helpfulness": "0/0", "author": "ljiljana jankovich"}, {"rating": 4.0, "review": "I truly like this device, but it has not developed into love just yet. There are some issues with video playback - especially in Hulu Plus. However, I'm hoping that with some updates to address these issues, this device will be a five star rating, easy.", "verified": true, "helpfulness": "0/0", "author": "R. Tisdale"}, {"rating": 4.0, "review": "perform as expected. Still learning how to load app into the stick.", "verified": true, "helpfulness": "0/0", "author": "Kenny"}]