[{"rating": 5.0, "review": "a great purchase did everthing I though it would do", "verified": true, "helpfulness": "0/0", "author": "harry berrian"}, {"rating": 3.0, "review": "My internet speed is to slow for the fire stick to work well...Amazon should have let us know that to work well you will need at least 5Mbps.  Also sending no instruction book or good way to know how to work the thing is poor customer care.  I hope by speeding up my internet it will work better...that will cost me $$$.", "verified": true, "helpfulness": "1/3", "author": "Clifton Lewis"}, {"rating": 3.0, "review": "We've tried a few of these types of devices in our house (Roku 2, Roku 3, and a Sony one). I'm liking this thing less and less every time I use it. It's nice that we don't have the extra wires up by the tv now, but there are a few things that I don't like about it:- It freezes at least once a day and needs to be reset.- The remote lags- The menu doesn't have the best interface- There are certain apps that are free on Roku that Amazon charges for with the Fire TV StickThe problem with it disconnecting from wireless has been fixed. That being said, I was able to pre-order it with my Prime account and didn't pay full price, so I can't complain too much.", "verified": true, "helpfulness": "0/0", "author": "S. Lear"}, {"rating": 5.0, "review": "I love that it is super smooth, I haven't had any trouble with buffering or anything like that.  I plugged it into my tv and within seconds I was setting it up and watching my favorite shows.  The only downside I would say is the fact that you can't cast your whole screen to the tv in order to watch what you want.", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Eric S. Guerrero"}, {"rating": 5.0, "review": "Loving the Fire Stick so far! We got it to use with our sling tv subscription.  Great picture and sound quality. Easy to set up and easy my Amazon fire app works well with it.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "great deal", "verified": true, "helpfulness": "0/0", "author": "Clinton Morton"}, {"rating": 3.0, "review": "Would be better if it had a browser and you could hook up to the Internet", "verified": true, "helpfulness": "0/1", "author": "laurence basche"}, {"rating": 5.0, "review": "The only thing I've watched is Bosch, but the fire stick worked fine.  It was easy to set up and I look forward to using it more.", "verified": true, "helpfulness": "0/0", "author": "CatWoman"}, {"rating": 5.0, "review": "only have Netflix but pic. was beautiful. & we enjoyed it very much. I might try amazon streaming some day tho .", "verified": true, "helpfulness": "0/0", "author": "Melody A Strait UP Fan of TheGeorgeStrait Fan Club"}]