[{"rating": 2.0, "review": "Well I have received it the directions seemed very easy but I cannot get the remote to sync with tv and how do I know if it needs registered or not that popped up also, I do not have Prime I was going to do the Netflix movies can anyone give me advice on what to do now that I have it hooked up to my Tv I cannot make it go", "verified": true, "helpfulness": "0/1", "author": "Lisa Dincher"}, {"rating": 5.0, "review": "Love the fire stick", "verified": true, "helpfulness": "0/0", "author": "SPullen"}, {"rating": 5.0, "review": "Awesome device!", "verified": true, "helpfulness": "0/0", "author": "Chase"}, {"rating": 5.0, "review": "Easy to install. Easy to use. My family and I have been using this for 5 days now, and it has supplanted the Google Chromestick we used to use and allows me access to all of my content on the big screen it is connected to. I am glad let my wife talk me into getting this!!! Highly Recommended.", "verified": true, "helpfulness": "0/0", "author": "Catman"}, {"rating": 4.0, "review": "Still trying to figure out how to use it. Packaged nice", "verified": true, "helpfulness": "0/0", "author": "Peggy kester"}, {"rating": 5.0, "review": "Just what I expected and best of all, we cut the cord with Comcast!", "verified": true, "helpfulness": "0/0", "author": "Eric T. Metzler"}, {"rating": 4.0, "review": "Waiting for xfinity to work with them and hbo go to show up, but all else is great!", "verified": true, "helpfulness": "0/0", "author": "Joshua B. Gray"}, {"rating": 5.0, "review": "Love this device!  The streaming is fast and there is so much to choose from.  Can't wait to figure out everything it does.", "verified": true, "helpfulness": "0/0", "author": "Michelle Borders"}, {"rating": 2.0, "review": "I'm a long-time Amazon Prime member and order hints from Amazon all the time, but am returning this. The Netflix app's audio/visual is perpetually unsynced and there's no way to search only video or apps included in my subscription, so I'm always finding video that I'd have to pay more for. Ended up feeling more like an advertising platform for pay-per-view-type movie rentals and, at this price, I can get something that works much better with the free platforms AND allows me to rent video as well. Two stars because it wasn't broken, just very disappointing.", "verified": true, "helpfulness": "1/2", "author": "J. Harrell \"JAH\""}, {"rating": 1.0, "review": "Great product but it drops wifi constantly.", "verified": true, "helpfulness": "0/0", "author": "Kara Carapella"}]