[{"rating": 3.0, "review": "I love all of the variety of shows/movies available, but I'm disappointed with the connection problems I keep seeming to have. I have owned this product for less than a month and I feel like I keep reconnecting to our wireless again and again. Our router is less than a year old, so it shouldn't be a problem. I have connected the TV stick to it's adapter and into the wall so it has the best connection and it still seems to lose connection off and on. I'm a little disappointed but I wanted a product that had Hulu Plus, Netflix, etc. all in one place because I'm over cable! Perfect for what I need, but I'm not sure how to fix the connection issue.", "verified": true, "helpfulness": "0/0", "author": "April Keeley"}, {"rating": 2.0, "review": "IMHO the interface is not at all user friendly.Could not find out how to turn it off.  Ended up unplugging it.", "verified": true, "helpfulness": "0/0", "author": "PA Shutterbug"}, {"rating": 5.0, "review": "Awesome. Love it! I have an Apple TV that I like for different reasons, but the Fire Stick does what I need and is great for travel.", "verified": false, "helpfulness": "0/0", "author": "Rich Karns"}, {"rating": 5.0, "review": "This is a well designed piece of hardware. Very easy to install and the use is very simple. This has allowed me to watch vod on my home tv.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 5.0, "review": "Great product! Works well and is very simple to setup and use.  I would highly recommend this product to anyone!  Good work Amazon!", "verified": true, "helpfulness": "0/0", "author": "Mitch"}, {"rating": 3.0, "review": "I have had the fire stick for about 7 months, lately I have been having issues with it. While streaming Netflix or Hulu  the picture keeps freezing, the dilalouge continues but the picture is frozen.", "verified": true, "helpfulness": "0/0", "author": "K. Schmidt"}, {"rating": 4.0, "review": "Interesting product. It works easily but really needs to come with a book.  I had to order a separate book on Amazon to figure out some options.", "verified": true, "helpfulness": "0/0", "author": "Mary Ellen Blohowiak"}, {"rating": 3.0, "review": "We have had our stick for 3 months now. I so want to give this 5 stars. I love that I can watch TV for about $35/month instead of the $150 I used to pay Comcast (we have Sling w/ HBO). But, I can't give it all my stars since  have to reboot the thing all the time, especially when using Sling or the PBS app.These are what we primarily use with the Stick--it can be frustrating. Please update the firmware. I have a similar request for Sling.On a happy note, I am glad that I no longer have to dedicate my laptop to HDMI or Chromecast when I want to watch a movie or show on Prime.", "verified": true, "helpfulness": "0/0", "author": "M. White \"Mel\""}, {"rating": 1.0, "review": "Awful...keeps buffering.All my other devices do fine.Movies keep stopping.Says not connected....then I check & see that I am connected.Then network error appears.Terrible device...needs lots of correction", "verified": true, "helpfulness": "2/2", "author": "Harvey Freeman"}, {"rating": 5.0, "review": "VERY VERY HAPPY with this fire stick!!!!! I honestly like it much better than the full size version...less clutter and this even appears to stream faster, I have not had any re buffering issues at all...will for sure purchase some for Christmas gifts this year and also purchase more for myself once the other streaming devices I have give up! Wont ever purchase any other type of device other than the Amazon fire! LOVE LOVE LOVE IT! And super simple easy set up! Which is a plus!", "verified": true, "helpfulness": "0/0", "author": "Nancy Labeda"}]