[{"rating": 5.0, "review": "We have not tried it yet, but it is very very easy to install. We did try to get in and look to see what movies are out there . I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "bob ross"}, {"rating": 4.0, "review": "I have been enjoying series that I would not have seen if I hadn't been gifted my Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Sally Ann May"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Linda Thorpe"}, {"rating": 3.0, "review": "Great price, got it at the Amazon prime membership special price.  It doesn't always mirror the screen from my Kindle Fire HDX which was the main reason I bought this, sometimes i have to reboot one or the other first. Seems a little better with the subsequent OS updates.  Tried to share the screen from a Win 8 tablet (Asus T300) where it could see the Stick, but couldn't finish negotiating the linkage (usually disconnecting very quickly upon exchange of PIN number). When are we going to get full Miracast support with Windows? Also would have expected many more apps - more on par with what the Fire HDX supports!", "verified": true, "helpfulness": "0/0", "author": "Innovato"}, {"rating": 4.0, "review": "The Fire TV Stick is being used in conjunction with my satellite service. I find myself watching more of it than my subscription service (for variety's-sake). The stick offers more than the service does. I have the choice of accessing Netflix, Crackle, or Amazon Videos I had purchased. The Prime videos are listed and I can either select them to purchase/join Prime. There are game apps available to use with the \"adequate\" remote or a game controller that can be bought. There is also an option to buy a voice-controlled remote (why?-just get up already and change the channel) that can be used for a few options...not enough to buy it, in my opinion. I REALLY enjoy my Fire Stick. The reason I rated four instead of five stars is that the stick dropped a few times more than expected (even after I had my lines and TV checked)...I think the problem is in the stick. Other than that, my family loves the options, I watch it more than my service, and honestly...when watching it, I don't miss my service. This is leading me to reconsider the service. It it really worth it? Keep the internet for WIFI and drop the other stuff. Time will tell. One more increase in service fees and I will know what to do!", "verified": true, "helpfulness": "0/0", "author": "Dwranny \"Dwranny\""}, {"rating": 3.0, "review": "It works like it was advertized but there's no way to shut it off", "verified": true, "helpfulness": "0/0", "author": "Pedro Ramirez"}, {"rating": 4.0, "review": "We cut the cable, we are using it with sling TV they're new so there is a lot of bugs still. But for the price it is an excellent choice for me.", "verified": true, "helpfulness": "0/0", "author": "Rene Hernandez \"ranarene\""}, {"rating": 4.0, "review": "We like it.  Seems to do the job.", "verified": true, "helpfulness": "0/0", "author": "C. Olofson"}, {"rating": 5.0, "review": "Had a Netflix account and just did not find what I liked on it.  This is so much better and if for some reason I would like to get my Netflix account back the Fire TV Stick is compatible.  The whole family enjoys it.", "verified": false, "helpfulness": "0/0", "author": "Clara Peck"}, {"rating": 5.0, "review": "The firestick is awesome!  Between my prime account, netflix and hulu plus I get all the tv I want for less than $30 a month.  Bye bye high cable bills!", "verified": true, "helpfulness": "0/0", "author": "Sherry S."}]