[{"rating": 5.0, "review": "Fire stick worked the best of any of these devices (that is after I spent two weeks straightening out the fact that I ALREADY HAD amazon prime and they tried to make me susbscribe again (In case you don't know,people, this device was INVENTED TO SELL AMAZON PRIME - ITS NOT MUCH GOOD WITHOUT IT)", "verified": true, "helpfulness": "0/0", "author": "PDS"}, {"rating": 5.0, "review": "Worked good", "verified": true, "helpfulness": "0/0", "author": "Busy Mom \"Wash -es-alot!\""}, {"rating": 5.0, "review": "I am very happy with my Fire TV Stick. It was easy to install,l once I picked the correct language. My first accidental pick was German. Since I am American (no German blood), it took me a couple of tries to get back and get the correct language. After that, install was a snap even for me with little or no tech experience.", "verified": true, "helpfulness": "0/0", "author": "Happy Person \"Red Rock Woman\""}, {"rating": 5.0, "review": "I absolutely love my fire stick!! I just moved into my first apartment and this was exactly what I was looking for. I use it for Netflix and Hulu mostly. I definitely recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Sarah Wheeler"}, {"rating": 5.0, "review": "this little stick opens up a huge world of viewing opportunities , and it was super easy to install! I'm not the most tech savvy, but I had it installed in under 15 minutes. I definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "Kika \"Kika\""}, {"rating": 5.0, "review": "Works great! The remote is easy to use and the set up was even easier. Just plug into the wall and into the HDMI and its ready to go!", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 4.0, "review": "After some tweaking and a couple of telcons with the help desk the FTVS is working pretty good.  I am disappointed that it doesn't support Netflix.  I guess amazon sees Netflix as a competitor.", "verified": true, "helpfulness": "0/0", "author": "Richard W McGaughey"}, {"rating": 5.0, "review": "Easy to set up and use. Best invention ever.", "verified": true, "helpfulness": "0/0", "author": "kelly doud"}, {"rating": 5.0, "review": "Love it, get to watch,  shows , movies and sports anytime (:", "verified": true, "helpfulness": "0/0", "author": "Veronica S.Rodriguez"}, {"rating": 5.0, "review": "The Fire TV Stick is easy is easy to set up, use and is economical. I enjoy watching movies I want to see at the time I want to watch them without interruption.  The Fire TV Stick makes that possible.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]