[{"rating": 4.0, "review": "I love and hate this thing.  love it because when you root it , makes it feel like a great decision, bad thing is if you are streaming, it can give you a out of memory error which is nuts.  but other than that it is great", "verified": true, "helpfulness": "0/0", "author": "REGG \"regg949\""}, {"rating": 1.0, "review": "Package was open and stolen. So this product is horrible don't buy!! You'll get screwed over and amazon won't do s*** about it!!!!!", "verified": true, "helpfulness": "0/1", "author": "derrick dart"}, {"rating": 5.0, "review": "So far I really like it. I'd love to get local channels, and if you can then I have not figured it out.The setup was extremely easy!!! I didn't even need directions. (I am electronically challenged.)I'd recommend it.", "verified": true, "helpfulness": "0/0", "author": "M. Bagshaw"}, {"rating": 1.0, "review": "Just quit working after less than two months.", "verified": true, "helpfulness": "0/0", "author": "Kris Blessing"}, {"rating": 5.0, "review": "It is awesome. We love it! So many movies that I liked that are available to watch some of them are even free! We get free local channels and not to mention the awesome concerts shows too! I happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Fink"}, {"rating": 4.0, "review": "It would slow down many times . I would also have to reboot it a lot. But I loved it had a remote and it was ease to use.", "verified": true, "helpfulness": "0/0", "author": "Brooks Mixon"}, {"rating": 5.0, "review": "i like it", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "This is awesome!! Super fast shipping.. 1 day dont get any better!", "verified": true, "helpfulness": "0/0", "author": "Veronica"}, {"rating": 4.0, "review": "UPDATE on last review:  I spoke to my cable company and they helped me resolve my router issue which is what was causing the stall out and NOT the Amazon Fire Stick.  I take it all back.  Rock On AMAZON!!  I noticed a lot more movies become available to me once the issue did get resolved.  Fancy that, too!", "verified": true, "helpfulness": "0/0", "author": "Victoria W."}, {"rating": 4.0, "review": "There is a learning curve and you have to follow it carefully. The jury is still out on its effectiveness and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Robert Bone"}]