[{"rating": 5.0, "review": "Good bargain.  Great TV.  Well worth the price.  Do not miss cable at all!", "verified": true, "helpfulness": "1/1", "author": "Jamie Falk"}, {"rating": 5.0, "review": "Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Linda Gillispie"}, {"rating": 5.0, "review": "Wonderful invention for those of us who don't want to upgrade our HDTV.", "verified": true, "helpfulness": "0/0", "author": "Rocio Alba Gonzalez"}, {"rating": 4.0, "review": "It works well with the included remote.  The Android App for your phone however is buggy and freezes up. Wish I knew about it before purchasing a Chromecast, which doesn't allow you access to Amazon Prime stuff.  The Chromecast app was far superior for Android though.. you could fully control it with your phone.  This one, not so much.  Streaming quality has been good so far.. have watched several Prime and Netflix movies on my 8 year old Panasonic HDTV. with no buffering or quality issues. .", "verified": true, "helpfulness": "1/1", "author": "MarkinNC"}, {"rating": 5.0, "review": "What a great little item you can access everything from here and its small and portable And most TVs in hotels have the HDMI hookup", "verified": true, "helpfulness": "0/0", "author": "LaVonne"}, {"rating": 5.0, "review": "This is amazing!! I will be buying an additional stick for another TV so we don't have to move this around. Good bye cable. My family loves the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Sondra G. McLeod"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "alt"}, {"rating": 5.0, "review": "Love it can't get enough. Best buy yet.", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 4.0, "review": "My family is enjoying the use of this unit while we figure out all the components if offers.  I like the Sling tv app and Amazon Prime availability.  It's so much better than trying to watch a movie on the laptop.  I haven't had any connectivity issues at all.  The movies stream perfectly, so far.  I have Verizon FiOS 50/50, so some other reviewers may have an internet problem, not the Fire Stick's issue.", "verified": true, "helpfulness": "0/0", "author": "Katie H."}, {"rating": 4.0, "review": "I like the Fire Stick and so do my kids. I do have Amazon Prime but not Hulu or Netflix. I still get a decent variety of entertainment. I would've rated this as a five if it separated the \"free\" from the \"pay\" better. I have played a few games and have been debating on getting the controller. If games are important to you it will be a necessity.", "verified": true, "helpfulness": "0/0", "author": "K. Houston"}]