[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "PAUSE002"}, {"rating": 5.0, "review": "Oh my god i love it who would have thought it's so easy to work. i now watch what i want when i want this is great", "verified": true, "helpfulness": "0/0", "author": "Ruth Ellen Butcher"}, {"rating": 5.0, "review": "I have only had it for 2 weeks but I LOVE IT!!  It seems to \"trip\" once in a while, but not too bad.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Niddlediddle\""}, {"rating": 1.0, "review": "This device freezes up more than actual shows are streamed.  I spend more time resetting it than I actually spend enjoying watching anything.  When it actually is working and I utilize my promo subscription of Sling TV (on the rare occasion it will load) I am constantly waiting on programs to buffer or am kicked out.  I subscribe to both HULU and Netflix and have never had any issues, so I know this is not a network problem.Very poor quality device partnered with even poorer quality tv streaming subscription ( SLING TV). I will be returning this device, canceling the subscription and spending the extra money on an Apple TV.  What they say is true \"you get what you pay for\".", "verified": true, "helpfulness": "1/1", "author": "Jessica"}, {"rating": 5.0, "review": "I love my Fire TV Stick so much that I purchased a second one. We can watch prime on both floors. It's small and easy to set up, and no wires showing.", "verified": true, "helpfulness": "0/0", "author": "Fran57"}, {"rating": 5.0, "review": "It was everything I wanted and easy to use which is the big thing to me the controls get me confused but not these", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 1.0, "review": "Disappointing.  Not sure what I expected, but cannot watch live tv or HD programming, or maybe I didn't give it a fair shake.  If not for movie library or 2 day shipping, it would be returned.", "verified": true, "helpfulness": "0/0", "author": "Michael E McCarthy"}, {"rating": 1.0, "review": "Mine works great when it actually works. Drops WiFi signal every 20 minutes. Tried resetting, tried everything. Seems a common issue on the Amazon forums, which Amazon hilariously doesn't monitor. Apparently the antenna in the stick is too weak.  I'll stick with the Google Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Gregory M."}, {"rating": 3.0, "review": "The Fire Stick is a very good streaming device.  The only thing preventing it from getting more stars is the lack of a Vudu app.  Every other streming stick out there can access Vudu, why can't you Amazon Fire Stick.  Add Vudu and my rating will improve.", "verified": true, "helpfulness": "0/0", "author": "Tony Genco"}, {"rating": 5.0, "review": "See my review of the Certified Refurbished Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "gorfi"}]