[{"rating": 4.0, "review": "I purchased the Fire Stick for my mom for Christmas.  Did not receive before Christmas, I'm sure because of demand.  My mom LOVES it!!!!  She had been watching Netflix on a tablet and loves watching now on her larger screen.  My mom is in her 70's and Dad is in his 80's after a few tutorials from my 14 year old daughter they navigate the user interface like pros.  I'm very happy with the purchase!", "verified": true, "helpfulness": "0/0", "author": "Glenda L Johnston"}, {"rating": 1.0, "review": "Was ok for the first 2 days then it started to pass every 15 min so I took it back.", "verified": true, "helpfulness": "0/1", "author": "Joseph martin"}, {"rating": 5.0, "review": "Really fun addition to our entertainment system. Easy to use and very convenient.", "verified": true, "helpfulness": "0/0", "author": "Hailey P"}, {"rating": 5.0, "review": "Love the new fire stick! Let's me stream Amazon prime as well as Netflix!", "verified": true, "helpfulness": "0/0", "author": "kristysp"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Connie GIfford"}, {"rating": 5.0, "review": "Makes streaming media simple. Only downside, binge watching tv shows! That's on me, not the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Randy Holland"}, {"rating": 2.0, "review": "I've had the stick since Christmas so I can give an adequate review.  Pass on this device.It doesn't support most Surround Sound formats and requires the audio be sent via direct play.  This wouldn't really be that big of a deal, but it only support audio passthrough in a single format (MP4).  I have several TBs of MKV files I can't even watch because the Fire Stick is too stupid to just pass the audio to my receiver.  What a joke.Get a Roku Stick.  It's $10 more dollars, but at least it supports a far wider range of audio and video formats.", "verified": true, "helpfulness": "0/0", "author": "Fill in the Blank"}, {"rating": 1.0, "review": "I just couldn't get it to work.  After a few days of trying to connect and even calling the help line I eventually returned it.I eventually got a roku stick to work", "verified": true, "helpfulness": "0/0", "author": "K. R. Simmonds"}, {"rating": 3.0, "review": "I love everything about this product except, there is a little pop sound every few seconds. very very annoying. And forget about listening to music on it, unless it's constant heavy metal, maybe. Will there be a fix some time soon? I know that many others have this same problem. Please HELP. I so want to love this.", "verified": true, "helpfulness": "0/0", "author": "Robert Raymond III"}, {"rating": 1.0, "review": "Doesn't easily connect  with Android phones;  I couldn't get my LG3 phone connected to the device even after advice from tech support people.  This wouldn't be a huge issue except the lack of apps for popular things like HBOgo, comedy central , etc means that it's basically a stick for watching netflix and prime and youtube.  If you're looking for a streaming stick I'd recommend buying any other product.", "verified": true, "helpfulness": "0/0", "author": "Andrew Jacob Steyer"}]