[{"rating": 4.0, "review": "Pretty happy overall. Set up was fast and easy. No problems at all. Really like the interface for most services.Only complaints are - No HBO! That's a biggie. And, though I love the sleek design of the remote, the up/down/left/right buttons are so unbelievably touchy that it makes the remote almost unusable! This isn't just me, it's everyone at my house who has tried to use the remote.If you try to move one click in any direction, it will sometimes scroll four or five or more items before stopping. Then trying to go back and it will do the same thing in the other direction. My son and I both have android phones and have installed the ap, which works fine. But my wife doesn't have an android and is relegated to using the supplied remote. This has resulted in the utterance of more than a few colorful words and comments.To summarize: Overall quite happy, especially for the price. But - add HBO Go! And fix the bloody remote!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Certainly has a nice interface, especially if you're a Prime member.  But it fails on the \"portability\" thing.  Can't use it in places, such as a hotel, where a wifi authentication is required.  Also, be prepared to carry the power adapter with you just in case. I haven't found an HDMI outlet yet that provides enough power to make the device happy.", "verified": true, "helpfulness": "0/0", "author": "mtipper \"mtipper\""}, {"rating": 1.0, "review": "I had high hopes for this product.  It would give me more options that Chrome Cast . Fire Stick ran great for about one day and I really liked it.  On day two it would stop streaming.  It told me I was \"connected with problems\".  None of my other devices that uses the wifi network had any issues.  I would re-boot (unplug/re-plug) the stick and it would again work. It does it several times a day now.  From reading other post, this seems to be a big issue.  I am going to put it back in the box and go back to Chrome Cast.  Maybe an update or gen2 will be better.  Thanks.", "verified": true, "helpfulness": "3/3", "author": "GP"}, {"rating": 3.0, "review": "Mainly purchase for the Netflix portion of this, and with the recent Netflix app, it won't work. Everything else on the stick seems to be working with no issues. It just sucks that I can't use it for what I mainly purchased it.", "verified": true, "helpfulness": "1/1", "author": "S. Mick"}, {"rating": 5.0, "review": "It lets you side load 3 party apps without having to root/jailbreak the device. That alone makes it worth getting.  The remote is also really nice.", "verified": true, "helpfulness": "0/0", "author": "Sith Lord"}, {"rating": 1.0, "review": "I waited too long to open the package and hook it up so I'm not sure if it's returnable, however something doesn't work as I can't get the remote to even turn on. tried new batteries that didn't work. Just a waste of my time and money.", "verified": true, "helpfulness": "0/0", "author": "DOC"}, {"rating": 1.0, "review": "Useless outside of the US.  Even though there's not a single mention of this on the product description page.  $20's wasted.", "verified": true, "helpfulness": "2/7", "author": "loki_racer"}, {"rating": 4.0, "review": "So far so good, I do have connectivity issues for some reason with this on specific channels (ESPN, etc).  But I do like it better than my Chromecast", "verified": true, "helpfulness": "0/0", "author": "zimmy"}, {"rating": 2.0, "review": "Laggy interface, intermittent audio clipping, apps crash frequently.", "verified": true, "helpfulness": "1/1", "author": "Zac"}, {"rating": 4.0, "review": "I have both a chromecast and a DVD player that can play internet services such as hulu and this device beats both of them easily.  The problem with chromecast is that it relies completly on apps to control the device.  This is problematic in several ways that Fire TV stick has overcome.1.  I can now safely pause without worrying about loosing the spot due to disconnect from app.2. With the Tv stick I do not need to cast which sometimes can be problematic with chromecast - lots of problem like app not finding chromecast.3. fire stick actually stores information such as location, etc...4. I'm not sure about this but I feel that fire stick also stores a cache so that I hardly get stuck videos.4.  firestick is fast.5.  I'm not going to speak for DVD interenet playing since it is much slower and only use as a backup but even with this is more reliable than chromecast.I was about to return this due to negative reviews that chromeast is better - literally was about to cancel order and forgot to do so, when it arrived was about to just return it, forgot again, and finally decided to just give it a shot and now I'm using this exclusively.summary better than chromecast by far.  solid product!Hopes this helps.", "verified": true, "helpfulness": "0/0", "author": "Alex Lee"}]