[{"rating": 1.0, "review": "This item did not come with enough instructions. I cannot navigate my multiple remotes,the fire stick , cable etc. I have not enjoyed one single program on any of the  options. can someone call me and help.  207-284-0601. I need instruction.", "verified": true, "helpfulness": "0/1", "author": "Anita Hull"}, {"rating": 5.0, "review": "I really didn't know what I was getting when I ordered this on promo. I set it up with ease and I am becoming addicted! This device is amazing and much better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Thor19"}, {"rating": 5.0, "review": "Its super fast and responsive. The picture looks amazing. You can not beat it for the price @ 39 bucks. I got it for 19, I should have bought 3. Amazing product for the price.", "verified": true, "helpfulness": "0/0", "author": "R. Stacey"}, {"rating": 5.0, "review": "Fast and easy to use interface! I am in love with it!", "verified": true, "helpfulness": "0/0", "author": "Maria17fernanda"}, {"rating": 4.0, "review": "so far so Good", "verified": false, "helpfulness": "0/0", "author": "Diane Feather"}, {"rating": 5.0, "review": "I love it!!! It may just be the best purchase it have ever done besides my home.", "verified": true, "helpfulness": "0/0", "author": "sue Piper"}, {"rating": 5.0, "review": "The one thing they don't tell you is that it includes a power cord.  So it's not just the stick you plug in, there's also a power cord.  Works great!  Have been impressed with it so far.  Was running out of the box with no headaches.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I was so excited when the fire stick came a month early! Having said that it has failed to work at my house or my mom's house. The connection keeps dropping or the screen flickers to black and then back on. We both have strong internet, and I have it plugged into the power per the recommendation of the directions. I think it has to go back, which is disappointing.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Was easier to configure for amazon prime, but netflix was difficult. I am not using it. I will have to take more time to try to make it work.", "verified": true, "helpfulness": "0/0", "author": "Paul L. Rische"}, {"rating": 5.0, "review": "is ok", "verified": true, "helpfulness": "0/0", "author": "jesus maldonado"}]