[{"rating": 5.0, "review": "i was unsure of the fire stick but after doing some reasearch, I ordered this thrust another store.  Amazon was out of stock and I did not want to wait.  Got the fire stick, plugged it in, had trouble with getting the batteries in and then.....I was really really impressed.  My sister saw it and ordered it.  I do really like this product.", "verified": true, "helpfulness": "0/0", "author": "TyBee"}, {"rating": 3.0, "review": "I am using it for Netflix and Hulu. No where on the packaging nor on the display was it notes that Amazon Prime which almost all of the viewing choices are is required, nor was the cost.", "verified": true, "helpfulness": "0/0", "author": "Sharon R. Gailey"}, {"rating": 1.0, "review": "the navigation isnt easy. Slow. not the apps I was hoping for.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 1.0, "review": "It freezes up and losses connection frequently. And the remote quits working days after I purchase it", "verified": true, "helpfulness": "0/0", "author": "Jessica Kraus"}, {"rating": 5.0, "review": "So far so good it is very fast.  Good quality hd can't beat it for the price.  Great selection of movies and television shows", "verified": true, "helpfulness": "0/0", "author": "David Bushong"}, {"rating": 5.0, "review": "Later Comcast.", "verified": true, "helpfulness": "0/0", "author": "RollingVideoGamesDenver"}, {"rating": 5.0, "review": "Works great, sometimes we want to watch a movie together and this fire stick is perfect for that vs. trying to watch a movie on a n iPad or kindle", "verified": true, "helpfulness": "0/0", "author": "Kim Anderson"}, {"rating": 5.0, "review": "awesome!!! well worth the price.  no need for cable for me.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "works great.small footprint.well worth the money.", "verified": true, "helpfulness": "0/0", "author": "darrell schliepp"}, {"rating": 5.0, "review": "I absolutely love the Fire Stick. It has exceeded all my expectations. My husband and I got it as a gift and we are so happy. So many feechers that we still have to explore.", "verified": true, "helpfulness": "0/0", "author": "linda mullan"}]