[{"rating": 5.0, "review": "Work great , granddaughter luvs it", "verified": true, "helpfulness": "0/0", "author": "JZ"}, {"rating": 5.0, "review": "Really easy to use.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Lisa A Bowers"}, {"rating": 1.0, "review": "It would be a 5/5 star review but both of my sticks forget all the netflix account information. One stick needs reauthenticated to netflix daily. Why doesn't it store the account information on the internal hard drive??Mine are both either broken or it's just horribly designed… It's unfortunate because it would otherwise be the #1 device for netflix plus offer the ability to check out what I get free through Amazon Prime Video.", "verified": true, "helpfulness": "1/2", "author": "rbudden"}, {"rating": 5.0, "review": "I'm a little predjudiced as a Prime member, BUT:  easy set up (not a techie), free movies, free TV episodes, reasonable price, what's not to like.  Just watched \"Hemingway and Gelhorn\" good movie - did I say FREE", "verified": true, "helpfulness": "0/0", "author": "August Trometer \"Gus\""}, {"rating": 3.0, "review": "no instructions hard to use still not working", "verified": true, "helpfulness": "0/0", "author": "gail arora"}, {"rating": 2.0, "review": "The Fire Stick has the potential to be a great streaming device. It's tiny, cheap, has a good remote, and lots of features. However, I am only giving it 3 stars right now, because it still has bugs. I am hoping that Amazon releases some software updates to fix these bugs and create a better user experience.The Good:1. Cheap.2. Plenty of apps to choose from for your entertainment needs.3. Compact and portable.4. Bluetooth remote, doesn't require line of sight in order to function.5. Searching for content on my phone and playing it on my TV is excellent.The bad (buggy software):1. My unit has completely frozen multiple times while watching or browsing content. The only way I've found to fix it is physically unplugging the power from the stick.2. Sometimes the navigation locks up and a single press of a button registers as if I were holding it down. The means instead of scrolling one movie to the right, it will just continue scrolling without stopping.3. Button presses don't always register properly. There has been a delay of up to 5 seconds between a button press and the action taking place on the screen. Sometimes a single button press jumps multiple times, making it extremely frustrating to select content.The annoying:1. There doesn't seem to be a way to power the device off. I assume it goes into sleep mode after being idle, but I'd like to be able to turn it off.2. You should be able to skip the intro video.3. I was under the impression that HBO GO was going to be added in December, but now it says Spring 2015. We have to use another device to watch HBO GO until it is added to the Fire Stick.When it works, I like it. The user interface is one of the best compared to other streaming devices. Unfortunately, the bugs I mentioned are making it a bit annoying to use. I don't know if I got a bad device or what. Most others I have talked to have not reported these issues. Hopefully this gets fixed in an update soon.Edit 1/22/2015:I just experienced a new bug. While watching Netflix, every time I finished an episode and a new one started, the new episode showed up as a tiny box in the upper left corner of the screen. The only way to fix it was by closing Netflix and reopening it. I have no idea if this was a Netflix issue or what, but I have never had this happen on any other device. This is getting really annoying.Edit 6/26/2015My Fire Stick continues to be buggy with new issues popping up all the time so I am dropping my rating to 2 stars. The most recent new issue is that the idle screen saver starts up while I'm watching TV. The audio of whatever I am watching plays and I have to hit a button on the remote to exit the screen saver. It has frozen more times than I can count. I have to unplug it to reset it every time. Sometimes it just stops connecting to the internet and requires me to unplug it. Recently it just forgot my Netflix login info and I had to set it up again. The other day while trying to watch a show on Netflix it would just exit the app whenever I pressed play. I gave up and fired up the PS3 to watch TV. The HBO GO app is so laggy that it is such a pain to use, not sure if it's the app or the stick. It works much better on our Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Dan Constantin"}, {"rating": 5.0, "review": "once I got it attached to the tv it was great! lots of movies to watch.....very happy", "verified": true, "helpfulness": "0/0", "author": "charolette koerber"}, {"rating": 5.0, "review": "I wanted to wait for a while before I posted a review.  I was having a skipping problem and couldn't figure out how to fix it.  I changed settings.  Searched for other people with the same problem and tried everything I could.  There was a stutter in Netflix shows and it was hard to watch because I kept expecting the next stutter or skip.  It happened about every 5 minutes.  I finally unplugged it and plugged it back in and it was fixed.  It just needed a reboot.  Quick fix for anyone with the same problem.  Takes a minute.  I got this for the introductory price and am blown away at what I can do with it.  My cable bill went from $126.00 to $57.00 because I cancelled so much.  I would have cancelled all of it, but my wife insisted on keeping it.  I watch music videos, movies, TV shows, etc.  A lot of shows are original shows to Amazon, Netflix, or Crackle.  I would have never known about them without this.  They're great shows too.  Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Gonzilla7"}, {"rating": 5.0, "review": "This is GREAT.  I have Chromecast in one room and bought this one for another room.  The Fire Stick is easier to navigate and very quick, the included remote is very small but easy to work.  If anyone wants a Chromecast I will be selling mine to get another Fire Stick!", "verified": true, "helpfulness": "0/1", "author": "On Vacation 365"}, {"rating": 5.0, "review": "Very Cool! Getting closer to stopping my satellite subscription!", "verified": true, "helpfulness": "1/1", "author": "Nanci Arvizu \"student of life\""}]