[{"rating": 1.0, "review": "Terrible! It's not compatible with every modum and Internet service. Returning it ASAP!!!", "verified": true, "helpfulness": "1/1", "author": "Wendy Cash"}, {"rating": 1.0, "review": "We bought this with the hopes to stream Netflix and prime movies to our tv.  We couldn't get it to hold a connection to the internet.  When it would connect it would only connect during the days, but at night it would keep buffering.  We reset our modem, and tried it again, but we kept having the same issues, we are returning it.", "verified": true, "helpfulness": "1/1", "author": "checks"}, {"rating": 1.0, "review": "It took 3 hours to watch an one hour tv show. Very slow", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not very happy. No where did it say you have to pay for everything minus your own Netflix account which you already pay monthly for anyway. You have to buy every tv show and movie. Doesn't say that anywhere in the description. Only said you can stream everything and will need wifi. Very misleading.", "verified": true, "helpfulness": "2/2", "author": "sarah"}, {"rating": 5.0, "review": "Better than Chromecast, hands down!", "verified": true, "helpfulness": "0/0", "author": "Robert Scott Miller"}, {"rating": 4.0, "review": "As advertised.", "verified": true, "helpfulness": "0/0", "author": "M. J. Durant \"mattyd58\""}, {"rating": 4.0, "review": "As a confirmed Roku fan, I was a little reluctant to give a different streaming device a try. But the Fire TV Stick has more power and memory than the old streamer in my bedroom, and the price (and the fact that we already have a Prime account) made it an affordable gamble. The UI took a little getting used to (it definitely puts your Amazon Prime options front and center, and sort of relegates apps like Netflix and Hulu Plus to secondary options), but by the end of the first evening I found it very user-friendly and navigable. It creates a much more stable connection to our wireless network than our old Roku XD, loads faster, and generally does everything we need it to. The Roku 3 is still my 5 star main streaming device (it's in the living room - the Fire Stick is in the bedroom), but the Fire TV Stick is a great option, and well worth the money, particularly if you're a Prime customer. PLEASE NOTE: While not pictured, the device does need to be plugged in via a power cable to work.", "verified": true, "helpfulness": "1/1", "author": "@harrellscott"}, {"rating": 4.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "Freddy Moncion"}, {"rating": 5.0, "review": "fantastic", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/1", "author": "Jessica Bell"}]