[{"rating": 4.0, "review": "Outstanding for the price and size of this thing.  My only disappointment (and the main reason I bought it) was the lack of ability to miracast from my laptop.  Looks like it only supports miracast from android.  I hope some time in the future that will change.", "verified": true, "helpfulness": "1/1", "author": "Joe Stocking"}, {"rating": 5.0, "review": "We LOVE it!  It turned our TV into a smart TV!", "verified": true, "helpfulness": "0/0", "author": "Wckd_Mom \"The Mom\""}, {"rating": 3.0, "review": "Setup required an hour with a tech service person to get the thing working.", "verified": true, "helpfulness": "0/0", "author": "Brooks Smith"}, {"rating": 5.0, "review": "Perfect, better than expected.", "verified": true, "helpfulness": "0/0", "author": "Alicia Gallardo"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "david wilson"}, {"rating": 5.0, "review": "I have a Chromecast, the Roku Stick and the Amazon Fire TV Stick. I can without a doubt say that the Fire TV Stick is the best for me. The Chromecast doesn't do much more than allow you to beam content from your device to your TV (which the Fire Stick and Roku Stick also do). The Roku is very similar in it's offering to the Fire TV Stick, but for those with Prime and/or those with a lot of content from Amazon, this device is a must! It turns any TV into a smart TV. I didn't plan on using the gaming options myself, but my kids think it's really cool that they can hop on the TV and play Flappy Birds or Tetris with the remote. Best buy I have made in a long time.", "verified": true, "helpfulness": "0/0", "author": "Kevin D. Vick"}, {"rating": 5.0, "review": "TERIFFIC", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 4.0, "review": "I keep getting prompted to use the USB cord with the USB power supply it came with, although I am. Not sure if it is defective or ???I might as well just use the USB in the TV, seems to work just as well.This provides the same functions as a \"smart TV' or bluray. Nice if you dont have one of those or you are on travel.", "verified": true, "helpfulness": "0/0", "author": "Christian Fowler"}, {"rating": 5.0, "review": "As an Amazon Prime Instant Video viewer, very nice.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 3.0, "review": "I was so excited about the Fire Stick since it offers all the options that I want but does not work with my main television. The first one I received synced up to my main TV  just fine and I was even able to start streaming but the power started cutting out with short bursts of sound through the speakers. I returned it for a replacement. The new one won't hook up to my main TV at all now offering an error about the power adapter even though it was hooked up to the provided power. However, it works just fine  with my smaller TV. It's interesting because my Chromecast works just fine on any TV I've tried. Obviously the Chromecast doesn't work with Amazon Prime Videos so that is another issue in and of itself. In any case the Fire stick is not very useful on a TV that I don't watch very much, considering giving it to my mother and getting a roku so that I can actually use my Amazon Prime Videos on a screen bigger than a note card.", "verified": true, "helpfulness": "1/1", "author": "Nikole Bellock"}]