[{"rating": 4.0, "review": "It's really easy to use and I like some of the apps. Some of the apps have way to liberal movies for us and I wish that as a whole, those apps were a little more family friendly. But no biggie, we just won't watch those apps! We like it a lot and have used it a lot already!", "verified": true, "helpfulness": "0/0", "author": "Rochele Ambo"}, {"rating": 5.0, "review": "I have not had any problems with the fire stick so far. I thought it was going to be difficult to set up it wasn't,  make sure that you program the fire stick correctly, not so hard just try each til the instructions pop up and that's it.", "verified": true, "helpfulness": "0/0", "author": "Laura R."}, {"rating": 5.0, "review": "The fire stick order was originally backlogged but arrived sooner than the stated date.  The product installed quick and easy and was operating  within 15 minutes.  The fires stick is great product offering  all kinds of viewing.  This is our first experience with this type of product and we were originally hesitant to try it as we are somewhat technology poor but this item is so easy to install and use and ranks very high on our list.", "verified": true, "helpfulness": "0/0", "author": "Jim P."}, {"rating": 2.0, "review": "It has potential but may have been rushed to market. I have the latest samsung tablet 10.5 and Galaxy s5 phone neither which I can screencast. Power support the stick is an emerging product. As such I'll keep my chromecast and return the stick until the technology emerges.At least to be compatible with two of the most popular brand name tablet and phones in the market.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"philldee\""}, {"rating": 5.0, "review": "Absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "Regina M Ware"}, {"rating": 1.0, "review": "After purchasing it, I find out it has problems with compatibility with some Samsung TV's.  It constantly drops out and I have to re-initialize it.  I had the same problem with the Kindle.  Both the Fire Stick and the Kindle work well with other brand TV's.", "verified": true, "helpfulness": "0/0", "author": "Virginia Smith"}, {"rating": 3.0, "review": "It would not connect to the Internet for a long time.  After spending hours Googling for a fix, I found that the problem was a security setting on my router, which required me to log on as admin and play around until I found the correct setting.  Once that problem was resolved, it worked great.  However, Amazon could have given some notice or a heads up that this problem can occur and how to remedy it.", "verified": true, "helpfulness": "2/2", "author": "Gregory M."}, {"rating": 5.0, "review": "Installed in minutes, maybe just seconds, it was quick. Works flawlessly and easy interface. Too bad Directv in not a participant in some of the apps like History Channel. Don't know why that is as DISH is a participant. Don't know if that is on Directv or Amazon. No matter, as it is not a deal breaker. Lots of cool apps and especially like viewing our pics from the cloud on TV, which is the main reason for getting the Fire TV Stick. But there was so much more that I did not expect to get that made it even better. Streaming is almost instant and is probably due to our IT provider. Sling TV is a nice app, but don't really need it as we use Directv and I got voted down on dropping Directv. Today got Directv's over 20 buck a month increase, which may make it easier to drop them and use Sling TV. I'll see if I get voted down. Enjoy.", "verified": true, "helpfulness": "0/0", "author": "Sonoguy"}, {"rating": 3.0, "review": "Decent product but so limited by the weak wifi antenna that it makes it useless unless it is right next to the router. Using it with the power cord of course. I get a network error a few times every time I try to watch WatchESPN on it, no matter the time of day. I'm just glad I got it for $20", "verified": true, "helpfulness": "0/0", "author": "Brock Neilson"}, {"rating": 5.0, "review": "This tiny gadget is so easy to use I'm not sure why everyone hasn't ordered one.  If you subscribe to Netflix, Hulu or other services accessible through the Fire Stick, you need this device. We also have the Fire TV box but I have yet to find a reason to dump the Fire Stick in favor of the box for additional televisions. The remote control also has great connectivity even when mounted behind a flat screen TV. So far I love this little guy.", "verified": true, "helpfulness": "0/0", "author": "Cocktails by the pool"}]