[{"rating": 1.0, "review": "No ability to add files to watch on television", "verified": true, "helpfulness": "0/1", "author": "Dana Sheedy"}, {"rating": 4.0, "review": "Loads content quickly.  Interface a little clunky.", "verified": true, "helpfulness": "0/0", "author": "Timothy L Braunbeck"}, {"rating": 4.0, "review": "It performs as  advertised and provides an inexpensive way to bring services like Amazon Videos, Netflix, etc to your TV. I purchased this device to use with my Slingbox M1 and it connects nicely. The onscreen controls are slow and almost unusable, so I do all the channel changing with the Xfinity Remote app on my iPhone. I also had to turn off an annoying pop-up message that constantly tries to downgrade the Slingbox video quality due to slow internet speeds. It's kind of ironic, because the device was being used inside my home network. Once I turned off the pop-up, the video quality was great and things worked nicely.Here are a few more first impressions:1) Easy to setup and I like the dedicated remote.2) The iPhone WiFi remote app is a little clumsy3) Doesn't connect to older Slingbox (no surprise)4) Can't use it with HBO Go or Showtime Anytime because Comcast doesn't support logging in on the FireTV (I hear Comcast may support HBO Go on FireTV this Spring).5) Works with Watch ESPN, but not FoxSports (Comcast sign-in issue again)6) The FireTV stick uses too much power for most TV USB ports, so you have to use their external power adapter. I was hoping to use this when I travel, but I can see a problem with trying to find an outlet close to the hotel room TV. I did a little experiment using a portable USB phone charger and that seems to work (until it runs out of juice).7) Also to login to a hotel WiFi, the device will need to support webpage login. I've heard this is coming.8) I also experimented with side-loading a couple apps including one that allowed me to connect a Bluetooth Mouse and Keyboard and another for Xfinity X1 TV live streaming. The side-loading process wasn't too difficult, but I came to the conclusion that it's better just to wait for Amazon to support the app natively vs trying to use a hack.9)  I paid $5 and got AirPlay/DLNA Receive Pro, which allows me to mirror my iPhone. It works fairly well, but I'm not sure I'll ever use it.So overall it woks good for me for Slingbox, Netflix, Amazon Prime Music and Videos, Pandora, and ESPN. My primary use is for a 2nd home with high speed Internet and no TV service, so it works great for that.", "verified": true, "helpfulness": "0/0", "author": "David Larson"}, {"rating": 5.0, "review": "Simple to set up. We're extremely pleased with Fire Stick results. My only suggestion would have been instructions for the remote should be included.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Love"}, {"rating": 5.0, "review": "Good bye cable !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up even on our older model flat screen, even the app for the phone worked great the first time. Had been using the old dvd player to connect to Netflix, but it wouldn't get Amazon prime, and this does both now. I'm thinking of getting a second for another tv.", "verified": true, "helpfulness": "0/0", "author": "G. Byrne"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Yang Zhang"}, {"rating": 5.0, "review": "Better than what I imagined.. worth the wait and money", "verified": true, "helpfulness": "0/0", "author": "Cindy Z"}, {"rating": 5.0, "review": "I carry this with me on every trip I take...Plus with cloud drive, my family has full access to our family pics the minute we upload them,,,Home run Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "it's Okay. Performs as advertised.  However, searching for Netflix choices is slow compared to the PC.Hardware good; software iffy.", "verified": true, "helpfulness": "0/0", "author": "Fredex"}]