[{"rating": 1.0, "review": "way too slow. only plays ~30 secs of video before it has to buffer again. we have appletv on another tv using the same wifi so it is not due to slow internet speed. most of the apps only intermittantly work. a real disappointment", "verified": true, "helpfulness": "0/1", "author": "Courtney Maxey"}, {"rating": 4.0, "review": "Fire stick is definatly worth the price. The only thing I have not been able to do is access the intent and play videos from random sites. It may be able to do that but I haven't been able to get it to do it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "scmica"}, {"rating": 4.0, "review": "Arrived a day earlier that expectedI thought I would get more cable channels. But I do Kiel it and think it pretty niffy", "verified": true, "helpfulness": "0/0", "author": "susan frost"}, {"rating": 1.0, "review": "Not to happy with my purchase, roku works way better", "verified": true, "helpfulness": "0/1", "author": "Dumitru V. Moisi \"gefoo77\""}, {"rating": 5.0, "review": "Love it! Great addition", "verified": true, "helpfulness": "0/0", "author": "susan edwards"}, {"rating": 4.0, "review": "Love this thing! We have a Roku, but this device seems to work even better.We have had some problem lately, though, where it seems to freeze. Not sure if it is the Fire TV Stick, or a problem with Netflix. The only way we have found to restore playback is by pulling the stick from the TV and disconnecting the power for 30 seconds or so, the reinserting it. Annoying, but not a huge problem.", "verified": true, "helpfulness": "0/0", "author": "KJGM \"The former Direction\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Caterina Farris"}, {"rating": 5.0, "review": "Very easy to install and use.  It works great!  The app on my Fire He is a bit strange though.  The Fire screen is blank, and you have to watch the TV to see where you are scrolling .  You move your finger up, down, or sideways to find a program .  The remote is much better!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "Very easy to set up.  Alot faster than my previous roku.  Seems like the picture is even improved.  Love it", "verified": true, "helpfulness": "0/0", "author": "lauren dunlap"}]