[{"rating": 4.0, "review": "I am a big fan of the fire stick. It has so many features. Los to choose from. My only complaint is it sometimes will freeze and speed up to catch up. Not sure why.", "verified": true, "helpfulness": "0/0", "author": "Josh Davis"}, {"rating": 2.0, "review": "keeps disconnecting", "verified": true, "helpfulness": "0/1", "author": "Ginger S."}, {"rating": 5.0, "review": "To be frank I love it. I love anything from amazon because it has been the only company that has never disappointed me. I pre ordered this for 20 bucks when it came out, so I got a great deal. This was estimated to come to my house in January 05, 2015, but amazon was kind enough to send it on December 16, 2014. It is easy to use, and has a friendly interface. I used to watch prime and netflix movies first, but then I got into developer mode and installed some android apps such as crunchy roll etc. My father ordered something else from ebay I think which was more expensive. It had an android interface with play store, but the fire tv stick beats it in loading movies. The only thing I wish the fire TV stick had is more memory.", "verified": true, "helpfulness": "0/0", "author": "Frank Martin"}, {"rating": 5.0, "review": "love this! It is so easy to set up and use. I love having so many choices of movies and tv shows to pick from. I like checking out new & different tv shows.", "verified": true, "helpfulness": "1/1", "author": "Julie D. Gronewold"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Celeste Tavarez"}, {"rating": 5.0, "review": "great purchase, I can watch Netfilx, Amazon Prime and listen to Pandora.", "verified": true, "helpfulness": "0/0", "author": "Sara Rendon"}, {"rating": 5.0, "review": "Our family loves it. Not only do we get more use out of our Amazon prime, everyone can see the movie and it costs about the same as a DVD player. The kids love seeing the videos of each other that I took on kindle.", "verified": true, "helpfulness": "0/0", "author": "melissa wade"}, {"rating": 5.0, "review": "Very happy with the Fire Stick, allows us to quickly access Prime, Netflix and Pandora.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "This is such a great product for making a standard TV into a \"smart TV,\"", "verified": true, "helpfulness": "0/0", "author": "Sharon C"}, {"rating": 1.0, "review": "free prime amazon offer is miss leading", "verified": true, "helpfulness": "0/2", "author": "earl"}]