[{"rating": 5.0, "review": "I have a Fire Tv box in our bedroom and this works just as well downstairs. I was at first disappointed that it had to be plugged in as I assumed that it would be powered through HDMI. But it's not an inconvenience and I'd rather it work 100% rather than not because of lack of power.The apps are up to date and work perfectly fine like Netflix, Hulu, prime video, and plex. I replaced an old Roku hd from about 4 years ago with this and it was worth it.", "verified": true, "helpfulness": "0/0", "author": "jubeikibigami"}, {"rating": 5.0, "review": "Works as advertised!", "verified": true, "helpfulness": "0/0", "author": "Jay M Zimmerman"}, {"rating": 5.0, "review": "I am a tech dummy and I was able to download it all by myself. I love all the features and they work great. I had a few minutes of trouble figuring out how to \"find\" all the selections. and click on them I gave 4 firesticks as Xmas presents and everbody LOVED it!  I love  being able to stream movies so easily on my 4 year old flat screen.", "verified": true, "helpfulness": "0/0", "author": "Sarah Taylor"}, {"rating": 5.0, "review": "Everything they say it is and more", "verified": true, "helpfulness": "0/0", "author": "Joseph O'Neal"}, {"rating": 5.0, "review": "Amazing what you can do with a Fire TV stick", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Before getting the Fire TV Stick wile streaming the picture on my TV was something less then standard definition as for as picture quality is concerned. Now I'm getting something very close to HD. I'm very happy.", "verified": true, "helpfulness": "0/0", "author": "Charles B."}, {"rating": 5.0, "review": "Great product very cool it does everythig", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 4.0, "review": "Simple to set up and use. Program selection froze up a couple of times so have slowed down making changes. Much prefer the optional voice control remote to the one included. Like having my photos from the cloud so easy to access.", "verified": true, "helpfulness": "0/0", "author": "Sidney"}, {"rating": 4.0, "review": "Very easy to use and set up....love the movies but I can rent a new release for less than $2 on red box Compared to the $5.99 on the fire. Overall it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 2.0, "review": "Very patchy wifi connection. Roku3 much better. Bought both at the same time", "verified": true, "helpfulness": "0/0", "author": "Bj's Poultry"}]