[{"rating": 2.0, "review": "Bought this for the mirroring capabilities it advertised. I have a Samsung GS5, Google Nexus, and a Kindle Fire HD(older version). Mirroring doesn't work with any of them. Otherwise it looks cool hanging out the side of my TV. Also, the fireplace app is neat. The Showtime app would've been cool except I have Xfinity service, which is not supported. At least I only paid 19 bucks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic, set up was easy and it works just fine. After reading some negative reviews I was skeptical, but it does what it says and more than I thought !", "verified": true, "helpfulness": "0/0", "author": "Bill Trevette"}, {"rating": 5.0, "review": "Really easy to set up. Menus are easy to negotiate. Downloading the Amazon Fire app to my tablet gave me voice control. I was very impressed.Certainly recommend it for someone who wants to add \"smart\" capability to their flat-screen TV at a very reasonable price. And it added value to Amazon Prime account since I can watch Instant Videos on my television now, as well as my laptop and tablet.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 2.0, "review": "We just got ours in the mail, and it seems to be okay, but the primary (and maybe only) reason we got the fire tv was for the 'fling' feature. The details read \"Connect your small screen to your big screen— Fire TV Stick lets you fling your favorite apps to your TV to free up your small screen for other uses. Or mirror your phone or tablet to your TV.\" So i instinctively thought I'd be able to fling it from my iPhone to the big screen......... but come to find out it supports every device BUT Apple products. If I'd purchased it for $40 I would return it... not happy about this.", "verified": true, "helpfulness": "0/0", "author": "trane"}, {"rating": 1.0, "review": "I received mine at the end of November.This FireStick works OK (at best) some days, then others it locks up, and today it wont play anything.  Started out that playing music was the only problem, now its everything including TV and movies.I've already spent over an hour on the phone with the \"support\" team, getting past to 4 different \"techs\".  Then I'm told they'll put in a ticket, and get back to me in 2-3 days.  I get an email saying they dont see any problems, call if you still have problems, and thank you. I'm not calling back to be told to test everything I've already tested....restart, reinitialized, reregistered, adjust settings, unplugged, done it all. I have 2 separate Chromecasts in the house, both over a year old, and they still work perfectly.  My internet connection is solid, my router is good, my WiFi is good, etc....and I know how to test/compare all these variables.What I want is a refund at least , but even better would be a FireStick thats not filled with gremlins.  I appreciate the FireStick when its working, but this one has been nothing but flakey since day one.I really hope Amazon is paying attention, will understand my frustration, and make things right without wasting another hour of my time on the phone getting handed from \"tech\" to \"tech\".Long time Prime customer", "verified": true, "helpfulness": "2/2", "author": "AJLE"}, {"rating": 5.0, "review": "Love it, much better than chromecast, the remote is super useful", "verified": true, "helpfulness": "0/0", "author": "Z. Liu \"lzbob\""}, {"rating": 5.0, "review": "Excellent; It delivers more then expected.. Fast, excellent picture quality and lots of applications & games.", "verified": true, "helpfulness": "0/0", "author": "Manoj Kumar"}, {"rating": 5.0, "review": "I was fortunate to order one of these as soon as it was announced. As an Amazon Prime member, I was able to buy the Fire TV Stick for $19 during a two day sale. I figured, for that price, I might as well test it out!Set up was easy and straight forward. I find that the interface is quick and easy to use. The interface and streaming on the Stick is much faster than the Amazon app built into my HDTV. This fact alone made this a great purchase. Here are some more thoughts I have on the Fire TV Stick so far:' PROS:- Quick, easy to use, polished interface- Wireless streaming works really well- Amazon Instant video loads, fast forwards, and rewinds really fast- A dedicated Prime Menu allows Prime members to easily see what free content is available- Unlike Chromecast, the Fire TV Stick includes a remote- Can stream your own videos by first uploading them to your cloud disk- Can play quite a few casual games- Awesome, irresistible price for Amazon Prime users. I got it for $19 during the two day sale.I Love it", "verified": true, "helpfulness": "0/0", "author": "Leonard"}, {"rating": 1.0, "review": "It was easy to setup and basically had a great experience the first night. Next day for some reason I was unable to use it because said that there was no internet... Ended going to my living room to use the Apple TV. 3rdI give another try and I had to enter my network password because for some reason forgot the password (nothing else, my amazon prime was all good, etc), 5 minutes later asked me the password of my WIFI again.... After looking for something to watch and started watching netflix it was really slow and with a lot of pauses.... again I went back to my living room to watch Netflix with my Apple TV. 4th day I try again and boom: need to enter my wifi password.... I didn't and just factory reset the stick, put it nicely on the box again and exchanged it for the ChromeCast. It's a really young product and I will be willing to try it again but not now, it was a hassle that first bad experience.", "verified": true, "helpfulness": "0/0", "author": "luanpedrori"}, {"rating": 3.0, "review": "It's nice for Netflix viewing.  I hope more media/entertainment apps come to the service.  I would really like to see an Xfinity app!", "verified": true, "helpfulness": "0/0", "author": "wastingtime33"}]