[{"rating": 5.0, "review": "I had the Google Chrome version, but it will not plan Amazon instant video so I got this.  Very easy to setup and get going.  The wifi on it appears a bit better then the other one also.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Before my son got me the FireStick about a month ago I did not take advantage of my Prime membership like I wanted to because of the inconvenience of dragging my laptop in and hooking up to my computer every time I wanted to watch something.  Now that I don't have to do that I am watching more movies and taking advantage of more of the benefits, such as listening to all the music available to me.  I love it. I no longer have cable so this works out perfectly for me as it works with Sling TV, HuluPlus, etc. I also love the beautiful background scenery. Possibilities seem endless.", "verified": true, "helpfulness": "0/0", "author": "cathy"}, {"rating": 5.0, "review": "We love it! The only problem is getting my husband not to talk like the guy on the commercial Gary Busey.", "verified": true, "helpfulness": "0/0", "author": "Hip mom \"Toni B\""}, {"rating": 4.0, "review": "Works great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 3.0, "review": "Seriously love this thing, its awesome plays all of my favorite video streaming services. The 3 stars is because i keep losing internet connection even with the power supply and extension plugged in. Not sure what the deal is with this .", "verified": true, "helpfulness": "1/1", "author": "Maine Reviews \"Maine Reviews\""}, {"rating": 5.0, "review": "I love my Roku's, but after a couple years they both stopped working. I have a ChromeCast but obviously it doesn't provide Amazon Prime. Given the price and the faster CPU / more RAM, the Fire TV Stick was a reasonable risk. It's turned out to be amazing. It's the first TV device that's actually fun. The voice search, via the phone app, is extremely good. You really can play games on it. I always wondered why Netflix looked better on the WiiU than my older Roku - the network was the same. Now I understand streaming video quality is controlled both by network speed and CPU power. That's where the faster, more powerful guts of the Fire stick shines. Video is perfect. This is a great device. Obviously being sold under cost. I would get one while they're still priced to create a market. Oh, I was surprised that I could not run it off the USB on the TV -- not enough power. I guess faster CPU means you need a bit more power. I expect TV makers will adjust accordingly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Michelle Coulter"}, {"rating": 5.0, "review": "Really easy to use and set up.  Lots of great viewing to choose from.  Not sure why people would pay for movie channels on cable when the can get this.", "verified": true, "helpfulness": "0/0", "author": "R. Gettemeier"}, {"rating": 5.0, "review": "if it stops working like it did for me unplug the stick and your tv for a minute or two then plug them back in", "verified": true, "helpfulness": "0/0", "author": "tracy"}, {"rating": 4.0, "review": "Great streaming device.  So many choices of apps, movies, games, TV shows.  Setup took 5 minutes.  Anyone who is a prime member, this is a must! I'm not a prime member but may join.  For those that have to rent a movie or TV show, my only suggestion is to lower the rental cost.  We use the Fire TV Stick almost daily.  There are many free apps to install also.  It's great how Amazon syncs everything across devices.  I can install a Fire Stick app on my office computer and it downloads to my Fire Stick immediately.  Another huge benefit, it's portable!", "verified": true, "helpfulness": "0/0", "author": "Trish"}]