[{"rating": 1.0, "review": "I ordered this because of my love of Amazon and Prime services.  Low and behold... after waiting for a MONTH because the device wasn't available, I was sent a BRICK.  No signal.  Changed HDMI ports, changed power, used the HDMI adapter, NOTHING.  Was told by my Amazon Fire Customer Service representative to plug the fire stick directly into an outlet -- because it supposedly WON'T WORK when plugged into a surge protector!!  Seriously?!?!?  It still didn't work - glad I wasted my time on that \"fix\" to my problem.I'm buying a Roku.  Hope you will too, because Amazon clearly knows how to make basic cables, but they fail at making anything more advanced.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 2.0, "review": "If u like to watch a tv series that has been on for several years or a movie from several years ago  then the Fire Stick is the way to go.I personally prefer watching current tv and movies", "verified": true, "helpfulness": "0/0", "author": "Steven Schwid"}, {"rating": 5.0, "review": "Great content on Prime Video.", "verified": true, "helpfulness": "0/0", "author": "Stormspeed \"Sspd\""}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Julio C. Rodriguez"}, {"rating": 5.0, "review": "It works good, easy to use and portable. I use it with amazon prime and netflix", "verified": true, "helpfulness": "0/0", "author": "Edward Dewar"}, {"rating": 4.0, "review": "I wanted something  that would play all my required apps since I cut cable.  Amazon of course, Hulu, and Netflix.  Very easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Aaron Mingle"}, {"rating": 5.0, "review": "I love this!  The content is great and super easy to install.  I would recommend this to anyone wanting many options  to view.", "verified": true, "helpfulness": "0/0", "author": "Mary L. Hill"}, {"rating": 5.0, "review": "We love it! Specially my kids :)", "verified": true, "helpfulness": "0/0", "author": "Viviana David"}, {"rating": 5.0, "review": "Love it!  Getting another one for bedroom!", "verified": true, "helpfulness": "0/0", "author": "Susan H. Bell"}, {"rating": 4.0, "review": "Easy Set up.", "verified": true, "helpfulness": "0/0", "author": "Klaus"}]