[{"rating": 1.0, "review": "Wasnt worth purchasing", "verified": true, "helpfulness": "0/0", "author": "kenneth j freeman II"}, {"rating": 3.0, "review": "It's cool", "verified": true, "helpfulness": "0/1", "author": "simone stanley"}, {"rating": 2.0, "review": "Have Google, Apple and Roku streaming tools also but this is the only one who requires maintenance and still doesn't allow user to watch apps without buffering constantly.  Great idea. So close", "verified": true, "helpfulness": "0/0", "author": "tim frazier"}, {"rating": 5.0, "review": "I recently bought the fire tv stick as a late Christmas present for my dad (and, let's be real here, also for myself). It's exactly what I hoped it would be and even better. My dad is, to put it nicely, not the most tech savvy person in the world, and he LOVES it and has had absolutely no problems getting the hang of this device. The interface is so sleek and user-friendly, even for an Amazon product, and I was honestly surprised by how nice it was. We use it mainly for watching Netflix but it's super simple to use Amazon Prime and the other applications like Pandora and Hulu as well. The games are a nice touch too but I haven't really spent a lot of time using those because I only got the standard remote, which is a bit of a pain with the games. I'm sure they'd be great with the game controller, though. All in all this was such a great value, so simple to use and set up and it's perfect for streaming, and I even plan on getting a few others for upcoming family birthdays because it beats the hell out of a gift card any day.", "verified": true, "helpfulness": "0/0", "author": "Rhiannon Gagne"}, {"rating": 3.0, "review": "I like the stick. I bought it because I travel a lot for work and wanted to watch my favorite shows when I am away from home. However you cannot use it at hotels because there is no way to login to the Internet without a browser so it defeats the purpose of mobility unless you use your personal computer which I don't bring because its too heavy to carry two computers.", "verified": true, "helpfulness": "0/0", "author": "Happiness is in my grasp"}, {"rating": 5.0, "review": "Very easy to use! Love it", "verified": true, "helpfulness": "0/0", "author": "April Wilcox"}, {"rating": 5.0, "review": "very easy to use, love it.", "verified": true, "helpfulness": "0/0", "author": "jacquie"}, {"rating": 5.0, "review": "easy to install--works like a charm--not sure how I lived without it.", "verified": true, "helpfulness": "0/0", "author": "marilyn chase"}, {"rating": 4.0, "review": "The Fire tv stick is a good product not great , it needs a usb  port and the interface needs work ,it's just not a natural flow . I think u could stand to explore Roku and consider making some changes. But this is still a nice product with a good price. Amazon should also consider adding free to air Network tv to there devices now that in my opinion would be next level and seal the deal for a lot more people , if your using the internet already it would be simpler to get live network programing  without using a tv antenna . Well what i mean is this should be added free just like it was meant to be free over the air . Thanks !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simply plug in and program the wireless passcode then you can log into Netflixs, sling or other content providers.", "verified": true, "helpfulness": "0/0", "author": "Stanley K. Rader"}]