[{"rating": 5.0, "review": "It was so easy to install.  I'm using it on our only \"non-smart\" tv and love it. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Robert Smith"}, {"rating": 5.0, "review": "Works great and easy setup.", "verified": true, "helpfulness": "0/0", "author": "L. Larsen"}, {"rating": 5.0, "review": "Easy to use! Easy to set up!  Kid shows are great!", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Really enjoying it. It arrived early, was easy to install, and is easy to use. Can't ask for anything more.", "verified": true, "helpfulness": "0/0", "author": "Ksea"}, {"rating": 5.0, "review": "Arrived quickly and was very easy to set up (once I figured out how to get the back off of the remote to put in the batteries).  It took a few minutes to learn to scroll through the options, but once I got familiar with it the Fire Stick works very well.  I haven't used a lot of the options yet, but I have viewed some Hulu Plus, Netflix and Amazon Prime with it and they all worked pretty well, although Hulu Plus was a little trickier to use.  Overall it seems to be a good device, much more robust and reliable than the Chromecast I have had for awhile.", "verified": true, "helpfulness": "0/0", "author": "Tally D Lykins"}, {"rating": 5.0, "review": "For the price, this little gadget is great!", "verified": true, "helpfulness": "0/0", "author": "Dawn in CA"}, {"rating": 5.0, "review": "I am so glad I purchased the Fire TV Stick. It was so easy to connect to our wifi, and easy to download movies. The remote seems a little sensitive to the touch when your searching.  All in all glad we bought it!", "verified": true, "helpfulness": "0/0", "author": "Sally Greenwood"}, {"rating": 4.0, "review": "Sets up easy and easy to use.", "verified": true, "helpfulness": "0/0", "author": "rwk1951"}, {"rating": 5.0, "review": "Very cool!  Easy set-up...just plug it into the HDMI port on your TV set, plug the power cord in, and connect to your home wi-fi.  Watching shows , playing games, and running apps with the Fire TV Stick is really no different than doing so on an iPad, tablet or laptop, EXCEPT IT'S ON YOUR TV!!I highly recommend it, especially if you're a Netfilx or Amazon Prime subscriber and you want to watch shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Robert VanCamp"}, {"rating": 5.0, "review": "I love my stick!!", "verified": true, "helpfulness": "0/0", "author": "carol"}]