[{"rating": 5.0, "review": "Product is good. The only drawback is loose batteries​ inside.", "verified": true, "helpfulness": "0/0", "author": "Yeqifan"}, {"rating": 3.0, "review": "For what it was designed to do, it works well, I bought it under the assumption that it worked like the Chromecast device, it doesn't, I thought I could pair it up with my Androide tablet and have it transmitted to the TV, Didn't work, but other then that it works mush like the roku device, I have that as well as the chromecast really didnt need the fire tv stick. would i have bought it if i new it didnt work, No, the Chromecast  is really what i wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "keystarm"}, {"rating": 2.0, "review": "Don't waste your time on this one. Get the Fire Box just for the quad processor and less heat.  The TV Stick gets too hot", "verified": true, "helpfulness": "2/2", "author": "JoeFern"}, {"rating": 5.0, "review": "Works great, a must have if you are an Amazon prime member. Very simple and easy to set up. The remote works really well.", "verified": true, "helpfulness": "0/0", "author": "carey tanaka"}, {"rating": 5.0, "review": "This is such a great device, never have to get cable or satellite t.v. again!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Tracy L. Redwine"}, {"rating": 1.0, "review": "I have used a Google Chrome stick for about 2 years I decided to give the fire stick a try so that I could get amazon streaming video as well.  The device is unreliable and constantly freezes I've gone back to my Google Chrome stick.", "verified": false, "helpfulness": "0/0", "author": "TaTAylor"}, {"rating": 5.0, "review": "As advertised, no more chromecast, the remote works great.", "verified": true, "helpfulness": "0/0", "author": "Arnold B"}, {"rating": 5.0, "review": "Works great with it's own remote, also with my Galaxy 5 phone remote and also 7inch fire HD remote", "verified": true, "helpfulness": "0/0", "author": "Francis C Klauder"}, {"rating": 3.0, "review": "As a prime member, I was able to pre-order this device for half off.  For $19, I figured it was worth checking out.  I'm glad I didn't pay full price for the Fire Stick as it's an ok streamer, but has its issues.  I had been using Chromecasts (most recently) at home and expected this device to work as well as the Chromecast since they're in the same price point (and the Fire Stick has \"better' components).  I've been trying to find the perfect device for watching content from my home network and streaming. I've used the following setups: Xbmc on windows, Xbmcbuntu, Chromecast, Roku 3, and now Fire TV stick.The Fire Stick has a very nice looking on-screen user interface. The UI is much better looking than the Roku and is smooth and responsive at the beginning.  My wife enjoys the Fire Stick because it has an on-screen UI rather than having to open separate apps on her phone to watch content like we had to do with the Chromecast.We mainly use Plex, Amazon Prime Instant Video, Netflix, Hulu, and Flixster to watch movies and television.  Every app we have used worked really well at the beginning. (Noticing a theme here?)I wish I could say that we have found our perfect streaming device, but the issues it has prevent it from being so.  After running the Fire Stick for months, everything has started to slow down. The Fire Stick is slow to respond to button presses from the remote, the UI has become sluggish, apps are slow to respond (if at all), streaming buffers regularly, videos pause while the audio continues, videos go black while audio continues, apps freeze, etc. Our Fire Stick is not in a confined space, so there are not overheating problems due to lack of air flow. We are using the included extender which is supposed to help with wifi signal. I have been using the provided power supply brick and usb cable since the beginning. I have reset the device to factory defaults (which really sucks because you have to sit through the entire Welcome to Amazon Fire TV Stick video again as there's not way to skip it). I've uninstalled apps, cleared caches, cleared data, power cycled, etc. all to no avail. No matter what I do, the issues always come back shortly after trying different troubleshooting steps.I wish I could point all my issues to a recent software update, but unfortunately the problems occurred before and after the most recent update. I should also note, that my router is in close proximity to the Fire Stick and has excellent (80mbps) speeds with low ping.  I never had any of the streaming/buffering issues when running the Chromecast or doing anything else internet related, for that matter.I had contemplated buying a Fire Tv box, but with the problems we've had with the Fire Stick, I'm reluctant to drop $100 on a device by the same manufacturer.  I suppose I'll have to keep looking for the \"perfect\" media streamer.", "verified": true, "helpfulness": "2/2", "author": "Matt"}, {"rating": 5.0, "review": "Easy installation.  Really organized the services I have in one location.  Photos look good on big screen.", "verified": true, "helpfulness": "0/0", "author": "Katie"}]