[{"rating": 5.0, "review": "Easy to use. Works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Did not meet my expectation... YouTube is not free everything has to be paid for.", "verified": true, "helpfulness": "0/1", "author": "Bomo"}, {"rating": 5.0, "review": "I love it!  It was easy to plug in and the how to video helped in the beginning tremendously.  Being an Amazon Prime member definitelyhas its advantages...love the streaming and no shipping cost, not to mention the two day delivery on most orders.", "verified": true, "helpfulness": "0/0", "author": "teena rankin"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Pewanapta"}, {"rating": 4.0, "review": "Very easy to install and use. Streaming is slow.", "verified": true, "helpfulness": "0/0", "author": "Valerie Nousak"}, {"rating": 5.0, "review": "Love it! I have a Sony blueray DVD player which I can basically do the same thing but I llike this so much better.", "verified": true, "helpfulness": "0/0", "author": "Jerry Conner"}, {"rating": 3.0, "review": "Update, I have Network, Security, and PC degrees. 4 weeks old, the stick buffers randomly while I have gigabit Internet. This week number 5, it randomly does not wake when turning on. I have to reboot the stick and it works well for a while. Now I am 5 days past the final return date. Amazon says, call for warranty information. I wished I would have purchased the Fire TV although Amazon and Vudu don’t want to play together.Stick is still VERY FAST browsing Amazon stuff. Netflix and Flixster are slow responding. Flixster is my Vudu replacement. Current shows and movies have great picture quality, even on 4k TV.", "verified": true, "helpfulness": "0/0", "author": "The SWAG Tech \"SWAG'in\""}, {"rating": 5.0, "review": "Easy to hook up and easy to use controller.Works just like I hoped it would.", "verified": true, "helpfulness": "0/0", "author": "Jack G. Miller \"musiklover\""}, {"rating": 4.0, "review": "Very happy with the out come of the Fire TV Stick.  I would recommend it to friends and family.  I do however RECOMMEND that Amazon get their shipping up to par.  I was not impressed with the supposedly 2 day shipping of my order,  instead it took 4 days. This is when I also ordered prime for a 30 day trial.  Other than that I give Amazon 4 STARS!!!!!!", "verified": true, "helpfulness": "0/0", "author": "T-REX"}, {"rating": 5.0, "review": "I have been using it for a couple of months now. I have not had any problem with it. The app for controlling it is very convenient. The Fire Stick runs smoothly and is easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "brandon fulk"}]