[{"rating": 5.0, "review": "I bought this for my mother for Mother's Day. (I know, I know) SHE LOVES IT!!!!  This is her second favorite gift, next to her Kindle Fire.  So far she loves that the music has lyrics, so you can sing along.  She loves the slot machine and bowling games, and the fact that she can watch a ton of movies.", "verified": true, "helpfulness": "0/0", "author": "Toastie"}, {"rating": 2.0, "review": "The concept behind this product is awesome. The actual product.... could be better. My biggest issue is with the lag and freezing that often occurs from very basic usage. I often have to restart the fire stick (which I had to google btw to figure out how to do). At first I thought the issue was my internet, but it's not my internet works just fine. I also use Sling tv quite a bit and I don't know if it's them I should be ranting with, but Amazon supports them so I have no problem ranting here as well. Sling tv used to work great, now I'd say it works maybe a third of the time before telling me an error has occurred. The UX in terms of navigating their menu is awful too.I expected better Amazon. Affordable product shouldn't mean cheap experience, especially when Amazon is normally great in that regard.So... basically BE BETTER Amazon", "verified": true, "helpfulness": "1/1", "author": "NikkiS"}, {"rating": 5.0, "review": "Works wonderfully well.  I am considering weaning myself from cable and dish services and this fire stick is a great way to do it!", "verified": true, "helpfulness": "0/0", "author": "cynthia murphy"}, {"rating": 2.0, "review": "I really wanted to like this thing but I truly can't stand it.  Its constantly sticking or not working at all.  It has no real features and I get more apps on my roku, wii and playstation.  I don't recommend this for a main television.  Maybe a kids room.", "verified": true, "helpfulness": "1/1", "author": "M pulliam"}, {"rating": 1.0, "review": "Did not like because I have to pay extra for High-Def, and fades in and out", "verified": false, "helpfulness": "0/0", "author": "patricia a. bijaczyk"}, {"rating": 5.0, "review": "Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Krystle Morales"}, {"rating": 1.0, "review": "I hated this and sent it back. It was always loosing picture or sound and buffering all the time.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works very well and I use it daily. Remote is solid and it is well built and speedy with a decent UI. Great for prime members. However, please consider making a 4K/HDMI 2.0 model in the future for those of us with 4K televisions!", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Hubel"}, {"rating": 5.0, "review": "I love the Amazon Fire TV Stick.  I have been an Amazon prime member for a number of years.  I have always streamed to the TV either via an xbox, blu-ray, or directly to TV via the amazon loaded on the TV.  Streaming video via the Fire TV stick has been just as good outside of some minor buffering issues that I believe shall be resolved with a router upgrade.  I love the fact that the device is portable and have streamed while in the hotel.  I would definitely recommend buying one.", "verified": true, "helpfulness": "0/0", "author": "budmax"}]