[{"rating": 1.0, "review": "Unfortunately, my love for Amazon cannot overshadow this product I feel did not live up to what I thought it could be. I purchased two when the pre orders originally went up for sale. One for myself, one as a gift.I received my units yesterday, and I popped mine into the back of my TV. It kept rebooting from the Amazon Screen. The device itself actually recommended I use it in a wall outlet, so even though I could see the ugly wire going to my wall outlet, I obliged. Okay, now it's ready, Woot! Initial update. Okay, should be just a couple of minutes...20 minutes later, it has finished. Sweet, let's go. Oh, now it's installing? 5-6 minutes later, it's ready to be setup. Welcome Joseph P******e. Would you like to continue with your account or another? Well, this one I'm using for myself, so my account. Where do I put in my password? I don't? My Mastercard number is XXXXXX? So, if I gave this as a gift, anyone can just purchase apps, movies and TV shows on my account? Not cool.So, I have to go and put it in Parental Control so that the wife and family does not make purchases by accident, as she is not as up to speed with what is included at no extra cost in the movie and TV section (seeing that our other devices ask to verify a credit or debit card for each transaction) So, lets look for apps to add to this thing. Hmmm... buy this movie for 9.99, rent this for 3.99, where do I go to download apps? Let me use the search feature. WWE Network, lost connection. OK, lets go back home, WiFi is still connected, WWE Network, lost connection. Alright, it's new, lets soft reset it and pull the plug for a minute. It's back up. Search for WWE Network, black screen.I navigate a bit more, here is the apps menu at the bottom. They are organized by category. No option for all, in alphabetical order? Maybe I'm missing something, and can search, but if I did, it's not user friendly enough for me to plug and play like other popular options. Finished downloading my favorites.Lets try these games, should be fun to use between movies and shows. Download Flappy Bird, Kart Racer and a few others. Unplayable. The remote lags every minute or so. Left, Left, Left, nothing... then all of a sudden those three lefts activate. Now i'm off the track and behind. Lets try Flappy Bird. Jump, Jump, Jump (OK, this seems like it was meant for this) Jump (no reaction) darn. Now that action button presses, when it asks to continue.Nevermind, let me just stream something from WWE Network. Menu, Shows, PPV, Royal Rumble, Play, lost connection. Go home, go back in repeat, it plays for 30 seconds... lost connection.I'm sure with some updates this will get better in time, but I am not a patient person. I decided to return both devices.", "verified": true, "helpfulness": "72/87", "author": "sonofsicily"}, {"rating": 5.0, "review": "I love it!!! Movie start playing faster than a DVD! I have the slowest internet you can buy to! So easy to hook up that I did it in 2 min ( and I'm terrible at that stuff). Even has an instructional video when you get it started!!! Love love love! I'd give it 10 stars if I could :)", "verified": true, "helpfulness": "0/1", "author": "GR handyman"}, {"rating": 4.0, "review": "I have enjoyed using the fire stick. I also have the Chrome cast. Big plus for fire stick is you don't need any other hardware to use it Con. you cant stream from android phone or laptop like I can from Chrome cast.", "verified": true, "helpfulness": "0/2", "author": "D. S. Carithers"}, {"rating": 5.0, "review": "Very nice and very affordable. I was lucky and got mine for 19 dollars. I have used it for 2 days now and it runs very smooth. I use it for watching TV in my bedroom. I like the setup.  Also I like the fact that I can use my phone to use the voice feature that the supplied remote does not have. Games seem to run well too though I have only played 3 on it. All and all if you want a nice device with low cost to watch netflix or amazon it is an awesome choice.", "verified": true, "helpfulness": "0/1", "author": "Vegeta9991"}, {"rating": 5.0, "review": "Absolutely love it bye bye ROKU", "verified": true, "helpfulness": "0/1", "author": "Aaron"}, {"rating": 1.0, "review": "I'm sending my stick back after several frustrating days of attempted use. I've used a roku for several years with no problems, and will be plugging the roku back in tonight. I had no signal problems with my roku, even though it's several years old, but the fire stick immediately had problems maintaining a strong wifi signal. The big problem though, is that even when the signal was fine, I couldn't get videos to play. The system would just hang whenever I clicked on an episode to play. I had some luck with the device the first two days, but after that I couldn't get it to work at all. The support website is a joke. I tried uplugging several times, restarting, etc., but nothing worked. I also tried to reset the stick back to factory defaults, but the system would just hang when I entered my pin, so I couldn't even do that. Very disappointing.", "verified": true, "helpfulness": "1/1", "author": "J. Kaplan"}, {"rating": 4.0, "review": "Pros: very fast. sleek design.Cons: It recommended to use power outlet, but I use usb power either way. My tv has the usb prt next to the HDMI, so it is a little crowded. I recommend a shorter cable length, and switch the port to the end instead of on the side.", "verified": true, "helpfulness": "0/1", "author": "K. Nguyen"}, {"rating": 3.0, "review": "Hardware works fine. But good luck finding something from this decade to watch. Say your laid up on the couch after a skateboard injury and go to the search menu because the option menu only has a few choices from all of the providers that you're not subscribed to. So in this old DOS screen, you attempt to maneuver around the keys like writing a novel on your old rzr flip phone. THE  PRO.... you get typed in and YES you actually remembered a show you liked because you forgot to grab the tv guide for reference before you hobbled in to sit down. You remember, the one where Kurt Russell and Goldie Hahn were on the cover.  Cute couple is right!  Soo worth it bc now you're all set and now WHAT? Usually you can at least buy it for $2.99 even though you have a subscription to Prime but this says you need to have Hulu plus! Oh I see. I guess I'll just settle for 1989 dirty rotten scoundrels movie again. Or no wait, I still have cable. I do enjoy the screen savers tho as I loose interest and surf the net on my phone and fall asleep. Zzzzzzz", "verified": true, "helpfulness": "1/1", "author": "jarrid henderson"}, {"rating": 1.0, "review": "Dead on arrival.The screen is stuck on 'amazon' and won't go any further. So far... no impressed.", "verified": true, "helpfulness": "1/1", "author": "A.J."}, {"rating": 5.0, "review": "I bought the fire tv and the fire sticks for the kids. The sticks are great and easy to use within 10 minutes of opening the box. The interface makes everything so simple. I would highly recommend upgrading to the voice remote. Very happy with my purchase. I did find these cheaper at Best Buy.", "verified": false, "helpfulness": "0/1", "author": "Jason German"}]