[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Meg0797"}, {"rating": 1.0, "review": "LOADING.... LOADING ..... thats all it does. Says the network connection has a VERY GOOD signal but still wont load anything .", "verified": true, "helpfulness": "1/1", "author": "Exar"}, {"rating": 4.0, "review": "This is a cool little device with lots of features. I do not like how you have to plug a/c adapter into the fire tv stick but I do believe some tv's will power the stick with the a/c adapter but mine does not. This is a little inconvenient but manageable. It would be 5 stars if that was fixed.", "verified": true, "helpfulness": "1/1", "author": "Jacob Niven"}, {"rating": 5.0, "review": "Way better thanmy 5 Chromecast's.  My CC's would constantly pause and then the Loading % would appear at the bottom of the screen and Rinse and Repeat.I have the CC app on iPad, Iphone's and Chrome browser and all drop the connection to the CC after about 10 minutes of viewing whereas the Fire Stick comes with a remote control and apparently double the memory of the CC so there is a lot more buffering.I am now stuck with 5 CC's, I really think Google should step up and either send all owners a remote, offer a trade up program to the next gen for free OR full refund.It is us, the early adopters that stick our necks and wallets out and Beta test new technology and provide feedback to the manuf. about how their tech is working in a real world situation and should be taken care of if a product has issues like the CC does, a Google search will show you how many others are experiencing issues with it.I like how Amazon has chosen to go the Black packaging route vs. Apple's white.Amazon is doing a lot of things right, I really like the same day delivery and the Grocery delivery is an asset when we are too busy or come down with the flu like right now.  I have not purchased any Amazon Tablet's or phones, but would sure like to play with one sometime, I do need a new Tablet and Apple just released their next Gen but maybe the Fire would be better, I don't know, wish i could go see one and play with it, oh well, maybe Amazon will open stores sometime?????", "verified": true, "helpfulness": "0/0", "author": "A Super Smart Dude who provides HONEST Review's"}, {"rating": 4.0, "review": "Pretty nifty device, will get better when more apps are signed on.", "verified": true, "helpfulness": "0/0", "author": "Lush"}, {"rating": 4.0, "review": "Overall the Fire TV Stick was a good deal with the special pricing that I was able to get. Two minor problems that I have run into are first, the power cord was about 12\" too short for my closest available power source. Second, the WatchESPN app did not allow me to access the sporting events that I watch. I usually watch all kinds of college sports and I was not able to search by school and find the events that I wanted to watch.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey from Denver"}, {"rating": 3.0, "review": "Remote range is about 6 to 8 feet.Waiting for remote apple app to see if it better.", "verified": true, "helpfulness": "0/0", "author": "Rene Garcia"}, {"rating": 5.0, "review": "A wonderful product. I will definitely buy one for each of my TV's. Very fast and easy to use", "verified": true, "helpfulness": "0/1", "author": "Steve & Robin Stinnett"}, {"rating": 2.0, "review": "My wife bought this for me to use when traveling for work. Unfortunately, it is completely worthless for that purpose because it is not able to connect to hotel wifi networks. However, when we use it on our home network, it's quite nifty. It seems there may have been a rush to get the product on the market for the 2014 holiday shopping season and some bugs still remain.", "verified": true, "helpfulness": "0/0", "author": "Harris429"}, {"rating": 2.0, "review": "I was looking for a way to stream spotify on my tv which is the main reason I bought this but the spotify connect app is never detected by my iphone 6. My phone detects every other pc and mac I own but not the tv. I have updated, restarted, reinstalled, re logged in on both ends multiple times to no avail. Don't buy it if you want it for streaming music wirelessly to your central console in the living room. And yes, I am a US resident and a premium subscriber which is needed by the connect app.", "verified": true, "helpfulness": "0/1", "author": "Rishav Mukherji"}]