[{"rating": 5.0, "review": "LOVE IT!!", "verified": true, "helpfulness": "0/0", "author": "Amy L Boaz"}, {"rating": 5.0, "review": "Great product.  We have an Apple TV for our main TV that cost $100.  We just purchased this Fire Stick for another TV and found it is just as capable and is more mobile for use on others tvs.  This will definitely be a strong competitor for Apple.  Would definitely recommend this to others.", "verified": true, "helpfulness": "0/0", "author": "T.J's Mom \"Suze\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lindsey Atkinson"}, {"rating": 5.0, "review": "The Fire TV Stick is very easy to use!  My spouse who has a hard time with electronics likes it alot.", "verified": true, "helpfulness": "0/0", "author": "Belasko7"}, {"rating": 5.0, "review": "I luv it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Set up was a snap.  You can't beat this product for the price.", "verified": true, "helpfulness": "0/0", "author": "Rebekah Walton"}, {"rating": 5.0, "review": "It's easy to set up and use! There's only one thing I'm disappointed with is, that I can't access YouTube! Now I may just still be getting used to the device, but I'll get tinkering with it. Other than that, I'm very pleased and would recommend it to others!!!", "verified": true, "helpfulness": "0/0", "author": "Marisa"}, {"rating": 3.0, "review": "The product is AMAIZING!! but in my country does not works all functions, so I can't used as I want.", "verified": true, "helpfulness": "0/0", "author": "Eddyn Gerardo Soto Arguedas"}, {"rating": 5.0, "review": "Wife and I love it. Very simple to install, plenty of apps for a wide selection of programs (both free and paid) and crystal clear viewing. With using this for amazon prime video, hulu plus and an antenna for our local channels we have now dropped cable. For less than 20 bucks a month we have more TV programs and movies than we could ever watch.", "verified": true, "helpfulness": "0/0", "author": "Earl Gunner Moore \"Earl\""}, {"rating": 5.0, "review": "Great item!!!", "verified": true, "helpfulness": "0/0", "author": "dennis"}]