[{"rating": 4.0, "review": "We're working our way through the inventory.  Don't know if it ever gets upgraded, but there's plenty to work with.  Easy to use.  Efficient.", "verified": true, "helpfulness": "0/0", "author": "W. Robinson"}, {"rating": 5.0, "review": "fantastic addition to your home entertainment. easy and responsive with lots of options. great to sink to your prime account to take advantage of amazon's variety of services.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 4.0, "review": "Awesome device.  Has been great on vacation and in the home. The wifi on my device has issues with the connection at times and occasionally has streaming issues but overall a very solid device. Happy customer.", "verified": true, "helpfulness": "1/1", "author": "Peter Willis"}, {"rating": 4.0, "review": "Its great but, something's are not free its good great connection", "verified": true, "helpfulness": "0/0", "author": "sylvia fulmore"}, {"rating": 4.0, "review": "Remote broke sooo easily! I love the Fire stick but the circle part and enter button part have come off of my remote countless times. This last time it broke off it was stepped on and not able to be reapplied. :( I don't feel like these pieces should be able to come off so easily since they're pretty essential. I have been using my phone to control it, but it means I have to control it for my kids every time they want to change what they watch instead of logging them in and letting them have at it for their reserved tv time.", "verified": true, "helpfulness": "0/0", "author": "EverythingFromAmazon"}, {"rating": 5.0, "review": "Performs flawlessly though it would have been nice if the voice function that comes with the app also affected other apps on the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "M.R. Ercolano"}, {"rating": 5.0, "review": "So easy a child can use it... my 3 year old has mastered this, turns on the tv and loads up netflix without help, in fact she won't even let me help anymore! Well designed, simple to use, and performs well. There have been a few buffering issues, but that is my internet connection, not this product.", "verified": true, "helpfulness": "0/0", "author": "Peter P"}, {"rating": 1.0, "review": "Recently rated I loved it, but after a month having it, not even using it, the remote does not work :(", "verified": true, "helpfulness": "0/0", "author": "Lalenavcas"}, {"rating": 5.0, "review": "It's the best ever.", "verified": true, "helpfulness": "0/1", "author": "Nate Patrick Durham"}, {"rating": 4.0, "review": "A must have!!!", "verified": true, "helpfulness": "0/1", "author": "BigStue"}]