[{"rating": 3.0, "review": "Would like to see more apps, especially the Time Warner Cable app. Also using with \"good\" signal strength which causes loss of network. Maybe the Fire Stick could have a better antenna. I am adding an extender with the hope of curing my network issues.", "verified": true, "helpfulness": "0/0", "author": "Jim Philleo"}, {"rating": 4.0, "review": "Pretty cool!", "verified": true, "helpfulness": "0/0", "author": "P B."}, {"rating": 5.0, "review": "I love it.it is great. I am going to get another one.", "verified": true, "helpfulness": "0/0", "author": "judy white"}, {"rating": 5.0, "review": "Works like magic! Easy to install and navigate. I like it better than the Google Chrome", "verified": true, "helpfulness": "0/0", "author": "tim nguyen"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jrs0003"}, {"rating": 4.0, "review": "I really like the concept of the Fire TV stick.  It's only sticking point is that it needs to be located with a TV that is close to your Wi-Fi network box as that is the only way to get it to work consistently.  Other than that, it is easy to set up, easy to use and is a great way to enhance your viewing experience with not only your Amazon Prime membership, but those of Netflix, Hulu and others as well.  Well done.", "verified": true, "helpfulness": "0/0", "author": "Ali1023"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "ovad salama"}, {"rating": 3.0, "review": "too many additional subscriptions for TV shows and episodes and prime didn't cover a lot of the shows that I wanted to watch without a fee", "verified": true, "helpfulness": "0/0", "author": "Pamela J Ledsinger"}, {"rating": 5.0, "review": "Good and pretty fast. I face one issue with crackle app. It throws me error some time. But the fir stick is awesome and i love it :)", "verified": true, "helpfulness": "0/0", "author": "Umashankar"}, {"rating": 5.0, "review": "Easy to install. Up and watching within minutes!", "verified": true, "helpfulness": "0/0", "author": "Shirley Petronaci"}]