[{"rating": 2.0, "review": "Seemed like a good idea so I bought 2.  After setting one of them up we discovered that it offers the same stuff that Netflix offers and charges for most everything else.  Not a fan.  Now I just need to send them back!  URG!", "verified": true, "helpfulness": "0/0", "author": "Casual Shopper \"CS\""}, {"rating": 5.0, "review": "Excellent technology...easy to use.", "verified": true, "helpfulness": "0/0", "author": "Bruce Kallsen"}, {"rating": 5.0, "review": "A smart TV for under $40! Amazing!", "verified": true, "helpfulness": "0/0", "author": "Jason Reynolds"}, {"rating": 5.0, "review": "More memory than Roku... just and over all better unit. If you have buffering issues get a dual band router and have your firestick be the only one on that channel... also, make sure you have a strong wireless signal by your TV. If you are deciding which one to choose... Let me make your decision for you... FIRE TV STICK!!!!", "verified": true, "helpfulness": "0/0", "author": "Tim Teubert"}, {"rating": 4.0, "review": "Love it. But wish didn't have to purchase some of the shows. User friendly but the remote is tiny! Resets on it's own sometimes even in middle of show. A little glitchy, but not too bad. Would love an update to fix the glitches.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The device is easy on operation and use, the setup to audio-video projector was easy and works great", "verified": true, "helpfulness": "0/0", "author": "D. I. GAVER"}, {"rating": 5.0, "review": "It really is as simple as plugging it into the tv and turning it on. The layout is nice and it loads quickly. I have no complaints.", "verified": true, "helpfulness": "0/0", "author": "GA shopper"}, {"rating": 5.0, "review": "Love it, easy to set up and so easy to carry with so I always have Prime and Netflix wherever I go.", "verified": true, "helpfulness": "0/0", "author": "Vicky"}, {"rating": 5.0, "review": "Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Mary Rider Stancyk"}, {"rating": 5.0, "review": "Easy setup, tons of content. Have not used Netflix since I got it.", "verified": true, "helpfulness": "0/0", "author": "japadu"}]