[{"rating": 5.0, "review": "My brother in law wanted this for Xmas so he got it.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "madison resident"}, {"rating": 3.0, "review": "I've had the Fire Stick for about a month and have been debating on what rating to give it. Our household has many Chromecasts, which when we first got were a bit buggy, but now are pretty solid after updates. We were excited to give the Fire Sticks a try because of the remote and so we could watch Prime videos. Setup is super nice and easy and the remote works well; it IS nice not to have to use your phone for everything.I was a bit disappointed to have to pay for the Plex app. Overall, things work pretty well. Playback on all apps is a bit glitchy. At first, there would hiccups, and the sound would buzz for a second. This happened in Netflix, Amazon, and Plex. We hooked up the second fire stick we have and it had the same issues.After an update, the sound buzzing has gone away, but the hiccups have not. We also had an odd issue of a video on our Plex not playing sound on the fire stick (pre-update). It played perfectly on our computer, on our phones, and through the Chromecast.Even with all of its flaws, we typically use the fire stick over the Chromecast because of the remote.", "verified": true, "helpfulness": "0/0", "author": "Alicein Wonderland"}, {"rating": 3.0, "review": "I bought this device for two reasons, to be able to \"project\" from my Windows laptop, and because it was such a great value. As a streaming device it's a great value. The fact that it comes with a remote is great. I have used the following apps and found them all to work well: Hulu Plus, Smithsonian, Amazons Weather app. The PBS app did not work quite right (the main panel displayed a message to register Fire TV, but the video clips below that message played videos fine).I will keep the device in the hope that Amazon Develops support for Miracast that actually works from Windows laptops (Miracast is supposed to be a device independent standard). As a Netflix / Hulu player, it is great.", "verified": true, "helpfulness": "1/1", "author": "T J Watson"}, {"rating": 5.0, "review": "I really like the fire tv stick installation is a wiz easy to view and control I highly recommend", "verified": true, "helpfulness": "0/0", "author": "Lillian Ochoa"}, {"rating": 1.0, "review": "Unplugged it from my tv and it damaged my HDMI port on my 55\" TV. Now I am left with only one hdmi port and all Amazon did was provide a partial credit for the fire stick purchase (not nearly enough to cover repairing my hdmi port)! Stay away from this device.", "verified": true, "helpfulness": "1/2", "author": "Reviewerr"}, {"rating": 1.0, "review": "I have 2 of these. I hooked both up and both worked perfectly for a few hours. Now I keep getting messages saying to check the internet connection and when I do the connection looks perfect. I have no issues with and of my other WiFi devices. I had such high hopes for these. I'm very disappointed. :(", "verified": true, "helpfulness": "0/1", "author": "KLR2mom"}, {"rating": 1.0, "review": "This product has barely ever worked.  It is in the same room as our router & can't connect to our network due to low signal strength.  Our smart TV that is located all the way across the house from our router has no problems connecting to our network.  What a waste of my time & money.  Luckily there is a 30-day return window & I'll be sending mine back today.", "verified": true, "helpfulness": "0/1", "author": "Sassy"}, {"rating": 5.0, "review": "I love it! I had a Chromecast, but my Amazon Fire TV Stick is like a Chromecast on steroids!I could never play my purchased Amazon songs on the Chromecast...But, now...I can play everything on my Amazon music, on my Fire TV Stick .Plus, its so much easier to do all selections of movies, tv, music, pictures, etc...right on tv screen with either the Fire TV Stick app or the included remote control :)", "verified": true, "helpfulness": "0/0", "author": "Colleen R Hand"}, {"rating": 2.0, "review": "This would be great if it actually worked!  Freezes all the time and keeps disconnecting from my wifi. (And it couldn't be closer to my router...about 8 inches away). When it works...it's great!  But that would be about 25% of the time.  I'm constantly unplugging it.  One of these days it's just not going to be plugged back in.  If you have an Xbox...pretty much the same thing, but your Xbox actually works when you turn it on!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]