[{"rating": 4.0, "review": "pretty good so far. the only problem i have noticed is that sometimes i cant access netflix or youtube or prime. after a couple of attempts it works fine", "verified": true, "helpfulness": "0/0", "author": "jamaki"}, {"rating": 3.0, "review": "Easy enough to install. Good remote. Does budget more than I'd like.", "verified": true, "helpfulness": "0/0", "author": "James Dean"}, {"rating": 5.0, "review": "Exceeded expectations....brings a whole new world of entertainment to me....Thank you.", "verified": true, "helpfulness": "0/0", "author": "Toby S. Gridley"}, {"rating": 1.0, "review": "Warning! Never Ever Buy This Product, its completely waste of  money.the time we purchased this product we did not get a chance to plug in right away and took us few weeks, the first time I plugged in to my TV it freezes up on itself and keep re-booting it. We did not pay attention and wasted few more days before time to return. I wished I bough similar Chrome from COSTO and I do not have to worry about return policy. Amazon return policy should be changed to reflect a trusted company.", "verified": true, "helpfulness": "0/1", "author": "jazzy"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "sollex"}, {"rating": 1.0, "review": "I give it ZERO stars!  It won't start!  I have it connected as directed and the stick gets really hot, but never starts.  I tried holding the \"home\" button for more than 5 seconds--NOTHING!  My son wasted his money on my Mother's Day gift.", "verified": false, "helpfulness": "0/1", "author": "Debra Radcliffe-Borsch"}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Hannah E Kimbell"}, {"rating": 5.0, "review": "Easily set up and it has better picture quality than the Roku I was using. Well worth the price!", "verified": true, "helpfulness": "0/0", "author": "RNDiverBen"}, {"rating": 5.0, "review": "Super easy to install and set up. Was up and running in less than 5 minutes.  Very impressed with the selection of programs on Prime.", "verified": true, "helpfulness": "0/0", "author": "Jodi White"}, {"rating": 5.0, "review": "So happy to finally be able to catch up on so many TV shows and movies I have missed! And at my command!", "verified": true, "helpfulness": "0/0", "author": "Ms Vicki J Larson"}]