[{"rating": 1.0, "review": "Not impressed. Of course the order started out wrong that left a bad taste that still lingers. I put this in my basket a on the morning of the great Amazon sale at $23.00 by the time my wife ordered it a little while later it was $39.00 so I paid top dollar for an item that was suppose to be on sale. The stick doesn't give me any more than I already had with my Kindle hooked up with my HDMI cable. In fact it gives me less. Not impressed at all.Oh well we all make mistakes and this one is one of mine.", "verified": true, "helpfulness": "2/5", "author": "Texan"}, {"rating": 5.0, "review": "I have had this for over a week now and have really enjoyed it!  It is really easy to use and I LOVE the app on my phone so when I have a sleeping baby on me, I am not searching for the tiny remote!  I have cancelled my cable and hope that this amazon fire will be all I need!  Install was a breeze as well.", "verified": true, "helpfulness": "0/1", "author": "Jenny McDonald"}, {"rating": 5.0, "review": "Easy setup...very intuitive to use.", "verified": true, "helpfulness": "0/1", "author": "Ryan Ross"}, {"rating": 3.0, "review": "Only thing is the pausing of programs is annoying.", "verified": true, "helpfulness": "0/2", "author": "angela"}, {"rating": 3.0, "review": "Works very well for Amazon Prime content. I have been very disappointed with the performance of Kodi with the Fire Stick - especially for live TV. I have not yet tried the HDhomerun View app yet. Or the Plex app. Will try these and report back later.", "verified": true, "helpfulness": "0/1", "author": "Frank Suchanek"}, {"rating": 4.0, "review": "Easy to set up. Had a problem the first night and a note came back saying  that the stick was too close to my TV. Didn't change anything and the next night it played fine. Am waiting to see if it continues to play as expected.", "verified": true, "helpfulness": "0/1", "author": "salgal"}, {"rating": 4.0, "review": "Worked as promised. Would recommend it.", "verified": true, "helpfulness": "0/2", "author": "EDDIE FULLER"}, {"rating": 4.0, "review": "Overall I am very pleased with the Amazon Fire TV Stick. It was quite easy to install. I bought it to use with Amazon Prime. Occasionally there's a buffering issue. More thorough written instructions would be good to cover beyond the very basics.", "verified": true, "helpfulness": "0/1", "author": "LINDA e"}, {"rating": 3.0, "review": "Easy to load and set up.  But I was surprised at the need to 'subscribe' to each channel.....and at the cost of many of the channels.  I'm trying to slowly 'exit' from cable (because of my low 'fixed' income) but fear I'll be paying the same or close with this 'new' way to access TV entertainment....without the benefit of Internet access!", "verified": true, "helpfulness": "2/3", "author": "Colleen Jones"}, {"rating": 5.0, "review": "Fantastic so far. I've had it for just a few weeks and the convenience of not having to wait for my Xbox to power up and be ready is worth the price itself, not to mention reducing the wear and tear of always having the game console powered on.So far no dreaded buffering, which I wondered about due to the WiFi only connection, I have Verizon Fios and the Fire Stick is only a few feet from my router.Using this with the included remote is a great cost-effective way to access content without killing your game console(s), and it's way more convenient as well.", "verified": true, "helpfulness": "0/1", "author": "Mark S. Hanington \"dingo01\""}]