[{"rating": 5.0, "review": "It's all good. A bit of a learning curve but not too difficult to figure out.", "verified": true, "helpfulness": "0/0", "author": "Gayle Clarke"}, {"rating": 5.0, "review": "This item word very well. The small remote operates Amazon prime by itself", "verified": true, "helpfulness": "0/0", "author": "thad foster"}, {"rating": 5.0, "review": "So far, so good.  We haven't used the stick much yet, are still catching up on dvr'ed regular tv but it will be great come summer when it will be nice to have Prime at our fingertips.  What we have watched has worked fine.", "verified": true, "helpfulness": "0/0", "author": "19Jan46"}, {"rating": 2.0, "review": "The devices works but has problems.It work for a while and this cause a problem with video.I have gotten the blue screen saying that is has problem with HDCP and not showing the video. I have to then unplug the firestick from the wall andthe tv, then turn off the tv, then turn the tv on and then repower the firestick, then replug it to the tv.This is the only device I have had such trouble.I have used about 10 devices with this tv and this is the first time I have gotten HDCP blue screen problem.After google around I found out this is a problem others are having.", "verified": true, "helpfulness": "0/0", "author": "Michael L Bernson"}, {"rating": 4.0, "review": "Set up kind of stupid but works well, fast. And the remote works amazingly.", "verified": true, "helpfulness": "0/0", "author": "Matthew Espinosa"}, {"rating": 5.0, "review": "The Fire TV Stick is easy to use.  It also allows me to continue to stream NetFlix now that I've switched to the Linux operating system for my computer.", "verified": true, "helpfulness": "0/0", "author": "David G"}, {"rating": 4.0, "review": "Did some research on other IT sites as well as Amazon to determine which TV streaming tech I wanted. Disclosure; I am a Prime member for a few years now. Still wanted the best streamer to transition from my Blu-ray player which is getting old and of course lots slower when streaming off the internet. And no updates seemed to be coming from the maker for my model :( Also I have an older model 40\"Sony TV but open HDMI slots. Looking at the price for all the smart TV's out there and was dissuaded from buying a TV. Thus to the Fire TV Stick very good option for my needs. Downside 1. pricey 2. doesn't mirror with my Kindle Fire HD 8.9 tablet (still can use HDMI to tablet cable to connect to TV). Jury is still out while getting to know the TV Stick but so far things do happen faster and it has only shut down once (some nonsense about my internet connection while all my other devices had no such problem). All in all got Prime this is a good add on device.", "verified": true, "helpfulness": "0/0", "author": "Oldsoldier22 \"Chief3lw\""}, {"rating": 5.0, "review": "Easy to use and I love all the shows I can watch.", "verified": true, "helpfulness": "0/0", "author": "Catherine Stafford"}, {"rating": 5.0, "review": "Amazing and very fast. It is a great choice if you want to make smart your TV.You can add aplications, thats very important for me.", "verified": true, "helpfulness": "0/0", "author": "Gerasense"}, {"rating": 5.0, "review": "I'm an average tech-level person on a good day! But, I had this up and running in less than 5 mins. Streams way better than the Roku. I ordered another for the guesteoom TV.", "verified": true, "helpfulness": "0/0", "author": "MJ Gillis \"Brown-eyed Girl\""}]