[{"rating": 3.0, "review": "would like local channels", "verified": true, "helpfulness": "0/0", "author": "safe feelings"}, {"rating": 5.0, "review": "Very good. We have had a few roku devices over the years and decided  to give this a try.  Works great. Does have limited range being a stick.  I originally had it upstairs and across the house from the router. It worked but with some lag.  Moved it to a tv on the main floor now runs great.", "verified": true, "helpfulness": "0/0", "author": "Michigan Man"}, {"rating": 5.0, "review": "works as well as Roku for half the price!  Takes a while to find the Pandora app, but works great!", "verified": true, "helpfulness": "0/0", "author": "Lyn Clements"}, {"rating": 5.0, "review": "Was very easy to install, really like it.", "verified": true, "helpfulness": "0/0", "author": "Catherine Jordan"}, {"rating": 5.0, "review": "Now I can watch movies at the times I want to. Love this product.", "verified": true, "helpfulness": "0/0", "author": "MH"}, {"rating": 5.0, "review": "I am very pleased with the Amazon Fire TV Stick. I bought it to use because my Samsung smart TV's smart hub stopped working and I was unable to watch Netflix and Amazon Prime movies, which I subscribe to. Now with the Amazon Fire TV Stick I can watch Netflix and since I'm an Amazon Prime member it is so easy to access all the Amazon Prime movies and music. I'm still discovering all the apps and games that are available.  The ease of use is wonderful, just plug in and play!", "verified": true, "helpfulness": "0/0", "author": "meilan"}, {"rating": 4.0, "review": "Netflix app needs work it is annoying, loading another movie before credits finish. I want to pick my own movies. Hard to get Netflix to work, it took many tries.", "verified": true, "helpfulness": "0/0", "author": "Thomas L Zmij"}, {"rating": 1.0, "review": "Keeps freezing up! Going to check out Roku or Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Tina hartman"}, {"rating": 1.0, "review": "had ghosting issues on true detective. Amazon was prompt and delivered a 2nd TV stick as replacement. I updated software, installed the apps. Similar ghosting issues. HBO go menu is also a bit slow to react. I then opened smithsonian, ted, huff post live, and prime TV. I notice that HD content causes the most hiccups. And if there's a lot of movement. If the camera is panning while multiple things are moving the ghosting can be pretty bad. So depending on content it can range from unwatchable to slight annoyance. Spent nearly an hour with their nice reps. They're sending a third one but I'm about to give up.", "verified": true, "helpfulness": "0/0", "author": "Jason Tsai \"general enthusiast\""}, {"rating": 5.0, "review": "I've heard a lot of people wonder if it was something worth picking up, essentially asking \"what does this thing do that my TV doesn't do already?\" The answer is going to be different for different people, but here's an easy way to think about it; Amazon Fire TV Stick is an excellent purchase", "verified": false, "helpfulness": "0/0", "author": "Violette\tLuvenia"}]