[{"rating": 2.0, "review": "Being an Amazon Prime member, I saw the Fire TV Stick as a great opportunity to finally cut the cord on cable/satellite. I signed on to Netflix as way to enhance viewing options. While I didn't encounter as many issues of buffering and cutting out with Prime viewing, I did have quite a few of them with some of the other apps, including Netflix. I upped my internet speed from my ISP and  purchased a WiFi extender with hopes of correcting the problem yet still had issues. I even considered purchasing a new router to see if that would help. I was to the point of thinking I was premature on the idea that it was possible to cut the cord at this time. However, I decided to try a Roku 2 to see if that made a difference. It made ALL the difference!! The Roku did not buffer or cut out once, not once. The Fire TV box may be a better alternative to the Fire TV stick if you want to stick with Amazon products. As for me, I will be purchasing additional Rokus  for the additional TVs in my home. Roku offers many more channels and the ability to watch an entire program without buffering. Plus the cost comparison makes Roku 2 even more attractive:Fire TV Stick $39.99, Roku 2 $59.99, and Fire TV box $99.99. I really wanted to like the stick because there are no visual cords but the Roku box is much smaller than I expected. I cannot address the Roku Stick since I have not tried it. Roku 2 Streaming Media Player (4210R) with Faster Processor (2015 model)", "verified": true, "helpfulness": "0/1", "author": "psat"}, {"rating": 5.0, "review": "The Amazon Fire Stick is perfect for me to watch my Amazon Prime Instant movies. The movies are clear and I have no problem connecting it with my Panasonic TV. best purchase this year!!!", "verified": true, "helpfulness": "0/1", "author": "Lady"}, {"rating": 5.0, "review": "Love it! So simple to set up, works great!", "verified": true, "helpfulness": "0/1", "author": "Debora Martinson"}, {"rating": 5.0, "review": "Works perfect", "verified": true, "helpfulness": "0/1", "author": "Chuck Boroff"}, {"rating": 4.0, "review": "This is a great improvement over my old Roku.  I would like either tactile or color definition between the Navigation ring and the Select button.", "verified": true, "helpfulness": "0/1", "author": "Kieran C. McCabe"}, {"rating": 1.0, "review": "This is the biggest piece of crap I have ever bought. I have spent 20 minutes now just trying to enter my WiFi password. When you type, clicking the right button makes it go down half the time, the other half, it goes up. Clicking in the center which is usually enter...well it chooses which direction it wants to go. You get my point. I still haven't gotten the first letter entered correctly in 20 minutes. Ridiculous!", "verified": true, "helpfulness": "0/2", "author": "Amanda Varnum"}, {"rating": 5.0, "review": "I love my fire TV stick. I use it every single day in a room where I do not have a cable box. It has been very reliable and fast. The picture is crisp and clear. I have had some buffering issues on netflix, but nothing serious and nothing that bothers me enough to complain. I am so glad I purchased this and wish I purchased it sooner.", "verified": true, "helpfulness": "0/1", "author": "Vicki"}, {"rating": 5.0, "review": "Awesome. love it.", "verified": true, "helpfulness": "0/1", "author": "Tyrone Seneviratne"}, {"rating": 3.0, "review": "I've had the stick for about a week now. The first day we had issues getting an app to work and spent a good half an hour on the phone for it...and then yesterday I go to turn on the TV with it and it's just a blank black screen...I had to completely unplug it to reset it and get it to work. All this within a week doesn't give me high hopes for it. But I guess time will tell.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy, easy to install-what a value!!!", "verified": true, "helpfulness": "0/1", "author": "joy acosta"}]