[{"rating": 5.0, "review": "It is great that we can watch Netflix from both televisions.  The remote is simple to use.  The movie options are awesome.", "verified": true, "helpfulness": "0/0", "author": "Roxanne"}, {"rating": 5.0, "review": "😀", "verified": true, "helpfulness": "0/0", "author": "Robert Kirby"}, {"rating": 3.0, "review": "I bought the Fire Stick as a long time Amazon Prime member to take advantage of all the free content.  There is a lot of free content, but I was disappointed to find that you get a lot of stuff pushed at you that has to be purchased.  If you search for a TV series, the first thing you see is not the free episode 1 of season 1, you get the latest season, where each episode is $3!  Any many long running series don't offer any free episodes at all.  Any you can't rent fairly recent movies.  They have to be purchased for around $20.  What good is that?The remote and navigation controls are very intuitive and easy to use.  However, the organization of the content leaves a little to desired.  While the categories labeled Prime are free with Prime, everywhere else is a random mix of free vs pay_for items, so when you see something you like, you have to look and see whether its free of not, and chances are very high that it's not free.", "verified": true, "helpfulness": "0/0", "author": "Doug Domke"}, {"rating": 5.0, "review": "Easy set up", "verified": true, "helpfulness": "0/0", "author": "Peter Leslie"}, {"rating": 5.0, "review": "I loved it and all of it's  features.", "verified": true, "helpfulness": "0/0", "author": "dfeenx"}, {"rating": 4.0, "review": "I love it thus far, there are some movies i have been meaning to see,& they are right here for me to watch right at home,in which I'D  rather be", "verified": true, "helpfulness": "0/0", "author": "Christilee Johnson"}, {"rating": 5.0, "review": "WONDEFULL", "verified": true, "helpfulness": "0/0", "author": "COUSIN VINNIE"}, {"rating": 5.0, "review": "ONCE I REDID MY WIFI/MODEM, I FOUND THE \"STICK\" A QUICK METHOD TO GET TO THE AVAILABLE SITES. ITS A VERY USEFUL AND AN EASY \"TOOL\" TO USE", "verified": true, "helpfulness": "0/0", "author": "FLORIDA MARV \"better sleep\""}, {"rating": 5.0, "review": "I just luv it glad I bought it", "verified": true, "helpfulness": "0/0", "author": "Zenaida R. Ramirez"}, {"rating": 5.0, "review": "Have really enjoyed movies on the big screen from prime", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]