[{"rating": 5.0, "review": "The Amazon Fire TV stick is an easy and convenient way to get prime and other media on your tv. I no longer pay for television service that delivers lousy programming and channels I don't want.  A little creativity and the fire stick gets me everything I need in the tv department.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "It was great", "verified": true, "helpfulness": "0/0", "author": "Adrian aldaz"}, {"rating": 2.0, "review": "I got no satisfaction what so ever from this product. The initial set-up process took me around 30 minutes because it could never connect to my internet or connect to my fire stick. After that headache it took several hours for it to finally connect to my Netflix account, once that was done it took another several hours for all the Netflix data to load; **Menus, titles, etc.* Most of the time I was reconnecting the device and restarting it because of a failed Netflix signal or having no menu at the Netflix load screen. I tried downloading the karaoke app as well, this took around 3-4 hours to work; finally after getting it working all we could hear was an echo while we were singing..even the apps were a totally disaster. This little device was not worth the $24.99 I spent on the awful Amazon prime day.....sold it to my sister, Thank God I got rid of it. I'm going to try other brands just to see what else I can find besides this little device of doom.PRO:.....noneCONS: Never stays connected long enough for me to finish an episode of any show on Netflix, complete waste of money and time. If you buy this make sure you have internet speed that matches the speed of the flash.", "verified": true, "helpfulness": "0/0", "author": "RevengeOfTheWizard"}, {"rating": 5.0, "review": "Could have a better Wi-Fi range", "verified": true, "helpfulness": "0/0", "author": "Christian Aran Tuter"}, {"rating": 3.0, "review": "I can not get HD quality with the stick for the movies.  Pictures are HD. Music is fine.  I don't play games.", "verified": true, "helpfulness": "0/0", "author": "DaBenz"}, {"rating": 5.0, "review": "EASY TO USE", "verified": true, "helpfulness": "0/0", "author": "Marysol Calvillo"}, {"rating": 5.0, "review": "We purchased the Fire primarily to use in conjunction with our Kindle to stream internet content on the TV. My husband is able to stream his sports-car racing events on the TV screen with no problem! Not only that but we will use it to watch our Amazon prime movies and use it for Netflix and Hulu. Great buy.", "verified": true, "helpfulness": "0/0", "author": "Cover to Cover"}, {"rating": 5.0, "review": "Awesome deal and easy to use", "verified": true, "helpfulness": "0/0", "author": "Hunter Cole Brooks"}, {"rating": 5.0, "review": "A little trouble connecting to wifi in another room.", "verified": true, "helpfulness": "0/0", "author": "Betty Lamb"}, {"rating": 5.0, "review": "Love love it!", "verified": true, "helpfulness": "0/0", "author": "hulagirl"}]