[{"rating": 5.0, "review": "Enjoy very much except unable to access Netflix", "verified": true, "helpfulness": "0/0", "author": "Tom McWilliams"}, {"rating": 5.0, "review": "My family love the fire tv stick. Its easy to used, even my 4 year old use it.", "verified": true, "helpfulness": "0/0", "author": "Darline Gabeaud"}, {"rating": 5.0, "review": "It has been working perfectly, no problems and use it constantly. Very happy with it. Was a little skeptical with some of the mixed reviews, but had a chance to get it at the introductory price and I am so glad I did. Good job amazon. It works for me.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Great product.  Easy to use. Makes any new TV a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "vsf"}, {"rating": 4.0, "review": "works just great.", "verified": true, "helpfulness": "0/0", "author": "Roger K. London"}, {"rating": 2.0, "review": "I hate this thing. it has so many problems, sure its more powerful than a chromecast but the apps on it suck. PLEX is crashing a ton  and sometime won't even launch, I bought it for the better wifi, but it doesn't seem to make a big difference.", "verified": true, "helpfulness": "0/0", "author": "Kyle Rooney"}, {"rating": 4.0, "review": "I found it hard to open the remote which is essential to setting up the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "A. BRADLEY \"culture curator\""}, {"rating": 5.0, "review": "Bought this for my parents since they don't have a smart TV and so far they love it. They are not very tech savy, but they can still use this.", "verified": true, "helpfulness": "0/0", "author": "ShopperMe"}, {"rating": 4.0, "review": "I have been using Netflix on my TV via my PS3 for quite some time now and I have to say that, while the interface itself, on-screen, is the same visually, the picture via the Fire TV Stick is much cleaner with less freezing and stutter and quicker load times. Add to that all the other features in the Amazon Fire TV Stick and I am very pleased. I do wish there were more Prime movies and TV Shows for the annual price i am paying, but overall I am still very happy.My only complaint, and the only reason this did not get 5 stars, is that there should be at least the option for a \"universal\" remote available that can work with my TV, DVR, and other devices, as well as the option to connect an external hard drive to the  Fire TV Stick for downloads. I understand the larger, more expensive  Fire TV box has that, but it would be simple enough to include an additional USB or HDMI output to allow connection of ones own backup drive.", "verified": true, "helpfulness": "0/0", "author": "Evilboy"}, {"rating": 5.0, "review": "It is great.been watting for something like this for a while.", "verified": true, "helpfulness": "0/0", "author": "betty anding"}]