[{"rating": 1.0, "review": "I bought this along side my Kindle HDX 7, but I think it might have been a mistake. It took forever to finally find my Wi-fi signal. The first time trying, it kept dropping connection or not finding one at all. After it finally found a connection the stick then froze on me. Finally after getting it connected and stable I tried display mirroring with my Kindle HDX 7, tried is the key word. My kindle could see the fire stick, but when trying to connect it just kept trying to no avail. I then loaded up a video, the video seemed to take much longer to load, and kept buffering. I thought this would be a step up from my Vizio smart TV streaming options, but doesn't seem like it at this point. I'm gonna try it out some more tomorrow, but if it doesn't start working and flawlessly I'll be sending it back for sure.", "verified": true, "helpfulness": "1/1", "author": "Daniel Jennings"}, {"rating": 1.0, "review": "I just love being hoodwinked into buying the stick, based on my experiences with my Kindle; only to wait LONGER for the videos to come up. A unique pleasure for which I need not have paid money. Rip off of the first caliber.", "verified": true, "helpfulness": "0/2", "author": "S. W. V. Cott \"Broadway Baby\""}, {"rating": 5.0, "review": "Love it! Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "amy e drewel"}, {"rating": 2.0, "review": "It does a lot of buffeting. Which causes movies to start and stop continues.", "verified": true, "helpfulness": "0/0", "author": "Charlotte Johnson"}, {"rating": 5.0, "review": "Love this! Easy to install and works great on my bedroom TV. Paid only $27 and its well worth it. Packaged nicely as well.", "verified": true, "helpfulness": "0/0", "author": "allaire a lagrone"}, {"rating": 5.0, "review": "Traded my wife this for the laptop. She absolutely loves it! Streams better than the laptop for whatever reason.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this because as a prime member it was discounted. It sat around for a week or so before i used it, but when i did i was suprised of the options included with the fire stick. Easy to use, and transfer from tv to tv in other rooms. It has a lot of room for growth but the apps included justify the purchase price. I have chrome cast, apple tv, and the fire stick. The Fire stick is by far my favorite. The remote included is solid and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Joshua M. Morgeson"}, {"rating": 4.0, "review": "It's a great product I recommend it to friends", "verified": true, "helpfulness": "0/0", "author": "Vanessa Jenkins"}, {"rating": 5.0, "review": "A must have for Amazon Prime. If you are sick of AppleTV, Chromecast, or anything else that you can't view prime videos on, then get this! I just got mine and love it. I'm on the verge of saying it is better than AppleTV.  Amazon just needs to add HBOgo and it would be amazing.", "verified": true, "helpfulness": "0/0", "author": "Lauren D."}, {"rating": 5.0, "review": "Makes Netflix seem silly.", "verified": true, "helpfulness": "0/0", "author": "DJ"}]