[{"rating": 5.0, "review": "Great little stick!  Worked perfectly right out of the box", "verified": true, "helpfulness": "0/0", "author": "Mario R. Espana \"Mario E.\""}, {"rating": 5.0, "review": "Seems to be great so far!", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 5.0, "review": "Great.  Can watch whatever without having to change a thing.", "verified": true, "helpfulness": "0/0", "author": "Patty T"}, {"rating": 4.0, "review": "It fulfilled my expectations and now I'm enjoying my Prime fully. Not five stars because it was really hard to connect to my TV and it would not accept the USB power from my cable box, I had to use the adapter to plug it into the wall socket.", "verified": true, "helpfulness": "0/0", "author": "J. Bauza"}, {"rating": 4.0, "review": "I think it is better than the chrome stick much more versatile and more options .great little product.", "verified": true, "helpfulness": "0/0", "author": "Kathy Johnson"}, {"rating": 4.0, "review": "Four stars cuz there's no on/off button.  Just get it.  Works great, really good user interface, can be controlled with any smart device, although no need since it's remote works well.  Can't be the price, and works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Richard Beato \"Firefighter Rich\""}, {"rating": 3.0, "review": "runs slow.  Some apps have to be removed and reinstalled to work correctly. No  shows/news comes with the stick, must have prime, but is it worth the money to invest in prime when the basic apps have problems, is what you must ask yourself. It reads better then it is.", "verified": true, "helpfulness": "0/0", "author": "D. leonard"}, {"rating": 5.0, "review": "Perfect device and I highly recommend it.My wife and I were planning on canceling our dish network subscription and substituting it with fire TV and use only ( Amazon prime, Netflix and Hulu), (I'm saying were because we moved abroad). Before moving from the U.S. I had three devices  chrome cast , fire TV and Apple TV. Here is a comparison between them, I hope it helps those who still wondering which decide they should get: Chrome Cast: First of all i don't know how people compare it to fire TV and Apple TV; these are completely different devices. Chrome cast is merely a device that allows you to stream from other devices to your tv. Fire tv and Apple TV are totally different story. Both devices have pre-installed apps(Netflix, Hulu etc) on them, so you won't need to stream from other devices (laptop, tablet, or smartphone). This could be annoying from a practical point of view. For example: if you are planning on streaming from your laptop to your TV, when the laptop is not home, no one else will be able to use chrome cast unless they too have other device to stream from. Basically you download a plugin to your browser, when watching a video, you click on the icon of the plug in on the top right of your browser and the video will stream on your TV.Apple TV and Fire TV: (my comparison will be based on the ability of each device to perform solely with no other devices involved.)Both have the two main video stream services; Netflix and Hulu among tens of other cool apps such as history channel and ESPN (you can see all the apps on www.apple.com/appletv andAmazon.com/firetvExtra cool stuff:1- Apple TV allows you to watch movies/videos from your computer as long as they are in the itunes library (limited to MP4 format). This option is not available on Fire. To play a video from your computer on your TV via Apple TV, it's a pain in the neck if this video format is not supported by iTunes. In such a case you'd either have to convert the video format to iTunes applicable format ( mp4) or play the video on another application that would allow you (most if not all of them are paid).2-Apple TV allows you to watch your pictures/videos from your iCloud on your TV. Fire lets you see you pictures/videos storaged in the Amazon cloud only. So it depends on which app you use; iCloud or Amazon prime storage (iPhone users their pictures and videos are stored on iCloud by default).3- Fire TV has prime instant video, which is not available on Apple TV.  I personally love Amazon prime, so this is a huge plus.4- Music: it depends on how you listen to your music. If you are a pandora fan, (or any of it's equivalent other radio streaming apps) then Fire TV is your choice. Apple TV has only music from iTunes. You can either listen to the music that you already purchased from iTunes or purchase new music. You can also listen to music from other devices such as your laptop, tablet or iPod. Finally, if you are prime member, so you are already an Amazon music prime member which is a good source of music but of course not as good as iTunes.5- Apple TV allows you to mirror your laptops/phone/iPad screen to the TV screen. Fire TV doesn't let you do that.6- games: only on fire TV. Some of them you can play with the remote and others you will need to buy a controller.7- Apps choice: with Apple TV you have no choice with the apps you download, every other while you will receive an update with new apps. This is not the case with fire TV, which has what's similar to apps market where you can choose which apps you want to download.Conclusion: choosing which device to purchase depends in my opinion on two main factors: which apps you will be using especially when it comes to video streaming; Netflix and Hulu Plus only versus Netflix, Hulu plus and Amazon prime. Secondly: how much integration you are expecting with your other devices (laptops, smartphone and tablets).-If you are a prime member: Amazon fire is your choice, unless you want to play it from other device and mirror it to your screen.-if you are a dictated apple fan, your music, your videos, your pictures all are from/on Apple devices, then Apple TV is your choice. You.Good luck and if you have any questions let me know and I'll answer them.", "verified": true, "helpfulness": "1/1", "author": "mohamed Elian"}, {"rating": 5.0, "review": "My husband and I love our kindle fire tv stick!! We have watched more tv in the last two months than we did in the last two years! Right now we are enjoying Grimm seasons 1,2, and 3 and we cant wait for season 4 to come to prime. At Christmas we were able to watch holiday movies that we had no idea existed .......so very nice!!We are avid Prime users and we love it........thanks Amazon we appreciate all the ways you make our lives better!If things keep up the way they have been going we will need to purchase a new flat screen as we are going to burn out this set!Thanks again !", "verified": true, "helpfulness": "0/0", "author": "GamingLady \"LadyLovesToRead\""}, {"rating": 5.0, "review": "this was  the best xmas present ever.  my sister loves it and can now watch tv in her room. SO easy to install that us tech idiots got it done in 5 minutes flat.  would reccomend.", "verified": true, "helpfulness": "0/0", "author": "Marie"}]