[{"rating": 5.0, "review": "Does much more than I thought. Love the Sling option and the various apps.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "I LOVE THIS THING!! I canceled my cable and I can not get enough. Comcast wasn't happy, but I am. There are so many tv shows and movies of every genre, I am discovering new shows/movies everyday. I am even able to watch old shows from my childhood. I highly recommend that you try the stick. You will NOT regret it. If you have cable or satellite, you will never want it again after trying the Fire TV Stick. I PROMISE!! :)", "verified": true, "helpfulness": "0/0", "author": "Sweets"}, {"rating": 2.0, "review": "I've had it a week.  I love the ESPN channels on Sling TV which is why I got it.  It has locked up on me a few times so you need to refresh the picture and it fixes it.  The first night we had it, we got an error message and the screen went black at the end of a basketball game.  Had to watch the rest on my Sling TV iPad app.  I don't have Prime, may consider the trial.  Disappointed that there aren't very many free titles and hard to find mixed in with everything else.", "verified": true, "helpfulness": "0/0", "author": "Chuck Baldwin"}, {"rating": 2.0, "review": "It was easy to use, but I was surprised that thereare so few prime member shows..most are for a price.", "verified": true, "helpfulness": "0/0", "author": "Wiley Thomas"}, {"rating": 3.0, "review": "I enjoy the quality over other streaming devices, but with that said I live in a rural state that only has charter for their cable needs and Amazon fire stick does not sync my cable with the downloadable apps. So for that I only give it 3 stars. If you have other cable providers or if you are using it just for Amazon prime it is a good deal, but I'm my case I should have just gotten another Roku 3.", "verified": true, "helpfulness": "0/1", "author": "Joshua Sutter"}, {"rating": 5.0, "review": "Worked great...easy to set up.....love it", "verified": true, "helpfulness": "0/0", "author": "Sue Humes"}, {"rating": 5.0, "review": "Best purchase ever.", "verified": true, "helpfulness": "0/0", "author": "Woof586"}, {"rating": 2.0, "review": "Had to return this. While we have a fairly modern AV setup with an HDMI connection for the Fire device, we could not access it from the televisions menus and Amazon support was no help. In the future I'll go check out a set up with someone who has one before buying something like this.", "verified": true, "helpfulness": "0/1", "author": "CASEY'S BUD"}, {"rating": 4.0, "review": "Works good. It has locked up on me couple of times but I'm pretty sure it was because my internet connection was having issues at the time. Does seem to stream rather well. I do get 5.1 out to my Home Theater system. I was told that I probably wouldn't.", "verified": true, "helpfulness": "0/0", "author": "Sundance"}, {"rating": 5.0, "review": "I'm very pleased with my Fire TV Stick.  It has lots of apps available along with the Amazon Prime selections.  It was pre-setup when it arrived so all I had to do was enter my Amazon password and it was ready to go.  You can also download an app for your phone or tablet to use as a controller if you don't want to use the one that it comes with.", "verified": true, "helpfulness": "0/0", "author": "Jason Bachelor"}]