[{"rating": 4.0, "review": "It's fun and I like the portability but it has limitations. For example, the YouTube app doesn't allow streaming of live events. But it's easy for the kids to navigate and the price was right for what it offers.", "verified": true, "helpfulness": "0/0", "author": "Stephanie \"edenza\""}, {"rating": 1.0, "review": "Not happy with this. It is making the sound on my TV sound like chipmunks. Can't even use it. Very upset. It also is disconnecting my internet connection whenever I try to use it. Will probably just buy a TV that has Netflix and Amazon Prime Instant video.", "verified": true, "helpfulness": "5/6", "author": "andrea"}, {"rating": 5.0, "review": "I won't go through each of the technical details like everyone else has.  We happen to love it! Simple, easy to use - makes a great gift! Low profile and small, but simple remote.  Have your own Amazon library right at your fingertips! Love it more than the Roku!", "verified": true, "helpfulness": "0/0", "author": "Sl Judge \"gatormomz\""}, {"rating": 5.0, "review": "Love it so far, seems just as good as my Fire TV's just cheaper and I don't mind leaving it in my patio TV. XBMC on my patio, I'm very happy!", "verified": true, "helpfulness": "0/0", "author": "MxChris"}, {"rating": 1.0, "review": "Piece of s*** won't let you skip the intro video. I threw it on the ground.", "verified": true, "helpfulness": "3/5", "author": "ziddey"}, {"rating": 5.0, "review": "Works great. Easy setup.  I plugged into into the HDMI input of my receiver.  Have streamed Amazon, Netflix & YouTube, with very nice picture.", "verified": true, "helpfulness": "0/0", "author": "Tim Trippel"}, {"rating": 4.0, "review": "Works well, seems to be fast, good picture.  It would be nice if there were more apps that worked with Fire TV", "verified": true, "helpfulness": "0/0", "author": "L. Haas"}, {"rating": 4.0, "review": "Mobile remote app doesn't see the fire stick on the network. Else, i would have given 5 *s", "verified": true, "helpfulness": "0/0", "author": "gamerkong"}, {"rating": 5.0, "review": "As an owner of both an AppleTV and a Roku, I don't know why I bought the Fire TV Stick other than it was $20 for Prime customers. But I'm actually very happy that I did. It's a really solid little device, gives easy access to Prime videos and works incredibly well with the Amazon ecosystem. It's a great low cost streaming device, easy to use menus, and very intuitive. I have mine running through a 5 port HDMI switch with no noticeable issues.", "verified": true, "helpfulness": "0/0", "author": "Jared Matfess"}, {"rating": 2.0, "review": "Does not access my Prime acct.  Ordered two for our home and no Prime videos appear as free. I am a prime member.  Maybe it just needs some time.  Also, Prime movies cannot compete with Netflix.", "verified": true, "helpfulness": "2/4", "author": "MommyHuggin"}]