[{"rating": 3.0, "review": "I love the device itself but there is one major drawback.  My TV at home is not a \"smart TV\" therefore I have no way to access my Prime videos etc. except through my phone or my Kindle.  I thought that the Fire Stick would be the ideal solution for my dilemma.  It was, for home.  The problem is when I travel.  I work out of town a lot for my business and I again thought that bringing my Fire Stick with me on these business trips (and on vacations) would allow me to access my Prime videos and movies.  Well, it doesn't.  Whenever I try to connect to a hotels WiFi connection, they seem to always need a password that they provide or at the very least want you to accept their terms and conditions to allow access.  There is no way to do this with this device as you need to open up a web browser to do those things.  Therefore, my Fire Stick is rendered useless.  This is very disappointing as this was one of the main reasons that I wanted this device in the first place.  Long story short, I can only use this at home and no where else right now.  I hope Amazon is aware of this issue and comes up with a solution that will allow access to my stuff while traveling.  If I were able to do this I would have given this a 10 star rating.", "verified": true, "helpfulness": "1/1", "author": "MB JNKY"}, {"rating": 3.0, "review": "The Fire stick was easy to install. There are tons of movies and TV shows to watch, but you have to be very careful. Not all of them are included with the Prime membership and not really clear on if it is or not. Very small area where you can see if it is included.Otherwise, I haven't used it too much because most of the TV shows you have to pay extra for.", "verified": true, "helpfulness": "1/1", "author": "Cheryl Waltz"}, {"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Tim W."}, {"rating": 3.0, "review": "Video content is fine , but unable to mirror to tv.", "verified": true, "helpfulness": "1/1", "author": "Russell Gremillot"}, {"rating": 5.0, "review": "This is AWESOME!!! I did lots of research before buying it and it was well worth the price!!! l can view lots of movie apps, play screen savers on my tv, play games, it does it all! Does much more than my blu ray player could do, and much more then the google chrome device which is close in price. best price when compared when compared with similar products. I love that I can just plug it in my tv (no chords) and can use the remote (no laptop or tablet needed).The amazon cloud drive is comparable to apple cloud drive- can purchase movies and videos to view anywhere you can log into your account. I purchased my favorite exercise videos on amazon, goodbye dvds. I was thrilled when I got it for the $20 special price, wish I had bought more!", "verified": true, "helpfulness": "0/0", "author": "Virginia"}, {"rating": 5.0, "review": "Easy to setup, prime content is great, outside apps are a bonus. Well worth it.", "verified": true, "helpfulness": "0/0", "author": "Vince P."}, {"rating": 4.0, "review": "We received this as an anniversary gift.  One of the best gifts ever.  One thing I wish was easier to do is to add outside apps but other than that we are loving the portability.", "verified": true, "helpfulness": "0/0", "author": "DNM"}, {"rating": 5.0, "review": "Very easy to set up and use. Love this product.", "verified": true, "helpfulness": "0/0", "author": "Judy Morgan"}, {"rating": 5.0, "review": "Love it! Easy to use at a great price.  Does exactly what I needed it to do- stream Netflix and content on prime.", "verified": true, "helpfulness": "0/0", "author": "J. DiPietro"}, {"rating": 5.0, "review": "I got the fire stick as a gift from my sister. Originally she bought me the google chromecast.  I spent 6 hours that day trying to get the chromecast to work and dealing with the worst customer service I have encountered.So when i plugged in the fire stick i was weary... I it turned on, it connected to my internet, and was working in under a minute.If you are debating between google and amazon, go with amazon 100%. Its the easiest thing in the world. Google requires you to change settings on your router to work. ..but you don't need to with the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Natalie K Stratton"}]