[{"rating": 3.0, "review": "Started out great but recently has been EXTREMELY slow and the video is choppy. Internet on all my other devices is lightning fast. Not sure what's wrong.", "verified": true, "helpfulness": "1/1", "author": "Jon"}, {"rating": 5.0, "review": "The best streaming stick for the money! Does everything you want and more.", "verified": true, "helpfulness": "0/0", "author": "Zachary Tithof"}, {"rating": 3.0, "review": "had it for 2 weeks still having problems with this wifi works but keep saying no network availabe", "verified": true, "helpfulness": "0/0", "author": "William W."}, {"rating": 5.0, "review": "Love it.  It works great.  Lots of available apps.", "verified": true, "helpfulness": "0/0", "author": "bandguy54 \"bandguy54\""}, {"rating": 1.0, "review": "Did not think movies would cost as much. Think I'll stick with red box", "verified": true, "helpfulness": "0/1", "author": "kim merkel jr"}, {"rating": 5.0, "review": "Love my fire stick wish I would have gotten two for that special price that I had.", "verified": true, "helpfulness": "0/0", "author": "Debra Williamson"}, {"rating": 3.0, "review": "I am still having problems with the amazon fire stick. This is the second one sent to me after the first one didn't work well.I believe it gets too hot, so now I have taken to unplugging it from cord and TV and letting it cool down totally before trying to use it again. Often it pauses and you get that annoying circle thing (loading!).  Can't seem to watch it 2 days in a row without those problems. Glad I paid only $19.99 for it as a promotion instead of $39.99. On the plus side I like the offerings that are free, but I hesitate to purchase a netflix subscription until the stick works 100% of the time.", "verified": true, "helpfulness": "1/1", "author": "julie g. cooper \"highland lass\""}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Chris Simmons"}, {"rating": 4.0, "review": "I really like the Amazon stick,it's very easy to use. It offers many movies and tv shows. It arrived early and packed very well.", "verified": true, "helpfulness": "0/0", "author": "Randee Osgood \"book queen\""}, {"rating": 4.0, "review": "Still test driving, but,. liking what I see so far.", "verified": true, "helpfulness": "0/0", "author": "Christopher Smith"}]