[{"rating": 5.0, "review": "Absolutely love the Fire Stick!!!", "verified": true, "helpfulness": "0/0", "author": "Shawn M Ballor"}, {"rating": 5.0, "review": "Works great, wish i had gotten on sooner", "verified": true, "helpfulness": "0/0", "author": "Judy Ann Premo \"Winter\""}, {"rating": 3.0, "review": "It's OK. Cancelled my Netflix account before signing up for Prime. Prime video app for Android doesn't work well. To many Amazon apps to access before you can play video. The \"free instant\"  video selection is small, mostly B grade or older movies. Only Amazon content on firestorm or added cost for additional content (Hulu. Etc). Doesn't want to play files from phone  like Chromecast. It's OK. Don't give up cable, dish or Netflix for it though.", "verified": true, "helpfulness": "1/1", "author": "Vince Taylor"}, {"rating": 4.0, "review": "Had to update my speak on my wifi. Took a few tries with the cable company before info could start watching  without it stopping.", "verified": true, "helpfulness": "0/0", "author": "Enid Pinto"}, {"rating": 1.0, "review": "PROs:Great UINice remoteCONs:After 6 months it stopped connecting to wifi. Even if it is within 5 feet of the router with a direct line of site, it still won't connect. I tried resetting my modem, router, and even tried factory resetting my Fire Stick, but nothing fixed the problem.A quick google search revealed that my experience is fairly commonplace.https://www.amazon.com/forum/kindle?_encoding=UTF8&cdForum;=Fx1D7SY3BVSESG&cdThread;=Tx2CDOG0K31UBSB", "verified": true, "helpfulness": "0/1", "author": "Adam"}, {"rating": 1.0, "review": "I want one but they are out.  RUDE!", "verified": false, "helpfulness": "5/10", "author": "Gregory W."}, {"rating": 5.0, "review": "The Fire Stick allowed me to have a smart TV without having to deal with the crappy user interface of a smart TV. I love the ability to customize the interface to my desires. It is compact, sleek and lighting quick with plenty of storage for all my apps and games. A great product for the price point.", "verified": true, "helpfulness": "0/0", "author": "Cleric1stClass"}, {"rating": 2.0, "review": "So, I've got to say, I had high hopes and was rather disappointed in this device.  I've used it on vacation for almost two weeks and in a nutshell, if you're streaming content from Amazon, it's fantastic.  If you want to use it to stream from any place else (Netflix, Hulu, HBO GO, etc.) forget about it.  The Amazon video is perfect and smooth.  All other content is slow to load, choppy to play, and can be downright frustrating.  I own a Roku Box and and Apple TV and thought this would be a fun little portable device for traveling.  Don't waste your time - I wish I'd skipped this and just brought my Roku.", "verified": true, "helpfulness": "0/0", "author": "Matthew I. Halpern"}, {"rating": 4.0, "review": "Remotes are cheap and quit working or the buttons get stuck after little usage. Teh stick itself is great. I prefer it over the roku. The roku does have a better remote though. I wish they would set up bt audio though the stick.", "verified": true, "helpfulness": "0/0", "author": "American"}, {"rating": 1.0, "review": "Prime day sucks!", "verified": false, "helpfulness": "5/8", "author": "Naco"}]