[{"rating": 5.0, "review": "Love my Fire TV stick.  Works great...so far.  Only issue is that it was made in China!!  So disheartening and sad that they put profit in front of having it made in the USA.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I  GOT MY AMAZON FIRE STICK YESTERDAY, VERY EASY SET UP LESS THAN 5 MINUTES. GREAT PRODUCT. I AM A GAMER SO I WISH IT HAD MORE OF THE GAMES ON THE FIRE STICK THAT ARE IN THE AMAZON APP STORE, LIKE ANGRY BIRDS ETC. OH WELL MAYBE WHEN IT UPDATES IT ADD SOME BETTER  GAMES", "verified": true, "helpfulness": "0/0", "author": "JOYCE M."}, {"rating": 3.0, "review": "I like it but it could have more apps.", "verified": true, "helpfulness": "0/0", "author": "Virginia Andreozzi"}, {"rating": 5.0, "review": "So far, so great.  Pop it into the hdmi port on the tv, run through the set up and that's it.", "verified": true, "helpfulness": "0/0", "author": "LSGold"}, {"rating": 3.0, "review": "Once I got through the initial installation on my tv, I was pleased with the Fire TV Stick.  It kept searching for my remote and I had to unhook it a couple of times before it took.  My tv doesn't have a USB port, but the included cable worked with my HDMI port.  The remote is very nice, although difficult to open to get the batteries inside.  I had to search for a Youtube video to get directions for something that should have been easy.  It took a flathead screwdriver to pop it open.  I like being able to scan through the choices available and like that I can pick back up where I left off if I can't watch an entire show.", "verified": true, "helpfulness": "0/0", "author": "Heidi N."}, {"rating": 3.0, "review": "It's is great when it works but it loses connection in the middle of a movie.  Nothing else in our house loses connection, we can watch Netflix and Prime on our wii or laptop with no issues.", "verified": true, "helpfulness": "1/1", "author": "LuAnn Eitner"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "Martin Gair"}, {"rating": 5.0, "review": "It's small, portable and perfect!", "verified": true, "helpfulness": "0/0", "author": "Randolph"}, {"rating": 5.0, "review": "Great love it", "verified": true, "helpfulness": "0/0", "author": "Lawrence James"}, {"rating": 2.0, "review": "It started quickly, but the video I was watching was paused frequently. I was only able to watch one video when the network connection failed.  I will try again with the \"pigtail\" plug .  Since I watch at bedtime the first go was frustrating so I unhooked and returned to cable viewing until I have the patience to fiddle with it.  I was hoping for the easy access Apple TV provides.  At this time disappointing.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Kitson"}]