[{"rating": 5.0, "review": "I love it!Very easy to install", "verified": true, "helpfulness": "0/0", "author": "David Ramos"}, {"rating": 3.0, "review": "Be careful with the screen saver.  It eats up bandwidth even when you aren't using it.  No way to reduce the resolution to save bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"RT\""}, {"rating": 3.0, "review": "I am an Amazon fan and am loyal to Amazon even with it's warts.  In this case I am a bit disappointed with content and features.  For example I can't cast or mirror my Kindle Fire because it's an older version, that stinks, Amazon should make that available.  I also cannot get a simple internet browser app to work/load on Fire TV nor can I side-load an app even when following all the instructions for developers.  So my main goal was to mirror or cast my cable provider live TV broadcast wirelessly  from my Kindle Fire to the Fire TV and it's a no go so far.  Maybe there is a solution out there, I'll keep looking.  I will probably get a Chromecast stick which has a Browser and see it that works.", "verified": true, "helpfulness": "0/0", "author": "Edju"}, {"rating": 4.0, "review": "Excelent but many services are restricted in my country", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Awesome invention!", "verified": true, "helpfulness": "0/0", "author": "Nadia Sherif"}, {"rating": 5.0, "review": "My kids pove these!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Better than Apple TV. Being a Prime member, I have access to a lot of free stuff. Very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Robert A DiPenice"}, {"rating": 5.0, "review": "The Fire stick worked better then expected.  I used the 30 day free trial of Amazon Prime and it worked beautifully. I am extremely pleased.", "verified": true, "helpfulness": "0/0", "author": "Dennis E. Makowski"}, {"rating": 5.0, "review": "This is the best Streaming stick on the market hands down! It has an easy to use interface, a simple control, and it's perfect if you're an Amazon Prime subscriber! The only negative thing about this stick is that it's not customizable. Besides that it is very simple yet perfect. I recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "Manuel Castillo"}, {"rating": 5.0, "review": "Works perfect very happy", "verified": true, "helpfulness": "0/0", "author": "JOSE GARCES"}]