[{"rating": 4.0, "review": "I bought a fire tv stick a couple weeks ago.and i really love it:) it was really easy to plug into the back of my tv and it took a very short time to set up, after i signed into my account it seemed like minutes later i was able to watch movies and tv shows and play fun games like crossy road which is like old time frogger but more fun:) and it has an excellent picture: )It may not have the same Facebook app that roku has but it has an app that for i think just a dollar it gives notifications on the tv screen from Facebook and also shows texts messages from your phone on the screen too:)", "verified": true, "helpfulness": "0/0", "author": "Stephen leidy \"electronics addict\""}, {"rating": 5.0, "review": "Bought it for cottage tv in maine.  The price was right and it's perfect to catch up on my movies on a rainy day in maine.  Hopefully their won't  be  too many of them", "verified": true, "helpfulness": "1/1", "author": "Robert Pinkham"}, {"rating": 3.0, "review": "It's okay.  I would like a better selection of movies you did not have to pay for.", "verified": true, "helpfulness": "0/1", "author": "Robert Chartier"}, {"rating": 3.0, "review": "Good: Price, Size, Convenient, Video Quality, Amazon Prime, HDMI Commands (I.e. Turn on TV)Bad: Glitches, Lags, Display Artifacts, and did I mention a heaping ton of Ads?!Comments: Terrific for the price. I was delighted by the Amazon-Sling deal a few months back so I thought I'd give it a try. After 3 months, I've had a good, solid run with the Fire Stick, and come to the conclusion that I like the Apple TV better. In comparison to the AppleTV, there appears to be a bit of stuttering, lag, and overall glitching this with the Fire TV stick.Personal preferences aside, there does tend to be a lot more advertising that I'm comfortable with.", "verified": true, "helpfulness": "1/1", "author": "JuanGuapo"}, {"rating": 1.0, "review": "The commercial is horrible and irritating, that is the only reason why i am writing this review, it is also the reason why i do not want to purchase this devise.", "verified": false, "helpfulness": "0/5", "author": "Benjamin Moore"}, {"rating": 5.0, "review": "Best investment I ever made", "verified": true, "helpfulness": "0/0", "author": "Michael Rivas"}, {"rating": 5.0, "review": "Best Streaming device on the market, I bought 2, works great for on the road travel.  The only thing I wish was that it could do Bluetooth Audio like the Fire TV.  Amazon fix this and the device will be complete.  Sideload ready out of the box.  I am sold on most Amazon products, they put good parts in the gear...", "verified": true, "helpfulness": "1/1", "author": "jletse"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "1/1", "author": "Barry M. Ortlieb"}, {"rating": 5.0, "review": "loved it so much I stopped the cable and bought 2 more for in the house. now I get a message that I can't watch mine if my daughter is watching hers downstairs. If you are only going to get one it is fantastic and is everything it promised. Easy to set up.", "verified": true, "helpfulness": "2/2", "author": "Linda Sexton \"wendywins1\""}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/1", "author": "Tara"}]