[{"rating": 2.0, "review": "Very disappointed in the stick, have constant buffering when we use Netflix!", "verified": true, "helpfulness": "0/0", "author": "Erin V"}, {"rating": 3.0, "review": "I bought this hoping I can replace the Chromecast and add the ability to watch Amazon Prime videos too, but whatever the Stick's connection is - it seems weird. I have never had any lags or freezes on any ChromeCast videos (Netflix or Hulu), but the Stick keep freezing and being slow, when playing Netflix or Hulu. On the same network! So I'm actually a bit disappointed...", "verified": true, "helpfulness": "0/0", "author": "Pearl"}, {"rating": 5.0, "review": "Amazon Fire TV Stick is a good device to get if you are an Amazon Prime member. It lets you fully utilize all the programs available on Prime and any movies you purchased on Amazon. You can get Hulu and Netflix as apps if you belong to these services so that is worth it too. I have a Roku Purple Box (not HD) I bought last year new and I paid the same amount  ($39.00), but Roku is not making any more of these boxes right now so Fire TV Stick is a good cheap device for streaming.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 4.0, "review": "The fire stick works pretty seamlessly. We are fairly happy with what movies are available with prime although more choices of included movies what be great.", "verified": true, "helpfulness": "0/0", "author": "marguarett London"}, {"rating": 3.0, "review": "Pretty neat, has a lot of channels, from travel channels, cooking channels, pbs channels,news channels,YouTube, these are all fee.free channels! So you don't have to worry about paying for everything! Of course it offers fee based  Netflix, hulu,amazon,Pandora! And then there's a whole bunch of other stuff that I don't watch nor have the time or the interest for!", "verified": true, "helpfulness": "0/0", "author": "anne parmaktiar"}, {"rating": 5.0, "review": "it's fantastic!", "verified": true, "helpfulness": "0/0", "author": "CHRISTOPHER CITAR"}, {"rating": 4.0, "review": "picks up wifi better than the roku stick did a little confusing to use", "verified": true, "helpfulness": "0/0", "author": "bruce johannesen"}, {"rating": 1.0, "review": "not what i thought it might be. Was hoping it could be used on a computor", "verified": true, "helpfulness": "0/1", "author": "Bill Gard"}, {"rating": 5.0, "review": "Got the firestick a few weeks ago since my wife has a Prime account and it's a good deal. No technical glitches and lots of programming available in an easy interface. And it's portable. Go for it.", "verified": false, "helpfulness": "0/0", "author": "John Covell"}, {"rating": 5.0, "review": "I wanted something simple to set up and simple to use and I got it! Works great to enjoy Amazon Prime and Netflix", "verified": true, "helpfulness": "0/0", "author": "Diane Greiber"}]