[{"rating": 1.0, "review": "I just bought this to replace my ROKU and was a big mistake... it keeps on disconnecting, network error, failed to verify, etc.  Had the roku for 2 years and never got any of these errors... garbage, I would return it but I got it for 19 dollars so I'll throw it in the garbage!  I have switched back .", "verified": true, "helpfulness": "2/4", "author": "Slamon Shahnawaz"}, {"rating": 1.0, "review": "It does not work. It hooked up with issues but finally did. Now I can see the movies and my watchlist but it will NOT begin streaming.", "verified": true, "helpfulness": "0/2", "author": "N. Moore"}, {"rating": 5.0, "review": "Easy setup and if you've the bandwidth a good streaming experience with Amazon music.  Great playlists.", "verified": true, "helpfulness": "0/0", "author": "TCPMo"}, {"rating": 3.0, "review": "It meets everything I expected I like it very much", "verified": true, "helpfulness": "0/1", "author": "Anthony Santos"}, {"rating": 1.0, "review": "I received my Fire Stick and was very pleased with the ease of installation.  For the first day, it worked just great.  Loved it - told my family and friends all about it.  Second day, no video.  I get the blue screen indicating \"HDCP unauthorized.  Content disabled.\" Spent about an hour and a half trying to fix it with tech support on the line.  Tried all kinds of things, nothing worked.  Amazon is sending a new one.  However, I checked this error on the internet and found that this error is occurring quite a bit with Fire Sticks - there are many frustrated customers commenting about it.  Surprisingly, although this error has been noted on the internet for a couple of months, tech support knew nothing about it.  Absolutely loved it while it worked, but am now very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Cynthia Villa"}, {"rating": 2.0, "review": "I find the home screen much too cluttered and not user friendly.  Search feature (when typing in a movie or actor name) is glitchy and I often end up with 3 of the same letters when I only want one; I then have to waste too much time deleting and retyping.  I wish the remote had a \"back 30 seconds\" feature.  I'm willing to give it more time, but so far, in my playing around with it, I can say I expected more of the Amazon Fire stick.  I much prefer my Roku 3. Also, the sound drops out for a second or two a few times during everything I've watched so far.  This doesn't happen with Roku or Apple TV?  I will update my review in a month or so after I've spent more time with it.", "verified": true, "helpfulness": "0/1", "author": "Nutmegger"}, {"rating": 5.0, "review": "Very useful, I paid 20 dollars when it was on preorder and it was worth every penny. It is almost the exact same as the fire TV but 80$ less. The only difference I've noticed as an owner of both is speed. The fire TV is faster and has a better remote but that's it. If I were to recommend one or the other I would recommend the stick", "verified": true, "helpfulness": "0/0", "author": "Matthew Ray"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Steven D. Baxter \"SDB\""}, {"rating": 5.0, "review": "We love it and we've just begun exploring it!", "verified": true, "helpfulness": "0/0", "author": "Patricia J. Hale"}, {"rating": 5.0, "review": "Works greatso far", "verified": true, "helpfulness": "0/0", "author": "george romero"}]