[{"rating": 5.0, "review": "Awesome! Love it! So easy to install. So much too watch.", "verified": true, "helpfulness": "0/0", "author": "M. Frazier"}, {"rating": 5.0, "review": "Amazing Product!  its excellent in every aspect. Super Fast! everything open less than a second.", "verified": true, "helpfulness": "0/0", "author": "Babak"}, {"rating": 5.0, "review": "Pros:  1) Low Cost  2) Easy to use with either remote or with more fully-featured smartphone/tablet application.  3) Fast loading video over the Internet with little lag or flutter seen with some \"smart\" TV  4) With 5 GB, the Stick is upgradable and allows Fire apps to be installed for non-Amazon channels.Cons:  Very little.  Would be nice to have voice search via smartphone app, skip ahead on smartphone app (i.e. skip to specific time of video) etc.", "verified": true, "helpfulness": "0/0", "author": "Savvy Scott"}, {"rating": 5.0, "review": "Yes! No buffering.  Had probs. with Apple tv buffering, fire stick fixed that.  Btw it's not just a stick, for peak performance, you need to plug it in with the wire that is included.", "verified": false, "helpfulness": "0/0", "author": "tigress"}, {"rating": 5.0, "review": "Super easy setup. With Amazon prime every thing is so easy to order an amazing variet of movies and TV programs. Would recommend this to anyone", "verified": true, "helpfulness": "0/0", "author": "kdhuff"}, {"rating": 5.0, "review": "LOVE IT!!!!! Super easy to get started and going in no time!", "verified": true, "helpfulness": "0/0", "author": "Meghan Detty"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "andy choy"}, {"rating": 5.0, "review": "great - just as expected - thank you!", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "I have the fire stick and chromecast. Both are good quality for stuff like YouTube, Hulu, etc., but I love the fire stick for the amazon prime usage. The remote is nice as well. Play, pause, power on TV for the remote is great. Overall great product for prime and good for the other apps that it supports. Bias note, prime is the only subscription service that I have.", "verified": true, "helpfulness": "1/1", "author": "Thomas J. Robideau"}, {"rating": 4.0, "review": "Decent little stick that provides basic content. I use it mostly for the netflix and plex aspect of it not being an Amazon prime member. The only thing that would be better is if you could mirror a phone that's not a fire phone cause honestly how many people own those.", "verified": true, "helpfulness": "0/0", "author": "Koop"}]