[{"rating": 5.0, "review": "Works great. Entered my Amazon prime password and my Netflix password and was watching a movie in minutes.", "verified": true, "helpfulness": "0/0", "author": "Randy Waldrop"}, {"rating": 4.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Allison Bender"}, {"rating": 5.0, "review": "First: It Worked!  It was easy other than a somewhat clunky screen for logging on to a network.  After getting it connected, it just took off and was easy to use and delivered as hoped-for.  I use it a bit at home, but it will be a great travel accessory for the nights in hotels with nothing to do.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Gray"}, {"rating": 1.0, "review": "down as much as it works", "verified": true, "helpfulness": "0/0", "author": "Robert Hardy"}, {"rating": 5.0, "review": "Although it's a little buggy and it has its small problems, it's made my house superHappy, unable to afford cable, we have this and Sling APP and everyone gets what they want .. It its perfect but for sure worth the money", "verified": true, "helpfulness": "1/1", "author": "Michael A Delao"}, {"rating": 5.0, "review": "So far, so good. Only set it up a few days ago, but the setup was easy, the response and picture are very good, and so far it's behaving itself quite nicely.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great alternative to cable TV. Much more affordable too!", "verified": true, "helpfulness": "0/1", "author": "bethany blackwood"}, {"rating": 5.0, "review": "Love it this is great, came quickly and ready to plug right in and start watching. Wish i had gotten it sooner", "verified": true, "helpfulness": "0/1", "author": "lysavita"}, {"rating": 5.0, "review": "Awesome product! Very easy to set up and it has a ton of available apps and games. I'd suggest this over any other streaming device on the market, especially considering its price point.  If you were able to pick it up during Prime Day (one of the very few good deals available...) at an even deeper discount, then it was an even better value!", "verified": true, "helpfulness": "0/1", "author": "Enzo Rufini \"dskfjdsk\""}, {"rating": 5.0, "review": "Awesome and easy to use", "verified": true, "helpfulness": "0/1", "author": "calore"}]