[{"rating": 2.0, "review": "Well I wouldnt know because i have been up since the big event started and one minute it would tell me available for wait list but could never get on it... Im pretty upset about t5his as well.", "verified": false, "helpfulness": "4/13", "author": "marnie griffin"}, {"rating": 1.0, "review": "The prime day sales selection was unimpressive and the only thing I actually wanted I get put on some wait list that served no purpose but to get my hopes up and torture me all day. This was a total disappointment. Up until this point I loved Amazon but now I don't know if I'll renew when my subscription is up...", "verified": false, "helpfulness": "7/14", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Still learning but so far I am loving it and so are my grandkids", "verified": true, "helpfulness": "0/0", "author": "pat"}, {"rating": 3.0, "review": "Yo what the fudge ya better make this an exclusive for all amazon prime members i had other important stuff in life to attend to but i still managed to check in so andale iya iya ya better restock and re add this for 25$", "verified": false, "helpfulness": "3/7", "author": "Sergio"}, {"rating": 4.0, "review": "kinda confusing. :(", "verified": true, "helpfulness": "0/0", "author": "adriana wilmot"}, {"rating": 5.0, "review": "Love my firestick!  User friendly.  I have recommended one to my aunt and daughter who have both purchased one and also love it.  Great product at a great price!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was the perfect option for our TV in our living room where the family watches netflix. We used to have to hook up someone's in the family's laptop to watch it, but this solved that inconvenience. Have had it for 6 months now and never had an issue. WELL worth the low price!", "verified": true, "helpfulness": "0/0", "author": "Alison Hughes"}, {"rating": 4.0, "review": "Good product. Sometimes operates a bit slow due to the wifi connection, but overall, a good product.", "verified": true, "helpfulness": "0/0", "author": "William Schry"}, {"rating": 5.0, "review": "Very easy to use and love it ..", "verified": true, "helpfulness": "0/0", "author": "collette mclain"}, {"rating": 5.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "DoesItMatter"}]