[{"rating": 5.0, "review": "This product is terrific.  We love the original programming and also the App lets you do voice searched which is great.The only problem is that I thought I ordered two but only one came.  Something must have gone wrong with my order submission.  I would still like another one for my beach house.", "verified": true, "helpfulness": "1/1", "author": "tom c woodruff"}, {"rating": 4.0, "review": "this was a surprise for me when hdmicec worked fully on my Sony kdl520r model, I had to enable it in TV.... huge convenience.....not at all work like chromecast, dial protocol is not supportedw8 desktop chrome browser can't share screen like chromecastI use chromecast for total streaming using dial protocol, appletv and Xbox for usual streaming, xbmc for local movies and videosnow if windows miracast support started working that would be awesome....", "verified": true, "helpfulness": "0/2", "author": "Prakash Heda \"Prakash\""}, {"rating": 1.0, "review": "Same results with two different fire TV sticks:1) if it is a stick why does it require power? With the TV mounted on the wall there is not extra power available. Poor planning2) I attached it to my HDMI switch and after 6 minutes it over heats and the sound skips and the screen is filled with multi color static.If you have power make it a box. If you don't need power use a stick. For now my Roku is far superior.", "verified": true, "helpfulness": "2/10", "author": "Steve Reasner"}, {"rating": 1.0, "review": "Good interface .. easy to use .. WiFi connection doesnt work even when close to router ..giving it back", "verified": true, "helpfulness": "3/8", "author": "Anu"}, {"rating": 4.0, "review": "The packaging was really nice. Plex works well. I wish I could create a shortcut to browse Anime, and sub genres within Anime, but at least a search will show me stuff to browse through. I think if I could add such a thing, it would be a 5 star product. I also hope crunchyroll adds support soon.I pre-ordered mine at a steal of a price and now that I've tried it, I sort of regret not buying the second one I could have at half price.", "verified": true, "helpfulness": "0/0", "author": "NBMTX"}, {"rating": 2.0, "review": "This device has potential, but it would be nice to able to see the \"free\" Prime videos that Amazon has without wading through all of them. Maybe it's just my internet, but the videos are constantly buffering, and they don't play through like on my Apple TV. For now, I think I will stick to my Apple TV. I love that thing. If Apple had the Prime Instant Video it would be unstoppable. Since I have both, I would highly look into an Apple TV if you are going to be a cord cutter. Hopefully, Amazon updates the UI in the future to be able to go straight to the free videos.", "verified": true, "helpfulness": "0/0", "author": "Ryan Lee"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Shawn"}, {"rating": 4.0, "review": "Looking at the specs I'm sure these will be a perfect gift for my parents who watch Netflix and want to do it without hooking up a PC to their TV. I can't believe Best Buy is selling these for less than Amazon and they are in stock!", "verified": false, "helpfulness": "2/4", "author": "Jeremiah P"}, {"rating": 5.0, "review": "This thing is great! Only thing I didn't like was the process of setting up the netflix app being that there were no directions on doing so. Other than that, loved how I got it for the price of $19.99 bc of being a prime member so Im really happy about that😁. I have the chromecast and the Apple tv. All are good in there own little ways but for the price of $19.99, Im most pleased with the fire stick!", "verified": true, "helpfulness": "0/0", "author": "Huey Le"}, {"rating": 5.0, "review": "Fire TV Stick Arrived just in time for Thanksgiving family get together.  Super easy to instal and connect to my wifi network.  Lots of free content from Amazon because I am a prime member.  However in the games, the FreeCell sucks, does not allow some moves.  But I did not get the Fire TV Stick for FreeCell and the rest works intuitively.  Glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Ralph Wheeler"}]