[{"rating": 1.0, "review": "Bought early, did not even work. Spent hours on phone with 3 reps who said customers had similar problems and I should return it. Plugged into TV with no signal. Was told I can return it at my pre-order discount price and buy again when its available in future at full price! Don't waste your time, use Amazon to buy things but not if they make it, go with Google Chromecast - its simple and works.", "verified": true, "helpfulness": "1/1", "author": "A. Humad"}, {"rating": 5.0, "review": "Works flawlessly for our needs.  Beats the built in app on the TV hands down in terms of ease of use.", "verified": true, "helpfulness": "0/0", "author": "Big Al"}, {"rating": 5.0, "review": "Love it Love it ---- truly a  plug and play device", "verified": true, "helpfulness": "0/0", "author": "Susan Adelle"}, {"rating": 2.0, "review": "I purchases the Fire TV Stick for my father in law to watch Netflix, Hulu and Prime videos. I currently have two Roku 3's and my family love's them. So naturally I thought my father in law would love one too. After doing some research I decided that the Fire TV Stick would be a great choice for him.I decided to setup the device before giving it to him for Christmas knowing that he is technologically challenged and to familiarize myself in it's operation being that I'm the \"tech support\" of my family and chances are that if he has any issue he would call me.I had no issue plugging in the devise and is pretty straight forward.My BIG issue is that it would not connect to my home network after trying to type in the very long 63 character WPA2 password many times I was very disappointed that it was giving me this much trouble. I can imagine that most people would be pulling their hair out and even consider returning the product at this point. I decided to temporary disable the network password authentication (leaving an open network) and connect it that way in the hopes that a firmware update would be available to fix this issue.  Thankfully it worked and I was able to get a network connection.My SECOND issue is that even though it said it was checking for updates on the screen immediately after getting a network connection it appeared that it had not found any. Being surprised and extremely disappointed again I decided to go searching for a manual update check option in the settings in a last ditch effort.My THIRD issue is why does it force you to have an Amazon account before you can get access to the device settings? It does not make any sense to me!!! Why why why?My FOURTH issue is that the manual update check option does exist but is not where you would expect it to be. Instead I found it after clicking on \"about\" device instead of being it's own option under settings where I would expect it.My FIFTH issue is why is does it force you do a manual update before actually finding an update, download and install it. Why does the devise mislead you by saying that it is checking for updates and not finding any firmware update immediately after getting a network connection when clearly there is an update? WHY!!!!!Success!!! finally after letting it update and reboot and doing a factory reset (Only because I didn't want my own Amazon account associated with the Fire TV for my father in law) was I able to get it to connect to my home network using my very long 63 character WPA2 password.Issues like these should have been caught in testing prior to putting this device into the market, especially for a device that depends solely on wireless connection. But at the very least make a step by step troubleshooting guide easily available.", "verified": true, "helpfulness": "0/0", "author": "Ruby Olivas"}, {"rating": 5.0, "review": "Easy setup, quick response. We have a Roku as well, this is so much faster and we love the interface and menu's so easy to use our 4 year old can quickly find the show he wants to watch and can make it repeat. We haven't gotten to try out the games, we need to purchase the optional game controller.", "verified": true, "helpfulness": "0/0", "author": "Thomas Smith"}, {"rating": 5.0, "review": "Awesome!  Best Christmas Gift!  Also, Getting A Lot Of Mileage Out Of That Crazy Gary B. Commercial For FIRE STICK (As He Yells Out).", "verified": true, "helpfulness": "0/0", "author": "Kelli Shandera"}, {"rating": 4.0, "review": "The device is very easy to set up.  Just plug it into the first available HDMI port on your TV and plug the power supply cord into either the TV's USB port or a wall outlet if the USB does not provide enough power.If you are a Prime Member, it will come pre-registered and in 30 seconds or so (after the firmware updates) you will be able to access Amazon Instant Video, Music, and the photos you have uploaded on the Amazon Cloud.Fire TV does not offer anywhere the number of channels that the Roku does; hopefully, that will change in time.UPDATE:  This just would not smoothly stream MLB games (buffering and juddering picture) even after rebooting the router, clearing the Stick's application data and cache.  Amazon tech support tried to figure it out, but once they told me to perform a factory reset on it, I knew it had to go.  It has been replaced with a Roku unit which works without perfectly", "verified": true, "helpfulness": "0/0", "author": "orion1113"}, {"rating": 2.0, "review": "Cool device but it suffers from constant Wi-Fi signal drops and required password resets quite a few times. Would give it a higher ranking if not for the connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 4.0, "review": "This allows you to use Amazon Prime to watch movies on a TV that does not have internet. You do need a HDMI input on the TV to plug in the stick. I was surprised to see that it requires POWER. It comes with everything but you have to plug the power block in and then the cable to the stick, then plug the stick into the HDMI port on your TV. I thought it would have used power from the TV, not an external cord.Once installed its easy to select your WIFI and password, then account and its ready.It seems to work great.", "verified": true, "helpfulness": "0/0", "author": "Terry Schoenberger"}, {"rating": 2.0, "review": "I watch streaming video one floor below my Wi-Fi access point, and my Kindle had occasional connectivity problems, more than other devices I use. So I figured that the Fire TV Stick might be an improvement. Wrong. It was much much worse. It took an hour or so to get it to connect, and when it finally was connected, the connection was very slow. To make sure that I wasn't having an intermittent network problem, I tried connecting my Kindle and my cell phone -- both connected quickly and effectively. I tried the Fire Stick a few more times, but the problem persisted and I sent it back. I'll maybe try again after an upgrade is released, the Fire TV Stick II or Fire TV HDX Stick or whatever. The device comes very nicely packaged, and people who watch streaming video within a few feet of their Wi-Fi access point may not have the problems I experienced.", "verified": true, "helpfulness": "0/0", "author": "F. Langer"}]