[{"rating": 5.0, "review": "Excellent device. Easy to use. The remote makes it great. We use it for Netflix and it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "This is one nice simple little device that packs a major technological punch.  Easy to install and setup, and the best feature of all is that it can connect to 2.4Ghz or 5Ghz WiFi bands.  If your wireless routers support the 5Ghz band the device can access a huge pipe and you will always get 1080P and the highest quality sound available up to Dolby 7.1.  Most wonderful feature is that start-up is almost instantaneous, all I can say is WOW.I have had this device for 2 days and am very happy with its performance so far.  I would highly recommend it and  I am thinking of getting a few more for myself.", "verified": true, "helpfulness": "0/0", "author": "hooksett tech dude"}, {"rating": 5.0, "review": "I used to string and hdmi cable over to my laptop to stream from Amazon Prime and use my BluRay play for Netflix.  Now I use the Fire TV Stick for both and love it.  The setup was simple (unfortunately my TV cannot power the stick via its USB port, but I had an extra outlet behind the TV, so no wires are showing, which was the main concern).  Another review talked about having to unplug/replug the Fire Stick when switching back to it from another input source - I have not had that experience.  It always comes on for me (TV is a Samsung circa 2011).  As others have noted, it would've been nice for the default remote to have the voice search, but I'm glad I bought the voice-capable remote.  The voice recognition works well for me.  My phone/tablet isn't from Amazon, so I can't fling, making voice search that much more import.  Typing from any remote without a keyboard is a time-waster.I've had it for a few weeks now, no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Deb J"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Nathan Day"}, {"rating": 1.0, "review": "I was excited to get the Fire Stick, but after the first day, it just does not work.  It keeps losing the network connection even though the signal strength is very good, the network shows as \"connected\"  I continually receive  a \"network error\" message when we try to actually watch anything.  I am VERY disappointed.  I purchased this to try our on one tv with the intention to purchase several more for other tvs in our homes if it worked as expected.  Clearly I am going to need to look for another alternative.", "verified": true, "helpfulness": "0/0", "author": "Deborah B"}, {"rating": 5.0, "review": "Thank you for creating this.Sincerely,Everyone, Everywhere", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 2.0, "review": "I was disappointed in it.  I have an internet ready TV but HULU was always cutting out and freezing.  That is the main reason I bought the Fire Stick, and HULU still cuts out and freezes.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 5.0, "review": "Great so far. Love it", "verified": true, "helpfulness": "0/0", "author": "Doris Smith"}, {"rating": 5.0, "review": "Easy setup , performs great", "verified": true, "helpfulness": "0/0", "author": "MyPenName"}, {"rating": 4.0, "review": "Great.  Works great.  Wish it had Vudu.", "verified": true, "helpfulness": "0/0", "author": "McIntuff"}]