[{"rating": 5.0, "review": "Awesome little device. Does everything youd expect and more!", "verified": true, "helpfulness": "0/0", "author": "Nnadozie"}, {"rating": 5.0, "review": "Awesome product. Love that I can stream music, movies and other content with the remote. Way to go Amazon!", "verified": true, "helpfulness": "0/0", "author": "KB"}, {"rating": 1.0, "review": "Stopped working about a week after the 30-day return window. The best they can do is send me a replacement... Yeah I'll pass that puppy along to someone else that doesn't mind an inconsistent product and a company that doesn't stand behind its own brand.", "verified": true, "helpfulness": "0/1", "author": "A. M. Garman"}, {"rating": 5.0, "review": "Use the Fire TV Stick often.  It was a present and I have enjoyed many, many movies and more.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 4.0, "review": "I only wish it didn't need to be plugged in to an electrical outlet.  Now I have to take the TV off the wall so I can hide the power chord.", "verified": true, "helpfulness": "0/0", "author": "Dawn Crawford"}, {"rating": 5.0, "review": "LOVE this little gadget.  Works great, came already linked to my prime account, and the cheapest option I could find for all my streaming. Easy set up as well. All around great gadget.", "verified": true, "helpfulness": "1/1", "author": "Angie Gilmore"}, {"rating": 5.0, "review": "Easy to set up and use. The remote was a little difficult to open to put the batteries in. Set up the app on my iPhone so I can also use my phone as a voice controlled remote.", "verified": true, "helpfulness": "1/1", "author": "Xinneelie \"knitter\""}, {"rating": 1.0, "review": "Product worked fine for two weeks then product quit working.  The problem started by only downloading 25% of video then stopped.  This problem happened no matter what app I was using.  Finally, the apps quit loading all together.  My theory is the unit over heated because it is always on.  There is no off switch.  However, I am not an expert, so i could be wrong on why it quit working.If you buy this product you will risk product failure.  I had to send it back for a refund which Amazon did provide.", "verified": true, "helpfulness": "1/1", "author": "Danny Norwood"}, {"rating": 2.0, "review": "There is no web browser available with this product.  The apps do not include all the content on a site so the selection is limited.  It was easy to install.", "verified": true, "helpfulness": "0/0", "author": "DENISE L HENRETTA"}, {"rating": 5.0, "review": "Love it!!!!!  So easy to use.", "verified": true, "helpfulness": "0/0", "author": "Teresa Sherman"}]