[{"rating": 1.0, "review": "As of now my fire stick is only getting one star I love the idea. I have yet to watch anything. It took three days to connect to my wifi. Now every time I try to watch something it says there is a problem with my network. I have even tried connecting it via network sharing on my phone which I sat next to the stick. Still with no luck. I have no problem connecting my computer, kindle fire HDX or phone to my wifi while sitting directly in front of my tv. Any suggestions?", "verified": true, "helpfulness": "5/6", "author": "Samantha"}, {"rating": 3.0, "review": "How do I stop the stupid video already? Everytime I hit the back button it starts to restart the device, I can't get the stupid intro video to stop!!!. Such a waste of my time! I've let it run in the background and switch the TV to another channel.  So obnoxious. I want to use my device. I'm all excited that it's here. I don't want to have to wait through a stupid repetitive and slow video telling me the obvious.  I'm an electrical engineer.  I get it already.  Give the tech savvy people a way to make it STOP.", "verified": true, "helpfulness": "0/1", "author": "Amy"}, {"rating": 5.0, "review": "All I can is this thing is awesome. 20 minutes after installing the Fire Stick, I unplugged my Roku and Chromecast.  Set up was a breeze and connecting to all my existing accounts could not have been easier.  Everything I want and more are in one device now. The interface, the apps, and the speed of the Fire Stick blows the others away.  I love the menus; they are clean, organized, and very easy to navigate.  Everything loads so quickly, and I love that I can have Pandora playing while I browse the other apps and menu items.  I also love that as a Prime member I have access to tons of free amazon music. The sound and picture quality are amazing, and the remote picks up the stick from anywhere in the room without pointing it directly at the stick. And it's only going to get better with voice commands once the iOS app is released.  I can go on and on, but I want to get back to the Fire Stick.  If you're thinking about getting one, do it, you will be glad you did.", "verified": true, "helpfulness": "0/0", "author": "Ali Izadpanah"}, {"rating": 5.0, "review": "it's just very easy to install and what a great experience after!", "verified": true, "helpfulness": "0/0", "author": "Simon F."}, {"rating": 1.0, "review": "why I buy this? yes to watch my Netflix not your prime because every movie you have to pay. Explain please!!!why I have to buy those episode if I can watch it in regular tv.", "verified": true, "helpfulness": "1/2", "author": "elizabeth hansen"}, {"rating": 5.0, "review": "After using a roku, chrome cast, a smart dvd player and numerous other streaming options, the amazon fire stick is definitly my top choice.", "verified": true, "helpfulness": "0/0", "author": "Marc Kessman"}, {"rating": 5.0, "review": "I caught this on a limited sale and it is working great on my \"dumb\" flat panel.  Which now has Amazon, PBS and many other options.  I have wireless N and have had no delays or interrupts.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SalvationsJoy\""}, {"rating": 5.0, "review": "Haven't used my Chromecast since I installed the Fire TV stick. Great device and well thought out. Auto pauses when TV is turned off and goes into sleep mode while not in use. A couple very nice features. Beats everything else available in this form factor.", "verified": true, "helpfulness": "0/0", "author": "TheMaxwell"}, {"rating": 5.0, "review": "Great product - works exactly as advertised. Very quick and easy start up, great interface. Use for both Amazon Prime and Netflix streaming, each with a very stable connection (much better compared with a few other streaming options, including blue ray players and game console). Also very easy to move from TV to TV.", "verified": true, "helpfulness": "0/0", "author": "B. Barna"}, {"rating": 4.0, "review": "Love this, never used anything like this before and it worked exactly as stated in the directions.  Already connected to my Amazon account and I was off and watching whatever I wanted! Great gadget!", "verified": true, "helpfulness": "0/0", "author": "Terry"}]