[{"rating": 5.0, "review": "Better than Apple TV and easy to use!  Set it up in less than 10 minutes and was able to pair my iPhone as an additional remote.  If you have ipad or iphone, theres an Airplay app you can use to mirror to your TV.  Also a fairly large app store as well.  Worth $49 especially of you have Amazon prime account already!!", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 4.0, "review": "Received on time everything was as stated. Packaging was also good. Hooked it up at first had a few minor issues but after rebooting the tablet and the fire stick everything worked fine. Wi-Fi is a little slower than the RoKO I purchased before the stick but I can live with it.", "verified": true, "helpfulness": "0/0", "author": "James L."}, {"rating": 5.0, "review": "Very easy to use.  Definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Does exactly what is supposed to do! Save you money.", "verified": true, "helpfulness": "0/0", "author": "Apollo"}, {"rating": 2.0, "review": "I bought this during the $20 special last Christmas and because I am a Roku 3 user, I let it sit for several months.One of my kids had a little \"accident\" so I broke out the Fire TV Stick and plugged it in. Set up was easy enough.Over the next several days we watched our regular shows on the stick. The problem is that it would freeze or pause on a frequent enough basis to become annoying.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This product seems to work very well, so far I am very pleased with the quality and easy installation.  Enjoyed Amazon prime movies.  I will review further use in the future.", "verified": true, "helpfulness": "0/0", "author": "ernestina versailles"}, {"rating": 5.0, "review": "great - does the job", "verified": true, "helpfulness": "0/0", "author": "lawrence stone"}, {"rating": 5.0, "review": "I bought this Fire Stick during a pre-sale last November, however, I'm just now using it.  It blows my Roku out of the water. It's very speedy and easy to use.  I've had two Roku boxes, a Chromecast, and my new Samsung TV has built in apps.  This Fire stick works better than all of them.", "verified": true, "helpfulness": "0/0", "author": "Clark Roberts"}, {"rating": 5.0, "review": "Great product.  Easy to set up and use!!", "verified": true, "helpfulness": "0/1", "author": "Cats3814"}, {"rating": 5.0, "review": "Awesome. Love it. Really like the option of buying my favorite shows even new episodes the day after they air.", "verified": true, "helpfulness": "0/1", "author": "Steven A. Oliveira"}]