[{"rating": 5.0, "review": "I'm currently using the Apple TV as a replacement for cable or satellite TV.  I'm currently running the Apple TV through a Pioneer AV receiver and a Samsung 65\" LED TV.  I couldn't be happier with the Apple TV's picture quality.  The sound quality is also superior, but it is limited to a 5.1 output.Without cable, I'm using an off-air antenna to provide local channels and supplementing with Netflix and iTunes through the Apple TV.  I'm thinking about adding Hulu Plus as well.  I've used the built-in apps in my Samsung TV and a PS3 to stream Netflix before.  While I had good results using the PS3, I prefer to use the Apple TV.  The Apple TV also allows me to access iTunes, which is great for shows which are not on Netflix.  I'll gladly pay $40 for a season of a show that I want to watch vs paying $80+ every month to the cable company.When using iTunes, the picture is a full 1080p.  The streaming is very smooth and it takes almost no time to buffer.  My internet connection is through AT&T; U-Verse and is 18MBPS.I also subscribe to iTunes match, which allows me to play all of my music through the receiver which is hooked up to the Apple TV.  It also runs very smoothly and is fully controllable from my iPhone or iPad.  Additionally, I often stream Pandora from my iPhone via AirPlay through the Apple TV.  The Apple TV even displays the album cover art when listening to Pandora in this fashion.Overall, I'd say it's an excellent replacement for cable.  The setup was easy (HDMI cable hookup and the software walks you through getting it connected to your WiFi).Pros - Excellent quality picture and sound, full access to the Apple universe, streams/mirrors iPhone, iPod, and iPad, easy setup, great Netflix interface.Cons - Limited to 5.1 surround sound, can't download apps (as of yet).", "verified": false, "helpfulness": "1/1", "author": "A. Russo"}, {"rating": 3.0, "review": "The user interface is better than Roku (I have that also). I am VERY disappointed that Apple tv does not support Pandora.", "verified": false, "helpfulness": "2/3", "author": "Robert St Cyr"}, {"rating": 5.0, "review": "I love being able to \"mirror\" FaceTime calls from my ipad to my tv.  Great being able to see my grandkids on the big screen.", "verified": true, "helpfulness": "11/12", "author": "DJWEpt"}, {"rating": 4.0, "review": "We use this for so many things, watching Hulu, youtube, itunes, etc.  It is small and usable, but we hate typing into it.  I keep wondering if there is an app for the iPhone/ipad so you don't have to type using the small Apple tv remote.", "verified": true, "helpfulness": "0/0", "author": "Brooke Vertin"}, {"rating": 5.0, "review": "This apple tv is the best for streaming or purchasing items on ITunes. Netflix works very well also. small, affordible and exellent quality just like everything else from apple", "verified": true, "helpfulness": "0/0", "author": "Thomas W"}, {"rating": 2.0, "review": "Not easy for streaming videos.  Selections using remote are painfully basic. Jury is still out though, will give it more time to get used to before it gets tossed.", "verified": true, "helpfulness": "2/2", "author": "robert"}, {"rating": 5.0, "review": "Like all Apple Products...the best.  The only con I have is I wish it had more content for video shows.  Very easy to set up and use with great sound.", "verified": true, "helpfulness": "0/0", "author": "Steve Berger"}, {"rating": 5.0, "review": "Very Good  Very Good  excelent idea from apple, i love it with ipad and iphone is very beatiful product to use", "verified": true, "helpfulness": "0/0", "author": "Antonio lopez"}, {"rating": 3.0, "review": "Great product especially if you are apple lover and owner such as me. This will work great with apple products to easy stream thing to your tv fast.2 things that bug me at the moment but could be fixed.1. My apple tv makes a harsh, weird, and extremely annoying sound about every hour it still plays whatever is playing but with a incredible amount of distortion I cant seem to find whats wrong it does it on every app and evern when im streaming this makes me think its the box itself.2. Apple tv needs a app store just like the iphone app store the ipad app store and the mac app store come on apple why not?", "verified": true, "helpfulness": "2/3", "author": "Skyler LeGrande"}, {"rating": 4.0, "review": "I bought the Apple TV for my parents who love watching shows/movies on Netflix, but don't have a game consol/wifi capable dvd player that allow streaming.  Apple Tv is great for all them because it is so simple and what it does, it does great.The apps that work with Apple TV are great, my favorites are HBOGo and Netflix, but the ability to wirelessly stream any apple device to the TV is Apple TV's best function in my opinion.Now for a couple negatives. the apps on the device are great but there could be more. You have to purchase an HDMI cord or digital optical cords separately.A few little complaints aside, Apple TV is a great way to stream movies, shows, or music through your TV via apps or your own Apple devices.", "verified": true, "helpfulness": "1/1", "author": "Cooper"}]