[{"rating": 5.0, "review": "So simple. We plugged it in, set up the account info, and it has worked perfectly from day one. Love that I can even set the pictures in the screen saver to my favorites from my photo library.", "verified": true, "helpfulness": "0/0", "author": "We Like Mondays \"We Like Mondays\""}, {"rating": 1.0, "review": "This was a complete waste of money and I returned it after a week.  Unless you plan to buy a lot of movies from itunes, I do not see the point.  I tried it because I thought I could watch items from my iphone or ipad screen.  Turns out my favorite apps do not work with that feature.  Apps like HBO to GO and the FIOS app do not allow the media to be shown.  Even simple games and the internet lag and are useless.  Not sure why else you would want this thing but i surely didn't.", "verified": true, "helpfulness": "19/33", "author": "Jason I"}, {"rating": 5.0, "review": "I have a SmartTV, so adding Apple TV was a bit superfluous. Nevertheless, there are several features that made the purchase worthwhile for me.  To begin with, the whole family has a wide range of Apple devices, from iPod to iPhone to iPad, and the main feature I was interested in was Airplay.  Using Airplay, you can take whatever is on your screen and mirror it to the TV (this only works with the iPhone4S and later items, so the iPhone 4 and the iPod were left out).  You can also send the sound from your iOS device to your TV and from there to the surround sound system using Airplay.  Some games are designed for Airplay use as well.  Sky Gamblers is a good example of this.  You see the main view on the TV, and you have the secondary view, in this case your radar, on your phone.  There is a bit of lag from time to time, but you can get used to it.  Likewise, you can use Airplay to show photos and videos from your iOS device.  Unfortunately, in order to prevent “buffering” issues while playing back, Apple TV buffers much of the video beforehand, which means a long wait from when you press play to when you see video playing.Apple TV offers many other features, but I find that I rarely use them.  It is connected into iTunes, so your iTunes content is available to you, but other than that, I find most of the features are already present on my SmartTV.  For example, while Apple TV has Netflix, and a very nice interface at that, my TV has a Netflix button that has me in Netflix very quickly.  Other things like NHL Game Center are also available, but again, easier on my SmartTV.Apple TV is missing some things that you may expect from a SmartTV add-in box (like Roku).  There is no Pandora, Slacker, etc.  On the other hand, it can play anything from your iPhone, so you can just fire up Slacker from there instead.  Also, the remote is terrible.  Tiny, oversensitive, just not very good.  Fortunately, you can download the Remote app from the App Store (free) and control your Apple TV from your iOS device instead.  Another drawback, all it includes is the power cable.  You will need your own HDMI cable to attach it to your TV and you will need your own TOSLINK cable to connect it to your stereo (unless you use HDMI for that too).  Bad move on Apple’s part, since it won’t just work out of the box.  HDMI cables are cheap, and it would have been a good idea to include one, just to have people not have to go out to get one after they open the box and discover there isn’t one.Bottom line, Apple TV is great if you are already into the Apple Ecosystem.  If you have iPhones, pods, and pads, this is the gadget for you.  If you already have a SmartTV, then you already have most of the features here.  If you don’t have a SmartTV and are looking for an add-in to give you those functions, you may do better with a Roku or the like, but you won’t have the Apple functionality (Airplay and iTunes).", "verified": true, "helpfulness": "5/5", "author": "John Keitz"}, {"rating": 5.0, "review": "I was really tired of tethering my devices to the screens, and this has allowed us to just grab content from the computer.  Fast, works well over my wifi.", "verified": true, "helpfulness": "0/1", "author": "Paul Radeke"}, {"rating": 3.0, "review": "I purchased this product so that I could show content to my television without physically connecting them.  The streaming feature works only with designated content.  This content is not designated by me.  Instead on very limited items I can stream.  I wanted it to mirror my portable device.I was disappointed,David", "verified": false, "helpfulness": "2/2", "author": "I. Manni \"spinfrog\""}, {"rating": 5.0, "review": "Well, I finally made the leap and purchased an Apple TV unit. And I must say it was absolutely simple to hook up and sync to my iMac. It works like a dream. I absolutely love using Netflix on it.", "verified": true, "helpfulness": "1/1", "author": "John L Rumler"}, {"rating": 5.0, "review": "We use this as our family room sole entertainment box. It has all the apps that we need and services that we use so we can watching whatever we want from any source on this little box.", "verified": true, "helpfulness": "0/0", "author": "Robert Dunlap"}, {"rating": 5.0, "review": "Pretty awesome device, couple things I with I could do differently but Im still learning. Can't really go wrong buying an Apple product .", "verified": true, "helpfulness": "0/0", "author": "Joey G"}, {"rating": 5.0, "review": "This is a very high quality apple product that blows away the competition. The audio is high fidelity, the look is sleek and ultra-compact. The user menu is easy for a child to navigate and the hook-in to itunes is nothing short of brilliant. Highly recommend using this product. Make sure you have an HDMI cable and an open slot on your TV for using this.I love this setup so much that I'm buying a second one for my neighbor. When I told my neighbor, he was really excited.", "verified": true, "helpfulness": "0/0", "author": "JS"}, {"rating": 5.0, "review": "I no longer had my original Apple TV, and would NOT settle for anything less. Roku is cheesy, and half the product that the Apple TV is. I would buy one for every TV if I watched that much", "verified": true, "helpfulness": "0/2", "author": "Matt"}]