[{"rating": 5.0, "review": "I love my Apple TV. I became a cord-cutter this year and the Apple TV has allowed me to do that with ease. It is a fast device and it has most of the major apps and even some cool ones that most streaming devices don't have. We use it all the time for Netflix, Hulu, Watch ESPN, HBO Go, and FX Go (They also have a Showtime app but we haven't used that one). The biggest drawback as an Amazon Prime member is the lack of an Amazon Prime app.One of the best things about the Apple TV is AirPlay. I use it quite a bit to stream from my phone (especially from apps that aren't on the Apple TV). If you can get it on your iPhone, you can get it on your TV through AirPlay. You can also AirPlay almost anything from your iMac or iPad. If you're already in the Apple family, so to speak, this is the streaming device for you. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Josh Bledsoe"}, {"rating": 5.0, "review": "This product is awesome.", "verified": true, "helpfulness": "0/0", "author": "Dardo Paz"}, {"rating": 3.0, "review": "Is this A1469 - AppleTV3,2 model?", "verified": false, "helpfulness": "0/1", "author": "Shakir"}, {"rating": 5.0, "review": "Not my first and not my last.  My first one was purchased about 8 years ago and we are still using it.  I bought another for our tv in the barn.  I am an apple fan. I love being able to shoot my pictures on the screen and my guests love playing their playlist while visiting. Just be sure you don't have screenshots of your bank account in the photos because that will be displayed as well.", "verified": true, "helpfulness": "0/0", "author": "Gunnermccaw \"Gunnermccaw\""}, {"rating": 3.0, "review": "I'm not sure if I was just expecting so much because so many people had built it up but I'm a bit underwhelmed. (kind of like when people keep saying a movie is unbelievable and then you watch it and say, eh)First, the positives...AIRPLAY! WHOA! it's so true- this is fantastic for people who have adopted the apple ecosystem. I love being able to watch HD videos of my kids on my big screen tv. And the picture quality is fantastic. so just because of that, the purchase is worth it. My husband loves it even more than me. :o) While watching movies from Netflix or the disney channel, the quality is great. I'm happy with how well it streams, although we've hit a few snags, especially with airplay- I don't know if it is my internet connection or what. But in general, streaming TV shows and movies from netflix or the channels has been good.Now, the not so great stuff-I've been told that one of the biggest things about these streaming devices is that they may make cable service obsolete. Hey, you can watch all the shows on the major channels over the internet without having to pay for it, right? Well, not so much with apple TV (and probably other streaming devices? I don't know). But I do know that so far, I've had to put in my cable information for the channels I've tried (ABC, Disney, etc) which means I'm still pretty much dependent on my cable provider. Which is annoying- I wanted an easy solution to save money. And purchasing TV shows from iTunes wouldn't work either- where would the savings be?I love amazon prime and I can't get amazon prime on apple TV. I knew that going in though so that's fine. I did read that we can use airplay to watch amazon prime so I thought, eh let's still go with it. Well, let me reference the snags in airplay I mentioned before. There were a few moments of starts and stops, even when I was just watching videos of my kids. Sigh. And this happened while I was watching amazon prime.I pretty much hate the remote. My fingers aren't large and I find it difficult to push the arrow buttons without getting the center button. Hopefully, that will get better with time.Otherwise, I can't say that I'm upset with having bought apple TV because I'm totally an apple fan and it works so well with the devices we have (iphones, ipads). But I don't think it will be worth it for the general buyer who isn't entrenched in the apple ecosystem.edit: I just found an app called remote- this app allows me to control the apple TV through my phone or ipad and it's working out well! I haven't had trouble with connecting and I find that the functionality is fantastic. (it turns the iphone/ipad into sort of a trackpad. so if you're like me and you hate the remote, try the app!! It also makes it so that line of sight to the apple TV isn't necessary which is great!", "verified": true, "helpfulness": "1/1", "author": "Ordin"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "HENRY CARROW"}, {"rating": 5.0, "review": "Best device of its kinds. Netflix and Hulu Plus have replaced my cable provider. Full HD and easy to use. Only con: controller is a bit uncomfortable.", "verified": true, "helpfulness": "0/0", "author": "Francisco Lacayo Ocampo"}, {"rating": 1.0, "review": "Video goes in and out, has slow connection often despite very good and fast internet connection. UNRELIABLE.", "verified": true, "helpfulness": "0/1", "author": "Gonen"}, {"rating": 5.0, "review": "They loved it.", "verified": true, "helpfulness": "0/0", "author": "Christopher Edwards"}, {"rating": 5.0, "review": "I had a Roku player for three years now and for the last year it stopped working properly, turning off by itself and having issues with streaming Hulu and HBO.Once Apple TV arrived all the problems disappeared. Set up was easy and quick as with all Apple products, and streaming is flawless.Love the option to stream video from my phone or to mirror any of my devices on the tv without having to use any wires. iCloud sharing plus all the other Apple options are just great.I was pleasantly surprised with Smithsonian channel for free that I haven't had on my previous device.Apple TV looks sleek, remote seems to be working no matter in what direction you point it at which is great.Overall, why I haven't got this device before I don't know but I'm really happy I did.", "verified": true, "helpfulness": "0/0", "author": "Nikola"}]