[{"rating": 5.0, "review": "I don't have a smart TV so this is great for streaming all my favorite TV shows and music.  I love being able to show big screen slide shows for travels and grandkids.  Easy to use and a no-brainer to hook up.", "verified": true, "helpfulness": "0/0", "author": "Barbara L Dickinson"}, {"rating": 5.0, "review": "This was a gift for my son and his family. They love it! they use it every day great performance.", "verified": true, "helpfulness": "0/0", "author": "Biju"}, {"rating": 5.0, "review": "This is the 4th Apple Tv I have in my home and as the others it works perfectly. No complaints at all and it is easy to install and set up. I have run out of places for them now so unless I add on, this is the last one I will buy...LOL", "verified": true, "helpfulness": "1/1", "author": "TheWolfTc"}, {"rating": 5.0, "review": "This thing is slightly proprietary, in that it is very easy to use, not that easily customizable. There are cheaper products that do the same thing, but for system integration, this thing was a charm. It also helps if you can afford to subscribe to all the services that you can stream", "verified": true, "helpfulness": "0/1", "author": "Russell Stevens"}, {"rating": 5.0, "review": "I love my Apple TV.  I shut down my cable account to save money and purchased the Apple TV.  I have not regret it!  The device works as expected and no complaints.  I like being able to use my netflix account through it.", "verified": true, "helpfulness": "1/2", "author": "Amy Stromberg"}, {"rating": 5.0, "review": "Works wonderfully. Easy setup and very simple to use and navigate. I will get a few more for my home", "verified": true, "helpfulness": "0/0", "author": "Teresa Traylor"}, {"rating": 4.0, "review": "I really enjoy the Apple TV.  Kids love to watch netflix. I enjoy the air play feature. It's everything I expected.", "verified": true, "helpfulness": "0/1", "author": "Joe Bellecci"}, {"rating": 5.0, "review": "Love it!!!Have one already, in bedroom.  Our living room is Samsung Smart TV with internet connection and apps.  Still, it's not as user-friendly.  So we bought another one for the living room.", "verified": true, "helpfulness": "0/0", "author": "PKMAN"}, {"rating": 5.0, "review": "It is awsome, i use it for watching movies from my laptop on my tv. Also it's great for blasting music through your tv for parties, it's handy all year round. I only wish that I could jailbreak it. If you are someone who likes jail breaking and was looking forward to jail breaking their apple tv3 then throw that dream away. It's still a great product and it was pretty fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Kristen Benedetto"}, {"rating": 4.0, "review": "I would have given this product 5 stars if Apple allowed Apps to be installed. Very easy to set up. This is a sleek box that allows me to play movies, slide shows from my MacBook air, iphone, ipad or access my PC iTunes library on my Plasma TV.  I am glad I returned the overpriced Apple HDMI adapter for the Apple TV. Some reviewers complain that Amazon Prime is missing but I can use mirroring on My MacBook Air to watch Amazon Prime. In the bedroom I find myself listening to music on my TV just as much since it is just a click away.", "verified": true, "helpfulness": "0/0", "author": "Paul Joseph"}]