[{"rating": 3.0, "review": "First off, I absolutely hate Apple's possessiveness when it comes to EVERYTHING.  You buy a movie or a song through iTunes and you don't fully own it and can't do with it what you please.  However, buy the same item off of Amazon and it is yours - no strings attached.  You can share it with a friend or open it in another application.  No problem at all.That said, we immediately didn't like that the Apple TV does not have the ability to add \"apps\" like the Amazon app one for movies and rentals.  We'd much rather support their business model than be tied to Apple!  I get how this is in direct competition with iTunes / Apple but not having the choice is annoying when you'd rather own things you buy.  It's not a library book with strings attached!  If I bought the same DVD, book or CD at a store I could give it to a friend when I was done with it!  We also were disappointed in the lack of a Pandora app.  Sure, I could use Airplay from my iPad or iPhone but to have to change the setting every time on that device and not be able to create Pandora stations from the TV or thumb up/down songs from there was too many steps.I generally don't like homesharing because my base PC NEVER stays on (and why would it?  It's a waste of power...) and it was impossible to set up multiple accounts on the Apple TV (through two PCs).  I read somewhere that Apple makes it look like it is doable to set up more than one but never fully implemented it.  Then I tried to get BOTH of our iDevices set up to act as remotes.  I got one easily enough but could never get the second one working.  These are things that should be simple and Apple makes you THINK you can do them... but wow...  maybe not without a heck of a lot of research and tweaking!Sure, the photostream is cool and the interface slick and I'll miss those things but are they worth it?  Are we getting our money's worth?  Most importantly, can we easily do the things that we want to without having to spend hours googling to see if what we want to do is even doable?  The answer, for us at least, is NO.  So after two months with this thing, and still too many questions and frustration, we are returning it and getting a Roku 3 instead.", "verified": false, "helpfulness": "0/1", "author": "Morgan Luce"}, {"rating": 5.0, "review": "The best small device...Most important thing is airplay...works perfectly and very useful if we have all the apple devices. waiting for split screen features coming this fall...", "verified": true, "helpfulness": "0/0", "author": "Srini"}, {"rating": 5.0, "review": "This little box do a lost for me in the army... It's easy to hook up and work good in Germany...", "verified": true, "helpfulness": "0/0", "author": "Randolph Williams"}, {"rating": 5.0, "review": "IT WAS EASY TO INSTALL. AND TO GET UP RUNNING.  ONCE A PERSON SEES IT I FEEL THEY WILL WANT TO BUY ONE", "verified": true, "helpfulness": "0/0", "author": "Eugene C. Riley, Jr"}, {"rating": 3.0, "review": "No Netflix access in Africa, disappointing. Otherwise, it works well for the other capabilities provided herein, AirPlay feature works wonders. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Humphrey Muturi"}, {"rating": 5.0, "review": "I used to watch movies, and other media on my iPad, but now I effortlessly stream them onto my TV. Content is endless, and movies stream in high definition,even on my non-high def TV. The Apple TV box is really small, and the remote is even smaller, so make sure you remember where you put it down, or it is likely to disappear. Searching content with the remote can be tedious, but no worries; the remote app for the iPad, makes it easy.", "verified": true, "helpfulness": "1/1", "author": "J. Keller"}, {"rating": 5.0, "review": "I like it. sixteen fifteen fourteen thirteen twelve eleven ten nine eight seven six five four three two one zero", "verified": true, "helpfulness": "0/3", "author": "Noah"}, {"rating": 2.0, "review": "It doesn't have a web browser that's the most annoying thing and I could not install any apps using the app store. The watchespn app doesn't work for me as I am not subscribed to the listed ISPs. It was very easy to install but it takes lot of time to write something using the remote. Overall dissapointing had to return it..", "verified": true, "helpfulness": "1/5", "author": "Abhijeet Shirgurkar"}, {"rating": 5.0, "review": "Absolutely love this Apple TV. very convenience for using Airplay with my iPad or notebook. user friendly, great cool product!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have had the Apple TV for about three months now. The Apple TV frequently stops working with netflixs for days at time, there is no pandora, no way to add apps, listening to music from your icloud costs an additional $25 a year. Simply put the only reason to buy this is because it has the apple name brand on it. Apple is getting lazy and relying on their name instead of their products. GO WITH ROKU.", "verified": false, "helpfulness": "1/5", "author": "Matt"}]