[{"rating": 5.0, "review": "Is good", "verified": true, "helpfulness": "0/1", "author": "fahad alharbi"}, {"rating": 5.0, "review": "Loved Apple TV so much I had to buy another. Bought this for the kids room and now the skies the limit! They watch everything now. They love it!", "verified": true, "helpfulness": "0/1", "author": "Juan"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/1", "author": "flamingochic"}, {"rating": 5.0, "review": "Great price, free shipping and works like a charm. Tons of included apps to watch a plethora of shows. Keep in mind, you'll need a TV subscription to access most of the content (HBOGO, Showtime, ESPN) or a Netflix/Hulu account to access that content. The only thing it is missing is the Amazon app which is available on my DVD player. Between the two, I have everything I need for entertainment.", "verified": true, "helpfulness": "0/0", "author": "BoozeDaily"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/1", "author": "felipe rueda"}, {"rating": 5.0, "review": "We gave up cable a long time ago and haven't missed it with this. With all the app options now, you can practically watch anything. We love airplay and connecting to our surround sound while listening to music around the house. This worked right out of the box for us, just plugged it in and it worked. We have one on each TV in our house now that the price has dropped!", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "Looooove it", "verified": true, "helpfulness": "0/1", "author": "Lourdes"}, {"rating": 4.0, "review": "good product but the price needs to go down more.", "verified": true, "helpfulness": "0/1", "author": "conan"}, {"rating": 3.0, "review": "Save yourself some time and get a Chromecast. I gave this bulky piece of trash away 3 months into owning it. It was just a hassle. Ironically in the words of Apple, Google Chromecast \"just works\"", "verified": true, "helpfulness": "0/2", "author": "Voltron"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/1", "author": "persephone"}]