[{"rating": 1.0, "review": "The Watch ESPN App constantly freezes or kicks me back out to the ESPN menu while trying to watch a game. I constantly get messages such as; \"An error occurred while retrieving the required files.\" across the various apps. The AirPlay on my iPhone very rarely works and when it does it plays what I am trying to view for about four seconds before it crashes as well.I have tried restarting the device and logging out and logging back in to the various apps and that did not resolve the issues. I am not happy with this product and regret this purchase.", "verified": true, "helpfulness": "2/2", "author": "Dustin"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "1/1", "author": "kelly mead"}, {"rating": 5.0, "review": "Just bought this one for the bedroom. I already have one in the living room. I import all my DVDs into iTunes using Cinemoble, then I Can watch them on the TV. works great, Don't even own a DVD player any more..", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Easy setup and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Dave Knapp"}, {"rating": 4.0, "review": "I enjoy my apple tv. I hope they will add more apps, though.  You can mirror your screen for the vudu app if you have an iphone 4s or later. flixster will not  play on airplay mode. I can play amazon instant video through airplay. Other than the flixster glitch, I think it's great.", "verified": true, "helpfulness": "0/0", "author": "lisa \"whodunitbandit\""}, {"rating": 5.0, "review": "Best buy !", "verified": true, "helpfulness": "0/0", "author": "Angelica Radman"}, {"rating": 5.0, "review": "I honestly can't believe how much better this device is compared to the streaming built into the Wii, Tivo premiere, and the WD Live TV.  (Yes, I\"m embarrassed to say this is my fourth streaming device.)Pros: It's literally plug and play and requires minimal setup beyond putting your credentials into the channels. The interface is lightning fast. Let me repeat. Lightning fast. There is no lag at all scrolling between channels, browsing Hulu, Netflix, HBO, etc. It actually makes streaming seem easy. Mirroring from my iPad and Mac laptop was easy to configure and works great. I was able to happily watch Amazon free Prime videos on my iPad that mirrored with no lag to the Apple TV.  I did have trouble mirroring from the Xfinity Go App on the iPad, but I suspect that might actually be an Xfinity/Comcast issue.Cons: If Comcast is your cable provider, you'll need to jump through some hoops to activate some of the channels like A&E;, History, FYI, and Lifetime. This is because Comcast considers the Apple TV a competitor and they deliberately make it difficult for customers. One of the forums will walk you through activating them and I had no issues following it. Even though it's Comcast' fault, this is annoying and Apple really should do something about it. The Apple TV also only supports the lame m4p format, so if you have avi and mkv movies, you'll have to mirror them from your laptop or iPad. Or use an additional device like the WD Live TV which supports all imaginable formats (but has an interface as slow as molasses).", "verified": true, "helpfulness": "0/0", "author": "Curious Yellow"}, {"rating": 5.0, "review": "I gave this to my daughter for Christmas so that she and her two little ones can watch the Amazon Prime offerings and so that she and her husband can catch up on Homeland (if they ever get a chance to watch anything). My daughter absolutely LOVES this gift. She set it up herself and said that it was really easy. I feel great that I have finally been able to give my daughter a gift that she truly likes.Apple TV will convert your \"regular\" TV into a smart TV. If you already have a smart TV, I think that you probably don't need and shouldn't buy Apple TV. But if your TV is not \"smart\", Apple TV is great.", "verified": true, "helpfulness": "0/0", "author": "abthc"}, {"rating": 5.0, "review": "Love, Love, LOVE my Apple TV. Have one for each TV in the house!", "verified": true, "helpfulness": "0/0", "author": "CB"}, {"rating": 5.0, "review": "Lots of aps and the only way I can get what I have on my iPad onto the T V.", "verified": true, "helpfulness": "0/0", "author": "Van Payne"}]