[{"rating": 4.0, "review": "Apple TV is cool and this purchase works well and is what I expected.", "verified": true, "helpfulness": "0/0", "author": "Kevin Bieth"}, {"rating": 5.0, "review": "Perfect", "verified": false, "helpfulness": "0/2", "author": "Glauco Holanda"}, {"rating": 2.0, "review": "It doesn't work with Netflix....locks up, freezes, loses the netflix connection, one or all of the above. If you like Netflix don't buy this product.", "verified": false, "helpfulness": "1/4", "author": "Gene Dassing"}, {"rating": 2.0, "review": "too slow and not enough channel options.", "verified": true, "helpfulness": "1/2", "author": "...... \"Nestorf94\""}, {"rating": 5.0, "review": "works great as expected", "verified": true, "helpfulness": "0/1", "author": "Debbie Kidd"}, {"rating": 2.0, "review": "Cons: No pandora. No amazon prime. No vudu.Pros: looks good. Simple to get up and running.I've been using roku forever. Got this for the wife to easily throw up the ipad screen onto the tv.I find that Apple is trying to do too much with this. I don't have a choice as to where I listen to my music - pandora or where I watch my movies - amazon and vudu. They'd like me to do everything on iTunes. If that's you then this is for you.We are now using this as an expensive way to mirror our ipad to the tv.Roku even has a YouTube app which is what we'd originally needed to mirror to the tv. And the small memory stick form factor is perfect - less wires in the living room.", "verified": true, "helpfulness": "4/5", "author": "Ro"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/2", "author": "Hamood ALHAMOOD"}, {"rating": 5.0, "review": "Better than the cheapies!", "verified": false, "helpfulness": "0/1", "author": "Steve  Godofsky \"Steve Godofsky - Author of \"The Liberation of Henry Belmont\", \"Quesionable Therapy\", \"Mind Reader\"\""}, {"rating": 2.0, "review": "There is an annoying bug: in mirror mode, sometimes the sound playback of the latest MacOS X will just not work with these Apple TV and besides restarting the whole Mac sub-system nothing helps.100$ for a wireless HDMI connection to my TV is too much if it does not work flawlessly.Other shortcomings:- no volume control- no line audio output- way too big for what is does & no way to hang it on a wall or hide beneath the TV.- no good on Linux, Android or Windows- crappy included apps and no 3rd party app supportGood parts:+ very small lag, even when mirroring animation in 720p+ works with iOS and MacOS", "verified": false, "helpfulness": "1/3", "author": "Sandu Lungu"}, {"rating": 5.0, "review": "Best buy I could do. Excellent product from apple. The product arrived in perfect condition and spotless.", "verified": true, "helpfulness": "0/1", "author": "Julian Cely"}]