[{"rating": 2.0, "review": "As compared to the Roku 3, I feel that the Apple TV is inferior for two main reasons:1. Pandora: Roku has it, AppleTV does not. I'm a big fan of Pandora, so not being able to access it on the AppleTV is a pain.2. Amazon Instant Video: Same deal - Roku has it, AppleTV does not. And if you have prime, you want access to Instant Video.And, since these boxes are all about easy access to content, the lack of these hugely popular content providers is a really big issue for me. Plus, the benefits of the AppleTV over the Roku (airplay, access to your iTunes library) aren't that important to me. If they are to you, then your decision may be tougher.I say go with the Roku.**UPDATE**I have subtracted another star because I am encountering a very serious problem with my AppleTV now: whenever I try to buy a movie from iTunes, it takes HOURS (literally) of buffering before I can start watching.I have searched online and many people have this same issue, and nobody seems to have a solution. One website suggested switching to SD video quality, but even that hasn't helped. Why can I stream movies from Netflix or Amazon immediately, but it takes hours for an iTunes movie to buffer? It makes no sense. This obviously is yet another reason to buy a Roku instead. (In fact, last time I tried to rent from iTunes, it said it was going to take 1.5 hours before I could watch. I went downstairs and tried to rent from Amazon on the Roku LT, and I was watching it in less than 5 minutes.) Dumb. I'm selling my AppleTV and getting a second Roku!", "verified": true, "helpfulness": "17/19", "author": "mofo83"}, {"rating": 1.0, "review": "I ordered a Refurbished Apple TV shipped from Pro Sell, but I received a unit that was clearly USED, not Refurbished, as noted by the following:- return address on packaging was from a person, not a business;- a hand written note on a scrap of paper was in the box saying, \"When updating a software TV turn off. After this TV do not connect to wifi\" [sic];- when connected to my television, the unit was already configured in a language using the Cyrillic alphabet and was not in a state such as a Refurbished unit would have been; and,- the Aluminum Apple Remote which is supposed to be included with any New or Refurbished Apple TV was absent.", "verified": true, "helpfulness": "1/10", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really enjoy this device.  I should note that my family has many other apple devices that work with Apple TV, and as many other reviews have stated your experience with apple TV is likely to be more enjoyable if you already have a macbook, iphone, ipad, etc…What do I use apple TV for?  Personally, I use Apple TV for watching TV, Movies, and for airplay (mirror what’s on my iphone or ipad right onto the tv).  However, the device offers far more options that I have not yet taken advantage of.How do I watch TV and Movies?  Well there are mainy ways to do so with Apple TV.  Here are the ways that I’ve tried and enjoyed:1) HBO GO channel:  If you subscribe to HBO already, this is a fantastic way to watch HBO content.  This is one of my favorite uses of Apple TV and probably worth the cost of the device in and of itself (for me).2) Netflix Instant:  Another great channel and you can set it up so there’s a designated area for kids or adults.  We have it set up so the kids have one channel with only acceptable content.  We use this a lot.3) Airplay: I sometimes use this to mirror what’s on my iphone or ipad right onto the tv.  Great for pictures or videos I may want to show family members.  That’s mainly how I use this feature, but you could do more with it (like watch movies or shows).4) Other Channels:  Youtube, Disney, and a few others I use on occasion.5) Itunes:  I rarely rent or purchase shows or movies from itunes, but easy to do from Apple TV.  Plus it’s easy to access old content you may have purchased.Other Information:Set-up:  I thought the set-up was easy. Opened up the package, connected device, and it turned on.  It took a few minutes to log-in and link to my wi-fi, but pretty straight forward.Remote:  Small and simple to use.Apple TV Device:  Very small and looks exactly like the picture.Cords:  Comes with HDMI connector.Picture:  I’ve had no issues.  Everything seems to work just fine for me, but I imagine this could be a factor if I had a very slow network at home (glad I don’t).  Something to keep in mind though.Automatic System Updates:  This is a plus since there are periodic updates (adding channels or features).  Like other apple devices this runs smooth.I’ll update this review as I try more features, but overall I haven’t noticed anything that’s made me regret purchasing this.  Based on my 5 star review I would recommend buying.", "verified": false, "helpfulness": "1/1", "author": "Patriots Fan"}, {"rating": 5.0, "review": "I love the little remote that comes with this.  An apt for iPad installs a keyboard for the remote, making it easier to use.", "verified": true, "helpfulness": "0/0", "author": "Kuke"}, {"rating": 5.0, "review": "Requisite Warning; I am NOT an Apple fanboy. I own several of their products. I own many windows products too. I build my own servers and workstation. I love iOS and can't stand OSX.Simply put, this device is easy, fast and intuitive. I have one of these connected to both my TVs, rather than buying a smart TV I would happily get one of these.Pros;Ability to easily and quickly play Netflix, Hulu Plus etc...Easily and quickly plays any content you've ever bought from itunesCan easily stream anything in your library over wireless. (This works very well for TV shows you happen to put into your itunes library but didn't buy from itunes per se)Attractive enclosureEasy set upCons;Doesn't play Amazon Instant Video. This isn't it's fault but I really wish it did.A tad pricier than other streaming boxes (but so much more polished)Probably wont work all that well if you do EVERYTHING outside of the Apple eco-system. But really, if you have an iphone you are already in the walled garden.", "verified": true, "helpfulness": "1/1", "author": "makoman50"}, {"rating": 5.0, "review": "The Apple TV is a great little add-on if you've already subscribed to the Apple ecosystem. I have a macbook, iPad, and iPhone so I love how i easily fling whatever I'm doing on each of those devices onto my big screen.", "verified": true, "helpfulness": "0/0", "author": "Benson Chan"}, {"rating": 5.0, "review": "We never dreamed we could get anything from the net. that we get on our computers on our TV and often in hi def. We enjoy you-tube, Facebook, our emails, photos and messages on our Ipad and Iphone and much more.", "verified": true, "helpfulness": "0/0", "author": "Jody G Smith"}, {"rating": 5.0, "review": "for 99 bucks... im contemplating cutting off my cable. runs netflix nice, hulu, espn. very sweet and hope that they continue to add content like they have been doing", "verified": true, "helpfulness": "1/1", "author": "vrooooom"}, {"rating": 5.0, "review": "I use it with my iPhone all the time and it is great! If you like to see things on your tv and go bigger, you will love apple tv. I got it for my husband as a Christmas present and I am the one using it like crazy.", "verified": true, "helpfulness": "0/0", "author": "Zug"}, {"rating": 4.0, "review": "This is such a neat Apple product - I never thought it would be so useful when I bought it, but I find myself watching Netflix and HBO Go, sharing music, and screen-sharing almost every day.I'm constantly amazed at how well it can stand up to - and compensate for - a little bit of network congestion.My only complaint about the interfaces within it (e.g. the Netflix app or the HBO app or whatever) is that it's really difficult to navigate and find things.  You can't watch an entire season in sequence (without going back to the menu and selecting the next episode).  I think that could really be improved with a \"Play All\" button or \"Play in Sequence\" or something like that.  We have to figure out what episode is next and which we already watched and it is just a tad annoying.We also use a second unit all the time in our photography studio to share photos from our Mac to a large screen TV for clients.  It would work equally well for showing photos off to visitors and family!", "verified": true, "helpfulness": "0/0", "author": "Meowcat"}]