[{"rating": 4.0, "review": "There are other options out there for streaming media to your TV, but I found the Apple TV easy to set up, a breeze to control (especially with an iPhone), and able to stream even the largest of my movie files without skipping or stuttering at all. It offers a ton of subscription services right in the box, and anything it doesn't offer, I can stream from my other devices using AirPlay. Though not a perfect product, the pro's outweigh the cons in my opinion. (note: We own mostly Apple devices in our home, so our experience may be different than someone with out any. Haven't used it to stream from one of our PC notebooks yet)Pros:Easy set upiPhone as a Remote (great for entering in name/passwords for your subscription services)Tiny footprintFast streaming of networked media hosted on external HDGreat quality from subscription services (NHL is AWESOME!)Nice Screen Savers based on photos from your iphoto or photstream, or from Flickr searchesCons:iTunes does not support .avi movies without a work-aroundslight delay when changing song/movie using airplayNo Spotify/Pandora built-in - must stream this from another deviceNetflix layout is not as intuitive/pretty as other devices like the PS3 or some Blu-Ray playersWould be nice if it had a USB input for an External HD", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Barone"}, {"rating": 2.0, "review": "I love Apple products, but this one needs work.  It is amazing to use Airplay to be able to mirror my screen on my TV and stream music through the big stereo in my room.  But, this device has some serious technical problems.  It regularly disconnects from the wireless network for no apparent reason.  It also constantly disconnects airplay from my computer and makes me turn airplay on and off through the menu of the AppleTV to get it to work again.  I have been stuck in bed after surgery twice in the last four months.  Each time, I used the Apple TV very regularly to stream music or watch movies.  I would estimate I had a problem about five times a day that required power cycling the Apple TV or turning settings on and off in menus because they randomly stopped working.  This product has a lot of potential if they can get it to be stable.", "verified": true, "helpfulness": "2/3", "author": "Goodheretic \"GH\""}, {"rating": 3.0, "review": "Delayed screen on Wifi... cannot use for work purpose. Good for watching movies. You will notice delay what you type and what you see on screen.", "verified": true, "helpfulness": "1/1", "author": "Hardeep Singh"}, {"rating": 3.0, "review": "yea its cool TV but it not that useful as they described itbut after all Apple is Amazing Company", "verified": true, "helpfulness": "0/1", "author": "MiRO (Marwan S. Abdulqader) \"MiRO\""}, {"rating": 5.0, "review": "This is a really great product! Integrates all your apple stuff with your TV easily.Despite of that, you can access:- Netflix- Vevo- Flickr- Youtube- Rent movies in iTunes- Access your iTunes library- and so much moreGet Apple TV and enjoy it!", "verified": true, "helpfulness": "0/0", "author": "Oliver Chuo"}, {"rating": 5.0, "review": "Excellent device. Connection ease makes it a very versatile device. my daughter just 3.5 years, connect your ipad 4 and relayed their videos and cartoons. It is very easy to use and install", "verified": true, "helpfulness": "0/0", "author": "Belt"}, {"rating": 5.0, "review": "I am not a big tech person, but this little Apple TV really impressed me, it's very easy to use and to connect, all you need is a HDMI cable, which does not come with the device, and connect it to any Hi-def. TV or component, and pair it up to your WiFi, and your ready to go, it also connects directly into your computer modem if you don't have WiFi, or wireless, the Apple TV only works on Hi-def. Tv's.", "verified": true, "helpfulness": "0/0", "author": "Francis M."}, {"rating": 5.0, "review": "The best Netflix Player that I see! I have a Roku too, but this is faster and the quality is very impressive! The bad point is that you have the access only to Apple iTunes, and on Roku you have more options of apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Watch TV from iPhone, iPad or MacBook if you get past the proprietary Monopoly apple has on all their products it helps to be able to watch on a bigger screen. It works for keynote presentations or web design, or just playing Angry Birds Star Wars", "verified": true, "helpfulness": "0/0", "author": "DBL07.CO Web Design Columbia SC \"DBL07.co\""}, {"rating": 5.0, "review": "Works fine , and offers a lot of entertainment value for little cost.  I am just learning how to use it the best way", "verified": true, "helpfulness": "0/0", "author": "Max T. Nigh \"Max Nigh\""}]