[{"rating": 5.0, "review": "I use it mainly for streaming Netflix but love it! No access charges to use it! Am looking forward to streaming the digital movies I have on my computer!", "verified": false, "helpfulness": "0/0", "author": "NaPaAs"}, {"rating": 5.0, "review": "I find the Apple TV to be a fantastic product. The Netflix app is the best I've seen, very slick and user friendly.  I agree with several user reviews who find the included apps limited, however if you use Netflix, iTunes, Youtube, etc. then this little box can't be beat.As far as networking and download speed, I use AT&T; DSL Elite which is capped at 6 mbps and I rarely have buffering issues.  Anyone who uses a cable modem should be aware that you are sharing your cable node with many users so during periods of heavy use your performance will suffer.A recent update added HBO Go!!!", "verified": true, "helpfulness": "0/0", "author": "Bill in Michigan"}, {"rating": 4.0, "review": "At less than a hundred bucks, I decided to push the buy button after thinking about it for a couple of generational iterations. I watch a lot of TV, but seldom sports programming. I don't often rent a movie and certainly don't buy or collect DVDs, don't go to the theater often. So why do I even need this? I don't. The Apple TV is a Wi-Fi connected gateway to other web portals like Netflix, Hulu Plus, Go HBO, and Apple store most of which seem to require rental fees or paid subscriptions to get content. So beyond the hundred bucks you pay for this Wi-Fi peripheral you have to really want the content to pay extra to these providers in addition to already having working, Wi-Fi and cable or other internet connection services (which are utility subscriptions as well). Can you tell I am not a fan of the subscription payment model? Anyway, Apple TV will allow me to stream iTunes music content from my 2007 model iMac to my music system on a different floor of my home. The iMac has to be awake and iTunes running, however. Also useful, I can mirror my iPad 2 (won't work with the iPad1) and control Apple TV from it using Apple Remote app, and some apps and web sites can access Apple TV directly from the iPad. I can also display anything in my photo library on the iMac or iPad on the HDTV screen and associated surround sound system. Video and display mirroring from the iMac is limited to models 2011 and newer, very sad, but I knew that going in. I found it desirable to bump my cable internet speed from 1.5 Mbs (that's bits not bytes, by the way) to 5 Mbs another $5/mo, since some trailers and other content took a long time to load. This helped, but I think I would need even faster and more costly speed for some streaming HD content to be viewed without breaks. There is a lot of nickle and dime (read $5 and $10) added costs to getting the most out of this device. That sticks in the craw of this thrifty but honest reviewer.", "verified": true, "helpfulness": "2/2", "author": "John Kenderdine \"physical sciences teacher\""}, {"rating": 5.0, "review": "Apple t v is small work great,this is more than I through it would be.i recommend this for anyone this is a 10star", "verified": true, "helpfulness": "0/0", "author": "Fredrick Todd"}, {"rating": 4.0, "review": "This was easy to install.  Great picture and sound quality.  Movies look and sound fantastic.  I would recommend this to anyone with an iTunes account", "verified": true, "helpfulness": "0/0", "author": "Marc Versley \"mvers\""}, {"rating": 2.0, "review": "If the Apple TV worked well, it would be a wonderful product. I have serious speed issues when connecting to the Wifi and searching the Internet found that many people have the same issues with little feedback from Apple.", "verified": true, "helpfulness": "0/2", "author": "Rob van Deventer"}, {"rating": 2.0, "review": "The setup was easy and the Apple TV works well with Netflix. However, I already had no less than ten devices (four computers, one tablet, two smart phones, one game console, and two DVD players which worked well with Netflix. I primarily bought this for \"home sharing\" and to see what else it was capable of. Well, it has few other capabilities that are of more than passing curiosities to me, and the home sharing works horribly. I just spent about a half-hour getting the Apple TV to play a movie through home sharing. Five minutes into the movie, it stopped and displayed the message \"To access your iTunes library on Apple TV, turn on Home Sharing in iTunes on your computer.\" Obviously, \"home sharing\" is already turned on. Another ten minutes of tinkering and (hopefully) I'll be able to watch my movie. This problem didn't seem to occur when I first bought the Apple TV two months ago, but it seems to occur every time now. Extremely frustrating. If you want to access a streaming service like Netflix, the best solution is to connect a computer directly to your TV. You should also be able to access multimedia files directly from your home network, without the added hassle of iTunes. The simplest solution fr streaming is a DVD player, which would be far more functional than Apple TV at only two-thirds the price.", "verified": true, "helpfulness": "0/0", "author": "Statman"}, {"rating": 4.0, "review": "This product can fit anywhere in your living room. It only requires 2 cords in order to work. There is no power button on this device. It is always on so when you need it, it will be ere for you. If you own an apple device, you can stream media to the tv in a matter of seconds. Very impressed with this item. One thing I don't like is that it can be slow when opening up an app. I still recommend is item to apple users.", "verified": false, "helpfulness": "1/1", "author": "MasterReviewer05"}, {"rating": 5.0, "review": "I personally own the second generation of Apple TV, and I absolutely love it.  The way it so easily integrates with other apple devices makes it that much better.  In addition to the vast apple store for tv shows, movies, rentals etc... if you own any apple products, Apple TV makes a great addition!  Couldn't recommend more highly!  My family member is already in love with it and has only had it for a few days!", "verified": true, "helpfulness": "0/0", "author": "Keith S. Napolitano"}, {"rating": 5.0, "review": "I look by internet in site amazon.I  by for me and my son.I recommended For every oneThe price is very good", "verified": true, "helpfulness": "0/1", "author": "Celson Hubner Junior"}]