[{"rating": 5.0, "review": "We have had this for almost 2 weeks now and I am ready to cancel my expensive cable.  It was SUPER easy to set up and now we have Hulu and Netflix and it pretty much covers all of the TV we were paying almost $200 a month for for less than $15 a month for those subscriptions.  Not to mention all of the other freebies on there.  It also ties into our iPad if we want to play something on any other apps that might not be on there.  I would definitely recommend this to anyone!", "verified": true, "helpfulness": "1/1", "author": "dreamingviola"}, {"rating": 5.0, "review": "It's great.  Have one in the living room and one in my bedroom.  Very handly when you have grandchildren hanging out at your house.", "verified": true, "helpfulness": "0/0", "author": "L. Johnson"}, {"rating": 5.0, "review": "I am a Mac House and love the features this unit has to offer. Liked the packaging and I am enjoying the Apple!", "verified": true, "helpfulness": "0/0", "author": "Gary Ferrero"}, {"rating": 5.0, "review": "Does everything it says it would and more.  Everything in true HD. Still wondering why I never did it earlier", "verified": true, "helpfulness": "0/0", "author": "Matthew McCleese"}, {"rating": 5.0, "review": "I brought this myself but ended up giving it to my son and he loves it. This is a good value and we have had no problems.", "verified": true, "helpfulness": "0/0", "author": "B. D. Lewis \"Heartfelt Books\""}, {"rating": 4.0, "review": "I purchased this on recommendation from a family member.Price was better than Best Buy.I have not used it yet.  The moment I got it my brother borrowed it for a ski trip to Colorado, and it worked perfectly for all their downloaded movies while they were at the hotel.  The kids were able to easily navigate the window.  It IS easy to hook up.I love the portableness of this item.Got it in great time!  Price was great!", "verified": true, "helpfulness": "0/0", "author": "Gayla"}, {"rating": 5.0, "review": "This item came boxed looking brand new and works perfect! My daughter paid almost $100 dollars for hers. As long as it keeps working I am super happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Linda Florence \"lflore5\""}, {"rating": 4.0, "review": "This Apple TV is useful since had the airplay inlcuded.  You can use to view all your apps on your Iphone or Ipad.  The channels on the device could be improve by streaming content quicker.  That a WIP.", "verified": true, "helpfulness": "0/0", "author": "Tri T. Technology"}, {"rating": 5.0, "review": "My husband got an Apple laptop and with this device, we can connect his computer to our regular TV. This allows us to watch a movie on the TV, view photos, etc.", "verified": true, "helpfulness": "0/0", "author": "Keys Family"}, {"rating": 4.0, "review": "Easily integrated into my heavily apple-centric household.  I mainly use it for streaming stuff from my Amazon Prime account on my iPad.  I'm even able to stream the audio separately to my old Airport Express, which is nice.The interface is a bit clunky...works best with an ipad or iphone as the remote, IMO.I wish Apple had a comparable service to Prime, but let's be honest, it just isn't there yet.  The built in streaming channels are OK for an occasional diversion, but not much more than that.  I'm hoping the next software revision includes something new, content-wise.", "verified": true, "helpfulness": "0/0", "author": "Dan Newcomb"}]