[{"rating": 5.0, "review": "I added this to one of my older TVs so as to have a way to stream various types of content to it, whether from iTunes or one of the other sources. So far I'm impressed with the overall quality of what you can get through this tiny device.For one thing, 1080p content seems to be somewhat less compressed than other solutions I've seen. Given adequate bandwidth, and the same 1080p title looks better on the Apple TV than it does on some other services. Many people don't realize that 1080p alone isn't really a guarantee of any particular quality...just as important is the degree of compression applied to the video data. Broadcast quality 1080p often comes out of the camera at 60mb/sec. The best Blu-ray DVDs are about 40mb/sec...even top-end consumer video cameras are in the 24mb/sec range. Apple TV is 8mb/sec, but most of the competing products are maybe half this, meaning that while the Apple is tough on bandwidth, it gives you a better looking picture. To me, this alone is worth the price of the unit.Speaking of bandwidth, I find I just can't get adequate performance on wireless, so I've generally preferred to connect the Apple TV directly to my router with an Ethernet cable. A little less convenient, but overall much more stable. Of course, I use wireless from my computers to the Apple TV, but for online content, the wired approach gives me a much better experience (I have 35mbps Verizon FiOS).The other thing I love about the Apple TV is the included Airplay. My iPad2 not only streams music and videos, I can mirror my desktop to the Apple TV and project my iPad's desktop onto the big screen. As others mentioned, this feature is coming to Mac OS X in an upcoming release and will be a very handy way to display Mac content on the big screen. It seems to work quite well wirelessly, with just a slight delay.Overall, this little device is definitely worth the investment if you have adequate network capacity.", "verified": true, "helpfulness": "3/3", "author": "Busy Executive"}, {"rating": 2.0, "review": "Maybe I should have thought this out more. I added this to my cart on a whim when getting the new iPad. It really is a sleek little device but it just doesn't meet my needs. Just to make sure you don't fall in the same boat, here are a couple things to consider before buying -Navigation -  Navigation works fine, but typing does not. Using a four direction pointer to type will quickly frustrate you and bring back nightmares of trying to type your name on the high scores list of an old Nintendo. Just because this has the best navigation on the market doesn't mean it is good. Call me when this gets Siri voice input. In the mean time, I'll hook up my mac mini and use a keyboard.Content - Awesome if you use Netflix and iTunes. Not so great if you use Amazon Prime and streaming music services like MOG or Spotify. I know I can airplay music from my iPad or computer, and that really is awesome, but even more awesome is having that content natively supported. Roku has it, Apple TV doesn't.I have huge respect for apple devices and have always been satisfied in the past, but this one just doesn't do it for me. Maybe once Mountain Lion comes out with its native support for Airplay of your Mac screen I'll give this another look. Until then, I'm returning it for a Roku.---April 2012 Update---Just to follow up, I never did get the Roku. As commenters pointed out, it just has different shortcomings. I've had my mac mini hooked up to the TV since though, and I'm pretty convinced this is the best \"interactive-TV\" option on the market right now. Here's to hoping Steve Jobs \"finally cracked it\" for the next ATV. If so I'll be first in line.", "verified": false, "helpfulness": "5/10", "author": "Ellis Atwood"}, {"rating": 5.0, "review": "After spending a week with the new Apple TV I thought I would post a video review talking about it's features.TotalMount - Apple TV Universal Mounting Kit", "verified": false, "helpfulness": "136/173", "author": "Jerad"}, {"rating": 4.0, "review": "I just recieved this product, ssssuper fast (5 days..and I live in Honduras) and it just works wonders. The setup was very simple, it works pretty decent with my iPad. the only bad thing is that it doesn't have a RCA out to connect to an A/V reciever. I had to spend $25 on a Digital Output to RCA converter. but it still an amazing product that every apple lover should own.", "verified": true, "helpfulness": "1/2", "author": "Car_Bar"}, {"rating": 3.0, "review": "I was waiting for this 1080p release for over 6 months and finally arrived 3 days back. I already have PS3, WD Live Plus and few china made PMPs. I was eyeing on this because of its AirPlay, Youtube HD streaming, Mountain Lion's Airplay and possibly also for XMBC.Pros: o Simple to setup o remote is intuitive o Can use \"Remote\" app to control and to type text o Low power consumption compared to my PS3Cons: o The usual complaint - less contents. o compared to PS3 Netflix - same HD content  * Not impressed with the clarity  * Streaming is not smooth and buffers often  (I have connected my ATV3, hardwired to ~30Mbps internet connection) o Airplay videos from iPhone 4S (using n) takes forever to play  * Looks like it downloads the entire video and plays.Still keeping the box, hopefully I can airplay using my iMac once Mountain Lion is released and possibly I should be able to install XMBC ;)Overall I am ok with this box.", "verified": true, "helpfulness": "4/7", "author": "G. Nagiah \"G\""}, {"rating": 4.0, "review": "The new 1080P Apple TV is pretty much the same as the Apple TV 2 except that it can output 1080P video. The Apple website says that to stream HD movies you need a internet connection at least 8Mbps but our internet was capable of streaming it smoothly after about a 10 minute buffering period.", "verified": true, "helpfulness": "0/1", "author": "Brad98"}, {"rating": 5.0, "review": "I don't watch \"regular\" TV at all and haven't for many years so I decided to ditch the cable service and go with 2nd generation ATV back in 2010. For me and the family it was mainly about watching movies and some educational documentaries a few times per week through iTunes and Netflix. Being that we're also a Mac and iOS family with numerous Macs and iOS devices around the house, the ATV became more useful than just streaming movies and shows to the HDTV set. Now with iCloud it's the wireless router that brings all of the content available through the Mac and iOS ecosystem to the TV screen and the home theater audio system. Gone are the big unsightly black boxes and cables that cluttered the TV cabinet along with the racks of CDs and DVDs. With all the content on iTunes Match and the iOS devices, it's just a matter of using the remote or the iDevices themselves to control what you watch and listen to through the ATV.The value of the ATV is that much greater if you have already invested in the Apple ecosystem - Macs, iPhones, iPads, iPod touch, iTunes content, etc. The ATV on its own, I gather, isn't all that great compared to what's already out there. For TV freaks who put in 4~5 hours of TV time per day, I'd imagine there are more thorough and feature-rich devices out there. But as an extension device of all things Apple to the TV screen, this little unit works charmingly well and provides more than enough content for the casual TV watcher and movie fan. I'd only really recommend this unit to iOS device owners and there are plenty of them out there.Apple still has ways to go to make the TV an integral part of its growing ecosystem. One can tell that Apple is getting more and more serious about this business and that it isn't just a \"hobby\" anymore. These little ATV boxes seem more like a real-world R&D; testing for Apple's rumored HDTV set that could arrive near the end of this year or sometime in 2013. The key will be content and Apple still has a lot of work to do on that front. For me, live sports would be the only thing I'd consider to be essential to make it perfect but I know most other people have other wants and needs when it comes to what they want to watch. In the meantime, this new ATV would be a great addition to iPhone/iPad owners and a reasonable add-on for others who want to stream movies and archived TV shows every now and then.", "verified": false, "helpfulness": "2/3", "author": "Virtuoso Fan"}, {"rating": 4.0, "review": "Apple arguably has the best-developed video ecosystem in the business. Their video rental selection is top-notch, you usually get iTunes digital copies with the Blu-ray combo packs you can buy, a good (not great) selection of TV shows are available, there's tons of great free content (news, vlogs, etc.) via Video Podcasts and Apple's developed a way to stream what's on your iPad 2/3 or iPhone 4S screen to an Apple TV via a technology called \"AirPlay\".I personally have around 100 iTunes movies and it's great to be able to sync them to my iPhone/iPad for my kids to watch when we're out and about, then come home and stream them to my TV with a push of a button.As you'd expect with Apple, the interface is top-tier. Sure every Blu-ray player and game system out there nowadays has YouTube, but usually the interfaces are clunky enough that you rarely use the feature. Apple TV's Netflix interface is also my favorite of the plethora of streaming devices I tried!If you have a lot of iTunes video, a Netflix subscription, rent a lot of movies (but hate driving or waiting for the mail), or watch any Video Podcasts, it's surely worth dropping $99 on this puppy.However, it's not perfect. First, while this is the first \"1080p\" Apple TV, you shouldn't expect Blu-ray quality (as is the case with any current media streamer). Blu-rays pump out up to 40 Mbps of data to your TV, while Apple suggests you have an 8Mbps connection for their \"1080p\" content. Thus, while the resolution is technically full HD, movies have to be so compressed that they lose a bit of color depth and sound quality in order to make streaming over the internet practical: in short, this device is about convenience more than quality.Also, while Apple TV supports a lot of content that no other media streamer can (iTunes video in particular), there are some services notably absent from the selection. For example, there's no Hulu+ and no way to download it since the Apple TV has no App Store.The good news is that you can partially overcome this limitation with the video mirroring \"AirPlay\" feature of iPad 2/3 or iPhone 4S. The bad news with these devices is that the experience is suboptimal. Using Hulu+ as the example, the first thing you'll notice is that the aspect ratio of the iPad and an HDTV is different, so you get black bars on the sides. The picture is also relatively low quality, but it does the job.Nevertheless, since a lot of Blu-ray players offer Hulu+ and even apps, it puts the Apple TV at somewhat of a functional disadvantage in some respects.However, even with its limitations the reality remains that Apple TV is my go-to device for Netflix, YouTube, movie rentals, iTunes streaming, video podcasts and even Flickr slideshows of family photos. What the Apple TV offers, it offers better than any other device I've tried.", "verified": false, "helpfulness": "5/7", "author": "P. Colin McGraw \"AV, Computer & EnviroTech Nut\""}, {"rating": 3.0, "review": "This is an elegant and easy to use little box.  The interface is pretty, setup is dead simple (took less than 10 minutes from start to finish), and it's fairly intuitive to use.  The problem comes in that it doesn't serve a great deal of function, at least for me.Apple TV is essentially 3 main functions in one package.  iTunes front end, content/channel provider, and wireless display.On the face of it, Apple TV is a front end for iTunes and allows you to buy or rent content and view it on the box along with previously purchased content.  The usefulness of this is based on where you buy content.  If it's not iTunes then you can ignore most of it.  All the magic from this perspective is essentially gone for videos and even music doesn't work without iTunes Match.  You can alternatively access your media from another computer currently running iTunes, but only the content in iTunes (not a huge issue) and again, only when the computer is on and running (think of it like an iTunes extender).  The interface is lush and a joy to use but it's dependency on iTunes purchases or iTunes running on a computer diminishes the usefulness.  It'd be nice it it could access a network attached storage or something similar.The other content means are provided through channels/apps, like on a Roku box, but are limited to only 13.  Missing are the normal heavy hitters: Hulu Plus, HBO Go, Pandora, Slacker, Spotify, etc.  Only Netflix is present really, but what device doesn't have access to that?  I have 3 other devices connected to my receiver that can do it already and personally prefer the PS3 Interface.  The general feel of the channel/apps is also very smooth and works fast but some of them feel a bit long in the tooth, as if it could be better but in order to fit the overall design scheme it's not (again Netflix is an example).The final feature is AirPlay.  This is a feature that allows you to stream music and video from your MacOS and iOS device.  There's also AirPlay mirroring which takes what you see on your device (or computer once Mountain Lion is out) and puts it on the Apple TV.  It seems, based on the packaging, Apple is trying to play this up a lot and I'd agree with that goal.  It's really simple and amazing to use where it works (certain applications don't support it or actively block it).  If you're familiar with Intel's WiDi it's a very similar thing, especially with AirPlay mirroring.  Certain things work better with Airplay though (Slingplayer and Netflix, for example, display the controls on iOS while the video is on the TV) and others not so well (Hulu, for example, doesn't support video out - only mirroring.  HBOGo is blocked entirely, mirroring or video out).  It works really well and is very smooth with minimal lag with audio and experiences only occasional minor choppiness with video provided you're on 802.11N or have the apple tv wired (had bad problems with quality over two G routers).  The same, however, can't be said for AirPlay compatible games like Asphalt 6, which due to lag/stuttering is near unplayable (the jittering and stuttering mean you'll miss too much with fast paced games, e.g. In Asphalt you'll crash).Your enjoyment of this device will depend directly on the amount you give yourself to Apple, more specifically iTunes.  If you don't use iTunes for content purchase at least 1/3 of the functionality is right out the window.  And if you own a PS3, Xbox, TiVo, Wii, Roku, Google TV, certain Blu-Ray players, or even a smart TV then there's no point to the channels/apps really.  No MacOS or iOS devices and there's no point to the AirPlay aspect.  However if you're a diehard Apple fan and have lots of money spent in iTunes, this will be amazing, I'm sure of it.That's not to say it's not without its pleasure, the device is a joy to use.  I find myself wanting to listen to music from my TV just to look at the lush interface that's so simple and yet gorgeous.  But, for all of Apple's shine and improvements to the device, they've failed to address the largest issue - lack of content options.  Without more channels/apps like Netflix (looking at you Hulu, HBO, etc) Apple TV ultimately suffers from limited usability unless you're a big iTunes fan.  While it's fair that a good percentage of people looking at this device will have some content in iTunes, Apple simply cannot rely on that to support this product alone.  Features like AirPlay are a welcome addition but likely aren't enough.  Especially considering that video playback is a bit choppy and mirroring, especially with games, has too much lag.For me personally, I'm really only left with the AirPlay feature as a big feature.  Which alone might be worth the price, especially if Apple can improve the performance.  The content/channels/apps are, even objectively, poor.  And the dependency on iTunes either running or being used for content purchases diminishes the utility of the media for me leaving the \"Movies\", \"TV Shows\", and \"Music\" features as empty.  Yes it does everything the previous Apple TV did but better, but that's also it's flaw - it doesn't do anything new.Pros:++ Simple set up++ Very pretty and smooth interface++ AirPlay (for music and video)+ 1080PCons:-- Very limited channels/content-- iTunes only for content, even for in network- iTunes match dependent for music- AirPlay lags and stutters a bit too much with mirroring and gamesThings I'd like to see:1) Support for network storage for content streaming.  You can jailbreak and put plex or xmbc on to do this, but why do I have to?2) More channels/apps.  I've got all the missing channels on my iPad but why not on the Apple TV?  Especially annoying since this is based off iOS 5 and has hardware better or on par with the original iPad.3) Stronger AirPlay performance. (yes it's wired in, but it still stutters for games)In the end it does really well at what it does (most of the time) but it's a very shallow pool.COMPARISON TO ROKU 2:I also own a Roku 2 XS, so I figured I'd update with some remarks in comparison.  The Apple TV is notably easier to set up.  The Apple TV interface is also generally better, however certain apps (specifically looking at Netflix) while smoother on Apple TV are better laid out on Roku.  Specifically with that, I mean Apple TV forces a text list strong interface at front whereas Roku shows you the box art.  The remote on the Apple TV feels better but is more limited than Roku (Roku XS is RF as opposed to IR on Apple TV) and also lacks the instant replay (10 second) button found on the Roku XS - very handy at times.  Both are limited with text entry but have smartphone/tablet apps for use (although Apple Remote is only on iOS devices, whereas Roku Remote is on Android and iOS - a point to note, but not likely a deal breaker).  Image quality is comparable, Apple TV works better wirelessly than the Roku though (especially at start).  While Apple's interface is generally better/faster/smoother, it still ultimately lacks in content when compared to Roku.  Roku has Pandora, HBO Go, Hulu, Amazon Instant, Crackle, and many other options.  Aside from iTunes content (either from your computer or iTunes cloud for movies/tv or iTunes Match) there isn't anything I'm aware of that Apple TV has that Roku does not.  Apple TV does have AirPlay, which again makes it nice.While Apple TV interface is generally better and smoother, the cost of the Roku (I got the XS for $80, so 20% less) and the instant replay button make it a better option for streaming.  It's not as refined but it offers the heavy hitters missing from Apple TV.  Streaming options are just better with Roku.Unless you own an iOS device or will be upgrading to Mountain Lion (for AirPlay) or are heavily invested in iTunes store purchases - Roku is better hands down as Apple TV's use will be very very limited.  Conversely if you already own a gaming console or a TiVo or something similar then the streaming options of the Roku may not be unique (between my tivo, ps3, and 360 - there isn't a thing I use the roku for that I can't do on one of those - mainly the PS3).  If you're interested in a streaming device and don't already own a gaming console, Roku is likely better.  If you are only interested in Netflix, MLB, and NHL and/or you're really in love with iTunes or AirPlay, then Apple TV is better.Personally? I'm keeping the Apple TV, for AirPlay alone, hooked up to my TV in the living room.  The Roku is going in my guest room.  The Roku is a better device in my opinion, but it doesn't do anything unique like AirPlay.  Perfect on it's own though where I don't want to buy several devices again.  Apple TV though is much much limited on its own though.UPDATE:I've tried other AirPlay games (Real Racing 2, NFS Shift 2) and the performance is better on these games.  It's still not what I'd expect or really want to deal with but it's playable for sure.  Lag/stuttering happens less often and when it does it's less severe as compared to Asphalt 6.  I'll note as well that the performance doesn't have an appreciable difference when the Apple TV is wireless vs wired, so it's unclear what's contributing to the lag.  But the fact that some games are doable gives me hope for the future.UPDATE 2:Hulu was added - Huzzah!  We're getting closer and closer.I'd recently bought a MBA and have used the Apple TV for AirPlay when trying to show a video to someone.  It works well but occasionally refuses to work correctly - either the video is funny or there is no audio.  Requires a restart of the MBA to get working (so it's possible the error is on the MBA side).All in all I still enjoy and use this device but it's only used for AirPlay for me.  If you don't own other Apple products or don't intend to use AirPlay I still say your money is better spent on an Roku.  I'm still going to leave this as a 3 star review for me.  Again it's gained more features but not enough in my mind yet.  It's close to a 4 though, but the dependency on iTunes and other Apple devices to be anything unique keeps it down.  Feels more like it's supposed to be an accessory for Apple products, not a device to itself so much.  Which is fine, but then I'd expect better performance.UPDATE 3 (Final Update):So taking a look back on this after nearly two years of ownership.  Things have improved content wise - HBO Go is there, Disney and a few other channels have appeared as well.  But for all of content improvements they've still ignored the larger flaws while the improvements to competing devices (notably Roku and WD) and the introduction of the Chromecast manage to further highlight the flaws and shortcomings of the Apple TV.  There's still no NAS support and most services that could compete with Apple's iTunes (Pandora, Spotify, Rdio, Amazon Instant) are still missing and likely will be for the foreseeable future.The Apple TV interface, while simple, is becoming stale and ugly in a few applications (YouTube and Netflix jump to mind).  Roku has drastically improved their interface, bettering Apple as far as I'm concerned.  All the while the Chromecast has come on to the scene and for $35 does many comparable things (including whole screen casting similar to AirPlay from laptops - although admittedly not as smooth yet).Now, more than ever, the value proposition of Apple TV is largely tied to you and your participation in Apple's ecosystem.  If you need iTunes access or your need AirPlay, this is the only device to get them on.  But if you don't, there's really not any reason I can provide to buy an Apple TV anymore.  Even a year ago you could make the argument that if all you needed was Netflix, Hulu, and YouTube hat the Apple TV was as good option thanks to its attractive interface but since Roku has fixed their interface with the Roku 3 this simply isn't the case anymore; the Roku is now the box to beat.  The additional content channels provided by Apple TV do help its use, but it seems more apparent that they're deliberately leaving out competing services (or at least that those services have no interest being on Apple TV).  So if you use Pandora, Spotify, Amazon Instant, and several other services you have to get something else (for now at least).I'm not saying Apple TV is a terrible device, I still have mine hooked up in my living room for AirPlay.  But if you exclude iTunes and AirPlay there's simply no reason to buy it over a Roku or WD TV or Chromecast anymore really.  While iTunes and AirPlay are valuable features I could argue that the absence of Amazon Instant, Vudu, Spotify, Pandora, and Slingplayer are notable weaknesses that other platforms don't have. So in the end it really is based on your ecosystem needs.  If you're heavily invested into Apple's world and can do without the missing services then by all means get an Apple TV.  But in nearly any other instance your money is better spent elsewhere.", "verified": true, "helpfulness": "1/926", "author": "William B Partridge \"William B Partridge\""}, {"rating": 5.0, "review": "Highly recommend it. Air Play feature alone justifies the price.  This is what Apple is all about. I can even share my Mac (with advance preview of upcoming Mountain Lion OSX) screen on to the TV with a single click. Netflix is top notch too. The included new remote is definitely a huge improvement over the \"white acrylic\" that came with the first generation apple TVs. Still I am not a huge fan of it. With that said, who needs it any ways. when one can remotely control the Apple TV from my iPhone and iPad.", "verified": true, "helpfulness": "23/31", "author": "karma-rules"}]