[{"rating": 3.0, "review": "Sometimes won't \"connect to the server\" when all my other connected devices are working just fine. Not an internet issue. Of course if you want apple tech support you have to pay for that too", "verified": true, "helpfulness": "1/1", "author": "Brian Groenig"}, {"rating": 5.0, "review": "From quick shipping during the busy holiday season to easy set up, the Apple TV was a great gift that my husband and I are enjoying.", "verified": true, "helpfulness": "0/1", "author": "Rachel Wenzel"}, {"rating": 5.0, "review": "This Apple TV is very easy to set up and use, has a lot of features, and streams in pretty high quality. I like it.", "verified": true, "helpfulness": "0/0", "author": "Zacc"}, {"rating": 5.0, "review": "My son loves it....so I love it. Can't really tell much about it but apparently it works very well. It made a great gift for my 30+ old son.", "verified": true, "helpfulness": "0/0", "author": "punk"}, {"rating": 5.0, "review": "If you have a HDMI TV and you have any of the Apple products, such as an iPad, iPhone, or iPad then this is a must have device.  I constantly stream movies from my Mac Mini to my TV.  I also can send music to my stereo through this device.  It does require me to have my computer running when I send stuff from my computer.  I'm still not convince about the Googlechrome cast.  I like taking stuff from my iphone, ipad and computer and send it to the TV.  I just love that capability.  Not to mention all the other applications, such as MLB and Netflix.  I don't care that TV's come with Applications, when I have an Apple TV.  Great value for $100!", "verified": true, "helpfulness": "0/0", "author": "David H. Malin"}, {"rating": 5.0, "review": "Apple Tv is a nice product to convert your flat tv in a smart tv.If you are user of apple devices, you must buy an apple tv, It's very easy to share your phone/tablet/macbook in your HDTVAlso include the best version of  Netflix", "verified": true, "helpfulness": "0/0", "author": "Leonardo Noach"}, {"rating": 5.0, "review": "Love the fact  of streaming my iPad and iPhone onto the TV. And also being able to watch some of my favourite TV.", "verified": true, "helpfulness": "0/0", "author": "I Gooch"}, {"rating": 5.0, "review": "I have all of these gizmos including a roku 3 and chromecast. I don't have a favorite, but this gets plenty of use. If you're an apple fan then you need this today. The music steaming and phone/iPade remote functions rock. I love the apple trailer channel!!!  This is a must have for $100 or less.", "verified": true, "helpfulness": "0/0", "author": "Bradley F. Baker"}, {"rating": 5.0, "review": "I have a Roku and an Apple TV.  I like both of them but I prefer the Apple TV.  It's so much faster than the Roku and the picture is substantially clearer.  The Roku was then moved to one of the bedrooms and the Apple was moved to the living room.  I liked it so much I also bought one for my father who also then moved his Roku to his bedroom and put the Apple TV in the living room.  He also preferred the Apple TV over the Roku.It's also easy to install and to use.  If you prefer streaming content over watching cable, then this is an awesome device for you.  Many people think you have to have Apple products in order to use Apple TV properly.  This is untrue.  You do NOT need an iPhone or Mac.  I don't have a Mac and my father doesn't have an iPhone or Mac and he loves this device.Another plus, the remote is durable.  I washed my throw blanket and didn't realize the teeny tiny remote was tangled up in it.  In fact, the remote is so tiny I didn't even notice it until after I heard it clanging in the dryer.  After I made my discovery I removed the battery, put the remote on top of some rice and let it sit for a few days near the window.  I couldn't believe it when I tried the remote and it worked perfectly fine.  It doesn't even have a nick on it.BTW - I'm not one of those people that thinks Apple can do no wrong, but this is one product that I absolutely love and stand by 100 percent.", "verified": true, "helpfulness": "1/1", "author": "Vanessa"}, {"rating": 4.0, "review": "I love the Apple TV. I originally bought it to watch iTunes Movies on our TV but now we watch a lot more than iTunes Movies on it. We used it a lot when our cable line was getting moved to watch ESPN, because it supports WatchESPN. We also use it a lot for Netflix, now that it supports the new profile feature. And I really like AirPlay, because I can stream anything from my iPod or iPad to the TV, and there is virtually no lag at all. Overall, I really like the Apple TV and think it is definitely worth it, especially if you live in the Apple ecosystem.--David", "verified": false, "helpfulness": "0/0", "author": "momofthree"}]