[{"rating": 5.0, "review": "We got this for our son-in-law for Christmas. He set it up at our house and was impressed with it instantly. Very cool product.", "verified": true, "helpfulness": "0/0", "author": "JoLynn"}, {"rating": 5.0, "review": "this little magic box was a great gift !! and so easy to instal.. only thing is that you have to buy a HDMI cable . doesn't come with one.", "verified": true, "helpfulness": "0/0", "author": "Adriana"}, {"rating": 2.0, "review": "Video streaming was bad. Audio worked OK. My original requirement was video streaming from my iPhone. Did not like it. returned", "verified": true, "helpfulness": "1/2", "author": "Sudhakar P. Upadhyaya"}, {"rating": 5.0, "review": "this product does everything is said it would in the advertisement, it was packaged well and arrived quickly. this product will be very useful and I am very happy with the purchase.I would highly recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "darin"}, {"rating": 5.0, "review": "This does exactly what is says it will do. It's easy to set up and works right away.  It's especially good with Netflix.  Only minus is it doesn't work with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Stan Fidel"}, {"rating": 1.0, "review": "All the promo copy says it will display on your TV whatever is on your Mac, iPad or iPhone. Not true. It won't show DVD's, which was my main purpose in getting it. Eveything works fine until I put a DVD in my Mac, then all I got was a checkerboard graphic. I own the DVD but Apple TV won't transmit it from my Mac to my TV. I assume if I bought the movie through iTunes it would work. I did not try to watch an Amazon.prime streaming movie so can't comment on if that would work.", "verified": true, "helpfulness": "0/3", "author": "Auggie"}, {"rating": 5.0, "review": "The Apple TV was great for a christmas present t o my mom and dad. It came quickly and was packaged really well. The shipping box had a large bubble wrap to ensure that it didn't rattle one bit. The apple packaging was pristine as well. It works great and is extremely easy to set up and use. Be sure that you buy an HDMI cable, as it does not come with one. However, the Apple HDMI cable is fairly inexpensive and widely available. If you're looking for one of the best TV, photo, video, music streaming and computer home sharing devices, I strongly recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Sarah Carlson"}, {"rating": 5.0, "review": "Everything was OK and no complaints and happy with the products that were in the order made. No more comments", "verified": true, "helpfulness": "0/0", "author": "Brian Cambronero"}, {"rating": 4.0, "review": "It is really really good. It works perfect thanks apple. The only one problem is that it can not connect to nas to stream personnal stored music or movies", "verified": true, "helpfulness": "0/0", "author": "Juleschris \"Chris\""}, {"rating": 4.0, "review": "but playstation 3 does more, so not sure if i'll keep it.but playstation 3 does more, so not sure if i'll keep it.", "verified": true, "helpfulness": "0/3", "author": "J. M. Barbieri"}]