[{"rating": 2.0, "review": "The selling point for Apple products is that they \"just work.\"  Unfortunately, the Apple TV doesn't just work.But first the pros:  the Netflix layout is the best I've seen.Now the cons:the Apple TV reboots itself every couple of hours.  A lot of people seems to have a problem with this, and so far I haven't seen a solution.The movie trailers are a nice idea -- but it can take forever to stream them.  You end up waiting five or ten minutes in order to view a two-minute trailer.You can watch iTunes movies, but only on the TV to which the Apple TV is attached.There's no Amazon/Amazon Prime or Pandora.Recently the YouTube app was removed, because Google was no longer supporting the version on my Apple TV.  So -- poof!-- no YouTube.I generally love Apple products, but to me the Apple TV just seems old and worn out.  It doesn't \"just work.\"  It seems very dated, and there are problems for which there is no fix.  As I said, Apple TV has a great Netflix layout, and you can stream music and photos to it from other Apple devices.  But if you compare the Apple TV with the Amazon Fire TV Stick -- well, there's no comparison.", "verified": false, "helpfulness": "0/0", "author": "Siguiriya"}, {"rating": 4.0, "review": "This is actually my second Apple TV - for my bedroom so I can scream Netflix etc. in there. Simple, worry free - if only all other computer type gear were so easy!", "verified": true, "helpfulness": "0/0", "author": "Robert Fately \"f8lee\""}, {"rating": 5.0, "review": "Works great and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Frank M. Coury"}, {"rating": 5.0, "review": "I actually prefer the layout of the Fire Tv box, but this works awesome for getting HBO without a service provider.", "verified": true, "helpfulness": "0/0", "author": "MeAmazon"}, {"rating": 5.0, "review": "Apple products rarely disappoint. Adding this to our network was simple and seemless and it works beautifully!", "verified": true, "helpfulness": "0/0", "author": "tbs"}, {"rating": 5.0, "review": "What else is there to say..", "verified": true, "helpfulness": "0/0", "author": "Vishal Patel"}, {"rating": 5.0, "review": "Fast shipping and easy set up.", "verified": true, "helpfulness": "0/0", "author": "Bardy419"}, {"rating": 5.0, "review": "I love my new Apple TV and got it for a great price got it used looks and works brand new!! Love it!!", "verified": true, "helpfulness": "0/0", "author": "Matthew Hardaway"}, {"rating": 5.0, "review": "Works perfect. I know I'm going to use this for a long time. Remember to get your own HDMI cable if you buy just the Apple TV...", "verified": true, "helpfulness": "0/0", "author": "Benji AverageDays"}, {"rating": 5.0, "review": "It's Apple great product", "verified": true, "helpfulness": "0/0", "author": "carol grosso"}]