[{"rating": 5.0, "review": "This product was easy to use and easy to setup. I had no problems hooking it up to my TV and then linking it to my iTunes, Netflix and Hulu account. I am very happy with my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Micah"}, {"rating": 5.0, "review": "Easy to install and set up.  Only drawback is our older TV without the HDMI ports.  Using it on a newer TV in a bedroom.", "verified": true, "helpfulness": "0/0", "author": "John Otterson"}, {"rating": 5.0, "review": "A friend of mine has one and I played around with it at his house, so I decided to purchase one and I love it. I also have a smart TV in the house so this was mainly for the bedroom use. set up was a piece of cake, I didn't even need the instruction book that came with it. all the instructions were on screen and were easy to follow. the apple tv connect twice as fast for Netflix than the smart tv(don't buy one of those, big waste of money) I use it everyday. awesome product", "verified": true, "helpfulness": "0/0", "author": "Rod Thomasson"}, {"rating": 5.0, "review": "After buying 4 units in the past 3 years I can honestly say \"WOW\". I've had every generation since the beginning (2007) and they seem to always get better while getting smaller in size. These little boxes are powerfull, full of features and potential. We use them all daily for watching movies and Netflix. The Netflix experience is like no other. It's really hard to buy the competition when Apple has mastered this invention. Looking forward to the future models as well.GO APPLE!", "verified": false, "helpfulness": "1/1", "author": "Matt from SD"}, {"rating": 5.0, "review": "As far as I know, iTunes is the ONLY one that provides alternative audio tracks for digital copies of movies or shows you can buy or rent. My children like Disney movies and many of them come with a Spanish or French audio track alternative.  I do wish Apple offered more movies and shows with this feature though. What I do not understand it that this is a standard feature on DVDs,  but not on digital copies. We are raising or children bilingual and because of this very simple but very important language feature for us, it is the main reason why I prefer the Apple TV over all the other alternatives.", "verified": true, "helpfulness": "1/1", "author": "Luis"}, {"rating": 3.0, "review": "I have both the Roku and the Apple TV. I have to say that I do like the Roku a little better, although, as everyone mentioned if you are already deep in the apple ecosystem, this is the way to go.", "verified": true, "helpfulness": "2/2", "author": "Gregory R. Mccoy"}, {"rating": 5.0, "review": "Awesome! Love my apple tv. One of the best things i have bought! Great device for air play. Fast shipping, new product!", "verified": true, "helpfulness": "0/0", "author": "Iva"}, {"rating": 2.0, "review": "We don't have cable, so we have a roku in one room and the apple tv in another.  The Roku is definatly easier to use and loads faster than the apple TV.  Also, you have access to Amazon Prime on Roku, which you do not on apple TV.  We tent to watch TV more often in the room with the Roku.", "verified": true, "helpfulness": "1/2", "author": "Nathaniel T. Hulford \"Online Shopper\""}, {"rating": 5.0, "review": "it is well wrapped and well done. it work well but you cannot count on it to see free movie or tv show because almost all need register and pay.", "verified": true, "helpfulness": "0/0", "author": "Xiaoyi Jin"}, {"rating": 3.0, "review": "Nice and simple, but not so useful because you need to purchase almost everything online, sucking watching movies or watching the channels.", "verified": false, "helpfulness": "0/2", "author": "Dragon \"dragon801\""}]