[{"rating": 5.0, "review": "There is nothing much to say about Apple TV. I can stream CNN from my iPad Air to my TV using Airplay now and I'm super Happy about that! I do not pay for the cable & use Antenna to watch free channels & CNN is not one of those free channels so I had to stream it from my iPad. The iTunes Radio is also awesome! remaining most of the channels are mostly available on any other streaming device like Roku etc.", "verified": true, "helpfulness": "0/0", "author": "NILADRI MUKHERJEE"}, {"rating": 5.0, "review": "I really enjoy the Apple TV. I am able to easily stream movies from my phone or iPad", "verified": true, "helpfulness": "0/0", "author": "Jose Castellanos"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "jamcc"}, {"rating": 5.0, "review": "Love it..I'm getting me monies worth.", "verified": true, "helpfulness": "0/1", "author": "ed denis"}, {"rating": 3.0, "review": "If you already have plenty invested in Apple or iTunes, it's great. However, iTunes Match can lag, which, if you have 3rd gen is really the easiest way to stream your library. That used to just be a free feature remember. It forgets artwork and doesn't necessarily always have all your tracks. Throw in the fact that sometimes AirPlay works for some video and not for others and you have a product that fails to deliver on all it's promises. I make very little money so it took a long time to get this little black box. I'm really disappointed in it's inconsistency and connection/recognition issues. Also, Hbo go is not supported for Apple TV in all areas, which I was not aware of until well after the purchase. So I still have to leave my old Roku plugged in. The picture, command speed and audio are all exceptional though, so it's not a total bummer. And...most importantly I finally have a remote I can safely fit up my ass. So I've got that going for me. The iTunes rental access is of course, excellent and always at the top of your menu.", "verified": false, "helpfulness": "0/0", "author": "Joe Dawson"}, {"rating": 3.0, "review": "I haven't used this as much as I thought I would.", "verified": true, "helpfulness": "0/1", "author": "MJGrimes"}, {"rating": 5.0, "review": "Does what its supposed to do!", "verified": false, "helpfulness": "0/0", "author": "Steven A. Tanksley \"Tank\""}, {"rating": 3.0, "review": "I have been pretty unimpressed with my apple TV. It is super choppy compared to any other device on my home wifi network, streaming music from my phone cuts out every couple of minutes and requires reconnecting. It could be that my unit has a problem, but my experience has not been the best, I prefer the experience with my chromecast.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Good value.", "verified": true, "helpfulness": "0/0", "author": "Blair Schwartz \"\"The Bookaholic\"\""}, {"rating": 5.0, "review": "purchased 2 of these as Christmas gifts. Price was good and they were delivered before the promised date.", "verified": true, "helpfulness": "0/0", "author": "Ruthanne Kilburn"}]