[{"rating": 5.0, "review": "I bought this for one reason, to mirror what is displayed on my iPad to a projector.  That it can stream from other sources is nice but I already have lots of devices that can do it as well... well, it turns out not \"as well\", but \"too\" More on that later.Setup was laughably easy.  I plugged it in, turned it on, waited less than a minute, and it displayed a message on the screen that I should tap it with my iPhone.  I wasn't sure why but I always do what technology tells me to so tap I did.  Apparently there is some magic where the tap transferrs details about my home network because a few seconds later the Apple TV was connected to my home wireless system!  No remembering WEP names or WPA2 keys or even if I'm using WEP or WPA.  Just a tap and I was done!  (BTW, *nobody* should be using WEP as just about anyone can crack in in less than a day.)Sending my iPad screen to the projector just started to work.  I select Airplay on the home screen and whatever is on my screen is also on my... screen.  I couldn't ask for more.As for the stuff it does that is the \"same\" as Roku and every DVD player and video game made in the past several years; this provides the clearest, most responsive, and user frientliest interface I've seen.  Too bad it doesn't stream Amazon content.  \"Why can't we all just get along?\"Because of the way Amazon reviews are displayed I doubt anyone will get a chance to see this before it gets buried under a ton more of what I expect will be equally glowing praises.  If you do find it helpful I hope you will fine a way to let me and Amazon know.  More importantly, unless the Amazon content thing is a show stopper or you really like having a wireless headset built into your remote, then I think Apple TV is wll worth your consideration when trying to decide on a media streaming device.", "verified": true, "helpfulness": "11/11", "author": "Bob Tobias \"Robert Tobias\""}, {"rating": 5.0, "review": "This tiny box is all you need to go with a high quality but dumb 1080 TV and WiFi to complete any streamingentertainment you want.It's fast, simple to hook up and configure, and use.The only problem is the excellent remote is so tiny, it's easy to misplace it.", "verified": true, "helpfulness": "0/0", "author": "Ancient Mariner \"Proud Republican\""}, {"rating": 4.0, "review": "I have a Roku also. Apple has the better quality especially in the super tiny remote, but some channels I want are not available. These things should all be open platform for any dern channel I want.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Mirror and have fun! Haven't tried it enough but having fun so far! I think what stands out for me is convenience and quality of the product.", "verified": true, "helpfulness": "0/0", "author": "Pramod"}, {"rating": 5.0, "review": "Apple TV is amazing.  Either you get the concept or you dont.  If you get it, then you know what I mean.  You cant beat this little machine for under $100.  It changes the entire game.  Especially for mirroring my ipad, iphone or macbook to my TV.  I can watch videos of my kids sports on my iphone and broadcast them to my TV.  Thats worth $100 right there and of course there is so so much more.", "verified": true, "helpfulness": "0/0", "author": "Joe Shmo"}, {"rating": 4.0, "review": "this thing is pretty great, I use it a lot for watching netflix and listening to iTunes radio. The only thing that is lacking is a Safari app and general third party apps. Its kinda lame that you can't download additional apps without jailbreaking it.", "verified": true, "helpfulness": "1/1", "author": "Nic H."}, {"rating": 5.0, "review": "Now I can watch what ever TV show or downloaded movies I like anytime I want. Or pictures,music...Is there a way to type words faster?!", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Watch Netflix and videos from our Ipads regularly.  Kids love it.  Easy to set up and to use.  Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Bob Catherwood"}, {"rating": 4.0, "review": "I really haven't had a chance to use it much yet.  But the one time i did, i thought it was pretty good. i didn't see amazon prime or netflix on there though but as i said, i've only used it once..", "verified": true, "helpfulness": "0/0", "author": "Pam Mathison"}, {"rating": 4.0, "review": "…be aware that you can't stream from your computer directly. Everything has to be MP4 coded and 'imported' to iTunes.", "verified": true, "helpfulness": "0/0", "author": "jmerk"}]