[{"rating": 1.0, "review": "Update (Dec 7, 2013)Since version 6.02 Netflix has become unwatchable during prime time on the Apple TV. It used to be the best at streaming HD shows on Netflix. Not anymore. All my other device stream Netflix much better during the same prime time viewing slot. Lots of others are reporting the same issue on Apple TV forum on discussions.apple.com.Until this is resolved ... I will be using my PS3.-------Better YouTube experience here than on Google TV,That itself should tell you everything you need to know.The fact that it starts Netflix and get you to their main page in less than 3 seconds ... And plays everything flawlessly is merely icing on the cake.Bravo.Now some minor quibbles.- remote blows.- smithsonian stream stops in the middle- no Amazon prime", "verified": false, "helpfulness": "2/6", "author": "vulcanman"}, {"rating": 5.0, "review": "If you still don't have an Apple TV yet, and you have wireless internet, you should get this.  Netflix and HuluPlus are about $8 each.  Anyone can sync their Apple device to your tv to show movies, video and pictures.", "verified": true, "helpfulness": "0/0", "author": "dbkr"}, {"rating": 1.0, "review": "tried to connect to apple and it was too complicated.  I don't have an apple mac or iphone or iTunes.  Maybe that is my problem", "verified": true, "helpfulness": "1/6", "author": "peter galluzzo"}, {"rating": 5.0, "review": "Bought as a gift for my boyfriend and he was stoked.  Needs and HDMI cable to go with it, however you can access Netflix, HBO to go, HULU, and youtube.  I wish I could play my amazon movies from it yet, but maybe they will get the rights later.  Good for playing slideshows of pictures from other apple devices, don't need a DVD player, you can just play the DVD in your computer and play it through the apple TV.  Can easily rent movies from iTunes and play all my music and videos from my computer.  Great for the price, good gift for men who like gadgets and Apple :o)", "verified": true, "helpfulness": "0/0", "author": "Stacie Marshall"}, {"rating": 5.0, "review": "The Apple T.V. Is easy to install and comes with a remote if you order it new, but you will need to buy the cord to hook it up to your T.V.  I'd buy the one they suggest, otherwise you'll be ordering that separately. I love my netflix streaming through this and you can actually watch music videos if you download the VEVO app for free. Sometimes, you get lucky and find some movies for free and sometimes they cost an arm and a leg if you order them through iTunes. I like the Crunchy Roll programming. They're Korean T.V. shows that all seem to use the same actors, but very entertaining. Maybe on wrong on that review because I don't totally understand how the Crunchy Roll programming is set up. I still like it.", "verified": true, "helpfulness": "0/0", "author": "Dawn M Wilkinson"}, {"rating": 5.0, "review": "Just does not carry amazon prime video. Use it for YouTube and Netflix. Good all around device that will do the job it says.", "verified": true, "helpfulness": "0/0", "author": "VIPbeachBum"}, {"rating": 5.0, "review": "I love AppleTV after waiting for years to try it, I recently gave it a shot and love it!  I did have to convert all my home media to Apple MP4 or M4V format, but once done I am very happy with it.  The Netflix client is fast and easy to use, visitors no longer have trouble using my home media devices and having AirPlay to stream content, like movies, videos, or even just music is super convenient now.  I don't know how I managed before the AppleTV came along.  I highly recommend it to pretty much anyone, but if you have a lot of content in other forms (home media) converting it all over is a pain.  So its not for everyone.  But in any case, this is a great product, it can handle super huge HD Media files and even 3D.  I'm very happy with it.", "verified": true, "helpfulness": "1/1", "author": "Joe \"Joe Church\""}, {"rating": 5.0, "review": "My brother insisted that I purchase Apple TV and I'm so glad that I did. It's beautiful!! I also have a Netflix account that can be watched through Apple TV it's awesome and Perfection will be attained when AMAZON adds there movies. ( Hint-Hint)", "verified": true, "helpfulness": "0/0", "author": "Marcy"}, {"rating": 4.0, "review": "Apple TV mostly works as advertised.  It's a little quirky in our environment but what it can do it does consistently.  My students are able to quickly demonstrate their work to others as am I.", "verified": true, "helpfulness": "0/0", "author": "Tech Custodian"}, {"rating": 5.0, "review": "This is the second Apple TV that I have purchased. Easy to hook-up and use and always reliable. BUY APPLE!", "verified": true, "helpfulness": "0/0", "author": "Readicicco"}]