[{"rating": 3.0, "review": "We use it primarily for Netflix, and I have to find the movie on my computer and type it in to  the TV because this is hard to navigate", "verified": true, "helpfulness": "0/1", "author": "Mary Ellen Camden"}, {"rating": 5.0, "review": "Great product that we use with all of our apple devices! I would highly recommend this product to everyone I know.", "verified": true, "helpfulness": "0/0", "author": "William Ellis"}, {"rating": 5.0, "review": "I like apply tv and the options that it affords me. I am sort of an apply junkie and this just added to my collection and it works flawlessly. I would recommned this product to others.", "verified": true, "helpfulness": "0/0", "author": "Summer T"}, {"rating": 5.0, "review": "We gave it as a gift to our sons they love it. We would like to get one ourselves sometime.", "verified": true, "helpfulness": "0/0", "author": "Sally Kiekintveld"}, {"rating": 2.0, "review": "I like this product because of it's sleek design and air play feature. Otherwise, it's expensive, not a lot of streaming apps like redbox stream, vudu, only has sky news for live news. Apple needs to keep up with the video streaming app contents.", "verified": true, "helpfulness": "0/1", "author": "Monjur Alam"}, {"rating": 5.0, "review": "This is a very good product and I would recommend it for everyone.  It performed just as was described so i gave it a rating of five stars, it could not be any better.", "verified": true, "helpfulness": "0/0", "author": "Chipbuilder1"}, {"rating": 5.0, "review": "My son recommended this device to me so I could watch, from my iphone, on my TV. I was so impressed with the results that I ordered one for my daughter and her family for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Lawrence R. Edwards"}, {"rating": 5.0, "review": "It is the best ITV on the market.  I have had this for a year and works great.  Easy to set-up & interfaces are simple.  I loved it so much that I bought one for my brother.  I hope Apple adds Vudu and Amazon Instant apps and then no one would comer close to perfection.", "verified": true, "helpfulness": "0/0", "author": "Runner101"}, {"rating": 5.0, "review": "I have about five Apple TVs, and really love the new version that allows you to not only get iTunes media but also Netflix, Hulu Plus, HBO, ESPN and a bunch of other networks. Would love to see them add CNN or a news channel (other than BBC) to the lineup.  I can't give an opinion on how this compares to any of the other streaming devices, but I really love it.  Simple. Easy.  Actually follows the theoretical Apple philosophy of \"just works\" for once.", "verified": true, "helpfulness": "0/0", "author": "J. Rand"}, {"rating": 5.0, "review": "This product is so easy to use! I originally purchased a roku but could not get it connect correctly on my college network. I returned it and switched to Apple TV. This has worked out great with the new multi-monitor support with Apple's new Maverick OS. I have used it successfully with my macbook pro with retina display.", "verified": true, "helpfulness": "0/0", "author": "Ilyssa"}]