[{"rating": 4.0, "review": "I love this product, we can connect our apple products to the TV and can mirror whatever we are looking at.  It is great for showing off pictures to a large group.  You can also stream your videos from any apple products.  As a bonus you can also stream from your favorite apps. Great for the TV's that are not Internet ready and want to watch Netflix on it!  The negative i give it is that i wish the remote was a little bit bigger and easier to use.  There are only 3 buttons on the remote.", "verified": true, "helpfulness": "0/1", "author": "Anthony \"Anthony\""}, {"rating": 5.0, "review": "Excellent product on time delivery", "verified": true, "helpfulness": "0/1", "author": "Louis Finkelberg"}, {"rating": 5.0, "review": "I honestly was really hesitant on getting an Apple TV. I didn't think I did much aside from being able to watch Netflix and youtube and my iphone stuff (since my TV is not a smart tv figured this was best option either way) but this little thing has so many more features then I expected. Really worth getting it as you can watch all your Cable on demand channels, use any of your favorite movie/show apps, connect your iphone wirelessly, and listen to all your favorite music. The quality and wireless connectivity is seemless and great.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The module is working great, it's the remote that didn't make it past the second month.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Lauren Martin"}, {"rating": 4.0, "review": "It's good", "verified": true, "helpfulness": "0/1", "author": "extremepfs"}, {"rating": 5.0, "review": "Thanks for this item!!!", "verified": true, "helpfulness": "0/1", "author": "SANTIAGO YANEZ YANEZ"}, {"rating": 5.0, "review": "No doubt. One of best investments to see movies or similar from your mobile or ipad. Unbeatable.", "verified": true, "helpfulness": "0/1", "author": "Dr. Heinrich Brauner \"hörbuchwurm\""}, {"rating": 5.0, "review": "Love it!!!! I can't come up with the words to describe how convenient this device is. We have all of our movies off of you apple computer as well as all of our pictures and music. The best part is that we can access everything through our phones way easier than before!!! I love my new Apple TV", "verified": true, "helpfulness": "0/1", "author": "Mrs. Gray"}, {"rating": 5.0, "review": "Love our Apple TV box.  Great price!  Great to have HBO!", "verified": true, "helpfulness": "0/1", "author": "mathgeek"}]