[{"rating": 5.0, "review": "This device is a little larger than a hockey puck, yet it does so much more. Altough I do suppose you could play hockey with it. Wouldn't be the wisest thing to do, and probably doesn't meet hockey regulations. So, to those of you who relegate to using the Apple TV for media viewing here is my review.It's only connection is via HDMI. I tried a HDMI to DVI connector for an old TV and it didn't work. Apple TV has worked on all newer TVs i've tried using HDMI.You get Hulu, Netflix, and a few others. Sorry no Amazon Video with it... yet (hey Amazon take a hint - we want u on Apple tv).The Apple TV is very reliable, requiring almost no reboots. System errors are so rare that I've yet to encounter one. Software updates are occasional (quartely'ish) and do take about 15 minutes to fully apply.", "verified": true, "helpfulness": "0/1", "author": "PH"}, {"rating": 5.0, "review": "Its good item for ipad users.compact, easy setup and love it.I am enjoying to watch Youtube and movie with apple TV", "verified": true, "helpfulness": "0/0", "author": "Kanna"}, {"rating": 5.0, "review": "This is a great product that does everything that it is suppose to do . makes a great gift also... highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "To be honest we just hooked this up a couple of hours ago but we love it already. We were able to mirror our Macbook Pro screen onto our flatscreen with no problem. Now we don't have to look over each other's shoulder when perusing the net. The one downside that I see is that it looks like in order to play iTunes music we will have to pay about $25 a year for iTunes Match.Have not figured out how to do it otherwise. Also have not figured out if I can play my Amazon Cloud music either, probably not.All in all, we will probably not use the ROKU anymore, at least with this tv.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Wilkie"}, {"rating": 4.0, "review": "Very few apps. I wish apple allow to install apps from app store. The quality is great for sound and streaming.", "verified": true, "helpfulness": "0/0", "author": "Subhash"}, {"rating": 5.0, "review": "I have three of these throughout our house and we love them. We use them mostly to watch Netflix shows and movies as well as the more recent movies from the Apple store. The interface is super slick and easy to navigate. I just wish we could create shortcuts or favorites to minimize the number of clicks it takes to get to things we use frequently.", "verified": false, "helpfulness": "0/0", "author": "jacomstephens"}, {"rating": 4.0, "review": "I wanted to give it 5 stars, but the use of a key board on the remote would help a lot.My netgear streamer has one.Over all easy to use and install, movies stream fast really fast.", "verified": true, "helpfulness": "0/0", "author": "Just Saying"}, {"rating": 5.0, "review": "I expect for this amount of money, the product would exceed expectations....and it absolutely did. Apple products are wonderful...and it was packaged carefully.", "verified": true, "helpfulness": "0/0", "author": "Tamara"}, {"rating": 5.0, "review": "Great gadget to expand your viewing options and very affordable.  Great gift for those that already have wireless Internet in their home.  Easy install and setup -- we've added 2 to our house and will probably add a 3rd before long.", "verified": true, "helpfulness": "0/0", "author": "S. Terry"}, {"rating": 5.0, "review": "The ability to mirror with other Apple devices makes this product worth the money. No problems with set up or use.", "verified": false, "helpfulness": "0/0", "author": "new"}]