[{"rating": 2.0, "review": "* My main complaint is that it crashes and reboots itself a lot.  I thought that Apple products should not be such poor quality so I exchanged the first one for a new unit - but it has all the same problems.  I keep checking for software updates hoping they will fix some of the problems.Other issues include:* While streaming music from my Macbook air it will just stop playing sometimes.* While playing netflix movies the playback pauses often.  I don't have this issue with any of the other devices I use to stream netflix.* There is no volume control.  So I have to use two remotes to watch a movie.  Why?* The remote does not have good range and you have to point the remote directly at the front of the box or it will not work.* From my macbook air I can only airplay from itunes, not from any other app.  For example, using a web browser to access youtube.  The apple tv has a youtube app but it takes forever to type in a search one letter at a time so it is almost unusable.I could go on for a while longer but listing all the problems is making me tired.----UPDATE - Nov 2012----Apple released a new software update for the AppleTV recently and that solved almost all of the issues I was having. I also updated my macbook to the latest MacOS version. Everything works pretty good now!", "verified": false, "helpfulness": "1/4", "author": "Blade Doyle"}, {"rating": 5.0, "review": "Very compact and easy to install. As an Apple product, completely integrated with the others Apple products. The function mirroring for pictures and videos is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Mike Long"}, {"rating": 4.0, "review": "I'm a huge Apple (Steve Jobs) fan and I purchased this after I obtained several iOS devices so that I could AirPlay content. I also wanted to have a device that could connect to Netflix. So far, I do like the Apple TV but I do think there is room for improvement. Search can sometimes be slow since you have to go from letter to letter (Maybe a model with Siri will come out soon but who knows). Also, I'm bummed that my 2010 i7 MacBook Pro cannot AirPlay, that was a real bummer after I upgraded to Mountain Lion. Also, streaming speeds can be a little unpredictable, sometimes AirPlay or streaming content just doesn't work. All in all, it's good, maybe great, but not perfect.", "verified": true, "helpfulness": "0/0", "author": "Karnsy"}, {"rating": 5.0, "review": "The Apple TV is simple fantastic as all other Apple's products.I am a big fan of Apple and also the great Steve Jobs!!!!!!!!", "verified": true, "helpfulness": "1/2", "author": "Renato Rafael"}, {"rating": 3.0, "review": "This is a very nice product, easy to set-up,easy to use, but I am disappointed in the fact that this product is not compatible with Amazon content.", "verified": true, "helpfulness": "1/2", "author": "George Kolanowski"}, {"rating": 4.0, "review": "Knocked it down a star because there is little reason to own tha product but it worked as advertised. Early adopter product still IMHO.", "verified": true, "helpfulness": "0/2", "author": "Life-Long Entrepreneur \"Kenneth Ervin Young\""}, {"rating": 5.0, "review": "Meets all my expectations! I could not believe that I was able to purchase the new Apple TV for cheaper price than what many are selling the old one!", "verified": true, "helpfulness": "0/0", "author": "Pastor Shane Wall"}, {"rating": 5.0, "review": "This does everything its supposed to do and does it well! Very simple to set up, operate, and the quality is terrific. Shipping was fast and came earlier than expected.", "verified": true, "helpfulness": "0/0", "author": "randyb1858"}, {"rating": 5.0, "review": "It is a great product . I wish I could see my laptop on it too. Worth buying  apple tv.", "verified": true, "helpfulness": "0/0", "author": "Firoz Desai"}, {"rating": 2.0, "review": "As a Roku owner too, it became entirely obvious that the AppleTV is far inferior to the Roku box, and twice the price.  After purchasing, we plugged the AppleTV in and tried it out for a couple of hours, then unhooked it and right back into the box.  Thank you Amazon for being so good with returns.You are promised that the AppleTV will stream from your iPad or iOS devices, while this is partially true - it's not the whole story.  The Apple TV doesn't have Amazon Instant Videos on it, so I tried to stream my instant videos from the iPad to the AppleTV via AirPlay.... it connects just fine, but do to limitations, you are unable to stream the actual videos.The box overall just felt limited, there is no way to add channels, no way to add applications or anything to it.  It ends up as just a simple Netflix box.  Big deal.  The Roku has tons of channels plus you can extend it with PlayON to a heck of a lot more.  I can still stream my iTunes and what not through the Roku and it has a heck of a lot more to offer.  Overall, it's no contest.  AppleTV is nowhere near close to primetime.", "verified": true, "helpfulness": "1/4", "author": "Ryan Ellis"}]