[{"rating": 5.0, "review": "Why would anyone waste money on cable ever again? This changed my life, and saved me about $50 a month.", "verified": true, "helpfulness": "0/1", "author": "Tom K. \"Tom\""}, {"rating": 4.0, "review": "It is really good to be able to watch the content of my iPhone and iPad on the TV anytime.", "verified": true, "helpfulness": "1/1", "author": "Oscar Martinez Anzola"}, {"rating": 5.0, "review": "I was getting really sick of cable TV's exorbitant costs for channels that I will never watch in a million years.  So, I decided to cut the cable, so to speak, keep my internet connection, and opt for a pay-as-I-go media model.  Using Amazon Prime videos, primarily, and purchasing some shows that I want to watch, this has been great.  I'm saving big bucks and getting the programming I choose.It's a piece of cake to set up, and watching on my HDTV instead of my iMac is so much better.  I've read that if you already have Apple products in your home, this is the way to go, over Roku or other brands.  I don't know.  But, this works seamlessly.  The sound, the video, everything is better.  I highly recommend ditching cable TV.  It's old, gasping technology that will soon go by the wayside, as their greed will put them out of business.  Gotta love market forces.", "verified": true, "helpfulness": "2/2", "author": "Diane A. \"dusty dog\""}, {"rating": 2.0, "review": "So far I've had nothing but problems with Apple TV. Bad streaming or no streaming at all. These last few days the movies or shows I want to watch on HBO GO I'm not able to watch because of their server problems. This has been going off and on since I bought this a couple of months ago.When it finally does work, it's fine. Was it worth it for me to purchase? No. I'm wondering if anyone else has been having this problem?", "verified": true, "helpfulness": "4/4", "author": "Carlos C."}, {"rating": 5.0, "review": "The family loves it, no problems, and it is saving a bundle of money by not having to pay for cable.", "verified": true, "helpfulness": "1/2", "author": "Sylvia"}, {"rating": 5.0, "review": "Our family does a lot religious singing and reading on a daily basis and this device works perfect for us to put the music and scriptures up on the TV for everyone to read along.  Also for streaming video simply from an apple IOS or macbook it works great.  We have ours plugged in with ethernet instead of WiFi.  It's very small and sits behind our TV.  For the price and for what it does, it's worth every penny!", "verified": true, "helpfulness": "1/2", "author": "B Buyack"}, {"rating": 5.0, "review": "I was courious about why people like this device but now I am pretty sure why people like it. Since it is a very convenient device.", "verified": true, "helpfulness": "0/2", "author": "Vincent"}, {"rating": 4.0, "review": "This was a gift for my husband and we both love it.  Still finding out all the things it can do.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to use, great product. I love mirroring my iphone to the tv. Just writing more because I have to", "verified": true, "helpfulness": "0/2", "author": "Aucencio Arreola"}, {"rating": 2.0, "review": "Apple TV. Everything you love about Apple, plus TV - right? WRONG. Takes forever to download ANYTHING. We actually rented Star Trek this evening. PAID to rent it! It took at least 1 hour to \"download\" the movie, then quit an hour and a half in - said it needs another 8 minutes to \"catch up.\" This is absolutely ridiculous. Any program you try to open also takes a very long time to open. Netflix was far easier to navigate on our Wii, a lot less moving around from screen to screen, back and forth between seasons. Don't waste your money unless you have paid for all the extra Apple TV amenities, like sports and news channels. It's true that watching youtube and vimeo is nice but not worth the stress of the rest of it.", "verified": false, "helpfulness": "2/2", "author": "Jennae Miler"}]