[{"rating": 5.0, "review": "I love that i can mirror my ipad to my television. I also have to give kudos for the screen saver. Even if you don't have an an iOS device, Apple TV is an awesome upgrade to any TV that doesn't have wifi.", "verified": true, "helpfulness": "0/0", "author": "The Germ"}, {"rating": 2.0, "review": "Not exactly what I was looking for. I actually thought I was buying the apple tv2 and this was the 1st item that popped up looking like what I needed but it wasn't :(", "verified": true, "helpfulness": "0/1", "author": "aLexis"}, {"rating": 5.0, "review": "This is based on cloud. Cloud is where you have record of purchase with Apple iTunes store. If you purchased a movie on your computer, the APPLE TV allows you to watch it streaming into your TV. Requires internet in broadband capacity to really enjoy this product. Lets you watch Netflix and Hulu as well as Youtube and show flickr dot com slide shows. It has other features yet to tapped in and we are excited to say our household purchased two of these downstairs and upstairs. Apple TV is great to connect your iPad and iPhone to show on TV from different room to share with others and could be used in business situation to show your product video pulled from any youtube account and get the URL from iPhone or iPad while on wifi environment to display directly onto APPLE TV. It requires pairing prior to sending data on to the APPLE TV.", "verified": true, "helpfulness": "0/0", "author": "Parker Knight \"Photo Geek\""}, {"rating": 5.0, "review": "I am locked into the Apple Ecosystem and like it. Therefore this is an indispensable accessory. LOVE IT. Air Play Technology is awesome. I only wish that the Amazon Instant Video App  was not BLOCKED FORM USING AIRPLAY TO THE APPLE TV!! But Vimeo, Youtube, Netflix, iTunes movies all look great.", "verified": true, "helpfulness": "0/0", "author": "Need more books!"}, {"rating": 5.0, "review": "This is such an easy to use and necessary accessory to anyone that has a Macbook Pro, IPad or even Iphone.  The picture looks fantastic!  And it takes up very little space and uses almost no electricity.  Our Blu-Ray Player has not been turned on since we hooked up Apple Tv.  A couple of things to note before buying this product:1.  You must update your Macbook Pro Operating System to Mountain Lion to use it with Apple TV.  Mirroring will not work otherwise.  There is a cost of $20 to do this update and it will change your computer in many ways (including slowing it down and taking longer to boot up).  However, after using cords to connect my computer to my tv, I will take the bad qualities of Mountain Lion anytime.  The sound comes through crystal clear, picture is great.2.  Mirroring does not look very good coming from IPhone or IPad 2.But there are so many great things about this.  We are purchasing a surround sound system since it picks up the shared music on my itunes.Netflix looks great and HD comes through wonderfully.  I also love the \"Remote\" app on my iphone, which allows me to control the apple tv from my phone.  No need for a remote!!!! My wife and I can both have our own remotes and control the music, shows and pictures at the drop of a hat.With technology, comes convenience and this product made my life a lot easier.Thank you Apple", "verified": true, "helpfulness": "2/2", "author": "dickpimento"}, {"rating": 5.0, "review": "We got in our Apple TV and set it up instantly! The apple TV allows for access to Netflix and Hulu from the device through an app on there. I also found it was cheaper to just buy some of the seasons I love on iTunes than to have a bigger Dish package just to have that one channel so it has allowed us to save something like 200 dollars a year by looking at what we could buy or rent through iTunes and the channels and shows we currently watch. Hulu has access to tons of shows including the CW. We did have a slight hickup in doing the airplay from my MacBook Pro 2012 with the updated software. The CW website was having serious lag problems when it came to the TV screen. YouTube was also a little lagging from the computer to the TV screen through AirPlay. That is before I found the part where there's a YouTube app on the apple TV so you can simply search and show stuff through the device itself. I highly recommend looking at YouTube for people showing the device before you buy just so you know what it can do.In order to do AirPlay we did have to upgrade out software on our Macbook Pro 2012 but our \"New\" iPad's are already compatable and do the AirPlay brilliantly. One other addition when the iPad was hooked up the \"shown screen\" or the picture we were getting on the TV screen was smaller than the computer and when we just used the product itself. We have a wide screen TV. So it shrunk our TV quite a bit. You do have to pay for Netflix and Hulu if you want to use the services. Also I'll add in how the iTunes works. All your purchases are on there and accessible, but if you buy a season pass the show will show up one day later to be able to view. For example, my guilty pleasure Beverly Hill Housewives show's on the television on Monday's but I can't watch the show through iTunes until Tuesday. I think it's Tuesday at like midnight or early in the morning but it's always the next day even for American Horror Story. Hope this helps those that are curious about the apple TV.", "verified": true, "helpfulness": "2/2", "author": "reviewer"}, {"rating": 5.0, "review": "When I bought this Apple TV, I wasn't plan to watch that much streaming video/movies.  Since I had this unit, I have been watching movies on the TV instead on the iPad.  It is easy to set up and reliable.  It is also being used to share video amongst family.  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "AmazonBuyer33"}, {"rating": 4.0, "review": "Great device, especially if you utilize some of the Apps through the the Apple TV.  We are big Hulu and Netflix users and the integration is great.  Best feature is the mirroring.  We hooked one of the up to a small tv the the Kid's loft and we can be anywhere in the house and be able to stop or start their movie all while still being able to use my IOS device.", "verified": true, "helpfulness": "0/0", "author": "Trevor T"}, {"rating": 5.0, "review": "Im an apple junkie so why wouldn't I have this!!! I signed up for nextflix and canceled my cable saving me over $100 per month. Best purchase Ive ever made.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 5.0, "review": "ONE OF THE BEST APPLE DEVICES OUT THERE. Cant stop using it. LOVE APPLE FOR LIFE. YOU CANT GO WRONG WITH IT", "verified": true, "helpfulness": "0/0", "author": "Miguel A. Brizuela \"MICHAEL B.\""}]