[{"rating": 4.0, "review": "price was great", "verified": true, "helpfulness": "0/1", "author": "Thomas J. Kamenitzer"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "cole murray"}, {"rating": 5.0, "review": "Boom right out of the box awesome!  My personal test for high ratings is how long it takes to figure out a new piece of technology without pouring over the directions.  In this case Apple surpassed my expectations yet again. Love the product. Love the user friendly interface. Very happy with how quickly it went from new in the box to performing beautifully. I am impressed for sure.", "verified": true, "helpfulness": "0/1", "author": "Emily Stahmann"}, {"rating": 5.0, "review": "Awesome product. Can't wait for the next generation.", "verified": true, "helpfulness": "0/1", "author": "Jake"}, {"rating": 4.0, "review": "Probably the best device in its class. But Amazon Prime sometimes has a price advantage and Roku sometimes has a content advantage - just depends on what you are looking for. But hands-down the best UI in its class. Loses one star because you have to go so deep one the menu to put the thing to sleep. And because it seems to lose the wireless network after a week or so of inactivity. (Just requires a hard power down to correct but still a pain). I will say that wireless performance and picture quality are superior to my Roku box, HTPC and Sony network-connected Bly-ray for streamed content.", "verified": true, "helpfulness": "0/0", "author": "R. McGuire"}, {"rating": 5.0, "review": "what can say about a Apple product, it works, that all that needs to be said", "verified": true, "helpfulness": "0/1", "author": "Randolph Bagley"}, {"rating": 5.0, "review": "delivered quickly and fairly priced", "verified": true, "helpfulness": "0/1", "author": "rich"}, {"rating": 2.0, "review": "Product arrived in what appeared great condition. Was able to connect to tv and was able to power on thats when it became a problem. Got stuck on set date and time screen.Tried port forwarding as suggested and restore and reset option. Finally took to apple stor 40 minutes from where I live they swapped it out tested new one out there at store for me and brought it home and is currently working. not happy this was not plug andplay like its made to sound and it may be I got a bad unit that was trying to connect to time server and couldn't but this should not be something made this difficult.If you make a product to work on a local network in your home it shouldn't have to overcome so many obstacles to set up. And before anyone asks yes I did try troubleshooting everything suggested on Apple's cummunity board. Not a fun experience just glad its working now even though not original one I bought.", "verified": true, "helpfulness": "0/1", "author": "Jorge Garcia"}, {"rating": 5.0, "review": "Apple does it again. Easy of use and set up are indicative of Apple design.", "verified": true, "helpfulness": "0/1", "author": "Brandon Schadle"}, {"rating": 5.0, "review": "Product worked great and was in mint condition. Couldn't be happier.", "verified": true, "helpfulness": "0/1", "author": "Michael"}]