[{"rating": 3.0, "review": "It did not work with my Samsung 7150 Smart TV. The HDMI connection is fine as other devices are able to work with it. Kept getting \"No Signal\" message. Apple TV by itself may be great but did not work for me", "verified": true, "helpfulness": "0/0", "author": "Sanjay \"Sanjay Katti\""}, {"rating": 5.0, "review": "If you need a review of the Apple TV, then you must be living under a rock.  It's Apple.  It works.  And it's under $100.  Get one.", "verified": true, "helpfulness": "0/0", "author": "Pinchvalve"}, {"rating": 2.0, "review": "I watch YouTube on this AppleTV, a Playstation3, and Macbook. By far, the poorest performance is trying to watch any video using Air-Play from the Mac to this AppleTV device. Actually using the AppleTV YouTube app, is only slightly better.  Using my PS3 yields the best viewing. Air-Play is really bad. The video is jerky and freezes every 5-6 seconds. Impossible to watch anything.", "verified": true, "helpfulness": "0/0", "author": "Fleahead"}, {"rating": 4.0, "review": "Good item", "verified": true, "helpfulness": "0/0", "author": "Betty Hanlon-Deever"}, {"rating": 4.0, "review": "Only need to support usb, to see  a movie", "verified": true, "helpfulness": "0/0", "author": "Jose E. Morel"}, {"rating": 4.0, "review": "Despite my title, Apple TV gets a solid 4 stars. I bought this because I have Charter Cable TV and they want to charge an extra monthly fee for a 2nd cable box and service in another room. I figured if I bought this then I could watch CBS and NBC shows in my room. Nope, even with the free app, Charter cable has it blocked. So I'm basically just using this for Netflix. I do get ABC but not all the shows are on there, but that's ABC's fault, not Apple. I love the mirroring feature so I can watch HBO go on TV since charter too has that blocked on Apple TV, but the only reason why I can't give it 5 stars is Apple TV is not that intuitive. I've spent so much time in Apple community forums researching questions to certain features. I am an apple junkie with an iPhone, iPad and MacBook pro and I still had questions on this box. And unfortunatly the answer to many of my questions involves jail breaking the box. All in all this gives me the ability to watch some TV, but not all.", "verified": true, "helpfulness": "0/0", "author": "CHS \"Angel\""}, {"rating": 5.0, "review": "Get it. Love it. (Don't give Apple all your money)", "verified": true, "helpfulness": "0/1", "author": "BEST F'ING REVIEWER TO REVIEW"}, {"rating": 1.0, "review": "It sucks", "verified": true, "helpfulness": "0/5", "author": "frank szarafinski"}, {"rating": 5.0, "review": "Great if you dont want to pay for cable but still enjoy watching media now and then.", "verified": true, "helpfulness": "0/0", "author": "Jordan Dinardo"}, {"rating": 5.0, "review": "My refurbished Apple TV is absolutely PERFECT! The slightest bit of cosmetic \"damage\" but the truth is, this is just perfect. It works like a brand new Apple TV for a significantly less amount. Very deserving of these 5 stars, thank you very much!", "verified": true, "helpfulness": "1/1", "author": "Jensen"}]