[{"rating": 5.0, "review": "Great buy.", "verified": true, "helpfulness": "0/1", "author": "Alfredo Garcia"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Mike Gonzales"}, {"rating": 5.0, "review": "Very happy that we bought apple tvs.  Good performance and great build quality,", "verified": true, "helpfulness": "0/0", "author": "justplainsteve \"justplainsteve\""}, {"rating": 4.0, "review": "It is difficult to stream photos to the TV with Apple Software.  It doesn't work most of the time and is complicated.", "verified": true, "helpfulness": "0/0", "author": "Irving Becker \"Irv Becker\""}, {"rating": 4.0, "review": "Easy to use and navigate. I like how I can share my Iphone and laptop screens and they show on the TV. Downside, you can't pick and choose what applications you can use.", "verified": true, "helpfulness": "0/0", "author": "A. Heinrich"}, {"rating": 5.0, "review": "I am in love with my AppleTV! So many cool apps and easy to use! Definitely recommend this!", "verified": true, "helpfulness": "0/0", "author": "Maddie"}, {"rating": 5.0, "review": "Best thing I have ever bought. I have apple products so it is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mary Kay Reygers"}, {"rating": 5.0, "review": "Love this item.  We use it every single day.  It may not be a necessary component to those with smart TV's, but if you don't have a smart TV and want to access all the same apps and content that you can get on your phone or tablet, this is the device for you.  I love how it integrates with my Apple products so I can mirror my iPad and iPhone displays and pull picture and video streams automatically.", "verified": true, "helpfulness": "0/0", "author": "Hobbes World"}, {"rating": 5.0, "review": "REALLY happy I \"cut the cable cord\" and couldn't be happier with the switch to Apple TV!", "verified": true, "helpfulness": "0/0", "author": "C. Clay \"fur babies\""}, {"rating": 5.0, "review": "I should have purchased this as soon as it came out. We love it!!!", "verified": true, "helpfulness": "0/0", "author": "OsOBear"}]