[{"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Margarita Pais"}, {"rating": 4.0, "review": "I purchased this just for the Air Play feature. I own a Macbook Pro, Airport Express and iPhone so I figured it would be a good addition to the family. Only gripe with this is that it does not allow for the use of apps like Redbox or Amazon prime instead you are stuck with iTunes or Netflix for the most part. I suppose I could have a friend jailbreak it for me to add features. Easy set up and easy to navigate.  I suggest that if you are in the market for a", "verified": true, "helpfulness": "0/0", "author": "P. Hanlon"}, {"rating": 4.0, "review": "My Apple TV has been great for one and a half years.  Then whamm, it went black, quit working.  So I am going with Roku 3.  It has 3 essential programs I have wanted on one device ; amazon, vudu, and Netflix.  My daughter just told me I could put my itune movies on usb then watch them on roku 3 until I can find easy AND cost effective way to watch my iTunes movies.  I gave the apple tv  4 stars because when it worked it was very wonderful, clear clean picture.  I watched Netflix on Apple  instead of my  Sony  blu-ray because the picture quality was so markedly better.", "verified": true, "helpfulness": "0/0", "author": "N. Gunter"}, {"rating": 5.0, "review": "I use it to airplay content from my iPhone and Mac Air.  It works very well with video downloaded on my Mac Air.  Streaming video from Internet is not as smooth.  I suspect that has something to do with our internet speed.  I don't own other products similar to Apple TV.  For what I do this unit is very satisfactory.", "verified": true, "helpfulness": "0/0", "author": "Margaret S"}, {"rating": 2.0, "review": "Make sure you are in fact purchasing the 3rd gen.  Unfortunately I purchased this item last year and received the model number :A1378 which is the 2nd generation.For the same price you can purchase the 3rd generation that is model number: A1427 or A1469.Double check the model number on the bottom of your Apple TV when you receive it to make sure you are receiving the latest model.  I never thought to look until almost 8 months later because I figured all models were the same and now i'm realizing why I can only view movies at 780p because the unit I received was in fact the 2nd gen which only supports up to 780p and the 3rd gen supports 1080p.  Love the unit regardless however I wish I knew this when ordering instead of now figuring out the difference in model's that are being sold online.", "verified": true, "helpfulness": "4/4", "author": "starbux \"starbux\""}, {"rating": 5.0, "review": "The appletv is so underrated - it's a game changing device in my book.Tip* if ordering on Amazon, connect device to Internet and then update the software first thing!", "verified": true, "helpfulness": "0/0", "author": "Keynote Capital"}, {"rating": 1.0, "review": "Using 5 gen 3 Apple TVs in my house for about two years now, bugs with Airplay were never fixed... not with the latest update and connected to the latest AirPort extreme too. Playback drops, stutters, loses connection from time to time, you'd expect better from Apple...", "verified": true, "helpfulness": "10/11", "author": "Eiríkr"}, {"rating": 4.0, "review": "I'm a prety heavy series-watcher and could handle a year and a half without cable due to the amazing combo: Netflix + Apple TV.This add on is awesome specially because of how easy it is for you to use it.The remote control is unbeliavable minimalist (as anything apple does) and intuitive.Among its several features it has Netflix. Together with the radios, Youtube, news and etc it could keep you busy.I really believe it is worth saying, thought, that if you don't have a Netflix account or has a TV that already accesses Netflix with no problems, is not really worth it.", "verified": true, "helpfulness": "1/1", "author": "Amanda Kassick"}, {"rating": 5.0, "review": "Good product, use it everyday.", "verified": false, "helpfulness": "0/0", "author": "Monica Yu"}, {"rating": 2.0, "review": "Cant figure out how to get it to work with my tv? I followed the instructions to hook it up and I can't get it to work. Do I need a subscription? Do I need cable? I don't want cable. I have a Samsung 55UN9000 LED LCD with a Clear TV antenna hooked up and I get plenty of local HDTV and DTV channels that come in so crystal clear I wouldn't get cable again. The definition is unreal and in 3D imaging comparison (like). So, anybody out there, please help me figure out how to get this Apple TV working! I'm an audiophile guru and know my TV's pretty well but, this thing has me baffled???", "verified": true, "helpfulness": "0/2", "author": "RockDoc"}]