[{"rating": 4.0, "review": "Just an issue if you have to type word by word on screen and navigate thru ABC onscreen keyboard, if you have an ipad o mac runs great, just select apple tv and goes to your main screen.", "verified": true, "helpfulness": "0/0", "author": "Eliecer Acevedo"}, {"rating": 5.0, "review": "When you buy something form apple what you get is qualityfrom packaging to performance everything is very good with Apple TVand every body knows about Apple TV so writing a review is pointless , However there are some issues that may be useful to some people1. you can not compare this to chrome cast , Roku , Amazon fire , Google TV and others the main difference is this is not only a smart tv it is a mirroring device that works perfectly with apple systems , you don't need to install anything on your iphone or computer to access it  and mirror everything very easy on your tv2.the only issue that this device has is when you mirroring your computer and you streaming a video like abc , cbs the result is not that perfectyou will get some freeze every 10 seconds , but this has a solution you have to use a high band wifi when you are doing thisThis means that with your old router you will only be able to mirror your phone , or play something from your computer (not streaming)(my router is now a 60mb n type router)I wish this worked with every other computers and phones , that's the only problem that This device has", "verified": true, "helpfulness": "2/2", "author": "fixXxer"}, {"rating": 4.0, "review": "It's a great streaming device and I love it's compatibility with all things Apple. We own an iMac, MacBook, 2 iPads and 2 iPhones, so it was a natural choice. The mirroring function is fun and easy, and I love that it syncs with my iCloud photos. We use the photos as the screensaver. The only issue I have is that it doesn't play Amazon Prime videos. Sad Face. But we just play them on our iPad and mirror them to the TV. Problem solved.", "verified": true, "helpfulness": "1/1", "author": "saradada"}, {"rating": 5.0, "review": "I finally purchased the Apple TV. We love it! We got rid of my cable TV due the fact that we rarely watch shows when they actually aired. We DVRed every episode. We dropped cable and went with Netflix and Hulu Plus. We went through FPU and we are now saving lots of money by getting rid of our cable. Being able to access iTunes and also mirroring from my iPad and laptop are really great features. We Love our AppleTV and We would highly recommend to anyone!", "verified": true, "helpfulness": "2/2", "author": "ron tiller"}, {"rating": 5.0, "review": "I love the apple TV!  It is very handy for showing your screen on the tv, plus it has an awesome Netflix app!!  I bought one for my grandparents and they loved it as well!", "verified": true, "helpfulness": "0/0", "author": "CLEnat"}, {"rating": 2.0, "review": "I bought an Apple TV when there were fewer options on the market for a streaming device (no Chromecast, no Amazon box, fewer Rokus) and since then it has been utterly eclipsed in functionality, reliability and price. Many of the functions require you to be using ONLY Apple products, and NEWER Apple products. My 2009 Macbook Pro (with updated software) cannot mirror screens to the Apple TV. But that is far from the worst of it.Apple TV will not allow you to install newer Apps, so there is no Amazon Instant Video, no internet browser or any other useful apps. You can stream from your iOS device, but it is slow. The remote app for iPad or iPhone seems like something that was made in an afternoon and then forgot about for years. Useless.My top issue with the Apple TV is reliability. Almost half the times I try to stream Netflix I get errors or the connection drops out. Buy a Roku. Or a Chromecast. Apple TV is an outdated, forgotten product.", "verified": false, "helpfulness": "0/2", "author": "TheConman"}, {"rating": 5.0, "review": "I love all my Apple products AND Microsoft as well.  Apple TV kicks the butt of all the other streaming devices including PS3, roku, and all others.  I stream from a recent year Netgear router in the $80 range and wirelessly with NO ISSUES and rarely any hiccups.  Netflix, PBS, HULU, and the dozen or so channels all perform flawlessly.", "verified": true, "helpfulness": "1/1", "author": "S. Justice"}, {"rating": 5.0, "review": "Since buying Apple TV I have barely watched my cable! Netflix quality is awesome, and also HBOGO has more back-seasons than regular cable. Bring able to access iTunes and also airdrop from my iPad are really great features. Worth very penny and I would highly recommend to anyone.", "verified": true, "helpfulness": "2/2", "author": "shoecrazy"}, {"rating": 5.0, "review": "What can I say, it's an apple product", "verified": true, "helpfulness": "0/0", "author": "OP"}, {"rating": 4.0, "review": "I have several ways of watching videos including SageTV, MCE, Roku, Ceton, and AppleTV.  I like the Netflix application on the Roku better than what is installed on the Apple TV (it automatically goes to the next show in the series).  HBO Go seems to be about the same.  But, neither device supports Cinemax Go so I have to stream that from my iPhone.  And that is where the Roku cannot compare to the Apple TV.  Airplay is a great service supported by the AppleTV that lets you stream video from your iPhone/iPad to your TV.  The quality is great.  I also use AirPlay to watch ShoAnytime.  The price is practically impulse buy, but the rumor is that Apple will release a newer, more powerful version soon that might include apps.", "verified": true, "helpfulness": "2/2", "author": "hornms"}]