[{"rating": 1.0, "review": "Horrible product! Loose connection ALL THE TIME!!! Don't waste your money on this one.", "verified": true, "helpfulness": "1/2", "author": "Brian L."}, {"rating": 5.0, "review": "A great device to bring more content to your tv.", "verified": true, "helpfulness": "0/0", "author": "William Schrader"}, {"rating": 5.0, "review": "Love it... I have one in every room except those with Smart TVs!", "verified": true, "helpfulness": "0/0", "author": "ShoeLover"}, {"rating": 3.0, "review": "it had a lot of trouble connecting to wifi and would buffer constantly. I am aware i could consider it my own fault for needing a better router. but i purchased a roku 2 which worked flawlessly. i also looked forward to jailbreaking it and installing kodi, but this is not possible with and appletv 3. this isnt a bad streaming set top box, but there are better ones out there.", "verified": true, "helpfulness": "1/1", "author": "CristianG"}, {"rating": 5.0, "review": "great product I used it every day. I only have issues when the software is updating but thats very seldom.", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 5.0, "review": "learning to use it more", "verified": true, "helpfulness": "0/0", "author": "y"}, {"rating": 5.0, "review": "Love the Apple TV. Being a house of iPhone and iPad users streaming from our devices to the Apple TV is easy and always works great.", "verified": true, "helpfulness": "0/0", "author": "Lindsey Ramirez"}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "Cindy Laughlin"}, {"rating": 2.0, "review": "Screen sharing from an ipad looks horrible.", "verified": true, "helpfulness": "0/0", "author": "helmer meza"}, {"rating": 5.0, "review": "Love it! it has a great look and feel. It's easy to use too!I previously had a Roku, which I really liked, but after using my Apple TV for a week, I sold the Roku last night.", "verified": true, "helpfulness": "0/0", "author": "G.L"}]