[{"rating": 5.0, "review": "Works fine , and offers a lot of entertainment value for little cost.  I am just learning how to use it the best way", "verified": true, "helpfulness": "0/0", "author": "Max T. Nigh \"Max Nigh\""}, {"rating": 5.0, "review": "If you don't have an Apple TV, time to remedy that! So easy to set up and so convenient to watch anything on your TV that can access on your computer.", "verified": true, "helpfulness": "0/2", "author": "zoogrrrl"}, {"rating": 5.0, "review": "I bought this because of the appeal of sharing my sizable library with the big screen in our living room. The setup was a pain because of trying to use the remote for the pass-phrase, but the device has never overheated or ceased to work.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "I love AppleTV. This thing gets way more usage than our cable box or any other system. Watch Netflix, HBO Go, Hulu, and stream content from your iTunes.", "verified": true, "helpfulness": "1/1", "author": "mooseswamp"}, {"rating": 5.0, "review": "I love that the Apple Tv connects with all my other apple products (airport, iPhone, macbook, etc) and I really like the airplay function for games and music. I've had other smart players with the same apps, but the Apple TV works so much smoother and loads faster than Roku or my smart Blu-Ray, which is great! I'm also really glad I can stream all the movies and tv shows that I've bought in the past, that I don't keep on my hard drive, which saves a lot of precious space on my laptop (which I almost never use for watching TV). Most of all, the definition of the streaming quality is very good. I have it hooked into my bedroom TV right now, which is old so I can't say it's super HD yet, I still need to put it to the 1080p test...but I'm confident that it'll pass. This is a great addition to a high quality Tv's, because the new smart tv's are often a bit slow, and can't connect to other devices the way Apple Tv can. All in all, it makes life a bit easier and my TV watching experience a bit better!CON: The remote is pretty small and sleek, but I often find myself needing to type something in, and it's a total b**ch! I downloaded the remote app to type stuff in, but I don't really like it, sometimes my phone is unreachable! Mostly, I'm usually too lazy to find my phone and open the app. You can connect a bluetooth keyboard, but  I don't want a whole keyboard to sit around, I just wish they had a small remote with a qwerty keyboard on the back to make things easier.", "verified": true, "helpfulness": "0/0", "author": "TT"}, {"rating": 5.0, "review": "I love having the apple computer for my television.  It is easy to use and very convenient compared to connecting my laptop to the television through the HDMI cable.  I have had some problems with the connection and apple being unable to upload or connect to the server.  Customer service recommends keeping the apple computer on your t.v. stand or shelf away from the modem and sound bar.  There seems to be interference with the connection and apple computer will not connect.  Frustrating.  I didn't think I would have to worry about where to put the little box, but apparently apple is sensitive!! I would recommend this product, but just be careful where you place it to prevent any connection issues.", "verified": true, "helpfulness": "0/0", "author": "Tiffany M. Ramos"}, {"rating": 2.0, "review": "I received this as a second-hand gift.  I won't buy another Apple product and this one reminds me why. Unlike my Roku, this one will not allow me to watch content from Amazon Prime instant streaming.  Netflix works OK, but if I want to purchase and view content from iTunes, I have to download the entire content before it will play.  Usually, this means downloading today to watch tomorrow.  One movie that my sister purchased, we were never even able to watch.  Apple's restrictive policies are keeping me away for good.", "verified": false, "helpfulness": "3/7", "author": "Jumbl User \"transport modeler\""}, {"rating": 5.0, "review": "I finally decided to buy an Apple TV even though I have a blu-ray player that supports the usual apps.  Our family has a lot of Apple products (Macbook Pro, iPad, iPhones, ect), so this thing really added to the collection.  To me, the biggest advantage was the AirPlay option.  If you have an iOS device, being able to mirror what you have to your TV is truly amazing.  It's fast, intuitive, and very appealing.  The Apple TV is small, energy-efficient, and has been a great addition to the Apple family.  As other people have said... if you have multiple Apple products in your home, this is a no-brainer to purchase.  If you don't have them, I'd probably recommend going with a Roku or some other streaming tv device.  I think I'll be able to get rid of cable after using this thing with Hulu and Netflix.", "verified": false, "helpfulness": "0/0", "author": "Williams"}, {"rating": 5.0, "review": "The Apple TV UI is significantly better than the UI for streaming apps on my Sony DVD player. It starts up quickly and streams HD HBO GO and Netflix without any lag. I don't have an apple device but just for streaming, it's been great.", "verified": true, "helpfulness": "0/1", "author": "rabidRaccoon"}, {"rating": 5.0, "review": "I don't have any complaints, easy installation (it's an Apple) product! Once plugged in and did my settings it was ready to go.", "verified": true, "helpfulness": "0/0", "author": "Karen P. Young \"odyssey reader\""}]