[{"rating": 5.0, "review": "just like described", "verified": true, "helpfulness": "0/0", "author": "Gustavo Gomez"}, {"rating": 1.0, "review": "The information provided by Amazon is misleading:1. For four days I did not find a way to stream anything from my PC (Windows 8.1) to the Apple TV. I even installed a trial version of a software that appeared to be for receiving streaming from Apple products but not to stream from the PC.2. Apple laptops produced before 2011 most probably do not support AirPlay and cannot stream to Apple TV.The product can play directly streaming services from the Internet like Netflix, YouTube and does it well but there is no reason for someone who has a smart TV to buy Apple TV for the same functionality.", "verified": true, "helpfulness": "1/2", "author": "David BenJoseph"}, {"rating": 5.0, "review": "very good. But it takes 35 days to reach me in Beijing", "verified": true, "helpfulness": "0/1", "author": "Fuwen Bai"}, {"rating": 4.0, "review": "can not be jail broken. Had to bail it out.", "verified": true, "helpfulness": "0/2", "author": "Deepwest"}, {"rating": 5.0, "review": "I now watch about 95% of my television through Apple TV. What did I ever do before owning this?", "verified": true, "helpfulness": "0/1", "author": "Hannah Singer"}, {"rating": 5.0, "review": "It is very difficult to buy inexpensive Apple product and accessories from Amazon because the reviews usually do not identify the precise vendor or model number in possession of the reviewer. As a result, you may be reading a review for another version of a product than the one you are considering buying. This issue is rampant in the earbud category to this day (to the extent that it is not clear that there is ANY vendor on Amazon that sells true Apple earbuds despite their many claims) and also seems to affect this product: This review is for the model MD199LL/A, currently (as of 11/30/2014) advertised as \"Current Version.\" First, this model is NOT the current version. The current version is model MD199KS/A and if you want that model then you must search specifically for it by model number.That said, this is a wonderful device which I have enjoyed for almost 2 years. I am now in the market for another one as a gift, but it will not be this particular device because it is two years old.", "verified": false, "helpfulness": "6/7", "author": "Gary L. Kellogg"}, {"rating": 5.0, "review": "I am giving this to my mother for Christmas. It was supposed to arrive in 5 days, but low and behold, it came in today. So far I am very impressed and am excited for her to be able to use it.", "verified": false, "helpfulness": "0/0", "author": "Emmalee Marino"}, {"rating": 4.0, "review": "Glitchy. I love Apple products but this is sub par. Have to keep restarting.", "verified": true, "helpfulness": "0/0", "author": "BE"}, {"rating": 5.0, "review": "I couldn't get this to work on Amy of my tv therefore I think my internet connection wasn't fast enough", "verified": true, "helpfulness": "0/0", "author": "Leean Ozanich"}, {"rating": 5.0, "review": "None", "verified": true, "helpfulness": "0/0", "author": "Greg L."}]