[{"rating": 4.0, "review": "Neat. Minimalistic. Cool. Would probably get lost in a move it being so small but nicely built. Probably get another", "verified": true, "helpfulness": "1/1", "author": "khaim korii"}, {"rating": 3.0, "review": "Use it but it is not as user friendly as my d-link media server. Like most Apple products totally focussed on the Apple platform. Great to mirror the computer but if used for downloaded movies those have to be actually started on the computer ( unless they are in the i tunes library of course ).", "verified": false, "helpfulness": "0/0", "author": "aston m"}, {"rating": 4.0, "review": "I bought the Roku a couple of years ago and loved it.  I bough the Apple TV because I really wanted to be able to mirror my apple products in my house. so we moved the Roku to the basement for the kids and have the Apple TV in the main living room.I like that I am able to sync everything up. and it was easy too.  I wish that I was still able to access all the different channels like you can on Roku - like TEDtv. on the flip side, I like that you can view YouTube easily on this device. so there are pros and cons.Overall, I like the Roku and AppleTV equally, they just each have their own benefits.  both stream well and rarely ever an issue.", "verified": true, "helpfulness": "1/2", "author": "vyk"}, {"rating": 5.0, "review": "I was unsure about this product when my husband got it, but it works great! The internet works better through it than my TV or DVD player and I love showing my iPod screen on my TV. Excellent purchase!", "verified": true, "helpfulness": "1/1", "author": "corsue"}, {"rating": 3.0, "review": "Does not work with Amazon Instant Video App!  I would not have purchased it if I had known this.  Bummer.", "verified": true, "helpfulness": "6/8", "author": "Scott"}, {"rating": 1.0, "review": "the apple tv is like an ipod touch or an iphone, but without screen. In this case the tv is your screen. You can stream from iTunes of your computer directly over this device to your tv.what i dont like about it...- there are no apps you can install directly like on the iPhone or iPad- The streaming from games (screen duplication) lags from iphone and iPad, so gaming is not possible (solution - bluetooth connection? between the devices? Game runs on the apple tv!?)- it's cheap, but you can not do more than viewing pictures on it to be honest....My solution....i switched to a  http://amzn.to/11mxK92and attached it to my TV with wireless keyboard and mouse", "verified": false, "helpfulness": "1/5", "author": "Mr. K"}, {"rating": 4.0, "review": "I love this thing and I only wished I had bought one sooner.Could use some more services such as amazon, hbo go, etc.I suggest you go get one of these right now!", "verified": true, "helpfulness": "0/1", "author": "Redbeard"}, {"rating": 5.0, "review": "i can play all my itunes movies and i use it alot for netflix. also use it for pics and airplay", "verified": true, "helpfulness": "0/0", "author": "chad"}, {"rating": 1.0, "review": "We order this because our kids have it and love it. Nowhere did it say that we couldn't use it without an HD tv. I realize most people have updated their tv, but as ours still work, we haven't wanted to spend the money yet, so it wouldn't work. I hope, sometime to update and then would love to have an Apple TV, but also think Apple needs to be clear about what tv they WILL work with in the future!", "verified": true, "helpfulness": "0/4", "author": "Myra Moritz"}, {"rating": 5.0, "review": "After getting this and using it for a few months it became very apparent to me that I could finally cut the satellite. One thing I would recommend is either having an iphone or an ipad.  With either of those devices you can Airplay them on to your TV and watch pretty much any network TV show you want.  The other feature I love that I didn't expect was that all the music and movies you have in iTunes is available to play on the device.  I love this thing!", "verified": true, "helpfulness": "0/0", "author": "R. Gunn"}]