[{"rating": 5.0, "review": "If you have an IPhone this is a must purchase. It unlocks a great deal of content for your entertainment center. Plays your music from your phone or your music library on your computer through itunes. You must have a wireless network of course. Check it out.", "verified": true, "helpfulness": "1/2", "author": "TBONE"}, {"rating": 4.0, "review": "It's a very good media streamer to Tv, it's biggest strength Is airplay and mirroring for any ios device like iPhone or iPad to Tv. Literally it's like having all the ios apps on Tv. Although I miss CEC feature of automatic Hdmi switch which chromecast has. Mirroring of games is not that smooth on tv, occasionally it jerks. It's must device for anyone having any other apple device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It is a typical Apple product (I own and have owned many Apple products: Iphone's (now using Iphone 5 and loving it), Ipod's, Apple laptop, Ipad's (when will it get a USB port?) and it looks and feels great.  Packaging is beautiful and the menus on TV are easy to use and easy to navigate.  I was about to absolutely love Apple TV, until I tried to get Netflix on it to work.  Got an error message on my TV about the HDCP security protocol.  Did some digging with Google and found pages and pages of people having problems with this.  Come to find out that most TV's built before 2010 do not have the HDCP protocol built-in.  The Apple TV did work great on my 2 newest TV's that both have Wifi and internet TV built-in already.  Kinda defeats the purpose of buying Apple TV doesn't it?  I wanted to use the Apple TV to get one of my TV's that did not have Internet built-in online.  Apple completely missed the mark here.  Who would buy an Apple TV device that only works with newer TV's, of which most already have Internet TV built-in.  Those TV's don't need Apple TV.  Naturally, I tried the Google Chromecast device and it worked great.  Within 2 minutes I had the Google device up and running.  Apple 0, Google 1.", "verified": true, "helpfulness": "10/18", "author": "Gerrit Oonk"}, {"rating": 5.0, "review": "I bought the unit for the TV in our family room. Since we are heavily invested in Apple products (iPhones, iPads, and MacBooks), it is a perfect fit, and does an amazing job streaming from a remote iPad, iPhone or Mac. I highly recommend this, especially if you own other Apple products!", "verified": true, "helpfulness": "0/0", "author": "Dirk G. Payne"}, {"rating": 4.0, "review": "Very easy set-up.  Great functionality.  Very fast switching between different programs.Once downside is with the software.  No way to randomly use photo slideshow without repeating pictures over and over.  Seems like an easy fix, but unfortunately Apple can't/won't fix it.  Otherwise, very nice.", "verified": true, "helpfulness": "0/0", "author": "AG"}, {"rating": 5.0, "review": "Now she can hook up her IPOD to the TV.Yes we would recommend this product to other people.  Cuz its awesome.", "verified": true, "helpfulness": "0/0", "author": "t.stephenson"}, {"rating": 4.0, "review": "I love apple TV.  I have an Iphone and an Ipad so I really love the compatibility and mirroring features.  Its great to watch netflix, youtibe,etc.  I would have given it 5 except my remote broke and it was pricey to replace.  Although you can make your phone/ipad the remote...", "verified": false, "helpfulness": "0/0", "author": "Mayfair Delights"}, {"rating": 5.0, "review": "The Apple TV's that are selling for $250 are the ATV2's, NOT ATV3's. The ATV2 is only 720p, but can be jail broken, allowing the user to add additional apps not available on the ATV3, which cannot be jail broken. I have had an ATV2 for almost 3 years now, and have it jail broken with ATV flash which allows me to do quite a bit that the ATV3 cannot do.  I paid $99 when i bought mine, and would not let it go, even for $250. The scarcity plus increased functionality has driven the price up.", "verified": false, "helpfulness": "26/33", "author": "T. Williams"}, {"rating": 3.0, "review": "I mainly bought it to use it with AirPlay, mirroring local video files on my MBP.  After a few minutes of usage, keeps freezing.  Tried several times and the issue is consistent.  Couldn't be bandwidth issue on my local network/router, as all other devices are working fine when this issue is occurring with Apple TV.  Just returned it.", "verified": true, "helpfulness": "1/1", "author": "netshopper"}, {"rating": 5.0, "review": "Works great, could tell this was brand new, bought this right before black friday when it went on sale for another $10.00 off, contacted amazon and they refunded me right away. All in all, got this $15.00 cheaper than apple.com", "verified": true, "helpfulness": "0/0", "author": "Danielle S."}]