[{"rating": 5.0, "review": "Love Apple TV- lots of choices and there are a lot of free programs available.  Some of the movies that are a lot older have ridiculous charges but there are still a fair amount of shows.", "verified": true, "helpfulness": "0/0", "author": "Slee8391"}, {"rating": 5.0, "review": "Wow its perfect! I can watch my favorite shows, movies, music all in just one! Excellent product! I loved it", "verified": true, "helpfulness": "0/0", "author": "katia"}, {"rating": 5.0, "review": "I honestly have Never types an online review but given my trouble with trying to go with a competitor for the Appl e TV i felt compelled to write this. Hands down this device beats the Roku in functionality.  And with Roku only willing to support a 90 day warranty, tells you they aren't proud or willing to back up their technology either. Just do a quick eBay search for Roku 2 and look at how many are for sale due to this. Then look at how many Apple TV's are up for sale, people just keep them because they WORK!", "verified": true, "helpfulness": "0/0", "author": "Sny D"}, {"rating": 5.0, "review": "What can I say ... I love Apple TV. It's just so easy to pop pictures, movies, whatever to your TV from your iphone, ipad or your Apple computer. This is a must have item if you are an Apple device user.", "verified": true, "helpfulness": "0/0", "author": "sue chi \"sue\""}, {"rating": 5.0, "review": "can't go wrong with an apple tv. i own a couple of these and a roku to get into my amazon videos.  but some movies come out earlier on these platforms and that is the reason why i have both.  no late fees anymore with movies.  and i get my netflix", "verified": true, "helpfulness": "0/0", "author": "I need to return some video tapes"}, {"rating": 5.0, "review": "This Apple TV has everything you every wanted. And why is it better than the Amazon Fire TV, and better than the Roku? The reason is because it offers something that NO OTHER DEVICE OFFERS: Accessibility services for the blind. APPLE TV can be set to talk to you, everything that is on the screen! Blind people, millions and millions of blind people can use this Apple TV perfectly! It's an amazing product.The Amazon Fire TV and ROKU devices is completely crap and doesn't allow anyone with disabilities to use their product. SHAME ON THEM.BUY THE APPLE TV, support Blind people world-wide and get the best TV unit ever invented. No kidding.", "verified": true, "helpfulness": "2/2", "author": "J. Johnson"}, {"rating": 3.0, "review": "If you are looking for a streaming box and use Apple products, the AppleTV is the way to go.  The processor is not the fastest in its class.  It doesn't offer the largest variety of channels (though there are rumors this will change in the near future).  But, if you have other Apple products (iPhone, iPad, laptop) you can use the Airplay feature to project whatever is one your device onto your TV through the AppleTV.This helps to cancel out the lack of channels.  The feature does not work in all instances.  There are certain apps that do not allow the use of Airplay (the March Madness app is one example).The Roku 3 has more channels and a faster processor, but it does not have an airplay feature.AppleTV also works best when connected via Ethernet as opposed to wi-fi.The appearance is small and discrete but requires sightline for the remote to work. Also, concerning the remote, if you have an Apple laptop the remote controls the volume on your laptop.  This may be an added bonus unless you are on your laptop and someone else is browsing through shows on the AppleTV.  Your volume will increase and decrease with the familiar *blip* each time.  This gets old quick.  I've given up on using my laptop and AppleTV in the same room unless I'm Airplay-ing something from my laptop.All-in-all it isn't bad.  Definitely worth it if you already use Apple products.  If you aren't an Apple user you're best suited to use a different product.", "verified": true, "helpfulness": "1/1", "author": "Dave"}, {"rating": 5.0, "review": "I'm no techno wizard but I can tell you this ... if you have a hard time with your WiFi connection while trying to view a streaming Netflix movie, this is what you need ... now that I've installed my Apple TV not one movie was interruped with annoying message \"There's a problem with your Wifi connection, try try again\".", "verified": true, "helpfulness": "1/1", "author": "Kathy Gail"}, {"rating": 5.0, "review": "I can watch Netflix and YouTube... TV is overrated. I can also mirror my I Phone which streams anything on the internet :D", "verified": true, "helpfulness": "1/1", "author": "Ada Castellon"}, {"rating": 5.0, "review": "This simple to install and use device has significantly expand our viewing choices. Recommend it to anyone who wants to no longer be tied to network TV.", "verified": true, "helpfulness": "0/0", "author": "Gerald N Rhodes"}]