[{"rating": 5.0, "review": "I've just recently got into the Apple universe with my iPhone 4S and my New iPad.  I truly love how well they both work with the Apple TV.  The only thing Apple doesn't have that i use is Amazon Primr, but otherwise I have no complaints.", "verified": true, "helpfulness": "1/1", "author": "HattieLou"}, {"rating": 5.0, "review": "We purchased this to replace our Roku player and it was by far the best decision. It is much more user friendly and it also streams quicker with less lag time and buffering. On the Roku it was constantly stopping during play to buffer or load and we rarely have that issue with the Apple TV.The layout is also extremely user friendly and actually makes logical sense compared to the Roku which had a horrible layout.Also the Roku would always freeze up and become unresponsive if you pressed one too many buttons, and would force you to unplug the entire device in order to reset it. We have never had to do this with the Apple TV.Best streaming device!", "verified": true, "helpfulness": "0/0", "author": "S. Millspaugh"}, {"rating": 3.0, "review": "I bought this as an upgrade to my old first generation 160GB Apple TV. In some ways, it is an inferior product. I get to that at the end. I'll talk about what I like first.The good: The unit is small, light and doesn't act as a space heater like the old hard drive based Apple TVs. It has a pretty easy to use interface and supports full HD (1080p) video. Airplay is a great feature! I prefer hard line connections for security and the unit supports fast GBit Ethernet. I'm a heavy iTunes user, so the content side works fine for me, but I have heard complaints about access to other content providers.The bad: The new Apple TVs do not support iTunes Extras! WTF!!!!!! You can watch movies, but you can't watch the iTunes Extras that come with them on iTunes. One of the most ridiculously stupid things Apple has ever done. Nobody wants to watch a movie on their TV and then go sit at their computer to watch the bonus features. Also, the lack of internal storage means your computer must be on and iTunes open for the Apple TV to work, or you have to subscribe to iTunes Match (at extra cost). With the improvement in flash storage, this thing should have at least 8GB to store music and a little video so you don't have to boot up the computer just to hear some tunes while you're cooking dinner. While the interface isn't bad, it is inferior to the interface on the old Apple TV. The older version was much more fluid and easy to use.", "verified": true, "helpfulness": "2/4", "author": "Floyd L. Devine \"Devo\""}, {"rating": 5.0, "review": "I wish every techie item was this easy to set-up and get working!  Works well with my 60 inch Sony.  I can't believe the picture quality in HD from Netfix over the WiFi!  Wow.", "verified": true, "helpfulness": "2/3", "author": "KennyM"}, {"rating": 5.0, "review": "A new world this product. I can do a lot of thinhs, see film, watch my own photos, look for music, enter in a new Apple world. Great product and cheap. i am very happy and satisfied. Easy to intall and do a lot of things.", "verified": true, "helpfulness": "1/2", "author": "Rick"}, {"rating": 4.0, "review": "So far, the Apple TV is working well. I already cut the chord with Comcast! Only wish is that the Hulu app had continuous play.", "verified": true, "helpfulness": "1/2", "author": "Liz"}, {"rating": 2.0, "review": "I bought this primarily for Airplay from my iPad, but also from my MacBook Pro.Apparently, my MacBook, even with the latest OS X Mountain Lion, is not capable of Airplay.  What???  Something to do with the WIFI strength, or Apple wanting you to purchase a newer Mac.  I installed software called Parrot, but the delay from the laptop to the Apple TV was unusable.From my iPad, Airplay worked pretty well, but sometimes would be slow to respond or would stop in the middle of a presentation.  Really not good.With iOS 6, Apple also updated the Apple TV software.  Airplay now works much better.Streaming audio always worked well with the PC, MAC, iPhone and iPad.CONS:1.  You are best using a physical network cable instead of WIFI.2.  Why can't I stream movies or TV from my Windows Media Center library?3.  Why can't I get TV on the Apple TV?  I mean, is it a TV or a Internet video device?4.  Why do I get the Apple TV screen when I want to AirPlay?  It's not very professional.  Can't I customize the background?5.  If you queue up a YouTube video, and go to watch it again, sometimes it won't play.  You then have to search during a live presentation.  YouTube flashes pictures of related video that sometimes contains inappropriate pictures.  Perfect for getting your presentation made without distraction.  (Detect sarcasm here.)PROS:1.  Doesn't heat up like the old Apple TV with the hard drive.2.  Once you get Airplay to work well, it's a great tool for teaching and sharing.3.  Viewing photos on a large screen is fun.4.  Internet Radio is entertaining, although we don't use it often.5.  Netflix streaming is easy, although ROKU works just as well.I would buy it again just for airplay.  Otherwise, there are other options out there.  Sorry Apple.  I am loyal, but you just haven't gotten this product right yet.", "verified": true, "helpfulness": "1/5", "author": "MOK"}, {"rating": 5.0, "review": "A few years back when the second generation Apple TV came out I got it for my birthday and have used it just about daily in my living room. Being that I've used it so much, I recently decided it would be best to get another for my bedroom.I can't say that the Apple TV third generation is any better than the second generation, but it does seem a faster when navigating menus and loading content. Both of the televisions I have are 720, so I can't really comment on the picture quality, but I'm sure it would be better if I had a 1080.Setup for the Apple TV was a breeze. I had it connected to my iTunes account, Music Match, and streaming content in five minutes. However, it did have to upgrade to the newest OS which took some extra time.In my opinion the Apple TV is one of the most overlooked Apple products that will deliver you the most content to your television. With this device you can rent movies, watch Netflix, steam content from you iTunes library, and stream content from your other Apple devices. One of the other features I like, is the ability to stream music to multiple Apple TVs. You can make iTunes send your music to multiple rooms, which allows you to hear your tunes everywhere you go.Pros:- For under a hundred bucks there is nothing else on the market that can beat it- Steaming content from your computer is flawless- Free content to Apple events, like concerts and new products- Creates a seamless multimedia experience throughout your homeCons:- Wish airplay was a more open concept, which allowed other devices to utilize itOverall, if you are looking for something to make your TV a little smarter or a way to stream your home movies and other iTunes content to the big screen, look no further.", "verified": true, "helpfulness": "1/2", "author": "Aaron Mills \"VWHSRocket\""}, {"rating": 5.0, "review": "Blu ray player stalls every 40 minutes of use and this bad boy hasnt stalled once since i used it.slight delay when projecting from iphone/macbook.", "verified": true, "helpfulness": "1/2", "author": "tt"}, {"rating": 4.0, "review": "This device is really a lot of fun to use. It allows many, many options to enjoy applications and movies.  I really enjoy using my iPhone and iPad with if for YouTube and rented shows. A must have for any tech guru.", "verified": true, "helpfulness": "1/2", "author": "Soldier"}]