[{"rating": 4.0, "review": "Most often I use my Apple TV to AirPlay and mirror stuff from my iPhone and iPad. I wish there were more choices to load apps onto the Apple TV. No Amazon Prime streaming yet.", "verified": true, "helpfulness": "0/0", "author": "Blake T."}, {"rating": 5.0, "review": "I seem to have always had an apple TV, starting with the first 40GB version, then to the 160GB, and now the streaming version. The streaming version is the best by far, in my opinion, because not only is it connected to the iTunes store, I now have availability to use Hulu Plus and Netflix, as well as stream from my iPhone or my macbook air where I watch videos on Funimation Channel's official website (I am an elite video subscriber, I love my anime!) to my TV.  Since I have added this device I have totally dropped cable TV.  Now I watch everything when I want to, which is kind of the point, anyway, without having to DVR it or watch it live.  appleTV has made my life simpler.", "verified": true, "helpfulness": "0/0", "author": "Terry \"Dresden Phile\""}, {"rating": 5.0, "review": "The apple tv does everything it boasts about. When mirroring to my phone everything shows up on the tv. Its outstanding. Movies from iTunes are awesome.", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 4.0, "review": "For streaming of Netflix and watching movies on our library the Apple TV works great and you can use a iPhone or iPad for a controller and even send you iPad screen to your TV, unless you want to watch a DVD from a mac computer and TV simultaneously. We use the Apple TV on a TV that does not have a DVD player on it and my assumption was that I could play the DVD on our mac and watch it on the TV, however Apple blocks this service. All and all its a great small device that links all your apple device to your TV but competitor devices like the Roku may give more freedom.", "verified": false, "helpfulness": "0/0", "author": "Sam Canterbury"}, {"rating": 4.0, "review": "This is a wonderful product. I could award 5 stars if Apple can figure out how to connect home network using Windows 7.", "verified": true, "helpfulness": "0/0", "author": "MightyIndian"}, {"rating": 1.0, "review": "Update: Streaming audio to the Apple TV works for a while, but many times after about 10-30 minutes, the audio stream breaks up, becomes intermittent, or stops altogether. Neither the cause nor the solution are apparent. Altogether, this device is marginally usable junk.We've been using a Roku to stream Netflix and occasionally buy TV shows from Amazon.The Apple TV setup was simple. Streaming audio and video from an iPad worked pretty well after some fiddling. Apparently you have to start the playback (audio or video) and then send it to the ATV, which means it always starts a few seconds into whatever you're playing. Mirroring the iPad works well.The iPad slideshow, however, apparently cannot be mirrored or streamed to the ATV, which is inconsistent and irritating.We then tested another function: renting a movie. The Apple TV interface is terrible for entering usernames, passwords, and credit card numbers. After trying several times and failing, despite having entered everything correctly as far as we could tell, we rented the movie through the iPad. It immediately began downloading to the iPad. It would take nearly two hours to download, and then we would have 24 hours to watch it. That wouldn't work well with our schedule. The rented movie can only be played on the device through which it was rented. I suppose it might have streamed through the ATV.So I found the same movie on Amazon at half the price for twice the time, rented it through the Roku, and watched it. To reduce wireless traffic, I put the iPad movie download on pause and let it expire. There's apparently no way to cancel it outright.I probably won't try to rent or buy any media through the AppleTV, nor movies or TV shows through the iTunes store. The offerings seem to be limited, overpriced, overly limited, and clumsily handled.Playing videos and music through Airplay to the home sound system is very handy, and that's the main reason I got the ATV. The mirroring sounds interesting but ends up being marginally useful.", "verified": true, "helpfulness": "2/7", "author": "logaric"}, {"rating": 5.0, "review": "Love to watch movies and listen to music on my tv with Apple TV. So easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Michael Freund"}, {"rating": 1.0, "review": "This is the second unit I purchased. I did so because the remote died on the first one and I had no option to replace it. This time it failed two weeks past the replacement date. While the unit itself works quite well, that means very little if I cannot control it. Thought I'd install the remote app on my iPhone; but now it's restricted to IOS 5.0 and above. I have a 3G which can only be upgraded to version 4.2.1, so I get the shaft again t from Apple. I will not buy another unit nor anything else from Apple, for that matter. I would give the product zero stars if such a rating were possible. Apple has shown itself to be arrogant and completely unconcerned about its customers.", "verified": true, "helpfulness": "0/3", "author": "tshylo"}, {"rating": 5.0, "review": "I recently purchased the Apple TV device and love it.  It was easy to install (almost did it by itself).  It worked the first time and whereas my previous wireless connection was \"spotty\" the Apple TV is solid.The caveat however was in order for me to be able to use my headphones (in the middle of the night when my spouse is sleeping) I had to purchase an Digital => Analog converter ($80.00) plus an optical cable and an analog cable ($30 each) in order to hook the Apple TV to my receiver.The Apple TV only puts out a Digital signal.  Oh I also had to purchase an HDMI cable (Apple TV to Yamaha Receiver - $100.00) to connect the digital signal to my receiver.", "verified": true, "helpfulness": "0/0", "author": "Marv27"}, {"rating": 5.0, "review": "The coolest gadget I have ever purchased easy setup easy use small active remote its awesome to use for anyone. Comes complete with a detail manual it's easy to setup like I said and simple to use", "verified": true, "helpfulness": "0/0", "author": "Thomas Altman \"telpaman\""}]