[{"rating": 5.0, "review": "Easy to install, easy to use, makes an older tv like new and more. Get you one!Has a slender remote control, down side is the range is very poor, should be fine from the couch, but from more than 10ft your out of luck.", "verified": true, "helpfulness": "0/0", "author": "Playground Music Center \"Playground Music\""}, {"rating": 4.0, "review": "It's fast and easy to use ,very simple. But content provider don't provide live tv except British Sky News. So it canna Stand for a tv box. I need a tv box additional.", "verified": true, "helpfulness": "0/0", "author": "wander6"}, {"rating": 5.0, "review": "I finally got with the tech era. Got this to get WWE Network. Price is great as its cheaper that retail.", "verified": true, "helpfulness": "0/0", "author": "Washti"}, {"rating": 5.0, "review": "and this product provides a solution:video streaming from a main server to eliminate running new cabling in an older homewe live in a digital ghetto, surrounded by FIOS and high-speed cable - but we can only get less than 1Mbps DSL and wifi cellular connections are too expensivethis product provides a way for for us to stream movies and music from a stationary server in the house (an iMac) to our HDTVs placed around our home - and to do it wirelessly!very clean, very easy to set up:1. attach an AppleTV to each HDTV2. configure each to connect to your wifi router3. set up VNC (RDP) on your iMac4. sit in front of the desired TV5. initiate a VNC session from a netbook into your iMac (i use low-compression/quality settings which seem good enough)6. log in, then remotely select the desired AppleTV from the Finder's AirPlay menu7. launch VLC to play your movie8. eat popcornmost 'normal' AppleTV users will use their high-speed Internet to watch streams or info through a pay wall, but if you're like me and live in a digital ghetto, the AppleTV provides a way to conduct media sessions and enjoy entertainment in a closeted garden!", "verified": true, "helpfulness": "1/1", "author": "willie \"roadie\""}, {"rating": 5.0, "review": "This thing always works, it's easy to setup, it's easy to operate. I have an inherent delay right when a show/movie starts - but after starting it's never had an issue.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "For a little less than $100, I can view TV shows from overseas via youtube with very good result. That alone is worth the money for me.", "verified": false, "helpfulness": "0/0", "author": "Jewinly"}, {"rating": 5.0, "review": "Just how I expected and it came in mint condition! Couldn't even tell it was used!! The only other thing is that it didn't come with the HDMI cable which I didn't know I had to get so it would have been nice if I knew that but maybe I just missed it in the description.. Anyways fast shipping and an awesome product!", "verified": true, "helpfulness": "0/0", "author": "Leila D. Offner \"Fashion chic\""}, {"rating": 5.0, "review": "I used to use my blu ray player for watching Netflix and Hulu and listening to music.  But I always hated how slow it was in loading those apps.  I invested in one of these around Christmas and haven't used my Blu Ray player since.  I've even gotten to buying digital movies because it's so much easier than having to fiddle through your blu ray disc collection. The only downside to this is that it doesn't automatically play the next episode if you're watching a series on hulu or Netflix.  You have to click back, scroll down to the next episode, and hit play.  It's not like the app on the ps3 that does all of that for you.  But I can live that so, I'm good.", "verified": true, "helpfulness": "0/0", "author": "TAPU"}, {"rating": 5.0, "review": "If you're like me and don't want to spend $80 a month on a bunch of shows I don't even watch, then this is for you!", "verified": true, "helpfulness": "0/0", "author": "Dan Stimler"}, {"rating": 5.0, "review": "Having already installed one appleTV in my home, purchasing a second for a family member was a no-brainer. Easy decision.", "verified": true, "helpfulness": "0/0", "author": "Hoosier Fan"}]