[{"rating": 5.0, "review": "really enjoy it !!! thanks again Apple for creating another intuitive products. The only issue I find is that taking him to sleep mode is not easy - APPLE PLEASE FIX IT !", "verified": true, "helpfulness": "0/1", "author": "ld"}, {"rating": 5.0, "review": "It is sooo awesome to be able to mirror either your iPad, iPhone or Mac to any TV that supports HDMI. It works wireless or wired. Plenty of Media streaming to choose from. Beats Roku in my opinion cause i dont need the games.", "verified": false, "helpfulness": "0/1", "author": "shopaholic"}, {"rating": 5.0, "review": "It works flawlessly.  No issues here.  Radio stations on it are my main priority, most of them sound crystal clear (with the exception of few.)  500 channels of whatever genre I want at my fingertips is just awesome!  Add a slideshow of all of the pictures that I've ever taken with my iOS devices is just so cool.  The remote app for it works perfectly, and the remote that comes with it is one of the few high quality remotes that I've ever seen.  It also has some of the best reception, working about 50 feet away.  1080p looks brilliant!  YouTube very rarely need to buffer.  AirPlay is delayed by a few milliseconds, but you really only notice it when gaming, and I got used to it quickly.  I love being able to push a button on my phone or iPad, and instantly see a mirror of my screen on my TV.  The build quality on this good.  It's plastic, but it still feels pretty dang good for something that'll be out of the way most of the time. (not as good as the 1st generation build quality though). Overall, a very solid addition to your setup, perhaps this will be the one device to bind it all together, as its done for me.  Highly recommended.", "verified": false, "helpfulness": "0/0", "author": "Sage Wysocki"}, {"rating": 4.0, "review": "but the screen on the tv cuts off part of the end icons for the choices of apps and the shows that are on the end of hulu and netflix.", "verified": true, "helpfulness": "0/0", "author": "Karen M. Loparco"}, {"rating": 5.0, "review": "With so many long, detailed reviews about this awesome product, I figured a short, quick review might be helpful.Apple TV is great, I've gotten rid of cable, I'm saving money, and mirroring from an iPhone is pretty amazing.Netflix, Hulu Plus, YouTube and Vimeo are all available and work seamlessly, plus anything you've purchased on iTunes is ready to play, this includes music, TV shows and movies. You can also rent through iTunes, which though I thought I wouldn't use, I've rented just about a movie a week since purchasing Apple TV.Also, MLB, NBA, and NHL packages are available, however, there are blackout restrictions based on the location of your internet provider, so if you're a fan of local teams, these may not be worth it.In closing, buy Apple TV, it's worth it.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "I bought this as a gift and we were very excited to use it. Surprisingly, it's actually very small and the setup was really easy. Once everything was plugged in, we were able to program it within just a few minutes. Once it was all programmed, it was relatively easy to switch through the menu to whatever category of your choice. We primarily used it for Netflix and it works really well.", "verified": true, "helpfulness": "0/0", "author": "SenaR"}, {"rating": 2.0, "review": "I wish I'd known that I couldn't use the air Play feature to stream my Amazon Instant Video App from my IPad. I would've never wasted my time or money on this! I'm NOT going to repurchase movies thru Apple just to play movies I already have!!! VERY disappointed!!!", "verified": true, "helpfulness": "1/3", "author": "D. Holton"}, {"rating": 4.0, "review": "I have both the apple tv and the roku side by side in our den. The apple tv has the best picture but is limited in it's channel offerings. The roku has less than perfect picture but has more channels.I am planning to purchase another apple tv for the kitchen though.", "verified": true, "helpfulness": "0/0", "author": "D. Mullen \"pontoosuc\""}, {"rating": 1.0, "review": "I thought there would be more to Apple TV than there really is. Most of the apps you need to pay for and there aren't that many to choose from. Netflix does not have a large selection of quality streaming movies like they do for their mail service. The only thing I seem to do with it is watch YouTube videos. Not worth the price!", "verified": true, "helpfulness": "0/4", "author": "CORRIE MILLER"}, {"rating": 5.0, "review": "Apple TV MD199LL/A [NEWEST VERSION]I wanted the Apple TV so I could access recorded shows from my DVR onto another TV.  I wanted it to be able to access my DVR and transfer live TV to my other TV.  After I bought it, I read some discouraging reviews stating that Apple TV can not stream HBO GO or others.  The Apple TV DOES enable me to stream HBO GO in full screen mode using AirPlay and not by mirroring.  I access NPR music and PBS apps on my Ipad, and play the concerts and shows on full screen ( a 42 inch LG and a 55 inch LG led 3D tv.) I do the same with HBO GO too.  All of these work on Ipad 2 and 4 and Ipod Touch 4. The clarity of the picture is incredible, better than the Roku -- which is pretty good and beats most built in smart apps included with newer DVR's and \"smart\" TV's.I use DishAnywhere on my Ipad and can access all the live TV channels I subscribe to including any and all in either HD or SD.  I can access ShowTime and HBO as well as NBC or Comedy Central.  I access DishOnDemand and watch the shows on my large TV from the Ipad.  I am also able to access my stored shows and movies from the DVR and play them on the Ipad and then via Apple TV view and listen to them on the large screen TV in full HD quality.  I am not using 'mirroring.'Note: My Apple Ipad 2 does not allow me to access Dish Anywhere except only by \"mirroring.\" That is not as good of an option since I cannot get the entire TV screen filled this way.  Also, regardless of which device I use, the Amazon app for the Ipad ( or Ipod Touch) will only broadcast the sound not the picture, so I would have to use mirroring for that app, but I have had a Roku 2XS, and I use that for Amazon Video streaming to access my Prime movies and others.The video quality on the Apple TV is brighter and appears to offer more definition and clarity than the Roku --- which, again provides an excellent picture.  I do not use Netflix but my wife is trying a one month sub only to get Blu Ray DVD's of a certain TV series. The Netflix app on the Apple TV is by far the best HD quality picture one can get.  The You Tube app is excellent since I can also use my paired Blue Tooth keyboard to search the Your Tube site.  The WSJ site is good too.  I am taken aback as to how much I can stream in HD from my Ipod Touch 4. I am using the Ipod over the Ipad to access the apps and DishAnywhere.Of course I can access the my iTunes library but I don't care to listen to the music on my TV.  I have a few movies in my library that I acquired via ultra violet or something like that which I have in my iTunes cloud. Playing them back from ?wherever they are via the Apple TV is a real pleasure. The color and picture quality are the best.  Apple still reigns supreme when it comes to producing a great visual and sound product.", "verified": true, "helpfulness": "0/0", "author": "Jon West"}]