[{"rating": 5.0, "review": "I recommend this product because it's very useful for those that have ipad, iphone or ipod touch.Netflix is also useful too.", "verified": true, "helpfulness": "0/0", "author": "Patrick Napoleão"}, {"rating": 5.0, "review": "I have the 2nd generation unit, which I've been pleased with.  However, I recently upgraded a 2nd TV to a 50\" Plasma.  My son wanted to watch \"Frosty\" and \"Mr. Grinch\" on the new TV, but since both were part of my iTunes Library, I could not easily stream them to the new Plasma.  Now that I have this unit hooked up to the Plasma, streaming is perfect.  Of course, it all depends on your Internet Connection, but it's nice to stream 1080p content directly from the Apple Servers to this device with no lags or loss in picture quality.Setup is a breeze.  All I had to do was select my preferred language, enter my Apple ID and Password and all my iTunes content was available.  It really cannot get any easier!", "verified": true, "helpfulness": "0/0", "author": "T. Malyszko"}, {"rating": 4.0, "review": "I am trying to learn to use it with the remote, an old MacBook 13\", and the small TV in my office while I wait for the spirit to move me to buy an iPad. Not a great experience yet, tho it does work.The Baton Rogue", "verified": true, "helpfulness": "0/0", "author": "Baton Rogue \"The Rational Conservative\""}, {"rating": 4.0, "review": "I really like my Apple TV! The only problem is it sometimes takes awhile to load a movie or TV show. Other than that it is awesome and streaming works wonderfully! I don't regret buying it!", "verified": true, "helpfulness": "0/0", "author": "mcdboy"}, {"rating": 5.0, "review": "Easy to be anywhere around the house and control the stereo plus it gives us access to radio stations we didn't have before.", "verified": true, "helpfulness": "0/0", "author": "BRIAN LAROCCO"}, {"rating": 3.0, "review": "Just got it two days ago so still figuring out all the things it can do. Teenage son is quicker at learning the specifics to using the Apple TV. I was surprised about having to pay for certain features:( Home match. Took some time to connect to my home computers.", "verified": true, "helpfulness": "0/0", "author": "bklapierre"}, {"rating": 4.0, "review": "I use the Apple TV mainly for streaming Nexflix content to my television, and it works flawlessly for that purpose.  Setup was a breeze, and picture quality is also excellent, with hardly any need for buffering, but that can be due to cable usage in my neighborhood, or something else not necessarily the fault of the Apple TV.  Anyway, Apple needs to add more content, as I'm sure they eventually will, since Netflix (and Hulu Plus, if you so desire) are the only things worthwhile to me so far.  Yes, you can subscribe to sports programming but I'm not interested in those, and YouTube's quality varies immensely.  You can also play music from your computer (provided your computer is a recent model, and your OS is newer) to your stereo but I don't see the point of playing a low-fidelity medium on a high-fidelity system, and photos can also be streamed directly to your television.  All in all, a great product, albeit, limited in variety, so far.  However, if you subscribe to Netflix for its streaming then it is worth it for that alone.", "verified": false, "helpfulness": "2/2", "author": "Real Music-Not Rap"}, {"rating": 5.0, "review": "I chose this so that I could play my movies and music through my sound system easily. My MacBook Pro is too old to mirror, but when I get a new one, I can mirror my screen to it if I want. Netflix works great on here - what I mainly use it for.", "verified": true, "helpfulness": "0/0", "author": "IT Girl"}, {"rating": 3.0, "review": "I have a bunch of apple products and use Netflix, Hulu, etc, but it is not as streamlined or user friendly as I would have hoped. First annoying thing is that when I use the remote it affects my laptop (i.e. it must be on the same frequency--so when I scroll on the tv, it messes with my laptop. I may be a little daft, but I can't always get it to play from my computer or ipad. Anyway, I think my boyfriend (who is very tech savvy) has figured it out (after quite a bit of effort). Have not been using as much as I would otherwise. I do like the ease of browsing itunes and Netflix.", "verified": true, "helpfulness": "0/0", "author": "SLP"}, {"rating": 5.0, "review": "I just got this product and for the price you'll won't be disappointed. There's like millions of movies and shows to choose from. But you do have to rent or purchase certain movies. For example: If you purchase nexflix for $8.00 a month you'll get to choose from hundreds if not thousands of movies and tv shows. Then there's another I think 15-20 more apps on there. You tube is free, I've only used it for about an hour so I can't tell you too much. I forgot to mention one important thing, you need to have a internet service wireless or hardwired.", "verified": true, "helpfulness": "1/1", "author": "maui1015"}]