[{"rating": 5.0, "review": "I love this product its simple it takes not time yo setup.. The display is HD I would definitely recommend this system to anyone.", "verified": false, "helpfulness": "0/1", "author": "April"}, {"rating": 5.0, "review": "This is a great device for streaming.  I tried Google Chrome and could not get it to work.  After spending a couple of frustrating hours, my cable provider told me that Google Chrome will not work well if it is far from the modem.  I had no problem with Apple TV which was extremely easy to set up.", "verified": true, "helpfulness": "0/1", "author": "Blooma Stark \"Gadgetlover\""}, {"rating": 5.0, "review": "Works perfect looks new", "verified": false, "helpfulness": "0/1", "author": "Jesse Linares"}, {"rating": 5.0, "review": "Apple TV is wonderful - I hardly use ROKU anywomre.", "verified": true, "helpfulness": "1/2", "author": "MaloneJC"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "Canary"}, {"rating": 5.0, "review": "apple TV has been one of my greatest purchases yet!! It has truly EXCEEDED all of my expectations!! Oh yeah, it came a couple of days early, too!", "verified": true, "helpfulness": "0/1", "author": "Malcolm J. Berry"}, {"rating": 5.0, "review": "Great product. Can't wait to see the next iteration as well!", "verified": true, "helpfulness": "0/1", "author": "Stahl"}, {"rating": 5.0, "review": "Perfect exactly what I wanted", "verified": true, "helpfulness": "0/1", "author": "Who is He"}, {"rating": 5.0, "review": "We love the Apple TV it's the best. So easy to use. Only wish the remote was bigger  it is so small.", "verified": true, "helpfulness": "0/1", "author": "Linda \"Linda\""}, {"rating": 4.0, "review": "We LOVE our Apple TV. We had no idea what to expect when ordering it. Our goal was to turn our TV in to a \"smart tv\" and it worked! We can stream all of our favorite shows from Netflix, HBO go, Hulu and more. There's also a neat option to rent movies from iTunes and they have everything. Before you rent, you can also watch the trailer for free. YouTube is another app we love to use.The coolest thing about this is that we can mirror our iPhones and my MacBook on our tv!!!!! All we had to do was update my MacBooks server.The reason I gave it one less star is that the connection sometimes gets lost. I'm not sure if it's my internet or the product, but I'm pretty sure it's not my internet.We love this product and would recommend it to anyone that lives by Apple products.", "verified": true, "helpfulness": "0/0", "author": "Emma"}]