[{"rating": 1.0, "review": "Hope Apple catches up with the mainstream Blueray players with built in WiFi. This is lacking so many apps - why is there no Amazon InstantVideo?!?!?  If this had a built-in blue-ray player without changing the size too much, I might be swayed... but unfortunately, this had to go back.", "verified": true, "helpfulness": "2/7", "author": "LilBuggy74"}, {"rating": 5.0, "review": "everything was good as expected.just good old Apple product that works, right out of the box.  Nothing negative about it.", "verified": true, "helpfulness": "0/0", "author": "Scott Chen"}, {"rating": 5.0, "review": "I have had this device for about two months, and I love it.  It took less that five minutes to set up, and it works perfectly.  I use it for watching podcasts, renting movies from iTunes, and streaming movies from Netflix.  I also use the airplay feature to play mp3s on my home theater sound system.", "verified": false, "helpfulness": "1/2", "author": "mean_old_teacher \"mean_old_teacher\""}, {"rating": 5.0, "review": "It's better than paying $10 a month for Xbox Live! It's a lot smaller than an Xbox too... takes up less space!!", "verified": true, "helpfulness": "0/0", "author": "Paul \"El Lobo\""}, {"rating": 5.0, "review": "it is awesome!!!! use it all the time! it is modern tech at its best very very useful.highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "joseph hickman"}, {"rating": 5.0, "review": "This is just great, everyone in my family enjoys it. My kids love it to play movies or youtube videos. My wife also uses the radio feature alot and youtube also for her morning exercises. Just a great product.", "verified": true, "helpfulness": "0/0", "author": "Jorge Acuna Navarro \"Jorge\""}, {"rating": 5.0, "review": "About Apple V, I can say that it is a good product. now It`s wprlin with may wireless network very well.", "verified": true, "helpfulness": "0/1", "author": "javier"}, {"rating": 5.0, "review": "Got this because I don't want to pay for cable- and it's great! I only watch a couple shows anyway, or I'll watch it on Netflix! Its super easy to set up and use. Read other reviews for more details- they are telling the truth! =D", "verified": true, "helpfulness": "0/1", "author": "paparazzi83"}, {"rating": 5.0, "review": "I love having access to all of my iTunes music and videos on my tv.  I do wish that apple would allow us to download more channels.", "verified": true, "helpfulness": "0/0", "author": "Trav"}, {"rating": 5.0, "review": "Simple to use! Very simple to use. Love the airplay from iPhone/iPad. Setup took only few minutes - work flawlessly", "verified": true, "helpfulness": "0/0", "author": "Debabrata Panda \"Debu Panda\""}]