[{"rating": 4.0, "review": "Very good performance. However, I hate the remote. Takes so long to  call up what I'm looking for.A small keyboard like my Visio tv has is much easier to use..", "verified": true, "helpfulness": "0/0", "author": "ronnie jones"}, {"rating": 5.0, "review": "This streaming TV from the internet  gives us exactly what it claimed.  This is the future.  On top of that is all the money we will save.  LM", "verified": true, "helpfulness": "1/1", "author": "ljm"}, {"rating": 5.0, "review": "I purchased this for my brother who is a graphic designer and has Mac computers all over his house.The Apple TV works very good and now he streams the videos in his libraries (laptops, iphone, etc.) and we can all watch them in his TV.As soon as he connected the device, it was recognized in all his Apple devices and was ready to work!I have read that it may have some buffering issues but my brother hasn't experienced any problems in this regard yet.", "verified": true, "helpfulness": "1/1", "author": "TheGonz"}, {"rating": 3.0, "review": "The Good:Most features work as described.  Home sharing was incredibly easy to set up.  Now I can stream movies from my itunes library to the TV, which is my favorite feature.The Bad:I have been plagued by a buffering issue.  When streaming video from Netflix or my itunes account, the video freezes.  I have numerous devices that stream over my network only the AppleTV experiences this problem.  My home network is quite robust and I have tested for network interference as well.  The issue persists even after all other network devices are shutdown.", "verified": true, "helpfulness": "3/4", "author": "Mike"}, {"rating": 4.0, "review": "Apple TV works great but it does have a few quirks.  First of all, right out of the box is that annoying voice which I had to immediately learn how to turn off.  Airplay is quirky.  Sometimes it works and sometimes it doesn't(we've been using it with my wife's iPad).  I've also noticed that sometimes after enabling airplay on this device, that it will turn off after the unit is put in sleep mode.  Other than these few annoyances, the unit works well, picture is crystal clear, and the menus and organization is great.  I would recommend this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I ordered this device because I'm visually impaired and can't always read text on the TV screen.  When I got this, I turned on Voiceover and it works great.  I talks enough to give me some basic information about a show or item on the menu but doesn't talk over what I'm watching.Setup was easy and I was up and running in no time.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "Apple Tv is a great streamer and if you have iOS devices you will get the most of it by usuing it together while enjoying all the digital content you can find on iTunes and other social networks.", "verified": true, "helpfulness": "0/0", "author": "Alberto Quijada"}, {"rating": 2.0, "review": "Works GREATwith all apple products.  DOES NOT WORK WITH ANYONE ELSE.  If this were a DLNA certified product it should work with other DLNA apps and hardware., but it DOES NOT!", "verified": true, "helpfulness": "0/2", "author": "Javaman"}, {"rating": 4.0, "review": "With a house full of apple technology, this item is a must. It is a bit of a chore to set up and we have to keep reconnecting it but once you get it connected to your device it works great.", "verified": true, "helpfulness": "0/0", "author": "power7"}, {"rating": 5.0, "review": "We love our Apple tv. My nine-year-old actually set it up and started using it before I even got home.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]