[{"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/1", "author": "stacy martin"}, {"rating": 5.0, "review": "use it ever day ...  much better than regular TV.", "verified": true, "helpfulness": "0/0", "author": "Remote Viewer Carol"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Ivan"}, {"rating": 5.0, "review": "I love it!!!", "verified": false, "helpfulness": "0/0", "author": "kenny"}, {"rating": 4.0, "review": "Apple mirroring, better netflix interface compared to Roku, and watch home movies on itunes! The reason I gave it 4 instead of 5 stars is due to limited channels. Crunchyroll not free??? If you don't know, now you know!", "verified": true, "helpfulness": "0/0", "author": "J. Ginsberg \"jayemgee\""}, {"rating": 1.0, "review": "I've had some issues with my 3rd gen Apple TV for a while now, and finally got it fixed.  Overall I actually do like the Apple TV and feature like airplay a lot, but we had these issues where it would freeze up while playing for a long time.  While searching for solutions, I saw a lot of negative reviews from folks who had the same problems and so I decided to post in case my experience helps them.Symptoms:Apple TV would freeze when watching Netflix, Hulu, Movies, whatever.  Everything (Netflix, etc..) would play just fine on my computer, Wii, Roku, etc.. and all my speed tests came back fine (always around 15mbs).  This had been happening for a while but has gradually gotten worse to the point where it was almost unusable.  I tried messing with my router settings, bought an Airport Extreme router in case my router just didn't like the ATV and that seemed to help a little, but nothing really fixed it.  I even brought it back under a recall, received a brand new one and had the same issue. Twice.Solution:I called Time Warner and they did a test on the connection to my cable modem (I purchased my own Motorola Surfboard cable modem a while back).  They said that the speed checked out fine but that the signal was a little weak and there were some \"black lines\" in the test which I assume means lost packets or something along those lines.  They did something on their end to boost the signal strength and it's been smooth sailing ever since.  They did it remotely and the whole conversation took about 10 minutes.My guess is that the Apple TV is more sensitive to those little spikes and interruptions in the internet connection and isn't able to ride through like my other devices.  What finally tipped me off was that while the Apple TV has had issues on and off for over a year, the problem had just recently started expanding to my other devices.  Because all my other devices worked fine and the speed tests always checked out I'd never thought to call the cable company, but they fixed it right away over the phone.Overall I do like the Apple TV.  Airplay is great, it's great that it's synchronized to my iTunes and the selection of Apps keeps growing.  Setup was easy too, however this issue of the device freezing up was just really frustrating and Apple support isn't great.", "verified": false, "helpfulness": "6/8", "author": "Solsticehmg"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "alex"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "XxxyxxyxxxY"}, {"rating": 4.0, "review": "Product arrived as promised and in correct packaging.  I ordered this item used and was in great condition.  It has been working without any problems.", "verified": true, "helpfulness": "0/0", "author": "Maui Girl"}]