[{"rating": 5.0, "review": "If you have the whole package, iphone, ipad, and a mac, this device is very useful. Can stream all your data to any TV. Great stuff from apple", "verified": true, "helpfulness": "1/1", "author": "Alex A"}, {"rating": 4.0, "review": "I really like all the features of this product. Extended and mirror desktop from your laptop, streaming from a bunch of apps, iCloud integration to see your pics, etc. Library share. All that's great, but it should allow for custom apps, and it should definitely have Amazon Instant Video.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "jean ryszewski"}, {"rating": 5.0, "review": "If you have a regular tv, then his just upgrades it for using Netflix, Hulu, or other services provided through the Apple TV. Easy to use and can't complain about the fact that it is a 3rd generation product and I couldn't wait for the update unfortunately. Nonetheless, it is a great addition to the living room tv.", "verified": true, "helpfulness": "0/0", "author": "MusicDefines"}, {"rating": 5.0, "review": "We already owned an Apple Tv Device; and loved it so much we got this second one.  Don't forget to buy an HDMI cord because it does not come with one.", "verified": true, "helpfulness": "1/1", "author": "Byrdcrest"}, {"rating": 5.0, "review": "Works like a charm and very cool, however, i can see how the cost of renting movies etc. is going to be expensive", "verified": true, "helpfulness": "0/0", "author": "noah"}, {"rating": 5.0, "review": "this is a great product works great", "verified": true, "helpfulness": "0/0", "author": "anita w. snell"}, {"rating": 5.0, "review": "Couldn't complain about any apple product.This is very good and apps perform much better on this than any others.I have a ROKU box which in under performing already after a year, but apple tv is performing efficiently.", "verified": true, "helpfulness": "0/0", "author": "Pavan c Ramaswamy"}, {"rating": 5.0, "review": "Very good content. Easy to operate (apple). Running a video in the ipad or iphone wireless using the mirror function and see it in the TV without delay is simply priceless.", "verified": true, "helpfulness": "0/0", "author": "Alessandro Petrone"}, {"rating": 5.0, "review": "This device was an easy way for us to play movies on our IPADS and have them come up on our LEDTVs.  It was delivered fast, good price, and easy to set up.  My wife loves it, probably a bit too much.", "verified": true, "helpfulness": "0/0", "author": "Tom"}]