[{"rating": 5.0, "review": "It work with all my family's iPhone as well as my iPad 2. I have teenagers and they enjoy using it to watch their music videos or YouTube . Very clear and crisp viewing in our tv.", "verified": true, "helpfulness": "1/1", "author": "E Miranda"}, {"rating": 5.0, "review": "This device offers much more for the money than any similar device. I love it and would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Dr. C"}, {"rating": 5.0, "review": "It met all my expectations. The item has worked perfectly. It also works speedily and smoothly. It also works great with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jim McAteer"}, {"rating": 5.0, "review": "Really great item.  I enjoy watching prime with this.  Very easy to install and use.  Waiting on prime to get a few more of my favorite movies", "verified": true, "helpfulness": "0/0", "author": "NannieK"}, {"rating": 5.0, "review": "For what Apple considers a \"hobby\" this is one great device! We have one connected to every TV in the house and we stream Netflix, HuluPlus, PBS, YouTube, Vevo, ABC TV and our personal library of DVDs and CDs. Definitely a must have item for any media room.", "verified": true, "helpfulness": "0/0", "author": "C. Van Koppenhagen \"cvk\""}, {"rating": 3.0, "review": "I got this for 2 reasons. 1st my Sony str-dn840 has airplay but uses an awful high contrast graphical display with no screen saver that burns and image into my plasma tv. The Apple TV's Airplay playing capability is better. It allows browsing from its gui of networked shared libraries, and it has a nice screen saver. 2nd, the Apple tv allows for Airplay mirroring and iCloud photo sharing. This allows you to easily watch videos taken on your iDevice on the big screen, or view your iDevice photos saved to iCloud. Yes, you can do this with any tv or blu-ray player with HDMI and a Apple AV cable. However, the proprietary cable costs $50 and the Apple TV costs $85. To me its a no-brainer to by the Apple TV for this use case for an additional $35.Of course all of this assumes you are already heavily invested in the Apple universe with iPhones, iPads, Macs and iTunes, and care about watching iPhone videos and photos on your TV. There is another issue as well. Apple is a content provider though iTunes. They really don't compete with Netflix, as they don't provide a subscription service, so you get that, but they do compete with Amazon for movie rentals, so you don't get an Amazon app. You still need another device to use your Prime streaming or rent movies from Amazon which are cheaper than iTunes. Roku on the other hand isn't an Amazon competitor, so you get Prime along with many more streaming services.Performance wise, the Apple TV has plenty of storage so that buffering and streaming quality don't seem to be an issue. Also the Apple TV has some other potential. They do add content, and there is word that Apple with update the software with more app store-like functionality, so that developers can make apps for it. We'll see. For now its a good unobtrusive player, with Apple universe integration and less content than Roku or XBMC. Well, that is, unless they develop an Apple TV 3 jailbreak.One more thing. Airplay mirroring ONLY natively works with newer Macs with better graphics hardware and iOS devices. To use AIrplay mirroring on older Macs you need to buy the AirParrot app. I can attest that this works well on a ram upgraded late 2008 MBP, but it does use a lot of system resources and spins up the fan quite a bit.", "verified": true, "helpfulness": "2/2", "author": "Wolf Island Diver"}, {"rating": 5.0, "review": "Great for watching just about anything especially if you have an iphone, ipad or MAC.  Integrates everything together perfectly. I use it for Amazon Prime movies because I use my ipad/iphone, but would like to see Amazon Prime movies as part of the Apple menu like it does with Netflix.", "verified": true, "helpfulness": "0/0", "author": "A. J. Corrao"}, {"rating": 5.0, "review": "Love it great purchase have recommended to friends really great if you have other apple products in ones home compatible remote . I can even use the remote for my laptop.  who would have guessed!! cool!!", "verified": true, "helpfulness": "0/0", "author": "Lisa Lisa"}, {"rating": 5.0, "review": "I used to watch video or photos on my iPhone, but when I bought this, I can say goodbye to the small screen and enjoy everything on a bigger screen. My family all love it. And it's pretty easy to use. Highly recommend it!", "verified": false, "helpfulness": "0/0", "author": "Lanny W"}, {"rating": 5.0, "review": "I have this and a few Roku players around the house. I mainly bought this because I wanted to hook it to my stereo so I could airplay my music directly from my iphone or Ipad. It works great and uses a digital output cable for the sound (sold separately). I do use it to stream Netflix and just noticed that Apple included some free channels like the Red Bull and Smithsonian channels where you can watch some cool stuff.", "verified": true, "helpfulness": "1/1", "author": "Brian M. Kaplan \"Brian M. Kaplan\""}]