[{"rating": 5.0, "review": "I hear that this product is limited in comparison to a Roku, but I don't have a Roku to make the comparison.  This product is really easy to use.  I am a happy customer.", "verified": true, "helpfulness": "0/0", "author": "MoisesGo"}, {"rating": 5.0, "review": "Amazon was offering the Apple TV for a 10% discount at the time I purchased it (since then Amazon has done this multiple times). I have a Mac Mini that I connect to my TV set for an extra-large HDTV experience for whatever I do, so the Apple TV was purchased as a gimmicky hobby of sorts (isn't that what Apple says it is, too?). I love being able to explore the various channels on the Apple TV, and am able to wirelessly stream things like movies and such from my iPad, iPhone, or Mac Mini (although I don't truly have the need). Flawless execution, design, and build. Thanks, Apple & Amazon!", "verified": true, "helpfulness": "0/0", "author": "Chase"}, {"rating": 5.0, "review": "I bought the Apple TV as a gift based on my previous satisfactory experiences with Apple products. I would buy again.", "verified": true, "helpfulness": "0/0", "author": "Victor J. Ekvall Jr. \"Tool Guy\""}, {"rating": 5.0, "review": "Product is perfect! I deferentially recommend it.  If you want a High Definition and Interactive TV you should buy it.", "verified": false, "helpfulness": "1/1", "author": "Arnaldo Toledo de Aguiar"}, {"rating": 5.0, "review": "Absolutely love my Apple tv. Love the airplay feature. Can stream music straight from my phone via surround system that is connected to aplle tv. Good choice of movies to rent as well.", "verified": false, "helpfulness": "1/1", "author": "Chereb"}, {"rating": 5.0, "review": "This is another lovely product by the people at apple, The device is sleek and the size is just right, it does not take up much space and it support several device connectivity.Excellent product", "verified": true, "helpfulness": "0/0", "author": "Kevin Dillon"}, {"rating": 4.0, "review": "Love it. Connected to my iphone , ipad, and itunes. Very easy to use, like all apple products. Wish it had more apps but who knows what updates are coming.", "verified": true, "helpfulness": "1/1", "author": "Javier Mendez"}, {"rating": 5.0, "review": "I love being able to have a movie going upstairs and downstairs at the same time!!! We have a PS3 for upstairs tv and it connects w/ the Apple TV and the kids can watch what they want and the parents can watch what they want. Love it!! My favorite feature: all your pictures that are on your computer?-- they are now flowing rhymically w/ music of your choice from the endless stations on the radio. It is the up-to-date slide show but on a large flat screen tv (if you have one) .Everyone loves it!!", "verified": true, "helpfulness": "0/0", "author": "D. M \"dortatt\""}, {"rating": 3.0, "review": "The main reason I purchased this was to stream iTunes from my computer to my home theater speakers.  I spent a total of more than two hours, on two separate occasions, with Apple support and 1 hour with D-Link (Apple claimed it was my router, it wasn't).  Finally Apple said their software was not the problem and it was probably a problem with Windows and he referred me to an article in the \"Apple Communities\".  Of course I gave up and returned it.  Sonos, here I come.By the way, all other functions of the box worked fine.", "verified": true, "helpfulness": "0/1", "author": "Kevin J. Mcclure \"kjm\""}, {"rating": 5.0, "review": "I wanted to be able to group large numbers of digital pictures on my Mac, add music, and send the finished product to my large screen tv.  The Apple TV does the job simply and perfectly...now I just need to take better pictures!!!Setup was relatively easy and, after a few trial/error attempts, I believe I have it mastered.  I have yet to test the other features (e.g., Netflex movies), but the product does what I expected and does it well.  No more memory sticks or burning CD's.", "verified": true, "helpfulness": "1/1", "author": "P. Roberts"}]