[{"rating": 4.0, "review": "I like the product a lot that I do not have to connect any wire from my IPAD to apple TV.  The only problem I have is sometimes it slows down the streaming.  If it take care of that, I would give it a 5 star.", "verified": true, "helpfulness": "0/0", "author": "zcxprince"}, {"rating": 1.0, "review": "Pay $100 just to buy movies and such. There is much more free and accessible content on Google TV's and Roku's. (Games and such)", "verified": false, "helpfulness": "1/14", "author": "prashant junankar"}, {"rating": 2.0, "review": "Very disappointed in the product, and plan to return it immediately.  It's a great concept, poorly engineered and supported.  Really, this review is not just a review of the AppleTV alone, but also the iTunes home sharing concept, which the AppleTV is very dependent on and is essentially worthless without.Home sharing itself is very quirky, with all kinds of little issues which prevent it from being totally reliable or really easy to deal with.  In spite of Apples normal intuitive user interfaces, the design of home sharing is clunky, poorly executed, and terribly supported.  In this particular case, one of the issues is that many many people (unfortunately including myself) discover some sort of application defect whereby after 5-15 minutes of use, iTunes/Home Sharing kills the host PCs wireless interface.  Keep in mind that this is on multiple test units, on multiple wireless networks, using multiple operating systems and multiple routers.  It is quite consistent.  Even on Apples forums (and many others) people have been unsuccessful in determining what factors lead to this to isolate root cause.  In my case, this is supposed to be a \"convenience\" item, and I've wasted more time than it's worth trying to deal with it, so I'm done.  I've attempted multiple times to engage Apple, however those efforts have been frustrating and totally unsuccessful.In particular, this makes it even worse as Apple TV is so restrictive as to what you can actually play through it.  Most of us already can stream netflix (if we wanted to) and a myriad of other sources.  The idea was to be able to stream video content from iTunes, and unfortunately, this device is simply ineffective.I did give it 2 stars instead of on, because if you put the host PC on a wired network, it seems to alleviate the issue.  And before anyone comments to the contrary, this is the absolute ONLY function that the networks and hosts in question have any issue with.  These networks and devices routinely move FAR more content and FAR larger data sets/files via wireless than anything iTunes does.  The issue is clearly, concretely, Apple TV and iTunes - period.  Even Apple support finally acknowledged that.Some people are able to get this working well - nobody seems to understand why some have issues and others don't.  My advice is to really test the heck out of it if you're going to try it, so you can make sure you can return within the window.  Further, make sure you understand exactly what it does because it's much more narrowly focused than you might think in terms of capability.", "verified": true, "helpfulness": "3/6", "author": "wh"}, {"rating": 5.0, "review": "Just when I thought I had a good flat screen, withApple TV MD199LL/A [NEWEST VERSION] Apple TV, it became a great TV. To start with, music from my computer never sounded so good using Apple TV. I play the music through my old Pioneer sound system (using the AUX input red white and a cable going from the red white out on the TV to the AUX  input on my Pioneer) and it's like I have my own mini theater.There are pod cast programs I can access which makes my TV an educational tool in ways I had never imagined. The real joy is being able to show movies I have created on my iMac and showing pictures of family and friends as a slide show with music added instantly. I use my iPod in ways that give me more for the money than I had ever thought possible. If you are looking for first run movies, you'll find them on Apple TV as well. With the price of movies going up all th time, it's so nice to invite friends over to watch a current movie playing in theaters in the comfort of your own home. You can stop the movie any time and go back to it or go back to a sceen you want to watch again if you like. Rentals are good for 24 hours so you can keep on sharing if you like. HD movies never looked so good. Being able to access Netflex using Apple TV is a real bonus for me as well. I can look at TV series that I may have missed or movies that I have forgotten all about and would like to see again. On Netflex I can find movies for the children in our family so I can let the kids watch what ever they like on a TV in a separate room. This is one of the best purchases I have made. Apple TV comes with WiFi built in so you don't have to buy a USB adaptor for your TV to access WiFi; Apple TV automatically does that using a HDMI cable (not supplied) connected from Apple TV to your TV. If you have wireless access to the internet, all you need is Apple TV and am HDMI cable; it's that easy. I thought it would be compicated; boy was I wrong.", "verified": true, "helpfulness": "0/0", "author": "Robert Bier"}, {"rating": 5.0, "review": "I'm very happy with this device. It's very easy to set up and allows me to see the videos and movies in my iTunes library like I've never seen it before. There are only two wires; the power plug, and an HDMI cable. I was up and running in less then two minutes. The Apple TV walks you though set up; and that goes very fast. I get a lot of movies from iTunes, but Netflix and several other sources are available.The really good news is that the next version of the Mac operating system (OS 10.8) is going to have as part of the system software the ability to access your the browser on your Mac using you Apple TV on your flat screen. I'm happy with iTunes, You Tube, Netflix, etc.; been able to use the browser will be gravy.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 3.0, "review": "OVERVIEWIt's small, quiet, and fairly inexpensive, although competing products are quite similar in this regard. It's got a nice screen saver that uses your iPhoto or Flickr library, and is a nice companion to iTunes. Unfortunately, 1080p video playback is a little choppy, audio format support is extremely limited, and if your media isn't already in iTunes, you're in for some work if you want compatibility.AUDIODolby Digital, the audio format from the 1990's that is being phased out for DTS, TrueHD, or even DTS-HD is the ONLY surround audio option available on Apple TV. This is a major let-down, especially considering the jailbroken Apple TV 2 is capable of DTS pass-thru, and that DTS is an audio format made popular by DVD over a decade ago.VIDEOIt's true ATV3 does 1080p video, although it tends to stutter with complex motion when outputting the full 1080p (any scene with a full-screen pan will inevitably skip frames at 1080p), and will outright crash if the video reaches a bit-rate it can't handle. I encoded a few BBC Earth Blu-rays at 'constant quality' and any scene with lots of birds would freeze the ATV3 every time without fail, and the only solution was to re-encode the video at a much lower quality. It took a few encodes to find a setting that wouldn't freeze the ATV. DVD rips look great, and when playing to a 720p TV the video is crisp and smooth, especially when playing a 1080p source downscaled. Netflix HD streams also studded during complex pans.INTERFACEWhere Apple TV shines is the interface, it's pretty, easy and smooth; though that too has some issues, not the least of which is the common interaction of holding down the 'select' button - it doesn't always work or register, and when it fails, a restart is not enough, you must power-cycle the unit to fix it. It has a decent Netflix app, second only to the Xbox or iPhone version (I have Netflix apps on many devices), in that it displays the movie list nicely and does a pretty good job remembering where you were in the menus most of the time. It sports iTunes Cloud support, so if you're like me and you have your songs in the cloud, you'll save some room on your media center with it. Unfortunately, there's no way to watch Amazon Instant Video or anything else that doesn't have an iOS app, and even if it does, you have to occupy your phone or iPad with it to stream it to the ATV.HOME STREAMINGAnd then the 'Media Center' aspects. This is most important to me and probably other people, and it's where Apple TV is the among the worst. Sure, if you rip your videos right, they'll work great. I've got multiple audio tracks and subtitles and meta information in my videos and everything is great, but only after I've encoded them to the exact specifications required by Apple TV: x264 video, AAC stereo audio, AC-3 surround audio, and 3GPP subtitle text. Nothing else will work. I repeat, NOTHING ELSE WORKS. I've been ripping my collection since April (over four months) and I'm nearly finished, but there's many people out there who would (or did) scoff and call me a nut for not simply getting something that could play MKV files with modern audio formats and save myself hundreds of hours of CPU cycles.The exception, of course, is iTunes-purchased content, it's up to you how you value that.BOTTOM LINE (from a long-time Apple user)Unless you're an avid Mac user who's willing to rip his/her videos to work with iTunes in order to stream them to the TV, I strongly advise something with more modern specifications that can play MKV, DTS, and other formats that you most assuredly have if you're not already managing your media in iTunes.", "verified": true, "helpfulness": "1/2", "author": "Amazon Jeff"}, {"rating": 5.0, "review": "I have an iMac and iphone.  I really enjoy the ease of AirPlay.  My AppleTV is connected into my entertainment system, and it is so easy to stream music or video from either my iMac or iPhone to the stereo or TV.", "verified": false, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "This box is truly great at what it does in cross platform usage amongst all MAC products. I really love the airplay feature which enables my iOS device or Mac OSX to send content to the box to play on my LCD TV. Its very limited to the content you have on your iTunes account or Netflix and I would love to see this get opened to more content providers as well. I know theres a jailbreak for the 2nd Generation but I would rather not have to go thru a Jailbreak for more content choices. Lets hope iOS 6 changes everything.Great product, great extension to all your iOS devices! must buy!", "verified": true, "helpfulness": "0/0", "author": "JLo C. \"JLo\""}, {"rating": 5.0, "review": "We already had an account for MLB.COM and we added Netflix for unlimited streaming for $8 a month and the amount of movies and shows available are seemingly endless.  I doubt that one person can watch everything in one lifetime.  I'm catching up on a lot of shows that I've heard about but never really watched before.  You can watch the whole series in order without commercials.  We really like the standup comedy shows too!  We have cable internet service so our connection is very fast but the streaming still lags behind from time to time - granted it's a wireless connection so perhaps it's the microwave or garage door opener interfering with it, but other than that annoyance, we're completely happy with it and we'll likely buy a second unit for our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Spartan Child"}, {"rating": 5.0, "review": "I like the new Apple TV a lot.It loads the videos much faster then the old one.I recommend it for sure. Worth the price.", "verified": true, "helpfulness": "1/2", "author": "Roberto Fabbrin"}]