[{"rating": 5.0, "review": "I gave this Apple TV to my son for Xmas. He has used ours and really liked how it worked with his other devices.  He said he, \"works like a charm. Use it all the time. It will be nice to have for a party to play music through\"", "verified": true, "helpfulness": "0/1", "author": "M. Mann"}, {"rating": 4.0, "review": "I purchased this product solely because I wanted a better way to watch Netflix.  I did have access thru my computer and an older Wii, but I wanted to get HD quality.  For the most part, Apple TV does work fine and is easy to operate.  If you are connected to a cable network, the other uses for this product are unnecessary in my view.  The newly released movie rentals are more expensive than my cable network charge, the other uses are for apps like youtube and internet radio, which again you get with cable.  The one feature that I have used that is useful is Airplay.  That feature allows you to take content from your  home computer or other portable device and show it on your TV.If you want nice quality movies thru Netflix (based on your internet service) I would recommend this product.  It's reliable and not overly expensive.", "verified": true, "helpfulness": "1/1", "author": "Carmen T. Verenna \"cverenna\""}, {"rating": 5.0, "review": "It does everything he hoped it would. It was easy to set up. everything is accessible from 'your' cloud. It was a great gift.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Kirbach"}, {"rating": 3.0, "review": "It works well with the new Apple operating system but for the price there are a lot of cheaper options that work well for a lot less.", "verified": true, "helpfulness": "1/1", "author": "Kirby Marshall"}, {"rating": 5.0, "review": "My order was shipped quickly and it works great.  It is a great addition if you have an iPad and it also works great in my classroom at school.", "verified": true, "helpfulness": "0/1", "author": "Andya85"}, {"rating": 5.0, "review": "Excellent product. Easy to use and works well. Bought for my girlfriend. Buying it for myself very very very soon.", "verified": true, "helpfulness": "0/1", "author": "Kyle Perkins"}, {"rating": 2.0, "review": "I bought the Apple TV to mirror my ipad on the TV set. The quality is no where close to what is displayed, very blurry. Chromecast is the way to go.", "verified": true, "helpfulness": "1/3", "author": "Geraldo Dominguez"}, {"rating": 5.0, "review": "I bought this for my office. Not only does it allow me to stream or watch content, but it allows me to seamlessly share my MacBook Pro screen onto my tv. Initialize this with clients and training with employees. Another added feature is having a 4 digit pin setup, so only specific people can connect to it.I wish there was more streaming content and that it had Amazon Prime video.Highly recommend for Apple users and new users.", "verified": true, "helpfulness": "0/0", "author": "Harness TechED"}, {"rating": 5.0, "review": "This is what I tell my friends and family about the Apple TV.  If you have an iphone/ipad, or any other Apple products, it's a \"must have\".  I take it with me when I travel and buy them as gifts.  They're that cool!", "verified": true, "helpfulness": "0/0", "author": "Mark Wolfgang"}, {"rating": 2.0, "review": "No one warned me that TVs that are 5+ years old often have distortions and fluctuations in reception.  Currently I'm having constant \"blipping\" in tv transmission and music - totally unacceptable!", "verified": true, "helpfulness": "2/3", "author": "Heather P. Woltz"}]