[{"rating": 4.0, "review": "Bought the Apple TV because we have other Apple products and expected the interface among products to be least problematic. Found a bit of a learning curve, but not bad. Wife was disappointed because she expected more from the TV than what it was designed to deliver. Be sure you know what it does and what it is intended to do before you buy. We hooked it up via an adapter to an older analog TV which does not do it justice. Pictures are pretty good, but text on the older TV is blurry. Not good enough to allow sharing emails with a larger family audience on the TV screen.", "verified": true, "helpfulness": "0/2", "author": "Lawrence"}, {"rating": 5.0, "review": "This one lives by the name of Apple! It is fast, interface is fastest, and has bunch of features such as Airplay, Remote App, etc. that are so handy if you have other Apple devices. Even if you don't, the remote is fast, sleek, and easy to operate as compared to other devices and so it makes searching Youtube and Netflix so much easier.  Although I bought this at Best Buy as I needed it right away, you can buy wherever you want. But, let me tell you....Don't get fooled into buying a blu-ray streaming player or Smart TV if all you use is Youtube and Netflix as this one can do it (and much more) so much easily and adds 1000 handy features for other Apple device owners.  The interface and remotes that come with other blu-ray streaming players don't even come close to APple TV! This one surely rocks. Usually I am very critical and don't become happy very soon but this one charmed me.", "verified": false, "helpfulness": "1/1", "author": "SacEagle"}, {"rating": 5.0, "review": "Something I'd have expected from Apple: a great simple product.Easy to install and fun to use. I own 1st Generation Apple TV andI must say I love this new one.", "verified": true, "helpfulness": "0/0", "author": "Yon Blanco \"yblanco\""}, {"rating": 3.0, "review": "The remote makes me want to smash my head against the wall. It is so tiny, I lose it all the time. In fact, it may be the smallest remote I've ever seen.  It is so slim that it falls into the abyss of my couch through the smallest of crevices. I can't really speak to the quality of this device as the remote is always missing. So I basically have an attractive looking box next the tv that that just sits there taunting me.", "verified": false, "helpfulness": "2/5", "author": "Soulshine \"Soulshine\""}, {"rating": 5.0, "review": "after i got it the item was working perfectly, and no problems at all, good, excellent,i will tell my friends,", "verified": true, "helpfulness": "0/0", "author": "castaneda"}, {"rating": 5.0, "review": "Easy hook up, works like a charm.  Have watched MLB baseball, movies, photos, YouTube, and mirrored the iPad for room viewing of web browsing.  Nice gadget.  Also bought a 6' HDMI and it all came in the same package so I was ready to go.", "verified": true, "helpfulness": "0/0", "author": "Mr S - Indiana"}, {"rating": 1.0, "review": "Like everything Apple makes, this device is lovely and elegant and intuitive to use. If you're content buying things from the iTunes store and streaming videos from its short list of approved partners, you will probably adore this device. I was really disappointed. And I will tell you why.The problem is that if you'd like to do ANYTHING else, no matter how standard it might be on similar devices, you are out of luck.Want to watch that Blu-Ray you ripped into Xvid/avi? Nope. An .mkv file... half the tvs and Blu-Ray players out today can do that. Not your ATV. It only plays H264 stuff ripped into its formats. How about that camera phone video you made of your kid? Hardly. Maybe you made that video in one of the short list of approved formats. I hope you have it on a Mac or a PC running bloated old iTunes, because your shared network folders mean nothing to ATV. What if I just put it on a thumb drive and plug it in? Sorry, no USB ports. So if you're on Linux or you just don't like iTunes, you're S.O.L. I'm told there are elaborate ways to convert files and funnel them over from iTunes, but when competing devices offer plug n' play, how is that not an annoying hassle?How about streaming stuff... Maybe you'll just watch Hulu. Nope. (EDIT: Hulu has been added.) Amazon Instant Video? Nope. Blockbuster On Demand? Nope. Maybe listen to Pandora? Nope. Spotify? Don't kid yourself. Even my phone can play stuff off a UPnP server. Can't Apple TV? Nope again. No device has every service, every file format, but the ATV only has the ones that don't interfere with their moneymaking efforts. You could try and jailbreak it to get it to be more flexible... but there isn't a working jailbreak for Apple TV 3.If you browse through other compact media players, you're going to find that things like mkv/xvid support, USB ports, Hulu, and Pandora aren't just available, they're increasingly standard. Half the Blu-Ray players coming out today can do much of this stuff, many of the tvs, too.But even though the iPhone offers similar functionality to competing phones, the iPad offers similar features to other tablets, and Apple laptops serve similar needs to PC laptops, the Apple TV isn't really analogous to other home media players at all. It lacks most of the functionality those devices have in common and exists primarily as an aesthetically pleasing way of expanding your existing relationship with Apple and its partners onto your television set. If this is all you need/want, consider this a four star review. But for me, looking for an all purpose media player, I felt really let down.If you want your media player to play YOUR media, your way or if you're interested in services that have any competing interest to the iTunes store, best look elsewhere. It's not that this is a bad device, it's just that it's not really a true peer to similar devices.As a post-script, please let me add that I'm not antagonistic to Apple products AT ALL. I have an iPad I adore. I also have a Windows desktop, an Android phone, and a Linux laptop. I'm just looking for the best stuff. I'm not pushing any OS-specific agenda. If you're an all-Apple-all-the-time person, you may love the Apple TV. But I wanted to offer my review for people who aren't.", "verified": false, "helpfulness": "320/428", "author": "Jeffrey W. Webber \"Jeff Webber\""}, {"rating": 4.0, "review": "Owning both a Roku and AppleTV I would say both things do certain things well. One of the reasons that AppleTV only gets a four star rating and not a five star rating is because I feel that with Apple's resources they should be well ahead of Roku.Where AppleTV really shines is syncing with your home computer. Being able to listen to music stored on my computer in my living room, and being able to control it with my phone using the nifty remote app is where AppleTV shines. The Youtube integration is also a great feature on AppleTV. I love how Apple TV displays the album covers of the music I'm listening to on my television screen. Cover art has never looked better.Apple TV also allows you to mirror what's on your iPad or iPhone on to your TV screen. This is great for photos but when using it with things like Slingplayer it was horrible. My slingplayer app got no picture and other apps such as HBO GO are completely blocked. I mirrored some of my music on my iPad and noticed a huge drop in quality from the music that was played from home sharing. Not sure why.Both of these devices offer netflix however the Roku also adds many more channels such as Amazon On Demand, which I would argue is far better than the movies app on Apple TV.  Roku also offers HBO Go, Hulu Plus, Pandora, Crackle which are not offered on Apple TV, however Apple TV has YouTube which Roku doesn't. There is a channel that you can download for Roku called RateRix that allows you to watch all your bookmarked youtube videos however this channel is such a pain to use that it isn't even worth the free download.There's another app called Plex that I have on my Roku which isn't the easiest app in the world to use however it supports a lot more video than Apple TV does and one of my videos that was an MKV file played fine in iTunes but on AppleTV it didn't have any sound whereas with Plex the sound worked perfectly and was in sync with the video.  Plex also allows you to access your iTunes library on your Roku, however the user experience isn't quite up to par as it is with AppleTV.If you don't want to download the plex channel on your Roku, the Roku offers a USB port which allows me to download movies to a Flash drive and simply insert them into my Roku. This is not offered on AppleTVI would say both of these have features the other lacks, however where Apple dropped the ball in my opinion is not having an App store like they do with the iPhone, iPod, and iPad.  Roku shouldn't even be in business, much less providing competition for Apple.If I had to pick I would go with the Roku, however the AppleTV does some very cool things that Roku doesn't such as YouTube and while both will allow you to access your entire music library, the AppleTV does a significantly better job at this than Roku. On the other hand Roku has a lot more apps, and I would argue better apps.", "verified": true, "helpfulness": "67/84", "author": "The Guitarman"}, {"rating": 5.0, "review": "AppleTV is a great product, and I won't re-hash the product itself here. I had the 720P version and this is the 1080P version, but still just as great otherwise. No, what I found important here is that with this Apple product, I started to do as I always do and buy directly from Apple's web site.I was on a break at work, I had a credit card already set up with Apple, and I was ready to buy. So I logged in, put it in my cart, went to check out, but they wanted the security code for my Apple/Barclay card I have on file with them. Fair enough... a good security measure I suppose. But I'm at work and my card is at home where I keep it safely tucked away. I never use it for anything but Apple store purchases and I don't carry a balance due to it's usurious interest rate. So, without the code, I have to log off and leave the item in my cart for later.Later that evening, at home, I tried to complete my purchase. But when I logged in, Apple had forgotten that I put a product in my cart. What AppleTV? :D  So I added it back to my cart, noted the $99 plus tax price, free 5-7 day shipping and the need for someone to be around to sign for the delivery unless I planned ahead and did a release form (which you can't do until you get shipping notification.) Eh! Not a huge deal but a bit of a pain and kinda slow. Then for some reason, I stopped before entering my credit card security code and completing the sale... it occurred to me to hop over to Amazon and see if they had this item. Of course they do!Not only does Amazon have the item, it is the same price, but they offer 2-day Prime free shipping, one-click ordering with no hassle or extra verification step, and no hassle with having to be around to sign for it. And not only did I get 2-day Prime shipping for free, the fact that it came via ONTRACK means I actually got it in 1 day instead of 2.I think Apple's online store is great. And I don't have a problem with a certain amount of caution in the security department. But I've ordered several items there with that same Barclay card, had all shipments sent to the same address on file, so how it it necessary to have to enter to security code from the back of the physical card and sign for the delivery on an order like this? A multi-thousand dollar computer shipped to a different address, you bet. But I think some sense and convenience has to come into play.Thank you Amazon for once again proving this is the best place on earth to shop. No, I'm not a shill and own no interest in the company. I just like shopping online, getting 2-day free delivery and not having to fight traffic or lines to get anything anymore.", "verified": true, "helpfulness": "2/7", "author": "Joe \"JF\""}, {"rating": 5.0, "review": "Easy to setup, watch Netflix tv shows and movies on our tv. Makes it easy to look at our hundreds and hundreds of photos and movies.", "verified": true, "helpfulness": "1/1", "author": "Gloria Farrell"}]