[{"rating": 5.0, "review": "Even as the competition outpaces Apple to faster and more feature-heavy versions of streaming devices, the Apple TV stands above the rest for a couple of reasons. One, it has the cleanest and easiest-to-use user interface. All the apps on an Apple TV comply with the design standards that Apple set, so navigation on Hulu is the same as it is on Netflix and so on. And two, if you have other Apple products, it creates an excellent home experience by allowing all purchases, photos, etc. to stream easily from your cloud...or you can use the nifty \"airplay\" feature to broadcast any of you apple or mac screens through your apple tv to your television.We have been cable-free for at least 6 years now and the best of those six years was when we got the Apple TV. The one downside is I wish they had the Amazon app, even if it is the same app that is found on the phone (that allows streaming of Prime membership content and purchases, but does not allow you to purchase from the device any new content.)If you want easy navigation and already have iPhones and/or MacBooks at home, this is 100% the top choice for a streaming device, especially if you buy media through iTunes.", "verified": true, "helpfulness": "0/0", "author": "Schmagurty \"schmagurty\""}, {"rating": 5.0, "review": "I love my AppleTV.  I can play my iTunes purchases, Hulu and Netflix through it.  Honestly, I have the AppleTV instead of cable, and I don't miss cable at all.  I wish it had Amazon Prime, but I understand that they don't want to openly support the competition.  If you do want Amazon Prime, you can just AirPlay it through an iPhone or iPad (or possibly a Mac - I haven't tried) onto the AppleTV.  It doesn't require as many clicks of the remote as my friend's Roku, and the picture quality is good.  I've also had way less playback issues with my AppleTV than my friend has with his Roku, but I imagine that has more to do with internet speeds and providers as it does with the device.  Overall, I would recommend AppleTV.", "verified": true, "helpfulness": "0/0", "author": "R. Ellis \"Sunflower\""}, {"rating": 5.0, "review": "👍", "verified": true, "helpfulness": "0/1", "author": "Me"}, {"rating": 5.0, "review": "Exited my expectations", "verified": true, "helpfulness": "0/0", "author": "Trackiller"}, {"rating": 5.0, "review": "Apple TV is our only source of television, which we use for both Netflix and hulu, and the occasional movie rental from iTunes.  Everything Apple is awesome.", "verified": true, "helpfulness": "0/0", "author": "kgesmon"}, {"rating": 5.0, "review": "Exellent", "verified": true, "helpfulness": "0/0", "author": "Arlin Alicia Molina"}, {"rating": 5.0, "review": "Product as expected", "verified": true, "helpfulness": "0/1", "author": "Mark A Goode"}, {"rating": 2.0, "review": "it was a bad buy. Never got working and decided to shelf it.", "verified": true, "helpfulness": "0/3", "author": "Azim Sabouri"}, {"rating": 5.0, "review": "It was what he needed", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Heven't set it up yet but I already have one on another TV and love it.", "verified": true, "helpfulness": "0/0", "author": "dolly"}]