[{"rating": 5.0, "review": "This is my second Apple TV (gave one as a gift) and I must say it is a great little device... Shame it doesn't have Amazon prime thou.", "verified": true, "helpfulness": "0/0", "author": "Mario Uribe"}, {"rating": 4.0, "review": "Got here quicker then expected...works great...love it.", "verified": true, "helpfulness": "0/1", "author": "Eddie pugh"}, {"rating": 5.0, "review": "product works well, however sometimes skips or hesitates.", "verified": true, "helpfulness": "0/0", "author": "BigEd \"Ed Veign\""}, {"rating": 3.0, "review": "I like the capabilities of this unit - my cable company won't because after purchasing this, I'm going to be dumping a wide range of overpriced service offerings from my lackluster, customer negligent cable company....the only reason I gave this 3 stars is that when I purchased the unit, it was not operating as described and I had to call Apple Customer support to get it working. The fix was relatively simple, but it wasn't documented in the manual and delayed my ability to use this for several days - it had worked as described right out of the box, I would've given this a higher rating, but first impressions are reflected here - one note to Apple - when you require a serial number for support, you may want to make that serial number readable without requiring the use of a magnifying glass to see it...the font used to indicate the serial number was somewhere between a size 1 and size 2 font....the serial number was that small...it wouldn't hurt you guys to make that readable with the naked eye", "verified": true, "helpfulness": "1/1", "author": "Brian"}, {"rating": 5.0, "review": "Just as described.  Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Harry Kiafoulis"}, {"rating": 4.0, "review": "I love using this to play things from my phone or ipad on my tv. However, to use most features, you have to get a subscription in some form or fashion. I new this going into it, but some buyers don't know. Easy setup.", "verified": true, "helpfulness": "0/0", "author": "Jessss \"I read to find stories that inspire more for my life; more adventures, more expeditions to new places.\""}, {"rating": 4.0, "review": "I recommend this one over the cable, The cable price is $50, just add more $50 and control what you watch while you are setting.The only thing need to improve is to make it work also with windows based computers and blackberry phones.Some languages missing too", "verified": true, "helpfulness": "0/0", "author": "Haitham Hasan"}, {"rating": 5.0, "review": "yes it works great.  I actually kept it in my drawer until this month when my grandchildren were here.  We used it every day and we all loved it.  Thanks and sorry it took me so long to respond.", "verified": true, "helpfulness": "0/0", "author": "Betty Ford"}, {"rating": 5.0, "review": "Apple Tv is awesome! I love it! If you have Netflix it's even better. I canceled my cable and now I watch whatever I want on my tv with this great product. You have to have good internet speed though. And you need an HDMI cable. I totally recommend this item.", "verified": true, "helpfulness": "0/0", "author": "Daniela Afonso"}, {"rating": 5.0, "review": "I've owned about every version of the Apple TV since it was first released in 2007, I now have a library of over 600 movies. It was definitely rough in the beginning, but now it is a finely polished product. If you are serious, as I am, the best performance is to stream you purchased and home movies from a \"server\", I use an old mac mini for that purpose. I set it up 6 years ago and left it running without incident since (occasionally needing to access it for software updates and external hard drive upgrades as my library has grown). Obviously you don't need to set up a server any more like we did in the old days (before Apple obtained the licenses to stream purchased movies) but if you want/need speed the local option will produce a significant improvement.Of course you need to be into streaming Apple's products to make it worthwhile. I've tried Samsung's Smart TV and Amazon's product through that, I have also sampled Netflix through the xbox 360. These are decent and I would not look at this product if these are already meeting your needs. Apple's interface is better, assuming you can exist within its limitations (Apple's ecosystem).I recently bought these through Amazon: Sanus Systems ELM4308 8.2' Super Slim HDMI CableDefinitely recommend these cables for your Apple TV. The device is quite small and light and some of the heavier HDMI cables out there cause the Apple TV to sit askew or worse by gradually dragging it off the stand, which is annoying if you don't want to be stuck gluing it down.", "verified": false, "helpfulness": "0/0", "author": "Postcall"}]