[{"rating": 5.0, "review": "I'm very impressed with design, the quality is very good and I would definitely recommend this product", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "GREAT purchase.  Very happy with it overall.", "verified": true, "helpfulness": "0/0", "author": "Lisa Crawley Sample"}, {"rating": 5.0, "review": "thanks!", "verified": true, "helpfulness": "0/0", "author": "Sherri"}, {"rating": 5.0, "review": "I got it to stream video from my mac to apple TV. It works perfectly using airplay. Anything on my mac I can stream to apple tv with just 1 click.I had google chromecast but it is limited to chromecast apps like netflix or chrome browser.if you have a mac then apple tv is awesome to stream anything - even amazon prime app.It would be nice for apple tv to have more apps installed - but being able to stream any app from mac more than compensates for that.", "verified": false, "helpfulness": "0/0", "author": "Jin"}, {"rating": 5.0, "review": "Excellent product and fast delivery!!", "verified": true, "helpfulness": "0/0", "author": "Maria E. Enriquez"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Franklin Mieses"}, {"rating": 3.0, "review": "I use this thing all of the time, and I think it is nice most times. However, not all apps are available to use if you don't have certain TV providers. For some reason, not much is available to me with DirectTV.  Another annoyance is that Apple doesn't allow use of Amazon Prime on it, so I am stuck to Netflix and HBOgo.", "verified": true, "helpfulness": "0/1", "author": "Jack"}, {"rating": 5.0, "review": "EXCELENT", "verified": true, "helpfulness": "0/0", "author": "cesar garcia"}, {"rating": 4.0, "review": "Very good streaming video device, it never frozen video as some competitors.It costs a little more because, it was built-in 2 bands, dual antenna.With Apple TV we can stream YouTube, Netflix, Movies on demand and a lot more.etc...If you have i-phone, you can use Apple TV to air-play your video on i-phone to display on big creen TV where connecting with Apple TV. Audio output has Optical option connector, this option let you add audio to Digital processing amplifier or receiver, it makes clear digital audio in DTS mode.Next month Amazon comes out Fire Stick with Dual bands and Android O.S. for $39, it may be a touch competitor for Apple TV ($99)  and Google Chromecast (<$35)..Just Wait for Amazon fire stick before buy Apple TV, If Amazon Fire stick is not good, Apple TV is still the best streaming device.One thing, I don't like Apple TV, it is not compatible with some websites when I browses on internet, but Android operation does.", "verified": true, "helpfulness": "2/2", "author": "TuRau \"Movie lover\""}, {"rating": 5.0, "review": "It's Apple TV how much more do I need to say.", "verified": true, "helpfulness": "0/0", "author": "Chase Rich"}]