[{"rating": 5.0, "review": "Definitely hesitant to get this or the Roku 3 but glad I got this. VERY easy set up. I have mostly Apple products so I have fun messing around with the Airplay feature. Wish it was cheaper, but as far as features, it doesn't lack for me.", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 5.0, "review": "the apple tv is perfect and it works great", "verified": true, "helpfulness": "0/1", "author": "rebecca bullock"}, {"rating": 3.0, "review": "It's small it's now cheaper than when  I bought it ,but cheaper still are the Sony  and Samsung disc players without all of the apple add's. It seems to work with limited use so far, I have lost the remote down the side of the cushion on my chair twice.  Profhood", "verified": true, "helpfulness": "1/4", "author": "Donald hood"}, {"rating": 5.0, "review": ":)", "verified": true, "helpfulness": "0/2", "author": "Einar Gunnlaugsson"}, {"rating": 5.0, "review": "Very happy with the apple tv. Always happy with Amazon!", "verified": true, "helpfulness": "0/1", "author": "L davis \"Lynn Davis\""}, {"rating": 5.0, "review": "Works as advertised. Easy to install and we use it more than we thought. Great to watch FaceTime with the grand kids.", "verified": true, "helpfulness": "1/2", "author": "Richard L Herron"}, {"rating": 2.0, "review": "Good product but unreliable performance.", "verified": true, "helpfulness": "1/2", "author": "george"}, {"rating": 5.0, "review": "Amazing product, we are in love as always with Apple. Easy to use I set it up by myself (no husbands help 😉) and it was awesome. We will get a ton of use out of this, very impressed. The air play is such a amazing feature.", "verified": true, "helpfulness": "1/2", "author": "Jen"}, {"rating": 5.0, "review": "What a bargin now that they lowered the price! Now is the time to get it for sure!  Works great as expected.BTW, I bought the bundle version for the HDMI cable that comes with it so I won't have to tie up the one that goes to our xbox!", "verified": true, "helpfulness": "1/1", "author": "Terry Pick \"Expert Mom!\""}, {"rating": 5.0, "review": "Setup fast and easy. YouTube much better than the Stupid YouTube on my Sony Bu-Ray player. Intuitive user interface. Apple fit and finish. Entering characters using remote can be tedious for entering wireless passphrase, etc., but luckily you only have to do once.", "verified": true, "helpfulness": "0/1", "author": "Aardvark8"}]