[{"rating": 5.0, "review": "Purchased a second AppleTV for our living room.  We love that we can play music and video through our other apple devices to the AppleTV", "verified": true, "helpfulness": "0/1", "author": "Davis"}, {"rating": 5.0, "review": "AAAAAA+++++", "verified": true, "helpfulness": "0/1", "author": "chris george"}, {"rating": 3.0, "review": "the unit is cool, however is still growing the televisions over the Internet, so there is little option but to all apple tv is the best", "verified": true, "helpfulness": "0/2", "author": "Enjolras Lins Peixoto"}, {"rating": 5.0, "review": "Works great but I paid to much", "verified": true, "helpfulness": "0/2", "author": "Daddo-1975"}, {"rating": 5.0, "review": "We had 2 Chrome Casts in our house that drove me insane and I wanted to smash them! Now I have the Apple TV in our bedroom and I love it, love it, love it! I couldn't stream from the Lifetime app on my Iphone to the Chrome Cast so I bought the Apple TV so I could mirror the app to my TV. I don't even need to do that since the Lifetime app comes installed on the Apple TV and I can easily stream my shows.", "verified": true, "helpfulness": "0/1", "author": "J. Ruland"}, {"rating": 5.0, "review": "Easy to use for what I need it to do. I like how I can link all of my accounts up to this. Great price too", "verified": true, "helpfulness": "0/1", "author": "Brad"}, {"rating": 5.0, "review": "Excited and use it frequently for the Apple Air...", "verified": true, "helpfulness": "0/1", "author": "Adella Lopez \"Sending to you\""}, {"rating": 5.0, "review": "Fast shipping, product as expected", "verified": true, "helpfulness": "0/1", "author": "J-Smith"}, {"rating": 3.0, "review": "It's alright the connection from my iPhone 5c to the Apple TV isn't that great it slowly follows behind sometimes other than this its good", "verified": true, "helpfulness": "0/3", "author": "Malik Peralta"}, {"rating": 5.0, "review": "Apple tv is smple to use right out of the box and allows me to AirPlay form all my apple devices in just seconds. It made watching shows and movies from my phone a breeze. I highly recommend it to anyone who has Apple products.", "verified": false, "helpfulness": "0/0", "author": "Thomas Ryan"}]