[{"rating": 5.0, "review": "I bought this for my daughter and her family for xmas....as they didn't have cable/satellite....just plain old rabbit ears and can't afford to buy cable/satellite TV. They had heard of it before I had and had mentioned it. And they just LOVE IT !!! They said it's better than any TV subscription they had ever had before and have access to Netflix...hulu...and many others. Their kids love that they can watch cartoons or movies anytime instead of waiting for it to be aired like regular TV.  It was the best investment I have ever made, when it comes to TV products!", "verified": true, "helpfulness": "1/1", "author": "Debrah Nida"}, {"rating": 3.0, "review": "I use this for sharing airplay across a few of my devices and for that alone, this product is worth it. The only thing I hate about it, is the apps to access channels like Disney, ABC, ESPN, etc. You need a cable provider (they don't like satellite companies for some reason) in order to access them. That part is misleading, and no where in any of the documentation either with apple, or here on Amazon, provide that to you. Quite honestly, I would appreciate getting access to my NFL.com, or MLB.com accounts in Apple TV but I can always hope.", "verified": true, "helpfulness": "3/3", "author": "D. Nick \"Eppur Si Muove\""}, {"rating": 5.0, "review": "Apple TV is a great product, bought it for my parents for Christmas and they love it, highly recommended to anyone, especially if you have Netflix/HBO Go", "verified": true, "helpfulness": "1/1", "author": "Sean Taxter"}, {"rating": 5.0, "review": "My room mates and I love our Apple TV.  So many movies to choose from.  My only down side is that you can't add applications.  I think the quality of Roku and other devices is pure trash, so I would never change, but I wish you could add apps to the Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Jordan"}, {"rating": 5.0, "review": "This device was a gift to me. It's simply amazing!!!  I now play music and videos from my iphone and from my itunes acct, directly on my TV.  \"So much fun!!\"", "verified": true, "helpfulness": "1/1", "author": "Kent Scott"}, {"rating": 3.0, "review": "The bad thing is...it is not compatible for xfinity live streaming. You need to upgrade the atv to 6.02 for mirror-feature to work on ipad and iphone.", "verified": true, "helpfulness": "1/1", "author": "puroy"}, {"rating": 5.0, "review": "I bought this for the use of Netflix in the home.  We placed this in the living room but will buy another for my daughter;s bedroom!", "verified": true, "helpfulness": "1/1", "author": "Margaret A. Potter \"mp\""}, {"rating": 5.0, "review": "Why pay more? Same thing for less money! Hooked it up in just ten minutes and it works very well", "verified": true, "helpfulness": "1/1", "author": "Sharon"}, {"rating": 5.0, "review": "This particular Apple TV was purchased as a gift. Our son and his wife are not TV people, but live movies as well as certain TV shows. We knew from our experience that this product is perfect for just that. They tell us they use it often and love it!", "verified": true, "helpfulness": "1/1", "author": "Karen T \"Karen Arizona\""}, {"rating": 5.0, "review": "Exactly what I hoped for: a cinch to watch Netflix, Youtube, etc. on the big screen, to look at photos from the iCloud, and to mirror the iPad or Mac.  One downside is that streaming still not as good as Blue-Ray:  movies jump a little, but this is not Apple's fault.  And really a bargain at $99.", "verified": true, "helpfulness": "1/1", "author": "John B. Affleck \"JBA\""}]