[{"rating": 5.0, "review": "It works great with  my out Apple products, as expected. Our favorite feature is when we are listening to music, our photos from iCloud display on the TV.", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 5.0, "review": "love love love", "verified": true, "helpfulness": "0/0", "author": "Sheryl fausett"}, {"rating": 5.0, "review": "Ii had bought a Vizio smart TV about six weeks ago. It was great as I'd never had any type of Internet TV access. After five days it quit picking up my Wi-Fi signal so I called Vizio. They offered to replace it or give me a refund. I didn't want to wait for a replacement so I told them to send me a shipping label and I would send it back. So in the meantime my brother buys me a Samsung TV which is lots nicer than the Vizio. Only trouble was no smart feature. Okay, I'm getting this money back from Vizio so ill buy a streaming device but there are hundreds on the market. Since I have an iPhone and own lots of music content I thought it would be cool to be able to access all my iTunes stuff on my big screen. I never realized just how much it's capable of doing until I tried it. Three minutes out of the box and I was watching Netflix, Hulu, my own movies and podcasts and listening to the thousand songs I have on iTunes. Now the really amazing part is this. All this without a computer! I no longer own a computer and can do all this through my iPhone and Apple TV. Sixty-four dollars was never better spent. I was concerned that I couldn't get Amazon music and  video content because Apple doesn't support it and Amazon doesn't support iTunes. Really though, why would they when Amazon has Fire, it's own streaming device to access it's web based content? So here's the most beautiful part. AppleTV has AirPlay which will take ANYTHING you can access on an iPhone, iPad, or iPod and wirelessly play it on the big screen without anything needed but the AppleTV device. Less than 4\" square and an inch high it can fit very discreetly under the edge of the TV. You can also get one of the many mounting brackets for 10 or 12 dollars. There's an awesome app for your iOS device that lets you control all features of the AppleTV unit with extremely simple intuitive commands. Swipe right, fast forward. Swipe left rewind. Tap for menu and the like. Another thing is the reception of the wifi signal is amazing. I took my AppleTV on a trip and stayed in a hotel with wifi as they almost all do now. Plugged it in, plugged the HDMI cable into the TV and I had fifteen wifi networks at my fingertips. Of course some were private and locked but in addition to the hotel network there was the McDonalds down the street, Firestone customer courtesy account, another hotel next block over etc. Wifi heaven. So to cut this short and get back to one of the seventy or so preloaded apps on my AppleTV, yes I said SEVENTY, not seven, I'll just say this, you won't ever regret this purchase.", "verified": false, "helpfulness": "1/1", "author": "Jon L. Landau"}, {"rating": 5.0, "review": "Cool item", "verified": true, "helpfulness": "0/0", "author": "Aaron C."}, {"rating": 4.0, "review": "The 3rd gen apple TV is totally worth it, if you're the right person. If you still get cable, then this isn't really necessary. If you don't have Hulu / Netflix / HBO Now, then this isn't really worth it. However, if you do have those apps and want them easily accessible on your TV without plugging a computer in via HDMI (and your computer is a mac newer than 2011), then you'll love this apple TV.P.S. Airplay is WONDERFUL too! It makes this device work with EVERYTHING your computer can do. You could use this to show Microsoft Powerpoint presentations if you wanted to!P.P.S. It's likely a 4th gen apple TV will be released mid Sept. 2015, so if you're buying within a month of my review, you may want to wait.", "verified": true, "helpfulness": "1/1", "author": "Colin Frederick"}, {"rating": 4.0, "review": "The home sharing respone from my macbook was a little slow but its useful. just what i needed.", "verified": true, "helpfulness": "0/0", "author": "Andy Truong \"Andyptruong\""}, {"rating": 1.0, "review": "Lame I have 3 that I will be using as paper weights. the Roku 3 is far superior! Apple restricts the apps on here as per apples usual complete control policy. only thing I would buy from them now is computers.", "verified": true, "helpfulness": "0/1", "author": "Graciela Vigil"}, {"rating": 5.0, "review": "5 star", "verified": true, "helpfulness": "0/0", "author": "Marc Adam"}, {"rating": 5.0, "review": "nice", "verified": false, "helpfulness": "0/1", "author": "william weichert"}, {"rating": 3.0, "review": "I have both an Apple TV and a Roku in my bedroom... long story why.  I like the Apple TV  and I'm an Apple Guy but the Roku Remote is better.  Weird huh?  Here's why.  The Apple Remote looks great, it's tiny but there are two problems with that:1.  It get's LOST all the time.  I seriously spend so much time looking for the bloody remote.  It's under my dog, under a pillow, fell behind the bed.  Because it's so small it's hard to find.  The Roku is larger and therefore easier to find.2.  Another problem with it being so small is that you need to press multiple buttons to do a simple function.  Like let's say you want to skip back or forward 30 seconds.  You have to hit pause, then hold the back arrow for a second or two and release.  Two buttons and it doesn't always work.  But say you want to skip back 90 seconds.  You have to pause, hit and hold the back arrow for a second or two and release.  Then you need to do this again, and again, and again.  For every 30 seconds.  Now if it worked every time, I wouldn't be worried but it doesn't.  Sometimes something weird happens and it takes me to the end of a movie, or a baseball game or back to the beginning.  With Roku I can hit ONE button and I can see on the screen the frame where it's going to take me to and I can hit OK and I'm there.  I LOVE Apple, but offer a different remote, the tiny remote sucks!", "verified": true, "helpfulness": "1/1", "author": "J.W."}]