[{"rating": 2.0, "review": "the search box is difficult to navigate using the remote.....Very Frustrating.Its the only downside I see in the unit so far.", "verified": true, "helpfulness": "0/1", "author": "Daniel Smith"}, {"rating": 5.0, "review": "compacto, sencillo y muy divertido.un buen producto con la calidad que le caracteriza a la empresa  APPLE, no encontré problemas en actualizarla. saludos desde ECUADOR.", "verified": true, "helpfulness": "0/1", "author": "Carlosan3 \"carlosan3\""}, {"rating": 5.0, "review": "I love bing able to stream anything from my iPad, iPhone, and MacBook. Easy setup and great image and sound quality.", "verified": true, "helpfulness": "0/0", "author": "Budrico"}, {"rating": 5.0, "review": "Now I have full access to over 1000 pornos right in my bedroom in full HD. No more wadded up tissues all over the computer room floor! Thanks Apple!", "verified": true, "helpfulness": "4/9", "author": "FreakNasty"}, {"rating": 5.0, "review": "Even though it's under $100, it's still has the great Apple quality.It's very easy to use. It looks cool no matter where you put it.The picture quality is great as well.", "verified": true, "helpfulness": "0/0", "author": "Evan Yang \"Evan Yang\""}, {"rating": 5.0, "review": "Know very little about this product.  This was a Christmas present for someone.  The person who wanted it always spoke very highly about it.", "verified": true, "helpfulness": "0/4", "author": "Rendezvous repair \"Dale T\""}, {"rating": 3.0, "review": "The new version of Apple TV does not have volume control and doesn't work if you are using an amp to send the signal throughout your house.", "verified": true, "helpfulness": "4/5", "author": "Mejojobo \"Sad Neighbor\""}, {"rating": 5.0, "review": "Let's face facts, Roku has more options and gives you more bang for your buck. However, if you own any iProducts or a Mac the screen mirroring makes it worth the extra cash. Plus, your iTunes purchases are readily available as well.My wife and I are in college and while juggling that with taking care of our son, watching our lectures broadcast to our larger tv than on our laptops is convenient to say the least.", "verified": true, "helpfulness": "1/1", "author": "Thereviewer54"}, {"rating": 5.0, "review": "Apple TV is awesome for HD tvs, but if you own an ipad like I do, I personally don't see a good enough reason to pay $100 plus another $25 for iTunes Match, just to use your iOS device on your TV. There's other, easier and cheaper methods which I cannot say ;) but its a cool apple item", "verified": false, "helpfulness": "0/0", "author": "Scott Donato"}, {"rating": 1.0, "review": "This is the worst product that i have ever seen from Apple, for 3 months it was Ok and able to find the network and everything looks perfect and then all of sudden it does not detect wireless network, for few mins it is able to find the network and works and then it does not detected, tried multiple reset and reboot but it does not work.Now it's out of warranty  >3 months and not sure how to replace it.", "verified": true, "helpfulness": "1/7", "author": "Naresh Jampani \"J Naresh Babu\""}]