[{"rating": 5.0, "review": "House full with family over Labor Day weekend. Great way for everyone to share their photos on the 60' TV. So easy to use. Love it.", "verified": true, "helpfulness": "0/0", "author": "michael murphy"}, {"rating": 4.0, "review": "Netflix has rather limited online content.  Apple has all the latest releases on iTunes.  When or when can we have an iTunes subscription service?", "verified": true, "helpfulness": "0/0", "author": "SSS"}, {"rating": 5.0, "review": "Shipping time was great, product is exactly what I expected.  I can't wait to hook it up and see what it has to offer me. currently waiting on tv to do so.", "verified": true, "helpfulness": "0/1", "author": "Zia Nuss"}, {"rating": 5.0, "review": "Works great, got it in no time. Works perfect great for entertaining the kiddos. Easy to use, easy to set up", "verified": true, "helpfulness": "1/1", "author": "Daniel P Lynn"}, {"rating": 5.0, "review": "If you are addicted to Apple products as I am, this thingy needs to be in your Apple ecosystem. AirPlay and AirMirroring are amazing features.", "verified": true, "helpfulness": "0/0", "author": "Ethem Kaan Okcuoglu"}, {"rating": 5.0, "review": "The Apple TV is great. I have one in three rooms of my house. I even keep one in my laptop bag for when I go on trips. Is it worth buying yes, very much so.\"This product was received at a free or discounted price in exchange for my review. I am a technology journalist and pride myself on providing fair and honest reviews. Please feel free to ask any questions you might have.\"", "verified": true, "helpfulness": "1/1", "author": "Nicholas Calderone \"Senior Editor, Co-Founder of MacSources\""}, {"rating": 5.0, "review": "Set up is very easy and fast. Very intuitive interface. I also bought a Roku-3 for another room. The Roku has the advantage of being able to stream Amazon Prime videos. Also the Roku has the remote with the headphone jack which is a great option. If your a big I Tunes user this is the unit to but. If not I would recommend the ROKU-3. Both ran great and easy setup.", "verified": true, "helpfulness": "1/1", "author": "chris"}, {"rating": 5.0, "review": "excellent , I recommend this product. came at the right time . Its very practical, and this is good idea", "verified": true, "helpfulness": "0/0", "author": "leonardo montoya"}, {"rating": 1.0, "review": "I got it so I could watch Netflix on TV. I have not been able to get it to work. It is attached and it will show pictures but not Netfix. A lot of money for nothing.", "verified": true, "helpfulness": "2/12", "author": "Mary Ellen Harriss"}, {"rating": 5.0, "review": "This is one of my most favorite product that I ever ordered from amazon. My family and I watched all days. I have cancelled my TV service since I got this Apple TV because I got everything I want to see.", "verified": true, "helpfulness": "0/0", "author": "Nhut Nguyen"}]