[{"rating": 5.0, "review": "You can mirror your ipad to your HDTV using airplay function. You can stream whatever on your ipad to your HDTV. Just that simple. Easy to setup. Easy to use.", "verified": true, "helpfulness": "0/1", "author": "Dan InGold \"xz38\""}, {"rating": 5.0, "review": "a great product for a great pricei have been using the old apple tv (with the hard drive) and love that and still use it much more than than this new Apple TV.  The only reason I bought the new apple tv is because Apple has decided to stop upgrading the software for the old apple tv (since it wants to exclusively focus on this new apple tv).  Specifically, the new apple tv does the following which the old apple tv does not do:-- you can send video and audio directly from you iphone/ ipad to the new apple tv (for your old apple tv, you can send stuff only from itunes on your computer)-- the interface is much better on the new apple tv-- the old apple tv does not have netflix (not relevant to me because i do not have a netflix account since i watch 2-3 movies a year)As an aside, since Apple has abandoned the old apple tv, you cannot \"send\" music from the old apple tv directly to any air-tunes device (like the zeppelen air); you can only send music from the old apple tv to an apple airport express", "verified": true, "helpfulness": "1/1", "author": "aakay"}, {"rating": 5.0, "review": "After a frustrating experience with a non-functional Roku, I bought this. I had it up and running in about 5 minutes and love the interface. I mainly use it for Netflix, Vimeo and flickr slide shows.", "verified": true, "helpfulness": "1/2", "author": "DivaChalice"}, {"rating": 5.0, "review": "Quite frankly, the Apple TV is the most used consumer electronic device in our house, by far. Surprisingly even more than the TV, to which it is attached, because we stream music directly to it as well, without turning on the TV. It' almost always on, either playing music, showing photos or playing TV shows and movies. We have decided a few years ago that we switch all our electronic devices to Apple products because they can work together so seamlessly. The Apple TV is something like the window to everything Apple; this is the ultimate presentation device. It has access to all our devices and can play or display pretty much all the content we ever purchased/downloaded/created, straight on the big screen.It's super easy to use and the interface is fast and responsive. We own a Samsung TV and a Samsung Blu-ray player, both of which actually have access to Netflix and other online services built-in, but boy ... you don't want to use them, believe me. They are laggy, ugly, have horrific user interface design, bad image quality and crash all the time. Since we don't have a cable box and we don't watch live TV, the TV is just a dumb box that displays the Apple TV's picture. The Blu-ray player is only used to play Blu-rays and DVDs occasionally.True, content on the Apple TV costs money: Netflix, iTunes, etc. However, if you are an adult with a job who otherwise spends over a $100 on cable TV, then the Apple TV suddenly becomes the potent alternative as an on-demand video box and gateway to all the content you already own.A couple of words about the changes between the old and the new Apple TV 2. The new one obviously has higher picture resolution (1080p) but even more importantly the rented and purchased iTunes (and Netflix) contents are also encoded in much better image quality. I wouldn't really notice the increased resolution, but the improved compression definitely makes it a worthy upgrade.Frankly, I don't agree with people who complain about the user interface changes. I think the new interface is easier to use, especially inside the Movies or TV Shows menu, where the submenus are readily available in the pop-up menu on the top of the screen.", "verified": true, "helpfulness": "153/179", "author": "Vagvoba"}, {"rating": 5.0, "review": "i love this item i can watch any movie stop it, cut it off and it picks up where it left off and i can watch the lastest movies anytime i want.", "verified": true, "helpfulness": "1/1", "author": "franchesska"}, {"rating": 5.0, "review": "Like my iPad and iPhone, this device works great as advertised.  It setup easily the first time into my AV system.  I waited for this version to get the 1080p interface.  It looks and works great.  I have actually bought 2 additional units as gifts.  One is connected to a projector in our karate dojo to allow video recording students with instant replay.  It works great.I also have a Boxee Box in my system.  Boxee has many more apps, but I really don't use any of them, so I'll probably use the AppleTV as my default Internet media viewer.As a big bonus, it connected perfectly to my Harmony 900 remote so I still have 1 remote for everything.", "verified": true, "helpfulness": "0/0", "author": "Fred Erickson"}, {"rating": 5.0, "review": "We love the picture quality and ease of use. We highly recommend this product for iPhone/iPad owners, for they can control it with the REMOTE app.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "First off, I am a diehard Apple fan.  I have two Apple computers, iphone and an ipod.  Apple TV is a cool product (as Apple always delivers on) and it does run smooth without any bugs, but when it comes it watching all your web content on one simple device, it falls very short.  I enjoy watching Netflix on it but can't believe there are no options for things like Hulu Plus, HBO GO, Crackle, or any other website that carries video content (ABC, NBC, PBS, etc.) There are better options for an all in one web-to-TV devices like the Roku, Xbox, Playstation and most blue ray players.Save your money and look else were on this Apple product.", "verified": false, "helpfulness": "2/7", "author": "Miles"}, {"rating": 5.0, "review": "I love all of my apple products!  Im actually writting this on my Ipad2.  I've had my apple tv for about two years, and I find myself bringing it from the bedroom to the living room because my wife and I use it so much.  I will eventually get a second, and would definitely recommend this for anyone who enjoys streaming movies, music, or games.", "verified": false, "helpfulness": "1/1", "author": "Baron Barrett"}, {"rating": 5.0, "review": "Initially I had issues related to airplay working consistently at my home but with the good customer care that was resolved. It was not apple tv issue, it was related to interference due to other devices near the router.My youtube watching has increased significantly after buying apple tv. If you have other apple devices at home like iPhone/iPad etc then searching for something in youtube is very easy otherwise it's little painful to type using the remote which comes with it.Overall very satisfied customer with this product.", "verified": true, "helpfulness": "0/0", "author": "kapil gupta"}]