[{"rating": 5.0, "review": "Love watching netflix when nothing good is on tv and my husband watches baseball through MLB.  We also can watch videos from the tv on it too...but I don't know how to do that yet, my sons and husband do though!", "verified": true, "helpfulness": "0/0", "author": "Judy Smith"}, {"rating": 5.0, "review": "Out of the box and working in 15 minutes, its that easy. We mainly stream music and watch youtube and dabble with some of the other apps. It all works great.I was told it was possible to stream Amazon Prime from the iPad through Apple TV but that is NOT the case so this is not the device for you if Prime is what want. This is not an issue in our home because we stream Prime through a Playstation 3.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"Waytogogto\""}, {"rating": 5.0, "review": "It's a great device. Video, pictures, music in streaming. Very easy to conect in the network. Full HD, great image in the TV!!", "verified": true, "helpfulness": "1/1", "author": "vherrera"}, {"rating": 5.0, "review": "price was spot on. cheeper than the apple store in NC. Need this item for class presentations for the iPads", "verified": true, "helpfulness": "0/2", "author": "david null"}, {"rating": 1.0, "review": "I expected an Apple 2 used but packaged normally. Instead I get an dinged up Apple 3 in bubble wrap.  This thing is useless when you're stationed overseas. Oh well", "verified": true, "helpfulness": "1/9", "author": "Eric Mamac"}, {"rating": 5.0, "review": "I recently bought a macbook air (already own a few ipads, and iphones) and this product really makes viewing movies on my TV easy. Previously, I was using a Western digital WebTv HD with a jump drive to stream movies. It was a little cumbersome having to load the movie onto a jump drive or hard drive before I can watch a movie. Now I can just stream it right off my laptop, iphone, or ipad. Also the user interface is easy to navigate and use my HBO Go account.", "verified": true, "helpfulness": "1/1", "author": "Stephen V. Le"}, {"rating": 4.0, "review": "I have an apple centric set up so it was natural for me to choose this over the competing Roku3.  I was worried though as I obtain my movies via DVD and BR rather than through iTunes.I adjusted my ripping process to target the ATV standards and along with iFlicks I have a great workflow for my content.  For playing back the device is great.  Airplay from my iOS or iMac works better than I expected and this makes up for the lack of Amazon Prime on the device.I took a star off because the device does not support DTS or higher audio standards and it also is not capable of transmitting 3D, so I still have to use my PS3 and 3D bluray disks for that.  If it did, I could place my entire collection on my media server....", "verified": true, "helpfulness": "1/1", "author": "40 Something Dad"}, {"rating": 5.0, "review": "I bought it for HBO GO and it looks excellent. The quality makes you forget that you are streaming the video.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Camacho \"Macho Camacho\""}, {"rating": 5.0, "review": "Hello, when you finally are fed up with waiting, clicking backto where you thought your last place was... only to get jacked backto the start.You need an upgrade.This will peel your bandaids and give you what you need, healed and forgetting your pain.Stop thinking, its WD or Ruku, I don't miss my WD live or my 3TB WD MyBook HD, it lost a year's work on me.For shame WD, for shame.an ipad 4 will super complete you air play experience.rock out with accessing your external hard drives from your PC.Then there's the JB........ Done, no cable. Bada bing.", "verified": true, "helpfulness": "1/3", "author": "slautterback \"slautterback\""}, {"rating": 3.0, "review": "The remote is minimalistic to a fault. No Amazon Prime which stinks, the Netflix UI pales in comparison to the XBOX one, some shows will not play more than 1 season and there are other issues.  The internet connection is always awesome and while they are always adding new \"channels\", most of them are require a paid subscription or cable service to access, which makes it difficult when you are cutting the cord from cable so to speak.  It should have a browser as well, would that really be a big deal to add mobile Safari or something?When I was adding a tv in the basement the plan was to get a tv and apple tv, but after using this one in our bedroom for a few months we decided just to get a Samsung smart tv.  Basically the same thing with more features all built in.", "verified": true, "helpfulness": "1/2", "author": "fat40oz"}]