[{"rating": 5.0, "review": "What more can you say.. worked great. solid apple device. Airplay worked great!", "verified": true, "helpfulness": "0/0", "author": "Scott A."}, {"rating": 5.0, "review": "who doesent know about Apple TV", "verified": true, "helpfulness": "0/0", "author": "Shankar Rathnam"}, {"rating": 2.0, "review": "I bought this exclussively to watch netflix. I had a chrome cast for a short time, and netflix stalled, pUsed, skipped, and in short was unwatchable.Apple tv set up was as easy as chromecast. Unfortunately netflix experience is also exactly the same. Then i thought may e ita my wifi. I went and. Baught an apple airport extreme. Set up easy. Tested speed and everything else. Turned out my linksys was just as good. No difference between the two routers. Netflix is still a disaster. It pauses, skipps, loses sound, get staticy. I searched the forums, they said they manually configured DNS settings and fixed the problem. I tried that and it didnt work. I also turned off air play as suggested, and no result. I have cable for wifi, and its fast.One thing i noticed in watching utube with apple tv, was that the videos download very fast. I see the white line fill quickly and then the blue highlight fills as the video plays. Is it netflix issue and not streaming device? Then how come some people stream netflix w/o any issues?I just wanted people to know that it may not be an apple or chrome issue.", "verified": false, "helpfulness": "1/2", "author": "Kay A. \"love2bake\""}, {"rating": 5.0, "review": "Great Item", "verified": true, "helpfulness": "0/0", "author": "Monkey"}, {"rating": 5.0, "review": "They are the best thing since sliced bread. Often imitated but never duplicated", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "Love my Apple TV....the best!", "verified": true, "helpfulness": "0/0", "author": "Madeline Matias \"Madeline Matias\""}, {"rating": 5.0, "review": "get this on apples website when they offer a gift card to iTunes with purchase. I use it every day. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "john william moss IV"}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/0", "author": "Gustavo Saad Soares"}, {"rating": 5.0, "review": "Works Great", "verified": true, "helpfulness": "0/0", "author": "John R. Lawrence"}, {"rating": 5.0, "review": "Cut my cable bill to internet/HBO only with comcast, for $50 a month and ditched cable totally. Use Netfilx and HuluPlus with Apple TV and could not be happier. Saving almost $150 a month now, and still get to watch 95% of the stuff I watched on cable!", "verified": true, "helpfulness": "0/0", "author": "oex \"oex\""}]