[{"rating": 5.0, "review": "This thing is awesome. iPhotos, iTunes, Streaming Radio, YouTube, DailyMotion, or just your Apple computer screen (e.g., stream movies from your hard drive with no . Works great with iPhones and iPads, too... and it's cheap!  Plus you can jailbreak it, stream content without worry of the heavy-handed MPAA (Cinavia, etc.) ruining your home theatre experience.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Apple TV is a great product, but you won't be able to take full advantage unless you own other Apple products.Just like the Roku (or several other set-top boxes), you can use the Apple TV to access Netflix or Hulu Plus, YouTube, and many other channels, as well as to purchase or rent movies or TV shows through the online store.But the killer feature for me is that you can use AirPlay and the Apple TV to watch any video, look at any picture, or listen to any audio on your iPhone or iPad on your TV instead.", "verified": true, "helpfulness": "0/0", "author": "Derrick Doyle"}, {"rating": 5.0, "review": "They keep on adding more and more content. Plus a user interface that actually make sense. I'll be buying the next generation for sure.", "verified": true, "helpfulness": "0/0", "author": "Brian J. Noah"}, {"rating": 5.0, "review": "Apple TV's are the best. No more buying DVD's. The cost of a movie is the same on iTunes. You can listen to your music, watch photo slides and connect to other internet sites.", "verified": true, "helpfulness": "0/0", "author": "NikiJ"}, {"rating": 1.0, "review": "I bought Apple Tv as I had other Apple products and thought it would be easier and fun to play movies/songs directly on my TV via my iphone/ipad or MacBook.. It all worked fine for few days, but after a while there was a huge lag, and movies and songs will hang in between showing buffering ! The movies will not play smoothly.Looks like a complete waste of money.. Will not recommend buying it.", "verified": true, "helpfulness": "4/7", "author": "mayank rathi"}, {"rating": 5.0, "review": "I own two of these and have gifted two more. You can use it for so much more than advertised. Love my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "misspossible"}, {"rating": 3.0, "review": "The Apple TV has some really cool features but this is the most disappointing apple product I've owned.  I consistently have connectivity issues, I hate the oversimplified remote and movies through the Apple store are a huge ripoff to both buy and rent.  The Apple TV costs $100 and then apple expects you to pay $6.99 to rent a movie that you can rent on RedBox for a $1.29 or $3.99 on Amazon.  The remote drives me nuts, it has essentially 4 buttons offering limited functionality and it's hideous and easily lost.  I like the Netflix streaming (although that has a fair share of connectivity issues) and the other nice applications.", "verified": true, "helpfulness": "2/3", "author": "Ryan N."}, {"rating": 4.0, "review": "Okay, I admit it. I'm an Apple Addict. I have three Apple TVs; an iPhone 5 and 5C; an iPad I, II,& a Mini; and several versions of iPod (my 160 Gb iPod is devoted to 700 or so of my Audible.com books). Oh, and my MacPlus, Mac LC and iBooks are stored away because I have a couple Mac Minis.Not boasting, just letting readers know I am an obsessive Apple Addict. So, consider my review accordingly.This Apple TV is a fabulous product that makes viewing my personal photos and videos, as well as my extensive video library on my Mac embarrassingly easy. Back when I worked overseas I downloaded full seasons of Monk, Battlestar Galactica, Star Trek Movies and, my favorite series of movies, The late Tom Laughlin's creation, Billy Jack.My one regret with this version of Apple TV is, there is no storage. I feel it would be superior if it came with 2Terrabytes storage, eliminating the need to keep the Mac turned on.Of course, just as many other Appel fans, I keep expecting Apple to announce the have developed the ultimate smart TV. I can only dream of what Apple will come up with.", "verified": false, "helpfulness": "1/1", "author": "C William Anderson \"Charles Wm Anderson\""}, {"rating": 1.0, "review": "If you buy an apple service like iCloud, a movie on apple TV, etc. expect nothing but problems. Password issues are the most prevalent. Never ever change your password...for no reason...ever! You will never get them in sync again. The appleid.com site will only make your problems worse. My latest issue, which caused me to write this was buying a movie on apple TV. I had a password issue which I had given up on. My wife finally got it resolved at 5am and she rented a movie for $5.99. Then she happily told me that I could watch it the next night. When we finally looked for it in \"settings\" and found the movies rented line, the little irritating circular thing that drives me crazy on my PC just kept spinning and spinning. The net was that I could spend an hour on apples worthless help line or piss away the six bucks. If your up for the aggravation of working with all this stuff then have at it. But for me, the promise of the technology age will never materialize, we will only lower our standards to accept it.", "verified": false, "helpfulness": "1/4", "author": "P. H."}, {"rating": 4.0, "review": "I haven't watched actual television for the past 3 weeks! I gave it 4 stars because it seems to loose connection kinda often, while my other gadgets never do.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}]