[{"rating": 2.0, "review": "I don't own one of these but I have several friends who do, and I am familiar with them.  They are OK for what the do, and they do work as specified right down to that comfortable feel Apple kool-aide drinkers get with Apple products (I'm not an Apple hater, I have an iPad3 and and iPod Touch).  If this were the only option out there it would be fine, and for $99 it might even be attractive.  However, for under $130 you can get a BluRay player that will allow you to connect with many more video sources and also allow you the option to play just about any kind of disk video media you happen to have around.  I have a $129 (street) player manufactured by Sony and I have yet to exhaust the number of video sources it offers in its standard implementation.  For example, I get Yahoo, Netflis, Vudu, Crackle, Hulu +. amd about 15 other sources (many of them offering free content).  My player plays any disk I insert into it so it doubles as a DVD player, a CD player and a SDHD media player.  It also has connected to each of the 6 WiFi routers I connected to.  So, for $30 the choice was very clear to me.  The Apple TV source media availability is much inferior to my BluRay player and it has no where the versatility in that it can't play disks.  If they offered it at about the $50 price point it might become attractive to some people who have assessed their options.  However, for me to consider one, they would have to price it at about $20, which still would give Apple a fine return on the hardware and they still get to sell you iTunes!", "verified": false, "helpfulness": "1/7", "author": "Moss Parker \"moss_parker\""}, {"rating": 4.0, "review": "I am a cord cutter, meaning that i get all my video and tv entertainment from the internet instead of regular cable TV.with my brother, we share a netflix and HULUplus accounts, as well as amazon prime. I have been using my playstation as my entertain center, connecting to the TV and nflx/hulu/amzn accounts. i have tried the boxee and roku but the Apple TV is the only one worthy enough to cause me to switch over.Apple TV is now great with airplay, when you view something on phone or computer, you can quickly pop it over to your TV! its magical and has worked really well.As more and more independent film-makers put movies on youtube and vimeo, this will be better and better!I still dislike the netflix viewer on appleTV.If anyone has any questions, definitely let me know! My question that i haven't figured out yet is can i use this to create a 2nd monitor from my laptop? so i want my laptop to be monitor 1 and tv to be monitor 2 through my apple TV... if anyone knows, would be fun.", "verified": true, "helpfulness": "0/0", "author": "Scooby Doo"}, {"rating": 5.0, "review": "I use the Apple TV as my main television source. Between Netflix, iTunes, and the available networks/channels my needs are well met. A convenient thing is the podcasts on iTunes are easily viewed, making viewing of a diverse array of programming simple. Plus, I can stream my own iTunes collection through my TV on iCloud, the most seamless personal entertainment system ever!But, it is tweaky. My box crashes at least once a day and has to be rebooted. This seems to relate more to how well my computer, router, and the apple TV box play together than the box itself. But, the box is a factor in this problem. The selection of channels/networks is a bit limited compared to Roku. But, this is overall a better system.", "verified": false, "helpfulness": "0/0", "author": "Gerry B."}, {"rating": 4.0, "review": "This device works as advertised.  But I can't give it a 4+ stars, as it disabled the apps download -- making it less useful.", "verified": true, "helpfulness": "0/0", "author": "Y. Hou \"M&m;\""}, {"rating": 4.0, "review": "It is a good product and cheap for what you get...nevertheless I think that is a little closed for example to have a browser in the TV without using a iPhone or iPad...But you have a product easy to configure, to use.For my childs it is great for example with netflix, youtube, etc....", "verified": true, "helpfulness": "0/0", "author": "Federruco"}, {"rating": 5.0, "review": "The AppleTV may get smaller, but it is a pretty big contender.I was originally looking for about any other streaming box that had HDMI and optical, but when the Roku lost it's optical port, I started to look back at the AppleTV. I would do little more with the AppleTV than carry it around the nearest BestBuy, and put it down before leaving. Take three, however, brought 1080p, more RAM, a better processor, and a new interface. The streaming services seem to be getting an upgrade, as is the content.Truth be told, my real reason for getting this little guy is because dlna music capabilities suck on my blu-ray player. I listen to music constantly, and using Remote to control iTunes in my office while AirPlay makes all the sound come from my home theater in my living room is OH so easy! AirParrot lets me put my computer on the TV for some killer web browsing, and those hard to stream movies work pretty well over the Parrot, as well.This is a niche device for me, but I do have some pros and cons.Pro:Setting up is incredibly easy.AirPlay from damn near anything1080pCachingOptical outputIntuitive menusAttractive designGreat remote -- satisfying clickCons:Updates interrupt playbackOccasional erratic behaviorNo Slacker RadioI haven't connected my friend's Netflix account to this little guy, because my BDP-s590 does such an amazing job, but it may be an incredibly capable Netflix player.Be sure to enable AC3 in the settings if your system supports it.", "verified": true, "helpfulness": "0/0", "author": "M. Watson \"Sleeper Ninja\""}, {"rating": 5.0, "review": "It works just as adevertised, no surprises and no problems.  I deffinetly recomend this product if you want to use iTunes and Netflix as your video streamming option.", "verified": false, "helpfulness": "0/0", "author": "Lpmb"}, {"rating": 5.0, "review": "I have been working to solve a long standing problem I had of how to get all the digital content I own (music, photos, videos) from my computer to my main entertainment system.  I decided to try the AppleTV as a solution to this problem and not only has it solved my problem, it provides what I have found to be the best source for additional video content - both TV and Movies.  The iTunes library has what I have found to be the largest and most current source for the content I either rent or choose to buy.  I also recently subscribed to iTunes Match and simply turned on that feature on the AppleTV and I am now enjoying higher quality versions of all the songs I own!The product is quite small and puts itself in a sleep mode when not in use so it does not generate a lot of heat in my system or take up much room.  The quality of the picture and sound is HD and the user interface is similar to navigating through an iPod or iPhone.  Your content is easy to find and access and content for rent or sale is easy to browse.There are also several third party 'apps' that grant access to their content (like NBA.com or Netflix) but I have not used them as they usually carry their own subscription and the iTunes content is more to my liking.I have heard the potential that Apple will allow developers access to AppleTV to begin to create apps for this device as well - this would only enhance what has provien to be a great solution to my entertainment problem.", "verified": false, "helpfulness": "3/3", "author": "Needle"}, {"rating": 2.0, "review": "Very easy to use as most Apple products, but of course limited to a few sources of content. But I'd be fine if that were the only issue, as we know Apple likes to choose for us. What I find annoying are the constant reboots I need so that remote would resume working. It also has a big buffering issue with Netflix to the point that it sometimes becomes unpleasant to use (something that doesn't happen when watching on PC or iPad). Would give it a 5 star if it worked as advertised.", "verified": false, "helpfulness": "4/9", "author": "Rod"}, {"rating": 2.0, "review": "I bought this over a year ago (not the new, new one) mainly for Netflix and photo/video sharing between my MBP, Ipod, Ipad, and my Panasonic 7.1 system. I used to have a wobbly TV dinner table next to my 65\" Panny Plasma for a laptop to connect via a HDMI.First, the Netflix video is spot on. Looks just as good as standard DVD. Last year, I experienced many video stoppages, and skips, and generally bad video performance. They must have fixed these problems because I have had no issue for almost a year.The bad, while you can stream video from Ipod and Ipad to ATV - you cannot stream them from your Imac or your MBP. YES I know you can use silly Itunes - however, I HATE ITUNES. I refuse to use Itunes because it is too controlling - it wants to become the end all be all media center. I deleted Itunes shortly after getting my MBP because it would not allow me to burn any of my music without my credit card info. It was my music I paid for previously and I do not give out my credit card info!Sadly, without the capability to hookup to my MBP, I can only give this product a 2 out of 5. (1) for ease of connectivity with my Ipad and Ipod, and (1) for the clarity of video on my screen when using Netflix. It is seamless with Netflix.", "verified": false, "helpfulness": "3/11", "author": "kchercmech \"Bo\""}]