[{"rating": 4.0, "review": "It took several attempts to get it running; a few phone calls to the cable company got it going. Now I enjoy it very much!", "verified": true, "helpfulness": "0/0", "author": "Nancy Pariseau"}, {"rating": 3.0, "review": "Has a lot of options, does AirPlay, is from Apple... seems to have it all.  That is, until you need to update it!  Say good bye to the next 30-45 minutes while it does it's thing so it can bring you another menu item you'll never use.  Seriously, if they are thinking about next iteration, they might want to add some processing power and storage performance to this device.  I refuse to believe these updates should be taking so long when they deliver so little in return.  I've since bought a Roku 3 and have yet to need to reboot the device AT ALL, whilest the ATV needed continual maintenance when it came to running Netflix for me reliably.  Giving up paid off, I guess.", "verified": true, "helpfulness": "1/1", "author": "Evan Graham"}, {"rating": 5.0, "review": "excellent like all the products of apple", "verified": true, "helpfulness": "0/2", "author": "Juan Diego Moreno Arias"}, {"rating": 5.0, "review": "Very nice. Durable and easy to use. Highly recommended to watch Netflix or Youtube. Control works just perfect as well. I also have a basic Roku model and it does not match this device.", "verified": true, "helpfulness": "0/1", "author": "Allan Araya Martínez"}, {"rating": 5.0, "review": "Little, nice, usefull.", "verified": true, "helpfulness": "0/2", "author": "bettina zanardo"}, {"rating": 5.0, "review": "it's very useful. I think of it as the best investment i ever did.", "verified": true, "helpfulness": "0/2", "author": "Sanat"}, {"rating": 5.0, "review": "I purchased this as a gift for my Father and he loves it. It easily syncs with our iphones, ipads, and macbook.", "verified": true, "helpfulness": "0/2", "author": "Melissa"}, {"rating": 4.0, "review": "No where near as good as Roku, but works with Apple servers where Roku does not, which is why we ended up with Apple TV.", "verified": true, "helpfulness": "0/1", "author": "BF \"0bfk0\""}, {"rating": 3.0, "review": "Not all apps work with all cable companies. They restrict some apps from using AirPlay.", "verified": true, "helpfulness": "0/0", "author": "major treble"}, {"rating": 5.0, "review": "Works great.Simple and very affordable", "verified": true, "helpfulness": "0/1", "author": "Cl"}]