[{"rating": 5.0, "review": "I want to start this review by stating that I am not an Apple elitist. I prefer and love my PC so I will give my best unbiased review of the AppleTV. My reason for buying the AppleTV was three fold: (1) I wanted the ability to integrate my home theater system with my computer media (music, movies, and photos) both wired and wirelessly, (2) I wanted to project what I was doing on my iPad to my television for guests to see without having to look over one persons shoulder, and (3) I wanted to easiest user interface for both my family and guests to be able to use without needing assistance.With those three items in mind, the AppleTV has met each one of my needs. It has the functionality of streaming internet videos as well through Netflix, YouTube, etc... but those are all just icing on the cake. As far as the hardware product itself, the newest version of the AppleTV has added the functionality of 1080p which is why I waited to purchase the newest model. Apple was behind the market in this category as other competitor products had 1080p capabilities long before. A quick rundown:Pros:(1) The accessibility of integrating your entire home theater system with your personal media collection from your computer or iPad.(2) The ability to mirror the iPad display for everyone to see on the TV.(3) The ease of the user interface for first time users.(4) As a plus, the size of the product is extremely small and easy to install. Only requires a power outlet and an HDMI cable.Cons: Apple's locked down software only allows for videos in your iTunes account to be viewed on the AppleTV. Knowing that before I purchased, I did not take away a star.Summary: I knew what I was getting before I made my purchase of the new AppleTV and it did not disappoint. In fact, because of the ease of installation, use of interface, and quality build of product it has met and in some ways exceeded my expectations. I await the day when the PC market will produce similar products with superior user interfaces.", "verified": true, "helpfulness": "22/30", "author": "Yesenia"}, {"rating": 5.0, "review": "Easy to set up, easy to use, great HD display.Apple has done a great job with this Apple TV", "verified": true, "helpfulness": "0/0", "author": "Carpavor"}, {"rating": 3.0, "review": "So I had last year's version, and it worked quite well. This year's model has the new UI. I'm not sure if it's the UI or the hardware, but this year's model is significantly more buggy than last year's. Sometimes I'll catch it turning on out of the corner of my eye. It'll turn on for an hour then turn itself off. Very annoying because the remote is IR, so you can't hide it behind other things.", "verified": true, "helpfulness": "0/1", "author": "Andy B"}, {"rating": 5.0, "review": "EXCELLENT PRODUCT !!!Especially when looking up movies/shows by the actor-lookup !I used pretty much most TV-box devices, and this one has the best user interface to make movie-rental decisions", "verified": true, "helpfulness": "0/0", "author": "Jane \"Corinthians CH13V7\""}, {"rating": 4.0, "review": "Got one of these  from the Apple store as a Christmas gift for my parents, since they wanted to watch MLB, and to use their iPad to stream/airplay music to the speakers on their back porch. We got it set up no problem, but the second time they tried to use it, it was completely dead.Unfortunately, due to a random series of events, we didn't make it back to the Apple store until May, but they still exchanged it for a new one. As for the unit itself, I find it to be adequate at what it does. I wish there was a setting where you could tell it to only do airplay through the TOSLink audio port on the back, but it's all or nothing.", "verified": false, "helpfulness": "0/0", "author": "WorknMan \"worknman\""}, {"rating": 4.0, "review": "It works well with Netflicks but I with it supported flash viewing.It's easy to use and it installs in no time at all.", "verified": true, "helpfulness": "0/0", "author": "John cal"}, {"rating": 5.0, "review": "es muy estable en la conexion, emite imagenes en hd, y muy sencillo de operar.Apple TV MD199LL/A [NEWEST VERSION]", "verified": true, "helpfulness": "0/2", "author": "kenneth grey"}, {"rating": 5.0, "review": "I will always be loyal to my Apple products, and this one for sure has yet to let me down!It is fast, has heaps of cool features like Airplay, Remote App, and many other devices.Make sure you don't buy a blu-ray streaming player if all you use is youtube etc. The interface and remotes that come with other blu-ray streaming players don't function as well as this TV.Going to buy one for my wife for Christmas, oh and it looks great too so that's a bonus.", "verified": false, "helpfulness": "2/2", "author": "Robert CC"}, {"rating": 5.0, "review": "I use this to watch NetFlix and to stream music from it onto my TV.  It is very clean and light weight and you barely notice it since it's so small.  You can also use your iphone/ipad alongside Apple's \"Remote\" app to control the ATV from it.  Well done Apple.  Well done.", "verified": true, "helpfulness": "3/3", "author": "Narto Gunawan \"Felix Gunawan\""}, {"rating": 2.0, "review": "I don't own one of these but I have several friends who do, and I am familiar with them.  They are OK for what the do, and they do work as specified right down to that comfortable feel Apple kool-aide drinkers get with Apple products (I'm not an Apple hater, I have an iPad3 and and iPod Touch).  If this were the only option out there it would be fine, and for $99 it might even be attractive.  However, for under $130 you can get a BluRay player that will allow you to connect with many more video sources and also allow you the option to play just about any kind of disk video media you happen to have around.  I have a $129 (street) player manufactured by Sony and I have yet to exhaust the number of video sources it offers in its standard implementation.  For example, I get Yahoo, Netflis, Vudu, Crackle, Hulu +. amd about 15 other sources (many of them offering free content).  My player plays any disk I insert into it so it doubles as a DVD player, a CD player and a SDHD media player.  It also has connected to each of the 6 WiFi routers I connected to.  So, for $30 the choice was very clear to me.  The Apple TV source media availability is much inferior to my BluRay player and it has no where the versatility in that it can't play disks.  If they offered it at about the $50 price point it might become attractive to some people who have assessed their options.  However, for me to consider one, they would have to price it at about $20, which still would give Apple a fine return on the hardware and they still get to sell you iTunes!", "verified": false, "helpfulness": "1/7", "author": "Moss Parker \"moss_parker\""}]