[{"rating": 4.0, "review": "Works great. High quality.", "verified": true, "helpfulness": "0/0", "author": "Kido, Yosuke"}, {"rating": 5.0, "review": "Great product !", "verified": true, "helpfulness": "0/0", "author": "Wendell"}, {"rating": 5.0, "review": "Item arrived as described", "verified": true, "helpfulness": "0/0", "author": "David G. Pope"}, {"rating": 5.0, "review": "again, just a nice device that works from apple. We love airplay and love how apple tv organizes the streaming content. If you want simple and quality you will need this device.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "I love my Apple TV. Works great never had a single problem have had it over a year. I love the AirPlay feature, allowing you to transfer the display from my iPhone, iPad or iPod. The apps that are installed work really well. You won't find as many apps as many other devices.  Being able to use my iPhone as the remote is very convenient especially since my household is very prone to losing remotes. Would recommend to anyone and everyone.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Schupp"}, {"rating": 5.0, "review": "A++ excellent product, excellent seller", "verified": true, "helpfulness": "0/0", "author": "oscar"}, {"rating": 5.0, "review": "Luv It!", "verified": true, "helpfulness": "0/0", "author": "David Orrico"}, {"rating": 3.0, "review": "It's ok....", "verified": true, "helpfulness": "0/1", "author": "HectorUNO"}, {"rating": 5.0, "review": "Product is great took 3 weeks to get delivered way past promised delivery date", "verified": true, "helpfulness": "0/0", "author": "Juan S. Garcia Jr."}, {"rating": 5.0, "review": "Having been an Apple fan since day one, I'm surprised it took me this long to get to Apple TV, but I am SO glad I did.  Simple clean design, as with all Apple products.  Just plug it in and it works.For me, the remote may be almost TOO simple.  (unless I am missing how to properly use it).  It seems that when you are several menus down in a service, such as Hulu, the only way to \"back up\" is to keep hitting menu to go back, back, back.  Would be nice to have a MAIN menu button to quickly get back to the top.Aside from that, totally satisfied and I LOVE the iCloud integration.  As long as no celebrities hack into MY photos.", "verified": true, "helpfulness": "0/0", "author": "Jim Oneill"}]