[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Marc hicks"}, {"rating": 2.0, "review": "I'm sure that it is fine for some people. I'm just not going to pay for every show I would watch from online sources. I expected a bit more free content. Plus, I'm not going to stream that much from my iPhone or iPad. Nothing wrong with the product that I could tell - just not worth it to me.", "verified": true, "helpfulness": "0/0", "author": "Travis Marlatte"}, {"rating": 5.0, "review": "love it and great deal", "verified": true, "helpfulness": "0/0", "author": "kimberly"}, {"rating": 5.0, "review": "I seem to have to own all of apples products out their. I remember the first time I turned my Apple TV on. I couldn't believe how incredible the interface was, it looked fantastic. Also for some reason it just seems to make the picture quality of images and movies so much clearer, and brighter. Their is just so much to do on it. I totally recomend this to anybody looking for an add on to their TV.", "verified": false, "helpfulness": "0/0", "author": "paul"}, {"rating": 3.0, "review": "Expensive. But if you have a IOS device, you are kind of stuck with using this option vs. FireStick or ChromeCast", "verified": true, "helpfulness": "0/0", "author": "EJC"}, {"rating": 5.0, "review": "Works great. Love it!", "verified": true, "helpfulness": "0/0", "author": "William E. Kendust"}, {"rating": 1.0, "review": "After setting up the apple TV to mirror my wife's ipad or iphone, it is very unreliable.  Sometimes the mirroring doesn't work at all.  Sometimes it is really slow.  WiFi in my house is great (AC1750) and signal at TV is great.  TV has no problems with connection.  1/2 the time I turn on the apple tv, it can't get on the wifi, but then when I goto settings, it connects right away.  I would definitely not buy it again.", "verified": true, "helpfulness": "0/2", "author": "andrewstrauss"}, {"rating": 5.0, "review": "I would have lousy tv without it. picture is dependable, consistent and clear", "verified": true, "helpfulness": "0/0", "author": "Gloria B."}, {"rating": 3.0, "review": "Works well with Hulu, Netflix, Youtube & airplay use.  I use these a majority of the time and cut my cable.  It would be nice if I didn't have to offer tv providers for pretty much every other streaming option provided or pay extra per month,  but that isn't on Apple as much as the other parties.  What is absolutely horrible is trying to stream anything I have bought off of itunes.  It takes hours sometimes before it will allow me to play a half hour long show.  And forget all the movies I have ever purchased.  Anyone with kids 4 and under can understand that telling your kid that it will take a couple hours for them to be able to watch the Lego Movie can be disastrous, and predicting what they may want to watch a few hours ahead of time is impossible.  It'd be easier to just buy the movies/tv shows on amazon and airplay them from an ipad and kill the battery....or just get a streaming device that has amazon prime installed so you don't end up with a load of devices tied up.", "verified": false, "helpfulness": "0/0", "author": "Tiff"}, {"rating": 5.0, "review": "love this apple tv", "verified": true, "helpfulness": "0/0", "author": "John Ciaccio"}]