[{"rating": 5.0, "review": "Airplay works with my iphone and ipad and now airplay from OSX.  I have 3 connected to the TV's in our house.", "verified": true, "helpfulness": "0/1", "author": "sesquipedalian"}, {"rating": 5.0, "review": "I love the little box.  It doesn't clutter up the shelf.  It  works great and I like to be able to choose what I want to watch.  No more cable bill!!!  :)", "verified": true, "helpfulness": "1/2", "author": "mom/teacher"}, {"rating": 4.0, "review": "Works as advertised.  Not a lot of apps.  Air Play is great! . . . . . . . .", "verified": true, "helpfulness": "1/1", "author": "Chris Seeke"}, {"rating": 5.0, "review": "Got my apple tv very quick and the apple tv works great..... Overall I was very satisfied with the product.", "verified": true, "helpfulness": "0/0", "author": "Hunter Contreras"}, {"rating": 5.0, "review": "Absolutely no question as to whether anyone should get this if they have more apple devices. With Airplay, having the ability to stream from one device to the TV is wonderfull", "verified": true, "helpfulness": "0/0", "author": "Liam Hennessy"}, {"rating": 5.0, "review": "The Apple TV is a wonderful product.  Can watch Hulu Netflix etc. I have apple cloud so can stream all of my music, movies, tv shows, pod casts, etc onto my TV.  Way cheaper than satellite TV and you wont need it with the Apple TV device, Unless you have to have a ton of TV shows all the time.  This is compact and takes up hardly any room and is a typically high quality Apple product.", "verified": true, "helpfulness": "0/0", "author": "C. Bassford"}, {"rating": 4.0, "review": "I had the original version with 40GB hard drive, which we used religiously for movie rentals, trailers, photo viewing, and YouTube.  Had some Christmas money to spend on Amazon, so decided to spend it on the latest version.  Much slicker interface, and appreciate having Netflix onboard vs. on my Sony BD player, which is very klugey to navigate (with an erratic connection quality).  Would give this device 5 stars if it had 3D content channels available, but nothing there yet I'm aware of.  Another great Apple product.  Bring on the Apple television!!!", "verified": true, "helpfulness": "0/0", "author": "Brad Bobzien"}, {"rating": 5.0, "review": "Apple TV is the best, Lots of Movies in the store, Youtube watching and Airplay is great and fast.I recommend it to everyone especially to people who own Apple devices.", "verified": true, "helpfulness": "0/0", "author": "Auser"}, {"rating": 5.0, "review": "Love the functionality of this. Netflix, share screen with Mac and more..simply all you need in a streaming box. Had the Apple TV 1 , an updated to the new version.", "verified": false, "helpfulness": "1/1", "author": "Great"}, {"rating": 5.0, "review": "If you are committed to the Apple ecosystem, the Apple TV (latest version) is a must have.  It allows you to stream all of your content from your main computer iTunes account to your TV in a superlative manner.  Additionally, you can stream purchased content directly from the iTunes store -- if you have purchased the content from Apple, you can stream it if you have a sufficiently fast internet service.  The newest software version of this device also allows you to access certain other content providers including Netflix.  Unfortunately but not surprisingly, this device does not allow you to access your Amazon Video-on-Demand account, which is truly a shame.  Nonetheless, this device does a lot and does it extremely well.I have been using Apple TVs since the second version, and it has come a long way.  This latest version unfortunately does away with the on-board hard-disk, which allowed one to place content directly on the Apple TV.  This was helpful for use in boats or RVs, where you might not have WiFi, internet, or the ability to stream from an iTunes computer.  On the other hand, the setup and use of this device is almost completely intuitive, and there is essentially no real setup procedure to speak of.  The device goes into sleep mode after being idle for a time, but simply click the remote and it immediately wakes up.  This works perfectly and effectively, and cures the grip that everyone had with the earlier Apple TVs, which was that they always ran warm, causing users to question the service life of the component.Overall, this is an elegantly engineered and well thought-out accessory that is a pleasure to use.  If iTunes is the major source of your content, this device is nearly perfect.  If not, you can still stream Netflix and certain other content providers, but it is somewhat limited in this regards.  RJB.", "verified": true, "helpfulness": "0/0", "author": "Roger J. Buffington"}]