[{"rating": 5.0, "review": "It has to be one of the best products I've bought in a while. I use it almost every day.", "verified": true, "helpfulness": "0/0", "author": "tom reynolds"}, {"rating": 4.0, "review": "Pretty lame that it doesn't have Pandora, but otherwise, everything works. The apple version of Pandora (Apple Radio or something) sucks because it forces you to WATCH commercials and no matter what you do, the sound will keep playing even if you try to go to the home screen. Very annoying.", "verified": true, "helpfulness": "0/0", "author": "Unavailable"}, {"rating": 3.0, "review": "I researched this and Roku thoroughly, and I am pleased that I am getting what I expected out of Apple TV. There is a lot you can do with it when you have other Apple devices that you stream media from. I would like to see Apple offer more free access to things like sports and news.", "verified": true, "helpfulness": "0/1", "author": "Jeff Simpson"}, {"rating": 5.0, "review": "I like how the appleTV just works.  The channels are abundant with a new PBS app and Smithsonian Channel app as well as the regular Netflix and Hulu apps and more.TIP:  If you click and hold on an app, it will select it, and not open it, and allow you to then relocate it with the arrow buttons.  This can help to stick apps you don't use at the bottom and bring ones you love up to the top for easy accessibility.", "verified": true, "helpfulness": "2/2", "author": "D. L. Beard"}, {"rating": 3.0, "review": "I got an Air recently and thought this would be a great replacement for the PC plugged into the tv.  Airplay would be really cool!Nope to both.  The apps were slow and clunky and the video quality was worse.  The home screen is full of stuff I don't want on my home screen (that's very very minor, though).  The Apple TV only works on wifi, so despite being 1 foot from my router and having an Ethernet port it still had to be wireless.  Not sure why they won't just let it work on the Ethernet port.  But airplay only worked (the little it worked) on wifi.Netflix is something we use daily.  We both hated the app on Apple TV.  Slow and clunky.Same for crunchy roll.I didn't notice an Amazon instant video app, so that means we still need the PC.I'd have still kept it if airplay worked well.  But it didn't.  In fact airplay got netflix to work ONCE.  After that it didn't work again.  I wasted my one use on Red Dwarf.  (The holoship episode).Sadly that was also the case for airplaying my display from the Air.  It worked one time after trying half a dozen times.  That one time it was not impressive, the display was in a window on screen.  At no time did the display scale and fill the screen so it was too small to really see.  I tried it a dozen times after that and it didn't work again.  The Air would try and try.  A couple times the Apple TV went black but didn't display the Air screen.What was cool is that my TiVo came up when I tried to airplay one time.  I will have to check that out.  The letters wore off my TiVo remote so I couldn't get my password punched in, but I'm intrigued.  If I can airplay to my TiVo I really don't need Apple TV.I wanted to love it as much as I f'n love this ipad Air, but I couldn't.  It just isn't ready to replace a PC plugged the tv.  I want to give it two stars, but I realize that not everyone has a PC or the layout for that to work.  If I didn't have a PC I'd have probably loved it, even without the airplay. I'd have said 4 stars in that case.  Hey diddle diddle, a three.", "verified": true, "helpfulness": "0/2", "author": "david laufnick"}, {"rating": 1.0, "review": "Cannot return with Amazon. Past my \"time period\". Totally crapped out and does not work. Should at least be able to exchange this item.", "verified": true, "helpfulness": "1/5", "author": "Tom Geen"}, {"rating": 4.0, "review": "Would be more useful if you weren't locked into only Apple's formats and marketplace.But it does a good job as Apple's portal into your pocketbook.", "verified": true, "helpfulness": "0/0", "author": "Brevemike"}, {"rating": 5.0, "review": "I own both the Apple TV 2nd generation and 3rd generation. For most people, the 3rd generation is the way to go. It offers improved performance in several key areas over the 2nd generation Apple TV. But if you want to jailbreak the AppleTV, you can't with the 3rd Gen so you'd want to find the 2nd Generation.From an appearance standpoint the two generations look identical. It's what is inside that makes the big difference.Here are the notable improvements in the 3rd Gen Apple TV. ➺ it supports 1080p/720p, whereas the 2nd Gen only supports 720p ➺ it has a faster on-board chip, the A5 vs the A4 chip in the 2nd Gen. ➺ it supports 5GHz networking whereas the 2nd Gen only supports 2.4GHzThe faster A5 chip really makes a noticeable difference in navigating the interface. And of course since the Apple TV now supports 1080p and has 5GHz networking, the A5 chip helps enable that higher spec performance.The back of the Apple TV has, from left to right: ➺ AC plug ➺ HDMI port ➺ MicroUSB port ➺ Optical Digital output which supports Dolby 5.1 Surround Sound ➺ 10/100 Base-T EthernetIncluded in the box is an AC power cord and an Apple Remote (IR.) Concerning the remote, since it is infrared, the AppleTV has to be able to \"see\" the remote or you have to bounce it off walls or ceiling to control the AppleTV. The best alternative is to use the app and control the AppleTV from your iPhone.The available content on the Apple TV has been greatly expanded with this newer generation. Here are the highlights of great content available: ➺ Netflix - ➺ Hulu Plus - paid content ➺ HBO Go - access to HBO programs if you subscribe to HBO already ➺ PBS ➺ ESPN ➺ ABC - doesn't yet work with Time Warner Cable ➺ NBA - premium but some free content ➺ NHL - premium but some free content ➺ Crackle - movies and tv shows similar to Netflix ➺ Bloomberg ➺ skyNEWS ➺ Trailers ➺ Weather ➺ KORTV - Korean station that offers video on demand - free and premium content ➺ Disney Channel - doesn't yet work with Time Warner Cable ➺ Disney XD - doesn't yet work with Time Warner Cable ➺ Disney Junior - doesn't yet work with Time Warner Cable ➺ Smithsonian ➺ Yahoo Screen ➺ iCloud Photos ➺ iMovie Theater - iMovie projects that you share to the theater ➺ Podcasts - ➺ YouTube - video sharing ➺ Flickr - photo sharing ➺ Vevo - music videos ➺ Vimeo - video sharing ➺ MLB.TV - Major League Baseball - some free content but a premium subscription is $24.99/yr ➺ Qello -  HD concert films and music documentaries - $4.99/mo ➺ Crunchyroll - anime on demand ➺ MLS - Major League Soccer ➺ Radio ➺ WSJ Live - programming from Wall Street JournalThat's quite a line-up and I'm certain Apple will be adding more content as time goes by. Keep in mind that some of the content is paid content but much is free and most content will require you to set up an account whether the content is free or paid.In addition to all that streaming content the Apple TV also provides some additional benefits to people in the Apple ecosystem. It has AirPlay and consequently it is now possible to stream to your HDTV your MacBook Desktop, iPad or iPhone. It can essentially mirror whatever is on  your device and stream that to your HDTV. This is fantastic for presentations, sharing slideshows, tutoring people and so much more.But even more interesting is the fact that you can now extend your desktop of your Mac computer to your HDTV. It's as if you now have two monitors hooked up to your computer. Once you start enjoying that feature I'll bet you'll be hooked.I love my Apple TV. The faster processor just makes the thing faster and it's been rock solid in performance too. Setup is a breeze. I also have a ROKU but since getting the 3rd Gen Apple TV, I rarely use the ROKU... there is no need to really.", "verified": false, "helpfulness": "5/5", "author": "M. Erb"}, {"rating": 5.0, "review": "i am in love with apple productit is my dream and when i used  i love it so muchsmall box with wonderful servicehelp me to show my mac in tvthanks for apple lool", "verified": true, "helpfulness": "0/0", "author": "Khalid Alsaigh"}, {"rating": 5.0, "review": "I found myself buying 4 of these each for four of my T.V's in the house. Just had to have access to my iTunes  account when I wanted to watch my movies. If my wife was in the family room and my daughter in the living room I can run to the back bedrooms to watch my movies or see other apps and what's playing on them in peace. Everyone who has an iTunes account should get these. My whole house is apple and they are wonderful products to own.", "verified": true, "helpfulness": "1/1", "author": "Joe Ramirez"}]