[{"rating": 2.0, "review": "My biggest gripes with the AppleTV is the lack of video apps and its inability to autoplay.  If you buy a series on iTunes, you need to click to start each episode.  If you are watching Hulu Plus, same thing.  The Roku will at least offer Autoplay in many apps, including Hulu Plus, where you can marathon a series without being interrupted to needing to find the remote after each episode and then click around to get to the next episode.My other gripe is Airplay with a mid-2012 Macbook Pro (upgraded with 16B ram and 512GB SSD) along with 80 MBps (yes, eighty MBps) wired internet.  There is a lag of about 1-2 seconds when you use the Airplay feature to play what you have on the laptop on the TV.  Voices do not line up with the audio, which is very annoying.I just find the AppleTV very limited at best.  Yes, I can watch video from my iPhone 4S, iPad 3, or 2012 MBP on my TV, but that's really about the extent of this device.I own a Roku 2 HD, PS3, Wii and Wii U, iPhone 4S, iPad 3, mid-2012 MBP.  I use the PS3 the most for streaming, followed by the Roku 2 HD.  I lent my AppleTV to a family member, who I think after one or two days gave up on it, and it is siting in their drawer.If Apple opened the AppleTV up to app makers for more streaming video choices, as well as the ability to Autoplay, then I would highly recommend it.  Problem is the are far too few choices for streaming, and there is no autoplay feature.  It's just too limited when you compare this device to competitors.", "verified": false, "helpfulness": "0/0", "author": "Michael DEredita \"Mike\""}, {"rating": 4.0, "review": "I bought this apple tv since my iTune kept getting upgraded and the Sony Playstation did not work correctly with my itune library. I was using PS3 Server.The only thing I dont like about the Apple TV, while watching Netflix the Sony can do 5.1 but the Apple does not !! they are connected to the same Sony Receiver.Also the Netflix client software on Apple TV does not show the movie detail as intuitively as Sony Playstation does, but since I have all my music and movies cataloged on iTune, I using apple Tv primarily.", "verified": true, "helpfulness": "0/0", "author": "Atlanta Kid \"Atlanta Kid\""}, {"rating": 5.0, "review": "These things rock! I can push any of my content from my iPhone / iPad to the screen to share with the family or watch a movie, stream music from my iTunes collections, it washes the dishes, folds my clothes, pays my mortgage, and takes care of the kids all at the same time!", "verified": true, "helpfulness": "0/0", "author": "Brent Stanphill"}, {"rating": 5.0, "review": "I love that I was able to call my cable company and cancel my tv subscription saving me hundreds of dollars a month.  This product is easy to install, easy to use, and since I installed it on my tv, I have purchased and installed it in my son's home, my daughters home, and my mom's home, saving everyone money!", "verified": true, "helpfulness": "0/0", "author": "pedalpushinmama"}, {"rating": 5.0, "review": "My sister told me about this item.  I was use to bringing in Netflix via my WII, but I hate that shaky remote on WII.  This is so convenient to just set up and turn on.  I have purchased two more of these to give as gifts.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Happyheartstrings"}, {"rating": 5.0, "review": "We had a MacMini hooked up to our tv to watch Netflix and movies.  I don't know why we waited 3 years to just buy the Apple TV.  I love it.  Watching Netflix or HuluPlus is so easy.  Access to your music & movies is simple and we love that you we can link to pictures on another computer to use in the screensaver.  For the price, it's well worth it.", "verified": true, "helpfulness": "0/0", "author": "Patti Myers Pringle \"Soundtrack Lover\""}, {"rating": 5.0, "review": "This little device has made entertaining friends such a delight. The two features that make the best impression are the Photo Stream screen saver and AirPlay. I love it.", "verified": false, "helpfulness": "1/1", "author": "Kevin Wong"}, {"rating": 5.0, "review": "Then Apple TV is the way to go.  Simple setup, simple usage, simple decision.  If you already use Itunes for your music needs, then Apple TV is a no brainer.", "verified": true, "helpfulness": "1/1", "author": "Kevin Dalpiaz"}, {"rating": 5.0, "review": "My whole family loves Apple TV. We use it on a daily basis to watch all of our favorite shows. We also use it to connect with the ipad and iphone to play music.", "verified": true, "helpfulness": "1/1", "author": "Cathi Lee"}, {"rating": 5.0, "review": "Absolutely love the Apple TV. I have been able to watch mlb.tv on it with high def. You can't go wrong with an Apple product", "verified": true, "helpfulness": "0/0", "author": "Robb Riddell"}]