[{"rating": 5.0, "review": "Set up was a breeze.  No problems connecting with my wireless network.  Mirroring is very interesting, but Apple TV comes with so many choices, including You Tube, I rarely use it.  But mirroring is simple.  No need to really do anything.  Enable mirroring in the Apple TV settings and the Apple TV will sync with your iPhone and/or iPad and the button to start mirroring on your tv appears in the bottom pull-up window.  I am extremely pleased and would highly recommend this to anyone, particularly those with iPhones and/or iPads.  Nothing like binge watching your way through arctic blasts.", "verified": true, "helpfulness": "1/1", "author": "Rank Amature"}, {"rating": 5.0, "review": "Works well and it is nice to have two Apple TVs in the house. It was cheeper here than in the Apple store, especially if you have Prime. I'll buy it here again when I need another.", "verified": true, "helpfulness": "1/1", "author": "drew"}, {"rating": 2.0, "review": "My Apple TV experiment fell flat.  I thought it'd be better than it is.  It just isn't.  No Amazon prime???  I thought I'd be able to just use the app store as I have Prime on my phone and Ipad.  Nope.  Not on Apple TV.I also bought a Roku3 for Christmas.  I've had the Roku2 for a couple of years.  The 3 isn't that big an upgrade, but I can do WAY more with my Roku2 from 2 years ago than I can with my AppleTV.  It's a pretty big disappointment.  I figured I'd get used to it, and make it do more before I couldn't return it, but I waited too long and now I'm stuck with it.Netflix is about all I use it for.  It's interface is clunky compared to every other interface I've used including GoogleTV, Tivo, Roku2/3, PS3, PS4, XB360, XB1, Samsung Blu-Ray, Iphone and Ipad.  I would take any of those interfaces over the AppleTV app.I thought slinging your ipad to the TV would be cooler.  It works sometimes.  When it does work it's pretty cool.  It's sad that if I sling my ipad to the TV, there are bars on the side.  So I use my Iphone6 plus to sling and take up the whole screen.  Which defeats the whole reason I got it as I have to stop watching TV to take a phone call or a text then.I really thought it'd be cooler and better.  It's easily the worst Apple IOS product I've ever purchased.  A swing and a miss.", "verified": true, "helpfulness": "1/2", "author": "Augster"}, {"rating": 5.0, "review": "This is my third Apple TV.  Works wonderful", "verified": true, "helpfulness": "0/1", "author": "Theodor Paulat"}, {"rating": 5.0, "review": "Works great with my ipad", "verified": true, "helpfulness": "0/0", "author": "the dream"}, {"rating": 5.0, "review": "Outstanding devise, especially love the feature of AirPlay which allows wireless playing of photos/videos from iPhone/iPads.", "verified": true, "helpfulness": "1/1", "author": "Susan Reilly \"claryqueen\""}, {"rating": 5.0, "review": "MY 43 YR OLD SON LOVES IT; GOT RID OF HIS CABLE TV AND IS SAVING A TON OF $$$.  WHO NEED TO WATCH RERUNS ON TV FOR OVER $200/MO WHEN YOU CAN SELECT THE THINGS U WANT TO WATCH FOR MUCH LESS.", "verified": true, "helpfulness": "1/1", "author": "sam"}, {"rating": 5.0, "review": "Excellent Product and great shopping experience.", "verified": true, "helpfulness": "0/1", "author": "Ava H. Coley"}, {"rating": 4.0, "review": "Love how this system works. I'm an apple fan and decided this might be an easier way to search Netflix and the other streamable services.Only issue I had was it doesn't have Amazon prime icon. It comes with everything you need except a HDMI cable.", "verified": true, "helpfulness": "1/1", "author": "P. Zensen"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/1", "author": "Juan Jose"}]