[{"rating": 5.0, "review": "Live stream movies in full 1080 HD, which is absolutely superb and outstanding; playing your favorite TV shows, and even the awesome ability to share your personal photo's and/or video clips that you've taken directly from your iPhone, iPad, etc. to your own Large Flat Screen TV at home. All your neighbors will be jealous, but happy to join in on all the fun with those remarkable Apple devices.", "verified": true, "helpfulness": "1/2", "author": "R. ANDERSON"}, {"rating": 5.0, "review": "A few things changed my life and this is one of them.  I love being able to get all my videos from my Apple account on my large screen tv.  Apple TV is easy to set up Iike all their other products and there's no service fee for using it!", "verified": true, "helpfulness": "1/2", "author": "Simsan"}, {"rating": 2.0, "review": "Poor Netflix Video quality. I can stream Netflix just fine on other devices, PS3, OPPO & Roku. I am happy with iOS and MBP and iTunes performance. I purchased this to replace older streaming devices, not functional.", "verified": false, "helpfulness": "7/8", "author": "c wildenauer"}, {"rating": 5.0, "review": "The AppleTV is a great product that essentially allowed us to cancel our cable service and now we watch 100% of our shows through AppleTV.  We utilize the Netflix app as well as occasionally purchasing content directly from iTunes through the AppleTV (mostly movies) and use the Airplay mirroring to stream live TV shows from various websites mirrored directly from our iPad.  The Airplay mirroring is a HUGE feature which has really made the AppleTV an indispensable product for us.  Netflix works well on the AppleTV, we used the Wii prior to purchasing the AppleTV and the interface and quality of streaming seems to be better on the AppleTV.AppleTV is highly integrated to work well with other Apple products and the iphone has a great free app which you can use to improve over the sleek remote that comes with it.  The nice small simple remote is great for going to quick places but when you start wanting to type, etc., an app like the remote app on the iphone is much more handy.  You can also pair a bluetooth keyboard to make typing even easier, but I haven't really needed that so much.You can also select Apples new internet radio station to play background music and if you have another Apple computer hooked up to the network it will also show a screensaver with your recent pictures scrolling from the photostream.Overall, this is a great product and has more than paid for itself in our ability to cancel our cable service.  The features such as Airplay are amazing and allow you to stream things from your iPad to the extent that you couldn't tell that you weren't watching the actual TV shows on cable.", "verified": false, "helpfulness": "1/2", "author": "Michael"}, {"rating": 5.0, "review": "Great replacement for cable when you add Hulu+ and NetFlix. Other streaming boxes are comparable, but if you are a primarily Mac household, then this device is a no brainer. Recent additions of the Disney Channels, and Smithsonian make it even better.", "verified": true, "helpfulness": "1/1", "author": "Anthony"}, {"rating": 5.0, "review": "Been looking at these for quite a while - I'm glad I purchased it.  The video quality is amazing and it's so simple to use from the remote or my phone.  Wonderful purchase, I shouldn't have waited.  Well worth the money for streaming video on apple products.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 3.0, "review": "While I found the base functionality to be adequate, being locked in to the universe of Apple supplied media is a nightmare.  Fortunately I gave this as a gift and that person has already had a full glass of the Apple Kool-Aid, so they're used to a limited selection at premium prices.  All I can say is...I'm glad they like it.  Ignorance is bliss.", "verified": true, "helpfulness": "0/7", "author": "Chris Underwood"}, {"rating": 4.0, "review": "Awesome little device.  I am only giving it 4 stars because I cannot add APPs like Amazon Prime videos.  But so far, I am really happy with this.", "verified": true, "helpfulness": "0/3", "author": "Deborah Decker"}, {"rating": 5.0, "review": "thnk you for you the order is very good as what I whant and it nice to use thank agen to you", "verified": true, "helpfulness": "1/3", "author": "mohammed aburhman"}, {"rating": 5.0, "review": "Pros: It is crystal clear compared to my BluRay player's similar apps (Netflix, Hulu, etc)Cons: The remote is difficult to use for typing.For the most part, I am very pleased with this product. It is far better than the apps I was using on my BluRay player to accomplish the same things. The addition of the Watch ESPN app is a great feature that I can't wait to use this football season (requires a subscription).The one thing I don't like is typing with the tiny remote control. My email address is rather long, as are all my passwords, making signing in to apps very cumbersome with this remote. The navigation is slightly difficult with the toggle button on the remote (my large thumb sometimes activates the wrong side of the switch). But this is definitely not a deal breaker for me. It would be great if I could connect my wireless keyboard to it for sign in purposes and searching.Overall, I very highly recommend this product. It's another example of a long line of Apple products that are clearly ahead of the game.", "verified": true, "helpfulness": "4/5", "author": "Megan Cabral"}]