[{"rating": 5.0, "review": "The apple TV does everything you would want it to and more.  The mirroring feature alone is worth the price.", "verified": true, "helpfulness": "0/0", "author": "Andrea Bakalar \"abakalar\""}, {"rating": 5.0, "review": "There is nothing much to say about this product, its simply great, more than what I expected. I recomend it with no doubt", "verified": false, "helpfulness": "0/0", "author": "DVB"}, {"rating": 2.0, "review": "Several Apple TV community discussions complain that they can not navigate their iTunes menu on Apple TV.  The problem started at about the same time as the most recent ATV update.  A user's iTunes menu should be navigable on Apple TV when Home Sharing has been turned on.  Lately however many ATV customers have taken note that whenever they attempt this, Home Sharing crashes and an error report pops up on their Mac/PC.  Some users continue to play their itunes selections on ATV by navigating their iTunes menu on their Mac/PCs instead.  Home Sharing is less likely to crash under those circumstances.  Nevertheless, the problem returns whenever the user tries to navigate their iTunes menu on their Apple TV.  Users have expressed their frustration on ATV discussion threads, but there is no patch available nor any word from Apple as of this post.", "verified": false, "helpfulness": "0/3", "author": "ichibo780"}, {"rating": 2.0, "review": "So you have a iPhone or iPad or Mac laptop and you want to stream to your TV?Try buying a cable for ten bucks and plugging it into the HDMI port.All AppleTV does is act like one, and wants you to start subscribing to more services and stream those.  You could get those on most of those subs on your device and just hit play and watch it on your tv.This is just a device for Apple to make money on continuous content purchasing and frankly, if I want to buy content I don't need this thing.  Returned.", "verified": false, "helpfulness": "4/10", "author": "Mr. Middle \"Put it into Context\""}, {"rating": 5.0, "review": "Much smaller than the 1st Generation, and the OS interface is totally different.  Easy to install/hook up - just two cables.  And the new AppleTV gets my iTunes library content from my Home Sharing rather than downloading it my library.  Much faster.  Still getting used to the new interface though - MUCH different than the 1st Generation AppleTV.", "verified": true, "helpfulness": "0/0", "author": "T. Hohmann"}, {"rating": 5.0, "review": "I have had absolutely no problems since I purchased the Apple TV. I wanted a way of viewing my iTunes content on my HDTV, and it does that and more. I still have to test out some of the other apps, but I am glad I can watch movies and TV shows I have downloaded on a much bigger screen. Amazon and DataVision did well in getting my Apple TV to me right on time. Great job!", "verified": true, "helpfulness": "0/0", "author": "M. Oberlander"}, {"rating": 4.0, "review": "I am certainly enjoying all the features of this product.I have not been getting any problems with this new Apple tvsince buying it.", "verified": true, "helpfulness": "0/0", "author": "Kennos"}, {"rating": 4.0, "review": "I know it seems silly at first glance and with so many others like Google TV, Roku and now Android TV but this one will impress. Skip through the typical provided services etc and jump straight to the ability to share ou iTunes libray to our TV w/o having to actually hook up you Mac to the TV. I put it on an HDMI switch and even set my Harmony remote to control it. Now I have access to my iTunes music with one button push or my movies...", "verified": true, "helpfulness": "0/0", "author": "Joseph Kennamer"}, {"rating": 4.0, "review": "I've noticed a lot of people are under the impression that this little box could single handedly replace their cable/sat subscription.  In most cases it probably won't.  It does not give you channels to watch at your leisure, but it will provide you with an easy to access and easy to navigate way to access plenty of online content such as itunes rentals, Netflix, video podcasts, Youtube, and Internet radio, plus a few others.But where this box really shines is when you pair it with another Apple device such as an iPad, iPhone or iPod Touch.  When running on the same network you are able to use \"Airplay\" to mirror your device onto your TV quite seamlessly and without wires.  Want to play your tunes on the nice speakers while you clean?  Easy.  Share your vacation pictures on the big screen with no fuss?  Simple.  You can even play games with the big screen, however depending on your network speed there is about a half second delay.I can't count how many times the music in our house has been pumped through the Apple TV.  Our TV system has the best speakers so it makes sense.Want to entertain the kiddos?  Airplay your ipad/iphone and turn on the video camera and let the kids have fun seeing themselves on TV.  Trust me, this entertains kids for quite some time.For the price, its a no-brainer.  It's not going to give you local channels, or replace all of the content you get with Satellite or cable but its a nice complimentary device for Apple users to take advantage of and at the $100 price you won't regret it.", "verified": false, "helpfulness": "1/1", "author": "A. Tippetts"}, {"rating": 5.0, "review": "Another example of apple's quality. Dont buy this if you dont won ipad or iphone, it works well with apple ecosystem of product. but not a good standalone product.i loved this item.", "verified": true, "helpfulness": "0/0", "author": "V. Chandrasekaran \"Venky\""}]