[{"rating": 5.0, "review": "It works great! I use it just about everyday. There was a update a few months ago and it's awesome!!", "verified": true, "helpfulness": "0/0", "author": "Rasaan Bonair"}, {"rating": 4.0, "review": "Worked as expected....did not relize it will not mirror xfinity app...some contractual agreement", "verified": true, "helpfulness": "0/0", "author": "Alexis L. Carmon"}, {"rating": 5.0, "review": "Works great for streaming services like Netflix. AirPlay works good as well, very impressed!", "verified": false, "helpfulness": "0/0", "author": "Martin Sten"}, {"rating": 5.0, "review": "Stop reading reviews and buy it. It's completely worth it.", "verified": true, "helpfulness": "0/0", "author": "Ash"}, {"rating": 5.0, "review": "I just got the Apple TV (Current Version) refurbished from Apple directly for $75 buck with free shipping. I set it up this afternoon and it was a breeze. It took me no longer than a few minutes. However, I was absolutely thrilled with the stuff that is available to watch for free! We have a macbook pro and several iPhones and iPads at home, so this was the route I took after abundant research. The fact that there is a waiting period to buy Amazon Fire TV products didn't help either.However, after the seamless use with all devices and the ease of airplay, I am shocked I waited this long to take the plunge! I would gladly recommend this to anybody that is interested in extending their viewing pleasure. Since I am a Prime member, I was a little concerned about not having Prime as an app, but no worries. I was just as easily able to airplay it from all my apple devices with very little lag. So, if not having Prime is any concern to you, don't, as long as you have an iPhone or an iPad.", "verified": false, "helpfulness": "1/1", "author": "Ellicottvic"}, {"rating": 5.0, "review": "We love our AppleTV. All of the set top devices have their pros and cons. There are definitely some things Roku or hard drive players do that I wish Apple TV did, but if you are an apple household, this will complete the ecosystem. As a set top player, it's solid, though I wish it had some more apps. But AirPlay is really the key feature here. I don't understand how it has been on the market for so long and people are just now finally making viable alternatives at a similar or lesser price. To me, this device is a great value, we use it daily, and I wish we had more.", "verified": true, "helpfulness": "0/0", "author": "Ashley Martinelli"}, {"rating": 5.0, "review": "Love my Apple TV. Great to stream stuff from my Mac book on to the TV. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Grace Gallagher"}, {"rating": 5.0, "review": "👍", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 5.0, "review": "😍 loved it. it was perfect and shipping was quick!", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Purchased it for a requested Christmas gift. Person receiving it was pleased. Is working well. I was surprised it was so small.", "verified": true, "helpfulness": "1/1", "author": "Jan1954"}]