[{"rating": 1.0, "review": "I have the highest speed wireless internet connection available in my city, but I can't watch a movie over the Apple TV because it has to pause so frequently and then takes forever to buffer only to play a few more minutes and pause again. It spends more time pausing to load then it does playing the show. I also have a Roku and with the same wireless internet it's very rare that the Roku has to stop playing to buffer a movie.", "verified": true, "helpfulness": "1/4", "author": "Acme Thunderer"}, {"rating": 4.0, "review": "Screw cable!  We love our Apple TV.  We have one for our bedroom and living room televisions.  We subscribe to Hulu and Netflix, and we use the YouTube and SkyNews channels often.  I just wish Apple TV would allow use of Amazon Prime Streaming on their device.  I'm sure they feel that it competes with iTunes, but I am both an iTunes and an Amazon customer.  I don't use one more than the other.", "verified": true, "helpfulness": "0/0", "author": "Jennifer R De Fini"}, {"rating": 5.0, "review": "I don't know how I survived before Apple TV. It's super fast. The quality is fantastic. The options for content are endless. The only downside is that Amazon and Apple don't get along. I prefer Apple products--but would really love to be able to watch Amazon Prime content on this device. A girl can dream...", "verified": true, "helpfulness": "2/2", "author": "Cait"}, {"rating": 4.0, "review": "only works through my iPad and screen share. Wish that the app would work on here too. Annoying that I pay for a subscription and I am limited to the devices I can use it on.", "verified": true, "helpfulness": "0/0", "author": "Tweetygirl \"Tweetygirl\""}, {"rating": 5.0, "review": "I really enjoy this!  I only was using the widget from my Blu-Ray player before, (mostly for Netflix) but it buffered slow and quality was not great.  This product took me all of 10 minutes to unpack, install, and begin enjoying! The remote is SUPER intuitive and kind of fun to use.I will be mainly using this for Netflix and Hulu, I have it connected to my TV with HDMI and the picture quality is awesome!  Really excited to keep using this for more fun stuff (iPhone mirroring, playing my iTunes thru TV setup, etc)", "verified": true, "helpfulness": "0/0", "author": "Pat Vee \"The1\""}, {"rating": 5.0, "review": "I guess I am big fan of Apple products...because I realize now that all my gadgets made by Apple. So Apple TV was logical choice for streaming TV. But for my surprise I can do some much more than just watch Netflix on it. Now I can watch on TV  everything that is on my iMac which is a big deal for me.As compare to Roku there is not as much channels but I honestly don't watch other channels than Netflix anyways.I am not sure how my review will help others since I don't know how things work. I just now that Apple product WORK. Simple as that.", "verified": true, "helpfulness": "0/0", "author": "Aya"}, {"rating": 5.0, "review": "Love this device. Works especially great with other Apple devices. All the apps apple has been adding have been great and streaming media from my computer to the Apple TV is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Ian Collins"}, {"rating": 5.0, "review": "Use it mainly to mirror my macbook or iPhone to my HD TV. The movie store and music streaming are also great features.", "verified": true, "helpfulness": "0/0", "author": "Bakir"}, {"rating": 5.0, "review": "My TV is not a smart tv and I was looking for a way to get netflix to work.  Added bonus you can watch anything from you ipad or itunes and send it to the tv.  Watching a youtube video and want to show the room?  Just send it to the tv using apple tv. I wish there was an app for amazon prime however apple and amazon seem to be at odds.  For amazon prime users you will just have to access your prime movies from your ipad or iphone and send it to the tv to work.  It does work, it just is a slight inconvenience.  Very small discrete little box.  Would recommend to anyone looking to help make their tv act more like a smart tv.", "verified": true, "helpfulness": "1/1", "author": "A Cow"}, {"rating": 5.0, "review": "This is just simply amazing. Love being able to push anything from my MacBook, iPad or iPhone directly to my TV at any given time. Some of the included apps like Netflix are amazing as well. Recommend this to anyone who has any Apple product as I mentioned above.", "verified": true, "helpfulness": "0/0", "author": "Marcus"}]