[{"rating": 5.0, "review": "It cost more then the other similar electronic however it has a lot of feature that you don't get with the cheaper one I have two of them.", "verified": true, "helpfulness": "1/1", "author": "grn46"}, {"rating": 1.0, "review": "I needed this device in order to use Netflix in conjunction with my Wi-Fi hotspot, since I don't have a \"smart\" TV.  This item was easy to install, but has not worked efficiently at any time. Just try to call Apple to get help......it's a joke. Every time I want to use Netflix, I have to enter my e-mail address followed by a password. This device does not remember anything. Using the remote with this device is annoying. It only allows you to enter one letter or number at a time and has a grating voice that calls out what you've typed in after each and every entry. There's no way to mute it. Netflix is definitely NOT the cause of my frustration. I have no problems accessing it on my computer. Things device was definitely not worth the money. I'd advise someone interested in such a device to buy a Ruko....at half the price.", "verified": true, "helpfulness": "1/5", "author": "Lester Pomerantz"}, {"rating": 5.0, "review": "As always, Apple delivers!  Quality product that works seamlessly with our phones, tablet and computers!  We plan to use the streaming features to show our clients their wedding photographs during the ordering process!", "verified": true, "helpfulness": "1/1", "author": "foreveryoung"}, {"rating": 5.0, "review": "You can't go wrong getting an Apple TV. With HBO Go and ESPN, airplay, rent and buy movies, shows, songs, etc. This will definitely be used at any dinner party. Anyone with an iDevice can stream their media.", "verified": true, "helpfulness": "1/1", "author": "Cesar Perez"}, {"rating": 4.0, "review": "I like the unit, the size is great, the remote works well, and the whole concept is all around good. The only bummer is that there are too many steps to view movie summaries. It'd be nice if there was a quick summary as you were thumbing through the menu vs. having to click on each movie to see what it is about. However, with that aside, it works great and is compatible with the other Apple stuff in the house.", "verified": true, "helpfulness": "0/0", "author": "K. O. Bumgardner \"Realtor\""}, {"rating": 4.0, "review": "This was easy to set up and works as advertised. However, it does not directly stream Amazon streaming. It only mirrors it so you do not get a full screen presentation. Hulu Plus is streamed a bit choppy in moving scenes as well.I added the digital optical audio cable so I could use my receiver with it. Works like a charm.Compared to the Roku I sent back, this works like a charm. I would prefer a Smart TV so I would have fewer remotes to deal with, but the price difference is staggering. If it actually streamed Amazon directly, I would give it five stars.", "verified": true, "helpfulness": "0/0", "author": "Dennis Osgood"}, {"rating": 5.0, "review": "It's an amazing small piece of technology. Very portable and when used with your laptop iTunes it's really cool. It's a bargain too.", "verified": true, "helpfulness": "1/1", "author": "John Schonacher"}, {"rating": 5.0, "review": "Great product.  Very easy to set, just plug the cables in and connect to internet....then enjoy your media content. Recommended!", "verified": true, "helpfulness": "1/1", "author": "Chino"}, {"rating": 5.0, "review": "This little thing started it all - now there are a bunch of products that mimic the original.I have 4 in my house and about to add a 5th, one for each TV.Some may like having a TV with smart capabilities instead to access Hulu and Netflix, but I have 99% of all my media bought from iTunes, which pretty much makes an AppleTV a necessity.Interacts with all my 6 iPhones/iPads in the household plus a Mac Mini media server.  People knock the closed wall of the Apple ecosystem but if you're in it, there's no easier way to do things as long as you don't want to interact with other technologies.", "verified": true, "helpfulness": "1/1", "author": "Jason Huang"}, {"rating": 5.0, "review": "I use it to watch/catch up on my favorite TV shows.  My daughter loves it because she has a library of her favorite shows (Handy Manny, Pinky Dinky Doo, Doc McStuffins, etc) that she can select from.  This is perfect for after dinner: she watches a 20-25 minute episode and then we get ready for bed. This is also good for those days where you are stuck home and you want to select what she watches.", "verified": true, "helpfulness": "1/1", "author": "D. Sheffield \"D-very\""}]