[{"rating": 4.0, "review": "I have been looking for a simple easy way to tell the cable company to F off and this wasn't it. I thoroughly enjoy the product and its ease of use but am baffled by the lack of other uses. I would have liked it to be compatible with HULU+ or Amazon streaming. After the jailbreak comes out for this device it might be closer to what I was actually looking for.", "verified": false, "helpfulness": "0/0", "author": "anthony friel"}, {"rating": 3.0, "review": "when i first got my Apple TV, I was impressed by the way it connects with my other apple devices, allowing me to stream music from my ipod to my TV (very useful at parties), i was also impressed with some of the internet features, such as youtube you could access on your TV. However as i looked for more features i became a little disheartened, the majority of the content on the apple TV required an additional fee to 'rent' it.In the end i felt like i had bought a device which does things that any PC can do, except on my TV, and i thought to myself... 'is that worth £100?I do not feel that this is anywhere near the quality level that other Apple products are, such as the iphone or macbook.", "verified": false, "helpfulness": "2/4", "author": "Harry Heslop"}, {"rating": 5.0, "review": "New Apple tv works like a charm.  Easy to hook up.  Great video quality.  'Like the new screen layout, too.  Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "N. Andrews"}, {"rating": 5.0, "review": "Good Device that is very easy to use.  Like the air play feature that lets you see pictures wirelessly from your iPhone.  Only thing missing is web browsing.", "verified": false, "helpfulness": "0/0", "author": "Rosie"}, {"rating": 4.0, "review": "Although the Roku has more video services available, what I like most about the AppleTV is the way it integrates with my other Apple products. I'm reserving one star for when Hulu+ and an AppleTV app store appears. I was a HUGE fan of Walmart's VUDU service because of the streaming quality. VUDU, HBO GO and Hulu+ are all built into my Samsung Smart TV and I could get by without the Apple TV. But, I can afford to have an Apple TV in every room with an HDMI TV.If you have no Macs or iOS devices the cheapest Roku will do the job. But this AppleTV with 1080p is way more fun to use with my iPad 3, iPhone 4S, and MacBookPro. Sky Gamblers Air Supremacy is awesome and the Apple TV is small enough to take on trips.", "verified": true, "helpfulness": "0/0", "author": "M. Bousson"}, {"rating": 5.0, "review": "i love watching tv shows on Netflix with no commercials. i tried roku first and it knocked my internet off every time i tried to watch a second movie so i had to send it back. since then, we bought a new router, so i don't know if it's because of the router or the apple tv that i can watch as much netflix as i want without the internet popping off.  on it's own merits, i think the apple tv is great, except they're too cheap to include a cable.  but its an easy install and setup. didn't even have to read the instructions.", "verified": true, "helpfulness": "0/0", "author": "RHONDA, THE MAGICLADY"}, {"rating": 5.0, "review": "I own a Roku that works great and now the Apple TV. Both are very good at getting movies from Netflix. The picture is better on the Apple TV and it tends to not rebuffer as often as Roku. You get more content available with Roku like Hulu, Crackle, etc. but the quality of the Apple TV is impressive. Apple offers movies and TV shows for purchase. However you can go to Amazon online with Roku and do the same thing. So if you want to go cheap Roku is nice. If picture quality and better quality is key Apple TV is it. Get both for about 150 to 200 bucks together and have the best of both worlds.", "verified": true, "helpfulness": "1/2", "author": "Charles Casterline"}, {"rating": 5.0, "review": "I've had all three generations of AppleTV (still have the first gen), and I'm impressed by the difference between the new AppleTV's 1080p and the previous 720p. Was it worth 99 bucks to upgrade? Absolutely.Apple TV allows us to do without cable/satellite at 120 bucks/month. We get to watch what we want, when we want it. And now it's 1080p.Wow.", "verified": true, "helpfulness": "3/3", "author": "Nikwax"}, {"rating": 2.0, "review": "I truly wish I could love this product.  I use it more than the average person because I do not have cable or even antenna tv by choice.  i have a very large tv screen but use it for movies and apple tv only.  i have to say up front that if you don't have netflix and don't want it, DO NOT buy this thing.  this little black box should basically be called the Apple Netflix Client or something.  beyond that you have the ability to watch youtube videos (duh, even your phone does that at lightning speeds now - but then.... it can also bring you netflix now)  and if you have like an NHL or NBA account where you pay those buffoons more money to watch a sport, you can, idk, watch them on this thing.what i wrote this review to complain about is the very thing this little box should be best at, but in fact it sucks at the most.  Connecting with your Mac computer and playing movies/music/podcasts, etc.  it can do this, let's be clear.  that is a major selling point for this item.  it extends MOST (but not all) of your Mac's content to your tv.  cool.  but only so cool if it works 40% of the time.  basically, if you're on your computer and you add ANYTHING to your itunes library and then want to view it on your tv, the apple tv will tell you you have to turn on home sharing on your itunes.  even when it is clearly still on.  this stupid little box will insult your intelligence and get you so frustrated you will be at an apple store within a few days, and they will tell you there is absolutely zilcho they can do for you.  added: it will even do this if you so happen to turn on your Mac while the apple tv was already turned on.  good luck.  you have to engage your mac products in a certain order i guess, or suffer the consequences.this product has connectivity issues - and the ONLY way to resolve these issues is to yank that power cord out from the back and start fresh (allowing it to restart which takes just about as long to boot up as my 27 inch IMac WTF) just to be able to view a newly added item from your itunes list.  CRAP.  not like Apple's reputation at all.  really, really, crappy.  you'd think if it had these issues one of the abundant \"geniuses\" at this company would have thought to make it at least easier to restart somehow.  how about a switch?  you know, like most electronics?  oh, what's that?  apple isn't most electronics companies?  I DONT CARE I SHOULDN\"T HAVE TO SUFFER FOR YOUR STYLISH REPUTATION.  make your product work, then make it look all space-age and overly simplistic.  make it reliably connect to your OTHER products, like you say it does, then sell me glamor and chic.now, you may be reading this and thinking, well, mine doesn't act this way.  i don't care.  the fact is, mine certainly does, and since the people at apple tell me it isn't defective and therefore won't assist me in solving the problem, i have only one way to view this product, and that is as a totally functioning, totally ill-designed piece of garbage.  i think they care very little how this product performs because they know that at 100$ it's almost the cheapest thing you can even buy in an istore, so it's going to sell no matter what.thanks.", "verified": false, "helpfulness": "3/8", "author": "thedudeabides1001"}, {"rating": 5.0, "review": "This product allows those of us who have chosen to disconnect the cable to continue to enjoy TV!  With all of the streaming services now, and the \"Digital content\" that is included with the vast majority of DVD and Blu-Ray purchases now, it is about time that something came along to allow ALL of these in one stop!  With iTunes being the media manager of choice in my house, it was painful to have to find a way to get that content onto streaming devices, or deal with the inconvenience of having to watch movies on my iPad, or Desktop.  Now, thanks to Apple TV, I can sit back on the couch, with a slick remote, and have it all available at the touch of a button, streaming directly from my iTunes library via wifi.", "verified": true, "helpfulness": "1/2", "author": "Dave"}]