[{"rating": 5.0, "review": "This was the best thing I could've ever purchased! I save so much money each month because I see no need for DirecTV now. I  love my apple tv! J plan on buying one more!", "verified": true, "helpfulness": "1/2", "author": "jamijo232"}, {"rating": 5.0, "review": "Before the November 2012 software update, the Apple TV was a joke; a 2-star product. Now, it's a 5-star product and our default choice (over the xbox) for any kind of media playback.", "verified": false, "helpfulness": "0/1", "author": "R. Stevenson"}, {"rating": 5.0, "review": "I watch all my tv through the apple tv now, all my videos are stored on an external drive connected to my mac, with itunes open my apple tv can read all the videos on the drive and plays them just fine.  I also use netflix occasionally and was even able to watch the presidential debates live on the wall street journal app that it comes with, also enjoy podcasts, specifically the rachel maddow one.  who needs cable when you have an apple tv.", "verified": true, "helpfulness": "1/1", "author": "B. Neilly"}, {"rating": 3.0, "review": "First let me start by saying i have the Roku in the basement and this for the bedroom TV. Simply put the Roku does more; like FREE streaming your entire library of music AND video via the Plex app. There are also way more channels for the Roku. With that said you also have to have itunes match to use the music from your mac. Just another apple product that nickel and dimes you for something that a competitor product does better.I am actually a little disappointed in this. BUT if you have match already and lots of movies on itunes i guess this will be just fine. Just saying though the Roku is a better and cheaper buy...", "verified": true, "helpfulness": "2/4", "author": "buckeyede06"}, {"rating": 5.0, "review": "I bought before the hdmi extension in order to project my iphones and ipads on my Tv but they weren't very useful because you always need to be near your TV in order to be able to use it, this one very practical you only need to connect it to your router and it works smoothly  from any place from your house you will be able to stream your videos and play your songs on your TV also you just need a program like Airparrot or others you will be able to mirror your PC also on your TV.This is a very useful item and i recommend it for anyone who has Iphone and Ipad.", "verified": true, "helpfulness": "0/0", "author": "Roland"}, {"rating": 5.0, "review": "I received the product in perfect condition as it indicated the seller, I recommend it 100%, it has worked very well! owns iOS which allows me to enjoy many applications, including use much to my studies because it is very useful in every way!", "verified": true, "helpfulness": "0/0", "author": "rbolivar720"}, {"rating": 5.0, "review": "Easy to install and use. Expanded use of You Tube, etc. viewing on the large screen digital, makes all programs enhanced.", "verified": true, "helpfulness": "0/0", "author": "Ken Minyon"}, {"rating": 5.0, "review": "Very neat, can play music, watch movies, sound and picture quality is amazing.  I have seen Roku and playstations interface, and for the price I think Apple TV is the way to go, especially if you have other Apple products.", "verified": true, "helpfulness": "0/0", "author": "Gregory Walsh"}, {"rating": 4.0, "review": "I compared this to the Roku and believe it was worth the money being that I have other apple devices.  It works great, its fun and it makes my 2 year old tv feel like new again.", "verified": true, "helpfulness": "0/0", "author": "V. Cucuzza \"vjc\""}, {"rating": 3.0, "review": "I am sure this will be very good once I get it hooked up and learn how to use it.  The directions are not quite clear.", "verified": true, "helpfulness": "1/2", "author": "Sue"}]