[{"rating": 5.0, "review": "Like all Mac products this is awesome.  Easy to set up, simple to use.  My TV always seem to drop signal to the wifi, tried boosters which still did not work.  This cured my problem.", "verified": true, "helpfulness": "1/1", "author": "SoonerBorn \"Sooner\""}, {"rating": 5.0, "review": "My friends recommended this Apple TV, and it lived up to expectations. If only I had more free time to enjoy it!", "verified": true, "helpfulness": "1/1", "author": "Susan B Kahn"}, {"rating": 1.0, "review": "With Roku and blu ray players featuring not only Netflix but Amazon and tons of rich content, why would anyone one want Apple TV?  Ignorance of other alternatives, I suppose. Get a Roku or net-equipped TV or player and enjoy the content without Apple's proprietary junk.", "verified": false, "helpfulness": "5/10", "author": "geodem \"It's all about the music, books & flicks\""}, {"rating": 5.0, "review": "Easy to set up and definitely worth the price.  Use it every day and am actually thinking about purchasing more for other TV's.", "verified": true, "helpfulness": "1/1", "author": "recliner648"}, {"rating": 5.0, "review": "This item works great, sets up in seconds and has so many features I'm still only now beginning to fully utilize them all!", "verified": true, "helpfulness": "1/1", "author": "sean"}, {"rating": 5.0, "review": "My son got this for Xmas and is very happy with it & so is his daughter. Who does not like more programs", "verified": true, "helpfulness": "1/1", "author": "Irene Gray"}, {"rating": 4.0, "review": "This product works great with the other Apple items I have in the house.  I know Chrome and Roku have similar products, and honestly, you can't go wrong with any of them.  However, if you are looking for a bunch of free stuff, then you will be disappointed.  The majority of the good things added to  Apple TV cost money to use.  But, if you have a Macbook or iPhone/iPad, then you can mirror things from your tablet or phone to the TV.  There are some free things on here like YouTube and some sports or news apps, but Netflix, Hulu Plus require a subscription and HBO to Go doesn't work with all Cable providers.", "verified": true, "helpfulness": "0/0", "author": "Veronica"}, {"rating": 5.0, "review": "Great system.  Works well and my son stated he was enjoying it as well.  Syncs to apple devices very well.", "verified": true, "helpfulness": "1/1", "author": "Donald Bunch"}, {"rating": 5.0, "review": "This is my 3rd time purchasing an Apple TV. I love it! The interface is really easy to use and the setup is pretty simple.", "verified": true, "helpfulness": "1/1", "author": "RMRA"}, {"rating": 1.0, "review": "If you don't have Netflix or other similar services, Apple TV is totally useless. Use it for air play only.", "verified": true, "helpfulness": "1/5", "author": "JC"}]