[{"rating": 3.0, "review": "I'm sure I am going to take a lot of flack for saying this since a lot of people love everything apple does, but this Apple TV is just OK.  Before you start clicking the unhelpful button let me set things up for you a bit.  I have a fair sized library of music but not many movies in my iTunes.  On the other hand, I have a lot of my personal DVD's burned to my windows server and can watch them throughout the house on other devices such as my Google TV blu-ray player, or my 1st generation Roku XS,Owning all 3 devices, here is a quick list of plus and minusesAppleTV+Netflix+AirPlay from iPad (Air Parrot from MacBook Pro)+YouTube (Kinda)+Cool screensaver and remote content+iTunes protected content+Podcast support+Hulu-No Amazon VOD-No DLNA support-No USB Drive supportRoku+Amazon VOD+Netflix+USB Drive Support+Hulu+Plex (All my movies available from my server in a great UI)+YouTube-No DLNA-No DRM Movies-1st gen can be slowGoogle TV+Netflix+BluRay+Native DLNA Support+USB Drive Support+Great Remote-No Hulu-No Itunes DRM SupportIf you could combine all 3 of these products you would have one great device (A Jailbroken ATV2 is almost perfect).  For me though being an Amazon Prime member, and a Hulu+ member the fact that Apple TV doesn't Support either is a pain.Another thing that is a bummer in the iTunes ecosystem is the price.  A quick glance at Amazon vs iTunes on a movie like The Avengers shows that iTunes rental costs $1 more, and to buy the movie costs an additional $5 over Amazon.  I can't figure out why that is.Basically, if you are heavily invested in Apple and iTunes you will love this device.  It has the slickest UI and operated Apple smooth.  If you are not, I think there are better options.", "verified": true, "helpfulness": "4/5", "author": "J. Banks"}, {"rating": 4.0, "review": "Regardless of the price, Apple TV is a nice product you will enjoy when sending the output of your iPhone/ipad/Mac to your TV wirelessly.I searched for 6 months to buy a \"smart\" tv, but at the end came to the conclusion that instead of wasting money on useless features of a tv, the combination of Apple TV and a simple but high quality TV works much better. Watching youtube clips is much more enjoyable now as you can see the video on the large screen of your tv in 1-2 seconds - thanks to Apple TV :) I can't imagine how the users of \"smart\" TVs can type using their stupid remote controls.My only complaint is the difficulty to get started with it. It took 3 computer scientists and 2 electronic engineers to set up the device successfully! It gave us multiple error messages (IP conflict, etc.) before starting to work. But now that the issues are solved, I strongly recommend Apple TV to the customers of Apple products.", "verified": true, "helpfulness": "0/1", "author": "A. Masoumi"}, {"rating": 5.0, "review": "I am simply getting a ton of enjoyment out of this little device.  I enjoy being able to interface my iPad to my HD TV displaying my photo albums, playing games, etc., etc.  It was also the catalyst for my subscription to NetFlix through Apple TV and I am currently enjoying the free month offered by NetFlix.  I also enjoy streaming my music collection through the device to the large screen and audio system that I have hooked up to the TV, and also enjoying the endless radio stations available through Apple TV.  One of my best purchases in a long time!", "verified": true, "helpfulness": "1/1", "author": "Sandy Scott \"Sandy Scott\""}, {"rating": 5.0, "review": "Bought this as a present for my dad who is Apple everything.  I have a Roku but no apple devices.  He loves Apple TV and uses airplay from his macpro to the tv.  Pretty coolProduct arrived on time, packages well.  No issues.", "verified": true, "helpfulness": "0/0", "author": "DaveVegas"}, {"rating": 4.0, "review": "I like my Apple TV.  Works quite well.  The only issues i have had are some mirroring lag with my macbook.", "verified": true, "helpfulness": "0/0", "author": "K Lowder"}, {"rating": 3.0, "review": "Apple is obsessed with miniaturization, but what they need to learn is that if the device is not made to be carried around with you, miniaturization is not always a positive. For example, the Apple TV remote is about the size of a stick of chewing gum, and only has 7 buttons. Sure, why would we need a variety of buttons when we can just hit these 7 buttons 16 zillion times every time we need to navigate through the user interface? I'm sure Apple sycophants are falling all over themselves saying how wonderfully intuitive the remote is, but Apple could come out with a device that stabs these people in the eye every 15 seconds, and they would be blogging about how wonderful and user friendly it is within minutes.Furthermore, I cannot watch Amazon Prime instant videos on it. Apple is always in a dispute with someone, so I am sure this is not a technical issue, but another Apple money grab. These people sue other companies for having rounded corners for crying out loud. EVERY OTHER STREAMING DEVICE WORKS WITH AMAZON PRIME!!! How can anyone say this device is superior when it is the only one that cannot do this.", "verified": true, "helpfulness": "2/3", "author": "Ernie UMass"}, {"rating": 5.0, "review": "One of the best bang for the buck ... I wished all of Apple products were more in the general price range as this product.", "verified": false, "helpfulness": "0/0", "author": "Ornate D. Smith"}, {"rating": 4.0, "review": "I went with the ATV over Roku simply for Airplay and the way it fit into my current media setup.  I wish it had more channels like the Roku, but Airplay makes up for that for everything I personally watch.  It will be great if and when Apple decides to allow more apps on the ATV.  It has huge potential.  The biggest drawback for me is the lack of support for external storage.  I already have an HTPC setup so it was not difficult to keep iTunes open to watch all of my videos.  But if I could just attach an external HDD with all of my music and videos, that would be ideal.  Roku does this to a limited extent.  There are other devices that allow external storage I know, but they have drawbacks in support and function that just aren't worth it.  So I will stream ITunes for now and wait to see what Apple comes up with next.  I have an Xbox and previously used it for all of my streaming.  So far I am happy with both, but we'll see how they compare over time, especially with Netflix and Hulu Plus apps.", "verified": true, "helpfulness": "0/0", "author": "stradavarius"}, {"rating": 5.0, "review": "When the revision of apple TV came out... I really didn't see the point but now that apple allows hulu and netflix, connects to your iTunes eco system, and allows content streaming from iDevices - the only question is why don't more people have them?", "verified": true, "helpfulness": "0/0", "author": "Splat Matt"}, {"rating": 4.0, "review": "Great for Netflix and Youtube.  Just wish there was a way to connect to the internet to be able to watch shows from other websites, like Comedy Central (Daily Show, Colbert Report) and others.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Bovee \"draw bridge\""}]