[{"rating": 5.0, "review": "This is my third Apple TVs for our home.  It is as good as the first one we got when Apple TV first came out.  Most new \"smart\" TVs can't \"AirPlay\" with iPad and iPhones.  Therefore, having an Apple TV is essential if you want to display pictures or play video from iPads/iPhones on your big screen TVs.", "verified": true, "helpfulness": "0/0", "author": "PDot4"}, {"rating": 5.0, "review": "My son told me to order this and it will upgrade an older TV set I have.  I had no idea what it did, but am I glad I listened.It was simple to hook up, and to my surprise, I now have access to all the cool channels that people get with their new televisions, like Netflix, Hulu, and all those applications.I love that I can now get netflix in the bedroom.  Now if I can just figure out how to hook up my pining library, I will be all set.  ;-)", "verified": true, "helpfulness": "1/1", "author": "Dr. Oceanfront \"Oceanfront\""}, {"rating": 4.0, "review": "Brought this for my mother. Want her to be able to use her tv in conjunction with her iPhone to access movies, videos, etc.", "verified": true, "helpfulness": "0/1", "author": "JO HARRIS"}, {"rating": 4.0, "review": "I really like the Apple TV. It's pretty cool to be able to watch iTunes movies or Netflix on my TV. Here, basically, are the downsides:- the remote uses IR instead of Bluetooth, so it's not 100% reliable. The Remote app on iOS does a good job, however.- Home Sharing (watching a movie or listening to music from a shared iTunes library elsewhere in the house) is unreliable and slow as heck. It's a really disappointing experience- renting/downloading a movie from the iTunes store can sometimes take 24 hours to download, which is ridiculous, given my internet connection.- Overall it feels slow and unresponsiveSo, it's not perfect, and I can see lots of areas for improvement, but it's a nice product. I'm glad I have it.", "verified": true, "helpfulness": "0/0", "author": "Matthew Harvey"}, {"rating": 5.0, "review": "You're reading my review because you're trying to figure out why you should buy this Apple TV vs a smart tv, a roku, a Chromecast, whatever. Well if you have a Roku and no iTunes then go buy a Roku, if you have an iTunes account well you better stick around. Oh and how about that Chromecast dongle that only works half the time and destroyed their only reason to being relevant? So yes, this ATV3 is not jailbreak compatible but that's okay. Most consumers don't understand that anyways. So here are the reasons why you should buy it.1) iTunes Library2) Airplay3) Netflix, HBO Go, Hulu+Do you have your iTunes library full of movies and music or what not? Try using Home Sharing and boom your entire library is on your AppleTV (given your computer is on). I love this because I have over 100 HD .mp4 movies on my 2TB hard drive connected to my mac which is in my bedroom while I have Apple TV's in my bedroom as well as my living room (projector). So now I have the greatest inexpensive home theater setup.What in the world is Airplay?So whenever someone comes over my apartment and they have an iDevice I like to mess with them and borrow their phone. Then I ask oh what's your favorite song? They tell me then I Airplay it to my setup. Most people are pretty impressed by it or shocked by it. This technology has been around for a few years and way cheaper than your Sonos or your Bose system.Netflix, Hulu+, HBO GoThe basics. You buy these for the cool apps, yes Apple doesn't have the best apps but they work very well.Other apps that you should buy when you purchase this.Beamer - Airplay your movies of any format to your ATVMovieIcon - Have movies but don't have the pretty cover art? This will do it for you (Requires MAC)AirFoil - You can use your computer, iOS device, Android device, etc to airplay to all these other things.So don't think twice, buy now.Anymore questions ask me!", "verified": true, "helpfulness": "12/12", "author": "cdelr334"}, {"rating": 5.0, "review": "Perfect condition love the Apple tv, no problems.  Great product I use it to stream videos and music. Thank you.", "verified": true, "helpfulness": "0/0", "author": "S"}, {"rating": 5.0, "review": "I use my Apple TV daily and I love renting movies on my Apple TV. I never rent movies any other way.If you have other Apple products, you will greatly appreciate the Apple ecosystem and how easy it is to get these devices to work together.", "verified": true, "helpfulness": "0/0", "author": "Jorge Tovar"}, {"rating": 5.0, "review": "Working well hooked it up to the tv with an HDMI cable and to the stereo with the optical cable.  Can play on the ipad or listen to music and it works well.  haven't used the tv portion yet, but am ready to do it.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "This is a great product if you want watch videos you have on your iPad or want to stream from Amazon or Netflix. Setup is easy an operation is intuitive.", "verified": true, "helpfulness": "1/1", "author": "Bill Ford"}, {"rating": 5.0, "review": "i can see this eventually replacing my cable boxeasy set upbought a bunch for my kids schoolok, the apple remote is small elegant and can get losti bought a universal remote and had atv learn the remoteit was the easiest remote set up ever just make sure the remote has all the dvr functionsits a high end elegant productfor out school really wows the kids and parents", "verified": true, "helpfulness": "0/0", "author": "nofeer \"NOFEER\""}]