[{"rating": 5.0, "review": "We purchased this Apple TV to take advantage of airplay from the iPad.  We put the basic Roku in a guest room that isn't used very often in order to avoid monthly cable equipment cost.  We have not gotten to the point of completely cutting the cord since there are still a few cable channels we enjoy, plus we like to get our local news and weather.  Although the overall content available on Apple TV pales in comparison to Roku, airplay helps to make up for it since you can stream Amazon, Pandora and others from your iPad through Apple TV onto your HDTV.  Plus Apple TV contains YouTube which is currently only available on the Roku 3 model, although supposedly that may change in the near future.  If you are a Comcast customer, they allow HBO Go to be activated on Apple TV but not through Roku.  Neither device is better than the other, both have their own advantages and disadvantages.  But if you are hesitant to cut the cord, with either one of these devices you may be able to subscribe to a smaller cable package and save money.", "verified": false, "helpfulness": "2/2", "author": "Janice A."}, {"rating": 5.0, "review": "Great choices when the grand children visit.  Highly recommend it to stream from your I Pad.  We have gotten rid of cable.", "verified": true, "helpfulness": "3/3", "author": "Michael Griffin"}, {"rating": 4.0, "review": "I got this form my father hoping he would be able to work it easy. ChromeCast requires a smartphone really, which he doesn't have.", "verified": true, "helpfulness": "1/1", "author": "Steven N. Vaughn"}, {"rating": 4.0, "review": "I like the Apple TV, it lets me share movies from my Mac Mini to my TV as well as ITunes and HuluPlus. But I wish there was a way to shut off that EXTREMELY annoying women's voice every time I click on a new link. It is often too fast, whiny and mispronounces words. Apple representatives if you are reading, give us an update to shut off her obnoxious voice. Thank you.", "verified": true, "helpfulness": "0/2", "author": "Silence of the Lambs \"SOL\""}, {"rating": 5.0, "review": "This was everything I expected and then some.  It seemlessly integrated both our home computers into the network so we can play music, home videos and movies from our iTunes accounts residing on our computers on the tv and home stereo.", "verified": true, "helpfulness": "0/0", "author": "Joff"}, {"rating": 1.0, "review": "I bought this solely to be able to mirror a web-based video stream onto the big screen.  With refreshes every half second or so, the video was completely useless.  Unless you're streaming straight to the Apple TV from an on-board widget, avoid this.  Mirroring is useless for anything other than photos.", "verified": true, "helpfulness": "1/3", "author": "Justin V Long"}, {"rating": 5.0, "review": "I got this for my family as a Christmas present for our Panasonic 55 inch plasma TV. It has a great, easy to use interface with a lot of neat features. Unfortunately, I couldn't use the music streaming feature while actually enjoying it because I need to get some speakers for the TV. The remote is one of the main reasons that I got the Apple TV. I love holding it and just looking at it; it's one of the best remotes out there. I also have a complaint about it.DEAR APPLE: INCLUDE THE CABLE IN THE PACKAGE!!! I don't mind if they raise the price, I just hate going and buying a separate HDMI cable. When you buy an iPod/iPad/iPhone, does the USB cable come separately? Of course not. Then why force customers to buy separate cables for their Apple TV. Apart from that, I like this small black box a lot.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "This TV wifi adapter performs well but has the usual somewhat quirky, intuitive but hard to navigate menu that seems to populate all Apple products.  It is a good option for an older flat screen that has HDMI inputs but no \"smart\" functions.  If  you have a smart-TV  you are advised to pass on this item unless you really must have an Apple interface.", "verified": true, "helpfulness": "1/1", "author": "DrBob"}, {"rating": 5.0, "review": "I just used the \"tap to set up\" via my iPhone.You just have to make sure it's at least 6.0.[...]", "verified": true, "helpfulness": "0/0", "author": "Dann Chen"}, {"rating": 5.0, "review": "I had an apple TV almost two years ago before I had internet at my home (yea, there was no point). A couple years went by and I acquired a few more Apple devices and found myself wanting to stream music wireless, watch TV shows without cable and use my TV to show other media during get togethers at my home. I debated between all the competitors to the Apple TV and highly considered Google chrome cast because of it's low price tag, but when it came down to it, the Apple TV is the best device of its kind for connecting your iOS device to your home entertainment setup. The Airplay feature made my decision since the other streaming devices relied on apps and not the actual iPhone, iPad, etc. I can mirror anything on my device and not just a tab or stream from just a certain app. My whole device can stream audio and video to my TV which is exactly what I wanted.It is limited on the amount of apps it has and while I thought mirroring my Macbook or iPad would be the same it wasn't. The aspect ratio of the device is transferred to the TV. This isn't an issue with the Macbook, but who wants to relax and watch something using your computer to control it?! The iPad and iPhone create odd black space around the video which isn't ideal.Overall I'm very satisfied and although there's rumors of a new version coming out very soon I was excited to have this device and at the discounted price offered by Amazon.", "verified": true, "helpfulness": "1/1", "author": "Jon McGuirt"}]