[{"rating": 5.0, "review": "Why buy one of those roku things when you can spend just a bit more and have this!  Awesome quality, great streamline compatibility with all things apple!  Have a couple of these hooked up in my home, love them", "verified": true, "helpfulness": "0/0", "author": "Taun Stewart \"TS\""}, {"rating": 5.0, "review": "I can't believe how small this product is (I almost wish the remote was bigger, even--it's incredibly easy to loose in the sofa cushions). I use an older MacBook that you're not supposed to be able to do the screen mirroring with, but with the addition of the program Airparrot, mirroring works like a dream. All the apps are great, although it is a pity you can't access Amazon streaming through it--music and movies streamed through iTunes are much more expensive. Still, super nice and great for someone who likes watching international television. I can now download things onto my computer and easily watch them on my tv.", "verified": false, "helpfulness": "0/0", "author": "Lllamaesque"}, {"rating": 3.0, "review": "I had problems renting a movie through the Apple TV. Apple replaced it but the new one had the same problem. I don't know if it is the Apple TV or my internet speed. I have increased the internet speed but haven't tried to rent a movie through it yet because it is a bi of a pain to get a refund--all rentals are final. I can rent on the computer and stream it from iTunes so I kept it.", "verified": true, "helpfulness": "0/0", "author": "robmac"}, {"rating": 5.0, "review": "My son asked if we would give these to our grandchildren.  They live on a boat and this item works get from them.", "verified": true, "helpfulness": "0/0", "author": "Sylvia Emmens"}, {"rating": 5.0, "review": "Second Apple TV I've bought.  This one was a gift for my daughter and son-in-law.  They love it.  Works great.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "Works fine, need to learn to use all the features. Overall good ourchase.  Good price too. Thanks for everything guys", "verified": true, "helpfulness": "0/0", "author": "Themis Kalogeris"}, {"rating": 4.0, "review": "Netflix has very little to watch in terms of movies for adults. Hulu is commercial hell. So unless you have kids neither are really worth the 8$ a month. The device works fine. I programmed my Directv remote to do all the functions as apple didn't allow for volume control... something to do with quality of audio and modeling themselves after CD or DVD players. SO the master remote works great and I can switch to any other entertainment device without changing remotes.", "verified": true, "helpfulness": "0/1", "author": "Chris"}, {"rating": 4.0, "review": "This is a great product, arrived quickly with Amazon Prime. Docking one star because we were unable to set it up due to the remote being broken and wasted a lot of time trying to figure out what was wrong. Eventually we had to go to an Apple Store to exchange for a new remote and everything has worked great since. We can now stream from Netflix or mirror directly from the iPad.", "verified": true, "helpfulness": "0/0", "author": "s"}, {"rating": 4.0, "review": "Very solid product.  It was easy to step up and get working without having to mess with itunes.  It shares the screen with my ipad and has it's own adequate lineup of channels.  Great video quality.", "verified": true, "helpfulness": "0/0", "author": "brente"}, {"rating": 5.0, "review": "EL PRUDUCTO FUE ENTREGADO CON LAS ESPECIFICACIONES MOSTRADAS, EN EL TIEMPO OPORTUNO Y EN LA FECHA ESTIMADA. RECOMIENDO 100%. EXCELENTE PRODUCTO!!", "verified": true, "helpfulness": "0/1", "author": "ALEJANDRO SALLEG"}]