[{"rating": 5.0, "review": "I simply love it... this is my second one and thinking to buy a 3rd.  Apple rocks!", "verified": true, "helpfulness": "0/0", "author": "Federico Tapia"}, {"rating": 5.0, "review": "This streams much quicker than my bluray. The picture is great. The display looks good and is easy to use. The only downside is that I cannot get amazon on it.", "verified": true, "helpfulness": "0/0", "author": "Shannon E."}, {"rating": 5.0, "review": "ExcelenteMuy bueno", "verified": true, "helpfulness": "0/0", "author": "ogendelman"}, {"rating": 4.0, "review": "Works great looks great size is compact which is a plus does not even use that much electricity!", "verified": false, "helpfulness": "0/0", "author": "D. C."}, {"rating": 5.0, "review": "This isn't the first Apple TV I've bought and won't be the last either. If you've already got any apple products the Apple TV extends their functionality to your tv so you can show photos, YouTube or even mirror your phone screen to show (most) apps. They are still useful even if you don't own Apple products by playing Netflix and other subscription based services. AirPlay is by far the most compelling feature though.", "verified": true, "helpfulness": "0/0", "author": "TheDawg"}, {"rating": 3.0, "review": "I want to love the AppleTv but I've had far more problems with it than I'd hope. I have a Mac and an iPhone so I admit the syncing works relatively well. However i seem to have constant trouble with airplay and can't seem to permanently resolve it to my satisfaction.", "verified": true, "helpfulness": "1/1", "author": "Kirsti"}, {"rating": 4.0, "review": "Excelente", "verified": false, "helpfulness": "0/0", "author": "Enrique"}, {"rating": 5.0, "review": "This is our second Apple TV devise.Working fine to this point. As before, easy to set up and use. Just as expected.", "verified": true, "helpfulness": "0/0", "author": "ARGary"}, {"rating": 5.0, "review": "very good love it", "verified": true, "helpfulness": "0/0", "author": "Gino yvon"}, {"rating": 1.0, "review": "This is a piece of junk.  I have been trying off and on for two weeks to get it to work with no success and it is now in my trash.  I have tried to get tech support which does not exist.  This is my first and last Apple product.", "verified": false, "helpfulness": "1/4", "author": "jiml"}]