[{"rating": 4.0, "review": "Got this for use by my company to run presentations controlled over wifi with iOS devices. The Apple \"ecosystem\" just works for instances like this, and that's all we wanted.", "verified": true, "helpfulness": "1/1", "author": "RHFSoSo"}, {"rating": 2.0, "review": "Not user-friendly. The way to enter your ID and password on screen dates back to CP/M days.  Very tedious and frustrating. And you have to enter that every time you want to get on the system. In addition it did not come with an optical cable which I had to purchase separately.", "verified": true, "helpfulness": "0/0", "author": "Alan Bertaux \"ABCO Enterprises Inc.\""}, {"rating": 5.0, "review": "works great and I am very happy with the product", "verified": true, "helpfulness": "0/0", "author": "Lenka Runza"}, {"rating": 5.0, "review": "As all Apple products, perfect!", "verified": true, "helpfulness": "0/0", "author": "Evelyn L. Sanchez"}, {"rating": 5.0, "review": "it works", "verified": true, "helpfulness": "0/0", "author": "papa \"Sobe Papa\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jack Majszak"}, {"rating": 5.0, "review": "I can't imagine my media center without this. I love that i can stream everything from itunes! It's makes it super easy to find content I wasn't even aware I was interested in!", "verified": true, "helpfulness": "0/1", "author": "Caroline"}, {"rating": 5.0, "review": "I love Apple TV.  Its so much easier to navigate through than regular cable.I love being able to stream anything off of my laptop, iPhone, iPad, etc.  Plus, its great to be able to use your remote app to control the device when the actual little remote disappears.", "verified": true, "helpfulness": "0/0", "author": "F_S"}, {"rating": 4.0, "review": "I love my apple TV. But after a year of owning it, I occasionally have to restart it because it freezes.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Hankins"}, {"rating": 5.0, "review": "Had the netgear piece of junk then WON an iPad air so I got this to go with it . Great unit great tech support .", "verified": true, "helpfulness": "0/0", "author": "they all want me \"question\""}]