[{"rating": 5.0, "review": "great product for mac as well as non-mac users, highly recommend it. easy setup/install/interface", "verified": true, "helpfulness": "0/0", "author": "DINGUS \"SWAMP DONKEY\""}, {"rating": 5.0, "review": "Liked it so much I bought 2", "verified": true, "helpfulness": "0/0", "author": "Ed M"}, {"rating": 5.0, "review": "I have ROKU3, WD TV Live, and APPLE TV.My favorite is Apple TV.  It's amazing how ipad, Iphone, Ipod could stream such a great quality video from Internet directly to Apple TV.  Very much polished solid product proven over several years. I purchased second one for my second tv.", "verified": true, "helpfulness": "1/2", "author": "All from Amazon \"Review Man\""}, {"rating": 5.0, "review": "Love the Apple TV.  It's an Apple product so you know it's good quality and dependable.", "verified": true, "helpfulness": "0/0", "author": "JD-ID"}, {"rating": 5.0, "review": "Works perfectly for me", "verified": false, "helpfulness": "0/0", "author": "Javin Cyriacks"}, {"rating": 4.0, "review": "Good price", "verified": true, "helpfulness": "0/0", "author": "Patrick Doty"}, {"rating": 5.0, "review": "I love It", "verified": true, "helpfulness": "0/0", "author": "iPhone"}, {"rating": 3.0, "review": "It beats the lame \"smart TV features\" on my new Samsung TV, but that is a low bar.  I am not dedicated to Apple.  Great form on the hardware, some nice features, but lets face it, all streaming devices are greatly limited without a cable subscription.  Hopefully that will change soon.  I have a few different streaming devices and pretty much every mobile device imaginable in the home.  I keep this around largely for Airplay, which is a genius feature, but I would not purchase again just for that.  I picked up this after ditching my Roku 3 which started flashing all kinds of crappy ads on the main screen that were not always age appropriate for my youngest children.  It seems this one goes to sleep when not in use like it should--the Roku 3 seemed like it was always on.  User interface is the same Apple cookie cutter as on all their devices.  No Pandora app is a groaner and worthy of shame.  I am trying the new fire stick now, which has Pandora and is looking promising for the price point, especially with the Amazon Instant content.", "verified": true, "helpfulness": "2/2", "author": "J Anderson"}, {"rating": 5.0, "review": "Mac Product? Better then 100%....Excellent.", "verified": true, "helpfulness": "0/1", "author": "Ricardo da Silva"}, {"rating": 4.0, "review": "work perfect", "verified": true, "helpfulness": "0/0", "author": "miguel"}]