[{"rating": 5.0, "review": "Excellent product.If you're thinking to buying one now, you might want to wait a few more days until Apple will announce/release the new version.", "verified": true, "helpfulness": "1/1", "author": "MI"}, {"rating": 1.0, "review": "We bought this expecting it to be a new Apple TV box. We spent hours trying to get it to connect to our internet. Finally my husband called Apple Support and we were told that it was not a new box and that the warranty was only days away from expiring. I would not recommend purchasing this at all.We bought a new one from Radio Shack after this one was returned and it worked perfectly.", "verified": true, "helpfulness": "1/4", "author": "kpa_31mom"}, {"rating": 5.0, "review": "Primarily purchased it because I was having streaming issues with my Blue-Ray disc player accessing Netscape. The Apple TV is working much better (faster) with very few streaming hesitations. Much improved menu system not only with Netscape but also many of the other Apps available from AppleTV. Also like the ability to play my iTunes, display my iPhoto library and mirror my iPad to the TV.", "verified": true, "helpfulness": "0/0", "author": "Ozzboy"}, {"rating": 5.0, "review": "I gave this to my daughter as a birthday gift on the recommendation of my sons. She is thrilled and couldn't wait to hook it up.  I am considering getting it for my own home.", "verified": false, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "We just love these apple TV's. We currently have two..we have no complaints. It has everything you need ready built in. It's a breeze to use.", "verified": true, "helpfulness": "0/0", "author": "Emilou"}, {"rating": 3.0, "review": "Very easy to hookup and setup.  Can play movies from my iTunes on my macs, iPads and phone.  very easy to share (mirror) my iPad screen - we were looking for something on-line and a bunch of people needed to see the screen very easy to do.  Streams Netflix very well.  Purchasing movies from iTunes is painful, I entered my iTunes id and password which is not a quick thing to do without a keyboard, I kept getting messages to verify this device by connecting to a computer and reentering the password.  I did this 4 times and it still didn't like it.  I ended up just purchasing the movie on iTunes and then this let it stream it.  So far I have not been able to purchasing any content on iTunes from this device.The firmware/software updates for the device seem to come every few weeks and take about 30-45 minutes to get loaded and I have pretty fast internet connection.Overall a good device that has some very user-friendly features and some very unfriendly features.", "verified": true, "helpfulness": "0/0", "author": "P. Dubuque"}, {"rating": 5.0, "review": "This is my third apple TV, I have one attached to every Tv in my home... I do realize that the apps are limited when compared to roku ( I would like to see apps like showtime & max to go added)... but the stream is always smooth and consistent, as long as its connected to 5 GHZ frequency... love the simplicity or the remote but wish it was a little bigger as I am constantly losing it!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Great product, it's like having a computer on your tv. It's also works well if you have itunes. Inexspensive product.", "verified": true, "helpfulness": "1/1", "author": "Brian Fitzpatrick"}, {"rating": 5.0, "review": "If you are a fan of apple products, this works great. Very easy to connect and use. It is uses almost daily in my home.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This Apple TV module packs a lot of power into a very small package.  I have used a smart Blue Ray player for years and this Apple TV module is faster when downloading from the internet and the navigation is very easy to use.  Another excellent product from Apple!!", "verified": true, "helpfulness": "0/0", "author": "Grandma V"}]