[{"rating": 5.0, "review": "Can't believe I didn't one of these sooner. Great upgrade and plenty of apps. The airplay function from my Iphone puts everything else I need on the big screen.", "verified": true, "helpfulness": "2/2", "author": "Jeff"}, {"rating": 5.0, "review": "I absolutely love my Apple TV.Pros:- great HD programming.- very fast processing- small and barely noticeable.- great price- easy syncing with other apple products and iTunes- mirror and Air Play (stream) content from your iPad or iPhone to your tv.- can Air Play music from your computer via Wifi to your tv through iTunes.Cons:- no Amazon instant video (as of now, Apple is constantly adding channels)  NOTE: The Amazon app will allow you to Airplay your videos to your Apple TV.- remote is small and is easy to lose. Especially if you have small kids like I do. I highly recommend downloading the remote app to your iPhone and/or iPad for a backup.I haven't tried the ROKU 3 yet, but I didn't really see many channels that Apple didn't have that I would like. So being an Apple family we chose the Apple TV.Overall I love this product and even use it in place of the built in features of my brand new Samsung Smart TV. And the video quality is great. Definitely worth the money if you already use apple products.", "verified": true, "helpfulness": "10/10", "author": "M. Grafton \"Mdean\""}, {"rating": 5.0, "review": "I love this thing. Well worth the money. (especially if you have alternate Apple devices that you can AirPlay with). It's very compact, very simple to navigate, and a great alternative to cable.", "verified": true, "helpfulness": "3/3", "author": "Lauren"}, {"rating": 4.0, "review": "Absolutely great little machine. A bit idiosyncratic and frustrating at times, but we do love it. The search entry with the remote is the most frustrating thing. Also how the only navigation is via the \"Menu\" button which takes you up one menu level at a time (You can hold it down a couple of seconds and it will take you to the top directly.)Works better with the \"Remote\" app on iPhone or iPad. This lets you enter search with a keyboard.  Still, it would be nice if there was a real GUI with the REmote app - like allowing you to select your application directly. Also - now so many apps that navigating is a pain. They should give option to put apps in a \"not used\" folder. 98% of what we do is Netflix.Still - overall - we love it.One great thing - go to Apple Maps on the iPad (or iPhone) - go to flyover - and send it to your big screen. VERY COOL!", "verified": true, "helpfulness": "0/0", "author": "Roka2 \"mmx\""}, {"rating": 5.0, "review": "I love my AppleTV. Between Netflix ($7.99/mo) and HuluPlus ($8.99/mo), I no longer need cable or Satellite. And it works seamlessly with my other Apple devices.  I recently purchased a Chromecast by Google and now appreciate my AppleTV even more. AppleTV just works quickly, easily, and provides more entertainment that I can possibly consume.", "verified": false, "helpfulness": "30/34", "author": "J. Trumps"}, {"rating": 5.0, "review": "This is the best product I have purchased in years. Brought me, and my music collection into the 21st century.", "verified": true, "helpfulness": "1/1", "author": "Daniel R Blair"}, {"rating": 5.0, "review": "If you use a Mac computer at home and have an HD TV, you should definitely get an Apple TV. The Air Play feature is the best feature ever. My family wanted to watch a particular movie, but it wasn't on Netflix and could only be purchased through iTunes. We didn't want to buy the movie so we found it on a \"less known\" streaming site. With Air Play, you can start the movie on your desktop (or other Mac) and then simply click the Air Play button to use your HD TV as another computer screen. It's fantastic! I don't know if this works the same on a PC. There are other benefits, but I'm tired of typing:-)", "verified": true, "helpfulness": "1/2", "author": "Chad"}, {"rating": 5.0, "review": "It plugged in just fine, found my LG  TV, and was up and running within 5 minutes. Good quality picture and sound. Pandora and IHeart radio work great.", "verified": true, "helpfulness": "1/1", "author": "vince ponciano"}, {"rating": 1.0, "review": "This is a fraud praying on vulnerable consumers. A brand new Apple TV LISTS for $99, this is being sold for over $250.", "verified": false, "helpfulness": "125/187", "author": "John Faughnan \"John G Faughnan\""}, {"rating": 5.0, "review": "I absolutely love being able to stream iTunes purchases from both mine and my husband's accounts directly from our TV. Extremely easy to set up and use.", "verified": false, "helpfulness": "1/1", "author": "L. Webb"}]