[{"rating": 5.0, "review": "Well worth it and works great", "verified": true, "helpfulness": "0/0", "author": "Eric Flatley"}, {"rating": 5.0, "review": "Great source of TV channels, it could connect to your iphone, macbook and ipad. You don't need to worry about the cable every time when you try to play something on your mac any more!!! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Steven Clements"}, {"rating": 3.0, "review": "it's ok bur amazon fire is much better", "verified": true, "helpfulness": "0/0", "author": "daniel l. chambers"}, {"rating": 4.0, "review": "Have had hours of enjoyment with the Apple TV!  Have shared with many friends, and everyone has enjoyed it also!!", "verified": true, "helpfulness": "0/0", "author": "Jack De Mave"}, {"rating": 4.0, "review": "I wish there was a setting to make the fonts easier to read. Product streams well though. Where it shines for my family is the AirPlay feature to stream content from our Apple devices onto our TV.The streaming apps are not that great, though we like a few. Wish the big local cable channels would offer their content for free on these devices.", "verified": true, "helpfulness": "0/0", "author": "sayheyjayray"}, {"rating": 5.0, "review": "I like it so beautiful", "verified": true, "helpfulness": "0/0", "author": "mohammed"}, {"rating": 5.0, "review": "That's great I like it", "verified": true, "helpfulness": "0/0", "author": "Chong Foo"}, {"rating": 1.0, "review": "Apple TV is a terrible  unit. Slow response time. Remote is not worth anything. I would not have it if it weren't for Game Of Thrones", "verified": true, "helpfulness": "0/3", "author": "Todd J Bailey"}, {"rating": 5.0, "review": "Amazing, i love how Apple products integrate together, providing an awesome experience, i have an iPhone, iPad, and a MacBook Pro. i use it everyday!", "verified": true, "helpfulness": "0/0", "author": "René Castillo"}, {"rating": 4.0, "review": "Works great! The remote has a lot of functions built into few buttons... This needs a bit getting used too, however with a little web help, I understand it well enough to use.My son and I love watching music videos on tv using this product.", "verified": true, "helpfulness": "0/0", "author": "Suresh Mungroo"}]