[{"rating": 5.0, "review": "Dear people don't be mislead about Apple TV..... It rocks and rolls perfect..... You will lov it forever and quite worth the money forever..... 1335p(NO)..... 1080p, 720p (YES) well it seems better than 1080p but it is apple TV and Apple  would know..... 1080p.....Picture is exactly G.I.F. (Ghost Image Format)..... Should I say anymore..... Im in lov with it..... P.S. it helps to have a super definition TV..... preferably Panasonic Vierra.....and how..... Large very large..... S.A.H. p.s. it might help to know that 1080p compared to 1335p is hardly a noticeable difference and depending on what file extension the format appears or is showing in, say Ghost Image Format(gif.), will determine clarity as well as perfection of screen picture..... Just for practical purposes very few tvs can actually put out a distortion or loss of clarity picture with 1335p. P.s.s. (p)is for pixels..... Scott!", "verified": true, "helpfulness": "1/2", "author": "Bobbi"}, {"rating": 5.0, "review": "Love this!  Use it every day!  We watch a lot of movies and older British TV series on Netflix, and the girls absolutely adore the videos on YouTube that are for children!  This device allows us to watch anything we can see on our iPhones or iPads right on our TV screen, including our photos and videos as screen savers!  If you have an iPhone or an IPad, you should have Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Gigi"}, {"rating": 5.0, "review": "We bought an Apple TV because we decided to cancel our cable. We signed up for Netflix and Hulu plus as well. Apple TV makes it so easy to stream these two services. We are saving about $75-100 a month by doing this. We are still able to watch our shows-Castle, Whitney, Go On, NCIS, Hawaii 5-0, etc thru Hulu Plus. We have a 2 and 6 year old that can easily find shows as well.Another thing I like is the radio option. Apple TV has thousands of radio stations to listen to. And while you are listening to them you can set you screen saver to show apple TVs options of flowers, animals, or you photo stream on your iPhone or iPad, thru the iCloud. AirPlay is also easy to do. You just need to be connected to the same wifi as your Apple TV.We love our Apple TV and wish we'd purchased it earlier.", "verified": true, "helpfulness": "0/0", "author": "Mybrick"}, {"rating": 5.0, "review": "Description and picture are accurate.  Received quickly and it was well packaged.  Not such a technical person so had trouble setting it up at first.  Nothing wrong with the product though.  Read the instructions that came with it and also did some research on- line that had more visual aids which mad it easier for me to connect to my TV and laptop.", "verified": true, "helpfulness": "0/0", "author": "Wendy A. Arriaga"}, {"rating": 5.0, "review": "I hesitated to buy this at first because of Roku 3 but after receiving the Apple TV and playing with it for awhile I am absolutely impressed by it. Everything worked seamlessly right out of the box. If you already have other Apple products at home this is a must have. Once you get one you'll kick yourself for not getting it earlier.", "verified": true, "helpfulness": "0/0", "author": "jebus"}, {"rating": 2.0, "review": "The reason why I even bought the Apple TV was because I wanted the AirPlay integration with the iPad (streaming the iPad's screen).As any Apple product, this thing was a pleasure to take out of the box and set up. There is nothing much to say about the setup process and interface, it's very simple and on pair with the competitive devices (I also have an older Roku 720p box).It worked for the first, like, 25 minutes. Until I updated it and opened a random youtube video from the \"most viewed\" category. The device played about a half of that video and simply hanged (went quiet and frozen the picture/frame). I tried to restart it by using the combination of keys at the remote (as per Apple's manual), then by taking out the power supply, then by connecting to my laptop via exotic micro USB cable (luckily I even had it from an older Samsung phone)... but no luck. The Apple TV would only display the Apple logo while booting up and then black screen. After spending a couple of hours on the Internet forums I discovered that surprisingly many people are facing this type of issue. Some users blamed TVs (I have relatively new 60\" Samsung and it works perfectly fine via the HDMI with a number of other devices); some users blamed HDMI cables (so I tried a couple of them with no luck); and there have been plenty of other \"dark magic\" options which I also tried, and which included  disconnecting the TV from the power supply and almost reading mantras. The bottom line is that the problem isn't new but Apple isn't doing anything about it for whatever reason.One wasted evening and I decided that it's not worth it. The return process was smooth and simple (as always with Amazon) and I got a full amount refunded in a day or two. Kudos to Amazon on the customer experience!As far as the AirPlay is concerned (the original reason for my purchase), I found that the feature is only useful for the photo slideshows. I was hoping that I could use the iPad as a full-blown keyboard / remote control for the TV but that's just not how the AirPlay works; this application is only compatible with certain services and kicks in when you start a youtube video for example, it opens it's own interface that intercepts the output from your device... guess what happens as soon as you navigate away from that page on your phone (let's say to search for another video)... it just stops playing it. And not to mention that the resolution and the screen ratio of the iPad doesn't match the 1080p TV... so instead of enjoying the full screen experience you actually end up seeing black borders on the both sides of your TV screen (while broadcasting the iPad's screen).All these TV boxes deliver very limited user interfaces as compared to the real computers with real browsers; I am now considering to purchase a mini-computer for the Netflix and etc. (those typically start at $300 but it's a way better alternative).", "verified": true, "helpfulness": "1/3", "author": "DMV"}, {"rating": 5.0, "review": "My family and I use it everyday. Easy Netflix streaming, and Hulu plus for TV..therefore you will strongly consider cutting ties with your cable company. Should you have an iphone, the integration is seamless, and we often watch videos off YouTube,/internet My 4 year old can pick up my phone, go the downloaded (remote) app, select Netflix, and watch her favorite shows. Very easy to use. And did I mention I dropped my cable company??  savings over well over $100 a month (kept the high-speed internet though.)", "verified": true, "helpfulness": "0/0", "author": "Jron"}, {"rating": 1.0, "review": "I bought this product based on my longtime experience with Apple. What a disappointment! I find that now Apple has reverted to the \"black box\" practice: no product data or support. To be specific, I found out that this device works only with some of the expensive newer Apple products. I have an early 2009 Macbook 13\". Fast and reliable. Well, it is NOT compatible with the ATV 3. Neither is my iPhone 4. I understand that its predecessor, the ATV2 was \"jail breaked\" and works fine with most of the older models. It seems to me, that Apple re-engineered the ATV3 (that Amazon labels \"the newest version\") to force customers to buy the latest products and prevent any modification to the device that could result in better use for the customer. Interestingly, the ATV2, now discontinued, now can be bought used at better that $400.00!What as scam. No more Apple of any kind for me.", "verified": true, "helpfulness": "5/13", "author": "N. Neuhaus \"amzon\""}, {"rating": 2.0, "review": "There's something you must known about AppleTV before purchasing that may change your mind.#1 - You CANNOT play your library of movies and tv shows WITHOUT a computer or ipad/iphone device being ON and STREAMING directly to Apple TV. What?! It's true. If you have a library of movies and tv episodes you'd like to watch on Apple TV -- well, you'd have to power on your machine, then stream it to Apple TV. You can't just turn on Apple TV and watch a movie or tv episode you've purchased outside of Apple TV. Any purchases you make ON and THROUGH Apple TV, you can watch without having a computer on, however.WHEN COMPARED TO ROKU -- Apple TV fails when compared to Amazon VOD, for example. On Amazon, whether you purchase on your PC or through the VOD channel on Roku, you can watch your content without a computer. Your library shows up on the Amazon VOD channel on Roku. No need to power on your PC or Mac then stream it to Roku.#2 - You CANNOT play iTunes U content WITHOUT first downloading it to your PC or mac/iphone/ipad, then converting it to a Podcast. What?! It's true. If you want to watch iTunes U content on your Apple TV, you first have to download it on your device, then change the video format. Then stream it, again.At this point you're wondering, what if i just turn on my PC or MAC, put in an HDMI cable and connect it to the tv? Hmm... should I pay $99 for that ability? Oh wait, it doesn't cost any money to do that already (provided you already have an HDMI cable).Hopefully the next gen of Apple TV fixes these problems.", "verified": false, "helpfulness": "6/10", "author": "Amazon Customer"}, {"rating": 3.0, "review": "some shows that I can see on the computer, but not on the Apple TV and there is no subtitle. NO GOOD.", "verified": true, "helpfulness": "0/1", "author": "no"}]