[{"rating": 4.0, "review": "Very good product, make sure to have a good hdmi cable such as the Amazon basics cable that has been working really well me not like a staples brand that kept cutting in and out of the picture", "verified": true, "helpfulness": "0/2", "author": "VAL CARDENAS"}, {"rating": 5.0, "review": "I love my Apple TV.  Makes things so much simpler when broadcasting my iPhone or iPad.  The apps are great.  Most of them are not free which is the only downfall but it houses all the main stuff you probably already have an account for anyway.  I don't even have cable TV.  I have my Apple TV with Hulu, Netflix, HBO Now and iTunes Stores.", "verified": true, "helpfulness": "0/1", "author": "Brandon Wilson"}, {"rating": 5.0, "review": "I tried Google Chromecast and it was okay. I wanted to try Apple TV and got this on sale and love it. I have access to all my iTunes music, movies and shows and so much more. My only complaint is I thought I had read a review that said it was now working with Amazon Prime but I haven't been able to figure it out yet. I think I can do it with AirPlay from my iPad or iPhone but haven't tried. So it's probably just user error...For years I've just been watching whatever I could get on Hulu, Netflix and AP but currently am paying the big bucks for cable because a Luddite housemate couldn't figure out Internet TV so right now I don't use it as much as I would. However sometimes I go through it rather than OnDemand (for the networks that are available on Apple TV). After so many years of watching what I want, when I want I'm lost trying to use regular Cable so I mostly use the OnDemand feature and the functionality (pause, rewind etc) on Apple TV is way better but so far only a few networks are available.", "verified": true, "helpfulness": "0/1", "author": "Arlene Haessler"}, {"rating": 5.0, "review": "Works great and accesses the iCloud account quickly. Much faster and handier than the Apple TV of years past.", "verified": true, "helpfulness": "0/0", "author": "applefan \"bearsthinkingabout\""}, {"rating": 4.0, "review": "So far, so good. Moving slowly towards cutting the Satellite cord, and this definitely helps. Hello Crunchy Roll!", "verified": true, "helpfulness": "0/1", "author": "Crilly Butler"}, {"rating": 5.0, "review": "I love Apple products because they simply work. This is no different. Right out of the box it worked once I set up the network. With each Apple product I buy it moves me closer to buying an Apple PC simply because everything works as hyped.", "verified": true, "helpfulness": "0/1", "author": "Warren Seago"}, {"rating": 5.0, "review": "Apple's hobby of a device doesn't require much introduction. I thought I would postpone buying it though until the new model comes out later this year. But I changed my mind when I realized that I needed it to access my HBO Now and Showtime apps on a much bigger screen. And with its discounted price of $65, it was a painless purchase. True, Roku and the rest are a lot cheaper and you will admit that there's a price for cheap. For someone like who plays only in Apple's walled garden, I can't imagine using other devices. Plus, they also don't support AirPlay nor are they able to access my iTunes playlist. With its treasure trove of channels, I wished that I had gotten it sooner.", "verified": true, "helpfulness": "0/1", "author": "theappleogist"}, {"rating": 5.0, "review": "No need for a computer anymore.", "verified": true, "helpfulness": "0/2", "author": "Fabio H"}, {"rating": 4.0, "review": "Works very good, needs more channel options, mirroring is a plus !", "verified": true, "helpfulness": "0/2", "author": "ed branom,jr"}, {"rating": 5.0, "review": "If you only used the Apple TV to rent movies it would be a worthwhile purchase.  The iTunes store provides an excellent experience to browse movies, watch trailers and see ratings for the latest movie releases and archive titles.Movies isn't all the Apple TV does, it has tv shows, Netflix, Hulu, Vimeo, Youtube, HBO, Vevo and many other applications providing great streaming content in a way that is much quicker and far easier to use than your smart tv.  It can also stream your music through your home theater, run slideshows of your photographs or make your tv work as a remote display for your iPad, iPhone or Mac.", "verified": false, "helpfulness": "0/0", "author": "Danny G"}]