[{"rating": 5.0, "review": "I love the Apple TV.  This was my second one I have purchased in the last year for another TV.  It has a lot of applications that can be used and most would say that it is not as good because you cannot install certain apps.  If you are an Apple fan this product is great because you can stream anything you want from your iPhone, Apple computer or iPad through this device.  So really people that criticize this device because it does not have an application like Amazon Prime it doesn't really matter because you can use it through any of the devices I mentioned by AirPlay.  You can also mirror the iPhone which is great because you can play your favorite games on your TV.  Plus if you purchase movies and music through iTunes you have access to your entire library.", "verified": true, "helpfulness": "0/0", "author": "timothy r houk jr"}, {"rating": 5.0, "review": "Love it ;)", "verified": true, "helpfulness": "0/0", "author": "Katherine"}, {"rating": 5.0, "review": "Like the Ruku better", "verified": true, "helpfulness": "0/0", "author": "Bryan P Mcguinness"}, {"rating": 5.0, "review": "Gift", "verified": true, "helpfulness": "0/0", "author": "Arlene R. Colantuono"}, {"rating": 5.0, "review": "This is Apple TV 3 Rev A A1469 the most recent model, sealed brand new. Prime account got it to me in 2 days flat. Great streaming, and a must for ipad and iphone users. If you use android go with kindle for hd.", "verified": true, "helpfulness": "0/0", "author": "Trg"}, {"rating": 5.0, "review": "Shipped in 1 day with prime. Works great. I don't know how I've been watching TV without it!", "verified": true, "helpfulness": "0/0", "author": "Noel Pendergrass"}, {"rating": 5.0, "review": "Works well with no issues", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "Unit no longer works. Light keeps flashing. Try restore using remote - no luck. No I get advise to order micro-USD cable to try to restore using iTunes. Return window closed 3 days ago. I am feeling sooo lucky!One visit to website, then store - issue resolved thanks to Genius Bar folks.", "verified": true, "helpfulness": "0/1", "author": "Tatarin"}, {"rating": 4.0, "review": "as advertised", "verified": true, "helpfulness": "0/1", "author": "tim"}, {"rating": 5.0, "review": "Works as advertised.  Just plug it in and follow the directions on the TV to program it.", "verified": true, "helpfulness": "0/0", "author": "Richard E. Roberts"}]