[{"rating": 5.0, "review": "Great purchase, we are very happy! So easy even Hubby can do it!", "verified": true, "helpfulness": "0/0", "author": "Vicky"}, {"rating": 1.0, "review": "This product SUCKS!!!  Cannot get General Hospital on Watch ABC.  Apple verifies issue on their end.  Tells me I am responsible to contact ABC and fix it?  Offers me ABC technical support #?  SUCKS!!!!!  Apple will assume NO RESPONSIBILITY FOR THEIR PRODUCT with the services THEY offered me to incentivize me to buy it in the first place!????  They SO don't get it!  SUCKS!!!!", "verified": false, "helpfulness": "0/4", "author": "techdecisionsinc"}, {"rating": 5.0, "review": "Very good,better than expected.I wish I new about it sooner,could have me some money.Thanks a lot.", "verified": true, "helpfulness": "0/0", "author": "Aubrey Willis"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Alexi Villalobos"}, {"rating": 4.0, "review": "Great...until I discovered roku.  With roku I was able to cut the cable cord.", "verified": true, "helpfulness": "0/0", "author": "Joe Consumer"}, {"rating": 4.0, "review": "does the job - a little tricky getting set up and using", "verified": true, "helpfulness": "0/0", "author": "David Zellmer"}, {"rating": 2.0, "review": "I mainly use it for YouTube, Netflix, and iPhone/iPad/Macbook mirroring. It has only a few movie, video, music, and news apps. Image quality is top notch. You can also link it to your flickr account and use your pics as a screen saver.Being an energy conservation freak, it did bother me at first that you can't turn the device off. You could set it to sleep through Settings or just wait for the sleep timer to go off. It does make it easier because you only have to turn the tv off. It is disappointing enough that you can't add apps, you can't even delete the apps you don't like.Typing with the remote is cumbersome. Apple does have a AppleTV remote app but it is lacking a keyboard entry feature so performing searches takes as long as using the standard remote.I wish it worked with standard bluetooth keyboards and had a safari (web browsing), Amazon, and eBay apps as well. Apple needs to support audio transfer to the iphone/ipad/ipod touch, something the Roku 3 has by including a headphone jack with the remote. I want the big screen but be able to crank up the volume and not bother others around me at the same time.It should also support USB and or SD cards and allow music and videos to play.In short, the AppleTV doesn't offer much more than what an XBox 360/One or PS3/4 already offers. If you have one, you don't need it. The Roku 3  is a better option since it has a lot more apps, games, and a headphone jack in the remote for personal surround sound.", "verified": true, "helpfulness": "2/2", "author": "Creezy Mak"}, {"rating": 4.0, "review": "I'm an older person so lucky for me, my grand daughter came to my rescue when I tempted to install/program my Apple TV. Now that it's up and running, I really enjoy all that it can do.", "verified": true, "helpfulness": "1/1", "author": "Utah guy"}, {"rating": 5.0, "review": "OH MY F@#$^# GOD YAAASSSSI JUST LOVE APPLEAPPLE THISAPPLE THATAPPLE EVERYTHINGI DON'T EVEN THINK FOR MYSELF BECAUSE IM A SPOILED WHITE KIDI CAN SAY ANYTHING I WANTNADADADADADADADADADWHERE YOU AT AMAZONTHIS JAWN IS THE SHIZZZZZZZZZZZAAAAAAHHHHHHHH PAL!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "nathan allebach"}, {"rating": 1.0, "review": "Wirelessly connected to an Arris TWC modem in another room, it's terrible. Takes 2hrs. plus to download a movie or simply shuts down. Was told by Apple there was improved wireless connectivity in the new model, and it was the same exact problem. Not happy", "verified": false, "helpfulness": "1/3", "author": "DK1000"}]