[{"rating": 3.0, "review": "I set this up, messed with it for a bit, then returned it once I realized my PS3 will cover everything it offers that I want. While it has a slick operating system and lots of features for the price, it just wasn't for me.", "verified": true, "helpfulness": "3/3", "author": "airon"}, {"rating": 5.0, "review": "Apple and the seller... Great job!", "verified": true, "helpfulness": "0/3", "author": "Steven Mcgee"}, {"rating": 5.0, "review": "Love it! I already have a smart TV but I like this better. The way the menus are lined up is much better. I was going to spend $30 for a long HDMI cable to connect my computer to my TV but I figured why not just buy this! Happy I did!", "verified": true, "helpfulness": "1/1", "author": "Kenny"}, {"rating": 5.0, "review": "Love it, the quality and simplicity of Apple.", "verified": true, "helpfulness": "1/2", "author": "Michael E Thomas"}, {"rating": 4.0, "review": "Excellent addition", "verified": true, "helpfulness": "0/2", "author": "snow bunny"}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/2", "author": "Benjamin Starkey"}, {"rating": 5.0, "review": "Apple simply works. And I have to admit, this one works well.Setting it up is really simple and it streams high definition contents to my hd tv flawlessly.When chromecast first came on the market, I was one of the first people to buy it.  But after a while, I got tired of chromecast's inability to maintain steady streaming.  While watching, the streaming quality would degrade over time, and then eventually lose its connection.  Apple TV 's mirroring feature or its AirTV, however, never suffered this in any way.  It \"casted\" whatever I was watching on my iPad mini to my tv via AppleTV's  airTV  feature and maintained great stream quality.The only drawback is that it lack app variety.  Since I have a roku on the same tv, this is not a problem for me.  I use AppleTV for streaming videos from websites for which there is no app counterpart.  For that purpose, it is PERFECT!", "verified": true, "helpfulness": "3/3", "author": "Curious George \"Eternity Newbie\""}, {"rating": 5.0, "review": "Very easy installation and set up of our Apple TV.  Still figuring some things out but over all its another very cool Apple product", "verified": true, "helpfulness": "0/1", "author": "Leonora Starr"}, {"rating": 4.0, "review": "My hubby loves it, he cant get enough, works great with my Ipad.", "verified": true, "helpfulness": "0/1", "author": "Elizabeth Turner"}, {"rating": 5.0, "review": "Netflix looks 20 times better when viewed through this device", "verified": true, "helpfulness": "0/1", "author": "Bobby P"}]