[{"rating": 3.0, "review": "It's a pain to set up. But I expected this. It doesn't offer anything any of the other type products offer. Nothing special with this thing.", "verified": true, "helpfulness": "0/5", "author": "nelly"}, {"rating": 4.0, "review": "Alone, the Apple TV is almost useless except for the Netflix app. However, if you own several Apple products (iPhone and Mac), it becomes infinitely more useful. Airplay is just awesome (if you don't know what this is I'd recommend looking it up).", "verified": true, "helpfulness": "0/1", "author": "Pierce Hite"}, {"rating": 5.0, "review": "I ordered this and, when I figured out how to use it, it's been a really great addition to my Home entertainment setup. If you download the \"Remote\" app from the app store you can use your iPod, iPad, or iPhone to use as a remote and means of playing movies and videos.  Very simple instructions; just a few modifications to you iTunes account and you will be amazed and the world of technology (at least I was, I'm a bit behind of tech-stuff).I highly recommend this if you have any Apple items with wifi or 3/4G service.Kudos to Steve Jobs!!!", "verified": true, "helpfulness": "0/0", "author": "Jon F. Huston"}, {"rating": 5.0, "review": "The main reason I purchased the AppleTV was for the Airplay feature. Shipping with AmazonPrime is always fast so I received my product on time. Installation for the AppleTV to my Home Theater System was very simple. Make sure you have an HDMI cable ready because this does not come with one. (I didn't have an extra one so I had to buy another HDMI cable online which prolonged my AppleTV usage for another 2 days) The Airplay feature works amazingly great! I'm very surprised of how easy it was to actually use this feature. At first, I thought I had to install a software, but once the AppleTV was connected, there was an Airplay icon that appeared on my Macbook that I click and BAM! Your desktop is on TV. Resolution on the TV is very nice and it also sends the audio to the TV. I connected this to my Home Theater System so the audio is surround sound as well.The only complaint that I have is when you're connecting to the Wifi, it does not scan for available networks; therefore, you can't click on the available SSID and connect to it. You physically have to type the EXACT SSID. This took me a while because I didn't capitalize a letter, forgot to put a symbol, didn't put correct spacing...etcAlso, I already had the remote control for my macbook pro (Remote configured to my macbook) so I decided to use this remote instead of the one that came with it.Since the remote is already synced with my Macbook, every time use the remote to go through the AppleTV, this would also increase/decrease the volume for my Macbook which was a bit annoying.Photo stream works just as great as it did with my iphone and Macbook. (It does take a while to load all the photo stream photo's onto the Apple TV)The movies that were being offered through the AppleTV were a bit pricey, but that's what Redbox is for.My only intensions of using the AppleTV is solely for Airplay. Once you set everything up, usage is simple and I'm glad that I purchased the AppleTV.Another fine product from Apple!", "verified": true, "helpfulness": "4/5", "author": "Kenta Kamohara"}, {"rating": 5.0, "review": "The first thing that really attracted me was the design, because is small and a nice color, had a doubt about if it was very useful or not, but when I found out all you can do with this small box I didn't think to much to buy it, I do recommend this product also because is very easy to set up and use in couple of minutes, something bad is that doesn't include the HDMI cable, after you get the cable all you need is a good wireless connection and you're done!Also let me mention that delivery was in only 3 days, it was well protected, so Apple TV is highly recommended", "verified": true, "helpfulness": "0/0", "author": "L. O. Cano \"leoc\""}, {"rating": 5.0, "review": "The Apple TV exceeded my expectations 15 minutes after it was out of the box.It is tiny, beautiful, easy to set up, and incredibly useful.What's to love:1. Easy set up.2. It's easy to play our Netflix account through it.3. It's easy to play movies and TV from your iTunes account.4. It's easy to show your pictures from iPhoto on the screen--although they don't appear entirely as they are organized in iPhoto. (I'd guess about 90%.) Note: 1080 isn't enough lines to do complete justice to good digital pictures, but especially the ones that don't have bright, harsh light in them look at least as sharp as HD movies and TV--true colors and you could count the hairs on a picture of a caterpillar.)I haven't tried to play iTunes music or Web-based video through it yet.If they aren't easy, I'll report back.", "verified": true, "helpfulness": "0/0", "author": "J. M. Walker"}, {"rating": 1.0, "review": "OK my 1st review was negative and I'm sorry for that. i had to get professional installment help and i got to admit I'm satisfied, good product so far", "verified": true, "helpfulness": "3/14", "author": "vince"}, {"rating": 5.0, "review": "Very easy to useExcellent pictureItune and iclouds work greatScreen resolution excellentMirroring from computerLap iPhone iPad iPodLooks great from any tv", "verified": true, "helpfulness": "0/0", "author": "GABRIEL FELIX"}, {"rating": 3.0, "review": "Ingenious toy coupled with absurdity by Apple thuggery, form over functionUnless you're a complete Apple monastic like myself, owning everything Apple makes, ala iphone, mac air, macbooks etc (and even, myself, having the apple logo tattooed on your wrist)., the intrinsic usage of the Apple TV box will infuriate you to the point of hanging a noose over a rafter to 'end it all' vis a vis the infuriatingly useless and pathetic remote that comes with this unit. Wonderfully downloadable from the Apple app-store is the \"remote\" program such that I can with my Ipad or Iphone do quick and easy searches on youtube or netflix quickly and wonderfully scrolling thru the screen and using a genuine though small keyboard on the ipad and iphone;  however if you are not the owner of said device(s), you will find Apples typical insane thuggery and near-perverse dedication to packaging its products in the smallest oragami sized packaging possible along with equally small and form over function (vs. ideal form following and mirroring/mating with function) hardware.Such is the case of the Apple TV remote, which is creepy to hold, thin as a bookmark, and feeling (to the blind) like holding a surgical knife, and having only 3 buttons, of which if you want to do a search on your wifi network for youtube vids etc etc. you will scream havoc and damnation upon the heads of Apple for making what I'm sure they thought at the time as a \"cute understated and 'hip' looking remote control\".Answer would have logically have been to include a touch sensitive pad to the top of the remote as the Apple magic mouse has and a $5 HDMI cable and charge $20 more for the unit package to cover the hardware production costs to the enduser to accommodate those who, unlike myself, are not monastic devotees to Apple and its array of products. I own 18 Apple products and have branded my body permanently with its corporate logo and advocate heavily for its OS and computers, as such I feel both logically and with evidences from experience in use of this product, to not only cry foul upon this absurdity of user-interface insanity, but proof of my dedication to Apple Inc. and not be, as there are out there, many Apple-phobics/haters. Dont buy this product unless you ALREADY own another Apple-created search tool (iphone or ipad). Searches and typing with this remote are an utterly insane non-starter; all the more so important since many buy this as a web portal video search interface for their TV.", "verified": false, "helpfulness": "0/2", "author": "VeritasluxMea \"Neoplatonic Platonist\""}, {"rating": 4.0, "review": "I have tried at different times to play movies from my PC or NAS on my TV through my home theatre.  Each time ending frustrated and disgusted.  I was told about the Apple TV and said to myself \"so it plays iTunes, it's probably a bitch to set up\"  But, I went and put down the $99 for the unit.  After a day of being able to watch movies (with the surround sound pushed through so the entire experience is maintained)  and listen to music on my PC without having to go through all kinds of hassle I went out and got another for the bedroom.  Now I can easily watch or listen to what I want where I want.  The only requirement is that iTunes has to be running on the PC where you want to play content.  The screen can be locked and if you happen to be using the machine while someone is playing a movie or listening to music you don't have to watch or listen to their selections.  Setup is quite simple and access is controlled via and iTunes store account.  Any purchases made through iTunes are available to you on the Apple TV for streaming purposes.  3rd party Apps are VERY limited.  But that said it does a excellent job of what it does, even though it is limited.  There has been an update so that any IOS devices can \"mirror\" what is on their screen onto the apple TV.  Also the latest generation of Mac's can mirror what is shown on their screen onto the apple TV.  So any net movies can now be viewed on the TV.  A good enhancement.  Overall I'm happy with the Apple TV, just wishing it had more 3rd party app support.  Connectivity on the back includes HDMI as well as fibre optic cable for the audio.  The box is small and unobtrusive.", "verified": false, "helpfulness": "0/0", "author": "Wizbang_FL"}]