[{"rating": 5.0, "review": "For $99 you can't beat this purchase, especially if you have other Apple products to take advantage of Airplay.  One of the most unexpected side affects of owning hit is my increased usage of Youtube.  I really didn't watch Youtube much because of the small size on my MacBook Air. With the Apple TV the full screen Youtube app is excellent. There are so many episodes of older TV shows, movies etc that I can now watch!", "verified": true, "helpfulness": "0/0", "author": "Nathaniel"}, {"rating": 5.0, "review": "Finally, I'm able to take advantage of my iTunes library without having to plug in my iPod, iPhone or iPad. Streaming, AirPlay, etc., etc., I'm just happy.", "verified": true, "helpfulness": "0/0", "author": "D. Yost"}, {"rating": 4.0, "review": "I AirPlay my videos and photos from my Mac and iPhone without having to connect them to the TV. Expecting more content on the Apple TV soon :). I use it to also play Netflix and youtube videos.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "En cuanto vi el producto en casa de un amigo me quedé impresionado e inmediatamente lo compré.Excelente equipo para transmitir desde el iphone, ipad y macbook hacia el TV", "verified": true, "helpfulness": "0/0", "author": "Daniel Ramirez \"danramirez\""}, {"rating": 4.0, "review": "If you're tied to your iTunes account or want to use Screen Mirroring from your iPad then this is the best box for you.  However, if you just want a smart media streamer you'd do better with an Android Mini PC.  Available on Amazon for as little as $30.", "verified": true, "helpfulness": "2/3", "author": "Install Heroes"}, {"rating": 5.0, "review": "Bought an Apple TV just to play around with and a bit because had grown very tired of my Samsung smart TV features crashing.The box is small and the black flat color makes it easily hidden away.  The remote is a beautiful machined work of art. It fits nicely in the hand and the simple concept should be a lesson to any company that makes remotes.Setup: Could not be simpler.  Plugged it in to TV and within 5 minutes was logging in to Netflix and streaming video.  Most difficult part was remembering passwords to do one-time logins.Use:1. The UI is simple, elegant and easy to use.2. The video quality is excellent, it does not downgrade quality.  Streaming Netflix on my TV or through XBox always was frustrating in regards to video constantly coming in at different resolutions.  Used to blame it on my Internet connection until seeing the difference on Apple TV.3. iTunes integration is really nice and easy to set up.  No complicated directions to follow, Apple TV walks you through in an easy to follow manner.4. Never crashes.  The smart TV functions on my Samsung TV crashed or froze so frequently that I figured it was just part of using it... And it was, but not with Apple TV.  In almost a year of using it, it has not crashed or needed to be reset one single time.5. If you have an iPad, iPhone or Mac computer Airplay is great.  You can easily mirror the device onto your T.V. to show slideshows, presentations or anything you can think of.6. Can run slide shows from either Photostream or FlickerA couple of months ago my cable bill went through the roof after discounts expired.  Total bill was coming to over 200 dollars a month and best they could do was to reduce it to 120.  This was without any premium channels.  After doing a little math I concluded I could pay for Netflix and Hulu plus as well as buy the TV shows not available on either of those services on iTunes and still pay much less per month.Only drawback for me is no Amazon content available.  Maybe in the future...After two years of use and two years of having no cable I am more than happy with my choice of cutting cable and going this route. Over all the savings alone have more than paid for the Apple TV box. Since the time I wrote the review several apps have been added and content has increased to the point I just do not see going back to cable at all. Recently when I was presented with a chance to get video service with my internet for just $3 more I declined. What is the point of having a bulky cable box when I can watch the latest programs on Hulu plus when I want? In addition there is now even streaming news as well as a greater variety of services offered.Do yourself a favor and ditch cable video for either Apple TV or one of the competitors. You will save money, be able to watch what you want when you want to watch it.", "verified": false, "helpfulness": "68/74", "author": "Alan C. Bryant"}, {"rating": 1.0, "review": "As a person who loves Apple products this was a must in my house.  However, I was really disappointed by its capability.  It basically only gives you Netflix and Hulu.  A dvd player today does more than Apple TV.  Watching movies through ITunes is a pain because it is  constantly buffering.  This is not a problem with my internet because I watch TONS of shows and movies online and never have this problem . Only with the Itunes store.  I am really tempted to junk this thing and go with Roku.  Thankfully this was a Christmas gift otherwise I would be pissed I spent the money on this.", "verified": false, "helpfulness": "13/27", "author": "Jennifer \"Jenn\""}, {"rating": 4.0, "review": "This is one of those things that gets a lot of use when people come over.  We use mirroring feature a lot.  It is a very good Netflix player.  Just wish they would expand the available apps a bit.  I get that they are competing with Amazon, but it would be really nice to have an Amazon Instand Video app.  If they expanded the library a bit, this would be my favorite media player.", "verified": true, "helpfulness": "1/1", "author": "Rick"}, {"rating": 4.0, "review": "My Roku stays hot even when not in use.  Apple just makes a better polished product.  They may limit your use but nothing beats it.  I would go with this definitely if you have an iphone/ipad/itouch but also would recommend this over Roku unless you like 5000 channels of stuff you may not use.", "verified": true, "helpfulness": "0/0", "author": "Scott Cho \"SwooP\""}, {"rating": 4.0, "review": "This item works very well with AirPlay... I did end up purchasing an inexpensive third party app in order to display my mid 2010 MacBook Pro via AirPlay, so all is well. It does have one Con: The Netflix user interface is not all that great on this AppleTV, compared to PS3's Netflix user interface.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]