[{"rating": 5.0, "review": "I have a roku and wiiU. I bought the Apple TV bc I have the hboNow app. Easy to connect. Highly suggest googling the setup tutorials.The only cons I have are:There is no keyboard even in the app availableI can only watch Amazon Prime when I do AirPlay.Remote gets lost so easy. I suggest adding Velcro.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"janetics\""}, {"rating": 5.0, "review": "great performance", "verified": true, "helpfulness": "0/1", "author": "JaeWon Chang"}, {"rating": 5.0, "review": "Got this since we only have antenna (we refuse to pay the cable cable company's outrageous prices). It works far better than my Samsung blu-ray player and we can stream everything we could need through this Apple TV. We LOVE it. So far we use Netflix, HuluPlus, and HBO Now or Go. It's so nice being able to watch anything you want and at your convenience. The small size tucks neatly out of sight, too (size of your hand). Super easy set up was great. Get yourself Apple TV!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's Apple..... it works just like it's supposed to.  BUT, it does not provide Amazon Prime programming.  See other reviews about how to circumvent this deficiency.", "verified": true, "helpfulness": "0/0", "author": "Guy Hawkins \"GuyHawkins\""}, {"rating": 5.0, "review": "This unit was a replacement for an older model. It was easy to set up. You may have to unplug for 10 seconds to reset after automatic upgrades are downloaded. It works fast and well. Love it!", "verified": true, "helpfulness": "0/1", "author": "R Read \"Yorkie Lover\""}, {"rating": 5.0, "review": "Got rid of cable, love the device. Would purchase again", "verified": true, "helpfulness": "0/1", "author": "K. E"}, {"rating": 5.0, "review": "Awesome! We love it!! We use it to watch movies! Glad we got it on sale for 63$ vs 100$ like my brother had gotten it for!", "verified": true, "helpfulness": "0/1", "author": "Stacey L."}, {"rating": 3.0, "review": "Positives: Stable streaming. Competitive pricing. Airplay.Negative: Limitations of Airplay disappointing. Adds little to features of in ROKU.  Adds nothing to the stability ROKU . Awkward small remote is not as intuitive as the ROKU remote.", "verified": true, "helpfulness": "0/0", "author": "DontDOIt"}, {"rating": 5.0, "review": "The device worked as expected and advertised.  Once home sharing was initiated all the apps I wanted appeared and worked well.", "verified": true, "helpfulness": "0/0", "author": "Douglas W."}, {"rating": 5.0, "review": "Terrific if you have Apple electronic and want to watch HBO.", "verified": true, "helpfulness": "0/0", "author": "Lora Opsahl"}]