[{"rating": 5.0, "review": "I've owned a V1 Apple TV for several years and loved it. I hung onto it because I thought it was better to be able to download songs / movies to the Hard Drive. I decided to upgrade to the latest edition, and pleased I did. The new Apple TV connects to iPhone / iPad remote control effortlessly. I think you get maximum value if you are also using iTunes match so all your music / videos are available even when your PC is turned off.Great product.", "verified": true, "helpfulness": "0/0", "author": "TheBritAbroad"}, {"rating": 5.0, "review": "Apple TV has exceeded all my expections!  Hours and hours of great streaming.  It's so easy to use and right there, 24 hours a day!  I'm going to \"cut the cable\" to reduce the expense and go with broadcast TV, Netflix, and this little unit!", "verified": true, "helpfulness": "0/0", "author": "Billy T."}, {"rating": 5.0, "review": "Got this as a gift from my kids, so for Christmas I had to buy one for my husbands TV as he got jealous because I had more on my TV then him but it's an excellent gift for anyone always needed this but didn't know the name of product. Came almost the next day.", "verified": true, "helpfulness": "0/0", "author": "Mikelle Briscoe"}, {"rating": 5.0, "review": "bought it as a xmas gift  he loved it  found alot of features he did not know it had  loved it !", "verified": false, "helpfulness": "0/0", "author": "Joan Joiner"}, {"rating": 4.0, "review": "I needed to update the device a couple of times in order to use it on my iPad & IPhone and able to use it on my older MacBook to access the music & photos. However I could not use Airplay or display what was shown on my MacBook. This was actually the main reason I purchased the unit as a substitute monitor. Well at least I could view the content on most of my Apple devices.", "verified": true, "helpfulness": "0/0", "author": "dcbonner"}, {"rating": 4.0, "review": "I bought this primarily to use with AirPlay on my iMac--and stream music from my iTunes, thru the Apple TV to my sound system.  But I also use it to stream photos and slideshows--very easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "BradB \"A/V Guy\""}, {"rating": 5.0, "review": "I am an Apple person so it made sense to finally purchase Apple TV. It works great and I'm glad I added it to my collection of Apple products. It makes my movie watching experience effortless.", "verified": true, "helpfulness": "0/0", "author": "Wanda Marie"}, {"rating": 5.0, "review": "This little thing is great. I use it in a couple of different ways which I will quickly detail here. 1. I use it to \"push\" movies from my iPhone and iPad to the TV, things like YouTube and internet videos. 2. I use it to stream movies from my iTunes on my iMac, you must be connected to the same home network for this. 3. I use it to rent movies directly from iTunes (Apple TV app), you must be connected to the internet for this.The only problem I have with it is any movie I get not in Apple format I need to convert and then drag into iTunes. This is a manual workaround but I have it pretty well down to a science by now. Those of you with Macs will want to use the free program called Handbrake and choose one of the pre-set AppleTV conversions, I currently have been using the AppleTV3 conversion pre-set and everything is great!", "verified": true, "helpfulness": "0/0", "author": "B. Briggs \"talktob\""}, {"rating": 5.0, "review": "Me gusta bastante, fácil el manejo y compatible con todos los device de Apple , q quiten q diga, ya", "verified": true, "helpfulness": "0/0", "author": "Carlos Brana"}, {"rating": 5.0, "review": "I have owned several Apple TVs of all three generations, I have loved the concept from the very beginning. This device is the reason that I don't pay cable TV, just a very fast internet connection plus Netflix, iTunes etc. This third generation goes all the way to full 1080p HD resolution and costs less than half what the first edition cost - and it is so much more capable. My only wish for improvement is for Apple to find a way to offer channel based TV subscriptions, it would be fantastic to put together your own lineup and pay accordingly. It's simply amazing what a small box for less than a hundred bucks can do. I have yet to come across someone who doesn't enjoy using an Apple TV. There's one on every single TV in my household.", "verified": true, "helpfulness": "0/0", "author": "C. Wolters"}]