[{"rating": 5.0, "review": "Works great, exactly as advertised and takes next to no setup.", "verified": true, "helpfulness": "0/0", "author": "Kingpin \"Kingpin\""}, {"rating": 3.0, "review": "We are gadget household and have plenty of Apple products, Airport Time Capsule, Mac Air, Ipad mini and iPhones so it pains me slightly to be less than impressed with an Apple product.  For our TV we were looking to replace our Google Chromecast. We purchased a Roku 3 and love it, loved it enough to get another for office but this time we went Apple, figured we needed to try them all.What I like about it- Well the remote is nice, might be too small but intuitive as you would expect from Apple.- The UI is great- Device is sleek and looks great on the shelf- The setup was simpleWhat I didn't like- No Amazon Prime (well there is work around - use the airplay and play it on my iPhone and share to the screen)- Slower remote response then the Roku.So I think I would have really like the Apple TV coming from the Chromecast if I didn't do the Roku first.", "verified": true, "helpfulness": "3/3", "author": "Scott Z"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "kamil nemri"}, {"rating": 5.0, "review": "Apple product is always at its finest! If anyone out there looking for a good and reliable device for streaming Netflix, Hulu etc. this is it! There are a lot of these type of devices out there such as roku, chromecast, amazon's own fire stick (which I have tried all and own roku and Fire stick but returned the chromecast) Apple by far is my favorite simply of its simplicity ease of use and smooth operation with almost no glitch at all. With the combination power of its A5 single core chip and Wi-Fi (802.11a/b/g/n) which lets you have an excellent wireless streaming connection and incredible range you can't go wrong with this device. It's by far the best connection out of all of the devices I mentioned.It comes preloaded with application already (unlike fire stick you have to download each and every single one of the apps). Roku also comes preloaded with application as well but when it comes to operation apples and roku beats the fire stick with its smoothest and responsive command which the Fire stick is lack of and not to mention it feels cheap (maybe that's why is only $39.99). If you are an iPhone owner this Apple TV will allow you to sync with it so you can mirror your phone right onto the TV which that was a great feature for me because I do a lot of streaming on my phone thur torrent sites and it's just a perfect way to watch it on the tv instead of the phone.", "verified": true, "helpfulness": "0/0", "author": "Rick Chan"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "JQ"}, {"rating": 3.0, "review": "This is significantly slower than the Amazon fire stick (can't stress this enough), much bigger than the fire stick, far less smooth than the fire stick, remote is garbage compared to the fire stick's remote.Never messed with a roku or chromecast, but this Apple TV is not worth all the extra money (and you need a hdmi cord separately, not the case with fires stick). Just buy the Fire stick, well worth the 39$.Summary: after buying the Apple TV for 67$ and then 10$ for a hdmi (77$ total), I switched back to my 19$ (black friday price) fire stick after only a couple weeks. Waste of my money, but it did work fine, just not as good as the fire stick... So that's why I gave it 3 stars and not 1.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "Works great.", "verified": false, "helpfulness": "0/0", "author": "Cecily Adwell"}, {"rating": 1.0, "review": "What a useless device.  I hate the dependency on itunes with its limited codec support and limited apple selected video services.  If it was to be useful it should allow me to install iOS type apps for video playback, or natively search selected directories on file servers for content. If it supported iOS type apps and standard quicktime codecs, then I could run programs like DS Video, DS Photo etc and it would be useful.It does work with airplay, and thus content from mobile devices can be streamed, but if I have to have a mobile device and an apple TV, then I may as well just dedicate a macbook directly connected to the TV as the playback device since the ability to easily connect to shared network content directories and install video players and codecs makes it far more flexible than this little box.", "verified": false, "helpfulness": "1/1", "author": "J. Anderson"}, {"rating": 5.0, "review": "Gave this as a gift to my parents and they absolutely loved it! Plus, some of the apps that came with the Apple tv are completely free to use", "verified": true, "helpfulness": "0/0", "author": "Joseph Lugo"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Laura Maness \"Swimmingwiz\""}]