[{"rating": 5.0, "review": "excellent product, the ultimate in technology", "verified": true, "helpfulness": "0/0", "author": "Ramón Gonzalez"}, {"rating": 4.0, "review": "I like the Apple TV.  The best is that it allows Airplay from my iPad.  If you like Netflix and other TV stations from you Apple TV, you will like it too.  I know have a TV with Netflix so we use that but I like it.", "verified": true, "helpfulness": "1/2", "author": "John G."}, {"rating": 1.0, "review": "I do not write reviews, but this simply does not work.Look at the forums, the Apple TV does NOT work with streaming video and a macbook pro without unwatchable lag.The lag is terrible and it is a known problem for years without any solution.  It is unusable with my brand new macbook pro.", "verified": true, "helpfulness": "1/1", "author": "Thomas Kim"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "catherine leonard"}, {"rating": 5.0, "review": "We love our Apple TV! Fast shipping!", "verified": true, "helpfulness": "0/0", "author": "Abbie"}, {"rating": 4.0, "review": "I love to stream Netflix and pictures. AirPlay is a blast and so easy. Setup was fine. Quick and easy, as anything should be. The system was WAY smaller than I expected, awesome bonus. The only thing I don't like is I would have to pay monthly to use my music. I am going to buy the next generation when it comes out. I am hoping I can plug my TV into it, and use it more. Still a great buy and perfect for family TVs or personal use.", "verified": false, "helpfulness": "0/0", "author": "Landon Sheckard"}, {"rating": 5.0, "review": "Love my Apple TV !", "verified": true, "helpfulness": "0/0", "author": "Karina Arauz"}, {"rating": 5.0, "review": "great replacement option for cable. I don't subscribe to much else other than netflix, but i mostly got it for the airplay! I kissed comcast good-bye for the most part!", "verified": true, "helpfulness": "0/0", "author": ".amen"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "CPete"}, {"rating": 5.0, "review": "I researched all the different platforms to get Netflix and other things onto my not smart tv. The reason I chose the Apple TV over the others is because it is the only one that I can watch the movies I have on a hard drive on my tv. I do have other apple products but am not an \"apple fanboy\" per say. I buy products that work for the intended purpose after lots of research.", "verified": true, "helpfulness": "0/0", "author": "Matthew Perkins"}]