[{"rating": 5.0, "review": "Our church uses this for projection of songs and Bible verses. I imagine we will also use to show movies in the future", "verified": true, "helpfulness": "0/0", "author": "Bradley"}, {"rating": 5.0, "review": "Changed our lives.  Love that we can buy iTunes movies for the kids and have them all the time on apple tv.  No more scratched dvds.  We also use it to access Netflix.  The slideshow of pics from iPhoto when it is idle is also a big plus!", "verified": true, "helpfulness": "1/1", "author": "Meg C. Kevane"}, {"rating": 5.0, "review": "Got two now, one at house one at cottage, working great,, a must have if you have a iPad so you can mirror to your TV.", "verified": true, "helpfulness": "0/0", "author": "Robert McBride"}, {"rating": 5.0, "review": "Love Apple TV I don't have to deal with any cords to stream movies no more.", "verified": true, "helpfulness": "0/0", "author": "Jon Martienz"}, {"rating": 5.0, "review": "I'm an Apple guy (iPhone, iPad, MBP, Mac mini, and Apple TV).  There are a ton of products out there that will make your TV \"smart\" but Apple just does it better.  I love how all my products work together seamlessly: I purchase a movie on iTunes and it's available on my TV, MBP, iPad, and iPhone. No burning discs, no cables.", "verified": true, "helpfulness": "0/0", "author": "dpidduck"}, {"rating": 5.0, "review": "I bought this so I could stream my Itunes videos and podcasts to my TV directly from my laptop, the only downfall is that this isn't compatible with Windows Operating Systems.  I spent hours on tech support and forums trying to get it to work but to no avail, I later found that there is a software out there that you can use, it's called Air parrot and  you can purchase it for about $10 and it makes it so you can stream directly from your laptop so you don't have to worry about your data usage.", "verified": false, "helpfulness": "1/1", "author": "Dan"}, {"rating": 5.0, "review": "These work great for standard entertainment media streaming, but the big benefit is that they have the built-in Apple \"AirPlay\" which lets one screencast their iPhone or iPad to the device. We use these in classrooms for presentations and math teachers love them as they can write equations on the iPad screen and students can view through the projector.", "verified": true, "helpfulness": "0/0", "author": "cset"}, {"rating": 5.0, "review": "I like Apple TV because we have all apple products (iphones, ipads, macbook).  Super easy to set up with my macbook.  My favorite thing to do with this is to play music and watch slideshows of our family pictures from the computer on the TV.  We use it a lot for streaming Netflix.  I noticed streaming with the Apple TV as opposed to our blueray player is that with the Apple TV, the picture is very clear.  This is our second Apple TV.  If this one dies, I will buy another one.", "verified": true, "helpfulness": "0/0", "author": "Bridgett Howard \"Bridgett Howard\""}, {"rating": 5.0, "review": "What a fantastic addition to any television.I like the YouTube function which allows me to watch anything on the big screen", "verified": true, "helpfulness": "0/0", "author": "Luis Dobon \"Lou\""}, {"rating": 5.0, "review": "Who needs cable anymore? This is the future of television.  I'll never go back to cable where you get robbed every month. Easy set up and easy to use.", "verified": true, "helpfulness": "1/1", "author": "E. Rucker"}]