[{"rating": 5.0, "review": "I have Amazon Fire the Roku  and Apple TV boxes. They are pretty much the same product, but the Amazon Fire and Ruko gets more stations. I only bought the Apple because I have a Ipad and Ipod touch that I can use to view my content on the large screen tv or even mirror the Ipad on the tv if I so desire.Homesharing works perfectly between devices and if I put photos in the photostream file folder they appear on all the devices including my PC using Icloud. I recommend the Apple TV to anyone who uses Apple products.Apple TV has a great user interface which is by far better then Amazon Fire and Roku.  Each has it's benefits Amazon Fire has the Amazon prime and Roku has the voice search.  However Apple TV has the mirroring option for iPad and iPhone.", "verified": false, "helpfulness": "2/2", "author": "Dante's Reviews"}, {"rating": 5.0, "review": "Quick shipping, arrived as expected.", "verified": false, "helpfulness": "0/0", "author": "Aksalano"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 5.0, "review": "This unit has performed wonderfully.  By comparison, this unit has worked reliably without lookups and provides more opportunities to view video content than a western digital competitor product that was previously returned.", "verified": true, "helpfulness": "0/0", "author": "Vincent"}, {"rating": 5.0, "review": "I purchased this because my Tv is a few years old, still good, and Hdmi capable, so I didn't want to ye purchase a smart TV. I got it set up easily, with a little help, and it's great so far Netflix, Huku, Youtube all in one place. I only wish it amazon prime video, but I can do that from my IPAD easily.", "verified": false, "helpfulness": "0/0", "author": "Toby Stewart"}, {"rating": 5.0, "review": "This is my second apple tv. Love it", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 4.0, "review": "very good purchase!", "verified": true, "helpfulness": "0/0", "author": "Paul Shelton"}, {"rating": 5.0, "review": "What's not to love!  Apple TV does exactly what it says it will.  Love using it to broadcast my iPad or iPhone.  Links great with Hulu, Netflix, and HBO Plus just as expected.", "verified": true, "helpfulness": "0/0", "author": "Richard Julian"}, {"rating": 5.0, "review": "Love the apple tv", "verified": true, "helpfulness": "0/0", "author": "Charlene Sorrells"}, {"rating": 5.0, "review": "Love this box super fast and great size", "verified": true, "helpfulness": "0/0", "author": "Michael Hernandez"}]