[{"rating": 5.0, "review": "What would I do without my Apple TV? Seriously!  We love the device and use them in 2 rooms of the house. Great stuff!", "verified": true, "helpfulness": "0/1", "author": "Jennifer B. \"badeauxgirl\""}, {"rating": 5.0, "review": "Purchased as a gift for my daughter after considering other similar products. Really love the connectivity with other apple devices, makes it worth the purchase.", "verified": true, "helpfulness": "0/1", "author": "K. McCutcheon"}, {"rating": 5.0, "review": "Love it! Best purchased ever!", "verified": true, "helpfulness": "0/1", "author": "Liz"}, {"rating": 2.0, "review": "We have two of these units and they are very unpredictable even after ensuing software is up to date.  Problem connecting to the wireless network at times when all other wireless devices in the house work fine.  More commonly the perpetual spinning wheel for purchased movies that never load.  It is handy having two because at least one is operational, although tonight neither work, hence I have time on my hands to write a review!  We own many and love Apple products except for this stinker.", "verified": true, "helpfulness": "0/0", "author": "BeenThere71"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/1", "author": "Alex Deprat"}, {"rating": 5.0, "review": "Purchased one last year and my granddaughter loved it so I bought this one for her.  We both love them.", "verified": true, "helpfulness": "0/1", "author": "Randy Bullen"}, {"rating": 5.0, "review": "Really enjoy being able to display content on iPhone and iPad on my big screen TV.", "verified": true, "helpfulness": "0/0", "author": "KM"}, {"rating": 2.0, "review": "I've had a lot of issues with Apple TV in the last 6 months.Constant \"freezing\" when attempting to wake the device.  At one point (last firmware) everytime we wanted to use the Apple TV we would have to reset it using Menu + Down.  The latest firmware it's gotten better so we only have to reset it every other wake or there abouts.Farily often when watching netflix the show will just stop and be back at the main screen.I've had several occasions recently where the device will give a weird error about the type of signal.  Resetting it fixes.There have also been a number of times when after a reset it will come back online and say no wifi network found.  It actually appears that it's just not ever trying to connect when it turns on. Going into network and simply selecting the right wifi network and it connects and all is well again.Beyond the numerous bugs, I find that the netflix app is lacking.  My Panasonic blueray player has a much better Netflix app that is easier to see the shows as you select them.Overall, I can see the Apple TV being decent if they fixed some of the bugs, but as is I wouldn't pay for it (won mine in a contest).", "verified": false, "helpfulness": "0/0", "author": "DYRyet"}, {"rating": 5.0, "review": "5 stars all day. Should've been got this. I got the iPhone 6 plus my wife and two kids have the iPhone 6, wife has the iPad mini and iPad Air and we have a Mac desktop. Now with the apple tv it just completed everything. Stream right through it. HD pics movies and plays your videos off your phone and music and play your games on it. Netflix with no lag. Man. I wasted my years not having this. But better late than never", "verified": true, "helpfulness": "0/0", "author": "Toweh Ketter"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/1", "author": "Victor Fernandes"}]