[{"rating": 4.0, "review": "Great product but hate when buffer is running behind.Causes blurry picture until buffer catches up.Fast and smooth setup/operation.", "verified": true, "helpfulness": "0/0", "author": "Mandip Singh"}, {"rating": 5.0, "review": "Apple does it again with the adventure of technology meeting usefulness.  I can now stream my desktop to my HDTV, and with audio to boot.  Hard to find concerts, no problem.  Search YouTube for a good source, stream away.  Instead of paying hundreds of dollars on seemingly authentic DVDs, just find an online source, mirror the desktop and viola, perfect entertainment.  Of course, it works projecting audio only too.  Some of the apps are useless to me because they are already on my TV or Blu-ray player.  Another toy, yes.  But, this one is a keeper.  Oh yeah, my Western Digital box is in the drawer.", "verified": true, "helpfulness": "0/0", "author": "Harold"}, {"rating": 5.0, "review": "This is an amazing product that gives you access to HBO GO, Netflix, Hulu and several other options.  The reason I like this over Roku, which I used to have, is that I can play my music from my iPhone.", "verified": true, "helpfulness": "0/0", "author": "Joseph78"}, {"rating": 5.0, "review": "We got this one as a gift for my brother. They are enjoying there everyday with the kids being able to watch old shows and they love playing music from their iTunes. We have one as well that we use all the time. We have fun when friend are over and we airplay different video or clips that we have found on youtube. Every household should have one.", "verified": true, "helpfulness": "0/0", "author": "Erin Vernoy"}, {"rating": 5.0, "review": "This item works exactly as I expected it would.  Although its doesn't have as many bells and whistles as others, it works very well for streaming the content I want and set up is extremely easy.", "verified": true, "helpfulness": "0/0", "author": "Jim taylor"}, {"rating": 3.0, "review": "This device is sold in high volumes here in Germany (on military installations), the only drawback is that Hulu, Netflix, and all the Disney channels do not work if you are living on the German economy.  Even when we paid for a U.S. VPN number, changed the DSN I.P., those items still didn’t work.  Hopefully it will live up to the hype once we return to the states.  I also bought the Roku 3, and it advertise to contain 2x more channels then Apple, but of course being on a European economy, we where only able to receive channels I have never heard of and none of them were Hulu, Netflix and or Disney...the main reason people purchase these devices.  I will write more in the Roku 3 section.", "verified": true, "helpfulness": "0/0", "author": "Dorian"}, {"rating": 5.0, "review": "I've had my Apple TV for half a year and love it. It's user friendly and the interface looks nice. Definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Steven Mitchell"}, {"rating": 2.0, "review": "I bought this Apple TV primarily for mirroring games and was excited to see how Asphalt 8 car racing would look on my big screen TV... except for one problem... there is a half second lag time from iPhone to Apple TV via Airplay.  Result: when trying to hit the perfect window at 170 mph between knocking your opponent out and hitting the sweet spot in the turn, you end up in his wheel well or in the wall.  I'm sure movies are great (though the \"HD\" sports streams were like SD quality in a 16:9 frame) but at least for this gamer, it was an epic fail...", "verified": true, "helpfulness": "0/0", "author": "Eric Wave"}, {"rating": 4.0, "review": "This device is great.  I play all my iTunes library, videos included to it.  If only you could download additional apps this thing would be perfect.  It needs Showtime Anytime, Pandora, and a few others.", "verified": true, "helpfulness": "0/0", "author": "D. Fitzgerald \"fitz\""}, {"rating": 5.0, "review": "This is the best streaming player out there. It provides you with all the apps that you need in a normal TV viewer's life, seamless and Airplay connectivity with your iOS devices as well as can connect wireless with your computers once you have iTunes synched up. Very handyThe remote is very sleek and stylish.", "verified": true, "helpfulness": "0/0", "author": "Arindam"}]