[{"rating": 5.0, "review": "GREAT PRODUCT BUT THE PRICE WAS RAISED IN THE LAST 24 HOURS!!! YOU CAN PURCHASE THIS AT WALMART FOR 92.00 AND BEST BUY!", "verified": false, "helpfulness": "0/1", "author": "Suzy"}, {"rating": 5.0, "review": "Bought this as a gift and boy is it a hit! If you know what this unit does, then know that it does exactly as described. If you run everything (Movies, Shows, Music) through iTunes, then you need this! If you run everything through Amazon, then this or the Roku work great. Just depends on you.", "verified": true, "helpfulness": "0/0", "author": "H \"\"Quality Matters\"\""}, {"rating": 1.0, "review": "Let me preface this review by saying that I'm a huge Apple fan, a shareholder, and supporter. I learned how to use computers on an Apple II, I've had Apple PCs or laptops for work or fun for the past 17+ years. I have 4 iPads in the house right now and, between my wife and I, we've had one or more of every generation iPhone. I even bought a Time Capsule last Christmas when I bought our new 27\" iMac.I bought Apple TV because my friend had one and loved it. It was good for streaming content to his TV and music to his stereo. I needed the same for my house so I purchased the latest version about 9 months ago. Since I've owned it, there hasn't been one time where I've turned it on and it's worked as I expected. It either needs updated account into, it needs updated firmware, or it straight up doesn't work. Never have I hated an Apple product until this one. It's really frustrating because when my kids want to watch movies or TV content from Apple TV, it ALWAYS fails to work properly for one reason or another.I know why Apple treats Apple TV like an afterthought--it's because it sucks.", "verified": true, "helpfulness": "7/10", "author": "D. Wood \"ATL\""}, {"rating": 5.0, "review": "Excelente!!!!", "verified": true, "helpfulness": "0/1", "author": "VARTOCO"}, {"rating": 5.0, "review": "Works great! Liking this a lot!", "verified": true, "helpfulness": "0/1", "author": "DantheMacMan"}, {"rating": 5.0, "review": "We use our Apple TV primarily for streaming Netflix. It's so nice to be able to stream on the television as opposed to on the computer. We have yet to check out the other apps, but it does come with quite a few. Worth the money, IMO.", "verified": true, "helpfulness": "0/0", "author": "J. Bostrom"}, {"rating": 5.0, "review": "Now I can watch all the porn on my computer from the comfort of my own couch!", "verified": false, "helpfulness": "1/2", "author": "Craig Schultz"}, {"rating": 5.0, "review": "very good quality item..", "verified": true, "helpfulness": "0/0", "author": "Angel R. Bejarano"}, {"rating": 5.0, "review": "Perfect media player if you already have Apple products.  Has most of the same apps as Roku and Chromecast but this will allow you to mirror your Mac, iPhone, and iPad onto your TV.  I've never had any issues with it and it always seems to work reliably.", "verified": false, "helpfulness": "0/0", "author": "Brad Meiser"}, {"rating": 5.0, "review": "Great product! Seller 10 points", "verified": true, "helpfulness": "0/0", "author": "E.D.F."}]