[{"rating": 1.0, "review": "If you don't have Netflix or other similar services, Apple TV is totally useless. Use it for air play only.", "verified": true, "helpfulness": "1/5", "author": "JC"}, {"rating": 5.0, "review": "This is the easiest most intuitive device that turns any TV into a smart TV. I have 3 and have gifted 3. As far as I am concerned...if you have an iPhone and an iPad...you can't do better. Roku and the like just don't offer the ease of use.", "verified": true, "helpfulness": "1/1", "author": "BernerMom"}, {"rating": 5.0, "review": "maybe we don't need 4, but each one of us has an Apple TV on our TV....we love it! Easy and Fast!", "verified": true, "helpfulness": "1/1", "author": "Susan Mendoza"}, {"rating": 4.0, "review": "Serves the purpose and now that we are accustomed to using... we don't use TV or BluRay apps. Being able to stream video and images from Mac laptop has done wonders for my neck and enjoyment level when wife shares schtuff. Apple should include the plastic mounting bracket and loosen the purse strings...because of that, I give it a 4.", "verified": true, "helpfulness": "0/0", "author": "Harrence J. Technician"}, {"rating": 4.0, "review": "I bought this because I had a TV in a room with no cable. It is a great item for movies and back series. Good picture.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Plantz"}, {"rating": 5.0, "review": "Apple TV is great! I love having a smart tv without the price of one! I have access to Netflix, Yahoo, YouTube, etc on this device. I bought it for my 21 year old brother as a Christmas  gift and he loved it! He has an iPad & iPhone which he mirrors to the Apple TV and uses the ipad/iPhone almost as a remote control, it's a pretty neat little invention. When it goes idle on your tv it starts playing a slideshow which is pretty cool, could be random pictures or you can stream your iCloud and your personal pictures would come a cross the tv screen. Best thing is it's small and doesn't take up much space at all! all you need is a HDMI cord to connect it to your television because it's not included in the packaging! After seeing how much he liked his I decided that I wanted one for myself! best purchase ever, Apple has never let me down.", "verified": true, "helpfulness": "1/1", "author": "christina"}, {"rating": 5.0, "review": "Device is great.  Simple setup, easy to use.  Video streaming is good even connected with wifi.  I love this box!!", "verified": true, "helpfulness": "1/1", "author": "Clement"}, {"rating": 5.0, "review": "That is, when my kids aren't monopolizing it by playing Minecraft on their Ipads and using the AirPlay feature to stream it to the tv.  The Netflix and NHL Gamecenter menus are by far the nicest I've seen.  I have been using my PS3 to stream those in the past in this beats it out handily.  It was very easy to set up and configure and it's so small, you can barely see it behind my tv.  Playing my shared music is ridiculously easy and the picture/sound quality is flawless.", "verified": true, "helpfulness": "1/2", "author": "K. Neher"}, {"rating": 5.0, "review": "Love the simplicity of use. I frankly use the device 80% of the time streaming videos off my iPhone or iPad to the Apple TV. It is the best and most convenient. I've used Roku before, and frankly speaking it seemed to have a lot of \"bloat-apps\".Apple TV has the bare minimum number of Apps of which some are free and for others you need a cable subscription or know someone who has a cable subscription with the channels that are on there (ESPN, HBOGO).Practically every video streaming website I've used (Youtube, Yahoostream, etc) has Apple TV support - so you're pretty much covered there.In the event there is NO support, then simply use the \"Mirror\" option on your idevice.Cheers.", "verified": true, "helpfulness": "1/1", "author": "conscious79"}, {"rating": 3.0, "review": "I own two of these as well as a newly required roku 3.  I'm tired of apple locking Dom their devices so you can't access the competitions apps on them.  Vudu let's you access everything including amazon instant video and vudu which apple doesn't.", "verified": true, "helpfulness": "1/1", "author": "podarski"}]