[{"rating": 4.0, "review": "Only 4 stars because sometimes I lose connection or videos will stop playing. This happens on my work and home devices and usually occurs when streaming YouTube videos or ppt presentations.I hope the next model allows an HDMI input also so you can use without switching TV sources or taking up an extra port on the TV.My main use for this device is as a way to beam YouTube videos to my TV from my iPhone. I use this for music and videos when people are over. I used to use TwonkBeam but it doesn't work anymore. I hope the connections improve to 100%!", "verified": true, "helpfulness": "0/0", "author": "JS"}, {"rating": 4.0, "review": "I've had my Apple TV for a year-and-a-half.  It works flawlessly and exactly as advertised.  The only reason I don't give it five stars is that it simply lacks a lot of native channels that any good streaming box should have, for example, Amazon, Vudu, Spotify, Rdio, TuneIn, iHeart, PlayOn, Simple.TV, BYU TV, Ebru, to name a few of the bigger ones.  A lot of these compete with Apple for customers.  As it is, I use it when I can't get something on my Roku 3 or when it offers a better user experience.  For example, I can Airplay MLB At Bat from my iOS devices during the playoffs, so I can watch games on TBS which are unavailable on MLB.TV on Roku.  I also prefer the YouTube channel on Apple TV to the one on Roku and Airplaying Spotify to an Apple TV is a better user experience than using the Roku channel.  And if you use Podcasts, Apple TV allows you to sync to your iTune's account and podcast subscriptions, which the Podcast channel on Roku does not.If you are only going to buy one streaming box, I'd go with the Roku 3, but for the money saved from cutting the cord, anyone in the iOS ecosystem can augment their streaming experience with an Apple TV for about the cost of one month's cable saved by cutting the cord.  For that use, I recommend it.", "verified": false, "helpfulness": "0/0", "author": "Gregory K. Laughlin \"GL\""}, {"rating": 5.0, "review": "I used this almost every other day. Netflix, ABC, HBOgo, Fox, and other apps comes in preloaded and updates on the system comes in once a month. Can't live without it. I'm pretty sure Amazon has the fire that compares to this but I've never seen one in action yet. I also like the slick remote controller that comes with the apple.", "verified": true, "helpfulness": "0/0", "author": "nam nguyen"}, {"rating": 1.0, "review": "Scam bundle.", "verified": false, "helpfulness": "0/0", "author": "John M"}, {"rating": 5.0, "review": "As expected.. :-)", "verified": true, "helpfulness": "0/0", "author": "Remas"}, {"rating": 1.0, "review": "OMG!  I'm that person that was dumb enough to buy this bundle.  I should have read BEFORE purchasing.", "verified": true, "helpfulness": "0/0", "author": "Adonis Kelly"}, {"rating": 5.0, "review": "Happy with product. shipped quickly.", "verified": true, "helpfulness": "0/0", "author": "Rosario Carballo"}, {"rating": 5.0, "review": "Apple tv works great and came with remote as expected. Seller was quick to deliver.", "verified": true, "helpfulness": "0/0", "author": "Kelli"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Kathy Giese"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Jesus R Pacheco"}]