[{"rating": 5.0, "review": "Very pleased with the Apple TV & the quality. No issues, just need higher bandwidth internet to download movies faster. Fast shipping.", "verified": true, "helpfulness": "0/0", "author": "OSUCOWBOYNTX"}, {"rating": 5.0, "review": "Great product, easy to set up and use. Use it daily for Netflix and music. Sharing capability between the apple tv, iTunes, and iPhone is very cool.", "verified": true, "helpfulness": "1/1", "author": "Jsn716"}, {"rating": 5.0, "review": "We were quite pleased with the product. The Ipad Iphone connection works pretty good and you end up having a smart TV.", "verified": true, "helpfulness": "1/1", "author": "Y. Ulcer"}, {"rating": 3.0, "review": "I was able to get the apple TV setup pretty quick, it did have problems reading my Wifi network and I called apple and they had a fix within 5 minutes.  Once I got it going the features work pretty well, the netflix is great but does cost $8 month.  I have had issues with some of the airplay features where I have to reset the apple TV and/or my iPad 2/Iphone 4s.  The mirror function only works in SD and i wish it was expanded to HD.  If you just want to play music and videos from iTunes or Netflix this device is great! I wish it had more apps like HBO Go.", "verified": true, "helpfulness": "10/13", "author": "Doug Gold"}, {"rating": 5.0, "review": "This is a great little device and a big improvement over the original Apple TV, which I'm still using.  I got this to supplement my Roku boxes, mainly in order to be able to view content that I purchased from Apple's iTunes and stored in the cloud (which I can't do with a Roku) on Apple's servers.There's a huge improvement in the resolution on the Apple TV, not to mention that it seems a lot faster than the original model.  They've added Netflix which is nice, letting me access this content without having to switch over to my Roku box.Cloud content is where we're headed, and an Apple TV gives to a great way to take advantage of that, provided you're purchasing content from them.  For Amazon content, you'll need a different box, such as the Roku.It's a breeze to set this unit up, you'll be up and running within minutes.This is a great product for cord cutters.July 15th:  Update.... I just discovered the Airplay feature on this unit, which allows me to stream content from my iPhone or iPad, such as YouTube videos, or items in my iTunes library, making this device even more useful....", "verified": true, "helpfulness": "0/0", "author": "Damian P. Gadal"}, {"rating": 4.0, "review": "Product is as advertised, enjoy music, video from your computer . You tube on big screen is great, very simple setup. I love the airplay feature.", "verified": true, "helpfulness": "0/0", "author": "Cedar bird"}, {"rating": 3.0, "review": "For what it's supposed to do out of the box, it does pretty well.  But it's extremely limited in the kinds of media it can play.  This has been solved for the 1st and 2nd generation Apple TVs through the painless jailbreak process, but a jailbreak is not yet available for this, the 3rd generation unit.  Until that happens, I strongly recommend spending your sawbuck on last year's version (MC572LL/A) instead - although it only supports 768p (the 3rd gen adds 1080p), the older unit can run nitoTV, which turns the AppleTV from a curiosity into a must-have game-changer.", "verified": true, "helpfulness": "0/1", "author": "DAK"}, {"rating": 5.0, "review": "I just left my first review of another product and had fun so am leaving more.  I did not buy my apple tv on amazon but do have one.  I love it!!  I especially love the streaming netflix which works with my home wifi.  Great for lying in bed and watching endless romantic movies!!", "verified": false, "helpfulness": "0/0", "author": "Joan Harrison \"Romance Lover\""}, {"rating": 5.0, "review": "we have a large and extensive library on iTunes.  Educational stuff as well as the entertainment.  a 2TB drive dedicated to storage off of one computer that shares the content.  We have two Apple RV boxes like this that wirelessly communicate to an Apple Time Capsule, which connects to the LAN by wire.  That Time Capsule is just a wireless station, and so the 2 TV's are connected in to it, which in turn connects via the Time Capsule to the Apple Mac Mini which runs iTunes all the time.  We have 24x7 access to the library of movies, music, tv, off of iTunes.  I don't connect these to the internet because that just brings up trash content.  We control it. The tools to control it are a combination of using OPENDNS service coded into the Apple Time Capsule, and parental controls on the rest.  Takes some doing, maybe I should write a paper on it.", "verified": true, "helpfulness": "0/0", "author": "Grant Johnson"}, {"rating": 5.0, "review": "Just like other reviews have said, the full utility of the Apple TV (aTV) really depends on whether you have already bought into the Apple eco-system or plan to in the future. To determine if the aTV would fit my family's needs, I did my research, but I had to search mutiliple websites to answer my questions. This review is aimed at providing all the information I wanted to know before I pulled the trigger on this purchase.First, a word on my previous entertainment setup/usage. I had a Apple Mac Mini MC270LL/A Desktop used as a Home Theatre PC to a Samsung 1080p TV with an additional Sony BDP-BX38 Blu-ray Player Wi-Fi Ready / Internet Apps that was given to us. However, most of our movies were bought from iTunes and stored on an Iomega MiniMax FireWire 800/USB 2.0 1TB Desktop External Hard Drive 34937 (White). Add in a keyboard and mouse, and you can start to mentally see the clutter around our TV. We used this setup to primarily watch Netflix from the Safari browser and Hulu (free version) from Hulu Desktop - throw in a spot of Youtube on the side. As mentioned earlier, movies (and music) would be rented or purchased from iTunes. Even though the Blu-Ray player has Internet Apps such as Netflix, Hulu+, Pandora, Amazon video, etc; it wasn't used much at all, except for the odd DVD/Blu-Ray disc somebody loaned to us. However, when the Blu-Ray player was given to us, they forgot to remove their Hulu+ (paid version) account information, and we got introduced to the full glory of Hulu+ (it was nice to go watch past episodes for shows we discovered three seasons in). My wife and I both have an iPhone and iPad each, but we have no other laptops/desktops besides the Mac Mini.Footprint:Even though Apple's website has numerous pictures of the aTV, I was still very much surprised by how small this thing is. The official size is 3.9 inches wide by 3.9 inches deep by 0.9 inches high, and I even read multiple reviews that it was literally the size of a hockey puck, but I still stood amazed at how compact, sleek, and sexy this little black device was. The aTV replaced the Mac Mini, external hard drive, keyboard, and mouse. My wife could not be happier at the reduced \"nerd clutter\".Setup:Many reviews have talked about the ease in setup, so I won't belabor the point. Just know that like all things Apple, the aTV \"just works\" out of the box. Plug it in, type in your wifi, iTunes, and Netflix information and you're set to go.Remote:Apple always goes with a minimalist design, but I'm always concerned that anything \"minimalist\" will lack strength and functionality. I'm the type of guy that will use a 4x4 post to hang a bird feeder. However, this minimalist remote feels solid in my hand. My fingers wrap around perfectly, and the buttons have a solid response and feel. I can scroll through Netflix adding movies to my queue for hours without fatigue or risk of carpal tunnel. Additionally, the Apple Remote app works flawlessly and is really put together well. There may even be a lot of people who use the app as the primary remote, since it works so well. For me, there will be no more spending 30 minutes trying to find where the 2 year-old stole the remote off to, since my iPhone/iPad can seemlessly step in until the remote turns up 3 days later. Some people may also be pleased to know the old Apple - Apple Remote remote control can work as well, and for the more budget minded people, can be a cheap replacement/backup. I will say searching for content with the remote can be cumbersome. You have to move the remote cursor to each letter to spell out words. You can get pretty quick at it, but it is not the same as a regular keyboard. Unfortunately, the Apple Remote app for the iPhone/iPad won't allow you to use its keyboard to aide in the process. Unless you are willing to jailbreak (which currently there is no jailbreak for the aTV 3), you learn to be more efficient like searching for a TV show once, and additing it to your instant queue in Netflix or adding it to your favorites in iTunes. While a minor convienence, it doesn't effect my rating of the product.Navigation:Like most people, I'm looking for ease of use. I don't want to navigate through 10 submenus before finding information on a movie to press the back button 10 times to look at another movie. This was the downfall of the internet apps on my Blu-Ray player. The aTV home screen is setup with app icons like on the iPhone/iPad, making navigation between the apps simple. The implementation of the Netflix app is quite user friendly. I like it much better than using Netflix's website from the Mac Mini. The iTunes store is the same friendly user experience. You can quickly scan different movies, read a synopses, and move on. If you are looking at an Adam Sandler movie, you are one click away from seeing the other Sandler movies available on iTunes. The whole menu system is awesomely designed to quickly find a movie or TV show and start watching.Movies from the Cloud:I hated standing in front of the TV looking through DVDs only to find the DVD I wanted to watch wasn't in the case, and finding it 3 days later sitting next to the remote. With the mac mini, I stored all my movies on an external harddrive. While this added another piece of \"nerd clutter\", all my movies were readily accessable whenever I wanted. aTV takes this a step further: All your iTunes purchases are available through iCloud. Anything you have purchased via iTunes on a particular account can be streamed over the Internet to your aTV, so no need for a harddrive. In fact, I was quite surprised to find 3 movies that I had bought 6 years ago, that I had completely forgotten about. I bought them on a laptop that had crashed, and I assumed the movies were gone forever. However, iTunes kept up with that purchase, and it was quite the nice surprise when the aTV started streaming them for my lost enjoyment. These streamed movies take about as long as a Netflix movie to load and start playing (only a few seconds with my internet connection). Also, you can purchase additional movies and TV shows from the iTunes store directly from your aTV, and know they are safely stored in the cloud for your progeny to enjoy.iTunes Home Sharing:Also, if you have a laptop/desktop computer on your network with movies/music stored in your iTunes library, then you can stream these over your network to your aTV. This takes less time to start playing than if you are streaming from the cloud, but honestly, I find the cloud so convenient, that I don't use this option much except for playing music from one of our playlists. To me, the difference in load time is negligible. However, this is the only option to play music in your iTunes library, unless you have paid for iTunes Match which will allow you to stream iTunes purchases from the cloud. Also, if you have ripped any DVD's to your computer, then iTunes Home Sharing is your only option to stream to your aTV. But when needed, it works well.Content:The aTV certainly doesn't have the same amount of content as the Roku or even my Blu-Ray player. For internet content, the aTV is limited to Netflix, Youtube, Vimeo, Flickr, MLB.TV, NBA, NHL, and WSJ. Most of these speak for themselves, but I would like to expand upon MLB.TV. Now, I enjoy baseball, and Altanta Braves games is one thing I have missed since we got rid of cable 5 years ago when we got the Mac Mini. MLB.TV blacks out the Braves games since I'm so close to Atlanta, but I would probably be too cheap to pay the subscription price even if that wasn't the case. However, even without the subscription, MLB.TV will stream a 2-3 minute Sports Center-like recap of the games. I know it isn't the same, but it is more than I've had for 5 years, and I'm exstatic. The main gripe I've read about content is the lack of Amazon Instant Video on the aTV. I'm an Amazon Prime member, so I get the unlimited streaming videos. Even though the aTV lacks Amazon support (or even a iPhone/iPad app that I can mirror to the aTV), I'm not too upset. Amazon's library is not very large, and the movies they do have (that I would actually watch) are 99% of the time on Netflix too. If Amazon continues to develope their Instant Video library, then this may become more of an inconvience. This really comes down to whether you are an iTunes user or an Amazon instant video user. If the latter, and you have bought movies from Amazon Instant Video, then the Roku or similar device is for you. The other main gripe is lack of Hulu+, I'll address that below in the Hulu paragraph.AirPlay/Mirroring:If you have an iPhone and/or iPad, there is no excuse for not having an aTV. The Aiplay/Mirroring feature is amazing. I can display my iPhone/iPad screen up through my aTV onto my HDTV. You will be surprised just how useful this is. Say I was reading the news on my iPad and found a video of San Diego mucking up their 4th of July fireworks display, I can Airplay the video to the TV, and my wife and I can laugh in unison. When I go out of town for a business trip, my wife can mirror her Facetime video onto the aTV, so the kids can all see me on the \"big screen\" without having to squeeze themselves around the \"small screen\". Another useful feature, is if you prefer searching for videos on your iPhone/iPad, then you can open up Netflix (or similar apps that support Airplay) find the video you want to watch and Airplay it to the aTV. Now there is a difference between Aiplay and Mirroring. Airplay is used by apps that have been specifically designed to use the Airplay feature (many of Apple's apps do this) and fill up your TV screen. Mirroring will only put a mirroed video iPhone/iPad screen. This will only be in 4:3 aspect ratio, so you have these black bars on the left and right of the screen. But Mirroring is surprisingly responsive with hardly any noticeable lagging. I have found a mirad of uses for Airplay/Mirroring. You will not be disappointed.Hulu+:Mirroring can be combursome for watching lots of videos. This is one of the reasons why it took me so long to buy an aTV. With the gift of Hulu+ on the Blu-Ray player, I realized that this was a feature I wanted, but the aTV didn't have Hulu+ built in, and Mirroring would only play a 4:3 video of it, and not utilize my entire TV. So I waited. My patience was awarded on May 21, 2012, when Hulu released version 2.5 of their Hulu+ app for the iPhone and iPad. The update improved Airplay Mirroring to stream a 16:9 video to your aTV. It almost fills my entire TV, leaving only about a 1.5 inch black bar around the borders on my 55 inch TV. It was difficult to find information on whether this new implementation was good or not. I can certify that Hulu's update solved the problem, and Hulu+ mirrored from my iPhone/iPad to my aTV is a great solution. I enjoy sitting on my couch browsing my queue in Hulu+ then sending it to the aTV for the family to watch. The video is crisp and responsive. It is a pleasure to use. For those wondering, I do have my own Hulu+ account now, and am happy to pay the subscription fee.***UPDATE 2 Aug 2012***Apple pushed down a software update, and now Hulu+ is natively supported on the aTV. It has it's own appp icon right next to Netflix on the home screen. While I didnt mind aiplaying Hulu+ from my iPhone, the native app is more convenient. Initial impressions are Apple has done a good job. It is intuitive and easy to use. You can even sign up for Hulu+ directly from the aTV. If Hulu+ was a hang up for you on getting an aTV and my original review didn't sway you... Well now you have no excuses.Pure Speculation:Given the rumors of the iTV, I think Apple has more in store for the aTV. It is way too much for Apple to expect everyone to buy a whole new TV to get their new features/content. To overcome those user's who won't pay $2K for a new TV, I think all the new wiz-bang features will be offered in an aTV software update. If the rumors are right, that could be as soon as this year. And if I'm right, there will be a mad rush to buy aTV's, and I'll be glad not to have to fight lines at the Apple Store or waiting 2 weeks on backorders. Again, this is pure speculation, and this review will either be prophetic or be my shame.Summary:If you aren't an Apple-fanboy, the aTV still has a lot to offer. This is a must have item if you are already in the Apple eco-system, but is useful for those people only looking to cut their cable bill because of widespread internet content, and it is much cheaper than a HTPC. My advice mirrors other reviewer's. Know what you expect your purchase to do, and determine if a particular product meets your needs. The aTV does this for me in spades, but it additionally has the user friendly experience that Apple provides.", "verified": true, "helpfulness": "78/93", "author": "T. Duncan"}]