[{"rating": 5.0, "review": "I like Apple TV, which can watch youtube our ets in My TV and I can show my Ipad Iphone or Mac in My TV", "verified": true, "helpfulness": "0/0", "author": "CaT"}, {"rating": 5.0, "review": "I love it! Especially for youtube videos! Simple, easy connect, user friendly...I love everything about it! Fast and professional S/H.", "verified": true, "helpfulness": "0/0", "author": "Mom2kpbaa"}, {"rating": 3.0, "review": "Was thinking there would be a lot more that cane done with device. Basically it is ITunes for your TV.", "verified": true, "helpfulness": "4/4", "author": "jim"}, {"rating": 5.0, "review": "We used this to watch Netflix, rent movies or listen to music--the quality of the streaming is generally excellent, better than our usual cable transmission. We also use Airplay to send music or pictures from our iPad.  (We have an Apple airport router) It is simple to use, takes little space, and the remote is easy for anyone to learn.  (With a bit of effort, the Harmony remotes will work with it as well, but the Apple remote is so simple and effective that we prefer it )  Beautifully designed.  We have two and have not noticed any problems with both being used at the same time.  Please note that it does require the use of HDMI but does not require any other apple products.", "verified": true, "helpfulness": "1/1", "author": "William Brunkan"}, {"rating": 3.0, "review": "Surprised that it takes 3-4 times the lengt of the video to upload apple's own video format \"mov\" on iPhone and iPad.", "verified": true, "helpfulness": "0/0", "author": "Fred Calmerman"}, {"rating": 5.0, "review": "This is my second Apple TV. I still use the first one almost daily, so it was only natural that I'd get another when I wanted to expand. The airplay feature is beyond useful!", "verified": true, "helpfulness": "0/0", "author": "Xnickitynickx"}, {"rating": 5.0, "review": "i got this free from downloading apps and getting amazon points! lol so yea i love my apple tv.! kit is a new apple tv sealed from apple. its an amzing ox. wish a jailbreak would be out for it. but hey i dont care still amazing 1080p.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Cruz"}, {"rating": 5.0, "review": "I purchased this not really sure if I was going to keep it. Becausethere are several options now with Mac products (iPad or Mac Pro)to stream videos on HDTV using a cable.  But once I set it up and sawthe ease of using it, the quality of the display, and the options Apple TV canoffer beside video streaming from iTunes or Netflex is amazing. I highly recommendthis product.", "verified": true, "helpfulness": "0/0", "author": "C. B. Wilder"}, {"rating": 5.0, "review": "I have one of these on each TV and utilize my iTunes library continually and throughout the house.  I also utilize them for NBA league pass and other online streaming.  For a hobby, Apple has really developed a good device.", "verified": true, "helpfulness": "0/0", "author": "Darrell Smith"}, {"rating": 5.0, "review": "The only issues I ever have are due to my network (I'm a computer nerd so my house has a complicated network).  Usually, I can easily find the answers on the support forums.  The device itself works amazingly well and interfaces well with the multiple iTunes libraries on my network.", "verified": true, "helpfulness": "0/0", "author": "T. Waldrop"}]