[{"rating": 3.0, "review": "Great item to have at home; it is mobile and compact. No need for anything else, strongly recommend getting one!", "verified": true, "helpfulness": "0/0", "author": "Vanessa"}, {"rating": 4.0, "review": "We have a Sony Smart TV but often times we would have issues with our Netflix connectivity.  I assumed it was our DSL, but our computers and phones weren't having issues on the wifi, so I wondered.  I decided to purchase this AppleTV because I also wanted to listen to the music on my phone through the stereo without tethering my phone via a cable.  I am SO glad I purchased this as our main Christmas gift to our family from \"Santa.\"  It took one use to realize all the issues we had been having with Netflix and YouTube were due to our TV, not our DSL.  Now we can watch Netflix and YouTube all night long on our TV with the AppleTV with no issues at all.Using it for playing music from my phone hasn't worked out as well.  When doing so, it often cuts-out, there's popping or it'll just drop the connection.  It's so frustrating, I've just gone back to listening to the music on my phone via a cable. Oh well...it's not everything I wanted, but it's still pretty darn good.  I also wish you could use Amazon Prime on it, but again, oh well.Our set-up:  we connected to our AppleTV to our Sony Receiver via HDMI cable and of course the TV is connected to the receiver via HDMI.  It works great!", "verified": true, "helpfulness": "0/0", "author": "E. E. Easter \"easterbunny\""}, {"rating": 5.0, "review": "So convenient and easy to use! Everyone should have one :)If you use Apple products, this is a a great way to stream.", "verified": true, "helpfulness": "1/1", "author": "Amy June"}, {"rating": 1.0, "review": "I have most Apple products, iPods, iPads, iMac and iPhones. I must say I preferred iOS6 to iOS7 but by far the worst Apple product I have used is Apple TV. It frequently requires power cycling, loses network connectivity in the middle of streaming and has one of the worst user interfaces anyone has produced. They keep adjusting scrolling speed in every release, but don't seem capable of producing a usable one. They need to look for a radically different solution obviously, but they keep beating this dead horse.What is shocking on top of it is how bad the Apple Remote app is. What is wrong with the team designing these? They should take a look at \"Mouse Pro\" to see what a touch remote interface should look like. If Apple TV is a hobby, then Apple should look for something else to spend their free time on.", "verified": true, "helpfulness": "0/2", "author": "Will"}, {"rating": 5.0, "review": "If you live way out and tired of paying high cable bills this is the item to use.Pay now then decide later what you want to watch.", "verified": true, "helpfulness": "0/0", "author": "Joann Costa"}, {"rating": 4.0, "review": "Having used a couple of other streaming products over the years (Roku, internet TVs), and admittedly being a bit of an Apple fanboy, The Apple TV is where it's at. No, it's not your cheapest option, and yes I'd love for them to update the software (perhaps to match with iOS 7), it's really the best option for someone who uses Apple products. The quality is fantastic, it has all the streaming channels you'd want (those that it might not have, you can easily connect from your phone), and it seamlessly integrates with all of my other iDevices (iMac, Airport, iPhone, iPad).There are a couple of things that bother me, but nothing that makes me not want to use it. For example, the YouTube App is kind of frustrating in the Apple TV, but I find it's just as easy to search on my iPhone YouTube App, then just send it to my TV. Similarly, there is no Amazon Instant App, but I do the same: find it on my iPhone and send it to the TV. And yes, I am ready for them to upgrade the software/interface. It's been a while.As for things I LOVE: It's great for parties, in that I can put my iPad out and open, for anyone to access Spotify and have it streaming through my TV and speakers. Before the Apple TV, I would have had to let people use my computer, which is less appealing. Also, if I've got a group of people over and we are sharing YouTube videos, it's easy for the next person to queue up their video and send it to the TV when it's their turn.All in all, it works like it's supposed to, the hallmark of all Apple products, and the Apple TV is no different.", "verified": true, "helpfulness": "0/0", "author": "John Zelek"}, {"rating": 5.0, "review": "Apple works great.  I play my own music on it that is loaded on iTunes.  I use my iPad as the controller.", "verified": true, "helpfulness": "1/1", "author": "rtd"}, {"rating": 5.0, "review": "The was a great price for a quality product. The shipping was super fast as well. As I teacher I am using all of this to help better my classroom instruction. Thanks!", "verified": false, "helpfulness": "1/1", "author": "Rick Malone"}, {"rating": 5.0, "review": "Say what you will about Apple products but quality and ease of use will be two things.  I bought this for my 79 year old mother.  She connected it herself and watching her favorite movies right away. She uses her iPad to control the device and is saving money by canceling many premium cable services.  You can play with Android devices if you wish, but if you want to connect and use immediately, buy an Apple YV.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Fast, easy setup.  I also have a Roku LT.  The Netflix app on the Apple TV is much nicer than the Roku.  Interestingly, the 2 devices don't list identical offerings in their respective PBS apps/channels.  I do wish Apple wouldn't assume that their devices are so simple that decent instructions aren't necessary -- although setup was simple, figuring out how to get closed captions to display required a web search.  Easy enough to find online but that type of info should be in the brief guide they provide in print.", "verified": true, "helpfulness": "0/0", "author": "ex-jerseygirl"}]