[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Annette"}, {"rating": 5.0, "review": "The Apple TV was really easy to set up and has played flawlessly for me.  The black unit blends in with the rest of my audiovisual equipment and the supporting structure.  I have used it with my iPhone 5S, my wife's iPhone 6, our iPad, and even my MacBook Pro (2014).  The official reduced price was also an incentive to buy it.", "verified": true, "helpfulness": "1/1", "author": "Orville Wright \"aeronut\""}, {"rating": 1.0, "review": "Connected seemlesly and smooth UI.  Using over WiFi n, kept stopping to load buffer while watching HD netflix....finished show on xbox 360 located next to the Apple TV with no buffer issues....apple tv returned", "verified": true, "helpfulness": "1/1", "author": "STEVEN F JACKSON"}, {"rating": 4.0, "review": "we enjoy using this, it doesn't have lag issues on wireless like our chromecast does.  We have figured out that casting from a phone or tablet is most of our lag issues, since I guess it goes over wireless twice.  Watching things directly from the box has not had any lag so far.Only issue is that sometimes when it wakes up, it doesn't send signal to the TV, only fix I can find is unplug it to reset it, then it is fine for a while.", "verified": true, "helpfulness": "1/1", "author": "Chris \"Workin momma\""}, {"rating": 4.0, "review": "I HAVE FEW A[[LE TV BOXES AND OVERALL I AM  PRETTY NEUTRAL ON THEM. THEY DO SOME STRANGE THINGS EVERY ONCE IN A WHILE.  SOME TIMES THEY JUST RESET THEMSELVES FOR NO REASON.  I USE TO WATCH CNBC LIVE BECAUSE MY CABLE COMPANY DOES NOT CARRY CNBC LIVE.", "verified": true, "helpfulness": "0/1", "author": "YOUR SMALL BUSINESS ADVISOR"}, {"rating": 5.0, "review": "I love it, but I am having trouble hearing the sound on the TV when I FaceTime ? If you can give me a suggestion on thus, let me know , Thanks, Yvonne S.", "verified": true, "helpfulness": "0/0", "author": "Margaret S."}, {"rating": 5.0, "review": "I just love it.", "verified": true, "helpfulness": "0/0", "author": "Ariel Vazquez"}, {"rating": 5.0, "review": "This is a must have if you are an Apple family user, as you can air play all your music, photos, movies etc. from all your devices (or that of visitors) to your big screen tv or simply play via Wifi off your computer, watch YouTube etc. It also connects to other streaming services. If you are an Apple person, it's a no brainer.", "verified": true, "helpfulness": "1/1", "author": "Photography buff"}, {"rating": 5.0, "review": "If this is going to be your only Apple device, there are probably better choices.  But if you live in an Apple \"ecosystem\", this is the final piece, bringing everything to your TV screen.  Macs, iPhones and iPads are all enhanced by this little box.We have six of these.  They are trouble-free, allow airplay in a few seconds, and brilliantly display and play your entire local iTunes library - the ultimate closed circuit on-demand setup for those of us with large collections.  And with Airplay off an iOS device, they DO PLAY AMAZON content, too.  At the lower price, this is a great value in an Apple centric home.The latest A1469 hardware works as well as the older A1427 version, uses less electricity, and supports peer to peer airplay for guests.  Apple has been keeping the software updated, and the internet content roster continues to grow.  No wallwart, stable wireless performance, and wired ethernet, too.  Strap to the back of the TV, and it takes no space.  What's not to like?This will also work with older analog TVs with a suitable HDMI converter.", "verified": true, "helpfulness": "1/1", "author": "M. Malone"}, {"rating": 5.0, "review": "My only TV device at the moment; this has made me forget about cable and really leave no desire to go back. With HBO Now exclusively on Apple TV and a recent price drop, there is very little reason that this minuscule device should not be hiding out in your entertainment center.", "verified": true, "helpfulness": "1/1", "author": "Shawn Jolicoeur"}]