[{"rating": 3.0, "review": "This review is for the Apple TV.I own an iPad Air, an iPhone 6 Plus, an iPhone 6 (wife's), and an iPhone 5s (work phone). I love Apple products and, as an early adopter, always want the newest tech gadgets for no real reason other than they are cool! The idea of an Apple TV seemed awesome to me in theory. In practice, I was not too impressed with the Apple TV and returned it.Like all Apple products, this is extremely easy to set up with almost no effort, and even easier to use. It has the same look and feel to your other iDevice. Apple AirPlay was awesome at first - this is where you can stream your iDevice screen directly onto your TV through the Apple TV. This is great if you want to play games, type documents, look at pictures, or watch movies on a much larger screen. You can also stream music, movies, Netflix, and other video streaming apps.Ultimately, I ended up returning the Apple TV. Although the AirPlay was cool, I never really needed to use it and when I did, it took away from watching shows on the TV. Second, you have to rent or purchase movies/tv shows to stream from iTunes which can be very expensive. Most of my movies are all on DVD or Blue-ray, with very few digital copies. Additionally, I have a SmartTV so I can stream all those things right on my TV.In Summary, if you have a SmartTV, you really don't need this unless you need to stream your iDevice screen to your TV, or have a large library of music/movies in iTunes to stream.", "verified": false, "helpfulness": "1/1", "author": "Dust Storm (aka Haboob)"}, {"rating": 5.0, "review": "C'mon guys. It's an Apple product. Simplicity in design and use. It just works! Must buy.", "verified": true, "helpfulness": "0/1", "author": "Cisco"}, {"rating": 5.0, "review": "excellent device,Regards", "verified": true, "helpfulness": "0/0", "author": "Alvaro Javier"}, {"rating": 5.0, "review": "It was amazing", "verified": true, "helpfulness": "0/0", "author": "Sabina"}, {"rating": 5.0, "review": "What a great product!  Connects easily through airplay.", "verified": true, "helpfulness": "0/1", "author": "Gladys Rivera"}, {"rating": 1.0, "review": "It does not work--  I do not know how-----  Poor instructions  -- Useless  I  am sorry I purchased it", "verified": true, "helpfulness": "0/1", "author": "Dadbear"}, {"rating": 4.0, "review": "👍", "verified": true, "helpfulness": "0/1", "author": "sultan Alothman"}, {"rating": 5.0, "review": "Cheapest price around. Bought for my tv world great.", "verified": true, "helpfulness": "0/1", "author": "Ryan"}, {"rating": 5.0, "review": "I love this thing, link it up with your cable provider (I have Comcast/Xfinity) and it runs all the apps like HBO GO for free based on your current TV sub! I use this thing all the time with my Macbook to play music on my theater system and also use my iPhone now and then with it too. Screen mirror is a cool feature. Its just a great little movie box for me, with all kinds of great features to play on your TV and home theater. The Chrome Cast and Roku is nice, and cheaper, but the Apple TV is more than worth the $99 tag. I work on computers, smart phones and tablets for a living, so I know my way around electronics. I'd recommend this to even an Android user.", "verified": true, "helpfulness": "0/0", "author": "Jason S"}, {"rating": 4.0, "review": "The build and software experiences are very good.  It appears Apple continues to add \"channels.\" IF they want to seriously influence  the Roku market, this had better continue, if not pick up!As I purchased both, I'd have to say, Apple is a slightly better \"fit and finish\" experience, and slightly more refined user experience. Roku has the channels, but so many are fee-requiring and it's almost impossible to find a list of which are free without simply investigating each individually.", "verified": true, "helpfulness": "0/0", "author": "Spock"}]