[{"rating": 5.0, "review": "Perfect, reliable,", "verified": true, "helpfulness": "1/1", "author": "byegeorge"}, {"rating": 5.0, "review": "Netflix looks awesome through this. Controls my entire music library off my computer, routs it to my receiver and can pick any song from 60,000 at the touch of a button.....how CRAZY.", "verified": true, "helpfulness": "0/0", "author": "Michael J Kelting"}, {"rating": 5.0, "review": "Duh, it's the most functional and easy to use TV streaming product. It's Apple. What did you expect?", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "arrived as promised, working fine", "verified": true, "helpfulness": "0/0", "author": "giladm"}, {"rating": 5.0, "review": "Apple TV is simply the best! Has a lot of channels and miraculously changed the face of TV. Since this is the current version, it has a lot of factors and features making the predecessor better.", "verified": false, "helpfulness": "0/0", "author": "dale sims"}, {"rating": 4.0, "review": "the picture is really clear, some downfalls are you need a tv provider for some station like lifetime, history channel. currently at&t; u-verse is not listed in tv provider. it has netflix which my family and i love and the youtube is awesome as well you can search anything youtube and it will come up.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "We purchased an Apple TV for our den from another retailer, and it worked great, so decided to purchase another for the family room. We found this item on Amazon was almost 30 dollars less than our first purchase elsewhere. Works great !", "verified": true, "helpfulness": "0/0", "author": "Pamela Chantre"}, {"rating": 5.0, "review": "I absolutely love this and have saved money by installing these in all of my bedrooms for the kids!", "verified": true, "helpfulness": "0/0", "author": "Talisman"}, {"rating": 5.0, "review": "Super easy to use and the high definition video is astounding. I'm really glad I got it.", "verified": true, "helpfulness": "0/0", "author": "J. A. Walker"}, {"rating": 1.0, "review": "Got a defective one first time, and another broken one on second time.", "verified": true, "helpfulness": "0/1", "author": "Forgive me, Lord"}]