[{"rating": 1.0, "review": "I took forever to decided to buy this product because I liked the idea. HUGE mistake. It's the single most difficult piece of technically challenging crap I've ever shelled out $ for. The remote is not user friendly and Barbie would find it too tiny for her hands. The interface doesn't easily connect between devices as I'm finding out is an apple trait. But they have alas gotten my last dime because the lack of customer service is the end of the road for my apple journey.", "verified": false, "helpfulness": "3/13", "author": "Okbullzeye"}, {"rating": 5.0, "review": "Could not be easier to use!  Recently added ESPN and Hulu plus.  Will be perfect when they add Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "K. Thompson"}, {"rating": 5.0, "review": "They should read the instructions with the remote first and thoroughly.  It meets all expectations as I have Iphone, Ipad and IMac and now ITV.", "verified": true, "helpfulness": "1/1", "author": "Brent Faunce Welch"}, {"rating": 5.0, "review": "I LOVE this product especially the remote functionality with my ipad and iphone.  Mirroring and airplay are very convenient if you are an owner of other iProducts.", "verified": true, "helpfulness": "1/1", "author": "Dan M"}, {"rating": 5.0, "review": "I use this primarily to connect my PC to my TV. With this device you can access all of the content you have stored in iTunes on your PC or Mac right on your television. Of course, the apps are nice too and being able to purchase or rent (and then stream) movies and television shows from iTunes is wonderful. I highly recommend this product if you're looking to bridge your TV and PC.", "verified": true, "helpfulness": "1/1", "author": "J. Silvia"}, {"rating": 3.0, "review": "I like it very much, sadly after 4 months it stopped working, apparently I bought one of the bad ones, apple says they are gonna change it, I hope so!", "verified": true, "helpfulness": "2/2", "author": "Andres Garcia"}, {"rating": 5.0, "review": "As long as your videos play in iTunes, they will play on the Apple TV. I had seen so much online about jailbreaking the Apple TV2 or using Plex with Apple TV3, but you don't have to do any of that stuff if you are okay with the built in GUI and don't mind converting your files to mp4. I wish I could airplay more than audio from my iPad 1, but besides that, I have no complaints.", "verified": true, "helpfulness": "0/0", "author": "Jerad Horning"}, {"rating": 5.0, "review": "I. Love. My. AppleTV.  Plain and simple.  It's easy to use and intuitive, it integrates flawlessly with my MacBook and my AirPort, and it's become the only peripheral I even use anymore.", "verified": true, "helpfulness": "1/1", "author": "Kristofer Bolz"}, {"rating": 5.0, "review": "A friend recently purchased this as a gift, and though it's a little expensive and not something I would ever have bought for myself, I have to admit that I enjoy it immensely.  It's easy to install, even if I had to go out and buy an HDMI cable that wasn't included, and it's very easy to use.  It also doesn't take up much space, which is always appreciated.  The box is maybe a little bigger than a baseball.The device comes with access to a variety of programs--Netflix, HBO, and a whole lot of sports channels I don't care about--but most of those need subscriptions.  People with HD TV's probably wouldn't need Apple TV at all, as most of those come with the TV, but this makes access easier.  It also comes with YouTube, and who wouldn't love watching \"Ghost in the Stalls\" on the big screen?I believe there's also a way to hook up an ipad to the box so I can have the contents of my ipad on the television.  I haven't gotten around to doing that yet, but it doesn't seem difficult and would make purchasing one of these worthwhile just for that.All in all, there are easier ways to gain access to what Apple TV provides, but it's still nice to have them all on one convenient box rather than having to fight Internet connections and all the other nonsense that goes with.", "verified": false, "helpfulness": "1/1", "author": "venus_smrf"}, {"rating": 5.0, "review": "We have an Apple TV, and think it's wonderful! Everyone in our extended family has them too, and it's great!", "verified": true, "helpfulness": "0/0", "author": "AmazonReviewer"}]