[{"rating": 5.0, "review": "Great, ease to use and does what it promises.I liked it so much that I'm buying a 2nd one for the other TV", "verified": true, "helpfulness": "0/0", "author": "Adalberto Golbert"}, {"rating": 4.0, "review": "I wish more apps were available. I so want to get away from paying for obsolete/uninteresting television, I love HBOgo. Will be buying more for the rest of the house!", "verified": false, "helpfulness": "0/0", "author": "Judy Blair"}, {"rating": 5.0, "review": "I stream movies direct from iTunes via this device.  It is very easy to set up, basically plug & play.  Once you are set up, you can easily and quickly purchase/rent tv shows & movies from iTunes and watch them within a couple of minutes.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 2.0, "review": "Terrible. I've owned 4 of these over the last several years. None of them worth the money. Regular restarts and freeze ups. The worst remote in probably 50 years: no range, poor battery life, buttons tend to skip. Do yourself a favor and just use netflix, amazon, etc. on your DVD/Playstation/Xbox.", "verified": false, "helpfulness": "0/3", "author": "John A Dorman"}, {"rating": 5.0, "review": "We absolutely love this Apple Computer for your TV .  We just enjoy it and  wish we had gotten it sooner.", "verified": true, "helpfulness": "0/0", "author": "Linda S."}, {"rating": 5.0, "review": "Always works, though wish that Apple would release more content like on the Roku.  Have had this since September 2012 without incident.", "verified": true, "helpfulness": "0/0", "author": "Esteban Lopez"}, {"rating": 5.0, "review": "Works 100% integrated with all other Apple stuff in our home. Somebody (not me!) has been thinking as usually when it comes to Apples products. Not the cheapest BUT IT JUST WORKS!", "verified": true, "helpfulness": "0/0", "author": "BasilFawlty"}, {"rating": 5.0, "review": "Our previous experience has been with an LG Blu-Ray player that had online connectivity. We thought that was great until someone shared their positive experiences using Apple TV.  We immediately ordered ourselves one and 2 days later (love Amazon Prime!), we were in business.  It is so much easier to navigate than our Blu-Ray player and quickly became our device of choice. We particularly like Air Play and use our iPhones and iPad with it often. It's great for playing YouTube videos and watching Netflix/Amazon Prime movies. Another bonus is the ability to project your iPhone/iPad photos onto the TV, particularly nice if you have company over and don't want to pass around phones. Loved it so much I ordered one for my parents too. If you have an iPhone or iPad, it's definitely worth getting one!", "verified": true, "helpfulness": "0/0", "author": "glaski"}, {"rating": 1.0, "review": "Very limited on what content is availble.  Price for device not bad but price for movies,shows to much.  And limited to iTunes", "verified": false, "helpfulness": "1/3", "author": "BC"}, {"rating": 5.0, "review": "If you have a mac computer or ipad, and an Itunes library, this device is for you.I turns your computer into a TV station, Plus you can get the same stuff, or almost the same stuff you get with Roku.So It really worked for me.", "verified": true, "helpfulness": "0/0", "author": "Marco Pennacchini"}]