[{"rating": 1.0, "review": "I want to sand it back , but I do not find how. can you guys help me. Do not work well on my PC.", "verified": true, "helpfulness": "0/4", "author": "Carlos Terrinha"}, {"rating": 4.0, "review": "Wish I could get to my HBO account to watch from the Apple TV but there are many options for video including Netflix and Hulu. Streaming audio wirelessly from my iMac is one of my favorite features of this device.", "verified": true, "helpfulness": "0/0", "author": "Benjamin W. Sessums"}, {"rating": 4.0, "review": "I used it to provide ipad wireless presentation in a conference room.  Works.A few things to note though:1. \"upgrade\" notice is troublesome for non-home applications.2. all the show icons make it un-professional in conference room.3. of course, appleTV is not designed for enterprise.  But, given that many ipad, isn't it time for one?", "verified": true, "helpfulness": "0/0", "author": "half dome"}, {"rating": 5.0, "review": "A must have for anyone with an apple product (i.e. mac book, ipad, iphone). Basically integrates your tv with almost every app out there. MUCH BETTER than using a smart tv that requires a clumsy remote.", "verified": true, "helpfulness": "1/1", "author": "fsu142"}, {"rating": 1.0, "review": "We bought the Apple-TV to watch movies, but all we end up watching is the movie load, and load, and load, and load. In fact, it took Finding Nemo more than 24 hours to completely load using a fast and reliable DSL connection. We experience the same issue when streaming home videos from our iPhone's. Depending on the length of the iPhone video, it usually takes 5 to 10 minutes to load on average. When streaming just plain music, I can literally set the iPhone right next to the Apple-TV and it still 'hiccups' every so often, having to re-buffer the stream. Maybe we're doing something wrong, but this is completely unacceptable in my opinion which is why I've rated this product 1 star.CONS:Other than what's mentioned above, the Apple-TV really offers nothing but premium content (subscription fee content). If you have cable or satellite television, then you really don't need this product. You can't even add or remove apps. We're Amazon Prime members but this product does not support that.PROS:If you enjoy standing in lines, sitting at stop lights, or watching paint dry, then you certainly won't mind waiting on the Apple-TV.", "verified": false, "helpfulness": "1/5", "author": "Sidewayz"}, {"rating": 5.0, "review": "We had a WD box for watching Netflix but wre very disappointed in it. It was slow loading videos and froze often. We purchased the Apple TV unit because we have iPads, iPhones and Mac computers and were very happy with them. This device works so well and integrates with our other Apple products that we regretted not getting it first!! Amazon also saved us around $10 over purchasing it at an Apple store. We had it the next business day with free shipping too. We recommend the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Dave Zak"}, {"rating": 5.0, "review": "Am loving it because I can now watch Netflix and listen to radio and many other items.This is an amazing product that has revolutionized the TV industry.  GREAT product.Ger,Southington, CT", "verified": true, "helpfulness": "0/0", "author": "Gerard L. Comtois"}, {"rating": 4.0, "review": "The remote is a cool device but a bit small for larger hands.  We lost it in the recliner because it fell into a crevice because of size and slipperiness.  I used my iPad to run the apple tv.  iPhone works also with free app.  You must set up your apple tv though with the original remote before you can use them to control unit. Did finally save both remote and recliner and did not have to spend $20 for a replacement. This is important because there are no buttons on unit to interface without a remote.Apple tv is pretty cool.  Like the hi def and choices so far.  My in laws saw it and bought one also and are happy with it.", "verified": true, "helpfulness": "1/1", "author": "Tom Hulina"}, {"rating": 5.0, "review": "It is very easy to use, you can see a lot of films Netflix and you can see films Itunes.Can play game and see in TV, very fantastic....Perfect...", "verified": true, "helpfulness": "0/0", "author": "Thiago Schefer"}, {"rating": 5.0, "review": "Great product, works flawlessly with iPad2 or newer and iPod.Not as inclusive as Roku but still a great product.", "verified": true, "helpfulness": "0/0", "author": "Paul D. Aronoff"}]