[{"rating": 5.0, "review": "We use our Apply TV almost daily.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "I am an Apple TV Addict now! I love, love love it!", "verified": true, "helpfulness": "0/1", "author": "KOMA"}, {"rating": 5.0, "review": "Love my Apple TV!", "verified": true, "helpfulness": "0/1", "author": "Keri Montilli"}, {"rating": 5.0, "review": "We wanted to watch our local college football team but it wasn't televised. It was only on the college's website which we had to watch from my phone. Now we have this we can turn on airplay and it will mirror my phone. It also has tons of apps to choose from. We can watch sports broadcasts that aren't televised on regular cable.", "verified": true, "helpfulness": "1/1", "author": "Jonyardbird"}, {"rating": 3.0, "review": "Disappointed that Apple still has not updated this product to support 802.11AC.Apple should sell the product with a HDMI Cable which is an added cost for use of device.", "verified": true, "helpfulness": "0/2", "author": "Lincoln Rhoads"}, {"rating": 5.0, "review": "I love this device!  It was incredibly easy to install and it is a dream to use.", "verified": false, "helpfulness": "0/0", "author": "LJB"}, {"rating": 5.0, "review": "The first one I received didn't work correctly. I was so annoyed, but then I was so happy when I could easily return it and have a new one sent to me.  I LOVE AMAZON!The second one I received has worked great for over a year now.  I use it all of the time to watch TV, to push videos, music and pictures from my phone to the screen.  I watch PBS using the special app on the device.I also move this from TV to TV throughout the house so I can watch my Amazon Prime content on different TVs.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 4.0, "review": "The Apple tv works great except for the fact that you can't access Amazon prime, and you have to purchase an HDMI cable separately.", "verified": true, "helpfulness": "0/0", "author": "hector cajigas"}, {"rating": 5.0, "review": "Wonderful product. Easy to set up and very useful. Watch YouTube or Netflix on your TV. Love it", "verified": true, "helpfulness": "0/0", "author": "mary russ"}, {"rating": 5.0, "review": "Works well, good Quality", "verified": false, "helpfulness": "0/0", "author": "Anuka"}]