[{"rating": 4.0, "review": "I live in a rural area, with limited options for television. I heard about this product and thought it would be great, as I have decent Internet service. What I did not see (and did not realize until installing and trying to access) is that a lot of the options available require a tv provider. I will however enjoy accessing Netflix and Hulu Plus through the use of this box.", "verified": true, "helpfulness": "0/1", "author": "B. Reed"}, {"rating": 5.0, "review": "Works like every apple product out there, outstanding.  Easy to set up and use.  I highly recommend it for anyone who wants to view their ipad pictures on the TV.", "verified": true, "helpfulness": "0/1", "author": "K. Schulte"}, {"rating": 5.0, "review": "Apple TV is great.  I highly recommend it. Very compact, easy to use, and super dependable. Keep track of that tiny remote, though. It's easy to lose.", "verified": true, "helpfulness": "0/0", "author": "ABH \"Beth\""}, {"rating": 5.0, "review": "I love my Apple TV. I can view my movies through icloud, airplay my mac and ipad, use it as an extended desktop with my macbook, watch netflix, Hulu, Soccer, weather, youtube, and use the remote app on my iphone or ipad to control apple TV. I no longer have cable because this works so much better and so much cheaper.", "verified": true, "helpfulness": "0/0", "author": "Colin"}, {"rating": 4.0, "review": "yes, however i thought i remember it including the national geographic channel.  i love having netflix on the big screen.", "verified": true, "helpfulness": "0/0", "author": "vicki fraser"}, {"rating": 4.0, "review": "There are very many neat things about this product. I love that I can view content from my iTunes account in an easy manner and mirror any of my iOS devices to my TV.  It runs smoothly on WiFi and viewing Netflix is a cinch.  The reason for four stars is because I wish it had more app choices and I wish I could access Amazon Prime Video content.  I would buy again, but if you have no iOS devices other streamers may be more suitable for you.", "verified": true, "helpfulness": "0/0", "author": "PugMamaMN"}, {"rating": 5.0, "review": "This is hands down the best invention ever!!  I love it so much I bought a second and kicked cable.  This has so many features and is constantly updating to provide more access to other TV programs - HBO, Disney Jr, ESPN.  We've had a roku before and in my opinion it doesn't hold a candle to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Tabitha"}, {"rating": 5.0, "review": "This is my second Apple TV and we love them. I have one more room to put one in and we will be fully covered.  We share and use our iPads and Netflix with the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Little Lotta"}, {"rating": 5.0, "review": "Because i loved it Because i loved it. I was fun to use I could use it with my Mac and iOS devices", "verified": true, "helpfulness": "0/0", "author": "collinklein"}, {"rating": 4.0, "review": "works great and it's pretty awesome being able to easily display my extended screen through airplay. it's a typical apple product works great but comes with restrictions for example, there is no amazon prime app; the news network is pretty lame; it's a pain to turn it off or rather put it into sleep mode.", "verified": true, "helpfulness": "0/0", "author": "Chase \"chase\""}]