[{"rating": 5.0, "review": "Works great! Thank", "verified": true, "helpfulness": "0/0", "author": "AB"}, {"rating": 5.0, "review": "Works great, now I can view the photos and videos on my TV from my iphone instantly, plus many other features.", "verified": true, "helpfulness": "0/0", "author": "Spider Monkey"}, {"rating": 5.0, "review": "This little box is a Godsend.  I purchased it so that my daughter can mirror her iPad to our large flat TV in the family room.  She uses it all the time.", "verified": true, "helpfulness": "0/0", "author": "Lissi G"}, {"rating": 5.0, "review": "Very good. I use it more for you tube and to watch videos and pictures from my iPhone", "verified": true, "helpfulness": "0/0", "author": "Niraj Athawale"}, {"rating": 4.0, "review": "Wow.. I'm an Apple fanatic, so it's hard for me NOT to give 5 stars to this.  I have to say though, that in this case, the latest Roku beats Apple for a couple of reasons.  First, and most important for me, Roku offers users the ability to download lots of other helpful channels AND APPS to their device, and Apple does not.  I use a media server where I've stored copies of all of the DVD's that I have purchased over the years, and while I can stream those movies wirelessly to my iPad, and then share with the Apple TV, with Roku I eliminate that middle step because the Roku has the same App that my iPad has (DS Video) so the media server communicates directly with the Roku.  This app did not come native on the Roku, but I was able to get it (free of charge) from the Roku app site.  Also--the Roku just does a much better job of receiving streamed media wirelessly.  I'm not sure if it's because the iPad is not a \"middle-man,\" or maybe the Roku version of the App is better, or maybe the Roku hardware is better--but it streams flawlessly, where sometimes my Apple TV skips, crashes, stops.  Roku also fast-farards at lightning speed without hanging, and this is simply not true of the Apple TV.My second gripe with Apple TV is that for some reason I have to employ the ol' Microsoft fix--unplug it and plug it back in.  Gasp!  Apple TVs just seem to hang every so often, and the only fix is to unplug it.  Bill Gates would be proud, but Steve Jobs is probably turning in his grave to hear this.  Sadly, I see this happening with my iPad too, and occasionally my iPhone.  Sniff, Sniff..", "verified": true, "helpfulness": "0/0", "author": "Rob \"Rob\""}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 4.0, "review": "Ok, so I have a lot of iTunes content (movies and music). I'm really impressed with this and wish I would have done it sooner. For the price it's both simple and functional. I like to be able to mirror our iPhones and iPads. The only reason I'm dropping down to 4 stars is that a lot of the TV content is either pay as you go or you have to register the app. It's a bit of a pain but I guess nothing is free. The \"remote\" app on my iPhone is very cool. It controls the apple TV better than the remote that comes with it and I won't loose it. We seem to now use this more than our other devices. My Girlfriend prefers the interface for Netflix, with the iPhone remote app it is much easier to navigate. Oh the picture is flawless, I wired it direct which means I had to set up \"homesharing\" in the remote app. You absolutely want to enable homesharing. The Apple TV actually make that whole concept worth while. Basically thumbs up!", "verified": true, "helpfulness": "0/0", "author": "Joe B"}, {"rating": 5.0, "review": "Excellent product but need fast wifi to achieve smooth transmission form computer", "verified": true, "helpfulness": "0/0", "author": "Allyn S"}, {"rating": 3.0, "review": "Bought it for HBO Now (like everyone who bought in the last 30 days). It will do what I wanted it for, but it's inferior to my Roku 3 in every other way.  Seriously no other reason to own it.", "verified": true, "helpfulness": "0/0", "author": "Christopher Piper"}, {"rating": 5.0, "review": "Super!", "verified": true, "helpfulness": "0/0", "author": "Bob"}]