[{"rating": 3.0, "review": "The Apple tv did not work as expected because it did not connect to either using wifi or ethernet, it got stuck in setting time and date and the troubleshooting in the instructional manual did not provide a solution for this issue so I had to Google it and now I have to wait four hours for this damned thing to update. Apple disappointed me big time. I should have bought the Amazon Fire Stick instead (at least it is cheaper).Ah, final complain: the Apple tv is so primitive that it lacks WPS so I had to manually introduce my wifi network password. In comparison, my 3 year old Sony Bluray does have WPS. Such a waste of time and money.Update: It seems I have a karma with Apple products because my first experience with them is frustrating but I have to admit they have their charm once I get them to properly work. Thumbs down for Apple for the software issue that hindered me to use the Apple TV once I plugged it in but I googled a solution (connecting the Apple TV to a mobile hotspot using my smartphone and later retry connecting the Apple TV to my home Wi-Fi network and it did work).However the two main cons are the lack of WPS for easy connection to a home Wi-Fi network and the poor channel catalogue that the Apple TV offers, The Roku box is way better but Apple TV has its perks though.I'll update as long my user experience improves or worsens.", "verified": true, "helpfulness": "0/2", "author": "Sataniaster"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/1", "author": "Charles W."}, {"rating": 5.0, "review": "fast", "verified": true, "helpfulness": "0/1", "author": "celso"}, {"rating": 5.0, "review": "So easy to do Airplay from my iphone or ipad and stream a lot of things.", "verified": true, "helpfulness": "0/1", "author": "Tradetexasbig"}, {"rating": 5.0, "review": "Love the AppleTV. Perfect unit for the TV.", "verified": true, "helpfulness": "0/1", "author": "Eugene Brown"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/2", "author": "K. Mcdowell"}, {"rating": 5.0, "review": "I have one in every room.  Most of you know what you are getting with this.  If not, read about it on Apple.com and then buy one.", "verified": true, "helpfulness": "0/1", "author": "henry k misso"}, {"rating": 1.0, "review": "Apple TV has a clumsy interface and the software is buggy. It's slow to react to inputs. It buffers when you jump back 10 seconds. The software crashes regularly and requires the viewer to go back to the main menu, then click through sub menus to get back to the show that was being watched, only to crash again. Apple, if your device is going to crash often, at least put a \"reset\" button on the front of it. But no, that would upset the clean lines of the design. Apple: form before function, every time.When Google updated their YouTube software, Apple didn't bother to update their YouTube app. Instead, without notice, they reached into the Apple TV and deleted the YouTube app from my device. Apple made no attempt to notify me of this change. Frankly, I didn't know they could do this. It must say something about it in the 500 page iTunes contract I \"agreed\" to.The remote has only seven buttons, and two of them do the same thing. It's tiny and shaped to slip between couch cushions as quickly and efficiently as possible.Apple products only seem to last a few years before the company sabotages them with software updates, so a new device will have to be purchased as a replacement. This is simultaneously happening to all my Apple products. They've turned planned obsolescence into a science.Save your money. This product is a bust.", "verified": false, "helpfulness": "0/1", "author": "R Crane"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Gamaliel"}, {"rating": 4.0, "review": "Great buy. Everything i expected", "verified": true, "helpfulness": "0/1", "author": "Joseph"}]