[{"rating": 4.0, "review": "I LOVE my apple TV.  It has made my television watching more productive.  I know that sounds strange, but it's true!  I now watch Ted talks and podcasts on my television.  The Netflix doesn't hurt either.Anyway I'm a big fan the only problem I have with it is it doesn't always work in hotel rooms.", "verified": false, "helpfulness": "0/0", "author": "Dirk \"Fuente\""}, {"rating": 5.0, "review": "If you don't have one, get one. I have an iPhone, iPod touch, Mac Book Pro, and an iPad. So naturally I had to get an Apple TV. By far one of my best investments. You can literally throw a video, picture, or song onto the big screen from any of your other devices. It's great when friends and family are over to be able to do so.", "verified": true, "helpfulness": "2/2", "author": "Sean L"}, {"rating": 5.0, "review": "No USB port but I love this thing apple is the way to go its fast & smooth great for netflix highly recommend!!!!!!", "verified": true, "helpfulness": "0/1", "author": "richard zamora"}, {"rating": 5.0, "review": "We love Apple TV. It was very easy to set up and now we can access all kinds of programming that we did not have before. Love it!", "verified": true, "helpfulness": "0/0", "author": "ami"}, {"rating": 5.0, "review": "Great product. Works as advertised. Compact, elegantly designed. Wish it could do more like play any video etc... but I knew what I was buying. No regrets.", "verified": true, "helpfulness": "0/0", "author": "Lance Templar \"LT\""}, {"rating": 5.0, "review": "This was a birthday gift for myself.  Its awesome to have a small unit like this that works seamlessly with my iphone and ipad.  I think I will purchase a second one for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Chibicat23"}, {"rating": 4.0, "review": "Now that it has HBOGo, it has MOST of what I use (Netflix, Hulu, HBOGo, and WatchESPN).  It also is an easy interface to our iPhones and iPad.  Typical Apple mentality - I didn't take any thought to start streaming music and videos from our other Apple products.  I'd like them to sign on to the Amazon App next so i can stream Prime content.  Also, I wouldn't order movies off of it as they are several dollars more than through Amazon (which we stream through a PS3).  The remote is typical Apple - small, simple, and just works.  I got this before Google ChromeCast came out.  I would say there are regrets, but CC doesn't yet have the Apps, and the AppleTV interface (assuming you have apple products) works seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Andy Craig"}, {"rating": 5.0, "review": "This is a great addition to my big screen TV.  Have a smart samsung TV with similar functionality... but nothing compared to the speed and interface of the Apple TV device.  Great for airplay from my Apple computer and my Apple Iphone/Ipad.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "John Allington"}, {"rating": 5.0, "review": "What can you say, it is an Apple product and allows me to effectively integrate all my Apple devices.  Love it!", "verified": true, "helpfulness": "0/0", "author": "seirra gal"}, {"rating": 2.0, "review": "This device doesn't allow amazon prime to stream and other videos, such as you tube, stream with low quality. OK as a picture viewer and not much else. This product is in need of improvement, My smart DVD player works better for movies and was cheaper.", "verified": true, "helpfulness": "1/4", "author": "rosa p"}]