[{"rating": 5.0, "review": "Second one I've bought and I like them both. My Samsung Smart TV has many of the same features, but like most Smart TVs, it has numerous interruptions especially with You Tube. This is great to mirror your IPhone or IPad especially to view pictures. Only down side, it doesn't readily support Amazon Prime vides.It can also be used for video presentations from an IPAD/IPhone. Requires video projector and wireless router, but no internet required. Ther are several YouTube videos that show you how to do this.", "verified": true, "helpfulness": "0/0", "author": "Starlifter"}, {"rating": 5.0, "review": "Of course it works great but so did the old one. They dropped youtube from the menu to force everyone to buy a new transmitter which is deeply annoying. I am finding myself more and more willing to live without \"new\" tech simply because it's being crammed down my throat.", "verified": true, "helpfulness": "0/1", "author": "Alice"}, {"rating": 5.0, "review": "It's great.", "verified": true, "helpfulness": "0/0", "author": "Kim L Sayer"}, {"rating": 5.0, "review": "Just an apole gadgetEvrything works fine and as expectdI'm using it just for the airplay functionI plugged it using a digital cable for audio to my AV and stream spotify and other music apps from my apple device", "verified": true, "helpfulness": "0/0", "author": "Fabian Eduardo Tomasetti"}, {"rating": 2.0, "review": "Great concept, but at this point 95% useless without a cable subscription. I had canceled my cable hoping this would be a better alternative, but all it's good for is Netflix, Hulu, & HBO Now. I can do Netflix & Hulu from the X-Box already. HBO Now is a great concept, but not worth keeping the unit just for that.", "verified": true, "helpfulness": "0/1", "author": "Jennifer M. Darling \"DrDarling\""}, {"rating": 5.0, "review": "As advised and promised -maybe just a problem with network but apple tv crashes - but other systems a function just fine at the same time", "verified": true, "helpfulness": "0/0", "author": "Steven Harrell"}, {"rating": 5.0, "review": "Works well. Just as expected.", "verified": true, "helpfulness": "0/0", "author": "G Clark"}, {"rating": 5.0, "review": "Apple,,, as usual, excellent product. Highly recomnded.", "verified": true, "helpfulness": "0/0", "author": "Aci"}, {"rating": 4.0, "review": "It delays too much. Other than that it's nice to have.", "verified": true, "helpfulness": "0/1", "author": "AT"}, {"rating": 5.0, "review": "I can't believe the price. I loveeeee", "verified": true, "helpfulness": "0/0", "author": "Nargis"}]