[{"rating": 5.0, "review": "It came in no time and works as advertised. Very convenient and works with all my apple products. Great invention.", "verified": true, "helpfulness": "0/0", "author": "Michelle W"}, {"rating": 5.0, "review": "My wife finally decided she wanted one for Christmas--mostly to show pictures and video from the iPhone.  We have been very pleased.  Using Airplay couldn't be any easier with our phones (the family has 4...) and showing pictures from our Windows computer was also easier than before.  Compared to the Streaming BluRay (we had an LG and now have a Panasonic), the Apple TV starts much faster, has better and faster menu system, which delivers a more pleasant streaming experience.  Purchased shows from iTunes are about the same price as Cable VOD, but better quality.One trick worth mentioning--When we facetime my daughter, I mirror the image from my iPhone to the TV screen, place the phone on top of a speaker just under the screen, and two of us talk to my daughter on the big screen.  Works great, and its much more pleasant that trying to pass the phone back and forth or cram into the picture.We use it mostly for sharing pictures, and streaming Netflix.  Its been well worth the money just for the pictures.  We could share pictures on the TV before, but it required more hassle, and we only did it on special occasions.  Last week I took some quick shots and video of a warehouse on fire near my office, and showed them to my wife on the big screen before we watched a TV episode.If you are an apple family, its well worth the $100 to share photos on the TV with incredible ease.  But I would say its not a good purchase if you don't have apple products.  We can do most of the same things through a Streaming BluRay player--just takes more steps and time.", "verified": false, "helpfulness": "1/1", "author": "Jim"}, {"rating": 5.0, "review": "After buying Apple TV my wife and decided we really didn't need to have Direct TV anymore. We can watch just about anything with out losing any of picture or sound quality that we enjoyed with Direct TV. Really the only thing missing is Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "SCBFSU \"Scott\""}, {"rating": 4.0, "review": "The fit and finish on this device is much higher in quality and feel than the Roku.  It has a nice solid, heavy feel to it and all the seams are very tight and smooth.  I used to own the Roku 2 and it was an inferior product both aesthetically and functionally. The obvious advantage that the Roku had over the Apple TV was the channel selection but that was about it. Setup on both devices is easy.  Plug them in, they find your wireless network and after the password is entered, you're good to go.  You have the option for a wired connection but for some reason the wireless works better on my network.  The GUI on the Apple is smoother and looks better than the one on the Roku.  The Roku is clunky and it takes forever to scroll through the channels, whereas the Apple has the channels on a grid pattern.  Picture quality is also superior on the Apple TV and the wireless streaming has been glitch free.  I had trouble setting up the homesharing but once it was up and running that also has been free of problems.  The only reason I removed a star on the rating was because of the performance of Airplay.  The sound quality is poor and it fluctuates during playback, becoming louder and softer continuously.  This could be a problem with my network but other people have also complained of this.  The bottom line is that this out performs the Roku with the disadvantage of a small channel lineup  which didn't matter to me because the main reason for this was the home sharing and the use of Netflix.", "verified": true, "helpfulness": "0/0", "author": "ILoveTheUSA"}, {"rating": 5.0, "review": "It works great with the iPhone, iPad and MacBook for mirroring, and I can use the Remote App to control it from the iPhone which is better for navigating through menus than the remote, which I can use with my MacBook. Really integrated stuff here.Also can stream the movies stored in my PC via iTunes.Netflix loads faster in Apple TV than with the roku xs I already have.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Having satellite TV and not wanting to pay for receivers in each room, we were relying on rabbit ears to pull in channels in our bedroom.  With AppleTV we can add the lineup of Netflix and Hulu as well. It is easy to hook up and portable so if we want those streaming channels on our main TV, it only rakes a minute to swap.  We plan on trying it the next time we vacation to see if it will work with the hotel's wifi.", "verified": true, "helpfulness": "0/0", "author": "D. Beckwith"}, {"rating": 4.0, "review": "It is great but I was hoping to stream my prime movies from my iPad through the Apple TV.  Thanks", "verified": true, "helpfulness": "0/0", "author": "Luella P. Rollins"}, {"rating": 4.0, "review": "Nice for people who have apple ecosystem (like my girlfriends family) and you get netflix and your libraries on your TV.Wish there were more apps supporting it.Also im not sure if there is a work around, but while airplaying certain apps, picture would not full screen.  I know the screen ratio of my GF's IP4 is different from a widescreen, however it was basically a 4:3 inside a 16:9 inside a 4:3 as their was space all around the picture.  Tried adjusting all the settings, but it wouldn't atleast match up the height or the width.", "verified": true, "helpfulness": "0/0", "author": "Brady"}, {"rating": 4.0, "review": "Edit:  The Hulu Plus issue detailed below has been fixed with a system update ... I'm bumping this up to four stars but I'm leaving my original comments online so that people can see that this product has historically not gotten the support it needs from Apple.Original Review: 2 Stars:Considering the Apple name and the price, I expect a premium product - this doesn't cut it.  Hulu Plus only works if the device is set to Wifi, even after a firmware update.  This is a known issue that Apple can't or won't straighten out with Hulu.  I can cope because the wireless streaming is reasonably fast and reliable ... BUT .... tonight I rent a movie on iTunes and it won't load unless I hard-wire the internet.  Tedious.If you're expecting the same quality you find in iPhones and MacBooks, then no, this isn't the same level of quality usually found in Apple products.  I expect to tinker with cheap, also-ran products but not slick, expensive Apple products.  Just under the surface is a 5-star product waiting to bust out here, but this device is the red-headed step-child of the Apple line.  It's basically a beta-test for the TV Apple is going to make anyway, and it feels like it.", "verified": true, "helpfulness": "0/0", "author": "Mayor Bloomburger"}, {"rating": 5.0, "review": "i would buy another one of these. I don't have to buy a adapter for my iphone to play movies on the tv. this new age of \"streaming\" movies is wonderful.", "verified": true, "helpfulness": "0/0", "author": "Mexman00 \"mexman00\""}]