[{"rating": 4.0, "review": "Works well, typical of Apple which stresses design and functionality.  One wish - that Apple someday decides to add a slingplayer to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow! The installation is very simple. The operation is intuitive. The video pass through is very high quality. The ability to play from an iPad or iPhone is amazing. AND it is inexpensive (at least until you start subscribing to downloads).", "verified": true, "helpfulness": "0/0", "author": "T. Pendergrass \"History Dawg\""}, {"rating": 5.0, "review": "Apple TV is a perfect inexpensive addition to your TV. I use Airplay frequently, watch YouTube and Nerflix on it, rent movies, and occasionally stream music to it. It is simple and makes it easy to do what it's supposed to do.. Also, it has the most elegant remote I've ever seen.", "verified": false, "helpfulness": "0/0", "author": "Cathrine L Hutcherson"}, {"rating": 5.0, "review": "It's Apple TV a $99 investment into almost limitless entertainment. This is the fourth Apple TV I bought, if you have a TV you need Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Michael Fieramosca"}, {"rating": 5.0, "review": "Can say it does as advertised. Good remote catches wi fi easily. Have to reboot (unplug) once in a great while.", "verified": true, "helpfulness": "0/0", "author": "D. Keeney"}, {"rating": 5.0, "review": "Our Apple TVs extends our TVs to include experiencing more of our content - pics and vids - and adds to our options for viewing downloaded / streamed content. And it is controllable from from iOS devices.", "verified": true, "helpfulness": "0/0", "author": "Patrick D. Quinlan"}, {"rating": 5.0, "review": "One word describes this device.  AWESOME!  I love all Apple products and would not change.  I would definitely recommend this product to everyone", "verified": true, "helpfulness": "0/0", "author": "giluv2ski"}, {"rating": 4.0, "review": "Comcast will not allow their customers to access HBO Go on the TV unless you are an Apple owner and have an iPad or similar device to project movies downloaded from the Internet to the Apple TV device.  It works great", "verified": true, "helpfulness": "1/1", "author": "Apple phi"}, {"rating": 5.0, "review": "Amazing!!! With the 1080 HD thhe video quality is superb -- as good as any blu ray DVD I have played. . Netflix streaming is excellent. I am on the 30 day free trial and I definiteely will subscribe  While newer movies and a lot of old movies are not included there is still ample material. Also there are a. world of TV series that are available from the first episode on. .The deciding factor in my selecting Apple TV over the latest Roku is the mirroring of the iPad (2 or later) screen onto the large screen TV. There were things that I could only watch on my computer that is a lot more enjoyable on the big screen TV.The remote is small but very good. I have had an older Roku for some time. The newer one also has 1080 hd capability and seems to sell for the same price. It might boil down to the mirroring.  No matter which one is right for you -- jump on it. I don't think it could get much better.I will add that the mirroring is a constant source of enjoyment.  It alone is worth the money.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Grandon\""}, {"rating": 5.0, "review": "Best thing ever!  No more wii for Netflix, no wires showing, great to connect to my iPhone.  Good variety of standard features", "verified": true, "helpfulness": "0/0", "author": "BUNDY"}]