[{"rating": 5.0, "review": "Just got mine yesterday, can't get myself away from it. This is a great product if you are an Apple aficionado. The easy setup and ease of the interface is suburb. Airplay is an awesome feature specially when you have too many apple products laying around.I would recommend in a heartbeat minute to anyone interested in this kind of gadgets. Way to go Apple.", "verified": true, "helpfulness": "0/0", "author": "Bashar Elsbei"}, {"rating": 5.0, "review": "Love this Apple TV. I can Watch movies on Netflix and on my computer. Love this product better than I had expected. Now I am thinking about getting rid of my cable.", "verified": true, "helpfulness": "0/0", "author": "Wynter Metoyer"}, {"rating": 1.0, "review": "This thing is the most archaic piece of crap I have ever used.  Apple should be ashamed to put their name on this garbage.  I own several iPads, and several iPhones.  I am a huge fan of Apple products, so thought the Apple TV would be a great addition.  WRONG.  The remote looks and functions like something out of about 1983.  But by far the worst part of all is the Apple TV has a mind of its own.  Frequently (meaning several times a week) will not connect to the internet, despite being wired direct to my router via ethernet cable (I tried wireless, it was exponentially worse).  Sometimes it won't work on startup, other times it will just cut off mid-movie and stop working.  Restart sometimes works, sometimes not.  Absolute piece of garbage.  Wish Kindle TV would have been available when I got this.  Lesson learned.  Thankfully Amazon has phenomenal customer service.  I am going to try a new Apple TV unit (would much rather get the Kindle TV, but since I own so many iTunes movies, would really be nice if the Apple TV worked), and will report back if that one works any better.  But so far with all my Apple products....everything else A+...Apple TV...F-", "verified": true, "helpfulness": "0/3", "author": "Matthew Dunham \"wildfan\""}, {"rating": 5.0, "review": "The Apple TV is great for watching movies, listening to music, Netflix, a TV-Sized photo player...I love this device!Thanks Apple!", "verified": true, "helpfulness": "0/0", "author": "Jason B Ziegler"}, {"rating": 4.0, "review": "I love Apple TV, but I wish I had access to my private home network! Why can't that be an option? Get with the program Apple! Also an updated UI would be nice. I think They should make it look more like IOS 7.", "verified": true, "helpfulness": "0/0", "author": "Andrew Read"}, {"rating": 4.0, "review": "This product works fine.  The case and remote are made well and of metal.  I also bought a ruku around the same time.  I like the quality of the Apple TV's case and remote, but the Ruku is easier to navigate.  The Apple remote was not designed for big fingers.  My students say they use their iphones and I touches to control their apple tv's - instead of the stock remote", "verified": true, "helpfulness": "1/1", "author": "Fred"}, {"rating": 5.0, "review": "Prob best to wait til the new apple tv comes out but i bought this anyway and use it for airplay.  Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 4.0, "review": "Love my new Apple TV! Much better than paying for cable service and a lot more choices of what to watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not sure how this did. It was a gift.", "verified": true, "helpfulness": "0/0", "author": "Barbara graves"}, {"rating": 5.0, "review": "Family members told us about Apple TV several months ago, and we finally decided to purchase one. Wow!!! This is fantastic!! We are now able to stream our church services, stream movies, and so much more....we love it!", "verified": true, "helpfulness": "0/0", "author": "SueZan Stutts"}]