[{"rating": 3.0, "review": "Purchased the Apple TV primarily for streaming my movie collection onto my HDTV without needing to convert file formats for iTunes/Home Sharing or AirPlay.What an enormous letdown. AirPlay Mirroring simply did not work for me despite countless hours of online research and having conversations with users at Apple's discussion forum and the Mac Rumors forum.The Beamer app (a 3rd party app) worked for standard definition content but not for HD movies. The company that makes Beamer blames my relatively new MacBook Air. I seriously doubt that.User interface is ugly too. Just a bunch of tiles that are clunky to navigate.The one time I rented an HD movie from iTunes via the Apple TV it would not start playing for at least an hour. I thought movies were supposed to start after a few minutes. I'd rather rent from my cable company via VOD.I'm sure the Apple TV is great for many others. I'm a huge Apple fan myself. But for my needs it was a disaster. Probably going to purchase a WD TV Live Media Player at some point.UPDATE: Okay, I'm updating my review because I found two apps (Infuse Pro and Air Video HD) that essentially allow me to AirPlay natively (not AirPlay Mirror) video files to my TV via my Apple TV.This is huge for me. It's essentially the only reason I bought my Apple TV to begin with. It really sucks though that AirPlay Mirroring really isn't an option for many of us when it comes to streaming our video content. I feel like Apple is really not being honest on that front.Also the interface as of the summer of 2014 for the Apple TV is simply gross. Even if you can delete channels it's still ugly and a poor user interface. I suspect this Apple TV will get a software facelift come fall of 2014.So yeah, thank you Infuse Pro and Air Video HD for allowing me to use this device as I intended to all along.", "verified": true, "helpfulness": "3/5", "author": "Lovethefuture"}, {"rating": 1.0, "review": "Bought the AppleTv back in 2011, worked amazingly well until 3 months ago.  Now all it does it say \"An error has occurred\".  We've tried factory reset, and other means, but whenever we try loading via AirPlay to our homecomputer, just doesn't work.  Netflix still works though weirdly enough.  We tested the computer movies and they still all work, it is almost like the Apple TV box stops working after 18 months...  Apple, if you're listening, please explain this, because when I search this on the internet; there is literally thousands of folks complaining about this issue as if it is an update issue!", "verified": false, "helpfulness": "0/7", "author": "MegZini"}, {"rating": 4.0, "review": "Apple TV is, for the most part, a great buy: you can watch any iTunes video, view a slideshow of your photos, view Netflix through it ... But it's a pain to set up. The photo viewing was a big part of why we bought it: so we could easily show our friends our honeymoon photos ... Unfortunately, despite doing everything we could think of and everything the experts said to do, it still won't work properly. I'd still recommend it to a friend, but only those who know their technology. If you don't, or don't have anyone to set it up for you, then don't go there.", "verified": true, "helpfulness": "0/1", "author": "Kiersten"}, {"rating": 5.0, "review": "My tv was sad then i gave it an apple tv now with my Bose surround sound and Panasonic I am thrilledIt works with all my apple devicesMacbook ProIpad MiniIphonesFull size iPad", "verified": true, "helpfulness": "0/1", "author": "Logan Lamonte"}, {"rating": 5.0, "review": "we have come to expect so much more from Apple that we expect more!this product is very good and getting things onto my TV is so easy.Wonderful extension to their product line", "verified": false, "helpfulness": "0/0", "author": "G1"}, {"rating": 3.0, "review": "I find that I enjoy my roku so much more than this.  It's ok, but it doesn't have the channels I'm used to with the roku.  The only good thing about it is the airplay... when it works.  Airplay is really only good when both the iOS device and the Apple TV are on a fast wifi connection with good signal strength, or when you can plug it into ethernet.I don't think I'll be keeping this, the roku seams to have more of the content I am used to, with an easier to use interface.", "verified": true, "helpfulness": "0/2", "author": "A. Noney Mouse"}, {"rating": 5.0, "review": "I have owned a 1st gen Roku box almost since they were released and I use it nearly every day.  As an Apple heavy household (MacBook Pro, iPad, iPhone, and two Apple AirPort Routers, etc) being able to mirror those devices onto he Apple TV was very appealing. It is wonderful and was easy to set up. For other Apple households I highly recommend it. It may be somewhat less interesting for PC homes, especially if without any iOS devices.But the following is why I'm writing this review:I just bought a refurbished Apple TV from Apple last weekend. I had a hiccup getting Photo Stream to work and called Apple Tech Support. Along with their world class tech support from the Canadian tech I spoke with (we solved the issue quite quickly), she told me something that is not well known. If you buy AppleCare for your Apple TV, the coverage extends to any AirPort Extreme or AirPort Express routers you may have, as long as they are less than two years old. (Of course all Apple products have 90 tech support from date of purchase.)AppleCare, for some reason, isn't available for the routers on their own, but being able to get it via Apple TV was wonderful news. For $29.99 (list price) you can ensure you get two years of tech support for any networking issues you may develop. Since a one time tech call for products out of tech coverage is also $29.99, why not cover all your bases at the start, and for as many issues that arise?My original AirPort Extreme router was over four years old, so I decided to upgrade to the newest dual band version a couple of days ago.  Although I did call tech support to walk me through the set up, it couldn't have been simpler with the AirPort Utility App that is included in Lion and Mountain Lion as well as on iOS 6 devices (iPhone and iPad, for example). Again I received world class service. Last night it turned out I needed to fine tune one setting, and the Canadian tech I spoke to also suggested investing in AppleCare for the Apple TV for the reasons I've just given, and I have done so.This \"wrap around\" coverage to the routers also come from Apple iMacs, MacBooks, MacBook Pros, and iOS devices. For some reason this isn't commonly known, but it should be.  Networking issues can crop up, and having someone troubleshoot them for you can be very expensive. They also drive me crazy with frustration and knowing I have Apple to lean on is a huge relief. Their support is incomparable and North American-based. Every time I've ever had to call (and not many that) I am more impressed by their level of training, their patience and good will. They are my tech angels!", "verified": false, "helpfulness": "1/1", "author": "CityGal \"khcalgal\""}, {"rating": 5.0, "review": "This item is something that everyone has to have. It is so entertaining. Listening to your favorite music and also your playlist with this item is so easy and the price is so affordable. Another Thanks to Amazon", "verified": true, "helpfulness": "0/0", "author": "lili"}, {"rating": 5.0, "review": "Remote stopped working the 2nd day.  Replaced the battery to no help.  Instead of being able to charge my ipad at night, now I have to take it to bed in order to use it as the remote.  (Not that smooth to use really.)I wish I would have tried other options to see if this is the best option or if the slow and delayed response is normal for this type of tv option.edit:  I Changed from 3 to 4 stars knowing that my issues could possibly have been my own.  I will give it the benefit of the doubt.  I will say that I really like having apple TV most of the time.edit 2:  Make sure to mount the apple TV to where the remote can \"see\" it.", "verified": true, "helpfulness": "0/0", "author": "James M. Campbell"}, {"rating": 2.0, "review": "I am not happybut i was expecting more channels to see for free, but look apple didn't want to put to much content for free,I am really disappointing w/My purchase, cause I can have a much cheaper streaming device w/more content and I think this is solely to got more money from your pockets to sell even the TV shows already aired a long time ago,", "verified": true, "helpfulness": "0/4", "author": "Armando Martinez"}]