[{"rating": 5.0, "review": "Excellent stuff", "verified": true, "helpfulness": "0/0", "author": "roberto young"}, {"rating": 5.0, "review": "I purchased the Apple TV to be able to stream HBO now.  I am so glad that I bought this, The resolution and quality is amazing.  I owned a ROKU prior to this and while I enjoyed the ROKU the Apple TV is so much better.  I would highly recommend this to anyone wanting to stream apps like Netflix, Hulu, HBO, and many many more!", "verified": true, "helpfulness": "0/0", "author": "fltc"}, {"rating": 5.0, "review": "Ive had this a couple days now and havent explored all the features, but i didnt need to use the set up guide, just plug it into my tv, give it my wifi password and good to go. I love the airplay with my iphone; i tried to use the youtube app built into the boxes programming but didnt much care for it but just use my phone with a 2click feature and boom anything on my phones on tv, movies, videos, etc. when i set up netflix i didnt have to put in my visa, just my icloud info and itll charge me automatically now, so simple and easy to use. It arrived on time and in perfect condition, luckily my hdmi cable came at same time and i didnt have to wait for it :-) i did notice theres things like history channel where u might not beable to get full episodes on every show but on alot of shows theyre abailable, some other major tv networks but didnt open, a weather channel, etc. no pandora or safari/internet explorer option but if u have a iphone it doesnt matter just use airplay", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "I dig it. Still playing around with it but so far it's cool. Just a giant iPad screen. :)", "verified": true, "helpfulness": "0/0", "author": "Nicholas hardy"}, {"rating": 2.0, "review": "Remote is just awful. It looks cool but is simply not functional - it's too small and the buttons are hard to work individually. Could not pair with Bluetooth to my MBP.  Had to \"restore\" for no reason then would not let me sign in afterwards. Apple doesn't understand television.", "verified": false, "helpfulness": "0/2", "author": "G. Blanston"}, {"rating": 5.0, "review": "Great product, amazing for anyone, streams perfectly and is almost like having another TV box with you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I had trouble setting it up to my television.  The directions were not given for a novice to understand.", "verified": true, "helpfulness": "0/0", "author": "Pauline L."}, {"rating": 5.0, "review": "This was excellent", "verified": true, "helpfulness": "1/1", "author": "Gary D. Boeka \"hskr\""}, {"rating": 5.0, "review": "My apple TV has outmoded every other streaming device in the house. It is hard to imagine life without it.Sadly no Amazon video support yet.", "verified": true, "helpfulness": "0/0", "author": "von Scorpio"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Brian Westrick"}]