[{"rating": 5.0, "review": "Best purchase!", "verified": true, "helpfulness": "0/1", "author": "dz."}, {"rating": 5.0, "review": "It works. Just setup the internet connection. If you want to mirror your phone just swipe up on it and select airplay. Done. I gave this to my parents and they like the idea of showing pictures/video of the family on  the 55\" TV versus their 4\" phone screen.", "verified": true, "helpfulness": "0/0", "author": "Avid Amazon Buyer"}, {"rating": 5.0, "review": "I enjoy all my favorite shows with this. Not really any complaints. I mean, its apple so its expensive. Maybe I'll try the amazon version for cheaper. If you're a die hard apple person, then I don't even know why you are reading this review. You know you are going to buy it. Just add it to your cart already!", "verified": true, "helpfulness": "0/0", "author": "Ckeys002"}, {"rating": 5.0, "review": "Love the Apple TV.  It's so user friendly.  Works with your iphone.  Very cool.  Got it for Netflix and it's great.", "verified": true, "helpfulness": "0/0", "author": "Wizzy"}, {"rating": 2.0, "review": "I have one. It works. It works on pictures.However, even after numberless updates, the device still drops audio from the Mac to TV after the laptop monitor has been to screen saver mode. And it REFUSES to pick up the audio again without a restart.After so many years, this problem should have been addressed permanently long ago.", "verified": false, "helpfulness": "0/0", "author": "Ole Bjrsvik \"Ole Bjørsvik\""}, {"rating": 1.0, "review": "Awful Awful Awful!  I've had this for 1-1/2 years now and it's just horrible. It has a dedicated IP address, connects perfectly to our network and yet NEVER plays our movies! It will just buffer forever before starting the screen saver.  My Mac can't play movies from it using AirPlay.  It can connect to the Apple TV and movies act like they are loading but they never do. iPads and iPod Touch 5G can't AirPlay to it.  YET my $20 Firestick works PERFECTLY with never an issue.  If we didn't have 100 iThings and hundreds of movies in iTunes, I'd use Amazon exclusively.  So many problems with one son's iPad and this Apple TV is not worth becoming a door stop. Do yourself a favor and use FireStick, Rocu (?) or whatever else you can because this thing is awful.  I even took it to the Genius Bar and they said there is nothing wrong with it but I have to connect via ethernet from Macbook to Apple TV to stream a movie.  Are you kidding?", "verified": false, "helpfulness": "0/0", "author": "CAMPERGIRL"}, {"rating": 1.0, "review": "I loved this Apple TV. But it's been acting up after owning it a little over a year. I can't seem to watch movies I've purchased because it's always stuck on thinking and freezes. And lately it restarts my Netflix every time I turn off my TV. So I have to keep logging into Netflix which is a complete pain. And I find myself unplugging or restating the Apple TV just to get it working. So while this may be a good product at first I now hate it. It frustrates me constantly. I don't recommend buying.", "verified": false, "helpfulness": "0/0", "author": "Kristi Gana"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Fernando Valdez"}, {"rating": 5.0, "review": "I honestly do not know why I waited so long to purchase this. Amazing Amazing purchase. Wish the remote was a little bigger as to not get lost, but I know in electronics smaller is preferred for most. I ended up putting the remote on a larger object which works great. Easy to install and I swear anyone that purchases should just love it.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "I just love my apple tv! It's amazing, ai use it for Hulu, Netflix, Youtube and Airplay for Safari, it works great! I really like the fact that you can modify the Network settings, becquse I use a special DNS, and I was able to set it. The remote is a little bit small but it's fine. The only bad part is that when you're using the airplay for watching a movie or something using Safari, you can't see the subtitles that you see on your ipad, but other than that it's amazing!", "verified": true, "helpfulness": "0/0", "author": "Mary V"}]