[{"rating": 5.0, "review": "All the necessary apps available to enable you to cut the cord that is cable.  Appropriately priced. Just as easy to use as any other Apple product. Enough said.", "verified": true, "helpfulness": "0/0", "author": "Brian E. Silvers"}, {"rating": 5.0, "review": "If you love Apple products and you already have a lot of them in your house (iPhone, iPad, Macbook, etc), the Apple TV is a no-brainer for you.  It's easy to set up and the interface is true Apple quality.  I've used blu-ray players for years to access streaming apps and none of them were as easy to use as Apple TV.  Plus, the mirroring and AirPlay options are great.  Great price, good buy!", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "Perfect product to make my Bose Lifestyle V35 system wireless enabled. Dont have to worry about anything to keep pace with latest Apple technologies (read lightning vs. 30 pin iPod dock) and offers so many features to you like airplay, mirroring etc. My main objective was to supplement and enhance my bose HTIB and advance its connectivity....does more than what i intended.", "verified": true, "helpfulness": "0/0", "author": "Hemant"}, {"rating": 5.0, "review": "The big reason I bought the Apple TV was for YouTube.  It was either Apple TV or Roku 3, although I heard about a Western Digital device but I don't know much about it.  I have had many Roku devices and they've all worked fine, but I thought I'd try Apple TV for a change.  I have recently changed over to Apple Ipads and laptops so I thought I'd give it a try.  Well, from my first few hours with it I'm quite impressed!  The YouTube set up is awesome!  The picture is great, the menu works fine, and I couldn't be more impressed. And, YouTube has SO much great content!  You can find just about everything on YouTube, documentaries, full music albums, sermons, speeches, how to videos, movie clips, you name it and it's probably on YouTube!  And I have the Roku2 with all it's supposedly great channels.  But you know what I use it for?  Netflix, Amazon, and Vudu.  That's it!  Crackle sucks, it has commercials, and PBS is cool but it's on Apple TV as well.  The other thing I liked about Apple TV was the Airplay connection where you can stream from your MacBook, Imac, Ipad, or cell phone to your TV.  I tried it with a MacBook and it couldn't be more simple!  I streamed some Coursera courses on it from my Macbook, and it worked flawlessly!  The Neflix interface is a little snazzier on the Apple TV, a little more slick and prettier than the Roku.  The one thing I don't really like that much is the Apple TV Remote.  It's kind of hard to get used to, I was always pushing the middle button accidently when scrolling.  It's also very small and about 1/8\" thick and I wonder when I'm going to sit on it and break it.Other than that, like I said, I'm VERY impressed!  I'm glad I got the Apple TV instead of the Roku 3 which people seem to be having problems with.  But, I also kept my Roku2 and use it along side the Apple TV.  You just have to make sure you have a few HDMI slots on the back of your TV, which most TV's do have nowadays.  The Apple TV also is a nice piece of technology.  It is a lot heavier than the Roku, and doesn't seem \"plasticky\" like the Roku, but more like a solid hockey puck.  It's as easy to set up as it is to get a laptop hooked into your network, doesn't take 5 minutes.  All in all I'm impressed with the feel of the device, the interface is typical Apple cool, and everything works exactly as you would want it to.  What more can you ask for?", "verified": true, "helpfulness": "1/1", "author": "Butters232 \"Big guy\""}, {"rating": 4.0, "review": "We bought this so we could watch Netflix and HBOgo without using our Xbox. Does fine, easy install and set up. Only complaint is the Disney junior channel won't let me use it. It didn't list Time Warner for a provider. So even though I pay extra for the channel it isn't available and that was one of the reasons I wanted this.", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 4.0, "review": "I bought this for two main reasons. I wanted to add it to an old plasma TV that has no built in apps so I could watch Netflix and I wanted to be able to use all my other Apple products with it. Works seamlessly. It's a little dated given the features on the new Roku products but it does everything I need. I paired an Apple wireless keyboard to it so I don't have to chase letters all over the screen when searching for things. It works great too.", "verified": true, "helpfulness": "1/1", "author": "Bill Bardin"}, {"rating": 4.0, "review": "I originally sought Apple TV as a way to display Ipad Mini on a monitor/television using Air Play without a relatively costly hardwire connection (The Apple adapter alone is $60.)  I wanted to show videos and slide presentations loaded on the mini Ipad to a larger television screen. This gave me that capability but also is a great way to access photos and ITunes music playlists through my home network (As long ITunes is up and running on the Windows 7 PC in my home office).  Thirdly, it's a very good way to access streaming video applications such as Netflix or Hulu. The streaming capability seems to produce better sound and picture clarity than my Sony Blue Ray DVD players or PS3 with less buffering.  I hooked Apple TV through my Bose home theater system (which even had a setup expressly for Apple TV). Apple TV produces Dolby 5.1 surround sound through my Bose system quite nicely. It seems like a cost-effective way to add service to a television in that part of the house where you don't have cable or satellite television service connections.The main down side is that many of the applications do require that you have a service such as Direct TV or Xfinity somewhere in the house.  And you will need a home wireless internet network. Hulu Plus, HBO Go, and Pandora are now among many services offered by Apple TV, so there's a nice variety of applications available, some requiring subscriptions service (such as Netflix) or service from a tv provider (such as ABC, Disney, and HBO Go applications.) Regrettably, Apple TV does not offer an Amazon Prime Application.", "verified": true, "helpfulness": "1/1", "author": "L. Ganders \"Larry\""}, {"rating": 1.0, "review": "My TV does not have an HDMI connection which was required. When purchased, I did not know that the only way to connect to my TV was thru an HDMI cable.", "verified": true, "helpfulness": "0/14", "author": "Philip C. Dyer"}, {"rating": 5.0, "review": "Excellent product.  Easy to use and easy to install on a TV. .  Meets all expectations as promised in advertising.", "verified": true, "helpfulness": "0/0", "author": "DC Buyer"}, {"rating": 5.0, "review": "I have several, and use them quite a bit. I hope Apple continues to update and expand on the features of this product, but it is pretty good as-is.", "verified": true, "helpfulness": "0/0", "author": "Dave Meyer"}]