[{"rating": 5.0, "review": "As Advertised", "verified": true, "helpfulness": "0/1", "author": "Steven Tibke"}, {"rating": 4.0, "review": "I've been waiting to get this for a long time, I would have given it a 5 star, but I'm surprised that you can't AirPlay mirror fullscreen from an iPad except you jailbreak it", "verified": true, "helpfulness": "1/1", "author": "Olukunle"}, {"rating": 5.0, "review": "I also own a Chromecast and a Roku, but I think the Apple TV is my favorite streaming device.  If you have a \"Apple household\", this is probably the best solution to integrate with your iPhone, iPad, or Mac computer.  And Apple keeps adding new streaming apps to the device, so the functionality continues to expand.PROs+ Has all of the usual services: Netflix, Hulu Plus, Crackle, Watch ESPN, etc+ Want to show off your recent photos?  AirPlay makes it a cinch to put your iPhone photos up on the big screen.  AirPlay Mirroring is also useful when you want to show someone a web page, game, or app as the Apple TV can mirror (almost) anything that shows on your iPhone or iPad (unless the developer, like the Comcast streaming app, specifically denies this function)+ Slim remote makes it easy to navigate the interface (if you lose it, it's probably between the couch cushions)+ Streams your iTunes purchases (not available on other boxes)+ Plays iTunes Radio (also not available on other boxes)CONs- Some missing services: Amazon Instant Video and Pandora.  However, you can start a show/song on the iPhone and then AirPlay it to the TV.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 4.0, "review": "Second one we bought.  Pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Robert Farrell"}, {"rating": 5.0, "review": "Just what we needed!", "verified": true, "helpfulness": "0/0", "author": "Cyndia Douglas"}, {"rating": 5.0, "review": "Apple TV is I think the best option for online TV...if you travel, you can take it with you everywhere you go!", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "1/1", "author": "John S. Hopkins \"John H.\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "1/2", "author": "abenilson feitosa costa filho"}, {"rating": 4.0, "review": "Good product.", "verified": true, "helpfulness": "1/2", "author": "DaShrine65"}, {"rating": 5.0, "review": "LOVE THIS! Everyone needs Apple TV. Prompt shipping!", "verified": true, "helpfulness": "0/0", "author": "DMADDNESS"}]