[{"rating": 5.0, "review": "This is a great product and will only get better when the new OS X comes out within the next two months (Fall 2013).  OS X Mavericks will let you use Apple TV to connect wirelessly to your HDTV and use it as a 2nd (or 3rd) display for your computer.  That will be fantastic.", "verified": true, "helpfulness": "1/1", "author": "Farhan Bhatti \"Farhan\""}, {"rating": 5.0, "review": "I use it a lot for work and pleasure.  I am a minister and it is a great tool for visuals.", "verified": true, "helpfulness": "0/0", "author": "Regina Harwell"}, {"rating": 5.0, "review": "Best investment I could have made. I will never watch network TV again. Got rid of cable bill and also bought one for my parents. Picture always sharp and even works when wifi signal is compromised. So happy with this purchase, worth every cent - especially all of the ones being saved not having cable!", "verified": true, "helpfulness": "0/0", "author": "Zoila"}, {"rating": 1.0, "review": "I like that we can watch a picture slide show in our livingroom now. I like that we can listen to iTunes in our livingroom now. I like that we can watch some of our movies that are on our iTunes and nowhere else in our livingroom now. But we had to spend $20-30 on the new operating system to have it be compatable with our Mac. Then, we had to spend another $100 on Microsoft office because the version we had was outdated and not compatable with the new operating system we just got. Also, now my iPhoto has a hard time recognizing my memory card from my camera. And now Disney is no longer giving the iTunes digital download code with its DVDs so my kids won't be able to watch their Disney shows on our iPod, phones or Apple TV. The set up was extremely easy... But just not worth it, really, for us. We still have and continue to use it for what we can, but it hasn't changed our life or anything. It was a bday gift for husband and I wish I would have gotten him something else.", "verified": true, "helpfulness": "1/11", "author": "Gena"}, {"rating": 5.0, "review": "Technology is Ah...Mazing. This device is our Family go to on the weekends, or when there is nothing on T.V. A must have. Just be careful where you put the remote down at. Since it is so small & thin it can easily slide down in between cushions, or the wall.", "verified": true, "helpfulness": "0/0", "author": "StaciSmiles"}, {"rating": 5.0, "review": "This makes a hub for everything I need,and works very easy. It's great that all of my apple products can use it. I'm buying another one for my daughter.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "Many of the reviews did not mention many of the things that I was concerned about.  I was interested in a faster method of viewing Netflix.  I did my research and decided on the Apple tv.  The setup was very easy, even for someone like me with only a limited technical background.  I used a hard wire connection with cat 6 cables and a HDMI auto switch so I could hook up both the ATV and a blu ray to one one HDMI port on my TV  The increase in speed from turning on the equipment to watching a movie on Netflix was simply unbelievable.  No waiting for 20-30 seconds or more for the blu ray to load.  It was almost instantaneous and the improved navigation was wonderful.  Coupled with the simple design and Apples reputation for quality make me very glad that I chose the Apple tv.  I wanted a system that would last and not give out in a year or two.  The final reason I chose ATV was for its ability to view my pictures off of my other apple products.", "verified": true, "helpfulness": "0/0", "author": "Gdadgd"}, {"rating": 1.0, "review": "I'm sorry to be the bad guy!Tried to \"go Apple\" and ended up with sour grapes.The Family is Apple... I'm the PC Geek who finally thought we could use this for 1080 HD with Apple and Netflix... knowing Amazon Prime wouldn't work.Sure it is pretty... and sure it is a slick well thought out User Interface... If it only worked properly!Every damn time you try to use after selecting a program in HD it has the infamous \"Change your Cable Error\"... which of course is nothing to do with the cable and is an Apple equipment problem.And... I've tried everything to keep the family happy... just isn't working.[...]My take... Buy the Roku/WD/Android Products that work... dump Apple and be in the open platform world.I tried!If anyone want's mine... they can have it.", "verified": false, "helpfulness": "2/7", "author": "SWatkins \"Swatti\""}, {"rating": 5.0, "review": "Very simple device with a great user interface.  I use the mirror function with my MBP all the time to show friends and family home videos and photo's.  There is some latency with video, but I expected that.  Awesome for YouTube and Netflix streaming.  No complaints as of yet.", "verified": true, "helpfulness": "0/0", "author": "E. Travis \"etravis78\""}, {"rating": 5.0, "review": "Save a lot of money by getting rid of cable. Instead, get one of this streaming gadgets (Apple TV, Roku, etc.) to watch your favorite shows and movies on Hulu, Netflix, Redbox, etc.", "verified": true, "helpfulness": "0/0", "author": "D.L."}]