[{"rating": 5.0, "review": "Apple TV is awesome. Very easy to use. Easy setup and great user interface as with all apple products. Time for apple to give it a serious update though. It's been a pet project for way too long.", "verified": true, "helpfulness": "0/0", "author": "nloco"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/2", "author": "JC"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/2", "author": "Rob"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/2", "author": "Hussain Mahfood"}, {"rating": 1.0, "review": "Purchased the Apple TV in August, 2014.  Worked great for a couple of months, like the interface.  Not fond of the 'oversimplified' old-style ipod knockoff remote.  Then it started.  5 mins into a show, 2 minutes, 40 minutes - random times, the show would stop, as if the internet disconnected.  All other devices in the house working just fine.  Resetting works for another 30 minutes (or maybe 3).  Sometimes we get to watch a whole 40 minute show before it freezes.  Tried complete restore.  Contacted Apple several times.  They keep coming up with new tests to prove it's not the Apple - guess what...It's the Apple.  They refuse to replace it.  Don't buy it, folks, It's not worth the inflated Apple price - this one doesn't come with Apple's great service or product.  On top of that, it doesn't play Amazon Prime, and even Airplay with my ipad and iphone is intermittent.", "verified": false, "helpfulness": "5/9", "author": "RonW"}, {"rating": 5.0, "review": "Easy install, and I never think any install is easy :( Worked out of the box and offers an easy interface and lots of watching options.", "verified": true, "helpfulness": "0/0", "author": "PNWrez \"PNW\""}, {"rating": 5.0, "review": "super easy to use, and love the airplay.", "verified": true, "helpfulness": "0/0", "author": "Aldrin sangma"}, {"rating": 5.0, "review": "Love the product", "verified": true, "helpfulness": "0/0", "author": "PingPong"}, {"rating": 1.0, "review": "So I'm renting my first movie and it says it'll be 3 hours and 48 minutes. (it's not my internet speed). Very very disappointed in Apple. Should NOT take this long to rent a movie very disappointed don't buy one.", "verified": true, "helpfulness": "2/8", "author": "Rita M Baker"}, {"rating": 5.0, "review": "Gave up cable after having every channel for almost free for 7 years (worked for a cable company) I was a TV addict and thought I would miss it dearly but i don't I have my Appletv along with HULU Plus and Netflix :)", "verified": true, "helpfulness": "2/2", "author": "Michele L. Trahan \"Michele\""}]