[{"rating": 4.0, "review": "I was kind bought this item because I bought an iPad.  It's working fine so far.  But I don't use it that often.  I would not recommend it to just anyone unless you have $100 to spare.", "verified": true, "helpfulness": "0/3", "author": "Michael in Fontana"}, {"rating": 5.0, "review": "For a mere $99USD, you can have so many options--streaming on demand top movies(usually for a nominal fee), music, TV, and more, love the floating images as a screen saver. As always, Apple products surpass all others.", "verified": true, "helpfulness": "0/1", "author": "Kenneth W. Moffet"}, {"rating": 5.0, "review": "We feel this product lives up to its value.  We experience excellent results with this product.  Also, we have been a repeat buyer of this item.  Good Choice!", "verified": true, "helpfulness": "0/1", "author": "C. E. Rhodes \"Castaway007\""}, {"rating": 5.0, "review": "Perfect for watching Hulu plus, Netflix, streaming from my macbook air. It is very easy to use and set up. there is even an app for your iphone to have a remote control that helps with typing things in easier. Very satisfied and came in perfect new condition in a small box.", "verified": true, "helpfulness": "0/1", "author": "R. Howe"}, {"rating": 1.0, "review": "Awful, awful, awful!  Not what I've come to expect from Apple.  I bought this to replace my 1st generation Apple TV which had an internal hard drive that died.  Big mistake.  I gave it a noble try, but ended up returning this brick.  Since the newer Apple TV doesn't have any onboard storage, or any way to connect external storage, a computer has to be running any time you want to watch your own content (or listen to your own content without paying for an Apple cloud subscription).  \"Okay,\" I thought, \"it's the latest and greatest, and I have an old Mac mini I can leave running all the time.\"  Big mistake.  Not only was it a pain to set up, it kept losing its connection to the computer ON A HARD-WIRED, GIGABIT NETWORK!!!  Every time it would drop, I'd have to go to the computer and re-start iTunes, and point iTunes back to the photos folder I wanted to display on the Apple TV.  If that wasn't bad enough, the Apple TV has such a small photo cache that the screen saver displays the same few photos over and over.  It isn't even smart enough to go and grab a handful of different photos from the folder that iTunes is pointed to.  Instead of enjoying my media I spent all my time being an IT tech.  Not fun.  Buy a WD TV, but not this!", "verified": true, "helpfulness": "4/9", "author": "dc"}, {"rating": 5.0, "review": "I needed some way to connect my PC computer, Apple devices (iPhone and iPad), and wifi services (NetFlix etc.) to my TV. This does it all simply and well. I use the HDMI output connected through a 5.1 channel HDMI AV Receiver to the HDMI input on my TV. I get great sound and picture. I can view content from my PC, iPhone, iPad, or the internet. It all works well and is easy to set up.", "verified": true, "helpfulness": "0/1", "author": "Bert76"}, {"rating": 5.0, "review": "This is where my eyes are burned out! I have watched so many movies and the list keeps getting bigger and bigger on Netflix. I do think I will run out of movies in about a year and a half. But that's what happens when you pick off 3 or 4 movies in a day. At the very minimum one movie. Netflix is worth the money and so was the Apple TV. Although now that I know I need a new TV I'm going to buy a smart TV. Then I won't need the money for the Apple TV anymore! But until then they rock!", "verified": true, "helpfulness": "0/0", "author": "Matthew L. \"Big Daddy L\""}, {"rating": 5.0, "review": "Love it, great product. I can sync it with my iphone, iMac and iPad for games, tv, movies, music and so much more. Nuff said!", "verified": true, "helpfulness": "0/0", "author": "Ryan Anderson"}, {"rating": 5.0, "review": "The Apple TV doesn't look like much but it's an absolutely must have if you're the owner of an iOS device (iPhone, iPod, iPad). The Apple TV doesn't provide the most apps but enough to keep someone content. If you're heavily invested in iTunes this is also a must have. Apple provides constant updates with new features (recently HULU)which is second to none in support. The GUI is also great, actually the best out.For me, the best feature is AirPlay; it is rock solid. AirPlay allows you to wirelessly stream any photos, HD Videos (stunning video quality even wirelessly on my HD TV), mirroring of video games as well as YouTube and basically most things on your iOS device.Apple like many of it's devices make using the Apple TV SIMPLE and a joy. Again, it is absolutely worth the $99 for the AirPlay feature alone.", "verified": true, "helpfulness": "0/0", "author": "Eric F."}, {"rating": 5.0, "review": "I got a HDTV as a gift, and given my Apple product collection (computer, ipod, phone), this just made sense compared to the other TV streaming devices. I love being able to airplay from my phone or computer, and share my photography on my TV so easily.", "verified": true, "helpfulness": "0/0", "author": "cebulka26"}]