[{"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "leonardo"}, {"rating": 5.0, "review": "I love my Apple TV. Can't believe I waited so long to get one.", "verified": true, "helpfulness": "0/1", "author": "Anna Torres"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Luis Eduardo Villalobos Nassar"}, {"rating": 5.0, "review": "Comparing this to the Chromecast and Roku3, the AppleTV is a nice device, but more like a mix between the Chromecast and Roku. It has the easy casting that you get with the Chromecast but with any apple device, plus the apps and remote like with the Roku. The thing that sets the AppleTV apart from just being a hybrid of the two is the design and user interface. The hardware feels sturdier and more modern, especially the remote compared to the remote on the Roku. The user interface is modern, efficient, and easy to navigate.Anything you can stream on your Apple device, you can stream to your AppleTV.  Knowing Apple, they will continue to improve this device in the future with great ingenuity.", "verified": true, "helpfulness": "0/0", "author": "Steve G"}, {"rating": 1.0, "review": "Your just wasting your money if you buy this. As with any apple product these days. This, like the rest of apple, is designed to completely crash in 2-3 years. I have 4 of them and I kid you not every one of them died within 3 years. If this is something your looking at buying, purchase the fire tv or fire stick through amazon! Way better and you won't have to spend all the money on therapy after cussing out your apple product every day it decides it just doesn't want to work anymore.", "verified": false, "helpfulness": "0/5", "author": "Christopher"}, {"rating": 5.0, "review": "Very happy with this", "verified": true, "helpfulness": "0/1", "author": "PTH \"PTH\""}, {"rating": 5.0, "review": "Great product, with wonderful integration with all my other apple products.", "verified": true, "helpfulness": "0/0", "author": "Juan Lopez"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/1", "author": "tom"}, {"rating": 2.0, "review": "It's an iTunes Store-centric device, and unfortunately Apple recently seems challenged to consistently keep their store online rendering all content purchased from their store unusable when their store is having issues (which should almost never happen)...twice today purchased content from the store has been unavailable because the store cannot be accessed...we have two Apple TVs and when the content purchased at the iTunes Store is available everything is copacetic...when that content is not accessible using Apple TV is very frustrating.", "verified": false, "helpfulness": "0/0", "author": "Kurt Kroncke"}, {"rating": 5.0, "review": "I use this in my house everyday to watch and stream movies and TV shows. Great device!", "verified": true, "helpfulness": "0/1", "author": "Kyle B."}]