[{"rating": 5.0, "review": "Brings added capabilities to my TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Sweet"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Juan Jimenez"}, {"rating": 3.0, "review": "I have my (Windows) laptop connected to my television and that, along with DVDs and Blu-Rays ripped to my hard drive, make up (until now) the whole of my television viewing.  The only reason I bought this Apple TV was to take advantage of the new HBO Now service, and its limited streaming availability.  The only time I even turn this thing on, is to watch HBO.  Anything else it does, I can do from my computer.  It's not a bad product, it's just one extra piece of electronics I have to keep in order to do just one thing with it.  Would like it better if I could keep it in my living room and still use my computer to stream it independently to my bedroom, instead of deciding whether it is worth the effort to move the box from room to room.  I don't think I really want to spend another $63 for the less troublesome option of multi-room viewing.  Once HBO Now becomes a streaming service on non-Apple products (can't even watch it via iTunes, even though I have to pay for my subscription through that), this box will become obsolete for me.", "verified": true, "helpfulness": "0/0", "author": "T. Malatesta"}, {"rating": 4.0, "review": "nice product, i really like it", "verified": true, "helpfulness": "0/0", "author": "Tonyks"}, {"rating": 4.0, "review": "I have 3 Streaming Devices in the house.  1 Roku and 2 Apple TVs.  I use all three daily, the positives about the Apple TV is that it it has a clean interface, and it builds into the current apple ecosystem well.  My gripe is with its remote, it really should be bluetooth. Outside of that it works very well steaming movies whether wifi or LAN work flawlessly.", "verified": false, "helpfulness": "0/0", "author": "David B King"}, {"rating": 3.0, "review": "Roku doesn't charge for pbs show so it wins. Bought as a gift and disappointed. Blasphemy to the hardcore Apple fans I know.", "verified": true, "helpfulness": "0/0", "author": "S. Winslow"}, {"rating": 5.0, "review": "Love the apple TV!", "verified": true, "helpfulness": "0/0", "author": "Kristen Wallace"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Plugged it in - gave it my wifi password - and it works.  Now I can watch Yahoo Screen full screen!  (By the way - check out \"Other Space\" - I loved it.", "verified": true, "helpfulness": "1/1", "author": "Jim TsChudy \"Jim Tschudy, Col (Ret), USAF\""}, {"rating": 5.0, "review": "brand new and works great!", "verified": true, "helpfulness": "0/0", "author": "Tayls \"Tayls\""}]