[{"rating": 5.0, "review": "Before purchasing an Apple TV, I was using the Apple HDMI Cable to connect my iPhone/iPad to my TV.  Because I already had that cable, I wasn't sure if buying an Apple TV was going to be any improvement for me. I'm glad I took the chance.  Now I can do Airplay mirroring all wirelessly!  I can easily share photos and videos from my iPhone/iPad on my TV without needing to stand nearby for the wire.  I am a Netflix customer and another great benefit is being able to access the on demand Netflix movies right from Apple TV.  The Netflix interface is beautifully designed and easy to use.  I also like the fact that the Apple TV will automatically power down after a period of inactivity, so you can leave it plugged in all the time.  The only thing I didn't like about the Apple TV is that when you have to type something such as your Netflix login, you have to navigate an on-screen keyboard with the Apple TV remote, which is not very easy.", "verified": false, "helpfulness": "0/0", "author": "bribri87"}, {"rating": 5.0, "review": "Been debating the whole AppleTV thing for about six months now! Bought Google TV Logitech review set-top box found out I hated it!! My built-in Samsung smart TV's web browsers three times faster than Google TVs chrome browser with their Logitech review.. So I bought the Apple TV. Love it the remote is very cool wafer thin the box is nice and Compact.. First of all YouTube has zero problems buffering and streaming Unlike some of the other devices I have tried with YouTube.. including Google TV!! And the newest model has Hulu. The navigation menus are very user-friendly to navigate. Netflix YouTube and Hulu it works great. Also if u have a iPhone you can download the remote control and link it to your AppleTV so when you type you don't have to scroll using the remote to type each painstaking letter one by one.. If you already own any other type of Apple device then this is a must for you to get!! You won't be sorry!! I'm just sorry that I didn't get this thing in the first place when I considered it Months ago..", "verified": false, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 5.0, "review": "Love these little devices.  Enables me to watch Netflix on all my large screen TVs.  Also use MLB Premium to watch my favorite games.  They are easy to setup and integrate with my iTunes account via iTunes match.  All of my movies, tv shows, and music is available on any tv.Streams great using my wireless network.  Has no problem picking up my Airport Extreme throughout my 3,000 square foot house.  (I do have a airport express plugged in on one side of the house to boost the signal)All in all for what Apple calls a hobby device I could not be more pleased.", "verified": true, "helpfulness": "1/1", "author": "ILUVmyGrandKids"}, {"rating": 2.0, "review": "It was simple to setup but it is a major downgrade from the first generation.I am over the lack of local storage (no HDD). I setup a mac mini as a media server for my home. But, it is still cumbersome to use with streaming data on a home network. It wants to force you into using iCloud and a paid Match service instead of using the content I have right there. Yes, you can go through 5 menu selections to get to your local content but that makes most of the front screen menu buttons just clutter unless you are committed to streaming everything from Apple.The organization of content is just bad. Every season of television shows gets its own listing instead of every show; that makes the listing way too long. Does the streaming TV shows have any real organization and why does it not show all of my old purchases?Furthermore, I am not sure if it will update my media server automatically like the first generation did. Can you even buy music/music videos on this??I repaired my first generation Apple TV and turned off all syncing. Now my system makes sense; it is simple, efficient and keeps my server updated without extra work on my end. I am sad to lose the video upgrades though. But, I do get analogue audio outputs for my stereo.If you have (almost) no content, do not care to use it for music purchases, want to stream everything over the web, it may not be a bad choice if you have never used the first gen. I just have trouble seeing how it could be a good choice for anyone. See if you can get a first generation.Update: I kept this and software upgrades have improved it. Also, I have become more comfortable with streaming everything. I still do not like that I have to pay to listen to music I already paid for. Also, the menus really should be in alphabetical order.", "verified": false, "helpfulness": "2/6", "author": "Robert"}, {"rating": 3.0, "review": "bought this last year, thought it was great, had netflix, youtube, vimeo...just updated it today, no more youtube or vimeo.well, going to get something else now.really, Apple? can't have competition?so much for that.", "verified": false, "helpfulness": "0/7", "author": "corpen1142"}, {"rating": 1.0, "review": "Pretty useless. Cannot view much on tv from iPad. Wish I had brought a Samsung blue ray which provides more options in terms of wireless experience", "verified": true, "helpfulness": "1/12", "author": "Sridhar Kanuri"}, {"rating": 5.0, "review": "I purchased Apple TV so I could stream live video from my computer to my TV. It is easy to set up and it works as advertised. I can now see player numbers on the big screen so I can see who is doing what.", "verified": true, "helpfulness": "0/0", "author": "Tom Singer"}, {"rating": 4.0, "review": "To start with, yes I am a little bit of a techy. Have Cablevision along with Sat TV subscription so why would I want to have not just one Apple TV but 7 you may ask?Quite simple.... If you own either an Apple iPhone 3G 8GB - Unlocked,Apple iPod touch 32GB Black (4th Generation) CURRENT MODEL or Apple iPad MC705LL/A (16GB, Wi-Fi, Black) NEWEST MODEL, the AppleTV goes together like peanut butter and jam! Even if you use the most basic feature of air play in order to play photo's or video's from your iphone or ipad through the Apple TV and bam! onto your 55 inch TV (in my case) or you get a little more creative with your Apple Mac Mini MC815LL/A Desktop (NEWEST VERSION) or Apple MacBook Air MD231LL/A 13.3-Inch Laptop (NEWEST VERSION) and setup your Apple TV to work with your iTunes music so that anywhere you have a TV in your home you can basically have your music library.Then you have to add the fact that if you are a NetFlix subscriber (USA or Canada) that is another reason for an Apple TV.If you want to watch or listen to your favorite video or audio podcast, presto Apple TV delivers again (sometimes drives my poor wife nuts with me watching technology reviews - but hey each to there own)!Hands down, for the small cost of the Apple TV, this mainly PC guy loves the bang for the buck that the Apple TV delivers.Okay, so why do I say almost perfect? Well the only issue that I have is that putting the Apple TV to sleep is not a simple one button or timed task and well sometimes very rarely the Apple TV remote does not response as quickly as preferred.", "verified": true, "helpfulness": "0/1", "author": "Andre Choquette \"BorderBuyer\""}, {"rating": 5.0, "review": "I got my apple tv for about a month now and I have no problem on using it, it is amazing. Its easy to use, its not big, its fits in any place and you can take it on your bag.I highly recommended this product if you are a apple lover and you like your devices connected on the tv.", "verified": true, "helpfulness": "0/0", "author": "W. Seifert \"Cristina A.\""}, {"rating": 2.0, "review": "* My main complaint is that it crashes and reboots itself a lot.  I thought that Apple products should not be such poor quality so I exchanged the first one for a new unit - but it has all the same problems.  I keep checking for software updates hoping they will fix some of the problems.Other issues include:* While streaming music from my Macbook air it will just stop playing sometimes.* While playing netflix movies the playback pauses often.  I don't have this issue with any of the other devices I use to stream netflix.* There is no volume control.  So I have to use two remotes to watch a movie.  Why?* The remote does not have good range and you have to point the remote directly at the front of the box or it will not work.* From my macbook air I can only airplay from itunes, not from any other app.  For example, using a web browser to access youtube.  The apple tv has a youtube app but it takes forever to type in a search one letter at a time so it is almost unusable.I could go on for a while longer but listing all the problems is making me tired.----UPDATE - Nov 2012----Apple released a new software update for the AppleTV recently and that solved almost all of the issues I was having. I also updated my macbook to the latest MacOS version. Everything works pretty good now!", "verified": false, "helpfulness": "1/4", "author": "Blade Doyle"}]