[{"rating": 4.0, "review": "I like the interface much better than Roku's. Much easier and more enjoyable to use. A little disappointed in that it does not have newer first run movies. I am hoping Apple comes with something more affordable, easier to use and better than FIOS or Comcast.", "verified": true, "helpfulness": "0/0", "author": "J. Dodge"}, {"rating": 4.0, "review": "Makes it nice to watch movies and videos from the ipad. A little quirky though and sometimes videos don't work depending on the app. Other than that it works well. I believe it is overpriced for what yo get though. I don't use all the crap that came loaded on it either. It seems to me that all that crap is just another way they try to make money off of you.", "verified": true, "helpfulness": "0/0", "author": "DM"}, {"rating": 3.0, "review": "This was great while it lasted. The best quality internet video device you can get. Netflix, Youtube, AirPlay, iPad mirroring, etc were just excellent. Remote is sleek and effective. The device can be operated via an app on your smartphone.Als, it broke down after less than 2 months. The wifi connectivity suddenly stopped working. Apple support on the phone was a bit annoying for the first time ever when they kept asking me to move the device around in a futile attempt to revive it. I could not return to Amazon as it was past 30 days and you get only a partial refund. Apple forums are full of posts from users who got replacements from Apple but saw the same problem again. So I am going to get a refund form my credit card company. Apple will surely replace it but the device has a design defect.", "verified": true, "helpfulness": "1/2", "author": "Asr \"ASR\""}, {"rating": 5.0, "review": "Gets the TV signal from MacAir router to the TV perfectly, great product.As an aside, I tried twice to purchase this product from the Apple web site but even eith a phone call was unsuccessful. Purchased it on Amazon with no hassle and at a slightly better price. I'm sure that doesn't surprise any Amazon shoppers.", "verified": true, "helpfulness": "2/2", "author": "D. Stinnett \"Blu-Ray Kid\""}, {"rating": 5.0, "review": "We use this for Netflix and Hulu Plus.  We signed up for these through the Apple TV and after the free trials are over they will bill to our iTunes account.  We can turn the subscription on and off through iTunes.  Theinterface for Netflix and Hulu Plus is similar.  It looks like services like this work the same with the Apple TV vs. having apps that have completely different interfaces.  Youtube works well and the radio is nice also.  It's excellent.  The interface is really clean.  Setup is dead simple.  It seamlessly integrates other Apple devices.It also integrates with our iPads and iPhones.  Having it work with other Apple devices is surprisingly useful.  We airplay from these devices to the TV all the time.  We use this for Pandora, video clips that we come across from web pages, etc.  It's nice to put those up on the TV to show the family.  You can mirror screens as well.I have to say that it's cool to start watching something on the iPad (e.g. a Netflix documentary) and then resume on the Apple TV later on.  I do this all the time.  I start watching something on the iPad, maybe while the kids are using the TV.  Then when they're done I resume on the TV.  That's more of a Netflix thing than an Apple TV feature but obviously it all works together nicely and I want to mention it for those who are considering this kind of setup.We use the remote app to control the Apple TV and that works really well.  Also, the screen saver for the TV will pull from your photo stream so when we take a picture it immediately shows up on the TV's screen saver and photo stream,  Having access to everything you buy with iTunes is very nice.The remote that Apple provides is not bad.  I've seen reviews that complain about it.  It's small, yes.  But it's very functional and we make sure to put it on the coffee table or an end table when we aren't using it so that it doesn't get lost.  It doesn't allow you to control the sound on the television.  That would be a nice feature to add.Like any Apple device it automatically updates its software periodically when new versions are available.  It's very user friendly.Lastly, we used this setup plus a Winegard FreeVision TV antenna to eliminate cable TV.  We're *very* pleased.  My wife was a skeptic and pleaded to drop the idea.  I kept cable while we tried this and then I let her decide.  Our deal is that she can allocate the savings from cable to something else that we need (for the kids or the house).  She loves the new setup now that she's tried it.  The kids absolutely love it and thanked me for getting them Apple TV.  It's really about the entire system but they like how Apple TV organizes kids shows by character.  They flip through and then find new shows to watch.Buy it.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Okay, my initial plan was to save up and just buy a mac mini and hook up an external hard drive to play all my iTunes library, but that's going to take a while, and in the meantime, I had 4TB of iTunes videos (sad, I know) that had no way to get to my TV...so I picked this up. (Thank you, refund fairy!)It was a nice surprise that it didn't make me authorize it, since I've maxed out the number of devices I can authorize, and I didn't know who was going to get cut from the lineup (again, weep for me and my troubles!) and that made life nice.The downside was that the apple remote was operating my laptop and the apple TV at the same time, so while I got it on the network I think I watch/paused about five movies on my computer.I had to turn the home sharing feature off, then on again on my laptop to get the streaming effect going (not airplay, I think my computer is too old for that to work without airparrots assistance, but I hooked this up yesterday so haven't tried too hard yet) and then later when I went to change videos I had to do the same thing. Minor issue for me, but if you're operating a desktop in another room you might be led into temptation to use bad words after that goes on for a while. Also if the computer you're streaming from goes to sleep, that may or may not affect whether the movie continues (I just muted a really long music playlist)So I love this thing, but I also have months of iTunes exclusive video to play with...if you primarily watch other kinds of videos, I don't know that this will bring you nearly the skeeky joy it brought me. Best of luck though!Also I used a mediabridge HDMI 3D quality cable, and the picture is gorgeous, even the SD stuff I tried.", "verified": true, "helpfulness": "0/0", "author": "SteamedFrog Shopping"}, {"rating": 5.0, "review": "Easy to hook up and navigate and great picture. I would recomend this product. I'm adding more words because I have to.", "verified": true, "helpfulness": "0/0", "author": "kjk"}, {"rating": 5.0, "review": "looking for something with an easy set-up and can instantly forward videos and music from my iphone.  This does exactly what I wanted.  I have on in the living room as well as bedroom when I want to watch movies that are on the computer.For the living room you can use this one trick.....I hooked the apple TV up to the stereo reciver via the optical audio cord.  Now, I only have to turn on the receiver and forward music from my phone to get the sound.  I can leave the tv off (like when going through hdmi) because the apple TV will  start playing what I do on my phone instantly.  HDMI can also be hooked up to make it a dual output device.", "verified": true, "helpfulness": "0/0", "author": "DP \"DP\""}, {"rating": 3.0, "review": "I bought this in order to connect my ipad to projectors/TVs for presentations.  For this purpose the product HAS limitations.  I have relegated it to being used mainly for streaming netflix and hulu+.  If you are simply looking for a device to stream your media to your television...this is fabulous and I would give it 5 stars; however, I was expecting more in the marriage of AppleTV and my iPad.PROS:Great HD quality when using the HDMI connection.Can mirror my iPad to display photos at gatheringsExcellent alternative to cable/satellite (when subscribed to netflix and hulu+)The unit is small and mighty (easy to transport)CONS:-I am a public speaker and use the SlideShark app often to present my powerpoints from an iPad.  For this product to work, you have to have an internet connection.  Not all of my venues do.-I have to work around the limitations of projectors (until I purchase my own) that do not yet have HDMI input.  There are converters from HDMI to VGA yet that only carries video signals the only audio output is optical and most portable speaker systems are not set to receive optical audio signals.IF I were able to mirror my iPad WITHOUT internet (via bluetooth) I would give this 4 or 5 stars, but this was a great disappointment that prohibited me from using it for my primary intentions.", "verified": true, "helpfulness": "0/0", "author": "black sheep hunter"}, {"rating": 1.0, "review": "I bought this thing on base and it work just fine for the first five updates.  After that I have been emailing apple about the performance of this device.  I've been ripped off a couple of times trying to download a movie.  It will charge you but,  then movie will try to load and not play.  Apple has reimbursed me on the latest attempt, but this happens about every four to five downloads.There's also the update my system sign!  Guess what?!?  Will not update!!! Endless attempts but no success! \"The update was not successful!\" I don't know how much time and energy I've wasted trying to get this thing to work.  I have many Apple products and because of this is one device I'm willing to end my association with Apple forever.Sometimes, I have to unplug my device and restart it a few times just to get a movie to play.  I average about five attempts per movie when it is acting up!  Endless Frustration!!!", "verified": false, "helpfulness": "1/5", "author": "Bruce C. Smith"}]