[{"rating": 5.0, "review": "Best thing since TV!!HD movies, download entire TV series. I will never go to another movie theater again. This is perfect for a big HD screen in a home theater.", "verified": true, "helpfulness": "0/0", "author": "Howard Crow"}, {"rating": 5.0, "review": "Why didn't I buy this sooner.  Easy to hook up - love the music, photo and movie aspects.  Plus being able to watch Netflixs on the large screen TV on the sofa instead of the laptop.", "verified": true, "helpfulness": "0/0", "author": "J. C."}, {"rating": 5.0, "review": "The Apple TV has actually replaced a cable subscription for me.  I only watch a few shows, and I can grab these easily either through the iTunes store, Netflix, or Hulu.  This saves a ton of money versus a complete cable subscription, plus all of the content is available on demand, so there's no need to remember to DVR-record anything.  You can also generally avoid commercials, or at least limit them (in the case of Hulu).I also use the Apple TV to stream music through iTunes which is great day to day but also for parties.  The album artwork shows up on the screen which is a nice addition.This is a product that I use every day and would recommend highly to any of my friends.", "verified": true, "helpfulness": "0/0", "author": "Ben Beltzer"}, {"rating": 5.0, "review": "Apple just hit the nail with this device. Its so easy to setup, use, play and enjoy all the content right on your TV", "verified": true, "helpfulness": "0/0", "author": "Andrey Bolaños Sandoval"}, {"rating": 5.0, "review": "I am a huge fan of Apple.  And the Apple TV is just like their other products.  They just work.  I mostly use it for my Netflex account and to watch Youtube.  I would love to be able to get a bluetooth connection with my keyboard so I wouldn't have to peck through all the letters to find things when I'm searching but think on the future upgrade that will happen.  Overall a very neat simple product that just works.", "verified": true, "helpfulness": "0/0", "author": "H. High"}, {"rating": 5.0, "review": "I bought this to act as my Netflix and MLB.tv player. Xbox Live became too expensive to maintain, and not worth the price even if it were cheaper, given that I probably play video games less than ten times a year. The Xbox's network adapter (I have an older one) is pretty subpar as well.Enter Apple TV, the golden child of streaming devices. It's simple, clean of cumbersome wires and remote buttons, and fast. The network adapter inside is receptive enough to stream with few pauses or buffers. You get bouts of that stuff occasionally, but such is the nature of wireless networks. The menu is very comprehensive, and offers many features. The Netflix app is great, and you can stream music and videos directly from any other Apple product. If you're watching a video on your iPhone, or iPad, you may throw that puppy up on the TV and watch there instead.I do wish that you could download apps onto the menu. Also, be careful with the remote. Dropping it once, or banging it onto anything, can scratch or ding it very easily.", "verified": true, "helpfulness": "1/2", "author": "Lars Tarsim"}, {"rating": 5.0, "review": "Ok, I bought into the Apple infrastructure.  I and my wife have iPhones, iPads and Macbooks.  This is the ideal supplement to these products.  It installs easily and operates seamlessly.", "verified": true, "helpfulness": "0/0", "author": "David Snook"}, {"rating": 1.0, "review": "this order does not match that one on the web, beside it will come without remote, that means you can't use it.", "verified": true, "helpfulness": "0/5", "author": "HD"}, {"rating": 5.0, "review": "We all love it!  My husband and I and our 17-year-old son!  The selection of movies is a weekly event and we love the TV series available on Netflix! We gave up cable and THIS is our TV now!!!", "verified": true, "helpfulness": "0/0", "author": "AZhikergirl"}, {"rating": 5.0, "review": "I use my Apple TV for everything. You can watch Hulu and Netflix on it, which I love because that is so convenient.", "verified": true, "helpfulness": "0/0", "author": "Samantha Maddock"}]