[{"rating": 5.0, "review": "Have used ours everyday for the year we've had it. If you have any Apple products, the AirPlay integration should push this product ahead of the competition. If you don't own Apple products, then it may be more of a toss up. Ours is probably 50% a Netflix player. If you use Amazon Instant Video, that iOS app streams pretty seamlessly to this little box. Apple auto-updates the OS regularly. That may not be the case with other boxes.Two notes:* HDMI & Optical audio only. If you don't have a modern HDTV, this box won't work.* the (young) kids **love** the PhotoStream screensaver. It's insanely easy to set up a special PhotoStream from all your family iOS devices to feed the screen saver daily. Then when ever you snap a pic, a few taps from anywhere and when you get home, the photo's already mixed in.", "verified": false, "helpfulness": "0/0", "author": "bwc"}, {"rating": 5.0, "review": "We had NeoTV box before and the Apple TV's interface is soooo much better. We also enjoy being able to share photos and video directly from our iPhone and iPad through the Apple Share capability.", "verified": true, "helpfulness": "0/0", "author": "Uptown Girl \"A Reader\""}, {"rating": 5.0, "review": "Works perfectly. No problems at all.", "verified": true, "helpfulness": "0/0", "author": "cclay"}, {"rating": 5.0, "review": "i love my apple tvs.I now have 3 of them.", "verified": false, "helpfulness": "0/0", "author": "Karen eddinger"}, {"rating": 5.0, "review": "All the usual intuitive and simple design we Apple lovers have come to expect. The remote has just a few buttons, but it's very complete and easy to understand. Just wish it had a graphic EQ like iTunes OSX has...", "verified": true, "helpfulness": "0/0", "author": "pixel eyes"}, {"rating": 5.0, "review": "We live in China, and are able to stream anything from our computer to our TV, so it is great!!", "verified": true, "helpfulness": "0/0", "author": "Travis A Biasca"}, {"rating": 4.0, "review": "I have a apple tv that is a few years old and it works like new, but outputs only 720p HD which looks great on my 42 inch Vizio flatscreen TV.  It does everything very well, and it mirrors well from my Apple tablets and phones.  I took a star off the rating because it does not support Amazon streaming. Also, most of the channels it gets are useless unless you subscribe to each one. This is true also for Roku and other TV streaming boxes.", "verified": false, "helpfulness": "0/0", "author": "F. D. Thomas"}, {"rating": 5.0, "review": "I got this Apple TV at my local Target. The Apple TV is a great purchase for a household that uses all iPads and iPhones. We are able to stream anything and mirror our iPads and iPhones. This is great for watching movies that you have on an iPad, looking at vacation photos that you took on your phone, or even using the built in apps.", "verified": false, "helpfulness": "0/0", "author": "SahilTheGreat"}, {"rating": 5.0, "review": "LOVE APPLE PRODUCTS", "verified": true, "helpfulness": "0/0", "author": "Karen Billington"}, {"rating": 2.0, "review": "I'm tired of having to reactivate abc shows.  Every couple of weeks I have to go online to reactivate my account to watch shows that come from ABC.  An the activation process from ABC doesn't work half the time.  It may not be Apples fault but it makes me hate my Apple TV to have to go through all these hoops.  There is nothing much of a selection unless you subscribe to premimum cable, hulu plus, or netflix.", "verified": false, "helpfulness": "0/1", "author": "Gribbly Snard"}]