[{"rating": 5.0, "review": "Using it at our office to display presentations from our computers directly onto large screen TV.  Also use it for access to Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Richard P. Sarine"}, {"rating": 2.0, "review": "I  had great hopes for Apple TV but no such luck. To start off if you want to use the remote you hands better be the size of ten year old, so useless for me. This by itself makes the device unusable, but there are other problems, I have wireless extender so I can get a signal in my back yard. Well at some points in my house you get both signals, if your Iphone is not on the same network the Apple TV, you are out of luck. You have to stop and change to the same network. So do buy if you have mulitple networks in your house. The media choices are pretty limited, so unless you plan on spending a lot of money at the Itunes store you are out of luck.All I wanted was a device that would project my Iphone to my TV. I think I will just hook up a PC and get a wireless keyboard and mouse.", "verified": true, "helpfulness": "0/2", "author": "Burton Martin"}, {"rating": 5.0, "review": "I love watching Youtube.com on my AppleTv. Great quality as ALL Apple products are! Highly recommend this product. You'll love it!", "verified": true, "helpfulness": "0/0", "author": "LaCroixEnterprise"}, {"rating": 4.0, "review": "Little problem with selection language, but once that was fixed it works great every time.i recommend to every one who doesn't want to spend $2000 on a smart TV.", "verified": true, "helpfulness": "0/0", "author": "dmasu"}, {"rating": 5.0, "review": "A small, simple (we old folks like simple), easy to use device that greatly enhances the utility of our TV.We are great fans of PBS, and Netflix subscribers.  Having the ability to access both thru our TV is very convenient, instead of trying to watch content on our iPads or sit in front of the computer.  We are not constrained to watch only what PBS is showing at the moment; we can watch the current programming at our convenience and access programs that we have missed.  I also like the ability to access my iTunes music library and play music thru the TV.  No doubt there are other features that I haven't discovered yet.I combined the Apple TV with a 5-port HDMI switch to simplify the setup and allow multiple devices to be played thru the TV without the need to change cables due the limited number of HDMI ports. The combination has greatly enhanced the simplicity of operation and our enjoyment of our entertainment system.", "verified": true, "helpfulness": "1/1", "author": "Old Cyclist"}, {"rating": 5.0, "review": "No problems, works well with my devices. No scratches or signs of use on the device so all and all I'm very okeased", "verified": true, "helpfulness": "0/0", "author": "Shawn Shell"}, {"rating": 5.0, "review": "Awesome. Very simple to set up. Makes using my LCD TV easier than using the interface cable. Wifi connection is great", "verified": true, "helpfulness": "0/1", "author": "Mike"}, {"rating": 5.0, "review": "I am really am enjoying Apple TV....with other apple devices such as iPad and iPhone....streaming music, pics and movies from my iTunes account works great!", "verified": true, "helpfulness": "0/0", "author": "Leon D. Reed"}, {"rating": 5.0, "review": "The Apple TV is great. You can use it for netflix, hulu, hbo go, etc... You can use your iphone or ipad to control it. The air play feature is my favorite. With airplay i can wireless display anything on my iphone, ipad, or MacBook Pro. I stream movies and videos to my 50\" tv with no problems.Other great features:ITunes RadioRent or buy movies right on the deviceCons:The only thing i wish would be possible on this model... Jailbreak!!!To allow for even more customization and applications.", "verified": false, "helpfulness": "0/1", "author": "J. Flores"}, {"rating": 5.0, "review": "Wow!  This is great; just what I wanted.  Now I can see all the movies and TV shows I purchased on my iTunes account on my TV and do not have to look at them on the computer any longer where it isn't so comfortable.  Easy to install even for a non-tech old lady.", "verified": true, "helpfulness": "0/0", "author": "M. James \"Crow Passion\""}]