[{"rating": 5.0, "review": "This is my 3rd Apple TV as a gift.  It's an awesome system, especially if you want to use air play from other devices and play them on your tv.  Can't recommend more highly.  Buy IT.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "I have two of these because I liked the first one I got another one for my wives TV. I like it more now since I can play Amzon videos.", "verified": true, "helpfulness": "0/0", "author": "Birger M. Lerdal"}, {"rating": 2.0, "review": "I'm an apple fan and really wanted to like this product. I gave it six months before I finally got fed up with the limitations. I wouldn't recommend this to anyone when there are so many capable and more economical products out there. Look elsewhere.", "verified": false, "helpfulness": "0/2", "author": "johnnydex"}, {"rating": 1.0, "review": "Not a tech person at all. But from what I had read in news articles, Apple TV was supposed to be a kind of substitute for cable TV for people who need TV but not that much. So when I got Apple TV for  a gift I was very excited to say the least.  I have been messing around with my Apple tv but I don't really understand what Apple TV is. You can get Netflix but you have to pay for it. I can get netflix through my DVD player or go to red box, so why get Apple tv. It has an HBO app, but you need to be paying for HBO to use it, and I can access the same stuff it offers through ONDEMAND with my cable provider. Again, I dont need AppleTV to get what it offers. It has Youtube, again, I don't need appletv to watch youtube videos. It offers shows, which again you have to pay for and I can get from my cable provider, usually for free. It has ESPN, again I don't need APPLETV to watch ESPN.I am sure for tech people, they can sync their ipad and their macs with Apple TV and do wonderful things, but for me, I don't  see what it offers really. Netflix and youtube videos?I am still totally searching for the point of having AppleTV.", "verified": false, "helpfulness": "0/15", "author": "History Buff"}, {"rating": 5.0, "review": "Very Easy to set up and connected to wireless effortlessly.Graphics are impressive and the Airplay feature through other apple devices works very well.", "verified": true, "helpfulness": "0/0", "author": "A. Minasyan \"Blackjack\""}, {"rating": 1.0, "review": "I have purchased an AppleTV sw ver 6.0.  It works well with my HP system (Win7) with Itunes.  I does not work with either of my 4s iphones  or my Ipad(3)  It will mirror both screens but refuses to connect with home share.Will be returning this to Amazon.", "verified": true, "helpfulness": "0/5", "author": "Elect. Eng."}, {"rating": 1.0, "review": "If you look up the model #, it was placed under the US Amazon website when it should have been listed on the Amazon UK site.  New from the UK site is 129 pounds so i guess that is a discount.  Not sure if the UK model can be used in US, but make sure you know what you are getting before you buy this.  The US model 3rd generation (newest) is listed for $84 now, so not too difficult to figure out which one to buy.", "verified": false, "helpfulness": "10/18", "author": "Amy"}, {"rating": 5.0, "review": "Something as small as an Apple TV can transform a regular television into a gateway for all your Apple media, You Tube, NetFlix and more. I use it so that I did not have to order another expensive DVR from the cable company... The interface it the highlight of this device though using the tiny remote can be a pain for large handed people.", "verified": true, "helpfulness": "0/0", "author": "Andrew A. Hughes \"Masqueman\""}, {"rating": 5.0, "review": "Bought one for my living room and it's the greatest thing ever. It hooks up to my iPhone iPad iPod and my Mac just fine. Love my apple products", "verified": true, "helpfulness": "1/1", "author": "Jonathan"}, {"rating": 1.0, "review": "I have been gifted two of these things and still think it is pretty useless.An inexpensive BluRay player does more for the same or less cost.Apple has a lot of hits, but this is a bust.", "verified": false, "helpfulness": "1/5", "author": "Alan Fetzer"}]