[{"rating": 4.0, "review": "Great product, but it can be difficult/trying at times to connect it to your iphone via Airplay.  YOu have to always turn off airplay, then turn it back on again on the apple tv", "verified": true, "helpfulness": "1/1", "author": "Robert P De Lara"}, {"rating": 5.0, "review": "Adding Apple TV to our own changed everything the same way adding a TIVO back in the day did.  I love having my movies and tv shoes at my finger tips. I have a child and having his movies all there without having to fumble with finding, keeping track of, or changing DVDs is really great", "verified": true, "helpfulness": "2/2", "author": "Jennifer Cagide"}, {"rating": 5.0, "review": "Hello Apple TV. Goodbye cable. We're saying money every month and enjoy tv more. We bought a hd antenna so we could watch basic channels. Between hulu and Netflix were set. I wish they would add more options for the news.", "verified": true, "helpfulness": "1/1", "author": "outlaw323"}, {"rating": 5.0, "review": "I have bought into the Apple eco-system and so decided to go with the Apple TV instead of a Roku 3. I actually did have a Roku 3, but realized quickly that I was really only going to use it for Netflix, and not much more. While the Apple TV allowed for more flexibility within our household. Two iPhones, two iPads, and regular use of iTunes for media management. Plus, Comcast supports the HBO Go app on Apple TV, while they don't (as of this writing) support it on Roku. We use the Apple TV for Netflix, HBO Go, and iTunes media access. I have a hard wire internet connection which provides buffer free viewing of HD content through those services.The design is dead simple, all the way down to the box it came in. I was honestly really impressed with the simplicity of the box/packaging design. And that was before I even plugged the unit in. Once I did that, I continued to be pleased with my decision. It just works. There is some authentication/signing in for the various apps, but once that's done, the device just works and works well. I do recommend making use of the Remote app for iOS during setup. Entering usernames and passwords is much nicer on the keyboard on the iOS device instead of the onscreen keyboard.I honestly don't have any complaints about this device. I even love the remote. It is sleek, simple, and easy to work with.", "verified": false, "helpfulness": "1/1", "author": "IT-Jon"}, {"rating": 5.0, "review": "It has exceeded our expectations. Easy to set-up and use. Good value for the price and gives us a lot of choice.", "verified": true, "helpfulness": "1/1", "author": "teresa morrow"}, {"rating": 3.0, "review": "Amazon does so many things well so I was surprised that they sold a product which has so many widgets minus Amazon Prime.  Netflix works great but Amazon Prime is my other mode of watching tv.  If someone tells you that you can watch Amazon Prime by airplay through later generation iphones and ipads, well I tried this and the picture was grainy and the connection kept getting lost.  When Apple adds Prime, my rating will be upped to 4 or 5 stars.  In the meantime, I hope that many of you put some  pressure on Apple.  Think of it like this:  What would Apple be saying to Microsoft and what would be saying, as well, if itunes was not on Windows computers?", "verified": true, "helpfulness": "3/4", "author": "J. Rubin"}, {"rating": 5.0, "review": "I've had an Apple TV since gen 1, and just upgraded from the generation 2 device, so the first comment is:1080p is -so- worth it. I didn't think I would notice as much difference as I do, and the 1080P programming on iTunes is just gorgeous. I'm re-watching things like the scenes in Breaking Bad with those gorgeous New Mexico landscapes and the detail and picture quality is wonderful. I'm on an old Sony HDTV, which is 1080P, although only 60 hz, so I expect the picture quality may be even better on newer TVs. So, a big thumbs up for the 1080p picture and ITMS programming content.The other big plus with this device, is that if you are in the Apple ecosystem, everything just works. iPhones and Macs can copy their screen content to this gadget with a single click. Simply wonderful. Last summer I used my iPhone and the previous Apple TV to watch the Tour de France using the NBC iPhone app and streaming it to the Apple TV. For $15, I got commercial free, near-HD quality live from the Tour. It was the best TdF coverage I've ever watched and a bargain.Apple has added many services to ATV: PBS, Hulu, Smithsonian, etc, but you don't get all the choices of something like a Roku. However, between Netflix, iTunes, PBS, Smithsonian, Comedy Central I have more programming than I can watch, and it's quality stuff, not the BS of 300+ cable channels that I never look at.ATV let me cut the cable cord years ago, and I've never missed it.", "verified": false, "helpfulness": "1/1", "author": "Charles E. Bouldin \"Macs\""}, {"rating": 5.0, "review": "It is great and we use it a lot.  What a great tool to watch tv shows!  Very easy to use also.", "verified": true, "helpfulness": "1/1", "author": "Scott D. Vignassi"}, {"rating": 5.0, "review": "Very easy to install, but I have the apple I-pad mini Wi-Fi and had no problems.Apple is a great tech advancement over Google.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "It's so easy to watch purchased videos, to rent new videos, browse YouTube, or even any of the videos on my home computers. When I find something I like on my iPad or iPhone, I can send it to the Apple TV effortlessly, and enjoy it on the big screen. I've also enjoyed using iTunes Match with this, so my entire music collection is also accessible at any time through any of my devices, including the Apple TV.The device also supports a number of video services, such as Netflix, Hulu, Crackle, HBO Go, ABC/Disney channels, Crunchyroll, and other upload choices like Vimeo. It doesn't support Amazon Prime Streaming Video.Though I use the USA Apple Store, I'm living in Japan, some of these other services do not allow access because my physical IP address is outside the USA, however all the content in the iTunes Store works fine.", "verified": true, "helpfulness": "1/1", "author": "Bwana"}]