[{"rating": 5.0, "review": "Has functioned flawlessly", "verified": true, "helpfulness": "0/1", "author": "Jose Rosado"}, {"rating": 5.0, "review": "if it had sling tv it would be my favorite streaming box, still a great buy and air stream is awesome", "verified": true, "helpfulness": "0/1", "author": "Eric Quick"}, {"rating": 5.0, "review": "It was a gift for my mom for mother's day. And she loves it!", "verified": true, "helpfulness": "0/1", "author": "Kimmy1"}, {"rating": 5.0, "review": "Love it. If you like the Apple eco system, this is the only way to go.", "verified": true, "helpfulness": "0/0", "author": "tumbleweed"}, {"rating": 5.0, "review": "great price; works like a charm!", "verified": true, "helpfulness": "0/1", "author": "mikelly321"}, {"rating": 5.0, "review": "This is a great thing to have!", "verified": true, "helpfulness": "0/1", "author": "Rebecca Presley"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/1", "author": "Sarah"}, {"rating": 5.0, "review": "Excelente producto", "verified": true, "helpfulness": "0/1", "author": "david"}, {"rating": 4.0, "review": "I had some connectivity issues with my router's settings (default settings which have worked for years for all other devices on my network), but once that was resolved, it worked as it should.  AirPlay is great and it sends audio out both the HDMI and Optical cable simultaneously so we can listen to music with the TV off (HDMI audio only plays if TV is on).  It plays Netflix in full HD and looks amazing.  Love my Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Jason Boggs"}, {"rating": 5.0, "review": "An amazing device. We use it all the time to display our pictures and play music.  I travel alot and set up my router and apple tiv, hook it up to the hotel TV rather than having my girlfriend's (wife) picture on the night stand I can hundres of images of her on the TV. Also can rent great first run movies and play all of your music from your I tunes account plus there is free I Tunes radio for free music.", "verified": true, "helpfulness": "0/1", "author": "gypsyflyboy"}]