[{"rating": 5.0, "review": "Lots of great features, but probably the two that are most fantastic:- getting to see the thousands of digital pics streamed from my PC on a regular basis, family is regularly mesmerized- getting to easily stream itunes music to the living room, finally all digital music available around the houseThen the perhaps more commonly thought of access to iTunes movies and Netflix is just great. Love not paying cable company more and this product has brought me to the edge of canceling video cable.", "verified": true, "helpfulness": "1/1", "author": "LPDDS"}, {"rating": 5.0, "review": "This is a great gadget.  Love all the features.  Not one problem with it! Love being able to access Netflix and all the music.", "verified": true, "helpfulness": "1/1", "author": "D. Vina"}, {"rating": 5.0, "review": "A must for anyone who uses iTunes. Easy to use, very convenient for media streaming. You won't regret it. Promise.", "verified": false, "helpfulness": "1/1", "author": "James Wood"}, {"rating": 5.0, "review": "I really like this product. never had one , i think i will by one for each tv in home", "verified": true, "helpfulness": "1/1", "author": "sebastian alvarez"}, {"rating": 5.0, "review": "I recently purchased the Apple TV and absolutely love it. We do no have cable but I am able to play TV shows on the TV for my kids to watch  from my ipad, while I'm still surfing the net, which I think is a great feature. I would highly recommend this product to anyone with apple products.", "verified": false, "helpfulness": "1/1", "author": "Nakeidra"}, {"rating": 5.0, "review": "Ordered this for a Christmas present, it arrived in a few days, great product, great price & I didn't have to deal with the crowds in the stores!  How can I complain?", "verified": true, "helpfulness": "0/0", "author": "Cheri Camp"}, {"rating": 5.0, "review": "We have the Roku and the Apple TV. At first it took a little figuring out because the products are different but I love the apple tv a lot more. Very easy to use. Haven't had a problem so far. The guy who did a lengthy comparison of the two is spot on and he convinced me to buy this product and I'm not upset that I did. Very pleased.", "verified": true, "helpfulness": "0/0", "author": "xoxmbixox"}, {"rating": 5.0, "review": "Streaming movies/music is smooth with absolutely no interuptions. In the past I used my Samsung B-ray player to stream movies and it was very frustrating as the movie would pause, stream and restart playing again. My Apple TV-3 is sitting next to my Blue Ray player in my entertainment center, and I have no streaming problems at all. Great product, way to go Apple!", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 5.0, "review": "Even better streaming Amazon prime Showseasy set uplowest price by farno more cable, dish, direct tv or commercials", "verified": true, "helpfulness": "0/1", "author": "catherine page"}, {"rating": 5.0, "review": "After reading some reviews, I had made plans to return this device for a Roku 2. I have the return mailing label (provided by Amazon) but before I place everything in the box, I gave it one more go around. And after reading MANY more reviews regarding Apple TV and Roku 2 and since I have EVERYTHING Apple (MacBook Pro, Mac Pro desktop and 2 iPads), I decided that the Apple TV (new version) is a keeper. Like everything else Apple it just works! Below line, if you are thinking differently, just stick with Apple!", "verified": true, "helpfulness": "0/0", "author": "C. S. Campbell"}]