[{"rating": 5.0, "review": "The Apple TV works great with all our Apple devices as well as watching videos on YouTube, Netflix, or other streaming services. We don't have a DVD/Blu-ray player hooked up to our TV, so this is awesome for watching videos.", "verified": true, "helpfulness": "0/0", "author": "J. Bigler"}, {"rating": 4.0, "review": "Apple TV allows you connect your apple product with TV. It works smoothly and fast. Just one thing you have to know that Apple TV locks up in its own system. You cannot change any apps. (Maybe there are limited number of apps you can choose. )", "verified": true, "helpfulness": "0/0", "author": "volterra"}, {"rating": 5.0, "review": "again i spent my hard earned money luckly not on amazon, but it wont work on older tvs( I KNOW I KNow everyones thinking duh she should know that ) For some reason i thought it would work with an av cord like roku but i was wrong i either have to bye a new tv that supports hdmi ( which  i am an idiot yes lol at me. :) But looks like i might be return it. Or mabey i will save up for a new tv. Any one who knows how to find a hdmi to av cord i dont know if there is such one or if they work let me know thanks. btw its not apples fault its my fault for being a idiot lol.(SCRACTCH ALL THAT PAY NO ATTENTION :) This box is amazing it was my fault for not understanding technology i love haveing my apple music collection on my tv and having all the great radio stationts so cool!! It looks great on my new smart tv.", "verified": false, "helpfulness": "1/5", "author": "arietta night sparkel"}, {"rating": 5.0, "review": "Is a good product & performs Iike it is supposed to! Money well spent! We will enjoy our purchase for a long time to come.", "verified": true, "helpfulness": "0/0", "author": "Sunil B Bhojwani"}, {"rating": 5.0, "review": "We have a smart TV in our living room, but nothing in our bedroom. This has been great to access Netflix and other apps. Good purchase!", "verified": true, "helpfulness": "0/1", "author": "Courtney D \"Luca74\""}, {"rating": 1.0, "review": "I normally expect Apple products to be high quality but my Apple TV didn't cut it. I have had it for 1 year and 5 days and it no longer works (the warranty is one year). I started buffering for long periods during play on occasion a few months ago but I thought it was just temporary issues with the streaming. But now I can hardly get through 15 minutes without this. It also will freeze completely. I have to completely reset the device and then it is OK for a few hours then it starts again. I mostly use it for Netflix but I do also use trailers and podcasts.I have this on a high-end HD TV and picture quality is great. As usual, Apple has made the presentation slick and the hardware itself is attractive. I also have a Roku on another TV and it never has any problems. I have to replace the Apple TV and it will be with a Roku. If you must buy an Apple TV, you better get the 2-year warranty if you want something you can use for a while. My advice: buy a Roku!", "verified": false, "helpfulness": "5/11", "author": "Corrinne"}, {"rating": 5.0, "review": "No complaints. Airplay Mirroring gets used regularly and the built in menus are nice and responsive. This is now my 3rd device (TV + PS3) for Netflix and it is easily the best.", "verified": true, "helpfulness": "1/1", "author": "J. Hurley"}, {"rating": 5.0, "review": "Plug n play perfection! (Requires iPhone, iPad or Mac) or really doesn't get any simpler!I understand that it's proprietary... Wish I could use it with my windows products..", "verified": true, "helpfulness": "1/1", "author": "Ralex420"}, {"rating": 5.0, "review": "This is a great product by apple, and I love it.Some things to consider:APPLE TV DOES NOT SUPPORT OLDER TVS. ONLY OUTPUTS THROUGH HDMI.To enjoy it to its max, you probably want an iTunes account, Netflix account, etc.What comes with the Apple TV is what you get. No app store like Roku.For me, with a Netflix account, YouTube account(not required), and iTunes account, and iPod Touch, it's very worth what I paid for.", "verified": false, "helpfulness": "2/2", "author": "Daniel"}, {"rating": 5.0, "review": "Living overseas has us out of the loop a lot of the time. Ive been listening to the radio on the apple tv, everyday!! I love it! Its pretty funny to listen to the commercials from other states, back stateside. Looking forwards to trying out more of the features!", "verified": true, "helpfulness": "1/1", "author": "L. Cheek \"army wifey\""}]