[{"rating": 5.0, "review": "Very happy with how this works", "verified": true, "helpfulness": "0/1", "author": "D-1"}, {"rating": 1.0, "review": "Crap. All it does is buffer. Do not recommend at all!", "verified": true, "helpfulness": "1/4", "author": "Meredith Loughmiller"}, {"rating": 1.0, "review": "It did not work.  I even hired a computer person to come hook it up.  He informed me it was a bad one so I returned it.  I am waiting to hear regarding my credit!", "verified": false, "helpfulness": "1/4", "author": "marlene ovard"}, {"rating": 4.0, "review": "This is my second Apple TV. I have one in the Great Room, now I've put one on the lanai. I use it to stream music and to put up kids's shows for my granddaughters. Purchasers should check with their cable provider to see if they support some of the Apple TV's features (some don't) which will put some limitations in what you can watch.", "verified": true, "helpfulness": "0/0", "author": "tshreve"}, {"rating": 2.0, "review": "Mediocre UI, poor apple device/ tv connection leaves myself and others wondering why we never bought Roku.A review based off of 3 Apple TVs used in 3 different locationsI'm not convinced apple employees watch television off of netflix, hulu, etc because they make some huge mistakes right off the bat. For instance, if you enjoy binge watching shows or even watching shows one after the other, this product is not for you. After a show finished, any other device would start counting down to the next episode. Not Apple tv, it returns me to the page of the episode i just watched, making me have to back track more than i'd like.Apple Device --> TV connection: I was surprised to find that all three of these apple tv's took at least 2 attempts to connect to the apple TV. Playing music off of my apple device was laggy and skipped around, making it impossible to enjoy music in the lightest sense.", "verified": false, "helpfulness": "2/2", "author": "Ian Steffy"}, {"rating": 4.0, "review": "Its a very good device and apple did a great job with it,the remote is metal and is very well made,but i did replace it with a roku box and now im going to be switching to the amazon fire box,however if you want to stream music and videos from a ipad/iphone/ect then  this would be perfect for you,", "verified": false, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "I like it and I'm very pleased with my products and how fast I receive it that was great thank you.", "verified": true, "helpfulness": "0/1", "author": "Julio C"}, {"rating": 5.0, "review": "Love being able to see iPad content on TV screen. Applications to TV I am absolutely amazed to see. Easy hookup and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kathy H. \"Kathryn Hutto\""}, {"rating": 1.0, "review": "The device stopped working what am I suppose to do now????", "verified": true, "helpfulness": "0/5", "author": "Aboubakr wahba elhelaly"}, {"rating": 5.0, "review": "I love this new toy but was surprised and disappointed that I had to buy the chord separate.", "verified": true, "helpfulness": "0/0", "author": "Princess"}]