[{"rating": 4.0, "review": "Works fine. Does not get local channels or real time TV. However an indoor antena should get your local stations. Check to see if Netflix, Hulu or your antena gets your \"have to have\" shows before severing ties with your provider, if that is your intention. Nice feature allows you to stop the show your watching and resume it where you left off later. Most of my tv watching is when I go to bed so works out great. Can see on your tv what is on your Ipad. Bit of a lag doing it that way. If your getting it to sever ties, it is a change to get used to. Switching your tv from one source to the other to watch from the antena or apple tv and the change of the menu. No big deal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have an iPad 4th gen and bought this to stream my HD movies I have downloaded from iTunes.........using the HDMI connection to the TV and the toslink optical cable to my Onkyo receiver I get a fantastic home theater experience....was super easy to hook up and connect to my wireless network.......I can stream from my iPhone4s and my iPod touch 3rd gen as well.......If I use my HP laptop and open iTunes I can stream from my homeshare and play my music too.", "verified": true, "helpfulness": "0/0", "author": "USMC74"}, {"rating": 4.0, "review": "Apple TV is cool. It'll be even cooler when they realize how great this device can really be, and we get a lot more apps for it.Currently a little limited (hence the 4 stars), but what it does do, it does well.I love using AirPlay to listen to my iTunes library on my Denon home theater receiver.", "verified": true, "helpfulness": "0/0", "author": "LenTex"}, {"rating": 4.0, "review": "but like most apple products, they maintain some type of control... you cant add your own stuff here --- UNLESS you pay of course.must have tho if apple has their hooks in you already", "verified": true, "helpfulness": "0/1", "author": "Lee \"rodins_understudy\""}, {"rating": 5.0, "review": "This is the greatest little invention for the tv. We love that we can connect out iPads and our computers to the tv. I love the iRemote app that lets your phone become a remote control. Love love love Apple TV. Perfect for adults, yet our toddlers even know how to use it!", "verified": false, "helpfulness": "0/0", "author": "S. Bennett"}, {"rating": 5.0, "review": "I absolutely LOVE IT!!!! So much to Watch on it and do!!! I'm thinking of canceling cable now!!!! Wouldn't trade it ever!!!!! It's awesome I love apple products!!!! Can't talk enough with this product!!", "verified": false, "helpfulness": "0/0", "author": "KK Chan"}, {"rating": 5.0, "review": "But I have one as well and I love it, we don't have cable or anything and it's an extremely convenient way to rent new releases, watch netflix, hulu plus, youtube, listen to music and much more.", "verified": true, "helpfulness": "0/0", "author": "Lindsy M. Carranza"}, {"rating": 4.0, "review": "Hi All, I got this as a bday gift for my boyfriend and he absolutely loves it. Although he initially had problems syncing it to his macbook, he figured it out and now all products-ipad, uphone, etc are synced.", "verified": true, "helpfulness": "0/0", "author": "ShanieceB"}, {"rating": 5.0, "review": "I love this device. It lets me AirPlay everything from my laptop, my phone and my tablet. It is very easy to set up with your Wifi. I have it hooked up via HDMI to my plasma tv and have it outputting sound via an optical cable to my surround sound. The reason I have the optical is so I don't have to turn the tv on to airplay music. I just turn on my surround sound and airplay music to it and then I can do chores while jamming out. My surround sound has sleep functionality so I can leave it playing when I go to sleep and it will turn off. It can access YouTube, Podcasts, movie trailers, Hulu Plus and so much more. The only thing missing from it is a browser, like Safari. I highly recommend this device to Apple users.", "verified": true, "helpfulness": "0/1", "author": "Alessandro Zuniga \"Olly\""}, {"rating": 5.0, "review": "really enjoy it !!! thanks again Apple for creating another intuitive products. The only issue I find is that taking him to sleep mode is not easy - APPLE PLEASE FIX IT !", "verified": true, "helpfulness": "0/1", "author": "ld"}]