[{"rating": 5.0, "review": "I love this thing!!! Have it hooked up to my 55' connected to the surround sound. Can play all the music in my itunes collection whenever i want my me time. Plus when having friends over the icloud is great they can instantly play their music through the apple tv. Love it love it loveit!!! Plus can order and watch movies anytime couldnt ask for anything better. The install takes maybe (and i do mean MAYBE) 3 mins 5 at max. So simple and easy for such a useful prodcut.", "verified": true, "helpfulness": "0/0", "author": "freemon"}, {"rating": 5.0, "review": "Best little investment for crap TV programing that exists today!  Pick your own genre and never watch a hemmeorid commercial again!", "verified": true, "helpfulness": "2/3", "author": "Enzo Rat Racer \"Enzo's\""}, {"rating": 5.0, "review": "Apple TV Works great for streaming from your I pad or I phone.Great for looking at pictures ,TV shows,Movies, U Tube. Etc.", "verified": true, "helpfulness": "0/0", "author": "Buzz B"}, {"rating": 1.0, "review": "Apple stripped the capability I wanted this for. Gen 2 works for streaming home files, Gen 3 can't. Useless for me.", "verified": true, "helpfulness": "0/9", "author": "John Svirk"}, {"rating": 5.0, "review": "Makes your TV a smart TV with all the bells and whistles you would expect from Apple. Interfaces with other Apple devices so you can do things like play your itunes library through your AV system wirelessly. Already set up for other providers like Netflix, Hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "hleap"}, {"rating": 4.0, "review": "Works well if you are a Mac and iPhone user. Beware Apple wants to charge you for everything you do on here except to hook your phone or computer up. Other than that the product isn't worth it.", "verified": false, "helpfulness": "0/1", "author": "Jason Blackstone \"Jason B.\""}, {"rating": 5.0, "review": "For one hundred dollars, i'm incredibly happy. This little device might not be worth buying for the person who doesnt mind hoooking up their laptop everytime to watch netflix, but you have to remember one thing, it also comes with a REMOTE!", "verified": true, "helpfulness": "0/1", "author": "Collin Alberts"}, {"rating": 5.0, "review": "By far the best compared to ROKU and others.  Easy out of the box setup - connect to WiiFi or ethernet - tell it you apple ID and you are off and running.  Best picture, sound coupled with seamless install and interface ..... can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "gdawg"}, {"rating": 5.0, "review": "I love the Apple TV. Just like all other apple products, it is extremely user friendly. It is the smoothest and easiest streaming device I have ever seen. Also, not only can you stream Netflix and Hulu, you can watch YouTube videos, movie trailers, various sports, and much more. And it is so inexpensive! A must have!", "verified": true, "helpfulness": "3/3", "author": "Megan"}, {"rating": 5.0, "review": "We added this to our growing Apple TV collection - a device for each of the family room, bedroom and basement. With our house dominated by Macs, iPads, iPods, i-anything, it's key to enjoying our media and Internet entertainment throughout the house. They've always been easy to use. Use the Remote app on your iOS device to control any of them.", "verified": true, "helpfulness": "0/0", "author": "Badi Baltgalvis"}]