[{"rating": 5.0, "review": "This was a gift that my son wanted to give my daughter-in-law for Mother's Day.  She loved it.  Met all her expectations and was a great price.", "verified": true, "helpfulness": "0/0", "author": "Patricia L. Lewis"}, {"rating": 5.0, "review": "The product is very easy to set up and to use. As always Apple products as as intuitive as life.", "verified": true, "helpfulness": "0/0", "author": "L. F. Block \"LuisB\""}, {"rating": 5.0, "review": "The Appel tv is Great for apple users but not android users I have a lot of apple products and this is one of my Favorites it will only work with hd tvs with hdmi plugins. This devices is worth getting. It lasts a long time to.", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 5.0, "review": "This is a great product! We use it all the time to watch movies with the family, and with its 1080p it has amazing video quality.", "verified": true, "helpfulness": "0/0", "author": "Joni Hutchins"}, {"rating": 5.0, "review": "We now have four of these little beauties. One we use when we travel.  The other three are in our house and work fine together in the same environment.  You just give them different names.  While our most used feature is Netflix, we also stream directly from our iPads.  You simply select the Apple TV box you want the iPad to connect to.  They install easy and work flawlessly.  But they don't (won't) have an App for Amazon Prime.  That's our only complaint, as sometimes the program we want to watch is not available on any other service.", "verified": true, "helpfulness": "1/1", "author": "David J. Martin \"Opera Lover\""}, {"rating": 5.0, "review": "Apple TV is just so perfect for family with all Apple's products. So convenience. Easy to set up and use also.", "verified": true, "helpfulness": "0/0", "author": "Van P."}, {"rating": 5.0, "review": "It has become the core of late night entertainment as it flawlessly handles Netflix and its vast library of TV and movies.  The remote control is the paradigm of simplicity and function in one.", "verified": true, "helpfulness": "0/0", "author": "ChicagoFox"}, {"rating": 5.0, "review": "We like this more than we expected we would. Can't wait for Apple to add more services. We also have a blueray player that has network services, and the Apple TV is a completely different (faster, easier to use, more elegant) experience.", "verified": true, "helpfulness": "0/0", "author": "Michael D"}, {"rating": 4.0, "review": "It does work as expected... however i cannot seem to get the air play to work (stream wirelessly from my iphone/pad to the TV)Other than that it's great to have shows available at anytime!", "verified": true, "helpfulness": "0/0", "author": "swest"}, {"rating": 4.0, "review": "I purchased the product primarily because we have an Imac with the music library that I wanted to play through the Definitive speakers . the results are great. more detailed instructions on how to use the apple tv's other options would have produced a higher rating.", "verified": true, "helpfulness": "0/0", "author": "Brooks M Steedman"}]