[{"rating": 5.0, "review": "Bought this as a gift. Came in original packaging. Worked as expected. You have to buy an HDMI cable for it though.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Billy Meyer"}, {"rating": 1.0, "review": "CRAP!!!!", "verified": true, "helpfulness": "0/6", "author": "Alicia \"green\""}, {"rating": 5.0, "review": "I didn't buy it online, but I had to leave a review. I love this stupid thing, SO much. It may be hard to justify the cost compared to Chromecast or Ruku or Fire TV, but there's one huge thing that differentiates this from the rest: Ease and Picture quality.Picture: I used to watch Netflix through my Xbox 360, and have also seen some on my friends Chromecast, but that Apple TV is doing some magic to the video before you see it, and the result is really pleasing. It's the same content I used to watch (I watched episodes I've seen before on my 360 and friends Chromecast) but looks way better! It's definitely doing some processing just like what some Smart TV's do, and it does a great job at it.Ease: There's no better way to justify ease than by throwing it in front of someone who's not technologically savvy. I had my friend come over who purchases technology based on how much time she has to spend with it before she gets it, and she loved this thing. A remote doesn't have to turn on, everything is instant, not a glimpse of lag at all, and just very easy to use! Just couldn't be more pleased.Also, if you have a Mac you can mirror your display to the TV, or use it as an external monitor. As for the iPhone, the display can be mirrored too (all with unnoticeable lag), but you can also just send a video you're watching to the Apple TV, and it'll just start playing right where you left off. Very handy for a media heavy person like myself", "verified": false, "helpfulness": "2/2", "author": "Tyler Macdonald"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "George"}, {"rating": 5.0, "review": "Very nice", "verified": true, "helpfulness": "0/1", "author": "Andy"}, {"rating": 5.0, "review": "Of course we love it. It's an AppleTV!!!!!", "verified": true, "helpfulness": "0/1", "author": "Roger J. Stricker"}, {"rating": 5.0, "review": "Apple TV is an important component to own if you have a Mac.  Apple TV is the bridge to watch Amazon prime, Netflix, or Hulu from you Mac on your lgs flat screen tv.  The system integrates both devices seemlessly", "verified": false, "helpfulness": "1/2", "author": "Golden Lion \"Reader\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/2", "author": "John"}, {"rating": 4.0, "review": "Great product, I only use it sometimes but is very reliable. This box does not contain Amazon Prime for anyone who wants to know.", "verified": true, "helpfulness": "1/1", "author": "kim"}]