[{"rating": 5.0, "review": "Awesome.. Gonna be busy for like a week playing with this new toy. Came undamaged and on time. Good price too.", "verified": true, "helpfulness": "0/0", "author": "Shine.Jassen"}, {"rating": 5.0, "review": "I love my Apple TV and have ordered another for our downstairs TV!", "verified": true, "helpfulness": "0/0", "author": "Debbie Kirkman"}, {"rating": 5.0, "review": "works well in a home that has no cable.", "verified": true, "helpfulness": "0/0", "author": "Joseph McClanahan"}, {"rating": 5.0, "review": "Cant beat the price with 2 day shipping...WOW", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "Arrived on time, works well and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "J.Lee"}, {"rating": 5.0, "review": "I love this! Super easy to set up & makes dropping cable bearable.", "verified": true, "helpfulness": "0/0", "author": "P. Ross"}, {"rating": 5.0, "review": "Great add on for home entertainment. Cut the cable on cable. Even though this is older model, we gave plenty of options. Like all things Apple, awesome!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "I'm still learning how to use it.", "verified": true, "helpfulness": "0/0", "author": "benlc"}, {"rating": 5.0, "review": "Apple products always work, no troubles and are intuitive to use.  Apple TV turns ANY TV into a smart TV; Chromecast just lets you SEND stuff to your TV from another device.", "verified": true, "helpfulness": "0/0", "author": "Michael Smith"}, {"rating": 5.0, "review": "What can you say about Apple TV?... It works as expected. I have one mounted on the back of every TV in our house. It streams movies, pictures and music seamlessly from any Mac or PC with iTunes on it. It runs Netflix and other cloud services flawlessly. You can use any iDevice as a remote to get around the annoying line-of-sight Apple provided RF remote issue. What else could you ask for? This device has definitely won the Cable vs. Cloud battle in our house. Frustratingly the YouTube app has disappeared from the home screen, but you can use AirPlay from any iDevice to still watch YouTube on it.", "verified": true, "helpfulness": "0/0", "author": "Brian Zuvich"}]