[{"rating": 4.0, "review": "Good but needs third party apps and Hulu need to store more episodes of shows especially the simpsons", "verified": true, "helpfulness": "0/0", "author": "pixiechick"}, {"rating": 5.0, "review": "This is the best investment for electronics have a made so for. If you like electronics using your Idevices you have to have this for home. You can mirror whatever you're showing on your phone or iPad and also play music directly from your idevice.you can stream video from Netflix Hulu ABC apps they're already in the AppleTV. You can also View your pictures from your phone or iPad directly to your TV it's awesome. If you're watching YouTube on your phone you can also stream that to your TV as well.", "verified": true, "helpfulness": "0/0", "author": "Ohgodalex"}, {"rating": 3.0, "review": "I bought this specifically to watch HBO Now because the streaming sucks in a web browser for some reason.  If that's all you want it for, then this is easily a five star device.  The reason I give the device only three stars is because I've owned three of these and all of them will eventually fail to play rented/purchased content from iTunes.  You'll get a media playback failure and you have to turn the device off and on again to get things to work.  It's a real pain and it's ironic because its an Apple device interacting with Apple software, you'd think that would work flawlessly.  It's apparently a known issue if you look on the Apple forums but they've never addressed it.  It's enough of a hassle that I eventually decided the device was not for me and got rid of it.", "verified": true, "helpfulness": "0/0", "author": "Joseph C."}, {"rating": 5.0, "review": "Cool - as described - great performance", "verified": true, "helpfulness": "0/0", "author": "biewel"}, {"rating": 5.0, "review": "it's apple, so good as usual. Nothing to complain here.", "verified": true, "helpfulness": "0/0", "author": "Tanja Z."}, {"rating": 3.0, "review": "I like it, but I previously had an android box and I think android are better ones than any apple tv.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Stiglich \"Just a person\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Maria Duenas"}, {"rating": 5.0, "review": "Recommended by a friend and works as described. thinking about dropping the cable and saving a little money.", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 3.0, "review": "It's an AppleTV! product is just as described. I think Apples interface needs an update. Typing is a pain and search between different apps is a pain.", "verified": true, "helpfulness": "1/1", "author": "TRob \"TRob\""}, {"rating": 5.0, "review": "This apple tv is the easiest thing in the world to set up and use. I love the ability to stream from my i-devices directly to my tv through the apple tv. There are also a bunch of apps included on the device like Netflix and Youtube.  I bought one for my parents who are in their 70's. My dad, who barely knows how to operate a tv remote, was able to have this hooked up (plug in and connect HDMI cord) and running in less than 20 minutes. It took me (self proclaimed tech whiz) about 7. I think that says a lot about its ease of use.", "verified": true, "helpfulness": "0/0", "author": "shopnfool"}]