[{"rating": 5.0, "review": "over time newer updates come out that make it more responsive and more content availalble. ive owned google tvs which annoyed me due to slow updates and not feeling like a quality product .. for 99 bucks or less this is a great deal and personally i like the interface better than the roku .. but the roku is cheaper but loses iphone \\ ipad functionality", "verified": true, "helpfulness": "1/1", "author": "Kevin Mongru"}, {"rating": 4.0, "review": "I love streaming my music, movies, and TV over Apple TV. But I wish it would also allow non-Apple streaming services (i.e. Amazon) on the device without having to use laptop mirroring.", "verified": true, "helpfulness": "1/1", "author": "kjmij"}, {"rating": 5.0, "review": "We have two of the older models and one of the new and love them all.  Setup easy, use easy, and wireless-N.", "verified": false, "helpfulness": "0/0", "author": "C. Fox"}, {"rating": 5.0, "review": "I owned a Sony Blue-ray (model: BDV T58) with wifi function.  I recently purchased this Apple TV because I want to mirror my Mac Air and iPad screen to the Sony Brevia TV (no wifi function).  So, after comparing these two products, here is my observation.Sony Blue-ray has many more channels by 10 times compares to Apple TV, including the unpaid/no-need-for-subscription Crackle (ad. occurs every 15 mins).  Also, if you have Amazon Prime, you can watch Amazon Instant Movie on Blue-ray, but not on Apple TV.  The only movie channels on Apple are iTune and Netflix.  If you like TV shows, Apple TV also has Hulu Plus that costs just as much as Netflix online streaming.  But that is pretty much it for Apple TV.One huge advantage of having an Apple TV is that you can actually use keyboard to enter the name of the youtube video or name of the movie/TV shows or whatever.  If you own a bluetooth Apple keyboard, then you can easily connect it to your Apple TV (it is a no brainer, super easy to do).  Don't underestimate this feature, because a lot of people, including myself, have already given up on searching videos on YouTube or Netflix using a Blue-ray, because it is a pain in the neck to use remote control to enter each letter of the keyword or song/movie/video title.If you have subscribed to Netflix and have high-speed internet at home (download speed is greater than 10mbps), then Apple TV gives you super HD quality picture (1080) when you watch a movie.  The blue-ray I own is visibly not as great as Apple TV when it comes to HD movies on Netflix.  However, if your internet is slow when you use Apple TV, then multiple problems occur when you watch HD movies, including in-synchronization between audio and video, video stops frequently and screen turns black, video lags and so on.  One solution might be to use ethernet cable instead of wifi.The set-up for Apple TV is easy - all you need is a HDMI cable (purchase separately) and a TV that has HDMI input.  The mirroring function of your iPad/Macbook/iPhone/iPod to your TV can be done in less than a 1 sec.  There is no requirement for set-up.  All  you need to do is to connect the Apple TV to your TV and power, and the icon for mirroring function will automatically shows up on your other Apple devices.  I've had a lot of fun with the mirroring function with my cat, he truly believes now that there is a huge rat lives behind the TV screen because I played a lot of rat videos on my huge Sony TV through mirroring function via my Mac Air.If you have a PC and no Mac, then there is no question about it that you should choose anything but Apple TV.  I have a Windows 7 PC laptop, and I can stream movies to my Sony Blue-ray through the windows media sharing client function.  However, it does take a bit of effort and time to set up.  Not nearly as easy as Apple TV Home Sharing.  So, if you have a Mac and you want to stream movies or videos, then your best bet is Apple TV.  However, if you have a PC and want to stream videos, then you must use Blue-ray or other Windows compatible devices, unless you have purchase movies directly on iTune, then it is ok.Finally, Apple TV does not take blue-ray disk or any other DVD.  Also, to my surprise, if you try to play DVD through Airplay, it won't work either.  So, if you play DVD every now and then, then Blue-Ray is your best bet.After testing out both the blue-ray and Apple TV, I think these two devices aim at different population and they do several different things as mentioned above.  I am glad I got both and I do NOT feel like they are redundant technology.", "verified": true, "helpfulness": "3/4", "author": "YS Sheu \"ss\""}, {"rating": 4.0, "review": "I bought two of these to use around the office for mirroring desktops on MacOS, iOS, and Windows 7 to large monitors.  This has to be one of the most effortless technology hoops that I ever had to jump through.  I was all prepped for having to do a bunch of research and trial & error, but it was about a 10 minute operation from unboxing to mirroring.  Wow.  Thank you, Apple, for making my life easier.  Thank you, AirParrot, for making it easy to run AirPlay off a PC.Now, as a media device, I don't like the dependence on iTunes, limited media file playback, or the lack of an Amazon Prime player.  I also find it annoying that the homes screen has extremely limited customization ... you can move some of the icons (!??).  But I did not buy these devices for media purposes (however most people will).  If you are buying these only for the AirPlay feature, then it is well worth the price.", "verified": true, "helpfulness": "3/4", "author": "Jason Berry"}, {"rating": 5.0, "review": "It's a awesome product. We bought it for my Mom. She had some issues with her router so double check that you have a compatable one before buying. Hers was a Cisco and it didn't work well.", "verified": true, "helpfulness": "0/0", "author": "Kevin Pack"}, {"rating": 5.0, "review": "Quiero comentar que este producto de apple es totalmente recomendable, la experiencia como.usuario es de las mejores. Instalación sencilla, interface adecuada. 100% utilizable", "verified": true, "helpfulness": "0/0", "author": "oswaldo"}, {"rating": 5.0, "review": "good bye cable bills. hello freedom and more access to shows!!! the best just wish i did not have to use my ipad to mirror and use pandora since pandora is not a direct access app like huluplus and netflix. i would only recommend this for those with other apple products and use their itunes library excessively since this can be mirrored onto your tv via the apple tv.", "verified": false, "helpfulness": "0/1", "author": "Rochelle"}, {"rating": 5.0, "review": "It is another great Apple product! It is extremely easy to set up.Only con is it does not come with more instructions!", "verified": true, "helpfulness": "0/0", "author": "Mary Ann \"Limey\""}, {"rating": 5.0, "review": "I really like my apple tv.  Really a great accessory if you have multiple apple devices and a library of music and movies in itunes.  Netflix works great on this too.  Cool little device!", "verified": true, "helpfulness": "0/0", "author": "PTW"}]