[{"rating": 5.0, "review": "This is the fourth Apple TV I've purchased. Having used the new Roku and Chromecast extensively, I simply cannot see how someone passes on purchasing an Apple TV. The ease of use of this device is second to none. It requires nothing but itself and internet. As a standalone media unit, it has quite a robust offering. Go to Apple's website to see all the content available, but needless to say, it is fully-loaded, and getting content updates regularly. Pair this with a Mac, iPhone or iPad and you have endless possibilities. I use an Apple TV in my office as a wireless monitor. Over AirPlay I can stream content not yet available on the device (such as Amazon Instant). For its average price these days (around $85) there is nothing that works as well. You won't regret buying one.", "verified": true, "helpfulness": "0/0", "author": "Trevor"}, {"rating": 5.0, "review": "I was worry than it didn't work outside the US but it works well and i have no complains. i will recomend this product if you have other devices apple so you enjoy better.", "verified": true, "helpfulness": "0/0", "author": "Monica Roncal"}, {"rating": 5.0, "review": "But it doesn't. Resolution is much higher than streaming services on a laptop. It seems like it's a complete cable system.", "verified": true, "helpfulness": "0/0", "author": "REVIEW JUSTICE \"dzadecta\""}, {"rating": 5.0, "review": "I have really enjoyed this Apple product and do not wish I had gone with the more expensive.  My husband and I watch you-tube and netflix on it but also enjoy VIMEO and VUDU and several other apps--not to mention showing off our computer pictures on the television while we entertain.", "verified": true, "helpfulness": "0/0", "author": "D. Smith"}, {"rating": 5.0, "review": "The only bad thing about this product is I want one for every TV in the house. Easy set up, prefect streaming. It does take a while to preform the updates, but not horrible.", "verified": true, "helpfulness": "0/0", "author": "Paul Mojica"}, {"rating": 5.0, "review": "another excellent product from apple.  As time goes on I found this device better and better. Nicely integrated with other apple product like photostream.", "verified": true, "helpfulness": "0/0", "author": "R. Matt"}, {"rating": 4.0, "review": "Great product. Air play makes it so easy to send movies from your iPhone, iPad, or iBook. Don't hesitate to buy if your on the fence.", "verified": false, "helpfulness": "0/0", "author": "Jeffrey R \"Jedi Master\""}, {"rating": 5.0, "review": "Had the original Apple TV and decided to purchase the Apple II TV for the streaming capabilities...from my iPhone or Mac Pro...incredibly easy to set up and operate...The Best! Love it!", "verified": true, "helpfulness": "0/0", "author": "Ric \"Ric\""}, {"rating": 1.0, "review": "Very tightly controlled by Apple, like all Apple products. Will only play iTunes stuff from iTunes store or from a few services like Netflix. Just not enough. Get a WD TV box and you can then play your own video files from anywhere on your network plus all the services on the internet.", "verified": false, "helpfulness": "6/10", "author": "SL \"pismo10\""}, {"rating": 4.0, "review": "Excellent performance with purchase price. I will recommended to buy.Speed and quality of picture is good. I will satisfy with this product.", "verified": true, "helpfulness": "0/0", "author": "Jitendrakumar Patel"}]