[{"rating": 5.0, "review": "One of the cheapest prices I found for a new Apple TV. My only issue is my router, make sure you have a good router that supports all the devices you use or you might find you need to reset your router often. Hopefully Apple will update the device so you can change the apps that are installed and you can add apps you want.", "verified": true, "helpfulness": "0/0", "author": "Drew T. Riddle"}, {"rating": 5.0, "review": "I love it I can connect my iPhone or iPad to it and play music or movies or tv or just use it's menu! Definitely worth the money!", "verified": true, "helpfulness": "0/0", "author": "annemarie"}, {"rating": 4.0, "review": "Really glad I purchased this streamer. I had an iPhone already so it just felt right to get! I wanted to cut my cable bill a get into video streaming and it was well worth it. I would have like more channels like the Roku 3, but I am more than satisfied with the features. I especially like the air play feature where anything that is played on your apple device, it can be streamed straight to your tv through the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Lamont"}, {"rating": 5.0, "review": "what more can i say about apple product. Apple TV is easy to install, easy to use and compatible with any laptops. I am using it daily either to stream or watch movies.", "verified": true, "helpfulness": "0/0", "author": "BJ  Park"}, {"rating": 4.0, "review": "Let me start by saying I am a Roku guy.  I have 2 of them and they are awesome.  So why did I buy an apple tv?1.  The simple answer is the mirror feature.  With apple tv I can stream the CBS app on my iphone and have it play through my TV.  Why do you need this?  Well we dumped our cable and CBS shows are only available online or apps.  This is a super easy way to keep current on all our shows.  You can do this with anything else on your iphone or ipad.  I use the iphone because the stream window is almost full TV size where the ipad is minimized.2.  I was blown away by the HD quality.  It puts roku to shame.  My wife, who can't tell the difference between standard def and HD on  Uverse even noticed the difference between the roku and the apple tv.Why didn't you give this a 5 star rating?  2 reasons:1.  You can't watch your amazon prime, though as I write this I haven't tried mirroring from my phone.  C'mon apple, add the app.2.  You can't add any channels. You get what apple gives you.  This is where Roku shines.  My recommendation get both.", "verified": true, "helpfulness": "0/0", "author": "rindy"}, {"rating": 4.0, "review": "My family and I have given up TV and this Apple TV gives us a way to watch some shows and movies without having cable service we love it!", "verified": true, "helpfulness": "0/0", "author": "Kristina Cavener"}, {"rating": 5.0, "review": "Don't know what took me so long. Easy connect. Easy to use. The remote control is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "clearwater"}, {"rating": 4.0, "review": "Does everything I expected it to do, the remote control is nice and small with great functions price was right and delivery was great", "verified": true, "helpfulness": "0/0", "author": "glenn schultz"}, {"rating": 5.0, "review": "The Apple TV is probably Apple's best accessory.Aside from being a standalone streaming device, the Apple TV supports AirPlay, which blows the doors off any any other competition. AirPlay allows for any iOS device running iOS 4 or later to play any video or audio over Wi-Fi. AirPlay mirroring is supported on the iPad 2 and later the iPhone 4S and later, or Mac 2011 and later, which allows for whatever is on your device screen to be mirrored to your HD screen without a VGA cable. This is great for Demos, gaming, and Presentations.Another underrated future, is iTunes Home Sharing, which is supported across every iOS device and Mac computer already. That allows for everything in your iTunes library to be streamed to the TV, including encoded DVDs or Blu-rays. I legally encode the physical media that I own and store it on a hard drive. It's all easily accessible through iTunes and the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "T. Brock"}, {"rating": 5.0, "review": "Love how easy it is to set up use. Great content, and you can use the Apple rote on your phone or iPad. Delivered fast!", "verified": true, "helpfulness": "0/0", "author": "Geoffrey W Morris"}]