[{"rating": 5.0, "review": "BES TV STREAMER EVER!", "verified": true, "helpfulness": "1/2", "author": "Jairo Oviedo Abreu"}, {"rating": 5.0, "review": "This is a must for any Apple owner! This does all the same stuff as the Roku or Amazon Fire, but this has all of your iTunes downloaded movies, music, and TV shows built in.  Easy to set up and ready to use out of the box.  I have a Roku and an Amazon Fire also, and they are great TV streamers also, but if you have any Apple products, this is the box for you.", "verified": true, "helpfulness": "0/0", "author": "teamHoffman"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/1", "author": "A. J. Cormier"}, {"rating": 5.0, "review": "At first, I was wondering if this was really worth it, but now I use it almost daily.I use it to watch ABC live, Netflix, watch videos (from iPhone or Macbook) and show pictures. It's so great when I have people who come over and want to show pics/videos from their iPhone. I have them connect to airplay and everyone can see it all on my big screen tv. No more gathering around a tiny phone.All my digital copies of movies are right there for simple picking and watching.I had some problems with the ABC app, but I contacted their support team. They sent me directions, which fixed the issue.", "verified": false, "helpfulness": "0/0", "author": "beachbum"}, {"rating": 5.0, "review": "too good of a deal and with an hdmi cable i mean come on get one", "verified": true, "helpfulness": "0/1", "author": "a.l. \"The Leeb\""}, {"rating": 5.0, "review": "This is the best.", "verified": true, "helpfulness": "0/1", "author": "DaveB"}, {"rating": 5.0, "review": "Awesome investment. I canceled my DirecTV service and picked up the AppleTV I also bought the Amazon fire stick as well both are very awesome and cool I like the Apple TV because it works well with all my Apple products the iCloud works perfectly with pictures apps and interacting with my iPhone I can see my iPhone screen live on the TV screen as well has a ton of apps to include Apple radio Netflix fox now, ABC, HBO YouTube and many more apps that will help keep you up-to-date on all your favorite TV shows and movies AppleTV is absolutely free it even has all the streaming movies and TV shows that you will love. I no longer need cable or satellite TV this has it all and is save me over $80-$150 month because I do not have to pay for high-definition boxes or for cable or satellite TV services. Buy an HDMI Cable from Amazon that is all you will need. Also check out the Amazon fire stick both of these products are awesome to have.", "verified": true, "helpfulness": "0/1", "author": "Johnathan"}, {"rating": 5.0, "review": "Love it!! I wanted a smart TV because I wanted Netflix on my TV but there was nothing wrong with my current HD TV so I was so torn.. When I found out that Apple TV basically turns your TV into a smart TV I had to try it.. It's everything I wanted and more!!! I could get all my songs from iTunes plus my movies, I could rent movies and the air play is the coolest thing ever!!! Saved thousands and love it do much more..?im definitely getting another for my guest room!!", "verified": true, "helpfulness": "1/1", "author": "Donna"}, {"rating": 5.0, "review": "We love ours, especially now that HBO Now is on Apple TV. It was a pain to use the remote bc it controls our Macbook Pros as well, but this can be fixed by adjusting the settings in the Mac.", "verified": true, "helpfulness": "0/1", "author": "scott tillett"}, {"rating": 4.0, "review": "Works as expected.  Operating software seems adequate but definitely could use a better remote control.", "verified": true, "helpfulness": "0/1", "author": "H. F. Rash"}]