[{"rating": 5.0, "review": "Love it, love it, love it! Could not be any happier. It works great, even with an older, 2005 Plasma TV!", "verified": true, "helpfulness": "0/0", "author": "Ed Meyer"}, {"rating": 1.0, "review": "I've had my Apple TV for a year and it hasn't worked all summer. None of my apps will load and I feel like I wasted a bunch of money for a piece of junk. I'm better off using my HDMI converter that allows me to hook up my computer to my TV. The converter actually is cheaper than the Apple TV. Even after the new update, this stupid piece of electronic still won't work.", "verified": false, "helpfulness": "3/9", "author": "Cella987"}, {"rating": 5.0, "review": "Awesome little box that allows me to watch Netflix et al. on my HDTV. Order right from the screen. Did I say awesome? Yes, I am an Apple fan.", "verified": true, "helpfulness": "0/0", "author": "Mal \"Lisa\""}, {"rating": 5.0, "review": "Very easy to install and use. Amazing speed in accessing my Apple account on my computer. I recommend this product emensly.", "verified": true, "helpfulness": "0/0", "author": "Joseph KP Villagomez"}, {"rating": 5.0, "review": "The Apple TV is definately worth the price!  At $100 you can't beat it!  I love using the Apple TV to watch Netflix, Hulu Plus, and many other apps you use through it!", "verified": true, "helpfulness": "0/0", "author": "Todd W. Richey"}, {"rating": 5.0, "review": "This is a great add in for the entertainment center.  Easy to use and works great for displaying ipad iphone browser on the tv.  I may buy another one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "James R Clingerman"}, {"rating": 4.0, "review": "I own a lot of movies, TV series, etc. from the Apple store, and therefore had to use an Apple TV.  But given the choice, a Roku box, or even my own PC running Plex Media Server, is a better and more versatile system. Apple, when are you going to allow Amazon.com, Windows media servers, and other digital channels?", "verified": true, "helpfulness": "0/1", "author": "Rassilon \"Game Sage\""}, {"rating": 4.0, "review": "Like most Apple products, this is well made with a great interface. I took a star away for 2 reasons: 1st, no Pandora.  Apple needs to include that.  2nd, I had to call tech support to make YouTube work.  While this may be YouTube's fault, it was still annoying.  Tech support finally got it working by having me manually change an IP address (not my local WiFi IP, but an external IP).", "verified": true, "helpfulness": "0/0", "author": "Michael D. Finley"}, {"rating": 5.0, "review": "Everything was delivered on time no issues. Device works great still figuring out new ways to use it. It came in real handy to show off vacation pictures and videos wirelessly.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Per usual, top quality product by Apple. Works exactly as expected.One note since the solution is not in the manual: if you have a router that has dual-band frequency ability (both 5Ghz and 2.4Ghz) and you connect your Apple TV to the Internet via Wifi, sometimes you may get a blank screen when attempting AirPlay. I was able to get around this by plugging AppleTV in to my router directly via Ethernet cable. Hopefully this is an option for you if you run into this issue.", "verified": true, "helpfulness": "0/0", "author": "Hubbub"}]