[{"rating": 4.0, "review": "My Samsung Blu ray would drop the wi fy signal every time I tried using apps. This Apple TV box is super fast. has an excellent easy to use menu and never drops signal. Apple has done it againA must buy!!!", "verified": false, "helpfulness": "0/0", "author": "ROBERT M."}, {"rating": 5.0, "review": "My excellent Roku 1 died last month after 6 years of wonderful service. I bought a Roku 3 last year for my second TV and it works incredibly well!! I was torn between replacing my dead Roku with another Roku 3 (which I know works extremely well) or getting the Apple TV so I can leverage my iTunes collection, and other Apple devices that I've accumulated over the last couple of years. Pros of Roku 3 and Apple TV:Roku 3 ProsExtremely fast user interfaceHeadphone jack on the remoteRemote easier to useApple TV ProsAccess to iTunes digital library - music, movies and TV shows (items purchased on iTunes)Access to \"Home Sharing\" on iTunes - music and photos (not purchased on iTunes)Access to iMovies program from laptopAirPlay feature for iOS devicesThe only thing missing from Apple is Amazon Prime. But I understand that you can use the iPad Prime App with AirPlay. I don't use Amazon Prime that much, so its not that big of a deal to me. If you don't have other Apple products, I would recommend getting the Roku 3. If you do have an iTunes library with Digital copies of movies, I would recommend getting this unit.", "verified": false, "helpfulness": "2/3", "author": "Dov"}, {"rating": 2.0, "review": "I jumped on the Apple bandwagon years ago starting with a classic iPod.  Back then, they were so far ahead technologically - there was little choice.  Over the years, their interface between their products and iTunes has drastically declined and become more frustrating and buggy.This new Apple TV was bought to replace my old Gen 1 when the old one quit accessing the Apple Store due to a bug in the software (which Apple still has yet to fix!).  I get this new unit all set up and it's got a problem staying connected to my library.  Yes, my computer stays on all the time.  However, IF you let the Apple TV SLEEP - it WILL DISCONNECT & NOT RECONNECT until you shut off your computer and the Apple TV and re-boot.Apple leaves it's users to post hundreds of posts trying to get help from each other - rather than supporting their products personally.  It's alarming.  I'm seeing more and more of my friends switching to other products - especially phones (Android, Samsung, etc.).  I'm appalled that they'd switch - then I run into these issues.  Apple is slowly dying.  I'm sad that they are focused on the volume - rather than fixing & maintaining the products they already produce.Bottom line: While the new Apple TV is an improvement over the old - it's frustrating to keep connected and why bother having a power saving feature that you can't even use?  The price is right - but you get what you pay for!!  I paid $300 for my original Apple TV - and loved it - because even if you were disconnected - you had a hard drive full of content to play anywhere.", "verified": true, "helpfulness": "0/3", "author": "S. Porter"}, {"rating": 3.0, "review": "Great features for apps, music, and video. However hard to connect any wifi to it and Using airplay with my computer is a hassle. A majority of the time the picture is blurry, choppy, and slower than the actual video displayed on my computer. Remote app is useful and iTunes library is easy to connect to.", "verified": true, "helpfulness": "0/0", "author": "Jalen Brown"}, {"rating": 1.0, "review": "So I purchased this product 12.5 months ago.  Apple products come with the standard 12 month warranty, and it has just broken.  I took it to a repair shop and they confirmed that Apple TV is known for breaking right after warranty expires.  Make sure you buy the extended warranty.", "verified": true, "helpfulness": "0/2", "author": "RedLegs Reviewer"}, {"rating": 5.0, "review": "I love the Apple TV! We use it for work purposes with an iPad and absolutely love it! I have not tried watching movies or anything with it since it is for work but hopefully one day I will get a chance to.", "verified": true, "helpfulness": "0/0", "author": "rai9813"}, {"rating": 4.0, "review": "I purchased the Apple TV so I could wirelessly relay music from iPhones and MacBooks to the big stereo system in the living room. I'd used a wire before that, and besides all the hassle trying to hide it, it was picking up hum from the power lines. No such problems with the Apple TV, and as an added bonus we can also look at photos and watch movies from the iPhones and laptops, too. Even better, the Apple TV was actually less expensive than the Apple Express that would have relayed only music. I can't say much about using Netfilx and other streaming services as the data caps that come with our satellite Internet service don't really allow much traffic, but if there were any other Internet service available here I might consider dropping our satellite TV service.The only draw back is that it takes the Apple TV a little while to come on when power is first applied, but that would be a non-issue if it was powered with an always on outlet.", "verified": true, "helpfulness": "1/1", "author": "JunkBMW"}, {"rating": 5.0, "review": "I've already had one and use it mainly with netflix and my macbook pro. I bought this one for my sister. As expected it works fine.", "verified": true, "helpfulness": "0/0", "author": "Giselle Pinheiro Arcoverde"}, {"rating": 3.0, "review": "I bought this about the same time I bought a Roku Stick for a different TV.  The Apple TV was SUPER easy to setup with my iPhone (use bluetooth and it does everything for you).  It works fantastic as a Roku style device, streams Netflix etc beautifully and has optical and HDMI output etc.Disappointment comes from a couple of things.  Mostly Airplay.  Airplay is awesome and works perfect from an iOS device, but is very sub par on my macbook pro.  We have a variety of movies in various formats on my computer and I have had to do a lot of messing with my router to try and make playback watchable.  Streaming TV from a website for example is borderline watchable with the jumpiness.  its like I am getting 5fps instead of 30.  Sometimes if hangs for a half second or so.  Doesn't seem like a big deal until you are trying to watch a show and its so distracting!I also wish I could do the \"private listening\" that the Roku offers.  I have watched a couple shows while my wife sleeps and it would be epic if I could listen from my headphones rather than the speakers.  You can't do it however, even with apps etc on your phone that say you can (at least  that I have found so far).The Roku Stick couldn't even hook to my wifi.  I get an excellent signal (checked with Air Radar mac app) right in front of my TV but the Roku was terrible.  I sent it back.  I have a Roku 2 on the way (previous was the stick) I hope it works better....", "verified": true, "helpfulness": "1/1", "author": "Joel R"}, {"rating": 1.0, "review": "Well - what to say about the Apple TV3?It doesn't do anything.  Can't stream from Amazon, can't stream from a media server (without iTunes), can't play music without iTunes.Can't watch internet TV without a subscription.Can't jailbreak it to make it useful.There's a whole lot of \"cant's\" and for the life of me, can't find any \"can's.\"Unless you bleed apple blood, don't waste your time or money on this.  A complete waste; and cannot for the life of me figure out why anyone would want or use this little black box.", "verified": true, "helpfulness": "4/10", "author": "phil"}]