[{"rating": 5.0, "review": "Apple TV is a great value at the new price. We love ours. Only downside is no Amazon prime video!!!", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 3.0, "review": "It's ok", "verified": true, "helpfulness": "0/0", "author": "Caro"}, {"rating": 5.0, "review": "great price. No problems.", "verified": true, "helpfulness": "0/0", "author": "Jon A."}, {"rating": 5.0, "review": "I so happy thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Thach an nguyen"}, {"rating": 5.0, "review": "I've gained 15 LBS since purchasing my Apple TV. I love it. I'm addicted to watching Netflix- or YouTube videos on the big screen. If you want a fabulous little box that connects you to the world- purchase the AppleTV. If you want to not sit on your couch and binge watch The Orange is the New Black in style- don't buy this. The remote is super simple and easy to learn. My 6 year old picked it up in no time. The only thing I will say is that tthe remote is super tiny so sometimes it gets lost in the couch and I have to physically stand up to find it- bummer, I know.", "verified": true, "helpfulness": "0/0", "author": "Jean"}, {"rating": 4.0, "review": "Great product, but no way to watch anything from your amazon prime account easily.", "verified": true, "helpfulness": "0/0", "author": "Lindsey deMont"}, {"rating": 5.0, "review": "Only good things to say about Apple TV, this was purchased for the stand alone HBO NOW app works great couldn't be more pleased. Great devise would highly recommend to everyone!Update I had Apple TV just a little over a month, just stopped working this morning, we had been watching for a couple of hours put it to sleep came back about hour later tried to turn it on wouldn't do anything.", "verified": true, "helpfulness": "0/0", "author": "Sandra Smith"}, {"rating": 3.0, "review": "I have to admit that I bought it mainly bought it for HBO Now, but here in Colombia we don't have it, so, it sucks.", "verified": true, "helpfulness": "0/0", "author": "Michelet Díez Posada"}, {"rating": 5.0, "review": "I received it at time.I bought with the High Speed HDMI Cable from Amazon.The installation is very simple, the set up too.Its my 2nd Apple TV and its the best solution to see stream movies on the TV from Netflix or Youtube, for far.The quality of the image its super, better than the Samsung Smart TV app.I have a Samsung Smart TV , the latest model, but I need to buy an Apple TV to experiment better quality.", "verified": true, "helpfulness": "0/0", "author": "Nieves Barrera"}, {"rating": 4.0, "review": "The package box was worn out.However, the apple tv itself was good enough to be considered as a new product.Even the vinyl cover was not removed on the remote controller.Overall, I think the product was good.", "verified": true, "helpfulness": "0/0", "author": "YongKi Kim"}]