[{"rating": 5.0, "review": "This little device won't keep your doctor away, but it will certainly make your life better.  At my cabin, I don't have the super duper mega-channel cable that I do at home.  Nevertheless, I watch a lot of movies and TV series through my Apple.  When I go into town, my dog tells me that he doesn't have to watch stupid commercials that way.  I know this because he is always smiling when I come back to the cabin.  I have one at home, too, because I like the way it streams things my smart TV doesn't seem to stream.  Six million channels on the cable and there is nothing worh watching.  Ever feel that way?  An Apple will fix you right up.", "verified": true, "helpfulness": "0/0", "author": "J. Leebron"}, {"rating": 5.0, "review": "I was looking to purchase a 2nd Apple TV for another HDTV in my home.  This used device works just like the original MD199LL/A I already had, and gives me the ability to wirelessly stream TV shows I've recorded via my Mac/EyeTV/Pinnacle HDTV Tuner for the Mac.  This setup, coupled with an Over-the-Air Antenna, has enabled me to ditch the DVR Recorder and cable service from Comcast.  Three months' worth of saved rentals/cable costs and I've paid for my equipment.  I wasn't watching anything besides the local channels anyway.", "verified": true, "helpfulness": "0/0", "author": "Greg Sawatzky"}, {"rating": 5.0, "review": "If you have the internet and other Apple products, then this is a no-brainer kind of purchase.  It syncs with your other devices and provides excellent viewing of shows on all the major networks.  I also have a Netflix account, which makes Apple TV even better.  I can view past seasons of favorite shows in just a few moments.  The remote is tiny and subtle, much what you would expect.  Of course, there is an app in case you lose it.  Great product.", "verified": true, "helpfulness": "0/0", "author": "Kimberly N. Miracle"}, {"rating": 2.0, "review": "easy to start and operate, but it is not always easy to connect mobile devices and stream a video on it, gives a lot of errors, slow, they have to find an other way for the search may be voice command like the Amazon TV. no a great buy, overpriced", "verified": true, "helpfulness": "0/0", "author": "Zzz"}, {"rating": 5.0, "review": "Great product A+", "verified": true, "helpfulness": "0/0", "author": "Vishal niranjan"}, {"rating": 2.0, "review": "WTF - I'm very disappointed this POS. I purchased this to replace a broke Roku, but I  should have just picked up another Roku, not only is the Roku cheaper, but it actually has Amazon Prime listed.If you don't care about Amazon Prime, then it works fine.", "verified": true, "helpfulness": "0/1", "author": "DFiore"}, {"rating": 5.0, "review": "This is a devise to broadcast the screem of your Apple device on your TV... I really like and recomend this.", "verified": true, "helpfulness": "0/0", "author": "Jorge"}, {"rating": 5.0, "review": "It's part of the Apple ecosystem that brings everything I love to my television with simplicity and elegance. Enough said!", "verified": true, "helpfulness": "0/0", "author": "mrcrader"}, {"rating": 5.0, "review": "I got two of these.  One for my place and one for my girlfriends place.  I have a Netflix account that we use at both places.  WARNING....it will show up at both places what has been watched at both places.  That's not a problem for me because we are together at one or the other places while watching movies.We have had them for two years, and we are very satisfied with them.I recommend this Apple TV", "verified": true, "helpfulness": "0/0", "author": "C. Foster \"Road Warrior\""}, {"rating": 5.0, "review": "Received it on time in good shapeEasy to install and useMakes it easy to connect your computer to your tvAccessing variety of stuff such as Netflix ,Hulu plus, YouTube, etcThanks", "verified": true, "helpfulness": "0/0", "author": "fma"}]