[{"rating": 3.0, "review": "This device contains quite a few programs. Some of which require a subscription. Thus far we only use it for Netflix. It does allow us to stream and the picture quality is good. However, it is awkward to search. It is awkward to rewind or fast-forward.The remote does not have an on/off switch and there is not a notation in the manual that shares how to turn it on and off. I assume when you turn the T.V. off, Apple T.V. turns off. To turn it on one must press menu on the remote.", "verified": true, "helpfulness": "1/1", "author": "Richard A. Ruppert"}, {"rating": 5.0, "review": "Installed on a 24 inch ViewSonic monitor.  It works precisely as advertised.  But had to purchase an additional cord/adapter item to get the sound as the monitor does not have a tuner.This was bought so grandkids would be able to watch programming off an Ipad II and from internet.  Good product.The only downside is the remote is very small and darn easy to lose.  Fortunately, the local Apple store has plenty of remotes for about 20 bucks.Very pleased with this solution for tv for grandkids.", "verified": true, "helpfulness": "0/0", "author": "Oldretiree \"Avid reader\""}, {"rating": 1.0, "review": "No Amazon Prime - blocks my Ipad NBC ap to Airplay as not supported. I got talked into this instead of the Roku 3 - should have trusted my gut to stay away from another Apple product.", "verified": true, "helpfulness": "2/15", "author": "Todd"}, {"rating": 4.0, "review": "If you have any Apple products the Apple TV is a must.  Airplay allows you to stream videos to your TV.  Great for Youtube, Netflix, and HBO go.  I traded in my Apple TV for a Home Theater PC, the only reason was because I wanted to DVR live TV.  If you have lite streaming needs the Apple TV will meet all your demands.", "verified": true, "helpfulness": "1/1", "author": "Christopher"}, {"rating": 5.0, "review": "My husband and I decided to cancel our cable/satellite and move to strictly stream our programming from the internet and Netflix. I opted for Apple TV instead of subscribing to something like Hulu Plus. There are, of course, pros and cons to both options. For me it boiled down to not wanting another monthly subscription so I am sacrificing on some content.Regarding my experience with Apple TV thus far...installation was extremely simple! I was up and running within 10 minutes. The first thing I did was bring up one of my major network apps on my iPad (abc/cbs/nbc) and using Airplay and the mirroring technology stream an episode of one of my favorite shows. Worked like a charm! (I did have to Google the steps on this because it wasn't listed in the manual how to set up Airplay, but it was very simple).  This was one of my main reasons for buying Apple TV, so I could stop watching my current seasons of shows on small screens like my iPad and iPhone (or computer). The picture was crystal clear and once it had a solid connection, it played flawlessly (a few hiccups at the start).After that, I brought up Netflix. This was just an added bonus for me that Netflix streaming was included, I already had this capability through my Samsung BluRay player and my Wii. But let me tell you, the Netflix experience using the Apple TV is stellar compared to the Wii and BluRay player! It connects extremely quickly, much quicker than my BluRay player and the look and feel is just outstanding.There are a lot of apps already available with Apple TV but be forewarned, you need a programming subscription with a major provider for a lot of the content. I knew this going in, so this didn't disappoint me. But there is still a lot that you can leverage: PBS, The Weather Channel, Radio, YouTube and more. Let alone anything in your iTunes.The one con is that iTunes rentals and purchases for movies, TV shows/series, etc. is pretty inflated, at least for my area of the country. Between RedBox, Netflix and brick & mortar rental stores, you can rent shows for much less than iTunes offers. The convenience is nice however, if that is worth the inflation to you.Some features I recently learned about but have not used yet: there is a special connection with Yahoo that you can use. I want to explore this more. You can also use your iDevice as a remote by downloading the Apple TV Remote app. I downloaded the app but haven't used this yet. The remote it comes with is nice and simple, but very small so downloading the app is a good back-up plan in the event the remote gets lost (I have a 4 & 5 year old!).I'm looking forward to the updates that Apple makes to Apple TV because as awesome as it is now, I know it is only going to get better. And for $99, your ROI will be quick if your eliminating a cable/satellite subscription like me.", "verified": true, "helpfulness": "5/5", "author": "Angela"}, {"rating": 5.0, "review": "It does what it's supposed to do very well. Set up was quick with no issues. I love being able to watch various channels and listen to iTunes Radio. Kids love Netflix and Disney channels. We bought it mainly for Netflix and iTunes music. Disney channels turned out to be a wonderful surprise.", "verified": true, "helpfulness": "1/1", "author": "Carole"}, {"rating": 3.0, "review": "We're still not sure this is really working in sync with the TV's (2 in home). Granted we have a 2007 iMac running IOS 10 updated as far as we can go with IOS and iMac; so we are not really sure when there appears to be conflict and we get odd messages on TV.  Since we are not die hard Apple users, the jury is still out.", "verified": true, "helpfulness": "0/1", "author": "Wind Sock @ RedTop Landing \"MadScientist\""}, {"rating": 5.0, "review": "Apple Tv is awsome you are able to watch netflex right off of it . You can access your itunes account off of it . you can stream any songs or videos or pictures off of your other Apple products off of this Apple Tv. I would reccomend this product to anyone that  has quite a few Apple products.", "verified": true, "helpfulness": "2/2", "author": "Randall Scott Brown"}, {"rating": 4.0, "review": "Great little streaming box with a simple-to-use interface.  I can't give it 5 stars since there is no Amazon Video app.  I'm sure it's because Apple doesn't want to compete with Amazon for purchasing and renting streaming movies.  I bought this as a present for my daughter and I'm considering buying one for myself, but due to the lack of Amazon app, I will be giving more consideration to some of the more popular competitors.", "verified": true, "helpfulness": "1/1", "author": "Timothy E. Raborn"}, {"rating": 4.0, "review": "Great buy for Apple and iTunes users. Stylish and sleek design. Works as described. Needs more apps like twc app and amazon prime.", "verified": true, "helpfulness": "0/0", "author": "rory levario"}]