[{"rating": 5.0, "review": "I can now watch all of the HD movies I've downloaded in iTunes on my 55\" HD TV.  I'm now renting movies in iTunes, instead of OnDemand through my cable company.", "verified": true, "helpfulness": "1/1", "author": "Mivici"}, {"rating": 5.0, "review": "[this device replaces an Apple TV version 2 and the review is based on that]we use this primarily to watch netflix and for the ken burns slideshow (as we have a wired house, and our best travel pictures setup for apple photoshare); the quality of the pictures (taken mostly with real cameras, ie. rebel, nikon P series, not iphones) is noticeably better; so much so that I have found myself watching it for quite a long time, since on a big flat screen, there's quite alot of depth to see, asnd I am truly seeing things in the photos that I have never seen before.as for the netflix support, it seems a bit better than it used to be, especially in the stopping/starting functionality. SWMBO watches her Bones on it, and the HD episodes seem very sharp and without pixellation or such problems as that (we also have a ROKU, just to be safe, so I do have something to compare this to; I've always thought the ROKU streams better than the Apple, but not so sure with this new ATV3; of course, as for the interface, there's no comparison, but i don't have time to go into that).", "verified": true, "helpfulness": "0/0", "author": "rompers uncle"}, {"rating": 5.0, "review": "I bought this unit primarily to access Netflix and Amazon Prime  (using Airplay).  It works great for both.  The Apple TV interface for Netflix is much better than the one provided with my LG Blu-ray player and streaming is more reliable.  It is also great for viewing your photo library on TV and accessing music on your networked computer with iTunes.  With Airplay you can mirror on your TV pretty much anything you can display on your iPad or iPhone and it works great.  There are quite a few other supported services and features that I have not used.  Using just one of the supported services would justify the purchase.", "verified": true, "helpfulness": "2/2", "author": "Stephan A. Henry \"Kansas_Traveler\""}, {"rating": 5.0, "review": "Great unit at a reasonable price. Would buy this unit again!This unit defines the words plug and play. Thank's!", "verified": true, "helpfulness": "1/1", "author": "Doug2"}, {"rating": 4.0, "review": "when i logged into Netflix, it had another user account already activated.i tried it and sure enough i logged in under their acount and they had their users set up!of course i logged out and re-entered Netflix under my credentials.but nonetheless, Amazon represented this a new and i got a used one.not sure how i feel about Amazon listing it as new yet selling an obviously returned unit.", "verified": true, "helpfulness": "4/4", "author": "Chinook"}, {"rating": 3.0, "review": "I really like the apple tv, but the only thing it really needs is Amazon so I can watch  my Amazon prime stuff for free, and I have more options to rent. I don't like how itunes is the ONLY source for me to rent movies from. I also wish Apple would have software for older modles of Macbook pro to watch movies through airplay. I mean, comeon! My laptop is only about 2 years old.", "verified": true, "helpfulness": "0/0", "author": "KIMBERLY D CASON"}, {"rating": 5.0, "review": "This took a little getting used to the remote, but the options it provides for viewing are great.  Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Hooks up real easy ready to go in fifteen minutes.I gave this as a gift to my daughters family and they have now dropped there cable.", "verified": true, "helpfulness": "0/0", "author": "oakaxehandle"}, {"rating": 5.0, "review": "I mostly use my Apple TV for the iTunes Stores (renting movies) and Netflix, but I also have an app called Plex Media Server on my computers that I can use to stream video to my Apple TV such as other downloaded media an can control everything from my iDevices. Perfect if you are in the Apple ecosystem and still works with Android through various apps.", "verified": false, "helpfulness": "0/0", "author": "dsjr2006"}, {"rating": 4.0, "review": "This is a great product that's for sure, however if you get one that needs a software upgrade, don't update it, especially if you use Netflix, it worked great for me until I finally updated the software. Now Netflix app is super slow, however again, this product in itself is still a great buy.", "verified": true, "helpfulness": "0/0", "author": "CHAD BOUCHE"}]