[{"rating": 5.0, "review": "This is the 2nd Apple TV device I have purchased.  The first one I purchased to use at home to stream audio from iPhone to my home stereo along with streaming video/pictures from my iPad to my TV.  It worked so well that I bought another one for the office to connect to our 80\" TV that we use in our conference room.  We have a lot of internal people with iPads and iPhones that want to show live content from their idevices that it seemed like a no brainer to hook this up.  We also get quite a few external people that show up to our office for meetings with idevices and want to show content on our screen, so again the Apple TV works great for allowing this to happen.A couple of things to note on this application of Apple TV.One, using AirPlay (the mechanism to connect to Apple TV from a iPad/iPhone) to \"mirror\" your screen to a display/tv will only happen in a 4:3 \"like\" format for the iPad and an even narrower format for iPhones.  So, if you have a wide screen display (i.e. 16:9 or 16:10) then you iPad screen mirror will only take up the center of the screen with black bars on each side.  The image will rotate along with the respective screen orientation of the iPad, so viewing the iPad in landscape mode will fill more of the screen but not all of the screen.  Not a big deal, just a comment.Two, some iPad/iPhone applications can stream directly to Apple TV in full screen mode without having to use AirPlay \"screen mirroring\", so you can fill your entire 16:9 wide screen.  For example the YouTube application can do this and fill the entire TV screen.And lastly, some ipad/iphone applications can deny your ability to use AirPlay to stream to your Apple TV.  For example, I was hoping my Xfinity application would allow me to stream movies to my TV but it told me I was not allowed to use AirPlay. :-(Just things to consider if you want to use the Apple TV for video streaming.  Streaming audio to your stereo system works great!  You need an optical digital input on your stereo to do this, so keep that in mind.  You can even stream music from your computer in iTunes over your network.  The Apply TV can connect to your network over Ethernet or WiFi.", "verified": true, "helpfulness": "1/1", "author": "Vertech"}, {"rating": 5.0, "review": "I still do not know all of the things that this amazing piece of technology can do!  I love to use it to watch reruns for free.", "verified": true, "helpfulness": "0/1", "author": "Amanda Weibel"}, {"rating": 5.0, "review": "Easy to set up and use. Great alternative to on demand thru cable.  Encourages binge watching tho so be warned!", "verified": true, "helpfulness": "0/1", "author": "Gretchen L. Lomker \"glomker\""}, {"rating": 5.0, "review": "Streaming Netflix is a breeze now! The set is so simple ANYONE can do it, there's really no set involved, you plug in the HDMI cord, the power cord and boom, you're up and running. It's a bit on the pricey side, but you won't regret this purchase. Movies stream seamlessly and having the ability to play my iTunes through my tv from my home computers library is a huge plus!", "verified": true, "helpfulness": "0/0", "author": "Terra M. Johnson"}, {"rating": 5.0, "review": "Apple makes the coolest products. And it offers channels I can not get on my cable. Smithonion channel is on I have wanted and Dish does not offer. Thanks Apple.", "verified": true, "helpfulness": "0/0", "author": "Gina M. Whitmarsh"}, {"rating": 5.0, "review": "Works well. We can now watch films etc with no commercials!Wish we had gotten one earlier.Good oroducpt for us.", "verified": true, "helpfulness": "0/1", "author": "annette richardson"}, {"rating": 4.0, "review": "Apple TV is a great product - had many versions of it. However, it would be great if Amazon Prime was available like Netflix and Hulu Plus is but we all know that's a long shot now.", "verified": true, "helpfulness": "0/1", "author": "Technic"}, {"rating": 5.0, "review": "If you love apple, you'll love this.  We liked it so much we bought another one for a bday gift.", "verified": true, "helpfulness": "0/1", "author": "Kimberly A Simon"}, {"rating": 5.0, "review": "Great device!!! Super simple to set up!!!  Super friendly as usual from Apple very light and small go get it today", "verified": true, "helpfulness": "0/1", "author": "Chasity McDonald-Rocha"}, {"rating": 5.0, "review": "I love it, but can't wait for a software refresh. The only thing that worries me is the monopoly that the cable / DSL companies have will drive up content prices.", "verified": false, "helpfulness": "0/1", "author": "arrggghhh"}]