[{"rating": 5.0, "review": "Works as advertised. Use it daily", "verified": true, "helpfulness": "0/0", "author": "Romans 1:16"}, {"rating": 5.0, "review": "This is much easier to use than our Roku with less issues.  I wish Apple TV would strike a deal with Amazon so we could see our Prime videos without having to mirror or install an additional app, but hopefully they will in time.  I highly recommend this if you have other apple products because they all work together really well.", "verified": true, "helpfulness": "0/0", "author": "B.Crane"}, {"rating": 5.0, "review": "I always kind of laughed at this but I found out my sister has one and after playing with hers I bought one.  Just the feature of being able to show all our pictures we take on trips off my phone on our big screen TV without any hassle is work the $89 I paid on Amazon for it.  You have to go through most of the program apps and sign in using your cable provider in order to use most of them.  If you don't have cable or satellite then this is mostly workless.", "verified": true, "helpfulness": "0/0", "author": "Dave4047"}, {"rating": 5.0, "review": "wotks great", "verified": true, "helpfulness": "0/1", "author": "Aakash"}, {"rating": 5.0, "review": "whole family loves it. easy to use", "verified": true, "helpfulness": "0/0", "author": "B. Campbell"}, {"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/0", "author": "Carlos Rodriguez"}, {"rating": 5.0, "review": "Best invention ever. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 5.0, "review": "Always great. This is the third one we bought and it works great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "BB \"BB\""}, {"rating": 5.0, "review": "This is an awesome, trouble free way to \"cut your cable\" and Apple constantly does behind the scenes \"push\" upgrades (you control the privacy settings) that add features and apps to this device. I will say, why would ANYONE, buy this from Amazon or any other third party seller for $109 when you can buy them all day long at Apple's refurbished store for $75.00 with a new shell, and one year warranty and they look and run as well as brand new??? I own 5 (soon 6) of them (plus 2 first generation ones with 160 gig storage) and these are \"bulletproof\", trouble free (set them up, and forget them), and all were $75.00 each. We have one on a switched outlet in the master bathroom, that daily has power turned off and on, and when turning it back on it never ever loses its settings or network connection. Plus I can use them the TVs connected to them as extra wireless speakers, or use other networked speakers as sound source for that tv, or stream to the TV from my iPhone or iPad, or computer (late model apple only). This product's integration into the apple ecosystem is one reason Apple has become such a technology juggernaut. It just WORKS!!", "verified": false, "helpfulness": "2/2", "author": "JJ \"John\""}, {"rating": 5.0, "review": "I ditched a cable box for this.", "verified": false, "helpfulness": "0/0", "author": "HB"}]