[{"rating": 5.0, "review": "It is a wonderful asset to my classroom instruction.  I don't know how I lived without it all this time.", "verified": true, "helpfulness": "0/0", "author": "Pamela L. Walker"}, {"rating": 3.0, "review": "Apple TV seems to be behind the curve to ROKU's channel offerings. They are expanding with more channels (AE and Historty) but mostly with those who already have cable television subscribers. Currently, the service is available to customers who subscribe to DirecTV, Verizon FiOS, and Cablevision Optimum, with support for additional providers coming in the near future. I have Comcast so i am out of luck.There are a couple of issues.Inputting username and password is a bear with the small remote control. Once it is done you should not have to re-enter the information.No Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "BG"}, {"rating": 5.0, "review": "An Amazing product and so easy! Perfect for Netflix, music, and images. So glad I bought it and great price!", "verified": true, "helpfulness": "0/0", "author": "Brooke Palmieri"}, {"rating": 5.0, "review": "Excellent! Very satisfied with the product. Would recommend it to anyone out there who wants to buy it. Happy happy", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "It works perfectly!  My husband loved it ( I bought it for him for our 10th wedding anniversary)!  Thank you for such a great product!Mahalo!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Watanabe \"Jen Mamo\""}, {"rating": 3.0, "review": "I guess I was expecting too much from it. I already have a TV with internet...has all YouTube, Netflix etc. I thought it will be easy to just play apps on TV. But unfortunately, even when I can switch to TV, most apps just offer mirroring, my iPad and iPhone batteries are still being used and they become useless when I am mirroring. Also, some iPad apps , like CBS, do not even work full screen on TV, I feel like just using my iPad to watch those things. Also no slide show options for pictures on my device.... Well as I said, it's ok and maybe I was just expecting too much...", "verified": true, "helpfulness": "0/1", "author": "S. Prakash \"SP\""}, {"rating": 4.0, "review": "Like what this has to offer, didn't really realize many things like movies and all have to be purchased.  Not quite like a smart tv, but close.", "verified": true, "helpfulness": "0/0", "author": "Steve H."}, {"rating": 5.0, "review": "This device is a perfect match for my iPad and flat TV to use in my classes and at home. I reallly enjoy using this new technology. Thanks once more.", "verified": true, "helpfulness": "0/0", "author": "Eliberto Martinez"}, {"rating": 5.0, "review": "Loving the apple tv I bought.  The main purpose I purchased it for was to play MLB.TV and it works like a beauty.  Streams full 1080.", "verified": true, "helpfulness": "0/0", "author": "Eric Gustafson"}, {"rating": 4.0, "review": "I first must say that I develop private apps for both apple ios and android.  In saying that i want it to be clear that i like both platforms.Ok to the review.  I own this apple tv , roku 3, chrome cast and amazon firetv, I'm a cord cutter, tired of paying the huge cable bills.  So this review will have a pros and cons that considers the four \"tv boxes\" versus each other.ApplePros: smooth operations as far as the software goes (best  i have used), works great with all apple productsCons: software is smooth because apple limits the developers by only allowing certain looks and interactions, doesn't work with some other branded products, very limited apps. limited processor versus some of the others.Roku 3Pros: great overall box, largest number of apps (channels), smooth operations.Cons: no real cons except the slower processor (doesn't have a huge effect now but may in the future)ChromecastPros: Cost (cheapest of the four), easy install, size (smallest), cost, cost, costCons: need a computer or ipad/iphone/tablet or some other type of controller to operate, wifi reception is a little weak, buffers more than the others, has limited number of apps, has a limited processor.Amazon FireTvPros: best processor, with newest firmware as of may 29 2014 is very smooth, rapid growing number of apps, the voice search is nice and has improved.Cons: not many, i love this guy and will probably buy another one.To conclude i hope apple will allow for a little variety in their apps and open the API to the public.  I also hope that apple releases a new apple tv with improvements (basically to match the other in hardware).People who are apple fans will love this product, people who have a lot of apple products will love it, people with no apple products will be ok with it, and people who prefer other operating systems (windows, android, linux, etc) will probably prefer the Roku 3 (or maybe chrome cast,or amazon FireTv).", "verified": false, "helpfulness": "1/1", "author": "Empiror22"}]