[{"rating": 2.0, "review": "It is very annoying that only Apple devices can stream using this device.  I wish Apple supported working with non-Apple devices.  Feels like I'm struck with Apple Inc.", "verified": true, "helpfulness": "1/2", "author": "Udayakumar Dhansingh \"Udy\""}, {"rating": 1.0, "review": "i should've known this this would be as locked down as it is. The main reason I chose it was because its HBO Go app works with comcast, while roku's does not (which is completely retarded and another discussion altogether). The quality of said HBO Go was was worse than I could imagine. Netflix's HD offerings look pretty damned good, so that's what i was expecting from a premium channel's stream. Anyways, this box might be good, if I had more money than brains and wanted to waste it on itunes videos, which are only useful in the apple ecosystem. Not sure what idiots pays these prices for something they can't lend, trade, give away, or sell. I guess the same is true of ALL drmed video. At least with discs, I'm capable of doing what i want with them. Another thing I hated was the sparseness of channels. I'd expect more big players like Amazon Instant Video to be available, but nope. The plusses I can think of are that it works well with my iphone, the airplay thing seemed cool, until you realize how many apps (like Amazon Instant Video) are crippled to not work. That, and i can stream all my music, but have to have itunes open to do so. Overall,  if you leave and breathe Apple, thus might be a good deal, but not if you want any sort of value.", "verified": true, "helpfulness": "12/23", "author": "sixsixtysix"}, {"rating": 1.0, "review": "Let me preface this by saying I'm a huge apple fan. I own multiple Apple devices. I was really excited to receive and try out the new revisions of the AppleTV3.Unfortunately, it did NOT work with my TV. I was using a 2012 model Toshiba 50L5200U. This TV is HDCP compliant (according to the TVs manual) but I could not get any video out signal from the AppleTV.I tried 3 different HDMI cables, in the 3 different HDMI ports on the TV in various combinations and it would not detect a video out signal from the ATV. Audio however, worked (using optical audio out).I have read various forums saying AppleTV3 will not product a video out signal if the TV is non-HDCP compliant but this model is. I have heard people reporting similar issues after updating to the newATV firmware. Ive since returned this unit for a refund and will go with a Roku3. Highly disappointing that it would not work as I've always associated Apple products with reliability.", "verified": true, "helpfulness": "9/16", "author": "absolutnate"}, {"rating": 2.0, "review": "I bought Apple TV mostly to be able to wirelessly stream movies and other programs from my iPad.  The channels directly available on the device were pretty much the same that I could get from my Samsung tv, so the airplay from my ipad was important. Well, I just can't get the airplay to work.  I went to all the blogs and support sites and it seems like it's a common problem.  So, I gave up and bought a roku 3 and it's great. I can get all kinds of new channels, many fee, some paid. I think it will allow me to downgrade my satellite tv channels and save a lot of money each month.", "verified": true, "helpfulness": "0/2", "author": "B. Biello"}, {"rating": 1.0, "review": "Most of the reviews here are spot on - unless you already own Apple equipment, buy a Roku instead...I found a major bug which is not yet resolved as of this writing.  At first startup, or if the Apple TV ever gets unplugged or there is a power failure, the Apple TV goes into an endless loop trying to set the date and time.  After searching the web, I learned that you need to use a secondary wifi source, such as your cell phone's hotspot, to connect to the Apple TV - this fixes the problem, and you can then go back and connect using your wireless router.Each time you have to reconnect to your router in this fashion, you then have to re-enter your router's password using the klunky Apple TV user interface.  Then you can finally use your Apple TV again.Until this odious bug is fixed, DO NOT BUY THIS PRODUCT.", "verified": true, "helpfulness": "8/16", "author": "Kevin Carlson"}, {"rating": 5.0, "review": "Sorry for the comparative review,but Ii have a Roku 3,Roku 2xs, the Apple TV and Sony Internet TV with Google TV.  So I should be able to compare them. I purchased Apple TV, because I wanted to be able to use it io view my iPad, and the Roku does not have A Youtube channel. I find myself mainly using the Roku, but probably because I cant have Hulu on both devices.Even though I like checking the Roku app store, I rarely watch anything that Apple TV does not have. The Apple works smoothly, and was easy to set up. I have not had enough time with the Sony TV to comment, but I bought the Sony because it has Google chrome, and Google TV! which might be less expensive for renting, or buying titles. Since the Sony has so many options, and channels, and apps, if it works smoothly it might completely replace the functionality of the Roku, but not the Apple.  The one thing about Roku 3 is that you have the headphone jack on the remote. So I am finding that all three devices are great, I don't have cable TV so I have gone wild with these things. If you are an Apple person you should get one. If you don't have a Mac or iPad, it is great, but you might want to wait until the verdict is out on the Sony, or the Roku 3 for a less expensive, yet robust, mature experience, Or if you are saving a bundle, not paying for a landline and cable etc., then if the Sony turns out as good as the price, get both the Apple TV, and the Sony w Google TV.", "verified": false, "helpfulness": "1/1", "author": "harmono"}, {"rating": 4.0, "review": "We use it to watch Netflix and also to AirPlay to iPad and laptop. It is small and very easy to use.", "verified": true, "helpfulness": "1/2", "author": "calbearaya"}, {"rating": 5.0, "review": "Love the way programs are set-up with no commercials,  Have not had a chance to sink with computer.  Getting ready for the magic conventions.  Wish we had WIFI in our camper.  Have to watch DVD's.  Slick unit.", "verified": true, "helpfulness": "1/2", "author": "Michele Parkes"}, {"rating": 5.0, "review": "it may be more limited in some aspects, but as far as build quality and reliability there isn't anything else close.  if you already own apple products, this is a no-brainer.  plus, apple is set to add much more content in the near future (others are trying, but apple has the $ to pull it off).chromecast is a joke, even at $35, or whatever their latest \"promo\" is (google netflix promo, what a scam).  just a failed google tv stripped down.  don't believe me, google it.", "verified": false, "helpfulness": "2/3", "author": "DJ Walker"}, {"rating": 5.0, "review": "I have canceled my cable since I got this... Rent movies from iTunes, have Hulu and Netflix... The one disappointment is no amazon prime...", "verified": true, "helpfulness": "1/1", "author": "Skleathers"}]