[{"rating": 5.0, "review": "We can flip our tv shows, videos, games and everything else up on the tv! Plug in and start watching.  Easy easy.", "verified": true, "helpfulness": "0/0", "author": "Linda M Wilson"}, {"rating": 5.0, "review": "I don't usually write reviews but the device is amazing!  It's a all in one super machine for your apple devices. Just one click and its on the tv screen.Cons: I have an iPhone 4 and iPad 2 so it limits some of the display options. Another con is its way to easy to rent movies now!", "verified": true, "helpfulness": "0/1", "author": "Zach"}, {"rating": 5.0, "review": "One for my shop, Bought one for my parents and one for my LR Bedroom. Some people want the Apple TV 2 because of Jail breaking. I don't know. This is 1080P the 2 is 720. Only other channel I wanted to watch was HBO GO so I got a ROKU XS. Same thing as Jail-breaking an Apple 2 but its 1080P so is the Apple 3 and a lot less money that a Jail broke Apple TV 2 Plus,if you screw up and get your Apple TV 2 updated, you lose your Jail Break. This is a great product. Oh the updating over wifi would not work. Failed on all three. Found a Mini USB from an old cell phone and plugged it into my computer, Opened iTunes, update screen popped up and in 5 minutes had the latest firmware.I would buy this over the Apple V 2 even if they were the same price. Great picture! Great audio, Air play, Blue Tooth, everything I need!", "verified": true, "helpfulness": "0/0", "author": "Mark Schuster \"m6255\""}, {"rating": 5.0, "review": "I love this thing. I have one in the living room and one in the bed room. Can't fall asleep without it. No problems whatsoever.", "verified": true, "helpfulness": "0/0", "author": "Jason Sandblom"}, {"rating": 5.0, "review": "5 minutes out of the box and I feel like I've used this product forever. Nice small size. Wonderful product. Have sold 5 more of these to family members who have been over.", "verified": true, "helpfulness": "0/0", "author": "craig Erickson"}, {"rating": 3.0, "review": "The Apple TV MD199LL/A does exactly as advertised, however, it doesn't do much more.  As the owner of several Roku streaming devices we are used to being able to add our favorite channels for streaming.  These channels include Amazon Prime, which is not available on Apple TV.  We were VERY dissappointed to find that we cannot add channels without \"hacking\" the device.", "verified": true, "helpfulness": "0/1", "author": "Justin Wright"}, {"rating": 5.0, "review": "Few times in life can it be said a product is a game changer, a true life enhancer. I can say with a soul untouched by marketing ghouls or any partiality developed by product loyalty over the years, that this item has changed the course of my life. This product has the ability to take any mundane, boring life, and make it analogous to being Crocket in Miami Vice as you drive along a hot Miami freeway at night with the top down. This product is the air I breathe, the warm touch of sun on my skin, the look of love reflected in a child’s eyes. If I was ever trapped in a layer of the space time continuum with no hope of escape, and could only have one item to spend the rest of time with, it would be this item. I attempted to take a picture showing me with this item, but so much of my pure essence is focused on enjoying this item that I no longer reflect light as a normal person and can no longer be seen in a standard photograph. I would say more, but that would take time away from using my item, and I physically cannot handle that…..", "verified": true, "helpfulness": "0/1", "author": "Timothy Mattingly"}, {"rating": 5.0, "review": "We are super happy with our Apple TV. We use it in the bedroom to watch the occasional Netflix, etc. We were plugging iPad into TV with a 10 ft HDMI cord before and that was a pain in the butt!Apple TV is super easy to use and took less than 5 min to set up. Love that we can also access the iTunes content from my computer upstairs, including movies that I download as torrents and convert using Vuze. We've even used it to watch videos from YouTube or to listen to the iTunes radio stations.", "verified": true, "helpfulness": "0/0", "author": "colebillcole"}, {"rating": 4.0, "review": "I'm glad to have the AppleTV as it's fun and ads a new dimension to our entertainment.I had a problem with network/WiFi conectivity drops but believe I made some changes in the WAP that have taken care of it.The thing I'm surprised about, and disappointed in is the lack of comprehensive music and playback control.  To add music to what's playing is useless.  If you don't build playlists or play by category like genre, artists etc., you really can't build a current play list or \"now playing\" and have mush control over it.There are probably better appliances out there for a little less money, but over all, I'm pretty happy with this.  I do hope they add more control to it though.", "verified": true, "helpfulness": "0/0", "author": "J. Kennedy"}, {"rating": 5.0, "review": "APPLE TV is easy to add on to existing TV.  Adds wide variety of additional options to your potential viewing choices.  Also allows you to project photos, keynote presentations, videos from you iPhone or Apple computer with ease.  Versatile with frequent updates to units options/capacity.", "verified": true, "helpfulness": "0/0", "author": "Bill"}]