[{"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Luis Gonzalo Giner"}, {"rating": 4.0, "review": "Honestly, although i do not own any other Apple products, the Apple TV has become a staple. Honestly, the Netflix and Favorites features are worth it alone, even for those like me who don't actually watch much TV. If the Search capabilities could be connected through a phone app or a keyboard so that letter entry did not require scrolling through the entire alphabet, my score would be a 5. Go for it, people! --Danny Ronen", "verified": false, "helpfulness": "1/1", "author": "dronen"}, {"rating": 5.0, "review": "Keep adding more streaming apps. Love watching 1080p movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Doug Bandy"}, {"rating": 4.0, "review": "Great product. Looking forward to more channels", "verified": true, "helpfulness": "0/0", "author": "Matt Phillips"}, {"rating": 5.0, "review": "It's been a while since I purchased this but I thought a review was in need. I also own the Roku and also have a Samsung Smart TV and both offer very similar features and services. Based on using all three of these, I can honestly say the Apple TV has the best overall ease of use when selecting the different streaming services offered out there. You can tell they really put time and effort into their menu navigation. Not only is it much easier and quicker but it's also more aesthetic! I would buy this product again!", "verified": true, "helpfulness": "0/0", "author": "Art Harrington"}, {"rating": 5.0, "review": "EXCELENTE", "verified": true, "helpfulness": "0/0", "author": "Pablo"}, {"rating": 4.0, "review": "Was disappointed to find I couldn't share my desktop on my 2010 MacBook 13 inch.", "verified": true, "helpfulness": "0/0", "author": "Paul Gardner \"Conductor of Magical Publishing\""}, {"rating": 5.0, "review": "got it ofr my husband very happy with it", "verified": true, "helpfulness": "0/0", "author": "Eileen Compani"}, {"rating": 5.0, "review": "Great, I love it.", "verified": true, "helpfulness": "0/0", "author": "Simone Schmeer"}, {"rating": 5.0, "review": "I had used an Apple TV device for years.  I replaced my older Apple TV with this one to take advantage of the enhanced resolution.  i use it to watch TV (from iTunes, HBOGO, Netflix, etc.) and stream content from my iPads and MacBooks.  The device is simple to use, and, while I absolutely hate using the VERY basic remote to enter text/passwords, once that's done, it's all good.  device comes with just itself and a power cord, so be sure to pick up an HDMI cable if you need one...", "verified": true, "helpfulness": "0/0", "author": "Sam Beckett"}]