[{"rating": 3.0, "review": "Purchased this Apple TV for my parents to hook to there Sony Bravia tv via hdmi cable but connection goes in and out. Have updated the tv, updated the Apple TV, tried numerous different hdmi cables and no luck getting it to stay connected picture goes in and out. The voice talking on the Apple TV is by far one of the most annoying I have heard and at first even after I turned it off still kept going. After trying 6 different hdmi cables finally got one that for now seems to work with it. Will see how it goes and hope the issue I had initially is no more. Both junk hdmi cable and funky glitches in Apple TV.", "verified": true, "helpfulness": "1/1", "author": "A. Mancheski \"A Yooper\""}, {"rating": 1.0, "review": "I have a love/hate relationship with Apple, but I just hate this thing. My feelings would be different if there was a Jailbreak for it (coming soon) and if in that Jailbreak I could access more things. What's the problem? NO APPS! Do you use Amazon to watch movies? Well, you can't on Apple TV. Do you watch cable shows on Xfinity? Can't do that on Apple TV. What about HBO GO? Nope! All you get for streaming is Netflix, other then Hulu which is crap. I am not even able to use Air Play and watch these apps on my iPad through Apple TV. What's the point of a set top box without useable apps? What's the point of Air Play if I cannot watch these apps that are on my Ipad? I have the first generation Roku and it is far more capable then this thing. If you own or have ever used a Roku then don't even think about this device. Apple needs to open up the source code on this and let people create apps for it. Some of the previous mentioned apps are an issue with them and Apple not seeing eye to eye, but as the customer that is not my problem.", "verified": true, "helpfulness": "8/16", "author": "D.Graham"}, {"rating": 5.0, "review": "Works just as says.Setup is a little difficult but worth it.Can show my I phone or my I pad on our 70 inch big screen so everyone can see.", "verified": true, "helpfulness": "1/2", "author": "Lewis Myatt"}, {"rating": 1.0, "review": "Computer to tv doesn't workphone to tv doesn't workhas netflix but not amazonrepeated tries were unsuccessfulApple phone support minimal", "verified": true, "helpfulness": "2/7", "author": "Bill SCHAAF"}, {"rating": 5.0, "review": "Plugged it in and it worked immediately.  Couldn't have been easier.  Easy setup and easy use, like most apple products.", "verified": true, "helpfulness": "1/2", "author": "Trey Kenna"}, {"rating": 5.0, "review": "Love IT!This is like the answer to cable companies and their pricing. I got Hulu+ and Netflix and stream EVERYWERE I GO!!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love having this little box bring magic to my TV box.  It's easy to use, and Apple keeps it up to date.", "verified": true, "helpfulness": "0/1", "author": "Marcia Corbett"}, {"rating": 5.0, "review": "Got one for the bed room tv, so good I may get one for the main tv too; Fun free games and apps.", "verified": false, "helpfulness": "0/1", "author": "John Rodrigues \"Saw Man\""}, {"rating": 5.0, "review": "A good deal. The machine is working well. I've been with a tie for iPhone and iPad Mini. It was enjoy high-quality video", "verified": true, "helpfulness": "0/1", "author": "Abdullah"}, {"rating": 5.0, "review": "This iis the second one I've purchased.  This time for the bedroom tv.  Easy to install.  No problems. Now  I can watch my PC ITunes movies in the comfort of my own bed.", "verified": true, "helpfulness": "0/1", "author": "R. M. Chang \"puhau1230\""}]