[{"rating": 5.0, "review": "I love it, but can't wait for a software refresh. The only thing that worries me is the monopoly that the cable / DSL companies have will drive up content prices.", "verified": false, "helpfulness": "0/1", "author": "arrggghhh"}, {"rating": 5.0, "review": "Apple TV - I just love my Apple TV and what I can do with it! all my iTunes and iPhotos and iPhone stuff just works while playing through the Apple TV.  These other TV streaming set top boxes are half products at most!", "verified": false, "helpfulness": "0/1", "author": "gavin blur"}, {"rating": 5.0, "review": "This is a good device, works well with my Panasonic 42 inches screen, with my MacBook Pro, Iphone or Ipad. It's good made but a little bit expensive.", "verified": true, "helpfulness": "0/1", "author": "Nestor ABS"}, {"rating": 4.0, "review": "I use this on a daily basis. Set up and connection is really easy. I wish there was more free things to watch and movies are really expensive to rent.", "verified": true, "helpfulness": "0/1", "author": "Theresa hirsch"}, {"rating": 5.0, "review": "This is the future of TV.  simple to use, links to the apple ecosystem and conntect to (Netflix, HBO, Youtube)", "verified": true, "helpfulness": "1/1", "author": "Jay Brower"}, {"rating": 5.0, "review": "If you own anything apple this is a must have. You can send all of your content to the screen. I have owned for 3 years. I am so happy I bought a second one for my new jacuzzi bathroom tv.", "verified": true, "helpfulness": "0/1", "author": "Soberyogi"}, {"rating": 1.0, "review": "I used to have an Apple TV in the past and loved it. That was part of the reason I purchased a new one. After receiving my new model I started having issues with the ATV dropping out of home share. While watching a movie it would drop like every 5-10 min. It was so aggravating. Doing some research on line I found that this was a common problem. Apple still has not come out with a fix. I have traced this problem to at least a year ago. Many people have complained about this issue with Apple. They still have come out with a correction to this issue.I loved this product in the past and would happily recommend this to others if Apple would get on board to fix the glitch. Right now my ATV 3 is a hundred dollar paperweight.", "verified": true, "helpfulness": "25/28", "author": "James"}, {"rating": 5.0, "review": "Love it!!  Great product I would suggest this to anyone interested especially in mirroring their ipad to your tv .........great idea!!!", "verified": true, "helpfulness": "0/0", "author": "JoVonna White"}, {"rating": 5.0, "review": "So easy to set up. Simply plugged in 2 cords (had to purchase HDMI cord separately), did the software update and it was up and going in about 5 minutes. I am a photographer and I love being able to see my photos on a big screen. I also enjoy being able to see my videos and movies that I purchased from iTunes on the big screen.  It does so much more, like being able to rent new lelease movies for about $4.99.  I can't wait till my kids get home from school, they are going to love it. I may purchase a coupe more of these for my kids rooms as well. They will love watching Netflix and utube videos on their tvs. Thumbs up Apple you've made another great product. I should have bought this long ago.", "verified": true, "helpfulness": "0/0", "author": "LaCindra"}, {"rating": 5.0, "review": "Bought it as an xmas gift for my parents and they love it.  It was easy for them to setup on their own and start using which is a plus.", "verified": true, "helpfulness": "0/0", "author": "Sundevil"}]