[{"rating": 5.0, "review": "I had no problems out of the box but after the first software update, it would not stay connected to my Wifi.After calling Apple, it was decided to do a full software restore by plugging it into a computer running iTunes.  This procedure fully resolved the connectivity issue.", "verified": true, "helpfulness": "0/0", "author": "John K."}, {"rating": 5.0, "review": "I have an apple tv 2 that only does 720p. This is a huge difference on picture quality. If you are an Apple person, this is a must have.", "verified": true, "helpfulness": "0/0", "author": "BillyP"}, {"rating": 5.0, "review": "Apple TV is an amazing entertainment device, and really delivers on its promise. The Airplay feature alone would make it an outstanding device, but the variety of options and choices of programming to view is stellar. Really love it!", "verified": true, "helpfulness": "0/0", "author": "Jacob Hedgecoth"}, {"rating": 4.0, "review": "I don't know if it was refurbished but device looked like brand new. And works flawlessly. I love it a lot", "verified": true, "helpfulness": "0/0", "author": "Julio A. Villanueva \"javillanueva67\""}, {"rating": 1.0, "review": "Although Apple states that you can push anything through AirPlay to your tv, this is not true.  Apple has blocked the Xfinity App on the Apple TV device and the transmission is blacked out.I had intended to use this in a room in the house where I do not have cable run, and it would have worked well, if it worked as advertised.  Sadly, after contacting Apple they refused to return/refund the device, as they stated it was working properly.  For other Comcast users in a similar situation, however, I hear that there is a Samsung Smart Box that would work.I suppose there are other applications that I can access with this unit, but the live broadcast access is limited, and their channel lineup is not nearly as robust as some of the other devices out there.  They just want you to buy everything via iTunes.  Disappointing.", "verified": false, "helpfulness": "0/2", "author": "Justin Camer"}, {"rating": 5.0, "review": "We have an Apple TV in the den that we mostly use for Netflix and to mirror images from iPad or iPhone. We enjoyed it so much that we decided to purchase one for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "familyman04"}, {"rating": 5.0, "review": "I just want have simple watch tv instead watch all the cable also setup is not hard. You can connect all Apple Device to Apple TV even your MacBook Pro can do it.", "verified": false, "helpfulness": "0/0", "author": "Mo"}, {"rating": 4.0, "review": "Purchased a second one for the den.  Have issues with losing audio when going to mirroring mode  Not sure whether problem is with AppleTV, HDMI cable or operating system updates.", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 5.0, "review": "Beats Chromecast by 10,000%. Easy to use, works as stated.  If you purchase you will not be disappointed.  As always Apple put out another great product.", "verified": true, "helpfulness": "0/0", "author": "Bruce Olmsted"}, {"rating": 5.0, "review": "So far we are using it for Netflix and viewing our own photos and movies as well as others that are sent to us or are on-line.  We have our high speed DSL cable connected directly to it and have not tried our WIFI as we did not need to and wanted to avoid any potential problems.  All of our computers are Apples as well as our iPhones so we know and like the platform.There has not been one blip or problem of any kind in the month we have been using it.  The quality of the image is outstanding.  Our only fear is that of losing the beautiful, but very tiny remote that came with it.  I have been using my iPhone as the remote with the ap for that and it works perfect.", "verified": true, "helpfulness": "0/0", "author": "K.C."}]