[{"rating": 5.0, "review": "My husband had bought one of these units at the local Apple store.  He like it so much, he wanted another.  This was about $10 less expensive for the same product", "verified": true, "helpfulness": "0/0", "author": "Ruth D."}, {"rating": 5.0, "review": "This was a Christmas present for my husband, and it made him extremely happy.  He played with it all day like a little kid.  Lol!", "verified": true, "helpfulness": "0/0", "author": "DVelle"}, {"rating": 5.0, "review": "This works great - the picture quality is amazing and it is very easy to set up - love it.", "verified": true, "helpfulness": "0/0", "author": "TJF"}, {"rating": 5.0, "review": "Great product.  Airplay worked right out of the box with little configuration needed.  I hooked this up to my stereo and TV and it looks and sounds great, I love it.", "verified": true, "helpfulness": "0/0", "author": "Brandon Calhoun"}, {"rating": 2.0, "review": "The only thing this so called \"apple TV\" mirrors well is youtube .. games are sluggish .. and very sluggish .. i have a 50 mpbs connection ..so network was never an issue .. streaming from my laptop to smart tv works flawlessly .. Stay away !!", "verified": true, "helpfulness": "0/4", "author": "Santosh Dash"}, {"rating": 4.0, "review": "My son recommended it because when he watched Roku on my 50\" Vieja and he thought it was slow to load Neflix or Amazon Instant Video. Respecting his opinion, (he had just received an Emmy for his CGI work for \"Rising:Rebuilding Ground Zero\"), I bought the Apple TV. It was easy to set up and use. It has a large number of APPS, but unfortunately not Amazon Instant Video.I called Apple to ask why, the answerer replied that many people had asked the same question and he would pass on my request to his marketing department.", "verified": true, "helpfulness": "0/0", "author": "ERIC BANNISTER"}, {"rating": 5.0, "review": "Their teacher wanted one to display some things from her iPad onto the TV.  It's worked great for that purpose.", "verified": true, "helpfulness": "0/0", "author": "J. Rader"}, {"rating": 5.0, "review": "Excellent choice for not smart tv with FHD support, the airplay mirroring is good, but when displaying the pics and videos from iphone it takes quite a lot to load. More apps needed.", "verified": true, "helpfulness": "0/0", "author": "Camilo F. Vargas"}, {"rating": 5.0, "review": "Easy to operate after initial setup with home computer equipped with WiFi.  Viewing choices are good although Netflix is somewhat stale.", "verified": true, "helpfulness": "0/0", "author": "R. Medeiros \"shell collector\""}, {"rating": 5.0, "review": "I purchased the latest version of Apple TV for $89 on Amazon as a Christmas gift. It worked out of the box and was easy to setup with my wifi. As is typical for Apple products the software was intuitive to use and we'll organized (icons). I would recommend this product over the competition for these reasons and for Apple's excellent customer support.", "verified": true, "helpfulness": "0/0", "author": "Joe D Tipps"}]