[{"rating": 5.0, "review": "Bought as a gift.  Was very much appreciated.", "verified": true, "helpfulness": "0/0", "author": "Lilly"}, {"rating": 5.0, "review": "It's Apple and that's all I can say.  Very easy to use and works very well.", "verified": true, "helpfulness": "0/0", "author": "Roberto D. Pulenta"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Tap"}, {"rating": 5.0, "review": "Apple TV is amazing! Especially for someone who doesn't have cable! You can watch pretty much anything you can on tv on this plus awesome extra features!", "verified": true, "helpfulness": "0/0", "author": "ayrianna macrellis"}, {"rating": 5.0, "review": "I own 3 of these Apple TV's and it's become my go to source for TV, Movies and Music. Also they are so tiny you can travel with them anywhere.", "verified": true, "helpfulness": "0/0", "author": "GL"}, {"rating": 5.0, "review": "My son loves it", "verified": true, "helpfulness": "0/0", "author": "Keith Hare"}, {"rating": 2.0, "review": "Bought this mainly to mirror iPad and Macbook video to the TV.  Works fine with iPad but if I use it to mirror or extend video from the desktop of my Macbook Air, the video is very choppy and jittery.  Tried every fix I could find online and no luck.  Apple knows about it but hasn't fixed it.  With that problem, the Apple TV is basically just a Roku with no Amazon Prime.  Well, not quite...Roku has Plex, which works.", "verified": false, "helpfulness": "0/1", "author": "J. Layman"}, {"rating": 5.0, "review": "Great machine! I love this I used to have the Apple TV 1st generation and I love the ease of using this device and being able to air play and mirror my phone. A little redundant with mySmart TV but loving it", "verified": true, "helpfulness": "1/1", "author": "Courtney Lomelo"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "yisel"}, {"rating": 5.0, "review": "I use this everyday. Can't say anything bad about apple TV. It was the best buy ever!", "verified": true, "helpfulness": "0/0", "author": "Omar D. \"Omar R. Diaz, BSN, RN\""}]