[{"rating": 5.0, "review": "Excelente!", "verified": true, "helpfulness": "0/1", "author": "PAblo"}, {"rating": 5.0, "review": "I am so happy with this product!I have a few apple products and I am really pleased with this one as well. It's not my favorite apple product, but close to the top. I'll make a list of some of my pros and cons. For reference, we have a Roku HD, Roku 1 and two Roku streaming sticks. I have some experience setting up a chromecast from showing my parents how to use theirs, but am not really a fan.Good:* I am one of the people who still love hard wired equipment. Our house has wired Ethernet and we connect the apple tv this way instead of wifi. The streaming is flawless. I never have a lag or connection issue.* The picture quality is great and the sound is as clear as our regular cable TV through our HDMI cable.* The interface for shows is consistent and I prefer it over my RokuNot So Good:* At this time you cannot stream from Sling, Amazon Prime (I get it) or Vudu* If you view Sling on your MacBook from the web interface the Airplay sync is highly delayed.Indifferent:* Price: I purchased this as a test, but it's more expensive than our Roku.", "verified": true, "helpfulness": "1/1", "author": "RellBell902"}, {"rating": 5.0, "review": "Prompt and as described", "verified": true, "helpfulness": "0/1", "author": "Chad"}, {"rating": 4.0, "review": "My wife and I have recently made the decision to \"cut the cord\", so I purchased the Apple TV for primary use in our living area. After using it for a couple of weeks, I will be purchasing another for use with our bedroom television. Let me say, first, that ours is a home with 2 MacBook Pros, 2 iPhone 6 Pluses, and 2 old iPhone 4's that our children use as iPods, so ours is definitively an Apple ecosystem. After trying the Roku and Apple TV, I will highly suggest the Apple TV if yours is an Apple home as well. The Apple TV works seamlessly with our other products and has completely replaced cable and satellite. There a many native apps, some free and some with subscription fees or cable/satellite provider requirements. Any apps not native to Apple TV, but available to stream on mobile devices, can be \"mirrored\" to the television via AirPlay. Other than HBO Now, we are only using the free apps, and they are plenty for our family. My children are 6 and 4, and they spend much time on Youtube, Netflix, and Hulu. My only concern, and I am searching for solid options, is that I will need to find a way to catch NFL and College Football games in the fall. In fact, football season is the only reason I give this product 4 stars, rather than 5. I love Apple TV and will recommend it to anyone looking to cut cable.", "verified": false, "helpfulness": "0/1", "author": "DMS"}, {"rating": 5.0, "review": "This is my 3rd apple TV, they are so easy to use.", "verified": true, "helpfulness": "0/1", "author": "Leigh Ann Lyons \"L.A. Lyons\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "Olando"}, {"rating": 3.0, "review": "As expected. But I think Apple TV should have an analogue sound outlet like AirPort Express. It would make it far more versatile and good to use for Airplay audio use.Now I had to buy an DA converter and that only has fixed volume level. Not what I want.The noname/off-brand Airplay players are so unstable that I prefer Apple for this application.", "verified": true, "helpfulness": "1/1", "author": "Magnus Ward"}, {"rating": 5.0, "review": "Fast streaming.", "verified": true, "helpfulness": "1/2", "author": "Bill Mall"}, {"rating": 5.0, "review": "One of the best purchases I've made.Paid only $60 and works wonderfully.", "verified": true, "helpfulness": "1/2", "author": "Rodolfo Tacsan Ch \"rodolfotc\""}, {"rating": 5.0, "review": "Good product, great price, fast delivery!", "verified": true, "helpfulness": "1/2", "author": "A. H."}]