[{"rating": 4.0, "review": "Best $90 I've ever spent.  The AirPlay feature is awesome.  Netflix is a bit slow to load though.  The other apps work nicely.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "Great and easy product. Easy setup, less than 5 minutes.I appreciate how much effort Apple designs accessibility into their products. As a very independent blind individual, it's nice not needing sighted assistance.", "verified": true, "helpfulness": "1/1", "author": "Smart Shopper!!"}, {"rating": 5.0, "review": "Beats the pants of that other cheaper system. I got one for home, then got one for my 70+ year old mother. She has no probs using this. It's the best internet tv system u can get", "verified": true, "helpfulness": "1/1", "author": "DCTex"}, {"rating": 5.0, "review": "As always, a requirement if you're cutting cable. Love the concept, the interface is a bit out dated and the device is in serious needs of some upgrades. But overall, I am still a huge fan of these little devices. They always work! I have one for every TV I regularly have access to!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It does what it says it can do. My main gripe is that the channels are limited to the set Apple chose rather than being open. But, hey, that's Apple! The AirPlay functionality is what makes this product a winner over other comparable products since AirPlay increases the number of channels available through other iOS devices (e.g. Amazon Instant Video). Getting Hulu Free to play on it is a challenge though, unless you happen to have an AirPlay supporting Macintosh computer.", "verified": true, "helpfulness": "1/1", "author": "mammoth"}, {"rating": 5.0, "review": "Excelente RECOMENDABLE", "verified": true, "helpfulness": "0/1", "author": "Gonzalo Loitey"}, {"rating": 3.0, "review": "Mine stopped working in a week. Thank goodness for the Amazon replacement option.", "verified": true, "helpfulness": "1/1", "author": "c"}, {"rating": 5.0, "review": "NICE PRODUCT LOVE IT", "verified": true, "helpfulness": "0/1", "author": "patricia"}, {"rating": 5.0, "review": "Love my Apple TV!", "verified": true, "helpfulness": "0/1", "author": "jboyett593"}, {"rating": 5.0, "review": "Can't say anything bad. Maybe a bit high priced for the unit but I love it.", "verified": true, "helpfulness": "0/1", "author": "JSpring"}]