[{"rating": 3.0, "review": "Product seems to be as advertised.", "verified": true, "helpfulness": "0/0", "author": "REID H."}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Thomas Walsh"}, {"rating": 2.0, "review": "This does not have a power button!  For this alone I am giving it 2 stars.  I like every thing else about it so far.  It did not connect to my router either.", "verified": true, "helpfulness": "0/0", "author": "John Domenico \"NJ\""}, {"rating": 5.0, "review": "Love it :)", "verified": true, "helpfulness": "0/0", "author": "yanet"}, {"rating": 5.0, "review": "Super easy set up and use. Wonderful!", "verified": true, "helpfulness": "0/0", "author": "MomofTwo"}, {"rating": 5.0, "review": "I already have a Roku, but I wanted the Apple TV to allow me to project PBS movies from my MacBook Pro onto my flat screen TV. I bought it on Amazon when it was marked down to $73 and am very happy with it. Recommended!", "verified": true, "helpfulness": "0/0", "author": "Barry S."}, {"rating": 5.0, "review": "great device!  Way better than cable!  and way cheaper", "verified": true, "helpfulness": "0/0", "author": "Matt McCoy"}, {"rating": 5.0, "review": "This review is actually for my girlfriend. I ordered it but she got a hold of it  before I got home and she set it up. I was reluctantly allowed to touch the remote twice since.  Physically it was very easy to set up. (She integrated it into our entertainment system without issue), and configuring it and connecting it to one's Apple's account was child's play. (She connected it to HER Apple account.) She also was able to get the HBO app linked to it and uses it mostly to watch various HBO specials (Including Game of Thrones). She did have some issues getting her photos from iCloud to display on it but I think that is due to another issue between her iPhone and the cloud itself.  For myself, the interface was very slick and easy to navigate, and the only minor quibble I had was that due to small size of the remote, I tended to hit the wrong key from time to time (during one of the two times I got to touch it). Very annoying when entering passwords and you lose track of what letter you are trying to input so you have to do the whole thing again. I quickly got used to it though. It seems to have many other features/capabilities and I hope to be given the opportunity to try them out sooner or later. My girlfriend seems very happy with it so far though, so by extension, I guess so am I. :)", "verified": true, "helpfulness": "1/1", "author": "Darin D. Sheriff"}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "Svetlana"}, {"rating": 5.0, "review": "Great product, use it all the time.", "verified": true, "helpfulness": "0/0", "author": "JohnKreese \"Mercy Is For The Weak\""}]