[{"rating": 5.0, "review": "Easy to set up and use. Using an optic cord for sound through my receiver. I just had to ensues my tv speakers were turned off for sound to work on optic. So worth getting.", "verified": true, "helpfulness": "0/0", "author": "nickel"}, {"rating": 5.0, "review": "I love Apple TV! I dropped my cable TV for open air antenna and Apple TV.  Works great, I like that Apple updated the software occasionally.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 4.0, "review": "Apple TV is very good.  I use it a lot.  Apple makes your life easier on everything they develope.  Streaming on Netflix HD, HULU plus, HBO Go, are just fantastic apps.I hope all tv channel were added to the apple tv.Just Great.Winston", "verified": true, "helpfulness": "0/0", "author": "Winston Rojas"}, {"rating": 5.0, "review": "The AppleTv is a great product which we enjoy a lot in our family. Kids are able to stream from netflix and we can rent very recently movies in HD at a reasonable price.", "verified": false, "helpfulness": "0/0", "author": "Luis Rojas Mendez"}, {"rating": 5.0, "review": "We keep moving it from room to room because we love it so much.  Obviously we need to get another one!", "verified": true, "helpfulness": "0/0", "author": "Nat"}, {"rating": 5.0, "review": "Love the device.Easy to set up and get going with programsNo glitches noted in over 3 months of use", "verified": true, "helpfulness": "0/0", "author": "Prasad Abraham"}, {"rating": 4.0, "review": "i got the Apple TV and got ride of cable because this is so useful. Saving $80+ a monthonly negative is lack of sports but there are ways around that.", "verified": true, "helpfulness": "0/0", "author": "Kal"}, {"rating": 4.0, "review": "I replaced my FiOS set top boxes with this and an Apple TV, they both have their pros and cons but this one seems more flexible overall. The Roku offers lots of free channels and has a convenient 3.5mm (headphone) port where you can use something like a nice little 2.1 speaker setup to improve the overall viewing experience.", "verified": true, "helpfulness": "0/0", "author": "Mr P"}, {"rating": 5.0, "review": "Until the recent updates, I preferred the Roku XS because of its versatility. It could do Amazon, Angry Birds, Pandora, and a lot of other \"underground\" video services. AppleTV could do a very nice Netflix client, Apple iTunes purchases, and in-home streaming, as well as AirPlay from iOS and OSX devices.Now that it can do HBO Go natively and Amazon Streaming via AirPlay in addition to everything else, I think it's the way to go, at least for me. It's beautiful and easy to use. It's OK that it doesn't play Angry Birds.", "verified": false, "helpfulness": "1/1", "author": "Jindo Fox"}, {"rating": 5.0, "review": "When I purchased my MacBook Pro - this last August, I decided to spend an extra $100 to get the Apple TV as well. Best $100 I ever spent.First off - you need an HDMI cable to hook it up that does not come in the box but if you're anything like us, you have extras. Right out of the box it was extremely easy to set up. I was reading some reviews about limited channels but I found that Netflix, Hulu Plus, YouTube, Pandora and iTunes is more than enough. There are more channels - but I have yet to check them out. We share an iTunes library with my husbands family so we have over $2000 worth of movies on this little guy. We also opted out of getting cable and use this for all of our shows.My husband and I both have iPhones as well and the Apple remote app is great! Works just like remote it comes with and its nice to have more than 1 remote we can use.I also have a MacBook and airplay is wonderful. Like I said we don't have cable but I do have a few shows that aren't on Hulu or Netflix like Catfish. So I go to MTV.com - find my episode, press the airplay symbol on my Mac and in like 12 seconds I'm streaming on my tv wirelessly.Could not be more impressed and I will definitely be getting a second one for our living room as well!", "verified": false, "helpfulness": "3/3", "author": "Stacie"}]