[{"rating": 1.0, "review": "This is a cool device, no-doubt.  It worked great at home, where I had a wireless network with internet access.  I liked several of the built-in options, including Netflix, very much.  But, I didn't buy this for home...I bought this to use on my boat, to couple movies from my iPhone to my HD-TV.  The Apple-TV won't connect to the iPhone without both devices being on the same WiFi subnet. Nor would the Apple-TV connect to the iPhone's personal hotspot (well, the Apple-TV does connect to the internet, but the iPhone and Apple-TV aren't on the same subnet and won't communicate... STUPID).  So, I bought a wireless router, installed it on my boat... Apple-TV would then connect to the iPhone, but Apple-TV won't work without internet access to verify your phone's movies... STUPID.  Once again, because the iPhone's WiFi hotspot is a different subnet than the iPhone's internet (4G) connection, the two won't work together.  It's such a stupid design that it can't be accidental, Apple had to have done this on-purpose.If you're looking to use this at home, where you have WiFi and you have internet access, this thing is pretty cool.  Try to do something a little different, and this product loses its mind.  I returned mine and bought a Lightning Digital AV Adapter cable, much happier now!", "verified": true, "helpfulness": "1/5", "author": "Michael Edick \"edickent\""}, {"rating": 5.0, "review": "I've bought these for myself and for relatives and friends.  It greatly expands available TV content at no extra cost.  Everyone loves the photo slides feature.  People are amazed when I take their picture and it pops up in the ongoing slideshow a few minutes later.", "verified": true, "helpfulness": "0/0", "author": "plot"}, {"rating": 5.0, "review": "Using it for...streaming videos ( workout  videos in iTunes or YouTube videos) from my ipad or computer to my tv. I can use netflix and watch it thru Apple TV on my tv. It uses apps so you don't need your other devices to be on all the time.  ( only for iTunes videos)The best thing right now is I can stream World Cup soccer to my tv! Awesome!", "verified": true, "helpfulness": "0/0", "author": "Irma"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Bobby B Hudson"}, {"rating": 4.0, "review": "Saw my son's and loved it.  Like It because it is so easy to set up and use.I have already shown it to two people and they bought one the next day.", "verified": true, "helpfulness": "0/0", "author": "Judith Gillispie"}, {"rating": 2.0, "review": "Without the ability to watch amazon and add content apps not games my tv alone does 99 % of what this thing does.If I had a tv without internet I would not recommend this unless your entire library of content is on your computer.  Look elsewhere.", "verified": false, "helpfulness": "0/1", "author": "Realist123"}, {"rating": 5.0, "review": "Typical Apple product - it just works.  I have an Apple network and all Apple devices (iPads, iPhones, Airport Express, Time Capsule, iMac, Mac Mini, etc.).  Plugged it in, turned it on and in a few minutes I was on my secured network.I am thinking of hooking up a Bluetooth keyboard, because with the slowness of the hunt/peck alphabet input built into the Apple TV, it's a pain typing more than a few letters.I also set this up to control with Remote on several iOS devices.  That feature works nicely.This is hooked into a Samsung 46\" LED TV via HDMI (had to but that cable separately, which seems odd).  In the future I'll hook up a sound bar to beef up the sound and drive the sound from the optical out.", "verified": true, "helpfulness": "0/0", "author": "jfb"}, {"rating": 4.0, "review": "Love Apple TV!", "verified": true, "helpfulness": "0/0", "author": "minimedic71"}, {"rating": 5.0, "review": "If you own an iphone or an ipad this is a great add on, with this you can stream the content of pc, iphone, ipad and also see content fron the native apps in the apple tv", "verified": true, "helpfulness": "0/0", "author": "DIEGO G. PIMENTEL O"}, {"rating": 4.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "Ryan Bonetto \"Ryan Bonetto\""}]