[{"rating": 5.0, "review": "We are in love with our Apple TV.  We have netflix and ESPN, ESPN Sports Etc......Those extra channels are provided inHD through our cable company. We are looking into buying another apple TV soon!!! :) LOVE", "verified": true, "helpfulness": "0/0", "author": "Mom85"}, {"rating": 2.0, "review": "Sound is clunky on netflix and itunes as in it doesn't work most of the time.  Airplay from ipad does not always sync.  I bought this to remove stress but this has increased it when I want to watch a movie", "verified": true, "helpfulness": "0/1", "author": "David Plunkett"}, {"rating": 5.0, "review": "I all of a sudden have these all over the place. 2 in my office and 3 in the house. Mirroring any Apple device on the TV is great. In the office I share work on my TV or TV in the conference room. At home mostly Netflix plus some other channels. Also great to throw up pictures. Great to mirror TV stations from websites you don't get from your provider such as the local news station during a storm which I do not get on DirecTV. iTunes Radio, etc. This gives you a small taste of where TV is probably going in the future.", "verified": true, "helpfulness": "1/1", "author": "Richard S. Butwin"}, {"rating": 4.0, "review": "Works as advertised. No complaints. Easy to hook up. Took me a little bit of time how to mirror my ipad.", "verified": true, "helpfulness": "0/0", "author": "Goschill"}, {"rating": 5.0, "review": "a gift for my daughter she loves this both she and my son love the apple products and they use this all the time", "verified": true, "helpfulness": "0/0", "author": "lori leone"}, {"rating": 5.0, "review": "Love the product, but need to do a little more research.  We were told that it could be run through our Cox Cable box to our non HDMI tv. Need an adapter to make it work, still looking.  Works great on a tv that has HDMI capability.", "verified": true, "helpfulness": "0/0", "author": "Nana"}, {"rating": 5.0, "review": "It was so easy to install, to set up and use it. Even my four year old girl is enjoying to use it. Very intuitive.", "verified": true, "helpfulness": "0/0", "author": "Marcos S. Aranha"}, {"rating": 3.0, "review": "I like how does it works I mean the purpose, but the software is slow sometimes, first I thought it was because of the Internet, then I realize it is because of the interface.", "verified": true, "helpfulness": "0/1", "author": "Mariana"}, {"rating": 5.0, "review": "I think by this point if you wanted an apple tv, you would have gotten it. If you don't know what an apple tv is, well, plenty of reviews by professionals will answer all your questions. So here is what you're getting from, why should you buy it from amazon.com rather than, say, apple store1. listing price is cheaper2. maybe you still live in one of those great states that there is no sales tax when purchasing from amazonoverall, you save about 10-20 bucks.No HDMI cable -- while you're at it, pick one up from amazon for like 3 bucks. DO NOT go to your local bestbuy or radioshock to buy an HDMI cable, they will charge you 10x the amount.", "verified": true, "helpfulness": "2/2", "author": "HT"}, {"rating": 5.0, "review": "This thing is great!  Has lots of features and was fairly simple to connect.  Some things to know, though.  You should go to itunes and download the free Remote for iOS app before setting it all up.  Also the way to \"mirror\" what you see on your ipad is supported by enabling the Home Sharing section under the Computer icon on apple tv.  Also, in order to see your control for Airplay on your ipad place your finger on the bottom of your screen and swipe up fast and it'll bring up your Airplay control panel so you can start mirroring things from the device to the TV.  I realize most Apple people already know this but it took me a long time to research all this out! Hope this helps someone else.", "verified": true, "helpfulness": "10/10", "author": "Tryin_hard \"tryin_hard\""}]