[{"rating": 5.0, "review": "I bought this for only airplay but have found the YouTube and NBA to be great. What I don't like about it is that the movies are expensive - there should be some free movies. Also, instructions do not mention that the software update should be done via wifi, and not Ethernet connection.", "verified": true, "helpfulness": "1/1", "author": "OB"}, {"rating": 5.0, "review": "My favorite aspect of this apple TV is the ability to watch youTube videos on my 42\" plasma.  While I could have accomplished this in other ways, the streamlined operation of the Apple TV makes it seamless.  Additionally, I appreciate my ability to link my iPad to my apple TV and listen to Pandora (through the backwards way of using TuneIn radio to connect the iPad to the apple TV, then going to the Pandora app and that overriding the TuneIn Radio music) during parties and social gatherings.Another great apple product.", "verified": true, "helpfulness": "0/0", "author": "ell107"}, {"rating": 5.0, "review": "Considering for me it is not for an old monitor watching movies. Otherwise works great and so far I have no problems with it.", "verified": true, "helpfulness": "0/0", "author": "Valentin K"}, {"rating": 5.0, "review": "Very Nice", "verified": true, "helpfulness": "0/0", "author": "Moises Ospina"}, {"rating": 4.0, "review": "I am disappointed with the limited availability apple TV offers.  The interface is excellent and it is easy to use however.", "verified": true, "helpfulness": "1/1", "author": "T. Accomando \"\"part-time chef\"\""}, {"rating": 5.0, "review": "I own a Roku and a PS3 so I have had all the different internet TV available, but I always wanted to watch You Tube on my 55\" screen. This Apple TV blows away the Roku as far a picture quality. The Apple TV is far superior to the Roku! also being able to take my iPhone and my Imac and connect through Airplay my iTunes and Video and pictures from either to my TV is great. This may not have all the channels the Roku has but I am using the Apple TV far more then the Roku.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "You simply cannot go wrong with the Apple TV.  Works flawlessly every time.  Very easy to set up.  Also, provides closed captioning for everything.  Thank you, Apple!", "verified": true, "helpfulness": "0/0", "author": "Cate Cullen"}, {"rating": 4.0, "review": "Purchased the Apple TV with the hopes of ditching high priced cable.  Unfortunately that has not come to fruition yet but still trying.SImple to hook up, just need the HDMI Cable purchased in addition to the Apple TV.Enjoy the 'Sync\" features that can be used along with an iphone or android phone.Overall price is very reasonable.", "verified": true, "helpfulness": "0/0", "author": "erk"}, {"rating": 5.0, "review": "Easy to install (just a cable attachment).  We use it all the time! Enhanced the use of both Netflix and iPad for us, and we're not very tech savvy!", "verified": true, "helpfulness": "0/0", "author": "Ronnie329"}, {"rating": 5.0, "review": "Meets all my expectations. I really like the Apple TV. I use it all the time and it works great. It was very easy to set up and get started. I would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "Kelly Gesell"}]