[{"rating": 3.0, "review": "When you finally decide to let us add or remove channels freely like a roku device, I will change this to 5 stars.", "verified": true, "helpfulness": "0/1", "author": "J.M"}, {"rating": 5.0, "review": "I was not really sure what internet TV box to get.  I almost bought a Roku.  Apple has done a nice job in making this product simple, intuitive and functional.  Streams H.D. video with very little buffering at the beginning.  I also ordered a new N network router to make sure the wireless speed in the house would support the box.  I Highly recommend this upgrade, although I tried the Apple TV with the old G router and it worked well with it too.", "verified": true, "helpfulness": "0/0", "author": "Bill T"}, {"rating": 5.0, "review": "Plug and play for Netflix, I tunes, home sharing ect. Love the ease of use and great set up. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Peter Seabloom"}, {"rating": 4.0, "review": "like other apple product.  it works very well.  The only downside is price, just like any other apple product.  i needed this for airplay capability and don't need it much for streaming.  If you factor heavy on streaming, roku is probably better.jailbreak for gen3 is currently not out 12/7/12 as of this review but it is said someone is working on it.", "verified": true, "helpfulness": "0/0", "author": "GFM350"}, {"rating": 4.0, "review": "This is a good gadget for your tv. I could love it if the iTunes store in my country was available, but, that's not an apple tv problem, is an apple problem", "verified": true, "helpfulness": "0/0", "author": "Ivan Etchart"}, {"rating": 4.0, "review": "I bought this because the Roku does not have YouTube.  That's all I use it for.  It works very well.  It is nicely designed as any Apple product I have ever dealt with.  If you have trouble signing into YouTube through the interface, you may have to go to your email settings and 1) turn off 2 step verification or 2) set an application-specific password.", "verified": true, "helpfulness": "1/1", "author": "Jeffery C"}, {"rating": 5.0, "review": "Best UI. And syncs with you iOS deceives. It's great. Can't wait until the adds more channels.  It'll be great!", "verified": true, "helpfulness": "0/0", "author": "M. Garcia"}, {"rating": 5.0, "review": "We love our Apple TV!  For a long time, I didn't know what it could do, so I was not very interested.  We love to use it for family gatherings and holidays to enable everyone to see pictures - new and old!  It is simple to operate -- even though we have the same capability in our Samsung TV, we prefer the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "GH"}, {"rating": 5.0, "review": "great little gadget to keep the kids happy, and very cheap to have whole house sound.  I would recommend this to a friend", "verified": true, "helpfulness": "0/0", "author": "Troy Cherry"}, {"rating": 3.0, "review": "Purchased the Apple TV primarily for streaming my movie collection onto my HDTV without needing to convert file formats for iTunes/Home Sharing or AirPlay.What an enormous letdown. AirPlay Mirroring simply did not work for me despite countless hours of online research and having conversations with users at Apple's discussion forum and the Mac Rumors forum.The Beamer app (a 3rd party app) worked for standard definition content but not for HD movies. The company that makes Beamer blames my relatively new MacBook Air. I seriously doubt that.User interface is ugly too. Just a bunch of tiles that are clunky to navigate.The one time I rented an HD movie from iTunes via the Apple TV it would not start playing for at least an hour. I thought movies were supposed to start after a few minutes. I'd rather rent from my cable company via VOD.I'm sure the Apple TV is great for many others. I'm a huge Apple fan myself. But for my needs it was a disaster. Probably going to purchase a WD TV Live Media Player at some point.UPDATE: Okay, I'm updating my review because I found two apps (Infuse Pro and Air Video HD) that essentially allow me to AirPlay natively (not AirPlay Mirror) video files to my TV via my Apple TV.This is huge for me. It's essentially the only reason I bought my Apple TV to begin with. It really sucks though that AirPlay Mirroring really isn't an option for many of us when it comes to streaming our video content. I feel like Apple is really not being honest on that front.Also the interface as of the summer of 2014 for the Apple TV is simply gross. Even if you can delete channels it's still ugly and a poor user interface. I suspect this Apple TV will get a software facelift come fall of 2014.So yeah, thank you Infuse Pro and Air Video HD for allowing me to use this device as I intended to all along.", "verified": true, "helpfulness": "3/5", "author": "Lovethefuture"}]