[{"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Robert S."}, {"rating": 5.0, "review": "Best device for streaming video.  I do a lot of video streaming from iTunes, Netflix, ABC, and Airplay (Audio and video from iPhone/iPads)If you don't have Apple products (iPhone/iPad/Macs), the AppleTV might not be the best for your own media content streaming (It does not offer a way to attach to shared network folders).If you do have Apple products and use iTunes for your music library, the Apple TV is your best choice IMO. Apple TV offers easy setup using Apples Home sharing, the remote app for iPhone/ipod/iPad is great and streaming Local LAN, Netflix and other AppleTV content is better then any competing products I have tried.  I have tried quite a few of them...You can certainly just plug it into a Tv and watch content, but its nice to also plug into your Audio Receiver and Airplay your own Music, Pandora, iTunes Radio etc. to your home stereo.  I have an old iPhone I use as a remote control and Airplay music streaming during Parties at the house.Again, if you have Macs or iPhones/iPads, this is your best if not the only solution you should be considering.", "verified": true, "helpfulness": "1/1", "author": "Kevin"}, {"rating": 5.0, "review": "Perfect if you own an apple computer, ipad or iphone.  Makes streaming movies a snap and viewing pictures with friends on your TV super cool.  You can allow via the settings, anyone to display pics from their apple product to your TV.  Make sure your TV has an HDMI input!!!!", "verified": false, "helpfulness": "0/0", "author": "Gary C"}, {"rating": 3.0, "review": "For some reason, after playing for a while, the sound goes away.  I had to reset in order to get the sound back. Gotta figure out what wrong with it.", "verified": true, "helpfulness": "0/0", "author": "CCRN-r-us"}, {"rating": 4.0, "review": "it works!", "verified": true, "helpfulness": "0/0", "author": "AB/DL"}, {"rating": 5.0, "review": "Another great Apple product", "verified": true, "helpfulness": "0/0", "author": "Daniel N Anderson"}, {"rating": 5.0, "review": "We love our Apple TVs and use them more than our cable. One of our favorite features is being able to stream the movies from our computer library into the tv, and airplay is great too. Definitely the best choice if you have an apple-centric household.", "verified": true, "helpfulness": "0/0", "author": "specialk3782"}, {"rating": 5.0, "review": "Must must must have! Have used all the competitors, and nothing comes close to the ease of use and also in terms of all the features offered...Have used it almost everyday since purchase almost 3 years ago....", "verified": true, "helpfulness": "0/0", "author": "SSM \"Pienso que existo\""}, {"rating": 3.0, "review": "Much too limited content when compared to Roku.  Biggest advantage is that you can screen cast from your apple device.", "verified": true, "helpfulness": "2/2", "author": "cooler joe"}, {"rating": 4.0, "review": "I have had this for about a week and there are no surprises.  It works as advertised but there are the usual Apple disappointments like No Pandora (it is a competitor) and a rather limited list of services, many of which require a paid subscription.I can stream music from my iTunes library directly to my TV and that is nice but sound like a TV.I am going to try to add a bluetooth keyboard as the remote control search keyboard in Youtube is insane.As always, the Apple product comes with almost no printed instructions and Apple's on-line help stinks.  An \"older\" user may be challenged by this product unless they are already an \"Apple-head.\"I would suggest trying the Roku3 or Amazon's new offering.  I think they both offer more functionality for the money.", "verified": true, "helpfulness": "1/2", "author": "M. Loftus"}]