[{"rating": 5.0, "review": "Apple is know to have user friendly products and this is also seen in the Apple TV. Extremely easy to connect and use. This product is everything I was expecting.", "verified": true, "helpfulness": "1/1", "author": "TimS"}, {"rating": 5.0, "review": "Works great. My wife loves FaceTiming with my son in 55\" HD ....lol..  It will be nice at the pool this summer to let other people choose the music we have playing.", "verified": true, "helpfulness": "1/1", "author": "Steve \"Steve\""}, {"rating": 1.0, "review": "First off, I want to say that this tiny product is not worth the $100.00 plus tax and let me explain why. When I first bought the product, as I love apple macbook Pro's, the device is very limited to 13 products. However, 13 products make much less bloatware on the device. The Box is very shiny and luxurious as it comes to looks. But, When I looked at the 13 products listed, I tried out the movies rentals and the itunes on my computer worked fine in comparison. THe biggest problem is that when I downloaded the product, it did not allow me to watch the movie right away. THe loading time is over 2 hours to watch a movie that is only an hour and 30 minutes long on the lowest settings for internet connections. This was baffling and should not be overlooked. Please save yourself the money and just use your computer to watch movies or a dvd player. In fact, buy a redbox because this product is the least satisfying money I have paid for a long time.Please like my review because of the facts. Thank you.", "verified": false, "helpfulness": "1/6", "author": "Douglas Quaid"}, {"rating": 4.0, "review": "I waited a long time to get Apple TV.  But now with the ability to stream from my computer or iPad through the Apple TV onto my flatscreen, I decided to buy myself a holiday present.", "verified": true, "helpfulness": "0/1", "author": "A.G."}, {"rating": 5.0, "review": "Great device and great fast shipping. Apple TV meets my needs since I have all Mac and Apple devices. I enjoy streaming my MacBook screen to the tv.", "verified": true, "helpfulness": "1/1", "author": "TJ Grunfelder"}, {"rating": 5.0, "review": "This is a very awesome product, it works smoothly and is beautiful.  It comes with a small elegant remote, it has a sort of that aluminum unibody feel to it.I don't understand the point of SmartTV gimmick that come with all these new TVs.  I was looking at Chromecast, but I have experienced Android woes and felt that the additional $60 dollars in cost was justified for quality.", "verified": true, "helpfulness": "1/1", "author": "Tenzin L."}, {"rating": 5.0, "review": "Like it, play YouTube 1080p videos on my iPad even everyday. And many apps such IGN on iOS device also support the airplay function, it is easy to use and bring a very good experience of watching videos on portable device.", "verified": true, "helpfulness": "1/1", "author": "Leon"}, {"rating": 5.0, "review": "This thing is great. A cost efficient way to stream Netflix as well without smart equipment or playstation/x box for much more money. The only downfall is that you cannot add apps. What it has is what you get. The only way to receive more is through Apple updates.", "verified": true, "helpfulness": "1/1", "author": "Austin Hylton"}, {"rating": 4.0, "review": "Awesome and very easy to use. Wish it had more free apps, but worth it. Excellent price and plays nice with iPhone and iPad..", "verified": true, "helpfulness": "1/1", "author": "Edward Sadler"}, {"rating": 5.0, "review": "The Apple TV is great for a household like mine where everyone owns Apple products.  Many people have stated how their Apple TV does not work for them.  I had an issue where whenever I would mirror a device, my home's Internet would restart.  That was due to a router setting.  With some research, that setting was tweeked and the Apple TV does everything that it's supposed to.", "verified": true, "helpfulness": "1/1", "author": "Hootie"}]