[{"rating": 5.0, "review": "While we use the Apple TV for streaming movie downloads, we also can do streaming downloads from our cable service provider, our Roku 3, our Blu-Ray player, our Visio TV and our Nintendo Wii U box. So streaming movies is not our primary reason for purchasing this device. We purchased the device for one primary purpose.  To be able to easily use AirPlay from our Macs, iPhones and iPads. The Apple TV excels at this better than any other device we are aware of. We have the device plugged into our stereo system so all of our AirPlay videos or iTunes music from any of our Apple devices has a rich surround sound quality and are displayed on our large screen TV.  It is extremely easy to use and the video quality is always excellent.While our Yamaha stereo receiver can play AirPlay music it cannot play video. So the Apple TV is, to us, an essential part of our household Apple system. Many other reviews discuss the benefits of streaming iCloud, iTunes and video of the Apple TV.  But the AirPlay feature alone is worth the cost of this device.  I highly recommend this device and we use it daily on average and far more often than we stream downloaded movies from any device.We liked it so well, we also bought this for Christmas gifts for our immediate family.  As a gift, it was a huge hit and we are told that their Apple TV is being put to as much, if not more, use than ours is.", "verified": true, "helpfulness": "0/0", "author": "iiiireader"}, {"rating": 1.0, "review": "I am a huge fan of Apple products, but this is has got to be the biggest piece of @#$% I have ever had to deal with. They should fire the engineer that designed this. It would work fine one day, and then the next day it would not work at all, and the computer would say that it was not online. I can't tell you how many times it  stopped in the middle of a movie and then I had to spend 15 minutes trying to get it to work again. Often I could not get it to work again, but then it would be working the next day. The thing was close to my computer and modem which were working perfectly, so that was not the problem. After too many numerous times of this P.O.S. crashing, I freaked and destroyed it. That was the most pleasure this thing ever gave me. Boo Apple, you definitely need to replace this product with something that actually works like it is supposed to. 1 star is far to good for this thing. Hate it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "verified": false, "helpfulness": "0/4", "author": "iluv335s"}, {"rating": 5.0, "review": "excellent product I recommend the most", "verified": true, "helpfulness": "0/0", "author": "juan carlos blanco-uirbe bello"}, {"rating": 5.0, "review": "We love having it. Now we watch way too much TV.", "verified": true, "helpfulness": "0/0", "author": "Robert B Russell Jr"}, {"rating": 1.0, "review": "Within a year's time, this no longer worked properly. I do not recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Cammy Ashby"}, {"rating": 5.0, "review": "sold on apple tv, have one for main tv and boight this for bedroom, so much more intuitive than say samsung smart tv browser.  apple needs to add amazon movies, only downside", "verified": true, "helpfulness": "1/1", "author": "chuck sites"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "abdulla hussain al-mesry"}, {"rating": 5.0, "review": "Simply awesome. We brought it to Spain on assignment there and worked just fine. Some programming is limited overseas, but downloading movies and shows worked very well. Lives up to Apple's simple to use reputation.", "verified": true, "helpfulness": "0/0", "author": "Michael R Schlenker"}, {"rating": 1.0, "review": "Have had apple tv for 3 years, originally on FIOS cable and now on sattelite connection. Rarely use it now. Feel we have totally wasted our money buying movies through this system. Movies take forever to load and system freqently freezes. No such problems with Roku. This is without even talking about the system's failure to enable Amazon and other feeds. Apple Tv is antiquated junk.", "verified": false, "helpfulness": "0/2", "author": "James E. Carr \"Western Slope Guy\""}, {"rating": 5.0, "review": "I love the ability to duplicate my iPad screen on the TV over WiFi using the Apple TV.  I haven't tried the channels but I was surprised there were so many.  There are some free channels but of course you will have to pay a fee for most.", "verified": true, "helpfulness": "1/1", "author": "Steven Conaway"}]