[{"rating": 5.0, "review": "When you don't have a state of the art super-zuba TV, nothing beats adding an AppleTV to get access to iTunes, Netflicks, and Hulu-Plus. If you have an IOS device, you can also show video on the AppleTV using Airplay. It's awesome!", "verified": true, "helpfulness": "0/1", "author": "K David Monson"}, {"rating": 3.0, "review": "I have issues when connecting to entertainment site such as Hulu and Netflix. Does not seem to connect smartly, minutes upon minutes of doing the Hula. and never connecting. This is the case with both my Apple TV devices in two different location and ISP provider.No issues with AirPlay. performance, Works super well.", "verified": true, "helpfulness": "0/0", "author": "A_Uzer"}, {"rating": 5.0, "review": "We have had this product for over a year and we love it use is everyday.  We keep our digital movies on our iTunes account and can access them regularly.  My husband uploaded photo's to it, so when we are not using it, or are listening to the radio we have our family photo's displayed on our TV as a screen saver.  The Apple TV gives you links to Netflix, Radio, Hulu and several other apps automatically so it's a one stop shop for digital users who have multiple accounts .  The only down side is you must have an internet connection even to watch your purchased digital movies.", "verified": true, "helpfulness": "1/1", "author": "Busy Mother of Two"}, {"rating": 5.0, "review": "It's everything I expected to do and more. I definitely highly recommend this to everyone who owns a hd tv.", "verified": true, "helpfulness": "0/0", "author": "Dan Lew"}, {"rating": 3.0, "review": "Doesn't do what I wanted but we do get some use out of it. Wish they couold upgrade software to fix this.", "verified": true, "helpfulness": "0/0", "author": "Bruce L. Coyle"}, {"rating": 5.0, "review": "This is an incredible device that allows streaming of ITune content stright to TV. I'm sure it does far more and does it well. It's Apple after all", "verified": true, "helpfulness": "0/1", "author": "Ringnut \"Bliksm\""}, {"rating": 5.0, "review": "Love it! So easy to stream movies on the TV. Great when there is nothing to watch on regular TV.", "verified": true, "helpfulness": "0/0", "author": "Heather Kearns"}, {"rating": 5.0, "review": "His quote  \" TOTALY ROCKS\"  They love it and it works great for them.  My son has one and he loves his also", "verified": true, "helpfulness": "0/1", "author": "KAREN H WHEELER"}, {"rating": 5.0, "review": "I had to write a review on this because i have seen people comparing Apple tv and the google chromecast player and some saying they are not much different. NOT TRUE. I purchased both for my apartment to have one in the living room and in the bedroom The apple tv is $100 but well worth it, especially if u have apple devices at home such as ipad or iphone. But u dont have to have it to work this.  Apple tv has so many more options then chromcast. If u have a television provider there are disney channel apps, nfl, HBO and more u can use. If u have an ipad or iphone u can turn on air play and use the mirroring option so everything u are doing on your device is on the big screen. Also it come with a remote but u can also download the apple remote app on ur device and control it from there that way u have a keyboard and makes searching for movies alot faster.  Now chromecast is good but only $35 because it doesnt have alot to offer. It doesn't come with a remote so if u dont have a smart phone u cant opperate this device and also only offers netflix and youtube thats it. Easy to set up but nothing fun to play with.", "verified": true, "helpfulness": "0/0", "author": "Kami Lee"}, {"rating": 5.0, "review": "My husband bought Chromecast after seeing a commercial for it, but we already have access to Netflix through the Wii U, and Amazon instant video since we have Prime.  Chromecast didn't do anything new that we didn't already gave.  We got Apple TV and LOVE IT!!! We can play Netflix, and ABC, HBO, Disney, PBS (for Downton Abbey) plus all of our other iTunes movies!!! So pleased with our purchase!!!", "verified": true, "helpfulness": "0/0", "author": "GrumpyNTiana"}]