[{"rating": 1.0, "review": "Get a Chromecast or any other streaming device... just like other Apple products (and I own a lot), this one really limits the formats that it can stream.", "verified": true, "helpfulness": "3/7", "author": "Nutmeggerking"}, {"rating": 5.0, "review": "Arrived on time and works as expected.", "verified": true, "helpfulness": "0/0", "author": "Cory Rogers"}, {"rating": 5.0, "review": "I think I use Apple TV more than cable TV now", "verified": true, "helpfulness": "0/0", "author": "Apar"}, {"rating": 5.0, "review": "As expected.", "verified": true, "helpfulness": "0/0", "author": "Jim Rathje"}, {"rating": 5.0, "review": "Great idea; we scan our DVDs then either share or sell them.  Love the idea of having movies right at hand; no more in-out, bend and stretch to get the films set up.", "verified": true, "helpfulness": "0/1", "author": "NanaCO"}, {"rating": 4.0, "review": "actually you do not need this if you have a SMART hdtv", "verified": true, "helpfulness": "0/1", "author": "lee kwan yu"}, {"rating": 4.0, "review": "I gave away my Roku a year ago and found a need for another way to stream Netflix.  I also have two streaming. Blu-Ray players! a Wii and a tv with a dongle.  By far, the Apple TV is my favorite tool for streaming.  As it's dedicated to the task, there's MUCH Less wait time during applications.  Turn on the tv, turn on the Apple device, and there's a menu.  Click Netflix and the connection is speed.  Also, browsing titles is optimized.  A couple minuses-- the mirror function is hit or miss, sometimes it just stops working and sometimes, the icon disappears.  Also, as far as Netflix is concerned, it doesn't keep track of titles I've rated.  Sure, the stars are there, but they're not red for unrated and gold for rated.  I've started a couple movies to realize I'd seen them before.", "verified": false, "helpfulness": "0/0", "author": "GREGBUQUERQUE"}, {"rating": 3.0, "review": "Downloading any movie or tv show from the iTunes site takes FOREVER!!! Pick another product  - I have apple computer and phone which is why I went with this but its such a hassle - it's not my speed - it's the product. Youtube as well can be very frustrating. Apple needs to make this better or give it up.", "verified": false, "helpfulness": "3/4", "author": "S. Wallace"}, {"rating": 5.0, "review": "LOVE IT WOULD RECOMMEND THIS PRODUCT", "verified": true, "helpfulness": "0/0", "author": "Cora McGuire"}, {"rating": 1.0, "review": "Don't connect apple id! What I do?", "verified": true, "helpfulness": "0/3", "author": "Oscar"}]