[{"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/1", "author": "Meecy"}, {"rating": 5.0, "review": "Love this box. Getting one for another room. I became a member of the \"cable cutters\" revolution about 9 months ago. My satellite provider last year said they would give me new equipment. (I won't mention the satellite company name, but the equipment rhymes with meanie) I had to sign a 2 year contract to get the equipment free. After 6 months of complaints that their equipment kept crashing and about 8 tech calls later, I told them to shove it all. They would only give me back my old equipment if I signed a new contract for 2 more years. (I was already 6 months into the contract for the new, crappy equipment). I saved over $2,800.00 for the next 2 years by canceling. Because it was their problem, they waived the early termination fee. Another $400 saved.So, I kept my Netflix. 8.99 a month. Then something fantastic happened. HBO, the only reason I've subscribed to cable or satellite since 1985, broke away and made history. They created HBONow. Then Showtime did as well.I would always have unlimited Internet for 50.00 a month anyway. So now I have the AppleTV in my living room, along with a smart bluray/DVD player(Sony makes the best).I pay $14.99 a month for HBONow, 10.00 a month for Showtime, the 8.99 for Netflix.The Apple TV lets me watch them all, with no subscription costs of its own.I've not tried the other services except it's very fast at downloading seasons of shows I buy on ITunes. I still save thousands a year.Cable cutters are the future, and so is streaming. About a half million of us cut the cord this year.  I had a little withdrawal for a week or two. Now I don't aimlessly channel surf anymore. It was an addiction I had to rid myself of. I also read a lot of books.Am going to order another AppleTV for another room because I find myself carrying it from one room to another.Thank you, Apple. Once again you've proven to the world that a product doesn't have to crash or freeze or give us headaches. (My Samsung TV apps did this a lot)Great product. Many more streaming channels coming, I'm sure", "verified": true, "helpfulness": "1/1", "author": "Lynne Marie \"Creator of the 365 Day IPhone/IPad Challenge\""}, {"rating": 5.0, "review": "great item", "verified": true, "helpfulness": "0/1", "author": "jamie"}, {"rating": 5.0, "review": "I cannot say enough great things about this device. I had initially purchased a Roku, and for me it did not work out. The Roku was constantly dropping the wifi signal. The Apple TV advice was a breeze to set up-not one iota of trouble connect it to my wifi. Then the channels came up super fast. I have been using it for the past 3 weeks, and I am super satisfied. I knows ghG zoom", "verified": true, "helpfulness": "0/0", "author": "Bellafelice \"Amazon fan\""}, {"rating": 5.0, "review": "look ok for this prices N Quality", "verified": true, "helpfulness": "0/0", "author": "wee"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mike Nguyen"}, {"rating": 5.0, "review": "Works like a charm.  While I haven't been able to cut the cord with my cable company yet (only because I'm tied into a contract), I've found my Apple TV to work beautifully.  Incredibly easy to set up and it works really well to view videos that I could only watch before on my laptop by mirroring them via Airport.  NO complicated setup!  And once I get out of my Cable company contract, I fully intend to use my Apple TV, along with an antenna to provide my TV service!  Thanks!", "verified": true, "helpfulness": "1/1", "author": "EmmaMom"}, {"rating": 5.0, "review": "It's a nice items to good holding", "verified": false, "helpfulness": "0/1", "author": "Talal Al3zemi"}, {"rating": 5.0, "review": "LOVE my Apple TV. Had Roku, which periodically needed to be reset or had other issues, but Apple has worked like a charm since day one. The remote is the lightest and most elegant one ever made and incredibly easy to toggle through channels or input search text. One of the best parts, though, is being able to see pictures from my Photo Stream while the tv is in standby mode or to play slide shows. And the price is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works like it should", "verified": true, "helpfulness": "0/0", "author": "SPG900T"}]