[{"rating": 4.0, "review": "Works really well most of the time, but seems to require A LOT of restarts. I love my Apple TV. I use it as a second monitor when I'm working at home with my Macbook Pro, and also to stream from my iMac, and watch Netflix and PBS. I'm taking one start off because there are  A LOT of times the AppleTV simply stops working and rebooting it always fixes the issues. This can be kind of a pain when you're halfway through watching something.", "verified": true, "helpfulness": "0/0", "author": "John S. Ruzicka \"John R\""}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Julian Robayo"}, {"rating": 4.0, "review": "We love this Apple TV!  Love the software for it...the remote is small and comfy and easy to operate. Only down side is it needs more apps instead of pushing buying all the apple shows.", "verified": true, "helpfulness": "0/0", "author": "Happy Mom \"Annie B.\""}, {"rating": 1.0, "review": "Too little apps, being such a rich company, it could afford to have better apps. I would go roku which has more apps and better quality. It should be for 30 bucks for the kind of apps it offers, also HBO and the crap, IT IS NOT FREE, you have to pay thru your cable provider. If I have on cable why would I need an app for it and go thru apple.", "verified": true, "helpfulness": "0/1", "author": "manonfire"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Sergio"}, {"rating": 4.0, "review": "It's nice and elegant and i love free content", "verified": true, "helpfulness": "0/0", "author": "Saad"}, {"rating": 1.0, "review": "About a month after I bought it (right after return policy ended), the video signal flickers and audio cuts out- Not sure what warranty info is. But don't trust these refurbished items.", "verified": true, "helpfulness": "0/0", "author": "Scott Gawlik"}, {"rating": 5.0, "review": "Awesome product and even more awesome price! Would recommend to anyone! Easy to use! Packaging was good and shipping was fast!", "verified": true, "helpfulness": "0/0", "author": "dabinion"}, {"rating": 5.0, "review": "I watch apple tv all the time.  This is a great way to watch your stuff.", "verified": true, "helpfulness": "0/0", "author": "Acekenny"}, {"rating": 4.0, "review": "As expected.", "verified": true, "helpfulness": "0/0", "author": "DEBRA ANN SOBIERAY"}]