[{"rating": 5.0, "review": "perfect product, air play an amazing feature. Totally loved it and if you have any other apple product at home (ipad, iphone, mac book) then just buy it. Worth every penny!!", "verified": true, "helpfulness": "0/0", "author": "Upendar Garg \"UG\""}, {"rating": 5.0, "review": "This is the second Apple TV I've bought.  I wanted my daughter to enjoy it as much as I do.She can log into her Netflix account from it, and also stream movies.  We both enjoy thatwe can view content from our iPhones and iPads on it.  No wires needed!!!", "verified": true, "helpfulness": "0/0", "author": "Theresa C. Campbell \"Caper\""}, {"rating": 1.0, "review": "Apple TV 2 will make you want to break things.  It will never work when you need it to.  It constantly has trouble connecting to Netflix.  TRUST ME it is not my network.  I have personally watched netflix on my laptop, Roku, Wii and even the humble Nintendo DS all at the same time with the ATV2.  All stream perfectly with no connection issues while the ATV2 loses connection every 3 seconds.  It does not matter if you use WiFi or a direct connection.  I tried both.  It is equally Sh*tty either way.It needs to be rebooted every few hours or you will find yourself staring at a black screen with a tiny apple loading icon that will NEVER stop.ATV2 is the MOST FRUSTRATING piece of technology I own.  It has made me hate it.If your primary purpose for buying ATV2 is Netflix...  Get a Roku.", "verified": false, "helpfulness": "3/13", "author": "K-kok"}, {"rating": 5.0, "review": "Best player I ever had, really good picture, Really compact remote control, fast connection, easy to hook up, best than roku and other brands I have", "verified": true, "helpfulness": "0/0", "author": "Airbus"}, {"rating": 3.0, "review": "This Apple TV is Great for streaming Netflix and Hulu plus, But you cannot access movies off your hard drive, unless it is converted, put into iTunes(which can take awhile). And if you want to rent a movie it has to download first! The movie does not stream! So if you want to see a movie in HD you better have a fast connection because the movie will have to download first. The one great feature of the Apple TV is that you have AirPlay,  which means you can access media, and play games off your other Apple devices(iPhone, iPad, iPod, ect...), and play it on your HD TV!  Pretty cool :-)", "verified": true, "helpfulness": "1/3", "author": "James L. Dutton \"Techno\""}, {"rating": 5.0, "review": "In combination of HD TV and High speed internet Apple TV is excellent stuff for entertainment, I will get another one  for other TV", "verified": true, "helpfulness": "0/0", "author": "Edison Viteri // Att: Gustavo Madrigal// Gustavo S"}, {"rating": 5.0, "review": "I was a little unsure at first. It was highly recommended to me to buy it. I love the thing. I like having the ability to play my music directly from my computer, use netflix, hulu plus, YouTube, etc. Awesome buy.", "verified": true, "helpfulness": "0/0", "author": "Review"}, {"rating": 1.0, "review": "I have two Apple TVs and 2 Rokus.  The Apple TVs are basically unusable.  They stutter, delay, and pause buffering for extended lengths of time.  The Roku does not do this.  Netflix seems okay on Apple TV and Roku both.  Apple rentals (and _everything_ is a rental) always stutter and buffer with long delays.  As a Amazon Prime subscriber I can watch Amazon movies on Roku.  They never stutter, pause, or buffer.  On Roku Netflix doesn't stutter, pause, or buffer.  The problem appears to be the Apple rental server.Again, The Apple TV is unusable.  I have unplugged them and set them aside.", "verified": false, "helpfulness": "14/27", "author": "Allen_TX_Reviewer"}, {"rating": 5.0, "review": "I use this device to stream movies and shows on the web to my HDTV with great results. Picture quality on HD content may not be as good as that from my Oppo bluray player but it is good enough for me. Will recommended.", "verified": false, "helpfulness": "0/0", "author": "Evaku"}, {"rating": 5.0, "review": "The Apple TV is easy to set up like most Apple products. Streaming Netflix is great, but the big plus is that this syncs up with my iTunes account so I can play any of my purchased Movies, TV shows, plus all of my music library from the cloud. Watching my photo stream is also a cool feature. I haven't tried using it as a big screen for games from my iPhone or iPad, but I'm looking forward to that. For under $100, its a great product!", "verified": true, "helpfulness": "0/0", "author": "Adam"}]