[{"rating": 5.0, "review": "Works with my old HDTV, works great with my ipads thru airplay. Netflix is great and HULU plus clear HD picture. had a Roku stick for about a week, what a disappointment stopped working sent it back and got this, You want a streaming box that works this is it. Love APPLE.", "verified": true, "helpfulness": "1/2", "author": "Larry J. Mcbeath"}, {"rating": 5.0, "review": "I've been an apple loyalist since the very beginning and the Apple TV keeps urging on my admiration of their products. The Apple TV is a great addition to the apple line. The greatest thing about this little (and I do mean little) device, is that it offers prime apps. Things like Hulu plus, Netflix, HBO go, and now recent additions such as the History channel and PBS it is just amazing. If you are like me and are tired of paying more than you have to to the cable providers this will help. We no longer use our cable box and strictly use the Apple TV for all of our streaming purposes. Another great perk is the easy transition of viewing content from our iPad, iPhone, and Macbook straight to the larger and bigger screen all because of the Apple TV. Virtually all purchases are synced through the account so it keeps adding to its value. It's a great buy and present to the tech person in your life. I have bought over four of them just as presents for others.Updates are constantly performed and I can only imagine other additions to the app/network line. It's the way to view television... On our time.", "verified": true, "helpfulness": "1/2", "author": "Nycittiebee"}, {"rating": 3.0, "review": "After a couple of weeks of use, all connection with the Internet was lost. Only 'My computer' and Settings remained.Only after a SW update the connection returned.This should not happen to a product!", "verified": true, "helpfulness": "0/0", "author": "Abraham Mizrahi"}, {"rating": 4.0, "review": "I use my Apply TV every day and really enjoy it. I have HBO Go, Hulu, and Netflix and use all three of these apps on the Apple TV frequently. Intermittently, a show will not load, but that it mainly due to my wifi connection cutting out. The box is very small and can be mounted to the back of your TV with hardware that I have seen on Amazon.The cons of this product are few, but may be important to you.1. The remote is TINY! I know that you can download the Remote app on your iPhone and use that, but I like having a separate remote to use since I do not always have my phone by my side while watching TV. This remote can get lost easily if it get left on the couch or on the bed.2. No Amazon Prime Instant Video!3. This may not be true for all, but if I am playing a DVD through my MacBook Pro and mirror it to my Apple TV it is unbearable slow. The video skips or completely stops. I was so excited to use the mirroring feature for this purpose since I  do not have a DVD player attached to my TV with the Apple TV, but I never use the feature because of its poor performance.These cons may not be issues for you, but they can be a bit of a nuisance. Overall, I do love my Apple TV and use it frequently.", "verified": true, "helpfulness": "0/0", "author": "Gabriella"}, {"rating": 5.0, "review": "I have been using this for nearly over a year and works great. I have been able to stream all my fav shows and watch videos and movies like I wanted to.", "verified": true, "helpfulness": "0/0", "author": "Deepika Mirchandani"}, {"rating": 5.0, "review": "My young kids love it....and my wife and I use it for Netflix among other things.  I wish these guys would pick up some key cable channels so I could dump my cable provider.", "verified": true, "helpfulness": "0/0", "author": "TK"}, {"rating": 5.0, "review": "Our in-laws got us hooked on a series on Netflix.  A little investigation showed that the best way (not the cheapest) was to buy an Apple TV.  I like it because, in addition to the wide selection of alternate programs, I can mirror my iPad to the TV.  I have really enjoyed exploring all the unusual show available on some of the channels available on Apple TV.", "verified": true, "helpfulness": "0/0", "author": "B. G. Fehringer"}, {"rating": 2.0, "review": "I bought this in hopes of replacing my Roku 3.  My logic was that there were some channels that had apps for watching video for which there was no channel on Roku and either didn't use or limited their Hulu selections.  First, let me say trying to use Airplay from an iPad for this purpose was pointless.  The Apple TV was plugged directly into my AC router which also happened to be in the same room as our main TV.  With no other network traffic, the picture was terrible and it stuttered, stopped, and restarted for no reason.  So, I wrote off Airplay.Still, I paid for it so I was hoping I can still use it on a different TV rather than buying another Roku.  To put it bluntly, the channel selection is pathetic for a device that costs the same as a Roku.  Not only is there no Amazon Prime, there are not just a lot of other channels either.  I've given up on cable/dish, so having as many channels as possible without having to hookup my laptop to the TV is essential.  Here the Apple TV falls very, very short.The user interface is nice and smooth and I actually prefer it slightly over Roku.  The lack of channels is just too big of a drawback for me to overcome.  So, if you can't decide between Apple TV or the latest Roku offering, I would suggest the Roku.", "verified": true, "helpfulness": "0/0", "author": "JJG"}, {"rating": 5.0, "review": "exelente", "verified": true, "helpfulness": "0/0", "author": "Diego Rivero"}, {"rating": 5.0, "review": "Makes things so much easier than playing anything from my phone.  I don't have to download my movies from ITunes anymore and I can get Netflix on it.  I thought it was a TV before until a friend showed us his.  Then we bought two.", "verified": true, "helpfulness": "1/1", "author": "Bunson"}]