[{"rating": 5.0, "review": "I've owned about every version of the Apple TV since it was first released in 2007, I now have a library of over 600 movies. It was definitely rough in the beginning, but now it is a finely polished product. If you are serious, as I am, the best performance is to stream you purchased and home movies from a \"server\", I use an old mac mini for that purpose. I set it up 6 years ago and left it running without incident since (occasionally needing to access it for software updates and external hard drive upgrades as my library has grown). Obviously you don't need to set up a server any more like we did in the old days (before Apple obtained the licenses to stream purchased movies) but if you want/need speed the local option will produce a significant improvement.Of course you need to be into streaming Apple's products to make it worthwhile. I've tried Samsung's Smart TV and Amazon's product through that, I have also sampled Netflix through the xbox 360. These are decent and I would not look at this product if these are already meeting your needs. Apple's interface is better, assuming you can exist within its limitations (Apple's ecosystem).I recently bought these through Amazon: Sanus Systems ELM4308 8.2' Super Slim HDMI CableDefinitely recommend these cables for your Apple TV. The device is quite small and light and some of the heavier HDMI cables out there cause the Apple TV to sit askew or worse by gradually dragging it off the stand, which is annoying if you don't want to be stuck gluing it down.", "verified": false, "helpfulness": "0/0", "author": "Postcall"}, {"rating": 5.0, "review": "Awesome, cheaper then at Apple, brand new, works just fine!", "verified": true, "helpfulness": "1/1", "author": "Dennis S."}, {"rating": 5.0, "review": "It works really good the apple tv, I don't have any problem with the device and everything was in perfect conditions", "verified": true, "helpfulness": "0/0", "author": "Santiago"}, {"rating": 5.0, "review": "This device works great.  I had no problems setting it up.  It works perfectly.  I'm also glad that its black since all of our devices are.", "verified": true, "helpfulness": "0/0", "author": "Heidi"}, {"rating": 1.0, "review": "dimply put, Apple is far behind the competition when it comes to the Apple TV.  We have two chromecasts and two Apple TV, and we far prefer the chromecast.  The Apple TV requires at least 1 reboot a day because the audio gets fuzzy.", "verified": false, "helpfulness": "0/2", "author": "Nick"}, {"rating": 5.0, "review": "Works great only issue was no instructions on how to set it up", "verified": true, "helpfulness": "0/0", "author": "James M Labry"}, {"rating": 5.0, "review": "I love this product.", "verified": true, "helpfulness": "0/0", "author": "Howard Gibson"}, {"rating": 5.0, "review": "Like it", "verified": true, "helpfulness": "0/0", "author": "Dom Chetbundit"}, {"rating": 2.0, "review": "As far as the ease of use and the interface, I love this device. Although the text descriptions on shows and movies are hard to read, I understand that many people have bigger TVs that would make this a non-issue (we have a 36\" TV).However, after 1 1/2 years, the device died (and of course there's only a 1 year warranty). Doesn't turn on, no lights, no nothing. Tried all the troubleshooting tips, and unfortunately the final assessment was that it was a dead brick. I never move it from where it's sat, so it's a quality issue with the hardware.If it was more reliable, I'd give it 5 stars. If the interface wasn't as clean and easy to use, I would've only given it 1 star.Very disappointed. I expect better from Apple hardware.", "verified": false, "helpfulness": "1/1", "author": "Christopher C. Bloom \"iggyb\""}, {"rating": 5.0, "review": "I just bought an Apple TV last night from Best Buy. I spent much time debating which of the many streaming devices I would get to hook up to my office TV.What ultimately made me select Apple TV over other devices was the selection of services available. All the ones I use are here with the exception of Amazon Instant Video, and there's an easy workaround for that by simply steaming content from your phone or tablet through the device.While other devices may offer more entertainment options, if you're like me, you only have time for about 5 or 6 anyway, everything else is just filler. Like WWE Network? It's here. Crunchyroll? It's here. HBO GO? It's got that too. And of course Netflix and Hulu are practically a given on everything. Every major American sports league is here too except for the NFL.All of these are high quality apps with Full HD capability tailor made for this device. Setup was a breeze. If you own an iPhone or iPad already, simply turn Bluetooth on, touch the Apple TV with it, and you are good to go in less than 60 seconds. Having an iPhone is also helpful because in my opinion the in box remote sucks mostly due to being so small that it's difficult to hold.My only disappointment is that I didn't get one sooner.", "verified": false, "helpfulness": "1/1", "author": "James Anthony Banks"}]