[{"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Josue"}, {"rating": 5.0, "review": "Killer GUI, Quality Video, and it's an Apple! 'Nuff Said!", "verified": true, "helpfulness": "0/0", "author": "Robert  Marc McCarthy"}, {"rating": 1.0, "review": "Really disappointed in this product. It's very buggy and glitchy. I can't put spotify on it. I can't put amazon prime on it. For the money Roku is a better product. I love Apple products but this has been a headache since the day I bought it.", "verified": true, "helpfulness": "0/1", "author": "Ronnie Sandlin"}, {"rating": 5.0, "review": "Works as advertised, although be advised that in order to use mirroring that it requires models from 2010 up to more recent ones. Otherwise, it's pretty amazing, though annoying that if your macbook is open, the remote will randomly open up itunes and start playing music.", "verified": true, "helpfulness": "0/0", "author": "MAS \"MSantosi\""}, {"rating": 5.0, "review": "Apple is the best.", "verified": true, "helpfulness": "0/0", "author": "Alaa"}, {"rating": 4.0, "review": "Good quality. Product as expected.", "verified": true, "helpfulness": "0/0", "author": "Jorge L. Berges"}, {"rating": 5.0, "review": "Okay so if you're looking for a platform that allows you to watch your Netflix and Hulu and all that stuff without going and buying a play station 4 then I would recommend the Apple TV. It's fast and very easy to use. Plus having all your music and iTunes being at your fingertips is also a bonus. Lastly you also get HBO NOW on it so there's really no question if you need it or not.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "This is my second one got my first from direct from Apple as a refurbished unit for $69 got second one new for same price after Apple dropped the price on them earlier this year so now I got one on the living room TV and in the Bedroom. A must have for viewing WWE Network or listening to music or watching videos on the big screen from iPod, iPhone, iPad or Mac OS computer.", "verified": true, "helpfulness": "1/1", "author": "Edward F. Roeder Jr. \"Computer guy\""}, {"rating": 4.0, "review": "The things we do too watch Game of Thrones! Now have access online without it, don't really need it, it's for sale on Ebay!", "verified": true, "helpfulness": "1/1", "author": "Lex"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Richard Christensen"}]