[{"rating": 4.0, "review": "So far, works ok.  Sometimes I get disconnects when AirPlay, but not sure why.  Didn't have this problem with my apple tv 2.  Will try it for a bit longer before I deem it defective", "verified": true, "helpfulness": "0/0", "author": "A. Liu"}, {"rating": 5.0, "review": "Being able to have my iTunes library played on our big screen TV is wonderful.  Netflix, HuluPlus and the MLB app are also inlcuded.  We subscribe to MLB package so now we can take it with us when we travel with our AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "I have to admit I have become an apple junkie and this is the latest edition to my apple toys.Here are the Pros:- Easy enough to install. You need a longer hdmi cable, be warned.- Works well with streaming movies and gives you the option to stream Netflix and Hulu which is pretty nice of Apple, considering it's a much cheaper way to watch movies than through Itunes.- When you do buy a movie through Itunes, the quality is wonderful. My husband pays the Verizon Fios bill, so we take turns as to who pays for the movie on demand. Wish Apple would lower their movie rental prices to compete with Redbox- Great for streaming your iPad or IMac onto your TV screen.- There are three different speeds to fast forward and backwards. Again, you would need to read the instructions to know about it.Here are the Cons:- The remote is not self explanatory and you need to read the instructions. I would have preferred to see a button on the remote which was marked \"Select\" instead of just a round silver button within a black circle with arrows pointing North, West, South and East. You need to figure out what that means. For non-techy people, the remote will be an issue.- To go backwards, you need to click the menu button.- To play, if you press the silver buttonBe aware, it needs it's own HDMI input on your television. The better the hdmi connector you use, the better your picture will be. Also, in my opinion, it's better to use an ethernet cable than wireless, especially as our TV area is pretty far from the wireless router. All in all, I'm pretty happy with this, but I am a techno junkie.", "verified": false, "helpfulness": "2/2", "author": "GoGirlGo"}, {"rating": 3.0, "review": "Other than that, it's yet another device you can watch Netflix on, or rent movies with. Having an MCE PC, and the fact that this thing has no additional apps, I feel like I wasted a hundred bucks.It's a great idea, but very weak execution. Needs apps, sorely.", "verified": true, "helpfulness": "5/7", "author": "Ehh, Well \"Taxed Out\""}, {"rating": 5.0, "review": "We used to have a Roku but it was an older version and I wanted to upgrade. Since we have mostly Apple computers, however, I decided to try the Apple TV instead. It's great. We use it mostly for Netflix streaming and the picture is extremely good. One of my favorite features, however, is Airplay. If your computer supports Airplay (newer Macs do), you can stream anything from your computer wirelessly to the TV - no cables needed. There is little or no degradation of the picture - you can stream movies, photos, music - if it's on your computer screen, you will see it on the TV. And there's no set-up involved - simply set your TV to Apple TV input and click the Airplay icon at the top of your computer screen. Whatever your computer screen is showing will also be on the TV. Additionally, you can set the sound to come from the TV sound system not your computer's. I was skeptical at first because we don't have the fastest internet connection and I thought the picture when streaming a video would be choppy but wasn't at all. We are very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "DeeDee"}, {"rating": 1.0, "review": "After a few months, my unit stopped communicating with the wifi router. After a quick search, it appears to be a common problem. Not ready for prime time. Sigh...", "verified": false, "helpfulness": "3/9", "author": "rhuang@cs.berkeley.edu"}, {"rating": 4.0, "review": "This is usable if you have plenty of apple devices used home,I have taken 1 star out cause it is not customized and you have to take what available their to watch...", "verified": true, "helpfulness": "0/2", "author": "Hanny"}, {"rating": 5.0, "review": "on time and in a good shapeon time and in a good shapeon time and in a good shape", "verified": true, "helpfulness": "0/3", "author": "Hasan"}, {"rating": 5.0, "review": "I really like this product. It was easy to setup and easy to use. It works with all my Apple devices.", "verified": true, "helpfulness": "0/1", "author": "Alexrue"}, {"rating": 4.0, "review": "Okay, bad on me for not doing my research, but the whole reason I bought this was because I wanted to watch Amazon Prime Video Streaming from my iPad to my TV.  I thought airplay and screen mirroring would be the way to go.  Little did I know Amazon and Apple are having a stand-off because Apple can't handle competition.  Well, I'm sorry Apple, but in my opinion, Amazon's services are better than your's and Netflix' combined.  In the meantime, I'll use my dinky little Wii to watch Prime content in non-HD.Seriously Apple, get over it and quit suing everyone for everything.Please hold while I step down from my soapbox.... Okay, on a positive note.  This thing is incredibly easy to use, I watch my video podcasts effortlessly, and video rentals are actually quite reasonable.  Also, I really like the ability to stream music from my PC (using iTunes) and have a slideshow screensaver display on my TV (from a specific folder that I chose on my computer).  Screen mirroring is pretty cool, but I haven't found much practical use for it.It was a toss-up between this and the Roku, and I'm glad I got the Apple TV.Good hunting...", "verified": true, "helpfulness": "0/1", "author": "aophil"}]