[{"rating": 3.0, "review": "In the box you get the Apple TV, which is a small black box measuring only 23mm x 98mm x 98mm that weighs just 0.27kg, a nice-looking aluminum remote with very few buttons, some setup instructions and a power lead. The Apple TV has exactly the same ports and connectors on the back as before. There's an ethernet port, an Optical Audio port and a HDMI port for connection to your TV. You'll also notice a Micro-USB port, but this has no use for the home user - it's just for Apple's Geniuses to use when diagnosing problems. The Apple TV processor has been upgraded to the A5 chip to cope with 1080p HD movie playback. iFixit has done a teardown on the Apple TV and found that the Broadcom 4330 Wi-Fi chip inside also supports Bluetooth 4.0+HS, although it currently makes no use of this technology - it's possible that the functionality could be added in a future update. The current Apple Remote uses Infrared, this requires line of site to your Apple TV, which can be a pain - a Bluetooth remote would be far superior.Connection to your TV is via a HDMI cable, but be aware that there isn't one in the box, so you have to purchase that separately.The first surprise with the new Apple TV compared to the previous generation is that once you connect it up to your TV is that it talks to you! A voice asks you if you'd like to enable the Voice Over feature by clicking a button on the remote three times.Voice Over reads out what the menu option you've currently got selected is, so it will be a very useful feature for visually impaired users who need extra help navigating the menu systems.Proceeding on, you set up the usual things like language then select a WiFi network - if you've never done this before then it will be your first encounter with the Apple TV's tedious way of entering text and numbers - you have an alphabetically ordered block of letters that you have to have to slowly manoeuvre around using the remote's click wheel. t's frustrating to use because the layout is so unfamiliar - having the letters arranged like a computer keyboard would have been more intuitive.Going through the process of painfully entering your WiFi password one character at a time using this input method only to realise you got one of the characters wrong and have to do it all over again is heartbreaking, especially when at this stage you just want to get on with enjoying all the great content your Apple TV promises. It's a shame Apple still use this input method because everything else about the Apple TV is so easy to use it stands in sharp contrast to other media streamers.", "verified": false, "helpfulness": "2/3", "author": "James"}, {"rating": 5.0, "review": "Apple TV is a great add on to your TV viewing experience. No larger than a hockey puck, it enables a host of additional experiences - Netflix, Apple downloadable movies/TV shows, and \"Air View\" display from other Mac devices in the household.", "verified": true, "helpfulness": "0/1", "author": "Howard K. Murphy"}, {"rating": 5.0, "review": "I love this thing if you use itunes netflix or hulu this device is great also it allows u to use apples internet radio with 50 million choices lol", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Except for not having a dedicated app for Amazon (they gave theirs to Roku) it is a super addition to your tv.  The device is sleek and the remote is simple.  It is a job apple does well - and roku does not.  The apple tv does not ask for any personal information and works perfectly every time all the time.  Upgrades can be made on the TV to the original apple tv.No complaints at all", "verified": true, "helpfulness": "0/0", "author": "happy amazoner"}, {"rating": 2.0, "review": "I use my Apple TV casually, usually for Netflix and Airplay. The netflix is about 50/50, I will often get random error messages that result in me having to get up and manually unplugging and replugging in the Apple TV to reset it. The Airplay is slow and jerky, making streaming video from my Mac completely unrealistic. I would not recommend this product.", "verified": false, "helpfulness": "0/2", "author": "Beth  A Kingsley"}, {"rating": 5.0, "review": "The Apple TV is the best companion device for your iOS devices and iTunes. Even if the AirPlay Mirroring is the only feature you ever use, it would have been well worth it.I have completely replace my cable provider with Netflix, Hulu Plus, and iTunes. This is one of the best purchases I have ever made, and the 1080p video quality is just awesome.To anyone who is already invested in the iTunes ecosystem, I would highly recommend getting an Apple TV to compliment your visual experience. You won't regret it.", "verified": true, "helpfulness": "2/2", "author": "SirK"}, {"rating": 5.0, "review": "Easy to hook up and use.  If you desire something to display your Ipad or iPod fun, then this is it.  It also allows us to play iTunes movies stored on computer...wicked...", "verified": true, "helpfulness": "0/0", "author": "Kathleen Jans"}, {"rating": 5.0, "review": "Excellent and easy to hook up. I would recommend it to everybody. The control is user friendly. Love the screen saver", "verified": true, "helpfulness": "0/0", "author": "Roxy"}, {"rating": 5.0, "review": "So much to do with the Apple TV!  You Tube, Netflix, Airplay... Just wish Pandora was available. Great Product for the price.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Plevniak"}, {"rating": 5.0, "review": "I bought this specifically for watching movies on tv that I bought on iTunes, but it turned into so much more. My wife started playing with it and was able to access shows in German for my daughter to watch. Great all around. Love it, I use it almost every day.", "verified": true, "helpfulness": "0/0", "author": "Kenneth J. Keim"}]