[{"rating": 5.0, "review": "I am a big fan of Apple TV.It's an amazing device for anyone who loves high quality video content.You can absolutely choose whatever you want to watch, anytime you want to watch it.Say good by to your cable tv providers and get ready to build your own tv programming.Choosing from great movies to tv shows.And for those of you who live in Brazil, there is anything like this!!!Stop depending on Net, TVA, SKY, with their lame programming.In addition, the airplay is awesome. You are able to stream anything to your tv or receiver from your apple devices.It's a must have!!!", "verified": true, "helpfulness": "2/2", "author": "Mauricio"}, {"rating": 5.0, "review": "I had a 720P one at home and found it so good to watch anything I like. It uses more than anyother similar devices. I also found it a good gift, so I bought two new 1080P version, one for myself and one for my friend. Like it!", "verified": true, "helpfulness": "1/1", "author": "Allen Mu"}, {"rating": 4.0, "review": "I bought this unit so that I could get HBOGO.  NO go!  I am investigating my options.  Still a great product for a reasonable price.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I recomend Apple TV, is very easy install, but hasn't internet only in NETFLIX, YOUTUBE and 10 other website. It hasn't imternet freedom.", "verified": true, "helpfulness": "0/1", "author": "MIGUEL JARAMILLO"}, {"rating": 4.0, "review": "I bought this device in order to watch my YouTube videos on my HDTV.  I have Time-Warner Turbo Internet service and so streaming videos from YouTube works very well for me.  Set-up was straight-forward following the instructions provided.  Be aware that Ethernet & HDMI cables are not supplied, but the included remote contains an excellent battery.", "verified": true, "helpfulness": "1/1", "author": "Bill Suda"}, {"rating": 5.0, "review": "Highly recommend this! Haven't got cable this is all we use!! Love photo streamingon large screen!! Might want to add another to my second TV", "verified": true, "helpfulness": "0/0", "author": "maiseymae \"reading teacher\""}, {"rating": 1.0, "review": "AppleTV blocks Amazon movies, something they neglect to boldly mention.  So you are pretty much railroaded into using iTunes when prices are better at Amazon!  A real cheap trick.  Bad, bad, rotten Apple!", "verified": false, "helpfulness": "13/27", "author": "Lawrence H. Chapman"}, {"rating": 3.0, "review": "I purchased this to \"mirror\" web movies/shows from my ipad, specifically from Amazon Prime.  It does not support Amazon's streaming protocol.  I sent it back since it was an expensive device to show photos or play itunes content.", "verified": true, "helpfulness": "3/4", "author": "Chris T."}, {"rating": 4.0, "review": "The device was easy to install and more-or-less intuitive to use.  At first we had problems with streaming -- but that turned out to be a problem with our cable company and not the device.", "verified": true, "helpfulness": "0/0", "author": "Howard S Fredman"}, {"rating": 5.0, "review": "Love the product.  I instantly show my videos, movies and pictures on my tv. It's so much easier to watch videos this way than on my iPad. It's great how apple makes all their products work seamlessly with each other.Be sure to update the product once you receive it. There are more apps available now.", "verified": true, "helpfulness": "1/1", "author": "Michelle Huang"}]