[{"rating": 5.0, "review": "This is a good product that just keeps getting better with more content updated all the time.  I am about to cancel my cable bill because I rarely stray away from my Apple box.  If you want the local news or watch regular TV then it is a great enhancement for movies but if you are like me and don't watch the networks this is for you.  I use NetFlix and Hulu Plus and can watch pretty much whatever I want that was worth seeing on regular TV.", "verified": true, "helpfulness": "0/0", "author": "Robert Evans \"Digital Wave\""}, {"rating": 5.0, "review": "I have regressed back to PC's for the last several years (because work makes me and I'm not made out of money, yo) but I try to buy Apple products when I can - and boy, do I love the Apple TV. This thing is great - super easy interface and it has HBO Go! Huzzah!", "verified": true, "helpfulness": "0/0", "author": "MR"}, {"rating": 3.0, "review": "I like the roku much better, it has a lot more channels, this is ok if you dont have a roku", "verified": true, "helpfulness": "0/0", "author": "easye"}, {"rating": 5.0, "review": "As a year-long Roku user I wasn't prepared to move up to the Apple TV, but an opportunity presented itself and I gave it a shot. I wish I'd have bought this unit in the first place; all apps work flawlessly without stalling or crashing, and the interface with my iPad and iPhone simply cannot be beat.", "verified": true, "helpfulness": "0/1", "author": "Mike Holzer"}, {"rating": 5.0, "review": "Hooked up, which is plug-n-play and it worked right off the bat.  Doesn't take a genius to get it going. Put it in my daughter's room, since I don't have cable run to her TV (and don't ever want it in her room - horrible for kids!!) and she's able to watch the Disney Chanel without the commercials (which is why cable sucks so bad!) and also youtube, which allowed us to watch several mini-series of MLK, Jr. which she needed to do a report on.  The mini-series helped her get a perspective of his life and what he went through and WHY he went through it.  That was something I couldn't have done any better and the timing of the Apple TV arrival was perfect for that alone.  Great little device.  Love the mirroring feature too.  We have lots of movies on iTunes and the kids love being able to get to those through the AppleTV app.  We also have a VUDU account, and they can load those on their iPods and mirror the movie through the TV, since VUDU doesn't have an app through AppleTV, that I'm aware of anyway.  Love it so far!", "verified": true, "helpfulness": "0/1", "author": "Amber Ramsey"}, {"rating": 5.0, "review": "Apple TV introduced me to some excellent web content like Vimeo, Simithsonian and Qello.  Only the latter was a paid subscription.  I also enjoy watching several other channels such such as the Wall Street Journal.  I also find watching movies to be easy.  Finally, I have an iPad and iPhone and the airplay mirroring which puts the screen content on your TV works very well.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey Schreier"}, {"rating": 5.0, "review": "Yes, everything received was as listed & as all Apple products are easy to setup.Should have got one sooner.", "verified": true, "helpfulness": "0/0", "author": "johnnie"}, {"rating": 2.0, "review": "I purchased this in October 2013 and was so happy until it no longer recognized my WIFI with the router sitting right next to it.  All of my other Apple products, of which I have many, don't have an issue with the WIFI.  I had to dig out my router instructions and reset it last month.  Now it happened again.  I don't have the time or the inclination to continue doing this.  I see from the Apple site that I am not the only one experiencing this problem.  I am a fan of Apple products but am seriously annoyed.  It was purchased on Amazon and it was passed the 30 day window to return it.  The Roku in the other room, further away from the router, works like a charm and has more channels available.  I regret my purchase and will try to return it at the Apple store.", "verified": true, "helpfulness": "0/0", "author": "Mo"}, {"rating": 5.0, "review": "I love the Apple TV! It just continues to get better as Apple adds more features with each software update.", "verified": true, "helpfulness": "0/0", "author": "REB430"}, {"rating": 4.0, "review": "We disconnected our cable at the beginning of the year and haven't looked back. We have both Rokus and an Apple TV, with Netflix, Hulu and Amazon subs. The bad is the Apple TV is notably slower than the Roku and is missing Amazon Instant Video, but I still use the Apple TV more often because of airplay with my ipad which allows me to project nearly any video from the browser onto the TV. Korean dramas, anyone?If you don't have other Apple devices, go with the Roku. It's much better as a standalone product. If you do use other Apple products, the Apple TV fits right into your lineup.", "verified": false, "helpfulness": "1/1", "author": "booksandshoes"}]