[{"rating": 4.0, "review": "Apple TV (MD199LL/A) is a pretty good supplement to my entertainment system. You can access many different non-apple accounts from; the NHL network to Vimeo and from youtube to Netflix. Also, you have the same access to the iTunes store that you would from a computer (albeit in a different interface). The real great thing about appleTV is that you can \"mirror\" your macbook and iphone to your television - this basically means that you can watch your computer screen on your TV. This only works if you have the iPhone 5 (or newer) and a 2011 or newer macbook pro - I'm not sure about other apple products, so please read the fine print before buying! Also, with slightly older apple technology (say iPhone 4) you will still be able to use airplay to play music and videos.However, I feel that apple is still lacking in the total user interface with appleTV. As of April 2013, they do not have access to an app store, so what you see on the main screen is what you get.", "verified": true, "helpfulness": "0/0", "author": "Johnny Vigneux"}, {"rating": 4.0, "review": "This works great.  I found the setup a bit confusing, mostly in regards to iTunes passwords and such.  With only two buttons on the remote, text entry (i.e., the pasword) is a major challenge to \"type\" in.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 3.0, "review": "I had looked forward to seeing Hulu, for instance, but one can only get a subscription.  Most everything requires a subscription!  Since I could already stream from my laptop via a cable, the Apple TV is redundant.  There are other devices like this out there, and I would encourage you to research them better than I did.  Hopefully I can find a hack for this box and unlock the streaming features that I wanted.", "verified": true, "helpfulness": "0/0", "author": "michael buhler"}, {"rating": 5.0, "review": "We have really only used it for Netflix at this point but so far so great! Extremely easy to set up and very straight forward to use. No complaints!", "verified": true, "helpfulness": "0/0", "author": "Melanie L. Stanley"}, {"rating": 5.0, "review": "only thing missing is HBO Go.  other than that love it.  The mirroring from my MBA and Iphone5 is pretty good, gets a little choppy.", "verified": true, "helpfulness": "0/0", "author": "zacb"}, {"rating": 5.0, "review": "As an owner of multpile Apple device the missing puzzle piece!The perfect gadget to get all your photos/movies/music on your mobile devices right on your big TV screen using AirPlay.Immidiate access to your purchased itunes items and many other useful applications.", "verified": true, "helpfulness": "1/2", "author": "Adva"}, {"rating": 5.0, "review": "Wife & Kids love it, hours of entertainment.  Gets lots of free programing.  Easy to set up.  Highly recomend for families.", "verified": true, "helpfulness": "1/2", "author": "Jeffrey Dalton"}, {"rating": 5.0, "review": "Very easy to install and use. I can stream from the Internet onto my HD TV right from my iPad by turning on mirroring. You need to go to the online manual to learn how to use all the features though. The set up guide that is printed is really just for the basic setup.", "verified": true, "helpfulness": "5/6", "author": "Diveartist"}, {"rating": 5.0, "review": "The best ever apple product.O melhor produto desenvolvido pela apple.El mejor producto apple.Le meilleur produit apple.Die besten Apple-Produkt.", "verified": true, "helpfulness": "0/2", "author": "Fabio Monteiro"}, {"rating": 3.0, "review": "as all apple products its very easy to set up and navigate with. I bought Apple TV to do mirroring with my macbook pro unfortunately after buying I realized that mirroring doest not support Macbook pro mid-2010 but I use Airparrot as solution for that. unfortunately I experince some lagging while mirroring unlike if I used HDMI cable.what I didnt like in Apple TV is the channels limitation and all the connected should be through itunes only.", "verified": true, "helpfulness": "1/2", "author": "Thamer"}]