[{"rating": 5.0, "review": "As all Apple equipment, this is another great device.Easy to setupJust pay attention, cause you need newer Mac/Macbook Pro/IPad to stream videos", "verified": true, "helpfulness": "0/0", "author": "Luis Gustavo Tsuru"}, {"rating": 5.0, "review": "I love my unit.. I recently started using Netflix and didn't want to use it on my computer while in my office. I have an extra monitor that I don't always use, so I got this unit to plug into it and am very happy now. It was very easy to install and connect to my account. Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Everglades Photograpgy"}, {"rating": 5.0, "review": "I just use this for AirPlay and Internet radio most of the time, and worth it just for that. I have it hooked up via optical to my sound system and it sounds great. Video quality is top notch also.  Now has HBO Go app too so just started using that.", "verified": true, "helpfulness": "0/0", "author": "MDaytona"}, {"rating": 4.0, "review": "I Like because It is that I expected.I recommend this product to duplicate what you see in the ipad or iphone.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Herraez"}, {"rating": 5.0, "review": "I have been looking to get apple TV since a long time ago and I finally did it! What I like the most is the mirror option, I can share what it's going on in my Iphone and Ipad in my 55\" HD TV and works quite well!", "verified": true, "helpfulness": "0/0", "author": "C. Parreno"}, {"rating": 3.0, "review": "Streaming quality is better than our Samsung blueray and on par with our xbox 360. I'm mostly happy with the content but I wish they would add Amazon Prime streaming content soon. That would bump it to 4 stars, easy.", "verified": true, "helpfulness": "0/0", "author": "ARBadger"}, {"rating": 5.0, "review": "This was the perfect gift for the gadget guy who has it all ( my Husband).Great gift!The only down side I see is that if you have multiply televisions in the house you'll have to purchase one for each television. We have ours in the family room, perfect central place in the house.", "verified": false, "helpfulness": "0/0", "author": "Vosornio"}, {"rating": 5.0, "review": "We use it to stream Netflix.  It is easy to use and understand.  We are happy with it.  We wpuld recommend it.", "verified": true, "helpfulness": "0/0", "author": "Vita Walen"}, {"rating": 5.0, "review": "Great little box!  One word:  AirPlay!  If you have an iPhone or iPad, it is worth it solely for this feature.  You can 'mirror' what is on your display, and also stream audio/video via AirPlay.I have two of these at home, one is connected to my 50 inch plasma for video/streaming.  Mostly Hulu/Netflix/YouTube.Another is in a different room connected via HDMI to my AV Receiver for audio only.  I listen to music and podcasts on this one.  Apps that support AirPlay that I have used and work (there are probably lots more than this):  Downcast, Pandora, Spotify, built in Music app, NPR News, NPR Music, TuneIn Radio, and Amazon Cloud Player.PROS:--AirPlay, AirPlay, AirPlay!--Great Netflix/Hulu interfaces--YouTube (go to \"most watched\" today or this week to see the latest viral videos)--1080p video looks fantastic--More content available with the latest software update (v5.3), including HBOGO, WatchESPN, and Sky News.--Draws less than 1 watt of power for the 3rd gen, rev2 model -- A1469.  This is according to an analysis done by AnandTech in March 2013--Small:  about the size of a hockey puck!  Speaking of hockey pucks, there's a great built in app for watching NHL highlights (free)!CONS:--Apple has not opened up the Apple TV platform for app development, but this is not as important with the AirPlay feature.TIPS AND TRICKS:--With the latest software update (v5.3), there are now many apps on the home screen.  You can clean this up a bit and hide the ones you are not using by going to Settings-->General-->Parental Controls.  Scroll to the bottom, and you can toggle show/hide for each app.--To move apps around on the home screen, hold down the 'select' button and then you will be able to move it to wherever you like.--To go back to the home screen at any time, hold down the 'menu' button for a second or so.--Remote control:  You can pair the Apple TV with a universal remote (go to settings to set this up).  You can also control via the 'Remote' app in Apple's App Store, or even pair it with a Bluetooth keyboard (I have not tried the latter).--The Apple TV drives both the HDMI output and optical audio output at the same time.All in all, if you have an iPad/iPhone, I would say get this and enjoy!If you don't have an iPad/iPhone, it is still one of the best streaming boxes out there -- the Netflix and Hulu interfaces are the best I have seen.", "verified": true, "helpfulness": "0/0", "author": "Music Fan"}, {"rating": 5.0, "review": "Great box.  Recent Apple update provides ESPN and a live news broadcast from England covering world news.  Great choice to cut your ties from cable and satellite plus you save money which I know everyone likes.", "verified": true, "helpfulness": "0/0", "author": "Steve Burton"}]