[{"rating": 5.0, "review": "we also have 2 Roku boxes, I love that we can use with our iPhones & iPads with the apple box !!!!!", "verified": true, "helpfulness": "0/0", "author": "Rocco Z"}, {"rating": 5.0, "review": "This was given as a gift a while back, it has worked very well and I know they are very happy with it.", "verified": true, "helpfulness": "0/0", "author": "JRD"}, {"rating": 5.0, "review": "worked great", "verified": true, "helpfulness": "0/0", "author": "Arthur C Tomchuk"}, {"rating": 5.0, "review": "gets updates easily and this one still works after years", "verified": true, "helpfulness": "0/0", "author": "cailiqingsheng"}, {"rating": 1.0, "review": "Nothing but problems from the beginning with HDCP compatibility issues. All Apple support does is finger point. Apple products never cease to amaze me in their limitations and inefficiencies. Last Apple product I will ever 'attempt' to use.", "verified": true, "helpfulness": "0/2", "author": "M. Leeds"}, {"rating": 5.0, "review": "I'm trying not be an advocate for Apple but their stuff just works man. Come home and save yourselves the headache.", "verified": false, "helpfulness": "0/0", "author": "Daywalker \"v1\""}, {"rating": 4.0, "review": "This was super easy to set up with my iPhone (I didn't even have to put in my WiFi password). Typing with the controller is annoying - I'd like to see them allow you to use your phone's keyboard to control the Apple TV through Bluetooth. I was surprised at how many channel options actually existed, though the one it's obviously missing is Amazon. However, there are a few articles out there about how to get your Amazon streaming video onto your Apple TV through your phone, but that's just a hassle.", "verified": true, "helpfulness": "1/1", "author": "R. Uresti"}, {"rating": 5.0, "review": "Perfect just perfect", "verified": true, "helpfulness": "0/0", "author": "Chris ilunga"}, {"rating": 1.0, "review": "I don't believe Apple made this kind of product. Owning this was a torture. Every half an hour there was communication error. I don't even wan to talk about it's remote app.", "verified": true, "helpfulness": "0/2", "author": "sanjay baral"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Shane"}]