[{"rating": 5.0, "review": "We use this all the time.  Well worth the money and the picture is super clear.", "verified": true, "helpfulness": "0/0", "author": "Jenna Allen-Smith"}, {"rating": 5.0, "review": "What more can he say it's Apple TV, if you have one you know what I'm talking about. If you don't have one in use a iPhone or iPad you should really think about getting one.", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 4.0, "review": "Netflix app is not as good as PS3. No continuous play option. Apple TV remote works on same frequency as iMac so I have to have my computer in sleep mode to use the remote.", "verified": true, "helpfulness": "0/0", "author": "Daniel Farruggio"}, {"rating": 5.0, "review": "I purchased this to add to our Roku 3 and be able to beam Mac content to our smart TV. Found this right here with a local seller on Amazon brand new. Apple updated this 2012 one's software as soon as it was plugged in and online, I love it but Apple seriously needs to add more content. I was a bit disappointed in that respect.", "verified": true, "helpfulness": "0/0", "author": "Othermom"}, {"rating": 5.0, "review": "It was a gift.  He just loves it.", "verified": true, "helpfulness": "0/0", "author": "ann masala"}, {"rating": 5.0, "review": "It is great.", "verified": true, "helpfulness": "0/0", "author": "Saleh"}, {"rating": 5.0, "review": "streamlines all my favorite shows and videos, great while watching netflix", "verified": true, "helpfulness": "0/0", "author": "Celia"}, {"rating": 5.0, "review": "I was visiting with a friend who has apple tv and I was blown away by the variety.  Sports,  all the great HBO shows, Hulu,  etc.  Howard Stern has been raving about it for years and now I understand why.  This didn't not disappoint.  The kids selection is great for my kids, niece's and nephews.  Another great/smart apple product.", "verified": true, "helpfulness": "0/0", "author": "Toni Randolph"}, {"rating": 3.0, "review": "This only occasionally works. Not sure if this is a problem on my end or with the product. I've done all the troubleshooting and just can't figure out why it only works a third of the time.", "verified": true, "helpfulness": "0/0", "author": "B"}, {"rating": 5.0, "review": "It's Apple!  This is my 3rd AppleTv.  They all work flawlessly, never had any issues with any of them.", "verified": true, "helpfulness": "2/2", "author": "A. dinz"}]