[{"rating": 5.0, "review": "Built-in wifi, and access to all of your itunes media, this is a great media device:  Provides access to hulu, netflix, and other subscription services through a great interface.  Easy access to youtube, and direct access to latest posts from the channels you subscribe to.  Showed the itunes music festival -- easier to navigate than on the computer.Also, a great device for airplay -- letting you see your whole computer, iphone or ipad screen on a large display, or just play a video file at full screen size.By itself, it doesn't do anything (no free TV channels, etc.. - though you do get youtube).  But as a conduit for access to your media library and subscription services or for showing stuff from your other devices on the big screen wirelessly without having to plug anything else in, it excels!Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Suriyun"}, {"rating": 4.0, "review": "this is apple product, what to say, just excellant , just fine, price is higher then other device, but excellant.", "verified": true, "helpfulness": "0/0", "author": "jitu pandya"}, {"rating": 5.0, "review": "i am using this to pair with my slingplayer and large screen TV.. It works great and would recommend to anyone who has apple branded products", "verified": true, "helpfulness": "0/0", "author": "thomajc \"thomajc\""}, {"rating": 5.0, "review": "Like all Apple products, the Apple TV is a fantastic product that is easy to use and durable. I just hooked it up to my tv and follow the onscreen instructions. It's that easy!", "verified": true, "helpfulness": "0/0", "author": "gnow"}, {"rating": 5.0, "review": "Great product. Easy to use and does everything promised.  One two three four five six seven eight nine ten words!", "verified": true, "helpfulness": "1/1", "author": "Steven M Alexander"}, {"rating": 4.0, "review": "Works great! If you like watching movies and tv shows on itunes and netflix then Apple TV is for you, if not look elsewhere, Besides limited function of iTunes songs and only being able to see paid content with iTunes you don't have many other options. I don't use it that much but it is handy. Wish Netflix had more shows and movies on it though,", "verified": true, "helpfulness": "3/3", "author": "Anjali Sharma"}, {"rating": 5.0, "review": "I have found this to be an amazing product for home use to streaming photos, movies, music throughout the house.  But my pleasent suprise came when I started using it for business use in keynote or powerpoint presentations wirelessley from my ipad, or even iphone.Super easy set-up and mobility.", "verified": true, "helpfulness": "3/5", "author": "Christian Pollinger"}, {"rating": 5.0, "review": "I bought this without really reading into what it does. I originally just wanted to stream shows and music videos from Youtube from my Ipod. Imagine my surprise when I finally figured out it comes with it's own apps for those things installed. I've had this for a few months now and I enjoy it. Make sure to buy an HDMI cable since it doesn't come with one to hook into the TV. It's easy to set up even without a keyboard. No complaints so far. Don't lose the remote!", "verified": true, "helpfulness": "1/1", "author": "HappyCow"}, {"rating": 5.0, "review": "I bought this apple TV as my second unit, My first apple tv was the 720 p modeland it was good but this one if a lot better 1080 p,And also has more internal memory,What more can I say Its Apple,,,,,,A+++++", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "My sister bought this for her husband and didn't have time to order another one. It is perfect to replace all the other equipments . Now just one and they can watch all the movies they want Perfect. Fast delivery. Love it. Thanks", "verified": true, "helpfulness": "0/1", "author": "C. Luca"}]