[{"rating": 5.0, "review": "Work good", "verified": true, "helpfulness": "0/0", "author": "tam huynh"}, {"rating": 4.0, "review": "Better than TiVo but still more expensive than it.", "verified": false, "helpfulness": "0/0", "author": "donald norman"}, {"rating": 5.0, "review": "my son loves it", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "Great product and arrived earlier than expected.", "verified": true, "helpfulness": "0/0", "author": "Pato_n5"}, {"rating": 5.0, "review": "Very nice interface for your iTunes if you have a high speed internet connection. I like the simplicity of the remote, 3 buttons. The unit is small, it has one LED on it, so there's no b/s display. Everything is self contained.", "verified": true, "helpfulness": "0/0", "author": "Adam \"TACP\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "We use our Apple TV every day! It's a wonderful product and is great for our Apple-centric home!", "verified": true, "helpfulness": "0/0", "author": "Diana Schell"}, {"rating": 5.0, "review": "I got this AppleTV in order to stream movies from my iPad to my TV, especially Game of Thrones and YouTube videos which you can also play directly off the YouTube app built into the Apple TV operating system. The initial set up process was a little bit annoying but once I set it up it's very convenient to use and has no problems. For the price that is I strongly recommend this product", "verified": true, "helpfulness": "1/1", "author": "Alex N."}, {"rating": 5.0, "review": "I love this thing to death! So much better than trying to use my smart TV. If you have other apple products (like a macbook or an iphone) you can also use airplay to play stuff onto your TV. It's SO useful and easy to use. I'm so glad I bought this reasonably priced Apple TV :)", "verified": true, "helpfulness": "1/1", "author": "minamesephy"}, {"rating": 1.0, "review": "I don't have to buy anything on Netflix...", "verified": true, "helpfulness": "0/5", "author": "Tina Johnson"}]