[{"rating": 5.0, "review": "Best.Purchase.Ever.  The seamless connection between my Apple devices (iPhone, iPad. iMac, iPod) and Apple TV device have completely enhanced and evolved my home-theater and music system.  All this, and the best user interface I've found for favorite media apps such as like Netflix, Hulu+, HBOGo, and more (compared to the same apps in other tech pieces I have like the Nintendo Wii and Playstation 3).I love my Apple TV and will definitely be purchasing the update when it comes out.", "verified": true, "helpfulness": "1/1", "author": "T.KCCO \"TWK Music Lover\""}, {"rating": 4.0, "review": "Impressive. Small, powerful, easy to use. Good deal. Instant technical support if you mess up setup. Rad.", "verified": true, "helpfulness": "1/1", "author": "Luke Stefanowicz"}, {"rating": 5.0, "review": "works like Steve wanted", "verified": true, "helpfulness": "0/0", "author": "Julio Villar Marcos (estvp@adinet.com.uy)"}, {"rating": 5.0, "review": "Does everything it says, better interface than the roku 3 and better picture with no buffering. Glad I finally got one.", "verified": true, "helpfulness": "0/0", "author": "Pablo Marquez"}, {"rating": 5.0, "review": "As a Snowbird I spent my winters in Florida and summers in Washington State.  I found in doing so that I missed my Apple TV which I had in Florida, and so purchased a second one for Washington.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Ingrid A. Kleinfelter"}, {"rating": 5.0, "review": "If you like apple products, you will love this! Phone, tablet and laptop all connect like a charm. It is also great to stream netflix though without having a gaming system set up. We use this on a daily basis and love it!", "verified": true, "helpfulness": "0/0", "author": "linjes09"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "MOACIR SUHAI"}, {"rating": 5.0, "review": "SOOOOO thankful!", "verified": false, "helpfulness": "0/0", "author": "Destiny Jaymes XXX \"Destiny Jaymes\""}, {"rating": 5.0, "review": "This the great invention ever!  Great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Overall it works good, but it does have some lag, especially if you stream a movie from you mac with a media player like vlc.", "verified": true, "helpfulness": "0/0", "author": "Andreas Ioannou"}]