[{"rating": 4.0, "review": "Good product, but unfortunately, Apple decides which apps to install so there is no flexibility to install what you want.", "verified": true, "helpfulness": "0/0", "author": "JOSoCal"}, {"rating": 3.0, "review": "Its okay, it seems over priced. I would not buy it again, I would most likely just get a Fire stick or a Roku.", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 5.0, "review": "So far this is a nice device, has all the options I purchased it for.  Set up was easy, and this product was highly rated with consumer reports.", "verified": true, "helpfulness": "0/0", "author": "candy"}, {"rating": 1.0, "review": "First off let me start with the remote... It is so incapable of doing simple tasks it's almost unbelievable. You'd think with a house full of apple products it would be capable of using the qwerty keyboard on those devises WITHOUT A SECOND HAND APP. Way to overpriced for what it is, which is a streaming device. Only reason I bought it next to my chromecast was because I figured you'd be able to add your own apps on it with the app store but you can't even do that. Do yourself a favor and save around $70 and get a chromecast. If I could return this and get another couple of chromecasts I would.", "verified": true, "helpfulness": "0/1", "author": "Josh grinstead"}, {"rating": 5.0, "review": "Excelent!!!!", "verified": true, "helpfulness": "0/0", "author": "Roberto"}, {"rating": 5.0, "review": "Very pleased with AppleTV with remote.", "verified": true, "helpfulness": "0/0", "author": "Terk"}, {"rating": 1.0, "review": "We've had nothing but problems accessing content with this devise. And it's not an ISP/data speed issue because we can watch Netflix programming through our smart tv without the same problems. We purchased this specifically to be able to watch HBO content and have never seen more than about 10 consecutive minutes without data interruption. Try contacting Apple and it take you up to 48 hours to receive a reply, then you have to schedule a phone call to talk to a live person. Cable companies get a bad wrap when it comes to customer service but the iTunes service makes dealing with them a breeze. We stopped using it after less than a month and cancelled our iTunes/HBO subscription only to have the monthly service charge keep appearing on our credit card statement, and again it takes 48+ hours to resolve the issue . . . each month. We've been apple users for many years but the lack of real time customer service to back up this product is shocking and a big disappointment, from a company that once seemed to care about the consumer experience.", "verified": false, "helpfulness": "1/2", "author": "j"}, {"rating": 5.0, "review": "Love it. I can connect my MacBook Air wirelessly to our big screen TV and show pictures and videos to people at our house.", "verified": true, "helpfulness": "0/0", "author": "Amy M"}, {"rating": 5.0, "review": "As always another great Apple product.  Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Neil H Weintraub"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Francisco Diaz"}]