[{"rating": 5.0, "review": "Best streaming device ever and set took 20 secs. High quality streaming and I now listen to my music much more.", "verified": true, "helpfulness": "0/0", "author": "Akila Narain"}, {"rating": 5.0, "review": "Apple TV brings everything together in one place for easy of use.  From HBO, to Hulu, Netflix, ESPN to streaming the latest movies. Small enough to take with you when you visit family and friends. Setup was simple and easy, just purchase your HDMI cable and connect that to your TV and enjoy.", "verified": true, "helpfulness": "1/1", "author": "Damon"}, {"rating": 5.0, "review": "Every household should have one. The ONLY way to stream Netflix- It does a great job! Bought another for my boyfriend as a gift,", "verified": true, "helpfulness": "0/0", "author": "Avid Shopper"}, {"rating": 5.0, "review": "It was so easy to set up. Now I can watch Netflix or listen to music from my TV. I was concerned I wouldn't be able to figure it out since I'm not very technical technologically savvy.it was soo easy", "verified": true, "helpfulness": "0/0", "author": "Binae Karpo"}, {"rating": 5.0, "review": "Great interface and the iPad remote app is useful, too. Haven't tried using netflix yet but plan to soon. This is step 1 to saying bye bye to expensive cable for me.", "verified": true, "helpfulness": "0/0", "author": "Goody2shoes"}, {"rating": 5.0, "review": "Delivered late due to weather. Otherwise it's as great as expected! Simplifies and expands our viewing pleasure. Very satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Andrew Walter"}, {"rating": 5.0, "review": "I am a part of the Apple ecosystem and this works great for me and my daughter! Streaming is not glitchy and as more apps. become Airplay compatible and/or Apple adds mor apps. to Apple TV it will get better and better!!", "verified": true, "helpfulness": "0/0", "author": "tina hornoff"}, {"rating": 5.0, "review": "AppleTv is so easy to use my 8 yr old daughter loves to show videos on our tv from her IPad mini.  Very easy to configure and set up", "verified": true, "helpfulness": "0/0", "author": "Darren S."}, {"rating": 4.0, "review": "I love my Apple TV. So far I've had it for only 3 days but I think it's great. 4 Stars only because I have a smart TV and didn't realize that the Apple TV does a lot of the same things my smart TV does. But, I was looking for a way to connect my movies from iTunes and listen to Pandora etc. on the TV with ease and Apple TV does just that for me!I'm ready to get rid of my cable TV altogether!1. Easy to set up2. Connected in seconds to my iPad, iPhone, and Macbook Pro3. Great picture, easy to use remote!", "verified": true, "helpfulness": "0/0", "author": "Pam Bowers"}, {"rating": 4.0, "review": "I purchased the Apple TV for my mom and she loves it and I really enjoy using it whenever I am home visiting. The controller and device are sturdy and feel like quality products like most of Apple's branded products.Pros: Usability and functionality are nice. It interfaces seamlessly with Apple products.Cons: Apple proprietary, so no go on other wireless devices, which for any Apple user should know this anyways. Limited amount of channel options such as Netflix, Hulu, etc. This is why I gave it 4 stars. The price is a little steep to have such a limited selection compared to Roku, but the quality of the product is better. Don't forget you have to buy a HDMI cable for this product!", "verified": true, "helpfulness": "1/1", "author": "EHall754"}]