[{"rating": 5.0, "review": "So little money to receive such pleasure. The interface is excellent.  I enjoy using YOUTUBE for music and other video watching.  Love Netflix and many other programs.  For $100.00 dollars you just can't beat it for another viewing option.", "verified": true, "helpfulness": "0/0", "author": "Genuwine \"JH\""}, {"rating": 5.0, "review": "The Apple apps are great.  I like the music best, radioAnd Vevo.  I also added Netflix after canceling cable.", "verified": true, "helpfulness": "1/1", "author": "Jimmy"}, {"rating": 5.0, "review": "Reviews might be more objective if the reviewer was not compelled to fill this field in.  Even filling the field in is not enough, a minimum number of words is required.  Not only that, Amazon sends you an email that looks like the review form that actually is a click-through to the web site.  You cannot rate a purchase using the email as it is made to appear.  Because of the unsolicited email and the hassle Amazon creates in the process forcing a customer to go though all of this to do a review, I always deduct at least two stars.  I am happy to spend money and to give a rating.  Whether or not I provide a minimum length dissertation on the topic should be at my option.", "verified": true, "helpfulness": "0/14", "author": "Marquis"}, {"rating": 4.0, "review": "Apple's software is always a little bit less than perfect, sometime it gave us unreasonably glitches but considering the price, it's alright.", "verified": true, "helpfulness": "0/1", "author": "Snowyash"}, {"rating": 5.0, "review": "it is very useful, it works perfect, it has good materials and I can enjoy all the different services that it has", "verified": true, "helpfulness": "0/0", "author": "Pol"}, {"rating": 5.0, "review": "My boyfriend is able to watch his shows on Netflix in the loving room, and I can watch my netflix shows in the bedroom with Apple TV!", "verified": true, "helpfulness": "0/0", "author": "LGergel"}, {"rating": 5.0, "review": "It you already own Apple devices, this is a must add to the collection. It was purchased as a birthday gift for my husband and he loves it. I'm not sure how often it will be used as we already have a ton of other electronics but it does do great streaming and everyone seems to love the Netflix app on it. It's an Apple product, how can you go wrong with it.", "verified": true, "helpfulness": "3/3", "author": "L. Bryan"}, {"rating": 5.0, "review": "I'm so excited to have this.  It saves me $60 per month in cable fees.  You can even mirror your iphone to it and access the internet.  Great!", "verified": true, "helpfulness": "0/0", "author": "gjw"}, {"rating": 1.0, "review": "I purchased my first Apple TV on Christmas 2012.  It was fantastic.  I plugged it in, entered my account, made sure iTunes was running on my PC and voila! it worked flawlessly.My kids and I watched movies over the entire Christmas vacation.  It was great.  So much so, I purchased a second Apple TV for my bedroom.  Awesome!Then about 4 months ago, Apple updated my box and since then it won't connect to my iTunes account on my PC.  The only thing they are good for is watching ONLY movies I have purchased through iTunes.  All of my home videos of my kids playing and opening presents are no longer available.I did some checking and found that there are many other people encountering the same thing.  When I contacted Apple about my problem, they had me run through a battery of registry updates, network protocol changes, and constant rebooting and restarting and restoring.  Nothing works.So, I am now at a loss.  I really want to love this thing, but it has failed me miserably.  I only hope yours works.  Because, when they work, they are fantastic.", "verified": true, "helpfulness": "21/36", "author": "T. Person"}, {"rating": 5.0, "review": "Easy to set-up. Even easier to use. Love this product. I continue to find new ways to use it. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Rjflower"}]