[{"rating": 2.0, "review": "I still can't get this to do anything!  Followed directions, but it does nothing.  Anybody else have this issue?  I love the rest of my apple products.", "verified": true, "helpfulness": "1/3", "author": "Russell N."}, {"rating": 3.0, "review": "I bought this as a wedding gift for my girl, because she'd been hinting about wanting one. She's into tech stuff and gadgets and anything with an Apple logo on it, so she loves it. I like it too, but I have issues with it.There's only a couple of things I don't like about this, causing it to get a 3-star rating instead of 5 stars.For one thing, it has an app for Netflix and Hulu, but it has no app for Amazon's Instant Video. Granted, you can stream Amazon content from an iPhone, but it's annoying to have to do that. If my wife didn't automatically assume everything by Apple is the best, I'd have just bought a Roku device because that'll also play Amazon video.The other complaint is the tiny remote. I'm sure Apple-lovers are all swooning over how sleek and stylish it looks, but the remote is just entirely too tiny for my tastes. It gets lost every other day, because it's just so tiny. It's about as thick as a graham cracker, and it's very short and narrow. So it's always being buried and hidden under clutter, or it's always falling into cracks in the couches/recliners. I know it's unheard of for people to ask for bigger electronic devices, but it would actually be appreciated to have a conventionally-sized remote that won't get lost all the time. Frankly, having a bigger remote would allow for programmable shortcut buttons or a small qwerty keyboard which would make the Apple TV even easier to use.", "verified": true, "helpfulness": "0/0", "author": "Just Jon"}, {"rating": 5.0, "review": "I bought this for my husband's Christmas present...Excellent gift, for an Apple fan not to mention the price was right!", "verified": true, "helpfulness": "0/0", "author": "KIRA RECHCYGL"}, {"rating": 5.0, "review": "It works great. Kids love it! Exactly what we wanted and easy to use. Easy to install and operate. MustHave!", "verified": true, "helpfulness": "0/0", "author": "Shawna Clark"}, {"rating": 5.0, "review": "I decided to do away with TW cable and ever raising prices. I am so glad I made the switch. It works great and watching tv shows and movies when I want fits my schedule.", "verified": true, "helpfulness": "0/0", "author": "j"}, {"rating": 5.0, "review": "We all have Iphones in our home, so this was a must-have for us. We can all share photos, videos, etc instantly. The apps are also very easy to use an navigate which is all we need.", "verified": false, "helpfulness": "0/0", "author": "Belle Rodriguez"}, {"rating": 4.0, "review": "It has everything but.... it does not have the ability to connect to the internet unless you share your IPAD or device.", "verified": true, "helpfulness": "0/0", "author": "TexasLonghorns"}, {"rating": 5.0, "review": "This is my second Apple TV - it is just as good as the first one!  Easy to setup and very reliable.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "i bought this some time back and now with technology you can buy just about anything with netflix and youtube. i love this so i can mirror any streaming video from my i-pad onto my large tv.", "verified": true, "helpfulness": "0/0", "author": "mike fogerson"}, {"rating": 5.0, "review": "Have a bunch of Apple iTune movies now, and this little device is really nice to have for entertainment.  Such a small device that can handle a lot of functions, but my only wish is when these devices can handle full web content on an HDTV.  Someday perhaps.", "verified": true, "helpfulness": "0/0", "author": "SR"}]