[{"rating": 5.0, "review": "very good,fast", "verified": true, "helpfulness": "0/2", "author": "jiang,xudong"}, {"rating": 5.0, "review": "Simple to set up.  Some of the programs, like YouTube and PBS require a code to set up.  All you have to do is log in to website for each program with code provided and you are all set to go.  We don't have cable or satellite, only antennae tv, so this gives us a few more options.  We can  mirror items on our iPhone, which is awesome.  First purchased one for our family room and recently purchased this for our bedroom. The only con is we can not watch Amazon videos.", "verified": true, "helpfulness": "1/1", "author": "Cathy \"Cathy\""}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/2", "author": "David Velasquez Jaime"}, {"rating": 5.0, "review": "Excellent medium for streaming.", "verified": true, "helpfulness": "0/2", "author": "Mary Ann Swanson \"EPS\""}, {"rating": 4.0, "review": "came quick and wirks as expected... 2nd apple tv we own", "verified": true, "helpfulness": "0/1", "author": "Brian Chapman"}, {"rating": 3.0, "review": "I LOVE my AppleTV!", "verified": true, "helpfulness": "0/1", "author": "eds"}, {"rating": 4.0, "review": "Its a Apple TV. Does everything it suppose to do.The only part I don't like is not the TV but the apple ego.  I am able to access crunchyroll for free on Android (sure, there are ads) but not on Apple TV. I have to be a paid member to get it.", "verified": true, "helpfulness": "0/1", "author": "fobster"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/1", "author": "Ab"}, {"rating": 4.0, "review": "It is not as fast as the Roku except for fast forward and backward, where it beats the pants off the Roku.", "verified": true, "helpfulness": "0/1", "author": "Robert B. DeBellis"}, {"rating": 5.0, "review": "If you have high speed internet and any other apple device (and you do), buy this product. The free content alone is well worth it. The pay content is also fantastic and only improving. Very rarely am I this happy with a purchase.It may take a few min to enter all the necessary codes to receive subscription content, but that's the only \"con\" I can come up with. I'd buy another one in a heartbeat. Even got an extra one and set it up for my parents already.", "verified": true, "helpfulness": "0/0", "author": "Daniel Rhys Cook"}]