[{"rating": 1.0, "review": "i'm not sure if it's my lack of technical expertise or the fact that all my other apple equipment experience has been so good but, so far, the apple tv is a waste of money.", "verified": true, "helpfulness": "0/2", "author": "Martha \"med\""}, {"rating": 5.0, "review": "I love my new Apple TV.  I wish I had bought it a long time ago.  I would recommend to anyone that has a Mac or Ipod touch.", "verified": true, "helpfulness": "0/0", "author": "Amanda Johnson"}, {"rating": 3.0, "review": "I have two of these, they work very well although slow to go through the menu and options. The toughest thing about the Apple TV is you are at Apples mercy when it comes to updates at which time they may add one or two new channels, so it really is limited. They do not have Amazon Prime, so I recently purchased the ROKU 3 for that purpose.I guess it's about how you use a streaming device, I don't care about AirPlay; I don't listen to my iTunes on the TV, I don't care about having photos up and I don't rent / buy movies from iTunes. But if you do or like all that this is a five star unit. I just want Prime and maximum streaming options and flexibility, ROKU does that. So don't get me wrong it's like serving a beautifully prepared filet mignon to a vegan! The Apple is best if you; 1. own Apple devices and  2. use them in conjunction with the TV.The other issue I have is the remote has to be very close to the unit and nearly in front to change channels, very annoying. There is an App that takes the place of the remote, and that is certainly useful.Frankly with ROKU at the same price the  Apple doesn't make sense, it  is too limited and not flexible, I should be able to buy Apps the way I do on any Apple product. I cannot recommend.UPDATE: to be fair in reviewing this I am trying out the music channels and they are wonderful! Very surprising fidelity, excellent. Set it up through my receiver and the music reproduction is awesome. Again I continue to feel there are not enough APP options and flexibility compared to the ROKU, but I am among the converted when it comes to what it does offer. I will add I have it connected directly to the router, not WiFi so that helps.I continue to feel it is largely geared to Apple products users, and frankly if it had Prime I wouldn't feel the need for the ROKU. Since I have both I would say if you have to buy only one and want Prime, ROKU is not a compromise. If you don't have Prime and don't care and want the best in Audio/ Video reproduction quality Apple is the way to go.", "verified": true, "helpfulness": "1/1", "author": "ACRA"}, {"rating": 5.0, "review": "I love this Apple TV.  I bought it for my wife for Christmas, since she had been asking for it... She loves it, I love it, my son loves it, everyone that see's it loves it, etc!  I love that I can setup sharing and easily stream movies, music, pictures and more from our iTunes on any computer.  I also love that I can use my iPhone to share my screen from my phone right up onto my big screen TV, so I can easily show pictures to people that are over or anything else.  You can rent movies, it has a ton of free radio stations, I love watching YouTube or finding Disney stuff on YouTube for my kids.This thing is worth every penny!", "verified": true, "helpfulness": "1/1", "author": "Matthew Gisonno"}, {"rating": 5.0, "review": "It is bomb.com... Strongly suggest anyone thinking about it gets one. Especially if you have a Mac and or iPhone!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Works, A must if u own an ipad. cause apple air feature is really awesome! received a working product which makes me a happy customer!", "verified": true, "helpfulness": "0/0", "author": "tinkles"}, {"rating": 5.0, "review": "I love my apple TV, it's far better than Roku. I own 2 Apple TV's and use them often. Great product", "verified": true, "helpfulness": "0/1", "author": "Lisa D Massa"}, {"rating": 5.0, "review": "My son ordered this for my husband and me and we are so thankful! It has made life watching TV so much easier.", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 5.0, "review": "My wife purchased this as a Christmas gift and soon became the family gift. No more moving the Wii or Xbox as an extra source of online streaming. It is great to pull out one of our IPads and stream family photos or video to everyone in the home on our TV set. I love the screen saving feature that scrolls thru my IPad photos and passes them along the screen.We are big Netflix fans and use this unit often to view films, videos from YouTube etc.  a great buy for Apple Fans!", "verified": true, "helpfulness": "0/0", "author": "mdcowboys@aol.com"}, {"rating": 5.0, "review": "Great product! We love the Apple TV. Ots a great addition to the iPad, iphone family. I recommend this product to all apple lovers.", "verified": true, "helpfulness": "0/0", "author": "Taylor Lambert"}]