[{"rating": 5.0, "review": "It was everything she expected it to be.  Easy to set up she has enjoyed it very much!  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Jerry Perkins"}, {"rating": 5.0, "review": "As Apple has us acostumed this is a great product.  Only thing is for it to be able to see files from a NAS, with that it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "R. Izquierdo \"juron\""}, {"rating": 5.0, "review": "Absolutely amazing. So easy to connect. Not to mention this cool design. Would've paid $100 for only the remote ;)Love it love it love it", "verified": true, "helpfulness": "0/0", "author": "Hrefna Aevarsdottir"}, {"rating": 5.0, "review": "This little box has gotten me away from my computer, and watching Hulu and Netflex on my television. The remote is the neatest gadget. All of my other remotes have many buttons. The Apple TV's remote has three, and it is amazing what those three buttons allows you to control.", "verified": true, "helpfulness": "2/2", "author": "Ray Thorne \"razor\""}, {"rating": 1.0, "review": "Airport Express to Airport Extreme to ASUS N66U routers. Streaming from my iPad or iPhone to the Apple TV is just a pain now, always lagging or shuttering. Audio and video goes out of sync at times too. This doesn't happen before and I thought it is the router not fast enough, but no, it is the recent firmware update of the Apple TV and the latest iOS, rendering Airplay of videos unsmooth in a lot of situations.", "verified": false, "helpfulness": "0/4", "author": "Yano"}, {"rating": 5.0, "review": "Smaller than the original which I already had.  Put my old one in another room but this new version lets me view and listen to my iPhone and iPad movies and music.  Saves time putting everything on my computer.  Only problem is there is a bug getting it to work initially only because of Apple software.  Unfortunately you need to unplug everything then re attach cables to everything for this to finally work.  After that have not had any problem once I did a restart. Took me hours to find this fix online.  Now I love it!", "verified": true, "helpfulness": "0/0", "author": "Janet G."}, {"rating": 5.0, "review": "The apply tv arrived right on time. Packaging was good. We hooked this up in the bedroom upstairs and it synchs perfectly with our wifi downstairs.", "verified": true, "helpfulness": "0/0", "author": "Cloud"}, {"rating": 5.0, "review": "I've never been in the cult of Apple.  Mac Books and iPhones are nice but never worth the money to me.  This thing is TOTALLY worth it.  The interface is indescribably better than the one on our Bluray player, we can do absolutely everything with it, and our picture quality improved way beyond what I had previously thought our internet connection was capable of.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 4.0, "review": "I found that the unit is easy to set up and use, but I have an iMac, iPhone and iPad. It is seamless with apple devices. My only complaint is that it does not stream amazon prime video", "verified": true, "helpfulness": "0/0", "author": "frank"}, {"rating": 5.0, "review": "This works quite well and I now have the original (760p) Apple TV and the new one (1080p).I am very pleased with this instrument.William Linder", "verified": true, "helpfulness": "0/0", "author": "William R. Linder"}]