[{"rating": 5.0, "review": "another great product", "verified": true, "helpfulness": "0/0", "author": "keith e gregory"}, {"rating": 5.0, "review": "My sister liked mine so much I bought this one for her", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Paulo"}, {"rating": 5.0, "review": "This is an Apple essential. Provides you with seamless connectivity between your Apple devices as well as giving access to many apps and entertainment from the Apple Store. Worth every penny. Especially if you have Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Max Colte"}, {"rating": 5.0, "review": "AppleTV is a fabulous little device (and I do mean tiny -- about the size of two decks of playing cards!). We love the PBS app most of all; so nice to be able to watch our favorite shows after they air instead of having to be home at a certain time to watch them live. We've also been very pleased with the extra content PBS offers through the app on this device. Having AppleTV has also inspired us to subscribe to Netflix for the first time ever; accessing movies, documentaries, and tv shows is a snap via AppleTV. My husband is in his 70s and has become increasingly technically challenged, yet he mastered how to use the AppleTV (and how to toggle back and forth between it and our cable service) within a week. Yay! Now he is primarily watching content via AppleTV, so I'm hoping to disconnect our cable service altogether. Double yay!! AppleTV is a stellar product and we are continuously pleased with this purchase; we highly, highly recommend it. (AND, YES, THIS VERSION DOES INDEED COME WITH A REMOTE!)", "verified": true, "helpfulness": "1/1", "author": "Ancient Aunt"}, {"rating": 5.0, "review": "I love this product! Once I added all my movies to my iTunes and set up home sharing it turned my room into a personal home theater!!", "verified": true, "helpfulness": "0/0", "author": "Joshua Johnston"}, {"rating": 4.0, "review": "It is not reliable, must turn it on an off some times to view the videos or movies.", "verified": true, "helpfulness": "0/1", "author": "Just4u"}, {"rating": 5.0, "review": "Gave this to my husband for Christmas and he loves it.", "verified": true, "helpfulness": "0/0", "author": "GramiZ"}, {"rating": 5.0, "review": "A great item and esxactly what I wanted.", "verified": true, "helpfulness": "0/0", "author": "peter t. waters"}, {"rating": 3.0, "review": "I am a bit disappointed. The picture is great. However, 80% content providers available through the apple tv require cable subscription. This is ridiculous since I bought apple tv as a replacement of cable tv! Netflix and HBO the only two I found accessible without contract with local provider. And be informed, that you cannot install soft from appstore to apple tv. All applicstions it has are preinstalled and all you can do is to use or hide them. Airdrop is s great thing, which a bit glucky however. It freezes from time to time. So, if you gonna see a long movie - expect that you will have to restart it at least once or twice.", "verified": true, "helpfulness": "0/0", "author": "Maksym Popko"}]