[{"rating": 5.0, "review": "I have one of the first ROKU's and of course has a little problems. Since all my \"toys' are from Apple, I decided to try the Apple TV. The setup instruction is not clear, but going on the internet to the Apple site, there you can get all the missing details.The unit works absolutely fine and since we are fluent in several languages, we can watch not only movies but most of the foreign TV stations. We don't have to see the tinted US news of course.I'm sure if Apple comes with a new unit in the future, even so I don't know what they can do better, I'm sure I will buy it.", "verified": true, "helpfulness": "0/0", "author": "everhardo"}, {"rating": 5.0, "review": "Awesome device. If you have your ITunes on the cloud this device will let you stream all of your music through your TV and audio receiver. Easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Canaan Lawrence"}, {"rating": 5.0, "review": "So easy to install and if you need guidance AppleCare is there for you to guide you step by step.Will certainly recommend it , so much easier to use than streaming through other devices.", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "It came just as expected, super fast shipping I will be purchasing from them again. Item idles it's job and is not cheap or flimsy the kids love it we get to watch all our she's and catch up on movies", "verified": true, "helpfulness": "0/0", "author": "cassandra alvarez"}, {"rating": 4.0, "review": "Works very well. Enjoy air play and Netflix.  Also streaming music from main computer is very easy to perform. It's all user friendly.  I recommend it", "verified": true, "helpfulness": "0/0", "author": "Teresa Garden"}, {"rating": 5.0, "review": "As every other Apple product, this one exceed it's expectations. Package arrived as noted on order and the item was brand new, simply amazing", "verified": true, "helpfulness": "0/0", "author": "Tenace"}, {"rating": 5.0, "review": "Super cool technology. Limited screen content I must admit but the presence of You Tube makes up for it. The big one is the Mirroring of my devices on to the big screen. AAh Bliss.", "verified": true, "helpfulness": "0/0", "author": "Harry B ,Woodlawn Bronx"}, {"rating": 4.0, "review": "I found this listed on Amazon for less than other sites.I'm happy with the way it connected to my smart Samsung TV.It is very easy to set up.Only thing I would change it the size of the remote. It's small size is a little hard to use with large hands.Harold", "verified": true, "helpfulness": "0/0", "author": "Harold Lamprecht"}, {"rating": 5.0, "review": "awesome product.. no complaint... easy set up .. wish it comes with clear instruction of software information and menu set up", "verified": true, "helpfulness": "0/0", "author": "rdknpdgd"}, {"rating": 5.0, "review": "Does everything I could imagine, and the ability to send nearly any video on our iPhones and iPad to the TV made this THE streaming device I was interested in. We use it every day.", "verified": true, "helpfulness": "0/0", "author": "Thomas Waring III"}]