[{"rating": 1.0, "review": "Really bad problems with the new software updates.Apple delivers great products, but horrible updates.Any apple device will become pratically useless in two years if you do the recomended upgrades.", "verified": false, "helpfulness": "3/3", "author": "Cesar Lara Gavino"}, {"rating": 2.0, "review": "Sporadically fails to function.", "verified": true, "helpfulness": "7/7", "author": "Project Firestart"}, {"rating": 5.0, "review": "With the apple tv, my apple experience it's complete.  is th right way to watch tv.", "verified": true, "helpfulness": "0/0", "author": "Angel G Ramos"}, {"rating": 5.0, "review": "As expected. Second time around. It works great.", "verified": true, "helpfulness": "0/1", "author": "steve johnson"}, {"rating": 5.0, "review": "Love it", "verified": false, "helpfulness": "0/1", "author": "Melvin"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/2", "author": "Steve"}, {"rating": 5.0, "review": "Love it.  Just wish they integrate Pandora.  I'm not a fan of Beats Music.", "verified": true, "helpfulness": "1/2", "author": "Aaron Check"}, {"rating": 1.0, "review": "I cannot believe Apple would allow an underperforming device such as this. The apps consistently do not work, crash, or reboot the device. Multiple times per day I find I must sign out and sing back in to the various apps. Apple should step up quality control and user experience for the apps available on the device. AirPlay is another disaster. When I first got this device back in ios 6 it was a much different story. Loved AirPlay and the apps, but the quantity of apps was low. The only apps that I use that work are Netflix and HBO GO.", "verified": false, "helpfulness": "0/4", "author": "J. K. \"J.K.\""}, {"rating": 4.0, "review": "I purchased the Apple TV over a year ago and it still works perfectly.  Seems like every time I use it they have added more programming.  Although, most of the programming I am not interested in.  I do like the mirroring capability from my ipad and iphone to the television.  I also enjoy watching FOXNow, HBO, Netflix, Showtime, and YOUTUBE videos on it.  Not to mention the occasional movie from iTunes.What I don't care for is the Apple tv remote.  It is narrow and thin.  We always lose it in the sofa. What is a great alternative is the apple remote app.The family downloaded the free remote app.  Not only does the app come in handy when we have misplaced the Apple TV remote, but it is also much easier to enter search information since you can just type keywords easily from the keyboard vs tediously navigating left, right, up and down selecting letters for the search criteria.", "verified": false, "helpfulness": "1/1", "author": "Showmestate"}, {"rating": 4.0, "review": "Great for mirroring, ties well into the Apple ecosystem. Not so great with the variety of apps, and you're pretty much stuck with whatever's baked-in. (That's where mirroring comes in.)", "verified": true, "helpfulness": "0/0", "author": "alexakajojo"}]