[{"rating": 4.0, "review": "I really love this thing!!1. I just have to wait 2 days (I didn't pay shipping) and arrives in perfect state2. The presentation of the Apple TV (in and out of the box) are perfect, too clean (like always apple does), comes with the regular Apple stickers, manuals, Apple TV Remote, the cable of power and the Apple TV, I really love it3. You can use every \"app\" in the Apple TV IF you live in the United States, I live in Colombia and I can use the basic (music, movies, Netflix, YouTube) but if I wanna watch HBO, FOX, Disney, ABC, CNN and everything else I have to switch the country of my account, that's the only bad thing4. It should come with a HDMI included, but anyway these cables are not expensive (the mine costs 5 dollars)5. The Apple TV remote it's a little annoying, it's to tiny so when you lose it in the couch, or the bed, or anywhere else is so hard of find it.6. Isn't heavy, isn't too big but isn't too small either, the size of the Apple TV is perfect, I'd buy a mount for put it on my tv (costs 14.99 [really good price])7. It takes a lot of time downloading the movies I buy in iTunes Store, in 720p The Hobbit: The Desolation of Smaug takes like almost 4 hours in charge, in 1080p takes up 5 hours! (The movie duration is 3 hours and 9 minutes, takes longer the charge than the same movie)I recommend it if you like to watch movies all the day!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Barbosa"}, {"rating": 5.0, "review": "good and quick delivery", "verified": true, "helpfulness": "0/0", "author": "KH Yang"}, {"rating": 5.0, "review": "Great, bought as a gift for my husband.  Easy to use and we can watch all the movies that he has purchased from Apple and Netflix.  Great deal for the price!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Taylor \"clothes horse\""}, {"rating": 5.0, "review": "Works great for us.  Love the ability of showing our pictures using Airplay from the iPhone and iPad.  Make sure you have a good, high speed internet connection if you are streaming video.", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "this was the best deal out there for all in one access to entertainment", "verified": true, "helpfulness": "0/0", "author": "piccolo0069"}, {"rating": 5.0, "review": "Worked well, fast delivery", "verified": true, "helpfulness": "0/0", "author": "Tallassee City Schools - Technology"}, {"rating": 5.0, "review": "I like Apple products because they are user-friendly. The set up was easy and accessing the apps was easy too. Just make sure you know your password for you specific cable company. Be sure to turn on the Home Sharing option on your computer or other apple device too (not required, it just allows you to access the things you have places too).  You need to purchase an HDMI cable to use the device.Buffering can be an issue at times. I am not sure if it's Apple TV or my cable company.", "verified": true, "helpfulness": "0/0", "author": "Nicki"}, {"rating": 5.0, "review": "I love Apple TV!! The apps are great, and I can't believe how easy the apple device to Apple TV feature is to use! Wow!", "verified": true, "helpfulness": "1/1", "author": "J.R."}, {"rating": 5.0, "review": "BOUGHT AS A GIFT FOR MY DAUGHTER AND SHE LOVES IT. MULTIPLE APPS. ARE DEFINITE PLUS, SAVES ON CABLE SUBSCRIPTION. PLAYS NETFLIX FLAWLESSLY. GETTING ONE FOR MYSELF AND I HIGHLY RECOMMEND.", "verified": true, "helpfulness": "1/2", "author": "SERGIOP369"}, {"rating": 5.0, "review": "Excellent!  Very useful to show content from Netflix, YouTube, etc. on our TV screen.And I use it to display photos and play music from my Macbook.", "verified": true, "helpfulness": "2/2", "author": "Show-Me Skeptic \"Show-Me Skeptic\""}]