[{"rating": 5.0, "review": "The best thing about Apple products is they come with zero fuss...and the same goes with Apple TV. You take it out of the package, plug it in and you are on! Works perfectly with iphone, ipad, Macbook (with Airplay). Remote is also as simple as it can ever be.As always Amazon did a perfect job in delivering it on time with perfect packaging!", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Very convienent to use and the set up is so easy. I Highly recommend this product for you iphone, ipod or ipads. The mirroring feature is so cool! We enjoy watching shows and movies, playing games or reading the news on our 55\" TV and the picture quality is very good!", "verified": false, "helpfulness": "0/0", "author": "MomOfTwo"}, {"rating": 1.0, "review": "Apple makes good looking, easy to use products, but God help you if your products don't work. Don't think this is a one off \"damaged in shipment\" rant because mine worked fine for a few months and then exhibited a problem many others are writing about online.Their support makes calling a 3 hour support line in India seem like a pleasant solution. Because in this case after you go through your call and endless steps the problems are often resolved. Apple gives you advice that doesn't work, doesn't give you advice that does which they should know and then at some point throws up their hands and says \"sorry screw you\" even though you've invested money for years in their products like content that is now useless to you. This happened to my entire iTunes music library as well. I kept at it but had I not I would have been out thousands of dollars I spent. Apple support cut me loose to my own devices. (no pun intended)Anyway back to Apple TV.This Apple TV worked for months and then recently it started taking content like movies 2+ hours to load. I also have Netflix, Youtube, Amazon and Hulu Plus on my Smart TV and none of them have problems so I know it's not a network issue.I searched the net for hours trying to find out what's going on. It turns out users all over the world are having this problem as well. 100's of pages of discussion and still no resolution is forth coming nor has apple addressed this issue. They have a short support page on it that according to what I've read has helped absolutely no one. It's clear it's still a problem and as of to date silence from apple with the exception that \"yes some apple tv's will be replaced for free\". Sadly my Apple TV serial number is not one of the ones eligable? Why not? I purchased it very recently.For various products including Apple TV I've contacted customer support and 20 to 30 emails later being constantly shuffled around they *still* don't know what I'm talking about. I am very fluent in english, tend to express myself well and have spent years engineering devices like Apple TV so the problem is not on my end. I was also friendly and patient.Recently it started working again but it's a gamble. Say you have a movie night planned with your sweetheart and friends and nothing plays for you that day? It's not a gamble with any other streaming service like Netflix, but it is with Apple. Buying an Apple product means you are at the mercy of your own technical expertise and if I as a former hardware designer and former software designer with a degree in physics can't figure it out, then it's generally not suitable for the average consumer.Yes of course I reset the box, downloaded firmware updates and reset the box, reset my modem, reset my router, updated the firmware on my router, checked all my router settings, did an internet speed check, reset network configurations, spent hours researching on the net, etc. I would say stick with other streaming services but the problem is Netflix and Hulu don't have the large selection that Apple does.One thing you can do is download the entire movie while you're at work onto your laptop hard drive and watch it on your laptop. Then you are guaranteed that you will be able to watch the movie or tv show when you want it. Which would obviate the necessity of buying this box.Or if being randomly disappointed when the screen says \"3 hours until movie is ready to watch\" and you don't mind that by all means go ahead and buy the product but don't expect support. And of course yours could be one of the many boxes that is never affected by this problem, but how would you know?", "verified": true, "helpfulness": "17/30", "author": "S.K."}, {"rating": 5.0, "review": "I took this with me to Dominican Republic and was able to use it with my ipad and get all USA , like Netflix and other things I use to steam, not like my song player, would not pick up USA only the country's program. It's very easy to use and steam onto to your TV .", "verified": true, "helpfulness": "0/0", "author": "angie"}, {"rating": 5.0, "review": "Got one for each TV in the home.  To access my Netflix, iTunes library (photos, movies, tv shows)  and Aperture library (photos, home movies) stored on my iMac.  Never had any problem with device itself and they just work.  The only issue I had was with Airplay from my 27\" iMac to an AppleTV having stuttering video on a 1080p movie (both devices were ethernet connected) but Airplay works fine from iPhone and iPads (perhaps because of the lower resolution and therefore lower bandwidth requirements?).", "verified": true, "helpfulness": "0/0", "author": "S Movva"}, {"rating": 5.0, "review": "I had an older version of this and it stuttered a lot during Netflix views. This one has been great!", "verified": true, "helpfulness": "0/0", "author": "Jakintosh"}, {"rating": 4.0, "review": "I would love to say its 5 stars especially because it apple but I can't. It has a beautiful UI that is easy but it does have WIFI PROBLEMS!! Sometimes it says theirs a errror when i try to watch netflex. So i have to unplug it and plug it back in. But it if very nice and small, but until apple fixes the wifi problem I can't really recommend it, even if you can mirror anything from your ipad or iPhone on to it.", "verified": false, "helpfulness": "0/0", "author": "Andrew2834"}, {"rating": 1.0, "review": "I bought this product because I LOOOOOVVVEEEE my iPhone.I love the simplicity of the interface, the user experience design, and the fact that everything works.  It just works.  No time messing with settings, or tweaking this or that, or having to update codecs, or any of that.  Everything just works.So, when it came time to ditch my cable, I thought this was the no brainer.Let me just save you the trouble, and tell you to take your $99, stick it back in your wallet, and go get something else.  Anything else.  Get a box of crayons and a notepad and make yourself a flipbook - because at the end of the day, you'll at least be able to watch it.Lets start with the crux of the problem - iTunes.  iTunes is a disaster.  It hasnt aged gracefully, and it really needs to give up the goat and allow something better to come along and replace it.  Call it iMedia, or iVids, or iDontGiveaRatsass what you call it - just dont call it iTunes. Because I (and I'm sure I'm not alone) will avoid it like the plague.Aside from completely destroying my folder structure after I specifically said \"NO\" to the reorganize my media option (still pissed about this) - it placed about 90% of my library all willy-nilly into a single \"not added\" folder.  Yeah.  About 500gb worth of songs/videos/etc in one folder, with no naming convention, and no way to play them in iTunes.Then, what it did add, it added about 3 copies of to my library.  And guess what - apple is obviously keenly aware of this problem because they created a \"handy\" option to show all duplicates.  And thats great, because it highlights all the duplicates so you can manually go through them, right click, delete, and hope you go the right one and dont wipe the file off your disk.  Super helpful apple, thanks!Oh, and it only plays MP4 videos.  And even then, even if all you have are MP4s, its VEERRRRYYY picky about which MP4s it will play.Its a joke.  Its useless.  I get a warning message about 10 times a day telling me to update the software, which has come up since I bought the damn thing, and yet every time I've tried it fails.  It spends about 20 minutes going through the whole process, reboots, and tells me it failed.  Every. Time.Seriously worst product ever.Apple, you've lost someone who was a BIG supporter.  I still love my iPhone, but just not apple.", "verified": true, "helpfulness": "10/21", "author": "Steven Soeder"}, {"rating": 3.0, "review": "I am apple fun but this appletv I got had trobble with my non apple wireless router, ( I have Belkin n wifi router) Every so and then I had to unplug the power cable from my wifi router and rplug it back on to make it work with this appletv beauty. I dont know was that the router, modem of the appletv itself the problem. The appletv customer support suggested me to buy a apple airpot extreme ( that is a apple fiwi router with extra feauters) for just over $200 but as you can guess", "verified": true, "helpfulness": "0/1", "author": "David Dvalishvili \"happy man\""}, {"rating": 4.0, "review": "Great product however I just realized I would need aHDMI cable when trying to install it. The vendor shouldhave specified that the cable is not included.", "verified": true, "helpfulness": "1/1", "author": "Lucy"}]