[{"rating": 5.0, "review": "Awesome! Easy to setup and get viewing!", "verified": true, "helpfulness": "0/0", "author": "BigEater"}, {"rating": 4.0, "review": "I bought this for one thing and it has not disappointed. It integrates well into my already Mac system so have access to all my media files from computer. The one downfall I found is in having to go to computer to activate most of the channels , so I would give this a 3.7 rating on the stars but it doesn't let me so I rounded.", "verified": true, "helpfulness": "0/0", "author": "Michael Quiroz"}, {"rating": 5.0, "review": "awesome product!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "mandez"}, {"rating": 5.0, "review": "My husband and I have an Apple TV and we use it every day.  It allows us to watch shows through Netflix and our Apple movies purchases.  It is really easy to use and I can't imagine doing without it.", "verified": true, "helpfulness": "0/0", "author": "poohbearplace \"smederos\""}, {"rating": 5.0, "review": "A must have in any house especially if you have apple iPads and computers! Love it! Drop down to minimal cable and now have Netflix and Hulu plus & amazon prime too. Amazon prime isn't built into Apple TV, but if you have an kindle well your all set, if you have and iPad you can just play it threw apple air play by mirroring it on your screen works the same. We save lots of money this way!", "verified": true, "helpfulness": "0/0", "author": "Melissa Fortier \"Melis22\""}, {"rating": 5.0, "review": "Great item.", "verified": true, "helpfulness": "0/0", "author": "LFMOLINA"}, {"rating": 3.0, "review": "This device gets 3 stars, not because there is anything wrong with it but because it's just not needed if you have smart devices. Most of my devices (blue ray, TV, etc) are smart devices and have apps like Netflex, Amazon, etc. built into the device. You really don't need this device if you have that.The only thing this gives you extra is if you have a lot of Apple Products at home (iphone, ipad), etc. is a convenient way to mirror your device to the TV. That was the main reason I bought this. My daughter has an iphone (I personally don't like Apple products because I think they are overpriced) and she wanted to mirror the phone on the TV. I ended up laying $100 for this which is way too much. Apple did drop the price down to $69 because they realize this just isn't too attractive other than that capability. You can get the same from your smart devices, roku, or chrome cast for less.", "verified": true, "helpfulness": "0/1", "author": "milman"}, {"rating": 4.0, "review": "Like the AirPlay feature. Lose connection more than I would like...but that may be my service provider/router issue, hard to tell. Although I don't seem to have an issue with other devices. Overall I am a satisfied user. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Justin Bondurant"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "Ezra"}, {"rating": 5.0, "review": "works as expected great price", "verified": true, "helpfulness": "0/0", "author": "William B \"Scott\""}]