[{"rating": 4.0, "review": "The apple tv works perfectly. I was skeptical about buying this from another retailer outside of apple, but it works fine.", "verified": true, "helpfulness": "1/1", "author": "Kendeno Knowles"}, {"rating": 5.0, "review": "Very good and easy to use , The remote is a little weak , but for the price and watching netflex and youtube was easy", "verified": true, "helpfulness": "1/1", "author": "Sol"}, {"rating": 5.0, "review": "For the price (100 bucks) it's one of the best devices you can hook up to your TV. I've never seen netflix run faster and/or with such good quality (tried it on my PS3, computer and ipad).", "verified": true, "helpfulness": "1/1", "author": "Agustin Pablo Costa"}, {"rating": 4.0, "review": "I love that I can mirror from my iPad and iPhone onto our tv.  You can't mirror everything...Amazon Prime movies being one.The thing I guess I wish it had?  More to do.  I wish that there were apps specific for Apple TV that could be used via phone or remote.  I wish I could go onto safari without having to use my other i devices.UPDATE - March 2014Sorry it has been forever.  They have updated it and it now has HBO for those with HBO.  There are many more pre-installed \"apps\" and things to do.  I enjoy it more now.I stopped using it for a couple of months because it was kind of boring but once more content was available and mirroring is allowed via more sites, it is great.", "verified": false, "helpfulness": "1/1", "author": "Raeann"}, {"rating": 5.0, "review": "Bought this for my girls room. Play Netflix and Pictures on it for my kids, easy to setup up, wireless connection works great.", "verified": true, "helpfulness": "1/1", "author": "Dr. Benjamin Smith"}, {"rating": 5.0, "review": "The Apple TV new version it's a great product, extremely useful and very easy to use. I recommend buying for everyone!", "verified": false, "helpfulness": "2/2", "author": "Lib"}, {"rating": 5.0, "review": "This is my 2nd one and I love it.  I had to get one for the bedroom since we enjoyed it so much in our Living Room.  Absolutely love this product.  No lag time at all when watching Netflix but that also depends on your Internet connectivity at home.", "verified": true, "helpfulness": "0/0", "author": "Angel V. Vivas III"}, {"rating": 5.0, "review": "I purchased my Apple TV device to watch streaming shows on my tv after envying my friends for over a year. It's primary use is to allow services you pay for, such as Netflix to be viewed on your tv. It is easy and quick to set up. One must know a bit about computers. If you can't program it yourself, well that's why we had children, grand children and neighbor's children. My son did the parts I could not do in ten minutes. Overall set up time was about twenty minutes. You will need an HDMI cable to reach from where you set your receiver to where the tv is located. The receiver must be in an unobstructed place for your remote. The remote is easy to use and only has three buttons!", "verified": true, "helpfulness": "0/0", "author": "Ted Lagueux"}, {"rating": 4.0, "review": "Works well and easy to setup.  The remote takes a bit of getting use to.  I wish there was a keyboard option with it.", "verified": true, "helpfulness": "0/0", "author": "M.Jones"}, {"rating": 5.0, "review": "I have my whole house wired with Apple TV's with a airport extreme tied to a HD for digital movies and such. I have a great time with this! My friends love that they can select any of the 500 movies I have with a click of a button. I look forward to using these items for many years to come! Digital Streaming is the way of the future!", "verified": true, "helpfulness": "0/0", "author": "Kbails84 \"kbails84\""}]