[{"rating": 4.0, "review": "Love Apple TV, but the remote failed after only 1-2 years. You can only go up or down, which is not very helpful. Fortunately, Apple was smart and made an app, so we only have to use the remote to turn Apple TV on and off and can use our phones to navigate through the apps and search for shows.", "verified": true, "helpfulness": "0/0", "author": "Barbara G."}, {"rating": 2.0, "review": "Meh... it's ok.  The content is limited to various pay sites and there is very little customization possible.  It'd be nice if I could knock out ALL the channels I don't want INCLUDING the apple ones.  There will never be a time I use itunes to purchase/rent a movie.  The alternatives are simply too plentiful and cheap.  It is very likely I will be replacing this with a HTPC-like box.  The new android boxes are becoming amazingly robust, configurable, and infinitely more useful.  The appletv's saving grace is I can stream to it from my computer/phone, but it'd be nice not to have to do that to get the content I want (amazon prime I'm looking at you!).  I know they are competitors, but really, I don't care.  I am not partial to any one company, stop trying to force me into a corner.  Win me with content, service, and price, not with lockouts.", "verified": true, "helpfulness": "5/6", "author": "Sheila"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "David Cormier"}, {"rating": 5.0, "review": "Bought this for my sister and haven't heard a single complaint or issue.  She loves using it with her iPad to watch shows on TV.", "verified": true, "helpfulness": "0/0", "author": "Liberty Joy"}, {"rating": 5.0, "review": "Love my Apple TV, easy to use and setup.", "verified": true, "helpfulness": "0/0", "author": "RobinGolf"}, {"rating": 3.0, "review": "Airplay/mirror is starting to work with fewer apps each day", "verified": true, "helpfulness": "0/0", "author": "Santiago"}, {"rating": 3.0, "review": "I think I will get more use out of my Roku", "verified": true, "helpfulness": "0/2", "author": "flyboy"}, {"rating": 5.0, "review": "Great!! i love airplay", "verified": true, "helpfulness": "0/0", "author": "Sergio Paz Morales \"Zeuz\""}, {"rating": 5.0, "review": "Love it, however expensive it is", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Zielinska \"Ela Z\""}, {"rating": 5.0, "review": "just like described", "verified": true, "helpfulness": "0/0", "author": "Gustavo Gomez"}]