[{"rating": 5.0, "review": "Apple sells its self. I love the Apple TV because you can do so many things on it. We have been catching up on walking dead. We've also watched movies, listened to music and much more! Not to mention the delivery was super fast. I selected two day delivery and I actually received it in two days.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 5.0, "review": "Airplay Mirroring is the most amazing feature on here. I would have gotten it simply for that reason. No more watching downloaded movies on my laptop screen with computer sound. Now my wife and I enjoy them on our big screen and not only the video is streamed but the audio too! And all on our LAN network. Amazing.We have several apple products and this just makes them all better. Now they all have connectivity with the Apple TV and we use what ever is most convenient for the remote...ipad...iphone...the standard remote...I also got rid of my xbox last year. (i'm 1 year Halo sober!) But the bad part was no more hulu and netflix on our flat screen. My wife loved those features of xbox live. No problem now! We can watch our Hulu+ and Netflix shows on the Apple TV. And even better, NO SUBSCRIPTION. Just one time $99. No $50 yearly subscription needed.As you can see I love my Apple TV. Such a great product and man what a great price. It brings so much more value to all of my mac products. You have to get one. Don't wait. Buy now.", "verified": true, "helpfulness": "1/2", "author": "Marcus"}, {"rating": 5.0, "review": "that is very nice. i can watch many movies and share music and movies to other family. I love it", "verified": true, "helpfulness": "0/1", "author": "eric"}, {"rating": 1.0, "review": "Downloading movies is constantly spotty, so much to the point that we won't use the product any more.  A very expensive $100 paperweight.", "verified": true, "helpfulness": "0/5", "author": "E. White"}, {"rating": 5.0, "review": "My classroom loves it too! It is so great and works really well with my projector. I am on the hunt for great educational apps now!!!", "verified": true, "helpfulness": "0/1", "author": "Rodney S. Asano III \"knowhowcity\""}, {"rating": 5.0, "review": "It's incredible! As I don't have a smart tv, with this appliance I can have access to a lot of movies, videos, series and documentals in Hd.", "verified": true, "helpfulness": "0/1", "author": "Patricia Aguirre"}, {"rating": 5.0, "review": "Lots of flexibility viewing video and photos in HD. Easy to set up. Must have IPad2 or higher for video.", "verified": true, "helpfulness": "0/1", "author": "Stephen G. Powell"}, {"rating": 5.0, "review": "My son wanted to connect his iPad to our 52\" TV, so my wife bought him a cable for $50! We returned the cable and payed an extra $50 for this wonderful device.", "verified": true, "helpfulness": "1/2", "author": "Sherif Ahmed"}, {"rating": 5.0, "review": "This Apple TV works exactly as advertised. Took a little getting used to commands and prccedures but it works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Gordon Ross"}, {"rating": 3.0, "review": "I have both the Roku and the Apple TV.  I use the Roku 95% of the time.  I mostly use my Apple TV to stream music from my macbook pro and that's about it.  The Roku let's me watch all the netflix content, hbo go, etc.  It will also do the slideshow like the apple tv does.  I can also buy rentals through Amazon.com vs the Apple TV.  Amazon prices seem a bit lower too.", "verified": true, "helpfulness": "7/8", "author": "Jon Flaherty"}]