[{"rating": 5.0, "review": "Love it need I say more", "verified": false, "helpfulness": "0/0", "author": "GaryBe"}, {"rating": 5.0, "review": "Had to update it when I got it but it works awesome!!", "verified": false, "helpfulness": "0/0", "author": "A. Luster \"A.Luster\""}, {"rating": 5.0, "review": "I use it all the time.", "verified": true, "helpfulness": "0/0", "author": "leslie13"}, {"rating": 5.0, "review": "We have 5 AppleTV's installed throughout our house. They let us use every TV as a second monitor for our MacBook, easily play our media, or even just use the attached sound system as a stereo. Each AppleTV is connected to the sound system attached to the TV via the optical cable. This is a nice addition by Apple because we don't need to turn the TV on to play sound, a very nice feature.Apple has been adding functionality lately, including live TV from many sources (fox, abc, espn, and others all the time). With airplay, you can easily output almost any screen or content from any Apple device including iPhone, iPad, and any Mac computer.They are more and more integrating allWith multiple AppleTV's and multiple Airport Expresses, we can wirelessly play music to every single room in the house. If you already have iPhones, iPads, and Apple Computers, then you really should have an AppleTV on every TV in the house to let you totally free your media.If you don't have apple products, you will find the AppleTV will be of limited benefit over the competing products (Roku, Chromecast, or Amazon's Fire TV). However, if you have Apple products, there really are very few reasons you should consider one of those over the AppleTV. The AppleTV \"just works\" with your apple products in a  way no other device can. If you do not have Apple Products, I would probably recommend you go with Amazon's Fire TV instead.", "verified": true, "helpfulness": "0/0", "author": "Jacob & Kiki Hantla"}, {"rating": 5.0, "review": "I have two if these in my house. They work great. We are not into the apps. We mostly use these for sinking our apple products (iPads, iPhones, and air) to the tv. It is a really cool product and allows my hose to be 100% apple integrated.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 1.0, "review": "In our TV room the Apple TV always disconnects from our home wifi network.  On the other hand, when I bring my laptop to connect to the TV - is does connect.  The strength of the Apple TV wifi receiver seems weak.  My mother also found it to be very weak - and they had to move the Apple TV device right next to the wifi router.Then, each time it disconnects, I have to retype in the long wifi password every time -  ... it somehow won't remember it...This is the one Apple product I have found is lacking.  we own just about every other device and they are all great, but this one is really not good.  they need to make it better.", "verified": true, "helpfulness": "2/4", "author": "Christopher Cannon"}, {"rating": 5.0, "review": "Apple tv works great. Thanks for the HDMI cable. It is now used in a classroom for Airplay, and I appreciate you notifying me of shipment.", "verified": false, "helpfulness": "0/0", "author": "Joe R."}, {"rating": 5.0, "review": "Blah, blah, blah, yes it is an apple product and yes it is great lol. Me and the wife love this item, she has always tried to push me towards the apple products in the past. I always refused to acknowledge apple products as good, smart purchases and would never become a apple follower. I am happy to say that life is good, I love apple products and yes I am a applehead! Every time I turn this product on when the wife is not home, I am always looking at everything it offers, I just can't get enough lol. Buy it and you will love it!", "verified": true, "helpfulness": "0/0", "author": "H"}, {"rating": 5.0, "review": "Works pretty well.  Compared to PS3 it is a bit less functional for streaming video, but substantially easier to control with our harmony remote.", "verified": true, "helpfulness": "0/0", "author": "Stuart Lempert"}, {"rating": 5.0, "review": "all good, new equipment on hand, excellent packaging, delivery in record time", "verified": true, "helpfulness": "0/0", "author": "brayan_wx"}]