[{"rating": 5.0, "review": "So many things available at no extra cost. Variety galore. It was easy to install and is easy to operate. I lowered my cable package and save money all year.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good quality, it was as we expected and we can recommend it. I will buy again if we need anothe one.", "verified": true, "helpfulness": "0/0", "author": "erwin"}, {"rating": 5.0, "review": "Great product!... This is the second appletv in our household and we use both of them every day!  We love it!", "verified": true, "helpfulness": "0/0", "author": "Gianna LM"}, {"rating": 5.0, "review": "She loves it. It is convenient and you can stream and mirror your apple product to your TV through it. I have one myself.", "verified": true, "helpfulness": "0/0", "author": "Mario S."}, {"rating": 4.0, "review": "Apple TV is great for use in either home or office. You can not only do nearly everything you can do on iTunes on the Apple TV, but you can AirPlay from any Apple device. Airplay is what I most use Apple TV for. Airplay has the ability to play or view any music, video, photo and even what is on your screen wirelessly through WIFI or Ethernet to the Apple TV from your Apple device. It provides 1080p FHD HDMI output and Dolby Digital sound quality. Rather a slideshow or PowerPoint presentation for work or just music and movies as I do, it's a great product. You can also choose from a variety of apps like PBS, ABC and HBO and many more to stream on demand directly from the Apple TV!", "verified": false, "helpfulness": "0/0", "author": "Benny"}, {"rating": 4.0, "review": "This product I have had for about a year and was hoping for Jailbreak but never happened.Other than that the air play works great and the user interface is awesome the product is very strong and has never crashed on me. The product is great and very easy to rent movies.I don't like that the product is closed. Also a big problem for me was that I have a few movies and few tv shows and I cant search by the name or search by anything.Also no pandora on the product itsself", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Mayhall"}, {"rating": 5.0, "review": "This is a fantastic device to have on hand. I love using the Apple TV at my parents and finally got one for myself.", "verified": true, "helpfulness": "0/0", "author": "Kayla"}, {"rating": 4.0, "review": "Best part is you can beam anything from an apple product to your TV.  Has had to be reset a few times but works most of the time", "verified": true, "helpfulness": "0/0", "author": "R. Kahn \"Spinyrek\""}, {"rating": 5.0, "review": "if you have an apple environment, then the apple tv is what you need.. not only because of the apps, but for the mirroring and airplay functionality.this is simply a must!", "verified": true, "helpfulness": "0/0", "author": "David Calvo"}, {"rating": 2.0, "review": "This would be a great product.  If it worked consistently. and better. I have been using this product since February of this year when i decided to get rid of cable. I had high hope for it but I'm really disappointed. I love how you can use your iPad or your mac to control the device. But a lot of the time, the sound and the movement of the picture are out of sync. It does what I call \"kick back\" which means it kicks the picture off of the TV and back to the PC or iPad MANY times throughout watching a program. So that I have to \"send\" the picture or program back to the Apple TV. Sometimes, the sound does not come through at all, at which point I have to either unplug the device or reboot my computer. I had really hoped this was going to perform much better. At time I just hate it. I do also have a Google Chromecast in another room. I notice that the Chromecast works PERFECTLY with my iPad, but not so much with my Mac PC, however, at 1/3 of the price of the Apple TV, at this point, I will be using Chrome to expand to other TVs in my home. No way will I purchase another Apple TV until/unless these issues are resolved.", "verified": false, "helpfulness": "0/0", "author": "deedeeg \"deedeeg\""}]