[{"rating": 2.0, "review": "Not a bad product unless you are using it to stream anything with AirPlay to your TV.  Amazon instant video hbo go xfinfity on the go show time ect.  All these apps aren't currently supported and will not stream to the TV.  At least not with my new iPad, I've been told it works with older models, but not with my new iPad or iPhone 5.  And you can't download those apps either it comes pre loaded with Netflix and hulu and that's it", "verified": false, "helpfulness": "1/2", "author": "Michael Haley"}, {"rating": 5.0, "review": "I buy these things for every one for gifts. Everyone uses iTunes these days and this lets you easily integrate your home theater and TV. Great features also include access to things like Netflix!", "verified": true, "helpfulness": "0/0", "author": "Brandon C. Diamond \"BDiamond\""}, {"rating": 2.0, "review": "We purchased the Apple TV MD199LL/A specifically to stream a TV signal from our computers to the TV.  While it does everything else well, Netflix, Amazon, etc., it skips and freezes consistently while streaming content from any and ALL of the four Apple products we own, iPhone, iPad, MacBook AIR and our desktop iMac.  No suggested fixes from any source have been successful in resolving this issue.  We have resolved to use the Apple TV for uses other than our intended purpose...  \"TV\".  Simply not that impressed.", "verified": true, "helpfulness": "1/2", "author": "Gary"}, {"rating": 5.0, "review": "We bought this Apple TV as a gift for my in-laws.  They wanted it to stream videos from Netflix and to stream their iPad.  It works perfect for that.  It was really easy to install with step by step directions.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "love my apple tv! works best with another iDevice for streaming and that kind of thing; pandora via iphone and such.", "verified": true, "helpfulness": "0/0", "author": "Joshua Kendrick \"AlphaFox\""}, {"rating": 5.0, "review": "Great companion to other Apple products.  I love the convenience of using Airplay.  Best device I've purchased in ~3 years!", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "It is great to be able to stream all my iTunes TV, movie and music purchases to the television - from the cloud or my computer it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "MSC"}, {"rating": 5.0, "review": "Christmas Gift for myself :-)Absolutly love it.  I really enjoy being able to control everything from my iPhone or Macbook ProLove the Airplay feature and NetflixGreat gift and very affordable", "verified": true, "helpfulness": "0/0", "author": "Evan"}, {"rating": 4.0, "review": "I purchased it for my son and he loves it.  He uses it on a TV that is not connected to cable.", "verified": true, "helpfulness": "0/0", "author": "C. Mills \"Book collector\""}, {"rating": 5.0, "review": "This works great.  We have an older 720p flatscreen, and we set the Apple TV to 720p and it works great.  We use it for videos from our iMac, rentals, and YouTube.  I would say it has a slightly better-than-average interface to YouTube.  It could take some pointers from the Wii YouTube interface, though.", "verified": true, "helpfulness": "0/0", "author": "N. Stocks"}]