[{"rating": 3.0, "review": "Poor streaming and caching performance otherwise ok, however most of my media is purchased on amazon so not used much as pushing from android to other compatible devices.", "verified": false, "helpfulness": "0/0", "author": "bhipinne"}, {"rating": 2.0, "review": "I bought an Apple TV a while back, and I like the video quality, the connectivity, and ease of setup...But I really do not like the very limited content on the Apple TV!Apple's business model seems to be that they just want to facilitate sales via iTunes,rather than provide a broad access to different content providers.Because of the lack of diversity of channels on the Apple TV, I switched to a Roku2,and then most recently to a Roku3!I have not touched or plugged in my Apple TV in a while, and should really sell it.I LOVE my Roku3, and can only recommend getting one -- forget the limited-content Apple TV.", "verified": false, "helpfulness": "0/1", "author": "T.S."}, {"rating": 5.0, "review": "Great new way to watch TV! It gives me programs that are exactly what I want, when i want it.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Schuch"}, {"rating": 5.0, "review": "It's made by Apple so of course it's simple. The interface is very responsive, unlike many internet TVs and blu-ray players I've used. You can scroll quickly and accurately. Being able to play my iTunes movies on my TV is awesome. I now have an actually good reason to rent and buy movies on through Apple.Because it's a direct competitor, Amazon Prime is not available, but that's not the end of the world.", "verified": true, "helpfulness": "0/1", "author": "Shifty"}, {"rating": 3.0, "review": "This is cool if you have other iOS devices, if you don't own any other apple products, I'd suggest looking into a Roku box instead", "verified": true, "helpfulness": "3/3", "author": "M-Bones"}, {"rating": 5.0, "review": "Easy to use, breeze to set up and navigation is idiot  proof. Delivers as it is supposed to when used.", "verified": true, "helpfulness": "0/0", "author": "RH \"RH\""}, {"rating": 5.0, "review": "First my profile is home with 2 teenagers so the youtube features are  a big hit.  We now look here for \"on demand\" movies as the kids get itunes gift cards all the time.  I was not sure about real-time streaming but this is flawless and sending music and video from the iphone and other devices are simple.  All you have to do is share your library in itunes ( PC of Mac) and you can display it on your TV in HD.Next I need better audio on the TV to replace the stereo!", "verified": true, "helpfulness": "0/0", "author": "Dave in Ashland"}, {"rating": 5.0, "review": "Slowly becoming an Apple fan.  The UI is typically intuitive.  Syncs up quickly to AirPlay, multiple devices.  Considering dropping my satellite provider.", "verified": true, "helpfulness": "1/1", "author": "R. Borkman \"consumer\""}, {"rating": 5.0, "review": "We love the Apple TV (newest version).  It has added more to our entertainment experience.  The setup took me less than 5 minutes (with an existing WiFi network and iTunes account with Share enabled).  We are considering dropping our Cable TV, keeping Cable Internet and using just the features of Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mark Miller"}, {"rating": 5.0, "review": "Opened up a new world of entertainment for us. Saw 4 years of \"Breaking Bad\" in 10 Days. Canceled all our premium channels.Make sure you have an available HDMI outlet on your TV.", "verified": true, "helpfulness": "0/0", "author": "Festus \"cooking skydiver\""}]