[{"rating": 5.0, "review": "I love the apple TV, i actually bought two of those one for the living room one for the bedroom. they work great and i mostly watch tv shows and movies on it. i'll sometimes stream from my mac as well. overall great product.", "verified": true, "helpfulness": "0/0", "author": "Vincent Gabriel"}, {"rating": 1.0, "review": "I guess if you want to figure out how to use something called airplay and use your computer to control your tv (instead of just a remote) then somehow it's possible.  But I didn't buy this device to go to a lot of trouble to watch movies.  So... no Amazon channel, on the other hand I don't know how to access my iTunes library with Roku.  So... what a pain.", "verified": true, "helpfulness": "1/10", "author": "Reginald H. Henderson"}, {"rating": 4.0, "review": "Apple always make the best products, don't they? I love the Apple TV because it is very smooth and fast. I use a device called Boxee to view my own files on my projector, and compared to the Apple TV, it is too slow and laggy. I love the Airplay on the Apple TV. The only thing that separates the Apple TV from perfection is its inability to stream local files. Sure you can stream your iTunes collection, but what about my Avi's and MKV's?", "verified": true, "helpfulness": "0/1", "author": "Naif"}, {"rating": 1.0, "review": "The only reason I got this was so I could stream movies from my computer to my television. This does a terrible job of this, the video is broken and laggy. I have 10 other devices I can watch netflix from so this helps me in no way.", "verified": true, "helpfulness": "0/7", "author": "Chris Berg"}, {"rating": 5.0, "review": "It's a great buy, I'm very happy about it. I'm thinking buying another one for my other TV. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Michael H Pan"}, {"rating": 5.0, "review": "This was my third AppleTV, and it keeps getting better, all for 99 bucks. My home is an Apple world, and the AppleTV ties it all together seamlessly into my living room, and now in any other room since I have two others. I love being able to play my music, movies, Pandora, the new iTunes Radio, Netflix, YouTube, etc. all right on my home theater system and control it all from my iPhone or iPad. The ability to browse something on my iPhone or iPad and quickly throw it up to my home theater via AirPlay is just awesome.  My only beef is the lack of analog audio outputs that I had on my First Generation AppleTV. Almost all Zone 2 outputs on home theater receivers require analog instead of digital, so I find myself unable to play iTunes or Pandora through the AppleTV to my outdoor speakers. Other than that, I love this device. It sets up quickly and just plain works great.", "verified": true, "helpfulness": "0/0", "author": "M. Goyette"}, {"rating": 5.0, "review": "Way better than \"Roku\"... and Apple updates it often adding new apps, most of them have been free to use... like iTunes Radio, Smithsonian ch. Weather ch plus you can play movies or music on your computer using wi-fi from a free acct w/ iTunes... if you have an iPhone or iPod even better, you can play games from your phone on the tv screen display pictures.. easy easy easy set up - small 3 button remote and easy navigation. Worth every penny.", "verified": true, "helpfulness": "1/2", "author": "James Detore"}, {"rating": 5.0, "review": "I bought this to use with my flat screen television, to watch Netflix primarily. And to mirror my iPad on a larger monitor. It works fine for both. It was quite easy to set up, and using the remote is pretty intuitive. I didn't need any directions.", "verified": true, "helpfulness": "2/2", "author": "smwknits"}, {"rating": 5.0, "review": "Awesome product. Streams a lot faster than mi wifi tv. Highly recommend to anyone that is looking for entertainment. Yes!", "verified": true, "helpfulness": "1/1", "author": "Jonathan G."}, {"rating": 3.0, "review": "Like so many of Apple's products, this seems to come with many maddening singularities.  It required weeks of tinkering to get sound from Netflix, for example.  I still haven't figure out if or how I can watch videos on my computer without first loading them into iTunes, and, of course, my Kindle videos seem to be out of bounds as well.  I am not a \"tekkie,\" so maybe these betray my own incompetence, but...you know what...I don't like buying hassles, which on balance this is.  I see some but not much net gain.", "verified": true, "helpfulness": "0/0", "author": "Tom Diaz"}]