[{"rating": 5.0, "review": "We have slowly walked over to the Mac side of the world over time simply because their products work and work well.  When this is coupled with the airplay any current mac device instantly has the ability to have what ever TV this is attached to as a monitor.  We've streamed movies from the laptop through this with fully acceptable results.", "verified": true, "helpfulness": "0/0", "author": "D. Campbell \"darwin346\""}, {"rating": 4.0, "review": "Apple TV doesn't disappoint. It is a quality, well conceived product with a clean logical interface as is the case with all of Apples products. It allows easy streaming of music and video directly from your computer, iPhone, iPad via AirPlay. Additionally, it provides complete access to iTunes. My only knock would be that I feel it should offer a few more channels.", "verified": true, "helpfulness": "0/0", "author": "Dadhertz"}, {"rating": 5.0, "review": "ROKU LT vs APPLETV:The Good:AppleTV wins hands down on style.  The little box is about the same size as a ROKU LT, and a little heavier.  The on screen graphics are also laid out like ever other Apple product, clean, easy to understand.Roku on the other hand is much faster, have a bizillion types of content (even \"hidden addable stations\") that you can add later.  The UI is clumsy, sure - but so what when you have that kind of content made available to you for free!The Bad:AppleTV only allows a hookup with a optical interface or HDMI.  This would prove sorta tedious if your TV only has 1 HDMI port.  On ROKU you have a choice, HDMI or old school RCA (red, yellow, white) plugs.  AppleTV also seriously lacks any way to acccess any really cool information (apps)AppleTV:  NetFlix (paid) HuluPlus (paid) MLB.com (paid) NBA (paid) NHL (paid) Trailers (free) YouTube (free) Vimeo (free) Podcasts (free) Radio (free) PhotoStream (free) Flickr (free) WSJ Live (haven't checked this out yet)ROKU:  The world, literally!  You can add \"unpublished\" channels as easy as 1-2-3!The UGLY:AppleTV is slow!  I have it hooked up via HDMI and it buffers like crazy!  You can't listen to your iTunes music unless you pay $24.99 a year to mirror the music!  ROKU has a cool app called PLEX which will let you play all your iTunes music and Videos and other YouTube videos that you can \"PlexIt\" with the click of a button on your information bar!!  NO AMAZON PRIME?  WTF?ROKU requires a credit card for setup. It's also lightening fast compared to it's elder brother AppleTV.So, right now it's a toss-up with Roke edging out AppleTV to be my favorite, but I'll edit this review when I find out more.", "verified": true, "helpfulness": "2/3", "author": "Book Reader \"Book Reader\""}, {"rating": 5.0, "review": "I had several of the original hard drive equipped Apple TVs.  I still miss some of the features of having local storage but the new version has won me over.  I now have four of the new Apple TVs in my home and with each upgrade I love them more.  I have a dedicated home theater and the picture quality on my 123\" screen is near Vudu HDX quality.  If Apple can get the HD audio codecs to stream there will be no reason to buy another Blu-ray.", "verified": true, "helpfulness": "0/0", "author": "David Golombowski \"dgolombowski\""}, {"rating": 5.0, "review": "There is always room for improvement with application offerings, but the hardware works flawlessly and it gets better with every OS upgrade.", "verified": true, "helpfulness": "0/0", "author": "Joe Wiedenmeier"}, {"rating": 5.0, "review": "We received this as a Christmas gift and totally love it! Set-up was fast & simple, including the network connection to our home wi-fi. I love the AirPlay feature which lets us stream to our HDTV from our iPads. I like being able to stream photos and music for a screen saver; it's fun having a rotating slide show of our family, friends and favorite pics.  We have also used it to rent an HD movie from iTunes and the download time and play quality were excellent. We don't have a Netfix or HuluPlus account, so have not tried those options. However, we also have a networked Sony BluRay DVD player we use to watch TV programs and movies on Amazon Prime and find them similar in quality and pricing. The advantage of AmazonPrime is the free content, i.e., Downton Abbey seasons 1 & 2 are free on Amazon Prime, but you have to purchase them on AppleTV. We also have Comcast Xfinity and get free programming that we would have to pay for on the AppleTV, i.e., Homeland TV series.  I think AppleTV would be a better product if it included AmazonPrime, but I'm happy with it. I just wish we could combine all these products into one box so we'd have fewer remotes to keep track of!", "verified": false, "helpfulness": "2/3", "author": "Debra \"Deb\""}, {"rating": 5.0, "review": "I can't believe how small this is!!  It's real quick and very nice!!!  I'm going to replace all of our t.v. boxes with this little guy.", "verified": true, "helpfulness": "0/0", "author": "J. Hotrum \"anotherjen\""}, {"rating": 4.0, "review": "This TV was easy to set up and coordinate with my itunes account. It has many capabilities and is easy to use. It is fun to use photos as a screen saver while listening to playlists and other music. Videos from You Tube can be viewed on the TV screen, as well as Hulu Plus and Netflix streaming.The only reason I am not giving it five stars is because it seems to not hold my connection to my iphone 4S. I am able to connect my phone and complete a mirror image, but I then lose the connection. This may be due to the firewall on the WiFi, or may be due to using a slightly older phone? I will continue to explore this issue and update if a solution is found. Since I have many capabilities of viewing videos, I am not sure I will miss this feature. But, it would be an important feature for someone who planned to watch movies via the mirror image of the phone.", "verified": false, "helpfulness": "0/0", "author": "D. Rotoloni \"shopper\""}, {"rating": 2.0, "review": "I have an older Roku at home and bought an apple tv as I expected the same functionality as the old Roku along with the ability to control it with my iPad and iPhone. I was shocked although it will play Netflicks Apple has chosen not  not support Amazon instant video which is my personal favorite. I am not sure if they have excluded others but I immediately sent it back when I learned that. What was really frustrating was that the only was I learned this was by setting it up. I found nothing in the on line product specs or on the packaging that shared this lack of comparability . The documentation says it plays your favorites.", "verified": true, "helpfulness": "10/14", "author": "Joe Ski"}, {"rating": 5.0, "review": "This device is a little larger than a hockey puck, yet it does so much more. Altough I do suppose you could play hockey with it. Wouldn't be the wisest thing to do, and probably doesn't meet hockey regulations. So, to those of you who relegate to using the Apple TV for media viewing here is my review.It's only connection is via HDMI. I tried a HDMI to DVI connector for an old TV and it didn't work. Apple TV has worked on all newer TVs i've tried using HDMI.You get Hulu, Netflix, and a few others. Sorry no Amazon Video with it... yet (hey Amazon take a hint - we want u on Apple tv).The Apple TV is very reliable, requiring almost no reboots. System errors are so rare that I've yet to encounter one. Software updates are occasional (quartely'ish) and do take about 15 minutes to fully apply.", "verified": true, "helpfulness": "0/1", "author": "PH"}]