[{"rating": 5.0, "review": "I bought this as a Christmas gift for my brother and his family who all utilize Apple products and the really like like it a lot and one for my son who loves it.  He can purchase all his favorite shows by episode or season.  The only thing that would make it better would be if it had more free programming.", "verified": true, "helpfulness": "0/0", "author": "Yvette D. Pannell"}, {"rating": 5.0, "review": "This is one of the better tech purchases I made this year. I can mirror from my iPhone or iPad mini, stream Netflix and Hulu plus or listen to music from iTunes. With the airparrot app I can mirror my PC which is great for streaming. I highly recommend the Apple TV", "verified": true, "helpfulness": "1/1", "author": "msquire"}, {"rating": 5.0, "review": "Absolutly love Apple TV, so much that I decided to get one for another TV in the house.  Lowered my Cable bill and now use itunes, and netflix to stream TV and Movies.  You can also \"mirror\" the iphone on your TV screen which makes searching the internet fun.", "verified": true, "helpfulness": "0/0", "author": "Scott Bruno"}, {"rating": 5.0, "review": "I was looking at purchase a nice dock like the B&W; Zeppelin Air, but then I realized I could buy another Apple TV for 1/6 the price and use it with any speakers I want.  This solution works very well for me as I can take my small powered speakers and the apple TV anywhere in my wifi network and I have air play speakers.", "verified": true, "helpfulness": "0/0", "author": "J. Hamer"}, {"rating": 2.0, "review": "First off, I do like the look and interface to the Apple TV.  I really wanted to like this product.  However, having lived with it for more than a week, I find the Roku to be a much better alternative.  If you are already into the Apple Eco-system, then hands down this is the product for you.  Air Play was cool too.  However, I was looking for free content and new Roku has a similar function as AirPlay.  Not much freebies on Apple TV except Podcast.  The content on Podcast was spotty at best.  If it's more up-to-date, it might have been OK.  Another complain is that the unit would freeze up after a few program searches.  I had to reboot the unit every time I use it.  As a result, loosing all my user profiles and log in info, including re-entering wifi info.  I could not recommend this product based on my experience.  Bottom line:Pro - If you already subscribe to the whole Apple Eco-system, you already have you content there.  AirPlay.Con - Not a lot of free content, unit freezes up.", "verified": true, "helpfulness": "0/1", "author": "Tech Man \"eTechReviewer\""}, {"rating": 5.0, "review": "I really want to know why everyone does not have this device in their house! There are probably a lot of reasons with the #1 being that they don't know how to use their Apple devices. So sad because Apple TV just makes everything better - we can show videos, pictures, and literally everything to everyone on the TV using our Apple devices or play music through the in-home speakers from my computer or phone or iPad with Apple TV.  Amazing... Nuff said!Way to go Apple. Thanks for continuing to make products that fit into my life and my interests.", "verified": true, "helpfulness": "0/0", "author": "A. Allen"}, {"rating": 5.0, "review": "This is a great product, however you can get a Roku for a lot cheaper.  The reason that you would get this over a Roku is if you have another apple product such as an iPad, iPhone or Mac computer.  If you have one of these items then the Apple TV is a bit bitter because you can share things through airplay.  This is really convenient and works really well.  Basically, whatever you are seeing on any of those devices you can share with the TV which is a nice feature.  The accessibility to Netflix as well as Wall Street Journal is really nice too.", "verified": true, "helpfulness": "0/0", "author": "pat"}, {"rating": 5.0, "review": "Love it! Surprised by the amount of content available. The only downside is that some of you have to pay for, but $8/month for Hulu+ is a tremendous bargain especially considering that ALL of the 5 Star Trek series are there.", "verified": true, "helpfulness": "0/0", "author": "Galen A Grimes"}, {"rating": 4.0, "review": "I bought this primarily for my theater room which has a projector and surround sound.  The rest of the streaming devices I have are all 780p, so streaming Neflix at 1080p and projecting it on to a wall makes it look like you almost blu-ray quality.  I  also 'airplay' music from my PC where I have 100s of songs stored to this device and then to my Pioneer receiver.Now the complaints...con #1: In terms of content, it is rather limited. I have an account with Amazon Prime and would love to watch the free streaming movies available online, but unfortunately it is something I cannot do with ATV3.con #2:  I have on the unit is that it's remote is flimsy and Apple really needs to review the design of it. Quite often, in a dark room, it is hard to locate the buttons on the Popsicle stick like remote. I wish the buttons were not so sensitive or the remote had some low led light although I agree this would consume battery life out.con #3: This is a common complaint, apple needs to figure out the keyboard.  Searching for a movie using the ATV3 can be quite frustrating at times using the onscreen keyboard. I have a 10 year old no name digital recorder and it has the same keyboard, so it is not something i was expecting from one of world's leader in innovation.", "verified": true, "helpfulness": "0/0", "author": "Travelling Nomad"}, {"rating": 4.0, "review": "I like Apple TV and being able to stream Netflix movies and YouTube videos to my living room television.  I haven't quite figured out the iPad sharing version yet but I will.  I don't really use the iTunes movies because of the cost on each movie but I do enjoy my Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Linda K. Morefield"}]