[{"rating": 5.0, "review": "Meets all expectations , easy to set up and easy to use. The price was right and was delivered quickly. Couldn't be happier with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Edgar E. Allen"}, {"rating": 5.0, "review": "Apple TV lets us watch movies tv use Netflix, watch videos from phone and show pictures! Easy and convenient!!  The kids use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Movietvfan"}, {"rating": 1.0, "review": "I just got it and set it up.  nearly useless. I expect to have a browser to watch news.  thinking to return it.", "verified": true, "helpfulness": "1/18", "author": "Aijun Wang"}, {"rating": 5.0, "review": "My iTunes content streams in Full-HD, Netflix interface is extremely responsive as is the Hulu +. AirPlay is convenient for streaming your own local content on iDevices. Super fast connectivity with wireless n and connect through ethernet for an even better experience. It's a extremely stylish(sexy) piece of hardware as is the apple remote. I don't see a need for other applications offered by likes of roku because of AirPlay! Also content on iTunes well I've found everything I've ever wanted on that store! Because it's an apple product it works great of course.using airplay limits viewing but can be fixed by using zoom option on TV! I enjoy the benefits of NBA app as well. I'm so buying more for my other tv's. hope this helps.", "verified": true, "helpfulness": "1/1", "author": "Bartolo Vargas"}, {"rating": 3.0, "review": "Haven't used it yet but am looking forward to streaming from the Mac directly to my TV.  Will eventually get time to use it.", "verified": true, "helpfulness": "0/10", "author": "Gregory A. Buss"}, {"rating": 5.0, "review": "I don't like Apple products in general because I hate the simplicity in design and likes more control. However, Apple TV is the exception here since it does its only job very well: watch TV. Of course, searching youtube for a particular video can be pain when you need to type something using the awful control pad to search each character at a time.If you are Chinese or like to watch Chinese programming, Apple TV provides great access to a large libraries of Chinese programming for free.", "verified": true, "helpfulness": "1/1", "author": "T. Zhao"}, {"rating": 5.0, "review": "We have the Roku and now the Apple TV. The Apple has a better looking user interface and movies are easily made able to go fast forward or reverse, something the Roku has trouble doing. If you have streaming Amazon Prime then you need a Roku if not the Apple TV is a better choice. This unit can stream YouTube videos something the Roku doesn't and I choose to start my online \"in the cloud\" movie collection on iTunes rather than Amazon. For a hundred dollars, hard to beat the entertainment value.", "verified": true, "helpfulness": "0/0", "author": "Eric Brady"}, {"rating": 5.0, "review": "We previously owned the prior iteration of Apple TV circa 2011.  It was slick but had a very limited range and was effectively useless in our wireless setup. We switched to a dual band ROKU 2 XS and had improved results.  The ROKU was not that reliable, however.  It frequently dropped signal and most of the time played back in a format well below HD.  The device does not tell you the bandwidth directly but provides a range of one to four dots with all four being HD.  We almost never never got four dots. Most of the time we got three dots, sometimes 2 or even 1.  Still, it worked.We bought the new Apple not expecting any improvement in signal or resolution but merely to watch shows on HBO GO.  It turns out that the suits at ROKU, DirecTV (our service provider), and HBO could not agree terms to stream HBO GO.  So, we were able to watch HBO GO on ipods and pads and computers but we could not watch it over the ROKU on our TV (figuring this out by the way took forever; its a fact that all of the parties involved seem to want to keep well hidden).  Needless to say this was frustrating since we were paying for the service through the HBO subscription.Anyway, the new Apple TV was an unexpected delight in every way. The signal streams in HD almost all of the time.  It is fast, way faster than the ROKU, and you can rewind and pause without dropping the stream - a common event with the ROKU.  It is simply a much more powerful device than the ROKU. Build quality is typical Apple but at the high end of what they do.  It is a solid, heavy and robust feeling piece of gear.  Compared to the Apple the ROKU feels light and cheap. The milled aluminium remote is a delight to use and is far nicer than ROKU's remote which is really quite nice itself.  Presentation is sleek and navigation and setup are a breeze.  The exception is accessing a computer library through the network.  It doesn't bother me because I have a dedicated stereo and have no desire to listen to music through the relatively poor Sonos speakers attached to the TV.  Others may disagree.All of this was totally unexpected.  I had anticipated range problems and was hoping that APple had stepped up and fixed the issue.  They had.  I am not an Apple fan generally but on this piece of kit I think they knocked it out of the park.  On a functional, aesthetic, and build quality basis I would expect this to be $300 - $400 piece of gear.  Either ROKU is reaping huge profits or Apple is taking a hit to position itself for the full blown Apple TV ecosystem rumored to be in the pipeline.  I think the latter.  For $99 this is an incredible deal.  To say that an Apple product is underpriced is even more incredible but, however strange, its true here.I have to give this five stars on all counts with the obvious caveat that it would be nice to access one's Amazon library from Apple.  A really great little piece of kit and a nice surprise.  Well done Apple.", "verified": false, "helpfulness": "1/1", "author": "pingufreddy"}, {"rating": 5.0, "review": "Easy to install, the kids love it. We can review the entire week with the family on Sunday evenings with the entire family. Everyone has an I-phone so we all get together and share pictures as a family. Havent used all the capabilities yet, we are still learning.", "verified": true, "helpfulness": "1/1", "author": "Tom D."}, {"rating": 5.0, "review": "Very awesome i absoulty love it it is the best thing i ever bought i use it every day love it", "verified": true, "helpfulness": "0/0", "author": "Dalton Hurst"}]