[{"rating": 5.0, "review": "We divested ourselves from cable and went with Apple TV.  I initially bought a Roku 3, but our home already had a plethora of Apple products so I exchanged it for the Apple TV (Apple products mesh well together).  We love the ability to buy movies before they hit Redbox.  More than anything else...watching TV À la carte is what we wanted, and Apple TV delivered", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "Love it!Really good product!My son can watch cartoons and I can work on my IPad at the same time!", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 4.0, "review": "its apple...  like a toyota camry - buy it for your kids and parents, safe and reliable, but no thrills at all.", "verified": true, "helpfulness": "0/0", "author": "JCB \"dependanSEA\""}, {"rating": 1.0, "review": "Quite simply, it does not work.  While I can get the box to connect to the internet, I can't get airplay to mirror any of our our eight iPhones or iPads, despite trying everything under the sun.", "verified": true, "helpfulness": "0/3", "author": "Dahlface"}, {"rating": 2.0, "review": "I have been Apple loyalist since the beginning, but I despair of anything iTunes, the app, the store, and trying to use the app as a file system on the iPhone, and now the Apple TV. Simple and clean to set up for iTunes and other commercial channels. So far impossible (I am not a neophyte, check the forums) to set up mirroring for my pre-2011 iMac.Again Apple has crimped the usability of one of its elegant devices in the interest of pushing their overpriced content.", "verified": true, "helpfulness": "1/3", "author": "fear of buying"}, {"rating": 3.0, "review": "might be ok", "verified": true, "helpfulness": "0/0", "author": "S. PHILLIPS \"Yobro\""}, {"rating": 5.0, "review": "hey, it's Apple. it's good. now if only they would update the specs. sigh.", "verified": true, "helpfulness": "0/0", "author": "Lazlo \"Lazlo\""}, {"rating": 5.0, "review": "I've been using this about a year now. It works flawlessly. My favorite feature is streaming content from my iPhone, iPad, or Mac to the TV. It just works. Plain and simple. Apple designs their products to be easy to use. This is no exception. Channels and features are added quite regularly. Be advised not all channels will work unless you are a paying cable or (certain) satellite customer. For instance, I can't watch shows on the ABC channel because my particular satellite provider isn't set up with them for this access. However other channels like A&E; and the History channel work fine. I like being able to pull up the radio icon and find my local stations to listen to crisp and clean since I don't get very good reception where I live.", "verified": true, "helpfulness": "1/1", "author": "Wooderson"}, {"rating": 5.0, "review": "its a apple product they work well when they want to and other times they don't . my go to is a roku but it you want airplay you stuck with this, i really wish they would bring back a analog output would save me a lot of time and money but thats never going to happen", "verified": true, "helpfulness": "0/1", "author": "Jason P. Loveless"}, {"rating": 3.0, "review": "Meh", "verified": true, "helpfulness": "0/3", "author": "Wingback43"}]