[{"rating": 5.0, "review": "An amazing device. We use it all the time to display our pictures and play music.  I travel alot and set up my router and apple tiv, hook it up to the hotel TV rather than having my girlfriend's (wife) picture on the night stand I can hundres of images of her on the TV. Also can rent great first run movies and play all of your music from your I tunes account plus there is free I Tunes radio for free music.", "verified": true, "helpfulness": "0/1", "author": "gypsyflyboy"}, {"rating": 3.0, "review": "I've only had Apple TV for a month but I'm disappointed in the limited number of movies/TV shows available on Netflix which is much much less than on my computer. I'm not sure whether is licensing issue or not but the selection is sparse.", "verified": true, "helpfulness": "0/1", "author": "Richard H."}, {"rating": 5.0, "review": "This is my second Apple TV for a separate room. I love this thing. It has allowed me to convince my wife to turn off cable.", "verified": true, "helpfulness": "0/1", "author": "Matt"}, {"rating": 5.0, "review": "Super easy to install. The method to \"learn your TV remote\" is easy and effective. Allows me to send iTunes to my home theater wirelessly and inexpensively.", "verified": true, "helpfulness": "0/1", "author": "Andy Libe"}, {"rating": 5.0, "review": "Well being a amazon member for years,barely leave review. But this apple TV is a much to place 5 star review. :)", "verified": false, "helpfulness": "0/1", "author": "Michael Shen"}, {"rating": 4.0, "review": "Wish would've waited until the price lowered to $70.00.  Excellent design and performance.  AirPlay Mirroring works intermittently.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "harbage Apple TV that worked for six months and then stopped. Go to Apple Store to get a warranty repair, find out this was a previously sold and \"refurbished\" Apple TV.No mention of this was made in the description.", "verified": true, "helpfulness": "0/1", "author": "S. H. Bottoms"}, {"rating": 5.0, "review": "I like it a lot. If you don't own any other Apple products I suggest you check out Amazon's Fire TV, Fire TV stick, Roku and Roku Stick.", "verified": true, "helpfulness": "0/0", "author": "Brandon Ramsey"}, {"rating": 5.0, "review": "I have the 2nd gen apple TV (its worth noting I've had it for 4 years and its still good as new). As far as I know its the same as this current model but projects in 720p not 1080p. When I first got the TV it was limited but It continuously gets better in time. HBO, Netflix, Showtime, FX, Hulu, etc. No it doesn't have Amazon but this is where the best part of the Apple TV comes in- airplay. Basically any content(music/video) you can play on your iphone/macbook(newer models)/ipad can be streamed to the TV with one click of a button. You can then lock your phone or continue to use it. This is the best quality. There are some shows I don't have access to for various reason but all I have to do is find it online somewhere (yes even from \"sketchy\" websites) and then stream it. If you have apple devices I would definitely recommend this over the others.", "verified": false, "helpfulness": "0/0", "author": "Megan R."}, {"rating": 4.0, "review": "It is very cool! I got it for myself and it works very good! The only thing is that it didn't come with a HDMI cable, and that is what you need to make it work... But other than that it is so worth the money!", "verified": false, "helpfulness": "0/1", "author": "Slim"}]