[{"rating": 5.0, "review": "Came brand new in the box and untouched. Worked perfectly and was a great alternative to paying a high monthly cable bill. Very Satisfied!", "verified": true, "helpfulness": "0/0", "author": "Alex Quinones"}, {"rating": 5.0, "review": "Super easy to setup and comes with remote! Easy to use with iPhone or iPad, too.", "verified": true, "helpfulness": "0/0", "author": "sandie shute"}, {"rating": 5.0, "review": "Easy to set up and perfect size doesn't take too much space", "verified": true, "helpfulness": "0/0", "author": "Miliam J Valdes"}, {"rating": 2.0, "review": "Not sure what the problem is but I have to keep restarting it to get it to work.  Having alot of trouble with it.", "verified": false, "helpfulness": "0/0", "author": "Nancy Wood"}, {"rating": 1.0, "review": "This is a terrible streaming box and I will tell you why. Its not the box itself, it is the fact they force you to use ITUNES to rent or buy movies. Now when you use ITunes. they do not stream the movie immediately. They download the movie to you and it can take hours!!!! Roku and amazon fire gives you the movies immediately. I thought my apple box was bad so I stupidly bought another one. Same thing. ITunes movies take forever to download. Im surprised Apple wont include Amazon.....Id recommend a Roku or amazon Fire box. Who wants to wait hours to watch a movie after paying for it. Same on you Apple and ITunes!!!! you would think Apple would realize ITunes is costing them business....", "verified": true, "helpfulness": "0/0", "author": "Scott Solomon"}, {"rating": 5.0, "review": "Works great and easy to setup and use.  Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "I love using AirPlay with my wife's Mac and my iPad. However, I recommend connecting the Apple TV via an Ethernet cable directly to your router. I spoke to an Apple support specialist and he explained that the device you use uses twice the wifi - once to stream what you want to watch and the other to send it to the Apple TV. I've had the sound drop and playback stop, but since I connected with Ethernet, it's been a lot better.", "verified": false, "helpfulness": "0/0", "author": "AJ Cabrera"}, {"rating": 5.0, "review": "Don't need cable, don't need a dish, just give me my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Brandon A."}, {"rating": 3.0, "review": "Love the apple tv, but I hate that when I got mine it was clearly refurbished. I had to sign out of someone else's account on 3 different apps! Totally disappointed in the seller on this one", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "Didn't use, but own another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]