[{"rating": 5.0, "review": "Do I need to write anymore?", "verified": true, "helpfulness": "0/1", "author": "gwynspekes \"gwynspekes\""}, {"rating": 5.0, "review": "As described and fast shipping.", "verified": true, "helpfulness": "0/1", "author": "Thomas Ollukaran Inasu"}, {"rating": 5.0, "review": "It's awesome compared to google chromecast.", "verified": true, "helpfulness": "0/1", "author": "Amazonian"}, {"rating": 2.0, "review": "I love Apple and own most of there products, I bought the Apple TV with the intention to use AirPlay to stream my MacBook pro retina to my tv.  The performance is terrible with an unbearable lag.  I would not recommend this product if you want to use AirPlay from a retina MacBook.  Apart from that everything else worked great, such as playing media from iTunes, and streaming pictures from my photo stream", "verified": true, "helpfulness": "0/2", "author": "Kuditec \"Kuditec\""}, {"rating": 5.0, "review": "Exactly as advertised!", "verified": true, "helpfulness": "0/1", "author": "Anthony Campbell"}, {"rating": 5.0, "review": "worked good", "verified": true, "helpfulness": "0/0", "author": "Dura"}, {"rating": 5.0, "review": "This is not my only video-streaming device: I use a Sony PS3 (not the later PS4) for the best possible image quality. The more recent PS4 is less versatile, because of DRM problems. I also have a Fire TV, and I think that it beats *this* Apple TV on video quality. Neither box competes with the venerable PS3.Still, I use the Apple TV for three applications.The first, of course, is to stream iTunes content.The second is to use AirPlay from my iPad Air 2, iPad mini 2 and MacBook Pro retina (late 2013.) (I am an Apple fan, so sue me!)The third application might be of interest only to Comcast (Xfinity) Internet customers.Xfinity offers an \"Internet Plus\" plan that includes a 25 Mbps Internet connection plus a very basic cable service for about $70/month plus tax. This plan does not include HD cable service, but it does include HBO and HBO Go. HBO Go allows you to watch HBO shows in HD on computers and streaming devices. With the Xfinity cable service, however, HBO Go cannot be activated on most streaming devices. For instance, my beloved PS3 does have an HBO-Go App, but it cannot be activated using my Xfinity plan.For some reason, however, you *can* activate HBO Go on an Apple TV, using your Xfinity account. So, thanks to my new Apple TV, I have been able to watch several seasons of \"Game of Thrones\" in HD. Even the fourth season, that is not yet available on Blu-Ray or digital download (as of Dec. 2014,) is available in HD on HBO Go.For me, the cost of the Apple TV is fully justified by its ability to stream all the seasons of GoT in HD, in conjunction with the affordable \"Internet Plus\" Xfinity plan.In conclusion, for watching Amazon content (I am a Prime subscriber,) Netflix or Hulu Plus, you are better off using an Amazon Fire TV - if you don't have the still-amazing PS3. For HBO Go, the Apple TV is the best solution, especially if you are a Comcast (Xfinity) subscriber.", "verified": true, "helpfulness": "1/1", "author": "Filippo Neri"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Dylan Leas"}, {"rating": 5.0, "review": "Best box on the market for your TV as a solution for connecting to the various VOD services online as well as your iTunes library and as with everything else made by Apple, it seamlessly fits in with their entire ecosystem and \"just works\".  Thank god for Apple setting the bar high with every product they sell.  Everything was tested in this box before it was put on sale and it seems to have outlasted the other similar products on the market.  This box has the highest build quality of all the boxes I mention below.  The remote is aluminum and the box has heft to it.To give an idea of my experience with these boxes, I have the top three you are most likely considering and I would not hesitate to recommend the Apple TV over the other two at this point.  I also have had to edit this review because Amazon has stuck with the Fire TV and has fixed the problems I had while dropping the price in the process, they have to be commended for that.  I still have some reservations recommending the Fire TV to anyone wanting to use it with Amazon's Prime Video, the other players also allow this feature and it doesn't differentiate the box over the other options.  But since they have the important premium services on the box like Netflix (which now works) and Hulu Plus as well as a wide array of other Android based apps, it should be a device to consider.I had the fortune to be introduced to the Roku when it was still in its Alpha stage, so it does have a little place in my heart.  I have been though numerous generations of this ever tinier box and currently have the Roku XS and if you are lucky you can acquire it for under $50 refurbished on Amazon (this was the finest Roku before the Roku 3)  It has both wired and wireless internet capacity, I use the wired connection and when I do so with my 100/100 Mb/s connection I haven't had an issue with it other than its random decisions to reboot while watching things on Hulu Plus (I can't figure out the source of these little quirks).  This is rare and the reboot time isn't bad.  However, this box was designed as if the wireless capability did not matter at all and even with a very respectable corporate wireless network covering my home, the Roku has trouble maintaining a solid connection.  I hope the Hulu 3 is better on this front but this box is the worst of all three in regards to the wifi connection; video is unwatchable when I try streaming it over the Wi-Fi connection.  If you are not going to have a wired connection for your device, I suggest that you go with the Apple TV or the Amazon Fire, they have solid wireless connections able to stream HD video easily. The one feature of the Roku that can be convenient and inconvenient at the same time is the RF based remote controller.  This would not be an issue if the box also had an IR interface as well, but it does not so you have to use two remotes, regardless of the universal remote you have.  I have the harmony color full touchscreen remote which has an RF transceiver and it doesn't even work with that.  However if you don't mind the extra remote, it is well built and you don't have to worry about line of sight.In summary, I would prefer the Apple TV as it seems to have the upper hand in build quality with the Amazon Fire coming close with its recent updates. Now that Amazon has reduced the price of the Fire TV it is directly on par with the Apple TV, but if you already have Apple products the synergies between the products make it compelling for the Apple TV.  In the end, the Roku might just be a little too confusing for some users with its hidden private channels while the Apple TV will not confuse a soul while having benefits that only Apple can provide.", "verified": true, "helpfulness": "1/2", "author": "Jason S."}, {"rating": 5.0, "review": "Bought for my parents for Christmas. They are in love and it's perfect match with all their other apple products. Better then Roku and Amazon fire TV", "verified": true, "helpfulness": "0/0", "author": "Chris Jr"}]