[{"rating": 5.0, "review": "I have cancelled my Dish Network service and am completely reliant on internet streaming services. My Apple TV is an amazing product, and integrates perfectly with our other Apple products - iPhone, iPad Mini, etc. I recommend it to everyone who asks me about it, or about streaming services.", "verified": true, "helpfulness": "0/0", "author": "Jason Cloninger"}, {"rating": 1.0, "review": "Quite possibly the worst apple product ever. I am convinced that his is made and developed by an outsourced vendor for apple. It is old technology when you look at connectivity. It's definitely not \"plug  and play\". I even made a bet with a friend that we'd be watching movies and streaming within 10 minutes of opening the box. He bet an hour. After 90 minutes, I gave up and packed the device and returned it to amazon. He won.Very disappointing. FYI, I bought the google chromecast for $35 as a throwaway to test. While it is not as good using an iPhone/ipad for interface, it's way better that Apple TV. If you have an android device, it's amazing. Apple needs to learn from google on this one. Too bad!", "verified": true, "helpfulness": "1/8", "author": "KAT"}, {"rating": 5.0, "review": "Great media consumption device. Great for what I use most. HBO go and Netflix. Have had no problems with this device. Picture quality for streaming is great.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Eatmon"}, {"rating": 5.0, "review": "This thing is awesome. If you use other apple products, and have a television, it is a must have.Like all apple products, everything 'just works'. Check out built in VEVO for background music videos for your next party. Entertain yourself with selections from Vimeo and YouTube, watch your favorite flicks with Hulu or Netflicks.Looking at a cool picture on your iPhone? Throw it up on the big screen for everybody to see.The onscreen menus and display is eons ahead of the other products on the market.This is by far the best $100 I've spent on multimedia. Ever.", "verified": true, "helpfulness": "0/0", "author": "Faldo"}, {"rating": 5.0, "review": "Bought this for my sister last Christmas.  She loves it and uses it regularly.  Install was simple.  The device and remote, of course being an Apple product, has a sleek and simple design to it that makes it blend in and easily hidden from sight.  However, I would have probably bought her the Chromecast had it been available when I was looking at this.", "verified": true, "helpfulness": "0/0", "author": "Nina \"bambi86\""}, {"rating": 4.0, "review": "Works well and does what we need it to do, but the interface is not as user-friendly as what we were accustomed to with the Logitech Revue we had previously.", "verified": true, "helpfulness": "0/0", "author": "Andrew Nichols"}, {"rating": 5.0, "review": "Great. Nothing need to be said about. It's apple and works well. Netflix, Itunes Music and so on. A good streaming music and video equipment.", "verified": true, "helpfulness": "0/0", "author": "Marcos Luz"}, {"rating": 5.0, "review": "Lots of free stuff to watch on Apple TV. Works with your Netflix account too. Easy set up if yo order the suggested HDMI cord! Very tiny and takes up very little room. Make sure you turn on automatic updates so it will do it during the night and not when yo wan to watch a movie!!", "verified": true, "helpfulness": "0/0", "author": "Brinda Myers"}, {"rating": 5.0, "review": "Very easy to set-up.  Small and simple to use.  Movies stream smoothly and without breaks.  Much less expensive than a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Wayne and Liz"}, {"rating": 5.0, "review": "Tried a Google Chromecast before this. It was very limited. Moved to the Apple TV because I could use AirParrot to share my screen to the Apple TV...what a difference. I could put anything I wanted on the TV then, and use it as a second big monitor while I worked. Even better, it looks like the features I used Air Parrot for are build into Maverick.", "verified": true, "helpfulness": "0/0", "author": "seedubb"}]