[{"rating": 5.0, "review": "It took considerable time to set it up to wrk.  But Apple is extremely \"user friendly\", so it was not a surprise.", "verified": true, "helpfulness": "1/2", "author": "Liz_amazon"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/1", "author": "Bill"}, {"rating": 5.0, "review": "I received my AppleTV and am very satisfied, it's great!", "verified": true, "helpfulness": "0/1", "author": "Tracey Harrison"}, {"rating": 5.0, "review": "Love this device I own 3 of them and my house was struck by lighting and needed to repurchase one and that is what I did. I use them to sent music and video from my phone to the TV all the time. From YouTube and from iTunes I can sent video for the whole family to see.Very small package and I use a good quality HDMI cable to hook to the TV.It make any TV smart.Has YouTube,HBO,HULU,Netflix  and many other apps installed and auto updates new apps as they get added.", "verified": true, "helpfulness": "0/1", "author": "tybow"}, {"rating": 4.0, "review": "Playing rented movies is multiple times as complicated as it is with Amazon Instant Video on my PlayStation 3.  I use it primarily for YouTube and news channels.  The capability to airplay my Mac and iPhone onto my 55in TV via Apple TV is AMAZING!  Very limited applications available however.", "verified": true, "helpfulness": "0/1", "author": "Goody"}, {"rating": 5.0, "review": "Excellent Product....Will purchase again.  Seller sent items really fast. I highly recommend!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Julius Moore"}, {"rating": 3.0, "review": "It's helpful but there are a lot of connection issues with multiple devices that are only solved by restarting the system after having just turned it on in the first place.", "verified": true, "helpfulness": "0/1", "author": "Victoria N.P."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "selectallok"}, {"rating": 5.0, "review": "I bought two. One for my boyfriend and one for my mother. My boyfriend had no problem setting it up, but when I tried setting my mother's Apple TV up, it appeared a setting and computer icon only. I reset it and it stayed \"activating\" for at least 20 minutes. What I did was connect the Apple TV to my iPhone's hotspot, activate the Apple TV and it worked fine. I am super happy with my purchase.", "verified": true, "helpfulness": "0/1", "author": "Ileana T. Varas-santos \"Ileana Varas\""}, {"rating": 5.0, "review": "Good image features, my cell phone and tablet PC photos and videos can be displayed on a large screen TV", "verified": true, "helpfulness": "0/1", "author": "Huangzhibin"}]