[{"rating": 5.0, "review": "Anyone who has one will tell you this is a great buy. Easy installation as well right out of the package.", "verified": true, "helpfulness": "0/0", "author": "Ham2293"}, {"rating": 5.0, "review": "This was super easy to install and use. The HDMI connection to my TV processes the audio signal through to my Receiver. I wanted to be able to listen to music without my TV being on. The Digital Optical output on this unit was available, but the input on my Receiver had already been used. I bought a C2G / Cables to Go 40019 Optical to Coaxial Digital Audio Converter that allows me to use the Apple TV for music without my TV being on. I also love the ability to use Airplay from my iPhone or iPad to view photos, videos or even Network TV programs on my TV.", "verified": true, "helpfulness": "0/0", "author": "Mister Fixit"}, {"rating": 5.0, "review": "My Chromecast is officially junk; Apple TV is spectacular! There are a lot of app options that I am unable to use due to a lack of owning cable with the corresponding channels (so stupid, this is totally the networks' fault), but my Hulu account is wonderful on this interface. Plus all of my iPad and iPhone apps magically have an AppleTV icon now, as it recognizes the device on the network. Meaning I can play anything I watch on my devices immediately on TV. If I can find a way to work around the cable subscription conundrum, I will never buy cable/satellite again with this. Just my Hulu and Amazon Prime subscription and I'm set. Amazon has so many movies I can stream for free, and so many shows, that between that and Hulu, I think I get everything I could want except for some of the TLC and Bravo shows I like. Pretty great for the price. I wish I'd bought it sooner...", "verified": true, "helpfulness": "0/0", "author": "AmazoningMyMoolaAway"}, {"rating": 3.0, "review": "By the time I got it, the person I ordered it for had found it elsewhere and bought it for himself.  So, I returned it.", "verified": true, "helpfulness": "0/4", "author": "Violet"}, {"rating": 3.0, "review": "After purchasing a Roku 3 and Apple TV at the same time, I returned the Apple TV, although, in my opinion they are almost different devices and I could see a need to have both of them. The greatest thing about Apple TV is the wireless integration with an Apple phone or Tablet. As a streaming player however, I was not as impressed. I had both devices connected to different televisions in my home, so if I had a problem with one, I would go to the other and see if the same problem existed. On several occasions, the Apple Netflix would not connect (or would show an error) while the Roku connected every-time. Almost everything on the Apple requires a \"subscription\" (incurring additional costs) while the Roku offers many free viewing selections. (The food channels for recipes and the fitness channels for home workouts are awesome). Since Roku 3 allowed me to stream pictures, music and video from my apple devices, I made the final decision to send the Apple back. But with that being said, I do want to state again that I can see where it would be nice to actually have BOTH of these machines. Just be sure of your specific needs before you purchase is my advice.", "verified": true, "helpfulness": "1/1", "author": "Elizabeth"}, {"rating": 5.0, "review": "Use this thing daily! I deleted my cable after getting this. I use HBO Go and Netflix along with streaming from my home computer's iTunes library!", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "I love our apple TV.  It allows us to steam netflix, hulu and more right on the TV so we are not forced to sit around a laptop. Recently Apple has been adding content, and while much of it is still dependent on having cable we still get a lot of use out of it. So true cord cutters might not be happy with it yet.If you are dedicated to the apple ecosystem this is a must buy. It connects to your iTunes account and allows me to stream my music, iCloud pictures (great for when family comes over and wants to see pictures of the kids) and movies. We purchase a lot of disney blu rays with digital copies and they stream directly to the TV no looking for discs. I love this box, we are considering buying a second for other rooms in our house.", "verified": true, "helpfulness": "0/0", "author": "Kzoodad"}, {"rating": 5.0, "review": "Works really well with my IPad. I love how it connects to your apple product and you can mirror anything on to your TV. Photos and video look awesome on my big screen.", "verified": true, "helpfulness": "0/0", "author": "Smokinjoe"}, {"rating": 5.0, "review": "This was easy to hook up - I already had a Netflix account so it was great to watch movies on my big-screen TV instead of the computer.The only negative would be the remote - it's so tiny and if you lose it, you're screwed.  There are no buttons on the unit to change channels, applications, etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"AnyPorkInAStorm\""}, {"rating": 5.0, "review": "Amazing product!!  I love it.  It is very user friendly.  I've owned a similar device for years which I've always liked and still do. However, the Apple TV makes everything so easy.  If you own an iPad or iPhone it is so easy to send your favorite shows to the Apple TV to view on the big screen!  We don't have cable and have found this to be a lot easier to see our cable shows rather than hooking up the laptop to the tv all the time!!  We will probably purchase another one soon for another TV.", "verified": true, "helpfulness": "0/0", "author": "Jenn"}]