[{"rating": 5.0, "review": "arrived on time and great quality!", "verified": true, "helpfulness": "0/0", "author": "Rose Ann Pearl"}, {"rating": 5.0, "review": "I bought this for my son and he loves it. It is compact and does everything he wanted it too.", "verified": true, "helpfulness": "0/0", "author": "Barbara Romaniello"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Cathleen Broers"}, {"rating": 2.0, "review": "Though I find it to be very useful. The iOS 8 updates have hindered the Wi-Fi data performance. It takes forever to stream an HD movie purchased from my library. Sometimes tells me that it will take 17-21 hours for my movie to be ready. Only seems to be immediate when plugged in directly into the modem.This is my second Apple TV that I purchased. For years, I've used it only on Wi-Fi. I had an internet package that gave me up to 50mbps with old router. I have since upgraded to a 125mbps package with an extremely high caliber dual band router that provides coverage for up to 10,000 sq.ft. The Apple TV does work well being 7 feet from the router. It is not the equipment. I noticed the change shortly after the iOS upgrade on both my Apple TVs. Went to war with my internet provider and upgraded everything. But still didn't solve the problem.Since I've gotten Chromecast, use a Nexus 6, HTC One Max and LG G2 on the network and get download speeds between 80-100mbps. Streams like a champ! Except for my Apple TVs. Very upset! I have thousands of dollars in movies that I cannot watch because there is no something wrong with Wi-Fi connectivity. Same movies will stream on my iPad with with no problem.", "verified": true, "helpfulness": "1/2", "author": "Joseph Woolridge"}, {"rating": 5.0, "review": "Great deal and looks / works exactly as it should.  With no cable in one room this worked perfectly for our family to bridge that gap.  It took less than 10 minutes to figure out and I had my in-laws using this in one night and they loved it.", "verified": true, "helpfulness": "0/0", "author": "Kurt \"Kurt\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 5.0, "review": "Apple rocks", "verified": true, "helpfulness": "0/0", "author": "A. Solano"}, {"rating": 4.0, "review": "Works just like an Apple!  (We upgraded from the initial release - this one works just fine too!)Out of all the new streaming devices (Apple TV, Roku, Fire Stick, and our DVD player...), the Apple TV has the most-predictable interface and streaming quality.  (BUT - there's no access to AMZ PRIME - which is our favorite source for movies!)We use the Apple to view new releases that - for some reason or another - are not available on AMZ or elsewhere.", "verified": true, "helpfulness": "0/0", "author": "jon mceachron \"(JDMc)\""}, {"rating": 5.0, "review": "Can't say enough about Apple- TV - Awesome product - easy to setup and use.  I now have 2 of them", "verified": true, "helpfulness": "0/0", "author": "Great-granny Harper"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "jose  castro"}]