[{"rating": 5.0, "review": "Great product. Cool to watch YouTube on TV transfer from my ipad. Also great to bring it with you as long as you have wifi and hdmi cable.", "verified": true, "helpfulness": "0/0", "author": "pooky maliboo \"pooky maliboo\""}, {"rating": 5.0, "review": "Great addition to my husband's TV room.  You can play all you tube videos, stream from you Ipad or iphone and great quality", "verified": true, "helpfulness": "0/0", "author": "Rachael"}, {"rating": 5.0, "review": "I'm an apple freek.This gadget is perfect. I can watch almost anything from home.My boy and I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Luciana Soares"}, {"rating": 5.0, "review": "I use this for wireless demos and presentations regularly and it's the only way to go. Several at our company have adopted the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Robert Nordstrom \"Hitec1\""}, {"rating": 5.0, "review": "I am an Apple guy so I am probably a little biased on this but this works great. high def and awesome sound, just cant be beat. I'm using a Bose surround sound system so I can play all of my iTunes and watch movies with great sound and great picture along with all of the internet extras with Apple TV. who needs a movie theatre anymore", "verified": true, "helpfulness": "0/0", "author": "rayonavich"}, {"rating": 4.0, "review": "I was skeptical at first, but with its Netflix capabilities and airplay the Apple TV has completely replaced my cable television!", "verified": true, "helpfulness": "2/2", "author": "justanotheramazonianonamazon"}, {"rating": 5.0, "review": "This is the second box I have purchased, this one for my office. More TV shows, movies, music, podcast, etc than you can ever use. Once live sports and live news break the monopoly of cable companies, this will be how we watch TV in the future.", "verified": true, "helpfulness": "0/0", "author": "Raymond E. Pinard"}, {"rating": 5.0, "review": "The box & cable arrived in an excellent condition and on time. Packaging was neat and clean. Thank you. Product & delivery was so good, my neighbor asked me to buy one for them.", "verified": true, "helpfulness": "0/0", "author": "Fr. Joseph"}, {"rating": 5.0, "review": "We host a lot at our house, so this is great for sharing fun YouTube videos or even to project music. It's great for Netflix and very simple. I am not very tech savvy, so I love this. It's simple but has a lot of great features.", "verified": true, "helpfulness": "0/0", "author": "Emille31 \"Emille31\""}, {"rating": 5.0, "review": "So simple. We plugged it in, set up the account info, and it has worked perfectly from day one. Love that I can even set the pictures in the screen saver to my favorites from my photo library.", "verified": true, "helpfulness": "0/0", "author": "We Like Mondays \"We Like Mondays\""}]