[{"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "WJ Harper"}, {"rating": 5.0, "review": "my hubby loves this item", "verified": true, "helpfulness": "0/0", "author": "Lybronda Middlebrooks"}, {"rating": 5.0, "review": "Perfect! Just Perfect!", "verified": true, "helpfulness": "0/0", "author": "Alexandre Araújo"}, {"rating": 2.0, "review": "I passionately dislike Apple and the way it does its \"iLife\". However, this was a gift for family that already had an iPad so the mirroring idea is what sold it the most in reality.A HUGE thing to mention here is that the controlling momma Apple does not allow any other apps to be installed onto the device. Whatever Apple chooses to install or remove during an update is what you will get and you will have no say in the matter. Why do I say this? Well...do you have Amazon Prime so you can watch tv and stuff???...not on the Apple TV you don't!!The control leaves much to be desired. It is also NOT a bluetooth control so you must keep a clear shot to the device for the control to work.On the plus side, the looks of the device is sleek and classy. It blends very well and does not take up much space at all. The setup (I am pretty technically inclined) was a breeze. Connecting was equally easy (HDMI).Reliability: Cannot attest to any of it as the device has barely been used still. I hope Apple still takes pride in the products and demands the high level of quality it did when Mr. Jobs was still in charge.Disclaimer:I am extremely bias in support of the Android platform. I use Samsung devices (SmartTV, Smartphones) and they all connect together wonderfully, the TV let's me install extra apps (on top of the pre-installed ones). I have used one of the many Google TV devices and those also allow you to do what any Android tablet can do.Final words: I think that for the money, you could find something more competitive with more flexibility. I personally would never purchase this device for personal use. If you are already submerged into the iLife, however, then this device is neat simply because you can mirror some other apple devices onto the tv with this (play a game without having to have the phone 5 inches from your face!!)", "verified": true, "helpfulness": "0/1", "author": "El Macho"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "chaochenwang"}, {"rating": 3.0, "review": "goodnight let me know as I use my warranty controlApple TV will not hurt me and I could use.heidy thanks bald buitrago", "verified": false, "helpfulness": "0/3", "author": "Heidy Buitrago \"HEIDY BUITRAGO\""}, {"rating": 5.0, "review": "My only regret is that I didn't buy this sooner. I had seen it in stores and online. Finally one day at apple, I played around with it, and I love it!! I have a lot of apple products, and really enjoy them. The setup wasn't bad. I usually mess around with stuff rather than read the instructions. It probably took me 10 or so minutes. You have to enable the home sharing on your computer, so that took a couple of minutes, which I include in that 10 minutes. You don't need to have an apple computer, just iTunes. You will need a hdmi cord, so if you don't have one, order one or pick one up at walmart. I then had to figure out which input to use on my remote, which turned out to be hdmi2. Then sign into Netflix, watch channels that are included, rent movies, listen to tons of music, ect. I love this device!!", "verified": false, "helpfulness": "1/1", "author": "Juanita Bentson"}, {"rating": 5.0, "review": "Was told this worked great in our granddaughter's room.", "verified": true, "helpfulness": "0/0", "author": "Shirley Scott"}, {"rating": 5.0, "review": "Apple TV, what more needs to be said. It's a great product.", "verified": false, "helpfulness": "0/0", "author": "Ola Olusoga"}, {"rating": 5.0, "review": "I live in a place where I can't even get broadcast television with an antenna, even if I had it mounted on the roof. I love the fact that the apple TV is working amazingly with my DSL connection. I am excited to see how it will work when I move back to a place where I can get faster internet. So if you are even if you can only get DSL, streaming from Hulu Plus and the free apps will work really well. I wish I could add apps to the Apple TV or that there Safari was loaded on it, but it really doesn't hamper the fact that having it is saving a ton of money where I don't have to get satellite.", "verified": false, "helpfulness": "0/0", "author": "Chantal"}]