[{"rating": 5.0, "review": "Apple quality and efficiency of delivery from Amazon. Perfect combination!I am very pleased with the Apple TV. My two kids love animated films and programming from Netflix that Apple TV makes it even more interesting. I like that.", "verified": true, "helpfulness": "0/0", "author": "Adalci"}, {"rating": 5.0, "review": "Having an AppleTV is just awesome.The viewing quality through some apps is often better than viewing programs through regular TV.Combine your AppleTV with a HD SmartTV, and the experience is even better.Setup of an AppleTV is very easy and streaming content from the computer, tablet or phone is just by a single tap of an icon.Would recommend an AppleTV purchase for anyone.", "verified": true, "helpfulness": "0/0", "author": "CHunter"}, {"rating": 5.0, "review": "Great for Netflix, Hulu, ESPN, and many more. I also love the vevo channel. A slightly better selection of channels than the Roku.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Love this product.  You can get Netflix and many more online (paid) services.  The main reason I bought this was to be able to watch sporting events on my iPad that are not available anywhere else and project the image from my iPad wirelessly to my TV via the Apple TV connection.  It works much better than viewing things via the laptop and connecting the laptop via HDMI to your TV.", "verified": true, "helpfulness": "0/0", "author": "CRogers \"Crog\""}, {"rating": 5.0, "review": "Directv, and Dish, there's a new Sherrif in town... Apple TV is the new way to watch TV  ! Apple TV", "verified": true, "helpfulness": "0/0", "author": "Scott  P Winebarger"}, {"rating": 5.0, "review": "This is the 3rd Apple TV  device I have purchased... If I had a 4th I would purchase another. Easy to set up and never a problem.", "verified": true, "helpfulness": "0/0", "author": "PJH \"PJH\""}, {"rating": 5.0, "review": "I love the device.  It met my expectations... I'm be enjoying it for long time.. Thank you for the reminder.", "verified": true, "helpfulness": "0/0", "author": "Solange \"I love books that will help me cope with my life's changes and relationships.\""}, {"rating": 5.0, "review": "Easy to connect, easy to use. Make your life easier to watch any movie, series, sports events and view your iphone and ipad on the tv", "verified": true, "helpfulness": "0/0", "author": "Rafael Diaz"}, {"rating": 5.0, "review": "I love apple Tv MD199LL/A. The only thing that I do not like is: there is a difference between Netflix for Latin America and Netflix for USA, but it is not Apple failure. USA Netflix is thousand times better than Latin version.", "verified": false, "helpfulness": "0/0", "author": "Dennis Aguiluz Milla \"damilla\""}, {"rating": 5.0, "review": "I like apple products as like as Apple TV.  I recommend it.  Airplay is the best technology.  I like it.", "verified": true, "helpfulness": "0/0", "author": "kota"}]