[{"rating": 5.0, "review": "This is so much fun and easy to use small lightweight and portable apple you did it again will buy again if I need a gift", "verified": true, "helpfulness": "0/0", "author": "Jeffery"}, {"rating": 5.0, "review": "Playing music and view videos through the AppleTv wireless. Great to having a good time sharing your music, video, podcast, etc.", "verified": true, "helpfulness": "0/0", "author": "Cuitlahuac Guerra"}, {"rating": 5.0, "review": "I love being able to watch TV, movies, etc. on all my devices! This has been a real enhancement to our entertainment!", "verified": true, "helpfulness": "0/0", "author": "Coren E. Mino \"suburban customer\""}, {"rating": 5.0, "review": "Picture & sound quality Awesome! Available programs? Awesome! Like it for NetFlix & a few others better then TiVo! Thank  you!@", "verified": true, "helpfulness": "0/0", "author": "Bick"}, {"rating": 5.0, "review": "This is my second Apple TV.  I loved the first and wanted to add another to the bedroom.  I love the mirroring and ability to watch movie clips before purchase.  It is super simple to hook up and never has in issue.  I downloaded the free remote app from itunes so I can control it from my iPad or iPhone.  Now the Apple TV device sits out of site and it can be operated without a direct line of sight.  COOL!", "verified": true, "helpfulness": "1/1", "author": "DBW"}, {"rating": 5.0, "review": "I received the product and im happy with it! I got it on time and just the product is perfect!", "verified": false, "helpfulness": "0/0", "author": "melanie torres"}, {"rating": 5.0, "review": "I must say I bought this with a little apprehension, but I am surprised at how great the product really is and the ease of use. I love the air streaming feature, where from any other apple device like iPhone etc I can simply stream pics or videos I have taken on iPhone to my tv. I can stream music as well which means I don't need to buy another accessory to do this. Great product for great price.", "verified": true, "helpfulness": "0/0", "author": "Barry Berman"}, {"rating": 4.0, "review": "To start with, let me note that I am primarily a Netflix and iTunes user. I started out with a very nice Roku 2XS which worked just fine out of the box, detected and connected to my network, and functioned exactly as it was supposed to. Then... I realized my iTunes library was completely inaccessible and realized I'd made a mistake. So I ordered the Apple TV from Amazon. Here are my observations:1) The fit, finish and packaging for this most inexpensive of Apple's products is as good as anything else Apple makes. It does not appear like a stepchild in Apple's product line. It is an extremely tactile, compact, weighty little device with clean lines and is a perfect physical match for my new flat screen.2) The user interface is far and away superior to that for the Roku or any other similar device I've tried. Some thought has gone into their software for this device and it's the most usable in its class.3) The \"channel\" selection through AppleTV continues to grow, and so far as I can tell, this item offers more options that the Roku.4) The Airplay connectivity with my wireless PC works as expected. It's a very pleasant experience to find your complete iTunes media library accessible directly on your set without being forced to connect yet more cabling. I have a 2Wire router from AT&T; and the performance is easily good enough for high-def movies and TV shows. This is the main reason I went with this device. I am quite satisfied. I can now see new episodes of \"Justified\" and \"Mad Men\" when they come out on iTunes the day after the episodes air. You can't get everything in the most timely manner through iTunes (Game of Thrones? Hello? HBO?) but this is a large chunk of a good solution for people like me who refuse to subscribe to cable.I would eventually like to see Apple manufacture another version of this product with a 2-3 TB hard disk. I would absolutely consider buying such a device given that they can be trusted to put thought and design into the software to really make it work.", "verified": true, "helpfulness": "0/1", "author": "Rich Grace"}, {"rating": 4.0, "review": "Probably but this thing is pretty nice.  I kind of hate giving Apple all my money, but they make a darn good product.", "verified": false, "helpfulness": "0/0", "author": "TechGeek"}, {"rating": 5.0, "review": "Bought one when they first cam out with apple tv and loved it.  Now we bought this one and still love it.", "verified": true, "helpfulness": "0/0", "author": "James P. Barrett \"Joleen\""}]