[{"rating": 5.0, "review": "Looks like finally I have what I needed. I am using airplay to stream from my macbook, using vlc player to stream dvd. Works like a charm. Great product at this price.", "verified": true, "helpfulness": "0/0", "author": "Po the panda"}, {"rating": 5.0, "review": "I was trying to stream movies via my ipad but wanted to see them on my TV and heard about apple tv.  I had no idea what to expect but absolutely love it now!  it was so simple to set up and I love how i can access my itunes and videos from it too.  If you are a iphone or ipad person I highly recommend apple tv!", "verified": true, "helpfulness": "0/0", "author": "Kristy H. Thompson"}, {"rating": 5.0, "review": "I bought he Apple TV after much consideration between it and Roku, I found it best suited what I was seeking. My family and I have a Roku in the game room where the kids can easily access Netflix and watch their shows, while in the media room we have the Apple TV. We are a complete \"iFamily,\" so the Apple TV is perfect. It shares with our computer, iPhones and iPad flawlessly. With the recent addition of ESPN Go and HBO Go to the channels the Apple TV is by far the best choice. And no, you don't have to watch everything or anything on iTunes to get the most out of the Appe TV. If you don't have any other Apple products, the Apple TV stands on its own like a champ. Like all Apple products it hooks up easy and the interface is beyond user friendly. Highly recommend for persons who have other Apple products, as well as for those who want to enjoy a wide array of programs, as Apple continues to add new channels.", "verified": true, "helpfulness": "0/0", "author": "Matt Whitaker"}, {"rating": 4.0, "review": "I bought this because my vacation home has no TV service (by choice). I hooked this up and its working great with my DSL internet connection. I bring up sling box on my laptop and watch anything I want on my cheap 32 inch TV through Air Play display mirroring. Best of both worlds. Netflix and ESPN  work great directly from Apple TV.", "verified": true, "helpfulness": "0/0", "author": "M. Espriella \"Mac Fan\""}, {"rating": 5.0, "review": "I've been very pleased.  Since we own Apple products the ease of setup and use is just like any other Apple product.", "verified": true, "helpfulness": "0/0", "author": "Doug of CLT"}, {"rating": 5.0, "review": "I bought this based on a friends recommendation.  I am more than pleased.  I ordered it on Saturday, Amazon shipped it promptly and I had it set up and working by Wednesday afternoon.  I particularly enjoy watching Lost via Netflix!", "verified": true, "helpfulness": "0/0", "author": "G.B.FlaJim \"Jim\""}, {"rating": 5.0, "review": "Awesome hardware if you are an Apple fanatic , I currently have several apple products and they work seamlessly together including the AT3.I would recommend this product to a friend", "verified": true, "helpfulness": "0/0", "author": "Freddy Baez"}, {"rating": 4.0, "review": "Particularly like Airplay mirroring capability from iPhone and iPad.  However, it takes some effort to fully understand how to take advantage of its features.", "verified": true, "helpfulness": "0/0", "author": "Amazon fan"}, {"rating": 5.0, "review": "Brilliant product with great functionality. I think it's quite adequate to convert a normal LED to a smart TV at an unbelievable price with this product.", "verified": true, "helpfulness": "0/0", "author": "Adi"}, {"rating": 4.0, "review": "I gave apple tv 4 stars only because the update doesn't seem to work and as far as I know the only movie format you can use with it is mp4 which is fine if you have a video converter.  Also, you have to import all movies you want to watch that are a file into itunes and then have itunes on in order for it to show up on apple tv.  The access to netflix and all the other channels it great and easy.  All in all, I love apple tv and am planning on buying another one for our tv downstairs.", "verified": true, "helpfulness": "0/1", "author": "Joel"}]