[{"rating": 2.0, "review": "Not so impressed with the Apple TV.  I mainly bought this so I had a device to link my phone and ipad to the television.  Sometimes it works, but most of the time it drops the connection constantly.  Also, most of the apps don't offer anything unless you already have cable,  so keep that in mind if you are thinking if using it for HBO or ESPN and do not have cable.  All in all, I'm pretty disappointed.", "verified": true, "helpfulness": "1/2", "author": "Jostci"}, {"rating": 5.0, "review": "Well.. I own 3.  I have them in bedrooms, living rooms, every-and-any-where!  I plan on getting more too.  I have it connected to my network and surround sound.  I can play movies, music, Netflix, you name it!  Best part, you ask?  I can control it all from my iPhone, iPad, or MacBook Pro (with the Maverick update, that is).  It's just wonderful.", "verified": true, "helpfulness": "0/0", "author": "Tiffany A."}, {"rating": 5.0, "review": "Love it all the way!  This is great for those of us that have large digital collections of movies, music and tv programs!  Works fantastic.", "verified": true, "helpfulness": "0/0", "author": "aroglesby85"}, {"rating": 5.0, "review": "It's like most every other Apple product.  It works and does everything it is designed to do.  It has a tiny footprint, but growing options for additional entertainment and streaming.", "verified": true, "helpfulness": "0/0", "author": "B. Petree \"B Petree\""}, {"rating": 5.0, "review": "My family loves Apple TV. It gives us everything we already had on the phone and ipad right on the tv. This includes all of the movies and shows my kids watch and it's easy enough for them to function it on their own", "verified": true, "helpfulness": "0/0", "author": "Coldwatergardens"}, {"rating": 5.0, "review": "If you own an iPhone or iPad this little device will really enhance your pleasure with Apple Products. For example I like to watch HBO GO on my TV but my TV carrier (Comcast, also known as the worse cable company in the entire univerese) will not support the Roku Player, but thank god does support Apple TV. Almost anything you watch on your iPad or iPhone you can stream it using AirPlay with Apple TV. It is a must have device.", "verified": true, "helpfulness": "0/0", "author": "David Burke"}, {"rating": 5.0, "review": "We use iPhone, iPad, and Macbook, and so it make a lot of sense to get this Apple TV. This device is very easy to set up and convenient to use. We are really happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Jello"}, {"rating": 5.0, "review": "Setup was easy, it doesn't take up much room and I love being able to play movies from my iTunes account on my TV.  I wish Apple would make an \"all in one\" device that would both play movies/content as well as render the laptop display on the screen that would be ideal but, sadly, the AppleTV unit only plays iTunes content (an \"Airplay\" unit is required to show the computer desktop on the TV).", "verified": true, "helpfulness": "0/0", "author": "theOCjeremy"}, {"rating": 5.0, "review": "Christmas gift looks good it's for my grandson he will be flying in for holiday won't no anymore until after holidays", "verified": true, "helpfulness": "0/2", "author": "Michael abram"}, {"rating": 5.0, "review": "My wife and I like to click around on our iPads.  We often are doing the same thing and would like to view it together.  We also like the ability to use movie apps.  This is a very cool thing.", "verified": true, "helpfulness": "0/0", "author": "Tommy \"I want to feel good when I complete a story & am a little harsh on depressing ones.  There are a few sad ones that I love but not many.\""}]