[{"rating": 5.0, "review": "Love my Apple TV!  It is especially wonderful when using it stream videos from my iPhone!", "verified": true, "helpfulness": "0/0", "author": "LostShadow225"}, {"rating": 5.0, "review": "thx", "verified": true, "helpfulness": "0/0", "author": "Dan Tashnick"}, {"rating": 4.0, "review": "The product works very well.  It was a little complicated to setup at the beginning, but eventually everything fell into place.  I wanted it mainly for \"mirroring\" the content on my iPhone.", "verified": true, "helpfulness": "0/0", "author": "George Joseph"}, {"rating": 5.0, "review": "Got a bigger house and bought a second one so I can have access to all of my media on both TVs.  Certainly helped that they dropped the price $30.", "verified": true, "helpfulness": "0/0", "author": "ron"}, {"rating": 5.0, "review": "Awesome. Works great!", "verified": false, "helpfulness": "0/0", "author": "Lauren Opar"}, {"rating": 4.0, "review": "Item was as advertised and arriv d in a timely manner.", "verified": true, "helpfulness": "0/0", "author": "shirley tode"}, {"rating": 1.0, "review": "I tried to find out what it actually is via the web and through the store and I really never got an answer that I could understand.  After reading the different reviews of this not being as good as that, etc. I took the chance and bought it at the Apple Store.  I connected it and I have been successful in watching YouTube and listening to music.  It appears that I have to pay something to watch anything else, to include PBS.  As I can't return it now, I am stuck with it until I replace it with Roku or something else.  Right now it is as good as a paper weight!  Would I buy it again?  NO, would I recommend it? NO, and will I buy another? HELL NO!  You got me once, shame on you, get me twice, shame on me.", "verified": false, "helpfulness": "1/4", "author": "David F"}, {"rating": 5.0, "review": "I bought this to watch HBO NOW and it didn't disappoint! My only minor complaint is that it is annoying to type with the included remote.", "verified": true, "helpfulness": "0/0", "author": "Kyle R."}, {"rating": 5.0, "review": "Really good!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Matthew Sato"}, {"rating": 4.0, "review": "Good choice", "verified": true, "helpfulness": "0/0", "author": "JAESEUNG"}]