[{"rating": 4.0, "review": "I have found that I use this more with AirPlay to view steaming videos and listen to podcast from my iPad and iPhone, rather than trying to navigate the screens with the very basic remote.  The home sharing with your iTunes music and pictures is probably the 2nd best feature, as I can use playlist and let photo albums run on the TV.  This finally solved the anxiety of all the pictures that I wished were framed our in photo albums.", "verified": true, "helpfulness": "0/0", "author": "Michael Wray \"Casual Shopper\""}, {"rating": 5.0, "review": "I love it!!!!  The only thing I would recommend is them adding more airplay games on the App Store . Everything else I have no complaints about , it is the most amazing technology I've ever used", "verified": true, "helpfulness": "0/0", "author": "Dustin"}, {"rating": 5.0, "review": "I've been watching so much Beyoncé on my Apple TV it just doesn't make sense this product is so great thank you so very much for the fast shipment", "verified": true, "helpfulness": "0/0", "author": "Alphonso Dunston"}, {"rating": 1.0, "review": "I was pretty excited as I bought this. The features Airplay and Youtube were the biggest advantages of getting this. However, both of them have serious drawbacks and are not at all functional.The airplay has too much lag and is not a good experience for watching anything. It is better to use the HDMI cable. This is even more true for me since I keep my router away from TV, so data has to go from my laptop to the router to the tv.Youtube app was a disappointment as well, since it does not play any VEVO videos and the interface is pretty bad. This can be attributed to be google's fault as well, but I don't care. I want a good experience while using appleTV and I didn't get it.I returned it and went for a Roku. Not disappointed so far.", "verified": true, "helpfulness": "2/5", "author": "Eizenh3im"}, {"rating": 5.0, "review": "Great product, allowed me to get rid of cable and save money. Very similar to turning TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Salty"}, {"rating": 5.0, "review": "I love my Apple TV! It's super easy to set up and use. Just make sure you have a Netflix or Hulu Plus account, otherwise you'll be getting things with your iTunes account.This also works great with your iPod or iPhone (and in my case my iMac) great for playing music from my iPhone through the home theatre system - if I get a call, it pauses the music and then starts playing again when the call is ended.", "verified": true, "helpfulness": "0/0", "author": "Carmen Camacho"}, {"rating": 5.0, "review": "We got a box for streaming Netflix with our new flatscreen a few years ago, but it never worked properly. The cable guy told me I needed Apple TV. For the price, it is SO WORTH what this does for you. Never since hooking it up (relatively easy with my husband's help) have I had a problem streaming Netflix. It works great. The mirroring is nice too, when I want to send something from my MacBook Pro up to the big TV screen. Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Dreamer"}, {"rating": 5.0, "review": "i got this after trying out the google chromecast and i fell in love. i can play all of my movies and music off of my multiple computers via itunes and it is always hd quality and never laggy. the interface is extremely easy to use.", "verified": false, "helpfulness": "1/1", "author": "R. A. Moore"}, {"rating": 1.0, "review": "Many of the more recent reviews of Apple TV have been negative, very negative. Mine must be also. I have an older model that works perfectly. The one I just bought did not. (To be totally upfront this was a refurbished model that I was assured by Apple would function exactly as a new one would. So I trust that the fact that it was refurbished was not the problem.) My internet connection was working as it should. My home network was also working as it should. I was able to watch Netflix movies with no problem - no streaming issues, no buffering issues, no issues at all!! But, the airplay feature on the Apple TV was not working properly. I was not able to airplay movies from my iPad or computers to the Apple TV, even after spending a lot of time on the phone with Apple Care. The people I spoke to on the phone could not easily solve the issue. Their only thing they could recommend was to \"restore\" the Apple TV. This took over an hour and required re-doing three sets on User IDs and passwords - a frustrating process with Apple TV. Unfortunately, it didn't resolve the issue. It actually made it worse! I called back, explained the situation, and was transferred to another person. He had no answers but would check with someone else for assistance. We were cut off. He didn't call back even though he had my number. I waited 10-15 minutes and called back myself. I eventually got transferred to someone who would try to get me to the previous tech person. In a short time, we got cut off again. There was no call back. There was no email sent to me as a follow-up.This morning, I brought the Apple TV to a local Apple Store to return it. My home network was working as it should. Any software issues were addressed with the \"restore\". Therefore, it seemed rather logical that the problem was a hardware issue. BUT, at the store there was no offer to exchange my unit for a new one to see if that was, in fact, the problem. I would have appreciated the offer and given the new unit a try. As it was, I left the store with a refund, but no Apple TV, and a somewhat negative feeling about Apple, in general. Apple Care offered no solution. Neither did the store. I am very disappointed in Apple customer service. I expect more from them. And, just for the record, I have been purchasing Apple products for 30 years. My first computer was an Apple IIe.It seems there is a problem with the newer versions of the Apple TV, problems that Apple hasn't addressed. Purchasing one at this point is a gamble. Maybe it will work, maybe it won't. I would recommend waiting for any purchase until there is a solution and the product is reliable.", "verified": false, "helpfulness": "3/9", "author": "Spencer Woods"}, {"rating": 5.0, "review": "The more I use this the more I love it. I am an owner of Roku boxes, the original Boxee Box, as well as the other common streaming options like a PS3, Smart TV, and Blu-Ray player.  Of all of the devices in our house the only one my wife uses is the Apple TV. I would say simplicity as well as reliability are the biggest reasons why she prefers it to the others.There are little things that I love about Apple TV that put it ahead of the competition. Let's start with the Apps first.  Apple TV has a very different interface for services like Hulu Plus and Netflix and it is in my opinion a superior one. Roku's Netflix App, for example, makes you scroll left to right with just a few titles in your instant queue showing each time. Apple TV shows all of your instant queue titles in one large screen. It is much easier to scroll down and find titles in the middle or bottom of a large queue.  Because of this different user interface all of the screens in the apps are easier to use and navigate.I also like that when you pick a something to watch it suggests several other titles that are similar to the one that you picked. This is very helpful in unlocking lesser known titles in the Netflix library.  Most apps do not come close to showing you all of the titles that are available for Netflix streaming. The suggestions open up the options to things you did not know were there. I love this feature as I have discovered titles that never show up in the main browsing menus.The other big plus is that the Apple TV always works. I cannot say this has been the case with the other boxes I own. I have lost track of the number of times I have had to reboot my Roku or Boxee Box to clear up a problem. This is more of an issue with Boxee but my Roku will often restart itself, lock-up in an app, or just be very slow in general navigation. I do not remember the last time I had to unplug the Apple TV for a hard reboot, if ever.I also love being able to push the up or down button on the remote to see where I am at in the program without having to press pause. I miss this function a lot on my Roku boxes. In addition to your place in the program this bar is useful when you are streaming Itunes related content. Apple TV has 8GB of internal flash storage and begins downloading an Itunes title when you start watching it.  This means you will not see a drop in image quality while watching a program even if your bandwidth becomes less. The progress bar shows you how much of the title is downloaded with a white bar.  If you are having streaming issues just pause the title and wait for the white bar to go ahead of your pause point. It is pretty rare when I need to do this but it is good to be able to see how much of the content is downloaded. If you do not finish a title and come back to it later the downloaded portion stays on the flash storage so streaming is always smooth.Of all the positives mentioned above I have not gotten into Air Play functions.  If you own an Ipad or Iphone, like my wife and I do, then this is another awesome feature. Simply put there are other options that offer more content but there are not many that do it in such simplistic and reliable fashion as this. If you own any other Apple products like a Macbook, Iphone, or Ipad then getting this little box would be a great choice. Even if you are not an Apple user there is a lot to love about Apple TV.", "verified": false, "helpfulness": "2/3", "author": "Raymond R. Jackson"}]