[{"rating": 5.0, "review": "Easy to use. Great product for any room in the house.  Multiple apps to stream video. AirPlay is fantastic to watch my iTunes U videos for class.", "verified": true, "helpfulness": "0/0", "author": "Joshua Vengley"}, {"rating": 4.0, "review": "You must have this if you own an iPad or iPhone. Airplay feature is worth it alone. I like all the channels apple is slowly adding however the current interface makes this interface way too cluttered. I hope they update this system soon... maybe in march. This apple TV is a gift but I would like to buy a new one for myself.", "verified": true, "helpfulness": "1/1", "author": "Adam Glowacki"}, {"rating": 5.0, "review": "So far so good. SO easy to set up! We were literally watching one of my itunes movies in under 10 minutes. We were previously streaming netflix and hulu plus through our wii but its not HD compatible. This is full HD. Love being able to stream movies and tv shows from itunes. And the remote is MUCH easier to use than the wii remote!", "verified": true, "helpfulness": "1/1", "author": "M. Knaus"}, {"rating": 5.0, "review": "Simple and intuitive. I'm no genius when it comes to hooking up technical devices. But I was able to get this up and running in no time.", "verified": true, "helpfulness": "0/0", "author": "Mark Taylor"}, {"rating": 5.0, "review": "Seamlessly air plays ipad right onto the tvMany other apps really converts any tv into a smart tv, but  with Apple standards", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 2.0, "review": "WORTHLESS if you don't pay for Cable TV -Apps Require Cable TV Subscription verification.Apple TV is worthless if you want to use apps!.... All but Netflix or paid video like HULU need a Cable Provider Verification!!!Apple TV just added WatchABC app and you need to have a cable provider to use the app. ABC is a network channel and is free to people who have antenna tv and don't have or can't afford to pay for cable tv.  But on Apple TV the WatchABC app you need to have proof that you pay for cable TV and on top of that AppleTV does not even offer all the cable TV providers including DirectTV, Dish or TimeWarner cable. So this app is WORTHLESS to most people even if they have cable TV or not.Most of the Apps on AppleTV are like this. WatchEspn, MLB, FoxNow, all three Disney Channel apps all require cable TV verification. They want proof you pay for cable tv even for apps where one does not need cable TV to watch the channel.If I had cable what would I need the app for when I can watch it On Demand on my TV...WatchABC app is free on an iPad or other devices but not on AppleTV.So is FoxNow, NBC players but not free on Apple TV.In my opinion Apple TV sucks. Pretty worthless if you want to use apps.The apps Apple TV has are so few with several in chinese or japanese so if you don't speak those languages you can't use those apps.AppleTV is only good for Netflix, Hulu, and  iTunes purchases.Instead buy a Google ChromeCast device USB port device for $35 and get the same mirroring of apps as Apple AirPlay does. Much cheaper and the picture quality is fantastic. Just mirror your apps from your mobile, iPad, Android or computer device to your TV...Then you don't need cable TV subscription verification.Don't buy this unit.", "verified": false, "helpfulness": "3/10", "author": "Buffy The Movie Slayer"}, {"rating": 2.0, "review": "The Apple TV is quite a disappointment.Airplay is incredibly cool.  Streaming content or entire screens from you (or your friend's) Apple devices is incredibly easy and quite brilliant.  Streaming music from iTunes running on your PC or Mac is decent.  Photo Stream integration is nice when it works.  Using the \"Remote\" app on iOS devices to control it is kind of neat.If you don't use the iTunes Music Store for purchasing content, you'll find the entire top row of icons to be useless.  Even if you do use ITMS, it still feels like ad-ware when you turn it on and see a bunch of scrolling advertisements to purchase movies or music.The Netflix player is bad.  As a competitor to the ITMS, it gets second-class treatment.  The video quality is poor and barely ever achieves HD.  There is no \"Next Episode\" option.  Worse yet, I have several Netflix titles that *ALWAYS* error out on Apple TV but work everywhere else.  The PS3 Netflix player is significantly better in almost every way - especially with regards to video quality and the fact that it actually plays all of the content available on Netflix without error.  Good luck getting Apple or Netflix to support the playback client.The Photo Stream integration is cool - when it works.  I was surprised to find several errors trying to log into my iCloud account, that didn't feel very seamless or \"Apple-like\" to me.  The Photo Stream option didn't work at all for several days, but after several attempts I did get it to work.There is limited channel selection.  There are several services that will probably never be available on Apple TV because they present competition to the services that Apple wants you to consume.Overall, Apple seems to be somewhat stagnant in this space.  I can't overstate the coolness of Airplay - which can be fun for parties (bring your own music!) but the device is lacking in almost every other way.Perhaps I would feel differently if I bought my content from the ITMS, but this thing is a big disappointment.", "verified": false, "helpfulness": "1/4", "author": "Brandon Kirsch"}, {"rating": 5.0, "review": "I ordered two of these this time. I liked the one I previously ordered so much that I got one for my two kids for Christmas. So, I bought three in total. Great product, especially because it give me more TV options than I already have. I live in the country and only have DSL and Dish so my TV options are spotty at best.", "verified": true, "helpfulness": "0/0", "author": "Cultech"}, {"rating": 2.0, "review": "After a ton of research, I couldn't get an apples to apples comparison of a Roku 3 to an Apple TV.  Since I have all newish Mac devices (iPad, iPhone, and a MacBook), I gave Apple the benefit of the doubt given its reputation for devices that work well together.  In short, I've been gravely disappointed--few of the features work well, and in particular the \"mirroring\" feature basically doesn't work at all.  It does at least do an OK job with YouTube and a good job showing pictures from my devices on the screen.", "verified": true, "helpfulness": "0/4", "author": "Dude in RVA"}, {"rating": 5.0, "review": "I love love my Apple TV I don't have a computer only IPad & IPhone I was happy watching Netflix or Hulu because my cable is very limited but after a while tablets can get hard to watch for a certain length of time.My first experience with Apple TV was at my cousins he has all new technology.So a few months later had to have went on Amazon it was a little les expensive than Apple so I happily purchased they also had the cables.I called my cousin told him I purchased & not sure how to install which was easy my cousin bought me for Christmas returned bought me another nice gift TMI Any how love love Apple TV and all Apple.", "verified": true, "helpfulness": "0/0", "author": "DebRDel"}]