[{"rating": 5.0, "review": "Works great, could tell this was brand new, bought this right before black friday when it went on sale for another $10.00 off, contacted amazon and they refunded me right away. All in all, got this $15.00 cheaper than apple.com", "verified": true, "helpfulness": "0/0", "author": "Danielle S."}, {"rating": 5.0, "review": "My daughter was so happy to receive this by Christmas! The grands could watch all the Disney they could until they were fast asleep!", "verified": true, "helpfulness": "0/1", "author": "Steven \"I enjoy listening to audio books on the long drive to and from work.\""}, {"rating": 5.0, "review": "You can save a lot of money in cable. Plus good movies & shows. Recommend to anyone . Go ahead", "verified": true, "helpfulness": "0/0", "author": "Judith velez"}, {"rating": 5.0, "review": "This device costs 99 bucks, but it's worth it. I love the fact that I can take my apple products anywhere and connect them to the tv. I have used it with FaceTime and it's awesome, my friends are on the tv and therefore I don't have to look at the small iPhone screen. Also, I have used it with Netflix and Amazon instant video, works great with those too. Finally, I made a karaoke system and I use this to view the lyrics, and my iPad to send the songs to the system, it works great with that. For 99 bucks, I think this is a great purchase.", "verified": true, "helpfulness": "0/0", "author": "A. Rangel \"Al R\""}, {"rating": 5.0, "review": "My wife & I can't believe we waited so long to make the switch from cable. Nothing compares to the amount of access you have for the cost. We have reduced our monthly home entertainment bill by $200.", "verified": true, "helpfulness": "1/1", "author": "Joe Dombrowski"}, {"rating": 4.0, "review": "In a sea of media streaming, network ready, HD capable devices on the market, this Apple product is a solid contender. If you are an Apple person, with the ipad's and the iphone's and such, then this should be your media device of choice mostly due to the inherent compatibility with this unit. And the extra Apple feature of Airplay, to throw anything that is on your mobile device onto your big screen TV. We are enjoying it.", "verified": true, "helpfulness": "1/1", "author": "Chris Holliday"}, {"rating": 5.0, "review": "Thanks for making a great priced product for Christmas!! I gave the gift of apple TV + Netflix to my parents. We love our apple TV!", "verified": true, "helpfulness": "0/0", "author": "Maria M"}, {"rating": 3.0, "review": "This is an okay box and works great for pairing with other apple products but is very limited in channels and speed compared to the Roku 3. I would recommend the Roku over this if you want great free channels, Pandora,  slacker, TuneIn, etc and a better interface.", "verified": true, "helpfulness": "1/1", "author": "J. Marshall"}, {"rating": 5.0, "review": "This little TV unit for Apple is great.  My wife and I love being able to watch our iTunes selections on the big screen TV and this is a perfect addition to our collection of gadgets for TV enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Rev. Dr. C. William Mercer"}, {"rating": 5.0, "review": "I purchased the Apple TV as a gift and was amazed at how easy it was to hook up and get it working. This is a very useful product for so many reasons. It's the ultimate big screen for your iPad.", "verified": true, "helpfulness": "0/0", "author": "J. T. Pater"}]