[{"rating": 5.0, "review": "Have one attached to my tv in the family room and works wonders. I enjoy watching things from several selections from Netflix and Hulu-plus  and from my itunes library.", "verified": true, "helpfulness": "0/0", "author": "ROBB ROESLER"}, {"rating": 5.0, "review": "One of the nicest, most productive  purchases I've made.  It has made my life much easier.  Don't have to leave the house to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Daisy"}, {"rating": 5.0, "review": "Bought this for my wife for while she was off on maternity leave.  We have Comcast cable with almost all of the channels.  The appletv has easily supplanted that, and is her primary source of tv now.  I like the screensaver feature which does a cool little moving collage of the pictures you have taken with other apple devices, and put on your home network.  Very nice.", "verified": true, "helpfulness": "0/0", "author": "Wyatt"}, {"rating": 5.0, "review": "Owned one prior and bought a new one for my other T.V. and extremely happy with w/ my second Apple TV!!!", "verified": true, "helpfulness": "0/0", "author": "tawny549"}, {"rating": 5.0, "review": "Love this little gadget. Let's us watch netflix or stream sports events from our iPads. Everyone in the house uses it with their iPads and iPhones.", "verified": true, "helpfulness": "0/0", "author": "Equisuz"}, {"rating": 5.0, "review": "We only stream movies and films, so instead of a flat screen TV, we opted to get a projector. Until recently we would plug our laptop or iOS device directly into the projector. This was a hassle because 1) you can't charge the iOS while it's streaming so you have to hope the battery's full or swap out the iPhone/iPad mid-show, and 2) HBO blocks the connection between an iOS & a projector, so if we wanted to watch HBOgo on the big screen, we'd have to reorganize the cables and connect a laptop.When FireTV announced the HBO parntership, I was psyched. Guess what -- even with the HDMI to VGA converter with R/L Audio Converter, the Fire TV will not work with a projector. So we got the AppleTV. It's not only compatible with our projector (using the converter we bought on Amazon), we found out we could stream HBOgo through our iOS wirelessly, which means it can be plugged into a power cable across the room. Perfect!", "verified": true, "helpfulness": "2/2", "author": "solara"}, {"rating": 5.0, "review": "It's an Apple product so what's not to love? So far I haven't had any problems with this. I've been able to watch movies downloaded onto my computer via iTunes seamlessly. I think it works great! I have not used it yet to stream movies from Netflix or anything like that yet.", "verified": true, "helpfulness": "0/0", "author": "ShirleyRN"}, {"rating": 5.0, "review": "We have 8 of these now and they keep getting better. When used in conjunction with the Apple Airport Express wireless home wifi router you can easily mirror the screen on you mac compute, iPad, iPod, or iPhone. Its easy and just like Apple products \"It just works\", no geek needed.The Apple TV give you access to your entire media library as well as capacity to purchase or rent newer movies from the iTunes store, watch your netflix, and many other apps. We like the screensaver that shows a slideshow of your photo stream pics when it goes into sleep mode. It never gets old to see your kids in larger than life random slide show on your HD flat screen. Great product, Great value, Recommended X 100", "verified": true, "helpfulness": "2/2", "author": "S. Hart \"S. Hart\""}, {"rating": 1.0, "review": "The Apple TV crashed after one day of use. I had to call Tech Support to find out that the Apple TV software had to be restored through ITunes. Very disappointed. Now I must purchase the USB cable so that I can hook my Apple TV up to my computer and restore the software through ITunes.", "verified": true, "helpfulness": "0/3", "author": "Alan J Brown"}, {"rating": 5.0, "review": "I got this because most of the equipment I had was apple devices. It work out very good, Now I could use it to watch movies and television shows.  I was very affordable to own it.  I love it because i could use all the pictures on device to see in the HD big screen.", "verified": true, "helpfulness": "0/0", "author": "Deope Gayomali"}]