[{"rating": 5.0, "review": "I bought the Apple TV off the apple website as at the time it worked out cheaper than it did on amazon, it's really easy to set up and easy to use! I'm not a big fan of the tiny remote but it's not problem to use I just don't like how small it is, I have a few apple products so this is nice to use iTunes on, I like the way it's easy to switch between mine and my husbands iTunes accounts for different music/ movies. I would recommend!", "verified": false, "helpfulness": "0/0", "author": "Eleanor Flowers"}, {"rating": 2.0, "review": "Had issues trying to return because product is defective, return process was started and apparently cancelled and then needed to be restarted again blah blah blah...ended up just taking the route of having to restore the software every few days to get the Apple TV to maintain an Internet connection. My bad for buying used. Lesson learned", "verified": true, "helpfulness": "1/2", "author": "Ian Craig"}, {"rating": 5.0, "review": "Bought this for my Sons birthday and he loves it. But he loves all Apple products.", "verified": true, "helpfulness": "0/0", "author": "Donald Iocco"}, {"rating": 5.0, "review": "The new Apple TV works great.  We have a \"2\" on one TV and the new one brings a host of new features, and faster scrolling.", "verified": true, "helpfulness": "0/0", "author": "Fran"}, {"rating": 5.0, "review": "simply the best", "verified": true, "helpfulness": "0/0", "author": "Fabian"}, {"rating": 3.0, "review": "I bought it because it was on sale and I needed a small device to play netflix and hulu while I'm traveling for work instead of sitting in my hotel watching tv on my laptop.It does the job but because of apple restrictions on design and app development, all the apps on it have the worst experience compared to their counterpart on PS3, Wii, XBox, etc...if I had to do it again, I'd go for a Roku maybe.", "verified": true, "helpfulness": "0/0", "author": "Sam F."}, {"rating": 4.0, "review": "I use it together with a Roku and Tivo. Fast, reliable and great interface. No problems at all and love the way it works with all my other Apple products. My only reservation vs the Roku is the much more limited selection of channels, especially no Amazon Prime. If I was given a straight choice between Apple TV and Roku and I did not have any other Apple products, I would go with Roku, if you can live with no Amazon Prime and you want to mirror your iPad etc, then Apple TV is a no-brainer.", "verified": false, "helpfulness": "0/0", "author": "pettybogie"}, {"rating": 5.0, "review": "Satisfied. Had a friend who owned apple TV so knew what to expect. Apple Quality.", "verified": true, "helpfulness": "0/0", "author": "Atul Kumar"}, {"rating": 4.0, "review": "The remote is somewhat difficult to use.", "verified": false, "helpfulness": "0/2", "author": "mam"}, {"rating": 5.0, "review": "I bought this soley for streaming quilting videos off my I pad onto TV and it works perfectly. I did, however, rehook my ROKU box back to the TV as Apple does not stream Amazon. It was easy to set up and use (once I realized the selector must be set on HDMI, not any of the Video settings as ROKU. Also, Pandora is not on it as on ROKU.  You can download app onto iPad and then mirror the channel onto TV - not big deal, though.  Obviously I don't hook these things up very often...  Both units are working well on the same set.", "verified": true, "helpfulness": "0/0", "author": "MaggieD \"ncmaggie\""}]