[{"rating": 5.0, "review": "Our ISP is slow and we were unable to use netflix  at all. We got the Apple tv and so far it has never failed to play whatever program we choose.Now we have used the Apple TV for several weeks longer and it has still not failed to load and play without interruption.", "verified": true, "helpfulness": "0/0", "author": "William Lee Christensen"}, {"rating": 1.0, "review": "The only reason this product has 1 star is because I had to put something.This product is horrible.  I tried to rent a movie thru i-tunes.  It was going to take over 2 hours to download the movie.  I didn't want to wait that long, so let the program run overnight.  The next evening, I went to watch the movie and had to download it again.  Over 2 hours (on the lowest resolution) I am not going thru this again.  It looks like apple ripped me off for the 3.99 or whatever the movie price was.Other options are Hulu Plus and Netflix (pay services).  I was previously dissappointed in Netflix and cancelled my account.  I have not tried Hulu Plus yet.The only positive aspect:  Using the \"mirror\" function on my ipad and iphone worked well.  You can easily stream movies from your ipad to the apple tv wirelessly if you have them loaded on your ipad.Save your money, go to redbox or just stream movies from your laptop and connect to your TV via HDMI.I feel ripped off.", "verified": false, "helpfulness": "1/8", "author": "JSM"}, {"rating": 5.0, "review": "I've have a Roku and a WDTV.., but Apple TV is the best by far. Apple mirroring is the ticket that opens up a world of goodies. Stream from your ipad or iphone directly to your TV. How sweet it is.", "verified": true, "helpfulness": "0/0", "author": "PjcostaBgrt \"mrdotcom\""}, {"rating": 5.0, "review": "This latest \"Black Box\" is highly addictive! I'm stuck in a Netflix alternative universe! Seriusly, this will be a gift that keeps on giving.", "verified": true, "helpfulness": "0/0", "author": "Hertzel Grotch"}, {"rating": 5.0, "review": "Apple TV works great , especially with iTunes and with iPad. Highly recommend this product partnered with other apple equipment.", "verified": true, "helpfulness": "0/1", "author": "L. Summey"}, {"rating": 5.0, "review": "Got this as a birthday present for my sister.  She has numerous Apple products and I thought this would be a good way for her to access Netflix.  I heard her mention once about Airplay and how it let you \"stream\" content (a bit embarrassing that she heard about it before me, seeing as I'm the resident tech in the family), so I thought it would be nice for her...Once she received the gift and started using it, I was VERY impressed at the capabilities! Not only does she finally have Netflix access on the TV, but that Airplay...wow!  Anything from you ipad, ipod, iphone, macbook, imac.... all can stream straight to your tv!  No delay or anything!Wanna hear your playlist while cleaning a room on the opposite side of the house from your computer? No problem, stream it!Tired of playing the Sims on that small macbook screen? No problem, mirror your desktop on the 40\" TV!I would've given it 5 stars if.... well you know what, I can't think of anything so it gets the 5!  The only gripe I WOULD have is that the Airplay doesn't work with any OS before Lion, and I haven't upgraded and don't want to.. but hey, it's not for me and all her computers are fully upgraded! She loves it.  This gift was so good, I could probably skip a year or two of presents haha.", "verified": true, "helpfulness": "0/0", "author": "J.E.Mc"}, {"rating": 5.0, "review": "Bought as a gift and now I want one.  The manual is a bit lacking but once you get the hang of it it's great.", "verified": true, "helpfulness": "0/0", "author": "C. Hill \"Yup\""}, {"rating": 4.0, "review": "This tiny little box replaced an old \"internet aware DVD player\". The Netflix video resolution is better with the Apple TV and it even seems to sound better. I chose the Apple TV over the cheaper Roku box because we have 3 Apple computers in the house and it is fun to be able to show photos and play music from the computers.", "verified": true, "helpfulness": "0/0", "author": "R. Mooney \"Rick\""}, {"rating": 4.0, "review": "Found it easy to use (ex: Netflix app). Like the AirPlay feature. I wish they supported more video streaming services.", "verified": true, "helpfulness": "0/0", "author": "cabernet chick"}, {"rating": 5.0, "review": "I love the Apple TV it works great and is really cool. It's super fast and delivers great hd it's also great for air play. Now that I have the Apple TV I would not be able to live without it!", "verified": true, "helpfulness": "0/0", "author": "Alec"}]