[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Brian Olsen"}, {"rating": 5.0, "review": "Pretty standard way to Netflix, HBO, etc. I will say that if you do not own at least one apple product, it's not worth it. It's a part of the ecosystem, as you can project the screen of any Apple device that has AirPlay. If you are an Android fan, stick to things like the fire stick (which I have and love, BTW) or the chrome thingy.", "verified": true, "helpfulness": "0/1", "author": "KM"}, {"rating": 5.0, "review": "it's apple, no need to say more", "verified": true, "helpfulness": "0/1", "author": "wes"}, {"rating": 4.0, "review": "It's simple out of the box but be aware you will need to purchase HDMI and ethernet cables on your own. This comes with power cord only. Truly a plug and play device. One of the simplest, trouble free electronic devices I've ever utilized. Plug in power. Plug in ethernet or connect wireless. Run HDMI to TV or reciever. That's it. The device will power itself up and walk you through a quick set up screen. It will be easier if you have created an iTunes account already. Updates will download w/in the first several minutes hooking it up.I won't go into a lot of detail about the icons/apps as they are well explained here and other places. The UI is user friendly and easy to navigate using the small, sleek remote control. The only one I've really played with so far is Netflix which connected to my account using just user name and pw. Didn't have to run up to the home computer and register the device to my NF account. Very easy. Unless you subscribe to iTunes Match ($25/yr.) you must ha... Read more", "verified": false, "helpfulness": "0/0", "author": "Kristi Britton"}, {"rating": 1.0, "review": "Worked for about 3 weeks and now it won't do anything. The power light is still on but we've replaced the batteries in the remote and nothing. Too late to get a replacement? Seriously?!", "verified": true, "helpfulness": "0/0", "author": "memotosk"}, {"rating": 5.0, "review": "Love it especially if you have iPhone or iPads home. It may not have a million apps like Roku but it's the cheapest way to use AirPlay on the big screen", "verified": true, "helpfulness": "0/0", "author": "ronny oemraw"}, {"rating": 2.0, "review": "We just wanted another avenue to see Netflix and stuff (it doesn't have Prime on it by the way), but really we wanted the ability to see photos, movies, hear music, through the Mac and iPhones. It is such a stuffy, moody, and temperamental device. It stops streaming during videos, has a really hard time showing pics from the devices, as if they were strangers rather than 'family,' among other things. Not impressed at all.", "verified": true, "helpfulness": "0/0", "author": "The Swingster"}, {"rating": 5.0, "review": "I have not just one, not just two, but three Apple TVs… They are so simple to use, give us access we need to Netflix, and allow us to throw images and videos up from our iPhones on any of our TVs.We have the older versions and I can't imagine what Apple will come up with that will urge me to buy the new version, as these fill our family needs!", "verified": true, "helpfulness": "0/0", "author": "S. Jones \"5hannon\""}, {"rating": 5.0, "review": "i like this product", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 4.0, "review": "Apple TV is very simple to set up, and delivers an excellent image.  The remote control, however, is abysmal.  Its buttons are slightly recessed and cramped, making it uncomfortable to use and easy to hit the wrong one.  The worst offender is the thin ring used to move the screen cursor.  It is almost impossible to use without inadvertently hitting the enter button, thereby creating problems.  It's especially frustrating when having to move through a series of selections, such as when needing to type out a name.  For a company known for its design, Apple seems have forgotten that the remote was meant for human use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]