[{"rating": 5.0, "review": "I wanted to be able to group large numbers of digital pictures on my Mac, add music, and send the finished product to my large screen tv.  The Apple TV does the job simply and perfectly...now I just need to take better pictures!!!Setup was relatively easy and, after a few trial/error attempts, I believe I have it mastered.  I have yet to test the other features (e.g., Netflex movies), but the product does what I expected and does it well.  No more memory sticks or burning CD's.", "verified": true, "helpfulness": "1/1", "author": "P. Roberts"}, {"rating": 4.0, "review": "Should come with HDMI cord, hard to find we still have not been able to set it up, hope it works", "verified": true, "helpfulness": "0/0", "author": "Lois K. Gorton \"quilter\""}, {"rating": 5.0, "review": "The product arrived within a couple of days and only took minutes to set up. It's great to have a few more choices than the standard cable packages.", "verified": true, "helpfulness": "0/0", "author": "pforlando"}, {"rating": 5.0, "review": "Unit was super easy to set up and provides great video & sound.  Its important to know Airplay will only work if both the Apple TV and portable device (iPhone,etc.) are connected to the same local network.", "verified": true, "helpfulness": "0/0", "author": "Amazonian \"AmaCraze\""}, {"rating": 4.0, "review": "I bought this device for its versatility and power when coupled with an apple laptop/desktop or IOS device. Let me just say that I seldom watch live TV, so having different options like netflix, huluplus, etc is nice. Since I have Amazon prime, I wish I could access the videos here but that is a no for now. The device does allow the \"air play\" from computers with mountain lon and all iOs devices. This works flawlessly. In fact, it worked so well that we bough a second one for the chuch and plugged it to the overhead projector. So whenever  someone delivers a message they can stream content from their iPad/iPhone/iPod to the Apple TV wireless without having to switch the video sources. We ran the audio to the sound board and the results were great.", "verified": true, "helpfulness": "0/0", "author": "MP"}, {"rating": 5.0, "review": "Aesthetics: Apple Tv looks very sleek, it is pleasing to eye but also it doesn't isn't very eye-catching. 5/5Functionality: it connected almost instantly with my wifi network. I have to admit, I have it pretty nearby a router so connection has to be great. I bought this because the thought of airplay was just awesome. No cables. No strings attached. Tried it with a MacBook Air 11' 2012 model and the results were amazing. There was almost no lag at all. I could stream movies, surf the internet, just amazing! I also connected it with an iPad 2 the results were the same, I streamed a youtube video, image quality was also very nice. 5/5", "verified": false, "helpfulness": "0/0", "author": "TheHonestReviewer"}, {"rating": 5.0, "review": "We finally took the plunge and cancelled out cable service. And surprisingly, not only do we not MISS cable, but we're happier without it. Knowing that we're not throwing $1200 a year at a cable company makes us incredibly happy!", "verified": true, "helpfulness": "1/1", "author": "Matthew Friedman"}, {"rating": 4.0, "review": "It's clear that the Apple TV is still just a side-project for Apple as it lacks some features and capabilities that it's obvious the hardware could handle.  That said, it's proving to be a rock-solid and slick way of getting video from my MBP to the TV with perfect video and audio quality.  The integration with the Apple Remote app is very good though I wish the Remote app basically duplicated the menu selections on screen on the iOS device.", "verified": true, "helpfulness": "0/0", "author": "almondpg"}, {"rating": 4.0, "review": "Really like the capabilities, but I am seriously thinking about hacking it. You have to wait for Apple to get new apps. So, no Amazon Prime videos, which is weird they have Netflix and Hulu Plus. Oddly you get no notifications when they put a new app up. Hulu just showed up one day. Kind of limiting, thinking about getting Boxee or something similar.", "verified": true, "helpfulness": "1/1", "author": "Pingthis \"Pingthis\""}, {"rating": 4.0, "review": "All Apple products are of top notch quality.  It is surprisingly small and compact.  Works perfectly and is not another ugly device.", "verified": true, "helpfulness": "0/0", "author": "John Chuchman \"poetman\""}]