[{"rating": 4.0, "review": "I like it.my favorite thing about the Apple TV is that there are many tv shows and shows that I like.", "verified": true, "helpfulness": "0/0", "author": "XIN HONG CHEN"}, {"rating": 5.0, "review": "We liked our ROKU and love our Apple TVs.This is our second (first was only 720i). The 1080p of this allows Netflix's SuperHD to show the pores on the noses and hair in their ears (OK so that's not as pretty it's cracked up to be).Quicker and smoother than the older model, and we love being able to stream the pics from our iPhone, iPad to it to stir up memories. Heck, even other people's pictures from their iPhones as well!And we travel quite a bit, so we often steam the movies we purchased on it to the iPad when in remote locations - to the RV and Hotel rooms.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"LJguitar\""}, {"rating": 3.0, "review": "The apple TV is extremely easy to set up, but what I didn't like is the fact that everything is through airplay. I run on my treadmill and I liked the idea of being able to keep my iphone by me in case I got a call (so I could see who was calling) instead of having it connected away from me at the TV with the HDMI cable. Also, since I run on the treadmill and it's noisy I listen to the videos on my iphone with blu tooth headphones. Now with the hdmi adapter I can have the video go out through the cable and have the audio sent to my blu tooth headphones. With the apple TV it is all or nothing. If you send the video to the tv you have to send the audio there as well. And if you send the audio to the blu tooth the tv will remain blank.I see this as such an easy fix, but for some reason apple will not allow you to split the audio and video outs.", "verified": true, "helpfulness": "0/1", "author": "J. Etter"}, {"rating": 5.0, "review": "My favorite feature is being able to use AirPlay from my iPhone.  AirPlay allows me to stream what I'm seeing on my phone to my TV.  This is pretty handy if you own an iPhone.  If you don't own other Apple products to use AirPlay with then there are other streaming devices that will get the job done.  If you love Apple products, Apple TV doesn't disappoint.", "verified": true, "helpfulness": "1/1", "author": "Erik K. Hill \"international traveller\""}, {"rating": 5.0, "review": "Apple does not make any bad products in my opinion and I have always been happy with my purchases...I have one at home now, one that I take on the road with me when I travel and one at my in-laws...you cannot beat the price on amazon!", "verified": true, "helpfulness": "0/1", "author": "mark graydon"}, {"rating": 5.0, "review": "Easy to use and easy to install.  I recommend because it's a great productAccessing Netflix account was quick and easy", "verified": true, "helpfulness": "1/1", "author": "Kelly Turnage"}, {"rating": 4.0, "review": "This is a must-have device especially if you have kids.  I love being able to pull up good programming without having to pay for cable TV.  I have an older LCD TV that has DVI input instead of HDMI.  Just use a HDMI to DVI cable and you're set (although with DVI the audio will need to be routed separately from the AppleTV's TOSlink to your TV, receiver, or DAC.Only problem is that darn PBS activation.  We activate, then it forgets.  Then it won't see that it's been activated.We enjoy it a lot nonetheless.", "verified": true, "helpfulness": "0/0", "author": "J. Rutirasiri \"goldenpiggy\""}, {"rating": 5.0, "review": "Saves you a ton of money from having to buy a Smart Tv. I couldn't think of a day where I don't use it.", "verified": false, "helpfulness": "1/1", "author": "Mac"}, {"rating": 5.0, "review": "My brother-in-law loves it -- psyched to finally get it and be able to use it.  We don't have it at our house, but he loves his!", "verified": true, "helpfulness": "0/2", "author": "lunacoyo"}, {"rating": 5.0, "review": "This item was slightly less in price at Amazon. It arrived quickly and works great. We have a Apple laptop and iPad so this is a great addition for intertwinement options.", "verified": true, "helpfulness": "1/1", "author": "Barbara"}]