[{"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Hansel Santana/075118"}, {"rating": 2.0, "review": "A bit outdated compare to other products in the market.", "verified": true, "helpfulness": "0/0", "author": "J. Avital"}, {"rating": 5.0, "review": "Gave it to my girlfriend for her birthday. She loves it.", "verified": true, "helpfulness": "0/0", "author": "Dave Kepple"}, {"rating": 4.0, "review": "The Apple TV device works as advertised.  It was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Wayne W. Painter"}, {"rating": 5.0, "review": "The best buy ever!!!", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "It was really easy to hook up! Loved that you could use iPhone or iPad to make set up faster!", "verified": true, "helpfulness": "0/0", "author": "Kristina Renee"}, {"rating": 4.0, "review": "bien", "verified": true, "helpfulness": "0/1", "author": "alexv78"}, {"rating": 2.0, "review": "Amazon Prime Video = BANNEDGoogle Play Video = BANNEDRather than compete in a vendor neutral free-market Apple TV simply bans the competition from allowing their streaming video on Apple TV.  Pretty shady but seems to be norm among these services, better lug your laptop to the living room and use Airplay if you want to watch something that Apple bans.Not only is it up to x3's more expensive than competing players but it forces you to buy the iTunes version of movies etc..NO... and Amazon just happens to be a competitor with Apple, gee I wonder why the app just happens to not exist on Apple TV... Cough Cough Wink Nudge.. Could be Amazon or Apple reluctant to cooperate and allow their apps on the competitors player. My guess is that it's Apple since I don't see a Google Play option either.This is a MAJOR let down because I paid more for the Apple TV than the 2 top competitors streaming devices Google Fire and Google Chromecast put together, yet I can't play Amazon videos.At least let me play my Amazon content that I paid for, if I have to buy it on the browser that's fine but I want to watch my prime shows and movies that I've already paid for.I don't mind paying more for an Apple product but don't play these dirty games to limit your competition.", "verified": false, "helpfulness": "0/2", "author": "My Pen Name"}, {"rating": 5.0, "review": "What a great divice you have to love apple, purchased with a great deal price, installed in the living room and now the entire family enjoy it in a daily basis.", "verified": true, "helpfulness": "0/1", "author": "M&M.;"}, {"rating": 5.0, "review": "Honestly worth every penny, and then some.", "verified": true, "helpfulness": "0/1", "author": "Stephanie"}]