[{"rating": 1.0, "review": "I am on my third Apple TV.  Apple 1st gen was OK.  2nd ten ATV has died after 15 months.  No recourse.  I bought a new one APT 2nd gen and it died after 16 moths.  I own a lot of Apple products, but I have never experienced such poor quality before.  Is it just me ???", "verified": false, "helpfulness": "6/21", "author": "Tchuban \"Photo Fan\""}, {"rating": 5.0, "review": "I got ATV 3 after getting rid of horrible D Link DHD 131 and I could not be happier. Biggest negative about ATV was the lack of apps ,well they just added hulu app yesterday and launch of amazon videos app on iPad makes me beleive that amazon video app will follow suit. As far as the graphics and streaming quality goes its top notch. I use my laptop as server and stream all my music (including FLAC files) using audiogalaxy app which works very well. Same for all the movies in different formats (.mkv, Divx etc) works great with online conversion. Those are two great things (besides obvious airplay etc) that i like about apple tv. I have my entie music library availabe to me without actually storing any music on iPad and i stream it to my Home Theater System..Would definately recommed this product over roku , D Link (not even close) .", "verified": true, "helpfulness": "1/1", "author": "AZB"}, {"rating": 5.0, "review": "I have always known the benefits and the simple beauty of design in Apple products, but because I work in the IT world, I've been tied to the anything-but-apple environment. Ironically, at home, it was my kids who convinced me to go Apple. We now have Iphones, Ipads, Ipods, Imacs ... and now the Apple TV.  Like all of those products named above, it is simple, well designed and full of features. As most of the reviewers have noted, if you are tied to the Apple world, the TV is an essential part. I also signed up for iMatch in which I have uploaded all of my CD's and \"legalized (or matched) all of my Napster-downloaded songs (most of which I had in one media form or another anyway). iMatch is a beautiful solution to the problem of where to organize all of your media, and the Apple TV makes your TV a view to the cloud. I'm sold!", "verified": false, "helpfulness": "3/3", "author": "Bill"}, {"rating": 5.0, "review": "It's a incredible gadget... It improve the way that you can enjoy your tv and contents... I recommend for the people that love apple", "verified": true, "helpfulness": "1/2", "author": "Dayver Fonseca"}, {"rating": 5.0, "review": "The newest version of the Apple TV is a wonderful piece of hardware.  It is a beauty in every detail.  I have a WDTV, a Roku and Apple TV.  The WDTV is the older version which doesn't support streaming, only your own content, so it is not comparable to the other two.Both system can be controlled with an App if you cannot find the remote that came with it.  They have great WiFi reception (I don't have any problem with interruptions, only very few occasions),  but this really depends on location and house construction.  Netflix is my primary source for both players.Here are the comparison:Apple TV:- 1080P- wondeful interface, easy navigation.  I love the similar movies suggestions.  Searching is a lot easier.- Airplay mirroring, for those with an iPad2/3 or 4S, this is a biggie- YouTube and Hulu- great construction, fine in every detail- aluminum remoteRoku LT:- smaller and lighter, easier to transport- Amazon Video on demand.  (but AVD now plays on iPads.  Will AppleTV be next?)- some form of Facebook functionality. I enjoy watching friends' videos on Roku.- separate analog audio out, I can play it to my multimedia Epson projector with a separate line feeding the home theater speaker system (a pair of Bluetooth Creative Zii and Bluetooth subwoofers).  Apple TV is HDMI with optical/Toslink.  Toslink is not very common with smaller portable devices like a multimedia projectors.- open to more contents, unless you jailbreak the Apple TV.", "verified": false, "helpfulness": "1/1", "author": "Nuknuk"}, {"rating": 5.0, "review": "i am very happy with this beyond amazing  picture and the airplay just amazing for anyone who can really understand how to use your mac product a must add on", "verified": true, "helpfulness": "0/0", "author": "skinhead jr"}, {"rating": 5.0, "review": "We love the Apple TV 3rd Generation! It is really cool and the 1080 progressive really adds to the quality of the picture.  If your TV is 1080 then this is definitely the one you want to get.We found one or two little tricks to improve our experience with the Apple TV. At first we thought the Apple was bust because it would cut off streaming in the  middle of a song or a movie. However, through trial and error we realized that the fault was on our end and not on the Apple. The Apple streaming box that you hook to your TV has to have an unblocked path from your Router. If you are using wi-fi, this is very important because the signal will be dropped. Objects such as chairs, mugs, or anything else can not be in front of the Router or the Apple box.  Then the signal is flawless!Watch Matt's review on the Apple TV and some of the features this product offers!", "verified": true, "helpfulness": "7/11", "author": "M. Marcus \"Matt & Tracey\""}, {"rating": 1.0, "review": "This is great if you want to do netflix and basic web app stuff but if youre buying this for the airplay mirroring features say far far away. I upgraded to Mountain lion and purchased this apple tv to have wireless mirroring of my macbook pro screen and it DOES NOT work well. And before you ask yes, it was set up right. I've been in networking IT for 7 years and i can set it up. The fact is apple dropped the ball on the software to do airplay.", "verified": true, "helpfulness": "3/15", "author": "Alex Brown \"Alex  Brown\""}, {"rating": 3.0, "review": "Wish apple would raise the price by a few dollars and include the necessary HDMI cable.  I didn't see the fine print anywhere that says the cable necessary for hookup is not included.  Totally annoying.", "verified": false, "helpfulness": "1/11", "author": "Lisa \"Lisa\""}, {"rating": 5.0, "review": "I have had this incarnation of Steve Jobs hobby product since it went on the market. It has been an improvement over the past version mainly because it can display in 1080p rather than just 720p. For those uninitiated into the mathematic of pixels, 1080p offers twice the resolution of 720p. And that increase was why I added the new model to my home.My Roku 2 XS 1080p Streaming Player also offered 1080p and unlike Apple TV offers Amazon Prime Instant Video as a channel. Why then has my Apple TV suddenly jumped out front?The answer is Mountain Lion a/k/a OSX 10.8.Mountain Lion has a feature called AirPlay mirroring which streams anything on your Mac to your Apple TV. Anything means anything-movies, documents, web sites. At 1080p the resolution is amazing. Your big screen LCD will suddenly become the biggest monitor in the world. And since Amazon Instant Video plays on a Mac. that Amazon content is now available.Now is the time to buy the 1080p Apple TV!", "verified": false, "helpfulness": "105/129", "author": "G. Ware Cornell Jr. \"anotherlawyer\""}]