[{"rating": 2.0, "review": "I have both a Roku and Apple TV, and barely use the Apple TV. You can get a \"basic\" Roku that performs better as a streaming device with more channels for half the price. I you want to stream your personal movie library (which is what I use streaming devices for), you can use Plex with Roku, but have to hack the Apple TV to use Plex. Don't even bother streaming movies from iTunes; it takes 10 minutes just to buffer the movie before it can start playing.Where the Apple TV excels over Roku, is if you want to stream your Apple computer, iPhone, iPad to your TV via Air Server.I have all Apple devices and usually stay within the apple ecosystem for ease of use purposes. But the Apple TV is probably the one Apple product I do not prefer to use.", "verified": false, "helpfulness": "0/0", "author": "Brad P."}, {"rating": 1.0, "review": "I had a moment of weakness and bought an apple product. Won't work with older HDMI inputs. Won't work with Sling TV. Won't work with Xfinity. Won't even profile your content request on multiple apps (roku will tell you all the apps that offer your specific program and tell you the cost on each platform). Gee, this thing isn't worth a dime. I gave it away and bought a roku 3 within 2 weeks. Junk!", "verified": true, "helpfulness": "0/3", "author": "chris D"}, {"rating": 5.0, "review": "Works great, like all apple new generation products", "verified": true, "helpfulness": "1/1", "author": "francisco jose ramirez p"}, {"rating": 5.0, "review": "good~", "verified": true, "helpfulness": "0/1", "author": "rootlim"}, {"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/1", "author": "Ned Stribling"}, {"rating": 5.0, "review": "beautiful product, fast shipping, great price!! the only problem ive had is the center button on my remote, after 2 weeks, does not \"click\" anymore and i have to press it hard to make it work. other then that i am very happy!", "verified": true, "helpfulness": "0/0", "author": "Matthew Stahl"}, {"rating": 5.0, "review": "Use it all the time.", "verified": true, "helpfulness": "0/1", "author": "Terri"}, {"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Etelka Vadas \"Maya\""}, {"rating": 4.0, "review": "Met goals.  Easy set up and movement of apps.  Fairly easy setup of cable company apps.  Apple needs to open remote control language to make iPhone control with progrmmed apps easier to control  Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Richard Stein"}, {"rating": 5.0, "review": "We got this to hook up to a projector. It is working fine for that, we have a pretty old projector so we had to get an adaptor vga to hdmi or something, I can't remember. Also, in order for the volume to work it's optical audio, we did not need an adapter for that, fortunately our amp had the correct hookup, but be aware in case you have an older amp that you may need an adapter. It was easy to set up, it connects to our computer really well. I like the parental controls it has in place. It is just what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Rachael McKEnzie"}]