[{"rating": 5.0, "review": "I bought the apple tv for my son for his birthday! I am not sure how this works but I believe you can view your computer on tv? and also watch shows on tv from the internet.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 4.0, "review": "You get a lot of features for $100 here if you own all mac products. The missing star here is the technical limitations for more experienced users and a far too simplified interface.And for all you non-geeks, make sure you read up on what you can and can not airplay. Far too many people buy this device thinking they are going to airplay NFL games or HBOGO. Not the case. I knew this before purchase, but it seems many people did not.Mac people, you'll want to look into buying an app for your computer called AirParrot. Solvs a huge second screen/mirroring issue.", "verified": true, "helpfulness": "1/1", "author": "Eric Celedonia"}, {"rating": 4.0, "review": "Recently I purchased this unit to be able to use the share function between the new devices.  I currently have the older 160GB Apple TV with the hard drive.  This one is small and sleek and doesn't seem to use as much energy as the prior one.  I did notice when using uTube and watching trailers that it was a bit sluggish compared to the older one I have.  I'm going to give it a few more try's and update.  I only took away one star due to the sluggishness and having to sometime wait for a Trailer to download.  in the past, I didn't have to wait as long.", "verified": true, "helpfulness": "0/0", "author": "Zeus"}, {"rating": 5.0, "review": "It is perfect that I want and for that price much better. The delivere was faster and espected. It recommended for people that have apple article.", "verified": true, "helpfulness": "0/0", "author": "JOSE TRINIDAD"}, {"rating": 5.0, "review": "super nice. bought it so i wouldn't need to sit at my computer all the time to watch a movie, and hate cable b/c I can never find a show to watch.", "verified": true, "helpfulness": "0/0", "author": "Stephen Sudholt"}, {"rating": 5.0, "review": "Perfect gift to a lover of technology, easy to use for a non-techy too! :) Would definitely recommend to a friend!", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "We already own one of these and are purchasing one for our son, it's so nice not dealing with cords when watching movies, or since we have a sound bar we even listen to music simply and easy to do.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Carol Robinson"}, {"rating": 5.0, "review": "I had the last version of this, the 720P version. This new version has a faster processor, and I could tell with streaming from my computer or my iPad. Works much better. Also a great plus having access to all my 1080P videos and TV subscriptions. Well worth the upgrade.", "verified": true, "helpfulness": "0/0", "author": "R. Madden \"Russ\""}, {"rating": 3.0, "review": "I purchased this so I could watch Netflix and Hulu Plus on our newly-purchased 55\" LED/LCD TV.  Little did I realize I probably didn't need it after all, as most late model TVs these days already have these same apps/WiFi built in.  Not so bad, considering the price.  Also the owner of several iPhones, iPads, and MacBook Pros, Apple TV does allow seamless streaming of content right from your Apple devices, so easier to share stuff on your big screen with effortless setup and implementation.Recommend if you have several Apple devices and want to avoid incompatibility between those and your TV.  Don't need this if you own Android-based or PC-based devices as it will do nothing for you...not compatible.  Only reason to purchase if you are Android/PC is if you don't have a TV that is has these same content apps (NetFlix, YouTube, HuluPlus, etc.) already built in to the TV.", "verified": true, "helpfulness": "1/2", "author": "J. E. Dimacali \"JED\""}, {"rating": 5.0, "review": "perfect for apple fans who have everything apple.The air play is awesome to use, either from a mac, a iphone or a ipad.", "verified": true, "helpfulness": "0/0", "author": "niu xiaoxu"}]