[{"rating": 5.0, "review": "As per my expectation, happy with price and enjoyed it well so far. Packing was good too! It was good!", "verified": true, "helpfulness": "0/0", "author": "Anil Patro P"}, {"rating": 4.0, "review": "It was a gift that was a \"must have\" and it's never been used. I'm sure it will be great if it ever comes out of the box", "verified": true, "helpfulness": "2/10", "author": "Jodi Orr"}, {"rating": 5.0, "review": "I have two of these now. One for the kids TV and one for my TV. I have another Blu-Ray player that utilizes WiFi for streaming Netflix or HULU Plus that is just plain inferior to the AppleTV. Not just the navigation, but the actual speed of streaming and drop-outs are awful on the DVD player. If you use any Apple devices, like an iPhone, Mac or iPad, the AppleTV is the way to go! Airplay works seamlessly and you can control it with the Remote App for iPhone/iPad and iPodTouch.", "verified": true, "helpfulness": "0/0", "author": "R. Darst"}, {"rating": 5.0, "review": "We especially enjoy the TV shows minus the advertising and the podcasts and music stations on radio. Very pleased with our choice to purchase the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Joyce Powell"}, {"rating": 5.0, "review": "Convert your tv in a media center easily. The instalation and configuration is easy, This is a product very useful for the entertainment.", "verified": true, "helpfulness": "0/0", "author": "ingequinpi"}, {"rating": 5.0, "review": "This little box is very easy to install  and easy to use.  We have two of them.  We use it primarily for streaming Netflix, but it is easy to purchase current movies and TV shows, too.  Also, the Smithsonian Channel is free and has many documentaries.", "verified": true, "helpfulness": "0/0", "author": "Barbara M. Molinari \"Barb\""}, {"rating": 5.0, "review": "There is no comparison to the ease of use of this device compared to a Samsung Smart TV and the cost is less than the premium for the Smart TV. Setup is a snap, you can use your phone or iPad as a remote, and the software has Apple's trademark ease of use and sharp design. Save money by getting the dumb TV and plugging this nifty little unit into it. As a side note, the Amazon app has now been updated so you can stream Amazon video through Apple TV using your Iphone, IPad, or Mac . This is a nice addition to the built in apps for Netflix, HBO Go, ESPN, Hulu, Disney, and quite a few others.", "verified": true, "helpfulness": "4/4", "author": "Terry S. \"I'm a private investor with an affinity for a good spy story, mystery, or thriller. WWII Biography or History also appeals greatly.\""}, {"rating": 5.0, "review": "Works very very well! I Have always wanted an apple tv, i am not disappointed at all. Made my day!", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "The Apple TV works great! I love that I can hook my ipad up to it and stream videos along with my music!!", "verified": false, "helpfulness": "0/0", "author": "Mr. Alba \"Carlos\""}, {"rating": 5.0, "review": "There are other cheaper options, but this is the only thing that lets you have easy iphone/ipad tv output. It has some built in video apps, and if you have an iphone for the tv output, there's alot of possibilities.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]