[{"rating": 3.0, "review": "We love it!But the remote is soooooo small. It gets lost all the time.  My toddler loves to grab it and hide it. Had to buy a replacement remote for $25.  But the product works great (and even the replacement remote works great... just take out of box, point, and it works.)", "verified": true, "helpfulness": "0/0", "author": "LACbuyer"}, {"rating": 5.0, "review": "We love our Apple TV!  Super easy to set up, as with most Apple items, pretty much plug and play.  I have an external hard drive I copied all of our movies onto and we use our Apple TV rather than shuffling around DVD's.  With a 3 year old that constantly wants one of her disney movies playing this sure does simplify my world!  My DVD boxes are all put away in the closet, DVD player hardly gets used.  I haven't really tried a lot of the other functions (Netflix etc.), but it does exactly what I bought it for.", "verified": true, "helpfulness": "0/0", "author": "Ultimate Amazon Mom"}, {"rating": 5.0, "review": "The AppleTV is a great buy for those families that have a lot of Apple products. We love it and would gladly recommend it.", "verified": false, "helpfulness": "0/0", "author": "zachary fregoe"}, {"rating": 5.0, "review": "Works great! I can watch movies from Netflix and more content from youtobe and others. Moreover, you can watch some of your comcast channels.", "verified": true, "helpfulness": "0/0", "author": "yesenia"}, {"rating": 5.0, "review": "Thank you apple my kids can watch cartoon that I choose from youtube", "verified": true, "helpfulness": "0/0", "author": "Majed B. Bahabry"}, {"rating": 5.0, "review": "I have had several AppleTVs and they are a seriously excellent way to get content.  If you have a lot of iTunes content already, they are even better.  Only drawback is no access to Vudu or Amazon.", "verified": true, "helpfulness": "0/0", "author": "T. Scot \"Mama Scot\""}, {"rating": 5.0, "review": "Well my girlfriend and I love Apple TV so this is our second purchase. We got one for the living room then got really tired of moving it into the bedroom so... we got a second. If you are tired of paying a ridiculous amount of money for a s*** ton of channels that you never watch this may be for you. Apple TV provides fairly inexpensive access to all the various TV shows and movies that we want. Its about $16 a month for hulu and netflix then whatever we spend on iTunes renting movies. For us it comes out to much less than the easily $100 plus that we were paying xfinity for a bunch of annoying channels we never watched. If you are the type of person who likes to watch every brain melting tv show out there and can't handle having a few moments of quite while you pick out your next show or movie then maybe steer clear... I dunno, just get one anyway", "verified": true, "helpfulness": "0/0", "author": "Foxtrot87"}, {"rating": 1.0, "review": "This product was a HUGE disappointment.  I had ordered a Chrome cast and it worked better because I can multi-task on the ipad while streaming and the Apple TV you cant.  Epic FAIL!", "verified": true, "helpfulness": "1/3", "author": "Jackie"}, {"rating": 4.0, "review": "If apple were to incorporate this device to include a DVD player, it would be the end all, be all solution for home entertainment.  Unfortunately I have to maintain a blu ray player in additoin to the Apple TV unit to have the best of both worlds.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "We love this. We choose not to have cable and this is the perfect amount of tv for us. I have noticed updates coming through over the last week or so. That's a nice touch. The remote is TINY. We are always losing it. But other than that we do love the Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Kristen D"}]