[{"rating": 5.0, "review": "I purchased the newest AppleTV a week after canceling my DirecTV service. I was paying $90 a month for what was basically HD basic cable with a few extra channels thrown in, in one room with a DVR and now I'll never need to go back.My job has me working both day and evening hours, so I basically only watched the news, the Red Sox, and The Walking Dead. I decided it was just not worth spending close to $100 a month for the few things I watched. A also pay for Netflix and Hulu+ on top of that.With the AppleTV I only pay for what I want to watch, a la carte style.What I can't watch on Netflix or Hulu I can pay for through the Apple TV and stream. While the AppleTV doesn't have a native Hulu app I can watch that on my PS3 or Xbox360, or if I want to show off, mirror the app from my iPad or iPhone 4S.Using the CNN app on my iPad I can watch the news live and mirrored wirelessly to the AppleTV. The only thing I'm missing is the Sox, which are blacked out on MLB.TV since I live close to Boston.", "verified": false, "helpfulness": "23/28", "author": "J&P Robinson \"Jared Robinson\""}, {"rating": 4.0, "review": "I tried to not get this for 2 years by using the following options.Pogoplug for Media storageBoxeeMac Mini Power PC 1GB RAM as HTPC running XBMCIn the end nothing was seamless and was ridden with high geek factor for ease of use and biggest downside the lack of playlist organization in enabling non-tech folks to use it easily.Once the new Apple TV was released even the lack of 1080p was not longer issue [Online content does not matter much for lacking 1080p] but lot of my home Media content from my camcorder is 1080p and did not want to lose it's resolution [Yes I can see the difference on my TV, though web claims 720p and 1080p are not distinguishable... not for me since I do not sit 25 feet from my TV...].Advantages:a) Use my iphone to figure out what I want to see [from either itunes, pogoplug, NAS with app, Online content] and just choose airplay..... This is no learning needed for folks using these and so problem solved.b) Natively on Apple TV you can access any content shared from a itunes client on any machine. Again I have a MAcbook that is always on serving the itunes for iphones and ipads sync and so this is not new requirement for me. So works great with it.c) The UI for netflix and youtube are much simpler and refined than other devices including Roku which I tried in another place.One thing to do however is in settings menu for playlists by defualt it would only show music play-lists. With this I felt stumped when none of my video play-lists in itunes was seen forcing me to browse the long list of videos.... But turning this option to show all play lists fixed this and now it works like a charm.If you already have itunes as your work-flow this is a great option. Otherwise options can be there like DLNA players which can connect to your NAS, but UI is not that good and not for non-geeks usually.Why 4 stars.... Some things like Flickr and other options are very rudimentary to useless and slow. I hope there is a fix for flickr since that is one another place I have tons of photos already uplaoded and want to use that.", "verified": true, "helpfulness": "0/0", "author": "reviewag"}, {"rating": 5.0, "review": "Apple product, apple quality.  Love it.  For those of you non-techies like me, it gives me access to Netflix on my large screen TV.  Lots of other accesses also, but I have only used Netflix and it is great for the Netflix $8 a month service.  The little remote control is hard to not lose, and it is so simple you might think it won't do what is needed, but it does.  God bless Apple minds who create this stuff :-)", "verified": true, "helpfulness": "0/0", "author": "pjbb"}, {"rating": 4.0, "review": "After trying both versions of the apple tv 2 and 3. I can say if you don't really need 1080p then there's really no need to get the newer version. Only a few sources at this point are 1080p. The iTunes store is the main source where you will greatly benefit from the 1080p. There are quite a few tv shows and movies in 1080p in the iTunes store to rent or buy. If your buying this device for 1080p on Netflix then there still aren't that many movies or tv shows. Also it's very hard to find which ones are 1080p.  Unlike the iTunes store which has icons for HD which means 720p and other icons for 1080p. The Netflix app only has icons for standard definition and HD. From my experience Netflix streaming had very bad picture quality.  The picture seemed to be artifacted and pixelated even with HD content. I had no issues with same content on my apple tv 2 or any of my other netlix devices on my 32mbps connection. I'm guessing that my apple tv 3 was defective as I haven't heard complaints of my issues. There are many threads on macrumor forums and apple discussions forums about the same issue. From my experience the picture quality was only bad on Netflix. Regardless of my issues I still feel the apple tv 3 is not up to par with other streaming devices.  Just about any streaming device (gaming consoles, blu ray players and media boxes) offer many more options in terms of services). In addition alot of them are cheaper or at the same price of the apple tv3. The newer apple tv does has have a faster processor and more RAM than the previous version. The only way to get apps and more streaming services on your apple tv 3 is to use air play with either an iPad , iPhone or iPod touch. At this point there is no jailbreak available on the apple tv 3. I didn't notice a difference in performance on the newer apple tv 3. Also I personally didn't notice a difference in picture quality between my apple tv 2 and 3. If you already have an apple tv 2 then I don't think you need to upgrade to the newer one. Also if you are considering an apple tv at this time and don't have tv that is 46 inches or larger I would strongly recommend looking at getting a refurbished apple tv 2 for $69 directly from appple. I decided the return my apple tv 3 and just get the refurbished older model. It's cheaper, easier to jailbreak and still has the great features and interface.I still find the aplle tv 3 overpriced when compared to other streaming devices that it competes with. But for the air play functionality alone it makes a great accessory for the iPad , iPhone and iPod touch. Also the netlix interface is far suporior to any other device I've tried.", "verified": false, "helpfulness": "3/3", "author": "AK529"}, {"rating": 4.0, "review": "I received this on the weekend and set it up on Sunday. It was up in under 10 minutes. I was able to see my MacBook Air's iTunes library fine and was able to use Airplay streaming. Most importantly I was able to play YouTube videos in beautiful HD very nicely.Downsides: Typing in passwords is worse than any system I've tried including PS3 and ROKU. It's twitchy with the pretty but annoyingly imprecise remote control and it's prone to typing phantom characters (which with a password which hides what you typed is maddening). Surely there is a better solution (bluetooth keyboard?). Also the selection of movies and TV shows and the prices won't cause me to rent many. I like the movie trailers but they need a lot more selection. If I'm going to pay through the nose here at least let me find what I'm looking for. Of the newish movies I searched for, none were there. I know that is just me, but it demonstrates how far they have to go. I get better hits in Netflix and their selection is pretty poor as well.Upsides: Youtube! And movie trailers. And EASY setup. And great industrial design (except for the remote). Streaming from my IOS devices (and eventually my computers).Please Apple -- fix the remote or at least give us an option to display what we're typing with passwords. Let us connect a bluetooth keyboard or provide another option (maybe there is one I don't know yet).  Add more movies and TV shows.", "verified": false, "helpfulness": "1/2", "author": "David W. Griffin"}, {"rating": 1.0, "review": "If you have an early Apple TV and plan to continue using it once you purchase this newer model, think again.  The latest version of iTunes makes that option impossible. The older Apple TV also stored the content on the device, while the new one does not, which can make it quite slow and you also have to keep your computer running in order to use it.  We contacted Apple with some of the problems that we encountered trying to use two devices and they said that they couldn't help us without a fee of $49.95 PER time and that they couldn't guarantee one session would resolve the problem.  We've also had problems with music just stopping and having to turn the Home Share option off and back on for no apparent reason.  We LOVED the old Apple TV, but I think this one is a pile of CRAP.", "verified": false, "helpfulness": "10/28", "author": "OhioMom"}, {"rating": 5.0, "review": "this apple tv 3rd generation is fully accessible to the blindwith voice over.unlike most other devices that offer netflix with no accessibility at all.your tv has to have a hdmi input connection. there is no andalog connections.it does not come with the hdmi or digital audio cable. so you have to buy them from a third party seller.it is easy to connect. the power and hdmi connection. and your ethernet cable if you are not going to use wy-fi.that's it!the voice over is slow to respond though.when you first plug it in wait about 30 seconds for it to start talking.(it does not have a power switch. but does go into stand by mode).it should tell you to press the small button on the right side three times to turn voice over on.from then on everything is accessible. you can turn voice over off in the settings menu.it speaks all of the menus and icons.all the movie descriptions and catagories speakthe first thing you have to do is setup your wy-fi connection and log into your netflix account. it remembers your i d and password even if you unplug the apple tv.most movies load in about 10 seconds.i tunes is not very good. when you rent a movie it takes about 15 minutes to load the movie before it will play.my only complaint is it does not have a keyboard for searching. you have to cycle the letters and numbers with the 4 way joystick? buttons. but it does speak the on screen keyboard as you go through it.it is not a qwerty keyboard.it has 5 rows of 6 lettersa to f, g to l, ,m to r, s to xy to z,1 to 45 to 0delete,clear, .com, .net. (you do not have to type these in.)if you want to save internet bandwith you can set the apple tv screen resolution to as low as 480 or as high as 1080p resolution in the settings menu. also accessible.do the same in your netflix account if you have one.", "verified": true, "helpfulness": "1/3", "author": "E sweeney"}, {"rating": 4.0, "review": "When I preordered my new iPad from Apple, I also got this to test the AirPlay. I read most of the reviews beforehand, and I was aware about all the shortcomings of ATV. My original thought was, even if I didn't like it, I can always jailbreak and install third party software on it.Connectivity and Netflix:It did not have any surprises, and the whole installation finished in 10-15 minutes--including wireless setup. I have a long WPA2 password, and that alone took an extra 5 minutes.  It connects to both 2 GHz and 5GHz channels on my Linksys E-4200 router without any problem. I immediately tested Netflix, and I was blown away by the interface, 1080P quality, and streaming speed of 8-12Mbps. I have a Sony BDP-S580 Blu-ray player that I used for streaming from Netflix, but Apple TV simply puts it into shame both in ease of use and speed. For this reason alone, I will keep this Apple TV. They really have thought about the user interface.I could not use the Apple TV to stream from my Synology DS212 NAS. It simply doesn't see the NAS. Synology has a music app that you can use to stream your music on Apple TV, but it doesn't support iTunes Home Sharing. I still could not find a decent way to stream movies from the Synology.Dual Screen (AirPlay) and Photo Stream:The dual screen or AirPlay is not too impressive for me. I like the share feature that you can send any YouTube or other videos to Apple TV, but the dual display is not that useful. Simply because the new iPad has an amazing Retina display that no LCD can come close to it. In addition, the dual display mode only works in 4/3 aspect ratio and not 16/9. Photo Stream works very well between Apple TV, iPhone 4s and the new iPad. I really enjoy this feature, and it uses your own photos as the screen saver.Problems: Only One!I have noticed that this new Apple TV does not support HDMI Control or CEC! I researched and found out that it has been a common problem in all Apple TV generations. Apparently, Apple doesn't like to support this mandatory standard.Conclusion:Considering the price, I will keep this new Apple TV. It is the best device for Netflix, and does a few more extra things. It is reassuring that you can always jailbreak and install third party software on it. At the moment, it doesn't do much with my current home network setup, but I am a satisfied customer. Thank you for reading this mini review.UPDATE (August 2013):It has been about 18 months since I got this ATV 3, and now even my TV has Netflix app. I rarely use this ATV, and since there is no jailbreak for version 3 so it can play XviD or DivX files, I wonder if Apple can keep up with the competition in the long run.", "verified": false, "helpfulness": "56/71", "author": "Simon"}, {"rating": 5.0, "review": "I have a Sony Bravia 32 inch flat screen in my bedroom that I often would use Apple's HDMI enabling cable (Apple $39.99) and physically link my iPad 2, so I could watch movies.  The downside was that my iPad was physically tethered to the tv and I could not read, check email or do anything while watching a movie.After my iPad 3 arrived, I decided to try the Apple TV 3rd Generation.  It took under 5 minutes to set up, both physically to the tv and to the wireless network.  I also downloaded the FREE Remote app from the App Store for the iPad and iPhone, so I can control the Apple TV from my iPad while wirelessly streaming movies.  I am thrilled to be able to read a book while I am watching a movie!  The Apple TV does exactly what I had expected.For those who experience problems make sure your software is up-to-date (on the iPad/iPhone/ATV/iTunes), that you have turned on Home Sharing on ALL devices and that your wireless signal is STRONG.  If all these are a \"yes,\"  then you will love your new ATV and what it can do!Network Specs:  ATV3, iPad3, Airport Extreme, AT&T; U-Verse", "verified": true, "helpfulness": "1/1", "author": "Em"}, {"rating": 3.0, "review": "I just got this and I really would love to know from ANYONE who can help me...  why can't I get Netflix  - at all????  I have a Netflix account and everything else seems to work fine - I can click on Podcasts and see those, youtube works fine... Please help!!", "verified": true, "helpfulness": "1/5", "author": "A. Gershman \"andy\""}]