[{"rating": 5.0, "review": "I wish they supply magnifing glass to read the guide. however was able to set it up without reading. One extra page in guide with larger font will be great help.", "verified": true, "helpfulness": "0/0", "author": "arora"}, {"rating": 3.0, "review": "You have to buy everything to use it.  I got it for airplay compatibility.  Hardly anything in the apple store to see for free.  Quite disappointing when it kills your internet from direct streaming.  I have to download to my mbp or iPad, to save from streaming from anything but the wifi transfer from my machine.  That part is very sad.  Otherwise you just end up feeling like other people have different experience than you.", "verified": true, "helpfulness": "1/1", "author": "Jello"}, {"rating": 2.0, "review": "I'm not that hot on this device.I waited for the 1080p version to come out, and bought when it did.Pros:====Really good picture qualityElegant device - no external power supply, UI is nice to look atWorks well with iTunes on a host PCAirplay from an iPad is kinda neatCons:====Doesn't do much - no prime streaming, no Vudu, for example.  We hardly use it - preferring the Netflix UI on the TV in one room, and a Roku due to more streaming options available in the other room.Remote is almost useless - I use an iPad most of the timeIt had a network issue (I used hard-wired) - which was finally solved by a software update ... that required wireless networking!  Set it up temporarily and it's been fine sinceCan't do much configuring - can't even delete icons for things you don't want to have appear, though you can move them to a lower rowI like the headphone jack on Roku 2 and 3 - nice feature this misses.  I'd imagine it could be done via streaming the sound to an iPadAlso, I'm surprised there's no app store for these, or games using an tablet or phone as controller.Steve", "verified": false, "helpfulness": "1/2", "author": "Steve \"Steve (Walnut Creek, CA, USA)\""}, {"rating": 5.0, "review": "I bought this for my daughter for a Christmas present.  I am sure she will love it.  The versability of this product is awesome.", "verified": true, "helpfulness": "0/1", "author": "Faith S. Whiting"}, {"rating": 5.0, "review": "You'll never say, \" there's nothing on T.V.\" I love this product!!I've got two and cut my cable bill by 1/2.", "verified": true, "helpfulness": "0/0", "author": "Meiling Chiao"}, {"rating": 5.0, "review": "I wanted to flush cable TV.  Apple TV has given me far, far better viewing choices and has saved me over $100 a month in cable fees.  I love Apple TV!  It is also easy to set up and use so I would recommend it to any one, even those who feel intimidated by technology.", "verified": true, "helpfulness": "0/0", "author": "mary huey"}, {"rating": 5.0, "review": "I bought two of them.  Allows me to have one system operate in two rooms.  Better than running wires through condo.", "verified": true, "helpfulness": "0/0", "author": "Joe Roddey"}, {"rating": 5.0, "review": "one of the people on my list has been asking for this but I did not know it did not come with the cord to hook it up..but delivery was fast and no problem in ordering..thanks for the offer...Merry Christmas", "verified": true, "helpfulness": "0/0", "author": "drice"}, {"rating": 4.0, "review": "First I must admit that I support apple products fully and because I do my products work together better than most. We have 3 Mac computers, an apple extreme, 2 iPods, iPads and only iPhones, there is no droid products and the only Microsoft product is loaded on a Mac computer. This Apple TV works flawlessly with the other products and streams more beautifully than our hd cable does. There are limitations though. We purchase music and video from amazon as well as having a prime membership that forces us to watch prime video through another resource (ps3) while we were once able to stream through airplay there have been limitations created that unable both audio and video to seamlessly stream in unison. There has been additions made to the channels that are very helpful. HBO and espn to go are great additions that expand viewing options exponentially and also alleviate DVR needs for me. I would give 5 stars if amazon purchased products worked just as iTunes products do, but unfortunately they do not.", "verified": false, "helpfulness": "2/2", "author": "cocktailconcoctor"}, {"rating": 5.0, "review": "It has to be one of the best products I've bought in a while. I use it almost every day.", "verified": true, "helpfulness": "0/0", "author": "tom reynolds"}]