[{"rating": 5.0, "review": "I'm most happy with the ability to show my Flickr pictures on my large screen TV.  We have had many enjoyable family get-togethers where I can so easily now share and enjoy the pictures that I've taken via Flickr and videos on Youtube.I also enjoy being able to show my iPhone display and Netflix on the TV and play Internet radio channels as well.  I was concerned as to whether the performance over WIFI would work.  Even though I do have a hard wired cat5 cable available from my router upstairs I decided to try the WIFI first.  It works so well I never plugged the cable in.  I highly recommend the Apple TV unit.", "verified": true, "helpfulness": "0/0", "author": "V. Camiolo"}, {"rating": 5.0, "review": "Great item. I bought this as a Christmas gift for my nephew, and he loved it!! I was so happy to find this on Amazon. Very happy with the purchase, and arrived on time.", "verified": true, "helpfulness": "0/0", "author": "Amber9207"}, {"rating": 5.0, "review": "Integrates well with iTunes on the main computer which means any kind of streaming (photos/videoa/music) with in the house is greatNice gateway to streaming  from Internet: acess to apple movies/Netflix/YouTube", "verified": true, "helpfulness": "0/0", "author": "Si"}, {"rating": 4.0, "review": "Fairly easy to use little box here from Apple. Great interface, highly recommended for those people who likes to spice up their TV sets.", "verified": false, "helpfulness": "0/0", "author": "Zulema Cook"}, {"rating": 3.0, "review": "This is a good product. It goes without saying as it is branded as \"Apple\". But as far as utility goes, It is good for those who have an ipad, iphones and other apple products and its just useful for mirroring your other apple devices on your TV. Other than this, i think its not that much useful. There are other products worth 30$ approx available. I have an apple macbook pro but to be able to use apple tv airplay with pro, i am being told to pay $20 to update my OS version to be able to use apple tv which i think is ripping money off you and making you stick to only one brand. I like to be a free bird and I do not think I liked it when it comes to utility but the quality of the product is very good and it does the few jobs its suppose to do preety well.", "verified": true, "helpfulness": "3/4", "author": "Kirti Mandal \"kirti mandal\""}, {"rating": 5.0, "review": "Great product just what i needed to watch all my ios products, ipad, iphone, etc. ive even use it to work on the flat screen", "verified": true, "helpfulness": "0/0", "author": "Milton Ortiz"}, {"rating": 5.0, "review": "I have this hooked up in my living room and its awesome. Being able to share all my media from my desktop without even touching via itunes share is great. Airplay is also a huge benefit to have. Being able to show pictures on your tv from your phone or laptop as well as music and videos is great.", "verified": true, "helpfulness": "0/1", "author": "A Techy Guy"}, {"rating": 5.0, "review": "Works great, very nice user interface with all the apps preloaded (Netflix etc) with great picture quality as expected. Recommended.", "verified": true, "helpfulness": "0/1", "author": "Prashanth \"Prashanth\""}, {"rating": 3.0, "review": "I'm not going to bother summarizing this device. If you dont know what Apple TV is by now, I doubt my review will help the general public.I'll stick to the good, bad and ugly.Good:Slick InterfaceNetflix is a breezeLighting fast streamingEase of setupHBO GO and MAX GO are available through Airplay.Bad:Airplay (I know the Apple fanbase will crucify me on this but here's the reason why)Airplay barely streams anything from your iPhone or iPad- It doesn't stream : VUDU, Cinenow, Amazon Prime, Showtime Anytime, Encore TV, Epix or Starz Play.iTunes is sometimes unavailable, so your \"iCloud\" movies, are unavailable.Not enough out of the box apps on the UIThe Ugly:I think Apple's price point is a little off considering the amount of apps they give you out of the box. A little rip for the Apple loving world if you ask me. I have all things Apple, but in 5 years, who knows. I'd be up for a challenge and healthy tech competition.Overall, its a solid device, yet overpriced, that is still too limited to be considered a real asset to my home theatre.", "verified": false, "helpfulness": "1/2", "author": "Laura Andrews"}, {"rating": 5.0, "review": "No trouble to setup and install.  I've never had a problem with it.  And if you have an iPad, it's simple to watch just about any video on your TV, via the iPad.  It just doesn't get much easier.", "verified": true, "helpfulness": "1/2", "author": "J. Praay"}]