[{"rating": 5.0, "review": "This is the best $99 I have spent on any type of computer product. I stream music to it, movies, anything that is playing on my iPad or iPhone can be sent to it as well. Love it.", "verified": true, "helpfulness": "0/0", "author": "Me"}, {"rating": 5.0, "review": "I got this for my dad for his birthday. This is his favorite accessory in his home and he uses it every day.", "verified": true, "helpfulness": "0/0", "author": "Erin Schlegel"}, {"rating": 4.0, "review": "should have had a sports channel, espn, foxsports etc. and another movie channel like u tube, otherwise it is ok", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "We like having a way to choose from so many good choices to watch and it not cost an arm and a leg. Watching by some other devices are just a rip off!", "verified": true, "helpfulness": "0/0", "author": "Cleona G. Ison"}, {"rating": 5.0, "review": "I already had a Apple TV in my living room, bought this one for the bedroom.I love that I can stream my own movies from my pc wireless to the apple tv, also I enjoy the youtube, netflix, and hbo go apps", "verified": true, "helpfulness": "0/1", "author": "Erik Auberg"}, {"rating": 5.0, "review": "liked the first apple tv my son gave me so much that I bought this for my other tv, they're both great units.", "verified": true, "helpfulness": "0/0", "author": "bombshelterbob"}, {"rating": 5.0, "review": "really love this!!!! have one in every room in the hose and connects with all my other apple electronics.......quick delivery also...", "verified": true, "helpfulness": "0/0", "author": "wkham"}, {"rating": 5.0, "review": "I really like it,  it is a second one that I bought because my son liked it so much that  i bought one for him.", "verified": true, "helpfulness": "0/0", "author": "mashih"}, {"rating": 5.0, "review": "Purchased as a christmas gift for my parents to use with their ipads.  They love it! Simple to use, but also extremely feature-rich, they stream facebook/youtube from their ipads in addition to using netflix and purchasing movies.", "verified": true, "helpfulness": "0/0", "author": "umichwolverine \"J.L.\""}, {"rating": 5.0, "review": "This is my second one, goodbye cable and satellite providers no more dishing out money to them, now I control my viewing choice.", "verified": true, "helpfulness": "0/0", "author": "C. Valderrama"}]