[{"rating": 5.0, "review": "Great price for a brand new Apple TV. We now have 2 .", "verified": true, "helpfulness": "0/0", "author": "Terence M OHeany"}, {"rating": 3.0, "review": "difficult to connect and disconnect from my TV.", "verified": true, "helpfulness": "0/0", "author": "Joan Page-Durante"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/1", "author": "Jose Marcano"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/1", "author": "Farzan"}, {"rating": 5.0, "review": "I love Apple products for their ease of operation.  I ripped all my DVD's, put them on my iMac and along with my music, they all show up on the Apple TV making them nice and handy - along with the streaming TV options - like Showtime - it's a very good quality TV box...especially so if you have other Apple products to stream to your TV - iPhone, iPad, iMac, Macbook...all can stream whatever you have on the screen, to your TV..flawless Apple ease as well.", "verified": true, "helpfulness": "1/1", "author": "D. Veracity \"Mac Guy\""}, {"rating": 5.0, "review": "First let me say I got this as a replacement for a cable box (one of three) that I never used anymore. Instead of paying $9 a month to rent the box, I decided to get an Apple TV for entertainment purposes. Best decision I've made.Apps come pre-installed and can be hidden if you don't use them. While there are services missing, Apple TV provides all my on-demand entertainment needs. Many of the apps require that you sign in using your cable credentials to get full access eg. USA, CNN, FX, Showtime Anytime, HBO Go, Disney etc. Once you do this, the Apple TV really shines.The hardware itself is small and takes up little real estate. Despite being three years old the UI is super smooth. I do get a \"Accessing\" content message that takes three to four seconds to go away but no biggie. Definitely recommend.", "verified": true, "helpfulness": "1/1", "author": "Rick Evans"}, {"rating": 5.0, "review": "perfect, just perfect!", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 1.0, "review": "This is easily the worst piece of hardware I've ever bought.  It constantly resets itself for no reason.  I have downloaded all the updates and nothing has fixed this problem.  Sometimes it goes for days without resetting, other times it reboots every 2 minutes.  It's unusable.If it wasn't for this massive problem, it would be great.  It does everything I want it to (except Amazon Prime streaming) and the mirroring / extension of the desktop from my Macbook is the reason I bought it -- when it's not rebooting, that is.", "verified": true, "helpfulness": "0/1", "author": "Gino A. Lomelino"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "manuel a leal"}, {"rating": 4.0, "review": "It does good job at mirroring from different iOS devices. Hope they will improve the speed of connectivity.", "verified": true, "helpfulness": "0/0", "author": "Ptbhoite"}]