[{"rating": 5.0, "review": "I have 3 at home, I bought the 1st ten and 2nd version that used to be loud, run very HOT. I ended up hacking those models to run other apps as it is a mini linux box and that was fun for awhile.I use it to stream airplay from my iPad, iPhone and MacBooks both video and also music.I have both 720 and 1080p versions while my TV can do 1080p most videos I watch I don't notice too much difference.", "verified": true, "helpfulness": "0/0", "author": "Andover Diver \"Andover Diver\""}, {"rating": 5.0, "review": "tried other streaming devices, they were complicated to set up and didn't work all the time.As with all Apple devices this is simple to set up and operate", "verified": true, "helpfulness": "0/0", "author": "Bobo"}, {"rating": 5.0, "review": "This is my 2nd apple TV, I find the device so easy, intuitive, and useful.  You won't regret getting one of these.  I share my movies on my TV now as a slide show, it is great to easily show your photo stream to friends and family.  Renting movies with a few clicks is one of my favorite uses for Apple TV, and netflix is good too.  This device is the missing link for TVs.", "verified": true, "helpfulness": "0/0", "author": "DER ICEMAN"}, {"rating": 4.0, "review": "Does everything I want except Amazon Prime. Well, maybe I'll find the feature in a future update. It does what it's allowed to very well.", "verified": true, "helpfulness": "0/0", "author": "JAMES WILLIAMS"}, {"rating": 5.0, "review": "So easy to setup and has so many features. We got one for all members of our family as gifts. We stream movies, listen to music and the best part for us is viewing all our iPhone pictures and videos right on the TV. We set up a family photo stream and every member of our family can now share their photos at any time. Now when we turn ours on we go to the photo stream and get to see all the photos the family posted and they get to see our photos. Grandma and grandpa just love it as it's so easy and they get to see new photos of their grand kids as soon as we post them. They love getting new photos almost everyday. The feature I personally like is the ability to mirror the iPhone so when I'm trying to show someone how to do something on their iPhone I can simply turn on the Apple TV, set up mirroring on my phone and then what I do on my iPhone is shown right on the TV screen. For the price you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "D. Wylie \"Big D\""}, {"rating": 5.0, "review": "Works great for us! Can watch netflix and you tube etc. Great unit!  Has Full HDTV video and sound!  Can't believe we did not buy before now highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Shane Boyd"}, {"rating": 5.0, "review": "Apple TV provides a far superior viewing experience than Chromecast. There is no latency between what is projected on the primary device (iPad or Mac) and TV. The pricture quality is excellent and is easy to use. I'd recommend Apple TV over Google's Chromecast", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the airplay. My wife and I use that a lot and netflix is the other one we use. Renting movies off there seems like a waste of time. We rented Cloudy With A Chance of Meatballs 2 and it was $4.99 for 24 hours. Kind of pricy compared to services like redbox and it took about 6 hours to be ready to play in HD using my slower internet connection. We rented Thor from redbox for about a dollar and of course it plays straight away being a DVD. Other than that we love our Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mr. C. R. Child \"Chris\""}, {"rating": 5.0, "review": "I love having the Apple TV especially now they've added access to HBO GO; unfortunately you still need an HBO subscription through your cable company.  Only downside is you cannot watch Amazon video unless you use an iphone or ipad app and use the Airplay feature.  It works but is just a minor pain.  Can listen to the tens of thousands of albums I have in itunes, podcasts, watch Netflix, HBO and several others as well as any of the hundreds of movies I have ripped to itunes.  Also can watch TV or movies on PPV but I haven't used so can't comment.  I now only have basic cable instead of all the bundles and save about $75 a month when all said and done.  Really works well!  Highly recommended.  The roku and other devices are good too, but none of them allow integration with itunes on my apple devices that makes the Apple TV so useful for me.", "verified": false, "helpfulness": "0/0", "author": "Mark Wothe \"that deaf, dumb and blind kid sure plays a mean asteroids\""}, {"rating": 5.0, "review": "I loveu it, it is apple, it works, it is easy to install, it is samll and it is HD", "verified": true, "helpfulness": "0/0", "author": "Louis J Ferraro"}]