[{"rating": 5.0, "review": "Don't know why I didn't purchase this sooner..", "verified": true, "helpfulness": "0/0", "author": "Randys \"Randys\""}, {"rating": 5.0, "review": "love apple product if you don't have one got to get!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Chris Funderburk"}, {"rating": 5.0, "review": "Perfect! Thanks :) !", "verified": true, "helpfulness": "0/0", "author": "Victoria Adriana Merdinger"}, {"rating": 2.0, "review": "Bought an apple TV and amazon fire stick. Fire stick is way better for a fraction of the cost. Not impressed with apple anymore.", "verified": true, "helpfulness": "1/1", "author": "Anon."}, {"rating": 5.0, "review": "I love Apple TV, but I also love Apple products in general.  The screen mirroring function with my iPad is a great feature.  I'd highly recommend Apple TV to anyone thinking about it.", "verified": true, "helpfulness": "0/0", "author": "Zachary Dewitt"}, {"rating": 3.0, "review": "3/21/2015 Update: A new version of hardware is expected soon--no wonder why they've let this version live for so long, as it looks like the engineers have been busy creating a major upgrade.  As I mentioned earlier, this version is slow, the interface is outdated, and possibly won't support new features.  I can't wait to buy the new version.  http://www.dailymail.co.uk/sciencetech/article-3004546/Apple-set-bring-apps-TV-new-set-box-revealed-June-control-home.htmlUpdate: After the Apple announcement of a price cut to $69, it makes this slightly more compelling than $99.  Having the exclusive HBONow service is of little value if you are not a cord cutter and already get it via cable subscription, in which case you can use HBO Go on many platforms.  As for my comment below about this being slow, here is confirmation: http://qz.com/358949/before-you-run-out-and-buy-the-cheaper-apple-tv-with-hbo-read-this/For a home with an Apple ecosystem, having one of these is indispensable.  Note I said one.  Having this attached to an AVR gets you access to podcasts, music, iTunes radio (free Pandora alternative), and apps of course.  Occasionally Apple with have exclusive concerts up for a few months, so you do get content here that you won't find elsewhere.  The slideshow screensaver feature is very intoxicating and customizable, as you can do custom Flickr searches which will update every few days.  If your album art is of low quality, you will probably want to upgrade all those low quality images once you see how they look on your HDTV.For the negative, this thing is slow compared to the generally rapid response from a Roku 3 or a Fire Stick.  I am so sick and tired of seeing the spinning circle to get around music or other apps.  Literally, I often am waiting 15 secs to move from one click to the next, and it is extremely frustrating.  And for an Apple product, navigating deep out of an app to get to another is a tedious series of clicks to get out--I don't understand why the UI has not been improved.  Netflix almost always starts instantly on Roku with degraded quality and quickly improves once cached, whereas there is often a delay on the Apple TV.  Perhaps that has been fixed, but again the device is sluggish in general, so to watch Netflix or Amazon video, I invariably use the Roku attached to the same AVR and have relegated this to the role of playing music or podcasts or iTunes Radio.  The other thing thing that a Roku gives you is the Time Warner app, which for TWC customers gives you the ability to stream any and all TV content with an interface that is as good as, if not better, to that on your cable box.  When Apple TV finally gets that capability, which I've seen mentioned online, that will put these two at parity.  The import of this app is that it allows you to ditch multiple cable boxes, unless you really need multiple DVRs.  While a Roku 3 is roughly the same price as an Apple TV, the Roku streaming stick is generally half the price or less.The other big negative is that you don't get Spotify on Apple TV.  I'm sure there are other apps as well.If you can afford it, you should really own one of these and a Roku or Amazon device, instead of putting multiple Apple TVs around the house.  Not too thrilled about the lack of remote for a Chromecast though.  The Apple TV is really in need of a hardware update and UI refresh.", "verified": true, "helpfulness": "1/1", "author": "Entrope"}, {"rating": 5.0, "review": "It's one of those things you don't know you really need until you start to use it.  I have ATT sevice and Netflix is constantly starting and stoping through my BluRay but when I used it with the Apple TV is was perfect.  It's great to view many of the music videos I haven't seen for the last 30 years like James Brown, Marvin and a what ever you can think of.  Love the ability to mirror my iPad on to the TV.", "verified": true, "helpfulness": "0/0", "author": "The gold \"Biscuit eater\""}, {"rating": 5.0, "review": "This is not my first Apple TV. I like these so much that I'm giving this as a gift!", "verified": true, "helpfulness": "0/0", "author": "C. Molina"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Ditched cable and went with apple TV.  With all my movies on my computer, I'm able to sync the apple TV to my library and \"airplay\" them to the living room. I also like the feature where I can start watching on my phone and send it to the tv.  I haven't had cable in over three years and this fills the gap almost perfectly.", "verified": true, "helpfulness": "0/0", "author": "Shmeg McGee"}]