[{"rating": 5.0, "review": "Super fast delivery. Product arrived as described. Great price!", "verified": true, "helpfulness": "0/0", "author": "Danielle T."}, {"rating": 5.0, "review": "Works like a champ. No problems, really easy to setup. So many things to watch on this Apple TV", "verified": true, "helpfulness": "0/0", "author": "patrick"}, {"rating": 5.0, "review": "ok for the price", "verified": true, "helpfulness": "0/0", "author": "Randall Piedra"}, {"rating": 5.0, "review": "All apple stuff are awsome the best of the best.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 2.0, "review": "The Apply TV works great, looks great and syncs great with my other apple products. The screen saver option was really cool and the iTunes radio is alright, but I prefer Pandora.And that is why I never use it. In fact, I haven't even set it up since I moved almost a year ago. There were only specific apps downloaded to the product and no other apps were available for purchase. Of those apps, a lot of them required a TV subscription or provider log in. A lot of the other apps were obscure Korean TV show channels or very odd channels that I found really pointless. I used the netflix app and that was about it. I think if I had known at the time that I would not be able to download apps I want onto my product, I would have gone with a different TV alternate. Maybe I should plug her in and see if anything has changed, though knowing apple, I doubt anything has.", "verified": false, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Makes TV fun to watch again", "verified": true, "helpfulness": "0/0", "author": "D. Singh \"mguyvr\""}, {"rating": 5.0, "review": "I was bummed to find out that Amazon tv is not an option, so I have to stream from my phone.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Best purchase I have made since amazon prime or netfkix", "verified": true, "helpfulness": "0/0", "author": "Amanda Thompson"}, {"rating": 5.0, "review": "Awesome product my husband loves it. We have one in two rooms in our house now", "verified": true, "helpfulness": "0/0", "author": "shannan twilley"}, {"rating": 5.0, "review": "Use it every day for hours at times.", "verified": true, "helpfulness": "0/0", "author": "Scott"}]