[{"rating": 5.0, "review": "This was a great addition to my other Apple products and I love the AirPlay option but just don't forget that little remote when you travel! It took me forever how to figure out how to set it up without the remote when I went out of town but besides that everything is good. I hope to eventually cut the cable cord and get rid of DirecTV.", "verified": true, "helpfulness": "0/0", "author": "Natalie Boyd"}, {"rating": 5.0, "review": "This is the future right here... and it's only getting better.  If you own any other Apple products or use iTunes, this is a must.", "verified": false, "helpfulness": "0/0", "author": "Michael Albaugh"}, {"rating": 2.0, "review": "There's really not to much good that can be said about this Apple product. The good first: Great design, the unit produces a really good 1080p picture. Now for the not so good: the extremely small, hard to hold remote control- lack of buttons. Entering your wifi password along with your Apple id and password is very difficult with this poorly designed remote. It is anything but fun. The Air Play feature is unstable. It just quits when it wants to. The Mirroring feature works great for your iPad 2,3 or iphone 4s only, until it decides to turn itself off.The app selection is much better now than when the product first came out BUT, if you're looking for free content, you will be disappointed.The bottom line, is that this product only exists to help Apple sell program content from the iTunes Store.Other than Amazon's good price and fast shipping, I really can't say anything else that is positive about Apple TV.", "verified": true, "helpfulness": "0/4", "author": "Frank D"}, {"rating": 5.0, "review": "I was a bit skeptical about purchasing a Apple TV, but I'm glad I did. It's worth paying 100 bucks.", "verified": true, "helpfulness": "0/0", "author": "SS"}, {"rating": 5.0, "review": "I've tried Roku, WDTV, PS3, Xbox, and now this.  Of all of those, this is the best combination of price and functionality.  I needed a quick device to watch iTunes and Netflix.  I would like to see Amazon Prime as well, but that wasn't a deal breaker.  One of the best features though is the AirPlay feature.  It is so easy to share your pictures and videos from an iDevice to the AppleTV.  I even use my Android phone and Windows laptop with software to be able to use the AirPlay mirror feature.  The user interface is just plain easy to navigate and nice to look at, unlike a lot of the other devices which can be confusing and ugly.  You don't have to be an Apple fan to get a lot of use out of this little box!", "verified": true, "helpfulness": "0/0", "author": "J. Patterson"}, {"rating": 2.0, "review": "I have had my apple tv since July/2010.  Here are the things I like-dislike about it:LIKE:- setup is easy- Video resolution is good(we are still on the 720p box)- the remote is built well and has been dropped a LOT without issues.- AirPlay is a nice feature- different options to play movies, I.E. from my computer, netflix etcDISLIKE:- apple movie rentals are TOO expensive.  A B movie from 1985 should not cost $4.99.  A good example is \"re-animator\".  Some use the excuse of \"well it's just convienent to rent from home blah blah\".  Say what you want, but the prices are TOO high and keep customers like myself from renting.  Here is a tip to apple:  If you rent movies at .99 cents(older movies) and I rent 5 a week, that's $4.95.  Now if you keep the prices of those same movies at $4.99 EACH, I personally will not rent anything.  I am also betting a LOT of other customers don't rent because of the same issue.  So you either keep prices the way they are and get ZERO or lower them and get more rentals.  Why would I \"buy\" a movie on there?  Its not a tangible object like real blueray or DVDs.- Netflix - even though it's a separate company, they are attached in apple tv.  I spent over 3 months last year trying to resolve a buffering issue with them.  My cable company pointed the finger at Netflix and vice versa.  Some changes were finally made(they never told me what) and it got better.  BUT..... If I play Netflix from my iPad or Mac, I never get buffer issues.  This lead me to believe the apple tv was giving problems.-  HDCP error -  boy this is annoying.  You go to watch a movie and 4 seconds later it freezes.  A minute later the infamous \"HDCP\" error pops up which makes you reboot apple tv.  I have followed all the suggestions to resolve the issue and still get this error about 2-3 times a week.- TV shows on apple tv - $2.99 a episode?  Yep you read that right, they are $2.99 for ONE 47 minute episode.  I cancelled my cable tv in June 2011 and got a antenna. Now I get 24 HD channels for free.  I don't get discovery channel, or AMC but the savings alone make up for it(was paying $165 a month for cable & Internet), now it's down to $60).- I tunes festival - I'm not sure how that option showed up because it just appeared one day without updates.  Kinda boring.- Hulu plus -  if you have a Netflix subscription, don't bother with Hulu.  Netflix(dare I say it) has a better selection.  We tried Hulu for 4 days and most of the selections were boring or not worth watching.  There was also a HUGE selection of Korean movies.  I personally don't speak Korean, so they are worthless to me.- YouTube is what it is.... Plays videos from YT.- the other options are really boring unless your into basketball or hockey.  And even then, you have to have subscriptions to both.  Can we say nickel and diming here......With the way companies break everything up and \"give you more options\" these days, what it really means is \"we are going to charge everything we can for EACH item\".  Again, see my \"nickel and diming\" comment above.My wife and I are currently looking for a Internet ready TV so we can get rid of the apple TV box.  It's quite sad because we moved ALL of our computers(4 total) from PC to Mac in mid 2010.  Being really happy with the move, we figured apple tv would be awesome.  Needless to say, it's mediocre at best.And don't get me started on the horrible podcast or radio options.......  One word for them:  CRAP!!!!", "verified": false, "helpfulness": "8/11", "author": "Torontobound"}, {"rating": 4.0, "review": "Out of the box, this version of appletv is pretty basic but runs great. The real treat is when the jailbreak is found and you can put XBMC on it. At that point, you can rate this thing 8 stars.", "verified": true, "helpfulness": "0/0", "author": "The Jester II"}, {"rating": 5.0, "review": "Apple tv works exactly how it says.  Works great with my ipad2 and picture quality is exceptional.  Very satisfied with this product and the price is fair.", "verified": true, "helpfulness": "0/0", "author": "Werts1980"}, {"rating": 5.0, "review": "This product is working great. Easy to stream movie from The internet, and work perfectly for wireless. I referto any body must buy it.", "verified": true, "helpfulness": "0/0", "author": "Moval"}, {"rating": 1.0, "review": "Well this was a letdown. Our family is rapidly moving to all things Apple. Or at least was moving that way. Perhaps when you get big enough to dominate (probably in violation of Anti-Trust laws) you also get big enough to sell trash to your customers.Unit hooks up fine to TV and connects fine to iTunes for streaming music. Beyond that, worthless.Netflix? Find any other alternative.Apple provided movies? Read the horror stories in these reviews about download times.For us, a $99 experiment that now has me looking at the Android platform.", "verified": false, "helpfulness": "2/14", "author": "C. Paul"}]