[{"rating": 5.0, "review": "The best set top box for your living room... The best", "verified": true, "helpfulness": "0/1", "author": "Rarguello"}, {"rating": 2.0, "review": "Nothing about it really stands out.  Its not as polished as other Apple products.  In fact, the user interface often lags.When I first purchased the Apple TV, I didn't have Spotify or Amazon Prime. I do now. It didn't take long to discover that Amazon and Spotify do not work on Apple TV.  I now regret buying the locked down, 90s-Microsoft-esque device.", "verified": false, "helpfulness": "0/0", "author": "AP"}, {"rating": 5.0, "review": "Surprisingly steep learning curve for an Apple product (IP address clash with shared PC, inability to completely find the WiFi initially) but I chalk those problems up to intermittent up-time from my ISP and after a half hour (which for an Apple product I consider steep) I got it all worked out.So far I love it. Looking forward to seeing certain popular TV series available on iTunes or HBO Now", "verified": true, "helpfulness": "0/0", "author": "J Francis"}, {"rating": 5.0, "review": "Best dohickey EVER. Love!", "verified": true, "helpfulness": "0/1", "author": "Susannah Zare"}, {"rating": 5.0, "review": "Works as described. Arrived nice and clean.", "verified": true, "helpfulness": "0/1", "author": "D O T"}, {"rating": 3.0, "review": "An OK streaming box but with some issues... First, if you download a movie it downloads the entire movie before it starts playing. That could take hours so don't make the popcorn and expect to watch what you selected.The lack of Amazon streaming support is disappointing. If the box gets an error while downloading or playing it just stops instead of recovering from the problem. That means you have to start your movie over from the beginning... I'm not sure I'd recommend it but I don't see that other similar devices have much better reviews...", "verified": true, "helpfulness": "1/1", "author": "Alec Carlson \"Mohawk\""}, {"rating": 4.0, "review": "Absolutely love it. Bought this mostly for hbo now. The only letdown was no hd master audio :(", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "I really enjoy the product apple always makes great products", "verified": true, "helpfulness": "0/0", "author": "Mori"}, {"rating": 5.0, "review": "It works great!  Have not had any issues and easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Linda Little"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ryan J. Lugo \"doughboy\""}]