[{"rating": 5.0, "review": "As you probably know, Apple products are never on sale.  This was!  No taxes or shipping make it a great value.  Love watching movies and viewing our pictures on our 52 inch TV!", "verified": true, "helpfulness": "0/0", "author": "Cena C. Hamby \"Cena\""}, {"rating": 5.0, "review": "One word that resumes my reason for buying this: Airplay. I can stream music and videos from my iPhone and iPad.", "verified": true, "helpfulness": "0/0", "author": "Luis H."}, {"rating": 5.0, "review": "completely change my life now I can listen to music watch netflix connect my cell phone with tv and connect my computer to the tv", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Last year I bought A Roku and was looking forward to all of the channels I could add and watch and even though there are more than I could ever watch I thought it was a great concept. I also bought the Roku mainly for Netflix and HBO GO which are both native apps. Then I found out that DirecTV does not support the Roku's HBO GO app which was frustrating, to say the least.Anyway, on to the Apple TV.Setup was a breeze and Apple never disappoints in the ease on navigating around the menu. I immediately configured my Logitech Harmony One remote to work with it (which went flawlessly) and I was ready to go. (The Apple TV remote is so tiny I was afraid it would get lost). Using my Harmony One remote on the Roku (even though it works) was a clunky, lag fest and very frustrating to use.After configuring the Apple TV I tried Netflix and the picture quality was great, I think better than the Roku as well as the Netflix Menu which is much more user friendly on the Apple TV.Then I tried streaming the movie Battleship on HBO GO from my iPad via Airplay and even though it took a min or two to start, the picture quality was much better than I expected and dare I say BluRay quality.Even though the Apple TV doesn't have anywhere close to the amount of channels that the Roku does, it's a top quality product which once again shows that Apple is the best in the business and being able to listen to my iTunes library through my home theater is awesome.HBO is currently working on a native App for HBO GO on the Apple TV so that will be the icing on the cake but for now, watching over Airplay is solid.Very happy with this purchase.", "verified": true, "helpfulness": "1/2", "author": "Joe"}, {"rating": 5.0, "review": "This is the Greatest device ever, can't believe I waited so long to buy one of these things....bye bye cable box", "verified": true, "helpfulness": "0/0", "author": "PRE-K TEACH"}, {"rating": 5.0, "review": "I love this product. I was surprised at all that it does like AirPlay for music and video, Netflix and many other commercial streaming services, and Internet radio.  Plus, photo stream slide show!  I loved that I could take a picture during a party and it would show up on the tv!", "verified": true, "helpfulness": "0/0", "author": "T. Plunkett"}, {"rating": 5.0, "review": "Gotta have one of these if you are a speaker and use keynote. The airplay feature is the best feature.", "verified": true, "helpfulness": "0/0", "author": "L. Leon \"DueceL3\""}, {"rating": 4.0, "review": "It is so easy to set up.  Just plug it in, connect to your wifi and log in to your accounts and you're all set!  The only reason I gave it a 4/5 stars is because there is no access to Amazon Prime content.  Not that I use it but it would be nice to have that option.  Other than that all other things work great!", "verified": true, "helpfulness": "0/0", "author": "Miguel"}, {"rating": 5.0, "review": "not the best, as you are locked into the the apple ecosystem. Ability to airplay from ipads, iphones via ATV is HUGE!limited apps, netflix,hulu+, wish i could add more apps like PBS.....", "verified": true, "helpfulness": "1/1", "author": "p4knyc"}, {"rating": 4.0, "review": "My son uses all Apple products (iMac, iPad, etc.)  This integrates perfectly and was easy to set up.Received it the day after I order it!", "verified": true, "helpfulness": "0/0", "author": "Greg Flannery"}]