[{"rating": 5.0, "review": "We got Apple TV for Christmas and LOVE it! We cancelled our cable and now just watch shows from the iPad and stream them on the TV. It's saving us a ton of money!", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "its awesome. it does everything you want and more. apple always has the best products and this is no exception!", "verified": true, "helpfulness": "0/0", "author": "Daniel Chait"}, {"rating": 5.0, "review": "I have had my apple TV for just a few days now and I have loved it every minute!  I have been able to watch all the movies that I have on my iTunes account with just a click through airplay.  Im gonna order another one for the bedroom TV!  The remote that comes with the apple tv is kinda lame, but the iphone/ipad has a \"remote\" app that is perfect and makes finding the movies i want to watch a breeze!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "I've been pretty happy with Apple TV so far -- I have it installed with HDMI cable to the TV, and a TOSLINK fiber-optic audio cable to my receiver.  Simple to install, works right out of the box.  I've not had the buffering issues that some reviewers mention, and the router we are using (Linksys 802.11g) is perfectly fine to give me good signal strength.Works well for YouTube, works well for Vimeo, works good with Airplay.  EXCELLENT with NetFlix, also-- the interface is better than on several Blu-Ray players I have seen.Integration with other apple devices is seamless -- you just suddenly have the \"send to AppleTV\" option on your phone or iPad.If you have other Apple devices, and a decent wireless setup, this will be a good addition to your media devices.", "verified": false, "helpfulness": "1/1", "author": "J. Spurlin"}, {"rating": 3.0, "review": "Pros:If you have an Apple products like iPad, iPhone you can play or mirror content from your ipad and iphone on your LCD/LED TV .It also plays content from your iTunes on your PC/Mac.It also has optical output that you can connect to your old receiver to have 5.1 audio from Netflix.Cons:When compared to Roku 2 it has very less content. Roku 2 has way more channels to offer that Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Ramesh"}, {"rating": 4.0, "review": "great idea, easy to setup and use. love the internet radio, and the movies and tv rentals from i tunes", "verified": true, "helpfulness": "0/0", "author": "ROBERT W ARMSTRONG"}, {"rating": 2.0, "review": "Too limited.  I'd like to get pandora as 1 example.  it does have good picture and sound.  thought there would be more free stuff.", "verified": true, "helpfulness": "0/1", "author": "John F Doherty"}, {"rating": 5.0, "review": "Have 3 of these throughout the house, feeding media off an Mac Mini and 2 iTunes libraries.Very handy, sometimes requires a restart if lost connection to libraries.Just wish they were more friendly/compatible to sources outside of iTunes and some interent media like Amazon prime/Netflix etc.Easy to use though and setup.", "verified": true, "helpfulness": "0/0", "author": "cityToCountry \"wang\""}, {"rating": 5.0, "review": "I added Apple TV to my Mac, Macbook, Ipad (X2) and Iphone (X2) home. It's a great addition that pulls all the technology together. For the cost it really can't be beat if you are running mac products.", "verified": true, "helpfulness": "1/1", "author": "Grant"}, {"rating": 4.0, "review": "It's perfect small size packs a lot in what entertainment it can provide. It is amazing with the iPhone 5 mirroring options the best video quality on such a small device.", "verified": true, "helpfulness": "1/1", "author": "JWT84 \"JWT84\""}]