[{"rating": 5.0, "review": "Works like a charm. Didn't even have to read any instructions. Just plug it in to power, and a free HDMI port --and you're ready to rock.", "verified": true, "helpfulness": "0/0", "author": "Mr. Mike R. Christian"}, {"rating": 5.0, "review": "Enjoy Apple TV and it works great!!!", "verified": true, "helpfulness": "0/1", "author": "Bruno LoPresti"}, {"rating": 4.0, "review": "Battery was dead in the remote, but the product was functional.", "verified": true, "helpfulness": "1/1", "author": "Juan Torres"}, {"rating": 5.0, "review": "I use this device exclusively for Netflix and Hulu.  Ocassionaly I rent or buy movies from iTunes.  For my needs, this device works flawlessly ---no stream interruptions, lack of audio synchroniy, high quality picture for my HDTV., and easy to use (I am a senior citizen and not tech oriented).  Prior to this I had Roky that I bought approximately in 2006.  Compared to the older Roku, the Apple TV is significantly better.  Overall, I'm pleased with this streaming device and I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Clemencia Lopez"}, {"rating": 5.0, "review": "Nice....", "verified": true, "helpfulness": "0/3", "author": "Sandip Patel \"Sandip\""}, {"rating": 1.0, "review": "If you love dropped frames (stuttering playback) you will love this product. This is a known problem. Up until a few months ago it worked fine, hence the good reviews for this product. I own a Roku too and it has a few issues but none as amazingly frustrating as the horrible video playback.", "verified": false, "helpfulness": "2/3", "author": "rambseigh \"yeahokay\""}, {"rating": 1.0, "review": "We bought this in January. In March, it stopped working. The white light is rapidly blinking and the TV screen just shows the apple logo. There is no way to reboot it (we've tried using a microUSB to restore in iTunes, but no dice). Apparently this is a not uncommon problem, but Apple doesn't have a solution. So frustrating.", "verified": true, "helpfulness": "2/3", "author": "Political Junkie"}, {"rating": 5.0, "review": "Great product-good price-for an Apple product.", "verified": true, "helpfulness": "0/0", "author": "D. Ballew"}, {"rating": 2.0, "review": "Apple controls what you watch. You'll find yourself struggling to look up a video on the YouTube app.sometimes they block the YouTube app altogether to force you to watch other stuff. I do not recommend buying an Apple TV. Buy something that gives you more freedom to do and watch whatever you want. The only thing that comes to my mind is the Windows based machines.", "verified": false, "helpfulness": "0/1", "author": "Wiaam"}, {"rating": 5.0, "review": "good item !! fast shipping as always ~!!~", "verified": true, "helpfulness": "0/1", "author": "Anibal Sabate"}]