[{"rating": 5.0, "review": "Got the Apple TV, plus Amazon HDMI and audio cables. The setup was easy, and mirroring our apple devices allows us to get more value out of our big screen tv. We are not into paying extra for subscription services, but our kids used their subscriptions for Hulu Plus and Netflix, and the device worked as advertised.  We mostly will just use this for mirroring. Great for showing a group your photos on iPhone or computer. BTW, a program called AirParrot is great for getting older macs mirroring capable without the risk of an OS update.", "verified": true, "helpfulness": "1/1", "author": "Arlo"}, {"rating": 5.0, "review": "This just works. Trying to link your mac computers to your TV and fussing around with 3rd party software that is buffering at inopportune moments in your movie? The apple TV is small, simple, and works great.", "verified": true, "helpfulness": "3/3", "author": "Tyler J"}, {"rating": 5.0, "review": "This is the next best thing to cable or satelite if you have a decent over the air antenna for your local channels, it integrates seemlessly with most Apple products with Airplay.", "verified": true, "helpfulness": "0/0", "author": "jr4356"}, {"rating": 5.0, "review": "Purchased as a gift. Received in a timely manner. Works great and with no issues. Make sure you get proper cables.", "verified": true, "helpfulness": "0/0", "author": "Kim Kennedy"}, {"rating": 5.0, "review": "I already have an iPad, Macbook Air, Macbook Pro and 2 iPhone-5s - the Apple TV compliments them perfectly.  I like that I can point the screensaver at my flickr stream and that my old apple remotes still work with this (not to mention the iPhone remote app).  Netflix and Hulu Plus work seamlessly (as expected) and we love streaming music from whatever device is currently connected.  Would recommend (and did already).", "verified": true, "helpfulness": "19/21", "author": "Ryan Furness"}, {"rating": 4.0, "review": "Works great and has lots of options only bad thing is all the cool stuff to watch cost more money!!", "verified": false, "helpfulness": "0/0", "author": "Mason09"}, {"rating": 5.0, "review": "I had been reluctant to purchase this device for a long time because of the $99 price.  When I found it for $85 I was willing to give it a chance.  I am glad I took the chance!  I love that I can watch Netflix, all my shows purchased from Apple, and anything on YouTube.I do hate the little remote control, but was able to program another remote control to work with the device.  If I figure out how to turn it off without having to read any instructions, the device will be perfect.", "verified": true, "helpfulness": "0/0", "author": "Indy"}, {"rating": 5.0, "review": "This was an awesome purchase! My son was so surprised to open this! He loves this addition to his electronics collection and uses it for sharing things with his youth group and friends. Great price, too!", "verified": true, "helpfulness": "0/0", "author": "karen a conrad"}, {"rating": 5.0, "review": "This is a great product.  I own three and they all work flawlessly.  I stream movies, music, and pictures from one iMac to all three and they all work perfectly.", "verified": false, "helpfulness": "1/1", "author": "Thomasj106 \"Thomasj106\""}, {"rating": 5.0, "review": "Received as a gift after contemplating for quite sometime.  Works great with my current iTunes library.  If you own \"I\" devices, you need this product!.", "verified": false, "helpfulness": "1/1", "author": "Todd Smith \"gadget man\""}]