[{"rating": 5.0, "review": "works as expected", "verified": true, "helpfulness": "0/1", "author": "Barbie Hiller"}, {"rating": 3.0, "review": "Now that the price has dropped its great to have IF you have the right bandwidth otherwise don't bother.", "verified": true, "helpfulness": "0/1", "author": "Kevin Johnson"}, {"rating": 2.0, "review": "Gets stuck all the time.  Need to RMA", "verified": true, "helpfulness": "1/2", "author": "Sanjil Ramchandani"}, {"rating": 3.0, "review": "i really like my apple tv because i have apple everything so it works out! I can dream my music and watch tv shows like PBS and PBS Kids. It looses a star because you have to have TV through a cable provider in order for some of the channels to work like Disney channel and disney junior. I think this kinda defeats the purpose of having tv through them but it still works for us. I wanted to just have this instead of TV. All they offer where I live is ATT and they want to charge me 400$ as fee for my credit plus the original set up fees and monthly payment. UHHH NO! oh well ill just deal", "verified": true, "helpfulness": "0/2", "author": "Sabrina B."}, {"rating": 5.0, "review": "What's not to love??? It's an apple product! If you are an apple user?? Go for it! You can link all Apple accounts as well as use your phone or iPad as a remote! The remote that comes with it  is pretty small and easy to loose buy a holder for it if u can!", "verified": true, "helpfulness": "0/0", "author": "FNZ218"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "Ayman Helkani"}, {"rating": 5.0, "review": "I already owned one I decided to buy another one for my other TV great products", "verified": true, "helpfulness": "0/1", "author": "Mikoj"}, {"rating": 5.0, "review": "What a great device for the price!  Easy set up, easy operation and works flawlessly.  I love having the Remote app on my phone and controlling the AppleTV from there.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Martin \"Software Developer/Bass Player\""}, {"rating": 5.0, "review": "Great product!!", "verified": true, "helpfulness": "0/1", "author": "Laio Dias"}, {"rating": 5.0, "review": "We like it a lot.", "verified": true, "helpfulness": "0/1", "author": "Amir Entezari"}]