[{"rating": 3.0, "review": "I have both the Roku and the Apple TV.  I use the Roku 95% of the time.  I mostly use my Apple TV to stream music from my macbook pro and that's about it.  The Roku let's me watch all the netflix content, hbo go, etc.  It will also do the slideshow like the apple tv does.  I can also buy rentals through Amazon.com vs the Apple TV.  Amazon prices seem a bit lower too.", "verified": true, "helpfulness": "7/8", "author": "Jon Flaherty"}, {"rating": 4.0, "review": "**17Sept 2013 edit**. I just got an update for Amazon Instant Video this morning, and itis now available over AirPlay to Apple TV!  Hurrah!I opted for the Apple TV over Roku products because I'm an Apple user (I've got an Ipad2 and an Iphone 4s, both of which are Airplay compatible).  I'm also an Amazon Prime member who watches a lot of television shows through the Ipad app.  One reason I chose the Apple TV was because of Airplay with my Ipad, I could watch Amazon Prime videos (one feature of the Roku that I really liked.)  Well, it arrived last night, and the Amazon Prime app is not available to stream over Airplay.Well played, Amazon.  Well played.That being said, the Airplay function is worth it.  I used velcro to attach the small design to the back of my small television and the signal from the remote bounces off the wall behind it to the box, eliminating line of sight necessity for the remote.The remote app on Ipad/Iphone is seriously easy to use and cool.  I also tried out a flight simulater game that uses the Ipad as a control panel and the television as game screen (I usually don't play these types of games.  I just really wanted to try out this feature.)  It was fun!", "verified": true, "helpfulness": "2/3", "author": "Kate"}, {"rating": 4.0, "review": "PRO's:--For an Apple device, it's surprisingly similar to prices of other, competing set-top boxes--It's small--Sips electricity when in use; incredibly low use when asleep--Dead silent--Generates almost no heat--Makes viewing Netflix movies with Closed Captioning possible, even if your TV's built-in Netflix app refuses to do it--Menus are pretty easy to navigate around--Supports 1080p content when availableCON's:--Hey, it's an Apple device--it's locked down, so you're stuck with the options they provide (unless you jailbreak it)--Remote is so thin it's actually a bit difficult to use--Range of default, included remote is limited to a fairly short line-of-sight infared; can't really hide the AppleTV from view due to this flaw--No Amazon Streaming or Rentals--more of a push towards Apple and Netflix servicesBOTTOM Line:  This is a nice little easy-to-use set-top box.  If you're planning to stream most of your content through one of the included service's apps, you're good to go.  You can stream media from OS X and Windows computers running iTunes.  The Apple TV 3 doesn't have nearly the same sort of selection of options and expansion capabilities of something like the Roku platform, but it's not supposed to; it does what it does, and what it does, it does simply and reliably.", "verified": true, "helpfulness": "2/3", "author": "Strick1226"}, {"rating": 5.0, "review": "I added this one as a second Apple TV for my home. I really like how these work and how easy they are to install into my system.", "verified": true, "helpfulness": "0/0", "author": "doclee"}, {"rating": 4.0, "review": "We already have a Roku and 'smart' tv's, but when are 3 year old cracked our LED TV, we went low end on the replacement and needed something for Netflix, etc.  Since we already own MacBook Pro's and Ipads (and Iphones), we went with the Apple TV.  For the most part, we've been satisfied and love the integration with Itunes.  However, the fact that Apple limits the third party apps causes some issues.  For instance, no Pandora App.  No Amazon Prime Instant app (not surprising I know).  The roku is much more open and would be my first choice due to the lower cost.", "verified": true, "helpfulness": "1/1", "author": "Jeff Krueger"}, {"rating": 5.0, "review": "Work great - new to the techie world and this allow me to watch movies from my IPAD on my TV -- Good times", "verified": true, "helpfulness": "2/2", "author": "Bill Anderson"}, {"rating": 5.0, "review": "Love 1080P output. Airplay from iPad and iPhone work well. Now able to sync with Bluetooth keyboards which helps with entering titles on Hulu and Netflix. The only negative is airplay mirroring from a MacBook can be laggy so it's better to connect a TV directly to the MacBook if you want to mirror your display.", "verified": true, "helpfulness": "0/0", "author": "Khoa Lam"}, {"rating": 5.0, "review": "One of the best things I've aver bought besides my Imac.  We use this every day.  One thing I would like is if we could get Amazon on it.", "verified": true, "helpfulness": "0/0", "author": "John B. Reese \"Dubai Master\""}, {"rating": 5.0, "review": "I've been using my Apple TV for several months now and I feel that I have enough experience with this product to author an adequate and honest review.Pros:Awesome packaging! Your Apple TV box slides out of the packaging sleeve revealing your awesome little black hockey puck of a media streamer. Pulling the Apple TV out of its box reveals the remote made of sleek aluminum. The remote feels solid, incredibly simple and almost familiar. Underneath the remote resides the power cable, sans bulky power block as the Apple TV's power supply is actually inside the device itself, and owner's manual/warranty information.Simple setup! Plugging your Apple TV into power and then into your HDTV or Projector with an HDMI cable (Amazon Basics HDMI recommended, quality at a low price!). You are greeted with a dead-simple interface. Language? Wifi Network name and password? Apple ID and password? Done! From box to Netflix took about 2 minutes, tops.Blazing fast interface! I finally have a replacement for the sluggish \"Smart\" options on my Samsung LED TV. Getting to the middle of my Netflix queue on my Samsung took around 5 actual minutes before we were watching the movie/TV show. My Apple TV does the same job in less than 60 seconds.Features! Streaming options include iTunes Movies/Music/TV Shows (for purchase and for rental), Netflix, Hulu, MLB.TV, NBA LeaguePass, NHL On Demand, Wall Street Journal Online, Flickr, Vimeo, Youtube, AirPlay (next bullet point), and more being added in updates! Since I have owned mine, they have added several streaming options.AirPlay! Definitely something that sets the Apple TV apart from the competition. With a single tap on an Apple mobile device (iPod Touch, iPad or iPhone), you can wirelessly send media content to your TV! You even have the option to mirror your device's screen to the TV! Anything you do on your mobile device can be seen on the TV! Web browsing, Apps (HBO Go and other streaming services that aren't natively on the Apple TV), games, email, documents, anything! Awesome! This feature even extends to Macs.**NOTE** You can get AirPlay to function on non-Apple devices! Download AirParrot on Windows and DoubleTwist on Android to enable your ability to mirror your device to your Apple TV, wirelessly.Connectivity! Built-in wifi and bluetooth connectivity allowing you to connect a bluetooth keyboard for quick login and search entry. Recommend the Apple Wireless keyboard as it is very thin and light, great for couch use!Cons:Missing some streaming services like NFL and HBO Go, though these services are available if you have a device that can AirPlay this content from the web or an app.No native component connections, though this is a rare need in today's HDMI world.My Setup:Cox High Speed Internet 50MbpsMotorola Surfboard Extreme DOCSIS 3.0Apple Airport Extreme RouterSamsung UN40ES6500 40 inch LED 120hz 1080pApple TV (3rd generation, 1080p)Amazon Basics HDMI cableIn summary, this device is well worth the $99. It exceeds expectations in every regard, and allowed my wife and I to become \"Cable-Cutters\" and drop our cable TV service completely. We went from spending ~$150/month on television and blurays, HBO, Showtime, Starz, etc to spending ~$50 with Hulu Plus, Netflix and various purchases and rentals from the iTunes store. It paid for itself in the first month!", "verified": false, "helpfulness": "4/4", "author": "Leslie Ann"}, {"rating": 5.0, "review": "I really like using the Apple TV to mirror my iPad screen on my HDTV. It was easy to setup and picture is perfect. Used cables before but this is 1000 times better.", "verified": true, "helpfulness": "2/2", "author": "Ken Clayton"}]