[{"rating": 5.0, "review": "I purchased this as a gift for our family.  I am not technical in any way but was told by my kids that this was what I should buy to do what I wanted it to do.  I was looking for something to add to our tv to be able to access YouTube, Netflix, iTunes, etc., wirelessly.  So far it's done what I was hoping it would.  Even I can use it (after tutoring from my son, who also set it up) and have enjoyed watching YouTube videos, photos and listening to music.  It's only been in use for a couple of days, but so far, so good.It was reasonably priced and came in a very little box!  It came with a very small and thin remote, but can also be controlled with your iPad or computer (a windows laptop in my case).  I also liked that I could download my own music CD's  (through my iTunes account, I think) and listen to them through the Apple TV.  Overall I'm excited about it and hope to enjoy it for many years.", "verified": true, "helpfulness": "0/0", "author": "Janet A. Gilles"}, {"rating": 5.0, "review": "There are tons of reviews out there about the specs and features of the Apple TV. So, I'll just say what I use it for. I primarily use it to watch Netflix or stream videos from my desktop via my IPad to the Apple TV. There are couple of ways I do it. I use Air Video or Air Playit to stream to my IPad, and Airplay to my Apple TV. I have a shared folder on my computer that these streaming apps can connect to. I haven't noticed any lag or delay in playing movies, even large files. MP4 files can play directly from Itunes to the Apple TV. No need for IPad to be in the middle in that scenario. Sometimes I also use Splashtop Remote desktop to connect to my computer and browse on the bigger screen. Splashtop only works with the Mirroring option. For those of you who are new to this, AirPlay and Mirroring are 2 different things and if you do a google search on it, will tell you how to do it.Netflix quality  is much better than what I used to get on my Wii netflix app. I haven't tried to play any games using mirroring, so can't speak to that.So far, I am really happy with my purchase. If you own a IPad or IPhone, this is a neat little toy for less than $99 right now on Amazon.", "verified": true, "helpfulness": "0/0", "author": "Nix"}, {"rating": 5.0, "review": "This purchase was actually a gift, because I have had my Apple TV for about 4 months. When first getting the product it's honestly amazing how tiny it is. Then you plug it in, and let me tell you, if your T.V. is Hi-Def you need the HDMI hook-up instead of the RGB Component, trust me.  Very Responsive and Aesthetically Pleasing UI, with just about every little \"app\" you could use.  The only real downside would be the fact that iTunes charges $5 to rent a movie, but I guess you just can't win them all.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Hickey"}, {"rating": 5.0, "review": "Love love love the Apple TV it does so much more then I even thought, worth the money, very happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 5.0, "review": "Super easy to install. Love it. Works great with Netflix and other apps. I only wish it had come with more instructions. Had problems getting it to come on but put it in SLEEP NEVER mode and no more problems.", "verified": true, "helpfulness": "0/0", "author": "Roe, CT"}, {"rating": 5.0, "review": "So easy to use and fun to play with! Def a must for apple users. We love it! Thanks apple!", "verified": false, "helpfulness": "0/0", "author": "Hedder08"}, {"rating": 4.0, "review": "We use this for AirPlaying photos and videos from our iPhones and iPad. I also bought Real Racing HD2 to try it out while using the iPad as a controller - it is a fun game when you play it on a big screen TV. Lastly, the Netflix interface is more user-friendly than what we have with our Sony BDP-S590 DVD player (which is not bad on its).", "verified": true, "helpfulness": "0/0", "author": "Fox Hill"}, {"rating": 5.0, "review": "We are having so much fun playing with this Apple TV. It has so many cool features, and it was a breeze to set up. I would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "A. Langefels \"Happy Customer\""}, {"rating": 2.0, "review": "After reading all the reviews before I purchased this unit.I think that apple has a ways to go with this unit.your not able to stream from HBO, which is one I already pay for.", "verified": false, "helpfulness": "0/3", "author": "Jill plain"}, {"rating": 5.0, "review": "We have an \"un-smart\" TV and so earlier this year bought a Sony SMP-N200, which is effectively the smart TV gubbins in a separate box.  I'm very pleased with the Sony for what it does.  But it's what the Sony doesn't do that caused me to want the Apple TV - I still have to watch ESPN 3, and non-Netflx/Hulu Plus streaming sites on my iMac - which is fine, but isn't in as comfortable a location as my TV is...The combination of the Apple TV and my iMac now means that by using Airplay Mirroring, I can watch anything streaming on my computer directly on the TV - which is just what I wanted.  Oh and we can also display whatever my wife is streaming on her iPhone directly on the TV.Purchasers do need to check the spec of their hardware though.  If you have an apple computer from before 2012, check the compatibility list on Apple's web site, to see if airplay mirroring will work for you.  If airplay mirroring won't work for you, and you don't intend to update your hardware, you may want to look at the Roku (no you-tube option to date) or another streaming device, which has more \"in the box\" streaming options than the apple TV has.However, for me and any other Apple devotees, this is the streaming device you want to attach to your \"un-smart\" TV (and possibly your smart TV as well).", "verified": false, "helpfulness": "0/0", "author": "Brian Hill"}]