[{"rating": 4.0, "review": "We like our Apple TV. We have a Samsung Smart TV too but we prefer Apple's clean, clutter-free interface. It is quick and intuitive and the remote is the perfect size when you already have a clunky TV remote taking up table space.It loses a star for its non-customizability. You can't move any of the apps around or add/remove the ones you use the most. Something I didn't realize when we purchased it... The Apple TV 3 is not jailbreakable. If that matters to you, buy the 2 instead.", "verified": true, "helpfulness": "0/2", "author": "Angela"}, {"rating": 5.0, "review": "Good product, highly recomended. It would be nice if you have it with a lower price but, works perfect !", "verified": true, "helpfulness": "0/0", "author": "D. Alva \"Kevin\""}, {"rating": 5.0, "review": "So small and easy to use. This was up and running in 5-10 minutes. I am going to get a second one for downstairs.", "verified": true, "helpfulness": "0/0", "author": "Sower"}, {"rating": 5.0, "review": "I LOVE ITSpecially wifi streaming (iPhone and iPad)The new Bluetooth feature is awesome too , now I can pair my B.T keyboard to my ATV", "verified": true, "helpfulness": "0/0", "author": "Raafat A. Al-Saqr"}, {"rating": 5.0, "review": "I have had this for some time now and I have to say we love it. The graphics look great on our TV.  It was easy to connect to our wireless network and it is very fast. So far we have no complaints about this.", "verified": true, "helpfulness": "0/1", "author": "NJ_Joe"}, {"rating": 5.0, "review": "I love my Apple TV. It does exactly what I want and need it to do. It's the perfect size, the kids can view their photos, listen to music and watch movies. I'm satisfied with the product and would recommend you purchase one too.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Advertising for the AppleTV states that you can mirror the monitor of a Mac (say a laptop) so long as you have OS X 10.8 (Mountain Lion). The fine print is that you need to be running a laptop from 2010-2011 or newer. If you have older hardware, even if you are running OS X 10.8, you are out of luck. It is interesting (if not, telling) that Amazon's product description for the AppleTV only describes iOS mirroring. To me, that seems like a subtle warning that Apple does not strongly promote the use of AppleTV for mirroring a Mac's display.", "verified": true, "helpfulness": "0/2", "author": "fygar"}, {"rating": 4.0, "review": "The only reason I bought this over a Roku was it's ability to AirPlay my iPad. It's still a great piece of hardware, but if you want more options for content and don't have an iOS device to stream to it, then get a Roku.", "verified": true, "helpfulness": "2/2", "author": "Michael Poole \"Amazonian Junkie\""}, {"rating": 5.0, "review": "This product is awesome! Easy to set up and use.  Way to go Apple! I would recommend this product to other buyers.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Bought a second Apple TV when I moved my old TV into the bedroom. Make a dumb TV a smart TV for less $$s.", "verified": true, "helpfulness": "0/0", "author": "Tim"}]