[{"rating": 5.0, "review": "A great Device", "verified": true, "helpfulness": "0/0", "author": "Homood Alhassani"}, {"rating": 5.0, "review": "Love this! Gave it as a gift to my parents. Although their not sure how to use this, their happy with it. My mom especially loves this", "verified": false, "helpfulness": "0/0", "author": "Sharlene Yeo"}, {"rating": 5.0, "review": "APPLE PRODUCTS AWESOME AS USUAL", "verified": true, "helpfulness": "0/0", "author": "RIck JD Hahn"}, {"rating": 5.0, "review": "Good.", "verified": true, "helpfulness": "0/0", "author": "Luiz"}, {"rating": 5.0, "review": "To anyone wanting an AppleTV so they can cancel cable, here is some insight on how the AppleTV works:The AppleTV turns on and you will see a lot of apps, just like on a phone. These are the only Apple available, you can't search and download an App Store like you can on your phone. I included a full list of these channels at the bottom of my review. These are changing over time and Apple adds more and more as time goes by.Many of the TV apps have free content available, like clips or interviews, but to access the \"good stuff\" like full episodes, you need to have a cable login/password.You can only access full content on a channel app if your cable package gives you access to it normally. I use my parents' account. Disclaimer: some companies may allow sharing accounts according to their user terms and agreements. I am not aware of every company's user agreements, so I can't speak to them, but what I can tell you is that I use my parents' cable account (I do not live with them) ... Read more", "verified": false, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 5.0, "review": "I waited until the Apple TV came down in price and it finally has. It is what I expected, a basic way for me to access Netflix and other media outlets without having to always hook up my phone or IPad. I gave it 5 stars because it serves my purposes so far. For those who are looking for much more, they may give it 4. I will not be getting rid of my cable tv any time soon unfortunately. The remote is very basic, but does the job. Biggest pain about the remote if having to enter long email addresses / passwords. I tried the Apple remote app, which works ok, but has a drawback where it disconnects if you have a screen lock used on your iPhone. I just turn that off while using the phone remote and it works a lot better than the Apple TV remote. I really do not use most of the apps on Apple TV so far other than Netflix, You Tube and music, but it is easy to set up and navigate within. Syncing up to Wi-Fi was easy and menu options are clear and easy to navigate. Google Chrome, Amazon Fire Stick or some DVD players may be other options to consider, but I wanted the Apple because we already have other Apple products and are happy with their quality and function. As always, B&H; offered great pricing, quick order processing and shipping. B&H; is my go-to for my electronic and photo needs!", "verified": true, "helpfulness": "0/0", "author": "vincent"}, {"rating": 5.0, "review": "Works perfect", "verified": true, "helpfulness": "0/0", "author": "Ryan Cartwright"}, {"rating": 5.0, "review": "Works great !", "verified": true, "helpfulness": "0/0", "author": "Ken Fava"}, {"rating": 5.0, "review": "Bought this for the husband for his birthday & he loves it! Also, I'm not very tech-savvy, but it's even easy for me too use.", "verified": true, "helpfulness": "0/0", "author": "Billsgrrl"}, {"rating": 5.0, "review": "So much fun to have an Apple TV. I got a refurbished one, but can't tell the difference.", "verified": true, "helpfulness": "0/0", "author": "Candida Cane"}]