[{"rating": 1.0, "review": "I have had a roku for a few months. I bought the roku for my mom so she could watch shows in the living room. I have netflix, amazon prime, and hbo go on the roku. My ps3 was my streaming device in my bedroom. Bad thing was, I couldn't stream hbo go on the ps3. I came here and read all the reviews about how awesome apple tv was compared to roku. I bought the apple tv without the slightest idea that prime instant video and hbo go weren't supported yet?!APPLE TV HAS BEEN AROUND FOR YEARS AND YOU'RE GOING TO TELL ME HBO GO AND PRIME INSTANT VIDEO AREN'T SUPPORTED? Not happy at all. The only way I could stream hbo go or prime is if I bought a $200 ipod or $400 ipad and used \"air play\". Now I have to return this piece of crap. Definitely not worth the apple logo you get on your device.", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's nice when a powerful product just works right all the time. It took about 90 seconds to set it up and it has been working flawlessly ever since. In comparison, my ROKU took half an hour to get up and running and needed to be reset about once a month to reset a lock up. The only disadvantage to it is the limited number of programs available compared to ROKU, including the Amazon Instant that I use occasionally (using my Samsung TV Smart Hub). But I'd give up Amazon Instant before giving up the Apple TV..", "verified": true, "helpfulness": "0/0", "author": "Steve B \"Mac User\""}, {"rating": 5.0, "review": "This is great for watching re-plays of shows through the History Channel and A&E; Channel app that I have installed on my iPad.  Picture quality and sound are superb.", "verified": true, "helpfulness": "0/0", "author": "Richard H. McCann"}, {"rating": 5.0, "review": "apple tv is a very nice product ,i can use it with all my apple products via internet connection and wireless .", "verified": true, "helpfulness": "0/0", "author": "nasser"}, {"rating": 5.0, "review": "This is a great way to be able to rent videos and watch them on your TV instead of the small screen on the computer. Easy to set up and a great addition to your iTunes collection.  You must have iTunes if you purchase the Apple TV, but I had it already and, with my iPod I have completed my Apple tree.  Enjoy.", "verified": true, "helpfulness": "0/0", "author": "James Gettens"}, {"rating": 3.0, "review": "Apple products are always great looking.  However this was very easy to install I sent it back because everything worth it to watch required more money.  You'll do better with Hulu or Netflix.", "verified": true, "helpfulness": "1/2", "author": "M. E. McElmurry"}, {"rating": 5.0, "review": "I use this as well as a Roku. If you have a iphone or iPad the Apple TV really works well with them", "verified": true, "helpfulness": "0/0", "author": "Gary C. Henley \"G C Henley\""}, {"rating": 5.0, "review": "Works as described.  This is my second one, and would recommend to anyone and everyone.  Definate must have.Great job APPLE!", "verified": true, "helpfulness": "0/0", "author": "D. Faust"}, {"rating": 5.0, "review": "Works with ipad, mac, ipod, and iphone. Also plays netflix on the big screen. Would recommend it to anyone interested in using their ipad apps to display on the screen. Amazon prime app will not play through this device though.", "verified": true, "helpfulness": "0/0", "author": "Robin A. Johnson"}, {"rating": 1.0, "review": "In Feb 2011 I purchased a MacPro 13 which I expected to interface with the new Apple tv about to come out. But, `No', Apple did not grandfather my virtually new Apple laptop so my Apple TV is worthless to me as a wireless streaming device. But even as a wired-in device I've found it doesn't handle the video formats I need, and has no capacity for add-on memory. But...I also purchased the next-to-last generation ROKU-2XD which has a BIG memory upgrade slot (USB) which I use with a 128 gig (!!!) flash drive - plenty for movies, family shots, music.  Enough said.", "verified": false, "helpfulness": "0/3", "author": "Magiclander \"MLr\""}]