[{"rating": 5.0, "review": "It's tiny. It's energy efficient. It's a  total breeze to integrate into an existing HDMI based home theater system. Netflix picture quality very good on a fast broadband connection. I'm using a 12mb VDSL link. Netflix supports Dolby D.  I'm very pleased.  Oh, did I mention that if you have a recent iPHone you can Airplay videos and pictures to your TV!Excellent product.  If you are an Apple product user,  i.e. iPhone, Macbook,  iPad, iTunes this is an inexpensive and essential addition to your multimedia system.Now if it would just support Amazon Prime video :)", "verified": true, "helpfulness": "2/3", "author": "Tony V"}, {"rating": 5.0, "review": "I have bought three AppleTVs in the past year for myself and family. If you have any Apple product that supports AirPlay, this is a must-have companion.We had a party recently, and everyone loved pulling out their iPhones and playing their favorite songs or home videos through our home theater system. It was a great experience.The PhotoStream screensaver makes your TV into a giant digital picture frame. Any picture I've taken with my iPhone, or edited with my MacBook shows up automatically.Airplay Mirroring lets you show your entire iPhone, iPad, or new MacBook screen to your TV screen. You can scroll through photos, watch videos, or anything really, all over wireless, all through your home theater system. This is the future.With Netflix and now HuluPlus, cutting cable TV is much easier. We eliminated our cable box recently and barely miss it.The AppleTV is simply a great device that gets more features every update. The Apple ecosystem is a great place to be.", "verified": true, "helpfulness": "2/3", "author": "Chris"}, {"rating": 5.0, "review": "I've had two of these, and I must say they are so simple to setup and fun to use. I just upgraded to Mac OS 10.8 and now I can do wireless full-screen sharing from my Macbook Air with my ginormous TV! Well worth the money, especially because of the slick Netflix and Hulu integration. I'm lovin' it!", "verified": false, "helpfulness": "1/2", "author": "teue"}, {"rating": 5.0, "review": "I have a Roku, and only chose it over Apple TV because it didn't offer hulu+, or mirroring from a computer. But just last week they added hulu, and they launched Mountain Lion that allowed for mirroring from my Mac, all while my Roku became incredibly slow to take any commands from the remote, and would sometimes just freak out. I got the Apple TV and so far it's been fantastic. It hasn't slowed down like the Roku did, yet, and it's great to be able to watch things like the Olympics on my TV through my computer that's streaming it from the NBC website. Plus, it's just one more thing to harmoniously sync with iCloud, and that always feel good. I'm really happy with the switch.", "verified": false, "helpfulness": "2/3", "author": "Samuel Claney"}, {"rating": 5.0, "review": "I love it... with mountain lion it actually became the best 100$ spent.. I love the user interface, the size (very compact) and the fact that you can use any device as a remote control (ipad, iphone,ipod touch). highly recommended", "verified": true, "helpfulness": "1/2", "author": "elzeidan"}, {"rating": 5.0, "review": "My boyfriend and I recently decided to get rid of Cable and I bought this for him as a birthday gift.  He LOVED it and has repeatedly said that this is the best gift I have ever gotten him.PROS: Netflix and Hulu Plus can both be streamed from the device (the Hulu still has items that can only be streamed from your actual computer/laptop if you have a Mac, you can do some mirror imaging and get away with watching on the tv after all).  Streaming photos and access to your music playlists is great.CONS: The only con so far is the \"random\" photo streaming... the random setting doesn't seem to cycle through the pictures very well.. I will see the same pic out of 300 a couple times just in the first 15 minutes the photo's are streaming.  that being said, not a real good reason to take any marks off the review.With the Apple TV and subscriptions to Netflix and Hulu, We aren't missing cable at all!!", "verified": true, "helpfulness": "0/0", "author": "Katherine Ann Hatch"}, {"rating": 4.0, "review": "This is really just plug and play if you are using apple products. I plugged it in and connected it to our wireless. I downloaded a software update, which allows us to use Hulu. It is so easy to use. It works flawlessly. The interface is brilliant compared to what comes on our Vizio TV set. If I want to stream music over apple tv, I just open up iTunes and click on the AirPlay button. Same goes for photos and vidoes, etc. The only annoyance is that I have not been successful in getting Amazon videos to work. I can hear the audio, but the video does not show. I use my ipad or iphone as a remote. Great system, better than V Beam, which stopped working two OS upgrades back.", "verified": true, "helpfulness": "0/0", "author": "L. A."}, {"rating": 5.0, "review": "Great addition to our family entertainment package.  We have a lot of tv shows purchased on iTunes and stored on my computer.  It makes it so much easier to watch them together as a family on the family tv without having to take my computer into the family room and hook it up to the tv every time.  Don't forget to buy a HDMI cable when you get this Apple TV.  It doesn't come with the it and it's necessary to hook it up to most televisions.  Easy to control with both the iPad, iPod Touch and iPhone too.  Everyone in our family is really happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Valerie Robertson"}, {"rating": 5.0, "review": "I was really wanting to get a roku for the past few months but then I found out about the Apple TV and started looking into it. Even though there isn't all the games or apps that other devices have the Apple TV has Netflix and Hulu Plus...which are all I need it for! Very please with the device only problem is when I use my remote I have to stay away from my macbook pro other wise Itunes will turn on.", "verified": true, "helpfulness": "1/1", "author": "ash"}, {"rating": 3.0, "review": "Ok, I bought this product thinking I can share my music and video from my iPhone and iPad using my home entertainment center and TV and it does work great and everyone is happy. Now, another feature of this product is to be able stream and/or download movies to watch. Well, streaming works fairly good depending on the sites you go to such as Netflix BUT if you go to the Apple site and try to download a movie to watch, forget it, you might as well get in your car, drive to the video store, rent a movie, go have dinner with family, stop for gas and come home and then \"maybe\" the download is complete. Bottom line, good for music sharing and streaming video, not so good for downloading.", "verified": false, "helpfulness": "2/3", "author": "Sachimo"}]