[{"rating": 5.0, "review": "This is my 4th Apple TV unit cause I'm too lazy to just have one.  I don't have to move the unit from room to room.", "verified": true, "helpfulness": "0/0", "author": "Rick Anderson"}, {"rating": 5.0, "review": "Best item we ever bought.  Makes me want to give up cable TV forever.  This provides me with programming I want when I want it.  I love it.", "verified": true, "helpfulness": "0/0", "author": "DR"}, {"rating": 5.0, "review": "Been an Apple user for a few years with a substantial investment in content.  I love using this little box to share my collection, stream from other devices.  Glad I have this!", "verified": true, "helpfulness": "0/0", "author": "Will Fugette"}, {"rating": 5.0, "review": "Simply the best ever for movies, shows and integrated with my laptop, iPad, iPhone and best of all can photo stream.", "verified": true, "helpfulness": "0/0", "author": "Rocstar"}, {"rating": 5.0, "review": "I purchased the Apple TV to be the solution for using my iPad to present to an audience. I haven't had the chance to use it for that purpose yet, but in the meantime I'm thoroughly enjoying streaming Netflix and others. I prefer the Netflix Interface on the Apple TV to the one on my Blu-ray player. The same is true for several other services available on both devices.  It also seems that the Apple TV stream slightly faster than the Blu-ray player.I'm quite pleased with my purchase even though I have not used it in the way I intended… yet.", "verified": true, "helpfulness": "0/0", "author": "Sally Lawrence \"Home Sales Sally\""}, {"rating": 5.0, "review": "Great...Finally I can show all my Family & friends all those pictures & videos that have been saved for years in my Mac . Now we can all enjoy them on our big screens at TV's.Still figuring out all the other features that only Apple TV offers....thanks for such a prompt delivery of such a wonderful item.", "verified": true, "helpfulness": "0/0", "author": "R. Almeyda \"Roberto E\""}, {"rating": 4.0, "review": "Lots of pre-loaded apps.  Purchased as a gift, but most apps were already available on his blu-ray player.  Only uses it to push music and video from his iPod Touch and iTunes from his computer.  There are a few free apps for viewing movies, but we don't have a paid hulu, netlix or other subscription. Maybe down the road.  We were also hoping to hook it up at his mother's house to do a slideshow from his iPod, but the unit requires wi-fi/internet access as well??  She doesn't have that.  It's an okay product for people with Wi-Fi/Ethernet internet access and non-smart TVs.", "verified": true, "helpfulness": "0/0", "author": "John A. Zapetis \"compugeek\""}, {"rating": 2.0, "review": "We really were looking forward to Apple TV but once we got it we found you can use it for much more than mirroring stuff to your tv. The biggest disappointment is the limited apps and the ones you can get you have to pay for everything. Hindsight we would just upgrade our tv service for Dvr and sling box.", "verified": false, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "I bay thes apple tv becos its naic its hd 1080 iAnd vere good for my home and for my tv lcd", "verified": true, "helpfulness": "0/0", "author": "eihab"}, {"rating": 5.0, "review": "Our church uses this for projection of songs and Bible verses. I imagine we will also use to show movies in the future", "verified": true, "helpfulness": "0/0", "author": "Bradley"}]