[{"rating": 5.0, "review": "I own both the new Apple TV (1080P/2012) model and the Roku2 XS. I found myself doing a side by side comparison of the two products and here are my findings.AppleTVPros: Works out of the box, minimum effort to setup, really easy to use interface + wifi. Can Restream old purchased episodes. Netflix App much cleaner and more superb. Streaming and buffering causes no delays or degradation of picture. AirPlay makes up for a lot of the limited channels (with Mountain Lion the functionality goes up even more). iPad Remote easy to useCons: Limited Channels...needs an open API like Roku to build more channelsRoku2 XSPros: Many Channels available, Cheaper ($10), Free Movie Channels like Crackle, AmazonPrime availability, Vendor neutral. iPad Remote easy to useCons: Missing iTunes integration, Poor quality and buffering (constant downgrading the image quality on NBA League Pass and Netflix). User UI is just bland and could be cleaner. Bugs and issues. Most channels you have to pay extra for. Roku disconnects from my wifi network randomly whereas the AppleTV never does during side by side streaming. Setup takes longer and more tweaking needed by the user.Summary:While the Roku offers you many more channels the end user experience on the AppleTV makes it much more simple to utilize. If you have some form of Apple Eco System then the AppleTV is for you. If you hate Apple then the Roku is for you. Each product has their own advantages and disadvantages. For me in the end it was about the user experience and ease of using the player and the AppleTV edged out. It's not to say I won't be using my Roku but until there are some updates to fix some of the buffers and issues the AppleTV is by far the better product.UPDATE: Completely Dropped my Roku in favor of Apple TV now. For some of the comments below I have a 30 Mbps down, 10 Mbps Up and being a network engineer and having quite an impressive armada of enterprise switches in the house I know it's not the network but the Roku. It's either the memory or the application code that keeps causing issues itself. Also for those that claim they cannot view movies due to apple protections...download airparrot and VLC. It works perfectly.", "verified": false, "helpfulness": "5/326", "author": "Ghazi"}, {"rating": 3.0, "review": "UPDATE: (03/17/2012) - It appears that the Apple iCloud streaming of purchased content is limited to those titles that have been authorized by the content providers.  So this is not a limitation of the Apple TV, but of the licensing agreements that Apple has made with the Studios.  I have changed the rating of this review to 3 stars until Apple can remove the content limitations. Sorry for the confusion.Original Review:A glaring flaw in the Apple TV is the inability to access purchased movies in the Apple iCloud without downloading it to a local device first (hard drive or iDevice).  This then defeats the whole purpose of having movies stored in the cloud.  What I expected was for Apple TV to allow storage in the iCloud and then playback of that content from the iCloud directly to the Apple TV without having to store it locally.  This would make for a nice comparison to Amazon or Vudu HD service.  While iTunes movie rentals are allowed to \"stream\", purchased content on iTunes is not allowed to \"stream\" from the iCloud to the Apple TV.While the other aspects of Apple TV have been reviewed at length, I will just point out this absence of functionality for others to consider before purchasing.", "verified": true, "helpfulness": "5/14", "author": "Zonker"}, {"rating": 4.0, "review": "we really like the apple tv.  the air play mirroring is amazing.  we are using airparrot to use air play for our mac book pro and of course our ipod and ipad has air play.  with our mac book we can watch hulu plus and amazon prime.  we love the podcasts and netflix content on the box.  the interface is great.  I cant wait to see where this goes.  I would love for some more apps on here.  apple tv is great if you have apple devices for the air play alone.  The only reason i am not giving this 5 stars is because of the fact you dont have hulu plus and amazon prime but with air parrot for your mac book you can!try the trial if you have a mac[...]we love it!", "verified": false, "helpfulness": "5/7", "author": "Daniel Tabor \"djtabor\""}, {"rating": 5.0, "review": "I have wanted to get an apple tv for the longest time due to the seamless experience with iTunes, and my iPhone and iPad. The one thing that kept me from getting it was that the previous version was only 720p. Well now that apple released the 1080p apple TV I finally took the jump and bought one. I can truly say I am very happy with it. With the apple TV I can access my music thats on my iMac, and with airplay i can start a movie on my iphone, or iPad and finish it on my TV. I have a ROKU and have enjoyed it for the last few years, but I always felt like it was missing something. I use my iPhone and iPad all the time so having a devices that seamlessly work together was important to me. Netflix is now also in 1080p so I don't just have to use my PS3 to get that kind of quality. For less than one hundred bucks with all the functionality that this little box does it is very worth it. If only it had amazon like the Roku this would be perfect.", "verified": false, "helpfulness": "2/5", "author": "Porfie \"Porfie Jr. Medina\""}, {"rating": 5.0, "review": "This is the third Apple TV that I have purchased as it is the easiest way to provide the Netflix experience to our TV's without the expense of true high end cable TV contracts.  A true bonus is the use of AirPlay via multiple apple OS devices we have in our house.  A BIG ease of use factor is the iCloud offerings of  our music and movies.  Gone are the boxes and DVDs.  The new Apple TV has a noticeable improvement on my large screen Panasonic TV.  The new upgrade to the software is so easy to use.  If you own an iPhone or iPad, be sure to download the free Remote app to control the Apple TV.  Highly recommend this!!", "verified": false, "helpfulness": "3/6", "author": "Richard H. Garrett"}, {"rating": 5.0, "review": "When Amazon released the Fire TV I rushed to buy one. I've plenty of Amazon hosted content and the prospect of a set top box which was both faster than my 3rd generation Apple TV and allowed for games made it seem like as great deal. So I did buy one, in fact, I bought two as I saw the opportunity for writing software for the big screen. But after a few weeks of novelty, my kids and I have reverted to using the Apple TV, although I will still switch over to the Fire TV now and then.The Fire TV is noticeably peppier given the newer processor in it. But this really only shows up in things that the Apple TV doesn't do, namely playing games. The more games I played on the Fire TV, the more I realize that Apple will have to release a 4th generation Apple TV with a dual core A7 and a beefier GPU  should they want to compete in the light set top gaming market. This current model is not going to be a competitive gaming platform. And that's OK.When it comes to what it does do, the current Apple TV is plenty fast at navigating, and displaying content. It shows 1080p high quality very well. Better, in my opinion than the Fire TV.  And the unified 2 dimensional grid interface used by the video apps on the Apple TV is more efficient than the haphazard interfaces seen on the Fire. The Netflix app on the Apple TV is noticeably more polished  and surprisingly given the hardware differences, much smoother scrolling than the utilitarian standard Android version distributed in the Fire TV App Store.  Since much of what we use a set top box for is watching Netflix, the more pleasant experience wins.As for controllers, the Fire TV remote is fine, and speaking into the voice recognition microphone, for that content it supports, is much nicer than arrowing around an on screen keyboard. But two things, it doesn't work everywhere not YouTube and not Netflix, and I don't use my Apple TV's remote. I pair a small Bluetooth keyboard, the kind found in iPad Mini typing cases, with my AppleTV and use it as my primary controller. Nicer than the remote, nicer than the iPhone remote App, nicer than the Fire TV and its fancy Bluetooth remote. It rocks when searching, jumping around lists and most importantly entering passwords.So, with a keyboard and a smoother Netflix integration, my family gravitates back to the Apple TV. But it is purchased content that keeps us there. We have a fairly large amount of movies bought from iTunes (maybe 100) and a huge number of TV shows and I don't care to have two places where I keep this content. Yes, this is the dreaded lock in but even if I were choosing a lock in today, I'd still choose iTunes for my content. One, every weekday there are free TV episodes to snag, and they are free longer, so I can bulk up on interesting new shows before choosing seasons to buy. There are a few free TV episodes on Amazon but there are only a handful at one time. Two, I have Apple devices and they are easily provisioned with movies or shows for trips or just watching from bed.  Three, I tend to think there is more HD content and the HD quality tends to be better. Having said that, it is a great feature of the Fire TV that it supports the Dolby Master Audio format, and not just Dolby Digital. I appreciate that Apple arranged its rights contracts such that I didn't have to pay to upgrade HD content from 720p to 1080p.We do switch over to Fire TV for Prime video content and dabbling with games.I hope Apple opens up the next Apple TV to 3rd party apps. That's a huge advantage of the Fire TV.I also have a Mac, and the integration of the Apple TV with OS X 10.10 has been quite flexible, and useful in a business setting or just as a way to share content amongst friends and family.Airplay support is one of the great advantages of Apple TV. I mainly use it to send music or podcasts to my home theatre speakers, but I have used it for sending Amazon Prime content to the big screen. I've even integrated Airplay support into my own apps I write, so I have one app that sends antenna signal quality to the TV and I had other drawing apps that show everyone what the user has drawn. It's a great feature, that I only wish more app developers took advantage of.People often ask why an iPad doesn't have an HDMI port. The AppleTV is the iPad's HDMI port, and a better than wired one that allows you to maintain mobility while still projecting to the big screen.Energy efficiency is first rate, at around a Watt during playback and practically nothing when asleep.I had to set the device to require a password for purchasing content from iTunes, and to enter my password via the Remote app on my iPhone, as otherwise, my naughty children would have purchased every episode of Fairly Oddparents. You can now setup sharing accounts for your individual children and be notified on your iPhone when they want to purchase something. The one problem with this setup is that purchases are not pooled in one location, so you end up searching in two places for your content.Keep an eye out for discount iTunes gift cards occasionally found online. You can often get content at 20% off via these deals.As for the differences between the 2nd generation and 3rd generation models, they are identical both in appearance and except for the 1080p capability in functions. While the newer model has a faster processor, in practice, the interface is zippy fast on either with any slowness due to network problems. If you don't have a 1080p TV, there is no reason not to stick with the 2nd generation, and even if you do, you might not notice a difference.  Both have gigabit Ethernet ports, and I recommend using a wired connection to your router if it is at all feasible.Apple is continually adding services, most of which I immediately disable. However, at a minimum, you should sign up for your free month's trial of HBO Now (just remember to access your account via iTunes and disable auto-renewal). Other third party channels I like are YouTube, Netflix, Crackle, Smithsonian, NBA, PBS, and PBS Kids. I used to record PBS programming a lot via my antenna, but now I often just get it on the Apple TV.So, in general, as an iOS user with a fair amount of purchased content, I've been happy with this device. It's my go to device for most of my  streaming needs. Still, I hope Apple takes Amazon up on the challenge and releases a more advanced, fast enough for games model with Siri integration and 3rd party gaming.", "verified": false, "helpfulness": "575/686", "author": "Glenn R. Howes"}, {"rating": 5.0, "review": "I pre-ordered this from Apple the first day I could and received it today (the 15'th) a day before you can actually pick it up in the Apple store. I upgraded from a first-gen Apple TV.So is it worth the upgrade?1080P is nice. REALLY nice. The new menu seems to work well too. But honestly, its just the 1080p thats the upgrade, but it's well worth it. You can see the difference easily and Airplay for me is a little bonus. If you sell your second generation Apple Tv on amazon it'll cost you about $30 to upgrade, if you sell your first gen (160gb) it could cost you as little as $6 for full high definition, and considering that 720P HD and 1080P HD on iTunes cost the same, if you settle for less it just seems like your getting ripped off.EDIT/UPDATE:As of July 31 2012 the Apple TV now comes with Hulu Plus, making it (for me) the perfect product.AirPlay has worked fantastically for months, I'm extremely happy with iTunes movie/tv show selection and the quality of it all as been amazing.", "verified": false, "helpfulness": "5/10", "author": "MyCreativePenName"}]