[{"rating": 4.0, "review": "Love it.  My only problem is there is no icon for my Amazon Prime like there is for netflix and Hulu.  You just hit airplay for AP but it really would be great to have an icon for this on the menu", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "Small and easy to use.  The remote is very small and does lip into couch easily.  But we love it.", "verified": true, "helpfulness": "0/0", "author": "RCA \"Fudge eater\""}, {"rating": 5.0, "review": "The best out there. I also purchased chromecast and i dont use it. Apple is simply the best out there", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "Christmas gift for daughter, she loved it! Didn't know what all it did, but my daughter loves the product alot.", "verified": true, "helpfulness": "0/2", "author": "Charles J George"}, {"rating": 4.0, "review": "My internet service didn't like it, my DSL speed is too slow.  So I gave it to my son in Philadelphia, and he loves it.", "verified": true, "helpfulness": "0/0", "author": "Pat Vanden Bosche \"PatVB Web Designs\""}, {"rating": 5.0, "review": "It does everything as advertised and I would buy it again. There are some issues. The normal volume setting on my receiver is 25 but I have to crank it up to around 55 when watching though the Apple TV.  Among the \"channel\" options is HBO Go, but not Showtime or Cinemax.  Hopefully, more channels will be added.  The content available through the premium network's online option is much broader than what is available through their \"on demand\" cable system.", "verified": false, "helpfulness": "0/0", "author": "Jeff Evans"}, {"rating": 4.0, "review": "Doesn't play amazon prime video, only sound. Works that way with other apps and games. But will mirror most videos and pictures and has apps of its own. Netflix, Hulu, hbo, to name a few. The amazon prime was a real disappointment for me because that's the reason a purchased it but I've grown to love it. It's definitely worth the price.", "verified": false, "helpfulness": "0/0", "author": "LisaC"}, {"rating": 5.0, "review": "Made by Apple.  Need I say more?But seriously.  Super simple to use.  Reliable.  Excellent content.  Seems to provide a better quality image for Netflix than my Xbox does.", "verified": true, "helpfulness": "0/0", "author": "David Coons"}, {"rating": 5.0, "review": "already own a first gen AppleTV and was game to try something else, so based on reading I did online and reviews, I bought a Roku 3 but was very disappointed by it, because it kept freezing during setup and I never even got to the point of using it. So I sent it back and bought a new AppleTV for my second TV. Stick with what you know, I guess, is the lesson.", "verified": true, "helpfulness": "0/0", "author": "Kieron M. Dwyer"}, {"rating": 4.0, "review": "I bought this so I can airplay my iphones screen to the TV.  It's awesome if you need to show off your pictures / videos or even better when you want to browse the internet with onlookers ..I use Netflix and stream movies from my itunes to the TV.Great little device for $99.", "verified": true, "helpfulness": "0/0", "author": "RJ \"Siric\""}]