[{"rating": 3.0, "review": "When I received it the battery in the remote was dead. It had not been cleaned out of who ever signed into it before. Took forever to get here.", "verified": true, "helpfulness": "0/0", "author": "Guinea Pig"}, {"rating": 5.0, "review": "The apple TV is fantastic. I can see everything I want in the TV. It is a good product. Thank you.", "verified": true, "helpfulness": "1/1", "author": "Virginia"}, {"rating": 4.0, "review": "Sorry, it is not a review. I am sure the Apple TV is very good for those within the Apple Eco-system, but for those who are not still a good one though Roku, WD etc may have better alternatives. Wanted to point out that the Apple TV this version has been long in the tooth for now and due for the next gen (better support for IOS7.1 etc) and possibly upgraded internals like dual processor, tie-ups with major content providers, more channels etc. If Apple hold the priceline then it would be worth the wait to get the next gen Apple TV.Edit March 2015 - Apple reduced price to $69 for this device, so Amazon msrp of $99 and therefore the implied savings are very incorrect!", "verified": false, "helpfulness": "1/4", "author": "Dealzguy \"Dealzguy\""}, {"rating": 5.0, "review": "I use it for netflix and for airplay.  it is almost a year and it is working fine.  if I didn't use it for airplay, I would buy a cheaper brand.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 4.0, "review": "Simple and easy to use, the AirPlay integration with iPad/iPhone works very well.  Selection of \"channels\" somewhat limited, you would get a lot more on the Roku.  But it was the AirPlay feature that had me get the AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Keith B. Silverman"}, {"rating": 5.0, "review": "We wanted to use our older tv as a smart  tv this works just great! Now my I pad can play on our tv and I phone.We love our pictures viewed on the tv from our iPad.", "verified": true, "helpfulness": "0/0", "author": "joseph h mayer"}, {"rating": 5.0, "review": "Having had a Samsung Bluray player with apps, a Sharp Smart TV, and a Roku, I bought an apple tv for the office and realized how much more of an exceptional experience it is.  We moved to Apple TVs for our house after that and we love it.", "verified": true, "helpfulness": "0/0", "author": "EJB"}, {"rating": 3.0, "review": "the video streaming is great but the sites to download from are limited.  If you want many different ways to stream content, look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Steve Murphy"}, {"rating": 5.0, "review": "Typical Apple product, works with an all things apple to mirror media to your tv. Can see why you'd buy a roku or another media player since it has more applications available to it (Amazon Prime for example), but for people that have an iPad and/or am iPhone this just seems like the right choice.", "verified": false, "helpfulness": "0/0", "author": "Brett M."}, {"rating": 5.0, "review": "Love this product. Much better than blu ray. Easy to use. I love it for netflix and renting movies:) great product overall", "verified": true, "helpfulness": "0/0", "author": "Briella"}]