[{"rating": 5.0, "review": "I bought my Apple TV through another retailer.  I have an iPhone 6 and for me the mirroring of my iPhone to the Apple TV is what makes this a 5 star product.  I can watch all my streaming apps including HBOGO, Netflix, and Amazon Prime, and anything online through the web browser on my TV and more or less this is exactly what I was looking for.I haven't even bothered setting my my iTunes account on the Apple TV, not sure why I need it unless they at some point offer a movie I'd like to rent that isn't available through Amazon.Renting a movie through Amazon once the movie is rented, it's as easy as open the app, turn on Mirroring (by swiping up from the bottom of the phone screen, pressing the AirPlay \"button\", select Apple TV and turn on mirroring) then close, hit play in the app and watch the movie.  The screen quality is exceptional, I've had no issues with buffering or freezing and while the movie or show is playing on my TV the iPhone seems to use very little power.All I can say is this is pretty freaking awesome for what I was looking for.", "verified": false, "helpfulness": "1/1", "author": "J"}, {"rating": 5.0, "review": "I must admit I am a bit addicted to Gadgets and I buy quite a few. My main reason for this purchase was for HBO Now release this April.I love my Apple TV.There are many free channels. It is sort of like a back-to-the-future modern day antenna providing you on-demand free programming, as well as your paid subscriptions in one convenient place(I also have Netflix). Streaming is mostly seamless --  I have my little apple TV box hooked up wirelessly in a second story home with my router on the first floor and the high-def delivery is amazing.I may end up dropping cable TV - haven't decided yet as there is still a lot of decision making/time investment in choosing what to watch on AppleTV, but I love the openness feel of the platform. This is probably the \"why\" Steve Jobs was not entirely happy with the UI experience. I'm definitely picking up another unit for our Cabin.If at some point they offer a favorite channels feature line up for \"instant\" viewing and easy channel switching across the providers that would be a strong push to saying goodbye to Cable.BTW - a lot of these providers include commercials. I don't mind that because the programming is free. I do take exception to that with cable TV - I have to pay them to watch their marketing junk. They should provide that for free IMHO given the amount of money they make off of selling it.One more thing to mention is that I love the feel of the Apple TV remote in my hand. It is small, round, weighted and has luxurious feel to it. Sometimes I like to just pick it up and admire the design. :)", "verified": true, "helpfulness": "2/2", "author": "Katherine Christensen \"A Rib from Eve - author\""}, {"rating": 5.0, "review": "Item as described, fast delivery. This item was a gift.", "verified": true, "helpfulness": "0/0", "author": "BS"}, {"rating": 4.0, "review": "Both of my units have worked from day one. No complaints here.", "verified": true, "helpfulness": "0/0", "author": "A. Grizzle"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 2.0, "review": "So after trying unsuccessfully for over an hour to get my new Apple tv to do anything close to entertainment I write this review in frustration.Background is that I own several iPads, ipods, kindle, google chromecast (one on every tv) and a FireTv.  Fire Tv gave some issues updating initially but after that 30 mins of hell, I could add apps in a second and I was up watching Hulu Plus, Netflix, Amazon Prime content, renting videos, downloading audio Bible and simply having fun. So why an Apple TV? Well Fire TV had this thing of freezing of the video while audio still running and after tiring of trying to reset the timeline on my favorite shows, deciding to try the mega machinery of Apple.  I mean 4.7 stars can't be wrong and the rave reviews on every Tech website swayed my better judgment (I left Apple in a divorce about 3 years ago when I tired of the hyped up performance of the iPhone).So... plug in the apple tv, connect HDMI, connect power and voila - pretty screen. Hmmm...look at the instructions..pretty vague but that must mean that it is really straightforward. Press Menu and There the screen goes to setting date and time...So as I look at the pending symbol, I awake from my trance 15 mins later to screen saver but alas still trying to set the date and time. Needless to say, even trying to bypass this, connect to my wireless networks and attempting to log into my Apple ID, the apple TV sits like a slim black box without an app, a movie, a song, a tune...It continually told me my Apple ID or password was wrong despite me rechecking on my iPads, my computer iTunes etc.The remote is silver, slim and very sleek BUT the arrow wheel is so stiff and close to center button, that the slow going of attempting to log in with a non Qwerty keyboard on the screen was torture.  Tried downloading Apple Remote on iPad hoping to connect to Apple Tv and use it as a remote...no luck. I eventually added a bluetooth keyboard.At the end of almost 3 hours, I gave up. No Apple online support group suggestions helped. I could not test my network without the date and time being set...could not connect to my Apple ID even though I inputted the correct password at least 10 times.Tech shouldn't be this hard...even if it is I won't put up with it because believe it or not, Apple rules the world by brainwashing people into thinking it does. So back to my Fire TV and Google chromecast combo...And back to the store you go Apple TV", "verified": false, "helpfulness": "0/2", "author": "Bong R \"Bong\""}, {"rating": 5.0, "review": "all ok...", "verified": true, "helpfulness": "0/1", "author": "brcotta"}, {"rating": 5.0, "review": "does the job", "verified": true, "helpfulness": "0/1", "author": "kim fitzgerald"}, {"rating": 5.0, "review": "As advertised", "verified": true, "helpfulness": "0/1", "author": "ERIK SIFTAR"}, {"rating": 1.0, "review": "I have the Amazon Fire Box, Fire Stick, and we just purchased the Apple TV box.  Out of the three the Amazon products are worth every penny over the Apple Box. Far easier to navigate and more choices and options.  Apple is not worth the time setting up.", "verified": true, "helpfulness": "0/1", "author": "Anna M Curry"}]