[{"rating": 4.0, "review": "The only reason it does not get a full score, is the lack of streaming from external servers / NAS devices.", "verified": true, "helpfulness": "0/0", "author": "Lars"}, {"rating": 3.0, "review": "The system was simple to set up but it just didn't get enough channels.  I already had a Roku 2 player but my mom, who lives with my wife and I, thought it would nice to watch YouTube on the TV.  She was not all that impressed and chose to watch it on her IPad instead so I returned it.  I don't really have anything negative to say about the box it just didn't meet the needs of the person who was going to be using it; my mom.", "verified": true, "helpfulness": "1/2", "author": "Craig"}, {"rating": 3.0, "review": "I know a lot of folks who praise AppleTV and when my Panasonic streaming device crapped out...I thought I'd give it a try.  Yes, I should have looked over the product specs in more detail but there were two reasons I was forced to return it.  One, it doesn't support Amazon Prime.  Two, you have to use the TV in order to stream music.  I ended up getting a Roku and an Airport for the music.  Apple needs to get this figured out.", "verified": true, "helpfulness": "2/3", "author": "Ojosv"}, {"rating": 5.0, "review": "I have an old Sony Bravia LCD TV, and it doesn't have a wireless connection. Well, it didn't. As soon as I connected Apple TV to my TV, I was able to use Comcast remove app with my iPhone because my TV got connected to the wireless network through Apple TV. So right now, in addition the great benefits of Apple TV, I can also control my TV from my iPhone, which allows me to get rid of at least one remote controller... I recommend this to every Apple user...", "verified": true, "helpfulness": "1/1", "author": "Can Sarisozen"}, {"rating": 4.0, "review": "Let me start out by saying I am comparing this product to other products I personally own.  Apple TV is still the best streaming and mirroring combo device.  If you own an Apple product like the iPhone, iTouch, iPad, and Mac, you can seamlessly stream video and audio content to the Apple TV on iOS devices and mirror your screen on Macs.  This is probably the most powerful feature of the Apple TV and why I love it.The problem with the Apple TV 3rd generation is that it is currently not able to be jailbroken and has not been for some time, that is why I do not use the Apple TV to its full potential, however I do on the 2nd generation.  With 1080 over 720 on the 2nd generation, sometimes I wish the 3rd gen can be jailbroken then it will truly deserve a 5-star rating and can be crowned the best media streaming device, period.", "verified": true, "helpfulness": "1/1", "author": "Tam"}, {"rating": 5.0, "review": "We have one of these at church for our projector for our Pastor to use with his iPad.  I loved it so much, I now have one at home!", "verified": true, "helpfulness": "1/1", "author": "P. Arceneaux"}, {"rating": 4.0, "review": "The Apple TV works, but setting it up is a challenge. I'm no novice to technology and I followed the prompts carefully, but could not get the Apple TV to recognize my iPad even though both showed up on the same WiFi. I searched the Apple website and internet for troubleshooting tips (not very useful) and ended up just trying as many things as I could think of, including starting over, shutting down, etc. I can't explain why, but it suddenly worked. I then attempted to set it up on a different WiFi in a different location, with the same results (long period of trial and error, followed by sudden connection after starting over, shutting down, etc.). Next came a different TV on the same WiFi, with yes, the same results. This is a pretty cool product, but my advice if you plan on using it for anything important is to set it up well in advance and leave it connected. No telling how long it will take.", "verified": true, "helpfulness": "0/1", "author": "okwoodworker \"okwoodworker\""}, {"rating": 5.0, "review": "I ordered this after I cut my cable. I have had no problems installing or using this product. Kids enjoy it as well.", "verified": true, "helpfulness": "1/1", "author": "Daniel"}, {"rating": 5.0, "review": "i bought this specifically to use in a slideshow picture frame. incredibly easy to set up and get going. had it running & showing pictures in less than 20 minutes. highly recommended!", "verified": true, "helpfulness": "1/1", "author": "Jason Hull"}, {"rating": 4.0, "review": "Like in the title, it's an apple product which says it all. It's easy to use, looks great, and has a sleek design. Anyone who wants the ability to have Netflix and other video streams without wanting to buy an expensive blu ray player or buy a gaming console should definitely get one. I don't even watch cable anymore and I have the elite package from xfinity.", "verified": true, "helpfulness": "1/1", "author": "Austin Milam"}]