[{"rating": 5.0, "review": "I had a Roku play for about 3 years that suddenly died.  Deciding this was a sign, I ordered the Apple TV and love it!!  The design is great and it is easy to use.", "verified": true, "helpfulness": "0/0", "author": "S. Harris"}, {"rating": 5.0, "review": "$100 one time fee vs $95/month to Dish Network. And that's with no movie channels. Here are 5 more words.", "verified": true, "helpfulness": "1/1", "author": "Ron Marshall"}, {"rating": 4.0, "review": "As a home and business custom audio visual integrator, we've installed more Apple TVs in our systems than any other AV product on the market. The best feature on the Apple TV is Airplay with Video. With airplay, you can wirelessly stream audio and video from anywhere on the WiFi network. It's so easy to use and allows anyone with an Apple device (iPad, iPhone, Macbook) to stream their content without having to download software, drivers or connect external dongles.With an Apple TV connected to an AV receiver and/or a nice HDTV, the audio and video quality are top notch. The built in apps like Netflix, Hulu, YouTube, Vimeo and 1000s of internet radio stations provide great entertainment all in High Definition. However, if it's not on the Apple TV, then you can use Airplay to view and listen to whatever app from your iPhone etc.From a business usage standpoint, the ability to wirelessly stream slideshow or video presentations to any attached video display makes the Apple TV an inexpensive digital signage solution. The possibilities are truly limitless.PROS: Super easy to use and works seamlessly with other apple products. High quality audio and video experience. Airplay is awesome.CONS: Occasional loss of network connection can confuse some users but simply powering off and then back on will fix it. Lack of RCA audio outputs can be limiting for people with older AV equipment.", "verified": true, "helpfulness": "2/2", "author": "Hawaii Installer"}, {"rating": 5.0, "review": "Love My Apple TV! It was a must have for all my other apple products. Love the air play with all the apple products.", "verified": false, "helpfulness": "1/1", "author": "Leticia Villagomez"}, {"rating": 5.0, "review": "Great product.  HOWEVER, a couple of useful tips:  You need a good wireless router, and, itunes should be your main storage source for your music, films, and photos if you want to fully utilize all the features this product has to offer.First, the router I had just didn't have the strength, so I got Apple's Airport Extreme which did a superb job.  Very few drops or buffering issues when streaming.Second, I love the features it has in regard to itunes - once you sync it with your itunes account, any movies, music, or photos you have on your computer can be streamed onto your TV with your Apple TV.  It also has a screen-saver feature which will \"slide show\" any picture collection you want to show up on your TV screen.  It also gives you multiple ways to present those photos in your screen-saver mode.You can also set up music files through itunes to play through you TV.  Very nice for dinner parties, holiday season, or just want to have music going on in your house while you do chores or whatever.It will only work for one TV so you will have to have an Apple TV for each television you want to stream on.  It does stream Netflix and Hulu Plus, but not Amazon.  It also has a \"movie-clips\" site from which you can view the latest movie promos.Overall, a very nice quality product - if you are committed to itunes.", "verified": true, "helpfulness": "1/1", "author": "Rusty Schucklefurd"}, {"rating": 5.0, "review": "All I can say is my family and I love it. Since we don't have cable tv it allows for is to watch tv show from our apps for free. I love how we can listen to music too and look at our home videos and pictures. If you can afford it buy it. Only complaint is it does not come with an HDMI cable.", "verified": true, "helpfulness": "1/1", "author": "Dottie"}, {"rating": 5.0, "review": "Fantastic! Only problem is that you get addicted and you want one for every TV & you then have to buy the additional accesories like the optics cable for sound & the HDMI cable for video.", "verified": true, "helpfulness": "0/0", "author": "T. J. Cubbedge"}, {"rating": 3.0, "review": "Read a lot about the AppleTV and wasn't sure if it was worth purchasing.  Decided to buy one for home and one for the office.  If you have any wifi products (tv, bluray, PS3) then there is no need for AppleTV.  The Air Play feature is nice but it only works for a few things.  I have DirecTV but that cannot be shown via Air Play.  So if you have any wifi products or are thinking this will be great for the air play feature, I would do some investigating before purchasing.  At $40 it would be ok.", "verified": true, "helpfulness": "0/0", "author": "tengleha"}, {"rating": 2.0, "review": "Many of the apps eg. showtime on demand etc do not allow steaming from ipads, iphones to Apple TV.  Air mirroring is also very temperamental and unreliable.  I specifically purchased this to watch old episodes of certain TV series and I am unable to watch them.  I think I will return the item.", "verified": true, "helpfulness": "1/3", "author": "Louis Salicrup"}, {"rating": 5.0, "review": "I love Apple TV, it does excellent job! If you are looking for something as a gift for someone, Apple TV would be a good choice.", "verified": true, "helpfulness": "0/1", "author": "Tung Hon Wong"}]