[{"rating": 5.0, "review": "I use only with an Iphone now but can't wait until I get the Ipad.  Already had a SmartTV for Hulu and Netflix that replaced the now obsolete Roku so I didn't need that feature.  Very simple to use with music, videos, pictures, YouTube, and probably more that I haven't seen.  It is great!", "verified": true, "helpfulness": "0/0", "author": "TerreHaute"}, {"rating": 4.0, "review": "This is astonishing to me that I cannot do a true \"mirror\" from my iPod screen to the big screen. Specifically I bought this device so that I could launch the HBO Go app and watch my paid subscription through Airplay on the Apple TV. But the app says it doesn't support HDMI output. It's unforgivable how limited the Airplay is and how it doesn't truly let you use all your device's apps on the big screen. This fractured experience just makes me want to veto the whole entertainment media establishment. Oh, BTW, the Apple TV is nice, as long as it lasts longer than my Roku (cheap box broke), and I like the movie trailers and all the other content in HD. Very nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Josh\""}, {"rating": 5.0, "review": "I live in a dorm, so the Apple TV's wifi related features do not work correctly yet, (They work at home) such as the remote app and airplay from an iOS device. But it is hooked into the ethernet and connects to my MacBook Pro through the ethernet network. I play my iTunes and mirror my desktop to it perfectly. It's hooked up to an Onkyo TX-NR616 and does everything perfectly. It outputs to HDMI and Digital Optical at the same time, which is perfect for when I don't need video. Overall it's a perfect addition to make listening or watching your media easier and better.", "verified": true, "helpfulness": "0/0", "author": "John S"}, {"rating": 5.0, "review": "Has opened up a whole new set of possibilities, from TV to movies, to music.  My only complaint is that it does not have Pandora available as an ap.", "verified": true, "helpfulness": "0/0", "author": "Kevin J. Keough"}, {"rating": 5.0, "review": "Great Christmas gift for my son and his family.  Cheaper than other places and fast shipping.  I Love Amazon.  He said it was really easy to set up and does much more than he thought it would.", "verified": true, "helpfulness": "0/0", "author": "Evil Lynn \"Linda\""}, {"rating": 4.0, "review": "Apple TV is Apple TV. $% cheaper than store. I use it to watch netflix, youtube and iTune movies. not quite developed other functions yet. I wish they can show Amazon instant movie soon, since their movie is often cheaper than itunes.", "verified": true, "helpfulness": "0/0", "author": "shirleyzhouzhou"}, {"rating": 5.0, "review": "Easy to instal and use. A must for IPAD users. a a a a a a a a a a", "verified": true, "helpfulness": "0/0", "author": "Robert K Sheehan"}, {"rating": 5.0, "review": "Plug and Play. Easy to setup. NO HDMI is a bummer. However, for 100 bucks, its not really a con. The glossy finish is nice, will leave fingerprints tho.", "verified": true, "helpfulness": "0/1", "author": "L. Targonski"}, {"rating": 4.0, "review": "On home videos, the WiFi has no problems streaming 720p from my server, computers, and iPad & iPhone but 1080p is too high bitrate.  Need to connect the cat5e to eliminate the intermittent buffering.  Other than that, works just fine.", "verified": true, "helpfulness": "0/0", "author": "victor schiller"}, {"rating": 5.0, "review": "Bought this for my boyfriend and he loved it! It was shipped fast with no problems. It is a little confusing for ME of how to get certain apps to show on tv.", "verified": true, "helpfulness": "0/0", "author": "Sandra R VonKannel"}]