[{"rating": 5.0, "review": "What is there to say? Both of mine work flawlessly. It integrates my TVs with my iPhone, iPad, and MacBook seamlessly. It streams HD without issue, it's a good buy for anyone.I just bought one for my Mother who isn't exactly tech savvy, but she figured mine out immediately, for the most part.", "verified": false, "helpfulness": "0/0", "author": "Justin K."}, {"rating": 5.0, "review": "works right and good price", "verified": true, "helpfulness": "0/0", "author": "csifife"}, {"rating": 5.0, "review": "Easy set up, pairs nicely with a Bluetooth keyboard. Movies stream instantly (with a fast internet connection of course). Love the user interface as well, better than a roku 3.", "verified": true, "helpfulness": "0/0", "author": "Gary F Williams"}, {"rating": 4.0, "review": "I use this in the playroom to play disney junior in HD (I only get it in standard otherwise). I like that you can play live disney Junior or previous episodes. I aao have used air play quote a lot, streaming YouTube videos from my phone to the Apple TV as well mirroring my Mac mini (to play some movies off of).Overall a great investment if you have apple devices. I am thinking about buying more.Only negative is that for some apps, I have to constantly reauthorize.", "verified": true, "helpfulness": "1/1", "author": "Christopher W. Chua \"CHAD\""}, {"rating": 5.0, "review": "Works well. Wish Directv would allow access to more of the channels.", "verified": true, "helpfulness": "0/0", "author": "Daryl R Hoffman"}, {"rating": 5.0, "review": "I gave as a gift! They were very happy.", "verified": true, "helpfulness": "0/0", "author": "Deena Butler"}, {"rating": 5.0, "review": "Love Apple TV.  Do not pay for cable tv any more.  Netflix, Hulu, and streaming movies from iTunes.", "verified": true, "helpfulness": "0/0", "author": "John M"}, {"rating": 3.0, "review": "Several times something has gone wrong with the Apple TV servers for our area and I sat down to watch TV with supper only to spend a 1/2 hour trying to get my show to play.  Also, Apple  À la carte is way too expensive for the average Joe. Discussed with Apple, it's not my home network or Internet provider.Originally, I thought AppleTV might be an alternative to DirecTV or cable, but now I only use it to stream iphone to TV, and not very often, I probably should sell it.  I broke down and got Time Warner again.  Time Warner is better now with the mobile apps to run the box.", "verified": true, "helpfulness": "0/0", "author": "Parzerot"}, {"rating": 5.0, "review": "Great product , new. App comes up. And while other people watch cable. I'm video streaming  Woohoo", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 4.0, "review": "This is one of the most entertaining home gadgets I own. I am pleased with the continual software updates, which have added streaming services where the subscriptions are compatible with iTunes. I have enjoyed Netflix, Hulu+, PBS, the History Channel, as well as the purchased movies and television programs in which I am able to view their high-quality display.So far as cons are concerned, the Amazon Prime app is not included, and that is a minus. Second, Pandora is left out, and in spite of iTunes having its own radio streaming service, which is available on this device, Pandora is still my favorite. And last, but not least, I wish that there was a much greater bluetooth compatibility range so that I could link it with at least my Bose SoundLink Mini Bluetooth Speaker or my Bose SoundLink Color Bluetooth Speaker.All in all, the Apple TV has been most instrumental in helping me reduce the amount of cable clutter that has existed around my TV, and if it could add its wireless capabilities in terms of linking with other devices, that would be an added plus.After owning Apple TV for at least two years and witnessing the evolving features that have surfaced over time, I have little difficulty endorsing it with four stars. It is surprisingly a product that one has reason to increasingly appreciate, especially in a perceived day and age of planned obsolescence.", "verified": false, "helpfulness": "0/0", "author": "JON STRICKLAND \"Jon Strickland\""}]