[{"rating": 5.0, "review": "We have 2 Apple Tvs in our house and have convinced my mother to buy one too.  Love the fact that you can Airplay pictures, video and music from your iPhone or iPads to the TV.  We used iRadio this Christmas to stream Christmas music through our stereo.  Netflix, HBO Go and rented movies look great, true 1080p quality.  I did have one box brick on me and had to purchase the USB cord separately, thats kind of pain.  The box was easily restored doing a back up from iTunes though.  Only negatives I'd say about the Apple TV are that you cant download new apps to it, Apple decides what apps there are and updates them through wireless updates to the box.  My other complaint would be that there is no Amazon Video app for the box yet.  You can Airplay Amazon video from another device though and that has worked just fine.", "verified": true, "helpfulness": "0/0", "author": "C. Riegle"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/1", "author": "Kyley Ochoa"}, {"rating": 5.0, "review": "It's our second one!Does what we need it to do...kids love it!", "verified": true, "helpfulness": "0/0", "author": "Darla Hey"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "michael p."}, {"rating": 2.0, "review": "I was excited to get the Apple TV but it was a great disappointment.  You have to pay and pay for everything.", "verified": true, "helpfulness": "0/2", "author": "Joseph D. Stimac"}, {"rating": 5.0, "review": "I upgraded my ATV2 to this ATV3.  I solved lots of issues with HD (runs 1080P) and seems to work more seamlessly with the whole Apple ecosystem.  Nicer menus, more Yosemite like.", "verified": true, "helpfulness": "0/0", "author": "Shade \"Shaded Shopper\""}, {"rating": 3.0, "review": "Great in many ways, but critical misses in others.  For streaming Netflix or similar, the AppleTV does a great job.  We had all kinds of trouble trying to play media from iTunes on a PC in the house, still haven't gotten that to work.  The remote software that will run on your iPhone or iPad is a great idea but does not work (can't find/sync with the Apple TV).  Finally, it's missing some big streaming services: Amazon and Plex.  Roku3 supports more streaming services (including Amazon and Plex), and it has an awesome remote with big features: RF transmitter (no need for line-of-sight between remote and Roku unit) and a headphone jack!  Great for watching in bed after your spouse goes to sleep!  For me the Roku3 is a better deal.", "verified": true, "helpfulness": "0/0", "author": "EquinoxV"}, {"rating": 4.0, "review": "I enjoy being able to air play my apple products. Very easy to use. I am not happy that it does not have Amazon prime on its menu and I have to play it through my device.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 4.0, "review": "My only issue is that it doesn't play all file types. other than that its a nifty little unit", "verified": true, "helpfulness": "0/0", "author": "Kasra Nourmofidi"}, {"rating": 5.0, "review": "Love it. Uses my in-house LAN and allows me to watch films that are on my Mac on my TV. Only internet traffic may interfer with the flow, but it's a really nice piece of equipment at a good price.", "verified": true, "helpfulness": "0/0", "author": "carpenter"}]