[{"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 3.0, "review": "what you can do is so limited, get a different one.", "verified": true, "helpfulness": "0/1", "author": "Coldray"}, {"rating": 5.0, "review": "I have it for more than 1 year, never had a problem, love this!", "verified": true, "helpfulness": "0/0", "author": "J. Garcia"}, {"rating": 5.0, "review": "Great product.  It supports multiple apple ID accounts and even some android phones when using the Allcast app.", "verified": true, "helpfulness": "0/0", "author": "Mario P."}, {"rating": 5.0, "review": "I just don't pay Cable anymore...", "verified": true, "helpfulness": "0/0", "author": "Alberto Muñoz"}, {"rating": 3.0, "review": "Pros:  Love the functionality of the product as I can now view items from my iphone and ipad on my TV.  Airplay works great.  Apple apps work rather seamlessly with the product, but non-apple apps can use some work (namely Netflix).Cons: The main reason I'm giving the product 3 stars is because of its connectivity.  I have it set up in my great room downstairs while my router is upstairs in the office.  After setting the product up with the network and using it with Netflix, I would continually get dropped connections.  After some time in the forums I found that setting my router to a static channel would help to resolve that issue, which it did to some extent.  After being on for several days, the Apple TV would lose connectivity and would have to be restarted before I could resume streaming.  When I had my Roku2 xd set up in the same location, I wouldn't have the same connectivity issues as the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "n sant"}, {"rating": 5.0, "review": "Work well", "verified": false, "helpfulness": "0/0", "author": "TX Buyer"}, {"rating": 5.0, "review": "LOVE this streamer. I love that i can get my music and movies on here with my apple id and stream other content like netflix and huluplus, cheaper than buying a smart tv, just need an HDMI tv. :)", "verified": true, "helpfulness": "0/0", "author": "Joy Brady"}, {"rating": 5.0, "review": "We use this daily.  Easy to use, and very convenient. We cancel cable too!", "verified": true, "helpfulness": "0/0", "author": "Kuniko K. Carpenter"}, {"rating": 1.0, "review": "Buying Apple TV was the biggest waste of money. I purchased from apple and they only give you 14 days to return. This pos never, and I mean NEVER works. Downloads take forever. Up to 40 minutes for an hour long show? It keeps telling you to download a lower resolution. It constantly give you \"error loading\" messages. Don't bother trying to watch a movie on a Saturday night with Apple TV unless you want your night ruined. Worst piece of crap ever! I have 3 rokus and those work so much better than this piece of junk. Apple should be ashamed to put their name on such garbage.", "verified": false, "helpfulness": "3/6", "author": "BinNJ \"BeagirlNJ\""}]