[{"rating": 5.0, "review": "Best purchase I've made even tho it's going for 69.99 now", "verified": true, "helpfulness": "0/1", "author": "Richard j."}, {"rating": 4.0, "review": "Works well.  Does not have amazon app.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The only issue I've had with this is that the audio isn't as loud when using the mirroring for watching movies from the laptop.  Configuration was very smooth though and I enjoy it when I do use it.", "verified": true, "helpfulness": "0/0", "author": "Aaron P. Beach"}, {"rating": 1.0, "review": "I'm not happy with the apple tv purchased through Amazon at all. The picture is very grainy and it wants to stream all the time, very unsatisfied!!! Wish I had hooked it up right away since now I can't even return it. $99 down the drain!!!", "verified": true, "helpfulness": "2/8", "author": "M. MADDOX \"music lover\""}, {"rating": 5.0, "review": "We love apple TV!", "verified": true, "helpfulness": "0/1", "author": "KM mom"}, {"rating": 5.0, "review": "Awesome ! I love the product and I saved a few dollars buying on Amzon. I am hooked on Apple TV , very simple to set up , tons of apps to use, and perfect to utilize other Apple products .I just wished I had a better remote and more apps on Apple TV. ( I do use my Apple Air for any app I may want to use , which so great !)", "verified": true, "helpfulness": "1/2", "author": "joezannafaith"}, {"rating": 2.0, "review": "Product was missing the HDMI cord.  It was included in the Apple TV I purchased three years ago from the Apple Store.", "verified": true, "helpfulness": "1/6", "author": "ckastl01"}, {"rating": 5.0, "review": "Love it so far. Fast and no lag. I will lose that bloody remote though, as it is teeny tiny. Great product.", "verified": true, "helpfulness": "0/0", "author": "Surrealist Sebastian"}, {"rating": 5.0, "review": "Great product but Apple sells them for $69.99 now", "verified": false, "helpfulness": "5/7", "author": "DZ"}, {"rating": 5.0, "review": "Excellent product, and I have two in my home. Instead of paying Comcast for cable TV we just get internet, then watch Hulu, Netflix, and HBO Go on the apple TV. If you don't have HBO Go, Apple just announced that you can have \"HBO Now\" on the apple TV for $15/month. This is the first time HBO has ever been offered without cable TV. To go with that announcement, Apple dropped the price of this item from $99 to $69, and Amazon has not yet updated their pricing ($92 at the moment).What sets the ATV apart from solutions like the Chromecast for me is how well it works in the Mac ecosystem. You can play all of your purchased movies and music from the cloud. You can also access the iTunes music and movies from any computer on the network. In my case, that means my external with 4TB of movies can play them on any TV in my apartment.Last but not least is screen mirroring. In addition to streaming a ton of content, and airplaying the content you can't stream, you can also mirror the screen and/or sound of your laptop or phone. That turns your TV speakers into a wireless MP3 player real quickly, lets you put a YouTube video on the big screen, or makes your office presentation that much easier to give.The Apple TV is an extremely versatile device, especially for cord cutters. The exclusive option to add HBO without a cable package makes it even more impressive for the new low cost of $69.", "verified": true, "helpfulness": "8/8", "author": "Ross"}]