[{"rating": 3.0, "review": "I bought this to replace my 2nd Gen Roku so that I could order HBO Now. In comparison to the Roku it has significantly more problems with crashing mid-program, and sometimes even jumping to the wrong episode of a show after it crashes. The design and interface is nice however, so I'll give it three stars. Hopefully forthcoming firmware updates can correct the crashing problem.", "verified": true, "helpfulness": "0/0", "author": "diane"}, {"rating": 1.0, "review": "It's been totally unstable for the last month or so. Crapping out at least twice a night", "verified": false, "helpfulness": "0/2", "author": "Greg Knott"}, {"rating": 1.0, "review": "This product is terrible; I've called customer service 4 times over the month I've had it only to be kept waiting for over 20 min each time. It often won't AirPlay and some apps consistently don't work, like Netflix. Save the cash & get chromecast", "verified": true, "helpfulness": "0/1", "author": "sunita mani"}, {"rating": 5.0, "review": "The Apple TV interface is great and visually appealing.Has many more features than other streaming devices.", "verified": true, "helpfulness": "0/0", "author": "C Stevens"}, {"rating": 4.0, "review": "It randomly shuts off and has trouble connecting to wifi.Other than that it works as labeled.", "verified": true, "helpfulness": "0/0", "author": "Ivy Baum"}, {"rating": 5.0, "review": "Excelent, it got to me on time, and it  was as described, brand new. I will buy again from this seller", "verified": true, "helpfulness": "0/0", "author": "carola orejuela"}, {"rating": 4.0, "review": "The only issue I had was having to have cable to access most over channel ap available. I also do not enjoy the fact there is no \"Home\" key so you may have to hit the menu button 4 times to exit a particular ap.", "verified": true, "helpfulness": "0/0", "author": "Brandon Kyle Holt"}, {"rating": 5.0, "review": "Works great, like all Apple products.", "verified": true, "helpfulness": "0/0", "author": "FLAMCHOP"}, {"rating": 4.0, "review": "difficult to initially activate", "verified": true, "helpfulness": "0/0", "author": "S. Jenkinson"}, {"rating": 4.0, "review": "2nd one we purchased, much faster than 1st generation. if allowed vudu or flixtser or amazon prime apps would give a 5 star hands down", "verified": true, "helpfulness": "0/0", "author": "Robin"}]