[{"rating": 5.0, "review": "It works fantastically well with apple devices. I love that I could immediately play videos from various internet sources, but also it was great for sharing personal photos and videos with friends! It was a little expensive compared to similar products such as chromecast or roku, but if you have iphones I would recommend getting the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Love the Apple TV, it sync's with all of my other apple devices and I can use my ipad and mirror it on the tv. My kids love this feature especially when they are playing games on the ipad and can watch it on the big screen tv. We also use it to watch Netflix and show off our pictures when friends are here. We can also listen to itunes over the tv as well.", "verified": true, "helpfulness": "0/0", "author": "Sherry Monteith \"sndmonteith\""}, {"rating": 5.0, "review": "This is the second Apple TV that I purchased.  One was a giftl, and the other I use.  There are other products out there, but  this one plays very nicely with my Ipad and macbook.  The other one is being used in a pc based environment as so far it is performing flawlessly.  I highly recommend the product.", "verified": true, "helpfulness": "0/0", "author": "GH"}, {"rating": 4.0, "review": "I owned a first-generation Apple TV and liked it. However, when I treated up to this current generation I like it much more. I'm very impressed with the user interface, and like the fact that it handles my Netflix and Hulu Plus subscriptions  as well as a variety of other networks and specialty programming providers. It's a shame that Amazon isn't represented, but, I suppose they are too much the competitors to allow such an arrangement. Likewise, with the up-and-coming Google TV. Fortunately, I have a Samsung intelligent television that works with some of these competing services.  I didn't want another box out in front of my television, so I bought an inexpensive hanger which mounts the very small and light Apple TV unit from one of the upper vent slots on my TV. The Apple remote is more than capable of handling this arrangement. I've also come to use the Apple remote app on my iPad, but as software goes I think it is as much a public beta as a real product.", "verified": true, "helpfulness": "0/0", "author": "Spike da Peke \"Spike\""}, {"rating": 5.0, "review": "Another milestone in my quest to replace ALL peripheral video services (ROKU, cable company, satellite, DSL) with internet based content streaming.Coupled with my Airport Extreme,  iPad 4 Retina, iPhone 4S, and soon-to-replace-cable-internet FIBER feed - I can access virtually ANY video streaming content source  and AirPlay to my plasma set!Amazon Prime, HULU+, Netflix, HBO-GO, major network apps - all play flawlessly through this compact, reliable device!", "verified": true, "helpfulness": "1/1", "author": "Stephen L. Phillips \"animal advocate\""}, {"rating": 5.0, "review": "I luv using my Apple TV for watching netflix and other shows.  Very easy to install.  There another brand (roku), haven't had a chance to really see how it compares to Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Winnie Hendricks"}, {"rating": 4.0, "review": "It works as advertised.  I like it , but volume is inconsistent and picture is not perfect in some cases.", "verified": true, "helpfulness": "0/0", "author": "Steven Solari"}, {"rating": 1.0, "review": "My Apple TV failed after warranty period. You have to pay to get support after that and it was an error code that I couldn't research or fix. I have an iPod 4 and an iPad 2 that I really like but I threw away my just out of warranty tv as it was useless. This was a very sad apple experience for me.", "verified": false, "helpfulness": "26/32", "author": "Undercross"}, {"rating": 5.0, "review": "Everything you need in one little box - ability to stream directly from your phone makes it super easy too!", "verified": true, "helpfulness": "0/0", "author": "sonja gould"}, {"rating": 5.0, "review": "This was exactly what I wanted and happy with my purchase from Amazon! :)  This was a better buy than in stores and did not let me down.", "verified": true, "helpfulness": "0/0", "author": "Erin Meehan"}]