[{"rating": 5.0, "review": "Apple TV is amazing! The Netflix interface is awesome and I love being able to stream content from my iPad or iPhone to the TV via AirPlay! I would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Jeff M \"jeffm\""}, {"rating": 5.0, "review": "I use it for access to iTunes music and movie purchases, streaming radio and podcast and most of all to airplay and stream my blu-rays and dvds from my Mac to the Apple TV and occasionally i would stream some Korean Dramas from the Mac to the Apple TV as well. Great value, and a must have for Mac and iOS users if you want to airplay mirror streaming.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm sure there are going to be a lot more detailed reviews of this product on Amazon. I wanted the ability to mirror what was on my iPad on my big-screen TV, and the Apple TV does just that. Great for watching YouTube, streaming videos or whatever (wink--wink) is on your iPad on your television screen. I'm not sure about the quality of streaming video, but the sharpness of some video may be affected by watching on a large screen. Does exactly what I bought it for.", "verified": true, "helpfulness": "0/0", "author": "D. Bratman"}, {"rating": 5.0, "review": "Got one for my husband for Christmas and one for my dad for his birthday cuz he liked my husband's so much. Really nice to control from our phones when we want to watch Hulu or Netflix or use our iPads on the tv. My husband suggested we get one for our other tv, too.", "verified": true, "helpfulness": "0/0", "author": "BeepCruz"}, {"rating": 5.0, "review": "I purchased this to watch Netflix on my HDTV as well as to mirror streaming websites and other things from my MacBook to my TV. Works well. Easy to set up. I like that it is so portable so that I can switch tvs with it. It does require an HDMI cable sold separately. I bought an extra cable so that when I use it on my other tv I don't have to reach behind my wall mounted tv to unplug the HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Michelle D."}, {"rating": 4.0, "review": "If you want to play music via itunes this is great. If you want to see your desktop on the TV, this is great. You wanna watch netflix? Sure, great choice. Roku does not support 1080i-- found that out the hard way. But it is not without it's flaws. No pandora. Limited to what can be done with it as far as apps. I'm not sure what else you would want, but there is not an ability to get more apps. I don't have an iPad, yet. Look I am a slow adopter and I don't drink the apple \"kool-aid\". HOWEVER, I gave the HD kindle fire a go (probably need to leave a review for that one elsewhere), and was not impressed. Great for reading books, well not great but works well at night, but everything else was not great. I have a masters in MIS and was completely lost on downloading apps-- never could find them... Wow. Tangent anyone? Sorry. But for 99 bucks or less this little box is worth it. Just do it if you are thinking it. For me it's worth the netflix option. Sad and true.", "verified": true, "helpfulness": "1/2", "author": "Brian Hodges"}, {"rating": 5.0, "review": "I ordered this for my boyfriends birthday since he's a huge apple fan and it exceeds mine and his expectations. It's marvelous for watching Netflix, playing games, browsing his photos whenever we get back from a trip, we sometimes listen to music while doing other things in the house, it's an absolute great buy!", "verified": true, "helpfulness": "1/2", "author": "Morgan"}, {"rating": 1.0, "review": "The only reason we purchased Apple TV was to view our Amazon Prime content. Come to find out the Amazon Prime Instant Video app disables Airplay on Apple TV. So, that means you cannot watch Amazon Prime videos on your television when playing them from your iPhone. You know Apple, we would have bought content from you (new releases, etc). Now I am just one peeved customer who will not be shouting \"Apple TV\" from the mountain tops.We will be returning this unit.", "verified": true, "helpfulness": "5/12", "author": "Courtney"}, {"rating": 5.0, "review": "I love Apple TV, it is much quicker/easier to navigate Netflix and other features then other streaming devices I have seen.", "verified": true, "helpfulness": "1/1", "author": "Matt Pridgen"}, {"rating": 4.0, "review": "Neat. Minimalistic. Cool. Would probably get lost in a move it being so small but nicely built. Probably get another", "verified": true, "helpfulness": "1/1", "author": "khaim korii"}]