[{"rating": 5.0, "review": "Bought one for myself to experiment with and found it so useful that I bought several more for Christmas presents.", "verified": true, "helpfulness": "0/0", "author": "Charles Chesnutt"}, {"rating": 5.0, "review": "Got this for my husband who is into gadgets for Xmas. Was amazed at how easy it was to use, even the kids can do it. Works flawlessly with our iPads", "verified": true, "helpfulness": "0/0", "author": "Jonathan S. Blank \"LoveGhostStories\""}, {"rating": 5.0, "review": "Pros: easy to setup, even for the less talented.60 days Apple support.Small footprintDoes as promised, and as with other Apple products, playing with it gives you even more.Amazon has a better priceEverything is sealed in the package ( as is Apples policy) you absolutely know this new and the real thingI assure you this is the newest version, the older version is higher priced because it can be \"\"jail broke\" which makes it able ( with geek experience) to stream things out of the Apple intentions. You don't have to be concerned with that detail or you wouldn't be reading this.With 1020 picture capabilities, the picture is stunning.I use this with my iPad. You can fiddle around and find what you want somewhere.Con: no Prime Amazon streaming vids. Apple, you will have to make nice with Amazon or you are going to lose customers. I do get Prime Amazon streaming vids on a app on the iPad. I will just have to get by with that until they get that settled.", "verified": true, "helpfulness": "1/1", "author": "Cynthia R. Peterson"}, {"rating": 4.0, "review": "Pros- It is as good as the ROKU just a different format layout of displays etc..I have both the Apple TV and the ROKU and don't regret the Apple TV- It give you options to watch TV. For example I use Apple TV to watch Youtube/ ROKU to my knowledge does not have the icon for Youtube.Cons- Remote is too small and easy to hit the center point when you want to hit the sides. Also my version of iPhoto is not current and will not work with the Apple TV.  The Apple TV recognizes this and instructs you to buy the latest iPhoto app at the iTunes store.For $89 and free prime shipping: I would recommend it and I would buy it again because it gives me options away from my basic cable source.Update Dec-30th 2013: I asked my teen daughter which see likes better the Apple TV or ROKU and she said Apple TV because it was much faster than ROKU to access programs.  I'd never considered this point so keep that in mind when considering one or the other.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "The Apple TV made life easier for me.  I have twin great nieces living with me while they attend college and purchased Apple TV to minimize arguments related to viewing choices. We created separate accounts and respect the varied viewing selections  (not me-I pay the bills!). It was easy to assemble, which they did without a problem. The price was great and the order arrived earlier than expected!", "verified": true, "helpfulness": "0/0", "author": "Vivian Johnson"}, {"rating": 5.0, "review": "Love my apple tv and when I had issues, Apple customer service was awesome!", "verified": true, "helpfulness": "0/0", "author": "Deborah A Pilon"}, {"rating": 5.0, "review": "I have already been using one of these for a Year or so. I love it so I ordered another one for a gift.It is awesome.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 4.0, "review": "Awesome product if you are an apple user!  Even if you don't prefer apple products and rather use other devices... this little box is great to have if you are always online and have the TV going!  Go out and get one on Amazon when it is cheaper (bought on Black Friday & price didn't change when it was Cyber Monday).  Best thing about purchasing from Amazon.com:  No tax! (well, at least in my state)", "verified": true, "helpfulness": "0/0", "author": "Amazoncritic"}, {"rating": 5.0, "review": "This is great! I have been wanting a smart TV and this was a great answer to this! works great with my iphone 5", "verified": true, "helpfulness": "0/0", "author": "Abel G."}, {"rating": 5.0, "review": "Finally something that can be used out of the box. There is one flaw in that the remote quite small and is easily lost, which means no operation. However a minor issue..", "verified": true, "helpfulness": "0/0", "author": "Jeremy Barrett"}]