[{"rating": 5.0, "review": "I have become an Apple guy. I bought this because I have an iPad and an iPhone and I love the cross functionality. I love being able to mirror either device to the TV screen. If you have an Apple device this is a great addition.", "verified": true, "helpfulness": "0/0", "author": "Nicholas James Jeffrey"}, {"rating": 3.0, "review": "The primary reason for buying this product was to view Netflix.  This was very satisfactory, even over WiFi.The disappointing part of the purchase was using it to play iTunes. It would play one or two tunes and then stop.  It would resume if I restarted iTunes on the PC, but then stop after one or two tracks.  Reading the forums, this appears to be a common fault on Mac and PC, which Apple have ignored.Had I realised this before, I could have saved some money and bought a Roku.", "verified": true, "helpfulness": "0/2", "author": "Keith E. Ridley \"Keith\""}, {"rating": 5.0, "review": "What a great idea everyone in my house has iphones we can all control it so cool! If you have a netflix sub like we do then its REALLY worth it!", "verified": true, "helpfulness": "0/0", "author": "Cathy M \"Cam1615\""}, {"rating": 4.0, "review": "I replaced my original apple tv with this upgraded model and man is it faster!  I have an ipad 3 and using the screen mirroring is awesome!  I gave it 4 stars because I had to replace the first one I got because the ethernet port died on it.  I took it to apple and they replaced it, no charge.  Great customer service!  At least at the store I went to.", "verified": true, "helpfulness": "0/0", "author": "B. Clark \"G35\""}, {"rating": 3.0, "review": "It's basically what I expected, but the account logic process was more difficult than it should have been, and it still won't run a software update, every time I try it, it fails. It also still won't see my iTunes library, even though everything is set up correctly. The video portion of AirPlay works great, but mirroring the screen of the iPhone or iPad, or laptop looks like crap. I still like it for airplay, but it's not anywhere near my expectations for an Apple device.", "verified": true, "helpfulness": "0/3", "author": "Alex"}, {"rating": 5.0, "review": "If you use iTunes & Netflix at all and have a HD TV this will be the best $99 you ever spend.I listen to all my music watch all movies through it. My bluray player is a giant paperweight now.Also bought an app for my iMac, Airfoil, and can now also stream Sirius Internet Radio through my TV using the Apple TV airplay feature.", "verified": true, "helpfulness": "0/0", "author": "Levinson Design"}, {"rating": 5.0, "review": "Being that this is an Apple product, it is just as I expected... Fantastic! There have been no issues thus far. A must buy!", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 5.0, "review": "The picture quality is awesome!!  Nearly as good as my blu ray.  Product just runs very well.  This was a good buy from Amazon.  It functions even better in an Apple ecosystem using the Mac, iPod, or iPhone.  Make sure to load all of the TV website apps that you can like ABC, NBC, etc.  They will most likely play smoother when using airplay.  That will allow you to stream free TV shows.  Bye Bye cable bill!!  We now only pay $7.99/mo for Netflix.  The rest is free streaming and local channels using an HD antenna.  Save $$!!", "verified": true, "helpfulness": "0/0", "author": "Adrian Johnson"}, {"rating": 5.0, "review": "Never seen it for less than MSRP before, great price and of course great product- but it's an apple product so you knew that!", "verified": true, "helpfulness": "0/0", "author": "victor lucas"}, {"rating": 4.0, "review": "Nothing on this thing is free except if you have any movies of your own (and you have to convert them into a special aTV format you cant watch .avi) 1080p is great, it even has that extra clarity that apple products have these days, Once this thing can be jailbroken it will be unstoppable.", "verified": true, "helpfulness": "0/0", "author": "Nathan Engel"}]