[{"rating": 5.0, "review": "I can use it perfectly with my SLOOOOOW internet, everything is great. The only thing that I don't like is that it has no safari explorer and can not access to the description of youtube videos (or  I have not discovered how to do so). I HIGHLY reccomend to buy the HDMI cable with this product because you will need it.I love it!", "verified": true, "helpfulness": "0/0", "author": "Endrina Castro"}, {"rating": 5.0, "review": "The advantage of Apple TV over the competition is the ability to display images from iPhone, iPad or other Apple devices on TV via Airplay.  We're still exploring other cool things it will do.", "verified": true, "helpfulness": "0/0", "author": "TaxGuy"}, {"rating": 1.0, "review": "If I could go lower I would. I mainly bought this for movies I downloaded on my iPad to watch in hotels or when I'm home. Everything works fine except AirPlay, that's the main issue. I get about 4-5 minutes of watching a movie or video, then the screen freezes and the volume continues. This happens for about 10 minutes at a time every 5 minutes or so, makes it very very annoying. Contacted Apple and got the usual about make sure you have the newest updates, your signal strength is strong, and there's nothing interfering with the air sync. Did all that plus restarted the machine and it still does it. Bottom line is if you are looking for something that has Netflix, Amazon, and other video watching service then there are several that are cheaper than an AppleTv that work just as good. About to box mine up and take it right back.", "verified": false, "helpfulness": "0/1", "author": "strawn"}, {"rating": 5.0, "review": "The Best!!", "verified": true, "helpfulness": "0/0", "author": "Rick Hagen"}, {"rating": 2.0, "review": "I've love our Apple TV !!!", "verified": true, "helpfulness": "0/3", "author": "Barbara Carpenter"}, {"rating": 4.0, "review": "Works better when I changed my internet service.  It does just what it said it would do", "verified": true, "helpfulness": "0/0", "author": "Nancy henderson"}, {"rating": 5.0, "review": "great item for tv", "verified": true, "helpfulness": "0/0", "author": "Joseph Campagna"}, {"rating": 5.0, "review": "Does a great job and makes life easier", "verified": true, "helpfulness": "0/0", "author": "robert sasson"}, {"rating": 5.0, "review": "I gave this as  a Christmas present.  They hooked it up very easily and love it!", "verified": true, "helpfulness": "0/0", "author": "Lovet2travel"}, {"rating": 5.0, "review": "Love this! Super easy to install but be sure you have an HDMI cable", "verified": true, "helpfulness": "0/0", "author": "Judi Houff"}]