[{"rating": 5.0, "review": "Chromecast is freaking AWESOME for $35!  I spent more on my LG 'Smart' TV and the Netflix/Hulu apps are rarely stable and constantly force me to re-sign back in.  Same goes for my Panasonic Blu-Ray surround sound (which sounds great otherwise).  This thing is far more stable, loads faster and overall has been much more used than the TV or Blu-Ray apps since I got it a few weeks ago.  Sure I'd like a few more applications to work on it (PLEX PLEASE!!!) but so far it's exceeded my expectations, ESPECIALLY FOR $35!!!  The only thing I don't like is Pandora doesn't do the screensaver thing that Google Play does (but that's not anything to do with the CC itself).If you have issues with your current hardware like me you'll absolutely love CC.", "verified": true, "helpfulness": "0/0", "author": "ZK"}, {"rating": 2.0, "review": "Limited, causes disruptions in Wifi, had to remove its power to get home network working…..I would not buy this again.", "verified": true, "helpfulness": "0/0", "author": "Jim Cromwell"}, {"rating": 3.0, "review": "The Chromecast doesn't yet work with Chrome for Android which was one of my main use cases. I want to be able to push content from a tablet when surfing the web and want to share with other people in the room.", "verified": true, "helpfulness": "0/0", "author": "Simon Lamb"}, {"rating": 2.0, "review": "Not that useful only works with youtube and chrome browser.  If they make this compatible with airport would it be a superior streaming device.", "verified": true, "helpfulness": "0/1", "author": "Carl Angervall"}, {"rating": 4.0, "review": "once u get it started It's awesome, it loads quick, ( I get Netflix started quicker then when I'm trying to via the app on my LG Blu-ray Player.But to get the damn thing started, jeez .. first off I plugged the thing in and.... voila no image, tried another hdmi port nothing.. tried the reset button.. nothingI was kinda getting mad on the damn thing when I started googling the problem...very important READ:it seems that on some chromecasts, the reset button is stuck.. you should press it different times after another...inserted it again and boom it worked. It worked ever since.. it works awesome.I personally don't have it plugged in my TV now, but in my sound system's hdmi port. works great and now I can enjoy the surround sound of Netflix etc.I just wish Google would release it in the Netherlands officially so more apps would be available.. now I'm stuck with Netflix, Google Play Music (works great also) and Youtube..Google please release Google Play Movies in the Netherlands... thank you and goodnight", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 4.0, "review": "Very good, works like a charm! However, lack of apps made me give only 4 stars. Definitely needs more support from apps. General display sharing from mobile phone would be really useful.", "verified": true, "helpfulness": "0/0", "author": "Mikko Lähteenmäki"}, {"rating": 5.0, "review": "Awesome gadget to convert your normal tv has su smart. Its great to use Netflix or YouTube at tv. I like so much.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Great gadget for little money! Works like a charme and does exactly what it's expected to do... not more, not less :-)", "verified": true, "helpfulness": "0/0", "author": "Kristian Peetz"}, {"rating": 5.0, "review": "Best thing ever!! Simple, useful, watch my chrome tabs and youtube on tv!! And for the price it is worth it.", "verified": true, "helpfulness": "0/0", "author": "Isauro"}, {"rating": 5.0, "review": "I really love it. It is easy to set up and works flawlessly. I recommend this product if you wasn't an easy way to get internet content and music into your living room.", "verified": true, "helpfulness": "0/0", "author": "Niko"}]