[{"rating": 2.0, "review": "instructions are so difficult yet so seemingly simple, took me 3 days to get it to work, through trial and error.  Boy there are a lot of errors.  Got it to cast from my laptop, but from the phone, forget it.  Great when it works.  Keep the $35 and try to improve it.", "verified": true, "helpfulness": "0/0", "author": "Don winckles"}, {"rating": 3.0, "review": "I purchased this because it's the cheapest media streamer on the market and if you need to stream Youtube or Netflix to your TV, this is your streamer.  However, it's streaming services are very limited.  There is no Amazon Instant Video support which is very disappointing and no screen mirroring from your phone.If you can still get this with the free Netflix, get it.  If not, then  hold off for version 2 or some more software upgrades.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "My wife and I have been watching movies from Netflix. Setup was easy-peasy. Now that the Hulu-Plus app is Chromecast ready we will be trying that. the You Tube app works great, too. Only wish that BBC America wasn't doing an exclusive with Apple. A number of things from them I'd like to watch not least of all Classic Dr Who.", "verified": true, "helpfulness": "0/0", "author": "D. Baker"}, {"rating": 5.0, "review": "Works fantastic with my pc, nexus 10 and nexus 4!  I don't have much else to say but amazon is making me!", "verified": true, "helpfulness": "0/0", "author": "Riju"}, {"rating": 1.0, "review": "Received the product, and was unable to connect it to my router. The tech support was totally INADEQUATE. Told me it was a router issue that they could not help me with. Called the router company, and tried to re-configure but no help. Surprised that Google would roll out a product that was supported so poorly .", "verified": true, "helpfulness": "1/3", "author": "Lewis Radoff"}, {"rating": 3.0, "review": "Honestly, I haven't used this thing since day 1. Ill use it again when they cast local content. one two", "verified": true, "helpfulness": "0/1", "author": "Ben H."}, {"rating": 1.0, "review": "It does not support youtube playlist, choppy chrome browser support and doesnt have amazon prime video support. I bought it couple of months ago and didnt use it after the first day of testing, waiting for more feature.", "verified": true, "helpfulness": "1/2", "author": "Ari Z"}, {"rating": 5.0, "review": "Good product easy to set up .can't beat the price. Just plugged it into my hdmi switched the corresponding input on my remote and set it up, takes 5 minutes. What I liked about this is that it gives you an option to plug it into an outlet or it comes with a usb cable to connect to a USB port on the  TV to power chrome cast. Like the fact that i can use my galaxy note 3 has a remote to pick the movies via Netflix app and play them on my TV. I can pick any movie during the day save them to my list and watch them when ever. Also one less box to dust off on my TV shelves. You can even see the chromecast device, so that's good if you like to avoid  Clutters of modems and cable box...etc. Overall good pruduct.", "verified": true, "helpfulness": "0/0", "author": "El Panda"}, {"rating": 5.0, "review": "$35?  And I can show anything from my browser on the tv?  And Netflix at full resolution?  Seriously?  Google rules!", "verified": true, "helpfulness": "0/0", "author": "SoCoastInt"}, {"rating": 4.0, "review": "I like everything about it. Just needs more apps. So far only utube and Netflix apps are available. The units works perfectly with these apps.", "verified": true, "helpfulness": "0/0", "author": "Kenneth J. Wieder"}]