[{"rating": 5.0, "review": "Best $35 I ever spent! Get it NOW!", "verified": true, "helpfulness": "0/0", "author": "Javier Revilla"}, {"rating": 5.0, "review": "I am delighted with this chrome cast, I can watch many programs just by clicking in my tablets, movies, news and more .Thanks.", "verified": true, "helpfulness": "0/0", "author": "Jose A Medina"}, {"rating": 5.0, "review": "Got it as a gift and they love it.", "verified": true, "helpfulness": "0/0", "author": "Michelle Cabral"}, {"rating": 5.0, "review": "It works very well and came in perfect condition in its box", "verified": true, "helpfulness": "0/0", "author": "J. Rincón \"Joh\""}, {"rating": 2.0, "review": "Using this to view HD video over a home WiFi network doesn't seem to work .  The host computer and the HD monitor are both on the household WiFi channel.  My guess is that the signal has to be sent first to the host computer and then, again, to the device into which the Chromecast is attached.  This double stream appears to swamp even my N-type WiFi configuration.  Perhaps I'm missing something in the configuration, but I can't get it to work at reasonable speed.  Using a wire instead of Chromecast works fine.", "verified": true, "helpfulness": "0/2", "author": "ground truth"}, {"rating": 5.0, "review": "easy to use, and works perfectly with my RCA tv", "verified": true, "helpfulness": "0/0", "author": "Mauricio Bolanos Sanchez"}, {"rating": 4.0, "review": "I would give it 5 stars but you have to put in your wireless password to often or reboot.", "verified": true, "helpfulness": "0/0", "author": "D. Wright"}, {"rating": 5.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "Daniel Rodriguez"}, {"rating": 2.0, "review": "picture and sound quality are a letdown!", "verified": true, "helpfulness": "1/3", "author": "john shaheen"}, {"rating": 5.0, "review": "This device is very useful nothing can beat it in its price range. The only problem I have is that I wish Google would get moving and get more apps for it.", "verified": true, "helpfulness": "0/0", "author": "Infante"}]