[{"rating": 5.0, "review": "This thing is great.I still haven't gotten to half the apps that this has got.very happy.doesn't freeze up .easy to search for prime movies.very good for the price.", "verified": true, "helpfulness": "0/0", "author": "jac"}, {"rating": 5.0, "review": "thank you", "verified": true, "helpfulness": "0/0", "author": "JAHmilah S."}, {"rating": 2.0, "review": "Not what I expected. Some items will not load and others are too expensive. Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "CHARLES L. MEADOWS JR."}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Herrington Family"}, {"rating": 5.0, "review": "Great product I have more than one!", "verified": true, "helpfulness": "0/0", "author": "Joeave"}, {"rating": 5.0, "review": "Bought this when my Apple TV was being throttled by my internet provider(s).  I have two separate high-speed connections from two different providers - both would often take over an hour to load content on the Apple TV.  The Fire TV box is a great value and it works.  I really like the voice search feature.", "verified": true, "helpfulness": "0/0", "author": "Jion"}, {"rating": 5.0, "review": "Great device. Wish they they would hammer out a deal with HBO for standalone streaming.", "verified": true, "helpfulness": "0/0", "author": "Charles Cousar"}, {"rating": 4.0, "review": "Has moments when picture and execution are flawless, and at other times there are pause-glitches and stutter. This could be due to my Internet Provider, in part at least.Content is excellent. All-in-all I am glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "James A. Lee \"Capt'n PhivoN\""}, {"rating": 5.0, "review": "Love it!! Extremely easy to set up and super fast. Voice search is incredibly accurate.", "verified": true, "helpfulness": "0/0", "author": "Huascar Matos"}, {"rating": 4.0, "review": "I have tried or owend almost all of them and nothing comes close in performance to the Fire TV. I have no issues streaming HD content whether it be wired or through Wi-Fi or playing high graphic games. The remote control is simple to use and works great. My complaints are few. 1st in order to use its full potential you must have an Amazon prime account or you'll just be limited to what app your using to provided you with video or music content. 2nd the Amazon store app selection is large but not even close to Google's play store and you may not find your favorite app here. 3rd storage is limited and if you want to install a one of the high end game with the awesome graphic you find that you don't have to room to do so, The Bards tale is one example as it needs almost 4 gigs of free space. Last is the user interface by far what I hate the most its clutter and unintuitive and Amazon has put a lot of effort to make it this way. They want you to by Prime and use their service everything else made to be nicely tucked away were you can easily forget its their. Most of these issues can be resolved very easily by installing Kodi. If you don't know what Kodi is and what it allows you to do I suggest you pick your favorite search engine and gather as much info as you can.  If you already know about Kodi and were wondering if it would its worth it I can tell you that is and you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "borincano"}]