[{"rating": 5.0, "review": "Setup was easy peasy, and the now I can fire up the PC from my couch and enjoy the web vids on tv, all controlled from my Blackberry Torch!Great device!!!!c", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 5.0, "review": "This is just a great way to watch things from the internet on our big screen TV. Love this devise!", "verified": true, "helpfulness": "0/0", "author": "Wilma Englund"}, {"rating": 5.0, "review": "It works well. I haven't had any problem with it. I guess for the money it is perfect. I recommend this.", "verified": true, "helpfulness": "0/0", "author": "shoki"}, {"rating": 2.0, "review": "First of all Chromecast is hard to set up combined with poor product support = frustrating evening.  The WIFI at my house is encrypted with the latest encryption as should be yours (WPA2).  But Chromecast does not support it.  The only way I could get it to work was leave my WIFI OPEN!  Chromecast then updated itself so I turned my encryption back on after rebooting  to see if it would work now and......nope.  Had to open WIFI back up to get it to work.* FYI Chromecast also only works on \"G\" band WIFI it will not work on the newer \"N\" band.It does work well with Netflix.  But that was all the further I went.  It was too much trouble for too little payback.  And of course it does install Google Chrome browser on your desk top as well as try to make itself the default browser.  A Roku is a much better option with a lot more flexability which includes streaming from your home sever to your TV.It was much easier just to hook up my laptop to my TV via HDMI cord and use a wireless key board and mouse that to use Chromecast!  Spend your $$ on something else!", "verified": true, "helpfulness": "1/2", "author": "PC Man"}, {"rating": 2.0, "review": "I know the product is limited but I expected it to be tolerable.Unless you like lipsync to be off and other problems, it can hardly be used with the chrome browser on a laptop like my Macbook. The same can be said for my Linux laptop,It works OK when controlled through my Android phone and through my wife's Ipad but it is a hassle.. My guess is that software updates might cure these problems but I'm surprised at the poor basic functionality.", "verified": true, "helpfulness": "0/1", "author": "P. GIBSON"}, {"rating": 2.0, "review": "Needs more apps, Google too slow on puttiing out updates, so other apps can be added, Google wanting more control!!!", "verified": true, "helpfulness": "0/0", "author": "joseph"}, {"rating": 3.0, "review": "While the Chromecast is great in theory it currently pales in comparison to other similar devices.  Launching with a Netflix App was great but the slow adoption by content providers (especially Amazon) has proven a stumbling block.The lack of a remote is also a bit trying unless you have more than one device capable of interfacing with it.  My Nexus tablet links right to the Chromecast but my Bionic won't.  Having to retrieve my tablet every time I want to do ANYTHING on the Chromecast can be a bit of a hassle.In time the Chromecast will definitely come into it's own but for now you're probably better off avoiding it unless you only use Netflix (and now hulu) for streaming content and also have multiple devices that are confirmed to work with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"WildBil2Me\""}, {"rating": 5.0, "review": "it was very easy to install and it works great, the setup was very simple as well within 5 minutes i already was ready to use it", "verified": true, "helpfulness": "0/0", "author": "david chapa"}, {"rating": 4.0, "review": "The picture quality is very good when streaming Netflix. I do wish there was more streaming options. l like that it is compact and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Google hit one out of the park with this one.  It's still needing some firmware updating, but running youtube through this thing is a wonderful thing.  Buy one if you are not making one out of an android device.", "verified": true, "helpfulness": "0/0", "author": "Joseph Hall-Patton"}]