[{"rating": 5.0, "review": "I love my chrome! I can use it with my phone and iPad. I hightly recommend it to Everyone who doesn't have a smart TV", "verified": true, "helpfulness": "0/0", "author": "Alejandra"}, {"rating": 4.0, "review": "I purchased the Chromecast to replace my older \"smart\" blu-ray player.  I absolutely love being able to stream Netflix right from my iPhone. The quality is much better and gets a stronger wifi signal compared to my old device. I was disappointed when I found out the Watch ABC app doesn't support Chrome but I'm hopeful it will be added soon!  This is the coolest gadget I have and at $35 you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Dana L"}, {"rating": 3.0, "review": "finicky for me with wireless connection.  it's also not compatible with all routers, make sure yours is.  cheaper but not as good as roku.", "verified": true, "helpfulness": "0/0", "author": "D. K. Howard"}, {"rating": 4.0, "review": "It is simple to install, it is friendly, hopefully continue adding compatible apps. You need a good wifi connection  for better experience", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 1.0, "review": "I watched the impressive commercials -- they showed how easily (a) many different devices could connect to the TV, and (b) how anyone could do it -- even small children. But this wasn't anywhere my experience. Here's my PROs and CONs.PROs- It works with some things using an iPad.- It comes in a nice box.CONsWith Regards to the iPad:- It took some doing to set it up on the iPad. Definitely not \"Plug 'n' Play\" as depicted in their TV commercials.- It won't \"cast\" videos to the TV from the iPad using the Safari web browser (e.g., AMCTV.com)With Regards to the PC:- It took a lot of doing to set it up on the PC laptop.- It won't cast sound to the TV from the laptop (using the Chrome browser).- It won't cast \"Full Screen\" from the laptop videos to the TV -- instead, one has to watch everything in a small 12\" space on the 40\" TV. Plus, Full Screen freezes the visuals.- If things aren't working, ChromeCast's help resources employ the \"Blame the customer\" technique (i.e., blame the User's Internet, Router and Device configurations and connections) rather than accepting blame for a shoddy interface.I searched for two phrases on several search engines (Google, Yahoo, Lycos (even!) and here's the results:- chromecast bad ... 8.1 million hits- chromecast sucks ... 147,000 hitsI can't recommend ChromeCast to anyone. To better understand why, check search for yourself. Or read this review...5 Reasons Why Chromecast Sucks ([...]/)", "verified": false, "helpfulness": "0/2", "author": "Just a regular guy"}, {"rating": 1.0, "review": "I tried to connect my Chromecast last night, and followed all the steps until the final step where the Chromecast configures with Chrome. For some reason, it gave me a blue screen with \"Not Supported\" in white letters floating around my TV screen. I tried to set it up again, a different HDMI input, but neither worked. I have Windows 7, and I think my router is fairly new / up to date. The Verizon Fios guys installed it a couple years back.Has anyone encountered this error? I'm going to return this thing if I cant sort it out.", "verified": true, "helpfulness": "0/0", "author": "Rahul Patel"}, {"rating": 4.0, "review": "The chromecast is a very nifty device that allows me to stream netflix from my phone/computer/tablet in 1080p. Bottom line is that it works. Now for some plus and minus work:Pros:1080p streaming of Netflix (and other supported video streaming providers) to any TV with an HDMI slotAppealing screensaver photos with timeA few really good apps (songza, rdio, netflix)Cons:May be difficult for some users to figure out the install and setup processDoesn't work well on pre-Windows 7 computersThere could be better applications/programs - like google earth with street viewBuy it if you want to stream music or video to your HD TV, but don't want to pay to access the streaming app (like you do with XBOX).Don't buy if you have a smart TV that supports streaming applications that you're interested in using.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 4.0, "review": "The Roku we had out in our living room stopped working recently, so we have been using this a lot more now. It is awesome. I love that I don't have to go find a remote to get something to play on my TV. It works from other rooms in the house, and the quality of picture is fabulous. I do wish I could use it with anything in my computer, though. (as in apps for pictures, etc.) I would recommend.", "verified": true, "helpfulness": "0/0", "author": "sharkbait-ooh-ha-ha"}, {"rating": 3.0, "review": "I own an Apple TV and just bought this as a do Android development. This does work - I do like the way the Chromecast works when streaming video to the TV.  The picture quality is great and I like the overall design of it.  It is great that it is very portable and can fit in a carry on without much trouble.  The setup was pretty easy, too.I thought that it would have a similar interface to an Apple TV and that Netflix would be an option - however, it will work if you have a tablet and use the Netflix app.", "verified": true, "helpfulness": "0/0", "author": "AZMedGuy \"Alpha computer geek\""}, {"rating": 5.0, "review": "I had a few issues with connectivity on my phone. However after an update its been great. I use Netflix, Hulu Plus, YouTube as my main TV services as I cut cable two years ago. Love it. Works great.", "verified": false, "helpfulness": "0/0", "author": "Dustin Saiger"}]