[{"rating": 5.0, "review": "Good value for the money!", "verified": true, "helpfulness": "0/0", "author": "MARCO"}, {"rating": 4.0, "review": "sometimes can be a bit glitchy, but as long as you are ok turning your apps on and off again, this product is great", "verified": true, "helpfulness": "0/0", "author": "Nate G"}, {"rating": 5.0, "review": "Love it, I have an extra TV I didn't really use oftenonly to play video games,  but since I got the Chromecast I leave my big TV on the cable and use the smaller one to watch Netflix,  VUDU, Start, HBO and a lot more it's great, should've bought a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Useful little device, does exactly what it says. I'm expecting software updates to make it even more useful in the future, but it's good enough as it stands now.", "verified": true, "helpfulness": "0/0", "author": "varun"}, {"rating": 5.0, "review": "Really great product, use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Jasmin Tremblay"}, {"rating": 2.0, "review": "Streaming is choppy especially through the browser plug in.  I guess if you were close to your internet connection it would be ok.", "verified": true, "helpfulness": "0/0", "author": "Brandon Vaughan"}, {"rating": 5.0, "review": "Didn't do exactly what I thought it would do, which is mirrorcast my phone exactly...but rather you run other apps and web compatible formats from your phone to your TV. Once I played around with it for about an hour, I had it figured out and though still limited, it serves it's purpose for me.", "verified": true, "helpfulness": "0/0", "author": "Alferrrd"}, {"rating": 5.0, "review": "I use it to stream video from my computer to my tv, and it works perfectly", "verified": true, "helpfulness": "0/0", "author": "QuiQue Q"}, {"rating": 4.0, "review": "Pretty cool device, simple to use and small.", "verified": true, "helpfulness": "0/0", "author": "JP \"Straight Shooter\""}, {"rating": 2.0, "review": "The Chromecast came prefectly, but when I first started it the lag was just killing me. I couldnt find any soulution. Do not recommend", "verified": true, "helpfulness": "0/0", "author": "Eric Joo"}]