[{"rating": 5.0, "review": "I bought this for my husband and he loves it.", "verified": true, "helpfulness": "0/0", "author": "Linda Woods"}, {"rating": 5.0, "review": "I bought this as an upgrade from my Sony streaming player. It has a lot of great new and improved features. l love it!  The only thing I didn't like was that you can't turn it off. You can unplug it, but that's it. It's always on. Like there's no on/off switch. It's weird. If you don't use it, then it just puts up a screen saver of some  BEAUTIFUL landscapes. And it knows who you are when you plug it in. That was a little creepy, but I guess that's technology for ya! Of course my husband thinks it's watching us with it's white eye all lit up. LOL! But, overall, it is definitely an improvement from the old. I recommend it!", "verified": true, "helpfulness": "0/0", "author": "Nxactly"}, {"rating": 5.0, "review": "i really enjoy this unit works well picture on tv is really great", "verified": true, "helpfulness": "0/0", "author": "Larry H."}, {"rating": 1.0, "review": "Got too hot to touch and stopped working when it got hot!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "In my opinion product is not for me to many old movies and i would need to pay a membership to get new releases so not worth the buck. I am sticking with cables less and cheaper", "verified": true, "helpfulness": "0/1", "author": "carolina r."}, {"rating": 5.0, "review": "The best on the market.", "verified": true, "helpfulness": "0/0", "author": "Bob Davies"}, {"rating": 3.0, "review": "This box is way to complicated to use. I bought it for my mom so she would not have to pay for cable but does not know how to use the dam thing", "verified": true, "helpfulness": "0/3", "author": "Angela Moreau"}, {"rating": 4.0, "review": "Pretty awesome piece of technology.  It lets you use your tv in a fun interactive way with most of your favorite shows and movies.  I notice that there are a lot of things that you can rent or purchase, and that's cool.  The only reason why I did not give Amazon fire TV a five star rating is...Make it to where I can watch live basketball, baseball and other popular live shows with a Pay per view system.  When you incorporate a way to do this(that's cheaper than cable mind you) I will be ecstatic. Please and thank you.", "verified": true, "helpfulness": "0/0", "author": "Joshua Cane Loyd"}, {"rating": 2.0, "review": "No directions included still trying to figure out its full capability.  Not so simple to do.", "verified": true, "helpfulness": "0/0", "author": "timothy brazil"}, {"rating": 1.0, "review": "Tech and customer support could not get Amazon Fire TV to work on my HD TV.  Very disappointed as I can not utilize Prime Shows and videos.", "verified": true, "helpfulness": "0/2", "author": "pafco"}]