[{"rating": 5.0, "review": "this is a well thought out device that operates as it should. In some ways it is the best streaming device and it could still use a little work in some areas. If you are just interested in streaming netflix or hulu then any streamer will work fine. However if you want more out of your device, like streaming from your own media server, then this is the device for you.", "verified": true, "helpfulness": "2/3", "author": "J. Belding \"Generallupo\""}, {"rating": 4.0, "review": "This is easily as good as the apple tv, but we find ourselves gravitating towards apple for rentals and using our xbox for amazon prime.  We mostly purchased this to try it out and it has ended up on a small television for guests.  They seem to like it just fine.The menus are quite intuitive and set up was as easy as a set up can get.For someone who is new to these small digital content boxes it would be great.  If you already have and apple tv or an xbox or something similar, it will be a duplicate.", "verified": true, "helpfulness": "3/4", "author": "Nicholas G. Frerman"}, {"rating": 5.0, "review": "easy to install, works great!", "verified": true, "helpfulness": "0/1", "author": "gary phelan"}, {"rating": 4.0, "review": "Upadate after using - Great works well no buffering (make sure your wireless is a higher speed is helpful)  - I just wonder if the new features can work with an older model?  Using the thumb drive for additional space and using headphones?  Having some trouble syncing memberships with Netflix, don't seem to be able use all the Prime features - but still in process of learning.  Other than seeing previous movies, listening to Pandora (if you don't have a smart tv) the features are okay.  I will update once I learn and use the item more.  Just wonder if the Fire TV stick may be as good?", "verified": true, "helpfulness": "1/3", "author": "PCH"}, {"rating": 3.0, "review": "I like this product when it actually works.  The shows come in very clear.  Unfortunately, it kicks me out of NetFlix often.  I have a second streamer which seems to be able to pick up my WiFi signal better.  I had higher hopes for this product.  i will keep trying but if it doesn't get bet, i will return it.", "verified": true, "helpfulness": "1/2", "author": "Rev. Rickie C Marecek"}, {"rating": 4.0, "review": "Nice performance excellent hardware for a small device.", "verified": true, "helpfulness": "0/1", "author": "Miguel Blanco"}, {"rating": 1.0, "review": "I have a netflix account already and now have to pay Amazon for it again? It won't let me access my account which is why I got the fire. This sucks. The rest is great but I bought the Fire to watch Netflix.", "verified": true, "helpfulness": "2/15", "author": "Michael K. Stephens"}, {"rating": 5.0, "review": "Fantastic!!", "verified": true, "helpfulness": "1/4", "author": "windsong7979"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "1/4", "author": "Alberto Fuentes"}, {"rating": 4.0, "review": "Works good, no problems. Tried to side load a browser which doen't seem to work well.", "verified": true, "helpfulness": "1/3", "author": "ron344"}]