[{"rating": 5.0, "review": "This is just a little box and small remote.  I took the advice of a friend and taped a large wooden spoon to the remote control so it wouldn't get lost as easily.  I love the immediate response, having the Amazon Prime movies and my personal library of previously purchased movies available.  We were able to downsize our regular Dish account and prime channels without losing the advantage of seeing lots of great movies, series and the such.  We chose to add Netflix and hardly spend time on regular TV anymore.  Invest in this little box.  It is so worth it.", "verified": true, "helpfulness": "3/3", "author": "Karen T. Dees"}, {"rating": 5.0, "review": "That's what it is!!  The Amazing Amazon Fire TV!!!Why is it amazing?  Lets start with how easy it was to setup!  In less than two to three minutes it was up and downloading updates and then it downloading the latest software, then it gave a brief tutorial how to use it with the easy to use remote control!  I already have Game of Thrones ready for tonight!  GET IT!!!  You will not be sorry!  Are you an avid movie watcher or addicted to series like Game of Thrones!  This is for YOU!!!  Do you hate spending hours setting up a system?  THIS IS FOR YOU!!!  Do you like Gaming?  THIS IS FOR YOU!!!  Do you have a kindle HDX  and watch movies on it you can mirror it onto your Fire TV  THIS IS FOR YOU!!!  I think I have covered everything in this ReveiwTHIS IS FOR YOU!!", "verified": true, "helpfulness": "3/3", "author": "Saramanoo \"Sweet Victory\""}, {"rating": 5.0, "review": "For me, the only thing I would like for this unit to have is the ability to seperately list all FREE Prime videos if that is what you want to chose from. The voice command works fabulously in my opinion. I have high speed Internet here, and the streaming videos I have watched, one of which is Eddie Murphy's Coming to America, was flawless. I also liked the pause, rewind and fast forward functions on this unit because they are very responsive and you have a thumbnail displayed on screen of the scene as well as a timeline. I compare this to my Panasonic Blueray players' (I have 2 different models) that are not so nice. All in all, I love this device. I am using it with my WiFi, and it is smooth as silk, as good as if it were on wired Ethernet.", "verified": true, "helpfulness": "1/1", "author": "BobL"}, {"rating": 5.0, "review": "This is an excellent box for streaming content (Amazon Prime, Netflix, etc).  Mine has worked flawlessly for 3 weeks now.  I especially love the voice-activated search feature which works really well and beats the heck out of typing with the remote to do a search.  Without hesitation I recommend the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Clark Fleming"}, {"rating": 4.0, "review": "First of all, the first Fire TV that I received was defective. After talking with tech support a few times, Amazon agreed to send me a replacement unit. The new one works great and I'm happy with how they handled it.----------------------------------------------------------UPDATE: I'm still having an issue with my replacement unit. The issue is a high pitched whine or squeal sound when a video is paused. I'm using the optical cable and dolby digital surround sound. Apparently people with Sonos sound bars are having the exact same issue. Amazon is looking into it and will get back to me. I'll post another update when I have more information.-----------------------------------------------------------From the limited research I did, there is no other product out there that will do what I need for 99 dollars. Well, except for the fact that the Fire TV doesn't have HBO go, but that is coming later this year so I wont knock off any points for that. Once this device gets HBO go, it will have basically everything. Prime streaming, Netflix, Pandora, Youtube, everything I need in one box. Apple TV and Chromecast can't say that. The only possible competition for me was Roku, but the Roku has no optical audio output so it won't work with my sound system, and it doesn't have voice search.The voice search is awesome! I'm really looking forward to the voice search being expanded to work with all of the apps. Right now it doesn't work with Youtube which is annoying, but supposedly that is coming. When searching for movies/tv shows, or launching apps, it's flawless, and saves a lot of time.Another thing that the Fire TV does is sync with the Youtube app that is on your phone. There is a really simple process to link the two together, and you can hit one button on your phone to display whatever youtube video you are watching on the Fire TV. This is helpful since the voice search function is not available yet and it's easier to find videos on a phone or tablet, rather than hunt-and-peck on the on screen keyboard. Also if someone sends you a link to a youtube video, you can easily watch it on your TV.I was disappointed that \"mirroring\" only seems to be available for the Kindle Fire tablet, and not other devices. It seems that with an iOS or android device, you are limited to mirroring the youtube app, and there is no option to surf the web on your TV by mirroring a phone or tablet.The quality of streaming video and audio is outstanding. Everything loads quickly and nothing freezes during playback. It's just as smooth as watching a DVD.The interface is okay. It's very basic and gets the job done. The layout is a little weird but you get used to it.Overall I'm very happy with it. I only have a few minor complaints, and most of them are likely to be fixed with future updates. I would not hesitate to buy again!", "verified": true, "helpfulness": "3/3", "author": "Control Dynamics"}, {"rating": 1.0, "review": "Not what I expected. TV shows and Movies required rental or purchase. Netflix and Hulu offers TV and MoviesWithout having to rent or buy. The Amazon. Fire TV is probably good for some people, but not me. I want my moneyBack.", "verified": true, "helpfulness": "5/18", "author": "Bob Matthews"}, {"rating": 5.0, "review": "It works better than my smart tv in the other room! Also the voice search really does work. The only hiccup I have had with it is for Netflix. It takes a minute for Netflix to start up. Once started  it works  fine. I'm sure it just needs a software update. I would recommend this for sure!", "verified": true, "helpfulness": "3/3", "author": "autrey87"}, {"rating": 5.0, "review": "I tried Apple TV - it never worked right. But the Fire worked better than I thought it would. I was able to cancel my cable last week because Fire has what I need and more. It was instant to set up - no extra technical skills required. Voice search was far more useful than I thought it would be. I'm a Prime member, so many of the shows I want to watch are free. I have to pay for some first run episodes, but the total cost is less than my cable bill (and I'm glad to know what I am paying for instead of a bundle of channels, most of which I don't care about). We also have Netflix, which was easy to set up. One unexpected bonus is how easy the games are to play - they are right there next to your TV shows. I am not historically a big game player, but maybe now I will be. Another unexpected bonus was the easy way I can upload my  digital photos to Amazon's cloud and then display them on my TV like a screensaver. I have tried to do this before but also could not make it work easily until I tried on the Fire TV. The reviewers with suggestions and flaws are valid - but to me it's still five stars, because I get to cancel my cable.", "verified": true, "helpfulness": "6/6", "author": "Josie Kelly"}, {"rating": 4.0, "review": "MLB Network available for purchase. Love the fact that it auto searches by voice command and has parental controls built in.", "verified": true, "helpfulness": "0/1", "author": "Calvin E. Loving"}, {"rating": 2.0, "review": "I used this device to replace my aging power-hungry PS3, mainly for watching content from Netflix, Amazon Prime, and my router's media share.The device is unobtrusive, with a nice muted power LED.  And the remote feels solid in the hand with a nice texture.  The buttons are relatively well placed as well.But the software needs a lot of work:- You can't control it using your TV's remote through HDMI like you could with the PS3, so you end up with an extra remote lying around.- There's no way to put apps on the home screen, so my favourite media player for Android can't show up.  Instead I have to dig 3 menus deep to find it.- The interface doesn't animate very well at all.  Movement is choppy, and the Netflix app looks like something from the late 90s.- The voice search feature, while a cool idea, is useless because it mixes up paid and unpaid Amazon content, and doesn't search Netflix.", "verified": true, "helpfulness": "5/7", "author": "Miku Jakusuhn"}]