[{"rating": 1.0, "review": "don't really like it", "verified": true, "helpfulness": "0/1", "author": "Madison \"MO\""}, {"rating": 4.0, "review": "It's great for casting youtube, hbogo, and netflix to your TV, but the tab casting could definitely use improvement.", "verified": true, "helpfulness": "0/0", "author": "Matthew Tibbits"}, {"rating": 5.0, "review": "Used to watch U tube songs for the band on TV. Very handy.", "verified": true, "helpfulness": "0/0", "author": "Derfy"}, {"rating": 5.0, "review": "Has a few quirks, but I really like it. I hope Chrome can straighten out the lag issues on some streams.", "verified": true, "helpfulness": "0/0", "author": "Gerald A. Hernandez"}, {"rating": 5.0, "review": "Amazing, easy to set up device. It's better with a fast home wifi connection rather than slowish, developing country wifi. Notwithstanding, it's well worth the money.", "verified": false, "helpfulness": "0/0", "author": "David"}, {"rating": 3.0, "review": "gave to a friend", "verified": true, "helpfulness": "0/0", "author": "Charles C."}, {"rating": 5.0, "review": "I have two Roku boxes for home and cut the cord, but one thing Roku boxes don't do well is travel.In steps the Chromecast and now I can take my Netflix and Hulu Plus subscription on on the road (hotels, visiting family, etc.)I combine it with my TrendNET N150 Wireless Travel Router TEW-714TRU. This way I don't have to join a new Wi-Fi network or even care if location (often a hotel) has Wi-Fi or wired Ethernet. The TrendNET also keeps me behind a NAT firewall with OpenDNS protection (which lets my kids get on with their tablets and not have full open Internet access).Most hotel's TV are HDMI capable these days so this works great. The real question is does the hotel have enough bandwidth. I recommend scoping out the hotel ahead of time with https://www.hotelwifitest.com. I found 7 Mbps to work just fine for Hulu and Netflix at 1024p but I'm happy at 720p too in most cases.It is also nice to throw on to any TV and throw up any videos or pictures from you phone while on vacation or at relatives house.I like too that you can control the volume from the my android phone (or Nexus 7 tablet). I found it very nice to be able to switch between them even as a show is playing.Sadly Amazon Prime or Instant Video won't work on Android but for travel, Nextflix and Hulu Plus are enough for now. I don't watch that much on the road any ways, but it nice to have this for the moments of downtime and not stuck watching crappy real-time TV with endless commercials.The new Roku stick might solve some of the minor issues, but this was cheaper. I'm not a Google fanboy but I do prefer the Android environment more than IOS (I own several of iPxxx devices as well). If you were a Apple user, I can see that being a better option. I've just never have liked Roku's interface for getting personal video/pictures on the screen so I give the Chromecast a plus on that end.I might even be able to use this for work to display what is on my tablet's or phone's screen during presentations. That is a bit more situational (HDMI port in always available on projector) but I think it has promise.Overall, this is now a permanent fixture in my tech go-bag.", "verified": true, "helpfulness": "0/0", "author": "JazzManG"}, {"rating": 3.0, "review": "Good for watching You tube movies. Too limited in what you can view without subscribing to pay for movies. But it's cheap", "verified": true, "helpfulness": "0/0", "author": "Coach F"}, {"rating": 2.0, "review": "I could not get this to work with my equipment, eventhough it stated in the instruction that it would.  Not sure why, but worked on it for weeks and had to finally give it up.", "verified": true, "helpfulness": "0/0", "author": "JLB \"Janet Brewer\""}, {"rating": 5.0, "review": "LOL", "verified": true, "helpfulness": "0/2", "author": "Yvonne Cheng"}]