[{"rating": 3.0, "review": "I love what Fire TV (box device) CAN one day do - I hate what it is doing right now, and can't recommend it until the storage capacity issue is resolved.  This device is fabulous provided you only rarely use it or you don't mind spending 75% of your time trying to make room for the content you want to use.  It has less storage capacity than a standard USB stick these days - which makes it impossible to do more than one or two things on the device before MANUALLY having to delete cache, data, apps, and games just to make room for something new.--MAIN POINT--If not for the extraordinarily constrained storage (more below), which I consider a show-stopper (more below), I'd be key-smashing my joy over how the Fire TV is poised to be everything the Apple TV never was.  I have literally spent more than $12,000 dollars on Apple TV content - which has never been capable of even half of what the Fire TV does - so I am sincerely hoping Amazon sees the light and addresses the only drawback it has.  I'll easily spend triple what I did with Apple if they do.  Without a fix, however, I doubt I'll spend another penny.  Of all things, seriously, to lose out on - Amazon chooses to fail when it comes to storage capacity?  REALLY?  Did they forget they set the original standard for automation or something?!--DETAIL--The Fire TV box comes with an 8gb internal hard drive - of which 5.4gb is available for new content after initial setup.  Accessing content - especially videos, apps, and games - requires MANUALLY having to then go in and uninstall apps and games, and delete all the associated cache and data...and then having to do it all over again after accessing the next batch of content, gets old.Very old.  Very fast.I literally just tried to play a new game - which required a 3.4gb download for the HD graphics - and had to uninstall everything first.EVERY. SINGLE. THING. ON. THE. DEVICE.If I wish to play ANY OTHER GAME I purchased, I will have to UNINSTALL IT and EVERYTHING ELSE to download that new game - and then DO IT ALL OVER AGAIN for videos to play fully and to access other content and so on and so on.  Who the hell thought THAT was a good idea?!  Give it more storage or open external devices to it.  Problem solved.Hell, even the original Apple TV came with 1TB of storage and it was just for video!!!  Games will ALWAYS push the boundary on hardware - the demands of 3rd party software is why all hardware is obsolete the moment it is made.  DUH.  Either eliminate everything that makes the Fire TV worth having (i.e. the non-video and non-music content ability) OR solve your storage management nightmare.Even if they provided at least a 1TB (minimum)/ 2TB (better)/ >2TB (best) physical drive, or gave it unlimited self-use of the cloud, or simply allowed external storage, this device would beat out all competitors easily.  I would trash the Apple TV entirely because I'd only ever after use the Fire TV.  I'm holding out faith that Amazon will realize the massive error they are making with this sort of stupid storage problem.  Amazon could bridge a gap here and become THE provider of all things digital streaming with Fire TV - winning all FUTURE content revenue by default, OR they can continue to unintentionally drive their own customers into the open arms of their competitors.  Boneheaded moves like this are how companies become an \"also ran\" in their industries instead of taking the top spot.  Amazon has the superior platform by far, imo.  Those who are like-minded are WAITING to embrace Amazon as their \"go to\" media content provider, so it's just plain stupid to not be able to do so for something as STUPID as storage capacity.--APPEAL TO AMAZON--You see a problem with users viewing external content - thus not giving you revenue for that content.  Guess what?  They will do that anyway by using multiple devices.  You still won't get their money AND you will have made your own device an \"almost was\" rather than the most amazing thing ever.  You are unintentionally forcing the use of COMPETITOR devices.  Stop and think, you've won our minds - people are TRYING to make the Fire TV their ONLY media device, don't lose their hearts along the way!  Solve the gap between how things are now and what you are trying to get, by opening the external storage ability.  It may seem counterintuitive, but the future you create is one where the \"problem\" solves itself.  All content will eventually come from Amazon because no one will be bothering to buy it anywhere else.  If you don't bridge the gap in the meantime, however, you restrict that future from ever happening - and you pretty much guarantee that someone else will have the lightbulb go on and will bridge the gap themselves making YOU the \"has been\" when you easily were poised to win it all.--PROS--There's no fee to use it unlike other media streaming devices.  I own a PS3, Xbox 360, a WII, and an Apple TV.  To utilize the channels I want via the gaming platforms I use most (the Xbox and the PS3), it requires me to pay for the ability to even get to them in addition the payments I already make for the channels so those were never going to be my long-term solution.  I don't bother with any other media box because of the same reason - excluding the Apple TV because it's convenient for my video streaming and I don't mind paying for the new content capability.Lots of \"free\" content - but beware the trend toward free apps that require purchases within them in order to actually have content that is usable or worthwhile.The Fire TV is very concise and much easier to navigate the Amazon Instant Video selections than via the game consoles.  It behaves VERY similarly to how the Xbox shows you available games - and not having to wait to navigate is a plus.The audio search is excellent and works perfectly for any Amazon-related content I want to find.Amazon \"coins\" are great - you purchase coins in bulk and can use them for purchases of apps and with in-game purchases, as well.  It saves you from too many \"one-click\" purchases that might interfere with your paying mechanism (if that mechanism is prone to \"fraud prevention\" it might not allow too many multiple purchases in quick succession).Customer support is fantastic.  Very responsive and very helpful - easy to get the assistance you need.Setup was great, most of it was done for me by Amazon as it arrived pre-configured and pre-registered to my Amazon Prime account.--CONS--Absolutely horrible space constraints.  It's not possible to play any serious gamer's games on it without it being far too cumbersome.  It also will only use Cloud for storage IF the game developer integrated - so if you have to uninstall it and delete data/cache for space, you will have to start from scratch AFTER re-downloading it.  Also, do NOT choose \"remove from Cloud\" within the device or you may actually have to repurchase the item.  Even in on a browser in your account if you choose \"delete\" for an app, you face the same issue.  Choose \"Archive\" in a browser looking at your apps if you don't care to see it but still want access to it for your device at some point - otherwise you'll be repurchasing it.Controller is sold separately, is heavier than necessary, and does not come with any motion vibration, yet.  Not major issues but doesn't help anything, either.Not enough detailed instruction on some of the options you can choose that might result in having to repurchase an app, or that could significantly impair the device.  Don't click on stuff thinking it won't be a problem - chances are it will be, and nothing told you it wouldn't be.When buying apps/games from the website, on a computer, if you forget to change the delivery option and the one-click purchase immediately sends the app/game to your Fire TV - you may not be able to cancel a download - and because of the limited space, that means having to let everything trying to download finish before you can uninstall them so you can access the only thing your limited space lets you access.--CONCLUSION--To serve its purpose, the Fire TV box has GOT to find a better storage management solution.  Right now instead of inspiring love for the device, Amazon has only managed to inspire some serious Nerd-rage.  It's a great concept and MIGHT become worth the money and effort - but I'd wait to see what Amazon does about the major drawback before purchasing the Fire TV box.", "verified": true, "helpfulness": "2/2", "author": "GadgetHound"}, {"rating": 5.0, "review": "Awesome device. Great picture quality. Easy viewing. Very fast, no lag at all. I'm thinking of buying a second device for another TV.", "verified": true, "helpfulness": "0/0", "author": "TV_PC Guy"}, {"rating": 3.0, "review": "I don't know if it is my wifi or what, maybe it's sensitive, but I have had a lot of issues with the box going out and having to unplug it and plug it back in to get it to work. It kinda sucks when you are in the middle of watching a movie. All I'm saying is that I don't have this issue on any of my other devices and kinda wish I got a Roku like my brother.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "I got this to replace a two year old Roku, and the difference is night and day. Menu screens are far quicker to move through, and the overall navigation from menu-to-menu is far easier than on the Roku.  Setup was simple and straightforward -- basically a plug and play type operation. It did take about 5 min or so to update itself with new software when it was initially connected.Zero problems running it through an AV receiver. I'm using a wired connection, so I can't speak to how well the wireless option works.Very sleek looking box that has a very small footprint.  Everything looks and feels well-built.The remote is not the best, but very workable. I would have liked to see some type of illumination so it can be used easier in the dark, but there's so few buttons on the remote that finding them by feel is pretty easy.I'm using it mainly for Amazon Prime video and Netflix. No problems at all with either app.Very pleased with this, and would highly recommend it. Much nicer user experience than I had with the Roku.", "verified": true, "helpfulness": "0/0", "author": "Comdet"}, {"rating": 3.0, "review": "Disappointed at the number of things (or lack thereof) you can watch 'free'.", "verified": true, "helpfulness": "0/0", "author": "Trish M."}, {"rating": 4.0, "review": "Needs to add more Afrocentric movies to Primetime .", "verified": true, "helpfulness": "0/0", "author": "Nico Nave"}, {"rating": 4.0, "review": "Handy to watch my classic choices of film/tv shows.Often hard to hear some of the programs,as I couldn't hear Chekhov,and had it cranked way up!", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 5.0, "review": "Love it, I read several reviews about the Netflix app, what no one seems to mention is if you call them they will talk you through the upgrade. It's very simple to do, go to settings, then upgrade and go from there. Easy peasy.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 5.0, "review": "Love this.  The voice recognition is fantastic.  More bang for the buck than competitors.", "verified": true, "helpfulness": "0/0", "author": "RiverWho"}, {"rating": 1.0, "review": "I got the box, set it up and the first thing it says is to connect to the internet. When I tried it would not connect. Finally after trying their stupid suggestions with no success, I call customer service. The end result? I was too far from the router. Really? So I move it closer. Still won't connect. After spending an hour on the phone (Half of which was spent in silence) they tell me they will let the tech support team know and they will get back to me asap. If I ever get to use this thing I may change my review.", "verified": true, "helpfulness": "3/5", "author": "Ashlie"}]