[{"rating": 4.0, "review": "This product is awesome. Works as advertised and arrived astonishingly fast. I have to admit that at first I had my doubts, but once you get the hang of it, it really does work great.", "verified": true, "helpfulness": "0/0", "author": "D. C. Masis \"Chino\""}, {"rating": 2.0, "review": "Well it works and is easy to set up.  HOWEVER, it really is just a wireless version of an HDMI cable casting from my computer to tv.....which IS a good thing.....just don't expect any new content.  My biggest disappointment was that Google has not added SOMETHING for all of us that got burned on Google TVs, you would think the link would allow me to just tap my Google TV into WiFi and go using the Google TV keyboard.....but  nope.  Having the allegedly smarter TV doesn't make any difference at all.  How disappointing. Perhaps they will upgrade the software later?  Here is to hoping!", "verified": true, "helpfulness": "1/2", "author": "Teri L. Mosier \"Deafer\""}, {"rating": 5.0, "review": "SO EASY TO SET UP ! GREAT !!!! Recommend this product to everyone. Great Streaming from youtube and netflix, havent tried it from my computer yet", "verified": true, "helpfulness": "0/0", "author": "peter"}, {"rating": 1.0, "review": "Worked fine the first few days.  After that it has worked only intermittently.  No help whatsoever from google.Luckily I have a smart tv so I don't need to rely on this piece of garbage.", "verified": true, "helpfulness": "1/4", "author": "william mccullough"}, {"rating": 1.0, "review": "Why is it just me that has a problem with software/hardware being released when it's not fully functional.  It would have been nice if Google let you know before hand that this... thing...  is picky about how your wi-fi is set up before you purchase.  It would have been better if ALL standard WI-FI settings were supported before it was released.  I'm not going to strip down my wi-fi security settings.I've gone with the Android Mini PC RK3188 instead:B00AZR1TG2", "verified": false, "helpfulness": "0/5", "author": "KMG"}, {"rating": 1.0, "review": "I bought this to stream movies and music, it did neither. Took forever for my WAP and chromecrap to shake hands. Was unsuccessful in seeing anything except the wallpapers. Quite embarrasing for a network administrator to be beaten by a google product. This should be a apple re-branded product. greed, non-unification, and having to sign up for a million services make this the perfect gift of garbage. Nothing works, pandora, netflix, google music. I have very common Samsung Display and Android Tablet, there is no reason for this much ridiculous non-functionality of a simple piece of gear.If you like giving grief as a holiday gift..look no further. Wasnt enough that Google works with the nsa? now chromecrap... google is the next yahoo...If there were zero stars it would have 5 of them.", "verified": false, "helpfulness": "1/6", "author": "vOCesUGa"}, {"rating": 5.0, "review": "This little device is perfect for what it is.  Don't need cable anymore, this takes show/movies from my computer/phone and puts them on my tv.", "verified": true, "helpfulness": "0/0", "author": "ckb04"}, {"rating": 5.0, "review": "I think that it was awsome but need more apps like hbo or stuff like that and lower the price", "verified": true, "helpfulness": "0/0", "author": "Craig Remines"}, {"rating": 4.0, "review": "Tried to set this up on multiple TVs with multiple devices.  Followed all the instructions.  Chromecast won\" open on a new Dell laptop.  New cell phone can't connect to the device.  Screen says \"Set Me Up\"  All devices say could not connect.  Followed instructions.  I'm going to connect this right back to Amazon.  Back to HDMI cables.  Phone set it up.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you are looking for that something extra get this love this and absolutely recommend it to anyone that is looking for a stocking stuffier.", "verified": true, "helpfulness": "0/0", "author": "George l valverde"}]