[{"rating": 5.0, "review": "This box is pretty great as someone who loves to consume media from Amazon.  Others seem to complain about an inability to search Netflix and other apps with the voice search.  I don't see the issue, those apps are direct competitors of amazons streaming service and they chose not to allow amazons box to search there content.  As someone who consumes both (netflix, amazon, and even hulu plus) this box is perfect.  Amazon has all the content I need especially since I have prime.Box has enough power to play video games as well.  I've tried the Walking Dead and it has no hiccups.  The gaming controller (sold separately) was surprisingly good.  Its similar to the xbox 360 controller and feels good when holding it.  Amazon hit that one out of the park for there first video game hardware.  I am an avid gamer and this box was a hands down decision for me over apple TV and the like.The remote is pretty awesome too.  It has a high quality feel just like the tiny box itself.  I am continuously impressed by amazon's hardware.  Its very impressive considering these are new areas the company is getting into.Bottom line, if you consume Amazon content and like casual gaming I'd pruchase this box.  Cant beat it for 99 bucks and 35 for a gaming controller.", "verified": true, "helpfulness": "8/9", "author": "Derek B"}, {"rating": 5.0, "review": "I plugged it in last night and so far we have watch AIV shows, Hulu +, TuneIn Radio, and played Sev Zero. The remote and voice recognition work great. One tip: Audio defaults to stereo. You need to go into the audio settings and turn on Dolby Digital if you have a receiver that will take that.", "verified": true, "helpfulness": "7/7", "author": "Tod B. Bookless"}, {"rating": 5.0, "review": "I'm not usually an early adopter and was a little skeptical at first but decided to give it a shot.Easy to set up and easy to use.Hardware feels high quality and performs the sameI have it connected to my wireless network and it plays in 1080p with no lag at all.Wish it connected to my Ultraviolet/Vudu account but maybe someday.Other than that - awesome, glad I bought it.", "verified": true, "helpfulness": "6/6", "author": "Christopher Tkal"}, {"rating": 3.0, "review": "Need more third party apps -- esp. TWC, HBO Go, Dishworld. Seems responsive, voices search does not work outside Amazon streaming", "verified": true, "helpfulness": "2/5", "author": "Frequency Scan"}, {"rating": 2.0, "review": "Give me VUDU support and this is a 5 star device.  I need to be able to access the movies and tv shows I actually own, not just the ones I'm renting through on-demand content.", "verified": false, "helpfulness": "8/14", "author": "Calcobrena"}, {"rating": 5.0, "review": "I love the reviews from people who do not own the product but are upset that it does not offer something they want.  No device will provide everything that everyone might want.  This review is based on my short term useage of this product.The product arrived in a timely manner.  Everything was well packaged and protected.  Set up was as easy as it gets.  Attach one cable and one power cord and you are done.  WiFi set up was equally easy.  The update download started and seemed slow, and the Fire alerted me to that fact.  A quick check showed that backup software was also using the router.  Disabled the back up temporarily and all was well.  The updates downloaded in about ten minutes as there was more than one.  At least two updates installed quickly once the download was complete.  Then the dreaded mandatory video began.To listen to some of the people complain about this you would think it was a thirty minute video from heck. It was a brief five minute video and then the device was fully functional.  Big deal.  The menu was easy to navigate. I selected and viewed two movies thus far with no problems whatsoever.  No buffering.  No pixelation. Fast forward and rewind functions worked well.  There is a short perhaps 5 second delay when you go back to play from those, but to me that is to be expected.  Picture quality has been acceptable.Thus far I am quite pleased.  There is obviously still a lot to explore and time will tell if the product continues to deliver.  I will try to update this review after several more hours of use.UPDATE 04/07 - After using this device all weekend....No complaints.  I should say that I have not used any of the other products like this so I cannot draw any comparison to them.I did notice that there is Amazon Prime programming that will initially show as requiring you to rent or buy on the initial screen, yet if you select the item it will play and is included in your Prime membership.  If it is truly a pay program you will still receive a confirmation screen, so you will not be billed unless you confirm the purchase, thus allowing you to back out and go back to the program titles.Again and overall as a first time user of this type of device I am quite happy.  No buffering....It is fast moving between menus and starting selected programming.  No buffering except for a very brief period after using fast forward or rewind.  The games play equally well.  To this point I have not found anything not to like.....UPDATE 05/02/2014 - Still using it and loving it.  Like others, I wish that the search engine would search more than just Amazon Prime, but that is a minor caveat.  The system has performed flawlessly with ZERO buffering, pixelation, or issues of any type.  VERY pleased......", "verified": true, "helpfulness": "46/52", "author": "Alan F. Jordano"}, {"rating": 5.0, "review": "This product its amazing you wont regret it unless you are a very picky person and hard to satisfy like most of reviwers in here. about shipping it was very fast came by ups and of course it required a signature 2nd day delivery just like amazon prime promises. Now about product it was already set up with my amazon account which is great and made everything much faster.  The box is fast you dont get errors unless your internet connection is too slow. For us prime users its even greater so if you plan on getting this plan to get prime too because it has prime shows that netflix doesnt have and free i was surprise when i found bubble guppies for my friends son to watch. Also the game i play on my ipad like despicable me is more fun to play it here on amazon tv.  Im very happy with my purchase of this product . I totally reccommend this to anyone", "verified": true, "helpfulness": "7/7", "author": "leidy"}, {"rating": 3.0, "review": "I purchased this unit for its' ability to access Amazon Prime. I also have a Apple TV box that, which I am very pleased with, but it cannot access Prime.The unit is indeed fast. It loads and runs programs better than any I have seen.My first disappointment was discovering that it outputs video as 8 bit RGB only. I would have expected YCbCr 422 or 444.My second was that the remote does not offer IR in addition to bluetooth connection. It is an issue with me as I use a control system for my theater and with IR control, I could integrate the Fire TV into my controller. A simple box to TV hookup it will be fine. But, integrating it into a theater system is problematic!The voice command did not impress me. Each time it required me to confirm what I said...not like the instant jump portrayed in the commercials.I have a problem with the Dolby Digital Plus output over HDMI or Optical. My A/V processor will not output 7.1 audio from its 5.1 input. In fact it sends my processor into mute. I must put my processor into bypass to output only 5.1 to match the input. I believe this may be a processor issue, however, my Apple TV box does not create the same issue.The apps that are integrated are adequate, but not overwhelming. As a DirecTv subscriber, I cannot us the Showtime Anytime app as DirecTv in not on the list of providers.I am going to return the unit.", "verified": true, "helpfulness": "3/10", "author": "John J. Grevan"}, {"rating": 5.0, "review": "I just received my Fire TV yesterday and I have to say I'm delighted so far.  I am a Roku 3 user and, as I expected, there is a noticeable speed improvement with Fire TV.  I've watched a couple movies already and the experience was excellent.  Voice search works really well.  It only searches Amazon so that is a little disappointing, but this was not unexpected since I read it in an earlier review.Beyond videos, I have installed apps for Netflix and Hulu.  Both work fine.  I have also installed a couple games and I have played them with the game controller that I bought separately.  Several games I already play on my phone or Kindle Fire are available.  Gaming is a nice bonus for me, but not my primary use for this device.I have lots of my photos and music stored in Amazon's cloud.  Displaying photos works well.  I'll be even more excited when music is available (supposed to be coming soon).  Tight integration with my Amazon content was my expectation and so far I'm a happy customer.", "verified": true, "helpfulness": "17/19", "author": "Michael"}, {"rating": 5.0, "review": "I love the resolution, the abundance and the quality of the shows and movies offered, the dimensions of the system, the ease of set up, moreover the price. I downgraded my cable service and I bought Amazon Fire TV; the payback is less than two months, the value of what is offered is priceless! Strongly recommended!", "verified": true, "helpfulness": "9/10", "author": "Gokhan Sarpkaya"}]