[{"rating": 5.0, "review": "I got exactly what I was expecting. Setup was easy and performance has been great. This unit is very fast. The gaming experience is much better than I anticipated - not as good as a console, but still really enjoyable and superior to other devices in this class. Overall, it's a terrific value with lots of content to choose from.", "verified": true, "helpfulness": "4/4", "author": "Brian S."}, {"rating": 4.0, "review": "Could not install the Fire TV on my Verizon FIOS wireless router. The online help was not up to the task and I could not find a phone number for support (It may be there, but I could not find it). The Fire TV recognized the WiFi router and showed strong signal strength. I tried entering the 26 digit WEP security key many times and received either a \"failure to connect to network\" error message or \"could not connect to Amazon.com\" message each time. Fire TV does not save the WEP key on failure to connect so you have to keep re-entering the number... gets old very fast. I knew the Fire TV was actually connected because I could see it in the wireless router device table with an IP address assigned. I was finally able to connect the Fire TV via the Ethernet port using a network cable connected to my router. Received one more \"could not connect to Amazon.com\" error message which cleared after disconnecting the Fire TV power cable for 5 seconds. Completed the Fire TV setup, and once up and running, I moved Fire TV to the first TV location and then entered the wireless network information and WEP security key without further trouble.I hope that Amazon addresses the wireless network setup issues quickly. I suspect it's just a timing problem in the software code.My two boys liked the Netflix and YouTube apps and thought the video was very good on the HD TV. The YouTube video was even better than on my Apple TV in the living room. The remote is fabulous and navigates easily when inputting search strings. Voice commands worked well from all three of us. Odd there is no way to power down the unit like the Apple TV so I guess it just times out. No mention of this in the instructions. Overall we like the Fire TV and plan to keep it.", "verified": true, "helpfulness": "1/3", "author": "Steve Harma"}, {"rating": 1.0, "review": "I really wanted to like this device. While the voice search feature is nice, there are too many negatives associated with this device. It intermittently lost audio, the bluetooth connection was intermittent, the video quality was poor, and the video often froze during playback.The problems are not related to my Internet service speed (50 Mbps) or my wi-fi network. I have multiple other devices (e.g. Roku players, Apple TV, Xbox One, and PS3) that have none of these problems.I was excited to see Flixster as it offers access to the Vudu content I have purchased -- via UltraViolet. All of my content was there; however, playback via Fire TV is limited to SD. Really!?I hope Amazon is able to work through these issues. As is however, this device is not worth $99 and I will be returning mine until such time these issues get worked out.", "verified": true, "helpfulness": "49/66", "author": "jcm"}, {"rating": 3.0, "review": "It's fast, it's smooth.  It has games.  It has a lot to like.But I like my Chromecast and Apple TV.  And my Tivo too.Because the Amazon Fire is an also ran in so many features already available on my existing devices I have to focus on what is missing for me.-  No HBO Go.  Now if Amazon came out and said it's coming I'd be more understanding.  But it is a glaring omission, and something I do use.-  Voice search only works on Amazon.  HUH?  Isn't that the point of search, to look across all your available assets?When I pay for a device I don't expect the marketing department to put in controls to limit what I can search.  It's just bad form in today's ubiquitous world.  If Amazon wants this to be a device that drives users to their content they should give it away.  Don't make consumers pay for their marketing efforts.Here's the thing.  Tivo lets me search all my assets.  It gives me connectivity to all my assets, including HBO Go.  When I search it tells me what's available on Amazon AND Netflix AND Hulu.  Tivo works invisibly to merge all my services into a single search.Yeah, the voice search is cool, but only when it works with all online media services.  Otherwise it's just a ploy by Amazon.Amazon, you should just buy Tivo and be done with it.  It has what you don't.  You can add the voice search and have a killer product on your hands.Sorry, Amazon, but you jumped the shark on this one.  You aimed too low IMHO.", "verified": true, "helpfulness": "5/13", "author": "Niawt Kram"}, {"rating": 5.0, "review": "Thank You Amazon - we have been very dissatisfied with our current cable company's ability to provide streaming TV, which they deliver at a crawl (we pay an upcharge for what TW calls `extreme'). Watching Netflix or an Amazon Instant Video was a waste of time, costly and frustrating - with constant video freezing or dropped connection. Using TW's own Prime Video option was not much better.Yesterday we received and in minutes installed the Amazon Fire TV box. After about 3 to 5 minutes of updating by the unit, we were watching a movie delivered to the screen in a flash of a second.Annoying movie freezes are now in our past!5 Stars for Delivery - arrived in two days in standard Amazon quality packaging.5 Stars for Bluetooth Remote - allows me to tuck the sleek Amazon Fire TV unit away with our other Entertainment components. Only suggestion is possibly making it a lighted remote.5 Stars for Voice search - found every actor or movie title we spoke into the remote5 Stars for Setup - no need to read pages and enter complex codes, etc.5 Stars for Content - and my trust in Amazon to continually expand their offeringsWill provide future updates as we explore other features of Fire TV - Apps and Gaming next.Thanks Again AmazonProduct Update: 4/15 - 10 Days after purchase - still liking Fire TV, but experiencing some glitches with the unit it does not want to 'turn on' when we switch over to Fire TV (taking several minutes to actually connect to the TV). Unit also randomly turns itself off and on when watching a program or movie (even Prime stuff). Hoping Amazon comes out with a support site, that can answer our questions. Will post an update soon.", "verified": true, "helpfulness": "5/6", "author": "Gone shopping 4 u"}, {"rating": 5.0, "review": "It's faster than the Roku, the remote is more responsive.  You can play Pandora, go back to the home screen, and then let the photo screensaver start on top of the music.  Once HBOGo shows up on it, along with a weather application, it will be everything I want.", "verified": true, "helpfulness": "3/4", "author": "W. Weber"}, {"rating": 5.0, "review": "Received the package in two days as promised (Prime). I had no problem with the Wi-fi connection. Took a little playing around to load my favorites and connect to my Fire HDX, but that's half the fun.I'm impressed with the speed and user interface. Had no problem navigating.I'm not into games, but the few I tried ran smoothly.The fun for me of buying Amazon hardware is the continual surprise enhancements. Thanks Amazon. Bring it on.", "verified": true, "helpfulness": "3/4", "author": "Grinznmore \"jim-in-wa\""}, {"rating": 5.0, "review": "Just got the Fire TV yesterday and I am pleased with its performance so far.  My previous connection to Amazon Instant Video was either to hookup my Macbook, use my Sony Blu-ray DVD player, or throw it up with the iPad. None of those was a satisfying experience. With Fire TV, Amazon has created an easy interface, the first voice command streaming box, and instant on video. As pleased as I am with Fire TV now, my guess is that Amazon has much more in store for the device as they refine it. For instance, why no Amazon MP3 player and my music library? Don't know, but that has to be in the future for this device, just as it is on Apple TV (which I also have -- I don't have a Roku, cable or satellite). Amazon surely will also activate shopping through this device sometime in the future -- why wouldn't they? For now, Fire TV does what I want it to do -- it gives me good, quick access to Amazon's library, plus a number of apps that I am sure will improve with time. Good first effort and worth the price in my opinion.", "verified": true, "helpfulness": "4/6", "author": "Amazon Customer \"Chuck Warnock\""}, {"rating": 5.0, "review": "Second day with Amazon Fire TV, and I'm loving it.As an Amazon Prime member and Netflix subscriber, once setup was done (hardly any, aside from connecting cables and inserting batteries into the remote), I had all I needed to immediately start enjoying this device.If you've ever used a tablet, smartphone and online apps, you'll find a familiar interface that is easy to use, organized well, and is very responsive.  Movies and music stream perfectly (my setup is using a wired network connection), games look great, heck, even the pre-loaded screensaver set is lovely.The only gripe I have is the limited onboard storage: out of 8GB, you quickly consume most of it given the size of some of the apps (e.g. Asphalt 8 is >1GB).  I hope that with the USB connector and some software updates, we will soon be able to connect external storage (memory stick and/or external hard-drives) to expand capacity.Nicely done, Amazon.  You had me at hello... :-)", "verified": true, "helpfulness": "5/6", "author": "Nexus"}, {"rating": 5.0, "review": "I couldn't believe that it only took me 3 minutes to get this all hooked up. It immediately connected to my wifi, I put in my password, the software loaded to it and I was searching Amazon for movies and TV. I can also connect with Netflix, Hulu and Crackle and with my Prime membership, I can watch almost anything. I watched a movie I downloaded to my Kindle a few weeks ago. It went right to my TV and I can pause from the Fire remote control or from the Kindle. I can use any other functions in my Kindle while watching TV and use the IMBD to find out more about the actors in the movie. It turned out to be an awesome experience for me. There are lots of Amazon TV shows which are in their first season so I put a bunch on my wish list. Today, all I have to do after this review is completed is to tell my cable company goodbye. With this small investment, I'll be saving about $65.00 per month which is significant on my budget.", "verified": true, "helpfulness": "6/8", "author": "tick \"tick\""}]