[{"rating": 5.0, "review": "Very easy to navigate!", "verified": true, "helpfulness": "0/0", "author": "Jerod H. Willems"}, {"rating": 2.0, "review": "On my second Fire TV now.  The first one just decided to quit playing Netflix. Spent three hours with Amazon customer service until they gave up.  They let me return it after having it for more than a year, but did not replace it.  I had to pay return shipping and then had to buy a new unit.  Now the new unit is starting to have intermittent connection issues.  I know it is a problem with the Fire unit because we also have a Sony internet USB connection hooked through the same tv and it does not have any problem connecting when the Fire does.", "verified": true, "helpfulness": "0/0", "author": "stunt"}, {"rating": 4.0, "review": "great product very easy to setup and use", "verified": true, "helpfulness": "0/0", "author": "Robert Schramm"}, {"rating": 5.0, "review": "We love Amazon Fire TV!!  It is so simple to use and very, very easy to connect our Netflix and Hulu to.  The Amazon Prime selection is really great.  We save so much $$ by not paying a monthly cable bill and our small children prefer this to cable/DVR because we can select exactly which Dora, Diego, Bubble Guppies, etc. episode we want to watch.  My three year old daughter can use the Amazon Fire TV with no problems.  She uses the voice activated button to find Dora, etc., or to open the Netflix app.  This is definitely one of the best purchases we made in 2014!!!", "verified": true, "helpfulness": "0/0", "author": "jjn2011"}, {"rating": 5.0, "review": "Loving it so far. It has the apps we use most often (Netflix, Flixter, etc...) plus the Amazon Streaming, PLUS games, PLUS PLUS a few things we've never used before like Disney Jr (which my kids LOVE). Everything is crisp, fast, and very user friendly.", "verified": true, "helpfulness": "1/1", "author": "StapleyJohnson"}, {"rating": 5.0, "review": "Great option for streaming videos. Easy setup and good wireless connection.", "verified": true, "helpfulness": "1/1", "author": "Cynthia K. Cooper \"Coops\""}, {"rating": 5.0, "review": "Purchased mainly because of toslink (optical digital) output and ability to downgrade DD+ audio to DD for legacy surround sound amplifier.  Replaced almost three year old Roku 2.  Works great right out of box, voice recognition nice but wish search functioned across multiple services (e.g. Prime, Netflix, etc) like Sonos search does for music.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Merely OK.  I debated - two or three stars.  The sleep mode only works intermittently.  The problem started with my first Fire, and Amazon replaced it.  The new Fire has the same problem.  Sometimes it shuts off, sometimes it doesn't.  Then I have to unplug it for several hours, and in essence restart it.  Huge buffering problems.  If it starts to buffer I just shut it off, because within a few minutes I will get the \"unable to play this selection at this time\" or some such nonsense.  Thank goodness I paid very little for it due to the discount they were offering at the time of sale.", "verified": true, "helpfulness": "7/7", "author": "Michael R. Peterson"}, {"rating": 4.0, "review": "great piece of gear", "verified": true, "helpfulness": "0/1", "author": "Julia Donson"}, {"rating": 5.0, "review": "ty", "verified": true, "helpfulness": "1/2", "author": "Vickie"}]