[{"rating": 5.0, "review": "A+  Works fine with Netflixs and my 46 Inch flat screen TV.  I get on my Google tablet and log into netflixs then I transfer the image to the TV+Chromecast and watch whatever I want.  Very nice and easy.", "verified": false, "helpfulness": "0/0", "author": "Charles Crow \"VA CROW\""}, {"rating": 5.0, "review": "Love the Google Chromecast...easy to install... Plug in and follow the on screen directions. Works great!", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 1.0, "review": "Didn't work at all for me.  Wouldn't even connect, so I sent it back.", "verified": false, "helpfulness": "0/1", "author": "bankshot"}, {"rating": 3.0, "review": "does not work with wwe network app like I was told", "verified": true, "helpfulness": "0/0", "author": "richard starner"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jlg70"}, {"rating": 1.0, "review": "Did not like having to use cell phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Perkins"}, {"rating": 1.0, "review": "Do yourself a favor and get a Roku with remote. This thing is VERY glitchy, at least with iPhone. It constantly loses connection with phone, requiring me to close and reopen the app to regain control. This happens EVERY time we use it, with all three phones (iPhones) in the house.Secondly, we have to unplug it when not in use because it throws interference into all the WiFi devices in our house, causing them all to intermittently disconnect. I purchased for a rarely used monitor in our house, because it was dirt cheap. Learned my lesson and got another Roku with remote, which works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Geezerglide"}, {"rating": 3.0, "review": "I was really hoping this would work more like a wireless HDMI cord than a video streamer.  I cannot stream a dvd directly from my computer to the tv without ripping the dvd, and I cannot cast anything from Amazon Prime or just directly from my desktop.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "It works!", "verified": true, "helpfulness": "0/0", "author": "shane alexander"}, {"rating": 4.0, "review": "We watch Netflix the most at our house and Chromecast doesn't work as well with Netflix as with other apps available - I believe this to be Netflix's app issue not Chromecast. Most other apps have a disconnect function but Netflix does not, so if you use Netflix a lot, connecting and disconnecting from Chromecast is slightly annoying. Sometimes we can't get our shows to stop or pause very easily - maybe someone from Netflix will read this and fix their issue. I also don't like that there isn't a remote included with Chromecast, but overall it works perfectly for casting shows to your TV.", "verified": false, "helpfulness": "0/0", "author": "sarasoda1"}]