[{"rating": 5.0, "review": "so far so good. however, where is the crunchyroll app for amazon fire tv?", "verified": true, "helpfulness": "0/0", "author": "kay"}, {"rating": 4.0, "review": "Nice compact unit and easy to install.  The voice searching is very helpful.", "verified": true, "helpfulness": "0/0", "author": "David  W Dedering"}, {"rating": 4.0, "review": "I'm enjoying the Amazon Fire TV. It's been 3 weeks since I purchased it.  Love the different options of apps. I own a Roku also. I don't feel they have as many app channels as Roku but all the main players like Netflix, Hulu, Crackle are available. If your a prime member it has all your prime videos. So far I'm enjoying it more than the Roku. But would like to see as many options as the Roku player has. One feature that I love is if I look for a video on Prime and its not available it will give you an option of more way to watch like renting or buying the video or actually give you the other service it's on. I am not sure if its for all apps but I also have a Hulu subscription and I have noticed that I will see available on Hulu if you can't see it on Prime videos. Please don't get rid of this feature Amazon!  This is one thing that sets it apart from other media players.  I like the fact that you can do some gaming on the Fire TV, but I feel it's better to have a controller for the games.  I checked and the game controller ships in 2 to 4 months. I will update after I buy one.  One new channel called Sling TV is great for people that don't have cable or \"cut the cord\".  for $20/month you get ESPN, DISNEY, TBS, TNT to name a few.", "verified": true, "helpfulness": "0/0", "author": "David R."}, {"rating": 4.0, "review": "A fine machine, improvement over Apple TV. Easy to navigate and search for shows, artists, etc.", "verified": true, "helpfulness": "1/1", "author": "Thomas Hamilton"}, {"rating": 4.0, "review": "Could not use voice activation on Netflix searches. Hopefully you will modify the product in the near future.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 4.0, "review": "very easy to set up. Performs very fast and clear", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I like Amazon Fire but am not finding that it is a bargain to own.  When I go on it to get the programs I would like to watch there is always a fee.I thought I would be able to get programs and not have to pay for them.  I already had Hulu plus so I'm not sure this is such a good bargainunless I am using it wrong.", "verified": true, "helpfulness": "0/1", "author": "Sharon Brockland"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Love it - great value for its price.  Beautiful picture, runs very smoothly with no noticeable lag.  I am very happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "Michel"}, {"rating": 5.0, "review": "Do the Amazon fire tv have a month payments", "verified": false, "helpfulness": "0/0", "author": "Pumkin"}]