[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Jason Martinez"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "sharnell berry"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jessica Coppinger"}, {"rating": 4.0, "review": "I really like this Fire TV, I wish I would of just paid outright for it though instead of going with the monthly payments, they don't take out when they say they will and it's causing a problem with my bank, but other than that the product is great.", "verified": true, "helpfulness": "0/0", "author": "JoAnn Huffman"}, {"rating": 2.0, "review": "Let me first say I was the most excited person ever to get my Fire TV in! I have 2 Apple TVs already so with me having an Android phone I was anxious to get something that would work better with my Note 3! I was very disappointed after setting it up to find out that Showtime Anytime did not let me login bc they don't allow DIRECTV subscribers to use it or log in! I was so frustrated to find this out! I really hope it is not the same way when they get HBO GO in the future. The screen mirroring does not work on the Fire TV either but it is working on my Fire TV Stick! I'm super disappointed by this!The Netflix doesn't always work and sometimes requires me to sign in again as well.I hope these are just bugs and get resolved by future software updates and Amazon allows Showtime Anytime to accept Directv subscribers. The Kindle version allows it so why not the Fire TV???", "verified": true, "helpfulness": "0/2", "author": "chris"}, {"rating": 5.0, "review": "Small sturdy box. Very easy install. So far so good.", "verified": true, "helpfulness": "0/0", "author": "Jam Debris"}, {"rating": 5.0, "review": "Easy to set up and use.  Plenty of good content with Prime but also has a huge rental library.", "verified": true, "helpfulness": "0/0", "author": "benjamin stoneman"}, {"rating": 5.0, "review": "It's sleek and fast... But Need little bit improvements with using the remote... Browsing should be made to wrap around... Now I have to go backwards instead of wrapping. Also it would be nice if voice search is available for other apps too for eg. Netflix", "verified": true, "helpfulness": "0/0", "author": "Ganesh Srinivasan"}, {"rating": 5.0, "review": "Great piece of equipment. Easy to set up and easier to use.", "verified": true, "helpfulness": "0/0", "author": "marco davila"}, {"rating": 5.0, "review": "Excellent product, fast response time compared to DVD applications.", "verified": true, "helpfulness": "0/0", "author": "Alan"}]