[{"rating": 5.0, "review": "So far no complaints, easy set up easy to use great  investment", "verified": true, "helpfulness": "0/0", "author": "ronnie"}, {"rating": 3.0, "review": "So far so good Still learning how to use it.", "verified": true, "helpfulness": "1/1", "author": "LUCILLE"}, {"rating": 5.0, "review": "Easier than pie. Came pre-loaded with all my prime content and set up was less than 5 minutes and go!!  still have my TiVo for cable and Netflix but I can switch over to fire tv with the click of a button for its prime content and all the other content not available on Netflix.  Amazing quality.  Very happy.", "verified": true, "helpfulness": "1/1", "author": "jude"}, {"rating": 5.0, "review": "smart TV without buying a new  set. none of the delays mentioned in reviews", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Amazon fire TV sucks ,thank god for the free 30 day free trial.Any movie my kids want  to see cost money.What a waste buying the box!", "verified": false, "helpfulness": "1/12", "author": "Brad Walter"}, {"rating": 5.0, "review": "Easy set up, fast deliverary. Had some trouble with one month free trial for Amazon prime subscription.Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Hawaiigirl"}, {"rating": 5.0, "review": "Love it. Just retired and will be using it much more. Use it during my indoor running helps pass the time.", "verified": true, "helpfulness": "0/0", "author": "Bev"}, {"rating": 5.0, "review": "Better than I could have hoped. He loves it and so do I.", "verified": true, "helpfulness": "0/0", "author": "Karole Miller"}, {"rating": 5.0, "review": "Does what is says and more thanks CJ...........", "verified": true, "helpfulness": "0/0", "author": "CLINTON JONES"}, {"rating": 2.0, "review": "Would not let me install Netflix! I tried the Fire TV forum with no luck and looked for a way to contact Amazon for assistance, once again no luck! Sent this back and ordered another Roku 3 since it works with no problem and has no problem letting me install Netflix,", "verified": true, "helpfulness": "1/5", "author": "Amazonfan"}]