[{"rating": 4.0, "review": "Very nice to watch movies, listen to music if you have strong wifi connection near the TV and is user of netflix, google movies, google music. Had some trouble setting it up due to a network with a bad setup (MTU value was wrong), but in other places, setup was smooth.", "verified": true, "helpfulness": "0/0", "author": "M. Ribeiro"}, {"rating": 5.0, "review": "Works great, easy setup", "verified": true, "helpfulness": "0/0", "author": "Jon Vann"}, {"rating": 2.0, "review": "Not impressed, especially the streaming speed, and more importantly even though it needs to be casted from Chrome browser, they want us to keep the browser open. I think, they should improve by having app for Chrome browser like Youtube, netflix etc., Returned back, as I was not satisfied", "verified": true, "helpfulness": "1/1", "author": "Nanisha"}, {"rating": 5.0, "review": "This thing is one of my favorite things in my life.  I love beaming things over from my ipad.  <3", "verified": true, "helpfulness": "0/0", "author": "morningmist \"morningmist\""}, {"rating": 5.0, "review": "This is a VERY reasonable way to connect your other devices (phone, computer) to stream on your main television screen. Do be aware that the device is powered by an AC cord, so consider that when purchasing and planning your setup. Nobody likes seeing cords hanging all over. That said, it does its job wonderfully. The screensaver standby is a nice touch. If you plan on cutting the cord with cable/satellite, start here, then go pick up an HDTV antenna. http://www.amazon.com/gp/product/B00DIFIM36/ref=cm_cr_ryp_prd_ttl_sol_10", "verified": true, "helpfulness": "0/0", "author": "daghouse"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Andres Perez Taboada"}, {"rating": 5.0, "review": "Chromecast is now the entertainment hub in my home. Very easy to connect via pc or phone. Only issue is the lack of support from several video apps for easy casting via mobile device.", "verified": true, "helpfulness": "0/0", "author": "Dominick"}, {"rating": 2.0, "review": "It is not working well (lag) when I try to send a film to my TV. Sound is not played properly.", "verified": true, "helpfulness": "0/1", "author": "Alexandre TAUVY"}, {"rating": 5.0, "review": "It takes a little time to understand how it works, but once you do, it is a great thing to have!", "verified": true, "helpfulness": "0/0", "author": "Николай"}, {"rating": 5.0, "review": "Love these; I have one on each TV", "verified": true, "helpfulness": "0/0", "author": "Brian Paul"}]