[{"rating": 1.0, "review": "We never could get it to work. It kept making us change the settings on our router. As opposed to the roku we also purchased and it just...worked.", "verified": true, "helpfulness": "0/0", "author": "Marlissa"}, {"rating": 5.0, "review": "we use this to stream netflix to the TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "libertymarie"}, {"rating": 5.0, "review": "I have already received the product and am satisfied with the purchase, thanks", "verified": true, "helpfulness": "0/0", "author": "Yamid Rojas"}, {"rating": 5.0, "review": "Best gadget I've bought in ages. So easy to use and set up for streaming. Not sure what took me so long to get one.", "verified": true, "helpfulness": "4/4", "author": "Mom of Boys"}, {"rating": 1.0, "review": "failed quicklynever seems to find connection even though everything around it does", "verified": true, "helpfulness": "0/0", "author": "Christopher P Willis"}, {"rating": 5.0, "review": "I love having this on my living room TV.  Using my android tablet, I can launch shows on Netflix, HBO Go, or Youtube and watch to my hearts content.Unfortunately, Amazon Prime video is not yet supported on Android devices, leaving me to use my PS3 to watch that.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "We got rid of cable three years ago and stuck to our Smart TV and Roku with Netflix.. The Chromecast has allowed us to expand our shows to HBO, Disney Jr and more just from streaming off of our smart phone or iPad.", "verified": true, "helpfulness": "0/0", "author": "Sinclair11"}, {"rating": 3.0, "review": "This device works real well once you get it working right. I'm a certified PC Technician and very electronically inclined.It still took a week to get it working right. I gave 3 stars because there isn't much in the way of documentation (online or written). The support forums don't really have helpful people in it. I feel bad for those that run into problems and don't have a state of mind that allows for troubleshooting and fixing things. Luckily for me, I can \"figure out\" just about any gadget. If you purchase this item just be prepared that we are not in \"a perfect world\" and things go wrong that you'll have to \"figure\" out by yourself.", "verified": true, "helpfulness": "0/2", "author": "Jean Walker \"theozzlives\""}, {"rating": 4.0, "review": "after 3 months of using it, it occasionally disconnects itself not sure it's the hardware problem or, software problem (youtube/chromcast)", "verified": true, "helpfulness": "0/0", "author": "Enoee"}, {"rating": 4.0, "review": "Great product. More apps are becoming compatible with it. Fun for gatherings", "verified": true, "helpfulness": "0/0", "author": "Cezasf"}]