[{"rating": 5.0, "review": "Perfect and great value...", "verified": true, "helpfulness": "0/0", "author": "LEIGH ANN GRIFFIN"}, {"rating": 4.0, "review": "I recently \"cut the cord\" and needed a media player for the television in my bedroom. At the moment, I'm using Hulu Plus only. My only disappointment is that I can't stream Amazon Prime because I have an iPhone. Otherwise, this does a good job for what I need.", "verified": true, "helpfulness": "0/0", "author": "Kimberly"}, {"rating": 3.0, "review": "Something to note before buying, this device will not work in hotels.  If you purchased it thinking it would be a great travel device like I did, you will be sadly mistaken.  The device cannot connect to the Internet if you have additional sign-in pages like you would at a hotel.  It works fine at home, but I already have devices that can connect to Hulu and Netflix without the use of my computer or phone.", "verified": true, "helpfulness": "0/0", "author": "land_shark3"}, {"rating": 5.0, "review": "good product", "verified": false, "helpfulness": "0/0", "author": "Alex Jauregui"}, {"rating": 5.0, "review": "Very usefull tool. I am using it almost daily and pleased with the results.", "verified": true, "helpfulness": "0/0", "author": "omar"}, {"rating": 5.0, "review": "AAA+++", "verified": true, "helpfulness": "0/0", "author": "Joe B Boyd"}, {"rating": 5.0, "review": "HBO Go on my TV! Previously I had been using display out from my tablet to HDMI on my TV, and picture quality was no where near as good. Plus now I can skip through the intro, play the next show etc from my couch instead of getting up. Well worth the money!", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 2.0, "review": "Worked ok initially but now it drops the connection every few minutes.  Good idea if you don't have a smart tv but needs some serious improvement.  Probably won't last as smart tvs become more prevalent.", "verified": false, "helpfulness": "0/0", "author": "Gary J. Kleier \"GJ Kleier\""}, {"rating": 5.0, "review": "Does what I want it to. Netflix works, Youtube works. For $35 you can't go wrong!", "verified": true, "helpfulness": "1/1", "author": "jeff"}, {"rating": 4.0, "review": "I've been using Chromecast at home to stream from Netflix and Amazon Prime.  My internet tends to be unreliable in the area I use the device, and I've had some trouble with connectivity.  I purchased a few Chromecast devices for teachers in my school this year and so far it's gotten great reviews.  It's easy to set up and to use.  The teachers love the ability to wirelessly connect to their projectors.  Teachers have been connecting to Chromecast with MacBook Airs and Samsung Chromebooks.  The range is about 10 feet.  I see a lot of promise for students presenting work wirelessly as well.", "verified": true, "helpfulness": "0/0", "author": "Katie"}]