[{"rating": 5.0, "review": "do you have to have cable or sat, to have amazon fire or will it work with kukuI don't do games", "verified": false, "helpfulness": "0/2", "author": "anita parish"}, {"rating": 4.0, "review": "After a couple of months of use in a household that also contains a few Apple TVs, a Roku XS, and a variety of other media players, the Fire TVs have found their place. Mainly we use it for inexpensive, light gaming, but I also like to see what new free content can be found on Amazon Prime.In terms of gaming, it's a great value. The Android games you can buy are cheap, and the featured ones are usually a lot of fun and make good use of the optional Bluetooth Gamepad. I've got a lot of inexpensive enjoyment playing the Asphalt 8 racing simulator and my kids have enjoyed a variety of flashy games where things blow up, a lot. The hardware is powerful enough to make for a smooth and enjoyable experience. Compare with a Wii U which has a better integrated experience but games cost, literally 20x as much. We like our Wii U, but in terms of enjoyment per dollar, the Fire TV has it beat.  If you intend to game, you will want to get the Amazon Fire Game Controller, or alternative gamepads which work well too. I have a Mad Catz C.T.R.L.R Gamepad which I've found to work as well or better than the official Gamepad.In terms of video content, my kids and I have drifted back to using the less flashy but more easily navigable Apple TV. The interface for 3rd party video portals like Netflix, YouTube, Crunchy Roll, and PBS are consistent on the Apple TV, and YouTube especially benefits from Apple's support of 3rd party Bluetooth keyboards; I would not want to search YouTube on the Fire TV with the included remote, life is too short. Also, Apple tends to have more free content to own: every weekday there is some first episode of a TV show to pick up and browse, and it's convenient in terms of bringing content along on a variety of devices to own and download instead of stream. As for 1080p video quality, the Fire TV is quite handsome, but I'd still give the best in class award to either Apple or Vudu.As for navigation, it's certainly flashy zipping around the grid, but I find it's easy to go down an unintended path, and as for voice control, that is very hit or miss and only works for a subset of the available content.The hardware is well done and shows how much Amazon has grown as a hardware company, this is not the junky original Kindle Fire, this is a mature hardware platform competently executed.I would say this box has a place under many American TVs. It's fun and well done and is a good value in terms of free and inexpensive content.", "verified": true, "helpfulness": "0/1", "author": "Glenn R. Howes"}, {"rating": 5.0, "review": "The only thing that I was not happy about is that the voice search only works in prime, other than that it works well..", "verified": true, "helpfulness": "0/0", "author": "Richard Davenport"}, {"rating": 4.0, "review": "We watch this thing constantly. As a matter of fact, our DIRECTV just now went out because it's storming pretty bad out... time to watch the fire TV!!!!!!! We love it.We had a day where it wouldn't play anything... I called Amazon and they had it fixed in minutes and told us what to do if it happened again.We also had a day where the remote stopped working out of nowhere! I changed the batteries and it still wouldn't work. Tried it again a few hours later and it was working.... weird.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 4.0, "review": "Disappointed that Amazon MP3 isn't/wasn't available on launch..  Would like to play MP3s/FLAC from my Amazon MP3 library... (and my own library for that matter..)Also hope for more music service options, like Spotify/Play/SiriusXM ...(That SPDIF port looks tempting)(Seems to have added Spotify Connect.. which works but is a meh solution, Still no SiriusXM.. Understand the No Play Music butperhaps some #Allplay integration would be an improvement over the Spotify Connect app..Also no Crunchyroll in HD... (Seems like this has been fixed. Crunchys avalible in HD it seems like)Would like to see a smarter onscreen keyboard.. minuum or something a bit more intelligent/predictive.. the voice input is nice though when its accessible (currently does not work in all apps)I own 2x Rokus, 4 Squeezebox Radios, 2 Chromecasts, 2x Gramofons running Qualcomm AllPlay, a few Chumbys, and I still like the Fire TVs way of doing things better than most of them.. Like to be able to access more of my own content on my home network as well...-JUpdate:Spotify is sort of available now using Spotify Connect technology.. But I would have liked to see more functions in the app and not rely on the phone...Android Mirroring now works on Android devices that support it, in addition to the Amazon Tablets... (I think its Miracast based)Still no sign of a Sirius/XM app, or some ability to stream my OWN content to the Fire TV(Know Google Play support was unlikely but it would have been nice to be able to use my subscription)Crunchyroll seems to now be available.. Think its in HD now but not sure of the resolution.. Anime/Cartoons have issues with scaling and compression so its not easy to tell..", "verified": true, "helpfulness": "0/0", "author": "J. Palaima"}, {"rating": 2.0, "review": "No matter how good the box is, Prime is still $99/ a year for shows that you still have to pay to watch.the offering of shows included in the membership that do not cost you additional is slim and conveniently blended into the pay to view content.  Most if not all seasonal shows have the 1 maybe 2nd season free then all subsequent seasons are pay per view.=there is no value here.  Netflix beats Prime hands down.", "verified": false, "helpfulness": "2/6", "author": "The Cat man \"Ric\""}, {"rating": 5.0, "review": "had the apple. after 2 of them we decided to switch to the amazon fire.  Its been awesome....my wife loves the ease of use..", "verified": true, "helpfulness": "0/0", "author": "Kevin P. Kelly \"kaker\""}, {"rating": 3.0, "review": "Its not really what I expected. I thought there would be more recent free movies and that even some of the older popular movies would be free. I was looking at it as an option so I could cancel my satellite tv service. Most of the movies cost more than I would pay with my satellite service.It is easy to use and was easy to set up.", "verified": true, "helpfulness": "0/1", "author": "Jeanette Robbins"}, {"rating": 4.0, "review": "Got this for my guy for his birthday.  He's enjoyed it.  I mainly got it so he can watch all the shows he watches on Amazon Prime on our TV instead of on his computer.  We've not had it long, but it's been nice so far.  My only complaint is that like Apple TV, many movies we want to watch are for sale rather than rent.  I don't want to buy a 30 year old movie, I just want to watch it.", "verified": true, "helpfulness": "1/2", "author": "Kiki"}, {"rating": 5.0, "review": "Fire Tv from amazon is fantastic. Cant wait for the update soft so my music can be down loaded from the cloud. Being a prime member makes Tv Tv even better.", "verified": true, "helpfulness": "0/0", "author": "j. duter"}]