[{"rating": 5.0, "review": "I love chromecast so much now i use it everyday for my Netflix and huluplus, this thing saved my life from watching movies and shows on my phone or tablet", "verified": true, "helpfulness": "0/0", "author": "Alexandria Slater"}, {"rating": 3.0, "review": "Does what it's supposed to do.  Easy set up.  Wish it was 1080p.Won't work with older versions of Android (and by older I mean like 2 yrs old.  That's unbelievable).  I have an Asus TF101 tablet which is running gingerbread I think and chromecast won't support it??  Doesn't Google make Android??But it works great with my Galaxy S3 so I'm happy about that.Now just TODAY I am reading that Google has released a bunch of new apps that will work with chromecast...including PLEX!  This means you should be able to cast LOCAL MEDIA without having to jump through all sorts of hoops (\"you can cast local media from your desktop by typing C://filename into a new chrome tab, then press CTRL+ALT+F5, B,A,B,A Select, Start, so you can play your media on the tv and still use your computer/laptop....but this won't work from your phone or tablet so you're kind of screwed there, ha!\").  Read some of the other comments here and on YouTube and you'll see what I mean.So if this is actually true then I would think about giving it 4 STARS but until I try these new apps out it gets 3 STARS.", "verified": true, "helpfulness": "1/1", "author": "Styles G Monkey"}, {"rating": 5.0, "review": "This is so RAD! Connects easily, I have google chromecast permanently plugged in the tv to watch anything from netflix, hulu and youtube. It's great/excellent/awesome.", "verified": true, "helpfulness": "0/0", "author": "*"}, {"rating": 5.0, "review": "Just Buy it!Bought it.Pluggled it (HDMI port in Sharp Aquos)Powered it.Set it up  - In IPad Mini  - In 2 IPhones  - In 1 Android Samsung galaxy 2  - Downloaded Chromecast extension for Google Chrome  - Played movie in all and watched them in my TV  - all in less than 30 min.Just Buy it!", "verified": false, "helpfulness": "0/0", "author": "P. Nagaraj \"pen pals\""}, {"rating": 5.0, "review": "Google's Chrome-Cast is a game changer. Now you really can just throw anything you're watching in Chrome onto your TV.While Netflix and YouTube already have the option to \"cast\" built in, you can just throw anything you're doing, including web surfing, Facebook, or whatever, right up onto your TV as long as you're using Chrome. Amazing. And at the price point?! Seriously sweet move Google.TIP: The Chrome needs a power source and comes with a USB cable. I had it plugged into a wall socket for months before I realized that most TVs (including mine) now have a USB slot on the back. So the TV will keep the device charged up. Just plug it into the USB slot if your TV has one!", "verified": true, "helpfulness": "1/2", "author": "C. Elrod \"WanderingCDE\""}, {"rating": 4.0, "review": "I am happy about this product. It was exactly as I read about it and it reached me in good condition. I recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Abdulmalik A Atar"}, {"rating": 3.0, "review": "Not a bad way to turn any TV into a smart TV for the price. It is a little disappointing that there are not a ton of apps out there yet that can use this, but I guess that will change with time. I do however enjoy the price point of this over say an Apple TV or a Roku. It gets the job done when I want to watch Hulu or Netflix. I do wish I was able to show more stuff on my phone with it like I can my Apple TV. I have also ran into some points when using apps that are compatible with the device and I sometimes have to reboot the device for it to associate to the Chromecast and display what I am watching. Not a big problem but gets a little annoying when you have to do it. If looking for a cheap and useful Christmas gift I would definitely recommend this to anyone.", "verified": true, "helpfulness": "1/1", "author": "Drew Wojciechowski"}, {"rating": 5.0, "review": "I bought this because I love new gadgets. And google makes good things.PROS-cheap-easy to set up-many new things in beta, expected to see more development-control netflix from my bed to tv like a remote-use chrome to stream videos from laptop to tv-better than itunesCONS-my desktop has no wifi card so i use laptop/iphone instead-some tvs come with built in wifi so this can be redundant-runs on win7/win8 but NOT XP. beware if you have old laptop-HDMI cord can do more but with less devices-i use HDMI to run between desktop and tv, desktop has more power/videos than laptop doesOVERALLWould buy for everyone i know! Great product that moves into the wave of the future of cordless. Sadly, I stalled on getting one and missed out on 3 months of Netflix but oh well. I split the bill with roommates so it was only a few bucks lost.", "verified": true, "helpfulness": "1/1", "author": "Nathan Venturini"}, {"rating": 1.0, "review": "I have tried to make this work at three locations with three different ISPs and there is a known, unresolvable issue stated on the ChromeCast sire for each of these...won't work anywhere and want my $$$ back!!!", "verified": true, "helpfulness": "0/3", "author": "Mike Walker"}, {"rating": 4.0, "review": "For the price, it's a great little device. So far, it's still a little limited, but the number of supported apps keeps growing. With the recent update, it is now possible to play local content from your tablet/phone (finally) through the Avia app (for $2.99), as well as support for a few other popular apps like Vevo. $35 is an incredible deal, considering similar devices, like a Roku box, can cost upwards of $50. lt is still missing support for Amazon Instant Video, but I have hope that it will happen eventually. I have noticed that the device itself does occasionally need to be factory-reset, which is why l'm only giving it four stars instead of five, but that process only takes a couple of minutes through the Chromecast app. All in all, it's a very good deal and a useful device.", "verified": true, "helpfulness": "0/0", "author": "Peaseblossum"}]