[{"rating": 5.0, "review": "Works awesome and great for streaming between mobile devices and a tv!", "verified": true, "helpfulness": "1/1", "author": "Danielle Hayes"}, {"rating": 4.0, "review": "First off this a super little device that will easily replace the built in streaming options that ship with my Vizio TV. Much nicer to use my smart phone to fling content than the clunky built in TV UI. High quality streams that start fast. I hope more apps include Chromecast support, especially Amazon VOD. This should be the thing that pushes Amazon into releasing a non-Kindle VOD player. The marketing material sadly leave off any mention of Linux, but this works perfectly fine casting URL's and tabs from Chrome on Linux. I am a bit disappointed that I have not received the promised 3 months free Netflix promo code. Google ended the promo quickly, but should at least honor it for devices purchased the first few hours of release.I didn't give the device 5 stars because of some performance issues when casting a full Chrome tab.", "verified": false, "helpfulness": "0/0", "author": "Brad Wyckhouse"}, {"rating": 4.0, "review": "I love my chromecast. I'm able to stream movies to my projector from my iPad which is very convenient. It works great once I figured out how to set the dang thing up. I originally tried to set it up in our lobby so customers could watch netflix while they waited but the chromecast won't connect to our wifi since it has a public access network set up through it.Besides that, I just wish you didn't need to power it with a usb port. It works great for some but an onboard battery option would be good for more mobile applications.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was simple to use. And it worked.", "verified": true, "helpfulness": "0/0", "author": "M. J. Hannahel \"markjhannahel\""}, {"rating": 5.0, "review": "The best and only way to stream to your tv! The BEST I own 3 of them.", "verified": true, "helpfulness": "0/0", "author": "Dave Spina"}, {"rating": 5.0, "review": "Awesome product a must for dorms", "verified": true, "helpfulness": "0/0", "author": "Nick K."}, {"rating": 5.0, "review": "Nice,,", "verified": true, "helpfulness": "0/0", "author": "Aref Aburrobb"}, {"rating": 3.0, "review": "I cant seem to get this product to work. I might be doing something wrong but have yet to get it to connect to my iPad.", "verified": true, "helpfulness": "0/0", "author": "Scott H Koehn"}, {"rating": 5.0, "review": "I love this device. If only prime instant video would offer support for Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Fil"}, {"rating": 5.0, "review": "I now have two of these are they are really a good buy.", "verified": true, "helpfulness": "0/0", "author": "Jack D Lazard"}]