[{"rating": 4.0, "review": "My only issue is that it heats up quite fast", "verified": true, "helpfulness": "0/0", "author": "Michael Jon Tanag"}, {"rating": 5.0, "review": "What a terrific product.  It works great and it is very nice to be able to show things on the big screen TV rather than everybody trying to look at the computer.", "verified": true, "helpfulness": "0/0", "author": "M. M. Tipps \"willysman\""}, {"rating": 4.0, "review": "works as advertised -s ort of. cant cast teh desktop, which was my goal, only browser tabs...", "verified": true, "helpfulness": "0/0", "author": "Olaf K"}, {"rating": 5.0, "review": "Like the size and simplicity of install - works great!", "verified": true, "helpfulness": "0/0", "author": "crosscro"}, {"rating": 5.0, "review": "Best thing I've ever bought!", "verified": true, "helpfulness": "0/0", "author": "Average Joe"}, {"rating": 4.0, "review": "It's pretty cool, but it does have some issues, one of them being flaky WiFi. I read the cable is the antenna, so I bought an 8-inch HDMI extension cable and that made WiFi access much more reliable. It won't play AVI files, but MP4 and MKV play just fine. That's all I've used it for, so I cannot comment on its other capabilities. If your WiFi access point is in another room, get an 8-inch HDMI extension cable; otherwise you will hate this thing.", "verified": true, "helpfulness": "0/0", "author": "Gyz \"Ig\""}, {"rating": 5.0, "review": "I LOVE IT!  Just don't forget to add a USB cable to the list when ordering your Chromecast Stick.", "verified": true, "helpfulness": "0/0", "author": "Sheri C"}, {"rating": 1.0, "review": "no cast icon in chrome browser iphone 4sComment #91 on issue 314 by alanwils...@gmail.com: Chromecast icon missinghttps://code.google.com/p/google-cast-sdk/issues/detail?id=314Same issue as above, was very surprised that you classify a missing icon asa moderate issue. The device is unusable. Using Samsung Galaxy S4, iPad3and Netflix cast icon has disappeared from Netflix apps.", "verified": true, "helpfulness": "0/1", "author": "jme"}, {"rating": 5.0, "review": "I love you Google. This solved all my multimedia problems. This paired with Google Play Music All Access (goodness that's a bunch to type) is heaven.", "verified": true, "helpfulness": "0/0", "author": "Wes Campbell"}, {"rating": 3.0, "review": "Probably should have done more research before I ordered it...", "verified": true, "helpfulness": "0/0", "author": "Regina Phalange"}]