[{"rating": 5.0, "review": "Great product! Love everything about it so far.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 2.0, "review": "Only thing I hate about it is that it can't read a hard drive to show videos. Which the roku can with the roku media player. I am going to return this Amazon Fire TV to get another Roku 3. Sucks too because its pretty fast. But junk is the usb port can't read a usb drive. Amazon messed up on this one. Possibly to roll out another one next year for more people to buy. HORRIBLE!!", "verified": false, "helpfulness": "2/4", "author": "mark"}, {"rating": 4.0, "review": "We love the Amazon Fire. It was very reasonably priced and extremely easy to set up, and is very easy to operate. It may be my imagination, but the picture seems even better than on our regular HD TV. Even though we have On Demand, the movies on Amazon Fire are a little cheaper and many are free to Amazon Prime members. I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Linda F. Foster \"Linda F\""}, {"rating": 5.0, "review": "This device is awesome!Prior to purchasing this, I was using a Samsung Blu-ray player as a streaming device.  With fire TV, I almost never find myself in a position where the player is needing to rebuffer. Everything is just extremely smooth. I really love the interface is well.  Well done Amazon!", "verified": true, "helpfulness": "0/0", "author": "John Robert Hight \"johnny634\""}, {"rating": 5.0, "review": "We bought the first one for our main television, and it was fantastic to have both Amazon Prime movies available to us, along with our subscriptions to Hulu and Netflix all in one place!We bought a second one for our back room TV and love it too! We gave up cable TV some time ago, and being able to watch all three of our \"networks\" in a seemless, easy to use, plug-and-play technology couldn't be better.", "verified": true, "helpfulness": "0/0", "author": "Jules \"Jules\""}, {"rating": 5.0, "review": "This combined with Plex is a fantastic media box!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"funenuf\""}, {"rating": 5.0, "review": "It's fast and it just \"works\". I love it.", "verified": true, "helpfulness": "0/0", "author": "Enginman"}, {"rating": 4.0, "review": "My broadband download speed is just 5 mbs which on paper isn't fast enough for streaming true hi-def video so that was a big worry going in. After watching 8 or 9 films this issue is laid to rest with just one caveat. The quality is very good over all but don't expect to equal the hi bandwidth stations from directv such as HBO or other premium channels. So far there have been no glitches or pauses relating to buffering issues despite my old obsolete router which isn't even rated for video streaming. The movie offerings for prime members (an absolute must) are free and the selection is pretty good and include recent films and some nice classics such as Bladerunner, Terminator 2, Hunger games and so on. The small remote is a bit funky at first but I've come to like the simplicity. I'm very satisfied so far and it will only get better with time. It's a no-brainer for prime members.", "verified": true, "helpfulness": "1/1", "author": "Roy A. Crocker"}, {"rating": 5.0, "review": "Being able to stream any prime show from any device is priceless. This is worth every penny.", "verified": true, "helpfulness": "0/0", "author": "IzKha"}, {"rating": 5.0, "review": "The voice command on this works like a charm. It has not mattered if I use it, or my mother, with her heavy accent uses it, or anyone for the matter, it always hears us clear and gets us what we need. I am so happy i Decided to go with this over the roku.", "verified": true, "helpfulness": "1/1", "author": "Rieon"}]