[{"rating": 5.0, "review": "I got this device on a 30 day trial. At the end of the trial it was a hands down decision that I would be buying it. I love this device. All my favorite streaming apps plus games. And only for $100. Definitely a steal.", "verified": true, "helpfulness": "0/0", "author": "Jaalah101"}, {"rating": 5.0, "review": "I am an apple junkie and have used the apple tv\"s since they came out.The fire works so much faster.  I could not believe the difference in the download speed.The voice control has worked much better than I thought it would.", "verified": true, "helpfulness": "0/0", "author": "Jane doe"}, {"rating": 1.0, "review": "The fire tv doesnt support DIRECTV.  Roku has way more channels.  I wish i bought roku.  I am not satisfied.", "verified": true, "helpfulness": "1/3", "author": "RUDY E DENMEADE"}, {"rating": 3.0, "review": "Small unit, doesn't take up much space. Works like others we've had. Voice search is nice, but doesn't always understand what you are looking for. Doesn't have some Apps that we wanted.", "verified": true, "helpfulness": "0/0", "author": "Steven F. Elensky Jr."}, {"rating": 4.0, "review": "I received my order and was excited to get it hooked up, but it did not include the needed HDMI cable so I went shopping locally and bought one for 20.00 bucks. I then discovered that my big screen TV does not have a HDMI connection. I have TVs all over the house that do but my main viewing location is the living room and that unit doesn't even though it is a 60\" HD TV. the picture is great with the cable service I now have so I am stuck with it for a while until it goes out. I refuse to buy a new TV just to have the Fire service. I was disappointed to say the least and will probably try it or something else similar in the future. Who knows what technology will be available by the time I get that new TV. I was confident when I ordered Amazon Fire TV that it would be a good addition to my entertainment choices and still think that it is for those that have the proper equipment to use it.", "verified": true, "helpfulness": "1/3", "author": "G. Flowers \"flowpo\""}, {"rating": 4.0, "review": "I have had Apple TV, Google Chrome Cast, Roku 1/2 boxes for streaming TV.  Nothing is as cool or as user friendly for my kids as this Amazon Fire TV box.  The voice activated remote understands everything my 8 year old, 10 year old and 14 year old kids say.  They can access their TV shows by saying what they want instead of trying to get through multiple menus (although to be fair, my 8 year old was always a whiz at that).  The only reason it is not 5 stars is that the voice activated feature works GREAT with Amazon Prime Video, but if you are trying to get into Netflix, you are still left with saying \"Netflix\" and then scrolling through to find what you want.  Until Amazon Prime rivals Netflix on kids TV show availability we will be hearing \"Netflix\" continually at our house.  I use it to do a search in Amazon Prime by actor, title, genre, etc.  I was hesitant at first after watching Gary Busey talking to a lamp and his pants, but I recommend Amazon Fire TV if you want a streaming box.", "verified": true, "helpfulness": "0/0", "author": "William G Pittenger"}, {"rating": 1.0, "review": "Does not have near the streaming opportunities the Roku has. The search on the Roku is almost much more inclusive.  Thanks for the free trial!", "verified": true, "helpfulness": "2/2", "author": "M. Ratcliff"}, {"rating": 4.0, "review": "I  like the device is easy to set up and use,it needs more apps and channels,Love the screen saverThe thing that I did not like is that tou have to purchase the game controller separately it would be nice if it was sold as a bundle,", "verified": true, "helpfulness": "0/0", "author": "Ana Galvan"}, {"rating": 2.0, "review": "This item is jus ok. I have a sony blu ray smart dvd player and got this under a free 30 day trial. I sent the item back and got another blu ray player instead. This device is incredibly slow to load pages and movies compared to the sony, the remote has very limited functionality and requires a large jump back to main menus instead of page by page, that was really frustrating. The right direction arrow didn't work well and had to be pressed hard which then would cause it to skip multiple \"pages\". The only real benefit this has is the games and really I don't consider that a benefit. Hopeully, like so many tech items the next generations will be better but I personally would skip this for now.", "verified": true, "helpfulness": "1/2", "author": "Jason Woodman"}, {"rating": 4.0, "review": "Pros:- Solid, not cheap feeling.- Excellent performance for the price.- Remote actually works!  and works the best, Voice too!- Wifi works perfect.- Easy to use, my 6 yr old and 4 yr old boys instantly knew how to use it.- Its from Amazon, so you know you're getting good quality and support.Cons:- 8GB of storage is no where near enough, fills up too quick.- It needs a physical or virtual power button, cuz the sleep after xx minutes does not always work.- It needs a better developer mode or open up more so that Google Play store works, I do not want to have to pay for apps/games that I have already paid for...so apps/games are limited (for now) on the Fire TV.- Needs to have a Micro SDXC slot for expansion and backing up/saving.Final verdict:Had to return it, as I am a power user.  Needs to offer another, upgraded version, more bang.  I'm more than happy to pay more.  Preferably with the new Nvidia Tegra K1 processor.  Would like to see USB 3.0 ports.  Other than that, I love it and look forward to the next gen version!", "verified": true, "helpfulness": "1/1", "author": "James L Hungerford"}]