[{"rating": 3.0, "review": "Works well, but if you don't use Netflix it doesn't have much use.  If you have a recent game console, or a media center PC this won't be very useful unless you travel and sit in your room a lot.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 3.0, "review": "It needs an SDK to work on for a start. More app support! Only supports a few big time apps such as Netflix and Youtube", "verified": true, "helpfulness": "0/0", "author": "Carsen Klock"}, {"rating": 1.0, "review": "Only had 2 apps that I could watch on tv.  That was very disappointing. I ordered a neoTv & it has about 20 apps that I can watch on tv.  The bad thing is I ordered 2 of them to give one as a gift. I just put them in top of closet & am using the neoTV all the time.", "verified": true, "helpfulness": "1/3", "author": "LKC"}, {"rating": 5.0, "review": "Works great and is affordable. Just have to wait for Google to add compatibility for more software/providers, but it wont be long now. Wife likes to put picture slideshows up on TV when family visits - flawless.", "verified": true, "helpfulness": "0/0", "author": "MRMarty"}, {"rating": 5.0, "review": "I love this cause I wanted to watch netflix and use my tablet. Idk about other purposes but works great for mine.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Great alternative to Directv...but wish chromecast offered more free channels like roku does.  Hopefully one day!  Cable and satelite services are goners!  This is the future!", "verified": true, "helpfulness": "0/0", "author": "BriansMac"}, {"rating": 3.0, "review": "I like the casting from my PC. Unfortunately I have an ipad so not much I can do with it. It needs a remote control", "verified": true, "helpfulness": "0/0", "author": "Aracely Martinez"}, {"rating": 5.0, "review": "Bought it on Sunday, arrived Monday.  Took about 5 minutes to set up.  Too easy to use.  Works exactly as advertised.  Just bought  a second one for another room in the house.Quick Update.  I decided to try \"Tab Casting\" Amazon Prime through a tab in Google Chrome with my laptop.  Worked like a champ, you just need to play via flash and not Silver Light.", "verified": true, "helpfulness": "0/0", "author": "Fisch"}, {"rating": 5.0, "review": "Easy to use and easy to set up. Came in on time. I own both Apple TV and Chromecast, but I think I'm leaning more towards the chromecast. Must buy!", "verified": true, "helpfulness": "0/0", "author": "Mohak rastogi"}, {"rating": 5.0, "review": "Been looking for a product like this to use in my home, I have a $100 roku, and a $250 sony blu-ray with all the connected apps, and I can say even though there are only 5 apps that are available for the chromecast at the moment (I have heard that the chromecast will be getting a significant amount of apps in the future) its still a great piece of tech, love the chromecast over the roku and sony online apps. The display quality is superb and its only $35!!!!!!!!!Remember more apps are to come", "verified": true, "helpfulness": "0/1", "author": "parm"}]