[{"rating": 5.0, "review": "Just got to say this piece solved most of my streaming problems! Got to get some more for my other sets!", "verified": true, "helpfulness": "0/0", "author": "K. Valen"}, {"rating": 2.0, "review": "I have an Apple TV but was hoping the Chromecase would allow me to mirror my Chrome browser to the TV.  Although this is advertised as a Beta feature, it is completely unusable.  The audio on the TV is fine but the video is out of sync and freezes frequently.  I have tried this with multiple computers on multiple wi-fi networks and it still causes problems.Although it will not be used at home, I plan on keeping this device.  It will be useful for Netflix while traveling and is more portable than the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Matt D Reier"}, {"rating": 4.0, "review": "I'd give it 5 stars but for the lack of apps to use this with.  Once the SDK has been in the right hands for a while hopefully we'll see more things like an HBOGO app, Amazon and Hulu apps, etc... (iTunes app? well......maybe)As it stands right now I really dig the Netflix, Chrome and YouTube functionality and I use this thing almost every day.  Worth it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Pretty much anything you can put in a Chrome browser you can show on you TV. You can upload Powerpoint slides and documents to Google Drive and present material wirelessly which is nice for business applications. I've tested it and it works well on PC, Mac, iPads, iPhones, and Android devices.A few improvements needed:1. My laptops get rather hot when broadcasting (tried on both a macbook and toshiba running windows 7, same results), yet my phone and ipad do not seem to be affected at all when broadcasting from them.2. Broadcasting from tablets and mobile devices is limited to Play Store, Netflix, and Youtube. Add some browser support for these as well. Add support for Amazon Prime Video, Pandora, and iHeart Radio at least.3. Sometimes the sound gets unsynced slightly and I have to stop and restart the broadcast to get it synced again.Over all it's a good product. A few improvements could make it a great product. Definitely worth $35.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"shnibitdohget\""}, {"rating": 1.0, "review": "Chromecast works great for watching Youtube.  However, if you want to watch a show you missed from a network online site, it will not cast a full screen view.  It will cast the tab and then when you click on full screen, the TV goes black.  You hear the voices and see it on the computer, but not on the TV.", "verified": true, "helpfulness": "0/0", "author": "User"}, {"rating": 4.0, "review": "I have LEDs that haven't connection to Intenet, but now with my Chromecast I can surf by Internet, use Youtube and Netflix. I'm very happy with this buy. The buy and delivery was very simply. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Carolina Lavin Lisboa"}, {"rating": 5.0, "review": "i recommend to everyone. Great product.The best soluction ever made by google. You can transform you TV in a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It has everything that is promised however, it would have been ideal if it could stream from chrome browser installed on iPad. I still have to rely on my laptop to stream anything from my browser.", "verified": true, "helpfulness": "0/0", "author": "Ankur Agarwal"}, {"rating": 5.0, "review": "Great product for the money and it can also mirror your computer screen (beta).The only think missing is streaming local (phone or computer) media like photos, music, and videos.", "verified": true, "helpfulness": "0/0", "author": "coolbhatt"}, {"rating": 5.0, "review": "Hard to beat this device for the price.  No issues, works great with all of our devices in our household.", "verified": true, "helpfulness": "0/0", "author": "Troy Chapman"}]