[{"rating": 5.0, "review": "I purchased the FireTV as part of breaking away from cable to save some money. I like it better than a friends Roku 3. It seems to have a better selection of movies and applications available. Not to mention more memory for the same price. The only down side is if you want to use the WatchESPN app, A&E;, History apps or other cable station based apps, you MUST have active cable service to watch shows/sporting events on the APP. Seems rather pointless for them to require a cable subscription to stream the shows/sporting events. I got around that by using a family members login for their cable account. Combine this with the Amazon Basics HDTV indoor antenna and I have every tv station I ever watch for the cost of netflix and Hulu Plus a month.", "verified": true, "helpfulness": "1/1", "author": "Allen Bader"}, {"rating": 5.0, "review": "awesome gaget", "verified": true, "helpfulness": "1/1", "author": "Jordan Nease"}, {"rating": 5.0, "review": "I brought this item to use on my spare TV that do not have cable. The setup was easy to setup and I am still getting use to the voice feature.  I love the different applications and I would not hestitate to purchase another one as a gift.", "verified": true, "helpfulness": "0/0", "author": "Clara Johnson"}, {"rating": 5.0, "review": "I have two Vizio Smart TV's that have pretty much everything that this box has built in. But I'm a gadget person. But my blu-ray player streams things as well. But the Fire TV got great reviews. But my TiVo streams Amazon as well. So I had to think about this for a while in that I wanted to try it out but I really didn't need it.Boy, am I glad I got it.The Fire TV adds a usable interface, great voice search, incredible speed, and ease of use to streaming. Setup is simple, video quality is as good as it gets, the remote control is easy to use, and I now far prefer streaming to blu-rays. I don't play games with it, so I can't speak to that aspect of the device.I can only think of one missing feature, and I'm not dinging the product for lacking it. Just pointing it out in the hope that someone from Amazon reads the reviews. Amazon, are you listening? Add a programmable volume control to the remote. I can turn my TV on and off just fine, but I occasionally want to change the volume when watcbhing TV. Since the Fire TV uses a bluetooth protocol for the remote, I can't program the Fire TV controls into a universal remote. So I am stuck with a seperate control for volume. The TiVo remotes are bluetooth but include programmable IR volume controls, so I know it can be easily done. Please, Amazon? I'll even buy an optional \"premium\" remote if thats what it takes!So, if you can live with a dual remote operation, it doesn't get any better than the Fire TV. Try it and become a believer -- I did, and will be getting a second one for the bedroom!", "verified": true, "helpfulness": "0/0", "author": "R. Grossman"}, {"rating": 5.0, "review": "If you are thinking about buying this, do it. This is the coolest thing since sliced bread.  There are so many options for the viewer. The only complaint I would have is that the voice recognition function be able to be used for ANY viewing options, not just Amazon Prime. The voice option works unbelievably well.  I had the unit hooked up in minutes and I'm 65+ years old with arthritis in my hands. A piece of cake!", "verified": true, "helpfulness": "0/0", "author": "4th Generation Orangeite \"K.R. Schlueter\""}, {"rating": 4.0, "review": "It's great that I can now make more use of my prime subscription and watch some free content. With my 100mbit connection, movies start up fast and in high quality on my 60\" plasma. I wish there were more apps and that it was more xbmc friendly.", "verified": true, "helpfulness": "0/0", "author": "NYC Photog"}, {"rating": 5.0, "review": "Previously we had only had one roku and several Apple tv's.  The apple tv's had so far been the best option, but we we're missing out on Prime. We decided to try a fire and a newer version of the Roku. The Fire was quite a surprise. The setup for all three devices is comparable. However speed, look and reliability on the Fire are truly impressing me. I've been using it over a month now and had no issues. I rarely use the Apple TV anymore and found nothing too special about the Roku in comparison.I'm also loving the Bluetooth remote and voice functions.  Although I'd really like to see an iPhone remote app please.", "verified": false, "helpfulness": "0/0", "author": "Jessica B. \"Jessica\""}, {"rating": 4.0, "review": "My favorite streaming device!  I like my Chromecast too, but the Fire burns brighter.", "verified": true, "helpfulness": "0/0", "author": "William O'Banner"}, {"rating": 2.0, "review": "The voice search works really well, but it's rendered useless by the fact that it only works with Amazon content. When searching for a show, I don't want the results to try to trick me into spending $2.99/episode for a show when it's also available through my Netflix subscription at a substantially lower price. The hardware is great, but it's wasted by the lack of games in the Amazon store and the antiquated version of Android that Fire TV's OS is based on. If you go through the trouble to side-load a game from the Google Play store that isn't available through Amazon, then it doesn't even show up in the main launcher -- you have to go through about 3-4 settings menus every time you want to launch it. I was really excited for the Fire TV to replace both my Roku 3 and Ouya but extremely disappointed with all of the greedy Amazon lock-in making the experience sub-par to continuing to use my existing devices.", "verified": true, "helpfulness": "1/2", "author": "Tim C."}, {"rating": 5.0, "review": "This is the best online streaming device out there!", "verified": true, "helpfulness": "0/0", "author": "Lawrence Bates"}]