[{"rating": 1.0, "review": "This item stopped working within days and I have been unable to get any online assistance with it .It was set up properly then out of the blue completely stopped functioning. It now says that I don't even have one hooked up to my system", "verified": true, "helpfulness": "0/2", "author": "Boubacar Sarr"}, {"rating": 4.0, "review": "Sometimes takes a while to load movie from electronic to tv and stops on the middle to reload.", "verified": false, "helpfulness": "0/0", "author": "Joe Randy"}, {"rating": 4.0, "review": "Did everything advertised and met my expectations", "verified": true, "helpfulness": "1/1", "author": "Jack Adrian"}, {"rating": 5.0, "review": "Works seamlessly as advertised, and with the on-boarding of more apps that support various streaming methods to Chromecast you truly are getting your value for money! Cheers Google!", "verified": true, "helpfulness": "1/1", "author": "Daniel K."}, {"rating": 5.0, "review": "Absolutely fabulous product.  Too late apple you can't beat this for price and performance", "verified": true, "helpfulness": "1/1", "author": "John Walles"}, {"rating": 1.0, "review": "AVOID! Terrible Cust Svc. For a reputable firm, it's been a huge disappointment. Product worked for a few months then started to crash my router every 10 seconds, with no other changes to setup. CS rep made me do a series of tests (15-20) and made me jump through hoops for over a month. Then, they tell me my router is on their list of compatible routers but even though it's obvious it's the Chromecast they refuse to replace their faulty product. I was patient for awhile but their latest rep was just terrible. Maybe it's ymmv.", "verified": false, "helpfulness": "0/2", "author": "Mr. Explorer \"Car Enthusiast\""}, {"rating": 5.0, "review": "Super easy to set-up, doesn't even require a wall plug.  You just plug the unit into the TV's HDMI port, and plug the USB into the TV's USB port, and you've got power to it.  Set it up with a laptop or tablet, and you're good to go.", "verified": true, "helpfulness": "1/1", "author": "Vince L."}, {"rating": 5.0, "review": "If you have a smartphone, hdmi tv, and if you stream any media at all, you just need this to complete your media-craved addiction. Seriously this item alone simply turns ANY HDMI ready tv into a web TV and more. Simply revolutionizing.", "verified": true, "helpfulness": "1/1", "author": "H. Ho"}, {"rating": 5.0, "review": "I love my chromecast! This lets me watch netflix, youtube, etc right on my TV without having to plug in a bunch of stuff. The picture looks excellent, the sound is excellent. I also have a Kindle Fire HD and I actually think it's even easier to use the chromecast with my kindle than my laptop. I can stream pandora music through my kindle right to my TV. There are some serious limitations to what you can cast to your TV, though - for instance, right now there is no way to stream pandora through a Chrome browser window on your laptop. And although you can cast an entire chrome browser tab to your TV, it is kind of sluggish and the sound isn't that great. But considering the chromecast is only $30, it is WELL worth it! Even if the only thing it did was cast netflix to your TV, it would be worth it! Love it.", "verified": true, "helpfulness": "1/1", "author": "Clairebear"}, {"rating": 5.0, "review": "Great buy", "verified": false, "helpfulness": "1/1", "author": "MeMaw Beaudoin"}]