[{"rating": 3.0, "review": "I like it. It's a sleek little black box you can barely notice. It sets up easy, my 12 year old son connected mine and had it ready to go in under 5 minutes. It has a cute little video (that you cannot bypass the first time) that teaches you all about the fire TV. The picture quality is great, it loads fast.. The voice search actually works.My only real problem with it so far is that I'm an Amazon prime member and there are 30,000 TV shows and movies I can watch for \"free\" for being a member, but there are not full lists of these free shows. There's only 150 free shows of each genre. I feel like Amazon is always trying to get more money out of my pocket and I almost feel conned by this. For instance, I can download HBOgo and watch all of their series and all of their movies, but on an Amazon device, I can't watch ALL of the Amazon prime shows. I imagine all 30,000 of the 'free shows are mixed in with the 100,000 that are NOT free. (Nice way to advertise the shows I'd have to purchase, I suppose)  It just frustrates me I guess. Would I buy this again? I guess so because of all the other options like HBO Go and Netflix, but don't buy it if you think it'll be worth it as a prime member, that's irrelevant to Amazon.  Would i recommend this? Haha yeah I suppose. But i still feel robbed a little.I forgot to add that the remote that comes with the TV doesn't work very accurately. When I press a button it kind of does its own thing. For example if I am trying to browse and I press \"down\" once, it goes down two or three times. Same with side to side. This is extremely frustrating. It gets worse day by day.", "verified": true, "helpfulness": "0/0", "author": "Melissa1982"}, {"rating": 5.0, "review": "Great product!! That's all I need to say..", "verified": true, "helpfulness": "0/1", "author": "Cesar Mir"}, {"rating": 5.0, "review": "Just what we needed for our new tv", "verified": true, "helpfulness": "0/1", "author": "Sandra K Sheridan \"she girl\""}, {"rating": 4.0, "review": "Some confusion what cost and burdonsome on web sign up.", "verified": true, "helpfulness": "0/1", "author": "Taylornurse"}, {"rating": 5.0, "review": "This was a gift from my son.  I love it.  And, even as a technologically challenged adult, I can work it just fine!!", "verified": true, "helpfulness": "0/1", "author": "Will"}, {"rating": 2.0, "review": "One of the Key reasons I purchased this was because of the USB port, and therefore the ability to plug in USB memory sticks …which as it turns out it is unable to do.", "verified": true, "helpfulness": "1/2", "author": "Walter Schmidt"}, {"rating": 1.0, "review": "This was stolen from my home before I could even set it up  - I guess I will have to order another one soon", "verified": true, "helpfulness": "1/15", "author": "Carole Ford"}, {"rating": 5.0, "review": "We bought this for our daughter for Christmas.  She loves it!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Music & Book Lover\""}, {"rating": 5.0, "review": "I am so glad I got this I would suggest everybody to get this and cancel the cable bill", "verified": true, "helpfulness": "1/2", "author": "joe doucakis"}, {"rating": 4.0, "review": "Like load up time", "verified": true, "helpfulness": "1/2", "author": "Florentino Martinez"}]