[{"rating": 4.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Olumuyiwa Ajakaiye"}, {"rating": 4.0, "review": "Easy setup and very intuitive user interface. The remote's buttons are laid out logically and are easy to the touch. Traversing the UI is almost instinctive and I love the fact that the response time is excellent.Glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "If you use Amazon Prime this the streamer to use.  I also subscribe to Hulu Plus+, HBO Go and Netflix and it works great.  Going to buy 2 more for other rooms in the house.", "verified": true, "helpfulness": "0/0", "author": "Gene Layton"}, {"rating": 5.0, "review": "Nothing can compare", "verified": true, "helpfulness": "0/0", "author": "GLORIA P. WALDRON"}, {"rating": 3.0, "review": "Uses too much of my wifi data allowance - it would be cheaper to rent a movie from RedBox", "verified": true, "helpfulness": "0/2", "author": "John Thompson"}, {"rating": 5.0, "review": "I have nothing to compare this device to but it does everything I care about, connects to every service I want, installed quickly and without a glitch, provides oceans of sources, many of them free through my Amazon Prime membership.  I am not interested in games so that's a non-issue.  My download speed was set at 7mb/second but was only actually doing 5, but we still experienced no glitches, just a nice smooth movie or TV show with no pauses, picture degradation, artifacts or any other problem.  Just to be safe I upgraded to 12mb/sec, still perfect.", "verified": true, "helpfulness": "0/0", "author": "Jim R."}, {"rating": 5.0, "review": "Say goodbye to high price cable.  Set up is so easy my 8 year old could of done it, also you can mirror from a cellphone or a laptop which makes it possible to watch those favorite tv shows from your laptop that you are paying high price cable to watch.  Also you can show off your family photos on the big screen if you have company over.  My 8 year old loves the games that are on the Fire TV and has enjoyed still being able to watch her favorite shows with mom saving on the cost.", "verified": true, "helpfulness": "0/0", "author": "deana heaton"}, {"rating": 5.0, "review": "You can't beat fire tv on price,  performance, and the options you get from watching TV,  movies,  playing video games,  and using apps.", "verified": true, "helpfulness": "0/0", "author": "a p"}, {"rating": 5.0, "review": "Love it. House of Cards baby!", "verified": true, "helpfulness": "0/0", "author": "Office Manager"}, {"rating": 5.0, "review": "So far love the functionality of the box. Very straightforward and easy to navigate. We subscribe to Netflix, Hulu Plus and Amazon Prime. The kids love Netflix and we like Hulu. We are up in the air yet about Amazon Prime, not sure if we will be keeping it past the 30 day trial. Before we got FIre TV we were streaming Netflix through our Blu-Ray player and it was horrible to navigate. Now that we have Fire TV it is waaaaaay better, much faster and easier to find specific shows/movies. Would highly recommend this box.", "verified": true, "helpfulness": "0/0", "author": "Staci"}]