[{"rating": 4.0, "review": "Not bad.  Love the easy portability of it.  I also have the fire tv stick.  If I didn't have a lot of purchased media on google play and was trying to decide between the 2, I would go with the fire tv stick.  Didn't realize how much I would like the remote.  So much better than using my phone.  Except when using youtube, that's easier when using your phone/tablet.", "verified": true, "helpfulness": "0/0", "author": "B.N."}, {"rating": 5.0, "review": "Love it i have one on every tv in my house... Way better then Apple TV and is cheeper too", "verified": true, "helpfulness": "0/0", "author": "Eric C"}, {"rating": 3.0, "review": "As usual, another half-baked, beta version of a google product. Drops connection often. Sometimes the streaming button appears on videos on my phone, other times not. At which point I try to stream my entire phone screen. Sometimes this works, sometimes blank screen. When it works--which is honestly not very often--it works great. Overall pathetic consistency. Great idea though; can't wait for it to make it past beta!", "verified": true, "helpfulness": "0/0", "author": "John V. Swain"}, {"rating": 5.0, "review": "It's amazing kit", "verified": true, "helpfulness": "0/0", "author": "saad"}, {"rating": 5.0, "review": "The Chromecast is great. We have one for every TV in the house. I have tried Samsung smart tv, Apple TV, Roku, xboxs, and playstations and the Chromecast's simplicity makes it my favorite. The lack of menus and a remote is nice.The biggest down side is the lack of Amazon prime support.", "verified": false, "helpfulness": "1/1", "author": "John I Carrington"}, {"rating": 1.0, "review": "A nightmare to setup and use", "verified": true, "helpfulness": "0/0", "author": "DJ in Texas"}, {"rating": 5.0, "review": "Easiest, most user-friendly streaming device around.  Thanks Google.", "verified": true, "helpfulness": "0/0", "author": "Jon Hughes"}, {"rating": 4.0, "review": "It does exactly what it's supposed to do, and it's a very affordable.", "verified": true, "helpfulness": "0/0", "author": "kaceann \"Kace\""}, {"rating": 5.0, "review": "I thought, by now, everyone knew how great this device was. Boy, was I wrong...So, I am hosting a party and have some YouTube music on my TV as a background, and then I have about ten different people asking me how do I do that from my phone ( I was just clicking on playlists, no magic, really). So, if you were asleep or very busy for last couple of years, Chromecast is one of the best inventions of the modern era. You just plug it to your TV and manage Youtube, Netflix, Hulu and other streaming platforms from your phone, tablet, or computer. The only exception that I know of (and quite unfortunate one) is Amazon Prime, so I have to use my Playstation for this one. You can also surf Internet on your device and it will be displayed on your TV, if you wish so. You need to have an HDMI output on your TV, and for better effectiveness a USB port. If you don't have USB port (i.e. your TV traveled through time zone with you), you can use a socket. Simple as that. Enjoy Chromecast!", "verified": true, "helpfulness": "1/1", "author": "Elman"}, {"rating": 5.0, "review": "Loves it", "verified": true, "helpfulness": "0/0", "author": "Kim Cosby"}]