[{"rating": 4.0, "review": "Once you master it you have all the movies old and new, as well as all the tv shows old and new.the only thing missing is live sports.hopefully coming in the future.", "verified": true, "helpfulness": "0/0", "author": "john d simon"}, {"rating": 5.0, "review": "great product!!!!t a little challenging to set up then directions said", "verified": true, "helpfulness": "0/0", "author": "Dana Murphy"}, {"rating": 2.0, "review": "Crashes too often .. Doesn't allow screen cast from all android phones and not at all from computers.. Expected better from a google product", "verified": true, "helpfulness": "0/0", "author": "vikash kumar"}, {"rating": 5.0, "review": "I love the Chromecast. Friends that purchased similar products have decided to get the Cheomecast because of the versatility.", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 4.0, "review": "It's a good product", "verified": true, "helpfulness": "0/0", "author": "Thiago Morasi"}, {"rating": 3.0, "review": "it worked 2xs for me, now all messed up.  wish that i had gotten an other streaming device.", "verified": true, "helpfulness": "0/0", "author": "maretta stephens"}, {"rating": 2.0, "review": "Works extremely flaky with Synology DS Video.  Keeps losing the connection.Also it feels clunky to have to use your phone to control it, since the phone locks and goes to sleep to conserve battery and then it loses the connection.  So then when you want to pause the video, you have to unlock the phone, pull DS Video back up, reconnect to the player, and THEN you can pause, about 20 seconds after you really wanted to pause it.", "verified": true, "helpfulness": "0/0", "author": "Kevin C. Pauli"}, {"rating": 5.0, "review": "works very well", "verified": true, "helpfulness": "0/0", "author": "mark twain \"qtk\""}, {"rating": 5.0, "review": "I don't have a \"smart TV\" so this basically replaces all of those features for much less money.  Get a Plex Media Server on your PC and the app for your phone and you are good to go.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Awesome item.", "verified": true, "helpfulness": "0/0", "author": "JANET M TOCZYLOWSKI"}]