[{"rating": 5.0, "review": "For the price, this is an amazing product.  I use this for my bedroom TV to stream Netflix and my Google Play Music. The set up was beyond easy.  I will often hear people question the need for this device when a 360, PS3 or Apple TV all do the same things and have more features.  My answer is this: Price.  My main TV has a 360 but I'm not going to buy an additional console to simply get stream some movies from bed.  I love that I can use my phone or tablet to send content to it and not deplete my device's battery.The biggest con I have for this device is the lack of compatible apps. It's still a newer device and new content will be added.", "verified": true, "helpfulness": "0/0", "author": "Dan C"}, {"rating": 3.0, "review": "It does work as expected. Can it be better? Yes. There is lag when streaming from a browser and sometimes the audio is a little off. Connection speed is key here, and also how busy your home network may be. Some case others may be downloading or streaming as well and this will affect the quality.", "verified": true, "helpfulness": "0/0", "author": "SoRec"}, {"rating": 5.0, "review": "What else can I say that this is a great product and the price is fantastic.  Follow the instructions for the install and it will work the first time.", "verified": true, "helpfulness": "0/0", "author": "Robert E. LaGrange"}, {"rating": 3.0, "review": "So far I haven't been able to fully activate the device.The problem is my Windows operating system,which is the XPS era. I will have to find a way tointegrate the Chromecast HDMI set-up with theXPS arrangement, which I hope will be possible.", "verified": true, "helpfulness": "0/0", "author": "Leon Lewis"}, {"rating": 5.0, "review": "This is fast and easy way to watch whatever I want from netflix or stream my music from Pandora.  I highly recommend it...i even turned my cable off because I didnt need it anymore!", "verified": true, "helpfulness": "0/0", "author": "catherine riggs"}, {"rating": 2.0, "review": "It is very slow and does not quite work with TV and looses pictures unless you have a very very high speed internet.  Also limited on going to different sites.", "verified": true, "helpfulness": "0/0", "author": "Behrooz Mohebbi"}, {"rating": 5.0, "review": "I plugged the Chromecast in to my TV, got it set up without problems, it worked.  What more need I say?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a lovely kit! I just hope Google adds full desktop mirroring to support all Windows application.Where's my Netflix trail subscription by the way?!", "verified": true, "helpfulness": "0/0", "author": "Yousif Anwar"}, {"rating": 2.0, "review": "Can't do anything with it when you are in the Philippines. Bought this so I can show the chrome browser on the TV from my Android phone but even that wont work. Can't stream existing media. Can only be used as a youtube viewer. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "ministryoftech"}, {"rating": 5.0, "review": "Wow. Amazing. Easy to use. Its like my iphone is a remote which is sweet.  Good quality. Good Sound. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Tori Malek"}]