[{"rating": 5.0, "review": "Worked great", "verified": true, "helpfulness": "0/1", "author": "Frankstylez"}, {"rating": 5.0, "review": "I didn't know that I could be so happy with it.  The description didn't say that the cord was included, so I bought one.  Extra expense that I wasn't prepared to spend, but I'll keep it.", "verified": true, "helpfulness": "0/0", "author": "Caprice"}, {"rating": 4.0, "review": "The stream quality is about as good as a Wii for Netflix and YouTube. I'm comparing this to a PS3 running the same apps on the same wifi.", "verified": true, "helpfulness": "0/1", "author": "Doug \"computer nerd\""}, {"rating": 3.0, "review": "Requires wifi. why would a company that is so heavily capable in the mobile department require you to go to an outside service provider to use their hardware?", "verified": true, "helpfulness": "0/1", "author": "Jeremey Penn"}, {"rating": 5.0, "review": "Replaced a very old Roku media player with this. Nice to not have to keep track of my remote anymore and can just grab my phone. Syncs well with more apps than I realized. I love this thing!", "verified": true, "helpfulness": "0/0", "author": "S. Kerry"}, {"rating": 5.0, "review": "5 stars for this Chromecast for my limited purposes. I have a Roku 2 that I have been using for well over a year for my streaming subscriptions and some channels like PBS and Smithsonian, for which it works well enough most of the time. I use the Chromecast for streaming home videos from my PC, casting the PC screen, slideshows and the like. It works very well for this (and unlike PLEX at $5/mo, it is free, though rather more limited and it only does local network casting). I have not tried it for my subscription services so cannot comment on this, though at some point I may see if it relieves some buffering we occasionally experience (even with 6Mb/S broadband). (I do not believe it does direct Amazon Prime, one of my services).", "verified": true, "helpfulness": "0/0", "author": "R. Adams"}, {"rating": 2.0, "review": "It seems a bit glitchy. The only thing we can really get to come in well is youtube. Trying to watch something like netflix just doesn't work well at all. Wish I had tried the amazon version first.", "verified": true, "helpfulness": "0/0", "author": "A. M. Hoogestraat"}, {"rating": 5.0, "review": "Excellent product!! $22 + tax is what I paid 3 weeks ago. I'm ordering 2 more when it goes on sale again!!", "verified": true, "helpfulness": "0/0", "author": "Cheech Rhein"}, {"rating": 5.0, "review": "I love the device, easy to set up, and works smoothly.  Only thing is, good luck on getting the $20 Google Play offer.  It does not exist.  The instructions tell you to got to chromecast.com/offers and there you will find 5 other freebies but not the $20 credit.Update: 12-22-14,  Contacted Amazon by email in regard to the advertised credit and they took care of the issue in-house.  Amazon customer service is amazing!Update: 03-02-15  This is truly a great little device. Stays hidden and out of site requiring nothing from you but to enjoy its benefits. The best part is that you can use a tablet or smartphone for your Netflix, Youtube, Nick, etc. to watch without hassles.", "verified": true, "helpfulness": "1/1", "author": "PapaJ \"Jesus is Lord\""}, {"rating": 5.0, "review": "Makes your dumb TV smart, assuming you have HDMI and  USB port cupcake!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]