[{"rating": 4.0, "review": "I just received my Fire TV today, and it's great!!  It's very easy to set up and use, and the user interface response time is snappy.  The voice search works as advertised, and I'm very impressed with how it works so far.  In addition to all the streaming media from Amazon (with my Prime Account), I can also access my photos, which is very nice.My wish list item for Fire TV is that Amazon will add access to Kindle Books.  If I could do that, I would happily give Fire TV a 5-star rating.", "verified": true, "helpfulness": "1/1", "author": "Fish Kungfu"}, {"rating": 5.0, "review": "I love the voice control it makes it very easy to navigate when looking for shows to watch. Highly recommend it .", "verified": true, "helpfulness": "1/2", "author": "oopcie"}, {"rating": 2.0, "review": "I was really excited to receive my Fire TV today.  I have 2 Roku units and needed a third, but you can't hook up surround sound to Roku.  So, my choices were between Fire TV or Apple TV.  The Fire TV box is sleek and unobtrusive.  The control is rubberized and has a good feel and layout.  My biggest complaint, and it's a legitimate one, is that Fire TV is very heavy on selling you entertainment through Amazon Prime.  If you don't subscribe to Prime (and I won't be in 4 months because of the ridiculous increase in Prime membership) you'll have extraneous items that you have to sift through.  On the homepage there is a left column with different categories; home, movies, TV, games, etc.  Click on movies, and they're all tied to Amazon; recently added to Prime, Shop New Releases, Recommended movies.  All Prime, no Netflix or Hulu is listed.  I'm already annoyed and this is the first hour that I have owned the Fire TV!  Let's say you want to watch Harry Potter on Netflix. You use the voice command and say \"Harry Potter.\"  All of the Harry Potter movies come up, but they are ALL on Amazon Prime.  Nothing from Netflix.  Colbert Report?  Again, the voice command steers you to Amazon, where the Colbert Report is unavailable.  Not a mention of the Colbert Report on Hulu, where I was able to choose between 11 different shows.  To make matters worse, the Amazon apps CANNOT be deleted from your Fire TV.  It's like having an Amazon advertisement pushed in your face every time you turn the TV on.  So, unless you are a diehard Amazon customer and can't live without Prime, Fire TV does exactly what Roku does (except digital sound through an optical cable) for half the price.  The voice command is simply not a good enough selling point because it ignores all apps except Amazon.  It does not justify the $99.00 price.  Also, HBO GO is unavailable on Fire TV (the app is unavailable for downloading.).  It's really unfortunate because the interface is superb and the processor loads shows much faster than Roku.  Amazon, you put too many controls on this product and you can't fully appreciate the bogus voice command.", "verified": true, "helpfulness": "3/7", "author": "Rocco Z"}, {"rating": 3.0, "review": "Best media player in the market with the worse color reproduction.I'm not sure how Amazon could release hardware with such a huge flaw, but its out and I struggle each day to keep. This is the best media player out there right, its fast and never lags and its got loads of channels, but the picture quality is just horrible and if you like proof just look closely at any dark area on the screen which has a very slight gradient. You will see the color \"banding\" rolling across the screen. I can see that amazon tried to hide this by reducing the brightness of the shadows, but with a correctly calibrated TV its easy to see.So like i said, I struggle to keep it. The PS3 has the most beautiful picture reproduction of any media player, but the Fire Tv has the best navigation. Don't get me wrong, tis a wonderful device for 99% of the people out there, but for that 1% video nerds like myself its dissapointing.BUY: if you want a very nice media playerDON'T BUY: if you want the best picture possible.", "verified": true, "helpfulness": "3/4", "author": "Steve A. Colen II \"Mr. S.\""}, {"rating": 4.0, "review": "Will I get rid of my apple tv, no.  But it's a nice addition, especially for Prime members.  The game controller is next and that may really make it worth while.", "verified": true, "helpfulness": "2/2", "author": "stevewake"}, {"rating": 5.0, "review": "I have the AmazonTV box hooked up to the same TV as my AppleTV box. Adding the Amazon box was like the sun coming up in the morning. I have always struggled with the apple box. You know the iPad and the AppleTV box always need some tweeking to get up to speed. The apple box \"thinks\" too much (reloads). The Amazon TV just simply worked.I plugged the amazonTV in (I have amazon prime, a great value, BTW) it did have to update it's software, but then the box knew who I was and my account info without being told! I always thought that apple could do this, and also make theft go away if they merely coded the their devices to the people who bought them. Apple does not do this. Amazon seems to have coded the box to my account. This is a super plus!The navigation on the amazonTV is about 10 times easier than the appleTV. I expect that amazon had a few apple tv units to play with and tried to rid their new box of all the usual appleTV frustrations. It worked. The aps I chose downloaded quickly and seemed to work. I was afraid that amazon would charge me for items that i did not know costs money. I checked my bill and I seemed to have some special offers along with my prime account, so nothing has cost money yet.I did not buy the game controller. I think I will now. This thing could become my only tv box.One caveat. I use directly wired internet. In general, I find that speed and image quality is better on a wire. Therefore I have not tested the wifi.If I could back a year and just wait and not buy the AppleTV, I would. I wish I could use my iPad on the amazon box - I hear that is on the way. Otherwise, I must just buy a kindle fire, and switch into amazon completely. I can use the iPad for email and a little word processing.Enjoy", "verified": true, "helpfulness": "5/5", "author": "JJ \"Travel Reader, Cyclist and Tech Curious\""}, {"rating": 5.0, "review": "I love all the features the videos the games the apps. I am really hoping in the future the USB will allow access for video file playback and/or more external storage. I am so excited", "verified": true, "helpfulness": "3/3", "author": "Joshua Shaw"}, {"rating": 4.0, "review": "can only use voice feature for amazon-not other media services...would be better if voice was available for all media services", "verified": true, "helpfulness": "0/1", "author": "B. Stockman \"BC\""}, {"rating": 5.0, "review": "There are already tons of reviews out there, so I'll just chime in with a few quick observations:1.  The video quality (as reported elsewhere) really is better than on the Roku.2.  If you store your photos on Amazon's Cloud, then you can very easily show pictures and videos on this device.  With Amazon's cloud drive also installed on my phone, I take a picture or video, it is automatically uploaded to the cloud, and then with no additional effort it is available for viewing on FireTV.  My kids love this!Finally, on my wish list for Amazon:1.  Support a wireless bluetooth keyboard.  Clearly the hardware already supports Bluetooth so this can't be a huge endeavor.2.  Put the Silk Browser on the device.The combination of 1 & 2 would be killer!!!", "verified": true, "helpfulness": "2/2", "author": "Jon J \"seattlejrj\""}, {"rating": 4.0, "review": "I loved everything about the Fire TV except that the Amazon Cloud player wasn't on there.  It took a while for the update to load, but even that wasn't a problem. Even my Roku 3 can access my Cloud Player. I wish you would add this to Fire TV.", "verified": true, "helpfulness": "1/2", "author": "Sheila"}]