[{"rating": 2.0, "review": "I understand Amazon wants to get these into houses so they can extend their services and brand, but limiting the screen mirroring to Amazon Tablets, limiting it to Amazon's own app store, and not launching with key software like HBOGo is not great for the customer.The hardware on this device is pretty great, but when you compare it to the OUYA which is shipping for the same price or less on similar hardware, it tells me that the Fire TV could've easily launched at the -SAME- price it is right now but included the controller.Give customers the Google Play store, give them a controller, support non-device specific Miracast, and get HBOGo approved for the device, and you have a Roku/AppleTV killer. Until then, this is just a device full of compromises, in a market full of devices that have compromises.", "verified": true, "helpfulness": "2/3", "author": "Travis Holmes"}, {"rating": 5.0, "review": "with my purchase. I've been eyeballing Roku for a while now, trying to decide which one to get. When I heard about the Fire TV. I still hesitated purchasing, until I saw my Grandmothers', After playing wit it for a minute, I was sold. When HBO comes, it'll be the icing on the cake.", "verified": true, "helpfulness": "0/0", "author": "Virgoddess \"Jen\""}, {"rating": 5.0, "review": "I have a SMART TV, but it wasn't smart enough as I couldn't watch my Amazon Instant Video library on it - now it is.  The voice function works seamlessly.  Great product, easy to set up and doesn't interfere with the cable box or sound system controls.", "verified": true, "helpfulness": "0/0", "author": "Joyce Walker"}, {"rating": 5.0, "review": "we was going to a PS3 or 4we looked at roku, Google, and my son has Applefor the money there is speed, HD, access to alot of Media.out performs Apple, equal to PS3 (my son has both so can compare) by equal i am only comparing performance. Apple not as fast, not voice command, apple has apple content so,so... i prefer Prime and Netflex combowe dropped Redbox stream and this pays for Prime (more for the same money)Content and Performance is KEY", "verified": true, "helpfulness": "0/0", "author": "don collins"}, {"rating": 3.0, "review": "I've had almost every generation of Roku that is out there, currently owning a Roku 3 and a Roku 2 XS in addition to my Fire TV.  The main complain I've had about my Roku's is the slow user interface, which the Roku 3 has gone a long way to solve.  Being a big Kindle and Kindle Fire fan I was pretty hyped about getting the Fire TV and got one day one.  It's been a few weeks now and I've gone back and forth from the Fire  TV to the Roku, mainly watching streaming TV, and I have to say I'm more prone to use my Roku than the Fire TV.  While the Fire TV is fast, very fast, it still has some growing to do.  Was hoping to see some rapid software upgrades, but if they've come, I haven't noticed them.  Most things work pretty well, but the interface is just a bit klunkier and I get random long (as in minute+) pauses at random when it transits from doing things like initially streaming something, or going to a commercial on Hulu+.The Fire TV definitely works much better on Amazon stuff, like Amazon Prime.  But with other services, esp. Hulu, it doesn't seem as nice.  Whereas Hulu has a rich interface that will tell me exactly where I can watch something and for how much, even if I don't subscribe, finding things on the FireTV is definitely geared only towards Amazon Prime.  For instance, want to find where you can watch an old TV show or movie?  On the Roku main menu you go to \"Search\" and put in what you want.  While your \"typing\" it in, its showing off to the right all the matches so far.  Once you see what you want over there just use the controller to select it and off to the right it will tell you where to find it, such as Amazon Prime, Hulu, Netflix, Vudu or whatever.  Roku also lists the price there, so you can choose the best alternative for you.I'd also have to use the \"Dad\" test on it.  My Dad took right to the Roku UI, and while the Fire TV is somewhat close, I still think he would get a bit lost in it.This device is nice, its definitely FAST, but it definitely needs a few revisions of software being done.  I also think it really needs to be vendor agnostic and promote EVERY channel like Roku does, not just Amazon branded ones.  Roku definitely has some competition on their hands with this though.Now to gaming.  I've not been impressed with the few games I've tried on the Roku, and I'd have to say the same with what I've tried so far on the FireTV too, but I haven't tried many.  One in particular, \"Minion Rush\" is pretty downright horrid, it really needs a tilt screen and the accommodations they made to make it run on the FireTV are inexcusable in terms of how it plays.  I'm all for more of my devices playing more of my games, but only when they do it well and this one was bad...  Have yet to hook up the controller and play other games more suited to it.  Will try and update review then.", "verified": true, "helpfulness": "0/0", "author": "C. Norborg"}, {"rating": 5.0, "review": "I only use it to watch movies mostly for Netflix and Amazon Prime. I had been using an older dvd player that made the process sluggish and often impossible. The Amazon fire is very quick to load the movie menus and once I choose a movie it is nearly instantaneous. I have not experienced any of the stopping in the middle of a movie as I often did with my dvr. I have never used any of the other current streaming boxes or games so I really can't compare to them. For my purpose it would be really hard to improve on the Fire TV.It was easy to set up and being a prime member it was nearly ready to go once I plugged it in. The box is small and sits under my flat screen mostly unnoticeable. Thats how I like it. I don't need a pretty one, just one that does what it is supposed to do and stays out of the way.", "verified": true, "helpfulness": "0/0", "author": "Sherry"}, {"rating": 1.0, "review": "After purchasing this product we were excited to see what it had to offer. The box was tiny and the remote is simple and easy to use.Unfortunately the programming all costs. Only very old and outdated programming is free. Most shows are about $3 per show!! That's ridiculous and it would cost a fortune to watch one season of just the most basic cable shows on TV.Very disappointed in the cost and variety!!!", "verified": true, "helpfulness": "5/16", "author": "Joan Hector"}, {"rating": 4.0, "review": "The product is easy to operate with a plug and play setup.  It arrived with my Amazon account preloaded.  I suggest using your laptop and going to the Amazon prime website for adding TV/movies to your watch list to save time.  The search feature could use some updating because it  was not finding everything I typed in that I know Amazon offers.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "I love all of the choices Amazon Fire TV has to offer.  The price is reasonable.  I've enjoyed everything so far.I would recommend this to anyone who loves tv, movies, games, etc.", "verified": true, "helpfulness": "0/0", "author": "S. M. Thames"}, {"rating": 1.0, "review": "I never recd. this. It may have been because you sent it to my old address. I also did not rec. the high speed hdmi cable", "verified": true, "helpfulness": "1/20", "author": "bruce batchelder"}]