[{"rating": 5.0, "review": "Very nice, and inexpensive.  Easy to install, I have Chromecast on both of my televisions and use them all the time.", "verified": true, "helpfulness": "0/0", "author": "R. Chojnacki"}, {"rating": 5.0, "review": "Easy to install and set up. Item works like a charm, very easy to stream content to a non internet ready TV with an HDMI connection.  Streaming over wireless is very good quality as well.", "verified": true, "helpfulness": "0/0", "author": "Donald Gallagher"}, {"rating": 4.0, "review": "Does the job, easy to install and use, great media solution ! Lacks a few basic functions compare to others media players, but considering the price dif, i like it!", "verified": true, "helpfulness": "0/0", "author": "OmarC"}, {"rating": 2.0, "review": "Only four free apps are available in playstore/apple store! I only bought because my TV can't show netflix, but I really expect they create more apps to show all my media stuff in big screan, that's why I thought they can improve this media player", "verified": true, "helpfulness": "0/0", "author": "Ricardo Barreiros Mariano de Sá"}, {"rating": 4.0, "review": "This is a cool product. The technology isn't new by any means, but for 35 bucks -- why not own this? Recently, Chromecast just added a few more apps, so that's a good thing. I am REALLY hoping that Google and Amazon give each other a hug, and offer Amazon Prime Instant Video. Now, THAT would be fantastic!", "verified": true, "helpfulness": "0/0", "author": "Michael Morgan"}, {"rating": 5.0, "review": "It works perfectlycommunicating with the great desktop computerthrough a routervery good itemshighly recommend it to everyonewho loves to watch movies on TVmeets as expected", "verified": true, "helpfulness": "0/0", "author": "András  György"}, {"rating": 3.0, "review": "works and is cool idea. needs more apps. i thought you could send anything from your phone to tv. but can only use apps. am I missing something?", "verified": true, "helpfulness": "0/0", "author": "Lawrence Milhoan \"tomack\""}, {"rating": 5.0, "review": "This device is absolutely amazing and for $35 how could you NOT get one? HBO Go was recently added to the list of apps that work with the device and I can't wait to see which other ones come on board. Just get it, you won't regret it!!", "verified": true, "helpfulness": "0/0", "author": "B. Reilly"}, {"rating": 1.0, "review": "Wouldn't work with my router. I have an Actiontec router.  It's not compatable with it.  There are other routers that it's not compatable with.  They should inform you of this flaw", "verified": true, "helpfulness": "1/3", "author": "Frances Martin \"Just a shopper\""}, {"rating": 4.0, "review": "For the price you cant go wrong. I would give it 5 stars but it lacks compatible video watching apps. Only limited to hulu, netflix and youtube.", "verified": true, "helpfulness": "0/0", "author": "Luis Tobar"}]