[{"rating": 5.0, "review": "Great device small compact, and fits into your TV but there are some notes:The Chromecast needs power and it comes with a USB power adapter that you can either plug into an outlet or an empty USB slot on your TV.In the Google conference where they debuted the Chromecast, it was advertised that it would turn your TV on from an off state, and play your content. I am assuming that this is ONLY the case with the NEWEST T.V.'s as this functionality doesn't work on my year old Samsungs.Overall great device, great quality, no network problems.Caution, after prolonged use, it does get pretty hot, so just be aware of that.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 2.0, "review": "I was unable to get this item to work with my system.  Surprised it would not respond to my kindle fire.  Will try again when I have enough time to work with it.  Would not recommend it to anyone.  Connected it through my AV receiver.  Finally got it to interact with a neighbors laptop.  I had thought either my kindle fire or my iphone would manage it.", "verified": true, "helpfulness": "1/1", "author": "thurmmary"}, {"rating": 5.0, "review": "Awesome product really meets my expectations. I just wished it would work with more apps but overall great product. :)", "verified": true, "helpfulness": "0/0", "author": "Luis G."}, {"rating": 5.0, "review": "Simple to use, Better than running an HDMI cable from your tv to your computer. I have been looking for a reason to cancel my cable. For the savings of 140 a month. The best thing is I can use my smartphone to watch tv by other means like you tube. I stream the nightly news so I still can watch local events. The only downfall is that chromecast only works with you tube,netflix and google play tv from your smartphone. You can cast anything from the computer,. Hopefully chromecast will allow other apps to use it. Well worth the money! Ordered a second one but have to wait till october to ship.....", "verified": true, "helpfulness": "0/0", "author": "paul kudelsky"}, {"rating": 5.0, "review": "Limited in capabilities, however it is so easy for what it does, it is well worth it.  I would purchase another in a heartbeat.", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 3.0, "review": "Hi, I thought the idea is great. It work well with Netflix and Youtube.Tried it on ABC, CBS shows and those are fragmented. Hope Google will update that.", "verified": true, "helpfulness": "0/0", "author": "Booklover"}, {"rating": 4.0, "review": "I would've liked an easier way to pause the streaming. My comp. located in different room, and in order to pause.", "verified": true, "helpfulness": "0/0", "author": "Espresso Lover"}, {"rating": 4.0, "review": "I am very happy with this device. This has become the only player that I use for watching Netflix and videos from my laptop. I gave it four stars due to the lack of app support. It's really easy to setup and launch videos. I didn't have any issues with lag other than the delays I get when I launch from Chrome. I'm considering getting a second player but I'll wait until more apps are supported. All in all, this is a really good player, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Anea"}, {"rating": 5.0, "review": "First of all, let's get this out of the way. No, this isn't a Roku or Apple TV. It's not even a Google TV. But that's fine. This tiny device does what it is designed for, and it does it well.Setup was a breeze. Just plug it into the TV, grab the Chromecast app on your Android device, and you're essentially done. The two devices will find each other, then you'll be asked for a few basics to finish the setup process (wireless network settings, naming your Chromecast, etc.). That's it. No complicated menus. No sliders, buttons, widgets, or whatnots to mess with.Once it's ready to go, operation from an Android device is simple and nearly seamless (assuming you have a recent enough device - the Droid Bionic, for example, doesn't use the version of Netflix with the chromecast button). Being able to search Netflix and YouTube straight from a phone or tablet and then throw it up on the TV is awesome. Sure, you can do those things on a PS3, Xbox, etc., but that involves a clunky on-screen keyboard or an extra peripheral to worry about charging. Google Play integration is a nice bonus as well. You don't even have to login to any service since you're already connected on your phone.Best of all, Chromecast streams directly from the internet, freeing up your phone for other things. Once you've told it what to play, Chromecast happily goes on about its business whether your phone stays connected or not. There are ways to make Chromecast play local media, and that's the one place that it can choke depending on your wireless network. But, as I said before, it's not designed to be an Apple TV.It's still early, so there aren't a lot of apps that offer Chromecast integration yet, but it's coming. And at $35 (or $11, essentially, if you were lucky enough to snag one of the Netflix promotions), it's not a deal-breaker to have limited support out of the gate. Hulu, Pandora, and HBO (to name a few) should all be coming shortly, which certainly makes the price look even better.I would absolutely buy a Chromecast again if I had a need for another, even at the full $35. And I would definitely recommend it to anyone with an Android device (I can't speak for the Apple side of things) who is interested in streaming any sort of media to their TV.", "verified": true, "helpfulness": "0/0", "author": "Mark N Redd"}, {"rating": 5.0, "review": "This thing is great. A little slow on the initial load with each use but then it's better than I expected. Getting rid of the cables I used before is great and it's also an upgrade from 720p to 1080p.", "verified": true, "helpfulness": "0/0", "author": "Mitch Davies"}]