[{"rating": 4.0, "review": "I wanted to be able to stream through Netflix and this does just that.  I have had a few instances where the device just was not synching with everything and it required unplugging the Chromecast from my TV and resetting my router.  When it is up and running, it is terrific.  I'd say I've had issues with seeing the Chromecast device on Netflix on my phone about 20% of its use.  Most of this was to watch the entire series of Breaking Bad.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 3.0, "review": "I was surprised by how little the Chromecast does. Suddenly, I understand why it's so much less expensive than a Roku box. It can currently only stream from Netflix, Youtube, and Chrome. To be honest the Chrome stream doesn't seem to work well; I've only tried using it a few times, but every time I do, the image on my TV locks up, and stops following my laptop. The Netflix operation works fairly well, but there can be some issues transitioning between episodes, or getting back to controls, if you have to exit the app, and then return to it on your portable device. Youtube works fairly well, though now my phone (Samsung Galaxy Note 2) tries to send to the Chromecast, when I turn my phone for full screen mode, even when I'm not trying to send to the Chromecast. Google is promising that Chromecast will support a bunch media apps in the future, but I wonder how long it's going to take.", "verified": true, "helpfulness": "0/0", "author": "Archon \"Be Objective\""}, {"rating": 4.0, "review": "Great product for using Netflix on my tv. I wish it was adaptable to more applications such as web browsing, amazon prime on demand, MLB TV, etc; but it doesn't have that feature yet. The app is very easy to use though for Netflix which is the main use I have for it and it goes for a much cheaper price than Apple TV or other alternatives. I just wish it had more capabilities.", "verified": true, "helpfulness": "0/0", "author": "N. Heath \"Mr. Orange and Blue\""}, {"rating": 5.0, "review": "This works seamlessly with my android tablet, smart phone and laptop to stream Netflix to my TV.Any of these devices works as a remote to choose the video, start, pause and stop. There are no controls on the Chromecast itself, so your phone, tablet or laptop is needed. All you need to do is plug the Chromecast into an hdmi outlet in your tv and the included usb from the Chromecast into the usb outlet on your tv to power it. Then, you download the app, enter the password for your wifi/modem and you're good to go. The Chromecast gets the signal directly from your wifi/modem, so if your tablet or phone is slow, that doesn't affect the tv signal.With Netflix, from the laptop, you can sign in as any one of five users with programming/homescreen unique to that user. On android, Netflix only allows you to watch videos as the primary user. For example, my daughter is the primary user on our Netflix account. Her 4 year old daughter watches a lot of children's content on her Mom's android. When I use my android phone or tablet to watch Netflix, I need to search or sort through all the children's shows displayed on the main screen that are there because Netflix has determined that the user likes those best. If I go in as \"myself\" on the laptop, the shows displayed there are shows that I'd most likely be interested in, based on my previously watched shows.When used with your laptop, you can show anything on your tv screen that you can pull up through Google Chrome browser (anything on the internet). I haven't played with that so much. I use it for streaming Netflix. I've also seen that I can stream YouTube videos. There are one or two more services listed that Chromecast streams. Using Chrome browser, there are more movie channels you can stream as well. I've never used Roku, etc., so can't compare.For $35, it works seamlessly. You can't go wrong.", "verified": true, "helpfulness": "5/6", "author": "Elise Timpe \"Realtor\""}, {"rating": 1.0, "review": "Not easy to install with kindle fire HD:does not work with Kindle fire HD. set up is too much for senior like me. one needs Master's degree in computers to use this with Kindle fire HD", "verified": true, "helpfulness": "0/3", "author": "prakash"}, {"rating": 4.0, "review": "I don't watch cable tv; don't like it... Having the chromecast and watching netflix and youtube allowed me to purchase a bigger TV without the smartTV stuff and save money. Works perfectly fine. Chrome tabs from my mac can be displayed as well and I can see my browser.What I would really like is to be able to watch my full android phone. For instance I would like to have movies on my phone and stream them to the chromecast without depending on Netflix. Specially because not all movies are on netflix... I manage watching them on a chrome tab on my mac through streaming, but it's not the same.....", "verified": true, "helpfulness": "0/0", "author": "Nicolas Ruiz"}, {"rating": 5.0, "review": "Very easy to setup and looks terrific on the TV. Setup took about 2 minutes and was straight forward.For the operation there is not a lot of app support but so far the apps that do support it the experience has been really good. I use it mainly for YouTube videos.Sits perfectly behind my TV and works everytime.", "verified": true, "helpfulness": "0/0", "author": "AKGeek"}, {"rating": 5.0, "review": "Its great if you know what you are buying.If you are looking for a way to stream netflix to a tv with minimal effort, this is the device for you.If you are looking for a way to stream content from your computer or home server to a tv this is not the device for you.", "verified": true, "helpfulness": "0/0", "author": "gord currie"}, {"rating": 5.0, "review": "Very easy setup.Easy to use, beautiful picture quality and tone.So far Netflix and Youtube work great, You just click the cast button and it immediately jumps to the tv.Both my Android phone (HTC One ) and W8 laptop work great with it.Using Chrome browser you can cast the whole tab to the TV, mirroring your device.Totally worth it- I love it so far! It makes my phone and laptop interact with my TV.", "verified": true, "helpfulness": "0/0", "author": "ross442"}, {"rating": 1.0, "review": "This device does not work with Cisco wireless routers.  It took me 11 days, 3 phone calls, and 11 emails with Google support for them to figure out that the product does not work at all with the wireless router I own.  I am returning the product and have chastised Google about their marketing material's false advertising.  Amazon's returns are great though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]