[{"rating": 5.0, "review": "For someone like me who doesn't want to pay cable and looks for free streams online, this is the best device. I am glad that along with ESPN, HBO GO, HULU PLUS & NETFLIX, I can also cast my chrome tab for shows that are not available on these apps (usually websites that provide this type of content for free are ad-heavy, so I need my adblocker extension to make it watchable)Right now I am casting a chrome tab to watch Men's Volleyball Championship (which is available for free thru Polish TV). No A/V sync problem, no hassle.I am super-satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "Hedy"}, {"rating": 3.0, "review": "serves the purpose right. Some times it loads and casting with netflix is up and down.", "verified": true, "helpfulness": "0/0", "author": "Muzamil"}, {"rating": 5.0, "review": "The Chromecast started out great, but keeps on improving. I love being able to stream whatever I want to the TV, even though I don't have a smart TV. Definitely worth the money!I've never had any connection issues and the video is always high quality.", "verified": true, "helpfulness": "0/0", "author": "Dallin Christensen"}, {"rating": 5.0, "review": "Changed my whole viewing experience", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "althought I still havent been able to install it...", "verified": true, "helpfulness": "0/0", "author": "jose marcano"}, {"rating": 4.0, "review": "Would be better if Android supported more video codecs. As it stands, the best way to stream is with a PC. Still, it's a great cheap way to stream content to a TV.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Great way to mirror pictures or videos from your smartphone, tablet or computer. Works very easily with minimal setup.", "verified": true, "helpfulness": "0/0", "author": "Scott G."}, {"rating": 3.0, "review": "Youtube is streaming great.  But it doesn't work well for other websites.  Not sure why....", "verified": true, "helpfulness": "0/0", "author": "Keerthi Jayaprakash"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "V"}, {"rating": 5.0, "review": "Very good .Thanks .", "verified": false, "helpfulness": "0/0", "author": "Abdulkarim M. Fattah"}]