[{"rating": 5.0, "review": "My son and his roommate had cords all over just to connect Macbooks for streaming, but the Chromecast works perfectly for them without the corded mess. Awesome clarity and transmission without any lag from both Windows or Apple laptops. My sons phone is Android, and we sat on the couch throwing things up on the TV without any lag. The Chromecast switched between content from three mobile devices like a boss. Super easy and fast set-up.", "verified": true, "helpfulness": "1/1", "author": "Ronald D. Pemberton \"Thoughtful Consumer\""}, {"rating": 5.0, "review": "What an amazing little device.  works interactively with youtube and netflix.  able to take whatever is on your current tab on chrome browser and plays it up on the tv screen", "verified": true, "helpfulness": "0/1", "author": "Bryan Burns"}, {"rating": 5.0, "review": "No need for a smart TV. Great device, simple interface (because you use the apps your already used to), affordable, and simple setup.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel E Bonton"}, {"rating": 5.0, "review": "This was such a fun, worthy purchase. I read all the other reviewers before I decided to buy it. I am very happy with my purchase, it is well worth the price paid and the easy install,and usage. I do not know what anyone was looking for, my entertainment needs have been met with Chromecast so much, I am buying another for my bedroom. It is portable, if you want to move it from tv to tv. As I said, I am happy with the purchase, I would definitely recommend this.", "verified": true, "helpfulness": "0/0", "author": "D. L. Brown \"A Knower Of Good Things\""}, {"rating": 5.0, "review": "This thing is awesome - no resolution issues, perfect clear HD picture, no audio sync problems, NONE of the usual computer-to-tv video issues these inexpensive devices often pose. Works exactly the way it's supposed to and the compact design is efficient for TVs in tight spaces. Couldn't be more satisfied.", "verified": true, "helpfulness": "0/0", "author": "Jordan A Rininger"}, {"rating": 5.0, "review": "Being able to wirelessly stream content controlled via laptop, cell phone, or tablet for only $35 is incredible. You can get one for each the TVs in your house. You can put a TV almost anywhere, such as your kitchen, and cast content to it without having a TV connection. Note to readers, there is a way to cast your entire desktop from the Chrome browser running on your PC. Once you've installed the Google Cast extension into your chrome browser, you'll have the cast icon in the upper right. When you click on this, there is a little \"down arrow\" and if you click on that you can select to cast your entire desk top. I find this very useful for casting pictures viewed on my laptop. By the way, I recommend the FastStone picture viewer for Windows which can be downloaded for free via CNET downloads. If you like it you can make a donation if you want.", "verified": true, "helpfulness": "0/0", "author": "andrey"}, {"rating": 4.0, "review": "Works great and is almost completely invisible on the back of my small kitchen TV. I love the quality. Great price for my use as it stays in the kitchen or travels with me and allows me to stream Netflix or Hulu. Which is all I wanted :)", "verified": true, "helpfulness": "0/0", "author": "Christina Booth"}, {"rating": 1.0, "review": "A lot of limitations and few app, it drops connections every few minutes. My smart TV can do better youtube and Netflix without touching another device, better yet I can control them using TV remote. Returned it.", "verified": true, "helpfulness": "3/5", "author": "FromCharlotte \"ddppkosh\""}, {"rating": 3.0, "review": "When it works, it's great. I've had issues where it will just lose the connection out of nowhere. And there is a lag between the laptop and the device - making the audio and video out of sync. Bought this so I could get rid of cable and just watch the shows I like online.... Ended up going back to cable. Just less of a headache and hassle.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 3.0, "review": "Not a bad little device, but limited use cases. I used it to control youtube video playback on a projector down my driveway for halloween. I was not able to get it to stream video coming from 4G (cell phone) over my home wireless network, to a projector, if the wireless network was not connected to the internet also. Also, it only works if the app you are using is Chromecast enabled, meaning that Google has to have a relationship and integration strategy with that app ….", "verified": true, "helpfulness": "0/0", "author": "David Bye"}]