[{"rating": 3.0, "review": "Needs more R&D; and more Apps, if your TV has one available HDMI port, and is not a smart TV this is an okay solution to change that. If you have an Android phone/tab then you can connect via your Wifi and control the unit. in time i am sure this unit will be great because it has great potential. For the moment i am giving this item 3 stars.", "verified": true, "helpfulness": "1/1", "author": "AV PRO \"DL\""}, {"rating": 5.0, "review": "Purchased Google Chromecast today, and I have to say I'm pretty satisfy with it. The setup was really easy, and I was able to connect the device with my Macbook in less than 10 minutes. It did take a few minutes to update the software, but other than that, it went on without any glitch.I was able to stream the typical Youtube and Netflix with lighting speed and amazing image quality. With the new software update, you are also able to stream more contents like Hulu, HBO, and Pandora.It also allows you to stream your Chrome tab, which is extremely important to me.1) You can cast other media sites, such as ESPN, which is currently not supported by Chromecast. You can simply navigate to the site, play the video, and click on the Chromecast icon to cast the webpage.2) You can cast local contents such as movie files or musics. I personally have a lot of MP4 files, and I was able to drag into the Chrome browser, and cast onto my TV without any problems. For AVI files, I had to download the Plex Media Server to cast the movies. It's not as direct as others, but you still have ways to work around it.Overall, I'm really satisfied with this device. For $35, you can really take your media contents on the go.", "verified": false, "helpfulness": "0/0", "author": "Ryan W."}, {"rating": 5.0, "review": "This may well be the best purchase I've made all year. What's not to love about the new Google Chromecast?", "verified": true, "helpfulness": "0/1", "author": "Austin"}, {"rating": 1.0, "review": "Blows. Nothing like the TV comercial lag on a 1300mbps fast wireless is horrible.  get a roku or WD streaming box, they are more money but in this case cheaper is not better", "verified": true, "helpfulness": "1/2", "author": "Paul G. Strahan \"Biff Hardcore\""}, {"rating": 5.0, "review": "This little gadget is a jewel. I use it to watch Netflix, Hulu Plus, Pandora and Youtube videos from my iPad or iPhone. You can also stream any tab directly from Google Chrome. Other apps are been added to the compatibility list. Hopefully, we will see more soon (HBOGO is the newest one, but I still have not tried it).", "verified": true, "helpfulness": "0/0", "author": "E. D. Aronne"}, {"rating": 5.0, "review": "Truly a great invention for all of us who jumped on to the LCD/LED TV's before they became smarter.. The TV in the bedroom has now more meaning with this device. Not all content is playable but it is good for what Google promises it should do. hopefully we can see then expanding this to more usage in the future", "verified": true, "helpfulness": "0/0", "author": "rahpat"}, {"rating": 5.0, "review": "I'm a pretty heavy internet media user. Our house has PCs, Macs, iPhones and iPads. We cut cable 2 years ago and each TV has a Roku and the big one also has an Apple TV. I use them all, but this is the one I end up using the most. Casting video that I come across while using my iPad or laptop is just so much easier with the Chromecast. No menus to navigate on the device itself, just send it from what you are already using. I'm surprised how much better I like that.", "verified": true, "helpfulness": "1/1", "author": "Chad W"}, {"rating": 3.0, "review": "Unable to stream videos from cellphones or tablets at the chrome extension is not supported.Other things are good.Overall I liked it.", "verified": true, "helpfulness": "0/0", "author": "Ranga Reddy Bapuram"}, {"rating": 4.0, "review": "The Chromecast is an excellent little gadget. While it has limitations (it currently cannot stream Amazon Prime, because of the Silverlight use) I've found it excellent for streaming anything from YouTube videos to Music to play through the TV.", "verified": true, "helpfulness": "0/0", "author": "Voyager"}, {"rating": 4.0, "review": "It's only been 24 hrs. But I like it so far. Picture quality is awesome. My only complaint has to do more with Chrome on Androids. than anything. It only works with  apps that can hook right into it on my Android phone and Nexus 7, It does not work appear to work with Chrome on the Android platform or any of the Google apps on an Android. But . . .  it does work well with Windows and Apple operating systems. I believe that it will work fine with Chromebooks also.Added . . .Well I did get it to work with my chromebook. As I said before, the video quality is awesome. it was great being able to show holiday pictures on the TV. Audio just plain doesn't work. There's no sound for Amazon, youtube, or browser inserted movies. It'd nice to be able to look at pictures with the family. It would have been nicer to be able to watch movies.", "verified": true, "helpfulness": "0/0", "author": "TomP"}]