[{"rating": 5.0, "review": "Most used device in my home.  This is awesome because its all over wi-fi and uses really the only 2 major programs I watch Netflix and youtube.  I heard they should be getting more apps for this soon.", "verified": true, "helpfulness": "0/0", "author": "Jodi L Walters \"sonixgirl77\""}, {"rating": 5.0, "review": "Things ChromeCast is really good!  I plan on bringing it on my travels to Southeast Asia as there aren't many English channels.  Love it for the documentaries.", "verified": true, "helpfulness": "0/0", "author": "j7general"}, {"rating": 4.0, "review": "It is good, it is just in its baby stage though. I believe, as of now, the only apps that work with it are..1. Google play store/YouTube2. Google music3. Netflix4. PandoraOnce Hulu is added, would be nice. Ideally I would like to be able to stream from my computer as well.", "verified": true, "helpfulness": "0/0", "author": "Daywalker"}, {"rating": 5.0, "review": "It works and it is very simple to install. My wife uses it for Netflix, almost exclusively, and some YouTube, so I cannot opine on other channels (does it work with Amazon PrimeTime? Don't know, haven't checked). The form factor is excellent; no problem finding space for it in the back of the TV. I installed in HDMI 1, and it's just a follow-the-instructions exercise. Once operational, very fault-tolerant. We really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Alfredo Ramirez"}, {"rating": 4.0, "review": "I love this deviece its wireless what more can you ask for, I'm giving it 4 stars because it needs a 5% improvement. There's a5 second transmittable delay from pc, cell, tablet to Tv. It needs to work with more devices and Apps other that its great.", "verified": true, "helpfulness": "0/0", "author": "Enrique Carbajal Jr."}, {"rating": 5.0, "review": "It is simply elegant! We just love it. Easy setup. No wires. We have netflix and now, we don't have to search for the tiny Roku remote (returned the Roku 3 that I bought after I used Chromecast). We watch a variety of sports from Google Chrome browser, movies and YouTube videos.", "verified": true, "helpfulness": "0/0", "author": "VR"}, {"rating": 5.0, "review": "Very convenient to use works with any phone. Android, fruit phone, windows; compatible with every electronic item in my house including my laptop. Convenient and very easy to use. :)", "verified": true, "helpfulness": "0/0", "author": "ameyzzin"}, {"rating": 5.0, "review": "Easy set up. Pretty reliable. No lag on streaming. No problems with is at all. I recommend this for anyone. Price can't be beat!", "verified": true, "helpfulness": "0/0", "author": "imweasel"}, {"rating": 4.0, "review": "Great product, great ease of use, just wish it supported more that Youtube and browser. Would be nice to stream your laptop, or videos from your nas, etc....", "verified": true, "helpfulness": "0/0", "author": "MJK \"mikeklement.com\""}, {"rating": 2.0, "review": "If you are looking for something to watch online like “YouTube,  Hulu,  NetFlix then this thing is for you.Google doesn’t want people to watch their own music and movie with this thing, and you won’t be able to. Google did auto update the firmware to make that people can’t play their own stuff which the previous firmware did.This thing doesn’t have a user interface, so you have to open a browser “Google chrome only” that very ODD.My was freezing 2 to 10 second during making the image like ghost shadow.", "verified": true, "helpfulness": "0/0", "author": "M. Adolphe \"The foreigner in NYC\""}]