[{"rating": 3.0, "review": "At times it is not able to play, play to try several times for it to happen, but it still disappoints me at all.", "verified": true, "helpfulness": "0/1", "author": "stibcasa \"stibcasa\""}, {"rating": 4.0, "review": "If you use the included apps it works like a dream, if you put up a website or stream from a website it can lag, bur overall I LOVE it.", "verified": false, "helpfulness": "0/0", "author": "Misty K."}, {"rating": 4.0, "review": "works ok so far.  still need to learn on how to use everything yet.  had help to install.  thank you.", "verified": true, "helpfulness": "0/0", "author": "Melvin Wong"}, {"rating": 4.0, "review": "I think the concept of Chromecast is a great solution for those without Smart TVs. It works well and I like how I can use it with my iPad. It's downfall is the lack of services (currently only YouTube, NetFlix, and they finally added Hulu). Once they add HBO GO and other such services, it'll be a  must-have.", "verified": true, "helpfulness": "0/0", "author": "Dan the Creator"}, {"rating": 3.0, "review": "I waited for the Chromecast to be delivered (it was on back order) for a couple of months.It works great for Netflix and Youtube but there aren't enough apps that support it.Chrome on the iPhone / iPad doesn't support it. COME ON GOOGLE!I'll be using my Apple TV and X-Box 360 until the Chromecast improves - it has a long way to go!", "verified": true, "helpfulness": "0/0", "author": "Ralph M. \"RamGen\""}, {"rating": 2.0, "review": "I bought it because it was a cheap gadget to try. But there is no really meaning for it. I still need either smartphone or a computer to connect to the internet. and if i have them, then i don't need this thing at all - there are many applications that allow you to do same things right from your phone or computer", "verified": true, "helpfulness": "0/0", "author": "Oleg & Sasha"}, {"rating": 2.0, "review": "The product description leads you to believe you can stream or \"cast\" your Chrome browser content from any device.  You cannot cast from Apple iPad (not browser content).  I was able to stream from the YouTube and Netflix apps.  Was disappointed as I hoped it was my solution to put my tablet web browser content onto the big screen.  Was able to cast Chrome content from my laptop, however.", "verified": true, "helpfulness": "0/0", "author": "Thomas Payne"}, {"rating": 3.0, "review": "I guess I was expecting more. It does what is advertised. For the price it is a nice. Just wish I could stream more from my Nexus 7 and Android phone then just 4-5 apps! Stinks having to use a computer when I want to stream websites and other content and not be able to do so from a mobile device....", "verified": true, "helpfulness": "0/0", "author": "Troy Hall \"trytroy24\""}, {"rating": 5.0, "review": "Once again Google comes through.  Chromecast is a fantastic product and if you haven't used it, you are in for a great treat.", "verified": true, "helpfulness": "0/0", "author": "Vicki Love"}, {"rating": 5.0, "review": "I love using this. It is easy to use and get setup. And very useful for watching Netflix on TV", "verified": true, "helpfulness": "0/0", "author": "Jobi Caraballo"}]