[{"rating": 5.0, "review": "greatest thing i've ever had and it's cheap too. the only downside is you have to plug it into the wall too. you also have to have a wireless router for it to work but you probably have one anyways if you're trying to buy it.", "verified": true, "helpfulness": "1/1", "author": "william hurt"}, {"rating": 1.0, "review": "I BOUGHT THIS PRODUCT SINCE MY COUNTRY (GUATEMALA) AT AMAZON.  WHEN I WANTED TO DOWNLOAD THE SOFTWARE TO LINK THIS PRODUCTO WITH THE TV,  I RECIEVED THIS MESSAGE \"THE SOFTWARE IS NOT AVAILABLE TO YOUR COUNTRY\".  I WROTE EMAILS TO ASK ABOUT THIS AND I NEVER  RECIEVE ASWERS.  I LOST MY MONEY.", "verified": true, "helpfulness": "1/3", "author": "Juan Carlos Martinez"}, {"rating": 1.0, "review": "Do not buy. the advertising is very mis leading. all you can stream is Netflix and Google Player which both sites they want you to buy the movie. Not able to stream videos or movies on your hard drive.", "verified": true, "helpfulness": "3/7", "author": "Gomez"}, {"rating": 5.0, "review": "This little dongle does everything I need to mirror material to a HDTV and I couldn't be happier with the price. No wonder it was sold out before, I just hope Google could continue to work on it and get more updates.", "verified": true, "helpfulness": "0/1", "author": "Nasu"}, {"rating": 5.0, "review": "AMAZING! Buy yourself one of these now. If you watch Hulu, Netflix, Google Play, or YouTube this is the best streaming player out there. And it's a great bang for your buck. Works very well any tv with an HDMI port. Use your smartphone or tablet as a remote which is extremely convenient. Amazing product!!!!", "verified": true, "helpfulness": "0/0", "author": "BAMS"}, {"rating": 5.0, "review": "Great price and everything works great. I can control Netflix and Hulu + all from my phone. Play great quality and was really easy to setup. I also like the fact that with a plug-in I can even display web pages from Chrome browser on my TV.", "verified": true, "helpfulness": "0/0", "author": "Everett"}, {"rating": 5.0, "review": "\"Easy\" does not even begin to describe how impressive this little device is.  Set-up was a snap.  And I now find I'm using it for all kinds of things I'd never thought about (e.g., friends who were just back from Prague came over and we put Google Maps on the TV so they could show us everywhere we should visit on our upcoming trip there.)", "verified": true, "helpfulness": "0/0", "author": "Amadeus \"_amadeus_\""}, {"rating": 2.0, "review": "Four issues with this product: (1)it does not have a simple remote control to control this product like TV we used to.  I cannot use smartphone to control it while someone call me on the iphone.  And my senior mother does not use to by using smart phone to do the remote control function.  She likes to have a regular simply remote control like TV remote.  (2) it only support Youtube and netflex, very very limited selection. After two months usage, I just left it there without any usage (3) it does not support Chromecast over the Chrome OS in the smartphone like iPhone.  (4) the product sometimes is not stable (sometime works sometime does not work and I have to do power-on-off thing to bring it back).", "verified": true, "helpfulness": "0/1", "author": "thomas hwang"}, {"rating": 4.0, "review": "Very good device. It works very easy with my Android phone and tablet. With Google Chrome it is possible to broadcast local videos and songs even from my Linux Kubuntu.", "verified": true, "helpfulness": "2/3", "author": "Marcelo Bittencourt"}, {"rating": 3.0, "review": "It's a neat idea.  It was fun sending home movies from the PC to the HDTV.  But the lag was pretty bad.  I hope they add more support for other apps.  I think I jumped on the google bandwagon a little too soon.  I don't find myself using it very much, but I'm sure they will keep making it better.", "verified": true, "helpfulness": "0/0", "author": "B. Jenkins"}]