[{"rating": 4.0, "review": "May be this is a great product but This is not for my needs as i already have a streaming player.", "verified": true, "helpfulness": "0/4", "author": "SRI \"gssmsri\""}, {"rating": 5.0, "review": "Works as advertised.  You can stream any tab from Google Chrome that you see on your computer screen.  I love it and much cheaper than other alternatives.", "verified": false, "helpfulness": "0/0", "author": "Roger Ely"}, {"rating": 5.0, "review": "Great youtube and netflix experience. Much better than airplay or apple TV (for netflix and youtube only)", "verified": true, "helpfulness": "0/0", "author": "DwnldDude"}, {"rating": 1.0, "review": "It worked for maybe a month and then wouldn't stay connected. I spent several hours changing my router settings and all kinds of troubleshooting and it still didn't work. Just go with a cable until technology gets better.", "verified": true, "helpfulness": "0/0", "author": "Mary \"Listening to audiobooks is the only way I get to experience books I don't have time to read!\""}, {"rating": 3.0, "review": "actually with the new hifi dvd players you can do the same thing this one is doing.", "verified": false, "helpfulness": "0/1", "author": "Naz Phiroz \"good movie obsession\""}, {"rating": 4.0, "review": "needs more apps to work with", "verified": true, "helpfulness": "0/0", "author": "Epicurious Eric"}, {"rating": 5.0, "review": "I LOVE this thing. I have only had it for a few weeks so I haven't discovered all the wonderful features, but it casts Netflix and YouTube videos perfectly!", "verified": true, "helpfulness": "0/0", "author": "Korrine"}, {"rating": 2.0, "review": "Slow, poor quality streaming via Wi-Fi. You won't be able to watch shows even with fast connection, let alone sports. Buy a Roku 3 instead.", "verified": true, "helpfulness": "0/0", "author": "Gotyrocker"}, {"rating": 2.0, "review": "I have to constantly program it to the tv.", "verified": true, "helpfulness": "0/0", "author": "Amadorla"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Moses"}]