[{"rating": 2.0, "review": "If you want to watch youtube or whatever is provided for by Google, then it is fine.If you want to display your photos or videos from the phones/laptops, etc - looks somewhere else.Overall, for $29 not bad, but would be 5-star if it was more flexible and played more content.", "verified": true, "helpfulness": "0/0", "author": "Nikola Trninic"}, {"rating": 3.0, "review": "I bought this primarily as a way to stream from my laptop to my TV.  Originally it worked great!  I could stream anything that was played on my computer just by adding an app.Then Google removed that app, and updated Chrome so it was no longer supported.  So I had to go buy a new DVD player after all.But I could still watch streaming content on the TV from any site on the internet without giving up the ability to surf the net.  All I had to do was run it in full screen mode, in Chrome.  Hitting alt-tab would keep the streaming tab streaming in the back.  Until right after Christmas.  Then, they update again.  Now the only full screen while surfing options that remain are the official Google partners - all pay services.This had much potential, but it's pretty obvious that Google is going to limit what they allow you to stream.  Which is a pity.....", "verified": false, "helpfulness": "1/1", "author": "Indyattic"}, {"rating": 4.0, "review": "Inexpensive, Idiot-proof setup (true plug and play), Allows multitasking are a few of the reasons I love this device. Many non-supported services can be played through the Chrome Viewer and transmitted to the TV with a small addon. You can use Chrome to play movies (files and online services) while it telecasts, but in full screen it hogs the computer from doing anything else (it is a slightly smaller letter box with multitasking). For what you get when purchasing this device, you get the long end of the stick. Not perfect (doesn't support Amazon movies yet unless through Chrome, but this could change soon). Great piece of technology for rock bottom $35.", "verified": false, "helpfulness": "0/0", "author": "JW20009 \"Electronics Freak\""}, {"rating": 5.0, "review": "I had one almost since it hit the market and bought one for each of my 2 sisters for Christmas. They work perfectly out of the US and the list of apps available is growing. The only con is the bright LED, but a little piece of tape on it solves the problem.", "verified": true, "helpfulness": "1/1", "author": "Esteban Gamboa Garcia"}, {"rating": 1.0, "review": "The product works fine to cast Youtube or Pandora from my cell phone, but the main reason for my purchase was to cast from Chrome on my laptop. It works for a few seconds and then stops. I've tried numerous other things including resetting the device and updating the software but nothing works. A lot of others online have been having the same issue. I'm going to be returning the product.", "verified": true, "helpfulness": "0/0", "author": "Nav K"}, {"rating": 5.0, "review": "Easy to installIt is hidden behind the TV on our TV - so aesthetically pleasingIt is so easy to use that our 4 yr old can start it upWe use it in our bedroom, where we have a TV, but no cable.  We use it to stream movies.", "verified": true, "helpfulness": "0/0", "author": "SoozeSays \"just LOVES books\""}, {"rating": 5.0, "review": "I love this little gadget. My wife and I watch YouTube and Netflix and listen to Pandora from our smartphones almost everyday. Everything communicates through our Wi-Fi. I haven't got my laptop to sync up correctly yet. I've recommended this to several friends. $29 at Best Buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was a gift for my mother who has never had anything past a cable box. Showed her how to use it with Galaxy S4 and I also gave her three months of Netflix to try out. She uses it every day now and it's so simple to use she picked it up right away.For the price this thing is great, I would like to see more functionality with other apps but even now it's a product worth purchasing. I plan on getting more for my own TVs soon.", "verified": true, "helpfulness": "1/1", "author": "J. Benavides"}, {"rating": 5.0, "review": "Great product that had everything that we were looking for with its netflix and HBOGo compatibility. Also very easy to use", "verified": false, "helpfulness": "0/0", "author": "Samantha Lin"}, {"rating": 3.0, "review": "Need to be able to cast a tab with other streaming video. Also it locks in on netflixs and can not exit unless unplugging. it also needs a off switch.", "verified": true, "helpfulness": "0/0", "author": "Vic"}]