[{"rating": 4.0, "review": "so far is good products and good .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Try to stream movies using Apps and it constantly buffers even on lowest quality setting.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "One of the best invention Google has made.  My son uses it all the time.Thanks again.", "verified": true, "helpfulness": "0/0", "author": "Ruth Colon"}, {"rating": 5.0, "review": "Great product. It does what it's supposed to do perfectly well. Very easy to set up: only 3 simple steps.", "verified": true, "helpfulness": "0/0", "author": "Ksrsth"}, {"rating": 3.0, "review": "It works well but does not include the Amazon app which is severely limiting.", "verified": true, "helpfulness": "0/0", "author": "Sean L"}, {"rating": 5.0, "review": "I use this for anything I want to watch on the tv, be it youtube, or casting tabs off chrome. It's the perfect device for those things, I haven't used many of the apps. But if you want to stream something to the tv from the PC it'll work just fine. Being that both the chromecast and my router are in the same room I have never had any drops in quality.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 2.0, "review": "This is a great item if you just want to stream the 3 or 4 major apps supported, but otherwise it is useless...cannot mirror an iPad or other iOS device...only HBOGo and the big ones...nothing can touch the AppleTV when it comes to streaming direct...at least for an apple device...cant speak for Android devices.", "verified": true, "helpfulness": "0/0", "author": "Mego9"}, {"rating": 5.0, "review": "Excellent customer service and awesome product! Thank you~", "verified": true, "helpfulness": "0/0", "author": "deborahjean \"dj\""}, {"rating": 3.0, "review": "does not connect well with phone", "verified": true, "helpfulness": "0/0", "author": "Zrg45"}, {"rating": 4.0, "review": "It works perfectly. However when I first got it the iPad Netflix app was having difficulties streaming to it but I was able to use the Android Netflix app and Chromecast Chrome extension to stream with no issues. Other than that, the Chromecast works exactly as it should. Either an ipad update or a Chromecast update fixed the iPad Netflix issue and that's now working correctly.", "verified": true, "helpfulness": "0/0", "author": "Ian"}]