[{"rating": 5.0, "review": "Great Device I am extremely happy with my purchase!", "verified": true, "helpfulness": "0/1", "author": "Christina Truong"}, {"rating": 4.0, "review": "This was very easy to set-up. It was suppose to arrive late because they were out of them but for some reason it came 3 weeks earlier and I got it in a few days. Over all it seems to work pretty well.", "verified": true, "helpfulness": "0/1", "author": "Debbie Robinson"}, {"rating": 3.0, "review": "VOICE SEARCH ONLY SEARCHES AMAZON CONTENT. I have had both Apple TV and Roku. I was an early adopter of Apple TV but their first generation didn't include Hulu streaming so I bought a Roku. I got tired of having both devices so I looked at a new Apple TV, a new Roku or Amazon's Fire. I chose the Amazon product because it seemed to offer more features. I was sorry to find out that the VOICE SEARCH ONLY SEARCHES AMAZON CONTENT, not Netflix or other content providers. To search those provider's content, you have to navigate to that provider and then use the clunky search tool of typing in a letter at a time with your remote. This limitation on the voice search IS NOT COMMUNICATED IN THEIR PRODUCT ADVERTISEMENT. If I am mistaken or not using the device properly, I would love to know Amazon.", "verified": true, "helpfulness": "1/1", "author": "Kay Christian"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Meryl A Costa"}, {"rating": 5.0, "review": "This Fire TV is a bit more substantial and gets a stronger signal for me than my Fire Stick.  I don't think anyone would be disappointed in either unit. I love them both. They are both no brainers to set up. Just keep track of the tiny remotes. They seem to love slipping into my sofa or under it. Don't forget to pick up a short HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "NancyB"}, {"rating": 5.0, "review": "Was a Christmas gift for my mother and she couldn't be more pleased.", "verified": false, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Love it! Streams/downloads quickly,  great HD picture and love all the available apps and games. The voice search is the best feature!!!Definitely glad I went with the Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Gigi"}, {"rating": 5.0, "review": "This works great. No lag at all.Tons of apps and games.A must have for Amazon Prime members", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "The  (smart tv) was slow and hard to use. This is head and shoulders above the tv operating system. The voice control is amazing. The downside is voice control only works with Amazon. Looking for non amazon content is still much faster due the speed of Amazon Fire tv. My wife is very happy with the Fire tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]