[{"rating": 5.0, "review": "I love this!  It is so easy to set up and so easy to use!  I saw it in an article about best new \"things\" and thought  \"Why not!\".  I have been recommending this to everyone.  It is wonderful!", "verified": true, "helpfulness": "0/0", "author": "Nan"}, {"rating": 4.0, "review": "It just doesn't support enough apps, it supports YouTube, I can watch music videos on my TV, and it supports Netflixs but I don't subscribe to Netflixs. So other then using it for YouTube music videos I don't know what else to use it for. I was hoping to watch tv programs that I missed, but until more apps are supported this won't happen.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Paul"}, {"rating": 3.0, "review": "Great for Netflix and YouTube.  But does not recognize a browser using my iPad2. Good value to get content on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Peter Gailey"}, {"rating": 5.0, "review": "The Chrome Cast player was a nice addition to my gadget collection. My Android tablet is a perfect companion gadget and increases the viewing options available in our home. We actually have three now between me and my brother.", "verified": true, "helpfulness": "0/0", "author": "BillyB1951"}, {"rating": 5.0, "review": "This product dies exactly what we needed it to: play youtube videos for our kids on the tv and not tie up our device while it plays", "verified": true, "helpfulness": "0/0", "author": "Justin Peachey"}, {"rating": 5.0, "review": "We have a sony blue ray player and evidently it is outdated or something.  Couldn't get past .5 on loading Netflix movies.  Comcast couldn't help us, Netflix couldn't help us, Sony said it wasn't their problem.  I don't know who's it is but some nice gentleman from Netflix said to get the chromecast HDMI and it solved our problem.  Took me a while to figure out how to get it set up.  I still don't know all it is capable of.  Will have to study it more.", "verified": true, "helpfulness": "0/0", "author": "turbocat"}, {"rating": 1.0, "review": "I didnt know it ONLY worked with certain wifi connections and had to return it because mine was 1 it didnt work with", "verified": true, "helpfulness": "0/0", "author": "christel brooks"}, {"rating": 5.0, "review": "Excellent picture quality and easy to use.  Easy to set up on a PC laptop and even my android phone.", "verified": true, "helpfulness": "0/0", "author": "Michael J Wysoglad"}, {"rating": 3.0, "review": "Easy to install, High video quality,But it works online with youtube.Wen google allows it to work as a duplicaton of the screen it Will be the top.Bye", "verified": true, "helpfulness": "0/0", "author": "Piero dalle Nuvole"}, {"rating": 3.0, "review": "I really like it and I know the beta part is well, beta but casting web content and local content from my phone works better than from my laptop. Casting from Youtube is flawless.... also almost pointless but for $35.00 I didn't expect much. Netflix does alright but I have that on enough devices already.Maybe this will get more love than Google TV 'eh?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]