[{"rating": 5.0, "review": "This has got to be the best deal out there today.Amazon Prime tied to Fire TV then move to Sling TV for the ESPN sports and other things to watch on the sling TV channel.I have bought both, The fire TV Stick and the Fire TV Box.The Fire TV Box is the Best, Response faster and the picture is Stronger in the colors, plus the audio remote in hand.Add from Amazon the Digital TV Ant with remote for local channels.  A Deal at $34.95.The best money that you can spend today.Fire TV!!", "verified": true, "helpfulness": "0/0", "author": "Robert T. Hentz"}, {"rating": 1.0, "review": "These devices sucked up so much data it was imposibble to run 2 at the the same time even with high speed internet! Sent mine back, sticking to my roku", "verified": true, "helpfulness": "3/5", "author": "Yvonne Meyer"}, {"rating": 5.0, "review": "Great product that also includes other great applications. A perfect example of how businesses can come together to create something Extremely efficient and user friendly. Great Job Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Joshua Butler"}, {"rating": 5.0, "review": "I own both the roku 3 and the fire TV. Between the two both have great features but the fire tv wins because it has more features for the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Extremely user friendly.", "verified": true, "helpfulness": "0/0", "author": "Cecil Thomas"}, {"rating": 5.0, "review": "Amazon Fire is awesome! I love the voice feature!", "verified": true, "helpfulness": "0/0", "author": "Shelbye Farmer"}, {"rating": 1.0, "review": "This product is horrible! I was very disappointed in the quality of this product.", "verified": true, "helpfulness": "2/7", "author": "d"}, {"rating": 5.0, "review": "awesome. the hardware blows away all competitors including Roku 3. Also gives the ability to side load apps that you like. Very satisified overal.", "verified": false, "helpfulness": "0/0", "author": "Wilson Shon1982 \"Shon1982 Wilson\""}, {"rating": 5.0, "review": "Excellent!!!!!", "verified": true, "helpfulness": "0/1", "author": "Michael R Greco"}, {"rating": 2.0, "review": "The good: easy to use, tons of apps, Amazon Prime TV, movies, music, all work great, as do the PBS and PBS Kids apps. Customer service is top-notch.The bad: First box I received blew out in less than an hour. Received a replacement from Amazon in a couple days. This one has worked fine. But....Netflix app doesn't work, ESPN app doesn't work, MLB TV app buffers every minute or so (I don't have a buffering problem with MLB on any other device in my house). No solution visible through customer service. Just have to ride out these growing pains.", "verified": true, "helpfulness": "0/1", "author": "Charles"}]