[{"rating": 5.0, "review": "I'm giving it 5 stars because it is exactly what it said it was. I was looking for more than just streaming. But it works great if you just want a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Forrest"}, {"rating": 2.0, "review": "I read reviews for Chromecast/Roku/Amazon Firestick for hours before deciding that the Chromecast would meet my needs.  It worked just fine at first, with the caveat that, if I connected through my computer, any work done on my computer would make the picture delayed and choppy.  Less than a week later, and the Chromecast device is no longer detected by my phone (which is the only way I can really use this while using my computer at the same time, as explained above).  I checked the device, I unplugged/plugged in again, I've tried connecting a dozen times, and nothing.  Chromecast appears to be connected on the TV monitor, but through my phone, nothing.  The Chromecast works when I do it through my computer, but why would I want to watch a jilted TV show?  The \"using your phone as a remote\" thing is an impediment, not a benefit.  I'll give this thing a few more tries before I give up completely, but at this rate, it seems like I'll be returning this semi-functional device for something with its own remote that doesn't depend on another piece of technology.", "verified": true, "helpfulness": "0/0", "author": "Shay"}, {"rating": 5.0, "review": "Recommend to anyone who is looking for an all-in-one device. Music, movies and more can be casted from one device (smartphone) to another (HdTv). Cast from Netflix, Hulu, Pandora, YouTube, just to name a few. I am very entertained daily by my chromecast!", "verified": true, "helpfulness": "0/0", "author": "Michelle I"}, {"rating": 1.0, "review": "This seems like it would be a great idea, but I cannot get it to connect to my network.The product requires you to make a number of ridiculous changes to your AP/router, including disabling the 5ghz radio completely.I'm using an ASUS RT-N66R, fully patched.Worst of all, there is absolutely no fallback facility to configure the device.  You can't plug it in, there are no other options.If my kindle can connect to my home wifi then this device should be able to.  I have android tables, android phones, apple phones, apple laptops, windows laptops, printers, televisions, xboxes, and security cameras, all of which can connect to this network.  The Chromecast is the only one who cannot.So beware, it may be a gamble whether this device will work on your network or not.If it does work, it'll probably be great.  But the fact that there is no other fallback mechanism to configure it is ludicrous.Google has a \"compatible router\" list up you can search for, but even if your router is on that list, you're going to have to make a ton of changes to get this working, including:- stop hiding your ssid- disable 5ghz radio- disable mac filtering- disable IGMP spoofing- set radio to channel 6- set radio to 20MHz fixed- don't use the USB power cable (even though it comes in the box, they tell you not to use it)- dont plug the chromecast directly into your TV, use the attached extender- do a factory reset of the chromecast after every attempted configuration changeThis is in my opinion a fairly ridiculous set of requirements, and results with you having a less secure router, and unable to use the higher-bandwidth radio.", "verified": true, "helpfulness": "2/2", "author": "Andrew H"}, {"rating": 1.0, "review": "This was a joke. Returning was smooth.", "verified": true, "helpfulness": "0/0", "author": "Tamara"}, {"rating": 5.0, "review": "Cancelled my cable service after purchasing this. ..enough said!", "verified": true, "helpfulness": "0/0", "author": "IRMA ZAMORA"}, {"rating": 1.0, "review": "Works for 45 minutes to about an hour and a half at most and then drops out. It's ok for the usual Youtube videos since they usually don't last longer than about 45 minutes, but trying to watch a movie on Netflix is impossible because of the dropout. Once the signal goes, it's gone and nothing I do will get it to cast to my TV. I wind up having to watch the rest of whatever Netflix movie  I'm watching on my Nexus 7 which fortunately picks up from where Chromecast dropped out. When I start Chromecast up again the next day it usually, but not always works fine again for about 45 minutes or so before dropping out ie not casting the movie or video to my TV although it's still working on my Nexus 7.Chromecast is a nice idea that is poorly implemented. It was released before it was ready.  It's not ready for Prime Time.", "verified": true, "helpfulness": "2/2", "author": "Larry"}, {"rating": 5.0, "review": "Great product- Love it!!", "verified": true, "helpfulness": "0/0", "author": "Patti Grubb"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Karen Richards Mathllin"}, {"rating": 5.0, "review": "This is cool. I use it most for MLB TV and YOUTUBE.  there's a few apps but don't use or understand most. But I like this", "verified": true, "helpfulness": "0/0", "author": "My opinions only"}]