[{"rating": 5.0, "review": "Love it thank you. ..", "verified": true, "helpfulness": "0/0", "author": "Kevin Barnwell"}, {"rating": 5.0, "review": "I like it.  Picture is  clear. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "randy pa"}, {"rating": 5.0, "review": "Easy to set up - a breeze to use.  Great investment!", "verified": true, "helpfulness": "0/0", "author": "Pastor of the North Country"}, {"rating": 5.0, "review": "I. Love. My. Fire. TV", "verified": true, "helpfulness": "0/0", "author": "Austin Robbins"}, {"rating": 5.0, "review": "Excellent interface--got me to finally join Prime!  I used to have Apple TV, which better for music and video but plenty of others ways to hear music and free shows/moves on Prime gets me to try things I would not have tried without it.  No equivalent to that on Apple TV", "verified": true, "helpfulness": "0/0", "author": "Robert Hoyt \"bookomnivore\""}, {"rating": 1.0, "review": "Worked just long enough to get set up.  When I tried to use it the next day, it would not power on. Despite trying all the tricks to get the remote and unit to work again - I was left with no solution.  I even had it replaced and the same issues re-surfaced.", "verified": true, "helpfulness": "1/2", "author": "Mr. Garcia"}, {"rating": 3.0, "review": "Functionality is limited to mostly Amazon videos. I saw no way to stream for a pc to the device so I returned it.", "verified": true, "helpfulness": "0/0", "author": "Astro"}, {"rating": 5.0, "review": "Its much faster compared to my streaming stick.  Lots to like, especially the interface.  However...it doesn't allow me to pin my favorite apps for easy access.  In doing so its favors Amazon Prime content and makes it more difficult to access content I want to see through other apps.  You might be better off buying the Roku3.", "verified": true, "helpfulness": "0/0", "author": "GDuarte"}, {"rating": 4.0, "review": "I bought my Fire TV because Amazon was giving 50 bucks off if I tried the Sling TV for three months. Great deal. I like them both. I give the deal five stars.The Fire TV takes a little to get used to compaired to my Apple TV. But just as easy. I took one star off because of picture quality. It seems to have a haze over the picture. I played with the settings. Changed HDMI cables. Switched HDMI ports. I even tried all of this on another TV. Still not as crisp as the Apple TV. But I do like it. It is nice not to have to put my Amazon prime through my IPad and airplay it with my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Heuwe"}, {"rating": 4.0, "review": "Worked as stated , very impressed", "verified": true, "helpfulness": "0/0", "author": "izzumm"}]