[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Alan Solis"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Claudia"}, {"rating": 5.0, "review": "This is the BEST you can get if you have DSL. It seemed a little hard at first before I got my netflix & hulu accounts signed in. It wanted to charge a high dollar amount to watch a show. maybe because I don't have a prime account. aftewr that it's great. nice screen saver pics to.", "verified": true, "helpfulness": "0/0", "author": "John Rommel"}, {"rating": 3.0, "review": "The apps were great and the picture quality was very good.  But it was constantly losing Internet connection and freezing up.", "verified": true, "helpfulness": "1/2", "author": "Tamara E. Watkins \"TamaraE\""}, {"rating": 4.0, "review": "I've had my Amazon Fire TV for close to a week now, and used it quite a bit, and I do like it.  I like how it turns a non-\"smart\" tv into a smart tv essentially, and of course this device is very portable, so you can take it on the road when you are traveling, or to a friends house or whatever.  And it has a lot of apps!  Way more than I was ever use.  Hbo Go, Netflix, and of course access to the Amazon streaming services being the main ones for me.The only thing I don't like is the remote.  Yes, the voice thing is clever, and kind of fun, and the interface is very simple, but simple isn't always better.  Why not at least give us the complete vcr-like controls?  Frame by frame, or being able to fast and reverse at different speeds etc.Aside from that it works really nicely.  And this is probably the only electronics purchase I've ever made that required virtually no setup.  It already knew that it was associated with my amazon account, and it was simply a matter of plugging in an ethernet plug and powering it on and using it... nice!", "verified": true, "helpfulness": "1/1", "author": "GameMaker \"Mainly a sci-fi, and fantasy junkie who also enjoys horror, whodunnits, and books about animals and sports.\n\nI'm also an amateur filmmaker.\""}, {"rating": 3.0, "review": "Overall it's fabulous", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's simple.  It works. And I now get closed captions.  Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Joe Santucci"}, {"rating": 5.0, "review": "Love how well the voice search works", "verified": true, "helpfulness": "0/0", "author": "Mike Krause \"Reluctant Griller\""}, {"rating": 4.0, "review": "This would get 5 stars but I only gave it 4 because of its lack of usb controller support and a few minor details that probably wouldn't effect the averge user.  Other than that, this device is awesome.  I have built many HTPCs and other Android devices and this device is better for what I need.  I was able to sideload Kodi and a few other Android apps with the help of a few YouTube videos with no problems at all.  One bad thing about sideloading apps is after they are installed, to open them you have to go into the settings, apps, manage installed apps and then locate your sideloaded apps, it doesn't make a nice pretty icon on your homepage like your smartphone does.  But at least you are able to install full apps from the playstore so I guess it's a give and take.  Kodi works perfect and plays all my media with no problems at all.  The UI is really easy to navigate and but a little repetitive.  Under movies there is tabs and one will say top apps and have a list of 10 and then another tab of suggested for you and will have a few of the same apps as the other tabs.  These are all minor things and don't really matter that much.  The most important thing is this device just works and you don't have to be a \"computer person\" to use this I feel it's simple enough for people of all computer knowledge to use.", "verified": true, "helpfulness": "0/0", "author": "Dennis Riese"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Kelley"}]