[{"rating": 5.0, "review": "HI GOOGLECHROMECAST ON MY SMART TV IS GREAT AND WORKING WITH YOUTUBE BUT MY CELL'S VIDEO I FILMED CAN'T SEND TO CHROMECAST SORRY.HOW TO USE MI VIDEO TO SEND TO GOOGLE?THANK YOU REGARDSJOHN", "verified": true, "helpfulness": "0/0", "author": "John A Leggio"}, {"rating": 1.0, "review": "I really wanted this device to work for me, but was very disappointed, it played one time from my Nook HD,afterward picture would start and stop throughout the whole movie, sometimes would not start-up again.  Again, it would get to 25% and the download would just spin, so I feel like it was a waste of money.  I really wanted it work.", "verified": true, "helpfulness": "2/3", "author": "Shirley McWhorter"}, {"rating": 4.0, "review": "$35 Chromecast purchase cost.  $8/month Netflix subscription cost.  These trivial amounts get you a huge selection of movies, documentaries, and TV series, viewable all the time, on your TV, at your convenience.  Roku and AppleTV do more, but at a higher cost.  For $35, Chromecast is a no-brainer - you gotta have it.  The setup is something that any 8-year-old can do quickly and easily, but may be beyond the capabilities of your grandma.  Likewise the operation of the device.If you don't have Roku or AppleTV, get Chromecast.  If you're nervous about setup and/or operation, ask an 8-year-old to show you how to use it.  You'll thank me later.", "verified": true, "helpfulness": "1/1", "author": "Gordon"}, {"rating": 2.0, "review": "Thought this was going to be a whole lot cooler than it turned out to be. Only a few apps on it the rest you need if load into a chrome browser to watch... Ain't no body got time for that. Thought this would be cool, it not.", "verified": true, "helpfulness": "1/2", "author": "Yup"}, {"rating": 5.0, "review": "Pros:Easy setupGreat to use with PC/ChromeGood picture with proper bandwidthCons:Not much use with tablet/smartphone yet outside of YouTube and Netflix... But that will likely changeI have a two monitor PC and when my wife gets home, I start streaming her favorite show on my PC and cast it to our downstairs TV and then put the tab in the background and all the music/sound for her show goes to the tv. Then I put that tab in the background and now I can. Goof around on the internet while she watches the chew and we don't have to pay for cable. Also works great with ESPN go if you want to watch the big game, downloaded movies, music, etc. I got 2 of them now.", "verified": true, "helpfulness": "0/0", "author": "DirkMcDonRon"}, {"rating": 4.0, "review": "We purchased a Chromecast to watch movies on our TV and enjoy it.  It cost us $200.00 to have it installed and had to purchase a book reader Samsung.", "verified": true, "helpfulness": "0/1", "author": "Marie C Anderson"}, {"rating": 5.0, "review": "Everything worked as expected and exceeded my expetations.Now I can view You Tube videos and NetFlix moovies on my TV and for a much lower cost than other solutions labels available in the market.", "verified": true, "helpfulness": "0/0", "author": "Silva"}, {"rating": 5.0, "review": "Dont need a cable box for my infant sons room. Just use this and completely control everything he watches.I love it and bought 3.", "verified": true, "helpfulness": "0/0", "author": "Michael Hayes"}, {"rating": 5.0, "review": "This is cheap. This is beautifully done.Next steps for Google:-- Allow 3rd party apps to cast content-- Allow users to select video resolution from YouTube iOS app", "verified": true, "helpfulness": "0/0", "author": "Syed Ahsan"}, {"rating": 4.0, "review": "at the present time I am very much satisfied hoping to be able to receive more networks in the future very easy to use very easy to install", "verified": true, "helpfulness": "0/0", "author": "victor smith"}]