[{"rating": 5.0, "review": "LOVE IT.  I bought a Chromcast first, but this is what I really wanted.  Netflix, YouTube, music and games.  I cant wait for the game controller to get here.  We are going to take some of the extras off cable now that we have this!", "verified": true, "helpfulness": "0/0", "author": "Jonluk"}, {"rating": 5.0, "review": "I'm glad i waited until i received NETGEAR AC750 Dual Band Gigabit Wi-Fi Range Extender (EX6100) before writing this review.The fire tv works great.  shows load quickly.", "verified": true, "helpfulness": "0/0", "author": "james carignan \"zepp90\""}, {"rating": 4.0, "review": "This little unit works great. It's quick to respond and the remote isn't infrared so you don't need to point it at the unit to get it to work. It has a lot of apps and options to choose from so there's always something you can watch. It remembers where you were last it you want to stop in the middle of a tv episode and come back later. Just wish that it would adjust if your internet speed should slow down for any reason instead of buffering for a long time.", "verified": true, "helpfulness": "0/0", "author": "Sherry L"}, {"rating": 5.0, "review": "Setup was a breeze (just do what it tells you to do). Picture quality was excellent. Apps load quickly. And the voice search feature - it really works!! Just say \"The Good Wife,\" and it finds all the seasons, so you select the season you want and then select the episode you want. I especially like the fact that when you find the show you want, if you are a member of Amazon Prime it shows \"Purchase with Amazon Prime\" (i.e., $0.00) as one of your options (provided that the show is available on Amazon Prime), so there is no need to go looking for the show you want on Amazon Prime (although you can do that too). Also, the Home menu lists \"recent\" shows you watched, so you can go directly back to them, and it \"remembers\" which episode you watched last and goes directly to the next episode. We are using it primarily to watch certain TV shows, movies, and \"Watch ESPN.\" I have watched several basketball games on \"Watch ESPN,\" and video and audio equals what I get on cable. I have Google Chrome on another TV and Vizio TV on another TV, but this is far better.", "verified": true, "helpfulness": "0/0", "author": "ocalaheart"}, {"rating": 5.0, "review": "Bought it as a gift. Set it up and promptly ordered one for myself. Easy set up. Worked great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV was very easy to set up. I love being able to use the free streaming for Prime members and using Netflix as well. This is much easier than having to use these features through my Xbox.", "verified": true, "helpfulness": "0/0", "author": "Mrs.Smalls"}, {"rating": 5.0, "review": "this devise is awesome!", "verified": true, "helpfulness": "0/1", "author": "Nina Young"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Anne Reilly"}, {"rating": 5.0, "review": "great little device works as advertised. probably looking into buying more.", "verified": true, "helpfulness": "0/0", "author": "Gregory Chervak"}, {"rating": 4.0, "review": "Much better wifi than my AppleTV, but how do you turn the darn thing off without unplugging it? I don't like the menus for netflix. I guess I'm used to the AppleTV, but that box had lousy wifi.It would be nice to pull up a listing of all the video that can be freely streamed with Amazon Prime, instead of having to click on every thumbnail to see if the option exists.", "verified": true, "helpfulness": "0/0", "author": "George J."}]