[{"rating": 3.0, "review": "Surprisingly limited on what you can stream onto your t.v.", "verified": true, "helpfulness": "0/0", "author": "Anthony Sepulveda"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "Jordan Sparks"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "RJL"}, {"rating": 5.0, "review": "Excellent . easy to use, small, powerfull, I am very happy  with it,", "verified": true, "helpfulness": "0/0", "author": "Ernesto Ayala Molina"}, {"rating": 5.0, "review": "Works great. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Deal Hunter"}, {"rating": 5.0, "review": "It does what it says and hasn't broke yet. Dollar for dollar one of the best home entertainment investments I've ever made.", "verified": true, "helpfulness": "0/0", "author": "Mark de Groot"}, {"rating": 2.0, "review": "Chromecast works great with YouTube, Pandora, and Netflix from my iPad. My biggest issue is with video streaming from my Mac Book. It NEVER works correctly. I usually waste about twenty minutes messing around with the internet and Chromecast trying to get it to work. Most of the time it eventually works, but it's truly not worth the hassle. I will be buying AppleTV to replace my Chromecast as soon as possible. I wish I would have made this investment originally!", "verified": false, "helpfulness": "0/0", "author": "Alyssa Boike"}, {"rating": 5.0, "review": "Good product, with a lot compatibility options, fast shipment", "verified": true, "helpfulness": "0/0", "author": "Eddy Arce"}, {"rating": 3.0, "review": "Much (most?) of the time, the picture on the TV looks like an old time movie reel - like there's a split moment between frames. I keep thinking it's the director's choice but I've learned that the same director is not working on everything I see on my screen.  Me no like-o so much.", "verified": true, "helpfulness": "0/0", "author": "Max Green"}, {"rating": 4.0, "review": "Haven't played with it much yet but it was very easy to set up and get started. Now to learn all it can do!", "verified": true, "helpfulness": "0/0", "author": "Jesica"}]