[{"rating": 1.0, "review": "It never worked. Wasted 3 hrs trying to set it up with my iPad and messing with routers and updates and ended up just packaging it up to return it. Wasted my money and time. Disappointed husband since it was part of his Christmas gift.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Chromecast was a good investment. It's portable. I can take it with me anywhere that has WiFi. I can mirror everything on my phone to the TV. It's nice to watch YouTube on the big screen. It's also nice that I can watch HBO, Starz, Showtime, etc anywhere because U-Verse has Chromecast support and I'm an AT&T; subscriber. Right now I'm streaming Netflix so my nephew can watch shows while I play on my phone. It doesn't interfere. Only reason I didn't give 5 stars is because it can be glitchy at times and that there are many services that aren't supported by Chromecast. But, many are still being added to the list. This is surprising due to Google's release of Android TV. I'm glad they haven't forgotten about Chromecast. Also, I've had a Roku for years. Both have pros and cons. My Roku is the first model, so it wouldn't be fair to do a full comparison. One would need at least a Roku LT being as it is the latest model closest to the Chromecast's price point. And I got $20 credit on the GooglePlay store for buying. All in all, it's a great device at a very reasonable price. I wish I would have a long time ago.", "verified": false, "helpfulness": "0/0", "author": "J.Smitty"}, {"rating": 5.0, "review": "Initially, I was a bit apprehensive in purchasing this dongle device for our family room tv. However, I have yet to be disappointed in the results thus far.Chromecast is what it is, it's a streaming device primarily geared towards Google applications and some independent ones such Netflix and HBOGO, if you have an HBO cable subscription at the moment, it streams from your Android phone and/or tablet, your chromebook, or your Windows 7 laptop, I'm not sure it will work on an 8/8.1 because I haven't had to use the chromecast extension on chrome on said OS.At any rate, you get what you pay for and for a $35 media dongle, it satisfies my streaming needs quite well. Be warned there's a slight delay when you start streaming anything be it movies, music, etc., so don't freak out if a movie or tv show on Netflix doesn't start immediately. Just give it a few seconds and it'll start, then again, it may also depend on your router and whether it's designed to handle high-end media streaming and downloads.I recommend this as a solid holiday gift for the family or for a student in a dorm, if he/she has a \"dumb HDTV.\" Can't go wrong with inexpensive practicality.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 1.0, "review": "Didn't play well with my Mac or iPhone. Kept crashing and had to reset and re-install numerous times. Going either with Roku, Apple TV, or Amazon's product.", "verified": true, "helpfulness": "0/1", "author": "Mark"}, {"rating": 2.0, "review": "Pros: Fits neatly behind my tv. Displays cool pictures. Works with most of the apps I use.Cons: Drains the battery on my phone and tablet.Sound cuts out. I might as well plug my laptop into the hdmi port on my tv and I would get the same quality without having to reboot the thing.I have a roku 2xd that I'm very fond of and was looking for something similar at a cheaper price point. This is not what I was hoping for and I plan to return it for another roku device. Sorry, Google.", "verified": true, "helpfulness": "0/0", "author": "Sometimes I buy things"}, {"rating": 3.0, "review": "Works but disappointed. You must have a very high speed of internet for this to work at all. Had to upgrade my internet for it to work even properly. Picture is mediocre and I would honestly rather plug in laptop directly in to the TV, works way better and much better picture.Also, if you go to options and change your bitrate to extreme it may work better.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 4.0, "review": "Really a.gandy tool but you have to have a strong Internet signal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lover of insightful literature\""}, {"rating": 5.0, "review": "Great device. I wish the app was more powerful and look forward to new additional sources.", "verified": true, "helpfulness": "0/0", "author": "ICouldDoCommercials"}, {"rating": 3.0, "review": "Video is really choppy depending on what it is you are trying to cast. We were also unable to reliably stream shows on NBC.com from our phones (Galaxy S4), which is one of the things we needed to do to get rid of Hulu. We ended up returning it to Amazon for a refund.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased for my son for a Christmas present.  He loves it!!!  Works great and so cool and convenient that you can operate your television all through your cell phone.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Barbara Lovelace"}]