[{"rating": 5.0, "review": "Being in the Philippines, I have to admit that there are some challenges (\"Discrimination!!!\" I say!) to owning this product because the Chromecast app isn't readily available outside the US. Fortunately for Android, the APK exists somewhere in the clouds. For iOS, however, sorry you're not as fortunate.But once it's all set up, you get a great YouTube streaming player. That's practically the only thing it can do outside the US but, given its low price, that's actually good enough. Fun times to be had by all as you toss video links at the device for playback on a big screen. This is a great thing to have during social occasions, thereby giving the phrase 'social networking' an added dimension.More thoughts over at [...]", "verified": false, "helpfulness": "0/0", "author": "Ming the Merciless"}, {"rating": 1.0, "review": "stopped working 1 hour after install. followed directions; subscribed to netflix watched one 45 minute movie \"hell on wheels\" then in went tits up; talked to the manufacturer for four hours. six different IT's no joy. This thing sucks.", "verified": true, "helpfulness": "2/5", "author": "Lowell Eneix"}, {"rating": 1.0, "review": "Google says they are working on a fix...but for now...since I have an AMD video driver laptop...all I can cast are youtube videos. Anything on a chrome browser tab has a frozen video display. Google....any update? Any fix? Perhaps it's time to just return the product.", "verified": true, "helpfulness": "48/65", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The idea of the Chromecast is as solid as the brick I threw at your sister in third grade. The execution is so poorly done that the Governor had to call in a reprieve. The problem is that when you cast (LIGHTNING BOLT) the \"app\" gives you almost no remote control capabilities other than play and pause. I am spoiled because using my PS3 to play videos on I can pause, play, fast forward, rewind, etc. Casting (FIREBALL) anything other than youtube videos is more heartache than anything. Also it gets confused and the app has no way to reset it so you have to physically unplug it and plug it back in so that it can cast (CHARM PERSON). If they fixed it so that the cast (MAGIC MISSILE) app gave your prtable device more controls I would be interested in it again. But atm it is just sitting in a drawer waiting to cast (CREEPING DOOM) once again.", "verified": true, "helpfulness": "0/3", "author": "judoka13"}, {"rating": 5.0, "review": "Being able to push tabs in Chrome to my television is just the feature I wanted. Ultimately, the services it offered at launch are the services I wanted. This is the product I have been looking for. I may even get another.A few things things consider:-Use is limited if you plan on using an Android alone; however, you can use services that have not been wrapped into Android apps if you push from the Chrome browser (video chat, music streaming, and video streaming).-When using the Chrome Browser, there will be no adjustment for your TV's resolution-Changes in volume have a noticeable lag-Be careful not to crush the device against a wall when moving furniture into place", "verified": true, "helpfulness": "0/0", "author": "The Invisable Man"}, {"rating": 5.0, "review": "Simply priceless, I think google chromecast beat them all for it price. It offers competitive value for less. Planning to buy some more.", "verified": true, "helpfulness": "0/0", "author": "Patrick Amoah"}, {"rating": 5.0, "review": "Only wish that It could be used for more than You Tube and Netflix, but it is a great device to own.  Can't wait until expanded for Hulu and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Kary"}, {"rating": 5.0, "review": "Easy to setup, almost plug and play.I was able to stream videos from my iPad within 5 minutes of opening the box that the product came in.You should definitely use the extender that comes with the product, it distances Chromecast from the shielding in the TV and improves its connection.Definitely happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Nova"}, {"rating": 5.0, "review": "The google Chromecast HDMI Streaming Media Player is a well designed and well built network device. It took about twenty seconds to install and set it up. I am currently using it to stream Netflix, Google Prime, and Youtube. All works perfectly. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "El Pajaro"}, {"rating": 2.0, "review": "I was hoping google would be a more open platform. Alas, they just locked the door last week (the day my Chromecast arrived). You can no longer stream your own media files and can only use their pre-determined video sources. Completely useless for me. Returned....", "verified": true, "helpfulness": "2/3", "author": "Michael Petronino"}]