[{"rating": 5.0, "review": "Where have you been all my life. I now program my own shows when I want to see them. And NO commercials. Thanks Amazon Fire T.V.", "verified": true, "helpfulness": "0/0", "author": "Keith Boyd"}, {"rating": 5.0, "review": "Excellent little device. I was surprised how much you can get out of it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Doerbecker"}, {"rating": 4.0, "review": "As long as you subscribe to Netflix and hulu this is a much less expensive way to have tv than either cable or satellite tv.  Kids love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy Setup. Clear picture. Movies and TV shows stream without any lag. Good Selection of content to view, and it looks like tyhey are adding more all the time. Just remember that this product is really useless without a subscription to Amazon Prime or Netflix", "verified": true, "helpfulness": "0/0", "author": "Charles Pagliotti"}, {"rating": 2.0, "review": "Not what I expected. Most applications need some sort payed product to view. Such as prime,Netflix,or your local cable.", "verified": true, "helpfulness": "0/0", "author": "Olaweb \"Olaweb\""}, {"rating": 5.0, "review": "This is a great addition to my prime experience.  Easy to set up and use.  So glad I purchased this.", "verified": true, "helpfulness": "0/0", "author": "D. Meyer"}, {"rating": 5.0, "review": "neat", "verified": true, "helpfulness": "0/0", "author": "John A. Rice"}, {"rating": 4.0, "review": "I really like the Fire TV. Simple to use and set up; very reliable.my only problem is that I'm on a metered internet service and I would like to set the Fire TV to download lower quality.Unfortunately you can't control this yet. They claim that the option may be added. Netflix allows this control.I think that it is the only streaming service to have addressed the issue.", "verified": true, "helpfulness": "0/0", "author": "Buster"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jay R. Gaglani"}, {"rating": 4.0, "review": "It took some getting used to but there are some definite positives to this little box.  Still, there are not a lot of differences between this and a lot of streaming devices out there, or smart TV's for that matter.", "verified": true, "helpfulness": "0/0", "author": "John Hammel"}]