[{"rating": 5.0, "review": "The interface is really responsive and easy to use. The free games you can get with it are actually pretty good. I was really surprised. It has a much better connection to my 2.4gHz/5.8gHz router than the Roku 2 did.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "I have been using a panasonic blu ray to stream netflix & amazon for some time and it's interface is limited and it is slow to get to the correct menu among many other cumbersome features.The Amazon fire is 100 times better.  the Interface comes right up with no lag, and there are tons of watching options with the free apps.  I hooked it up quickly and it just came on and worked.  There are extra cables required, but a trip to radio shack solved that.  I love this thing.  It's not perfect but it is awesome.  I love that there are games available as well.  I recommend this.", "verified": true, "helpfulness": "2/2", "author": "CLP in Mossyrock WA"}, {"rating": 5.0, "review": "I love this little device.  The remote makes it very easy to use (unlike Chrome where you need your phone, the app, etc.) and it's so small.  The interface is great.  I no longer need my blu-ray player (which i only used for the Netflix/Prime/Hulu apps).  I highly recommend this.  Another great product from Amazon!", "verified": true, "helpfulness": "1/1", "author": "NJ"}, {"rating": 4.0, "review": "Setup consisted of opening the box and plugging it in. It already had my Prime username and password associated and I didn't have to set anything up. This alone was worth it...The Amazon fire is fast and provides excellent video and audio quality vs the long buffer my Rokus have. The Fire seems to buffer before the movie runs and you are looking at HD quality video immediately.My only issue and the reason for the minus one star is that it does not have HBO-Go. Hopefully in the near future Amazon will see the error in their ways and make a deal with HBO.", "verified": true, "helpfulness": "0/0", "author": "Mark Anvoots"}, {"rating": 5.0, "review": "I'm an Amazon Prime member (and also have Netflix), so this is absolutely perfect for us! We have an Xbox 360 (with Xbox Live) in the living room, so I got this for the bedroom. We cancelled our cable tv, so this is perfect. It's so fast, the actual device itself is smaller than a double cd case, and it's pretty flawless. The \"search\" button works great. Basically zero buffering time. I have no complaints whatsoever about it. I'll definitely be getting another for the living room once our Xbox Live prepaid year is up. Waaaay better! :)", "verified": true, "helpfulness": "1/1", "author": "Michigan Chick 79"}, {"rating": 5.0, "review": "This thing is amazing, I was pretty hooked from the Gary Busey commercial but when my dad bought one and said how great it was I had to try.Hooking up the device was very simple, it is a very small square with all the essential plug ins. It has: Power, USB, Optical, HDMI, and Ethernet. Built in WiFi receiver is wicked fast if you have decent internet, and speaking of which*THIS REQUIRES AN INTERNET CONNECTION*You would think that would be a given but some people aren't tech savvy so make note of that if you aren't.Also*THIS REQUIRES A TV WITH AN HDMI INPUT* & *YOU NEED AN HDMI CABLE/DOES NOT COME WITH ONE*There are no component or composite outputs on the back of this machine, which is fine, however other than gaming and the amazon cloud service, most TVs now a days that have HDMI inputs are also smart TVs that come with amazon instant video built in, so it would have been nice for people still hanging on to there old TV's to be able to turn it into a smart TV with this box, but its OK move on with the future of technology.The voice search is spot on, and other than the time I slurred a little while speaking, it has been 100% correct.Many fun apps, here's a tip, create a Vevo account on vevo.com and create a music video playlist and through the amazon fire TV and the Vevo app you can host a super fun party.if you have a Kindle HDX you can use it as a second screen and jump movies you're watching from your tablet to the fire TV, or use x-ray on the HDX while you're watching movies to learn everything about the movie.Kindle Fire TV game controller available, amazon gaming is very new so there are not many games, but Amazon is climbing the entertainment ladder fast and will most definitely soon have a huge selection of fun games.", "verified": true, "helpfulness": "3/3", "author": "Dork Cameleon"}, {"rating": 5.0, "review": "This brought together all of my entertainment needs; i also downloaded the Plex App for my media i have on another computer to stream it onto my FireTV. So much better than the AppleTV I initially had.", "verified": true, "helpfulness": "2/2", "author": "NHarper"}, {"rating": 3.0, "review": "Works alright, but I find the small print and crowding of cover photos a bit hard to negotiate through. I don't understand why the makers of this device don't utilize the entire screen to convey visual information. I have a large HD TV and if I can't read the info, what in the world do folks with even smaller receivers do; pull up a chair and put their face against the screen? The quality of the video is fine and once I manage to find what I want to see everything is acceptable. Perhaps with patience, perseverence and practice it'all get mo' better.", "verified": true, "helpfulness": "2/3", "author": "Dr. Robert C. Crawford"}, {"rating": 5.0, "review": "First off parts of this product seem a little unfinished. It does cover the basics of netflix, amazon prime, and hulu. It already offers more than my chrome cast that has been around for several months now. I typically expect a product to not run perfectly if I am an early adopter.This device has ran like a dream however. I haven't seen any lag in the interface and the apps load instantly. I look forward to when netflix is integrated into the voice search , but it is so easy to navigate thru the apps especially when compared to say a firstgen or secondgen roku.I was also pleasantly surprised to find that I could cast videos to it from YouTube. The main thing I liked about my chromecast was this feature.Another point the remote has to be my favorite remote. It was irritating to have to add another remote but at least this one is good to hold. I like the grippy back and it seems to be the perfect size. Also just the right number of buttons enough to control everything but easy enough for me to already have memorized them. And the voice search is amazing normally my hick accent isn't understood. Siri just isn't down with what I am saying. I don't know where amazon came from with this one. It hardly ever misunderstands me. It's to the point I say netflix and pandora just to open the apps rather than scroll to find them.Overall I think this is an excellent product that shows great promise. It already is the set box to beat in my mind and with further updates which amazon is good to do it will be a great product. I was a little concerned paying 99 dollars for yet another box but it was definitely worth the purchase.", "verified": true, "helpfulness": "6/6", "author": "Tom"}, {"rating": 1.0, "review": "The voice recognition feature is good and works well but I do not like the way the scrolling action works.As one scrolls through programs the \"highlighted\" item is enlarged and this, I find, creates nausea similar to motion sickness, particularly on a large screen TV.With my ROKU the programs remain the same size and the highlighter scrolls across, which I find is easier on the eye.So the Amazon Fire goes in the drawer with all my other hardware disappointments.", "verified": true, "helpfulness": "4/22", "author": "Michael O \"Michael O'Brien\""}]