[{"rating": 5.0, "review": "I find it perfect for mobile streaming. The only thing missing is the open sdk for developers to create apps for it.", "verified": true, "helpfulness": "0/0", "author": "Emanuel Abrantes"}, {"rating": 5.0, "review": "Google always surprising us!Excelent product, easy to install and to use.  Capture easily the wifi signal.Hope Google adds another apps", "verified": true, "helpfulness": "0/0", "author": "Marcio H. S. Andrade \"Biomedical Equipment Course Coordinator\""}, {"rating": 4.0, "review": "Have to be more patient as apps get compatible with the device,DNS hardcoded into device so won't get netflix unless they let you.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Tan"}, {"rating": 4.0, "review": "It would be nice to stream content from local (network atached) storage. But besides that it's a verry nice device.", "verified": true, "helpfulness": "0/0", "author": "jeroen van gemert"}, {"rating": 5.0, "review": "Works good. Great for when I travel. Must have for travelers. Easy to set up and use. Hulu is a nice addition. Can't wait for Amazon video", "verified": true, "helpfulness": "0/0", "author": "Jess R Marshall"}, {"rating": 4.0, "review": "I'm casting from my Windows 8.1 laptop using Google Chrome and it simply does what it says it will do. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent picture quality and full hd 1080p clear video google chromecast surpass every other streaming device in the market by best picture quailty", "verified": true, "helpfulness": "0/0", "author": "Muhammad Gulraiz"}, {"rating": 5.0, "review": "No complicated mumbo jumbo- plug it in, select the name and the wireless network and with a few taps on the tablet, the chromecast is all set up and ready to stream to the TV.  Right now its only YouTube that streams ( Since I am not in the US), hulu and netflix are not available outside the US, but I see google adding more apps that could use this device. Great price too", "verified": true, "helpfulness": "0/0", "author": "Sunny \"Sunny\""}, {"rating": 5.0, "review": "Perfect for watching online content on my TV.  I love that it has CEC support and will turn on the TV and change inputs when I cast something from my smartphone or laptop.  I hope to see more functionality and apps added in the future, like for instance the ability to cast the photos or videos on my smartphone to the TV, but given that this device only costs $35 and adds smart features to my otherwise dumb TV it definitely deserves 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Aleksandr Gidenko"}, {"rating": 4.0, "review": "I watched youtube and it shows up very clear I am very impress with watching programs on the Tv big screen. You just have to keep down loading different apps other than that its great if you have a good internet connections. Take your chromcast anywhere you go hotels and out of town,", "verified": true, "helpfulness": "0/0", "author": "nina"}]