[{"rating": 3.0, "review": "I thought I would be thrilled with this, however do your research as to what it actually can do, and what it can not do.I am disappointed. Even though the price is relatively low, I would rather pay more to get more. Sony, WD, Roku, all have similar devices , but not exactly. Please, before buying , do check out what this unit is capable of and specifically what it is not intended to do.", "verified": true, "helpfulness": "0/0", "author": "NaturesKid \"natureskid\""}, {"rating": 5.0, "review": "Works really great.  Very easy setup.  Reasonable price.  I recommend to anyone who wants to stream to a \"non-smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "Ken in Murfreesboro TN"}, {"rating": 5.0, "review": "The advertisement for this product was on the spot. It works well and the price is excellent and boy does it save pulling out cables and connecting the laptop to the TV", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "it worked good for a month or so, but then it got missed up. It always says \"no cast devices found.\" I sent feedback and tried to fix it but nothing changed. In addition to that, you only can cast from Netflex and Youtube which is kind of good. However, when it first came out, you could cast videos and files from your cell phone and laptop. They canceled that features.", "verified": true, "helpfulness": "1/2", "author": "Hassan Ibrahim"}, {"rating": 4.0, "review": "It works great. Video quality is very good. Easy to use. I would have given it 5 stars except it doesn't let me stream video or pictures I have stored on my computer. Overall a good product.", "verified": true, "helpfulness": "0/0", "author": "Joe Mercer"}, {"rating": 3.0, "review": "I love the size and wireless streaming from my phone/laptop, but the limited uses (Netflix, Pandora and Chrome) make it really more of a novelty item.  Hopefully they strike some deals soon to increase the useability of this device.", "verified": true, "helpfulness": "0/0", "author": "Tony Davis"}, {"rating": 5.0, "review": "Chromecast is awesome.  It's super lightweight and has minimal load times. It's surprising how convenient it is to control your Netflix and Hulu shows from your touchscreen device of choice.", "verified": true, "helpfulness": "0/0", "author": "Daniel Bryant"}, {"rating": 5.0, "review": "This thing is so simple , a cave man can do it. And for under $50 bucks, what more could you saw ask for. :)", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 1.0, "review": "BEWARE, this product does very LIttle and not very WELL.  If you have a SMART TV you do not need this ITEM until they Google updates it to cover more movie sites like HBO GO, XFINITY.  All you get is Netflix (and YouTube) so if you use a roku or xbox ect, you are better off staying with those.  You can only stream from Google CHROME browser (not my favorite).  It is Jerky the Audio and Video are off.  If you WANT YouTube and do not care about Quality then this is perfect.  If you have a smart TV all of that is likely included. I am disappointed. PRO:  It is easy to install!", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "I love this thing. I now have 3 . I use it with my iPad and android to watch netflix and YouTube easily on my tv.", "verified": true, "helpfulness": "1/1", "author": "Dennis Dick"}]