[{"rating": 4.0, "review": "This product can go head to head with the apple tv and leave it in the dust because it can do almost everything as the apple TV and also some extra. It doesn't take up space net to all your other boxes and it only costs 35 dollars. This has been out for a pretty long time and lots of it's features are still in beta, but they are adding a lot of things as well. It is very easy to use and set up, all you need is a phone or computer and WiFi. I had to take off a star because of all the beta things after being released in mid 2013. But over all this is a must have product for every one without a smart TV but doesn't want to upgrade.", "verified": true, "helpfulness": "0/0", "author": "Anik P"}, {"rating": 5.0, "review": "People who know I have bought this ask me what it is and honestly I have a hard time describing it other than directing them to the product description. What I can say is that it works almost flawlessly and when people watch me use it they immediately ask me how much it is. They are shocked at how inexpensive it is. I use the word \"inexpensive\" because it is not \"cheap\". It is high in quality and low in price. I believe this product and others like it are leading the charge in a change in how people use their televisions. BYE BYE S**T CABLE!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Quesnel"}, {"rating": 5.0, "review": "very good.", "verified": true, "helpfulness": "0/1", "author": "Donald R."}, {"rating": 2.0, "review": "Using your phone as a remote blows. Get a fire stick, roku or Apple tv.", "verified": true, "helpfulness": "2/3", "author": "SFM"}, {"rating": 4.0, "review": "Doesn't support 5 GHz wifi! Another problem is i have not much use for it, since i have a Smart TV. Still price wise, it is a pretty good product.", "verified": true, "helpfulness": "0/0", "author": "Dachuan"}, {"rating": 2.0, "review": "no comcast/xfinity app available", "verified": true, "helpfulness": "0/1", "author": "Andrew M Reiter"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Stuart McKenney"}, {"rating": 5.0, "review": "Very nice, you can connect very easy and make your old tv become a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Azuil Júnior"}, {"rating": 5.0, "review": "Does what it says it does.  I don't use it much; but, when I need to quickly stream from my computer or Android phone, it works flawlessly now since the day I bought it shortly after they were first released.  Don't have the problems hooking up as some experienced, don't know why; perhaps as a computer IT guy, I just knew how to set it up as directed.  Not a necessity, but, it's nice to have when you need it. As long as it's told the right network, auto detected just fine!", "verified": true, "helpfulness": "0/1", "author": "Chip Cooper \"Cyberchip\""}, {"rating": 4.0, "review": "Pretty good at streaming pretty much whatever you want if you can get it on your phone you can get it on your tv mine recently started action up but i think it might be the tv i hooked it up to because it only does it on that one oh and btw this thing heats up like crazy afraid to touch it if i wanna move it to a diffeent room", "verified": true, "helpfulness": "0/0", "author": "Kyle monismith"}]