[{"rating": 5.0, "review": "I absolutely love this product. It was extremely well packaged. It was a breeze to set up and connect to my wireless network. I have downloaded several apps for watching other shows besides my Prime choices, such as SlingTV which offers me ESPN, TNT, CNN, TBS, Foodnetwork, ABCFamily. I've been looking for a way to dump cable. It is too expensive and they tell me what I can watch versus be choosing what I want. Between Amazon Prime shows, the apps for SlingTV, Hulu (haven't tried yet), Netflix (haven't tried yet), YouTube, and others I am perfectly happy and will save a lot of money. The FireTV gives rapid response to my choices, no buffering. Overall a great connection, response, and beautiful display. The voice remote is great and hasn't misread my requests yet. I use Amazon cloud for storing pictures and found that my screen saver for when I pause shows can be my own pictures shuffling on screen. Some older reviews say you can't find prime specific shows but I've had no problem with that - maybe it was an update, but you can easily do so, it is actually a choice. Also, I can choose to put shows in a watchlist to go back to and select from at a later date. Should have bought it sooner, glad I have it now. Don't hesitate to buy.", "verified": true, "helpfulness": "1/1", "author": "SP"}, {"rating": 5.0, "review": "So many movies an tv shows to chose from! I love that there is no buffering! Couldn't b happier!", "verified": true, "helpfulness": "0/1", "author": "Jessy"}, {"rating": 5.0, "review": "works like a charm", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Well It worked great for the first couple of weeks then just went belly up. I will no longer power on.  I'm chatting with CS now. If they replace it I will let you know, if not I will definitely let you know.", "verified": true, "helpfulness": "1/2", "author": "Stephen Herald"}, {"rating": 4.0, "review": "I hope Amazon continues to upload more content (couldn't find Perry mason) still needs more.Great amazing device though, easy to use, needs to have an off switch.", "verified": true, "helpfulness": "0/0", "author": "Mow and Devon's kindle"}, {"rating": 5.0, "review": "Looove this tv.", "verified": true, "helpfulness": "0/0", "author": "sherita"}, {"rating": 3.0, "review": "I originally bought 2 of the Fire Sticks but one was messed-up when I got it and while waiting for the two sticks...I was reading about the Fire TV which I liked the set up better and the voice thing sounded kinda cool...for about three minutes...Since I just wroteg a review about the Fire Stick before this review...I'll just give the basic word of caution.One of the reasons I bought these sticks...whatever.I thought.was actually saving me money on the difference in the cost of a Smart TV and the cost of the stick (hey, as much as $200-300.00!. And hey...no subscriptions for a lot of it.BIG BAD \"MUST KNOW\" FOR COMCAST PROVIDED!Comcast is the only holdout who will not allow the HBO2GO streaming...the only one. They are also blocking it on PS3 & PS4.Oh, oh, oh...I forgot to mention that you to (if you use the OneClick)... stop it immediately!! My cats ordered three movies while I was at the store because I left the remote on the sofa and if you don't \"logout\"...a few pressured steps with no time limit on inputting information allows my party pussys to order the movies BUTTTTTTTTTTTT because there is another step which actually requires the mouse or whatever to be moved and follow a command allowed me to cancel so de-activate!I am on the fence about the pluses and minuses,IF....  you have  one tv that is NOT in an area where other electronics are on, etc. then it's good because the stick is wireless...you'll love it.IF...  you have the surround sound, CPU, router, modem...yadda, yadda, yadda in some \"entertainment center then the ONLY way to go is the Fire TV...awesome signal with an HDMI connection with its own box and direct connection with ethernet making for awesome speed in connecting to the ridiculously endless array for programs, news sources (video blogs, issue groups. It has some of the coolest \"where-the-hell-were these programs\" when I was going to school.The voice command is cool but it only works when you're in Amazon Instant or Prime. You can't use it on another site like Netflix.Bottom line is it is a good produce by turning your TV into a SmartTV without having to buy something that most of us don't need (OLD TV's still good) and most couldn't or wouldn't replace UNLESS need be.Stick is perfect for spare bedroom, secondary \"out-of-way\" but for constant connection and WAY less issues get the Amazon Fire TV.Last but not least I actually upgraded from one of two Amazon Sticks I bought. one didn't work. I read one part about the HBOgo which I enjoy through XFINITY I paid the the extra $44+ just to find XFINITY is NOT part of the providers accepted.Another annoying bit is the roller coaster of fast video/slow audio and vise-verse>not listed in the description or Q&A; Forums", "verified": true, "helpfulness": "1/2", "author": "Melani Hughes"}, {"rating": 5.0, "review": "super", "verified": true, "helpfulness": "0/1", "author": "William Polly"}, {"rating": 5.0, "review": "We have been using the Fire TV since the new year. It is awesome. After using several other streaming devices this is the right one for my needs, Gave cable the boot last year and with Fire TV we don't miss it. It is blazing fast (have a direct line from my router) never get the buffering thing from any service. It has a lot of apps and choices for viewing. I am contemplating buying the gaming remotes. This is the future of TV cable is doomed.", "verified": true, "helpfulness": "0/1", "author": "Big Paulie"}, {"rating": 2.0, "review": "When it works its great but continually loses cononnection even thought network setting says good connecction.  No other devices have trouble with connections.", "verified": true, "helpfulness": "0/2", "author": "Steve S."}]