[{"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Daniel Ribeiro Holanda Lima"}, {"rating": 5.0, "review": "Love our Chromecast!  It is a really convenient way to display things from your mobile devices to your TV.  The included access to Netflix and other services is convenient as well.  We primarily use ours though for display of content from our mobile devices.  I feel certain we haven't yet experienced all that this device is capable of, but we have been very happy with it anyway.  We even got one for my Dad.  He loves his too.", "verified": true, "helpfulness": "0/0", "author": "Emily Wilson"}, {"rating": 4.0, "review": "Easy set up, easy to use and portable since I travel a lot.", "verified": true, "helpfulness": "0/0", "author": "remcd44"}, {"rating": 5.0, "review": "Why pay cable prices when this does everything for you. As long as you have some legitimate accounts with Netflix, Prime, etc.... there is no need to have a cable subscription. And for the price.....best buy on the market. Simple. Works Great. Cheap. Won't let you down.", "verified": true, "helpfulness": "0/0", "author": "Dave Mahoney"}, {"rating": 2.0, "review": "Took us a while to get it working with our iMac, and we never got it to recognize the Macbook. Our biggest beef however, is that it only works with Google Chrome and Netflix doesn't run on Chrome! We watch about 80% of our streaming content through Netflix, so it's kind of pointless. We've kept it for 3 months but after the first few weeks we just sort of put it aside and lost interest. Maybe someday we'll find another use for it, but who cares?", "verified": true, "helpfulness": "0/0", "author": "Spindle Books & Records"}, {"rating": 5.0, "review": "Awesome product for a great cost.", "verified": true, "helpfulness": "0/0", "author": "scholzyy"}, {"rating": 5.0, "review": "We've had two Chromecasts since the day they were released in the summer of 2013, and absolutely LOVE them. A simple device like this puts you in control of the content you want to watch, from YouTube, to Netflix, Pandora, Google Music, to screen mirroring for games. It's especially useful if you're a cord cutter who doesn't subscribe to cable TV.There's really only a few things not to like about the Chromecast, which I'm sure will be fixed in forthcoming updates:1) There's no 5Ghz wireless support yet, which can be an issue in congested 2.4Ghz areas.2) It's a little slow to startup, connect and switch streams sometimes. Hardware update should help here.3) KIDS can wreak havoc when they're all fighting to watch different things. An ADMIN / PARENT mode is sorely needed.", "verified": true, "helpfulness": "0/0", "author": "Jason Farrell"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Faisal Abbas"}, {"rating": 3.0, "review": "I bought this for my kid's room so they could watch Netflix and stuff. Set up was a breeze. However, I never actually got it to cast anything because their chromo tablets and zinger zte phones aren't compatible with the chromcast and I'm not handing them my iPad or iPhone in order for them to watch their tvs. I just bought them fire sticks so hopefully that will work  better for them plus we have prime and several movies in the Amazon digital library so I think that will work out. I guess I should have done more research to make sure that their tablets and phones were compatible so it is really my fault that I bought 2 of these and they aren't compatible. I'm sure it's a cool little gadget which is why it got a 3 star review instead of a 1 star even though it doesn't work for us.", "verified": true, "helpfulness": "0/0", "author": "C. Paul \"- Tina\""}, {"rating": 5.0, "review": "I love this Chromecast! Of course, once I received this one, I found the one that was 'misplaced'. Now I have 2! That makes it double awesome!", "verified": true, "helpfulness": "0/0", "author": "R Harmon"}]