[{"rating": 5.0, "review": "Love Chromecast. Would be nice to be able to control output to change the aspect ratio, but I guess that is expecting a lot. Can be used with a conversion device (HDMI to RCA) to allow it to be used on older TVs that have no HDMI inputs. Nice that it can be controlled from smart phone, laptop or tablet.Works to broadcast almost everything you can see on your laptop, to your TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it works very well", "verified": true, "helpfulness": "0/0", "author": "John W. Peterson, Jr. \"johnp4191\""}, {"rating": 5.0, "review": "Love the chromecast.  With more and more app support, it can only get better.", "verified": true, "helpfulness": "0/0", "author": "fobster"}, {"rating": 3.0, "review": "Ok, I purchase this on Nov 2014, and it broke down just a few weeks ago. Don't get me wrong, I love this device, but unfortunately it did not last long. As for funcionality it works great, you can cast almost anything you have on the phone, tablet or laptop. Setting it up is very simple and quick, you just need a device, a wifi network and a TV that accepts HDMI (I think most, if not, all of them do now) I used it with my Moto G mostly and then with my Blu Life One. With the original apps you can cast youtube, netflix and other more, and for browsing only Google Chrome, but, using third party apps you can do a lot more like watch videos, photos and music in your TV. I already bough another one for replacing it and also an Amazon Fire Stick to compare them, I will try to have the review for it later this month. So in general, am I happy with the product? YES! of course, it was too bad that it did not last that long. Hope this helps on your decision.", "verified": true, "helpfulness": "0/0", "author": "Santiago Sack"}, {"rating": 5.0, "review": "Works perfect", "verified": true, "helpfulness": "0/0", "author": "Steve contreras"}, {"rating": 5.0, "review": "Great price! The best part however was teaching the spouse to see her phone pics on the TV/", "verified": true, "helpfulness": "0/0", "author": "Craig Scudgington"}, {"rating": 3.0, "review": "I bought into the chrome cast frenzy and I have to say, if I was an android lover I think I would like it more... I find it hard to use with my iPhone and iPad. I can broadcast from my laptop which is cool because I can still browse without interrupting the show but other than that I think I should have held back on this purchase. Definitely do your research before buying!", "verified": true, "helpfulness": "0/0", "author": "Kara Burden"}, {"rating": 5.0, "review": "I bought this to replace my Roku 3.Since am only using it for Youtube and DramaFever, it works great.Better than Roku 3 actually as i don't have to manually switch app on the controller.Just select through my phone and its on the TV!Also Dramafever runs better with the Chromecast than the Roku. Seldom drops out or lag.My Roku 3 often hangs and remote times out after some time and I have to do a hard reset which is annoying sometimes.The only down side so far is that you need to be a Premium member of Dramafever to watch it on Chromecast, whereas Roku can watch it for free with ads", "verified": true, "helpfulness": "0/0", "author": "Gan Tze Shen"}, {"rating": 5.0, "review": "I got 4 of these dongles and they are very good.  All my dumb tvs are now smart tvs.", "verified": true, "helpfulness": "0/0", "author": "Mr. Gill"}, {"rating": 1.0, "review": "Very disappointing.  Very difficult to use and connect with wifi on our Mitsubishi TV.  It is still connected but we have not been able to use.  Sad.  Too complicated if yo u are not a geek.", "verified": true, "helpfulness": "0/0", "author": "Linda C. Gorby"}]