[{"rating": 4.0, "review": "You must have a good Wi-Fi signal where You are watching, otherwise it will show a loading Message all The time.", "verified": true, "helpfulness": "0/0", "author": "Silmara"}, {"rating": 5.0, "review": "Easy to set up and use. Works as described.", "verified": true, "helpfulness": "0/0", "author": "Usefull"}, {"rating": 5.0, "review": "Adds a lot of functionality to my old TV that support HDMI.  Chromecast didn't work well with my WiFi router that Comcast rents out.  Switching to a different router fixed the connectivity issues.  The TV automatically turns on when I stream a program through Chromecast.", "verified": true, "helpfulness": "0/0", "author": "MK"}, {"rating": 4.0, "review": "I've had Chromecast for a few months now. I like it, but I can't say that I love it. I use it primarily to watch Netflix. I haven't had much luck with any apps to play video files off my computer (no VLC for a Chromebook). I find it annoying that Neflix stops after each episode, instead of going right in to the next episode. I'm a binge watcher, so this is very annoying to me. The pictures that appear on the screen when nothing is casting to the Chromecast are awesome though, so really cool nature shots. Honestly, the fact that I have a Chromebook with no good program/app to watch video files really limits my options with the Chromecast. This may work better with another system.", "verified": true, "helpfulness": "0/0", "author": "Chelsea Therneau"}, {"rating": 1.0, "review": "Hardly worked when I bought it, once it stopped working, Google was supposed to replace it but never did. It's been pulling teeth trying to get them to replace it.", "verified": true, "helpfulness": "0/0", "author": "nathan l shaw"}, {"rating": 5.0, "review": "Fairly easy to set up and then fabulous piece of tech.", "verified": true, "helpfulness": "0/0", "author": "B. Schilling \"Maddie Zorn\""}, {"rating": 5.0, "review": "I've had two units for a couple of years. I swear people are idiots. This will probably get pulled. This is soooo easy to use. I started to read the 1000 some questions and most of the ones I got thru were written by complete idiots !!!!It is plug and play and if the usb on the tv doesn't work as one of mine, you just plug it into a cell phone charger plug.This disease seems to be everywhere !!!!!I have a bunch of electronics and I am not of the electronic age group and unless something is broken they all work as advertised on Amazon or eBay !!!!The problem is apparently people don't read instructions. Or they are from some tribe that hasn't yet had outside human contact !! I guess that's all I have to say about this product, but it applies to just about anything you buy to make your life easier or hard in some cases!!!", "verified": true, "helpfulness": "0/0", "author": "caz"}, {"rating": 4.0, "review": "Best with an android phone. Wish it had a physical remote sometimes when the phones screen is off.", "verified": true, "helpfulness": "0/0", "author": "John W. Anthony \"LA Tech\""}, {"rating": 4.0, "review": "Love it works awesome with YouTube and Netflix! Wish it would mirror display from mobile devices and all of desktop on the computer! Now it will mirror main info on chrome search engine with the chrome cast plugin. It will mirror everything on chrome search engine with lag.", "verified": true, "helpfulness": "0/0", "author": "Kaleb"}, {"rating": 5.0, "review": "Works great, perfect for netflix and other streaming sites if you don't want to buy a roku or other expensive media middlemen.", "verified": true, "helpfulness": "0/0", "author": "Steven"}]