[{"rating": 5.0, "review": "I rated the product based on the ease of setup & use...so far.  I received it in the mail today. It only took 5 minutes to install & get going. After the automatic program update, I was watching Netflix in no time! I think I'm gonna love it!!", "verified": true, "helpfulness": "0/0", "author": "Sandra Cunningham"}, {"rating": 5.0, "review": "The Google Chromecast is an excellent replacement for a Roku or something similar as long as you only use the main apps such as Netflix and Hulu.  Anything made by Google seems to work so well and efficiently and the chromecast is a great example of this!  It is super easy to setup and works just as expected.  Can't wait for more apps to become available.", "verified": true, "helpfulness": "0/0", "author": "L. Klimek"}, {"rating": 1.0, "review": "This does not work with all wireless routers such as Verizon's as they lack Universal Plug and Play (UPnP).  So if your router doesn't support this function, Chromecast will not work with other wireless devices like an IPad or IPhone.  Check your router's tech specs or go to Google's support site to see if your router is compatible.  If not, don't buy this!", "verified": true, "helpfulness": "1/2", "author": "Pamela E Cox"}, {"rating": 1.0, "review": "Seems like people just like to gush over anything Google. Well this thing does NOT work as advertised. I suggest before buying and rather than reading all this glowing reviews, you go check the google groups for this product first. Look at the number of unanswered questions there.Chromecast is at best in ALPHA, even though google itself calls it a BETA release. It is not ready for production. I am not sure why they released it to the masses.1. Installation is a nightmare. Took me about 3 hrs and 3 different PC/Laptop combinations to install through one PC. Even then, the other 2 machines did not see it on the SAME WIRED network. One thing I thought was funny was the number of times I got the \"Uh-oh moment\" error which basically means \"we are as confused as you are.\"2. Bought this to replace an old laptop I had hooked up to my TV. thought it was less bulky and I loved the id of Tab Casting. I though I could cast amazon prime shows using that. Well, any site I tried casting (other than the 4-5 sites like youtube, netflix etc that are optimized to work with this thing) FAILED to cast. I would get a still image of my PC on TV. Thought it was my Flash Player as most these sites have embedded flash content. Uninstalled and re-installed flash but nope that wasn't it. Called google support. Below is the system req they SAY you need for tab casting [...] Phone support did not know this. They told me 'tab casting does not work.'3. Finally after posting to the google groups someone was kind enough to admit this product is not ready fro primetime. The only tab casting supported is on one particular Chromebook machine and nothing else!If you need to cast Youtube videos on your TV then I guess this is great. Otherwise, stay away", "verified": false, "helpfulness": "0/1", "author": "F. Abedini \"critique\""}, {"rating": 5.0, "review": "Works perfectly with my Samsung smart TV. You can play YouTube from your iPhone/iPad, and video from a lot of apps too. Works even better with Chrome on a PC. For example, want to watch an episode of that CBS show you missed? Go tot he CBS website on your Chrome browser, and it'll play on your TV, If you want to play videos on your TV without any cables, get this,", "verified": true, "helpfulness": "0/0", "author": "G. S. Peres \"Gui Peres\""}, {"rating": 5.0, "review": "Love it#1 it is fast, the streams typically have no lag.  On my Nexus7(2013) often youtube is so slow to the point I cant watch it.  On the Chromecast is goes just as fast as watching it on a computer.  No lag and loading#2 It is easy.  Just simply click the chromecast button at the top of the desired app(that supports chromecast) and it shows up on your tv.#3 It is extremely portable.  You can take this anywhere and it takes up no room.Its a great service that continues to add great support.  HBO GO was recently added and works greatI now rent movies on Google Play as opposed to amazon, dvr, etc..  Why? Because I always have my tablet or phone with me, so if I want to finish watching it on the go I can.", "verified": true, "helpfulness": "0/0", "author": "coastal"}, {"rating": 5.0, "review": "I love this! It is easy to use and convenient for watching shows in other rooms when there is nothing on cable.", "verified": true, "helpfulness": "0/0", "author": "Jennifer J."}, {"rating": 4.0, "review": "This product is exactly what Google claims it to be. An inexpensive HDMI streaming media player. There is a notable drawback in that the device is mostly limited to playing the apps that have been approved/integrate by Google. This isn't something to take a star away for though, just something to note for people that want to buy this over devices that are 2-3x as expensive but offer more variety.The ChromeCast -does- come with the option to cast from a computer's Chrome browser tab, but in my experience casting from a tab is usually very laggy unless I bring the resolution down to the point where it is obviously pixelated and low-quality.The reason I took away a single star is because the Chromecast Netflix app does not automatically play next episodes as it does on my phone or computer (this may be Netflix developers at fault more than anything) and because Google has pointedly halted third-party developers from being able to develop chromecast apps for lesser known sites. One notable instance is a third-party developer that made an app to allow one to cast videos/pictures stored on mobile devices. Google update Chrome software, that app and any like it stopped working, and the development kit is limited to just a few vendors now (though Google promises to open it up to all developers shortly).In short it is as my subject line indicates. The Chromecast is worth the $35 for Netflix, Youtube and Pandora (Hulu and HBOGo if you have it), but it isn't perfect.", "verified": true, "helpfulness": "1/2", "author": "Carlos R. \"supernal\""}, {"rating": 2.0, "review": "All hype - no content.  You have to use Chrome browser, Netflix, or YouTube.  spend the extra cash and get a Roku.", "verified": true, "helpfulness": "3/4", "author": "Matt"}, {"rating": 3.0, "review": "It's not very impressive.  Once my IPAD goes to sleep, the movie on the TV screen keeps going, and I can no longer control it from the IPAD.  If I only watch half the movie, I usually have to try to figure out where I was when I stopped.  For netflix, Apple TV is head and shoulders above this product.", "verified": true, "helpfulness": "0/0", "author": "Winelover \"Wine lover\""}]