[{"rating": 4.0, "review": "Works great streams great.  I was even able to drag and drop my avi files into the url bar and watch them on my tv no problem. Love it!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Caudillo"}, {"rating": 5.0, "review": "Does what it is supposed to do.", "verified": true, "helpfulness": "0/0", "author": "Kitopal"}, {"rating": 5.0, "review": "I really like it, it's very useful when you try to stream something from your phone, tablet or laptop and it is really easy to set up and works with all android flavors which is really good if you have different types of gadgets.", "verified": true, "helpfulness": "0/0", "author": "Felipe"}, {"rating": 5.0, "review": "I love it.  So much fun to be able to watch anything from YouTube to Netflix on the big screen.  And so easy to install.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Nevadagrrl"}, {"rating": 4.0, "review": "as advertised, bought anther one on cyber monday infact", "verified": true, "helpfulness": "0/0", "author": "yefan ma"}, {"rating": 2.0, "review": "Although the idea behind the product is pretty cool, I was expecting quite a bit more from it. I was under the impression that the Chromecast came pre-loaded with apps such as Netflix that allowed me to watch my movies/shows without the assistance of my laptop or phone. This may be because I have only played with it for a few minutes so if someone else can give me some help with figuring that out, I may like it a bit more. Also, I am not sure if this is my TV or the Chromecast, but for some reason, my TV seems to switch inputs after awhile and switch to the next input. It's never done that before, so I am not sure if it's the Chromecast disconnecting or something like that. I also don't like that the Chromecast has to be plugged in to both the wall and into my TV. That's kind of a pain as well.", "verified": true, "helpfulness": "0/2", "author": "Alisa Bennett"}, {"rating": 4.0, "review": "Works well. It does require the additional HDMI extension plug that came with it for it to work on an older Sony projection TV (60\").There's just a lot of stuff Google could improve which would make the Chromecast better.Sometimes it's really slow when it comes to loading a Youtube video -- and this is when it's about 2 ft away from the AT&T; router.Also, some video files seem to have no sound when casted through Chrome (most up to date version of both Chrome & OS X).Some videos hiccup for a split second in visually intense scenes -- even on 480 videos.I wish there were other ways to control what I'm casting. Right now, when I cast form device A (for instance a Macbook), only device A gives me control over the casted content.I'd like to be able to control pause/play/volume etc. (or even better simply control the entire casted content) via my Android phone. It can't be that hard for Google to develop a Chromecast remote control app (like RemoteCast).", "verified": true, "helpfulness": "0/0", "author": "R. Siekmann"}, {"rating": 5.0, "review": "It took a few days for firmware to be updated and until then some functions didn't work. After the firmware to be the latest version, it works excellent. Very convenient to cast from Smartphone for Youtube, Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Yoshinori Ikarashi"}, {"rating": 5.0, "review": "Family loved it!", "verified": true, "helpfulness": "0/0", "author": "Paulo Borlongan"}, {"rating": 5.0, "review": "useful", "verified": true, "helpfulness": "0/0", "author": "Pal Mick"}]