[{"rating": 5.0, "review": "Love it! Finally cut the cable. Saving $63 a month.", "verified": true, "helpfulness": "1/2", "author": "Katrina Coker"}, {"rating": 5.0, "review": "This adds more to my prime membership.  Very easy to connect and use.  I am already a strong supporter of Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Fred & Laurel"}, {"rating": 1.0, "review": "The product arrive in good time, was easy to setup and worked very well out of the box, BUT what AMAZON did not tell the public is that you have to PAY for every TV SHOW or MOVIE that you will want to watch or join their AMAZON PRIME, if you do not PAY, you cannot PLAY", "verified": true, "helpfulness": "1/12", "author": "andre"}, {"rating": 5.0, "review": "Its an awesome little product. 5 days after i got it the price dropped 15 bucks.", "verified": true, "helpfulness": "0/1", "author": "Jesse Hawk"}, {"rating": 5.0, "review": "easy as pie to set up.  simple remote.  life is good.", "verified": true, "helpfulness": "0/1", "author": "Customer 31"}, {"rating": 3.0, "review": "Manufacturer made a big deal about USB port which found to be useless to the end userSo many good apps available to work on any other android device but not for the fire TV", "verified": true, "helpfulness": "0/0", "author": "Eddie Abdola \"Eddie\""}, {"rating": 2.0, "review": "We love our Fire, however be warned if you are even THINKING about getting rid of Netflix and even cable (we were since everything seems to be on Prime) DON'T DO IT!!!!!! We love Doctor Who and just found out TODAY with NO warning that Doctor Who is no longer included with Prime along with many other BBC shows. Thankfully Netflix signed (for now) and we didn't get rid of it! It's such a shame because we were looking at getting rid of cable all together, but no longer. We didn't buy the other 2 Fires we needed to make the switch and kept our Netflix! Thanks for the heads up Amazon, we normally love you, but the way this was done was ridiculous.", "verified": true, "helpfulness": "4/8", "author": "Melissa"}, {"rating": 2.0, "review": "Arrived DOA.  I guess that's what I get for trying to save on a refurb.  Tech team sent out a replacement.", "verified": true, "helpfulness": "1/1", "author": "Jay E."}, {"rating": 5.0, "review": "Amazing Product! Amazon is and always will be one of the best companies on the planet -  No more expensive worthless cable for me!", "verified": true, "helpfulness": "0/1", "author": "Vito V"}, {"rating": 4.0, "review": "Trouble googling it up as TV did not have enough ports. In use it is great. Wish it had column control.", "verified": true, "helpfulness": "0/0", "author": "Jackie \"Jackie\""}]