[{"rating": 5.0, "review": "Love getting off of cable on living room TV!", "verified": true, "helpfulness": "0/0", "author": "Synses \"Synsz\""}, {"rating": 5.0, "review": "I had purchased a Roku TV streaming device, and was quite happy with it. Then my older brother bought a Samsung smart TV, but wasn't sure how to use the smart features, so I bought him a amazon Fire TV device, he's 79, so I hooked it up for him as he is not technically adept. It was doing fine, but his son came over and told him that he already had all the features on his smart  TV and didn't need it. So since his son is so VASTLY more intelligent than i... ( everyone is more intelligent than I am according toy  brother).At any rate, he gave the Fire TV back to me. I had just bought a new smart TV as well, but I used the Fire TV on my Smart TV, and I love it. There are so many more features available with the Fire TV option. First run movies with reviews, CC options and of course the IMBD options. I find it fascinating to read up on the characters and directors. As well as the reviews and \" also watched\". I have over 1500 movies and series in watch list. I do use z Netflix once in a while, but I primarily use Amazon, and shop with Amazon Prime, which is another wonderful perk of Amazon.Keep up the good work Amazon! Love your style!", "verified": true, "helpfulness": "1/1", "author": "Wendy"}, {"rating": 4.0, "review": "Freezes when watching Hulu, and I have to reboot several times to get playback to start up again, which is the main reason I purchase the streaming device. Also sound quality goes in and out and be really bad and stereo sounding even so. I have hooked up device with both HDMI and fiber optic cable, still the same inconsistent sound quality. Device looks sleek and remote works great!", "verified": true, "helpfulness": "0/0", "author": "Victoria Gbenoba"}, {"rating": 5.0, "review": "I'm starting to prefer my Amazon Fire TV. There's a nice selection of apps and games and it's pretty easy to use. I also like that you can side load different things that aren't featured as compatible with the Fire TV. What sets it apart is the voice control. Just speak and it finds what you're looking for.And this Refurbished Amazon Fire TV looks and works like brand new.", "verified": true, "helpfulness": "1/1", "author": "Bill W \"Bill W\""}, {"rating": 4.0, "review": "For a simple little device gives great value for your dollar.  Defiantly beats paying cable.  And with Netflix and ability to use Internet I have quickly come to love this option.  Gives great basic and options for more.  Add the anteana on which gave me a lot more unexpected free channels and you can't go wrong.  I don't know how many times I flipped through channels looking for something to watch, or ended up watching the same old thing.  Really, you want me to pay greatly for that....no more....", "verified": true, "helpfulness": "1/1", "author": "Kimberly Younger"}, {"rating": 5.0, "review": "I absolutely love Amazon Fire TV! We cut the cord with all cable companies bought antennas for our local channels and use the Amazon fire for sling TV Netflix Hulu and various other apps.", "verified": true, "helpfulness": "0/0", "author": "H. Davis"}, {"rating": 5.0, "review": "Great! Fast and good user layout. Love the phone app for when I can't find the remote.", "verified": true, "helpfulness": "0/0", "author": "Tasha"}, {"rating": 5.0, "review": "I love this product! It has so many choices! A lot of the movies are included in Amazon Prime account. I might be stopping my cable because this item seems to have it all!", "verified": true, "helpfulness": "1/1", "author": "Karen"}, {"rating": 5.0, "review": "Outstanding, better than I thought it was going to be!", "verified": true, "helpfulness": "0/0", "author": "RH"}, {"rating": 5.0, "review": "Works just fine. To me...Fire T.V. is much better than Netflix, Hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "LAWRENCE W. WENDT"}]