[{"rating": 4.0, "review": "The price was right and I got the extra $6 google play credit. So I jumped at it. Even got another one for a family member. Works great for You Tube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jamerz"}, {"rating": 2.0, "review": "Product did not meet my expectations at all. It was not what I was looking for! It will only cast youtube, nothing else on phone can be casted.", "verified": true, "helpfulness": "0/1", "author": "Trupti"}, {"rating": 3.0, "review": "Unfortunately does not work with my router.  Make sure you read up on the issues connecting to your router first", "verified": true, "helpfulness": "0/0", "author": "Tony S."}, {"rating": 3.0, "review": "I had it for two weeks now, and no where is there any help guide.  There was only a small sheet of paper telling you how to install it.But once you installed it, there no instruction to control the shows your watch. In fact there are no controls.  Once Chromecast takes over your Netflix movie, you either have to watch to the end or change your TV source to exit.  There is no option to pause, ff, reverse the video your watching unless I missed something that Chromecast is not letting me know.", "verified": true, "helpfulness": "1/1", "author": "Gadgits"}, {"rating": 4.0, "review": "This product is as stated,  works fine for tv with speakers,  I have my tv hooked up to my stereo system and have no tv speakers.I may have to buy an extra component to allow sound to my stereo speakers. otherwise works fine. small and portable so will be great for my needs.", "verified": true, "helpfulness": "0/0", "author": "Doityourself"}, {"rating": 4.0, "review": "I bought the Chromecast for the purpose of using Netflix (which I didn't have prior to purchasing the Chromecast) and to cast Chrome tabs to watch streaming video of my daughter's college softball games that I can't attend. For the price, this is a really nice way to stream video to your TV, if you don't already own a DVD player with streaming capabilities.The Chromecast forced me to move my wireless router closer to the TV; it didn't connect until I moved the router right next to the TV. This wasn't a huge problem, but it did require that I purchase a wireless extender for another area of the house. It was something that needed to be done anyway, as my family's use of wireless devices has expanded, and the router needed to be in the same area where those devices are most often used. So this is not as much as a complaint as it is something you need to consider.Otherwise setup was easy. I used the extender cord on the Chromecast because my TV has the HDMI ports in an awkward place. I also use the AC adapter for power. I turned off the router to move it after installing Chromecast, and it took a while for the Chromecast to reconnect to the network. At first I thought this could be a problem because sometimes you just have to reset the router. It just takes a few minutes for the Chromecast to find the network again, then it works fine.The Netflix app works very well using both a laptop and smartphone to choose and control viewing. Some video streams better than others, and I wonder if it has to do with Netflix. Some movies play well from beginning to end with no pauses for streaming, while others may need several, and at times, several within a few minutes. So I think this might be a Netflix server issue.The video quality is a little dicey. It may be the difference between HD and non-HD. Watching some TV shows, the video appears to be a little blurry. Movies are better, but at times appear blurry, then sharpen up. Again may be a streaming issue. The sound for both TV shows and movies is not great. I have a soundbar and it helps.I can't comment on any other uses besides Netflix as that is all we have been using it for since installing it on Christmas Day. I am happy with the purchase and look forward to using it often.", "verified": true, "helpfulness": "0/0", "author": "T. McCool \"Musicologist\""}, {"rating": 5.0, "review": "Installed in 5 minutes. I stream my pandora and YouTube videos to my TV all the time now. And the price can't be beat. I bought one for every one in my family.", "verified": true, "helpfulness": "0/0", "author": "LB"}, {"rating": 3.0, "review": "Google Chromecast works just fine, but I'm not sure I see much advantage over a stand a lone devicesuch as a Blue Ray player or Media Player.You have to have your phone or tablet handy to use the Chromecast.The Blue Ray player I recently purchased has software which allows me to view Netflix, as well aswatch my You Tube videos. I can also connect to my home wi-fi and view pictures off of my desktop computer.", "verified": true, "helpfulness": "0/0", "author": "Leo Watkins"}, {"rating": 4.0, "review": "This is a great way to stream youtube videos or other videos to your home TV.  Fairly simple to use and the picture is pretty clear.", "verified": true, "helpfulness": "0/0", "author": "Rochelle Elliott"}, {"rating": 5.0, "review": "Works great! Picture quality is good and signal is good. Works as expected. So good I bought one for my daughter to use at college.", "verified": true, "helpfulness": "0/0", "author": "Eli Lopez"}]