[{"rating": 4.0, "review": "Once you figure out how it works, it works good!", "verified": true, "helpfulness": "0/0", "author": "Bruce J. Simpson \"wrccab\""}, {"rating": 5.0, "review": "This thing works and is amazing!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"watdapuk\""}, {"rating": 5.0, "review": "Works great with the galaxy S5.  MLB.tv Chromecasts to my TV perfectly with no lag.  Will be even better when more apps become available.", "verified": true, "helpfulness": "0/0", "author": "Robert Plummer \"Bob\""}, {"rating": 5.0, "review": "A must have for any hd tv user one time fee for all the shows sports music and slide shows you can handle. I dont pay for cable. 16 bucks a month covers my hulu for tv and netflix for movies. If you want to rent or buy new movies you can cast with Google.  So inexpensive. Who needs cable. I have everything i need for 16 bucks everything else is free. Just get it. You need it.", "verified": true, "helpfulness": "0/0", "author": "nicole batts"}, {"rating": 1.0, "review": "Bought this on November 13, 2013. Easy set up the FIRST time. Then it wouldn't connect. Then it would connect. Back and forth. No changes in my set-up. It was just fickle. I think I watched maybe about twenty hours or so of content. Now it doesn't work at all and I can't return it. Oh well. Amazon has been really great about other issues I have had. I will eat this. Too bad.", "verified": true, "helpfulness": "0/0", "author": "elledebbie \"elledebbie\""}, {"rating": 5.0, "review": "Multiply your expectations. I love these things. They make excellent gifts too. Might even be a good idea to keep one in your pocket so when you go to other peoples houses and throw a youtube party you can use their TV.", "verified": true, "helpfulness": "0/0", "author": "Jeremy McNeal"}, {"rating": 5.0, "review": "I'm always streaming something and will be cancelling cable TV now that I've got the option to stream Netflix, You Tube, podcasts, Pandora, espn3, mls, pretty much anything I need. Plus its super cheap. Sure it doesn't have amazon prime video, but my TV has an app for it so I'm all set.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "Excellent product- ditch cable!", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 1.0, "review": "I received it as a gift.  I'm sending it back.  It doesn't work with Google's own products.  Yes, it and stream Netflix and YouTube, but that's about it.  I have it on my laptop and on my ipad.  First, it doesn't work well (or at all) with Google Hangouts.  If you are Chromecasting and someone calls you on a Hangout, that opens in a new window which doesn't have the Chromecast extension button on it.  I found a post online that said you could set up (from the Hangouts page -- NOT from the Hangout icon), then, once you've set that up, you copy that url into a tab on your chrome browser then make the Hangout call.  That's a lot of extra work to go through just to do a Google Hangout.  When I did this, the sound from the party I was calling didn't work (even though it did work when I called them through a regular Google Hangout window).On the iPad, it's worse.  I downloaded Chrome for the iPad, but the Google extension doesn't go to the Chrome Browser on the iPad.  The only thing I can get it to work with on the iPad is YouTube.  Google Hangouts on the iPad don't work with it either.Why would Google make a product that doesn't work with its own products and app?  I don't see what everyone is so excited about.  It is hugely disappointing and limited.", "verified": false, "helpfulness": "0/1", "author": "S Patterson"}, {"rating": 5.0, "review": "The best web for TV", "verified": true, "helpfulness": "0/0", "author": "José Diniz Gonçalves"}]