[{"rating": 5.0, "review": "Use it to stream from my tablet to the tv. I have two actually, one in the bedroom and one in the living room.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Opens new vistas.  Sort of.", "verified": true, "helpfulness": "1/1", "author": "gloworm"}, {"rating": 3.0, "review": "need more wi fi range and speed", "verified": true, "helpfulness": "0/0", "author": "Edward"}, {"rating": 5.0, "review": "Delivered on time. Meet expectations", "verified": true, "helpfulness": "0/0", "author": "Pablo"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Claudio Tovar"}, {"rating": 4.0, "review": "perfect for casting ipad onto tv", "verified": true, "helpfulness": "0/0", "author": "Kim \"roscoe\""}, {"rating": 5.0, "review": "It's great working fine, and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Dwight J. Worker"}, {"rating": 5.0, "review": "works", "verified": true, "helpfulness": "0/0", "author": "Richard F Merhige"}, {"rating": 4.0, "review": "I'd say I like it--I've never tried Roku, and all my phones have been Android, so there's that.It connects easily, and enabled mirroring via the Android Chrome App, so I can end my futile quest for other hardware that never worked for that with my phone (LG e970 Optimus G for AT&T;).  The app also worked great for my ASUS TF300T tablet.I had NO luck using the Chromecast with hotel WiFi recently during a few trips, but a)I was dealing with Marriot FREE WiFi (Google it), and b)I didn't want to pay the hotel chain the add'l fees they've cooked up to gouge everyone who tries to stream in their rooms.At home, however, this little gadget became my overnight favorite, making it even easier to let go of my ancient Logitech Revue setup, as well as some other PC-based Android interfaces I'd messed around with.  Also note here I am currently NEVER thinking of rooting my Chrome in any way, mostly because I learned how it actually works.Which is:It employs 3 types of interfaces for casual home consumers--for all of them you'll have to download/install/run the FREE Chromecast app for Android or iPhone. Once you've done this, you'll notice the install setup familiarizes you with the various apps currently sporting little Chromecast icons somewhere on their screens ('Chromecast-Ready' apps) which will allow you to immediately view whatever you're streaming on whatever TV you connected your Chromecast device.Among the more popular streaming apps with Chromecast functionality built-in are: Youtube and Google Play (of course--it's why Google bought them in the first place), Netflix, Hulu, many movie channels (HBO, Showtime, Encore, Epix, etc.), and tons of sports broadcasters (ESPN, etc.).One gripe I have (with Time Warner, not Google) is that Time Warner has apparently decided to continue its longstanding history of neglecting its customers, and has opted NOT to make their own TWC-TV app Chromecast-Ready, forcing users to use the Chromecast app's Cast Screen function (mirroring) to throw whatever is on my phone screen, tablet, onto the device. Again, we all know this is less Google's problem than it is just Time Warner protecting its best interests in not overdoing it as far as what they offer for basic cable service, anyway.The Chromecast's Cast Screen feature works great on my smartphone, but I've yet to get anything to come up from my tablet.  I'm sure these are device-related issues and many, maybe more, other tablets will do just fine (again, my tablet is an ASUS TF300T--it's too old to even have wireless N built-in).Overall, the Chromecast seems like a very affordable option for fun streaming options at home.", "verified": true, "helpfulness": "2/2", "author": "Michael Denney \"The 'PC Doctor'\""}, {"rating": 5.0, "review": "I now have one in every tv.  Getting ready to cancel my cable!", "verified": true, "helpfulness": "0/0", "author": "Linna Richardson"}]