[{"rating": 5.0, "review": "This is fantastic, super fast and super easy.  The absolute best on application especially if you are a Prime member.  Nothing else is close.", "verified": true, "helpfulness": "0/0", "author": "robert b harnish"}, {"rating": 5.0, "review": "Very pleased with the system.  Great apps, movie choices and games.  Purchased the game controller which makes gaming so much easier.  Still navigating and learning the system.  Would recommend Amazon Fire TV to those looking to convert to a Smart TV format.", "verified": true, "helpfulness": "0/0", "author": "Victor Welker"}, {"rating": 4.0, "review": "I purchased the FireTV as a replacement for my parents AppleTV. Even though the AppleTV interface is supposed to be somewhat intuitive, it just never clicked with them. They picked up the FireTV interface almost immediately and have apparently been using it every single day since. The only problem they've had the interface is the differentiation between free Prime videos and regular videos (which even I have problems with sometimes).", "verified": true, "helpfulness": "0/0", "author": "Jason Lyon"}, {"rating": 5.0, "review": "Reliable Streaming device, easy to use.", "verified": true, "helpfulness": "0/0", "author": "J.Groneck"}, {"rating": 4.0, "review": "Great, but need third party access such as Vudu. Otherwise this is the best android device I have ever used. Fast and load 1080p movies perfectly.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 4.0, "review": "Its great!!", "verified": true, "helpfulness": "0/0", "author": "Charles Hurd"}, {"rating": 5.0, "review": "Ordered this as my new bedroom streaming device when my old Xbox 360 finally pulled the trigger and ended it's miserable life.  Setup was ridiculously easy.  Plug and go.  Quad-core processor makes this device snappy and quick.  Streaming quality is excellent and goes between episodes in a snap.  Also, this product has access to TONS of popular mobile games via the Amazon Marketplace. Highly impressed with the quality of this product.  My only complaint is the lack of a manual sleep feature.  This product have no on/off button, and can only hibernate after a set amount of \"idle time.\"  Normally, that is fine.  But if your television turns off (via sleep timer) before Fire TV does, Fire TV will NEVER enter sleep mode.  You have to turn your TV back on, hit the Home button, then the idle timer will begin.  It's a mild inconvenience, and by no means takes away from the experience of this machine.  I would recommend this to any friend.  I've used both Apple TV and Fire TV.  This far surpasses Apple TV, in my opinion, both in speed and quality.", "verified": true, "helpfulness": "0/0", "author": "Begrimed"}, {"rating": 5.0, "review": "received it as a gift that I wanted and it met all my expatations", "verified": true, "helpfulness": "0/0", "author": "Carol Haubeil"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "RTM"}, {"rating": 5.0, "review": "It is amazing what you are able to do with this device.  I love all the apps and ability to watch free tv.  I do wish it had prison planet tv but I can listen to it on Tunein radio.", "verified": true, "helpfulness": "0/0", "author": "James R. Speiser"}]