[{"rating": 5.0, "review": "For the money, it is hard to beat for convenience.  Although I have LG Smart TVs, it is a pain to have to grab the remote, change inputs and scroll through the sluggish TV interface.  The Chromecasts are much faster, and it is so nice to be able to open Hulu or HBO Go and cast it straight to the TV automatically without messing with inputs.  Google Play Music is also great with it.  I also have an app for my TV to change the inputs back to cable once I'm done using the Chromecast.  Now, if they would add more apps...", "verified": true, "helpfulness": "0/0", "author": "Michael L Brazeal"}, {"rating": 5.0, "review": "Works perfectly & as expected. Was delivered in a soft package which was starting to tare, but no damage was done. Using it as we speak. :)", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 1.0, "review": "I have followed extensive instruction upgraded my firmware, changed all recommended settings and this product still does not work. It fails to recognize the wifi, which works just fine for every single device I own and use. This however apparently has an entire list of routers it will and wont work with. Why is this even an issue? Why do routers NOT work with this device. Roku, rca media players do not require me to download firmware or tinker with settings im not familiar with in order for it to simply recognize wifi. Just to find the wifi signal it is blocked apparently by some kind of setting. So after anticipation, several troubleshooting efforts. Its worthless because it says it cannot find wifi. Not just my wifi but apparently it hates my neighbors wifi too because it finds nothing at all.  So thanks google for creating a great product that simply does not work.", "verified": true, "helpfulness": "0/0", "author": "S. Tam"}, {"rating": 4.0, "review": "This is such a great device for mirroring laptops, tablets, phones, etc. that I bought a second.  With a roku & blue ray that streams content apps (Amazon, Netflix, Hulu, etc) we use these solely for streaming yoga / fitness workouts from youtube, sharing photos from our devices & other social sites.  Super convenient, high quality 720p image, and really inexpensive.  May actually use this for presentations at work.  Waiting on a firestick for another set, but believe that will just feature apps for content & doesn't mirror devices (yet?)I'd recommend spending a bit more & buying a fire, roku, apple tv  if you want to use this as the primary way to watch Amazon, Netflix,  Hulu etc, but for mirroring or something to travel with the Chrome is great.", "verified": true, "helpfulness": "1/1", "author": "FW"}, {"rating": 1.0, "review": "Google has really screwed this up. The ONE feature that most people want to use Chromecast for is to mirror their device screen to their TV.  Amazingly, that feature (Cast to Screen/TV) only works on a tiny amount of qualified Anroid devices today and of course doesn't work on iOS.  This device is useless.  It was really built for Android, period, (not surprise there) and they haven't even gotten that right. This is still in Beta, but nonetheless Google is pushing Chromesact hard via TV ads and at Costco and BJs but nowhere on the packaging do they list what (few) devices it actually works on. They have apps that \"cast\" Netflix, HBO Go, etc to your TV as well as YouTube, but \"hello\", we already have that via smart TVs and DVD players. TERRIBLE EXECUTION. Returned it.  Very disappointed. Waste of time.  Folks on the Google support forum are having issues even with the supported devices.  If you have one of these devices you may be in luck:  ( https://support.google.com/chromecast/answer/6059461?hl=en )Nexus 4Nexus 5Nexus 6Nexus 7 (2013)Nexus 9Nexus 10Samsung Galaxy S4Samsung Galaxy S4 Google Play editionSamsung Galaxy S5Samsung Galaxy S5 ActiveSamsung Galaxy Note 3Samsung Galaxy Note 4Samsung Galaxy Note 10HTC One M7HTC One M7 Google Play editionLG G2LG G3LG G3 Cat.6LG G Pro 2LG G Pad 8.3 Google Play editionSony Xperia Z3Sony Xperia Z3vSony Xperia Z3 CompactSony Xperia Z3 Tablet CompactSony Xperia Z2Sony Xperia Z2 TabletNVIDIA SHIELD TabletTesco hudl2TrekStor SurfTab xintron i 7.0Support for additional devices coming soon", "verified": true, "helpfulness": "1/4", "author": "TruDat"}, {"rating": 5.0, "review": "I have four of these in my house, and have purchased several for friends and family as gifts.  It is by far the easiest way to stream content to your television!", "verified": true, "helpfulness": "0/0", "author": "Jason M."}, {"rating": 5.0, "review": "JUST WHAT YOU NEED IF YOU LOVE VIDEO STREAMING !!!!  BEST BEST!!!", "verified": true, "helpfulness": "0/0", "author": "ruben"}, {"rating": 4.0, "review": "Great product for the price. I wish it was more compatible with iOS. You must use 3rd party apps to look at your photos for example. I still got 4 more for my family for Christmas. The price is too good.", "verified": true, "helpfulness": "0/0", "author": "Joseph Bernard"}, {"rating": 3.0, "review": "Real nifty for wirelessly streaming Youtube and Netflix.  However, these streams will occasionally crash.  Unfortunately I bought this primarily to stream web browser video and this function simply does not work.", "verified": true, "helpfulness": "0/0", "author": "Brian Hill"}, {"rating": 5.0, "review": "This piece of technology is awesome! I purchased a Chromecast because I was disappointed with user interface on my Sony Bravia teleivision. I was surprised how easy it was to setup and it is quite intuitive. The people who had a hard time setting it up simply failed to follow the instructions. I am a network/client tech by trade but my fiancé had no problems setting it up when I decided to use her to test ease of setup. One negative thing I will say is there are only a handful of apps supported and the ones that do work can be a bit buggy at times. That is expected and with time the supported apps should increase. For people giving bad reviews for unsupported apps, well you should have researched the product before purchasing.", "verified": false, "helpfulness": "1/1", "author": "D. Chavez \"realistik\""}]