[{"rating": 5.0, "review": "I love my Chromecast.  It seamlessly streams videos using the most popular platforms.  Setting up was a cinch and I haven't had any problems with it since.  I love the Google Play Music integration because it allows me to listen to my music through our Bose sound system.  Frankly, I have other ways to watch videos but using my smartphone just feels so darn cool!", "verified": true, "helpfulness": "0/0", "author": "intherain \"enchanted_gal\""}, {"rating": 1.0, "review": "These things are terrible. They come with a very short power cord and very weak wifi signal. The only way this thing can possibly work is if it is positioned within 1 foot of a power outlet and 10 feet of your wifi router.", "verified": true, "helpfulness": "0/0", "author": "Charles Higgins"}, {"rating": 1.0, "review": "I really regret getting this.  I should have read more about it before getting it.  Here's why I don't recommend it:1) The device's Wi-Fi stopped working in 1 month2) You can only connect via Wi-Fi3) There's no dedicated remote, so if you have an old iPad, you have to hit a button to get the device's screen to go up, swipe to unlock, then you interact with the app, so you can't quickly just pause a video4) Every app has their own UI; most of them pretty terrible - Google should have minimum standards to enforce consistency5) The device never turns off6) You can't really customize anything7) Product isn't well integrated with Google's own products - e.g. on YouTube on iOS (tested on both iPad and iPhone 6), after you create a queue of shows, the play button doesn't work; you need to open up your list of videos (on the top right corner) then select the video you want to play - the giant play button on top of the video on the left doesn't work right after a queue of shows is created8) What shows up on the TV doesn't always sync with what you see in the app; e.g. the skip ad button is always slower on the mobile device", "verified": true, "helpfulness": "0/0", "author": "Roger B."}, {"rating": 4.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "tbone74"}, {"rating": 5.0, "review": "find free stuff and drag it into a chrome window/tab and cast it! Awesome! binge watched all of season 5 GameOT yesterday", "verified": true, "helpfulness": "0/0", "author": "J. King"}, {"rating": 5.0, "review": "best and cheap option", "verified": true, "helpfulness": "0/0", "author": "Cliffcat"}, {"rating": 5.0, "review": "Nice and convenient!", "verified": true, "helpfulness": "0/0", "author": "Marco Rocha"}, {"rating": 5.0, "review": "Great Product and pricing!", "verified": true, "helpfulness": "0/0", "author": "bofusrescue"}, {"rating": 4.0, "review": "that's ok", "verified": true, "helpfulness": "0/0", "author": "Elimes Rodriguez"}, {"rating": 1.0, "review": "Does not work with hotel internet.  The only reason I got it.", "verified": true, "helpfulness": "0/1", "author": "lcole66"}]