[{"rating": 4.0, "review": "Only issue is that it doesn't come with a separate remote. It streams HD videos faster than my Roku 3 on a slower internet connection", "verified": true, "helpfulness": "0/0", "author": "jijju"}, {"rating": 4.0, "review": "Love it, even purchase one for my friend's birthday after I got mine.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "THANKS", "verified": true, "helpfulness": "0/0", "author": "Saleh M Bajahmoom"}, {"rating": 5.0, "review": "Allows  me to get movies from Youtube, Huli, even HBO. The best part is it’s plug and play, so no confusing ports to configure or anything technical. I have it on an Android.", "verified": false, "helpfulness": "0/0", "author": "K Hubbard"}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "Kimberly Dankert"}, {"rating": 5.0, "review": "very good i love it", "verified": true, "helpfulness": "0/0", "author": "Alexandre"}, {"rating": 3.0, "review": "It works, its cheap, and incredibility easy to use.  The fact that is only allows a max of 720p video makes this device useless as a daily driver. A majority of online content is in 1080p and I don't want to hinder the quality of my content on a daily bases.720p video might be good for some of you, my mom cant even tell the difference between 1080p and 720p.Pros: It works, its cheap, and incredibility easy to use.Cons: max resolution 720pConclusion: Its okay, but not suitable to use as a daily driver.", "verified": true, "helpfulness": "2/3", "author": "A."}, {"rating": 5.0, "review": "Awesome, use this every day.", "verified": true, "helpfulness": "0/0", "author": "arex_oak"}, {"rating": 1.0, "review": "Steaming is laggy and Chromecast causes my network to crash when attempting to stream from a browser window.  Not worth it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is deceiving.  It does not work like an iPhone with the Apple TV.  The app on your android phone has to be able to work with the chromcast in order to mirror your android phone on the tv. Many apps on an android phone don't work with it. My son has a Sony Xperia Z2. He has a particular movie app whereby he gets to see many movies. We thought the chromcast would have been able to allow us to see the movie from the phone, on our tv. No. You can see you tube stuff and other Google approved stuff. Truly not what I thought it would do. Nowhere does it say that it streams particular apps. Bleh!", "verified": false, "helpfulness": "0/3", "author": "Nirmala Dindial \"Amazon shopper maniac\""}]