[{"rating": 5.0, "review": "Everyone of my friends wanted me to get the Amazon Fire TV, and I am, certainly, not disappointed only sorry that I waited so long", "verified": true, "helpfulness": "0/0", "author": "larmar"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Ruth M. Paez"}, {"rating": 5.0, "review": "Easy install,  worth the money", "verified": true, "helpfulness": "0/0", "author": "maru"}, {"rating": 5.0, "review": "Super easy to use and a very intuitive UX. The voice activation on the remote took a while to get used to but is very easy to use. I've recommended it to friends and will continue to do so.", "verified": false, "helpfulness": "0/0", "author": "Karrie Kampf"}, {"rating": 5.0, "review": "The Amazon Fire TV is amazing! I am so glad I purchased it. We had been using the Apple TV as someone had given it to us as a gift. I've never understood the appeal of Apple and the Apple TV is awful - took forever to load, would stop working during a TV show or movie. I could go on and on about how bad the Apple TV is. So if you are considering the Amazon Fire TV - get it. It is absolutely the best!", "verified": true, "helpfulness": "0/0", "author": "Cheryl K. Crowley"}, {"rating": 5.0, "review": "I also have Roku at another home. Fire is better.", "verified": true, "helpfulness": "0/0", "author": "Hal Watson Jr. (halprof39@aol.com)"}, {"rating": 1.0, "review": "The FireTv and Netflix app do not work together. The video jumps frames. Doesn't stream correctly. I am on my third FireTv and it still doesn't work. It is not my internet connection. I use the wired instead of the wireless. My internet speed ranges from 40 to 60 mbps. I tried different cables. I even bought a new router thinking it would help but no luck. Netflix blames Amazon and Amazon blames Netflix. It just doesn't work correctly with Netflix.", "verified": true, "helpfulness": "3/4", "author": "Cycleboy189 \"Cycleboy189\""}, {"rating": 3.0, "review": "Somewhat disappointed, thought I would be able to go from my PC to TV wireless.", "verified": true, "helpfulness": "0/0", "author": "John D"}, {"rating": 5.0, "review": "I got this one for my brother for Christmas. We have had one since they first came out. Recently, ours just died. I called customer service and they sent me a mailing label via email right away and I had a new Amazon Fire the next day. I put the defective one in the box, put on the label and took it to the UPS Store. Back to using it everyday. Nice product and excellent support.", "verified": true, "helpfulness": "0/0", "author": "Dan iel J. Farren Jr. \"ordinary guy\""}, {"rating": 5.0, "review": "Great content, love having all content in one place instead of going from site to site.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]