[{"rating": 5.0, "review": "works super fast", "verified": true, "helpfulness": "0/0", "author": "Parrish lee \"parrish\""}, {"rating": 2.0, "review": "So, I have an ATV (apple TV), Roku 1, Roku 3, WD Live Media and a Chromecast so I got this unit to test it out.  We are long term prime members, and bought a number of movies and tv shows along with lots of music on Amazon so a device from them directly hooked into all of that was HIGHLY desireable.  I also loved that it had 2-3X the specs of my other devices.PROS;BEAUTIFUL packagingLow ProfileAble to have out of sightCONS:First run FORCED to watch a 10min intro videoFirst REMOTE usage forced to watch an intro videoInterface is not logically laid out, and things that you would normally use like Prime Movies or Movie Library are buried 6-7 clicks down in the menu.  These items should be top of the list as this is a streaming device.The remote is way way off... Using it to type on the keyboard onscreen is a joke.  The unit will skip 7-8 characters so you are mad clicking back and forth to input anything.  For me I use secure passwords so putting a 22 digit password in is a pain but here it was so painful I gave up on getting Hulu working even.Netflix stutters ALOT on this unit.  I switch inputs on my receiver and the same movie on my Roku3 sitting next to it on the same network no issues.  Amazon Prime movies did not stutter nearly as bed leading me to believe that they are prioritizing Amazon streams (dirty pool)VUDU app is blocked from this device.  While I can install Plex and then pull vudu from my plex server that just should not be needed.  I know it is a competing service, but was hoping they did not pull the Apple move and block it.Overall I liked the look of the unit, and the specs are amazing but I think that I will wait and retry on the Gen3 or 4 for this unit.  This is the first foray and they got alot to fix.", "verified": true, "helpfulness": "1/2", "author": "David Mcdougal \"Web Geek\""}, {"rating": 5.0, "review": "Best little low profile box, great remote with voice search, (no hen and peck on screen). All my favorites streamed right through the box. Got rid of satellite DVR; miss the recording feature, but there wasn't much on to record anyhow. Now I have quick access to better quality and greater variety programming. Best Christmas present to our family.", "verified": true, "helpfulness": "0/0", "author": "J. Johnson \"Lover of individuality\""}, {"rating": 5.0, "review": "This unit rocks!  I bought it to replace my Roku 2XD and I won't be looking back!  The biggest thing I noticed was that this little guy is fast - very fast!  The forced instructional video was kind of annoying but after that I loved it.  The app selection is very good and I like what they did with Netflix.  I'm going to make note of the fact that this unit supports multiple profiles (unlike almost all of the others).  It was a breeze to side load some of my other non-root apps and the menus are very intuitive.  I wish there was an easier method to add the side loaded apps to the main screen but, it works with llama so whatever.  The only real complaint I have is that I wish there was some way to sort out the free prime content from the pay content.", "verified": true, "helpfulness": "0/0", "author": "ParttimeGamer"}, {"rating": 2.0, "review": "I haven't bought this yet but my issue is that I already pay the $99 for the Prime Instant Video.  I should not have to pay another $99 to be able to watch it on tv. Amazon is not playing nice in the sandbox by removing the free download app to be able to watch it on other devices like it had in the past. So it's basically a double hit to use amazon prime.  We have been loyal prime customers for a number of years because we could pay and watch on our tv and other devices without needing the box.  Not sure what we will do now.", "verified": false, "helpfulness": "0/2", "author": "H. Miranda"}, {"rating": 2.0, "review": "I bought it for my brain damaged sister, who speaks well but cannot read or write.  She likes it, but since she can't tell if she would have to pay for a movie or not, it is pretty useless.  The big negative for me, other than the ones already mentioned, is that it doesn't remember my Netflix account.  I have to re-enter all the account details on a regular basis.  This is a great nuisance, especially with that little remote. It is very hard to use it to enter information.", "verified": true, "helpfulness": "0/2", "author": "Sally Tomson"}, {"rating": 1.0, "review": "Made poping sounds and flashes on the screen so badly I thought it would damage my TV, so I returned it on the first day. I'm very disappointed, but should have expected something like this from Amazon.The actual device is awful too. It is NOT worth $80, even if it was not a refurb. The Netflix app doesn't even have the \"My list\" section which if you use Netflix, you know you need. Everything is INCREDBLY hard to find and use on this, I was shocked! Everything is smashed together, and it's harder to use than a PC to stream. You actually have to HAVE a PC to watch almost anything that isn't on Netflix. This is worthless item.", "verified": true, "helpfulness": "1/5", "author": "Diane w"}, {"rating": 4.0, "review": "I dont like that have to pay for movies, that was ever said in sales  pitch.", "verified": false, "helpfulness": "1/1", "author": "Michael cHAMPION \"Pennirich\""}, {"rating": 3.0, "review": "Wife got it for me for Christmas. Wasn't until rampant bandwidth overage became a problem until I googled and found out that the screensaver on it with its \"mosaic bug\" was contributing to heavy bandwidth usage, which ended up costing me some amount of money (haven't received last months bill yet) for going over my gig limit. Now that's the gift that keeps on giving, Amazon.Great product though, if you got the bandwidth for it.", "verified": true, "helpfulness": "1/1", "author": "Troy James Foley"}, {"rating": 3.0, "review": "Can I get live sports on here", "verified": false, "helpfulness": "0/1", "author": "wilbert dobyne"}]