[{"rating": 4.0, "review": "Better than any Roku", "verified": true, "helpfulness": "0/0", "author": "Justin G. Allen"}, {"rating": 2.0, "review": "The amazon fire tv works great better than a ruku however what they do not tell you is it isn't compatible with all tvs even if it has an hdmi input. For instance my tv is only 1 year old brand is hisense and the fire tv is not compatible i called amazon customer care they offered to refund my money but we decided to keep it for the bedroom.  Amazon handled the situation very well and were understanding of my frustration i just wish they would disclose that its not compatible with all devices.", "verified": true, "helpfulness": "3/4", "author": "david andrews"}, {"rating": 4.0, "review": "Great device for what Amazon will allow it to do.  It is very fast and responsive and the streaming capabilities are superb even over a N-wireless network.  Most of the \"Cons\" that appear in other reviews were written by early adopters or the reviewers lacked the skill to read and follow the numerous online directions for enhancing its capabilities.The newer software (which was installed on my device) prevents the user from rooting the unit.  Regardless, I was able to install XBMC and Firefox using only the ADB utility (search on it).  XBMC allowed me to stream mpeg2 Live TV from Silicon Dust's HDHomeRun Prime using DLNA.  HD content would not play without staggering because of the small amount of buffer memory.  However, SD video was smooth and continuous.The inability to become root crippled only one major feature that caused me to return the device.  The OS requires that the user be root to issue the \"mount\" command.  Since \"mount\" can't be executed, any external memory attached to the USB port cannot be seen or used.  The USB port does support an external Keyboard and Controller.  The limited internal memory (8G) is sufficient to load only a few games or a few videos.  Another possibility is automatically mount any storage device connected to the port as is common in most modern Linux OS's.The developers could have easily changed the permissions (ACLs) of the \"mount\" command and still have prevented the device from being rooted.  This would allow the attachment of an external source for video and additional storage.Many reviewers complained that HBO Go wasn't supported but virtually all online streaming content that is not directly supported by Amazon can be played using either the FireFox or Chrome browsers once installed,This could/will a killer product with the added capability of external memory.  I will try again in about 6 months.", "verified": false, "helpfulness": "6/6", "author": "Newton"}, {"rating": 5.0, "review": "This is the first streaming box I have seen thats actually fast. Combine that you can play games and install XBMC on it, its great.", "verified": true, "helpfulness": "0/0", "author": "Smartelf \"Smartelf\""}, {"rating": 5.0, "review": "I am a big fan of this device.I have owned many different set top boxes, (Roku, Apple, Chromecast, GoogleTV(multiple types), WD, Samsung, Boxee), connected TV's, blu-ray players and game consoles and this device is my favorite to use.  The interface is nice to look at and easy to navigate.  I haven't had any performance related hiccups during gaming or streaming (I also have the controller).  The kids love playing Minecraft and other games on the device as well.  Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "DismissedasDrone"}, {"rating": 5.0, "review": "After trying Apple TV , chromecast etc. fire tv is be far the best out there! Living out in the woods, there was no buffering. There was instant setup, voice command, and very happy customers! Thanks Amazon! I've got the fire stick on pre-order n can't wait for it to arrive!", "verified": true, "helpfulness": "0/0", "author": "H. V. Thompson"}, {"rating": 4.0, "review": "It is fast and can pick up the wireless pretty quickly. I wish you could use the voice for Netflix as well as other apps. Would be a 5 star if they could do that.", "verified": true, "helpfulness": "0/0", "author": "Hyun Suh"}, {"rating": 5.0, "review": "My son told me about this device and it took me a long time to see what it actually would do.  I am not disappointed.  This allows me to play any videos (etc) that I would use on my Kindle Fire and my husband and I can both watch.  Sometimes it's a little hard to maneuver around, but the suggestions are always spot on and I've got it figured out.  This is a great idea.  It is particularly great to get on my Kindle and search for something we would like  to see without using the television set.  I would recommend this to everybody.  It is the perfect companion used with my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "utah lady"}, {"rating": 5.0, "review": "Love this feature. Easy to use, awesome remote, love not paying a cable bill.", "verified": true, "helpfulness": "0/0", "author": "ES26"}, {"rating": 5.0, "review": "Amazon Fire is AMAZING!  I would highly recommend it.  Amazon has amazing products as well as customer service.  I love supporting them.", "verified": true, "helpfulness": "0/0", "author": "Jon S."}]