[{"rating": 5.0, "review": "I have a chromecast and Roku 3. Amazon Fire TV is faster and richer. The dolby sound is even better. The GUI for Roku sucks with Netflix, but it is better with the Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have been an Apple TV user for about 1 and a half years.  Lately, I have been having major issues with my Apple TV and the connectivity to my internet service and using Netflix on it (one of my major uses).  When I saw this device, I was skeptical.  \"Not another device that is going to be very disappointing in the end\" I said to myself.  But, we took a chance.  And I must say, thus far, we are extremely pleased.Most of this review will be a comparison to the Apple TV (sorry Apple).  Let's start with the remote control.  We have two large dogs and with Apple, the second one of them was in front of the Apple TV device, the remote would not work (it requires line-of-sight).  The Amazone Fire TV (AFT) remote does not and we can use it without having to point it directly at the device.  May seem like a small deal, but trust me, until you experience the frustration of trying to figure out why the remote doesn't have line of sight, you just won't understand.  The 'voice-activated' service is great.  Works like 'Google Now' and 'Siri' on smart phones and tablets.  The only issue here is that it doesn't work inside applications.  For example, when using Netflix on AFT, if you use the 'voice-activation' feature, it takes you out of Netflix and shows you Amazon options.  Would be nice if it worked in applications, too.  But that's not a big deal for me.  One of the surprising features about the remote, when the AFT is off and I have my TV on the input for watching cable, a push on the remote of the 'Home' button (which turns AFT on) also automatically turns my TV to the correct input to watch AFT!  Saves me from having to change inputs manually.Okay, some AFT feature reviews.  You can play games on AFT.  Now, I have not used this feature as I am not a big game player, but I found it an interesting feature to have supplied.  Movies come up almost instantly after hitting play.  With Apple TV, I would have to watch the dotted circle for about 5-10 seconds (sometimes longer) before the selected movie would start.  I have yet to have any delay with my AFT.  Very pleased.  Every single show we have watched displays very clearly and there has yet to be a sync problem with audio and video.  Not the case with Apple TV (happened a lot, and I would have to stop playing the movie, go out of the system, go back into the system, and then start it again).  AFT has Netflix and Prime.  Apple TV did not have access to Prime.  This was a BIG plus to us as we have lots of shows we watch on Prime.  AFT also has Showtime movies on demand.  It doesn't have HBOGO, but Prime members have access to HBO on demand through Prime, so I can still watch my HBO shows on AFT.Overall, I am extremely pleased with our purchase.  Our Apple TV has been moved to one of our home-offices and the main Living Room has the AFT in it.  I highly recommend trying this device, especially if you are a frustrated Apple TV user.", "verified": true, "helpfulness": "0/0", "author": "Monte Burns"}, {"rating": 5.0, "review": "Set-up was simple and it works very well to stream video.  The voice command works well but only if you know what you want to watch.", "verified": true, "helpfulness": "0/0", "author": "sewingfiend"}, {"rating": 5.0, "review": "I love my Fire TV!  It is more than I expected.  With my Prime, I have some wonderful movies and TV to watch.  Then there. Is the connection to Hula and Netflix.  I have watched so little cable tv it seems a waste to have.", "verified": true, "helpfulness": "0/0", "author": "mykelly"}, {"rating": 5.0, "review": "We haven't watched regular satellite since we got this. We can watch almost anything on almost anything with this, Amazon movies, TV, Netflix, Crackle, Hulu, Games, Weather apps, So much. All for one low price. Makes me glad to be born into this time of technology!! For around 100.00, you gotta get this!", "verified": true, "helpfulness": "0/0", "author": "Lesleigh \"LL\""}, {"rating": 1.0, "review": "I paid full price for the fire tv but now I gotta pay full price for the kindle hdx because I didnt forsee the bundle offer. I bought a game controller and signed for prime. The hdx should be discounted for prime members that bought all the extras!  The next time I wont be so quick to buy because I got ripped off!", "verified": true, "helpfulness": "2/9", "author": "James Hamilton \"Movie Buff\""}, {"rating": 4.0, "review": "Love love love Amazon Fire TV -- with the one exception that there is no on/off power switch on either the box or the remote :(  and if the box remains plugged in it gets \"hot\"...functionality of the box itself is good for Amazon and Prime .. unable to use the voice activation in other apps....really like the addition of HBO shows!!!  All in all very happy with the purchase -- it does everything it says it will.", "verified": true, "helpfulness": "1/1", "author": "Jodi Maynard"}, {"rating": 5.0, "review": "I received this as a birthday gift. What's great? The set up was easy.  Simply connect and you were there.  Within minutes you are watching videos from Amazon, or other apps.  The clarity and upload times were great.  I don't have the fastest up and down times on my internet connection, so it was incredible that the load times never suffered. And just like the commercials, it was very easy to speak into the controller to find what you are looking for.  I even searched for Gary Busey!  You know you have to after all of those commercials. This is one of the best birthday gifts I've ever received.  Two thumbs up!", "verified": true, "helpfulness": "0/0", "author": "ZZ"}, {"rating": 3.0, "review": "Not meet my expetations but if you have the new kindle fire is ok.Does not work on I-Pads or any wireless device needs kindle. But it it has pretty good graphics to play", "verified": true, "helpfulness": "1/1", "author": "Miguel aguirre"}, {"rating": 1.0, "review": "I had the hardest time with this Amazon fire TV. I have the Kindle fire HDX so I figured with both products being from Amazon they would work correctly, boy was I wrong....... mirroring the device was the easy part. When I connected the Kindle to the Amazon TV it would only stay connected for 2 to 3 minutes without skipping or disconnecting or buffering. I press the Mayday button and got in contact with Amazon Kindle services and they advised me to reset the Amazon fire TV as well as the Kindle fire HDX. Needless to say I reset both devices I then reconnected both devices and had the same issue. So again I contacted Amazon services. They said they would check the software in my device and check out my device making sure it's not malfunctioning and they will give me a call back. They never called me back I had to re-contact Amazon services. The rep told me maybe your router is too far from your fire TV explained it was sitting right next to it and I also had two other wireless routers in my home. I asked for a full refund and sent back the Amazon fire TV. Maybe when this software is updated I'll try it again but as for right now it's not worth it.", "verified": true, "helpfulness": "4/8", "author": "Amazon Customer \"ymustuhate\""}]