[{"rating": 2.0, "review": "I received this device and it worked fine but didn't offer anything that didn't require a paid subscription. I already had a device through my DVD played which did the same. I can see any reason to pay $99 for this. Amazon should at least offer one year free subscription to Amazon Prime with this device.", "verified": true, "helpfulness": "3/5", "author": "THOMAS E COMOLLO"}, {"rating": 5.0, "review": "A great buy when bundled with the fire hdx and a Amazon Prime Membership. With the cost of Netflix and cable tv packages going up all the time, you can watch all the movies you want for $99 a Year. That's $8.25 a month. Plus prime now has free music.", "verified": true, "helpfulness": "2/2", "author": "RCW"}, {"rating": 3.0, "review": "I can't really rate it because it won't work on the TV I bought it for.  This TV doesn't have the port needed to allow the TV Fire to work.  I'll have to return it unless my grandson can use it.", "verified": true, "helpfulness": "0/4", "author": "Sybil E. Harrison"}, {"rating": 5.0, "review": "I think everyone should have this as it makes it so easy to tune in to programs, and movies. We use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "We love it.  Actually just bought a second for upstairs so we could stop moving it from room to room.  Considering buying a third.  Have told all of our friends about it.  We are looking to get rid of our cable once and for all (bought this for a patio TV that couldn't get cable to it).  Set up is easy, content is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Not as many channels as Roku or it would get 5 star...  However, it looks like the channels and integration with KidsFreeTime is coming.  Great addition to my Prime membership and should be better by end of year.  Also - I gave the rental setbox back to the cable company a while back so this fits right into my house.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 4.0, "review": "Worked straight out of the box and preconfigured with my details.Streaming is seemless and great quality.My CloudDrive photos and videos were ready to view without doing a thing.My only dislike is that not all content is included in my Prime membership.", "verified": true, "helpfulness": "1/1", "author": "Michael Griffiths"}, {"rating": 1.0, "review": "would dump my roku if it had a heaphone jacklove that feature  on the rokucant believe that you wouldn't have included that featureits awesome to be able to continue to watch tv if my wife wans to goto bed", "verified": false, "helpfulness": "2/7", "author": "William Schmon"}, {"rating": 5.0, "review": "This is the most amazing device to watch tv shows and movies on especially if you subscribe to Amazon Prime, Netflix or Hulu. I have not regretted a single moment of purchasing this item.", "verified": true, "helpfulness": "0/0", "author": "Stephen Vance"}, {"rating": 5.0, "review": "Ok, it's no AppleTv or anything, but the voice search is wonderful!, and as advertised it works the first time every time!  The only fault I can find, is that when you do a voice search, it is ONLY searching on Amazon, it needs to search Netflix and Hulu+ at the same time", "verified": true, "helpfulness": "1/1", "author": "Zachary E. Freeman \"Zachary E. Freeman\""}]