[{"rating": 1.0, "review": "I'm giving this one star because I can't rate it zero stars! This thing is useless! I can't stream video from my phone unless I'm using WiFi. If i knew that I never would have wasted my money. I'm rarely home so I THOUGHT this would be a great way to watch what I want through my phone to my tv and cancel my cable service. Nope! I can't use my phone internet to watch a movie. Thx for nothing Google!", "verified": true, "helpfulness": "0/10", "author": "Jason"}, {"rating": 5.0, "review": "Was real easy to setup and love how easy it is to use. It will get a lot of use out of me", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "it is not supporting the window vista version. but i could able to add Google extension Beta to share web on TV. it is working good.", "verified": true, "helpfulness": "0/0", "author": "soundarrajan"}, {"rating": 1.0, "review": "Dear God, What a piece of crap. For the record... I am tech savvy... I just wanted to watch Hulu... that's all. I have  Surface Pro And Google made it stupidly complicated. I downloaded the app for my phone. fine. for my chromebook. fine. for the surface...w.t.f. I had to go to the Google store and hunt down Google something or other. no. just. no. I'll just hook up my surface with an hdmi cable and bypass the crap. sooooo much easier that  chromecast. now...back to Costco to return it", "verified": false, "helpfulness": "0/6", "author": "Chris Camaratta"}, {"rating": 5.0, "review": "Worth the money! I absolutely LOVE our chrome! Very convenient!", "verified": false, "helpfulness": "0/0", "author": "Takesha Hedgman"}, {"rating": 5.0, "review": "Best thing I've bought this year. Makes it easy to  watch videos from your phone on your TV. It works with tons of Android apps like YouTube, Watch ESPN, Google Music, and much more.", "verified": true, "helpfulness": "0/0", "author": "Eric Lavender"}, {"rating": 5.0, "review": "fast delivery it took only 2 days i recommend installing it with a iphone it is much easier than laptop because on laptop it says we cannot connect your chrome and with iphone it is much easier and faster videos are very clear i'm really enjoying this device.  I recommend buying it since they are on sale for only 23 dollars very affordable and reliable.", "verified": true, "helpfulness": "0/0", "author": "Erik"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/1", "author": "Grant Moellering"}, {"rating": 1.0, "review": "I returned it since it doesn't support stream (AirPlay) with iPhone", "verified": true, "helpfulness": "0/4", "author": "Lezhen Wu"}, {"rating": 1.0, "review": "I was so excited to get this as I heard nothing but good news about. However, as easy as set up seems to be, it shows up with an error message \" Chromcast is connected to WIFI, but has no internet access. I have been fumbling with it for hours in yet I still get the same message on my TV screen. If I am unable to get it to work I will send it back, and find something else that will work.", "verified": false, "helpfulness": "0/2", "author": "Mathew"}]