[{"rating": 3.0, "review": "Chrome cast is mediocre.  The sound is always out of sync with the actors. Using an hdmi cable is easier and clearer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "My biggest disappointment was that you still need your home WiFi network to use chromecast and only a few applications work with it.", "verified": true, "helpfulness": "0/1", "author": "Cavett Chipman"}, {"rating": 5.0, "review": "This product has served me well and I love it and all that good stuff. Thank you very much I love it.", "verified": true, "helpfulness": "0/0", "author": "Byron Bishop"}, {"rating": 5.0, "review": "love or hate google it does what it is suppose to do. just hope google keeps supporting it and bring it to the next leavle.", "verified": true, "helpfulness": "0/0", "author": "kirtland dordan"}, {"rating": 5.0, "review": "I was skeptical about the hype surrounding this device, but after using it I'm sold on it. Google has done an amazing job on this one. It's extremely easy to setup and use. I haven't run into a single issue after weeks of use.", "verified": true, "helpfulness": "0/0", "author": "luciddreamz"}, {"rating": 5.0, "review": "It is amazing, I can watch all movies and and TV series I want using my smartphone like a controller.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Cardoso de Oliveira"}, {"rating": 5.0, "review": "This was purchased for a Christmas present. It was shipped out quickly. She was very happy to receive this gift for Christmas. She says that it works great and is very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Molmor \"Molmor\""}, {"rating": 5.0, "review": "Honestly this device is capable of a whole lot more, but for now it has been worth the $35 just for youtube.You can control the volume, play, and pause straight from yours phone.  Also, answering phone calls or going into other apps does not disrupt the video stream.  You can even go back into youtube and assemble a playlist of what to show once the current video ends.  Chromecast has made it incredibly simply to come home after a hard day of work, plop down on the couch, and pull up a playlist of Game Grumps, DBZ the Abridged Series, and Tech News.  This convenience of never having to try to use the TV remote's number pad to painstakingly type out a search query would have justified the cost as is!  The fact that I can also watch netflix, access my Google Play Movies, stream tabs from my computer, and listen to Music through this is just icing on the cake.  There are plenty of other apps incoming so this device will only gain value with time.I highly recommend purchasing a Chromecast if you use Chrome, Youtube, or Netflix regularly!", "verified": true, "helpfulness": "0/0", "author": "A. Schroeder \"Galactus\""}, {"rating": 4.0, "review": "We've been using the Chromecast in our bedroom since we don't have cable hooked up in there and it's been working great so far.  No complaints!", "verified": true, "helpfulness": "0/0", "author": "KT77"}, {"rating": 3.0, "review": "Simple device and easy to set up. Not enough apps supporting this device. If only it can work for the ipad or iphones as an airdisplay, this would be a no brainer purchase. Just for YouTube and selected apps, it is OK. Glad it wasn't too expensive to try. Might sell it off since I hardly use it.", "verified": true, "helpfulness": "0/0", "author": "S"}]