[{"rating": 5.0, "review": "I had comcast who routinely liked charging me well over our agreed upon monthly price for no-good reason.  I got this and canceled my cable with them.  Best decision ever.  Not only do I get to watch what I want when I want to (obviously netflix and hulu have more options than On Demand) but I can use my phone as a remote.  Only downside is I wish Amazon Instant Video was supported.", "verified": true, "helpfulness": "0/0", "author": "Melissa Barwick"}, {"rating": 5.0, "review": "We love the ability to stream from computer to the TV, not only Netflix, but also Ted talks and technical videos.  It has transformed our evening TV viewing from the unendurable 20-minutes-per-half-hour of advertisements per 10 minutes of content to a much more reasonable, educational and enjoyable window on the world.", "verified": true, "helpfulness": "0/0", "author": "M. Thornberry \"grins\""}, {"rating": 4.0, "review": "Great Gift Item, not my personal cup of tea for a network device though. i would say moderate technical skills are required", "verified": true, "helpfulness": "0/0", "author": "iPodTouchMyself"}, {"rating": 4.0, "review": "Streams well on approved apps as stated, but is choppy when streaming local files.  I'm not using an \"n\" router so I can understand that and accept it (this was not what it is advertised for). Setup is confusing until you actual read and follow the directions.  I'm hoping new apps will come more quickly.  I use it for mostly for YouTube, but would like to stream movies cleanly when they get that bug worked out.", "verified": true, "helpfulness": "0/0", "author": "randy"}, {"rating": 5.0, "review": "Purchased another as I donated my original to my parents house so that they could easily stream NetFlix.  I had originally setup a computer for them but it required a bit more technical know-how to get that streaming properly than this does for them.  So, had to buy one to replace it on my TV in my bedroom.Even with the recently released Roku Streaming Stick and all previous versions of the Roku, I still prefer the Chromecast.  Especially with third-party apps like Avia that allow me to stream music, video, and pictures that are stored locally on my phones and tablets.  Avia also has Dropbox, Google+, Facebook, etc. integration to stream content from these sources.  Easy setup, easy use, having any connected phone or tablet able to control it, etc. makes the Chromecast a winner in my book.  Plus with the APIs being released recently, it will only get better with further third-party support and features.", "verified": true, "helpfulness": "0/0", "author": "Brian Northrup"}, {"rating": 3.0, "review": "Great service and delivered fast!!!  Sorry to bust Google's balls on your review.  Chromecast is very limited in functioning on iPad other than Youtube, Netflix and Vevo.i thought I would be able to stream from my Chrome browser from my ipad 4,  my mistake.  I don't use Netflix.Seller was great!!!this product isn't quite ready to be used as a true HD streaming device for everything just yet.  Hopefully more apps and the browsers will be compatible diwn the road.", "verified": true, "helpfulness": "0/0", "author": "Jon Steinhauer"}, {"rating": 5.0, "review": "Stream any videos, if you open the video in your Chrome browser.Stream many apps, if they have Chromecast support.I enjoy using Netflix to the TV from my iPhone.  The Apple TV's are more expensive and don't really do much more than the Chromecast.  Especially, once the Chromecasts mature...Apple TV gives you very specific things you can do with zero flexibility.  I own an Apple TV and use it for certain things.  But, for the other TV's, I love this little Chromecast.", "verified": true, "helpfulness": "0/0", "author": "J. Keefe \"Techie that expects more\""}, {"rating": 5.0, "review": "The only way to make this any better would be to have all things Chrome compatible.  It currently doesn't work with Amazon or ESPN.", "verified": true, "helpfulness": "0/0", "author": "Katie Hall"}, {"rating": 5.0, "review": "This was a little bit tricky to set up because the directions are not very clear.  After we finally figured out how to control it from my iPhone instead of my laptop its great!  While my kiddo's were watching a movie this past weekend I went to run an errand and I forgot my phone was running the movie,  it did not turn off even tho I was 5 miles away and gone for 30+ min.!  So great!!", "verified": true, "helpfulness": "0/0", "author": "Beth Leonardo"}, {"rating": 5.0, "review": "We recently added a TV in our bedroom, but weren't keen on paying for an extra cable box. We thought about buying another blu-ray player or a streaming device. We looked into the others on the market - for the price and for what services we actually use, it seemed that the Chromecast was worth a shot. For such a seemingly ridiculously low price, we figured there was nothing to lose.The Chromecast is perfect for us. We were primarily interested in streaming Netflix and Amazon Instant. Netflix is super easy, and the Amazon Instant isn't hard - we just stream directly from the Chrome browser.Best $35 we ever spent! There is a lot of potential in the Chromecast - looking forward to future models!", "verified": true, "helpfulness": "0/0", "author": "Julia H"}]