[{"rating": 5.0, "review": "My husband love it", "verified": true, "helpfulness": "0/0", "author": "Mumi"}, {"rating": 1.0, "review": "Total piece of crap stopped working went black screen after 3 months use. Thank you Amazon for carrying and selling garbage.", "verified": true, "helpfulness": "0/1", "author": "Stacy L Tyler"}, {"rating": 4.0, "review": "Works well, installs easily. A little lag casting Netflx and FF/REW controls are missing form app, May be Netflix issue not Google tho", "verified": true, "helpfulness": "0/0", "author": "Kevin C."}, {"rating": 5.0, "review": "can't believe I waited so long for this. now my bedroom tv is a multimedia device!", "verified": true, "helpfulness": "0/0", "author": "Peter S Ferreyra"}, {"rating": 3.0, "review": "I bought a Roku also.  They're both pretty much the same thing.  I like that that the Roku has a remote and I don't have to get my phone out and navigate to an app.  I'll keep them both ... one for home and one for when I have to travel.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "I use this in my bedroom.  It's awesome.  I connect my ipad to it and watch shows on Netflix and HBO.  GREAT for the price.", "verified": true, "helpfulness": "0/0", "author": "Audi"}, {"rating": 5.0, "review": "This is the best streaming dongle out there. The use of your phone allows you with more functionality and you can cast you entire screen using lolipop. You can use the USB port on the side of the TV or it comes with a long enough cable to use the an outlet if that works better for you. You can easily control the volume from your phone to quickly change the volume and you can still use your phone for anything you want while casting something. The only thing this is lacking is support for Amazon Prime Instant Video. That is the only benefit that the Fire TV has over this. There is no learning curve to this because it is just like using your phone.", "verified": true, "helpfulness": "1/1", "author": "good game fun"}, {"rating": 1.0, "review": "Wack", "verified": true, "helpfulness": "0/5", "author": "Bobby D Ephram"}, {"rating": 5.0, "review": "Love it !! Perfect for my tv", "verified": true, "helpfulness": "0/0", "author": "Sindy Nuesi"}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "Fernando Ferrari"}]