[{"rating": 5.0, "review": "This product does just what it's intended to do; stream TV programs and movies.  It can, however, overheat from being plugged directly into the stereo system amplifier (which caused the streaming to fail), but I cured this with the short extension adapter it came with.  A great product for the price.", "verified": true, "helpfulness": "0/0", "author": "S. Mitchell"}, {"rating": 5.0, "review": "I've bought two so far and will buy more. This is a god send. And to be able to control it with your cellphone is amazing", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "It's an easy set up. the only issues is a delay from my chrome book but from my desktop it is seamless.", "verified": true, "helpfulness": "0/0", "author": "Hun"}, {"rating": 1.0, "review": "I was excited to get this, but really quite disappointed with it after trying it out. My internet is by no means too slow to stream as I use my Roku daily and stream Prime movies in HD all the time, but this thing is soooooo slow. It's choppy and therefore I never use it. I would rather use my laptop and an HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Delightfully Daisy"}, {"rating": 3.0, "review": "It craps out a lot and the quality of the stream when you're not using the approved apps is pretty bad. It does an okay job of streaming apps like Netflix, Youtube and HBO GO without interfering with your laptop/computer usage though. Only complaint is that you have to exit out of the app, press the back button in your browser, and select the next episode of whatever you're watching. Kind of inconvenient for a binge show watcher like me...24 hour customer service line is pretty useful/necessary since there are a lot of functionality issues.", "verified": true, "helpfulness": "0/0", "author": "Vivi Nguyen"}, {"rating": 5.0, "review": "The price is reasonable, and the Chromecast setup is very quick and easy. Just plug it in and set up your Chromecast account. The mobile app is also a nice feature, so you can use your phone to select and play videos on your TV. Super easy, and it works well.", "verified": true, "helpfulness": "0/0", "author": "BB_MKE"}, {"rating": 5.0, "review": "One of our TVs in the house is not a smart TV, so we bought this to watch Netflix and Hulu.  It works incredibly and it is so easy to pull up either Netflix or Hulu on our smartphones and stream it to the Chromecast.  Was also very easy to set up.  Love it!", "verified": true, "helpfulness": "0/0", "author": "thefayray"}, {"rating": 5.0, "review": "Love this ... it is my second one for my home, haven't yet hooked up but the one I hv already works great!", "verified": true, "helpfulness": "0/0", "author": "NancyL \"THE MOM\""}, {"rating": 3.0, "review": "Works great so far. However, we bought it to work with our iPads and it does not support browsing from an iPad yet, only from a laptop. That was a big disappointment.", "verified": true, "helpfulness": "0/0", "author": "Book Junkie \"Book Junkie\""}, {"rating": 5.0, "review": "Chromecast has a few limitations:Inability to cast from Android devices (phones & tablets) below KitKat OS.Other than that, since I got my new KitKat phone (Moto X) I've been able to cast just about anything I can look at on my phone!I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]