[{"rating": 5.0, "review": "So easy to set up", "verified": true, "helpfulness": "0/0", "author": "gkgrl \"gkgrl\""}, {"rating": 5.0, "review": "If you are a \"cord cutter\" who is looking to ditch cable like more and more people are looking to do, this product is for you.The build of this box is superb. It is very sturdy feeling, and compact in size. The inputs in the rear hold cables very snug. The remote is light and doesn't need to be pointed directly at the box. In fact, I have the actual box inside of an entertainment center cabinet and never have to touch it.The Fire TV couldn't be easier to use. You simply plug the thing in, follow the quick tutorial, and it's ready. It comes pre-installed with your Amazon account information. The controls are super simple and the menu is laid out intuitively. The voice command is really handy as well.Overall, I highly recommend the Fire TV to anyone looking to replace, or even supplement, their cable TV. It is a fantastic product, especially for the price.", "verified": true, "helpfulness": "1/1", "author": "B. Cook"}, {"rating": 3.0, "review": "Need to add more movies , what the point in paying 100.00 a year for poor selected movies.I won't be doing it anymore..", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer \"nikki\""}, {"rating": 1.0, "review": "Amazon stopped selling Apple TV on Prime just because it's competition? Lame! Anyways, I've used both and Apple TV is leaps and bounds better!", "verified": false, "helpfulness": "1/11", "author": "Matt"}, {"rating": 1.0, "review": "My Fire TV cuts off half of the characters heads if the picture fills most of the TV screen.  If I adjust the picture so that I can see all of the characters heads, the picture fills only about half of my V screen.  I contacted Amazon help - and they were no help.  I am debating returning my Fire TV and going to Best Buy for a Roku", "verified": true, "helpfulness": "0/5", "author": "Pumpguy18"}, {"rating": 4.0, "review": "Haven't started using it yet, easy setup and fast loading, wish it had the \"Dramafever\" app", "verified": true, "helpfulness": "0/0", "author": "Russell King Jr"}, {"rating": 5.0, "review": "Much easier and faster to use than Smart TV controls and keyboard. I love it.", "verified": true, "helpfulness": "0/0", "author": "S. A. Hubans"}, {"rating": 1.0, "review": "Sorry, but ours was defective and had to return it. But our refund was given with no problems.", "verified": true, "helpfulness": "1/6", "author": "Rex Ray"}, {"rating": 1.0, "review": "I dont have a review but a question do u need internet in order to use the Amazon fire TV", "verified": false, "helpfulness": "1/18", "author": "Toyarn S."}, {"rating": 1.0, "review": "Ordered as a gift. He is overseas , could not get it working", "verified": true, "helpfulness": "0/8", "author": "Thressa burley"}]