[{"rating": 5.0, "review": "Much easier to watch on the TV than streaming online.  Going to buy one for a dear friend of mine.", "verified": true, "helpfulness": "0/0", "author": "Michael Alan"}, {"rating": 5.0, "review": "I purchased Google ChromeCast a couple of months ago. My husband watches a lot of TV and enjoys the older films but he was unable to remember how to work the ChromeCast. There are several steps to get the movies to work on the TV. We found the Amazon Fire TV to be much easier.When I purchased the ChromeCast, it took me a couple of days to figure out how it worked, but with the Amazon Fire TV, I was able to plug it in, go to the HDMI3 and everything was there ready to go.We watched an older film the first night we had the Amazon Fire TV and the color was magnificent and the reception is wonderful.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm not going to write a huge review but I love the Fire TV. I was skeptical at first because I wanted to keep my WD live to play from windows shares but then I read that I could just run a Plex server from my desktop and stream directly from my Tv with no problems.I love the interface, I love how easy it is. Amazon hit a home run.I'm not sure it's worth leaving Roku for but if you are on the fence I think the Fire TV is awesome.", "verified": true, "helpfulness": "2/2", "author": "EBaumann"}, {"rating": 4.0, "review": "Amazon's Fire TV works fine, but the voice search feature doesn't search NETFLIX at present.  Adding this ability would greatly enhance the usefulness.", "verified": true, "helpfulness": "1/1", "author": "Justin Hillsten"}, {"rating": 5.0, "review": "Fire TV does what Amazon promised. That says a lot for the company and the product! I look forward to watching what I want, when I want.", "verified": true, "helpfulness": "0/0", "author": "Douglas E. Hahn"}, {"rating": 5.0, "review": "I'd been using my Visio TV and Sony BP to stream online content including Prime movies.  Those devices were so slow and sluggish to the point that I'd considered online streaming was a immatured technology and my Prime benefit would be just for free shipping.Well, this Fire TV has changed by view completely with its performance.  I love my new toy. I found myself spending lots of time browsing around online video contents with it and enjoying every moment.  It's very pleasant to use from the touch and feel of the remote controller to the device interfaces and the content quality that it's delivering.  I truly think at $99, it's a bargain.Here are a few things that I like the most:- High quality build on all the parts: box, remote, and power adapter- Extremely responsive interface and search, and voice search works quite well even with heavy accent- Not noticable wireless connection latency- Dedicated closed caption button which we can customize text and background settings- Video and sound quality are excellent; as good as blueray qualityHere are just a couple things that I don't like so far:- Like other reviews, not able to search across content providers.  However Amazon promises this update will come soon.  So it's OK.- Game controller is a bit expensive and not as good as Xbox controller (opinions from other reviewers). This prevents me from getting one, so I couldn't test game features on the Fire.All and all, I really like Fire TV.  I'd strongly recommend it if you're watching streaming content from other bundled devices like TV or BDP.", "verified": true, "helpfulness": "1/1", "author": "HUAN L."}, {"rating": 5.0, "review": "This item is excellent. Puts the instant in instant streaming video. Voice command is stellar as I havent had to repeat anything I search for. Amazon Watchlist function is great for putting the shows I find surfing the net during the day at  my finger tips on the Fire TV at night. No complaints about it after a full week of use.", "verified": true, "helpfulness": "0/0", "author": "Moose"}, {"rating": 5.0, "review": "all i can say is thank you its what we needed awsoooooooooooooooooome could have used it before thank you for this", "verified": true, "helpfulness": "0/0", "author": "Paul Glerum"}, {"rating": 5.0, "review": "I stumbled across Amazon's new entry into the media player market by accident and gawd am I glad I did!  Had just gotten a little mad money and thought \"if it doesn't work well I can return it, what the hey?\"  What a pleasant surprise!  It took me all of 5 minutes to get Plex onto the box after I set up the wireless connection (is there a bluetooth keyboard option in the works perhaps?) and most of that was just the time it took to select a payment form for Amazon's \"one-click\" payment using my iPad.  Just a quick voice search and there it was!I decided to look for other options after my custom built HTPC rig started acting up, skipping, jumping and just not playing some video files that had never been an issue before.  The Fire plays them all and flawlessly.  The only files it didn't play were very very old AVIs from my Girlfriend's college days.  Otherwise it works like a champ.  The Plex interface is familiar, if not as customizable as I'd like, but that's no fault of Amazon.  I'm sure there will be updates.For about $125 (don't let the price fool you, Amazon charges sales tax no matter where you are, and you have to add a buck for Plex unless you have it on your Fire Tablet already) this little bitty can't be beat as a plex box.  I've also seen others putting XBMC on it if that's your choice of media servers.So if you're looking at a new media box, give this one a shot!", "verified": true, "helpfulness": "4/5", "author": "roweniii"}, {"rating": 1.0, "review": "Highly recommended - if you can't log into Netflix after providing your login and password - it doesn't recognize your Netflix account - go to Amazon Fire setup - delete the Netflix app - reload the Netflix app - and it will work. I think initially the Netflix app sometimes gets confused with all the Amazon Fire updates - even after they complete.The Amazon Fire device works very well.Update 4/27/2014Unfortunately the good times did not continue - so it lasted about 2 weeks. The box began to insert noise into the video and then was incapable of producing a continuous video signal. To eliminate a potential LAN connection issue from the problem, I disconnected it from my LAN, unplugged it and then re-powered it up - it still, with no lan connection, could not generate the introductory video one gets on initialization. Lots of noise with flashes of video. Certainly a bad box. I attempted to return it for a replacement (as a defective unit) - but was only allowed to return it for a refund. I'm returning it for the refund and buying a Roku 3 instead.", "verified": true, "helpfulness": "34/37", "author": "rivertech \"rivertech\""}]