[{"rating": 4.0, "review": "Easy to use, and install. Only works with YouTube and Netflix. Would like to use it for other streaming channels.", "verified": true, "helpfulness": "1/1", "author": "Andrew J. Calvert"}, {"rating": 4.0, "review": "Works great! Nice little toy to have if your on the roads and traveling. Easy to set up, and will not kill the battery on your device because it doesn't actually stream from you Mac ,iPad etc . It finds whatever you played online and plays it itself. Only reason it's not getting 5 stars is because when you unplug it and bring it to a different Wifi network it will not show up with a \" would u like to join this network ?\" Question. It only remembers the last network u were on so every time you get on a different wifi network you have to go back and set it up every time like it's a new devise, and it's the first time u plugged it in. Not a big deal it only takes about 4 extra minutes, but if u leave it plugged into ur tv on the same network all the time u won't have this issue.", "verified": true, "helpfulness": "1/1", "author": "Eric Swieca"}, {"rating": 1.0, "review": "does not work well. easy to set up but does not play things off tablets and computers like the ads protray", "verified": true, "helpfulness": "1/2", "author": "Kate W."}, {"rating": 5.0, "review": "I have just had this just a short time. I very happy with being able to use it for viewing Netflix movies. It loads fast and works great.", "verified": true, "helpfulness": "1/1", "author": "Ken"}, {"rating": 2.0, "review": "So I can send Pandora and YouTube to the chromecast, but \"Tabcasting\" doesn't work.  It is not supported?!  This came as a surprise and a shock.  Had I known/realized this was the case I wouldn't have purchased it.Installation was bizarre.  Had to try four different items (laptop, desktop, 2 tablets) before hitting on the one that would install.  The process on each of the four was different and confusing, at one point I was given an instruction that was not understandable by me.  It was in English, but I don't think it had all the components of an English sentence, you know a subject and a verb etc.  I stared at it for five full minutes before moving on to a different device.  I still don't know what they wanted me to do.", "verified": true, "helpfulness": "1/2", "author": "Noah Tall \"NoahTall\""}, {"rating": 5.0, "review": "Has many uses and it always reliable and I like the fact that for all it's functions I can't n use the music phone.", "verified": true, "helpfulness": "1/1", "author": "henry"}, {"rating": 4.0, "review": "This device is awesome and allows you to stream quite a bit. However, things like personal videos are not yet allowed to be streamed, hopefully there will be an update that allows the streaming of that and soon there will be more and more 3rd party support for streaming as Google just released the SDK.", "verified": true, "helpfulness": "1/1", "author": "Justin V"}, {"rating": 4.0, "review": "It is impossible to argue with the price point of the quality of the Chromecast device. For a mere $35 or so bucks, you have the ability to stream all your content from your multiple devices to your TV .... the only catch is iTunes content doesn't work with the Chromecast. So for all of you that have multiple bits of media within iTunes, the Apple TV might be where you might want to spend your money.Overall, I find that the Chromecast's best use is on apps like Netflix and HBO Go because it serves as a full-screen substitute for watching on the iPad or CPU. Apart from the iTunes content restriction it's we worth a purchase!", "verified": true, "helpfulness": "1/1", "author": "Brian"}, {"rating": 4.0, "review": "By far the easiest piece of equipment I have ever used to view videos. And, I can transfer it from one TV to another with no problem.  I love it", "verified": true, "helpfulness": "1/1", "author": "Willie"}, {"rating": 5.0, "review": "I love the chrome cast , it allows me to have video on the browser go to my television. Its a real money saver.", "verified": true, "helpfulness": "1/1", "author": "smthaxter"}]