[{"rating": 3.0, "review": "the power cord is bent a little and keeps coming off.  Not sure what all we can do with it.  So far all we have done is watch Youtube video on it.", "verified": true, "helpfulness": "0/0", "author": "ashlyn"}, {"rating": 5.0, "review": "Gotta have one of these babies. The ultimate viewing convenience!", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "This is a great device for streaming and screen sharing. I have two of them: one for the family room and one for the bedroom. I use mine mostly for video streaming of Hulu Plus, Netflix, MGO, VUDU, Google Play, Flixster, YouTube, and Disney Anywhere. I also like the screen sharing ability from my Nexus Tablet. I occasionally read digital books to my 3 children; screen sharing to the big TV screen makes it easier and more fun. As for photo viewing from iOS, I back up my photos to Google+ and view the pics from there. The same goes for videos. All this takes place natively from my Nexus tablet (audio and video). It also works well for audio streaming using Pandora and Google Play.Negatives:The biggest problem I have is the mandatory use of an app rather than the option of a separate remote. For example, I must have the Netflix app loaded on my remote device (tablet, phone) to load it to the Chromecast. This isn't a big deal, but sometimes it creates an inconvenience.This is a great device for the cost.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "What a disappointment... I don't know if it's my TV or what, but it doesn't take up the whole screen on my TV. Immediate deal-breaker. It also tops out at 720p, which is a pipe dream anyway considering it chokes under even minor, low-res streaming. I got this on sale and I still feel ripped off. Avoid this.", "verified": true, "helpfulness": "2/2", "author": "Brian Damage"}, {"rating": 5.0, "review": "Google rocks", "verified": true, "helpfulness": "0/0", "author": "Merrell Watts"}, {"rating": 4.0, "review": "Excellent! Only drawback is Chromecast cuts out when computer system is used for other purpose while video is being cast to television.", "verified": true, "helpfulness": "0/0", "author": "David G"}, {"rating": 5.0, "review": "Everyone who has an extra HDMI port (and a wireless device) needs this!  For the price this thing is amazing.", "verified": true, "helpfulness": "0/0", "author": "Christian Newcomer"}, {"rating": 1.0, "review": "We spent hours trying to set up on our iPhones, still doesn't work.", "verified": true, "helpfulness": "0/2", "author": "John Hone"}, {"rating": 4.0, "review": "It was a little more difficult to setup than expected, but aside from that it's been very convenient. I tried the Fire TV stick and was extremely disappointed by its performance and functionality. Between my Android devices and the Chromecast I can stream everything except Amazon videos to my TV (the selection is slimmer than Netflix and I can still use my Roku LT for Amazon video anyway). If you have Android devices and don't care about streaming Amazon video to your TV then the Chromecast is a good purchase.", "verified": false, "helpfulness": "0/0", "author": "One Guy"}, {"rating": 2.0, "review": "Not compatible with my internet service therefore it was a waste of money and time.  I stopped being cheap and just got Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Kgm25"}]