[{"rating": 5.0, "review": "This product is awesome!  Got it on all the TV's in our house and everyone loves it!!!  VERY Happy...  Cheap streaming...", "verified": true, "helpfulness": "0/0", "author": "Cloud Dancer2"}, {"rating": 5.0, "review": "There is so much great info out there about the Chromecast that if you're here reading this, theres probably little I can add, so I thought I would take this time to clarify some things that people commonly ask.Yes, this needs an external USB power source.  This seems to be a point of contention for some people.  This is a mini computer with a CPU, internal Wi-Fi controller and antenna, and the necessary video hardware to output 1080p video.  10, or even 5 years ago, to have a device that could do everything the Chromecast does, youd need a much larger box with an external power supply.  The fact that Google was able to cram all this hardware into such a small package is amazing.  I think the reason people are so surprised that this needs power is because of how small it is.  People look at it and think that since it looks like a thumb-drive, that it must work like a thumb-drive, when in reality, thats not true at all.When you plug in a Chromecast, you are plugging in a hi-tech mini computer into the HDMI port of your PC.  It needs power to work.The second point of contention that some people don't seem to like is that you must use a smartphone (or PC) to control it.  No, there is not a remote.  This isnt designed to be used with a remote.  If you want a standalone device that has a nice remote control, get a Roku or any one of the other dozen or so media players out there.The Chromecast doesn't have the app availability as other media players like the Roku, thats because this device is best used as a companion to your smartphone or PC.  Since its release, the amount of apps that work with it have more than tripled, but even still there are many that don't support it.You really should do research about what the Chromecast can and more importantly CAN'T do before purchasing it.  Its not for everyone.  If you want something for your parents to stream Hulu and Netflix without any fuss and works without any setup, this probably isn't a good device for them.But if you are a little tech saavy and use many media apps on your smartphone and want a cool way to display your media on your TV, this is a great device!  I use mine primarily for Plex and YouTube.  Its nice to be able to queue up a bunch of funny videos, Russian dash cam videos, and music videos and just let a playlist play.Overall, I am extremely happy with my Chromecast and can't wait to see what Google will come up with next!", "verified": true, "helpfulness": "1/1", "author": "Michael J. Eckman \"Mike\""}, {"rating": 5.0, "review": "Perfect!  Just what my family was looking for.  I am glad I held out and didn't waste money on an expensive smart TV.  They are not necessary with chromecast!", "verified": true, "helpfulness": "0/0", "author": "glenna niese"}, {"rating": 5.0, "review": "I purchased this just to see what it was all about.  The price was excellent.  Setting this up on my PC was a challenge but on the MAC it was easy peasy.", "verified": true, "helpfulness": "0/0", "author": "Matthew Daniels"}, {"rating": 5.0, "review": "Love it. Hooked up to my AV receiver in seconds and works as advertised. Doesn't have as many channels/apps as Roku which I also have but really great at what it does. Have used with android tablet and chrome browser.  Easily worth it.", "verified": true, "helpfulness": "0/0", "author": "Andrew Polsinelli"}, {"rating": 1.0, "review": "...I can't get this to work. Will be trying on TV in Hotel soon, which if like my last room, the side of the TV with needed ports will be accessible if I ask the TV be lowered. A techie friend said it was not perfected or ready for sale. We'll hopefully find that is not true.", "verified": true, "helpfulness": "0/2", "author": "BunnyLover"}, {"rating": 4.0, "review": "Great for streaming off any device. Wish it worked with amazon prime. If it did I would give it five stars.", "verified": true, "helpfulness": "0/0", "author": "h8 going to store"}, {"rating": 5.0, "review": "Awesome device. Needs more apps though. Im sure that will come with time once the SDK gets more attention. word", "verified": true, "helpfulness": "0/0", "author": "DankDarko"}, {"rating": 3.0, "review": "There isn't really a lot that can be done with this. Not enough Chomecast apps yet. My Roku can do a lot more.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "What I spected is the device.  Very cool and I love a lot because I don't need a new TV.", "verified": true, "helpfulness": "0/1", "author": "Miguel Green Camara"}]