[{"rating": 5.0, "review": "Quick, painless setup. Casts perfectly. Wonderful device.", "verified": false, "helpfulness": "0/0", "author": "Kenta"}, {"rating": 2.0, "review": "The iOS support is incredibly horrid.  Navigation on this thing is s***ty.Don't buy it.  Buy the Firestick instead.", "verified": true, "helpfulness": "1/1", "author": "Daniel Yang"}, {"rating": 5.0, "review": "good product and excellent attention", "verified": true, "helpfulness": "0/0", "author": "Ernesto Slully"}, {"rating": 3.0, "review": "In all fairness, this is a nice product.  It works well.  It's small and compact enough to move around easily.  And I can control the playback and TV volume of what I'm watching, from my smartphone, computer, or tablet.  But I'm biased.  I've got the Google Chromecast on my TV in the kitchen and the Amazon Fire TV on the TV in the bedroom.  Given the choice: I'd much rather use the Amazon Fire TV device leaving my smartphone available for other things.However, one advantage of Chromecast is that it can be used to stream any source that you can playback on your laptop, tablet, or smartphone directly to whatever TV it's plugged into.  For business use, this means that visitors can stream their Powerpoint presentations or marketing videos directly to the TV in the conference room -- no need to hook up an HDMI cable and string it across the room.", "verified": true, "helpfulness": "0/0", "author": "P. Swarthout \"Computer Junkie\""}, {"rating": 4.0, "review": "I bought this specifically so I could broadcast CBS.com to my TV.  The CBS app for my Roku requires a subscription for recent content that is free on the computer and tablet, so I thought I would give this a try, since it will pay for itself in 6 months.  I'm impressed.  It's easy to set up and use, and there is something to be said for controlling the content from a tablet or phone.  Plus, it's just hard to beat the price.  The one thing it will not do is Amazon Instant Video from my iPad, which was not a surprise, since Amazon is a competitor.", "verified": true, "helpfulness": "0/0", "author": "Camp Runamok"}, {"rating": 5.0, "review": "This has helped my family cut the cord and go without satellite or cable. It's very easy to use and a no-brainier if you have an android phone/tablet and a chrome browser on your PC. This has actually saved me money by not having to pay for cable anymore.", "verified": false, "helpfulness": "1/1", "author": "Jeanne Cervantes"}, {"rating": 3.0, "review": "Does not compare to the Roku, even with the software updates.", "verified": true, "helpfulness": "0/0", "author": "Ash Xan Howard"}, {"rating": 1.0, "review": "Warning - Does not work with Verizon FIOS.  What a waste of time and money to try and get this thing to work.", "verified": true, "helpfulness": "0/1", "author": "venicebeachy"}, {"rating": 5.0, "review": "I'm about 2 weeks from getting rid of my Direct TV. Thanks! However wish there was an On and Off Switch", "verified": true, "helpfulness": "1/1", "author": "Brandon Brugada"}, {"rating": 4.0, "review": "I bought it but returned this item immediately as i dont have too many android gadgets at home. and apple tv would be something more appropriate for my house.But this is surely good with Android", "verified": true, "helpfulness": "0/0", "author": "Swtz Hrtz"}]