[{"rating": 3.0, "review": "After several days of trying I can see it on my screen and on my tablet BUT I can't figure out how to watch anything???I guess I will give it to my daughter and see if she or any of her kids can make it work.", "verified": true, "helpfulness": "0/0", "author": "C9419"}, {"rating": 5.0, "review": "Amazing!!! I got it when it was $22.99,which was way better than $35.00(the price at the store) its a better investment than buying a hdmi cable.  Trust me 😃😃👍👍", "verified": true, "helpfulness": "0/0", "author": "Trinity"}, {"rating": 5.0, "review": "This thing is fantastic, I love it because I can stream all videos from my PC to my Television wirelessly. This includes twitch.tv streams, online television shows, music (including spotify web player.) Really worth it.", "verified": true, "helpfulness": "0/0", "author": "Pizza__Steve"}, {"rating": 2.0, "review": "The concept is cool. Unfortunately I couldn't use it.To start with, the network was not detected, even when I had my router next to the chromecast. After much troubleshooting, I discovered that I had to change the channel of the router in order to be recognised.Then, when I put back the TV in my room the signal was not strong enough, even though my phone and laptop get the signal just fine. The extension cable and the power supply didn't help.Overall I am disappointed.", "verified": true, "helpfulness": "0/0", "author": "Mave Lao"}, {"rating": 5.0, "review": "Didn't know what to expect from this, but it's very useful!  You can cast anything from the laptop chrome browser onto the tv which is nice for things like PBS website videos and if your friend with HBO Go comes over :)  You can also do photo slide shows from your laptop which is fun.", "verified": true, "helpfulness": "0/0", "author": "Janine M. Moore"}, {"rating": 3.0, "review": "Great concept, but stopped working in under a year.", "verified": true, "helpfulness": "0/0", "author": "Lora Ann \"lorasvi\""}, {"rating": 5.0, "review": "This thing is super! Anything My smartphone can play i get flick to the tv. I have used a blueray player for my netflix. This thing gives me more control and access then my blueray player with all the apps. Works for any streaming site....", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "just plugdid it in and streamt my movies scrait from my fone.  It workdid like majik!", "verified": false, "helpfulness": "0/1", "author": "Mugshot"}, {"rating": 4.0, "review": "Can't beat it for the price. I like the convenience of pulling up media on my phone and casting it to my TV. I don't even use my Roku anymore. Plus the slideshows are nice.Problems:- The Netflix app is supposed to cast to it, but does not. The remedy is to open Netflix in Chrome on a Mac/PC and cast it from there.- When plugged into my Toshiba LCD TV, the TV turns on automatically. Somehow, the Chromecast dongle is turning on the TV via HDMI. The remedy is to unplug the power from the Chromecast when not using it (it uses micro USB, so I sometimes use it to charge my Nexus tablet when the Chromecast isn't in use).", "verified": true, "helpfulness": "0/0", "author": "EK"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Marlone"}]