[{"rating": 5.0, "review": "The item was everything I expected plus more. Very easy set up and quality of item was absolutely superb! Always a great pleasure conducting business with google/amazon!", "verified": true, "helpfulness": "0/0", "author": "Angel Baby"}, {"rating": 5.0, "review": "Super easy to set up, and works great! I love being able to watch HuluPlus and listen to Pandora from my tv when I'm moving around the room/house. Just makes it easier than having it on the computer.", "verified": true, "helpfulness": "0/0", "author": "Raechelle"}, {"rating": 3.0, "review": "I bought this because I didn't want to spend the money on a second Apple TV. It works well, and it looks nice through HDMI, but there really aren't enough choices for the average person. I know they make all of those \"Get the Most Out of Your Chromecast\" books, but I don't have time for that. It doesn't support enough apps at the moment, and since I got it in October, there really haven't been many added. Certainly not as many as I was hoping for. I use the apps on my iPhone and a lot of the time, apps like Netflix don't recognize the Chomecast right away, or they'll lose contact with it mid way through the movie, and you have to shut it off and start over. Just seems like it has a lot of bugs to me, I wish I had spent the extra $10 for a Roku.", "verified": true, "helpfulness": "0/0", "author": "Nikki R."}, {"rating": 5.0, "review": "A little limited in Apps supported.  Hope there will be a site that lists all apps that are chromecast compatible.", "verified": true, "helpfulness": "0/0", "author": "History Reader \"klf\""}, {"rating": 5.0, "review": "These little media streaming devices are great, I have purchased four of them for every TV in my house except for one. They are very easy to use and a kids love using them. I'm sure with time they will only get better!", "verified": true, "helpfulness": "0/0", "author": "Torrance Clemmons"}, {"rating": 5.0, "review": "I have used many different devices to stream netflix (Smart TV, blu-ray, HTPC) and the chromecast is by far the best. The only thing I hope they add is more sports support (MLB.tv and if there is any justice in the world NFL Sunday Ticket)", "verified": true, "helpfulness": "0/0", "author": "John Ranz"}, {"rating": 5.0, "review": "Great device!  Allows us to watch Netflix on our television rather than on the computer, I recommend it to everyone who enjoys streaming!", "verified": true, "helpfulness": "0/0", "author": "Lylah G Saunier"}, {"rating": 3.0, "review": "watching this device function on commercials would suggest you can view everything on you iPhone/ iPad not the case. You can only view items that are driven byGoogle", "verified": true, "helpfulness": "0/0", "author": "Richard M."}, {"rating": 3.0, "review": "I have mixed feelings about my Chromecast.  It works great with websites that have a dedicated Chromecast button on the media player.  Unfortunately, (are you ready for a laugh?) it doesn't work well with Google Chrome.  In Google Chrome this is called \"tab cast\" and there are thousands of people just like me that can't tab cast on a Windows machine.  I can not speak for Android casters.  I have android systems but I do not cast from them. In an attempt to help my online brothers and sisters out there, I will list the sites that I know work and those that don't.Working:  Netflix, Youtube,Not Working:  HBO GO, And Any site that relies on Google Chrome to work.Not sure:  HULU", "verified": true, "helpfulness": "0/0", "author": "M. King"}, {"rating": 2.0, "review": "The problem with Chromecast is that each streaming provider must provider their own software to control the Chromecast. Some providers have awesome software such as Netflix and YouTube for example. You can control Chromecast easily from your phone or laptop using custom software.Some providers have pretty crappy software such as Hulu. I couldn't get Hulu's software to work from my phone or my wife's phone. Only my work tablet was supported and Hulu doesn't support laptops either!Some providers, such as Amazon, are not supported at all (except through tab casting, which uses the web browser and is so choppy it's unwatchable.)For now, my Chromecast is gathering dust and I've reverted to just plugging my laptop's hdmi out into my TV.", "verified": false, "helpfulness": "0/0", "author": "Alexander Jhin \"DoomGoober\""}]