[{"rating": 1.0, "review": "Don't waste your time!  Never could get the thing to sync with our iPad and Vizio tv! Slowed the Internet connection way down!", "verified": true, "helpfulness": "0/2", "author": "kb1"}, {"rating": 5.0, "review": "This is good, and getting better as more apps are released that support it. We occasionally have family chromecast night where we take turns sharing YouTube videos from our mobile devices over the chromecast. Beats tv a lot of times. Now with a new app I can stream my music to it so when playing a game at the kitchen table, I can control from my phone what music is playing through my system.", "verified": false, "helpfulness": "0/0", "author": "M. A. Reif \"FoFa\""}, {"rating": 4.0, "review": "It's great. Get one.", "verified": true, "helpfulness": "0/0", "author": "Jana Dexter"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Darryl Chan"}, {"rating": 5.0, "review": "Somewhat skeptical at first, now I absolutely love it! Netflix, HBOGO, YouTube, Play, phone… anything I want to play or share on a TV I can instantly. Going to order more for my other TV’s.", "verified": true, "helpfulness": "0/0", "author": "Chris Sam"}, {"rating": 5.0, "review": "Use it ALL THE TIME, great little product, highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I don't know what kind of wifi router and devices you need to decently stream from a laptop, but definitely the RT-AC66U and a retina 13\" early 2k14 macbook pro won't do.My 2014 edition samsung note 10.1\" had a few hangups here and there on YouTube.While this may sound like an apple fanboy thing, I can assure you it's not: I got used to the Apple TV not having much trouble streaming my laptop's screen outside of the .6 to .8 second delay. That delay makes it almost impossible to hit a specific, small portion of your screen with your cursor, if you're just looking at the TV. Maybe Chromecast 2 can do better? If the Apple TV can, the technology is already on the market, Google just has to use it.Overall a great idea, and definitely priced right, however, you're not going to get great use out of this, even if you're rolling on a gigabit wifi.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Best electronic I've ever bought for this amount of money. I use YouTube A LOT!! Very active subscriber, and I love being abel to make a TV Queue playlist. Very happy to see so many major companies starting to support it. Even Vudu now! Looking forward to Amazon Prime maybe supporting it in the future", "verified": true, "helpfulness": "0/0", "author": "Reony Tonneyck"}, {"rating": 3.0, "review": "very limited", "verified": true, "helpfulness": "0/0", "author": "Shawn Chen"}, {"rating": 5.0, "review": "Good product as advertised.", "verified": true, "helpfulness": "0/0", "author": "Dobrenoc"}]