[{"rating": 4.0, "review": "This device gets a lot right! For anyone without a 1) Smart or wifi enabled TV or 2) wifi enabled bluray player, just like my parents, this thing nails it on the head.For all the apps I have tried so far (netflix, youtube, hulu+) it runs seamlessly and flawlessly so far. The streams are superb quality from audio and video (hd), there is no lag, the sync is perfection!For the intended use I purchased it for, it falls short of my expectations. I purchased this for the ability to stream my PC content to the TV. Now, I'm still toying with it, there may be some things on my end to clear up, and Google could very well solve this problem themselves with updates to the device. BUT, the problem with this intention is that it does not stream perfectly (dealbreaker) or even half that for my standards. The video is constantly jerking, the audio isnt syncing hardly at all. No matter if I choose the 480p option instead of 720p makes no difference in the stream quality. I attempted to optimize my PC to make it run better, but man, if our PC cant do it then your average PC wont either.There is only one solution I havent tried yet (too much trouble, would rather just break down and buy a wifi enabled blu ray player) is to move the PC/router closer to the TV (its going from one end of the house to the other). This could very well be my problem, but I just dont think that to be the case.So, like I said to start with, this is an awesome device, more than capable of warranting the $35 it cost. It just doesnt fulfill my expectations to the degree I would like. If there is ever a fix/workaround for this then I would give this device 10 stars out of 5!!!", "verified": true, "helpfulness": "0/0", "author": "matt1272"}, {"rating": 5.0, "review": "I just see this getting better as they add more apps and eventually entirely release it for everyone to program in.  We do not have cable and it is great to be able to use one of our phones or tablets to either start up Netflix or build a TV Watch List on the fly.  I also like that I can take it and set it up and any of my friends house with very little hassle.", "verified": true, "helpfulness": "1/1", "author": "Blake Morris"}, {"rating": 5.0, "review": "I love this little gizmo.  I have one on every tv in every room.  Works like a charm, simple to set up and fast to connect.  Run it from a laptop, iPhone, iPad, or iPod.  I have a multiple account from Netflix so the kids have their own and can watch in their room what they want to watch and not clutter up my recommendation feed.  A Slick device for pennies.  I can't say enough good things about this device.", "verified": true, "helpfulness": "1/1", "author": "Fab \"O\" Louis"}, {"rating": 5.0, "review": "good pakeged~", "verified": true, "helpfulness": "0/0", "author": "kim zesan"}, {"rating": 3.0, "review": "some 2.5 sec of d-late of the pic, easy to used and install.hope goole will contact me , i have new and better idea and and improve, will make them billions.", "verified": true, "helpfulness": "0/2", "author": "adam"}, {"rating": 5.0, "review": "To start off the only complaint I have is that I originally bought it thinking it would work with Vista 64bit. It works with windows 7 and higher. It works flawlessly and is amazing for me because my computer is in one room, the big tv in another and me and my girlfriend can sit and watch netflix and other streaming media things in the living room now :).", "verified": true, "helpfulness": "0/0", "author": "shawn knowlton"}, {"rating": 1.0, "review": "This is very bandwidth dependent, from what I understand you are streaming from the internet to your computer back to your wireless network and then to the chrome cast.  Maybe that's not how it works.  Either way, the video on the computer and what is being played on the chrome cast are way out of sync, and it hangs a lot.  The Roku LT was just on sale for $36.99.  If you're looking to stream from a standard app like Netflix or Hulu, go with that instead", "verified": true, "helpfulness": "1/2", "author": "Mark v James"}, {"rating": 4.0, "review": "Works great for video off youtube and google play. Have found a app that will let me play most of my videos off of phone. Main reason it has not received 5 stars is the lack of apps and no way to mirror phone to it. But that being said from what I have read it is still a work in progress and phone mirroring will probley be added in the fucture. But still well worth the $ and all that I played on it worked perfect.  Maybe someday will be able to use it to play games on tv. But for now limeted.", "verified": true, "helpfulness": "0/0", "author": "andy h"}, {"rating": 5.0, "review": "I love my Roku but honestly, if I had bought this first, I may never have bought a Roku.  The beauty of the Chromecast is that you know Google will continue to develop it.  Right now it is only useful for Netflix and YouTube but if Google wanted to they could open the doors to all kinds of possibilities.  You can't beat the price.", "verified": true, "helpfulness": "1/1", "author": "Paul"}, {"rating": 5.0, "review": "GREAT product.  I ended up buying a few a extra Christmas gifts this holiday season.  Works with all platforms but best for Android.", "verified": true, "helpfulness": "1/1", "author": "Shawn Naylor"}]