[{"rating": 5.0, "review": "It's a Chromecast. What more needs to be said. It just works and works well.", "verified": true, "helpfulness": "0/0", "author": "Tri-State Tech \"Tri-State Tech Consulting\""}, {"rating": 2.0, "review": "Waste of money for me.  I broke down and bought Apple TV (which does work well).", "verified": true, "helpfulness": "0/1", "author": "Carroll A. Davis \"Grandparent\""}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "papin"}, {"rating": 5.0, "review": "BEST CREATION EVER!!! I am so stoked on this product!!! I got one for myself and for my parents. They love it because they can play YouTube videos of some old Spanish movies of Pedro Infante and so on and that makes them very happy. I love setting up YouTube music video playlists or music playlists from my Google Play Music app! Along with many other things that I can do with this dongle, with numerous compatible apps out there, one of my favorites a Karaoke app!! I so strongly recommend this product! IT IS AWESOME!!!!", "verified": true, "helpfulness": "0/0", "author": "Carlos Agueda \"DiablitoSoy\""}, {"rating": 3.0, "review": "Assuming that you will be using a computer to stream to the chromecast..... it is more than likely you will have an HDMI port or VGA port on your computer. Just buy a cable and connect both devices it will be faster and cheaper.... however if you intend to use a tablet to stream  your video this will work fine.... But I must warn you that you need to have a very very fast internet connection... i have 15mb download and 5mb upload package from my internet provider and the video still lags and sticks while streaming. You cannot connect an audio device to your table or computer to play audio because it will be out of sync, due to the fact that the video you are streaming will be lagging..", "verified": true, "helpfulness": "0/0", "author": "Michael Khan"}, {"rating": 5.0, "review": "Setup was easy and within 5 minutes, I was watching a youtube video on my 65\" TV. The quality was VERY good. I tried a 1080p video...", "verified": false, "helpfulness": "0/0", "author": "Hansel"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Julio Nuñez"}, {"rating": 4.0, "review": "Not  what i expected but its very funcional.", "verified": true, "helpfulness": "0/0", "author": "Eliezer"}, {"rating": 1.0, "review": "Returned it. The device would jam up. Restarted several times, At times would not even be located. Streaming was good, but installation and recognizing the device a pain always.", "verified": false, "helpfulness": "0/2", "author": "Salman"}, {"rating": 5.0, "review": "EX ELENA PURCHASE.", "verified": false, "helpfulness": "0/0", "author": "Pablo Lanetti"}]