[{"rating": 5.0, "review": "Bought it but I had little use.", "verified": true, "helpfulness": "0/1", "author": "KK Ho"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/2", "author": "shivashankar"}, {"rating": 2.0, "review": "Chromecast does not want to work with a Verizon FIOS router connected to my desktop.  I was on the phone twice with Verizon's technical support people and I received a newer router that still did not solve the problem.  The support site that Google provides for Chromecast is not helpful either.  I should be able to wirelessly connect a desktop to a large screen TV, but it does not work as advertised.", "verified": false, "helpfulness": "0/1", "author": "Marina Pappas"}, {"rating": 2.0, "review": "Does not support Amazon Prime video and casting the tab result in very low quality video.", "verified": true, "helpfulness": "0/1", "author": "Matthew"}, {"rating": 4.0, "review": "confusing without good clear instruction.  works great once you figure it out", "verified": true, "helpfulness": "0/0", "author": "jollymom313"}, {"rating": 5.0, "review": "Streaming Netflix has never been easier.  A great product at a great price.", "verified": true, "helpfulness": "0/0", "author": "newportgirl"}, {"rating": 5.0, "review": "Ordered a second a few weeks later.  I love the simplicity.", "verified": true, "helpfulness": "0/0", "author": "Mattski360"}, {"rating": 5.0, "review": "The product is as I expected.", "verified": true, "helpfulness": "0/0", "author": "Diego Díaz"}, {"rating": 3.0, "review": "Wish there was a manual way to control the stream quality (1080p vs 720p). I have a old tv with vga in that is only 720p. Bought this & 3 different HDM-to-VGA adapters, but would not work as adapters tell Chromecast (CC) they can handle both 1080p & 720p streams, so CC chooses the best, ie 1080p to stream & my old TV just shows blank. Works great in my 1080p tv though. Wish CC will address this issue in the future by letting u select the stream quality manually under CC settings.", "verified": true, "helpfulness": "0/0", "author": "brijeshsshah"}, {"rating": 5.0, "review": "I use this all the time, very easy to use. Very nice to be able to send things from your phone/tablet to the TV.", "verified": true, "helpfulness": "0/0", "author": "notyours"}]