[{"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "use it all the time.But if you're reading reviews before making this purchase, you don't need to buy this product, because you won't figure out how to use this incredibly simple device, and I feel sad for you.", "verified": true, "helpfulness": "0/1", "author": "ray Conley"}, {"rating": 3.0, "review": "ITS OKAY!!", "verified": true, "helpfulness": "0/0", "author": "cherre"}, {"rating": 4.0, "review": "I like it but they have still some issues to solve.The first one should be to be able to cast from a chrome browser in an Android tablet.", "verified": true, "helpfulness": "0/0", "author": "Germán Capdehourat"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Oscar Gonzalez"}, {"rating": 5.0, "review": "Good device, but of course you need a strong wifi signal.", "verified": true, "helpfulness": "0/0", "author": "Cody Joe"}, {"rating": 4.0, "review": "nice job", "verified": true, "helpfulness": "0/0", "author": "Yongzheng Hu"}, {"rating": 5.0, "review": "I normally just take a few words to review an item, but had a hard time deciding when buying this so will try to be as helpful as possible.I was debating between this and the Apple TV.  I ended up buying both because it was Black Friday and got a good deal, and after having and using both, I can describe them well.You literally hook this up to the HDMI port on your TV and follow some simple steps to set it up with your wifi at home and the device you are using for it, this only takes a few minutes.  Then whatever you stream on your PC, tablet, smart phone, will show up on your TV.  So if you have netflix, Hulu, or anything else, you start it up on your device and it'll transfer to the TV, you use your smart device as the remote.You can't beat this for the price.  All I pay for now is good internet, and my Netflix and Hulu Accounts.AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "Alex W"}, {"rating": 5.0, "review": "a marvel of technology", "verified": true, "helpfulness": "0/0", "author": "Wilfredo Salcedo"}, {"rating": 5.0, "review": "No problem with this product.", "verified": true, "helpfulness": "0/0", "author": "Boris Shaevich"}]