[{"rating": 1.0, "review": "I have to give the Amazon Fire Tv a poor rating due to the fact there is no power button. You are supposed to be able to touch any button on the remote to bring box out of sleep mode, but I always have to unplug box from power source to make it work. Amazon customer service is the best. They immediately offered to send a new one over night and did so, buy unfortunately it did not work at all. When it does work it performs exactly as promised and is wonderful. But I can't recommend this product to anyone till they fix power issue.", "verified": true, "helpfulness": "1/5", "author": "donna williams"}, {"rating": 4.0, "review": "I love it! My only complaint is that there is not a \"start over\" option. It always picks up where you left off. If you come back to a movie that is rolling the credits, you have to rewind it to the beginning to start it over. I called customer service and was told they are working on an update for this but that was two months ago and I have not seen anything yet. Otherwise, I love it. And the voice option is super handy!", "verified": true, "helpfulness": "0/0", "author": "Mary Michael McDonald"}, {"rating": 4.0, "review": "I love this thing for streaming video content, it's fast and picture is always sharp and clear.  Definitely needs some type of well supported browser though.For gaming, there is huge disruptive potential here due to the excellent performance and the growing library of titles being offered.  A few of the title ports still need a bit of work but overall they work very well especially with the controller.  But with the pitiful storage situation it's almost completely moot.  You can cram it full of several dozen mini games.  But larger games with several gigs of data like the recently touted GTA series make it almost impossible to have more than one, maybe two of these type games installed at once.  I'm not sure what can realistically be done about this, unless the so-far useless USB port is actually USB 3.0 and they can open it up for additional storage.  Otherwise gaming on this device is a misfire, and I really don't know why they don't take it more seriously.  Who wants to delete all their current games and wait an hour to install another one over the Internet just to play something different?  Wait for a 32GB version before you can plan to amass any meaningful number of these size titles on the device.  Would have gladly paid $20 more or whatever it cost to have decent storage, sheesh.", "verified": true, "helpfulness": "2/4", "author": "Bradley Davis \"brad78\""}, {"rating": 5.0, "review": "Amazon Fire TV exceeded my expectations. The first voice command electronics that I found that really worked. Would recommend over all others.", "verified": true, "helpfulness": "1/1", "author": "Tony"}, {"rating": 5.0, "review": "This is a great streaming media player. I got it two months ago an so far we are very happy with it. It has a very fast processor which it in turn streams media super fast. It has a slick design and it is compact. I am so happy with Fire TV I am replacing cable TV all together.", "verified": true, "helpfulness": "1/1", "author": "Martin Mares"}, {"rating": 5.0, "review": "I have had apple tv and switched them for Rokus.  I tried the amazon fire tv and love it.  I never have to buffer shows like I do with Roku.  I press play on amazon instant and it just plays no waiting.  I also love the games It doesnt replace the Xbox but it comes close now with the addition of GTA Vice city and others.  My only concern is storage space, I know there is a usb slot but Amazon hasnt enabled it yet for storage.", "verified": true, "helpfulness": "1/1", "author": "YMB"}, {"rating": 5.0, "review": "First off let me say that I am a fan of the PS4 and I love to game on a serious level but this thing is great for the price! The gaming experience is MUCH better than I thought it would be and boy is it small! This thing produces NO noise and is about the size of one of your average smart phones. I do hope that Amazon will bring SlingPlayer to the Fire TV but that is the only complaint I have. Thanks Amazon for bringing a beautiful streaming/gaming device to the market!", "verified": true, "helpfulness": "2/2", "author": "MasterYi"}, {"rating": 5.0, "review": "Just a great overall product.  The box itself is small and sleek, very easy to carry around between TV's also for those who wish to enjoy TV in different rooms.  Setting everything up for viewing only took a few mins itself.  I like the amount of apps that is already available to use, and it's now my go to player for anything Netflix.  There should be a more organization for the Prime Instant Videos as there is only 2 sub sections that list that videos that are instant.  They should allow to search by genre and have a checkbox that allows you just to view Instant Prime Videos only without having to wade through alot of the paid movies and rentals.  Overall The product just works great and I'm sure they will improve it even more overtime with updates, and I'm hoping that the Prime Instant searching will be addressed soon.  We got the Fire TV for a Family friend that has muscular dystrophy, and the simple to use remote with the microphone allows him to select movies which is really a great feature.", "verified": true, "helpfulness": "1/1", "author": "Hugstable"}, {"rating": 5.0, "review": "Very easy to use.  The speaker app. is great and gives you fast choices. So many things can be done with this and better than watching the same old thing over and over on standard tv", "verified": true, "helpfulness": "1/1", "author": "sugar \"George\""}, {"rating": 1.0, "review": "This product doesn't function with a typical home, public, restaurant, airport, hotel, wifi system.  Any connection that requires you to enter your password after opening your browser, or to accept terms, this doesn't work.  I use XFINITY.com home internet and this doesn't connect because it is an OPEN network and when the browser opens you enter the password.  Amazon Fire TV has now browser and therefore you can't enter the password.  It tries to go straight to Amazon.com.  But, it can't because the password is missing.  But, you can't enter the password for an OPEN network until you get to the browser.Why don't they tell you this before you buy it?????  Now I get to find the UPS drop off so the return shipping label that they email me and I have to print can be used to return this worthless product!", "verified": true, "helpfulness": "2/15", "author": "Randy"}]