[{"rating": 5.0, "review": "Always great", "verified": true, "helpfulness": "0/0", "author": "GOICH \"SSG1\""}, {"rating": 5.0, "review": "Very fast compared to all of the other streamers. There's no competition.", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "Love it. More than I expected.", "verified": true, "helpfulness": "0/0", "author": "jw"}, {"rating": 5.0, "review": "I love it! I used Fire TV so much in the first few days, it more than paid for itself! Definitely recommend and am already singing its praises to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Terresa F. \"terresa2000\""}, {"rating": 2.0, "review": "So far, not very happy with this product. Was led to believe that there were MANY free movies available through Prime. Very disappointed!  I will try Netflix to see if that works.", "verified": true, "helpfulness": "0/1", "author": "PJ1"}, {"rating": 5.0, "review": "This item beat the Apple TV hands down.", "verified": true, "helpfulness": "0/0", "author": "Blake Hinrichs"}, {"rating": 5.0, "review": "Amazon Fire TV has exceeded our expectations!!  We love everything about it, the ease of use, voice activation and subtitles which we did not have running Amazon through our smart TV.  Another bonus is the ability to start streaming a show on my Kindle Fire HDX, pause it and continue it on our TV.  We would highly recommend this product to others.", "verified": true, "helpfulness": "0/0", "author": "Susan Strickland, M"}, {"rating": 5.0, "review": "Excellent. Turned my tv  into a Smart Tv", "verified": true, "helpfulness": "0/0", "author": "Lenore F. Kahn"}, {"rating": 5.0, "review": "I love this little thing.  Fast and accurate every time.", "verified": true, "helpfulness": "1/1", "author": "Seaweede"}, {"rating": 5.0, "review": "I have learned over the years that in order to get exactly what you want for Christmas you should just buy it yourself, so I did. I purchased the Amazon FireTV box and I've got to say this thing is awesome! All of my steaming apps in one place, Amazon Prime, Netflix and huluplus. In addition to that, I can cast things from my iphone apps to play on my TV, like Iheart radio, Spotify, YouTube and many more! Also it hooked up to my Bose home theater system too! I am so very happy with this purchase! Suck it TimeWarner Cable, who needs you? Very very happy with this purchase!!!!", "verified": true, "helpfulness": "1/1", "author": "Detour"}]