[{"rating": 4.0, "review": "Easy to install and to use.I use it mostly for Netflix, and I have One little nitpick. When I'm watching a series, I'd like to have a button to finish the current episode and skip to the next episode. This is actually an improvement that would have to be made to the Netflix android app, not the Chromecast itself.", "verified": true, "helpfulness": "0/0", "author": "Franklin Harper"}, {"rating": 5.0, "review": "This turns any HDMI device into a smartphone enabled media center.  It's Google... what more is there to say?  Outstanding.", "verified": true, "helpfulness": "0/0", "author": "Chris Keiser"}, {"rating": 5.0, "review": "Bought this straight from Google when they offered it with the free netflix. At first it was upsetting with the limited options of media to stream but since the SDK was released and more companies were able to access it, more apps came out. I use this in every possible way, Netflix, Hulu, Google Music and more recently, Plex for my own personal media. Additionally, there are many other uses for it such as for gaming with friends. QCast and 4pics 1 word are example games to check out. This dongle has a tremendous amount of potential and I'm glad I invested in it.I love the fact that my cell phone is my remote control. I am also able to turn my TV on and off including volume controls with my phone with it being an S4 it's convenient. As a roku owner, this is just all around better in my opinion. Some people expect so much, but sometimes... simplicity is best.", "verified": false, "helpfulness": "0/0", "author": "Vincent A. Rizzuto III"}, {"rating": 5.0, "review": "Low price, no continuing service costs, you can move it from TV to TV, Google Chrome works great, we use it to watch Netflix and YouTube all the time.  It is a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Get it it is such a good invention I use it almost every day it works great on YouTube Netflix and HBOGO app", "verified": true, "helpfulness": "0/0", "author": "Bilal"}, {"rating": 5.0, "review": "Great tool from Google.  They need to open APIs to third parties, but will likely do so.  Until then, it is a great tool for watching HBOGO, youtube videos, viewing pictures, and netflix.", "verified": true, "helpfulness": "0/0", "author": "CityDweller"}, {"rating": 5.0, "review": "Chromecast makes it easy to stream videos at anytime from all of my devices. I have never had a problem using it.", "verified": true, "helpfulness": "0/0", "author": "lexie"}, {"rating": 1.0, "review": "Easy to install but it only works with my iphone and not my ipad. I had to reinstall it twice within 3 weeks. I spoke to Google tech support who were no help at all.I have an apple TV which works better.", "verified": true, "helpfulness": "0/0", "author": "Gilad Ellenberg"}, {"rating": 4.0, "review": "I bought it mainly to watch Plex. It worked the first week and now it's been over 3 weeks that stopped working. I can watch YouTube and other things but not Plex. So I think the Chromecast is working just fine, plex not so much", "verified": true, "helpfulness": "0/0", "author": "Miguel"}, {"rating": 5.0, "review": "This is such a great way to share movies, music, pictures, personal videos, work documents, etc. I bought one for every TV in my house, and I'm working on integrating these into the conference room projectors at work.", "verified": true, "helpfulness": "0/0", "author": "AZR2nut"}]