[{"rating": 5.0, "review": "Best streaming device I've tried by far. Own 3. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "D. Scott \"dasny97\""}, {"rating": 4.0, "review": "Good overall, but seems to buffer an annoying amount on Saturday nights.", "verified": true, "helpfulness": "0/0", "author": "TheRealOne"}, {"rating": 4.0, "review": "Thought it would mirror the entire laptop. Works for majority of the things I am doing.", "verified": true, "helpfulness": "0/0", "author": "Woody Martin"}, {"rating": 2.0, "review": "Not clear how to get it to interact with my current internet system - have to hire someone to set it up.  I hear it's great once it works", "verified": true, "helpfulness": "0/0", "author": "kathy hunt"}, {"rating": 5.0, "review": "This is an easy way to enjoy media on your TV. It was very reasonable and easy to install in minutes ans set up.", "verified": true, "helpfulness": "0/0", "author": "Terri Hawes"}, {"rating": 1.0, "review": "I thought it can simply mirror the phone screen to the TV, it is not,  only works on certain app like Youtube, quite useless because most smart TV has their own youtube ad, why we need this product?", "verified": true, "helpfulness": "0/0", "author": "Brian Lin"}, {"rating": 3.0, "review": "Simple installation is a myth.  I still cannot get it to work from my computer.  It continues to say it can't find it.  Works fine from my phone, but not from computer.  There is no phone number to contact for help.  Online help is worthless.", "verified": true, "helpfulness": "0/0", "author": "M. S. Miranda"}, {"rating": 5.0, "review": "wonderful device but needs many more apps to support for a more wonderful experience", "verified": true, "helpfulness": "0/0", "author": "MALHAR NAIK"}, {"rating": 5.0, "review": "I bought it for my mother and she loves it. The beautiful images it shows while inactive are a big plus.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Tamalet"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Abdulkarim Ahmed"}]