[{"rating": 5.0, "review": "This is a great product. I also have a neotv in the house and if fire tv was out before I bought it, I never would have. It is very easy to set up and it is very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Awesome product! Responsive. Better than my old Netgear NeoTV", "verified": true, "helpfulness": "0/0", "author": "Erik Friedman"}, {"rating": 5.0, "review": "This does exactly what I wanted it to do", "verified": true, "helpfulness": "0/0", "author": "james Yoder"}, {"rating": 4.0, "review": "I love it but when I type something in to find it always says no match can be found. And I can't locate the search box", "verified": true, "helpfulness": "0/0", "author": "Carolyn Walstead"}, {"rating": 5.0, "review": "I love my Amazon Fire!", "verified": true, "helpfulness": "0/0", "author": "melissa weiss"}, {"rating": 5.0, "review": "I'm enjoying my amazon fire tv. so much and i would tell anyone tp get the amazon fire tv Im so happy that I got the amazon fire TV because there's so many interesting subjects to look up and view like cooking or you check out YouTube for fun or serious subjects, the movies you can watch, so if you don't have cable the amazon fire TV is the next best thing to have.", "verified": true, "helpfulness": "0/0", "author": "velmajharris"}, {"rating": 4.0, "review": "Its not bad at all, my kids stay busy the only thing is you need to have prime to make it more worth it all.  And certain things need you to still have cable to run by.  But I like it", "verified": true, "helpfulness": "0/0", "author": "Amanda Moore"}, {"rating": 2.0, "review": "It ok", "verified": true, "helpfulness": "0/1", "author": "Edward Astacio"}, {"rating": 5.0, "review": "Used HDMI cord for streaming. This is wonderful. has what I want. Voice search is very efficient and easy to use. Comparable to AppleTV in every way in my opinion. Choosing what and when my TV viewing will be is so cool.", "verified": true, "helpfulness": "0/0", "author": "Richard Anningson"}, {"rating": 1.0, "review": "They say you get a ton of free stuff and everything I see you have a charge for. I am a \"Prime\" member and watch the Fire TV hardly ever. I also have Netflix and Huluplus and only use the Prime for the box. I could've saved a bunch and bought a cheaper brand from the store.", "verified": true, "helpfulness": "0/1", "author": "Ann Jovanovich"}]