[{"rating": 5.0, "review": "I use this every night. It works very well as long as you have Google chrome updated.", "verified": true, "helpfulness": "0/0", "author": "Ivette"}, {"rating": 4.0, "review": "Great product but you have to putts around to set up?", "verified": true, "helpfulness": "0/0", "author": "BL Meyer \"BLMeyer\""}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "DCM"}, {"rating": 1.0, "review": "This item only worked for less than a month.  Then it started with continual buffering which will make anyone crazy.  I finally purchased a blu-ray player withwifi so that I can stream netflix with no problems.  I would not recommend this item to anyone unless they want to be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Suze"}, {"rating": 4.0, "review": "this is a game changer in watching tv...it is the first step is the death of cable tv...streaming all your shows to tv anywhere with ease is the way  to go", "verified": true, "helpfulness": "0/0", "author": "richi"}, {"rating": 5.0, "review": "I have 3 of these and they are great for the price.Update Aug 28 2015Since the Amazon fire sticks have come out we have switched to these. I still think the chromecast is a great product but I love the remote that is included with the fire stick and the extra features for around the same price. We have now moved all of our tvs to the fire stick instead but the chromecasts are still holding up just fine.", "verified": true, "helpfulness": "1/1", "author": "Jason & Kelly"}, {"rating": 5.0, "review": "GOOGLE CHROMECASTThe Chromecast is essential if you have a smartphone/Chromebook and an HDTV. It allows you to stream and control a variety of apps from your phone or computer on your TV without the hassle of an HDMI cable. It is compatible with most android phones with jelly bean (4.1) or later and most recent iPhone models as well as Chromebooks and other computers through the chrome browser.A decent assortment of apps are supported by the Chromecast. The user can watch Netflix, Hulu+ or listen to Google play music. Some apps on smartphones do not have support for Chromecast such as amazon's prime instant video, but new apps are constantly being added.The design and interface is nothing spectacular. Instead it is extremely simple and straightforward. Moving the watching experience from one's device to the TV is as simple as tapping/clicking the \"cast\" button. In addition to the Chromecast, the Chromecast app needs to be downloaded on a smartphone or in chrome. This free app allows for easy setup and access to settings.The Google Chromecast streamlines a living room experience allowing you to control the TV with your phone or laptop. Some may want a dedicated streaming box such as an apple TV, Roku or Fire TV. I found that the Chromecast allowed me to do everything I would with any other streaming box simply and with great ease. Rating 5 out of 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Silas H"}, {"rating": 5.0, "review": "This device is the best thing I have ever purchased on Amazon hands down.  Now if they could just get there Amazon Prime service to work with it!", "verified": true, "helpfulness": "0/0", "author": "Quincy"}, {"rating": 5.0, "review": "Excellent application I use it for Netflix , you tube , Pandora, vevo, Realplayer cloud", "verified": true, "helpfulness": "0/0", "author": "midwesterner \"Passingthru\""}, {"rating": 5.0, "review": "Came in a day earlier than expected. Works great.", "verified": true, "helpfulness": "0/0", "author": "Walker Gray Haun"}]