[{"rating": 5.0, "review": "I have just ordered my device, looking forward to getting it tomorrow. As I read all the features and I am sure that it will work as advertised, the question that I have is, how many Amazon Fire TV devices can be under one's account? I am looking to get these to use both at home and at the office. A reply from tech support (perhaps) will be highly appreciated.", "verified": true, "helpfulness": "4/19", "author": "Alexandru Denes"}, {"rating": 1.0, "review": "I am in the market for a Roku-type device.  Was very excited to read about this product and I'm sure it will suit my needs as soon as they get HBO GO.  Until then I am not interested as that is the streaming product that I use the most.", "verified": false, "helpfulness": "11/138", "author": "artemis25"}, {"rating": 1.0, "review": "Thanks but not thanks.Sorry, not a gamer.I'm happy enough with what I have and don't need another box.", "verified": false, "helpfulness": "8/203", "author": "David Neunuebel \"David Neunuebel\""}, {"rating": 5.0, "review": "Even though every feature might not be 100% perfect on day 1 (when I bought it), this product is a winner.  It has many advanced features.  I bet the kinks will be ironed out with a software update soon.Voice Search - This feature makes it a lot more fun to look for shows.  If I had to type in every title (without a real keyboard), I just wouldn't search that often.  Now, searching is so easy that I am sure I'll do it a lot more.Gaming - Finally real gaming without spending hundreds of dollars on a gaming system.  Thank you!", "verified": true, "helpfulness": "80/86", "author": "Lucy"}, {"rating": 5.0, "review": "Like most of the 1-star reviews, I do not own this device yet, though I plan to purchase it in the next few weeks. I will update my review then, but until then I have to try to balance out these ridiculous 1-star reviews.I've watched all of the videos about the Fire TV, and I have to say that it looks totally awesome. They are missing a couple of important apps, like HBOGO, but Comcast won't let me use the HBOGO app on my Roku either, so these things happen unfortunately. I have little doubt that over he next few months Amazon will add more apps, and I would expect HBOGO is one of their top priorities. But Fire TV has launched with many more apps than Chromecast (which I also own) did.The hardware specs on this device look amazing, much better than the other media streaming devices on the market. I look forward to seeing how far Amazon is able to push this device and using it myself in the near future.", "verified": false, "helpfulness": "13/26", "author": "Carter Hall \"DVD guy\""}, {"rating": 5.0, "review": "I bought a US Apple TV and use it with a US-based iTunes account from the UK (because I can, it's cheaper, and I'm a cheapskate.) Certain US-only sites (Hulu, NBA channel, etc) are blocked in the UK but NetFlix, iTunes, and most of the other stuff works and I'm happy with it. SO, what if I bought one of these from the US and used it with my US-based account (I have both US and UK based accounts) -- would it work the similarly to the Apple TV box? Why, you might ask, would I do this? (1) Multiple TVs, so I can hook the Amazon Fire TV up to a different TV. When I figure which one has maximum awesomeness, I'll put it on the most-watched TV. (2) If I can get all the cool Amazon-only features NOW, it's worth doing. (3) If I hook it up to my Amazon UK account in the future, I would hope to get the UK-only features since the US-only features are IP blocked. I want to have my cake and eat it too. Anybody know if I can do this or are the US and UK boxes somehow restricted to those markets? I doubt it, but don't know for certain. The power issue is trivial. THANKS.", "verified": false, "helpfulness": "3/12", "author": "T. Pressley \"Wanderer\""}, {"rating": 1.0, "review": "I have an HDMI cable so I already watch Movies, TV shows, and other videos on my TV straight from my computer, laptop, and sometimes my phone. Why would I want to buy this?", "verified": false, "helpfulness": "12/224", "author": "Edmund Cee R. Garman"}, {"rating": 4.0, "review": "My older review is below:I ended up not keeping the fire when purchased in April which was the launch of Fire if I remember correctly, and went back to Roku.Now I have permanently left Roku 3 and bought another Fire TV. Roku's DO NOT LAST!! I have been thru 2 of them and the warranty is only 90 days!! After much complaint they agreed to a one time replacement but I had to send it back first and then wait on the replacement. I am assuming that would apply even if under warranty but I don't know. (90 days for electronics!! shakes head)They also charge for phone support after 90 days so BEWARE. I never received a shipping label after asking twice. I bought an Amazon Fire so that I would not be without TV and because I am finished with Roku company.Amazon stands behind their products and has the standard 1 yr warranty.Fire is faster but home screen is a bit more cluttered and not quite as easy to navigate. I will get used to it. Still  hoping for a PBS app.There are now news/weather apps for the Fire but I have not tried them yet.Fire vs Roku? Hands down.. Amazon fire for good customer service and warranty.------older:First let me say, I am a big Amazon fan and their customer service is outstanding for the most part. I did ask in chat before  purchasing, if PBS app would work on the Fire TV and was incorrectly told 'yes'. So far it and all of the apps in the android store will not work with the Fire Tv and that was confirmed with support on the phone.I have Roku and what I am finding is that the Fire is MUCH faster, pretty much instant play. The voice search is nice but I prefer the home screen of the Roku. The main disappointment with Fire TV is that there are no weather/news apps and no PBS app.I have 30 days to decide if I will keep it and hope that they will incorporate the android apps.. as advertised (I read it somewhere)! It was not made clear in the description that to mirror a show on your kindle Fire and Fire tv totally depends on your TV capabilities. Maybe most of you would know that, but this lady did not!I feel rather let down.. was expecting Roku features but faster.The only reason I might keep this is the instant play.. very nice.", "verified": true, "helpfulness": "46/54", "author": "LadyMMO"}, {"rating": 5.0, "review": "I am NOT an early adopter of technology.  I bought Fire TV as an impulse decision and it arrived less than 24 hours later which left little time for second guessing.I own a Roku HD, use Netflix and Hulu Plus on a variety of platforms and I am very picky when it comes to streaming media players.The Fire TV is TINY.  It is literally the size of a double CD album.  It feels solid, though.  Setup was non-existent if you are Prime customer.  Plug in HDMI.  Plug in ethernet (if you like).  Plug in power.It comes pre-activated with your Amazon account so there is no sign-up or setup process.  All I had to do was turn parental controls on and enter my PIN and I was ready to go.The biggest positive so far is ETHERNET.  I am not sure I can go back to wireless streaming and buffering again.  Of course you can use wireless if you like but the difference between starting a movie on my wireless Roku and starting a movie on the Fire TV is amazing.  It's much faster.  Sound and video are great.  No \"buffering\" lines so far.  (Caveat: I've only had a chance to use Amazon and Vevo so far... caveat emptor and all that..)The UI is fast and there is no lag in the menus or navigating around.  We have yet to try our games and apps since the kids wanted to watch movies immediately.I'm glad (so far) we bought this instead of a second Roku.  It's great so far and I look forward to trying the games and other apps.If things take a turn for the worse I'll definitely revise the review, but as someone who loathes early adoption of tech I am extremely pleased.", "verified": true, "helpfulness": "27/32", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love my amazon prime membership. I use it to stream TV and movies, and I love that I can download content to my Fire as well. I bought a Roku a couple of years ago and it has truly changed the way I use my prime membership. Because I use it for TV and movies, it reaffirms that the new price is worth it.I had been considering buying a second Roku for a secondary TV, but when I saw this new device, I bought it right away!  Here are my thoughts:SET UPSo simple to set up. Including opening the package, it took me 5 minutes (I timed it). All I had to do was connect the device to the HDMI and plug it in. Then I put in my WIFI password. Because the device is so slim and small, I have it sitting under my HDTV on the console. I feel like the cords are neater there.It took an additional 38 minutes to update the software, so it did take a while to actually be able to use it. I loved that as soon as it finished loading, a short, fun and helpful startup instructional video ran.Since I bought it for myself on amazon, it was automatically uploaded with my account info.NAVIGATING AMAZON VIDEO CONTENTIt gave me the option to add parental controls in the form of a pin to my account, which I did, because I didn't want my kids to accidentally (or on purpose) buy an episode. At first I was frustrated by this, because Amazon Prime content wasn't showing up. If I tried to access something on my watchlist, I had to select \"other viewing options\" to watch via Prime. I'm still not sure why this is. Then I still had to put my pin in, which made me wonder if I was buying it. I went to settings and was able to leave the pin on for purchased content and turn it off for Prime content, which is what I want. Then it made it easier to access the prime content.VOICE SEARCHThis does work! It's great. You push the button on the remote and speak the title or actor. Amazingly intuitive.APPSI added the YouTube app and it was easy to sign in to my account and access my videos. I'm sure my kids will love this.AS COMPARED TO ROKUI'm still out on this. The Roku 2 (which is the one I have) is at least twenty dollars cheaper and is what I was planning to buy for my 2nd TV. I really like the voice search feature over the Roku search. And it does seem to be faster.However, the navigation of the actual prime content isn't as easy to access as on the amazon app on the Roku. Part of it might be unfamiliarity, but it seems like it's easier to find prime content via the app on the Roku than the TV/Movie section on the Fire TV (It doesn't seem to have Prime set apart separately like on the app I use on the Roku).I do like the games availability and think my 10 year old son will enjoy it. It was one thing that caused me to buy it. He enjoys playing Angry Birds on the Roku, but that's where it ends there. It also comes with 500 coin credit to use.", "verified": true, "helpfulness": "27/32", "author": "Jennifer Donovan \"Jennifer Donovan\""}]