[{"rating": 5.0, "review": "Great product works well easy to connect will recommend it to all my friends and family", "verified": true, "helpfulness": "0/0", "author": "ceronne Patterson"}, {"rating": 4.0, "review": "It gives you allot of entertainment for the money, although many of the apps make you sign into another cable or dish account to activate their app. So it makes it hard to cut the cord to those companies. I also was hoping for more collage sports on Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Eric F Smith"}, {"rating": 3.0, "review": "I was hoping it would take the place of our Dish, but it did not meet my expectations enough to discontinue Dish.  I spend more time looking for something to watch than watching.  Hopefully, as new things are added, it will get better.", "verified": true, "helpfulness": "0/0", "author": "barb frymier"}, {"rating": 5.0, "review": "Great item!", "verified": true, "helpfulness": "0/0", "author": "Clyde Dotson"}, {"rating": 5.0, "review": "I absolutely love it! It's so easy to user and it even has an African movies app and African sports app. I love this all in one tv/games box.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 3.0, "review": "temperamental and lacking but when it works its great. Need more GOOD movies for your loyal PRIME members amazon. AND the SPOTIFY app!!", "verified": true, "helpfulness": "0/1", "author": "jennifer l. trujillo"}, {"rating": 3.0, "review": "I was excited to purchase Amazon Fire TV and place it in our main TV viewing room.  We used Roku 3 for several months with good results but since we are big Amazon.com fans and own a fire tablet, I decided to purchase the Fire TV.  After a week of use, I am ready to put the Fire TV in the basement and re-connect the Roku to our main TV.My biggest gripe is in the search function.  With Roku I did have to manually type my search words but it would search ALL channels.  Fire TV does not.  If a movie is available on Hulu or Netflix as a part of those memberships, it would not show up in the Fire TV search results.  Now the search by voice function is great!  BUT what good is it if doesn't provide you an accurate search result?  I hope Amazon makes a software fix for this.What do I like about Fire TV?  Optical sound output for my sound bar.  Voice search.Dislike?  Incomplete search function.  Extra step to open apps/channels (compared to Roku 3).  Cannot locate how to open video or pictures from an USB device.", "verified": true, "helpfulness": "0/0", "author": "Christopher M."}, {"rating": 4.0, "review": "Solid", "verified": true, "helpfulness": "0/0", "author": "G. McKinley Weaver Jr."}, {"rating": 5.0, "review": "Great devise to turn your older HDTV into a Smart TV", "verified": true, "helpfulness": "0/0", "author": "Wiscotaz61"}, {"rating": 5.0, "review": "Love it.  So easy and quick to set up.  Love the voice option.  I'm glad I got this instead of the stick just because of the voice option.  Easy to use.  Simple remote. Would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "michael maciejewski"}]