[{"rating": 5.0, "review": "Set up wasn't as easy as I thought.  I had to disable the AP on the Netgear router to make it work.  Wish there are more Apps that can cast onto my TV....  Overall, it works great for the price!", "verified": true, "helpfulness": "0/1", "author": "Stan C."}, {"rating": 5.0, "review": "I am from Canada and this product is not yet available here. I ordered from Amazon USA and the product was delivered on time.I attached the Chromecast with my regular 37\" LED TV and it instantly became more feature enriched than a SMART TV. I casted netflix, youtube to my TV from my cell phone, laptop & tablet. Voila it was quick and crystal clear.Even I casted movies from so many other web sites also, the only condition is always use CHROME web browser. Now, I am a die hard fan of Google Chromecast.I will recommend this product to everyone. Instead of buying SMART TV, just attach this magical device to any regular TV (with HDMI connection) and your TV will out perform the expensive SMART TV. Sure, give it a try.", "verified": true, "helpfulness": "1/2", "author": "Edmonton Guy"}, {"rating": 1.0, "review": "Chromecast casts most youtube videos I tried fine, except my own, for some unknown reason.And they happen to matter most to me.They are jittery, and experience obvious buffering issues.It does not appear to be related to resolution, since I tried different ones.But the biggest disappointment has been Google's support, which is done by email.There appear to be live people, but all they do is copy-paste canned responses, not reading the question.They claim obvious noncense, such as \"At this time, YouTube on Chromecast does not support casting of private videos\" - I got that replied to me twice, \"We currently do not support casting from embedded YouTube players\" - contrary to what they claim on their own Support page.It's been back-and-forth several times with me trying to get them to simply read the question, to no avail.I also sent them specific links to try.If anyone from Google happens to read this review, here's the support number, go read it: [9-6745000001756]And, here's the exchange for your convenience:chromecast-support@google.com <chromecast-support@google.com> Fri, Sep 27, 2013 at 9:34 PMHello David,Thank you for contacting us.If your are casting from a Google chrome browser You should be able to cast anyvideos from you tube.Make sure you are on the tab you want to project to your TV.Press the Cast button in the Chrome toolbar (top right hand area) of your browser.A list of available Chromecast devices will appear on your TV. Pick any device to cast the current tab to thisdevice.After a very brief load time, the current tab should appear on your TV!You can also change the chrome quality by right clicking on the extension and clicking on options.here is the linkto get to the chrome extensions:[...]We currently do not support casting from embedded YouTube players. Advise the customer to cast from theChrome tab instead.Thanks,The Google TeamOn 09/26/13 21:32:54 xxxx wrote:I've already received the same copy-pasted answer! Could you read the question please...On Thu, Sep 26, 2013 at 4:23 AM, <chromecast-support@google.com> wrote:Hello David,Sorry you're still having issues, my name is Courtney and I'll be more than happy to help. I've done someresearch but at this time, YouTube on Chromecast does not support casting of private videos, YouTube livestreaming videos, or videos from paid channels. A simple workaround to this is to use the Google Castextension in a Chrome browser rather than the Cast button in the youtube.com player or YouTube app. Youmay get a warning message that says “Cast-enabled page; use controls in the page for an optimalexperience. Learn more,\" but just ignore it in this instance.Thanks,CourtneyGoogle Play Support Team9/27/13 Gmail - RE: [9-6745000001756] Chromecast technical questionOn 09/25/13 20:15:41 ... wrote:Could you please explain what \"private\" video means. I thought all videos are private.Anyway, I tried some random videos from different people, same resolution, and most of them show fine,private or not.Mine however don't play.Casting from Chrome browser made it even worse.Could you please check again why.Also, is the explanation you give documented anywhere online, because I could not see that.On Wed, Sep 25, 2013 at 3:35 AM, <chromecast-support@google.com> wrote:Hello David,Thank you for contacting Google Play Support! My name is Charlese and I am more than happy to beassisting you with the issue you are having with your Chromecast device while Marcus is out of theoffice. I've reviewed your case and I see that you are having some troubles casting your own videos fromYouTube.At this time, YouTube on Chromecast does not support casting of private videos, YouTube livestreaming videos, or videos from paid channels. A simple workaround to this is to use the Google Castextension in a Chrome browser rather than the Cast button in the youtube.com player or YouTube app.You may get a warning message that says “Cast-enabled page; use controls in the page for an optimalexperience. Learn more,\" but just ignore it in this instance.If you have any other questions please feel free to reply directly to this email or follow the link below forfurther assistance:[...]Thank you,CharleseThe Google Play Support Team", "verified": false, "helpfulness": "2/8", "author": "dima"}, {"rating": 5.0, "review": "To watch my netflix, I have to use my ipad and hold it with my headphones in so I can hear it. Not comfortable at all!! No more, I can watch on my tv now. This gives me a wide variety of movies and tv shows to watch . I love it! This is, without a doubt, the best electronic gadget I have bought in a long time!", "verified": true, "helpfulness": "1/2", "author": "chipmunk53"}, {"rating": 5.0, "review": "nothing streams better than this. right now, only google play, netflix and youtube work. i think hulu and hulu plus? not sure. i can't wait for others to sign up like nfl network, anime stations, etc., etc. cast from your phone or your computer or pad for the price of a date at the taco truck.", "verified": true, "helpfulness": "1/2", "author": "Malcoln_Rodgers \"scrolls\""}, {"rating": 2.0, "review": "I'm giving the Google Chromecast two stars because it really is a good device that works exactly as advertised but it doesn't support enough streaming media apps to really be useful.  Buyers should understand that if all they want is to stream YouTube or Netflix from their iPad to their TV, this thing is great.  It's inexpensive, easy to set up and it works just fine.  The problem is, that's all it does.  It streams media from YouTube, Netflix, and music and video from Google Play.  You can also pop up web pages from your PC, but not from your Android or iOS device.  What you can't do is stream video through Chrome, which seems odd.Something really promising about this device is that it lets you use your smart phone or tablet as your remote.  That's an amazing feature and it works really well; almost flawlessly.  Some of the negative reviews complained about that, but it's a really cool feature and other devices could take a page from Google's book on this kind of integration.  If this thing supported just one more app, I'd be tempted to give it 4 or even 5 stars, but with it's current limitations I just can't do it.Google promises that more apps are coming, but which ones?  If this device supported the TWC app or HBOGo, I might have kept it. If it could stream music or video from Windows Media Player, I might have kept it.  The bottom line is, what I really want is a Roku box and what I should have done was shelled out the extra coin to get what I was looking for rather than hoping for a less expensive solution.Don't get me wrong, one day this little gizmo is going to give Roku a run for their money.  Unfortunately, that day is not today so I'm sending mine back and I'll invest my pennies in a more full featured device.", "verified": true, "helpfulness": "90/113", "author": "Adrien"}, {"rating": 4.0, "review": "This could be one of the very best streaming devices on the market today...  It's size is great about this size of a large usb key, you can put just about anywhere and its out of the way.  Needs extra usb power...OK...but all the needed power source and cables are included.  Running two on different brand components one directly into TV other via Reciever controlled by multiple devices running the major OSs with no issues.  BUT...MAJOR problem \"Where are the NEW apps?????\" so far just the 4 its launched with, play music/video, netflix and youtube which work great.Will be 5 Stars when more apps are supported.", "verified": true, "helpfulness": "1/1", "author": "E Schim"}, {"rating": 5.0, "review": "So easy to set up and use it's scary.Can't wait for more 3rd party provider support.If you don't have a way to get Netflix on your TV this is the device to buy.", "verified": true, "helpfulness": "1/2", "author": "Graham Green"}, {"rating": 5.0, "review": "This really is plug and play. You plug it into your TV's HDMI port and USB port and you're ready to go. Streaming from Netflix and YouTube is a piece of cake. Plus you can stream pretty much anything else you'd want using Chromecast. You can't beat this for $35, at that price it's even less than the cheapest Roku. I can't wait until Google adds more apps. I'd love to see a dedicated HBO Go app or Amazon Instant app.", "verified": false, "helpfulness": "1/2", "author": "Marko"}, {"rating": 5.0, "review": "This little gadget is absolutely amazing. Not only does it let you stream netflix and other apps to your television, it also lets you cast from your computer once you install the chrome-cast add on. Literally took 5 minutes to set up.And, to top it off, you can also cast music, movies, photos etc from your personal data collection if you install Plex. Best 35 dollars I ever spent.", "verified": true, "helpfulness": "0/1", "author": "Serenity \"Serenity Graham\""}]