[{"rating": 1.0, "review": "We had this for 3 months and we were streaming media and it got really hot and kept cutting out. Fire tv stick works much better.", "verified": true, "helpfulness": "0/0", "author": "blunt honesty"}, {"rating": 5.0, "review": "Amazing 😍", "verified": true, "helpfulness": "0/0", "author": "ReeMa"}, {"rating": 1.0, "review": "Never worked", "verified": true, "helpfulness": "0/0", "author": "David G. Ostrow \"BigDavidO\""}, {"rating": 5.0, "review": "Works great, excellent seller, fast delivery, A+++", "verified": true, "helpfulness": "0/0", "author": "Gregory Marcotte"}, {"rating": 5.0, "review": "easy install, include all the cables, transformer, instructions. I am using this with my samsung galaxy note 10.1, it works good. (note: you can use this with programs like Netflix, youtube and others, read the instructions)", "verified": true, "helpfulness": "0/0", "author": "Guillermo Kinderman"}, {"rating": 3.0, "review": "This product is good. It is nice to screen mirror. My issue was that i tried multiple routers and multiple devices with chromecast and had them all disconnect or distort at some time during use. This is very annoying.", "verified": false, "helpfulness": "0/0", "author": "Benjamin Maendel"}, {"rating": 5.0, "review": "I absolutely love my Chromecast. I have found myself using it all the time. I currently own two and my kids find them easy to use as well. I wish I could stream my Amazon Instant Video to it as well, but really all the lack of that functionality has done is nudge me in the direction of Vudu or Google Play to buy my digital content. I have pretty much abandoned Amazon for digital media purchases because of this. Overall, we love using Chromeast so much, it's making me think about cutting the cable cord as well.", "verified": true, "helpfulness": "0/0", "author": "D-Rock"}, {"rating": 4.0, "review": "It totally depends on your internet speed connection.", "verified": true, "helpfulness": "0/0", "author": "Borja"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Gates33"}, {"rating": 1.0, "review": "It stopped working 4 months later. Sweet.", "verified": true, "helpfulness": "0/0", "author": "Anthony Manno"}]