[{"rating": 5.0, "review": "My wife and I did a thorough review of all the TV streaming devices and this one was the clear winner.  We have used it several times and enjoyed the movies.  The directions for set up could be better.  I had trouble setting it up until I understood the concept of switching back and forth between the two devices.  Someone younger will have no problem.", "verified": true, "helpfulness": "0/0", "author": "Shermangolf"}, {"rating": 5.0, "review": "For those of us, who have gone through one TV box after another, looking for a decent, to good, operating device... Your looking is over. Not only is the fire decent, to good, it's excellent. In speed, quality of picture, and ease of operation, this little box can't be beat. I'm so glad, that I found it.Add in Amazon Prime, and it's an affordable, great deal. I have no problem in giving this game changer... the very best recommendation to you.", "verified": true, "helpfulness": "0/0", "author": "Manoli"}, {"rating": 5.0, "review": "I bought this primarily to stream ESPN3 to my TV.  It does so in amazing clarity, with no buffering or hesitation. I've watched about 15 hours so far without a single instance of buffering or pixelization.  Tons of free shows and movies as well with my Amazon Prime membership.  I also love Tunein Radio, with access to thousands of stations. Would recommend to a friend.  In fact, I already have.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "So glad we made this purchase.  So nice to be able to view so many free movies and if you enjoy watching certain actors the voice command is awesome.", "verified": true, "helpfulness": "0/0", "author": "Diana Szymaszek"}, {"rating": 5.0, "review": "The video and sound quality are excellent. The remote is the best I've used. The audio search really works. I have the optical out into a 7.1 surround. Great sound quality. I suggest to be an Amazon Prime member to get best selection.", "verified": true, "helpfulness": "0/0", "author": "Martin Holcomb"}, {"rating": 5.0, "review": "It has exceeded my expectations. Easy to set up, easy to use. Voice activated searches have worked flawlessness. The combination of on line content coupled with free offerings to prime members provides something for every one. I especially like how the buffering and processor power provides quick access and flawless video operation.", "verified": true, "helpfulness": "0/0", "author": "Raymond Mitchell"}, {"rating": 5.0, "review": "We have \"smart\" TV; \"smart\" Blu Ray player; Apple TV; and Roku.  With the exception of a couple of Apps not yet available,  the Amazon Fire TV is our \"digital media player / microconsole\" of choice.  It is used primarily as our streaming audio/video device.  If Amazon Fire does not offer an App that you rely upon, leave your old set top box hooked up and purchase the Amazon Fire TV for everything else.  If you are a \"gamer\", leave your game console hooked up and purchase the Amazon Fire TV for everything else.", "verified": true, "helpfulness": "0/1", "author": "Billy Cornett"}, {"rating": 5.0, "review": "OK,but need less regional restriction that permit to download free application and multi language keyboard for YouTube search and custom volume sound control button that decrease needed for carry two controle during watching,keep in your mind ,many competitive streaming media player will become available in the future with less restriction .", "verified": true, "helpfulness": "0/0", "author": "Rashid"}, {"rating": 5.0, "review": "I have a Apple TV and wanted to have a device to take advantage of my Prime membership. I was amazed at the HD quality. Also there has been no delay when streaming. I wish though you could have a menu item that showed movies/TV that are in the Prime Library, that go with my membership. I love it", "verified": true, "helpfulness": "0/1", "author": "Sandra"}, {"rating": 5.0, "review": "Easy set up. Paired up with my WiFi on the first attempt. Picture quality is as good as my DirecTV. The voice search is a neat feature and helps bring up movies and shows that you may not have heard of before.For those who are technically challenged, have no fear the initial setup and operation are intuitive and fast. After the initial setup the unit will download the latest software for the unit which takes a little bit of time. When the software is updated, you are ready to go and experiment with the unit and find a movie or show to watch.", "verified": true, "helpfulness": "0/0", "author": "Eugene T. Lovett \"Gene Lovett\""}]