[{"rating": 4.0, "review": "It works, which is kind of amazing.  But it doesn't work perfectly, which is to be expected, I suppose. Mostly, it will stall or freeze at times, making the viewing experience less than ideal.  But, I'm glad I have it.", "verified": true, "helpfulness": "0/0", "author": "Eric Greenberg"}, {"rating": 5.0, "review": "Very easy to use and can move it from one room to another.", "verified": true, "helpfulness": "0/0", "author": "Jennifer \"Readingteacher\""}, {"rating": 5.0, "review": "Amazing!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I work in technology and am amazed how hard it was to get this product to work ! I was only successful with getting this to work with YouTube on android. Everything else (Chrome, Pandora) didn't work.Returned this and hope Google can work harder to ship products that work. Very poor engineering, they have lots to improve with becoming a device + sw company.", "verified": true, "helpfulness": "0/1", "author": "Citi Amex \"sxsrivas\""}, {"rating": 4.0, "review": "I now own three of these devices.  One for each TV in the house. It is a great way to make your old TV into a smart TV.  I use it to stream Youtube videos, local media using Plex, and music to my sterea system using various music apps which support casting to this device.  I like it so much I have started purchasing these devices for family members.", "verified": true, "helpfulness": "0/0", "author": "Rivers8"}, {"rating": 5.0, "review": "i get it's good;;;", "verified": true, "helpfulness": "0/0", "author": "Robert T."}, {"rating": 5.0, "review": "Works great on three tvs. The display is clear and sharp. It's great to watch Netflix movies, youtube, and Viki on the big screen.", "verified": false, "helpfulness": "0/0", "author": "Amazon Mom"}, {"rating": 5.0, "review": "All TVs are smat now!!!", "verified": true, "helpfulness": "0/0", "author": "Francisco Figueroa"}, {"rating": 5.0, "review": "It's as awesome as everyone says. Use it with Plex and my S III. Flawless.", "verified": true, "helpfulness": "0/0", "author": "mikeandgiah"}, {"rating": 4.0, "review": "Very good product but it lacks the remote.", "verified": true, "helpfulness": "0/0", "author": "Careful customer"}]