[{"rating": 3.0, "review": "I had this for about 5 months now and I think I can give a little review now. This is a nice streaming box but I think I will try and just split things up with the pros and cons so I can just add on. I think I have more cons than pros.***Pros***Pretty Snappy and quickVery very power efficient.Nice 1080p movies from amazon plays nice and smooth and so does Netflix even thought I notice that Netflix seems to be cropping the ratio aspects of a lot of its content. This is not the units fault.Ability to use usb mice and keyboard with the unit.***Cons***No audio over Bluetooth (this would have been a great feature but its not possible)Only 3 games release from amazon game studios. (What happen to all the trailers you guys had out? I thought they things where like in production way because you release the Fire Tv, yet not updates about what is coming soon and two versions of that zero game. I used my controller once for the zero games and haven't used it since thanks to the no existing games list from amazon game studios. I know they have games from other vendors but I want to play they games that they shown in the trailer that got everybody interested in the device.)No option to put the device in standby mode. (I know i said its good on power but I like to be able to turn my devices off when In not using them anymore and not have to wait 15 mins, especially if you accidentally press a button on the remote that's another 15 mins so now its been on for 30 mins without even being used. Might not be a big issue for most be it just gets to me)No universal voice search. (You can search so the popular apps like Netflix with voice just prime and I think hulu now too.)Netflix app very outdated. (The Netflix app just plain sucks and definitely needs the voice integration.)Limited Storage (I know this is a streaming box but they also have it as a gaming box as well. There is only so much games you can install on a device that gives you like 5GB free. GTA games are over 1GB So that means I have to be limited to maybe 10 games on this unit? Definitely the worst flaw of this device. Expandable storage seriously need.Lack of Content (I know this is one a lot of people heard a thousand times but its true. Its really far behind the likes of the Roku. The amount of free content is limited in the Prime section and if you don't feel like buying or renting  and none of the free stuff appeals to you there isn't anything else to really look forward to as some of the interesting channels that you can find on the Roku is just no present here.)Amazon launcher sucks (the first time I saw it I thought it was cool but now this thing is just too confusing and makes no sense. They need to have some sort of app store instead of scrolling to the right to see every single App they have available. That make no damn sense. I would love to see a list of everything in a grid using the entire screen not one row moving to the right. The categories they have are pretty dumb as well. I'm mean for certain things it was easier for me to just come on amazon site and load it to my device from here, that's how tedious of a task it is.)Unable to play media using USB port (I thought this port would have been opened later on in the months to allow users to play their media but I was wrong. So you cant use this port for any of that good stuff like some other streaming devices with USB ports or expand the devices limited storage.)No app store (As I said earlier about this things need a dedicated app store and not a side scrolling one row grid for finding stuff. Doesn't really need play store just something to organised everything better.)Unable to side load apps (Some apps aren't available in the device settings so you just want to get it anyway you can but its not possible on here unless your tech savvy and know how to use ADB.)No Web Browser (Come on now serious amazon? we can just a few sites while on our fire tv?)So yeah I guess thats all I can think of right now. With that said you can sideload XBMC on this device if you do some research on XDA. It works fairly good crashes its fair amount of time too but its usable. The USB port can be enable to access and via XBMC if you root the device.(Only recommended if you know the risk of rooting and they possibility of a brick) As you can see I've been let down a lot by this unit. Hopefully things get better and I can remove most of the cons from my list that I think should be available on this unit because if not I might be looking at android tv, I know for one it already have universal voice search built-in. Hope you guys found this helpful.", "verified": true, "helpfulness": "1/4", "author": "Lo"}, {"rating": 3.0, "review": "there are to many pay for view even after the PRIME signup... there should be away to block all pay for views if you desire", "verified": true, "helpfulness": "0/1", "author": "Jim"}, {"rating": 4.0, "review": "How is it compare to Apple TV?", "verified": false, "helpfulness": "0/2", "author": "PatchTogether"}, {"rating": 3.0, "review": "I have an Apple TV. I got the Amazon product because of my Prime account access to movies. I want them on the big screen. I didn't hook it up right away, in fact, it sat for 6 weeks. I finally got around to the deed, and was I pleased. It has a better picture than the Apple device, and all the access to Netflix and Hulu that Apple has. I have some movies I purchased on Amazon, and I can watch them now in the front room. I am still having trouble getting it to pick up my music library. It has it on the computer (a MAC), but it is not transferring to the music portion of the Fire device, this is why I have not given it 5 stars.", "verified": true, "helpfulness": "0/2", "author": "Cohasset Man"}, {"rating": 4.0, "review": "Setup was far more complicated than advertised, with little documentation to refer to for help when things didn't go smoothly. But once I got it dialed in with my TV and boosted my download speed and upgraded my modem and router, it has been awesome. Having missed Deadwood and many episodes of The Sopranos over the years, I am now binge-watching and loving it.", "verified": true, "helpfulness": "0/1", "author": "by Tony Michaels"}, {"rating": 2.0, "review": "If you asked me within 30-60 days of owning the Amazon Fire TV how much I liked it, I would have given you a glowing review. It's a lot faster than my Sony players, my Roku 2, had access to all the features I wanted, except DLNA, PBS and HBO GO, and now they've added the PBS channel which is awesome. So why the low score? Let's talk about the problems and complete lack of support to get them fixed.First I was unable to see any content that had any amount of DRM on it. So basically, I could stream trailers, commercials, clips but not full episodes or movies. Level 1 customer support from Amazon would send me e-mails to restart the machine, change HDMI ports, at one point said it was probably the cord itself until I told them it was an Amazon Basics cord so maybe they should send me a new one. This went on for weeks until they moved to me to level 2. Level 2 rinse and repeated the old steps, would call, not stay on the phone for more than a couple of minutes, and the day after each call send me long e-mails of what I should. There was absolutely no reason given by instructions were not provided on the phone and only provide vie e-mail which would require me to e-mail them again and tell them the steps did not seem to be working. Then came the loss of the signal entirely. Each exchange would talk about fixing my wireless network at which point I would point out, again and again, that this device is wired... as in a physical cord is connected to it.I did this little dance for just about a month before saying I am done, need a new one. They sent me one, but I had to contact them for RMA information, since it did not come with the unit, and ship it back at my cost.Now I get occasion pauses and the CBS channel on Plex doesn't work at all.Now you might be thinking this is a network problem. Of course, you say, Amazon can't fix this for me.  Well if that is the case, it would be nice to get a human to walk through the steps of fixing the problem. And if the that is the case, Why isn't the Roku 2 having the same problem. The Roku 2 is also sent through the home theater system, is wired and doesn't have these problems. It is, however, considerably slower in the menu, and the Roku 2's have a known problem of randomly resetting that the company doesn't seem to care about. That's where the Amazon Fire comes in. Unfortunately, the Fire TV hasn't been the replacement I hoped. For instance, right now I am watching Criminal Minds on Plex via the Roku because Amazon won't bring up the channel at all. I might try Plex next to see if they have any idea or know if the Fire TV channel has a known problem or something.I am still troubleshooting, trying to get this to work consistently, but until I can get that consistent performance or at least be able to rely on help from Amazon CSR when there is a problem, it's strange to say but the BluRay players have been the most reliable devices I've had so far.Update - Just wanted to say I tried watching The Middle on Hulu Plus... never loads. Just a black screen with the channel 12 logos in the top left and right but never loads. Roku player, played right away. I have no idea what the problem is and the Fire TV doesn't seem set-up to provide any useful error messages to indicate there is a problem and what it could be. Amazon Prime played though, Hansel and Gretel.Update - Plex : So I believe a number of you do not fully understand what the problem is, keeping in mind this is not an XMBC set-up, so I am going to explain it as simply as possible. Plex requires a Media Server, which is basically a PC on the network. The device accesses that server to access channels like CBS, ABC, etc. So the Roku 2 and Amazon Fire TV are literrally accessing the same content on the same sever but the Fire TV is won't load CBS. It claims there is not a server connection. Except the Fire TV will load ABC and the other channels, and the Roku 2 can access CBS. There is something wrong with the way the Fire TV is trying to access that content but Amazon's tech support is not sufficient in troubleshooting the problem. This is just one example, but it is an example were the server itself and Roku have no problem accessing the content indicating it's not a network or set-up problem. This is just one example of many where the Fire TV is failing at loading third party content.", "verified": true, "helpfulness": "0/4", "author": "Tanya McHenry"}, {"rating": 5.0, "review": "Works great! Exceptional video and audio. Beats any other competitive device in it's price range for video library selections, options, and quality output. Remote is easy to use, even though my hands don't work that well anymore. The software is also easy to use. I don't need to use the limited software on my smart TV any longer. Very glad I got this!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Dennis White\""}, {"rating": 5.0, "review": "So far so good. It's fast for streaming, turning on, set up.... everything is very easy. Bye bye cable", "verified": true, "helpfulness": "0/0", "author": "jon turner"}, {"rating": 3.0, "review": "I got the FireTV free from amazon to use for 30 days. I think this is a good product but I already own a Chromecast and I didn't see much benefit with this over the Chromecast. If anything I feel the Chromecast has more functionality for me because I can stream any file from my computer and use my phone as a remote with a program called Videostream for Chromecast. But the Fire TV is definitely a prettier product that is more user friendly and has more features and power than the Chromecast.One small thing I think could be improved with the 'Fire TV' is the selection menu. When you are selecting a movie you want to watch the highlighted movie should be in the middle of the screen and not off the far left. When you are scanning through movies it makes it hard to focus on all the movies you are scrolling through when the highlighted movie is on the edge of the screen.", "verified": true, "helpfulness": "1/3", "author": "Solipsis"}, {"rating": 1.0, "review": "Returned.", "verified": true, "helpfulness": "2/23", "author": "pardude"}]