[{"rating": 5.0, "review": "what else can you say except for that chromecasts are awesome for anyone wanting to display content on a TV", "verified": true, "helpfulness": "0/0", "author": "Daryl \"Prime Addict\""}, {"rating": 1.0, "review": "Doesn't work that great with apple", "verified": true, "helpfulness": "0/0", "author": "ramon"}, {"rating": 1.0, "review": "This device is a piece of garbage. It works on and off. Loses its signal over and over. I have all high powered equipment for the record, And if you ever want to call for support. It's a bunch of over paid morons that tell you to unplug and re plug your device. I did this 30 years ago if my Nintendo didn't work. Next they will tell me to blow on the cartridge. I implore you to wait until the technology gets better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This made a great secret santa gift.  The old guy at our workplace didn't have any streaming devices on his TV and we helped hook him up.", "verified": true, "helpfulness": "0/0", "author": "micsun"}, {"rating": 3.0, "review": "I use my chromecast a few times a month when friends visit and they want to use their phones to control the music or videos we watch. For everything else, I just use my Xbox.I thought I would get a lot more use out of it, but my connection was just too slow to be practical. Based on recent use I think that's changed, but i never got used to using it regularly and there's not enough apps that implement a cast connection to draw me back in.", "verified": true, "helpfulness": "0/0", "author": "Katelyn"}, {"rating": 5.0, "review": "It is awesome to be able to project your smartphone screen onto you main TV. Sending Youtube to the TV is a breeze as well.", "verified": false, "helpfulness": "0/0", "author": "Robert Clark"}, {"rating": 5.0, "review": "I love this unit. It is very easy to use and setup. More reliable than AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Gwo I."}, {"rating": 4.0, "review": "Getting most smart tv apps into a non-smart TV with very little effort. Google Chromecast is a simple HDMI dongle with an usb power adapter to provide all the wonderful apps you have come to love. Easily slide this into any HDMI port on your TV and enjoy hours of Netflix, Hulu, MLB or ESPN all from your smart phone. There is very little to set up. Plug it in, download the chromecast app to your smart phone, connect to your network and you are set. Only set back is no amazon streaming yet. Amazon has not really commented on support for the chromecast. Especially after releasing the Five TV stick. Which is just as good as the chromecast but with a few more features.Chromecast  VS.  Amazon Fire TV StickThere are many similarities as well as some differences between these two streaming powerhouses. Chromecast has great support and an app straight from google with apps downloaded from the google play store. Amazon Fire TV Stick runs on its own version of android with tons of apps and games as well as a remote. Fire Stick TV is fast, REALLY fast. The home screen layout is the normal filmstrip look. Chromecast has no home screen or operating system due to the fact that it needs a smart phone to run apps. As far as apps go, both sticks are pretty comparable however the Fire TV Stick has a sold separately gaming controller that comes in handy. The conclusion however for me and my family is simple. BOTH have a place on our tv sets. At 35 dollars each, it becomes a simple handy impulse buy. When we need to throw something on for our one and two year old, it is very simple to get our phone out and throw Netflix on the living room tv. When the wife and I want to sit and relax after they are in bed, we will switch over to the Amazon Fire TV Stick to search for something to watch together.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Luv luv luv it do easy to use. Can move quite easily from room to room highly recommend it to anyone who like streaming binge watching", "verified": true, "helpfulness": "0/0", "author": "christine"}, {"rating": 1.0, "review": "People selling this device fail to mention you have to have a compatible router.  I got what I thought was a great deal ($20) only to find it will not work with my Centurylink Actiontec M1000 modem and W1000 wireless device.  You will have to purchase another router ($25 - $250) to make it communicate with your TV.  I'm not spending a dime more.  I will post this mine on Craigslist and get rid of it.  Word of warning.  Go to Chromecast setup guide (on internet) and look at the compatibility chart before investing in this.  PS if you have a ROKU, all you need is the ROKU app for your phone or pad and it will do the same thing...without a fancy schmancy router.", "verified": false, "helpfulness": "0/0", "author": "Samplerman \"samplerman\""}]