[{"rating": 3.0, "review": "i use this with on my old Samsung TV and I lose it. I wise this can work just like Apple TV", "verified": true, "helpfulness": "0/1", "author": "tae kim"}, {"rating": 2.0, "review": "I set it up on my Windows 8 pc and it worked ok. The sound lagged the tv slightly. I have had to re-set it up every time I use it. I have been unable to link it to my wife's pc. and she is running a prior version of Windows.", "verified": true, "helpfulness": "0/1", "author": "Michael T Lewis"}, {"rating": 5.0, "review": "I bought this primarily because the TV in my bedroom had no access to Netflix.  When I first opened the box I was afraid I was going to have problems because there was little in way of description as to how to set the think up.  Fortunately it was so easy little to no explanation was necessary.  I really like that I can connect to Netflix through my mobile phone and use the phone like a remote.  I am even more pleased that is doesn't use any bandwidth from my phone once the movie is started and I can still use my phone while the movie it playing.  There are many applications this device provides that I haven't yet had time to investigate, but I am already in love with it and think it was well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Dale Musser \"Dale Musser\""}, {"rating": 5.0, "review": "Wow, no longer need cable TV. Can watch videos, movies and listen to better quality music on the TV speakers. Easy to set up and easy to use. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Irving Cantor"}, {"rating": 1.0, "review": "I love Google, and I am a software developer by trade, so I'm not completely ignorant of technology.  I was excited about this product because it is inexpensive, it is praised for it's \"ease of setup\", and it's a good concept.So I plugged it into my girlfriend's TV, downloaded the Chromecast Android app to my Sony Xperia Z Ultra and proceeded to start the 'extremely easy setup'.  I get \"We could not communicate with your Chromecast.\"  Then I go to a help screen that talks about disabling access point isolation, ensuring universal plug and play is setup on your router, and .net3.5 framework is installed on your computer.  Fine, my girlfriend has Xfinity, and her router is not configured exactly the way Chromecast likes.Then I take it back to my house, and go through setup on my own network.  I use CenturyLink for broadband, and a completely different router than my girlfriend.  Same Error!  Just how many routers does this thing work with?  There is definitely no \"EASE OF SETUP\" here!  I'm fiddling around with the uPNP settings on my router, I can't find ANYTHING that resembles \"access point isolation\", and all of the Google help tells me to go to my router instructions - that's not helpful!I think the marketing people have finally caught up to the technology people at Google, and are trying to convince us that their crappy product does something useful, but so far, I don't see it.  Lost a lot of respect for Google with this debacle.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "took me sometime to figure the set-up, initially used my tablet, but I guess it was too old, after spending too much time trying to figure it out even contacting customer service at Amazon, I finally figured out to try my IPAD and was able to set it up myself.", "verified": true, "helpfulness": "0/0", "author": "Aria"}, {"rating": 5.0, "review": "I love my chromecast, use it every, for some reason it works better over wireless than any of the other devices in the house. It also looks gorgeous on my 1080p LCD panel. It's really never stuttered once playback begins when playing youtube or netflix, which is all I've tried thus far. PRAYING amazon decides to support chromecast somewhere in the near future. I can't wait to see what apps will be supported in the future.", "verified": true, "helpfulness": "0/0", "author": "Sean Bourg-Genser"}, {"rating": 5.0, "review": "Works awesome thanks for google n amazon for making this new method to share our thaught n stuffs across the technology", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 5.0, "review": "It was so easy to use with all the help you receive installing it. For the price you can't help but buy it and enjoy.It's", "verified": true, "helpfulness": "0/0", "author": "Jane Cotton"}, {"rating": 5.0, "review": "This is better than I expected.  My dad loves to watch youtube videos on the tv without spending much money!", "verified": true, "helpfulness": "0/0", "author": "John Thirlwall"}]