[{"rating": 5.0, "review": "Great investment, no more cable or sattelite so life is good.", "verified": true, "helpfulness": "0/0", "author": "Jim S"}, {"rating": 2.0, "review": "The whole point of getting Amazon Fire TV was to get rid of the cable providers and the best apps like HBOgo and Watch ESPN require to have a cable provider to access. The movies and shows that are included with FireTV are old and to watch something new and nice you have to pay for it.Amazon prime's shows and movies are obsolete. The device itself is practical and user friendly. Will give it a little bit more time. So far, we are not impressed at all with this device.", "verified": true, "helpfulness": "0/3", "author": "Meandall"}, {"rating": 5.0, "review": "Best media player and streamer I have had so far! Worth the price. I'll eventually get another one!", "verified": true, "helpfulness": "0/0", "author": "Geordan Brown"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "VWelsh"}, {"rating": 5.0, "review": "Before you read this, check out my video review on YouTube. Here is the link:https://m.youtube.com/watch?v=LFesNNIjjS0. So, to start off, I just want to clarify that this little box is truly amazing and in some cases mind-blowing with its capabilities. It has a sleek, modern design and is weighted so it doesn't move around. Before this, I had a hand-me-down Roku HD. It was neat, apart from the outdated technology, slow interface, only streamed in 720p (which defeats its \"HD\" name), and had four tiny little pieces of rubber which helped by being an ongoing annoyance. But, back to the box. Yes, some might say it stole ideas from other boxes, and I agree on some points. But in some ways it took those ideas and made them better. The Bluetooth remote (the Roku 3 has this) is a VERY useful tool when I am in my bed and the box is out of my sight. And it has similar navigation tools to a Roku. Now, one of the big features that Amazon stress is their voice search. When I first got this, I was optimistic about how much I would use it. Turns out, I use it way more than I would have first thought. It is very useful. Now the other big thing is gaming capability. It has a quad-core processor, which means it can handle high quality graphics and also keep the device running faster for longer. The gaming capabilities are outstanding. It does not lag at all, and is very high res. And it streams its TV and movies in 1080p, including Netflix. The only things I see wrong with it are that I can't find a way to see my pictures on it and for some reason, it does not even have an app available at this time that allows you to browse Shop Amazon. I mean, c'mon, you'd think that the company that developed this device would let it have capability to do things that the company provides. But, all in all, this device streams, games, and amazes without much fault if any. Thanks, Amazon, you've done it again!", "verified": false, "helpfulness": "0/0", "author": "Lucas"}, {"rating": 1.0, "review": "Voice search is misleading from within Netflix. While in the Netflix app, I used my voice to select the TV show \"Friends\" to watch for free. Instead, I was offered \"Friends\" from Amazon for a fee.", "verified": true, "helpfulness": "1/3", "author": "J Ruff"}, {"rating": 4.0, "review": "Now that we are used to it, we love it.  We had some early issues.  Using the Fire TV interfered with reception on other channels.  (We don't have cable--just use rabbit ears.)  The solution to our issues was multi-step. We had to  get a separate power strip for all things Fire.  Audio was not going into the TV, so a splitter was required, including an extra HDMI cord and red and white audio connectors.  When we use the Fire TV, we turn on its power strip.  When we are not using it, we turn off the power strip.  Having the unit stay on disrupts our regular TV signals.  But we have adjusted to this and are enjoying the many options.", "verified": true, "helpfulness": "0/0", "author": "Barbara B"}, {"rating": 5.0, "review": "Best streaming device out there. I previously had an Apple TV and this device had a broader scope of capabilities.", "verified": true, "helpfulness": "0/0", "author": "Sara Espinosa"}, {"rating": 5.0, "review": "Finally a box that can take care of more than one app.", "verified": true, "helpfulness": "0/0", "author": "Le cougar d'Atlanta"}, {"rating": 3.0, "review": "The voice search works really well - for Amazon Prime, but not for anything else. I opened up Netflix and did a voice search for a television show - it came up right away, but I didn't realize that it had changed over to Amazon. I wound up paying $2.99 for something that I could have gotten free on Netflix! Not happy about that at all. Since you have to pay for subscriptions for the various compatible services, I don't think this is worth what they charge for it. On the bright side, the gaming aspect works great!", "verified": true, "helpfulness": "0/0", "author": "Penny Craig \"smallchange\""}]