[{"rating": 2.0, "review": "This was very difficult to set up", "verified": true, "helpfulness": "0/0", "author": "Katie French"}, {"rating": 1.0, "review": "It sucks!", "verified": true, "helpfulness": "0/0", "author": "Ashley Robertson"}, {"rating": 5.0, "review": "Amazing product, works better with android!", "verified": true, "helpfulness": "0/0", "author": "Nicolas Obesso Perez \"MEGANICK\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Anirudh Singh"}, {"rating": 1.0, "review": "didn;t work on my samsung smart flat screen tv", "verified": true, "helpfulness": "0/1", "author": "Anthony Yamamoto"}, {"rating": 3.0, "review": "Pretty bulky device. Also, could this use a rechargeable battery? Keeping it plugged really drains power.", "verified": true, "helpfulness": "0/1", "author": "Ron Branch"}, {"rating": 4.0, "review": "This is great. I was able to use it with my old kindle.  But I upgraded this Christmas thinking it was going to work and it doesn't.  But I can use it with my phone", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It still needs to be improved so that it can play non-web-based videos other than the Videostream app.", "verified": true, "helpfulness": "0/0", "author": "I love Amazon"}, {"rating": 1.0, "review": "I Bought this hoping to play media from my computer desktop, windows media player to hdmi Television wirelessly, it will not, only media on the internet threw Google Chrome web browser, why no one could tell me that fact before I bought it I don't know, I was told by many people and others reviews here it would work, it doesn't, only internet media on Google Chrome web browser pages, no mirroring or casting of desktop to Television, downloading Chromecast setup files I was over whelmed with popups that stated Google Chromecast needed these to function, needless to say my computer messed up, took me four hours to find need to reload fresh copy of Windows to fix the mess it created \"Be weary if you buy!\"", "verified": false, "helpfulness": "0/1", "author": "Raggedy Mann"}, {"rating": 4.0, "review": "Good cheaper replacement for Apple TV, still prefer my Apple TV, but I use this one in my bedroom. Can be buggy at times, but gets the job done.", "verified": true, "helpfulness": "0/0", "author": "Alixandria Fogel"}]