[{"rating": 5.0, "review": "Brought as a gift. Great deal. Works well. Product arrived as described.", "verified": true, "helpfulness": "0/0", "author": "Katrina Walker"}, {"rating": 5.0, "review": "works perfect", "verified": true, "helpfulness": "0/0", "author": "FIRSTTIMEMOM"}, {"rating": 3.0, "review": "Not as user friendly as I expected.  Doesn't have onboard apps.  But performs well.", "verified": true, "helpfulness": "0/0", "author": "GB95037"}, {"rating": 5.0, "review": "excellent !!", "verified": true, "helpfulness": "0/0", "author": "Rolando"}, {"rating": 5.0, "review": "Just what I needed.  Arrived in perfect condition and is very easy to install.", "verified": true, "helpfulness": "0/0", "author": "L. A. Alcantar \"maletl17\""}, {"rating": 5.0, "review": "Amazing. If you want to  stream homemade videos, there's a plugin for chrome that allows you to do that.", "verified": true, "helpfulness": "0/0", "author": "Adriano Bittar"}, {"rating": 5.0, "review": "its the best thing for the TV", "verified": true, "helpfulness": "0/0", "author": "shashi"}, {"rating": 5.0, "review": "Sweet device that does everything I need it to do.  I wish the screencast feature worked with ALL android tablets though.  My Asus Memo 7 is not supported but with the help of ES File Explorer I can at least play movies from tablet to chromecast which is why I bought it in the first place.  Netflix/Pandora/Youtube work great and the chromecast easily handles HD playback.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Never could get it to work. Even after severl phone calls to Google tech support.", "verified": true, "helpfulness": "0/0", "author": "scott jones"}, {"rating": 5.0, "review": "I have owned the Chromecast for about 6-8 months or so. It's one of the few devices that we use all of the time. Netflix,  HBO go, YouTube and it will also play online videos of websites by using the chrome Web browser.", "verified": true, "helpfulness": "0/0", "author": "Matthew S."}]