[{"rating": 5.0, "review": "It was very easy to setup and the picture is very clear as expected. Would recommend this product. Great for the price.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 3.0, "review": "I bought it and tried it out and didn't meet my expectations. I ended up returning it. Great if you like watching youtube but it is limited to do a lot of wifi features. 808laidback808", "verified": true, "helpfulness": "0/0", "author": "Braddah1974"}, {"rating": 3.0, "review": "I should have spent more time reading the reviews and the specs on this. I have a lot of movies on my computer and was looking for this to stream them to my TV but it doesn't do that. If you watch a movie over the internet, ex. Netflix, Hulu, etc... then it works great, but it only plays them through the internet, not from your hard drive.", "verified": false, "helpfulness": "0/0", "author": "William Barnes"}, {"rating": 5.0, "review": "It was just the thing that I was looking for. Being able to cast everything on TV especially those google play movies is wonderful.", "verified": true, "helpfulness": "0/0", "author": "Prakash Shesh"}, {"rating": 4.0, "review": "Hesitated buying since I alrady had Roku and cable. Bought this solely because comcast wont let roku users watch HBOGo. GOT marathon. The setup app and overall usage are quite simple. The unit powers nicely off usb in the tv. Control from S4, iphone, ipad and laptop are all simple and pretty seamless.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Williams"}, {"rating": 5.0, "review": "Best invention yet. Much more convenient than Apple TV and my Samsung smart TV streaming feature. I have 2 of these on each of my 2 TVs! So simple and user friendly!", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 3.0, "review": "Its great product to turn a dumb idiot box into a smart one. but we need more apps that support chrome cast..specially for users like me who are using Linux as primary OS :) :)", "verified": true, "helpfulness": "0/0", "author": "Ankur"}, {"rating": 5.0, "review": "Pros--can't see the wires on the back of the tv. Thank you, Google!--plays nice with android devices for streamingcons-More apps need to work with chromecast. I use google play and youtube on my phone but I hope it gets expanded to more apps", "verified": true, "helpfulness": "0/0", "author": "James H."}, {"rating": 4.0, "review": "I've got a few of these. Good to have if your tv is not a \"smart\" one. Hopefully they add more apps for these, I use them mostly for streaming Netflix and it works very well indeed in that capacity. The streaming from a pc browser is average and not very smooth or impressive.I use the Avia app on my android phone to stream pics and that works well. Setting them up is usually easy but I did run into one that failed to connect and had to return for replacement. They're ok for the price and beats adding boxes everywhere.", "verified": true, "helpfulness": "0/0", "author": "RC"}, {"rating": 1.0, "review": "Whatever you do, DO NOT BUY THIS PIECE OF GARBAGE. Quite simply, it does not work. It will NEVER hold a connection to wifi and you will never stream more than 30 seconds of anything before this pile of crap fails out. And that's only IF you can ever get it to find show up in your network in the first place. 99.9999999% of the time you will never find this thing on your wifi network because it simply DOES NOT WORK. If and when you finally manage to connect it after hours of cursing and wondering why google released such a faulty piece of trash to the public market, presumably knowing full well that it doesn't function, don't blink....because in a split second....it's gone and needs set up/connected again. A virtually impossible task. BUYER BEWARE is the understatement of the year.", "verified": false, "helpfulness": "1/5", "author": "JasonLives"}]