[{"rating": 4.0, "review": "I very much enjoy this product and so do my kids. Only complaint is that I wish more movies were free on prime. There is an excellent selection but some movies which are old or classic are surprisingly not free but I understand money has to be made. Overall though excellent product.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Ease of set up and extended choices made this the perfect way to add television to my bedroom and not be connected to the satellite box.  I have totally enjoyed it.  I might add that I am 71 y/o and when I say ease of set up, I mean anyone can do it.", "verified": true, "helpfulness": "1/1", "author": "Evelyn Sammons"}, {"rating": 5.0, "review": "works great , love everything about it", "verified": true, "helpfulness": "0/0", "author": "nick roma"}, {"rating": 5.0, "review": "I have to say, I love this little box. I have it setup as a media server running XBMC, and it works beautifully. Plus it has support for Hulu, Netflix, and more. All this for $99! Great deal.The only con I have is that the USB on the back currently isn't setup to work as external storage, which is unfortunate, as some of the games offered can eat up the internal storage quite quickly.", "verified": true, "helpfulness": "0/0", "author": "EMS"}, {"rating": 4.0, "review": "- simple setup - worked out of the box and took about 2 minutes to get up and running- streaming quality is good - no buffering or interruptions so far- content selection seems quite broad but have not gotten very deep into it yet- the on-screen guide is clumsy- desperately needs a second screen app for kindle, smartphone, tablet  - guide with intelligent search 'n' browse - genre, date, actors, summary, reviews, ...  - remote control  - information about the content you are watching", "verified": true, "helpfulness": "0/0", "author": "Russ Coffin"}, {"rating": 4.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "doughsl"}, {"rating": 4.0, "review": "Both video and audio quality is very good.  I just don't like the idea of paying $100 for a box only to allow me to pay amazon for every movie I watch.  Make it FREE.", "verified": true, "helpfulness": "0/0", "author": "David Holzman"}, {"rating": 3.0, "review": "My review of this butts up against a review of the shipping because of certain convenience decisions Amazon makes when shipping this device out.I don't like to have a lot of physical media laying around for my children to attack, so over the last few years I've converted a sizable physical collection to digital.  Now the physical stuff sits safely in boxes and the digital stuff flows over my network.  I've used anything from regular PCs to custom builds to any of the Android based dedicated devices currently on the market.  Most are passable at first and scale fairly poorly as applications become more advanced and the tiny single board sets inside slowly become outclassed.  When I saw the Fire TV I figured the hardware would hopefully meet my modern expectations of a computing device.  In that respect it is brilliantly successful.  The picture is great, the sound is the best I've gotten out of one of these dedicated boxes yet and the UI is perfectly responsive.  That is about where I stop being impressed.  Oh, the remote is nice and magically blue tooth.  Basically it all actually works.Major issue:First off, the shipping.  It comes pre-linked to your account.  I was naive and figured I at least needed some sort of authorization code.  No, as it came configured for me, people were able to order immediately.  A feature that isn't even very helpful as, like most people at this point, I have multiple streaming services.  That pre-configured choice was proved a terrible misstep when it was delivered to the wrong address.  Delivery is not Amazon's fault and I do not hold them at all accountable for the rare shipping issues I've had.  They pay an agent to deliver, as is normal.  What they failed to do was unlink this device when it was mis-delivered.  I know this because two orders were placed after I reported it lost.  I used the email form to report that and was informed that it was likely an accidental purchase as no orders came from any other IP.  It was suggested that I use a pin for 1-click ordering.  Something I do use elsewhere.  Considering these videos were ordered from a device I didn't have, I don't think the support actually did a very thorough job checking the logs, if they checked at all.  Now Amazon support wouldn't know this, but a sizable amount of my time is spent looking at logs and network traffic for a living.  I also have a number of methods on my home network to see what is connected, when, who it's talking to, etc.  I did my due diligence and checked if I was the victim of some absurdly unlikely attack where my shipment went to the wrong house and the receiver got on my home network to order.  This was not the case.  I was refunded the money for these items but my trust in their security practices is severely damaged.Use:As I mentioned, the picture and audio are fine.  I would expect that much as this is no where near a new type of device.  At this point in the game having a decent picture is not worth bonus points.As for the UI, Amazon received some flack for having such an Amazon 'Pay' focused menu, especially when it was missing their music streaming service.  That has been actively addressed as there are now menu entries specifically tailored to the Prime content and the music service of theirs.  When they made these changes side-loaded apps were placed another menu deep, though.  A combination of fear and ego seems to fuel a real limiting effect.  A lot of the power of these Android based devices is lost when providers lock them down too much.  It's an unfortunate oversight.  More menu customization would be very welcome.  As it stands the UI is very responsive but is setup well enough to just not be horrible.  Basically it works as expected but it's not great to use.  I would be impressed in the voice search if it worked more globally and not just for Amazon apps.  If that gets updated I'll tap dance or something.  That would be great to see.  The voice search does work just fine where it functions.The annoyances:  These devices always have them.  Especially around launch.  My unit will randomly decide to pause a show over and over again.  Sometimes it will also decide headphones are being plugged in and removed over and over.  I have no clue why.  Nothing changes and I have nothing I could accidentally be plugging in.  I just reset the thing and move on with my life but it is another example of streaming being an inferior experience to physical.Misc:I have plugged in a few USB controllers and they detected right away.  That was neat but I don't really need another game consoles.  I don't have the Amazon controller and there's no way I'd bother with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Just ok", "verified": true, "helpfulness": "0/0", "author": "David J. Atwood"}, {"rating": 5.0, "review": "Extremely pleased with the Fire TV!", "verified": true, "helpfulness": "0/0", "author": "T. J."}]