[{"rating": 5.0, "review": "I wish I had known about Chromecast earlier.  I LOVE it.  Super easy to install, and then watch videos from my laptop.  Easy to cast tv shows from Amazon Prime, Netflix, etc.  My only complaint -- you can't cast photos/videos from your phone.  With your phone, you have to use an app that connects to websites (where the casting button shows).", "verified": true, "helpfulness": "0/0", "author": "K. Dieng \"kdieng\""}, {"rating": 5.0, "review": "really love this thing. We use it every day, and I really haven't had problems with it. It does what it's supposed to, playing media content through various android apps and the chrome plugin (which can now mirror a desktop computer screen fully), and if you have a newer version of android (4.4 and beyond, I think), you can also cast your whole screen to the tv with this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"caotico\""}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "yasseressa"}, {"rating": 4.0, "review": "Works great and as expected.  We use Chromecast for youtube vids for the entire family and netflix streaming.  I also use the TV service port with no issues.  The chromecast has to reboot everytime I turn on my TV but worth it instead of running wires from an electrical outlet to the wall mount TV.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel L Jennings"}, {"rating": 4.0, "review": "Not the best device in the world but there's a lot of potential. Inexpensive and works with smartphones and connected computers. Requires a common Wi-Fi connection (meaning same login in same location for all devices - you can not use 4G, or LTE, must be Wi-Fi). You can stream major services such as hulu, Netflix, YouTube, crackle, songza, hbo, and some others, but subscriptions to those bigger services are usually needed, which you can just sign in from on your phone to access. Now the app allows you to cast your screen directly to your tv for sharing photos and apps, unfortunately, the lag time causes some problems with smooth video/audio, however this does not happen when you are watching hulu or Netflix, only when casting your phone's screen directly. Just a little bigger than a USB drive using HDMI to connect to your tv, it is super portable. I own Roku, Chromecast, and have Wi-Fi tv's. I have not tried fire tv yet. The only reason why this is a four star review is because not enough apps offer casting capabilities. There are a lot of programmers making apps for this in the play store. I bought one that allows one to draw on your phone or tablet and cast the image to the screen like a white board, and even save the image, it's called castpad, my 4 year old Bruce played with that when she visited, look ma, no messy pens and crayons and papers, lol. I have no cable, no satellite, no landline, just internet. This tool is part of my entertainment arsenal.The following was a Q&A; I answered on the BBY website.. (sept 2014).Q: If I bought one for each t.v in my house could I watch a different show on each t.v using the same tablet/phone/PC?A: Hypothetically yes, although, you will not be able to watch 2 or more Netflix out hulu shows simultaneously because the app only allows you to cast to one screen (or one device - chromecast). But the hypothetical is that if you were casting from hulu to one device and Netflix to another device, using the same phone/tablet. As long as each service points to a separately named cjromecast, this can be done. (Pause.... trying this right now on 2 of my chromecasts)... and the answer is... YES. As long as the apps are independently run, each casting to a separate chromecast device (and provided your broadband can handle the multiple video streams) no problem and worked perfectly on 3 devices simultaneously. The evil thing I thought about is that this could be an effective control over lights out for a kid, when it is decided you want to stop a stream and take it out of their control, from a central device. Hope that helps", "verified": true, "helpfulness": "0/0", "author": "MurseJeff"}, {"rating": 5.0, "review": "Really quite simple to use, and works perfect", "verified": false, "helpfulness": "0/0", "author": "Alexander Salazar Arboleda"}, {"rating": 1.0, "review": "Does not work well using an iPhone as the remote to tv. Constantly disconnects from phone and is very difficult to reconnect to tv. Closed captioning does not work on tv. I like my Roku much better!", "verified": true, "helpfulness": "0/0", "author": "JH"}, {"rating": 5.0, "review": "Great product! .. I'm very happy with this purchase. Lot's of hacks ;) .. you can stream almost whatever you want with it. I use it for my projector.", "verified": true, "helpfulness": "0/0", "author": "Alejandro M."}, {"rating": 5.0, "review": "Wonderful tool for streaming Netflix on a non-smart TV! And great for projecting lectures onto a TV when they are streaming in a web browser. I wish there were a way to project other things too... But I absolutely love my Chromcast and use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Bethany"}, {"rating": 5.0, "review": "Excelent product. Very fast shipped", "verified": true, "helpfulness": "0/0", "author": "Andres Montoya"}]