[{"rating": 5.0, "review": "Love it!  Easy to install and friendly to use.  Lots of features and options.  The remote control is awesome and the voice command works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Sheila T."}, {"rating": 5.0, "review": "This device is amazing!Installation was a breeze.Voice search is flawless.Everything ticks and flows like a charm.Even the box it comes in is magical.Once you'll try this, you'll find it very hard to go back to Roku / Apple TV (you can have mine if you like :-)Do yourself a favor, ignore the trolls' 1-star ratings. This one is a solid 5-star device.", "verified": true, "helpfulness": "1/1", "author": "Watergrinder"}, {"rating": 5.0, "review": "This is a really neat device and works very well with prime.  I have TIVO to access Netflix and Prime but this device makes it much easier.  Amazon ships it ready to work with Prime and to setup Netflix took only a few minutes.  Worth the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Tie Tried\""}, {"rating": 1.0, "review": "Well it knocked out my big screen after it down loaded all of its so-called updates. Now I have no tv. It's very clear this was thrown out there without making sure this was a quality product. Now I have to have a repair company come out and hopefully fit my screen, if they can't maybe some legal issues might have to be looked into or might go public with it. Ya I missed off!!", "verified": true, "helpfulness": "5/41", "author": "b meyer"}, {"rating": 5.0, "review": "I have read a lot of reviews on this unit both pro and con. If you need just basic functions this is the unit for you. I just needed something to stream my Amazon Instant Videos. This is perfect. Setup was easy. I am able to direct connect the Fire TV into my Router so it updated quickly and I was watching a movie within minutes. Yes there are other features that this does not have, but for their first unit it is pretty good and they will continue upgrade this. The voice remote works great to search for videos!! I recommend this unit for anyone that just would like some basic functions!", "verified": true, "helpfulness": "2/2", "author": "One Way"}, {"rating": 3.0, "review": "Works well, but not enough memory for installing apps.The user interface is not designed for having many apps installed, either.If you like playing video games, I recommend waiting for the next model that will hopefully have more memory for installing them.Also, the hardware specs for the Amazon TV seems to be a bit lower than what's in a Kindle HDX 7. I was surprised to see that considering that the Amazon TV does not need to worry about battery life.", "verified": true, "helpfulness": "1/1", "author": "Chris Gripeos \"dream.make.play\""}, {"rating": 4.0, "review": "Very easy to set up.  Very small box is nice.  I like the voice search option.  Wish that I could access Redbox. Only had for a couple of weeks so far but very happy.", "verified": true, "helpfulness": "1/1", "author": "Sheila Thompson"}, {"rating": 5.0, "review": "I currently own a Roku LT and a PS3 as well as several other devices that can be connected to a TV including an iPad and kindle fire hd. By far, fire TV is the best device for entertainment use, and it's potential for improvement will probably make it blow the competition out of the market when better appd are added and more mirroring capabilities.", "verified": true, "helpfulness": "0/0", "author": "A.L"}, {"rating": 5.0, "review": "As soon as received it I added XMBC to give easy access to all of my local shared files Nas and other wise. The unit itself is working great. They have really hit it out of the park on this one:)", "verified": true, "helpfulness": "0/0", "author": "Ralphie"}, {"rating": 1.0, "review": "Other similar products (Apple TV, Roku, etc.) are very easy to understand and operate.  More importantly, they come with a lot of channels already installed, including all the major channels (Netflix, Amazon, for instance) as well as some obscure yet fun channels such as the one where you can see the pilot episodes of old TV shows (example, the original Superman TV series.)One of the main reasons I have these products (Fire TV, Roku, etc.) is to watch MLB-TV.  It's a subscription I pay for, and it lets me watch any game (except local games and games that are televised nationally on ESPN or MLB Network).  There's a similar app for basketball.Having said that, it never occurred to me to check to see if MLB-TV is available.  It is not.  Now I see a whole bunch of stuff isn't available for Fire TV.Amazon really had it together when they released the Kindle Fire.  If you have the Kindle Fire, adding MLB-TV is really easy.  Adding ANY channel is easy.  But, I made a huge mistake thinking Fire TV was going to be a fantastic piece of hardware.  While the setup was very simple, Fire TV only offers a handful of channels.  Another app I wanted is one that plays streaming audio.  Unfortunately, the app installed in Fire TV does not find the streams I want.  And I cannot add the app I want for audio playback.  Meanwhile Roku finds them -- even the Kindle Fire finds them -- and lets you instantly save them to your device so you don't have to search every time.I'm sure there are a lot of channels coming for Fire TV.  In the meantime, you're handcuffed to a very limited number of channels. Unfortunately, the entire setup assumes you want Amazon's videos.  Unless you're a Prime member, Amazon charges for everything.  And, it should be noted that Amazon Prime does not mean you get everything free.  If you want to watch a recent movie, chances are good it'll cost you.  I found a movie I wanted to see and it was $6 to rent.  No advantage to being a Prime member.Keep in mind that not all Prime TV or movies are free.  I subscribe to Netflix.  When I searched for House of Cards on Netflix, it brought up House of Cards for $2.99/episode on Amazon.  So you need to be sure you understand that voice search is not a good thing if you subscribe to anything other than Amazon Prime.Fortunately, it's easy to re-install Roku.  With Roku, all the sports channels I want are right there.  I can listen to the audio streams I like.  I have a huge amount of channels, INCLUDING Amazon.  In other words, my Roku gives me everything that's on Fire TV, as well has a large selection of additional channels.I just get the feeling Fire TV was not very well thought out.  Not nearly as thought out as the Kindle Fire.  And it's seriously lacking when compared to Roku.It will be interesting to see how long it takes to start adding more channels.  As of right now, I can't find any on the Amazon.com website.", "verified": true, "helpfulness": "9/29", "author": "Jon Badeaux"}]