[{"rating": 5.0, "review": "the best thing to use if you dont have the budget to get a smart tv", "verified": true, "helpfulness": "0/0", "author": "Ena Urbina"}, {"rating": 3.0, "review": "Lags quite a bit for me, much more than the Apple TV Airplay stream from my laptop.", "verified": true, "helpfulness": "0/0", "author": "J. Stout"}, {"rating": 5.0, "review": "Now that Chromecast supports native screen mirroring, this is the best purchase I have ever done. 1080p native screen mirroring is great for watching movies & TV Shows", "verified": true, "helpfulness": "0/0", "author": "Ara"}, {"rating": 5.0, "review": "amazing gadget... easy to set up and works flawlessly", "verified": true, "helpfulness": "0/0", "author": "Gmiller"}, {"rating": 5.0, "review": "This is great. Allows me to watch HBO Go and You Tube videos. Wish more would use it!", "verified": true, "helpfulness": "0/0", "author": "P. Welu"}, {"rating": 4.0, "review": "Great alternative to buying a smart TV. So nice to be able to control from a smart phone. Just wish it had a few additional features.- An on-screen menu would be nice, and simple to implement with HDMI CEC. Could be done similar to the RasPlex media center image.- Ethernet plug in the back would make streaming better when one has poor Wifi signal.- A windows / linux application for streaming an entire screen output shouldn't be any more difficult to implement than the Chrome browser streaming.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Great value for money. Great Product.", "verified": true, "helpfulness": "0/0", "author": "Paul Rausch"}, {"rating": 5.0, "review": "Works just like it says, easy set up.", "verified": true, "helpfulness": "0/0", "author": "Sally Rogers"}, {"rating": 5.0, "review": "I have not had any problems with the Chromecast so far. Quick response times as well.", "verified": true, "helpfulness": "0/0", "author": "Akil Gubbi \"skyhawk\""}, {"rating": 3.0, "review": "Not a bad. Being able to stream media from an android device to the Chromecast is nice, but it's limited to various google apps. I had gotten this so that I can broadcast my presentations during meeting, but I'm finding the limitation is enough to stop me from using it.", "verified": true, "helpfulness": "0/0", "author": "Nipith"}]