[{"rating": 5.0, "review": "I love the Amazon Fire TV.  Works great and I can get many shows that I cannot find any where else.", "verified": true, "helpfulness": "1/1", "author": "John L. Waite"}, {"rating": 5.0, "review": "wonderful product, decision to purchase it was the best ever.thank you", "verified": true, "helpfulness": "0/0", "author": "mandy butler"}, {"rating": 5.0, "review": "I do like alot  goodshows old and new", "verified": true, "helpfulness": "0/0", "author": "Doreen Nelson"}, {"rating": 5.0, "review": "The Amazon Fire TV was very easy to set up...comes with steps 1-2-3 \"et voila!\" The plus is that I am a Prime Member and have unlimited cloud space...so I have set my cell phone camera to upload all the pictures/videos to the cloud...so convenient when you want to view on your big TV screen.  Love it!", "verified": true, "helpfulness": "1/1", "author": "Carole J. Ramos"}, {"rating": 5.0, "review": "we love it", "verified": true, "helpfulness": "0/0", "author": "cathy schaefer"}, {"rating": 5.0, "review": "great product after I figured it out", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "Since we made this purchase it's provided great entertainment for the whole family! Easy set up.  My kids would like more options for game apps, hopefully that will come in time.", "verified": true, "helpfulness": "0/0", "author": "Janet Hilscher"}, {"rating": 3.0, "review": "Very unhappy that Charter Cable and HBOGO are not hooked up to go on Fire TV...", "verified": true, "helpfulness": "0/2", "author": "CARL D MACDONALD"}, {"rating": 1.0, "review": "This is the first time I write a review because this is the first time that I felt so disappointed to Amazon. It worked well for first 2 months, after then it couldn't stream anything except commercials. At the first, I thought it was hulu+'s problem, and what I found was hulu works good on my computer. Though, prime movie even cannot be streamed on the box. The worst thing is I don't even know where to contact to get a solution for it. SUPER DISAPPOINTED!!!", "verified": true, "helpfulness": "2/4", "author": "HuiziQian"}, {"rating": 4.0, "review": "Amazon Fire TV offers many options for TV programs and movie viewing; at this time it appears to have been a good purchase. I have not had the time to go through all of the programs and options that are available. The one thing that stands out is that some things are free and some are paid. You just can't push the button and think it is free.Believe it or not, there are some commercials.  One reason for getting Fire TV was to get away from stupid commercials. They say there is 1 free month of Amazon Prime but no indication of the starting date.  Is it the day you installed  and registered the program or when you actually try to get a free Amazon program.  Other then that, it seems fine.", "verified": true, "helpfulness": "0/1", "author": "Franco Cisco \"Franco Cisco\""}]