[{"rating": 2.0, "review": "Not very reliable or fast. Either my Comcast WiFi is garbage or this Cromecast is", "verified": true, "helpfulness": "0/0", "author": "William Jackson"}, {"rating": 5.0, "review": "I love it, it works very well, very useful and for a great price. Its like an HDMI cable that you can take anywhere that does not have to be connected to the computer!", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 2.0, "review": "Stopped working in a month!😞", "verified": true, "helpfulness": "0/0", "author": "MERH"}, {"rating": 4.0, "review": "The chromecast is so nice because even if you don't have a smart TV, you can use your smartphone or tablet to watch to netflix, youtube or other programs on the tv screen. It is very e as to  configure and use.the only problem is that I must configure it again e very time I spend two or three das without using it...", "verified": true, "helpfulness": "0/0", "author": "Hellen"}, {"rating": 3.0, "review": "It is great unless you have att uvearse.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 2.0, "review": "Sometimes worked OK, but would always lose settings or lock up. I eventually got rid of it and use either direct connect or my Roku.Simply wasnt reliable enough at the time.", "verified": true, "helpfulness": "0/0", "author": "Henyaman"}, {"rating": 3.0, "review": "It is cheap for sure, but I have found the Chromecast to be very disappointing. The streaming consistency is very hit or miss (and I have XFinity Comcast Blast with 50mbps Wifi). Overall, not worth it.", "verified": true, "helpfulness": "0/0", "author": "Tejas Patil"}, {"rating": 3.0, "review": "My overall rating for the Googles Chromecast is good. The HD picture quality is excellent. The problem is controlling the device. I have a iPhone 5, Samsung tablet, laptop and a desktop PC. Out of these four devices the laptop and the PC are the most stable. The iPhone and the tablet occasionally freeze and then you must rebooted to get it to reconnect to the device. This can be very frustrating if you want to stop a movie and can no longer control it. My evaluation of the applications that control this device is there not ready for prime time. I'm sure Google will eventually iron out the problems. Until then I don't plan to buy another one. And yes I do have the latest OS and the latest Chromecast apps are installed on both my iPhone and tablet. My laptop is wireless and my PC is connected to my router by a CAT5 cable.", "verified": true, "helpfulness": "0/0", "author": "James Russell"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Esteban"}, {"rating": 5.0, "review": "I highly recommend that everyone purchase a Chromecast.  The ease at which you can stream to your TV is amazing.  Especially items that you cant stream from other AV sources.  I enjoy live sports that only stream to a PC easily on my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]