[{"rating": 5.0, "review": "Works seemlessly, had it up and running in about 5 minutes. I was surprised that it comes with an HDMI extender, which I actually ended up needing to use. You do need a decent wifi signal, but it works exactly as advertised. At 35 a pop, this is a great deal even without the free netflix. Developers are going to be onboard soon, and we should its potential soon enough. Go for it!", "verified": true, "helpfulness": "2/3", "author": "Edward Kim"}, {"rating": 5.0, "review": "This is the best way to send 90% of videos that i watch on my tablet to TV. It is unique in its own way as it doesn't drain your phone / tablet battery when streaming to TV unlike airplay. Airplay is worst , Chromecast is best. If you already has google tv then you can do all this device does. But $35 common you guys have to like it just for aggressive price. Bring on competition. I like Google's new pricing strategy. Stop winning about Google tracking your data, everyone tracks your data and it ends up in NSA hands.", "verified": false, "helpfulness": "2/3", "author": "techgeek"}, {"rating": 5.0, "review": "UPDATE: Chromecast can stream AVI, MPEG, and MP4 video files from computers. For now MKV files only play video, with no audio. May be a software update can address that.What is it?My previous article explains a bit about that.[...]Setup:Fairly simple. You can setup following provided instructions using your PC / Mac or in Android App. iOS App for setup is coming soon as of today. Doesn't mean you cannot play videos from iOS devices. You can still play from iOS devices after initial setup. It is said to be having 4 GB of flash memory and 512 MB of RAM.PROS:Stream from Android and iOS devices (Netflix and YouTube for now. More apps coming).Anything and everything you can play / open / do in your Chrome browser of Windows / Mac. This means a lot. Any content where there is no app, we can simply play from the computer. This also means you can open a local video file in your chrome and that can be streamed.Queue Management of the content. I can keep adding videos from YouTube to the TV playlist. Other devices in the same WiFi network can see and control the queue as well.CONS:Only Chrome Support in computer browsers. That is enough anyway.Sorry to Blackberry and Windows phone owners. Hey, still you can use your computer to stream.Some local file types may have challenges, for now.Mobile device streaming at the mercy of individual apps. Glad to have Netflix on board. There is YouTube obviously. I am expecting that supported app list to grow fast. Need an app to play local mobile device videos / pictures.No mirroring of mobile device like iOS AirPlay.Will it replace Roku / Xbox Streaming / Apple TV?It potentially can, if you have a computer at home. For me, it definitely will. It will even replace my Home theater Windows PC. There is hardly any content that is not playable in computer but only in these streaming boxes. Anything that plays in Chrome browser, can be streamed to Chromecast. Period.Bottomline, for $35 you get too much!", "verified": false, "helpfulness": "4/6", "author": "sivag1"}, {"rating": 5.0, "review": "Ordered they day it come out, used my Prime, with next day shipping.  Easy to setup using my HP chromebook, and was \"casting\" within minutes.  The second evening we had a youtube music video party with 3 android phones and 2 folks with iphones, we were able to keep the chromecast hopping..  very cool how all the devices seemed to work together.  Only issue we found was that the iphones couldn't add videos to the \"tv querry\", but all others could.  play on one device, and pause or skip from another.  You can even control the video volume via your phone.a few cool features that we actually used.1.  if you use the provdied power supply, the TV can be off, and you can cast to it, the TV comes on all by itself.2.  the box comes with an HDMI extender to fit TV's with tight spaces, and it also improves the wifi connection.3.  google music works quite well.4.  Browser casting doesn't work well for streaming sites, at least not on our network.  hopefully amazon, hulu, and others will get on it soon.Have fun, totally worth the money.", "verified": true, "helpfulness": "1/1", "author": "Michael Franks"}, {"rating": 5.0, "review": "100% what I expected and ordered! great product for the price and am really hopeful for further advancements in the future. I would abolutely recomend this product to anyone with children, just streemed netflix to our tv at home watching what rhymes with \"the snorelax\" and it was ABSOLUTELY HD i mean it looked bluray quality and absolutely no lag whatsoever! really great product,, and you can't beat the price point of $35! thanks!", "verified": true, "helpfulness": "3/4", "author": "Ap114"}, {"rating": 1.0, "review": "So, far it's not as cool as I hoped. Still waiting for the iPhone app. Interesting concepts. But I feel duped by hearing free NetFlix and then hearing that Google pulled the offer due to the success. #fail", "verified": true, "helpfulness": "8/75", "author": "Matthew J. Mikulsky \"Matthew Mikulsky\""}, {"rating": 5.0, "review": "I received mine 2 days early and have been using it more than expected. Build up a queue for Netflix, YouTube and Play Movies & TV for the family so everyone is happier. I personally like it a little more than Roku because I can pick something from Netflix much quicker and because Roku doesn't have YouTube (I am aware of the work a rounds). For those of you wondering this thing consumes lass power (4.25W vs 5W) and want to put one on all 3 TVs in my house.", "verified": true, "helpfulness": "4/6", "author": "L. Hank"}, {"rating": 5.0, "review": "I ordered this the hour it went on sale on Amazon, and I'm glad I did, because not only did I make it under the cutoff to get the Netflix promotion (which really makes this a steal at $11) but I got it before it sold out and was at my door Friday. After having a few days to play with it, I can safely say this is one amazing device and really a smart move by Google.It comes in a nice little package with an HDMI extender (for those tight ports on your TV), Micro-USB cord, and wall adapter, as well as a little instruction booklet I didn't really look through. To set it up, you just plug it into your HDTV or A/V Receiver (I plugged it right into the front HDMI port of my Denon AVR-1613) then plug in the usb cord for power into your TV's, Receivers, or any other USB port close by (my A/V receiver has a USB port right next to the front HDMI port, you can also plug into the wall if need be). It immediately lights up and, provided your HDTV/ Receiver is setup with CEC (Consumer Electronics Control, allows HDMI to control the device) it'll change the input automatically and even turn on some TVs!Once it's on, you're greeted to nice looking setup screen, it tells you to go to a URL on your Mac/PC to download the small Chromecast application for setup. Once you start setup it actually connects your computer's wifi to connect direly to the Chromecast, this allows you to see what networks are available for the Chromecast to connect to. You can change the name of the Chromecast to whatever you want and select your local 2.4ghz wifi network (hopefully the next revision has 5ghz abilities). It takes a little bit to connect, but once it's on the network, YOU'RE DONE! Here comes the fun.So, the idea of this product is you can send Youtube and Netflix links to the Chromecast and it plays those videos on your TV in up to 1080p with 5.1 surround (surround only for Netflix right now), then your phone, tablet, computer acts as the remote control. However, this is just the beginning of what it can do. First off, you need to have Chrome installed on your computer (preferably the Beta or Dev version, I'll get to why in a minute), then install this extension to have the ability to mirror your chrome internet tabs to your TV: [...]With this extension installed, a button appears in the top right corner of your browser which gives you the ability to stream content on your browser to your TV in 720p max with a click of the mouse. There is a slight half second lag, but no worse than something like WiDi. You have options as well, streaming quality, zooming to fit, and browser re-sizing allow you to change the look depending on your preference and TV/Computer. When you click on the name of your chromecast, it immediately starts streaming and changes the input on your TV/Reciever, you see the tab you started streaming from and you can browse any site and have it mirrored, allowing you to watch Hulu, Vimeo, go to Facebook, anywhere you want on the web. With this, it only casts that one tab, so you can actually browse other tabs or windows on you computer and it won't change what's showing up on your TV, this can be great for watching Hulu in one tab on your TV, and checking facebook on your computer in another tab.Now, getting back to why you should have the Beta or Dev channels of Chrome installed on your computer, this gives you access to the extra Chromecast feature of FULL SCREEN MIRRORING, that's right, Chrome will stream your entire computer's screen. You can see your desktop, folders, and other applications in 720p right on your TV. To do this, you have to click on the little down-arrow in the right hand corner of the Chromecast extension, here you will see \"Cast current tab\", \"Cast entire screen (experimental)\" and the ability to toggle \"Audio mode\"* to stream the audio as well as video from your computer. Selecting entire screen does exactly that, this is obviously something google is still perfecting and testing, but it has worked very well for me so far. It does take a bit more performance from your computer and local videos do not play that smoothly just yet, but it's still a nice feature. You can also drag local videos into your browser and stream that tab, but that has its hiccups as well. This type of screen mirroring is in it's beta stages though, so I'm sure it will be improved upon, streaming videos from the movies app on your phone works much better. The fact that a $35 device like this has this capability is just amazing anyway, I'm very excited to see how it evolves from here.Streaming Netflix is a breeze, using either your phone, tablet, or computer, you can select a movie/show, and select to play on your chromecast. The beauty of this is that the video doesn't stream from your device, so it's not using resources or battery on your phone or computer, the Chromecast plays Netflix natively and your other device just acts as a remote control and you can even exit the app all together and it'll still keep playing on your TV. The chromecast button even shows up in the web browser version of Netflix, making it super easy to find and watch anything. If your family all uses the Netflix app it will stay synced with whatever is playing on the Chromecast and all devices can be used together as remotes, it won't kick anyone off. Netflix looks wonderful on the Chromecast, and if more developers take advantage of the Chromecast like Netflix did, we're in for something really special here (I'm looking at you Amazon Prime!!). Google didn't leave anyone out either, iOS devices have access to the same Netflix app control as Android users.Finally you can play your local music from your phone using the wonderful Google Play Music app, it streams directly to the Chromecast and can even pull songs from your Google Cloud. The album art shows up on screen and you can browse all your music and control it from your phone while it plays on the Chromecast. This is much better and easier than using bluetooth or just plugging your phone into your receiver. Pandora is supposed to add support very soon, so I'll update when that hits, I'm very excited about that and hopefully developers like Spotify will follow suit. Unfortunately, the music app does not allow multiple devices to queue music into a Chromecast playlist, the Youtube app does allow this for videos, and the Nexus-Q did allow this for music, so I'm hoping Google will add that ability very soon, but it's still good for playing a playlist on one device right now.One last note, the Chromecast does get VERY hot to the touch, supposedly this is normal and Google has acknowledged as such. There is a huge heat sink inside that goes right up against the plastic shell, be careful when handling after heavy usage. I think it is designed to handle extreme heat, so you shouldn't worry about the device, but just thought I'd mention it.So, to wrap up, this is one hell of a device for $35, and really should be a part of every living room, it just has so many capabilities and even more potential. Do yourself a favor, and pick one up, you won't be sorry, should make a great gift too!*UPDATE: The \"audio mode\" I referred to earlier is actually a feature that lowers video bandwidth in favor of increasing audio bandwidth when streaming for better quality and consistency when playing music from your browser. It DOES make your video extremely choppy, so if you want to watch video, un-check the \"audio-mode\" and and your stream will still play audio, but the video will be of a much better frame-rate. You can turn Audio on and off with the little speaker button that shows up when casting.", "verified": false, "helpfulness": "45/60", "author": "Douglas Curley \"Doug Curley\""}, {"rating": 5.0, "review": "As far as I am concerned, they just killed set top boxes, and to a large extent cable television. So impressed.", "verified": true, "helpfulness": "3/4", "author": "Daniel Sacks"}, {"rating": 1.0, "review": "Initial setup isn't quite as easy as they make it out to be. Some things you might not know.1 - You need a laptop or PC that is connected to your wi-fi router wirelessly. I don't have a laptop and my PC is wired to my router so this method of activation is out.2 - You can use a smartphone or tablet to setup as well. Sweet I have an ipad and iPhone so I'm good to go right? Nope. iPhone and iPad setup functionality is \"coming soon\". So yeah you can set it up via phone or tablet as long as they're Android. Great. They didn't quite mention that part.Hopefully iOS setup support is actually coming soon so I can use this thing. As of now it's pretty useless.", "verified": true, "helpfulness": "29/127", "author": "Jeremy Kane"}]