[{"rating": 4.0, "review": "Love it....great price....now i have a smart tv.  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Rothchilds"}, {"rating": 3.0, "review": "Needs Ethernet integration to work reliably.  Less than perfect wireless reception makes it very choppy.  Using your smartphone as a remote is a lot less convenient than it sounds, especially with an android phone (and you would think it would be more seamless with Google's mobile OS).  The software and content availability are pretty amazing, though.  Can't say how it compares to Roku or Apple TV, but it is FAR superior to \"Smart\" TV or DVD player software.", "verified": true, "helpfulness": "0/0", "author": "Charles Cone"}, {"rating": 5.0, "review": "One of the few products of this type that work flawlessly.", "verified": true, "helpfulness": "0/0", "author": "acharya"}, {"rating": 5.0, "review": "Works great! Love the Cast screen option, let's me see my phone directly on muy tv. Easy to set up, no hassle at all.", "verified": true, "helpfulness": "0/0", "author": "Miguel Jacobo"}, {"rating": 5.0, "review": "Very useful little gadget. Love it. Now if android can come up with a better way to use it, auto detect, auto full screen, etc.", "verified": true, "helpfulness": "0/0", "author": "Benji \"Amazonian\""}, {"rating": 5.0, "review": "Thanks.", "verified": true, "helpfulness": "0/0", "author": "Willy - Peru"}, {"rating": 4.0, "review": "It's Ok", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Sachs"}, {"rating": 3.0, "review": "Google Chrome cast works well enough, but it is still horribly slow. At least mine is.1. When using it on my iPhone, it often disconnects from my phone and continues to play just off my wi-fi​. This is fine, but it takes my phone a long time to reconnect after it disconnects, making it hard to adjust any settings. Sometimes I have to completely close out Netflix or whatever application is running and re-open it to get it to connect.2. When using in my computer it makes chrome run meticulously slow. I can't stand it and just don't use it. In fairness, my computer is a few years old, but I can run pretty large programs without problems.Overall - It is a great device/idea, but it just isn't polished enough yet. Roku is a better option in my opinion. I haven't tried the kindle stick, but it may also be better.", "verified": true, "helpfulness": "0/0", "author": "Phillip"}, {"rating": 5.0, "review": "Technology is amazing. Seamlessly stream video from your phone to your TV. It's like magic.", "verified": true, "helpfulness": "0/0", "author": "Jesse V."}, {"rating": 5.0, "review": "Got this for my mom for mothers day, she loves it. Easy to set up and use even though she can be technologically challenged sometimes.", "verified": true, "helpfulness": "0/0", "author": "Matt"}]