[{"rating": 5.0, "review": "Just wish it was compatible with more stuff. It works great with Netflix and YouTube and offers a quick portable route of streaming videos I did use with my mac to stream things from Google chrome browser but couldn't use with surface", "verified": true, "helpfulness": "0/0", "author": "Mommy of many kids"}, {"rating": 3.0, "review": "Good for websites $uch a$ hulu, you tube, netflix, and the like; but streaming from a local media server, not so much. You get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "G. Corrigan \"IT Professional\""}, {"rating": 4.0, "review": "Bought this for my son. Great and at the right price. An easy way to do Netflix if you don't have solos other device. The supporting ecosystem is not fully there yet, but still a lot of fun. Great for YouTube!", "verified": true, "helpfulness": "0/0", "author": "Techno user"}, {"rating": 4.0, "review": "This unit did take quite a bit of time to setup. Finally realized it had to go through a few hours worth of updates before it would function properly. Now it works great! works with my ipad mini, Android phone, laptop and sibling's iphones! Overall the cheapest way to convert that old LCD TV into a half-way decent smart TV. would highly recommend!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 3.0, "review": "It works well but the variety is very limited. As soon as more variety is added, it will be worthy of two more stars.", "verified": true, "helpfulness": "0/0", "author": "Anthony Cooper"}, {"rating": 5.0, "review": "We have one of these and LOVE it. We gave them as Christmas gifts and the recipients are loving these gifts.", "verified": true, "helpfulness": "0/0", "author": "Mary Bell"}, {"rating": 3.0, "review": "Not sure if we are doing something wrong, but so far all we can figure out that it supports Netflix and Youtube apps. We have Netflix on the big screen already. So we can only use it for One app??", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "If your a Netflix junkie this is for you as it's cheaper than buying a new \"smart\" tv and so far I have not had any issues with it.", "verified": true, "helpfulness": "0/0", "author": "Justin D. Cofer"}, {"rating": 5.0, "review": "The Chromecast is a wonderful creation by Google.  It turns any TV with an HDMI port into a multi-media powerhouse.It is super easy to setup and as soon as you do, pretty much anything you can put on your Chrome browser on your computer, phone, or tablet and be cast to your TV.  Do you have a HD TV that isn't a Smart TV?  Well for about $30 the Chromecast turns your not-so-Smart TV into a very Smart TV.For you techies out there that use Plex, the Chromecast is a playback device now recognized by Plex!  No more expensive hardware as a Plex client, just get a Chromecast and Plex away!", "verified": true, "helpfulness": "0/0", "author": "Prime Risk \"primerisk\""}, {"rating": 5.0, "review": "unbelivable didn't think it would be so easy! my 52 inch tv makes my internet look so amazing on tv!", "verified": true, "helpfulness": "0/0", "author": "helen ferencz"}]