[{"rating": 1.0, "review": "I am not happy with the fire box so far.  I haven't had the time or wanted to get on the phone with amazon yet to find out what is the problem.  Every time I try and watch something it buffers constantly.  On Netflix and amazon.  it's not even usable.  I also own a chromecast.  I can unplug my fire tv and plug in my chromecast and watch the same thing and it won't buffer once.  I don't understand the problem, but I am very disappointed", "verified": true, "helpfulness": "1/5", "author": "joseph bridges"}, {"rating": 5.0, "review": "Brilliant, just brilliant", "verified": true, "helpfulness": "0/0", "author": "David Grundy"}, {"rating": 5.0, "review": "Great product and well made. My kids enjoy this device. I will be buying another one very soon.", "verified": true, "helpfulness": "1/1", "author": "William Curlin"}, {"rating": 1.0, "review": "impossible to get netflix on it", "verified": true, "helpfulness": "2/8", "author": "cindy martin"}, {"rating": 5.0, "review": "Awesome. Love it. Way better and cheaper than Apple TV", "verified": true, "helpfulness": "2/2", "author": "DTran"}, {"rating": 1.0, "review": "Hdmi TV will it work on my TV it's an LG", "verified": false, "helpfulness": "1/10", "author": "Eric Mauro"}, {"rating": 5.0, "review": "Amazon fire tv, for the money; is the best thing on the market! Amazon prime membership is awesome!  Go check it out and read the reviews.  I beleive its a great buy!", "verified": true, "helpfulness": "1/1", "author": "brandon"}, {"rating": 5.0, "review": "Works like a charm! Side loading apps was simple with ADB.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Bogle"}, {"rating": 5.0, "review": "If you are going to give this product 1 star, but only ask questions, then you're wrong. Also, for those who are mad because you paid $99 and not sale price then just contact Amazon and they'll refund the difference if within 7 days. Outside of that return and rebuy then. You're not contributing to the review of this product. Anyways 5 stars, why? Because I said so.", "verified": false, "helpfulness": "4/7", "author": "Joshua Donovan"}, {"rating": 5.0, "review": "I really like my Fire TV. I decided on the Fire TV, because I use Amazon products like the Kindle eReaders and Kindle Fire tablet. They work well together. I am a Prime member and stream Amazon Instant videos. I also use Netflix and other streaming services, so I wanted a unit that would handle Amazon content well as well as other content. This does a great job. It integrates well with the Fire tablet. I absolutley love the voice remote. It is very easy to setup and use right out of the box like most Amazon products.", "verified": true, "helpfulness": "2/2", "author": "Martha A Collins"}]