[{"rating": 5.0, "review": "This is truly plug and play.  I got the book to unlock the untapped and found that i didn't need it.  However, it wasn't a waste.  I use the Chromecast exclusively for Netflix and link off my phone and it works like a charm.", "verified": true, "helpfulness": "1/1", "author": "Moxie Me \"MadDog\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Akshay"}, {"rating": 4.0, "review": "Not great for travelling, works well at home but sometimes we forget to use it.", "verified": true, "helpfulness": "0/0", "author": "Ken S."}, {"rating": 5.0, "review": "Best product from Google so far!", "verified": true, "helpfulness": "0/0", "author": "Sanket Jain"}, {"rating": 5.0, "review": "Let's start off by thanking google for their incredible customer service. Thank you for being so quick to answer my calls day or night and providing me with real solutions! It means a lot in today's state of service!Now, I got this for my mediavore spouse last christmas and we both love it. I'm curious to see how the Fire Stick compares, but that's for another review or update.We use this for streaming youtube, netflix, and pandora primarily. I don't think it's worth trying to stream your chromecast tabs. For whatever reason, it ends up looking less than ideal so unless you're doing a complicated presentation that requires chromecast, stick to you vga or hdmi.If you use netflix more than once a week, buy this. It's that simple.", "verified": true, "helpfulness": "1/1", "author": "Patricia"}, {"rating": 5.0, "review": "Absolutely love the product and the price. The longer I have owned it the more i  can use it because more and more apps keep adding this feature. Also easy to use and set up!", "verified": true, "helpfulness": "0/0", "author": "Kristyn Dinger \"Kristyn Dinger\""}, {"rating": 1.0, "review": "Don't buy it if your network is public like in Universities", "verified": true, "helpfulness": "0/0", "author": "Diego Lopez Isas"}, {"rating": 3.0, "review": "i guess it does what it's supposed to do, but i much prefer by Roku.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Say something about yourself!\""}, {"rating": 5.0, "review": "LOVEEEEEEE. Truly a life changer. If you dont have chromecast already, you need it.", "verified": true, "helpfulness": "0/0", "author": "Katelyn"}, {"rating": 5.0, "review": "We have 3 and use them every day. It is perfect when combined with Plex.", "verified": true, "helpfulness": "0/0", "author": "DavidC18"}]