[{"rating": 5.0, "review": "I bought 2 one for dad and one for my husband for christmas and they both really loved it. And this is crazy that you would have to use a min. of words to explain how you love a product!!", "verified": true, "helpfulness": "0/0", "author": "linnette"}, {"rating": 5.0, "review": "Allows you to view YouTube over any with HDMI inputs, allows you to stream from up to 5 portable devices.", "verified": true, "helpfulness": "0/0", "author": "W Woody \"Woody\""}, {"rating": 5.0, "review": "The best hook up for a novice like me who can't afford Hulu or other top of the line systems.", "verified": true, "helpfulness": "0/0", "author": "greentoo"}, {"rating": 5.0, "review": "Surprised that I liked it as much as I have.  Hope that there will be more add on options available on the iPad and iPhone.", "verified": true, "helpfulness": "0/0", "author": "Lori Furr"}, {"rating": 2.0, "review": "I got this as a gift and was quite happy as I had considered purchasing myself.  I'm glad I didn't pay for this myself as I'm finding it pretty worthless.My plan was to use in conjunction with my laptop instead of a mobile device.-  Youtube.  Videos from youtube.com work flawlessly.-  Hulu.  I next tried Hulu.  Through a laptop -- you have to use the \"cast from tab\" (beta) function...... and it's terrible.  It's just unable to stream to laptop and then chromecast -- very slow, choppy, unwatchable.  The only \"app\" for Hulu requires:  1.  a HuluPlus account and 2.  It's only available for some mobile device operating systems.  You CANNOT do this through your laptop.... at all.You might as well just get the cable to connect your laptop to your TV and skip Chromecast.- Netflix.  I don't have an account... but I believe Netflix 's Chrome browser extension works in a laptop browser without needing a mobile app.  This extension acts successfully like the youtube method.  So if you have a netflix acount -- then it's probably worth it (but chances are you've already got a way to do this already).:o)", "verified": false, "helpfulness": "0/1", "author": "Denise Hendsbee - ExtraView Corporation"}, {"rating": 5.0, "review": "i have a media center pc with quite a few movies stored on it and now with this item and plex can watch any movie on the tv in my Livingroom for the PC", "verified": true, "helpfulness": "0/0", "author": "Michael Kelly"}, {"rating": 5.0, "review": "I love this item east to use and works great for what i need it. I recommend this product very useful .", "verified": true, "helpfulness": "0/0", "author": "Juan Restrepo"}, {"rating": 5.0, "review": "I love my chromecast.  I now have one on every tv in my home.  You can typically add $100 to any tv to get the smart functions.  With chromecast you can do it for $30.  Can't beat that.  Great for traveling.  Links to phone, tablet, laptop and desktop.  You can even mirror your desktop screen using the beta screening option.  Great value. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Ratliff"}, {"rating": 5.0, "review": "Got my mom and sis each one of these - they love how convenient they are and how well they work!", "verified": true, "helpfulness": "0/0", "author": "Kelsey Schieren"}, {"rating": 5.0, "review": "I bought this for a TV in my sewing room that isn't hooked up to a cable box. I have been able to play movies and shows via Netflix and Youtube while working in that room, it's very easy to use and was very easy to set up. I can even move it to other TVs in the house without having to change any settings.", "verified": true, "helpfulness": "0/0", "author": "M. Cieri"}]