[{"rating": 5.0, "review": "Immediately uplifted my \"dumb\" tv set to smart after a couple of minutes configuring the wifi access. It works pretty fine casting YouTube, Netflix and TuneIn from my Android device (Samsung Galaxy S6) and from an iMac (OS X Yosemite) using Chrome with the Google Cast Chrome extension. For casting local videos in my iMac I use VideoStream for Google Chromecast (Chrome app).", "verified": true, "helpfulness": "0/0", "author": "Andrés Meza"}, {"rating": 5.0, "review": "👍🏼👍🏼", "verified": true, "helpfulness": "0/0", "author": "carlos"}, {"rating": 4.0, "review": "Very handy and portable and great quality for the price.Note: Use the strap to make sure gravity doesn't mess up streaming the video.", "verified": true, "helpfulness": "0/0", "author": "Michael W."}, {"rating": 5.0, "review": "excellent product quality", "verified": true, "helpfulness": "0/0", "author": "Orlando Volquez"}, {"rating": 1.0, "review": "doesn't function (I have another one perfect)", "verified": true, "helpfulness": "0/0", "author": "AYMERICH_2250"}, {"rating": 5.0, "review": "Wow so Kool... Can see All what Netflix has 2 Offer & yes that includes Movies....", "verified": true, "helpfulness": "0/0", "author": "Lorraine Chamblee"}, {"rating": 1.0, "review": "Does not work with Vista OS", "verified": true, "helpfulness": "0/0", "author": "froggy47 \"froggy47\""}, {"rating": 1.0, "review": "Save your money and buy Apple TV or something else. This is garbage! I have gone around and around on the internet trying to trouble shoot this device. On my TV all I get is an error message telling me I am connected to the internet but cannot access the internet? After looking online for assistance I found several other folks with the same issue. If that many folks are having problems then this is not a very well thought out product. I have reconfigured my router, spent two hours on help lines, searched the internet time and time again and I still cannot get this to work. Not heavy enough for a door stop. JUNK!", "verified": true, "helpfulness": "0/0", "author": "Father"}, {"rating": 5.0, "review": "best gadget ive purchased in a long time", "verified": true, "helpfulness": "0/0", "author": "willow"}, {"rating": 5.0, "review": "Love it. Use it in my apt were I don't have a box. Also when I go away I take it to watch my cable programs", "verified": true, "helpfulness": "0/0", "author": "steven cohen"}]