[{"rating": 5.0, "review": "This little box rocks. So much you can access. Super fast, easy to use and the kids love it. Go from cable/dish and 100+ bucks a month to prime + netflix for about 20 bucks a month and just as much tv. The remote is great and I would definitely recommend this to anyone. Add an antenna to the house and completely replace cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm just now getting into these types of devices but I love the Fire tv! It's almost like a big Kindle to me (which I also love) minus the books. The best way to use this is to have a prime membership. Prime offers so many titles. I also think subscribing to Netflix and Hulu are a must to get the most use from Fire tv. These are not big expenses and definitely worth it. There are also other apps like Pandora and games too which my daughter enjoys. I also like that it provides password protected purchases so I can control what is bought. On occasion the Wi-Fi gives me issues and the voice recognition will only explore Amazon content but no big deal for me. Since I got the Fire tv I have already canceled two of my four cable boxes! With the Fire tv I'm able to access my regular cable tv shows, movies and more at a much cheaper price ( with the hulu & other subscriptions). Just give it a try, I did and I'm addicted and ready to buy another one!", "verified": true, "helpfulness": "0/0", "author": "PinkDove"}, {"rating": 5.0, "review": "Loving it.", "verified": true, "helpfulness": "0/0", "author": "B.Braxton"}, {"rating": 5.0, "review": "Great product for movie apps, but not so much for game apps", "verified": true, "helpfulness": "0/0", "author": "Ronald Arndt"}, {"rating": 3.0, "review": "Great on the free stuff, too much pay for, and too expensive, considering payment to use in the first place up the cost and make everything free.", "verified": true, "helpfulness": "0/1", "author": "Harmon Talley \"Butch\""}, {"rating": 5.0, "review": "Easy to use and works great", "verified": true, "helpfulness": "0/0", "author": "Mr Rodge"}, {"rating": 5.0, "review": "Awesome. Blazingly fast streaming.", "verified": true, "helpfulness": "0/0", "author": "Papaw Fitz"}, {"rating": 5.0, "review": "Very cool little box replaced my cable bill (over $200 a month) so it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Maria E. Rodriguez \"MER\""}, {"rating": 5.0, "review": "Great poduct", "verified": true, "helpfulness": "0/0", "author": "Rickguylooking724"}, {"rating": 5.0, "review": "A wonderful addition to my viewing experience. It makes my kitchen chores, ironing, sewing and virtually any other mindless projects that I can drag into my viewing range much less mind numbing. I love being able to pause viewing so I can tend to some noisy part of a recipe or to leave the room briefly. Also, I enjoy being able to put Pandora on. I did come up with a way to protect the remote from kitchen-messy touches. I enclose the remote snuggly in a plastic wrap (like ziploc bag) then secure the wrapped remote to a small wood block to lift it off the counter surface. Now neither sticky fingers nor something spilled (it happens!) are going to dirty/damage it.", "verified": true, "helpfulness": "0/0", "author": "L. Fleet"}]