[{"rating": 4.0, "review": "Love these, I have 4. But, they have overheated on me.", "verified": true, "helpfulness": "1/2", "author": "FastKatt"}, {"rating": 5.0, "review": "Pretty awesome. Looking forward to these type of products getting more functionality. Works great for streaming from your laptop, or better yet, your phone. Cable television should be dead soon.", "verified": true, "helpfulness": "1/1", "author": "Viceroy Habanero"}, {"rating": 5.0, "review": "The best 30$ I've ever spent. My wife and kids use it basically every day. Whether you get a Chromecast or the equivalents out there, having a smart stick to stream netflix, stream videos from your PC, a home media server, or even just Youtube, makes things a lot more convenient.", "verified": true, "helpfulness": "0/0", "author": "pongsifu"}, {"rating": 5.0, "review": "Works great! good product.", "verified": true, "helpfulness": "0/1", "author": "Fabio Maldonado"}, {"rating": 5.0, "review": "Best media purchase ever!", "verified": true, "helpfulness": "0/1", "author": "Eric V \"Eric\""}, {"rating": 4.0, "review": "Works really well.  I bought it for the garage TV to replace the cable box and save $$.  Picture quality is excellent, but we also have very high speed internet service.  Other than ESPN, not many sports options.  HGTV, Food, Disney, and plenty of kids programming and news.  Additional sports channels would gain it 4 stars.  I've moved the unit to our guest room TV, and will return to the cable box for the garage for more sports options.", "verified": true, "helpfulness": "0/0", "author": "Mr S - Indiana"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "J.Hunt"}, {"rating": 4.0, "review": "Works as intended but a bit pointless for me. I got one to replace having to hook up a pc to the tv for Netflix, but the fact I have to control it with my phone, tablet or pc kind of negates some of its usefulness. Still, I like it and have it more as a backup.", "verified": true, "helpfulness": "0/0", "author": "Robert Roy"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "Halinka"}, {"rating": 5.0, "review": "Another amazing product from  Google!", "verified": true, "helpfulness": "0/1", "author": "Emmett Marrone"}]