[{"rating": 5.0, "review": "This is a great device. With more to come. Many great developers are making more content for the chromecast so if you dont like it now there is more to come. Its wonderfully easy and simple to use.", "verified": true, "helpfulness": "0/0", "author": "foster"}, {"rating": 5.0, "review": "It's not always flawless but when it works it's quite handy. The only real downside is that it requires external power but that's not a big deal.Streams from various Chromecast apps but just Youtube alone is already a nice experience. Maybe you're getting what you paid for but the experience is well beyond $35.", "verified": true, "helpfulness": "0/0", "author": "Jeff Chuang"}, {"rating": 4.0, "review": "This device works very well at what it does.  It needs more sources than You Tube and Netflix, and the tab mirroring from the Chrome browser lags a bit.  But for playing Netflix, or a You Tube video, the performance is great.Controlling the Netflix player is something else, as it requires using the Netflix app.  From my Android phone, the Netflix app seems to often forget that it's playing via Chromecast, and has to reconnect.  On my MacBook, Netflix wanted to install \"Silverlight\", which is pretty ridiculous for a remote control (all that I want it to do).Bottom line: worth the price for now, may mature into a fantastic product.", "verified": true, "helpfulness": "0/0", "author": "Bill \"billev2k\""}, {"rating": 5.0, "review": "Great way to watch the web on my TV. It is a truly innovative product! Google has done it again", "verified": true, "helpfulness": "0/0", "author": "Dave M. Sanda"}, {"rating": 4.0, "review": "I would've given 4.5 if there was a choice. Only thing that I don't like is that with the chrome browser there is a lag for example other streaming videos like on private websites besides youtube and netflix are slower.  However, it is in beta phase so it should get better..Amazing how you can stream from your smartphone perfectly!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The device works great! In fact it works better than I had even hoped and with the additional features soon to follow could there really be a better investment?", "verified": false, "helpfulness": "0/0", "author": "RichardH"}, {"rating": 5.0, "review": "Does just what it says. Completely happy with my purchase and my neighbor saw it and is completely jealous of it!", "verified": true, "helpfulness": "0/0", "author": "Doxie"}, {"rating": 5.0, "review": "as soon as I learn how to make it work  I don't have it functional at the present.  jDqmmms mammmms", "verified": true, "helpfulness": "0/0", "author": "Patrick Osburn"}, {"rating": 5.0, "review": "The device is easy to install, easy to configure, and easy to use. If your looking for an easy way to get media onto your tv.", "verified": true, "helpfulness": "0/0", "author": "Ryan L Steele"}, {"rating": 4.0, "review": "I was one of those that bought this within minutes of it showing up on Amazon on launch day. I can't say for sure if I would have done that without the three months of Netflix, but I'm glad I did go ahead with the purchase. While the uses are very limited today, if the companies that have promised support for the Chromecast follow through, I imagine I'll change this to 5/5 instead of 4/5. Setup was easy, and using it is simple. It's inexpensive, and extremely portable. I may end up buying another to keep plugged into the second TV later on.", "verified": true, "helpfulness": "0/0", "author": "Joshua S. Falk"}]