[{"rating": 5.0, "review": "Definitely recommend it to you tube users who spend a lot of time watching videos on the internet all the time.", "verified": true, "helpfulness": "0/0", "author": "Anand Kumar"}, {"rating": 5.0, "review": "I simply love this thing.  I am NOT electronic savvy so it is a good thing this Chromecast was so simple to get running.  The only thing Amazon needs to do is get Amazon Prime updated so it will run with Chromecast as so many other streaming programs do.", "verified": true, "helpfulness": "0/0", "author": "Joy Faye Hurt"}, {"rating": 5.0, "review": "Pretty cool for the price , needs more apps but maybe they will be coming later. Picture quality is great !", "verified": true, "helpfulness": "0/0", "author": "Davis"}, {"rating": 5.0, "review": "Does what I thought. Can't wait for more apps to come out too. Might may even buy another for other tv in house", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It works great, use it all the time. My son loves to watch all of his shows with it. Great product", "verified": true, "helpfulness": "0/0", "author": "Jon S"}, {"rating": 5.0, "review": "Very cool stuff, my daughter is so happy and she can watch barbie dreamhouse in her tv, broadcasting from her tables :)", "verified": true, "helpfulness": "0/0", "author": "Jorge Olivares"}, {"rating": 5.0, "review": "Item as described. Fast shipping. I gave these as Christmas presents and everyone loves them. Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Dennis Smith"}, {"rating": 4.0, "review": "I've had this for about a month now and use it regularly. The services that it supports are pretty limited and if it allowed the casting of my own videos, it would be even better. Thank goodness for the Google Cast Chrome browser add-in which is the way I primarily use this. I cast shows from xfinity (Comcast) that are available on-line (laptop or tablet), but not on demand via my DVR. It seems to work great.", "verified": true, "helpfulness": "0/0", "author": "Joan E. Santoro"}, {"rating": 3.0, "review": "It's ok needs more features !  But works as advertised. Hopefully it will develops more apps and video for it", "verified": true, "helpfulness": "0/0", "author": "ferhaad hakimi"}, {"rating": 1.0, "review": "That's the reason I returned the item. After a phone call to Google Chromecast team, they suggested me to replace my (perfectly working) wireless router. It doesn't make sense at all.", "verified": true, "helpfulness": "0/1", "author": "Evans MS"}]