[{"rating": 5.0, "review": "Amazon knocked it out of the park with this baby! I have the Fire TV hooked to our screaming fast 1.5 mb T-1 line. I was concerned that it would not work, due to the lack of \"speed\" that my internet connection offers. Sadly, T-1 is all we can get in my neck of the literal woods, so it has to do.Anyways, the Fire TV was a breeze to set up, truly plug and play. Grabbed my wifi signal off of our Apple Airport network with ease, very compatible. Welcome screen loaded very quickly, I was very surprised. First show I watched on Prime, again, loaded right up! I was watching a movie in seconds. We have a 2nd gen AppleTV, and it would take an hour over the same network before we could watch anything. The Amazon Fire TV was broadcasting immediately, I could not believe this.If you have a slow internet connection, over 880 baud, as I did get that message once, the Fire TV should work for you. Kudos to Amazon, they did this right.", "verified": true, "helpfulness": "1/1", "author": "Michael F. Wright"}, {"rating": 4.0, "review": "Very easy to use.  I like having amazon prime as an additional screening option.  If they would add HBO Go and let me somehow access my iTunes cloud so I can watch the movies I've already downloaded it would be perfect.", "verified": true, "helpfulness": "0/1", "author": "gaj5006"}, {"rating": 4.0, "review": "My family really enjoy the documentaries that we are able to view. The only downside would be the lack of classic tv shows. Most of the shows that are offered are today's shows, in which most of them are garbage.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm very pleased with the product and the ease of installation.  The applications available have provided hours of entertainment.John", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It will be interesting to see the effect of these types of devices on the traditional cable tv operators although I do use it for cable based programming.", "verified": true, "helpfulness": "1/2", "author": "S. Oneill \"Cruichin\""}, {"rating": 5.0, "review": "It's so amazing. I use it more than cable and it loads so quickly and the set up was so easily it's literally just putting a few wires in. <3", "verified": true, "helpfulness": "1/2", "author": "laura Greco"}, {"rating": 5.0, "review": "I just use it for accessing movies and TV from Amazon and for that it makes that process simple and fast.  No problems nor glitches experienced when I direct connect with Ethernet cable.  Wireless hung up at times.", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 3.0, "review": "I bought this to replace my Apple TV - especially to add Plex for my video library - and get Prime instant video.I am really disappointed because the Netflix app seems very limited compared to my Apple TV.  On Apple TV I can search by genre and many other means - but not with the Fire TV Netflix app.  It's extremely limited.It is also very difficult to search through Prime movies for instant viewing.  The offerings are limited and the pay movies are mixed in. It's frustrating to look through Prime movies.  I wish they could just allow you to scroll through all Prime Instant available movies.  I guess I just assumed it would be like this -The Plex app is fantastic, and that is the saving grace of the Fire TV. I hope they can update the Netflix and the Prime offerings, because I don't have a need to search by Actor/Actress/Title if I don't know what I'm going to watch!  I'm just looking for something that captures my attention.So in the end i will have to use both my Apple TV and the Fire TV box until Fire TV can get their act together with the Netflix and Prime applications.", "verified": true, "helpfulness": "0/2", "author": "ra ra retahd"}, {"rating": 4.0, "review": "*UPDATE* May 9 2014 --  I solved the audio issue described below.  It was a loose connection on the TV's optical audio output (the TV's connection, not the Fire TV).  Probably going to return the TV.  So far, I like the Fire TV fine.  The interface is perhaps a tad busy, I'll probably get used to it.  Fire TV is considerably faster than my old Roku XD, which was a big driver for why I bought it.  Also, I joined Prime (and cancelled Netflix streaming for now), so this device seems to make sense for me.  I really hope Amazon MP3 is supported soon, as well as a feature to search by Prime content only.  Also glad to hear about the HBO deal, gonna watch some old Deadwood episodes.  You gotta love Deadwood.-Original Review-I really want to like this device.  However, I can not get audio to work out of a Soundbar.  I will post a revised review if I can solve this problem, however my first attempt with Amazon customer service was not successful in coming up with a solution.  I will return this device if I can't solve the problem (audio through the TV only is not good enough).  Other complaints:1.  No way to start over from the beginning other then holding the rewind button down?2.  No Amazon MP3 app yet (yes I know it is coming)3.  No way search by Prime only (I understand this is coming as well).I'm not trying to be overly negative.  I've been a Roku user for 2-3 years, generally satisfied but my older Roku model is a bit slow.  The Fire TV has great potential.  I'm sure I will be a fan if I can solve the audio problem (and if the software updates roll out fairly soon).", "verified": true, "helpfulness": "1/2", "author": "johnny ballgame \"johnny ballgame\""}, {"rating": 5.0, "review": "SHOULD HAVE DONE THIS SOONER BUT IT WAS NOT AVAILIABLE,VERY HAPPY, I LOVE MY KINDLE,I LOVE MY PRIME AMAZON GOT ME HOOKED TO MY AMAZEMENT,KEEP IN MIND IT WAS MY EFFORT TO GET UNPLUGGED TO LATE!!!!", "verified": true, "helpfulness": "0/3", "author": "dragon"}]