[{"rating": 5.0, "review": "This product makes media streaming to the home so easy and it's price point cannot be argued with. And a great shopping experience withAmazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Watch anything you can open in the Chrome Browser as well as Netfilx and more. Control yourTV from your smart phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Mitch Kruger"}, {"rating": 5.0, "review": "Excellent product, easy setup, easy to use. So easy my 5 year old son can work it and stream his cartoons w minimum supervision.", "verified": true, "helpfulness": "0/0", "author": "H. Sosa"}, {"rating": 5.0, "review": "Easy set up.  Does exactly what as it says.  Great way to stream local content as well. For only 35.00 you can't beat it.  Very portable great for frequently travelers who spend time in hotel rooms.", "verified": true, "helpfulness": "0/0", "author": "Travis Abernathy"}, {"rating": 5.0, "review": "It is amazing how it works. I have Netflix online and I can stream movies on my TV with only one touch. Very easy to instal. Fantastic.", "verified": true, "helpfulness": "0/0", "author": "Carmen Hester"}, {"rating": 5.0, "review": "Product came quickly and in great condition. It installed easily and functions better than expected. It is great to be able to watch Netflix, a DVD or whatever straight from my computer with no cords or setup hassles. This is always ready to go with a click of the remote. Love it!", "verified": true, "helpfulness": "0/0", "author": "Michele Hicks"}, {"rating": 2.0, "review": "This product Did not meet my expectations as it does not work well with laptop or with the surface pro.", "verified": true, "helpfulness": "0/0", "author": "Peter G."}, {"rating": 5.0, "review": "I like it a lot, my TV is relatively new but doesn't have internet, this does it for it, now I use my phone to select the show I want to see on netflix and watch it on the TV, is very easy to use and install, and is tiny, no cables hanging or anything.", "verified": true, "helpfulness": "0/0", "author": "dri"}, {"rating": 5.0, "review": "Our son gave us this for Christmas.  Now, we are loving it.  We can take it with us anywhere and get video content from our IPads or computers on the go or at home.  A remarkable little gadget.", "verified": true, "helpfulness": "0/0", "author": "Sonin Fleming"}, {"rating": 5.0, "review": "We have a blue ray player that we have been streaming Netflix on, but it would always freeze or buffer a lot.  My son in law mentioned this Google Chromecast on Christmas day....I ordered it right then!  SOOOO much better than the blue ray player!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]