[{"rating": 4.0, "review": "Waiting to see a SDK coming out so that we can utilize the potential of this device to the fullest.", "verified": true, "helpfulness": "0/0", "author": "Mittal"}, {"rating": 4.0, "review": "i'm enjoying it.  i wish it was compatible with amazon prime, crackle, and the web in general via mobile device....you can cast tabs from your desktop/laptop browser, but not from your tablet or phone...they are coming out with more compatibility all the time, and now the plex server lets you play your own content...can't beat it for $35.", "verified": true, "helpfulness": "0/0", "author": "Brandis D. Resendez"}, {"rating": 4.0, "review": "Never fails to connect but there are pages that won't open on google chrome. Great for watching Netflix. Good buy.", "verified": true, "helpfulness": "0/1", "author": "Milagros Acevedo"}, {"rating": 3.0, "review": "Overall the Chromecast is a good purchase. I was going to get a roku, but I liked the idea of not having an extra remote and the portability of the Chromecast (ability to move from room to room in the house). Streams well, but works better with some devices than others. For instance, I have a Samsung Chromebook that I thought would be a flawless pairing- not so much. With the Samsung Chromebook particularly the video streaming is slow and commands are significantly delayed. Using and iphone or ipad works great though. Also I don't t like how it needs to be plugged into a power source on top of being plugged into the tv. Gets annoying with sparse outlets. All things considered, you can beat the price.", "verified": true, "helpfulness": "0/0", "author": "Landon M. Ford"}, {"rating": 5.0, "review": "Now watching movies on the big TV screen selected through HBO GO on my mobile phone, or YouTube videos found on the iPad … best 30 something $ ever spend.", "verified": true, "helpfulness": "0/0", "author": "Guy Vancollie \"GVC\""}, {"rating": 4.0, "review": "I was glad to have purchased the Chromecast. I purchased two one as a christmas gift and the other one for the family. It is great not to have a long HDMI cable running across the living room to watch movies.", "verified": true, "helpfulness": "0/0", "author": "joseph hatchett"}, {"rating": 4.0, "review": "chromecast works well for Netflix, but other apps can be glitchy. However, it gets the job done and for a good price.", "verified": true, "helpfulness": "0/0", "author": "April"}, {"rating": 5.0, "review": "Purchased this as a Christmas present for my Dad and he absolutely loves it.  It is very easy to use.  He has been able to watch HBO TO GO, YouTube, and Netflix on any TV in high definition using his iPhone and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Kw"}, {"rating": 5.0, "review": "In Canada, this device works primarily to play Netflix and Youtube.  It does it well, controlled by either my iPod or my computer.  As an added bonus, I can \"cast\" webpages I'm looking at to the screen.  It can do more in the US ... but I was simply looking for something inexpensive that plays Netflix with better picture image than my Wii and it does it well for the price.", "verified": true, "helpfulness": "0/0", "author": "Garry Heintz"}, {"rating": 5.0, "review": "Very nice thing, smooth and slick! It works like a charm from the beginning! The initial setup was easy and fast.", "verified": true, "helpfulness": "0/0", "author": "tataran pavel"}]