[{"rating": 5.0, "review": "Super great product that I love very much and use all the time.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Hodge"}, {"rating": 3.0, "review": "It is not a convenient as I would like. If you don't have an amazing wifi signal, don't use it. It just runs very slowly.", "verified": true, "helpfulness": "0/0", "author": "Jesse McClain"}, {"rating": 5.0, "review": "ready do get rid of cable, and get an HD antenna.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Heap"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "walter"}, {"rating": 5.0, "review": "Chromecast is amazing! Can't believe how useful it is - made me forget the last few years where I would use a 25 foot HDMI cable to put stuff on the TV.", "verified": true, "helpfulness": "0/0", "author": "Rapscallion Van Gogh"}, {"rating": 5.0, "review": "Love it, wish i had know before i purchase APPLE TV.", "verified": true, "helpfulness": "0/0", "author": "Karen Coleman"}, {"rating": 4.0, "review": "I like the technology.  I am having problems, though, the movies lag a bit as I am watching.  I have to figure out how to make it play smoothly through.", "verified": true, "helpfulness": "0/0", "author": "Luis Vidal"}, {"rating": 5.0, "review": "This thing rules. Plain and simple. The set up was extremely easy. The packaging was simple, the instructions were extremely user-friendly, and the setup was painless. I was streaming YouTube videos in a few minutes. If you're reading this and need a laugh, you should watch the Apparently Kid videos and then look up the Macho Man Randy Savage interviews. OOOOHHHH YEAAAAHHHH", "verified": false, "helpfulness": "0/0", "author": "Kaitlin"}, {"rating": 4.0, "review": "Good, but I think that it has few options to cast to the TV, but good product.", "verified": false, "helpfulness": "0/0", "author": "Victor J Gamboa Canto"}, {"rating": 5.0, "review": "fasta shipping and great product", "verified": true, "helpfulness": "0/0", "author": "Douglas Ledezma V"}]