[{"rating": 5.0, "review": "was super easy to set up. was so easy to just the name of the movie you wanted see and pop right up", "verified": true, "helpfulness": "0/0", "author": "Johnny R Vaughn"}, {"rating": 5.0, "review": "OK...I tried my own smart hdtv and got weak streaming.... then got a Roku 2... a little better but took awhile to get loaded.... Sent the Roku back and now have the AMAZON FIRE....  wow!  This thing works.  Very fast and so far trouble free.  A keeper.", "verified": true, "helpfulness": "0/0", "author": "R. ANDERSON \"Admiral Rich\""}, {"rating": 5.0, "review": "I have had an Apple TV, a google tv, a chromecast, a wii, and the amazon Fire.This is by far the best device for streaming video yet.The voice search feature is spot on, I rarely get buffering issues, and, well, it's just great.", "verified": true, "helpfulness": "0/0", "author": "PCole"}, {"rating": 5.0, "review": "I just got the Fire TV and after a couple of weeks, gave away my Roku 3.I like that the controllers are not \"line of sight\" and having Prime really seals the deal.What I found annoying about Roku was the abundance of useless channels. Braggin about how many channels you have isn't much use if they are of no interest.I am hoping to see the cloud player come to the Fire TV soon. If so, this device will be a lock for a lot of people.", "verified": true, "helpfulness": "1/2", "author": "Rich Hime"}, {"rating": 4.0, "review": "I love being an Amazon Prime member but before this product, I was never able to make full use of my membership benefits (i.e., the free movies and TV shows).  The Amazon Fire TV changed all that and I am very happy Amazon released this product.  Now I get so many great TV shows (even if some are a season behind) and movies that there is no way I could watch them all.  There are many shows that I was always reluctant to buy (I have an Apple TV as well, which I like a lot too) but many are actually available on Amazon Prime for free.Now why would I only give this product 4 stars?  Simply put, I don't like the user interface.  Like I previously stated, I have the Apple TV and the user interface is smooth, easy to navigate, and easy to look at.  I don't like the interface of the Amazon Fire TV as much.  I do like how it breaks down Prime shows versus other shows that have to be paid for.  However, it could use more of the Apple model for sorting options even further.With that being said, the voice searching option is terrific and if you know specifically what you are looking for, works tremendously.The remote is very user friendly and easy to use.  The setup was a piece of cake.  The quality of streaming is HD and on par with the Apple TV.Overall, I highly recommend this product and if they work on the user interface, it will get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "KPsquared+1 \"A some-what long commute so a lot of time to listen to audiobooks!\""}, {"rating": 4.0, "review": "I really like this nifty little media manager. We are slowly working our way toward getting rid of satellite TV due to cost, this little gadget is our first step. It was simple to set up and has been a breeze to use. Combined with our smart blueray, we have access to just about everything we could want beyond local TV. Of course, we can't get the paid programming such as Showtime & HBO, but its a small price to pay when you eliminate over $70/month in TV bills.I love that I can access You Tube videos. If they added web access so I can get the videos from the yoga websites I frequent it would be perfect! (maybe its there and I just haven't found it)The voice request feature works pretty good. I've used it in a room with other people talking and it picked up what I was saying correctly. We use it without frustration.I haven't had much problem with sound or picture - a little bit of voice/lip being off once in a while. When this happens I run it through my surround sound and it clears right up. It stopped once due to buffering, we were having a huge storm so I'm sure our satellite internet was struggling. Other than that our internet keeps up just fine, it's a medium speed package through a local provider. We don't limit any other usage while watching TV.* Since it has bluetooth, it would have been nice to be able to connect other bluetooth devices such as a keyboard.* I do not like that there isn't a power button.* As with many other reviewers, I've struggled a bit with prime vs. paid, but we are figuring it out and its not a deal breaker for me.* I do not like that many of the shows I want to watch with Hulu Plus are listed as web only through this device. Big bummer.* I do not have any opinion on games, not my thing.* Regarding all the different apps, I don't see the point of most and have been disappointed by a couple that ended up being preview type apps. This isn't a deal breaker either. Make sure you thoroughly read the description and reviews before downloading.", "verified": true, "helpfulness": "1/2", "author": "PentwaterGma"}, {"rating": 5.0, "review": "I bought Apple TV and Chromecast and returned both because they failed to deliver as promised.  I decided to take one more chance and bought the Amazon Fire TV.  Love, love, love it!  Easy to install, connect and get immediate streaming from Netflix on my TV.  Voice commands are marvelous and the remote is simple, small and easy to use.  I am so happy I took a chance on this!", "verified": true, "helpfulness": "0/0", "author": "M. Fredendall"}, {"rating": 3.0, "review": "This box did exactly what is advertised.  However, voice search only works for Amazon content.  So, if you are in Netflix and do voice search, it takes you out of Netflix and back to Amazon.  We did not like this.  Ease of use was okay, not great.  We have an older Roku system that works better for us in all the channels we watch.  We are not gamers so this aspect of the fire tv was not important.We used the system about 2 1/2 weeks just to give it all a fair chance.  We sent back Fire TV and using Roku again and much happier.Amazon is great for customer service and returns. Give them five stars", "verified": true, "helpfulness": "1/2", "author": "Carol"}, {"rating": 3.0, "review": "I am opposed to pay in for free network series, I mean really $2.99 peer episode you really out to brathbun@dc.rr.com ashamed..", "verified": true, "helpfulness": "0/3", "author": "Barbara Rathbun"}, {"rating": 1.0, "review": "Not a lot app advailble. Share screen difficult to do... just suck all the way around honestly waste of money", "verified": true, "helpfulness": "1/9", "author": "khalid b liburd"}]