[{"rating": 5.0, "review": "I own Roku 3 and Chromecast and this Fire Tv is much betterIn my opinion. I am very impressed with  quality,small size andPower plus quicker load time and great graphics. The voice searchIs easy and fun and works very well. The remote is simple and welldesigned. The menu interface is simple and superior. I am overallextremely happy with Fire TV and I would recommend this wonderfulUnit to everyone and it will now be my main  interface for movies, TvAnd the internet on my HD TV.  I hope this review will be helpful toothers.", "verified": true, "helpfulness": "10/11", "author": "D. S."}, {"rating": 5.0, "review": "We've had two appleTV's and liked them when they worked  but lately got tired of seeing half movies when the signal would be dropped and the movie would stop and a screen would announce that there was a problem with our wifi signal.  We got happy fast when we connected to Amazon's new Fire TV and everything just WORKED.  Yay!  We've had it two days and watched two movies and listened to music and it plays like it's supposed to.  Also, not having to type movie titles into the search box is THE BEST.  This device is intuitive and works really well.  Happy!", "verified": true, "helpfulness": "4/4", "author": "J. Olson"}, {"rating": 2.0, "review": "Same price as a Roku 3 but no earphone jack, very limited apps compared to Roku. No PBS, TED, Netflix Search. and other favorites. Why bother??", "verified": true, "helpfulness": "6/23", "author": "Kenneth Beer"}, {"rating": 5.0, "review": "Over the years, I have owned a Roku 2, Roku 3, PS3, PS4, 360 and shortly an XBox One.In my opinion, the only media player that could someday exceed this user experience is a future version of the XBox One.The speed makes all the difference in the world, and is hard to describe until you've used it.  The device is based on android, and we all know android can multitask, but if you're used to using a console or Roku, you don't realize how much time it takes to switch/reload apps (from Netflix to Amazon to Hulu, etc and back) until you're avoiding it by using a Fire TV.It is also hard to describe how great the voice commands are.  I was skeptical about it until I actually experienced how great it is with the momentary push switch for the microphone on the remote control.  No background interference and no waiting for the device to figure out you're done talking.  It makes the experience seem 10x as fast.My only negative comment is the unskippable tutorial video at the beginning.  Please make it optional.Also, if there was a separate universal remote that could control the power and volume of the TV/Receiver while also controlling the Fire TV/Voice commands, I would order that in an instant.", "verified": true, "helpfulness": "9/10", "author": "Christopher Gannon"}, {"rating": 5.0, "review": "I am simply going to say I love the Fire TV from Amazon… Running a quad-core processor, a dedicated GPU, and 2GB of ram the Fire TV is giving me a much better streaming experience than my Roku 3. With my Roku 3, as with all my older Roku and streaming BD player I always see very poor picture quality for up to one minute into the program; Fire TV provides a sharp crisp picture from start to finish. I have used the Fire's stock remote to play a few games and love that function in the Fire; playing games on the Roku is difficult and has been a letdown for me. Sure there is no HBOGo or mgo yet… YET, my guess is that we will see them in the near future. Because the Fire has more robust hardware it provides a better streaming experience it has replaced my Roku 3.", "verified": true, "helpfulness": "10/11", "author": "Venture"}, {"rating": 5.0, "review": "Fire TV is amazing!  Easy to set up and the remote device is intuitive and very fun to use! Home run Amazon", "verified": true, "helpfulness": "6/6", "author": "Marjorie FitzGerald"}, {"rating": 4.0, "review": "I have a Roku 3 and I love it.  This little box is as fast streaming as my Roku 3.  Did not take long to setup and I have been playing with this new toy for several hours and it has not missed a beat.  This little box does not have all the channels that the Roku has but the channels on the Amazon Fire TV are the ones I always use.  This has Sports channels that the Roku does not have and I plan on signing up for.  I look forward to the channels or Apps that Amazon will add in the future.  The little remote is very easy to use as well.", "verified": true, "helpfulness": "4/4", "author": "Garyd"}, {"rating": 5.0, "review": "Just got the device, took me about 2 mins to install, literally. The HDMI cable does NOT come in the pkg, know that and buy one simultaneously. I removed my GoogleChrome which was cool but lacked a remote for managing the onscreen content. It would seem easy to manage content with your iPhone, iPad or even your PC but it was a bit of a nuisance. Having a dedicated remote for the streaming content just takes it to a new level. The device had to download a few software updates and the screen went wonky for a couple of minutes causing me to think the system had locked up, but it was just a brief delay and then a little animation on how to use the system and we were streaming movies. The ease of ordering or renting movies is nothing short of amazing. We are enthralled! Buy it now, I'm thinking about buying some more for our friends/family.", "verified": true, "helpfulness": "4/4", "author": "Sandra M. Smith \"IrisDawn\""}, {"rating": 5.0, "review": "Very easy set up. I don't have cable, and cutting the cord has been ok, but I got tired of watching my shows on an iPad. This has been a dream. Super easy set up, and just moments later I was watching my favorite shows. The navigation is intuitive and I love that it remembers where I stopped watching… this is helpful because sometimes I will stop a show, and then start watching it again on another device later on.", "verified": true, "helpfulness": "9/9", "author": "E. Miller \"lainy1976\""}, {"rating": 4.0, "review": "Setup was a breeze and the box was already registered with my Prime account.The power of the quad-core hardware really shines. Navigation through menus is quick and smooth. I thought that the voice recognition remote would be a gimmick but, no, it works quickly and surprisingly well. My first HD movie stream started playing virtually instantly and video quality is very good.As others have said, there are some big gaps in content as compared to AppleTV and Roku. I'm hopeful that Amazon will sort this out quickly because in January I totally cut the cord to all cable/satellite TV content and only view via the Internet now. I'd like to see Spotify support high on the list too.Amazon also need to improve access to their own content. It's much more difficult to easily find my \"free\" Prime movies on Fire TV than it is using a browser for playback.", "verified": true, "helpfulness": "10/12", "author": "P Henry"}]