[{"rating": 2.0, "review": "Very disappointed in this product.  It would not connect to Netflix, even after resetting.  Sending it back.  We had one of the original Rokus, and wanted to upgrade to something more powerful.  This one looked good by description.  It works great if all you use is Amazon Prime Streaming.", "verified": true, "helpfulness": "2/3", "author": "Pen Name"}, {"rating": 4.0, "review": "So easy to set-up and use.", "verified": true, "helpfulness": "1/1", "author": "James E. Saylor"}, {"rating": 5.0, "review": "Love my Fire TV.  Have had it over a month now and it works beautifully.  It was really quite simple to set up.  Really no learning curve required.  I had never had a \"streaming\" device before and as usual Amazon makes it a joy to use.  (Have several Kindles and they, too, are a joy to use and easy to set up.)  Love all the apps such as Netflix already loaded and ready to use.  Also love the simple way the content is set up.  Again, no learning curve required.  Couldn't be more pleased.  Amazon has another home run in the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "kate13"}, {"rating": 5.0, "review": "I was hesitant to get this box at first, but then I saw the prices of the Apple TV 2, which are the most popular XBMC boxes. I looked online to see how hard it was to install XBMC, and seeing how it wasn't too difficult, I bit the bullet and ordered the Fire. It took me about 2 days of tinkering and reading/watching tutorials on how to install XBMC, but now I have the hang of it. Some of the boxes on ebay are about $140 with XBMC installed. That's great for a lot of people since they sell well, but I like learning new things, so I gave this a shot and it was worth it. XBMC works great, and as long as you have the right channels you can cut the cord if you wanted.My only complaint is the MLB app is bad. Constant hiccups and stuttering on this app only. Any other app I have tried works perfectly but I get inconsistent streams on the MLB app. Also there's no HBO Go app yet, so I have to resort to the Roku to watch that. It's not worth knocking off a star from the review because this is an extremely stylish, easy to use, fast streaming box. For $100 you can't go wrong as long as you have prime and can take advantage of the video service.", "verified": true, "helpfulness": "1/1", "author": "Dephtones"}, {"rating": 5.0, "review": "So far so good. Easy to set up but the programs stall sometime but that's because of my internet, not the device. Easy to navigate too!", "verified": true, "helpfulness": "1/1", "author": "M. Burta"}, {"rating": 4.0, "review": "So far it works great. Very very easy setup. Box is very small and quiet- no noise. The only thing I'd like to see is a web app so I can get on some of my other pay subscription web sites (motorcycle racing- streaming races). For now, I'll have to continue to use my laptop for that.....Otherwise, very happy with it.", "verified": true, "helpfulness": "0/0", "author": "jmb236"}, {"rating": 3.0, "review": "Put Amazon Fire TV to work today and compared to Roku It is disappointing in terms of channels that it allows the owner to watch. Otherwise it is a nifty device, set up, style, customer support is unbeatable, but the substance has to be in apps. available. This thing seems to be aimed at gamers.", "verified": true, "helpfulness": "1/1", "author": "K. Thomas Miller"}, {"rating": 4.0, "review": "Good machine overall.  Still learning what can be done with it but already enjoying streaming.", "verified": true, "helpfulness": "1/1", "author": "avc \"avc\""}, {"rating": 2.0, "review": "to hard to work would not buy again", "verified": true, "helpfulness": "1/6", "author": "phillip l littlejohn"}, {"rating": 1.0, "review": "I ONLY HAD THIS FOR 2 MONTHS AND STOP WORKING I DID EVERY THING I COULD BY UN-PLUGING AND RE-PLUGING IT BACK IN AND IT NEVER WORKED AGAIN!!!! DON'T WASTE YOUR MONEY I'M GETTING REFUND", "verified": true, "helpfulness": "3/12", "author": "BRENDA CAPITO"}]