[{"rating": 5.0, "review": "I can't comment on Google Play or Chrome tab integration, as I don't really have a use for that, but I figured $35 for a nice little Netflix and Youtube streamer would be worth it, and I was very pleased with the results. I have a first generation Roku XD and its navigation is painfully slow, Netflix constantly drops quality for no reason, and I can't stream Youtube on it.For starters, my setup is probably different than most (the INTENDED setup). I actually plug this little guy into the back of my receiver on one of the inputs (previously used by my Roku), and for this purpose, I did actually require the HDMI extender included in the box, which I didn't expect to need. It was very comforting that Google included ALL of the required and possible use cables and adapters in the box. For $35, that's really something, if you ask me.Setup was so easy, I'm fairly certain an 8 year old could handle it. It took about 3 minutes, then another 10 or 15 to wait for updates, and my Chromecast was ready to go. So far, I've used it quite a few times. Youtube is great. It usually starts in SD and goes up to HD in the first 10 seconds of the video. I'd prefer it to default to HD, and would rather wait for that to buffer, but I'm really just looking for a complaint here. It streams very nicely and the integration with my phone and tablet is seamless. Netflix always plays HD when available. I have not yet seen a Netflix video drop down to SD as it does frequently on my Roku. Considering the Roku is hooked up via LAN, I'm wondering if this is impressive for the Chromecast wi-fi radio, or just plain sad for the Roku. Either way, I'm pleased with the Chromecast.It does the things I expected out of it, and probably better than I thought it would. For the price, I don't see a reason to not get one of these unless you have a smart TV that already does what this device does.", "verified": true, "helpfulness": "0/0", "author": "Cicatrize"}, {"rating": 4.0, "review": "Excellent all round except that it doesn't work in a hotel room where you have to enter a code on a page after connecting on wifi. I see a lot of people complaining about this and I truly believe Google will fix it soon. Also would be great to have more apps supporting Chromecast and I hope that developers make this happen.", "verified": true, "helpfulness": "0/0", "author": "Safdar Mustafa"}, {"rating": 2.0, "review": "pros1.small2.\"wireless\" (you need a usb conection for energy)1.you need a wi-fi connection,2.second you need a router that handles very high speeds.3.Only works with chrome navigator or youtube (maybe more programs, those are the ones I found that worked)4.It doesn't show full screen, just the window.I rather buy the Netgear PUSH2TV HD PTV2000 . for a couple of bucks more, and works great (is more bulky)", "verified": true, "helpfulness": "0/0", "author": "mario celsi"}, {"rating": 5.0, "review": "Excellent product, family able to watch netflix right there cell phones and tables. Easy to install. Just follow simple direction. Use YouTube if you get in trouble", "verified": true, "helpfulness": "0/0", "author": "Jay Aponte"}, {"rating": 5.0, "review": "Not a game changer (yet), but a great product.  Waiting for Google to roll out more Chromecastable apps, but still, kicking youtube to the TV is pretty slick.", "verified": true, "helpfulness": "0/0", "author": "Bigfoot"}, {"rating": 5.0, "review": "This gadget is easy to use & best of all, it works. A fantastic innovation. . . . . . . . . Equaled or evenexceeded expectation!", "verified": true, "helpfulness": "0/0", "author": "Rudy M M"}, {"rating": 5.0, "review": "This is the coolest gadget. My kids are constantly fighting over the tv that I have this hooked up to. Its amazing.", "verified": true, "helpfulness": "0/0", "author": "L. Warren"}, {"rating": 5.0, "review": "Bought 2 already and plan to buy a few more. Netflix,Hulu, and youtube! I bet many more services will come soon. Great investment in my opionon.", "verified": true, "helpfulness": "0/0", "author": "Brandon Johnson"}, {"rating": 4.0, "review": "Works great for streaming with the couple supported services, and works pretty well for tab sharing, I just wish I could share my full screen on it.", "verified": true, "helpfulness": "0/0", "author": "P. Shipley \"beardo\""}, {"rating": 5.0, "review": "OMG. So I got hipped to this when I went to visit my friend in TX. I thought it would be great for see the movies I Have on Instaplay on Netflix. It would eliminate the hassel of having to plug my computer into my TV. But I c an do so much more than that. I love the fact that I can project anything that I am working on while use the Chrome brower onto my TV. This is an awesome product.", "verified": true, "helpfulness": "0/0", "author": "Wendy Silva"}]