[{"rating": 5.0, "review": "The unit is just great!  Voice search works flawlessly for me.  Also love the ability to sideload applications onto it since it is an android device!  That was a big plus for me.  It is one step better than the apple TV in the sound department also,  it pushes out Dolby Digital Plus vs. just Dolby Digital on the Apple TV.  What does that mean?  It means if the sound track has true 7.1 channels,  it will push out 7.1 channels to your receiver.  Where as Dolby digital is only 5.1.", "verified": true, "helpfulness": "0/0", "author": "B1GTED"}, {"rating": 5.0, "review": "I purchased amazon fire TV for my bedroom after doing extensive research between amazon fire TV, Roku 3, Chromecast, and apple TV. The amazon fire TV is the best bang for your buck.  The available apps are a little low but you can \"sideload\" just about any app including XBMC!!  I also have SNES, PSP, and Psx emulator set up and it runs it smoothly.  Paired with an Xbox 360 controller it's the perfect all around compact media/entertainment unit.", "verified": true, "helpfulness": "0/0", "author": "Roy Lee"}, {"rating": 5.0, "review": "Love this - non techie and set this up in 5 minutes !", "verified": true, "helpfulness": "0/0", "author": "jackie"}, {"rating": 4.0, "review": "only had for week,,so far so good", "verified": true, "helpfulness": "0/0", "author": "Ernie"}, {"rating": 5.0, "review": "Easy to set up, a breeze to use. A very good product. Crazy good.", "verified": true, "helpfulness": "0/0", "author": "dennis lum"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Lee Emanuel"}, {"rating": 5.0, "review": "Satisfied", "verified": true, "helpfulness": "0/0", "author": "S. Dye \"SDye\""}, {"rating": 5.0, "review": "So far so good. I even bought the fire stick  for my daughters tv. As long as my prime covers both we will be good.", "verified": true, "helpfulness": "12/12", "author": "Carmen"}, {"rating": 4.0, "review": "Great sound recognition.  Very slick interface in general.  Good video quality finally, which is why I held out as long as I did.  Will check 4k soon.The only reason it gets 4 and not 5 stars from me is that the selection of movies eligible for selection as free by a Prime member is too small.  Lots and lots of very old movies are still being charged for.  I get charging for the new ones, and the prices for those are reasonable, occasionally better, in fact, than other sources like VUDU.  But the older ones are too spendy.", "verified": true, "helpfulness": "0/0", "author": "Hawkdawg \"Vidiot\""}, {"rating": 3.0, "review": "It's ok if you don't have a smart tv but I have one so it duplicated what my tv offers.", "verified": true, "helpfulness": "0/1", "author": "Jason Lynch"}]