[{"rating": 1.0, "review": "Cannot make darn thing work.", "verified": true, "helpfulness": "0/2", "author": "John Healey"}, {"rating": 2.0, "review": "Low network speed connection, jumpy streaming on anything not found on You Tube or Netflix, and forces broadcasting device to G network rather than the faster N option.", "verified": true, "helpfulness": "0/1", "author": "hend0866"}, {"rating": 5.0, "review": "It works great just like I thought it would", "verified": true, "helpfulness": "0/0", "author": "Cory Jackson"}, {"rating": 4.0, "review": "Fantabulous! Only wish it worked with the Android software but otherwise it's a very good addition to your media collection.", "verified": true, "helpfulness": "0/0", "author": "D.L. Millage"}, {"rating": 5.0, "review": "Love it works great", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Chromecast is amazing. Love it. I'd pay double for what it does. Though I'm glad it's as cheap as it is.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "This device is awesome had a little problem with the upgrade but changed my internet to the theter from my mobile phone just for the upgrade then back on my usual network and it works fine.Drawback is can't use other browser to cast you must use only google chrome. It becomes annoying because I use mostly IE and am use to that.", "verified": true, "helpfulness": "0/0", "author": "Deepak"}, {"rating": 2.0, "review": "Good value I guess but I barley use it.  Kind of a hassle since you need another device to stream things from.  If you are using this for watching netflix spend the extra money and get an apple TV or an amazon fire TV.", "verified": true, "helpfulness": "0/0", "author": "Kris"}, {"rating": 4.0, "review": "Chromecast is neat. There's a lot you can do with it, it's portable, and the price can't be beat. Setup is a breeze if you're at all familiar with Chrome, and the available range of options is incredible.Let's talk a little bit about what Chromecast can do. At the most basic level, apps on Android-based smartphones and tablets will be able to display on a Chromecast-equipped TV. You can watch Netflix, Hulu, Youtube, and other streaming apps on your TV without hooking up a cumbersome media PC. That capability right there is worth the price of admission.Where Chromecast really shines, though, is the tab-casting ability. This lets you take any Chrome tab and broadcast it, sound and all, to your TV. Really ram-intensive processes, like flash games, will chug a bit, but most tabs stream without too much of a hiccup. If you're into game streams, you can put them on a TV and watch them without alt-tabbing over. If you're editing a document or pulling something from a website, you can throw it to a TV and use it like a second monitor. If you've worked at all with Google's ecosystem, you know what to expect- a versatile tool that's light on direction but strong on functionality.It only gets 4 stars instead of 5 for a couple of design quirks. First, it sticks straight out the back of the TV, so unless you have vertical HDMI ports, you need to get an elbow or deal with your TV not being flush against the wall. The power cord also goes in there, and it's very easy to break it trying to get your TV back to its original position (though it is a microUSB cable, and every gadget in the world uses them, so replacements are easy to get). Casting a tab mutes its audio, so you're stuck using your TV speakers for sound. Just a few little annoyances that make what would be a fantastic gadget just good.", "verified": true, "helpfulness": "0/0", "author": "M. Wonnacott"}, {"rating": 5.0, "review": "Shipped quickly. Product works great", "verified": true, "helpfulness": "0/0", "author": "Natalie"}]