[{"rating": 3.0, "review": "I was looking forward to this little device, but the reality is its pretty unstable & limited.Its not well advertised but you need a LONG list of compatible elements in the mix to get the results promoted.Much like early variants of the Apple OS there is a lot of Magic going on behind the curtain but no access to to help you troubleshoot /resolve issues.Im gonna guess that Chromecast REV 2 will have improvements & enhancements ....Id wait.", "verified": true, "helpfulness": "0/1", "author": "needrgr"}, {"rating": 4.0, "review": "I am very,very happy with this google chromecast.I was concerned with the set up.But I had no need to be at all.I went to Google Chromecast/setup and it guides you through PC ,Iphone and Ipad or android.It is very easy.For movies it supports You-tube and Netflixs.Sooner or later I'm sure they will support Amazon Prime and some others.But for now Netflix is just fine for me .I have watched movies streamed from my PC ,Ipad and my Iphone ,each with about 4 clicks and no wires.I watched a movie on my 50\" LG streamed from my Iphone.with no wires.This is from someone who can remember not having a TV as a kid and listening to the Loneranger and the Green Hornet on the Radio.Looked at some other streaming devices ,but they all seemed to have some issues.The resolutions are sharp and had  no buffering.or error messages at all.Very good deal for exactly what I wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "Mace"}, {"rating": 3.0, "review": "I don't know why I thought you could stream most anything with this little gadget. I am especially disappointed that I can't stream from Amazon, since I am a Prime customer. Guess I'll have to get Netflix.", "verified": true, "helpfulness": "0/0", "author": "Bonnie West"}, {"rating": 4.0, "review": "It's ok, pretty good quality, as for streaming videos from your library it's not great, YouTube and Netflix works good.", "verified": true, "helpfulness": "0/0", "author": "Richard montross"}, {"rating": 5.0, "review": "ONE OF THE BEST PURCHASES, I HAVE EVER MADE IN MY LIFE, IT MADE MY REGULAR, HDTV, INTO A SMART TV  AND I NOW CAN STILL USE MY SMART PHONE AND BROADCAST TO MY TV AT  THE SAME TIME, THIS IS SWEET: )", "verified": true, "helpfulness": "0/0", "author": "Juan Benavidez"}, {"rating": 4.0, "review": "I've been using a laptop computer connected to my home theater system to watch Netflix.  But I wasn't able to view Netflix programs on other HD TVs in my house.  With Chromecast, I can watch Netflix (and HBO Go) on any HD TV in the house.  The quality of the video and sound are excellent.", "verified": true, "helpfulness": "0/0", "author": "ER \"Rick7777\""}, {"rating": 5.0, "review": "it is simple and useful. the box was good and the time to deliver was also good enoughon my opinion", "verified": true, "helpfulness": "0/0", "author": "manelpalau"}, {"rating": 5.0, "review": "The Chromecast device, first and foremost, represents a huge value. It is the cheapest device of its kind and has all the functionality that most users ask for. The services I stream with the Chromecast are Hulu Plus, Youtube, Netflix, Pandora, and Plex,-Why did I buy this device?I got a screaming deal on a TV on black friday, also from Amazon, and it did not have \"Smart TV\"- nor did I want it to. Integrated Smart TV has never worked very smoothly in my experience. Poor integration and lack of updates means that many tvs have broken or unreliable smart TV features. The Chromecast is widely popular and support from Google guarantees that Chromecast will continue to add features and improve stability.-How easy is it?I was not experienced with the \"casting\" type of streaming, so there was a bit of a learning curve for me. However, after I became comfortable, I found that Casting integrated very smoothly with all my media. Using my iPhone or laptop as a controller, I pull up content and click a \"Cast\" button, which sends the media to the Chromecast connected to my TV.-Is it worth it?For only $35? You bet it is! The Chromecast will give you the best Smart TV package available on any TV with an HDMI port. Some may complain about lack of content providers, but what more do you need? Well, if you do need more, Google promises that the little \"cast\" button will be coming to many more apps in the near future, and even rumors that you will be able to stream files from your desktop (which I actually achieve with Plex right now).The Chromecast is the central media hub that I have been searching for. I had thought that it would come in the form of an HTPC or game console, but this tiny USB stick gives me access to millions of songs, thousands of movies, new TV shows, and all the media on my desktop.", "verified": true, "helpfulness": "0/0", "author": "Miles Lindgren"}, {"rating": 3.0, "review": "Although the Google Chromecast functiions as advertised, the user must provide Google with extensive information to ensure you get the benefit.", "verified": true, "helpfulness": "0/1", "author": "Richard C."}, {"rating": 5.0, "review": "If you don't already have a smart TV with wifi, this is the best way to get streaming content on your TV.Super easy to stream Netflix and HBO Go from your phone or computer.For such a low price, well worth it to turn a regular TV into a \"smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "Riyaz Kapdi"}]