[{"rating": 5.0, "review": "Love the Chromecast. It has changed the way I watch T.V. It's made my Netflix habit shoot through the roof. And you can even stream from your browser which is great.", "verified": true, "helpfulness": "0/0", "author": "DeRanjed"}, {"rating": 5.0, "review": "If you have online video services, this device is great. Easily control content from your smartphone and display on TV. Sometimes connection can be lost if you lock your phone (the video continues, but controls don't respond), but usually great control. More app support coming, but the big name online content providers already work with the Chromecast. Awesome price as well, I've given these as gifts quite a few times. My parents love having people over and queuing up songs from their phones!", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 4.0, "review": "Great alternative to watch netflix!", "verified": true, "helpfulness": "0/0", "author": "Natasha G. Benatti"}, {"rating": 5.0, "review": "Sweet devices.  Doesn't work with all videos on my iPad - just Netflix, Youtube, Hulu, and the Quicktime player on iPad/Pod/Phone.  But NOT with Amazon video.", "verified": true, "helpfulness": "0/0", "author": "GKPugh \"gkpugh\""}, {"rating": 1.0, "review": "It work for netflix for one week only will not recommend", "verified": true, "helpfulness": "0/2", "author": "oscar mayorga"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/1", "author": "sig feury"}, {"rating": 5.0, "review": "Excelente producto", "verified": true, "helpfulness": "0/1", "author": "jorge monterrosa"}, {"rating": 5.0, "review": "EXCELLENT streaming....easy installation. Now if I could just figure out how to connect it to my surround sound. Purchased a second because the first worked so well.", "verified": true, "helpfulness": "0/0", "author": "Centrella stacks"}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/1", "author": "Joao Leite"}, {"rating": 5.0, "review": "I had a little trouble setting mine up for the first time because my wireless signal wasn't very strong in the room I tried to set it up in the first time.  I once I went to a room with a string signal, set up was pretty easy.  I use it in our exercise room to stream movies while I'm on the bike, and can move it to the living room when we want to watch something there.  I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "J A Cawley \"JAC\""}]