[{"rating": 5.0, "review": "First all the negative reviews - do some research you aren't buying a Roku for $35 read what it does and quit complaining about ALL the things YOU would like it to do- it works exactly as advertised.  I had no functionality wifi or any issues at all with it.Took me less that 5 minutes to set up and I was streaming Netflix.  My 3 year crappy Roku would not work anymore - so I bought this for streaming NetFlix -plus you tube as Roku took away any and all you tube apps years ago.", "verified": true, "helpfulness": "0/0", "author": "Quad Net"}, {"rating": 5.0, "review": "Very easy to use. Great reception from any room in the house. My husband loves using to show family videos.", "verified": true, "helpfulness": "0/0", "author": "Kirstin McCrank"}, {"rating": 1.0, "review": "I bought this to display local content from my computer/phone, but even when the video is playing in Chrome, it won't chromecast.  There is very little content for this dongle now.", "verified": true, "helpfulness": "0/1", "author": "Avid reader"}, {"rating": 4.0, "review": "It does what it said.  Very easy to set up, can work with any smart phones.  I installed it in my son 's room so that he could connect his iphone to his TV screen to avoid him in a small screening watching TV for too long.  it worth to buy and very strong signal even I can detected it with my Samsung in my bedroom to beam my phone screen to his TV.", "verified": true, "helpfulness": "0/0", "author": "Bo Bo Au"}, {"rating": 2.0, "review": "Which completely limits the use of this.  So, I use my Roku instead.  It was so cheap, I really bought it just to play with, but I found I don't really play with it at all.  I could have skipped this purchase, for sure.", "verified": true, "helpfulness": "0/0", "author": "e40"}, {"rating": 2.0, "review": "For whatever reason, it doesn't stream as fast as it does on my laptop. There's a lot of lag time, which is really annoying. It also times out constantly.", "verified": true, "helpfulness": "0/0", "author": "Lucila Rodriguez"}, {"rating": 2.0, "review": "The 2 star rating is for ease of installation. Otherwise this device did not deliver for me yet; may be it is due to my weak Wi-Fi connection, I don't know. But I've not given up on it yet.", "verified": true, "helpfulness": "0/0", "author": "MRX"}, {"rating": 4.0, "review": "Set up was fairly simple. We put this unit in the Living room. We have used it for Netflix, YouTube and downloaded music from Smart Phones/Tablets.", "verified": true, "helpfulness": "0/0", "author": "ICC"}, {"rating": 3.0, "review": "It works well if the wi-fi is fast, mostly with Netflix and Youtube. For other sites, it is choppy, but worthwhile for $35 streaming hardware.", "verified": true, "helpfulness": "0/0", "author": "PenPn"}, {"rating": 3.0, "review": "There is still some glitches and apps that are not supported. Poor streaming with hulu. Excellent with Netflix.  Looking forward to updates.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]