[{"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Darwin Orozco"}, {"rating": 4.0, "review": "I like the Chromecast thing-a-ma-jig. It works o.k. I'm finding I don't use it too much. While watching a movie (I use non premium sources), I lose the picture and then have to restart my tablet and the appropriate app. My wife finds this irritating and doesn't want to watch movies this way - a few pictures of our granddaughter is o.k.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The ability to screen cast is my favorite piece of this. It also screams YouTube videos very well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Have to rely on content from the google app store which is limited depending on taste. Set up and connection was easy", "verified": true, "helpfulness": "0/0", "author": "Bray"}, {"rating": 1.0, "review": "Worst player ever. It keeps dumping my wifi, my phone doesn't recognize it or I'm constantly having to reboot. I have a roku in the front room...I'm about to give this google chromecast to someone I want to infuriate and get a roku for the bedroom as well. It's a piece of ish...", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Amazon lockout of ... no ability to use from Kindle HDX  w/ PRIME (or other) video.", "verified": true, "helpfulness": "0/0", "author": "JimR-Loveland"}, {"rating": 4.0, "review": "It was a gift for my son..he likes it", "verified": false, "helpfulness": "0/0", "author": "Shirley \"I am a senior citizen in birthdays but a inquisitive,thrill seeker,and lover of mysteries. My favorites are John Lutz,John Sandford,Craig\""}, {"rating": 5.0, "review": "Works great, especially since all of my devices are android based.  Very convenient.  I purchased a second one after owning this one for a few weeks.  I recommend independently powering it from the wall rather than the TV if you are looking to take advantage of its ability to turn the TV on (only works on newer TVs)  If you are not looking to use that feature most TVs have a usb port that you can use to power the device reducing the amount of wires coming down from the TV.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "Jeanete Michiko N. Ferraz"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "GeSi"}]