[{"rating": 3.0, "review": "To be honest I'm a bit disappointed. I've had a number of different \"boxes\" and the Amazon looked to be a decent purchase. Now if your going to only use it for Amazon Prime subscription it works fairly great.The issue is if your going to use this for Netflix it has some serious issues. It frequently has syncing problems with the video and audio. It tends to drop frames becoming a slideshow for 3 or 5 seconds, but with the audio intact. The video then speeds up to catch back up to the audio. It can do this fairly constantly most days. I have a very decent connection (90Mbps down) and other devices some immediately beside it have a great signal. It also occasionally loses connection to Netflix and just kind of sits there to you back all the way out. Again all other devices work fine.This is being used in my bedroom and only used when falling asleep so it hasn't bugged me enough to replace it yet, but I wouldn't have it on my main TV.", "verified": true, "helpfulness": "2/2", "author": "Divus"}, {"rating": 5.0, "review": "best thing ever", "verified": true, "helpfulness": "0/0", "author": "Terrie S"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "carlos"}, {"rating": 4.0, "review": "Arrived as expected, easy to set up and very straightforward.  I am still trying to find a faster way to sort through programs that are free and those for which there is a charge, but that will take some time.  The voice control is terrific!  A printed manual of some sort would be appreciated.", "verified": true, "helpfulness": "0/0", "author": "Carol S."}, {"rating": 4.0, "review": "Lots of choices, now I just have to learn how to use it all.  I also have Netflix, so am a little confused why I have to rent an episode of a program on Fire TV that I get as a Netflix member.  Yes, I'm a Prime member.  Guess I just have to drill down & get more info.", "verified": true, "helpfulness": "0/0", "author": "Eldee"}, {"rating": 4.0, "review": "While I love this device, I am unhappy with the expansion of this device. I am unable to utilize an external storage device. In addition, I would prefer for it to have the capability of playing content from my network as well as an attached storage device via the USB.I hope that they FIX these two issues with the device.As far as gaming and everything else goes, I am in love with this device. It is truly a universal device. The kids are always exploring new things with it. It is an ALL-IN-LOVE.", "verified": true, "helpfulness": "0/0", "author": "Arif Amjad"}, {"rating": 5.0, "review": "This is the Smart for your TV. Replaced my Google tv with this because of buffering issues. Now Netflix and especially Prime -Perfect! The voice command on remote is very sweet to find content. I added a 32GBP sub drive in back, no problem. It let you decide what Apps or content to move there. I bought the game controller and works great, lots of good games. It's no PS3 but for the price and occasional gaming it's perfect.All my content videos, photos, documents all at my finger tips. Content downloadable for offline use. It's so small I can take it with and watch on my friends and families tv for movie night. Keep the good stuff coming Amazon!", "verified": true, "helpfulness": "0/0", "author": "Kevin D.Ostler"}, {"rating": 5.0, "review": "This Fire TV box is pretty amazing. I do not subscribe to any cable TV. I normally use Netflix for movies and TV shows (without commercials). I would never have purchased it except I subscribed to Amazon Prime for some two day shipping I needed. Setting it up was a real breeze, a no brainer, just plug it in, because they pre-configure it set up for your account. It streams amazingly fast, plays the next show automatically, has voice search, and much more. Netflix is even better than loading on my smart TV. This thing probably has more capabilities than you can shake a stick at, but I gotta say, all I want to do is watch shows fast with no interruptions and in high def, and it does all of that.Many of the available (maybe most) of the movies and TV shows are not free, you have to pay for them. I never pay, I just don't believe in it, but there still seems that there is alot of stuff to watch none-the-less.WOW, this may be the longest review I've written. But I really do like it.", "verified": true, "helpfulness": "2/2", "author": "alj"}, {"rating": 5.0, "review": "I had been tied down to my laptop watching my Amazon videos.  This device freed me.  The picture is wonderfully clear and the sound great.  I am very glad that I purchased this device as I can now enlarge my viewing library with digital content and be sure I can enjoy the full-screen experience without having to fill up a cabinet with DVDs.  Worth the price!", "verified": true, "helpfulness": "0/0", "author": "A. Burgin \"teacher\""}, {"rating": 5.0, "review": "Got this as a gift, and learned to use it regularly. I wanted to mention those things that make this my favorite streaming box, a couple things you should be aware of.First, convenience. HDMI CEC is compatible with Anynet+ on my Samsung TV, and all I need to do is hit a button on the remote for it to change inputs. TV remote can control the Fire TV this way if need be. When FIRE TV goes to sleep, TV goes right back.FAST loading of videos! I have found this interface to be far and away the best to watch Prime content, and other regular content is easily accessible. Picture is best quality in fastest time, sound is good (DD+ makes a difference), and you can use the optical out in stereo along with HDMI out for surround (I use both as needed)LOVE the simple but elegant remote. Possibly the best remote I've ever used for a device. Wish the voice search included Netflix though. The interface for all streaming apps are very responsive. There's no lag or anything.If you have to enter a password at a hotel, or register as a guest, the Fire TV will bring up an authentication screen for you! Also because the Fire TV is basically on at all times it doesn't make you sign in every time you walk away. This new feature has saved me a lot of hassle, when before I had to sideload a browser just to get online on a guest wi-fi.Speaking of sideloading, you can add apps from a computer if you know how. It proved to be a beneficial feature in some cases like I mentioned.I have a keyboard/trackball connected through USB.CONS:Can't hide menu items like Videos/Music I own and such. It's only for Prime bought media, so is worthless clutter to me as I don't buy that way.Doesn't do 24hz. This is really important to me when I play Netflix content, as its movies are sent that way. So, what happens is a translation to 30hz shown at 60. This introduces a mild stuttering. Many people won't notice as they are used to seeing it that way, but I want my smooth film-like experience. So, I now use my Samsung TV to stream Netflix in the correct 24hz, and save the Fire TV for mostly Prime. This is not the way I want to do it, because the Fire TV is really the best user interface, but until they can output 24hz I'm stuck splitting my viewing experience, and watching less Prime content as a result! Come on Amazon!  24hz. Make this the best device without any doubt!As of a recent update (updates can't be turned off) a banner ad is always at the top of the home screen. One wonders what other worthless 'features' will be added without my approval in the future.", "verified": false, "helpfulness": "1/1", "author": "Benjamin Peck"}]