[{"rating": 4.0, "review": "This is a very easy to use device.  Can only really use for Netflix or youtube right now.  But hopes are that in the future will be able to stream all content from my phone or tablet to the TV. Don't waste your money on a Smart TV.  This device basically can do the same thing.", "verified": true, "helpfulness": "3/3", "author": "Topher"}, {"rating": 5.0, "review": "Simple. Quick. Good Quality. The best way to watch Netflix.I am listening to BB King right now from my computer to sound system.", "verified": false, "helpfulness": "1/1", "author": "William M. Halpin Jr."}, {"rating": 1.0, "review": "if you order this then do not open it. just return it. won't cast half the time. Sometimes works but it is not worth the $35 dollars. i hate it.", "verified": true, "helpfulness": "0/14", "author": "Hoss \"I love Scify, History and Christian Fiction.\""}, {"rating": 5.0, "review": "I am required at Church to broadcast our conferences on a big screen television. Instead of a bunch of wiring and equipment now I can just plug the Chromecast in, configure it, and then run the broadcast from my tablet. Thank you for making my life so much easier...", "verified": true, "helpfulness": "1/3", "author": "Anthony Q. Vaughan \"Tony Vaughan\""}, {"rating": 5.0, "review": "Amazing and Simple. I wanted another but Amazon has been sold out so I got a second one from google. If you watch youtube, it is a no brainer and worth it just for the implementation", "verified": true, "helpfulness": "1/1", "author": "Raphael Uduhiri"}, {"rating": 3.0, "review": "Got mine the other day. Setup was NOT all that easy but not that hard either. Problem: mine will stream all the services EXCEPT Netflix. It just sits there and loads, and loads. Nothing. Obviously a Netflix bug.", "verified": true, "helpfulness": "1/3", "author": "Reid Kirchenbauer"}, {"rating": 5.0, "review": "I purchased a Chromecast on day one, and I have to say this is one of the best tech investments I've made in a while. The UI is simple and just works! After showing what it can do to my family and friends, they all want at least one and maybe more. If you're on the fence about buying a Chromecast, don't be! Get it!", "verified": false, "helpfulness": "2/3", "author": "SteveV4389"}, {"rating": 4.0, "review": "This is a great device, simple to use but is still quite limited in its choice of apps available, especially if just using android devices (Netflix, Youtube & Google Music). It will improve so get your now.", "verified": true, "helpfulness": "2/3", "author": "Whoispriceykev"}, {"rating": 5.0, "review": "very nice device, easy to setup and it does exactly as it describes i love it you can cast you tub,net flex", "verified": false, "helpfulness": "0/0", "author": "wael"}, {"rating": 5.0, "review": "Easy to use. Smooth experience. Got the 3-month Netflix deal. Casting from Chrome tab is still buggy but that's still in beta. Looking forward to more updates from Google.", "verified": true, "helpfulness": "0/1", "author": "Yi Yang"}]