[{"rating": 5.0, "review": "It's really easy to use, really cheap for all the wonderful product this is.I just plug it to the TV and can stream you tube from my lap/smartphone/tablet and the videos go to the tv queue, also it's easy to stream a tab from Google chrom so you can share what you're looking at the moment.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "If you own a device with an HDMI port, you're doing yourself a disservice by not having one of these attached to it. Send almost any video or whole browser tabs to any screen with one of these attached instantly, from any device: Desktops, laptops, tablets, smartphones, whatever you have. Netflix, HBO Go, Hulu, YouTube, local videos, cloud videos, picture slideshows, live streams, whatever you want! Even turn your TV into a virtual whiteboard, the possibilities are endless, for 35 freaking dollars. You can't not have this.", "verified": true, "helpfulness": "0/0", "author": "Joshua May"}, {"rating": 4.0, "review": "I had been looking for a way to stream things to my laptop to my TV for awhile but most of the options I had found seemed expensive.  Once the Chromecast came out and was so reasonably priced I immediately purchased one.  The setup was very easy and intuitive, however, the playback on my TV was very choppy, so bad that I couldn't stand watching anything longer than a few minutes.  After researching I found out that this was not necessarily the Chromecast's fault but was happening because I had an old router that couldn't handle the traffic.  After spending another $100+ on a new router the Chromecast works like a charm.Overall: great product but didn't turn out to be as cheap as I thought (had to buy a new router).", "verified": true, "helpfulness": "0/0", "author": "Robert Barrett"}, {"rating": 3.0, "review": "Perhaps this very important incompatibility is mentioned somewhere but if so, I missed it. I intended to use my iPad or iPhone to \"cast\" the programming from a website to my TV. Unfortunately, there is apparently no ability to do this. There is a message saying essentially that Google is working on this problem. Android-powered devices apparently are compatible with the Chromecast. I can only control the BUILT-IN APPS from my iPhone or iPad.  I CAN \"cast\" directly from my computer but it is in another room so it is not very convenient. Having said that, the Chromecast was easy to install following the on-screen instructions and it works just fine otherwise.  You must download an extension from Google that puts a \"cast\" button on your Google Chrome browser. This allows you to \"cast\" whatever you are looking at on your computer to your TV.  No problem downloading the extension, but it tends to disappear whenever I close Google Chrome and it must be repeatedly downloaded every time I open Chrome--a nuisance at best.", "verified": true, "helpfulness": "0/0", "author": "Rod Bell"}, {"rating": 5.0, "review": "My status before a Chromecast was a 10 foot long HDMI cable thrown across my living room.  Life after a Chromecast is no HDMI cable!I have not compromised anything for this new addition.  The picture and sound quality are excellent.If you're looking for an inexpensive streaming media player then check out the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Lance T. Moore"}, {"rating": 5.0, "review": "Google Chromecast Player installed easily, and performs as advertised. Need to add a few words to make this review official. So, There.", "verified": true, "helpfulness": "0/0", "author": "Anonymous \"Anonymous\""}, {"rating": 5.0, "review": "Ok, so the price made it a no brainer.  But the more I use this and the more apps that are capable of using it, the more useful it becomes.  I bought one for my living room and dining room.  The dining room TV is small, and meant to be as unobtrusive as possible.  The Chromecast is so small, I can tuck it away behind the TV, plug it into USB, and you never would know its there.I love being able to stream from my PC to it as well.  Any online stations (NBC, ABC, etc) typically require you to watch from you computer, but now I can stream it to where I am comfortable watching it.This thing is just going to get better over time, and its already super useful.", "verified": true, "helpfulness": "0/0", "author": "Lenny"}, {"rating": 5.0, "review": "Not everyone will like Chromecast, but I am quite fond of it.  It's cheap, small/discrete, and does a great job for what I want.  I currently own 3 of them.You have to understand the main limitation to appreciate it.  Namely, it's not an ecosystem that arbitrarily supports all content you can view/access on mobile or computer.  There are many popular sources that are well-supported, though, like Netflix, Hulu, HBO, Plex, etc.  The list has really improved since they opened up development for it.  The ones I'd love to see added are Amazon Prime and DISH network, but there's competitive interests at play there.All in all, if you mainly want access to the popular content it supports, know how to view those on your phone/tablet, and understand how to switch inputs on your TV, you should have no issues with it.", "verified": true, "helpfulness": "0/0", "author": "noone \"noone\""}, {"rating": 5.0, "review": "Broadcast from computer, laptop and smartphone with ease. Sets up with no problem. Lets you cast anything from your Browser,", "verified": true, "helpfulness": "0/0", "author": "lou dagostino"}, {"rating": 4.0, "review": "It did what it was advertised to do.  I just made the mistake of having it billed to a credit card instead of a gift card.  Great job by Amazon on the return.", "verified": true, "helpfulness": "1/1", "author": "Frank Kallio"}]