[{"rating": 5.0, "review": "Couldn't be easier to setup or use. As with most items from Google, I'm very pleased with this excellent product!", "verified": true, "helpfulness": "0/0", "author": "Brian B. \"NC_Bandit\""}, {"rating": 2.0, "review": "I bought this based on the star ratings and i am really disappointed at the limitations of this thing, It feels as though it is underdeveloped and not ready for public use just yet, google needs to take this one back to R&D; and finish it, It has a lot of potential if they can get it to function correctly.My first problem with this was the initial set up, It would not see my network at all, so setting it up on my computer was not going to happen, so I downloaded the android app and finally got it set up and working through the app then I was able to set up my pc to use it.Everything that I casted from my browser was just terribly laggy. At first i assumed that my network was the problem but after doing some tests on my network I found that it was just the Chromecast having issues, Everything that runs wirelessly through my network worked flawlessly. The chromecast was only 10 feet away with no obstructions like walls or anything. The picture quality was pixelated and skipped a lot, which made everything unwatchable.I finally gave up on the pc and just tried out my phone and casted youtube and it was ok casting video and audio with out any problems I then tried other apps and everything seemed just fine when casting from the approved apps from my phone. My pc has a six core processor with 16gb of ram (64bit system) this is more than enough for the chromecast to work. my router is aAsus RT-N56U, perfect for streaming.I was able to cast my desktop which was pretty good but then got laggy when i tried to play a video, also since i have two monitors it casted both onto my tv which i expected it to do, I just do not plan on disconnecting a monitor every time I want to cast my desktop, so I will most likely not use this feature.All in all, I have decided that everything that the Chromecast is capable of doing I can accomplish with my ps3 but with better picture/audio quality, right now I have no need for the chromecast so I will be returning it.One more thing, When i tried playing movies from my own digital library the chrome browser would not play any video that was not in MP4 format, I have no desire to convert all of my videos to that format, I just dont have the time to do that, besides even if i did, im pretty sure it would be unwatchable any ways. for now i will just keep using my ps3 where I have access to all of my own video library as well as netflix and hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Mcolon"}, {"rating": 5.0, "review": "Worked great with our \"old\" LCD and is even better with the new Smart TV. Cast from Youtube or Chrome and the TV automatically switches to the HDMI channel. I have issues with loosing connectivity which is probably due to my own network. And unfortunately there is no way to hardwire the Chromecast. Works great with Android apps. IOS app functionality is more limited.", "verified": true, "helpfulness": "0/0", "author": "Mike in PA"}, {"rating": 4.0, "review": "On the plus side, I thought Chromecast swell enough a gadget that I purchased two more right away for family members. That being said, I think there are some limitations to the technology, although I am willing to concede that some of those limits are outside of Google's control.Apps are still somewhat limited, even though a half dozen more have been added by streaming venders. I for one would like to see support added to other browsers besides Chrome, Firefox in particular. And there are times when I would like to play something without having to first upload it into the cloud.To date I have had considerable experience (100+ hours) playing NetFlix, YouTube, and Google Play Music via both Android Apps and Chrome on workstations and laptops. NetFlix has considerable video material that does not play well, perhaps due to poor video translation while streaming. When \"off\" the images are jittery like silent film images. Occasionally Google Play Music cuts out and/or stutters.Of course there are many possible reasons for these problems including your ISP connection, your local wireless network, etc. My main irritation is there seem to be few or no diagnostic tools available to troubleshoot problems without resorting to advanced network analysis techniques. This is something that Google could address in future releases and I hope they do.In the end however Chromecast just works and overall works very well, I may well own a couple more before long.", "verified": true, "helpfulness": "0/0", "author": "cuttlefishdaddy"}, {"rating": 3.0, "review": "This was purchased as a gift. So I can't rate it. My son-in-law says he likes it and it is serving its purpose.", "verified": true, "helpfulness": "0/0", "author": "Joy Whitsit"}, {"rating": 4.0, "review": "The unit does what it claims and for the most part it is good. I have two problems with it. One, it does not support Amazon Prime. You cannot see movies that you can get for free on Amazon Prime. Second. Occasionally the audio and video get out of sync slightly. Enough that you can notice it. It does not do this all of the time, but it does do it. This could be a internet speed issue, although my connection is very fast, or something else. It was very easy to install, and as I said, for the most part it is good.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Aquaro"}, {"rating": 1.0, "review": "I can not get my Google Chrome to work.  Please help me. I can not connect correctly. I do not know what is the problem", "verified": true, "helpfulness": "0/1", "author": "Robert H. Furlong"}, {"rating": 5.0, "review": "Very good. I have been using it for decades. I like the guiding/wizard based methodology. I will recommend this to others.", "verified": true, "helpfulness": "0/0", "author": "BenaMED"}, {"rating": 5.0, "review": "i do not know how to use it at the first sight of it , it is not so bad", "verified": true, "helpfulness": "0/0", "author": "xbxbwanxbxbwan"}, {"rating": 5.0, "review": "I bought this because I thought it would be fun to watch some stuff on TV now and then. We use ours every day, several hours a day. We watch YouTube videos, NetFlix, and cast tabs from ChromeBrowser if something doesn't have the direct casting ability. It's really only limited by the size of your broad band connection. We have really low broad band but it casts great, not in HD, but really nicely. If we weren't cheapskates and went for a higher broadband connection the Chromecast is capable of casting in HD. Never imagined we would love this little device so much.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]