[{"rating": 4.0, "review": "I like my Google Chrome, it is awesome to watch Amazon Prime and HBO Go, but I wish I could play dvds on my computer and stream them on my TV.  Other than that, I would really do love it, simple to use and install.", "verified": true, "helpfulness": "0/0", "author": "Julie E Mero"}, {"rating": 5.0, "review": "This is a great product, one that really enhances the value of having a TV in the house.  Super small (just a touch larger than a USB flash drive) it plugs into the back of the TV and it is indeed super easy to put content from my phone or computer up on the screen.  I actually use it all the time and find it to be one of the few electronic add ons/ gadgets that really is GREAT!", "verified": true, "helpfulness": "0/0", "author": "Maxwell Kraft"}, {"rating": 5.0, "review": "Provides a great cheap alternative to the Apple TV or an expensive smart TV.  I was so happy with mine that I have since purchased more as gifts for family members- Easy to set up- User interface is intuitive and easy to navigate- Poised to only get better as Google adds new features and supported AppsVery happy with purchase and would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "AJK"}, {"rating": 3.0, "review": "Don't like that I cannot stream photos,  this did not do much for me.  I hope they make fore apps for this in the near future, otherwise it's just another junky thing on my desk", "verified": true, "helpfulness": "0/0", "author": "Christine Whittaker"}, {"rating": 5.0, "review": "good product now with open SDK. I will like it more and i use this not daily but i use it very often.it completes the living room.", "verified": true, "helpfulness": "0/0", "author": "Giancarlo Martinez"}, {"rating": 2.0, "review": "If you want to stream local videos ( I do want ) do NOT buy it.It just work well with Youtube and some other apps.It have to be connected to internet not just WIFI network and put a big load to your internet connection.The last problem that any one in your same WIFI network can stop your cast and cast from his device any time with no password required or limitation.So I think there is some devices called EZCAST is better than Chromecast.", "verified": true, "helpfulness": "0/1", "author": "H2O"}, {"rating": 3.0, "review": "It's a wonderful device, but it's not working on my t.v. I saw some beautiful images, but i can't get conection between my tablet and T.V. I'm not sure if there are problems with my router orir wifi conection. Thanks...", "verified": true, "helpfulness": "0/0", "author": "Robin Ramirez"}, {"rating": 5.0, "review": "bought this for my son inlaw he said he loves it going to buy for his dad and his older brother", "verified": true, "helpfulness": "0/0", "author": "Bobo"}, {"rating": 5.0, "review": "So, we have three TV's that are smart TVs, but we have one that isn't a smart TV.  We absolutely love this.  The only downfall is that it only streams certain apps..not everything, but I believe they'll be updating that periodically. :)", "verified": true, "helpfulness": "0/0", "author": "Sarah_Smiles"}, {"rating": 2.0, "review": "I bought this to be able to stream ANYTHING from my phone/laptop to the TV, but it only really works well with YouTube.  If you are able to stream from another source (most you can't), then the sound will be behind the video.  Just doesn't seem as useful as it should be.", "verified": true, "helpfulness": "0/0", "author": "Jason Stephens"}]