[{"rating": 1.0, "review": "Who needs this crap?Better buy a raspberry or any other android device and install XBMC on it.Install the free YATSE Remote Control on your smartphone and voila your set, can push youtube to your TV.Zero additioinal CostsChromecast = fail", "verified": false, "helpfulness": "4/32", "author": "Michael T"}, {"rating": 1.0, "review": "OK all you hi-techers good for you! As for me, this Chromecast thing has been a worthless, time-consuming piece of junk! Had to remove my 70\" TV from wall to install it, run the wires behind cable box & bluray, use wire ties and went to hook it up and NOTHING. Two hours of reconfiguring it to avail Wi-Fi in house didn't work... uninstalling it and reinstalling it didn't work... now I will have to remove everything again & return it to Google for a refund... but the time involved far exceeds that paltry sum. DON'T BUY THIS!", "verified": false, "helpfulness": "5/28", "author": "lance"}, {"rating": 5.0, "review": "It's 35 bucks - I've spent more money on lamer products. It does exactly as it's described and the quality is great (it helps if you have a great internet connection and awesome TV).  What I thought was nice was that I could change the chromecast device name to Chinese and Korean characters.I would normally use my PS3 for Netflix, but I can't immediately access Netflix without the constant updates... Majority of the TVs in my house are also Smart TVs with access to Netflix, but the controls are just incredibly lame unless you have a keyboard. The chromecast is really just an easy and quick solution for me to be even lazier when it comes to flinging Youtube and Netflix to the big screen.UPDATE: So I'm pretty late to the game on this one, but apparently you can stream local files from your computer to your Chromecast! When streaming from your computer, launch your Chrome browser (make sure you have the Chromecast Extension installed) and in the URL type the path of your own Local files to play movies.  I've tried it with .avi, .mp4, and .mkv, however, it seems that not all .mkv files use the same audio wrapper so there is a chance that your audio may not play.  It has been mostly smooth with some hiccups on streaming depending how congested the network is, but it's awesome!", "verified": true, "helpfulness": "4/5", "author": "Lion Hair"}, {"rating": 5.0, "review": "I wasn't to sure of this product because of a few reviews, but I'm very happy with my choice and I would refer to someone else.", "verified": true, "helpfulness": "1/1", "author": "Robert"}, {"rating": 4.0, "review": "For $35 it's a bargain.  It was a very easy setup. Works great from my Galaxy 3 phone.  Works well from my computer, but I think the clarity is better from my phone.  You can continue to use your phone and computer and even turn them off and Chromecast continues to work.Negatives:  Can't control the device from your TV set. =Pros:  Easy setup (basically plug and play)Virtually plug and playAlways available from phone or computerControl Cast from cellphone or computerAllows me to take advantage of languuage vidoes on Youtube.Cons:  Sometimes videos get stuck in the loop and turning off TV, unpuggling dongle does not help to turn off videos.Need two USB outlets (inlets?) so device can charge itself", "verified": false, "helpfulness": "1/3", "author": "Meh \"Meh\""}, {"rating": 2.0, "review": "my fault first off for not installing this and trying it out right away. with a busy schedule, i ordered this on July 26th. so after a week and a half after receiving, i was able to finally try and hook it up to my Panasonic Viera, about 4 years old now.first issue: with 3 HDMI ports used up with my WDtv Live, xbox 360, and my media center pc (each device using HDMI connections). i disconnected all of the HDMI devices then connected the chromecast. i saw a red light, which looked promising, but when i turned my tv on, and switched to HDMI 3, there was no picture of the \"set me up\" screen. i shut my tv down, then tried both of the other ports, with no success in getting picture. my tv does not have a usb port, so i had to use the power adapter, which is fine. i don't have cable tv hooked up to the tv, so i was unsure of whether i needed it nor not.\"maybe i had to install the software first\" i thought, but then the setup failed to find my wi-fi network. \"no big deal - it looks like your wi-fi is not turned on\" it said - LOL. i was using my desktop to set up the software, and installed chrome first, even. my tablet can see and connect to the wi-fi at will, but the chromecast software did not want to cooperate. after about an hour of rebooting devices and reconnecting things, i may have just given up.might pass this onto a google-loving pal of mine to see if they can get it to work, because i don't think i will be able to return this thing. at least it has been a nice deal.", "verified": false, "helpfulness": "3/7", "author": "Roger Wong"}, {"rating": 5.0, "review": "My local Best Buy was out of stock after the initial release and by chance I checked online and it said my store had some in stock.  They only had 3 left and to my surprise they were still offering the 3 months of Netflix deal which according to the talk on the internet was no longer available.It's streaming a Netflix movie right now and working great with no wifi interruptions. I messed around with the tabcast and it seems to be working pretty good too although I need more time to put it through it's paces.Is it perfect? No, Obviously they have a ways to go with the app development but I bought this more for the tab cast than anything and considering it costs me $12 after the Netflix deal I can patiently wait for those apps to come plus I have a Roku 3 and between the two should not be wanting.Two things I discovered are #1 if you want to use HDMI cec to turn on and off your Tv you have to use the power adapter and not the usb so the dongle is on all the time and #2 According to Google if you use the dongle extension chord it will increase your wifi reception a little acting as an antena", "verified": false, "helpfulness": "2/3", "author": "Dman"}, {"rating": 4.0, "review": "Great device considering it was only $35 dollars. Only draw back is lack of apps supported currently, however in the near future more apps will be available. Overall it's easy to use, set up and haven't had an issue yet. Streams Netflix and play movies without lag or shuttering. I would recommend this device to anybody. My girlfriend even wants one now, and she never likes to use new technology.", "verified": true, "helpfulness": "2/3", "author": "christopher"}, {"rating": 5.0, "review": "Received my Chromecast today. 5 minutes later, it is hooked up to my television via the HDMI and USB ports, and it works like a charm. Power supply was not needed since the HDMI/USB ports power it. Will be happy when more Apps are available to use through it but for now, it works great and that is why I purchased it. So easy to hook up anyone can do it quickly.", "verified": false, "helpfulness": "2/3", "author": "deadbirdgolf \"Len H\""}, {"rating": 4.0, "review": "I already have Roku player so I bought Chromecast to play Youtube videos. Setup was easy, It took 5 mins to setup and play the You tube videos. It works great using my Motorola Razr Maxx, Ipad and Laptop. But I am unable to play Google Play videos using my Razr Maxx phone. I am not sure if it the problem with Chromecast or with my Razr Maxx.", "verified": true, "helpfulness": "1/1", "author": "Sat Y"}]