[{"rating": 5.0, "review": "Wonderful streaming device!", "verified": false, "helpfulness": "1/1", "author": "Toks"}, {"rating": 4.0, "review": "Sets up fairly easy though I had some issues in the begining but now working ok.  I just wish there was a way for this to work when I had a DVD in the laptop.  Sometimes the Chromecast App seems to lock up, but good overall.", "verified": true, "helpfulness": "1/1", "author": "Greatscott!"}, {"rating": 3.0, "review": "I like the functionality of this but it fails in many other ways.1. It only works on the wireless g band (probably because of the stronger signal through walls) but I'd at least like the option to do wireless n since I don't have walls between my PC and TV.2. In general, things aren't smooth just playing on high quality. Trying to play a video at extreme quality means you're going to watch a stuttering turd of a show. Very sad.3. The Chrome extension seems to be in Beta because of all of the issues it has. My shows will randomly stop playing for no reason and no error messages. It'll make Chrome crash sometimes for the fun of it. Etc.It's very handy to be able to plug it into your Xbox One and use the TV functionality, this way I don't have to buy an HDMI switch for my two HDMI port TV. This thing would be fan-freaking-tastic if I could stream my PC screen to it instead of only certain things. If there's a way, please tell me!!This thing has room for improvement but it's not there yet.", "verified": true, "helpfulness": "0/0", "author": "Bob Phrapples"}, {"rating": 5.0, "review": "like it a lot. I have not used my smart tv features since getting this little gem.", "verified": true, "helpfulness": "1/1", "author": "bw"}, {"rating": 4.0, "review": "When I had DSL my Chromecast was useless as it would freeze for buffering every 15 seconds.  After  I upgraded to higher speed cable internet it was a different story.  I had it at first on a floor above the router, and it started OK but then started getting an unrecoverable error 102.  I then moved the chromecast to a TV adjacent to the router, and it was awesome!  Works seamlessly every time, no buffering.  Very pleased.", "verified": false, "helpfulness": "1/1", "author": "mlock307"}, {"rating": 5.0, "review": "Works exactly as described.", "verified": true, "helpfulness": "1/2", "author": "momtaz"}, {"rating": 5.0, "review": "Pretty cool device. For the price, Now I watch the movies, While I eat my rice.", "verified": true, "helpfulness": "0/1", "author": "Amazon Shopper"}, {"rating": 5.0, "review": "Really a great item, works great, was easy to set up.", "verified": true, "helpfulness": "0/1", "author": "Dave A"}, {"rating": 1.0, "review": "This device is cheap for a reason. It is basically useless. It won't connect to my router even though my laptop the same room does. I can't configure it because it won't create the wifi connection for configuration. I hate this piece of crap. I can't stress enough what a bad decision this purchase was.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I can put anything from my computer on my family room TV wirelessly. Super easy to install and setup. I can also cast my entire android galaxy S4 screen & audio through my amp/TV.", "verified": true, "helpfulness": "0/0", "author": "mikepfly2"}]