[{"rating": 5.0, "review": "Great way to eliminate the cable TV subscription. Casts Netflix, YouTube, and Hulu plus, among others.", "verified": true, "helpfulness": "0/0", "author": "Jared W."}, {"rating": 5.0, "review": "Simple, Neat, Easy way to stream media to a TV.", "verified": false, "helpfulness": "0/0", "author": "stephany Eloy"}, {"rating": 5.0, "review": "Best streaming stick, just $35 and you can mirror your android device to the TV", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 3.0, "review": "BEST FEATURE :Great product for someone who does not have a Smart TV, otherwise it doesn't add any more than standard Smart TV apps.SECOND BEST FEATURE : When you cast a web page the mouse and page tabs disappear. You still have to look at your laptop screen. ( were it not for this would give an extra starTHIRD BEST FEATURE: HDMI connection is nice but it has a problem. The problem has an easy solution that will cost you only $7.99. (PROBLEM) The chrome-cast device gets hot and stays hot.The heat affects components inside the TV. (SOLUTION) buy a 6 inch male male HDMI cable to extend the device connection so that the heat from the chrome device does not conduct to the TV. Cost $7.99. Problem solved and you're good to go.YES I WOULD RECOMMEND BUYING CHROME-CAST AND  I WOULD RECOMMEND LOOKING OUT FOR THE REDESIGN I EXPECT THEY WILL IMPROVE ON THE HEAT PROBLEM AND THE SOFTWARE FOR WEBPAGE CASTING HOPEFULLY THAT BIT WILL BE A FREE UPGRADE.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"followup\""}, {"rating": 5.0, "review": "Chromecast is super reliable. Everything about it is just so great. We love it!", "verified": false, "helpfulness": "0/0", "author": "Stephen Jackson"}, {"rating": 1.0, "review": "My chromecast is always dropping the show I am watching, as well as never showing in the apps I open even though it says I am connecte to the Internet. Constantly freezing. Definitely not impressed with this product.", "verified": true, "helpfulness": "0/0", "author": "Jillian Shainholtz"}, {"rating": 5.0, "review": "So easy to use, so inexpensive and so AWESOME!  Thank you Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "LRam1018"}, {"rating": 4.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Ali Gòmez"}, {"rating": 5.0, "review": "It streams well, yay.", "verified": true, "helpfulness": "0/0", "author": "Lucky Spidy"}, {"rating": 5.0, "review": "GOOD", "verified": true, "helpfulness": "0/0", "author": "weekly"}]