[{"rating": 3.0, "review": "I expected something more like Roku when I ordered this - so I think my expectations were a bit high.This does not have a control - but relies on you to have a laptop, iPad or phone that 'throws' its content onto the TV.I've used it a few times - and when I've had to pause a movie, I've lost the connection and had to start all over.  Not sure if this is me or the system, but I've gone back to Roku for Netflix, Amazon Prime, etc. and only use this for presentations or content not available via Roku.  I'm sure this will improve in the future - for for now I'm not all that impressed.  Com'on Google - you can do better!", "verified": true, "helpfulness": "0/0", "author": "Gungo"}, {"rating": 3.0, "review": "This is a great product idea, unfortunately google is taking its normal approach to a new product - don't support it and then eventually let it die. Unfortunately instead of a web page that's free to people, they've created something people are buying. It's a let down to see how slow adoption has been for chromecast - mostly due to google STILL not releasing a final SDK. I just don't get why they released this product if they weren't even ready for people to start developing for it. I kind of feel like I wasted my money until more than just netflix, hulu, and youtube support it.", "verified": true, "helpfulness": "0/0", "author": "Kevin Curtiss"}, {"rating": 2.0, "review": "It does not work in my region. If I didnt have a smart phone this would have almost been a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Michelle-Lee"}, {"rating": 4.0, "review": "They make life hard for non US based users.Had to change apple account to US to download the App.It couldnt connect with my modem when I tried to setup my 5 yr old Laptop ( my windows too old?)Works well with Youtube, but Netflixs wont work or Googgle play, so very limited application for the Non US based user, so far.", "verified": true, "helpfulness": "0/0", "author": "MilesBentley"}, {"rating": 1.0, "review": "I was really hoping that this would have been something more powerful. Unfortunately it just streams from your phone or tablet. Also, though it's small there are unsightly wires that come out of it and therefore the side of your television.Spend the money and get an Apple TV.", "verified": false, "helpfulness": "0/0", "author": "PopCultureWhore \"PopCultureWhoreDotCom\""}, {"rating": 2.0, "review": "It's just as well this thing is relatively cheap - it really isn't all that functional while Google falls all over itself trying to appease 'big content' providers so that they'll allow their media libraries to be streamed to it...  Do you really need another middle-man between you and those re-runs of \"Married with Children\" that you're so interested in watching on Netflix?In the meantime:Can you use it to 'cast' pictures on your phone  to your TV?  Nope...Can you use it to cast that cute video of baby's first steps that's on your phone to your TV?  Nope...And that great album you just bought on Amazon MP3 and spent all day bopping to at work, can you cast that through the home theater sound system attached to your TV?  Nopety nope nope...I gave it two stars because the YouTube integration is fairly smooth and the screensaver pictures are cute, just don't expect to use any of your own pictures in that slideshow...", "verified": true, "helpfulness": "0/0", "author": "Campbellman2000"}, {"rating": 5.0, "review": "I love this thing. It does a fantastic job of streaming content to my TV--a clear picture, and very rarely any need to buffer during the middle of a show/movie. (My internet maxes out at about 2.5GB, so faster connections probably work even better.) The Chrome plug in and YouTube app don't work quite as well as Netflix or Hulu, but I have had no reason to complain. I haven't watched regular TV since I got this.", "verified": true, "helpfulness": "0/0", "author": "C. Starr"}, {"rating": 5.0, "review": "The old Wii went out of service on us so we needed something that we could use Netflix. This little gadget is great. It's. Simple to use and can be operated from the home  computer or my kindle fire. The best part is the price.You just can't beat $35.00.", "verified": true, "helpfulness": "0/1", "author": "William E Yeager Sr"}, {"rating": 5.0, "review": "I enjoy that the Chromecast is so small. Compared to Roku and AppleTV. Granted, they can do more stuff but all I really needed was something that can let me stream Netflix on my TV. It's easy to unplug and bring to a friend's house too. I also like that I can control it from my iPhone.", "verified": true, "helpfulness": "0/0", "author": "K. Young"}, {"rating": 2.0, "review": "Great product for what it does, which isn't much.  I was aware of that when I bought it, but I thought I would be able to use it with the Google Chrome browser on my iOS or Android tablets.  However, when I try to install the Chrome Cast Extension I get a message that neither of these operating systems is supported.  I can understand why they may not be in a hurry to support Apple devices, but they apparently don't yet support their own devices either.  At this point it doesn't appear to do anything that my ROKU doesn't do.  Have I missed something?", "verified": true, "helpfulness": "0/0", "author": "John W. Soper"}]