[{"rating": 5.0, "review": "Sweet little dongle of the gods.  I love you.", "verified": true, "helpfulness": "0/0", "author": "Cody W. Yankey"}, {"rating": 5.0, "review": "Best dongle ever. I now have three and would buy more if I spent time in more rooms.", "verified": true, "helpfulness": "0/0", "author": "David TEeter"}, {"rating": 5.0, "review": "Bought this just to try it out and that was about two years ago and I love it!", "verified": true, "helpfulness": "0/0", "author": "Seth Spurlock"}, {"rating": 5.0, "review": "perfect as expected", "verified": true, "helpfulness": "0/0", "author": "Randy Hernandez Tavarez"}, {"rating": 4.0, "review": "Minimal set up and best of all works with iPhone, iPad, Windows Desktop - amazingly convenient.", "verified": true, "helpfulness": "0/0", "author": "Himanshu Sheth"}, {"rating": 5.0, "review": "Why are you even reading reviews of Chromecast? If you're on this page, just scroll back up and buy it. It will be the best $35 you'll ever spend if you have an HD TV and a smartphone. You can use your phone to control Netflix and Youtube, stream Google Music, and dozens of other useful apps all on your big screen TV. Background mode lets you point it to a folder in your Google Photos and it will drift through them intermingled with other interesting photos from the web when not actively playing an app. I would recommend creating a new folder and handpicking the photos you put in it, because it can get awkward when your mother-in-law is over and a picture of your friend mooning the Vegas Strip pops up.The technology isn't 100% perfect yet - sometimes Youtube loses control over the video when it's been playing for more than a few minutes and sometimes it just can't find it. But it's nothing resetting your phone or unplugging the Chromecast for a minute can't fix.It also works great for multiple TVs - I own 3 of these, and love that I can throw a video or song to any one of them whenever I want. It was also very useful when my girlfriend was stuck in bed with a broken leg and sent me on a mission to find something in her car - I cast my phone screen to the TV in the bedroom, called her on speaker, and then turned on my phone's camera. She could then see wherever the camera was pointing to broadcast on the TV, and was able to direct me to her critically important, must-have-right-now makeup bag or whatever the hell girls call that little purse thingy.It's actually become easier to use Netflix through Chromecast than it was via my PS3 or DVD player, because instead of a second remote you just use your phone. I really can't recommend this enough for anyone looking to boost their entertainment experience.", "verified": true, "helpfulness": "3/3", "author": "Elliot Levin"}, {"rating": 5.0, "review": "Kids Love it", "verified": true, "helpfulness": "0/0", "author": "hi"}, {"rating": 4.0, "review": "Great Product and Great service by Amazon", "verified": true, "helpfulness": "0/0", "author": "mar"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "HOMEBOY"}, {"rating": 4.0, "review": "Instead of shelling out hundreds of dollars to get a TV that can connect to wireless, why not spend thirty bucks on this lovely gadget? That was my reasoning and I have not been disappointed. I live in a household with multiple Android tablets and smartphones. The Chromecast has performed flawlessly with Netflix and Google Play. I took off one star because I use Amazon Instant Video for movie rentals and it is not natively supported by the Chromecast. I can cast my screen to the TV and then load the Amazon app, which works around the problem, but I would like to see Google and Amazon reach an agreement.", "verified": true, "helpfulness": "0/0", "author": "C. Nicoloff"}]