[{"rating": 5.0, "review": "It changed everything for me...I love this and it works good", "verified": true, "helpfulness": "0/0", "author": "brighteyes"}, {"rating": 5.0, "review": "Wonderful purchase! Great for a 720p tv. While I do have a new Smart TV,  my older, little Sharp 720p tv seemed like I was going to have to donate it because I didn't know when I bought it a few years ago that I would have trouble streaming Netflix or Pandora on it like the 1080p tvs, which Apple TV doesn't easily work on 720p.This little gem is a must for anyone who does not have a smart tv nor do they need to purchase a new tv. You can use your laptop or smart phone or media device (I have an ipod touch) to set it up, which takes minutes to do. This is affordable enough to have on different tvs around the house. I streamed Pandora on it and Netflix and I just couldn't be any happier with this product!Just be sure that you already have internet and you're good to go!", "verified": true, "helpfulness": "0/0", "author": "Diamond Star"}, {"rating": 5.0, "review": "I have a roku for me and my roommate to use but I wanted something to use in my room so I decided to try to chromecast after reading reviews on Amazon.Now Im thinking about getting rid of the roku and buying a second chromecast.The picture is always the highest quality. The only down side is when you use the cast to stream media from your laptop there is a slight lag so I use my phone to tablet to control my cast.", "verified": true, "helpfulness": "0/0", "author": "chris olsen"}, {"rating": 2.0, "review": "Lasted just under a year. Not impressed. But we'll priced compared to the competition.", "verified": true, "helpfulness": "0/0", "author": "Kuda"}, {"rating": 1.0, "review": "I bought chromecast to use on a laptop with Windows XP Home.  It worked using google cast and videostrem software although the local PC couldn't keep up decoding and sending the video stream to chromecast sometimes. It was great streaming directly from the internet though.Now in the past 2-3 months things changed on googles website. I have to re-run the chromecast/router setup program to reconfigure the chromecast device, but I can't because googles website says Windows XP is not supported. Why disable an operating system that worked just 2-3 months ago using their setup program. I can't find the \"chromecastapp\" executable on the net to run on windows XP which I could save and run locally so that I can bypass googles website and not have this problem.Thus, chromecast is pretty much useless to me now. No! I'm not going to go out and by another OS just to run chromecast everytime google and Microsoft changes an operating system.  Windows 7 will be phased out and so windows 8 sometime in the future which would leave me with only windows 10 or maybe windows 11 - I'll just stick with windows XP since it works for my needs.", "verified": false, "helpfulness": "1/5", "author": "Liteon User"}, {"rating": 4.0, "review": "A magic little device that turns any HDMI capable TV into a smart TV (well almost).", "verified": true, "helpfulness": "0/0", "author": "Dave Barker"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Matan Elhayani"}, {"rating": 1.0, "review": "OMG.  I was advised to buy this item to stream to Amazon Prime to my HD tv.  It is absolutely the worst internet \"casting\" product I've ever used.  The video stream was awful: choppy, out of sync, froze continually...essentially unwatchable. For the same money you're much better off with a simple HDMI adapter from Apple. Chrome will NOT solve the issue of casting/syncing Amazon Prime. Not to mention that it doesn't work with your Apple devices (iPad, iPhone.)", "verified": true, "helpfulness": "0/2", "author": "Alison Mundy"}, {"rating": 3.0, "review": "Somewhat difficult to figure out how to set up. Movies kept pausing to stream. I think my internet service may be too slow.", "verified": true, "helpfulness": "1/1", "author": "Mon"}, {"rating": 3.0, "review": "Used it some. Some lag and limited by its Chrome requirements, but decent for streaming photo etc. Have some more projects I will try over winter", "verified": true, "helpfulness": "0/0", "author": "John Elliott"}]