[{"rating": 5.0, "review": "Got it as an upgrade from my Fire TV Stick. Very nice. Much faster and smoother. Has all the streaming apps I need, plus all of Amazon Prime, which as tons of gems.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Fast streaming.  Easy to maneuver around screen.  Much better than older Apple TV we had.", "verified": true, "helpfulness": "0/0", "author": "PenniWA"}, {"rating": 5.0, "review": "As an owner of four chromecasts I love streaming Netflix, YouTube, pandora, and Pluto TV to TVs, but the Amazon Fire TV brings some great original programming via Amazon prime, games, an awesome remote for browsing, and voice searching. Wonderful and easy to setup", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 4.0, "review": "Value for money", "verified": true, "helpfulness": "0/0", "author": "Rajiv Harlalka"}, {"rating": 5.0, "review": "Love Amazon Tv..  Own one of these in every room of my house", "verified": true, "helpfulness": "0/0", "author": "Robert R Burke"}, {"rating": 3.0, "review": "9/12/2015 update. For some reason, I decided to try again. I guess I just hate giving up. And most of the things i had looked for were there. It is easy enough to use, but still requires another device when only one is needed. For the most part, will continue to use my tv remote.I have several kindle e readers, kindle fires, echo, love them all.I have samsung smart tv with apps and remote. I have a sony blu-ray player with apps and remote. I get to speak to this device, so big deal.it takes me to the shows, but not where i left off and not with my pre-programmed options (closed captioning and descriptive audio, when available). I didn't get my tv set up in time so it's too late to return it.", "verified": true, "helpfulness": "0/1", "author": "tmd54 \"tmd54\""}, {"rating": 5.0, "review": "Great product.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Laura A"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "G. Snowden \"Snowman\""}, {"rating": 1.0, "review": "Unstable Connection", "verified": true, "helpfulness": "0/0", "author": "Cez"}, {"rating": 5.0, "review": "My boyfriend bought me one a year ago and I love it. But I am so disappointed that they're not selling it anymore.:-( I wanted to buy one for my livingroom. Can someone recommend me something similar? Thank you.", "verified": true, "helpfulness": "0/0", "author": "P. Marcano \"P. Marcano\""}]