[{"rating": 5.0, "review": "we are a media household.  everybody has the app on their phone and so we play music, TV and youtube through it all the time.  Great device", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I was expecting a bit more out of this device.  It does not work with Amazon Prime and I don't want to purchase another delivery device.", "verified": true, "helpfulness": "0/0", "author": "Nancy N"}, {"rating": 5.0, "review": "The Google Chromecast is about the best thing that ever happened to TV. I got rid of my Cable and all I use is this. Allcast now you can stream your own content. It is amazing.", "verified": true, "helpfulness": "0/0", "author": "ballar217"}, {"rating": 1.0, "review": "I bought this item because I wanted to ditch the rising prices of the dish and saw an impressive ad.  HOWEVER, the gadget installs but requires a Google Chrome browser on my PC (where Google is blocked) in order to attach the required Chromecast extension.  So now I have the Chromecast device and a new HDTV but still no viewing capability.  None of the requirements were explained in writing or the ad.  In addition, the Chromecast device has NO instructions included - the user MUST go to Google on the Internet.  The whole situation sucks!", "verified": true, "helpfulness": "0/3", "author": "Robbi"}, {"rating": 5.0, "review": "For 35 bucks you can't beat this.  I also have an apple tv.  Apple needs to do a little work or google is going to take that market away from them with this.", "verified": true, "helpfulness": "0/0", "author": "Plano customer"}, {"rating": 3.0, "review": "Works well for YouTube, Netflix and streaming music. I wish it had a browser compatible app. It will get better as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Paul Michael Wiesner"}, {"rating": 3.0, "review": "It's really an amazing product. Let's you stream You tube, Netflix, Google Play Music, Hulu and some other apps to your TV in full HD quality! The screen sharing feature on Chrome works well too.HOWEVER, about 2 weeks ago it started dropping video and audio streams. Netflix and youtube would stop playing abruptly as well as google play music. A week later no video app would play. It would just keep buffering.I've tried different devices, un-installing and re-installing the apps, resetting the Chromecast, moving it closer to the wireless router.....nothing works! I've tried researching the problem and it could be an isolated incident but there are no solutions yet. Also, it could be that I just got a lemon and need to return it. I sure hope there's a fix soon if not, I'll have to return it for a new one......P.S. Yes, my Internet connection is fine and fast, so it wasn't that.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "I got this one as a gift and I was initially thinking that I don't need another storage device. Apparently it was the new chromecast which can use your tablet or cellphone as a medium to broadcast it to your tv making it capable to watch online viewing on your tv. It was great as I have a 6 year old LED TV which doesn't have any internet capabilities. I do have a Roku and that one worked well with the TV. I was planning to buy a newer smarter TV, but with Chromecast I changed my mind. Literally saved me a cost of a TV as I am able to watch youtube videos here. Worked well with my Note 2 and Asus Infinity tablet. I just hope that it is as durable as my TV. Definitely a great buy.", "verified": true, "helpfulness": "0/0", "author": "Daddy Z"}, {"rating": 5.0, "review": "I bought this for my family, who wanted to watch Netflix on their large TV but didn't want to pony up for a Roku or Apple TV.Come the Chromecast, which is really affordable and doesn't add another remote to the house. We use either a phone or pass around the living room tablet. It's really fun to watch together, and the number of supported apps should continue to grow, what with the public API being released and everything.If anything, we don't really use it enough.", "verified": true, "helpfulness": "0/0", "author": "pretendo"}, {"rating": 5.0, "review": "Super easy to use, excellent performance, great picture. My phone wouldn't recognize it at first, but after I did the initial install with my tablet, the phone had no issues. Also, no problems with my wife's phone and tablet. In short a great product, and for only $30 from Amazon, a bargain.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]