[{"rating": 5.0, "review": "Easy to set up and even easier to use. So far no problems with it.", "verified": true, "helpfulness": "0/0", "author": "Santiago Butnaru"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "John B."}, {"rating": 4.0, "review": "Like this a lot", "verified": true, "helpfulness": "0/1", "author": "Theresa"}, {"rating": 4.0, "review": "We bought this for my mother-in-law so she can watch Netflix in her bedroom. It seems that sometimes she cannot pick up the Wi-Fi signal but altogether it seems easy for a woman in her 60s to use as long as she has a smart phone or tablet. I would recommend this for anyone who does not want to spend the money on an Apple TV or more expensive unit.", "verified": true, "helpfulness": "0/1", "author": "Laura M."}, {"rating": 1.0, "review": "Total piece of s*** - read the other plenty of truthful reviews under the 1 star section for further explanations. Beware of those 5 stars (in general), there are specific jobs out there where people sit all day and falsely review products.Invest long term and purchase a nice HDMI cable", "verified": true, "helpfulness": "0/3", "author": "Christopher"}, {"rating": 1.0, "review": "Great concept.  Poor delivery.  The technology is not reliable.  It doesn't work all the time and the quality is poor.  Video's are choppy and  It freezes VERY frequently (like every 10 minutes or so) I end up reverting back to HDMI every time I try to watch a movie with ChromeCast.", "verified": true, "helpfulness": "0/1", "author": "Terri Swier"}, {"rating": 5.0, "review": "Best thing in the world!!", "verified": true, "helpfulness": "0/1", "author": "Ashley Nicole Cuesta"}, {"rating": 5.0, "review": "Oh my goodness. I hooked this up, and even though it says phone or laptop I used my desktop, and I love it! It could not have been easier if it plugged itself in!! I haven't had a single issue with it.", "verified": false, "helpfulness": "0/0", "author": "Janelle"}, {"rating": 5.0, "review": "I bought this from Walmart but my opinion on it remains the same. By far the best piece of technology I've ever bought for the price I paid. To get the most out of this device an Android device is needed as Google is making the most apps that are compatible with this.", "verified": false, "helpfulness": "0/0", "author": "John Stamos"}, {"rating": 5.0, "review": "Ran into some problems when trying to order from Amazon (probably heavy server traffic) so I ran down to best buy five minutes down the road and purchased this device for 25 dollars and some change! Really satisfied with this purchase, works off of individual app platforms from your phone.A huge plus is that it lets you use your phone or device while content is playing.", "verified": false, "helpfulness": "0/0", "author": "Robert Reyes"}]