[{"rating": 4.0, "review": "Bought one of these straight from Google the day it was released and have been able to test it out extensively. This is by far one of the coolest gadgets for streaming that I've ever used, mainly due to how simple it is to setup. From the minute you stick it into your TV to it being ready to use, is maybe a minute and then you are ready to stream.Netflix streams extremely well, simply hit the Chromecast button and select your Chromecast and it begins playing on your television. Now what is cool about this is the ability to still use your device for other things and to be able to use it as a remote. It also does not kill your battery doing this, due to servers doing the work.Google Music also streamed very well and I was able to adjust my queue and only pick up my phone when I needed to pause the music or change the song.I've also done some testing using a laptop and the Chrome browser. Pushing YouTube videos works very well, but broadcasting a tab from your browser is a bit jumpy and not as smooth as it could be. I also pushed audio from Spotify and that worked perfect.One other thing I tested out was copy the link to a movie on my hard drive and pasting it into the Chrome browser. After making selecting the Chromecast and making the video full size it began playing on my TV. I would not say the quality is as good as the Apple TV, but it looked pretty good and the audio was great. A feature like this would be great while traveling and not having to take your Apple TV on the road with you.Overall, I'm impressed with this little gadget and the potential it has if more companies like HBO, Spotify, and Amazon add this to their apps. However, the jumpyness of the streaming of a chrome tab has a lot to be desired, but I'm sure will get better over time.Lastly, if you have a Motorola branded phone, expect to have issues with Chromecasting. I have a Bionic and YouTube works, but Chromecasting does not work in any other apps. However, my Nexus and my wife's Samsung phone have no issues. I've read online that several Motorola phones are experiencing issues with this.For the cost I would say go ahead and buy it, but expect it to take awhile to catch on with other companies.", "verified": false, "helpfulness": "1/1", "author": "Aaron Mills \"VWHSRocket\""}, {"rating": 4.0, "review": "I was lucky enough to have ordered this just before they cancelled their Netflix deal so basically I got this dongle for about $11 (subtracting the price of the free 3-month Netflix subscription) and for this price, the device is definitely worth it(and even for $35)!What I think of it so far:I got it in the mail yesterday and havent used it too much yet but I did try out the basic features like playing YouTube and Netflix through the Cast and switching apps and even locking my iPhone and everything still plays on my TV. Adding YouTube videos to the TV queue is helpful too when I have some friends over. Casting tabs from my laptop is simple and effective. It is in its beta stages so it's a bit laggy sometimes but it works.What features they need to add:-I do think, though, they should add a password for being able to control the video from other devices as it might lead to friends trolling you and interrupting your video halfway through, etc.-I also think there should be an easier way to get back to the original video that is playing on the TV if I switch apps or browse to other videos within the same app because it is a hassle going back to it to control it.-I like casting a tab but its annoying if I want to go to another tab I have to stop casting the one it was before and start casting the new tab. There may be a way around this already but I don't know of it yet.-The obvious is that they need to add support for more apps to Cast to as Netflix and Youtube are essentially the only main ones so far.-And since google decided to let iOS devices into it, I think they should also add the ability to stream content I have purchased on iTunes as that would definitely stack up against the Apple TV.Overall, I am pleased with this product and if you were one to purchase it early then you got an even better deal! I hope this helped some customers into deciding whether or not they want to buy it. Tried to make it medium length since I know long reviews scare some people away :-)", "verified": true, "helpfulness": "1/1", "author": "Omar Ahmed"}, {"rating": 1.0, "review": "I was the first person to purchase this item at the local Best Buy.  I was really pleased, and rushed home to try it out on my \"Smart TV\".  It offered NOTHING that was not already built into the Smart TV.  I had been told by my \"techie\" friends that this device would mirror the content on my laptop.  Wrong!!  It does YouTube and Netflix, and that's about it.  I guess that if you don't have a smart TV or a ROKU, this thing would be of some value.  For me, it's going back.  Too bad, 'cuz the sales lady was REALLY nice and spent a lot of time looking for the device.  Anyone know of a device that really does screen mirroring?", "verified": false, "helpfulness": "6/63", "author": "Audio Dave"}, {"rating": 5.0, "review": "My setup: I've 3 laptops (all Win7), a Google Nexus One phone and a Samsung Galaxy Tab. I speak only for these devices.One of the Win7 laptop was tied to the TV through HDMI as most of our TV viewing is Netflix (either from laptop or Wii or BD player), YouTube and few online shows offered free. I also watch live sports online usually directly on my other laptop.Packaging: The packaging was nor great neither bad. It was easy to open and had instructions for setup right there on the lid.It came with an HDMI dongle with the edges covered with sticky film, a USB to mini-USB cord, a USB wall plug adapter and an HDMI extender.Device Setup: Connected the USB cord to the dongle, connected it to the wall adapter and plugged it into the wall socket that is right behind my TV. At this moment, the LED on the dongle started blinking (which I believe is to setup an ad-hoc network for Chromecast app to find it). Connected the HDMI dongle to my HDMI switch. My TV automatically switched source and displayed the home/welcome page with the device name. Opened chrome browser and went to [...] Downloaded the app, installed and ran it. Provided my wi-fi password (Only thing that took some time in the whole setup process because I could not remember this off the top of my head). The device connected to my wi-fi network. I could cast my browser tab once I installed the Google Cast extension for Chrome.What I was able to do:1. As I mentioned above, I was able to cast my browser's tab. (This is in BETA and the system requirements probably apply for this feature).2. When I tried casting a browser tab running YouTube, I was prompted that it would work better if casted directly from the app.3. I was also able to cast local media supported by the browser by giving the full file path in the URL space or by dragging and dropping it in to the browser tab. (Note - This does not work on handheld devices, only works on Laptops/PCs).4. I was also able to mirror my laptop screen (not just the browser, but all other applications) with limited functionality, by selecting \"Cast entire screen (experimental)\" option in the Google Cast icon.Other observations: 1. YT / Netflix when casted from the apps themselves took about 15 seconds to load and also had 2-3 seconds lag for pause/resume. 2. When playing a playlist from YT, whenever a new video starts, it plays for a second or two, re-started and played without any issue. 3. I was able to cast the video from a G+ hangout by copying the URL in the pop-up and pasting it in a browser tab. Audio did not work. 4. I was able to play local media files such as mp3 and mp4. .mov files did not work. I had not tried other file types. 5. Adding a YT video to the queue from another device needs to work better.What I like about this product: 1. My laptop is now freed up from always being tied to the TV. 2. I/my wife could use all of our devices to control what's being played. 3. Casting YT/Netflix videos directly from the apps resulted in very good resolution which I was not able achieve from Wii/BD player. 4. Got netflix discount of $23.97Conclusion: Is this better than Apple TV? - I do not know and probably it's not. But at this price point and for my needs, this works perfectly well. I only hope (and have seen articles) that more and more apps will be compatible.", "verified": false, "helpfulness": "3/4", "author": "K. Thirugnanasanban \"Karthik\""}, {"rating": 5.0, "review": "This is so easy to use and it does what it says!  Google comes out with another great product for such a low price.  I got this and my new nexus 7 at the same time and have enjoyed streaming Netflix, Youtube and Google play music to my TV seamlessly.  Also chromebook works flawlessly while streamline to the TV (viewing photo slide, internet pages, ect).  Great product!", "verified": false, "helpfulness": "1/1", "author": "RW"}, {"rating": 2.0, "review": "I was on the fence about buying this, but then I heard you get 3 months of Netflix for new and existing customers - this made me buy it! I mean that would effectively make this an $11 unit plus tax on $35. But apparently google decided to pull the plug on that promotion. Well that was the thing that made this a no brainer, and since they got rid of that promotion, I will let other people be the beta testers.Besides, they say this thing works with chrome, but it doesn't appear to work with chrome for ios. At least I could find no confirmation that it works on chrome for ios. Think I will buy a Android mini PC dongle from deal-extreme instead and pass on this thing...", "verified": false, "helpfulness": "0/9", "author": "Karen Wilson"}, {"rating": 5.0, "review": "Amazing device. Amazing value. I love how it pulls the stream from Google Play or YouTube on its own, leaving your tablet and phone free to do other tasks while still acting as a remote.I work for a phone company which has been heavily involved in OTT video. I used the Roku boxes, Boxee, the Western Digital devices and this little device already exceeds them all and has tremendous potential as Google polishes up this devices capabilities.", "verified": true, "helpfulness": "1/1", "author": "Mark A. Laughlin \"Raggedy Edge\""}, {"rating": 5.0, "review": "I had to plug the device into a laptop to set it up using a small setup program from Google.  But, after that...  Simply awesome!The only issue I found so far was that when you try to play certain songs from your phone on Google Music, and the same song is on your phone locally an error about \"sideloading is not allowed\" comes up and the song will not play.", "verified": true, "helpfulness": "0/0", "author": "cory j prestenback"}, {"rating": 5.0, "review": "Now that you can use it with Apple iPhones or iPad I use it all the time, but they need to add some more features/apps you can only run Netflix & You Tube.Save your money. What a waste of money, I can do the same thing woth a HDMI Cables. Save your money.........", "verified": false, "helpfulness": "5/64", "author": "Me"}, {"rating": 5.0, "review": "This is a must have.You can stream things from the phone, or the browser. In that sense, everything is supported in one way or another. Everything can be found on the web, and more apps are supporting it every day. It's easy to set up, and there is no learning curve. The devices you have are remotes already, so there's no more fumbling with multiple remotes.Epic win, Google.", "verified": true, "helpfulness": "1/1", "author": "Nate"}]