[{"rating": 3.0, "review": "I was really opposed to buying this, because I am leary of anything that has the brand name Google (this company has too much power, like reading your gmail emails) but my husband wanted to try it, If you stream from your tablet to your TV the images are dark like it is always night time when the shows are being taped or something. We tried to play around with the settings but the wireless capability is not as optimal as you want it. But if you just want the convenience they go ahead and try it. Personally, I think it does not matter to me if I stream from a tablet because we have an Xbox and the Xbox gives a clear picture when streaming.", "verified": true, "helpfulness": "1/3", "author": "Constance \"Constance\""}, {"rating": 5.0, "review": "The setup was super easy and fast. Watching youtube on large screen became my primary source of entertainment in the living room.", "verified": true, "helpfulness": "1/1", "author": "Lukasz Heldt"}, {"rating": 5.0, "review": "The Chromecast is the first (of many?) device built on the GoogleCast specification for media transmittal. What Chromecast affords you that other streaming receivers do not is the ability to start a stream on another computing device and then hand it off to the Chromecast. For instance, if you start up Netflix on your iPad then toss it over to the Chromecast, your iPad is NOT streaming the media any more; you're free to do other things on your iPad. This handoff protocol is something that's been missing from streaming and this spec and device can be a real potential game changer. Super easy to use and set up. Big fan.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I can't say much that others haven't said. The thing just works. Plug it in, and you'll be streaming Netflix, Youtube, and now Hulu Plus in minutes. at $35 you can't really go wrong. I imagine before Christmas Google will release the SDK (this means people can build things to work for it), and then we will see the real possibilities of this little guy.", "verified": true, "helpfulness": "0/0", "author": "K. Kanczuzewski"}, {"rating": 3.0, "review": "Yes you can stream your local videos if you play them on your computer through the Chrome Browser.  But why can't I stream the videos on my Android phone directly to Chromecast?  Makes no sense.  This app needs to exist!Also was surprised that this comes with a plug (to plug into the wall), which they recommend you use (they they also say you can power it by plugging into a powered USB port -- but the wall plug is recommended).Too bad it's not just the dongle, adds a mess of wires since you need to plug 'er in.Otherwise it's a breeze to setup and watch Netflix, Hulu+, etc.  But it needs a direct file streaming app.", "verified": true, "helpfulness": "0/0", "author": "carrerascott \"carrerascott\""}, {"rating": 5.0, "review": "Does what it is supposed to do, easy setup, cheap. I don't find myself using it all that much due to my busy lifestyle, but I like to have the option to stream things online, if I want to.", "verified": true, "helpfulness": "1/1", "author": "Matt McCullough"}, {"rating": 5.0, "review": "Super easy to set up, easy to use, and lets you watch on multiple TV's in the house!  Love it!", "verified": true, "helpfulness": "1/1", "author": "Julia Seltzer \"NYCmama\""}, {"rating": 5.0, "review": "I had a little bit of a hard time setting it up (I wouldn't talk with my router during setup.)  But after fixing the setup issue, the device has been awesome!  I mostly use Chrome on a PC to cast from and it works beautifully!!!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "I am a little concerned about the heat the unit puts off. Will it shorten the life of the components? I really hope programmers are writing more apps for this. More is needed to make it a great player.", "verified": true, "helpfulness": "0/0", "author": "Tim Francisco"}, {"rating": 4.0, "review": "Loved Chromecast, comes very well packed and all necessary cables and accessories for any installation.The only problem is that I live in south america and I can not download the app for my iPad & iPhone. When is it available?", "verified": true, "helpfulness": "0/0", "author": "Antonio"}]