[{"rating": 2.0, "review": "It was not what I expected, especially when I had no support from Google. I still cannot use this device and google cannot find  a solution. It is a waste of $35", "verified": true, "helpfulness": "0/0", "author": "SLR"}, {"rating": 5.0, "review": "Bought my first one the day it was announced and love it so I purchased another one for my grandmother because she like me does not own a smart tv", "verified": true, "helpfulness": "0/0", "author": "eddie"}, {"rating": 5.0, "review": "I look forward to getting one for each TV in my home.  The price is reasonable, and the utility high.", "verified": true, "helpfulness": "0/0", "author": "Wyneth C. Achenbaum \"wyna\""}, {"rating": 5.0, "review": "This is a marvelous device for streaming youtube and netflix so far.  With the APIs that are coming, I'll be very interested to see what comes next.  I had no trouble setting it up, and was even able to get houseguests streaming youtube videos at a recent party with little effort.  The quality is high, and even the Chrome browser streaming that's still in beta works decently well.  For this price, I can't imagine having gotten a device even this good.  Unless you already own every other streaming device on the market, you need this thing.", "verified": true, "helpfulness": "0/0", "author": "saseith"}, {"rating": 5.0, "review": "It's all perfect but it need more apps support... I've heard several companies are working on this....Cool stuff...I can recommend this!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Garcia"}, {"rating": 2.0, "review": "Does not stream audio from anything but google chrome browser. And google chrome browser does not play Avi standard format.", "verified": true, "helpfulness": "0/0", "author": "john clark"}, {"rating": 5.0, "review": "Very easy and compact alternative to Roku love it, easy to install, wish it had better iPhone integration not bad HD", "verified": true, "helpfulness": "0/0", "author": "louis moravecek"}, {"rating": 5.0, "review": "works like a charm, the bee's knees, cat's meow, and now for something completely different: everything should work this easy", "verified": true, "helpfulness": "0/0", "author": "David Koger"}, {"rating": 5.0, "review": "Just get it!!! The best technology on its own. Go get it and hook it up in just 10 min.", "verified": true, "helpfulness": "0/0", "author": "Chandra Pasham"}, {"rating": 5.0, "review": "Chromecast is an almost shockingly simple way to stream all kinds of video to your TV. Set-up is quick and takes only a minute or so. Using Chromecast is also simple. On your phone or tablet, a few apps (Netflix, YouTube, Google Music) have already been updated so that you just press a button to start streaming your selection on your TV. On your computer, you can stream anything in your Chrome browser, which allows you to stream other sources of internet video (like Hulu), even if they have a restriction against doing so. Hulu's odd device-restrictions on some video is no longer a problem with Chromecast. Additionally, because Chromecast uses the apps on your phone/tablet or Chrome on your desktop/laptop, there is not clunky UI to navigate. Just use the apps you're already familiar with.My roommates and love Chromecast so far. The only thing I'd like to see is Amazon release an app that allows you to stream Amazon Instant Video to it from a tablet or phone.", "verified": true, "helpfulness": "0/0", "author": "Eric Hall"}]