[{"rating": 3.0, "review": "I want to love the Chromecast, since it gives us easy access to Netflix, Hulu Plus, and Youtube, but I've had several experiences in which the Chromecast has simply stopped streaming and become totally unresponsive in the middle of a show/movie. Every time that happens I have to go over and unplug the Chromecast's power supply, plug it back in, and restart whatever I was watching. The WAF (wife approval factor) which was initially very high due to the unit's flexibility in viewing options has been dramatically reduced, and I find myself saying \"well, it was only $30\" more often than I'd like.Whether this is caused by our home wireless network, the device(s) I'm using to cast with (couple of phones and tablets), or the Chromecast itself, I'm not sure. It does seem to happen more often with the phones than the tablets, so we're still experimenting to see if some combination is more reliable.Also the Chromecast runs very hot. Others have noted this as well. We're powering it from the TV's USB port.", "verified": true, "helpfulness": "0/0", "author": "Haus"}, {"rating": 5.0, "review": "Love this. I can bring up anything online, through my phone and even my PLEX media center and cast it to my TV in HD. I have not noticed any bandwidth issues steaming movies. Easy setup and configuration on my home network. Works with Windows too so I can cast Windows and Android apps.", "verified": true, "helpfulness": "1/1", "author": "Troy L Hudson"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "pedro colina"}, {"rating": 4.0, "review": "Doesnt always work the way I would like for it to, but I am sure that is a learning curve for the person using it.  Otherwise it holds the feed very well.", "verified": true, "helpfulness": "0/0", "author": "Denise Galey"}, {"rating": 4.0, "review": "Very good purchase.", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "Perfect product- bought two", "verified": true, "helpfulness": "0/0", "author": "Mr Barter"}, {"rating": 4.0, "review": "The product worked as intended, if a little leggy when casting the entire desktop and chrome page. Part of the legginess is probably because of the wi-fi connection that I have at home. Needs more apps such as Spotify.", "verified": true, "helpfulness": "0/0", "author": "Andrew Gondokusumo"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Chris Cyr"}, {"rating": 4.0, "review": "would recommend", "verified": true, "helpfulness": "0/0", "author": "diane Mathews"}, {"rating": 4.0, "review": "I really like this little device but don't buy if you're wanting a streaming player as main entertainment. I use a Roku, Fire TV would also be good. This is ONLY a mirror device which is the BEAST solution for PC to TV mirroring, and chrome tab casting. You can play any video to your TV which is awesome for the stuff unavailable on typical streaming devices, such as HBO Now (now on android). But, this is not as good for watching Netflix, hulu, etc. as you have to link your phone between casts which can cause lag between episodes, battery drain, etc.", "verified": true, "helpfulness": "0/0", "author": "Tajanator \"Tajanator\""}]