[{"rating": 5.0, "review": "It is easy to setup, but you have to connect it to the same WiFi network at home for it to work.  It works great with Youtube, Google and basic web browsing.  I watch youtube video on my big screen TV, the picture quality is very clear and the sound is great too.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Hua C Ye"}, {"rating": 5.0, "review": "I love it. I'm using it every day with my Samsung (dumb - not smart) TV.For Netflix, Pandora, YouTube, HBO...Friends are spending tons of money on HDMI cables for their computers to connect to their TVs, but with this, everything is wireless and painless!", "verified": true, "helpfulness": "0/0", "author": "Momcilo Prodanovic"}, {"rating": 5.0, "review": "the best multimedia device I could buy", "verified": true, "helpfulness": "0/0", "author": "Edwin Aranda Galvis"}, {"rating": 2.0, "review": "Only works with a few established apps, namely Netflix and Youtube for streaming. Cannot stream anything directly from your tablet (Nook HD in my case), nor can you even see the Chrome browser itself. Initial setup was a beast. I use a Netgear WNDR 3700, with SSID broadcast normally disabled, WPA2-PSK[AES] security enabled, and MAC hardware address access list enabled. Well to get this to initially work, I had to enable SSID broadcast, disable security on 2.4GHz, and disable hardware access list. Then the Chromecast setup app is was able to finish the Chromecast setup to the point of it being able to use my network to perform a firmware update on itself. After that, I was then able to turn all my WNDR 3700 router settings back on, then had to re-setup the Chromecast for the WPA2 password and then it worked. I think the Chromecast plug needed its firmware update to work with the WNDR3700 ( which is dual 2.4/5 GHz and which I use the 5 GHz for my internal networking between computers and a NAS box). Anyway, after doing all this, I find that the only thing that presently works with Chromecast is the Netflix and the Youtube apps. My Crunchyroll app does not support Chromecast. And the Nook HD does not work with Amazon Prime video either and even it it did, I doubt that Amazon supports the chromecast device. At home, you would be better off hooking up an old spare computer to your HDTV (assuming the video card has HDMI output and you have a wireless keyboard and trackball/mouse) that way you get the full functionality of doing anything you want internet wise and displaying on your HDTV. All I can say is that while it works, it just does not do all that much so it is probably not worth even for the present low unit cost.", "verified": true, "helpfulness": "0/0", "author": "John I."}, {"rating": 2.0, "review": "Was difficult to get set up with my wireless router and there was very little helpful instruction for trouble shooting. After finally getting it working I was disappointed that I could not multi task while streaming a movie. If I open another window for working I lose my movie on the television screen.....why would I want the same thing running on both screens? Pretty much a waste of time and money in my opinion and the uses I wanted it for.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sharon\""}, {"rating": 3.0, "review": "I LOVE chromecast, but the one issue that drives me insane is it disconnecting from my wifi. About 5% of times I try to use it, the chromecast is disconnected from the wifi and won't connect. My other devices are within range and have a full 2 of 3 bars, but the chromecast for some reason won't stay connected.", "verified": true, "helpfulness": "0/0", "author": "Rebecca R"}, {"rating": 2.0, "review": "This is a great product, but it only works once and assumes that once it is installed, life will go on the same way forever. I installed this, and was happy for 3 weeks. Then something happened. No, I did not move from New York to London and neither did I try to hack the device. I merely changed my internet router, and reconfigured it to support the new Network name and SSID. The moment I did that, this thing flunked. Contacted Google Support - well with the stock riding in excess of $1K - guess they don't care.At best this is an experimental device, more like those crazy romantic relationships. It's great when it works, but absolutely dreadful when it ends.", "verified": true, "helpfulness": "0/0", "author": "Ravindran G. Gangadharan"}, {"rating": 3.0, "review": "Does as advertised - finding chromecast apps should be easier. wish it was powered over HDMI instead of USB so I woudn't need another wire to allow the tv to auto on. should have shipped with wireless N (not just G) as this is what will be better for increasing video quality and is better for less interference (when in reasonable distance from signal source).", "verified": true, "helpfulness": "0/0", "author": "Anthony G Ferreira"}, {"rating": 5.0, "review": "This is a great little device; it does what is advertises. The sync (cast) to the I-Pad went smoothly, and I was able to watch Netflix right away. I only paid $30.00 on Amazon; very good deal.", "verified": true, "helpfulness": "0/0", "author": "Guy Evans"}, {"rating": 5.0, "review": "This thing rocks...we have cheap-o Direct TV that loves to kick out on us.  We just start casting from the Ipad, without getting up or fumbling with remotes, whenever this happens...it  is sweet!", "verified": true, "helpfulness": "0/0", "author": "(a)bioticdesign"}]