[{"rating": 5.0, "review": "Fire TV is easy to set up. It allows us to access all of our children's programming in their play room on an old projector tv", "verified": true, "helpfulness": "0/0", "author": "Michael S."}, {"rating": 2.0, "review": "I can't load Netflix. It keeps telling me my download will start in a few minutes. We have had this for over a week!", "verified": true, "helpfulness": "0/0", "author": "Tracy Williams"}, {"rating": 5.0, "review": "easy to connect, easy to use! Glad I bought it!", "verified": true, "helpfulness": "0/0", "author": "chrisb"}, {"rating": 3.0, "review": "Overall I like the fire TV.  It's very easy to use and has all of the content I was looking for.  However, every couple of months it seems to start having a progressively worse buffering issue.  Resetting the device to factory defaults seems to solve the problem, but I have to re-enter all of my user names and passwords.", "verified": true, "helpfulness": "0/0", "author": "Travis Frels \"Travis Frels\""}, {"rating": 5.0, "review": "Yes it is great! Before in the middle of a program it would stop and buffer ..... and may not get the program back or have to restart the player. That happened yesterday and I told my son to use the Fire TV and it was so FAST connecting and getting back to the program. Just Awesome.I am glad I made this purchase!", "verified": true, "helpfulness": "0/0", "author": "Matthew C. Kramberg"}, {"rating": 5.0, "review": "Excellent buy", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "No lag.  Much better option than the media sticks.", "verified": true, "helpfulness": "0/0", "author": "Shark"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "aaron goldstein"}, {"rating": 3.0, "review": "I'm sure the product works fine but under certain circumstances. And that is high speed internet which I don't have. Long waits for downloading.", "verified": true, "helpfulness": "0/0", "author": "Ron Dehn"}, {"rating": 4.0, "review": "Ease of setup: Came coupled with my Amazon account out of the box. No HDMI cable though. I knew this, but a lot of people won't have a spare lying around, and that will be a passion to have to run and pick one up from a brick and mortar store.Hardware: Great. Not a fan of the loud click on the circle, but it functions great. It's in my bedroom and the single led is not too bright before it turns off.Apps: bought this for Netflix, Amazon, and Plex ... All work very well. Rewind and skip on some is s little sluggish to start the stream, but you get used to it. Missing skip in smaller time chunks. Once in 4 nights viewing, Plex got into a state where the fire TV required a reboot. I'm sure Plex will continue to work on the app, so this is not a ding against the fire TV ... Just mentioning here in case someone ribs into that.For our content streaming in a fixed environment, it beats my Chromecast ... not even a contest for me.", "verified": true, "helpfulness": "0/0", "author": "Eric Spencer"}]