[{"rating": 5.0, "review": "I've had a Logitech Revue Companion Box with Google TV and Keyboard Controller since it first came out.  Watching movies on it using Netflix or Amazon Instant Video is almost impossible because of the number of Shockwave crashes.  But I like being able to browse the web on my TV with it.  I was so excited to see an alternative to Google TV, the Chromecast.  While it doesn't have as many features as Google TV does, it sure is a lot more reliable!The Chromecast was easy to set up.  I opted to plug it in to my A/V receiver rather than my TV, so I don't get the automatic input switching like some people are when they plug the Chromecast in to their TV.  No biggie.  The Chromecast connected to my WiFi network okay, but the signal was a bit low.  So I installed the HDMI extender that comes in the package (the bag it was in said it improves the WiFi reception as well).  I got an extra bar on the WiFi signal after using the HDMI extender, so if you have a problem with your WiFi signal, give it a try.I love being able to play Netflix movies and music from Google Play Music.  I don't browse YouTube all that much, but it works just as well.  You just hit the new \"cast\" icon in these apps to send the video or audio to your Chromecast.  There is also a Chrome extension that allows you to cast any Chrome tab from your PC to your TV.  You can then open additional Chrome tabs without disturbing the tab that is currently being cast.  For example, you can start a YouTube video or have another website up on your TV and if you open another Chrome tab on your PC, it does not automatically get shown on your TV until you press the \"cast\" button... the old tab remains on the screen undisturbed.I haven't had any crashes or disconnects yet, which is more than I can say for Google TV.  Funny how Google TV boxes can run upwards of 200 hundred dollars or more and it can crash constantly, but this little $35 box does not.  Sure, the app support is limited for now, but this won't last too long.  With the popularity of this thing, I'm sure new apps will be jumping on board left and right!  The only thing that could have made the Chromecast even better would have been an HDMI pass-through like Google TV has so you can keep your TV signal in the corner while you view your Chrome tab or apps on the screen.At the intro price, this device can't be beat.  I can't wait to see what new apps and other updates come in the future.  Hopefully Amazon will release a Chromecast-compatible app for Prime Instant Video someday!", "verified": true, "helpfulness": "0/0", "author": "Juniorverse1"}, {"rating": 4.0, "review": "Really easy to setup.  I have multiple Android and iOS devices and have tested the current functionality with both.  Obviously this works better with Android as you have access to both Music and the Play Store Movies and TV.  The Netflix integration is good and is pretty fast.Most video from websites and even local content play, within 10 seconds the audio syncs up.Overall this is a great little gadget, for the tech inclined.  Once other services (Hulu, Amazon, etc.) are added this will be an easy recommendation.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 5.0, "review": "The Nexus Q was one of my favorite tech devices of all time and I mourned its demise for months. Enter Chromecast. The Nexus Q 2.0. Smaller and simpler than ever. I can now bury my Nexus Q and move on...What I love about Chromecast:1. Plug and play--open box and plug into HDMI port: 40 seconds2. Setup--the whole process is as simple as can be. Like they say, it just works: 3 minutes3. 3rd party app support from the start: I loved seeing Netflix already supported. (Hulu?? Are you going to join the party?)4. Browser sharing: YES! Love it.5. Out of site: the little dongle is 100% hidden behind the TV.6. This thing is so popular already I'm sure we'll be seeing lots more apps soon.7. So cheap!What Chromecast doesn't have on the Nexus Q:1. Playing music without having the TV screen running. I get it--using HDMI is easier all around but it's a pain to have to turn on the TV if you just want to listen to music.2. The glowing space-age orb. Maybe I'll donate it to a museum one day.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Google has done it again! Chromecast is a handy product that lives up to the Google name. Works great and is well worth the $35 it costs. My videos stream flawlessly from my phone onto my tv making me feel like I have a smart tv. The video's stream in HD and with no loss of definition. Youtube, Netflix, and Google Play videos are all compatible! The feature I love the most about Chromecast is that I can browse other apps while using it and my videos aren't even interrupted! I highly recommend Chromecast to anyone who wants a smart tv without paying the price for getting one.", "verified": false, "helpfulness": "2/3", "author": "sunshine"}, {"rating": 5.0, "review": "I normally don't write reviews for anything, but this thing is really neat. I bought it to use in my bedroom and my daughters room. In the living room, I have my PS3, so I can watch Netflix on that TV, but other than that, I just have my laptop. I have connected my laptop to my bedroom TV through the HDMI port, but it's too much work, and I have to use a wireless mouse to control the laptop...it's a big hassle. With the chrome cast, I can quickly and easily move it from my room to my daughters room and use my phone to control it. Just tried it out and the quality looks great. As soon as I plugged it into my TV, the setup screen came up. It was just a quick download, and it pretty much sets itself up to connect to your wireless. I downloaded chrome cast and Netflix to my phone, but I haven't tried casting a video yet.", "verified": true, "helpfulness": "2/3", "author": "ANDREA"}, {"rating": 4.0, "review": "Managed to get the last Chromecast from my local BB (an associate had hidden one under the counter but gave it up). They had sold 43 in one day. A few minutes fiddling with the proper inputs and, using my Samsung Skyrocket III as the controller, I had it going. I plugged it into an HDMI port on my home theater receiver, then ran an HDMI cable from that to an HDMI input on my TV. That way I can use my Logitech Harmony One remote to switch from my cable box to the Chromecast and use the Harmony One to control volume and switch back to other sources later. I still need to use the phone to start Netflix. This gadget may allow me to shut down my home theater PC, which, since it uses a VGA input, has not quite as nice a picture as the HDMI inputs. For now, the HTPC does allow use of other video browser sites like Project Free TV for the stuff that is not on Netflix. Setup was easy. You have to download the Chromecast application from the Google Play Store, but my Netflix and You Tube apps were already up to date for selecting the Chromecast. The Harmony One did not have the Chromecast as a device, but I used the earlier Google TV object and just changed the name. Since there is no controller for the Chromecast, the Harmony One only needed to set the receiver and TV to the proper inputs.", "verified": false, "helpfulness": "1/3", "author": "D. Knapp \"SQL DBA\""}, {"rating": 3.0, "review": "I didn't see an option to view the Chrome browser from my nexus 4 or nexus 7. I was able to view my desktop version of Chrome and the view is very poor quality. Tried Pandora and the sound is extremely choppy. Tried the YouTube app from nexus 4 and nexus 7 device and again the video is just poor. Playing music seems to be fine. Shows the image of the cover album on the screen. No options to show images like AppleTV. Did not try Netflix because Google stopped the 3 month trial.[video quality update] Video quality from YouTube seems to be fine. I don't see an option to play different resolutions for the video but maybe the fist time it tries the lower resolutions. I don't normally watch YouTube on my Nexus 7 but I did buy the Chromecast so that I can play YouTube on my TV. Maybe I don't know the app very well but I don't see a way to change the quality like on the desktop version. Seems to be working fine now. I expect the quality to up and down I guess. Gave another star to the product.[Netflix update] I was one of the lucky ones to meet the order deadline and did receive the code a week later. I'm a new Netflix user and one of the reasons I wanted this device. I don't know where I've been but Netflix is great. But this is a Chromecast review so I'll say the video quality is great and didn't have any streaming issues. I've only used the Netflix app and don't know what the video management is in a browser. I quick look at the browser version seems to have more features and options and seems like the app has the bare minimum for now. I'm thinking with time the app will be enhanced. Gave another star to the product.", "verified": true, "helpfulness": "4/18", "author": "R Robinson"}, {"rating": 5.0, "review": "I bought this as soon as it was announced this week. I figured for $35 and 3 free months of Netflix (at the time) how could you go wrong. I got it yesterday and I am very impressed. I downloaded the chromecast app on my Nexus phone to set it up but you can just as easily set it up from a Windows or Mac computer or tablet. It took me almost as long to open the box it as it took to set it up, just a few minutes.The steps to use it. From the phone/tablet just launch Netflix, YouTube or Google Play and pick a video and choose to Cast it to the TV. What happens next is what really impresses me. It not only turns on your TV but also switches the input to the proper input (HDMI1, 2 or whatever) and starts playing. At that point you can use your device however you'd like while the video plays as its not dependent on the source device at all. If you want to stop, ffwd, rewind or whatever just launch the app and it will show you the controls to do so. YouTube allows you to queue up as many videos as you'd like which it will play in succession. I primarily use it from my Nexus but have tested with an old iPhone and it works great there too. Had a friend over yesterday and we were loading the YouTube queue simultaneously from my Nexus and his iPhone.If you'd like to Cast from your browser launch Chrome and download the plugin available in the Chrome Store then all you do is press the icon in the right hand corner of the screen and your browser tab will show up on the TV.Its so easy to use you almost forget its there. Its a very natural extension of using your tablet or phone and the videos looked great. HD YouTube looks amazing.These apps give you a good deal to watch as it is but they have already said more are on the way.  In addition they have a software developers kit out there so any developer can add this casting functionality to their app on any Apple iOS or Android device.  Possibilities could be endless.", "verified": true, "helpfulness": "2/3", "author": "JimNJ72"}, {"rating": 1.0, "review": "I bought into the hype and received my fandangled dongle yesterday.Would've been a nice disclosure that Chromecast does not support iOS yet, so I'm basically no better off than if I just plugged an HDMI cable directly into my TV.Over-rated.", "verified": true, "helpfulness": "5/64", "author": "Calico8"}, {"rating": 5.0, "review": "I actually ordered a Chromecast the day it was announced from Google. However the next day, I was told that they were available for purchase at bestbuy. I was anxious to try it out so I went and bought another one and gave it a try.Setup was easy and within 5 minutes, I was watching a youtube video on my 65\" TV. The quality was VERY good. I tried a 1080p video first \"Big Buck Bunny\" and it looked, played and sounded wonderful. Next, was playing music from my Google Play music app. Same result, the music sounded great.I moved on to my Macbook Pro, and again, the videos was clear, without lag, no audio sync problems at all. Same for my Windows PC.Those considering buying the Chromecast  should consider what the Chromecast actually is and does, instead of what they wish it could do. So here are some facts:1. The Chromecast is not a streaming device of local digital content. In other words, it does NOT play digital music and videos that is stored locally on your network drives or computers. However there is a work-around for this:Use PLEX Media Server. If you don't already have it, here's the link:[...]Once you download it and point it to your files,it will act as a proxy and allow your music and videos to be played on your HDTV using the Chromecast through the Chrome browser. Simply launch the PLEX Media Manager in Google Chrome browser. Pick a file to play, Hit the Google Cast button and you'll get seamless playback of your own files. [Edit: Please see comments to see an alternative method].2. The Chromecast is not a DLNA or Miracast device or Apple's airplay. This is a lot like my number 1 fact, but I wanted to make this clear. If you want device mirroring (display whatever is on the device's screen), the Chromecast, is NOT for you. The video and music does NOT stream from the controller device (Your computer, tablet, smartphone). Chromecast works by fetching the content from a website or cloud service itself, NOT from the device you're using. Here's what's cool about that:A. You could start playing a video using your smartphone,tablet,computer as a \"remote\" and still be able to browse the web, play a game, check your social apps, write a book report, put the device to sleep,turn the device completely off (I tried this myself), or leave the house, and the video WILL still play without issues.B. Your battery life is saved! Because your phone, tablet or computer (not plugged in)is not actually streaming to the Chromecast, your battery consumption is minimal. You could Play dozens of movies over several days and still have most of your battery life remaining (Of course this would depend on what else you do with the phone, tablet or computer and how long your device can stay in standby).C. Every device connected to the Chromecast on the same network can take control of playback, adding to the queue (what's going to play next). Pause, fast forward, rewind, etc. So if your roommate, friend, parent, sibling, spouse, girlfriend/boyfriend has to leave with their device, you don't have to worry.D. You can play content from thousands upon thousands of sources using your computer. Using Google Chrome, nearly every webpage, that has content can be viewed using Chromecast. Of Course, this depends what protocols the site is using. If the site has trouble playing on your computer, then it probably won't work well on the Chromecast, either.3. Chromecast IS cross platform (works with multiple devices). As I said, I tried it with several devices with different operating systems. At the time of this review, it works on Windows PC's, Macbooks, and android devices. The app for iOS devices is coming soon. Everyone knows the Apple App store has stringent policies and at times, it can be a long process. Look at the Onlive game streaming app. We won't get into how Apple has been trying to eradicate google applications from it's ecosystem anyway. I'm sure the app is waiting for approval. Just be patient. [Edit: Please see comments for a reply to it working on iOS devices].There are several youtube videos that can show you how to set it up or how well it works. I made a video myself:[...]Watching my video isn't required, but it does help to verify what I'm saying.4. The device you use with the Chromecast, must be on the same WIFI network. The important word here is WIFI. If you are trying to use it, with a ethernet (wired) connected device, even though it's on the same network, it will NOT work! Yes, that sucks, but not being able to use sink water in your gas tank, kind of sucks to. If that's a deal breaker for you, then you shouldn't purchase it. It's how they chose to implement it's use. It is, what it is. [Edit: Please see comment section].5. The Netflix 3 months free limited time offer is over! I received 3 months free with both my purchases. I live in the eastern time zone. Even though I bought my second Chromecast on July 25th at 6:46pm. I realize that when the offer was no longer available, it should have been posted immediately so that consumers could factor that into their decision to buy the Chromecast. Instead of calling it a limited time offer, they should have said \"while supplies last.\" Never the less, the features and functionality of this device has nothing to do with the inadequacy of a bonus offer. To help people make a decision about a future purchase and if it will work for THEM in the home configuration they have, is paramount in my book.6. The Chromecast REQUIRES power through USB connection or from your wall outlet. The required peripherals ARE provided to you in the retail box. Some people are saying if you have an HDMI 1.4 compatible port on the back of your TV, the device can be powered by the HDMI port alone, without the USB cord connected. I CANNOT speak to that, as my HDMI ports did NOT power the Chromecast. I had to use the provided USB wire and connect it to a USB port available on the back of my TV.Overall, I'm extremely pleased with the purchase. I've read some of the other reviews, particularly the 1 and 2 star reviews, because it's an indicator of what can possibly go wrong with the device. I would suggest that people make their decision based on people that have actually bought the device and have experience connecting, setting it up and ACTUALLY using the device. Most of the bad reviews are from people that have not used it, didn't understand the features of the device, or, to be honest, has a problem with the competition between Apple and Google and wants to dismiss this product because of their affinity for Apple products. Look at the features and functions of this device and consider them for yourself.I hope this review helps someone who may be considering this device.EDIT: Recently more apps were added with chromecast support, including the PLEX app! Other editions are: HBO Go, Hulu Plus, Pandora, Vevo, Redbull.tv, Songza, Post TV, Viki, Real Player Cloud.", "verified": false, "helpfulness": "9/962", "author": "Shauna Morgan"}]