[{"rating": 4.0, "review": "I bought the Fire TV more because I was already a Prime member and wanted to take full advantage of my membership than any other reason. I refuse to run up a bill watching paid shows (cable is already screwing me sufficiently, thank you), so I stick to the Prime Video which is included in my Prime membership.I'm currently watching the first season of Bosch (an Amazon exclusive series). It's excellent and I'm hoping for a second season.One note - I also have an Amazon Echo. It uses the same remote control as the Fire TV, but the Echo's remote came with a magnetic holder - my Fire TV's remote didn't. I really like the holder, so I use it for the Fire TV's remote (I really don't use the Echo's remote). I think the Fire TV should include the magnetic holder also.", "verified": true, "helpfulness": "1/1", "author": "Grady Richardson"}, {"rating": 5.0, "review": "Excellent. ...", "verified": true, "helpfulness": "0/0", "author": "harpreet s zapra"}, {"rating": 5.0, "review": "Works great with Sling TV! This is my primary source of entertainment when I just want to turn something on and relax. I had the Fire Stick and kept having issues with it buffering on Sling TV. Not with the Fire TV! Cable cutting has never been easier!", "verified": true, "helpfulness": "0/0", "author": "A785254"}, {"rating": 2.0, "review": "a refurbished amazon fire tv for $89.00 and a new unit for $99.00 ? what is this stupid deal mean?", "verified": true, "helpfulness": "0/2", "author": "sotosan"}, {"rating": 5.0, "review": "just like new", "verified": true, "helpfulness": "0/0", "author": "William K Clark"}, {"rating": 5.0, "review": "Amazon fire TV is amazing. I purchased it as a replacement to my cable provider and its worth it. It has all the apps i need and more. its super fast and i can connected to literally any wifi network. Works like a charm. Went from $195 to $25 with the Sling TV app. Now i only spend $50 monthly rather than the 195 for my cable bill.", "verified": true, "helpfulness": "0/0", "author": "Emperor Julius"}, {"rating": 5.0, "review": "perfect size suction cups really hold well", "verified": true, "helpfulness": "0/0", "author": "cathy"}, {"rating": 5.0, "review": "Awesome product..very fast..excellent ui...but missing some channels and apps", "verified": true, "helpfulness": "0/0", "author": "Surya Lanka"}, {"rating": 5.0, "review": "Needs a easy way to turn off similar to Apple. Going to settings and sleep takes to long", "verified": true, "helpfulness": "0/0", "author": "Marilyn Beasley"}, {"rating": 5.0, "review": "I'm lovin every minute of it.  I don't spend a lot of time watching TV. There's so much garbage on cable. With Fire I'm able to watch what I want to watch. Thank you Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Gagnon"}]