[{"rating": 5.0, "review": "This was SO easy to set up. We were up & running in less than 10 minutes and WOW. This is primarily my hubby's toy (I play on the computer, he flies the TV). Voice search is SUCH a timesaver. I used to have to stop whatever I was doing to type in whatever he needed to search for. NOW, HE CAN HANDLE IT. Speak and ye shall FIND. Love, love, love this box!I waffled for WEEKS before buying this. I read tons of reviews & finally decided it would be worth the temporary (\"Honey, HOW DO I DO THIS????\") change in look, feel, etc. (we've been streaming with a Roku since about 2009; had the Roku XD for a long time, just before the change to FireTV). Finally, I decided to try it, thinking if Hubby had too much difficulty adapting, we'd just send it back (while also TRUSTING AMAZON to have made a massive leap forward--I have never, myself, been disappointed with ANY of their electronic offerings).I was expecting to have to sync it with our router, sign on to our accounts again and again (Amazon, Netflix, etc.). NOPE. Just plug it in.It turned itself ON.Updated ITSELF.FOUND my router.Was PRE-LOADED with my Amazon account.We were from box to watching in under 10 minutes (there's even a 2 or 3 minute cartoon TUTORIAL that teaches you everything you need to know to stream & use your remote--easy breezy).Here's a quick rundown of a few features I like:1. The speed of the video loading is awesome, as is the \"intuitive\" search function (Amazon KNOWS what he likes, so his lists are more or less pre-filtered so they load faster).2. When he wanted to try Netflix, he was able to EASILY click to install an app, then I *painfully* used a grid-keyboard to logon to Netflix account (username & pwd) only ONCE and we were DONE.3. The voice search is SUCH a leap forward. It's incredible AND accurate. Can voice search by title, genre, director, actor, everything. And it even understands SOUTHERN. WooHoo!4. It has 4 times the processing speed and 4 times the memory of our previous Roku box & WOW what a difference in loadtime, resolution, quality of picture/vividness of color. Just awesome. What can I say? Amazon did it again.5. Movie/Program descriptions are displayed at the bottom of the screen (& my ONLY quibbling complaint is you can't change the font size on descriptions w/o altering TV resolution, which I won't do). They do have excellent Closed Captioning functionality for those who need it & you can enlarge the fonts there for easy readability.6. Amazon is making constant improvements to the interface, independent of the hardware. In the five months or so we've had this box, we've seen many interesting enhancements. Bravo!Basically, I'm very happy we took the plunge (we bought ours in April); it really was a worthwhile improvement for us (we prefer Amazon's video streaming anyway--they have lots more documentaries than the other streaming services). I'm just sorry I waited so long : )---------Quick Update:Not all apps come preloaded on the device, though a ton of others did (Pandora, Bloomberg, Showtime Anytime, Netflix, Vevo, Vimeo, WatchESPN, Crackle, HuluPlus, iheartradio, and tuneinradio).IF you have an Amazon Kindle TABLET (I'm guessing like the HDX), you can somehow \"toss\" photos from the tablet directly to the Fire. Meaning, sitting in your living room, you can, apparently, swipe the photo across the screen and it \"lands\" on the Fire. (Don't have that, so can't DO that). HOWEVER, we do have many photos saved to Amazon's Cloud Drive & they were all accessible from the FireTV console (via the TV, with just a click)--even a short family video we'd uploaded. With no interference from me. Just clicked on \"Photos\" & there they were. EASY. A very nice feature.----Have a question about the FireTV? Leave a comment & I'll be happy to help you, if I can.", "verified": true, "helpfulness": "0/0", "author": "Amazon Enthusiast \"The Lucky One\""}, {"rating": 5.0, "review": "Thank you for another awesome device, Amazon.My husband and I were impressed with the lack of lag and drop outs while watching movies.  We have 2 of these devices and loving them both.", "verified": true, "helpfulness": "0/1", "author": "GEP"}, {"rating": 5.0, "review": "Yea, it's amazing.", "verified": true, "helpfulness": "1/2", "author": "Patrick Finger"}, {"rating": 4.0, "review": "Nice since I have a slightly older Samsung TV that's not 'smart' and don't have a game console, etc. I would give 5 stars if they could get HBO Go!", "verified": true, "helpfulness": "0/0", "author": "Michelle Miller \"Shelly\""}, {"rating": 4.0, "review": "The fire tv made our tv a smart tv, we love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I don't care what it can or can't do. It automatically let's one star for two reasons. There is no way to skip the condescending video that plays when you first connect it to the internet. There is no off button on the device or the remote, nor is there a shutdown option in the menus.", "verified": true, "helpfulness": "2/12", "author": "Tfuller"}, {"rating": 5.0, "review": "Easy to set up, easy to operate, intuitive. Nice to smarten up a dumb TV.Extensive content has allowed me to see great shows I missed previously. The voice command works well!  This is a really good steaming solution.", "verified": true, "helpfulness": "0/1", "author": "Pickney NC"}, {"rating": 5.0, "review": "My AFTv unboxing experience was smooth except for the horrible, thick plastic wrapping of the included 2 AAA batteries.", "verified": false, "helpfulness": "0/2", "author": "TeamLim27"}, {"rating": 5.0, "review": "I love my Fire TV.  It's a very nice, well built, fast, Android based streaming device.  RF remote is awesome.  Simple to use, small and sleek.  More apps, faster and easier to use than my samsung smart TV.  About the same content as NetFlix, so I wish there was more.  Unlike NetFlix, I can always buy content that is not included in Prime for free.", "verified": true, "helpfulness": "0/1", "author": "Brandon"}, {"rating": 5.0, "review": "Good product and excellent service!", "verified": true, "helpfulness": "0/0", "author": "Gene Bowser"}]