[{"rating": 5.0, "review": "It works great with Netflix! I haven't had much time to do much else with it. It is great to make a non smart TV a smart TV!", "verified": true, "helpfulness": "0/0", "author": "David La Rue"}, {"rating": 5.0, "review": "Works great, inexpensive alternative to being trapped with what your cable/satellite provider programing offers. You have many choices using the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "net.trading"}, {"rating": 4.0, "review": "For the price this is a pretty good deal.Although I wish there were more services that could connect to it.  It's pretty much Youtube and Netflix.It would be 5 stars if my apple movies and Amazon movies would play on it.But all in all I'm enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Gainer \"yahnafahn\""}, {"rating": 5.0, "review": "Love the ease of use of the chromecast, stopped using PS3 for Netflix cause this thing is so nice and easy to use.", "verified": true, "helpfulness": "0/0", "author": "J. Smith"}, {"rating": 5.0, "review": "It was a birthday gift and my sister loved it!!!! We use it all the time to stream netflix movies.", "verified": true, "helpfulness": "0/0", "author": "Marie R. \"Z. Mariedimples\""}, {"rating": 4.0, "review": "Works as its expected to was really bummed to find out that you had to have wifi to use it but other than that it works perfectly. Can't wait till the get more apps out the work with it.", "verified": true, "helpfulness": "0/0", "author": "Ceelo"}, {"rating": 2.0, "review": "This is an undeveloped technology. Difficult to set up and use with few sites really available. Check it out in a year or so maybe it will improve. Concept is interesting. If it weren't such a hassle I'd send it back.", "verified": true, "helpfulness": "0/0", "author": "rams1942"}, {"rating": 2.0, "review": "I bought a Chromecast for one reason: to stream HD quality HBO GO series from my cell phone to my television. It streamed the video (after having to reboot the Chromecast once after setting it up) BUUUUTTTTTT..... it's nowhere near HD. I have high speed broadband (20mb download and 5mb uploads), so that's not the issue. i didnt test netflix or any other streaming service because i only needed it for HBO GO.", "verified": false, "helpfulness": "0/0", "author": "R. Lamkin \"independent filmmaker reviews\""}, {"rating": 3.0, "review": "The Chromecast set up easily and worked well for youtube but didn't stream smoothly from sites such as CBS.  It broke completely after about 6 days.  Google's customer support was good, but the device was broken and they finally said to return it.  It didn't work well enough for me to exchange.  I would recommend if you only want it for youtube.", "verified": true, "helpfulness": "0/0", "author": "Megan Di Maio"}, {"rating": 5.0, "review": "Use for Netflix, works as advertised.  Controlling it from my iPhone is so easy and convenient. May by 2 more for my other dumb TV's in the guest rooms.", "verified": true, "helpfulness": "0/0", "author": "Jason Staudt \"Mosttoyswins\""}]