[{"rating": 4.0, "review": "Overall, it has worked well. Sure is a lot cheaper than satellite/cable. Works great with Youtube and Hulu, still haven't figured out how to order Amazon movies/programming off of it...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little hdmi does a lot of wonderful things and its a must have home appliance.", "verified": true, "helpfulness": "0/0", "author": "Toro"}, {"rating": 5.0, "review": "Absolutely love the chrome cast I received I have been wanting to buy one and I picked this up for 26 bucks back during cyber monday was a great buy, currently at 30bucks on amazon still a fair price. This device does everything I could possibly want, Hulu, Netflix, Amazon, and you can cast your tabs from your laptop only in google chrome as far as I am aware. So you can literally stream whatever you want, there are a few glitches with casting from tabs in google chrome on your laptops, it will glitch a bit on me here and there but i think they are in beta? or something like that.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "I love my  cromecase. It works great.", "verified": true, "helpfulness": "0/0", "author": "Martin Tucker"}, {"rating": 2.0, "review": "it connects but does not keep up when streaming, i figured since this was a google product it would be better than this and i have Android based everything and had high hopes that it would stream as well as they said it would.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "boss"}, {"rating": 5.0, "review": "EXCELENTE", "verified": true, "helpfulness": "0/0", "author": "Daniel Vallera"}, {"rating": 4.0, "review": "Works as expected. Would have liked the shorter HDMI/USB cable that is now sold with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "D.Gray"}, {"rating": 3.0, "review": "Works fine with my iphone and 90% of my movie playing apps. Does not work with the cinemaxgo app for example. All in all it I'm happy with it and it's still better than the old cable-to-the-tv method.", "verified": true, "helpfulness": "0/0", "author": "A. P. Hinton"}, {"rating": 4.0, "review": "Jjust what i wanted ,thanks.", "verified": true, "helpfulness": "0/0", "author": "dale jhonson"}]