[{"rating": 4.0, "review": "I would have given this a five star rating had it not been for the fact that Google's support and troubleshooting leaves a lot to be desired. The product is great, small and compact and the device plugs into an HDTV easily and simply. The price can't be beat! It practically installs itself to the wireless network and even logs into the router for you. Unfortunately getting the device to work after that was not so easy. My wireless network recognized the Chromecast but I could not get anything to broadcast from a Google Chrome browser over my Verizon FiOS network via an Actiontec MI434WR Gen2 router. After wasting hours searching online for a solution I chanced upon a chart at [...] and the last entry solved the problem. Logging into the router and disabling the IGMP Proxy under the Advanced tab made it functional.", "verified": false, "helpfulness": "1/1", "author": "Vivian S. Bedoya"}, {"rating": 1.0, "review": "I ordered a Chromecast 2.5 weeks back and it arrived 2 days early! I was so excited and ripped it out of the box to find the USB or AC adapter required for power. I thought to myself what the heck is the point of having a device that plugs directly into HDMI if I also have to have either 1) USB or 2) AC to power the dang thing. Why not just make a puck like the Roku or even the Apple TV??Meh.. I looked past that and plugged it into my new Sharp 39\" LED TV. All I have to say is once I got it hooked up I was dissapointed. Once again another Google beta project. Sure it has potential. But right now my SMART TV + DirecTV does everything the Chromecast does better. e.g Netflix and Youtube.The Chrome browser integration and streaming is buggy as well. My Wifi network at home is very fast and when streaming from Chrome on my Alienware PC (Wifi Router and TV are upstairs 1 room apart) the video was laggy and quality was bad.Only reason I don't return the Chromecast is because it was only $35.00. So I will hold on to it and see what happens. It's ok though, I forgive Google. I still really love my new 2nd Gen Nexus 7\" tablet.. so wish I could stream the NFL pre-season APP or mirror my Nexus screen with my TV though. May be next year when they release a new version. For now it's a great way to stream Netflix and Youtube if you don't have a SMART Tv or Roku.", "verified": false, "helpfulness": "5/14", "author": "teklovr"}, {"rating": 2.0, "review": "Chromecast advertises that netflix is available. That is not accurate. Netflix online uses MS silverlight which is not compatible with chromecast. So netflix is not able to me. This leave youtube LOL big deal", "verified": true, "helpfulness": "2/6", "author": "William J Flanagan"}, {"rating": 5.0, "review": "Not available outside the US, but with Amazon (and international shipping) it is here and working very well in Singapore.Setting up on an iffy WIFI took quite a bit of time, but when it was all set up, it was a cinch to use, and I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "D. Lye \"DL\""}, {"rating": 1.0, "review": "You get what you pay for, however, in this case not even the 35.00 was worth it..Cast is a horrible little dongle that will show a picture on you TV, but thats about it..It's choppy, freezes and it has a delay..It's going back to the store..", "verified": true, "helpfulness": "4/9", "author": "Alicia DeGregoria"}, {"rating": 3.0, "review": "It is easy to set up provided you have a modern television with usb on the tv.  If I had to plug the power into the wall for the device, I would not use it.The \"airplay\" of the chrome web browser using the (beta) extension frequently showed very blocky video that was unwatchable.I got this for my neighbor since it was cheaper than an Apple TV and she has an iPad to control it.  However with amazon instant video not working yet, I'm still disappointed.  Netflix is good enough for her though so I think she'll be happy.Using an Apple TV in general is much easier for people of any technical level and using airplay from my macbook pro produces much better results and is more flexible than the Chromecast.", "verified": true, "helpfulness": "0/3", "author": "Darla Baker"}, {"rating": 5.0, "review": "I have a Samsung 46 in mounted on the wall.  My wife likes clean no wire look.  The I have a HDMI and USB port right next to each other, so no need to plug this into the wall.  My wifi router is on the same floor on the other end of the house (30' away) The Chromecast works great on Netflix and You Tube using my phone or tablet.", "verified": true, "helpfulness": "1/1", "author": "Gary A Okula"}, {"rating": 4.0, "review": "It would receive 5 stars but ...... Support for Chromebook?  Doh!So long as it works as well as it does with all my other devices I won't complain further.Shipping was forever, so if you order hold on tight...it'll be awhile.Beyond that ... Love it!  Shipping and Chromebook issue brought it down a star.", "verified": true, "helpfulness": "0/0", "author": "MB"}, {"rating": 1.0, "review": "I thought Chromecast was going to be great.I bought Chromecast to upgrade the Android stick that I currently use.  I thought that Chromecast would relegate my AppleTV to the never use anymore pile.Unfortunately, out of the box there were problems.  I wasted a lot of time trying to get Chromecast to connect to my modern Linksys router.  Chromecast does not have a USB slot to connect a wired ethernet adapter like my Android stick.  I thought my problem had to do with WiFi reception.  Instead, it turns out that Chromecast does not support long passwords!  Google this for the gory details.  I have not seen a basic problem like this in quite some time.My choice was to then change the password on my many devices or get another router to only work with Chromecast.  So I pull an old Apple Airport Express out of the heap and setup another network with a nice short password that Chromecast will like.  Unfortunately, I will have to switch my Google phone and Google tablet to this separate network every time I want to beam something to the Chromecast.Unfortunately, another problem arose.  The Google Nexus 4 and Google Nexus 7 won't connect to this new network.Searching around, I find a Google Chromecast FAQ saying that they have a problem with Airport Express and to downgrade the firmware!Ok, I just want to get something to work so I pull out my laptop and install the Chromecast software.  I then switch the laptop to the Chromecast-only wifi network and I finally see some YouTube video on the TV.Unfortunately, there is no sound!What a hassle at this point.  Talk about an out-of-the box experience.  Is Chromecast another Google \"beta\" headed for early retirement?So I call Google Support which is conveniently 24x7.  Unfortunately, their technicians are not really well trained and have never heard of the password problem or sound issue.  They aren't allowed to Google the web to even understand the issues.  They don't have 2nd level support to escalate the problem to senior people.Until these basic issues are fixed the Chromecast is just a pretty screensaver on one of my HDMI inputs.AppleTV remains the workhorse and the Android stick that I bought on Amazon is 2nd choice.", "verified": true, "helpfulness": "154/199", "author": "eHawk"}, {"rating": 5.0, "review": "This device is easy to set up and use to wirelessly link my laptop to Panasonic TV to watch MP4 videos from the vastly improved Chrome browser as well as Redbox and YouTube.  My Nexus 7 (2013) also works great using this device.  The Kindle Fire HD 7 I had, not so much.", "verified": true, "helpfulness": "0/0", "author": "WiCkEd LeStEr"}]