[{"rating": 5.0, "review": "We've had chromecast for over 2 months now, it's been fantastic.Loved it because I could stream Youtube videos from my phone to the TV (even queue up a bunch at a time and they play through automatically, same with Plex (for Plexpass Users) and Netflix (Sadly the Netflix app isn't the best it could be, I can't just queue up a whole season of a show, or anything for that matter). Set-Up was really simple.We have a Roku but since joining Plexpass we now no longer need the Roku at all. Chromecast is less money for even better functionality.", "verified": true, "helpfulness": "0/0", "author": "Mariel A."}, {"rating": 5.0, "review": "It speaks for itself,  works well and Google tech support is able to resolve any issues. This was a good buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought one of these thinking I could stream photos and videos from my iPad , not. False advertising. This is a complete waste of money, go with roku or Apple TV .", "verified": true, "helpfulness": "0/5", "author": "John H. waldorf"}, {"rating": 4.0, "review": "I appreciate the need for brevity when it comes to computer related things, but a simple specific example whould have saved me 30 minutes or more.  Working great now.", "verified": true, "helpfulness": "0/0", "author": "G. Warren"}, {"rating": 4.0, "review": "This is AMAZING with Netflix or Youtube from an android Fast enough, beautiful quality, and surprisingly easy on my phone's battery. Really really stellar. However, it's very taxing from a laptop with streaming web content (it's a bit too much for my Core2 Duo Macbook Pro - not current, but not a slouch either). The number of apps and streaming formats it supports is disappointing, and if you're on a laptop, there's considerable delay (5+ seconds). The audio is great from the TV but not the lappy speakers.Essentially you have to embrace its limitations. It does a few things really well, and a few things aren't ready for primetime. It'd be nice if support were more common (the NBC Olympics app for instance) OR there were an Android feature that let you stream more things.", "verified": true, "helpfulness": "0/0", "author": "Kellen K Flanigan"}, {"rating": 4.0, "review": "Since I am new to the world of streaming, I was looking for something easy to install and use.  The Google Chromecast satisfies this requirement.  Granted, I'm still learning but for something to get started, I would recommend this devise.  Of course I know nothing about privacy and how protected I am, I will be careful to keep my info to a minimum.", "verified": true, "helpfulness": "0/0", "author": "Danny Jay Hostetler, Sr"}, {"rating": 2.0, "review": "All the favorable ratings may have more to do with the luck of the draw than robust plug-and-play performance.  Having a compatible wireless router with the right configuration seems to be essential.  My older generation router has the recommended communication protocol listed on the Chromecast setup website, but it wasn't on the list of routers that might be reconfigured to work with Chromecast.  This situation is not obvious from the promotional material but is learned belatedly from the Chromecast setup website.  Because my installation was successful to the point where my laptop and smartphone were recognized but not connected, I'll give it two stars.  Not wishing to buy a new router or spend hours troubleshooting the one I have, I've decided to return the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "J. Beverley \"quality freak\""}, {"rating": 5.0, "review": "Works really well.  I'm a complete novice at this \"tech\" stuff.  But a very nice young man (compared to me- everything is relative you know) had it connected up & running in not time.", "verified": true, "helpfulness": "0/0", "author": "Patricia R."}, {"rating": 5.0, "review": "I have other streaming devices, this is a a great device, more app connections being added all the time, great price!", "verified": true, "helpfulness": "0/0", "author": "joel huebner"}, {"rating": 5.0, "review": "This little device is the answer to my prayers.  I have been dreaming about something like this for the last decade, and it's finally here!  I use my Chromecast (there's actually one hooked up to every TV in the house) mostly to stream my personal media via Plex.  As of the writing of this review, you still need to be a Plex Pass Subscriber ($3/mo. or $29/yr. or $79/life) for this to work, but it should be rolling out as a free feature soon.Can you do the same thing with a Roku or Apple TV?  Yes.  But I enjoy this more because:Price - at $30, I can get 3 of these for less than  the Roku 3 or Apple TV.Remote - Not one.  I use my iPhone, iPad, wife's iPhone, whatever is around.  No little tiny remote to lose (or chase the kids around the house).Size - So small it stays behind the TV.  You can't even see it.  No additional box to clutter up my room.Shipping was beyond fast (via Prime) and packaging was remioniscint of an iphone/ipod.", "verified": true, "helpfulness": "0/0", "author": "D. Finholt \"CaptFinny\""}]