[{"rating": 2.0, "review": "I did not like it, Everything you want to watch you had to pay for it, Plus you have to pay 99 dollars for the box, It was fast but that is all.", "verified": true, "helpfulness": "2/10", "author": "z.guy"}, {"rating": 5.0, "review": "It's so simple to hook up - starts immediately. So many movies, so many t.v. shows, so many everything! Love it!  Now if the only thing it would also do that my KF Tablet does is allow me to read books on my t.v. screen (or whisper-sync and read the books due to the speakers with the TV system)  - then I'd give it ten stars!  The nice thing also is that with Prime - there are so many 'old' shows on that perhaps were missed due to watching a baseball game or BBQ with the kids and you never got to see the pilot of the show and it didn't tape on the VCR and you are still wondering today for example what happened to JREwing or why did the aliens invade earth or Mr. Selfridge start a store in the first place? Now you can go back and see! Plus KFTV has all the latest and greatest movies and programs as well! Love Amazon, it's service representatives and it's products!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Recieved the Fire 5 days ago....pros: voice function works fine.Cons: Even if you are a Prime member there is very little free movie content; If you want to figure out what movies are free with Prime you should first look on line (if you don't want to waste even more time) as there is no way to tell on Fire (at least that I have detected) without first clicking on a desired movie whether or not it is free: took them up on a free month of netflix but that stopped working after one day of use; I have a subscription to Showtime with Time Warner but despite spending much time and effort in trying to get the Showtime app to work on Fire it has thus far been a failure.Bottom Line: Perhaps some of these problems are due to pilot error and I will give it a couple more days but I am probably going to return this item and ask for a refund.", "verified": true, "helpfulness": "5/9", "author": "james mindell"}, {"rating": 4.0, "review": "I've had experience using Roku, Apple TV, Samsung smart TV apps, Plex on Mac Mini, etc. With obviously much better specs than any of it's competitors, this is by far the fastest interface out there.PROS:- Super fast and best looking UI- Easy instant setup (already signed in to your amazon account out of the box)- Runs PLEXCONS:- A lot of the Prime Instant movies are horrible are hard to avoid browsing through- Movies and shows that aren't Prime eligible are ridiculously expensive ($20+ for some titles)", "verified": true, "helpfulness": "2/2", "author": "David Traver"}, {"rating": 5.0, "review": "Supper simple to set up, and when done it goes to sleep! Lot of movies to see. Not sure at this time about those I would have to pay for, but that is not a major problem yet. High quality picture ect.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, but need shows like JAG, NCIS, NCIS La, and White Collar to be streamed free. Hopefully this will change soon.", "verified": true, "helpfulness": "1/2", "author": "Kenneth L. Marsh Jr."}, {"rating": 5.0, "review": "Just received it two days ago.  What a great addition for Amazon Prime members.  The programs made available from Prime make this an opportunity to turn off some of my satellite premium channels.", "verified": true, "helpfulness": "0/0", "author": "Barbara D."}, {"rating": 5.0, "review": "Received my Amazon Fire TV box on Friday and by Saturday afternoon I had everything hooked up, figured out and was watching some of my favorite TV shows.  Frankly, this thing is the greatest thing  since sliced bread for ease of use and hookup.  I plugged it into the wall and my smart TV, located the setting on the TV for the Fire and signed onto our wireless internet.  In minutes I was surfing free ( I have Amazon Prime) videos and making a watch list.  That easy.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Amazon Fire TV has too few compatible apps. No vudu. Does support Netflix, Hulu, and, of course, Amazon, but not much more than that. Maybe because it's in early phase. Amazon needs to get more apps on board to be competitive.", "verified": true, "helpfulness": "2/3", "author": "Amanda Barrow"}, {"rating": 5.0, "review": "I couldn't make Ruku work with my wireless system. This is a breeze and easy to set up. I am already a Prime member so I have unlimited movies at my finger tips.", "verified": true, "helpfulness": "0/0", "author": "Nancy E. Hodson"}]