[{"rating": 5.0, "review": "I connected it to my TV then followed the simple instructions. It took some time to download the update but that's because my ISP is slow. Within a very short time I'm already watching movies. I have to say I was surprised at how easy it was to set up the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 5.0, "review": "I bought this because I wanted a reasonably priced box with the power to run Plex. This box and Plex have far exceeded my expectations. It is solidly built, small and just works. I had to play with settings initially to get things working the way I wanted, but once done is now a little work horse.I highly recommend this unit especially for the Plex app which is awesome...........", "verified": true, "helpfulness": "1/1", "author": "Dennis Conley"}, {"rating": 4.0, "review": "I don't know what I was really looking for from Fire TV. I already have an Xbox 360, Xbox One, and Ouya all hooked up at home, but I'm a huge fan of Amazon products, plus Amazon's first party effort in gaming is far superior to its set-top box competitors (Apple, Google, Roku). So I purchased the Fire TV with the game controller and I've been toying with it over the past week! Here are my impressions:+ Clean, easy-to-navigate interface+ Voice search works well+ Relatively easy to sideload Android apps (for those who are inclined to do so)+ Some really solid launch games (mostly carryovers from Kindle products) like Fire-exclusive Sev Zero, Minecraft, and Walking Dead, but...− There aren't many truly compelling games, and the sold-separately controller required to play some of them is a bit awkward to operate− At launch there is a lack of some apps consumers may want, such as HBO Go and a web browser− Inoperable USB port− Only 8 GB of memory (I believe about 5.5 GB is usable), mine filled up FASTRight now, I can undoubtedly say the Fire TV is a nondescript little black box that packs a tremendous punch. However, if you already own a current-gen game console, Apple TV, Chromecast, or a smart TV, it might be wise to hold off on purchasing for now, only because the Fire TV is not really ground-breaking enough at this point to do a whole lot more than what you already have. If you've held off on a set-top box or smart TV this long though, the Fire TV is a no-brainer. Personally, I think it will gradually get better as Amazon adds more capabilities to the device with future software updates. And if Amazon follows through with creating must-have first party video (a la Netflix) and game (a la Xbox) content, this product may truly set the market ablaze.", "verified": true, "helpfulness": "2/3", "author": "Matthew W Buckley"}, {"rating": 5.0, "review": "I will have to say that the Amazon Fire TV is a fantastic device and I’m surprised by some of the negative reviews. First let me say I also own a Roku 3 and Apple TV so I am fairly familiar with the other major players in this space (Google who?). This device is comparable to a Roku and actually in my opinion much better (Not a fan of the current Apple TV at all).Setup to streaming literally took minutes. I’m a Prime member so it came already setup with my account information. Yes there was a software update but it could not have taken more than 3mins to complete (I guess all the people complaining need to upgrade from Dial Up service). I was also very impressed by the overall layout of the menus and the blazing speed at which it loaded content.Yes Roku has HBO Go and Amazon does not but to me that’s not a major deal (again I also have a Roku). A lot of reviewers laud Roku’s larger library of available channels but outside of HBO Go, Netflix, Amazon, Hulu, and perhaps Crackle the other channels are B-list at best (no offense Kung Fu Channel). The voice search is ok but will be better once they integrate it for use across streaming channels. Games are a nice add as well, I don’t have the game controller and so far using the remote is fine.So, Amazon provides a near flawless setup, menu interface, and channel options. Not to mention very fast load times and integration with your Amazon Kindle Fire (if you have one, I don’t).  The only problem is not having enough hours in the day to watch the programming it offers!", "verified": true, "helpfulness": "2/4", "author": "Brian Siegel"}, {"rating": 5.0, "review": "I am very happy with my Amazon Fire TV.  It was very easy to install...literally plug in and go.  It runs with ease.", "verified": true, "helpfulness": "1/1", "author": "Whispa"}, {"rating": 5.0, "review": "So I ordered this and have been very happy with it.  Straight out of the box I had issues downloading a mandatory update, it took a few tries.  It really seemed to come down to not liking my connection speed which is only 1mbps (that is the best I can get in my area).  After that it was no issue, it does seem to handle my slow connection speed fairly well.  Picture and sound were good as well.Pros:Already came preconfigured with my accountSmall and sleek very easy to hide but not necessary.remote small, sleek, and easy to useHandled slow connection very wellAndroid based so integration of existing android apps will be quickly adaptedCons:No phone app to make phone a controllerVoice Search only searches Amazon contentAccessing local content can only be done via another app i.e. Plex", "verified": true, "helpfulness": "0/0", "author": "w33mhz"}, {"rating": 5.0, "review": "This was my first experience with a streaming device.  I bought this because of the advertised simplicity of the system.  It is actually simple.  I plugged it into my TV and it loaded everything automatically.  The voice search feature is amazing.  If you are retired like I am and want something simple, I recommend this device.", "verified": true, "helpfulness": "1/1", "author": "James E. Ferguson"}, {"rating": 4.0, "review": "I feel it needs an instruction or information booklet aside from the quick set up pamphlet. I also feel that the home button should have a log off or turn off feature to it.Need more current movies on Prime. Lots of old movies available.Love the TV shows.I would like a chat feature on Amazon web or on fire box to be able to ask questions about the features, like when i didn't mean to order a movies or when the kids dropped the remote in water, that kind of thing. Like having it alot though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I could be exaggerating,however it is the best that I have! Set up was extremely easy, and I started using it immediately! I have not tried everything it has to offer, but so far very happy. The easy of mirroring my kindle fire HDX for YouTube and other's is truly simple.", "verified": true, "helpfulness": "0/1", "author": "Happy Robb \"Robb\""}, {"rating": 5.0, "review": "So far so good! I have watched a few movies but wish more were free with the \"Prime membership\" so don't be confused thinking if your a Prime member everything is free. But the remote works flawlessly, the video is great, and the selection of content is beyond my expectations. I don't have cable and really don't need it with my Fire TV box.", "verified": true, "helpfulness": "0/1", "author": "jphill11"}]