[{"rating": 5.0, "review": "Arrived as promised and works well apart from a few glitches now and then can highly recommend this for anyone who uses YouTube a lot", "verified": true, "helpfulness": "0/0", "author": "Alameda Frank"}, {"rating": 5.0, "review": "We love the simplicity of this device although we do not use it as much as we first thought we might. Most Amazon Prime and Netflix movies and series get watched on our Kindle Fire or laptop.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It came and I opened it up and installed it without problem! I had some problem understanding how to connect so I called the Google support number. They were great and walked me through the entire setup!!! I LOVE IT!!! I bought a smart tv at the same time and took it back because the google chromecast worked better!!!!", "verified": true, "helpfulness": "0/0", "author": "Matthew Walters"}, {"rating": 2.0, "review": "I hesitated about writing anything negative about Google least they cancel my GMAIL, Google MAPs, and other good and free services.  But, this is not as good, at least at this time, as my ROKU.  I have 3 TVs in different rooms.  I started several years ago with an early ROKU and that worked okay.  About a year or so ago, ROKU updated their hardware.  For about $100, I ordered one and it was greatly improved over the original.  I mostly used Netflix, Pandora, and several other free movie and recipe channels.I thought my wife would like to have this capability in another room so I ordered a second, newer, ROKU.  I hooked it up to a TV that also had internet capability.  So, maybe, for my usage, I didn't even need the second ROKU.  The Google went to the third TV and I thought it was cheap enough to give it a try.A problem with all of these devices is that users who are \"less than technology savvy\" may have a problem using them.  First, you have to switch the HDMI input from cable to ROKU or Google.  Then, you have to know how to navigate ROKU or Google.  My wife and I got into big fights when I tried to teach her how to use these devices.  Maybe I'm not a good teacher or maybe I'm lucky that our toilets have only one knob.  In any case, my wife can't and won't use either the ROKU, the Google, or the internet TV capability.That said, what is the difference.  My internet-connected TV works okay for Netflix and a few other apps.  But, it seems hard to use and limited.  The Google has only a FEW apps and many want money every month.  So, I found that the only Google apps I would use would be Netflix, Pandora, and YouTube.  Basically, I'm cheap and don't willingly pay for anything.  Netflix is a rare exception.On the other hand, ROKU has literally hundreds of channels to choose from.  Some, of course, are pay for, but, many are free.  Some of the free ones you surely would not like.  But, still, there are many more choices.Lastly, the ROKU comes with a simple controller and the Google does not.  In my case, I control the Google with an IPAD, but this can be a challenge at times.  I think that Google will improve in the future.  But, if you want something now, pay a few more bucks and get the ROKU WITH A CONTROLLER.  I see that ROKU is offering \"sticks\" so they can compete with the Google, but I still like having a separate controller.P.S.  Google, I still love you, but this product needs some attention.  Please don't cancel my GMAIL!", "verified": true, "helpfulness": "3/4", "author": "G. Linn"}, {"rating": 2.0, "review": "Will not work properly with Galaxy Note 2014.Looks pretty.Starts then locks up.  It may be just the problem with compatibility, but that doesn't help me.", "verified": true, "helpfulness": "1/1", "author": "J. Brown"}, {"rating": 4.0, "review": "Pros:  Great price. With promotion, discount I paid under $9 for the Google Chormecast from Amazon.com.  Easy to use. Just plugNplay in no time. My wife, who never wanted a smart phone in the past, now falls in love with both her Galaxy Note 2 and this Google Chromecast.  For average users, this will be great payoff even one ends up paying full price ($35 + tax & maybe with shipping). It buys them piece of mind with nowaday technology races that sometimes create more confusion than convenience.Cons:  More of suggestions than Cons. I wish Google offers more channels. Even including Google Chrome web browser would be a big PLUS. If it's not for my wife and kid to cast Youtube videos quickly and easily, I prefer to hop on my Roku 2 XS, which offers much more channels and Youtube videos casting through Twonkybeam. It's the reason I take one Star off my rating. Great job Google but there is still room for improvement.Alternative:  Look at the recent Roku HDMI stream stick (2014 version) at $49 on Amazon.com. It includes Youtube (finally).", "verified": true, "helpfulness": "0/0", "author": "Huy D. Phu"}, {"rating": 4.0, "review": "Its Simple, Easy and Great. Just plug it in, link your device and stream your videos directly to your TV", "verified": true, "helpfulness": "0/0", "author": "Roger T. Morrell \"RT Morrell\""}, {"rating": 5.0, "review": "Overall a tremendous advice. Can't wait until more is available for it, though. Also, would be good if it worked better on large networks. (for an office, etc.)", "verified": true, "helpfulness": "0/0", "author": "Matt Bower"}, {"rating": 5.0, "review": "Took a little setup to work with movies i had on my computer. I've been using Videostream with only a few hiccups. Great to have laptop content on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"melanie\""}, {"rating": 5.0, "review": "Very easy to set up.  Allows streaming of programs via my computer to my living room tv.  Much better than the Vizio CoStar I had previously.", "verified": true, "helpfulness": "0/0", "author": "Bruce Wilkinson"}]