[{"rating": 5.0, "review": "I saw an article regarding this Google Chromecast HDMI Streaming player so I went to Amazon to get more information. It got good reviews so I ordered it, as did many other people. It was on back order so it took some time for it to arrive. When it got here, it was easy to install and works great.", "verified": true, "helpfulness": "1/1", "author": "mdgoose"}, {"rating": 4.0, "review": "Shipped early, performs as advertised, easy set up/install.  Needs more content providers - that's the only drawback.  I really like it and would recommend it.  I think they will expand the content providers along the way.", "verified": true, "helpfulness": "0/0", "author": "B. M. L. Gregory"}, {"rating": 5.0, "review": "So glad I ordered this on the day it was first available directly from Amazon to import to UK shores. I got such a good deal considering the price hike now. I paid $54 which included everything from delivery to import fees and the delivery came within 5 working days from placing the order. Very impressed with the speed of delivery!The item itself. Definitely worth the price. Picture quality for netflix and google play movies is top notch. Streaming videos through laptops chrome browser is a bit patchy but I'm sure it will improve with updates.Overall, I would definitely recommend this gadget!", "verified": true, "helpfulness": "0/0", "author": "Warren \"Waza\""}, {"rating": 5.0, "review": "My 14-year-old grandson talked me in to buying this. It works great! Easy to use. Great find, would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Dr. Shirley"}, {"rating": 4.0, "review": "Slightly challenging setup but once setup easy to use. More app availablity is needed to make this product fully worthwhile. Great price point.", "verified": true, "helpfulness": "0/0", "author": "iceberg945"}, {"rating": 5.0, "review": "The chromecast has great pontential. I'm looking forward to having more options on apps, currently it only has netflix and youtube.", "verified": true, "helpfulness": "0/0", "author": "Ethan Bell"}, {"rating": 1.0, "review": "I cant use it in My country Argentina because Apple Store doesn't have The app For my iPhone! Dont like", "verified": true, "helpfulness": "3/5", "author": "marcelo steiman"}, {"rating": 5.0, "review": "For the price you can't beat it! I stream netflix/youtube from my phone(galaxy note2)/ipad/computer to my screens and can still browse the web. I'm actually streaming Netflix as I write this review! Once Google has the cast feature for their mobile browser this will be the keystone for whole-home entertainment.  Image quality is great. I stream to my 110\" dlp 1080p projector screen and it is as clear as any other input I have. Web browsing on this screen is just unreal!There is no question about this product... Buy it!", "verified": false, "helpfulness": "0/0", "author": "johnny"}, {"rating": 3.0, "review": "1) Chromecast player DOES NOT support the 5GHz band. If you want to use it, you must have a wireless access point running in the 2.4GHZ. with all the trash and interference Put mine on 5 GHz and Chromecast can't find the network.2) While Hulu Plus may be supported, it's not with the Hulu plus IOS client as of the date of this writing. If you want to use it you have to cast from the Chrome browser.3) Quality has been very good casting from iOS (iPhone 5, 7.0.2). Casting from the Chrome Browser on my MacBook Pro, i7, 16 GB Ram, 1GB Video ram has been a mixed experience.As other reviewers have noted, if Apple's AppleTV is a hobby, this device is even more so at the current level of support. It's not a Roku (which I also have). That said, it's small, very portable, cheap, self powered as long as your TV also has a USB Port, and useful to take with when traveling. I'm not sending mine back.", "verified": true, "helpfulness": "0/1", "author": "Savvy Engineer"}, {"rating": 5.0, "review": "So coolif you have a tablet or phone. Doesn't work with Chrome OS yet. It does display web pages on Chrome OS. For a PC it must be on wireless. Smooth playback with no queue problems. Easy setup and easy control.", "verified": true, "helpfulness": "1/1", "author": "V. B. Biggar \"master_finesse\""}]