[{"rating": 5.0, "review": "I can just literally stream any chrome tab to my tv really easily. Any flash video from any website will just instantly show up. It's so simple I don't know how it was only thought of now. Highly recommend especially for the price, it even integrates with things like netflix and youtube", "verified": false, "helpfulness": "1/1", "author": "Kyle \"cylem\""}, {"rating": 4.0, "review": "It works essentially as advertised. The only major issue is that computer has to be connected via WiFi, this goes counter to what the page advertises. \"Easy setup: Plug into any HDTV and connect to your home WiFi network.\" I see no reason why the Chromecast can't handle streaming video from any computer connected to the network. This doesn't really affect those who use tablets, smart phones, and most (if not all) laptops. But for desktop users who would more likely have only a wired connection and not have a WLAN adapter this would be a problem. If you can do it with a computer remote phone app, I don't see why Google couldn't figure it out. As it stands the Chromecast program for your computer is just a glorified configuration manager. Using it like a server app or as an A/V broadcaster would be great.With that in mind it does as advertised, it works, and it's relatively simple to set up. It's in no way a game changer, if it could stream the video output from your computer like you would by plugging in an HDMI cable into your monitor or TV then it'd be a great device. We can only hope that Google does an update to it's Chromecast program that enables this.*****EDIT: After some more tinkering I am partially wrong. The Chrome browser extension has an \"experimental\" share screen feature. This will share your screen but it will not share audio. Also, once the browser extension has been connected via WiFi you can disconnect from that and then use your normal wired connection. The Chromecast program still requires the WiFi connection on start up, but once it's started it will be fine with the wired connection. It looks like the Chromecast extension in Chrome is in \"Beta\" so hopefully some better progress there. You will STILL need a wireless connection from your computer initially it seems, but you can get a cheap $10 - $20 wireless adapter thumbdrive easy. If I can I'll be updating this from 3 to 4 stars, but my initial assessment is still the same. This is not a game changer.", "verified": true, "helpfulness": "1/1", "author": "neoritter"}, {"rating": 2.0, "review": "Not ready for prime time.  The chromecast will not work if you have a hidden ssid.  On the phone with support, yes google actually has a support number, for about an hour.  Chromecast would not work until I unhid the ssid, which I will not do permanately.  Also I connected it to a 55\" LG tv and could get no audio to play on it, connected to a generic brand 20\" tv and I got sound.  If your network broadcasts your network name it will probably work.", "verified": true, "helpfulness": "0/0", "author": "BRef"}, {"rating": 5.0, "review": "excellent gift for my brothers, fast shipping. I hope my brothers enjoy for christmas, it is kinda early but who cares.", "verified": true, "helpfulness": "0/1", "author": "daniel martinez"}, {"rating": 2.0, "review": "Used it for Netflix and a movie would play for around 2 to 4 minutes before quitting. It did this several times. I check with Chromecast web site about this and they are aware of this problem. I have returned it and bought a Roku which works great. No problem watching a movie with it.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 3.0, "review": "The problem with this purchase was, we were not given the free subscription to Netflix that was promised in the promotional literature.", "verified": true, "helpfulness": "0/2", "author": "Delta-Wye"}, {"rating": 3.0, "review": "This device has a lot of promise. Right now though, it works with only a handful of apps. The biggest thing it is missing, and the reason I bought it is, it looked like it would stream anything from your android, ios, ipad or computer. It does not and I am very disappointed.I am keeping it because it was $35.00 and I believe it will get there.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great! Just know that right now there aren't too many compatible services. I really wish Amazon would finally add Instant View to Android and Chromecast, and not just Google TV already, but there are some great apps like HBO Go, Netflix, Google's services, Hulu Plus, and Pandora (check Google or Wikipedia to see a full list of services working on Chromecast apps). If you're willing to wait it out, Google has pretty much promised more content providers on the way. These things just take a little time.Also, this thing is cheap as all heck. If this dongle can cast services you already pay for, or services you want, then by all means you should probably get this instead of a more expensive option like Roku or Apple TV. Each device has pros, cons, and limitations, but a $35 price tag is hard to beat.Plus, this thing has a lot of potential once it is opened up. It runs on a strange intersection between Android and Chrome OS, but once the software is fully open to developers, you can be guaranteed a lot of extra functionality. Especially if you have any Android devices.In conclusion, even if some apps may not be released for awhile, or maybe even fall through, for what it is, the Chromecast is a big bang for the buck. Subscribers of Netflix, Hulu Plus, and HBO Go will definitely enjoy this dongle.", "verified": true, "helpfulness": "1/1", "author": "LarkhillV"}, {"rating": 5.0, "review": "Bought this at Best Buy for $35+tax. Amazing product! I currently use this for my Samsung Galaxy Note 2. It was fast and easy to set up, and works wonders. Best part is I can still use my phone as normal while the video is streaming!", "verified": false, "helpfulness": "0/0", "author": "MikeWayne"}, {"rating": 2.0, "review": "I am very disappointed in this product. It took about 4 days to get this to work on my television and then come to find out you can only use certain apps with it. If I could I would return it as I could not get it to even work on a hotel television and the app I need it to work with is NOT AVAILABLE. I know this has potential, but I am going to stick with Apple TV for now.", "verified": true, "helpfulness": "1/1", "author": "D.Randle"}]