[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Victor Ramirez"}, {"rating": 5.0, "review": "Ordered my third chromecast. Gave two away as gifts since this is just a fab little device. I use it to cast all my favorite korean dramas from the viki app to my Samsung TV. I watch everything on YouTube on TV too. Easy to setup. I have not had any issues with this device. Hoping they add more apps to use with this.", "verified": true, "helpfulness": "0/0", "author": "Twice Shy \"~N~\""}, {"rating": 1.0, "review": "Save your money and try an Amazon Fire TV or Roku stick....anything but this garbage. I had to mess with it EVERY time I wanted to use it and tech support is laughable.  I would never recommend that anyone buy this device.", "verified": true, "helpfulness": "0/0", "author": "Pamela B"}, {"rating": 4.0, "review": "I really like using the Google Chromecast to stream movies and view stuff from my laptop.  It's crystal clear and pretty cool looking at photos via my TV screen.  I have ONE ISSUE with it: it's constantly losing it's connectivity when I watch TV shows online and have to go from one episode to the next.  Not sure why but it's very annoying.  Sometimes its a whole 20 minutes before I can get my laptop to \"find\" the Chromecast.  And yes I have my laptop less than 20 ft away from my TV.  Hell, it's right up on it and it still comes up that it can't find the Chromecast.  Other than that, I like it and will keep it.", "verified": true, "helpfulness": "0/0", "author": "Elle.A. \"landr70255\""}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "suryakant"}, {"rating": 5.0, "review": "As expected.", "verified": true, "helpfulness": "0/0", "author": "Dave L Hooper"}, {"rating": 5.0, "review": "Very happy thank you so much", "verified": true, "helpfulness": "0/0", "author": "sherry coward"}, {"rating": 4.0, "review": "Item received as described and working as expected.", "verified": true, "helpfulness": "0/0", "author": "Malvin Loaiza"}, {"rating": 5.0, "review": "We love the chromecast so we bought a second for the bedrood.", "verified": true, "helpfulness": "0/0", "author": "Timothy Rickels"}, {"rating": 5.0, "review": "Couldn't be happier with this little thing. I love being able to share with others the things I do on my computer.", "verified": true, "helpfulness": "0/0", "author": "Darlene Clark \"book worm\""}]