[{"rating": 5.0, "review": "Love it! Have had no problems and very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Magic132"}, {"rating": 3.0, "review": "I have broadband and sometimes it works great and others not so great.  It really depends on your internet connection.", "verified": true, "helpfulness": "1/1", "author": "Tammy"}, {"rating": 3.0, "review": "Fast but tries too hard to force Amazon content down your throat. I thought the search would be marvelous, but unfortunately doesn't search all your subscriptions and only gives you back Amazon results.Why would I pay to watch a movie on Amazon if it's included in Netflix or Hulu or another one of my paid streaming services?I miss the Roku and the universal search.", "verified": true, "helpfulness": "0/1", "author": "Ashutosh Kadakia \"Ash\""}, {"rating": 5.0, "review": "Great product, easy to use, with Prime the selection of movies and TV shows are EPIC. Nice job, Amazon!", "verified": true, "helpfulness": "0/1", "author": "JP MC"}, {"rating": 4.0, "review": "great product. loved it!", "verified": true, "helpfulness": "0/1", "author": "Vik"}, {"rating": 5.0, "review": "Something for everyone in the family! We love Amazon Fire TV!!", "verified": true, "helpfulness": "0/1", "author": "Ben"}, {"rating": 5.0, "review": "Excellent its a greath tv work excellent", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I found the Fire TV lived up to it's expectations fairly well. The video quality is very good and even with our problematic internet on Comcast in an apartment building, it holds up playing Netflix with only an occasional stutter. I do like the feature that when there is a stutter, the audio is untouched and stays in sync.  I do wish that Amazon had included the Prime video only selection as it takes longer to find a prime video.  We installed a Microsoft Xbox 360 controller for Windows and have played Sev Zero and Walking Dead. Both do show impressive performance for such a modest device. However, what I did not expect was that the memory to have more than a couple games and a modest selection of apps falls short.  In the case of these games, it means that you can't just flip between a library of them and instead play only one or two favorites  and unload them when you want another.  Perhaps, the Amazon Game Studio could use the cloud to load in content as needed and solve this issue.  It is this reason that I didn't give the full five star rating.  Now one more thing that bugs me, where are the thousands of new games promised in April?  Having bought a controller for $40 for two modest games seems silly now. Please at least pre announce the new ones so we can have hope that the promise of Android Gaming will come to pass on the Fire TV.", "verified": true, "helpfulness": "2/2", "author": "M. K. Bengtson"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/1", "author": "James Edenfield"}, {"rating": 4.0, "review": "Easy to set up, easy to use and a reasonable/good selection.", "verified": true, "helpfulness": "0/1", "author": "Ken L"}]