[{"rating": 5.0, "review": "Easy setup and low cost make this great for anybody with a hdmi port on their tv to stream netflicks, youtube, etc. Took about 3 min to set up. Now I can control netflicks and hulu plus from my phone or laptop. I love it.", "verified": true, "helpfulness": "0/0", "author": "Patricia K McGowen"}, {"rating": 4.0, "review": "but its just too slow for HD tvghosts every once an a whilewhich is way too oftenvery annoyingonly use it to watch you tubebought a blut tooth for the stereo so i don't even google music anymore", "verified": true, "helpfulness": "0/0", "author": "AMAZON SHOPPER"}, {"rating": 5.0, "review": "For $30 or $35, this should be on ANY television that does not have something that streams to it. Or if you already have every TV connected, I would still pick one up for travel. It works well and is unbelievably cheap and compact. Tip of the hate to Google for some pretty fantastic implementation.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 2.0, "review": "First time to write a review for something I purchase. So here goes:I would put the review in two parts one for the product itself and the other is for google's services.The product itself is awesome when it was working.  Stream my Netflix to my tv with ease.  From my laptop, I can play almost all my movie from the chrome browser.  Very handy with the online streaming from the Chrome browser too.  My Chrome cast worked great 2 month then it stopped working and that is where the service part comes.My chromecast just load to the screen with the wallpaper and the logo at the bottom left, no other message, no ready to cast or setup screen.  It only flashes white light. I always plugged in my chromecast to my tv and use the usb ac adaptor that came with it.  Since it is only 2 month old, it is still under warranty so I give Google customer service a call.  After 3 hours of stupid and useless trouble shooting,  He ask things like what kind of tv you using, what operating system and router.  I was who cares about any of that when your device is not loading properly.  It is not fully booted up so nothing will connect to it.  It was very frustrating.  Don't want to be racist or anything but I feel like talking to a india tech with my issue on my computer.  After all the trouble shooting, the customer service person finally put in a RMA request and can't do it himself as this Chromecast is purchase through Amazon and not from Google Play store.  That pisses me off as this is your product, does it matter which authorize reseller sold it to me?  It has been over 3 weeks and I am still waiting for my RMA on my Chromecast.  I can easily buy another one but it is just principle here.  Why should I buy another one when this one is still under warranty?  I did not do anything that broke it.  I just used it as instructed and it failed on its own.  It is a defected device and should be replace by warranty.  Hopefully, I will get my RMA before the end of the year.", "verified": true, "helpfulness": "1/3", "author": "Kenneth Wong"}, {"rating": 2.0, "review": "Unfortunately for anyone who owns a Verizon Fios Router, look elsewhere as it has known issues with that router. Its mostly the router's fault but it would be nice if they warned you since everyone who has verizon FIOS has the same router. The only way to work with the router is to turn it to broadband version which will now allow you to use the internet at the same time which is kind of terrible as it defeats the use of netflix. Also it does not support anything below Windows 7 so vista, xp, etc sorry you are out of luck. I did get it to work from my android to tv when I used a different router but I do not think everyone has access to two routers.The price was nice (29 dollars black friday deal) the idea was cool, just does not work with below windows 7 and with verizon fios routers. Luckily a coworker of mine brought it for 30 dollars.", "verified": true, "helpfulness": "1/2", "author": "Jay"}, {"rating": 5.0, "review": "Perfect for watching any type of video on you television. So easy to use from my Chromebook. Not sure how easy it is with other types of computers.", "verified": true, "helpfulness": "0/2", "author": "Drwdonze9"}, {"rating": 2.0, "review": "We have a Roku and a Wii that allow you to cast already.  We got the Chromecast thinking it would be a nice addition to on of the TV's without those nifty devices.  Without a NetFlix account, or a Google Play account (nobody uses that), all you can do is stream YouTube or your Chrome web browser.  I don't know about you but watching a YouTube video on my TV is not that big of a deal, especially since most of those video's are only a few mins long.What a waste.  Too bad I threw away the box and can't return it!", "verified": false, "helpfulness": "2/5", "author": "Tara"}, {"rating": 3.0, "review": "It's OK...but not real steady on the signal. Probably an issue with distance to the router, but none of my other equipment has this problem. I'll probably try other locations when I get around to it, but I'll stick with my HDMI cable to \"cast\" Netflix and such to the TV for now.", "verified": true, "helpfulness": "2/2", "author": "smartk9s \"smartk9s\""}, {"rating": 5.0, "review": "Netflix on Roku does not pass through captions.Netflix on laptop through Chrome browser to Chromecast passes through captions.Very happy with this little item.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer \"swuzy\""}, {"rating": 4.0, "review": "Chromecast just brought \"You Tube\" back to the big screen.  I have a Roku and PS3 for everything else.  Also love the ability to cast my downloaded videos with out any hassle.  It does get annoying having to change my Nexus7 back to my 2.4 GHz connection.  Come on Google.  Oh and how about casting tabs from chrome, or the lack off from my 7.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}]