[{"rating": 4.0, "review": "Great streaming unit! Very sleek remote and came pre-registered with my account information, which was fantastic. Have only had it for about a week now but everything runs smoothly. Cut my cable bill and now only have internet with the apps that are available with this device. The sleek remote that it comes with has a very nice feel in the hand. The size of the box is very thin being able to hide it away if you want the clean appearance on your entertainment center. Being able to search via voice is a great feature to have and use. The menu is very simple to use showing most recent apps that you have previously used or a movie/tv show that you were watching to pick up where you left off.The only downside that I do not like about this is that when you search it only searches for what it has available within Amazon. Being a product of Amazon that is not a surprise, but being able to pull information from that apps that you have on the Fire TV would be nice since some of that apps you might also be involved in a subscription of some sort.", "verified": true, "helpfulness": "0/0", "author": "Julian A."}, {"rating": 5.0, "review": "everything you need in one little box", "verified": true, "helpfulness": "0/1", "author": "Cody B."}, {"rating": 5.0, "review": "Excellent product couldn't be happier", "verified": true, "helpfulness": "0/0", "author": "gary wasilnak"}, {"rating": 5.0, "review": "Great little device that handles Netflix, Hulu, and Sling. I just wish they would let the USB port be used for attached storage so I can play movies from a portable HD.", "verified": true, "helpfulness": "0/0", "author": "John from OC \"Mustanggamer\""}, {"rating": 1.0, "review": "The picture and sound was excellent and was very easy to use especially with voice command. I was looking for an alternative to my cable provider and was familiar with the Roku device programming. When I connected the fire device to my television I was disappointed to find that almost all the programs including the old programming was pay per episode. Usually the first episode is free after that it costs anywhere from .99 to 2.99 each. This is not a cost effective alternative to my cable company. You'll also still need something else like outside antenna to receive local broadcasts.", "verified": true, "helpfulness": "1/2", "author": "john"}, {"rating": 5.0, "review": "I have had the Amazon Fire TV stick for 3 months now and I liked it so much that I bought the full Fire TV as well. I use the Fire TV as my main streaming service. I have yet to use any games or other apps on it yet. The content is quite large as far as shows. The movie content is a bit lacking. I want to get a game controller at some point and test that out. The music capabilities is a nice bonus. It is a great drop in replacement for the Chromecast if your phone supports casting the screen without the chromecast app, android 4.1.2 does not unfortunately.", "verified": true, "helpfulness": "0/0", "author": "Blrg891"}, {"rating": 5.0, "review": "I received this as a gift from my son. I was skeptical at first. However, after setting it up and using it I totally love it.", "verified": true, "helpfulness": "0/0", "author": "James A. Taylor"}, {"rating": 5.0, "review": "I am impressed with Fire TV.  It interfaces quite well on my new Smart TV,  It is more intuitive for selecting my Prime choices.  I liked Roku, but Fire TV is better.", "verified": true, "helpfulness": "0/0", "author": "Sadie Mack"}, {"rating": 5.0, "review": "Excuse my English, all I'm saying is that this device is simply amazing, I have not seen anything like it, I love it and if I could I marry her. hahaha", "verified": true, "helpfulness": "0/0", "author": "Ramon almonte"}, {"rating": 3.0, "review": "I like the amazon fire tv EVERYTHING EXCEPT THE REMOTE, THE BATTERIES ON THE REMOTE ARE STRAINED IF YOU DO NOT TAKE THEM OUT. This happens overnight, I didn't know at first, I thought it was the device, but when I replaced the batteries, it worked again, so I started taking them out when I was finished watching, BUT SOMETIMES I FORGET TO TAKE THEM OUT THEN the batteries are dead.  This is becoming quite expensive AAA batteries are 4 bucks a pack for two.  I am going to try to return the remote and hopefully amazon will replace it", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]