[{"rating": 5.0, "review": "Great way to watch TV again. I replaced my Apply TV with this new Amazon Fire TV. Really surprised at the quality and ease of operation. I love the voice control.", "verified": true, "helpfulness": "0/0", "author": "Anthony Cascella"}, {"rating": 5.0, "review": "Just set it up today so far so good the set up was very easy.  The streaming is great. This is a much better way to stream then the blue ray we were using. Love the voice search wish they would improve upon that so it could be used in appslike netflix.I think we will enjoy this product .", "verified": true, "helpfulness": "0/0", "author": "ally1"}, {"rating": 5.0, "review": "love it and all the apps are great", "verified": true, "helpfulness": "0/0", "author": "tazgolf"}, {"rating": 4.0, "review": "I have not yet purchased Amazon Fire TV, but am very interested. It may have been addressed in 1 of the over 1,000 posts, but here is my question: approximately how much data would be used for moderate-heavy to heavy usage? Any information would be greatly appreciated! Thank you!", "verified": false, "helpfulness": "0/2", "author": "georgia"}, {"rating": 3.0, "review": "It does make getting around easier, including the voice search which is very nice.  But there are issues with streaming Hulu Plus through it.  Not sure what the deal is but I get constant \"buffers\" wen watching shows on Hulu Plus through the Fire TV.  I can switch and stream Hulu Plus through my Blu-Ray player which sits right next to my Fire Tv with no issues or buffers at all.  I've read other comments stating the same facts.  Is Amazon Fire trying to put a damper on the Hulu Plus service to get people to cancel and go through Amazon Prime?", "verified": true, "helpfulness": "1/2", "author": "J. Thomas"}, {"rating": 5.0, "review": "Amazon really got this one right. The packaging is excellent, setup is a breeze, and using it is very simple. All the Prime shows are clearly marked on the display, so you know right away whether there's a charge or not. Selection is great, and I can use my other accounts as well such as Netflix, etc.Making a wireless network connection was simple. The HDMI and coax for digital audio out work flawlessly.", "verified": true, "helpfulness": "0/0", "author": "R. Sunderland \"hockey/baseball\""}, {"rating": 5.0, "review": "works great and has real good picture quality", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Excellent product.  Easy to set up and use.  Love being able to watch my Amazon Prime movies and TV shows on my big screen TV instead of my Kindle", "verified": true, "helpfulness": "0/0", "author": "Cherita"}, {"rating": 3.0, "review": "The video quality is good and I like the remote.A lot of App's that I want to use are not available on Fire TV. I have to connect another device to get everything I want.", "verified": true, "helpfulness": "0/1", "author": "Craig Sher"}, {"rating": 5.0, "review": "This just supplanted my Apple TV as my go to set top box.  For one thing, the voice search turns out to be unexpectedly useful and accurate.  In fact, the otherwise awful UI (which is still an improvement over Apple's) is completely moot when you can just say what you want instead.Second, it was fairly easy to sideload XBMC on it, which has the rest of what I want in a set top box.[Update, 1/1/2015]After three months, it has supplanted my Apple TV and my miracast receiver as my go-to video playback box.  For things like Netflix, it's so responsive that using my TiVo or Apple TV is painful by comparison.No set-top box is perfect, but this is the best I've found so far.", "verified": true, "helpfulness": "0/0", "author": "Dr. Curmudgeon \"Doctor of misanthropy\""}]