[{"rating": 4.0, "review": "Very nice streaming device!  As others have stated, it would be nice to see only Prime video selections in one of the categories without them being mixed in with everything else when searching.  But overall a very nice product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As odd as it sounds, one of my favorite features is the amazingly beautiful HD screen saver this has.. I've even encouraged my business owner friends to put these Fire TV units in their waiting rooms. :) That's just an extra bonus to all the fabulous features it has!! I love it! I bought one for each of our rooms with tv's!", "verified": true, "helpfulness": "0/0", "author": "Alice S. Thompson"}, {"rating": 5.0, "review": "Wonderful product.  Buying one for the basement and kids room!!!", "verified": true, "helpfulness": "0/0", "author": "Shelle"}, {"rating": 5.0, "review": "I love the new fire box. It was easy to setup and use instantly. I haven't experienced any buffering issues. Great product!", "verified": true, "helpfulness": "0/0", "author": "Christi4105"}, {"rating": 5.0, "review": "Cool", "verified": true, "helpfulness": "0/0", "author": "James Kivior"}, {"rating": 5.0, "review": "Love it. So easy to use. So many choices with prime.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Williams"}, {"rating": 5.0, "review": "I was motivated to try this after the rave reviews and we are VERY HAPPY we did! We have had an Apple TV for 3 years and have been using that for streaming, but when I finally decided to add Amazon Prime, I didn't have a way to stream to our TV. So I decided to give it a whirl after reviewing specs & reviews. It is WAY better then Apple TV, much much faster and has a smooth interface that goes head to head with Apple. The voice recognition totally does work, no joke! We love it. The only thing that is a bummer, is that we cannot stream our HBO Go (yet)  as our current cable provider (Comcast Xfinity) it not listed..I take this as it means it will eventually get on here, but not yet. So for now, I have to go back to Apple TV if I want to stream HBO Go. For the price, I paid only $79, I totally recommend this. I cannot say how much I love it. Plus the prices that Amazon charges for the pay (on demand) movies are cheaper than iTunes.", "verified": true, "helpfulness": "0/0", "author": "M. Chase"}, {"rating": 4.0, "review": "Its very enjoyable.I received one for Christmas. Its addictive . I have such a variety of movies and quite a few I've not heard or seen. It gets a 10 rating from me.", "verified": true, "helpfulness": "0/0", "author": "carla james"}, {"rating": 5.0, "review": "So far it is great!!!", "verified": true, "helpfulness": "0/0", "author": "Darin Cole"}, {"rating": 5.0, "review": "my husband was very happy best investment we make good by comcast cable and welcome to amazon fire world", "verified": true, "helpfulness": "0/0", "author": "chefjazzy"}]