[{"rating": 1.0, "review": "Waste of money, but more importantly time...no idea why I listened to my cousin and ordered this crap. Yep, and there's a return charge of $6...maybe I'll give it away to someone I don't like. Waste their life away...", "verified": true, "helpfulness": "0/0", "author": "Melinda"}, {"rating": 5.0, "review": "Best money spent in years. Integration with apps is fantastic, easy to set up, cheap and works very good with slow connections. Don't even think about it, go for it!", "verified": true, "helpfulness": "0/0", "author": "Maximiliano Martinez"}, {"rating": 3.0, "review": "not using chromecast at the present, using netflix", "verified": true, "helpfulness": "0/0", "author": "herb"}, {"rating": 5.0, "review": "I watch too much TV now with my Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Takmais"}, {"rating": 5.0, "review": "I am currently using this product while I am traveling abroad, and it is great. Watching movies, youtube, etc on the TV vs my laptop or tablet is great. Make sure that you read the instructions. I set it up using my HooToo Elite Wireless Router so it recognizes my internet regardless... Love this thing!!!", "verified": true, "helpfulness": "0/0", "author": "SHADOWDC1"}, {"rating": 5.0, "review": "This little device is absolutely fantastic.  Setup was easy, content loads quickly, and it's fairly future-proof (output up to 4k+).  For those thinking about getting it, know that you need another device to tell it what to do (smartphone, tablet, PC, etc.).  However, most of us have one of these devices anyway.  The Chromecast streams Netflix, Pandora, NPR One, YouTube, Chrome browser tabs, and even local content from a PC.  All you have to do is find the right app and you're on your way.For those that want a more simple solution, Roku works, but it doesn't have the potential of this thing.  Programmers are already finding ways to make it work with all of your apps, in addition to making it a full screen SNES ROM emulator.  All this for less than $50.  As a matter of fact, I picked mine up for $23 new.If you're not afraid of pairing two devices, this is a no-brainier.", "verified": true, "helpfulness": "0/0", "author": "B. Wolf"}, {"rating": 5.0, "review": "Superb product.", "verified": true, "helpfulness": "0/0", "author": "Siddarth K."}, {"rating": 5.0, "review": "Our family has purchased three of these now. They work great and allow seamless Netflix streaming to the TV's. Even my parents (who have no idea what they are doing with technology) have found this easy to use. Apple TV is another option but I just have never veered over into the Apple market. We have no Apple devices since my iPod touch in 2007. You can also stream Chrome tabs to your TV - almost like having a second monitor.", "verified": true, "helpfulness": "0/0", "author": "Kenny"}, {"rating": 1.0, "review": "Its too difficult to use with Apple products, perhaps impossible.", "verified": true, "helpfulness": "0/1", "author": "Dennis J Omeara"}, {"rating": 3.0, "review": "Product arrived on time. Disappointed because it disable itself and I have to connect it to the wifi.", "verified": true, "helpfulness": "0/0", "author": "Eno N."}]