[{"rating": 4.0, "review": "There are some glitches.  Sometimes it doesn't quite talk to Google play all that well.  Have had no problems using with Netflix.  Would love if I could use it for tv shows streaming off the show's website, or for on Amazon, but so far so good!", "verified": true, "helpfulness": "0/0", "author": "Leah Kelly"}, {"rating": 4.0, "review": "My Boss gave me one as a Christmas gift.  After it lay on the table for a month, I finally decided to test it out.  I plugged it up through my Samsung Galaxy tablet this past weekend.  I was really impressed with the HD screen quality while streaming from Netflix, eight episodes of my favorite TV show \"Scandal\".  I watched 4 episodes one day, and 4 the next day, and not once was I disappointed with the steaming.  So far, I've viewed shows only thru Hulu and Netflix.  I have not yet tried viewing thru You Tube, but I'm sure it's great.  I give this only 4 out of 5 stars because I feel that a unit such as Chromecast should be able to view any video from any website, and not just specific websites.  But this is not the fault of the unit itself,  but it is the fault of specific companies trying to monopolize the market so that you can only view video material thru their websites.  But the Chromecast device itself is superb.  I have no complaints.", "verified": false, "helpfulness": "0/0", "author": "Diamond M. Dominguez \"diamon2x\""}, {"rating": 2.0, "review": "Was not what I expected, casting from phone or tablet is not my idea of streaming. I still prefer the Boxee Box that is now gone.", "verified": true, "helpfulness": "0/0", "author": "Tim Cushman"}, {"rating": 5.0, "review": "I use this to stream Netflix to my HDTV via my Kindle.  It works perfectly.  I use it every single day.  You can also display YouTube but many of those videos look like junk so that's what you end up seeing on your TV screen.  I can also stream via my Android Smartphone and it works just as well.  If you want to stream using a PC, be sure you have WIndows 7 or later.  It doesn't work with XP or lower.", "verified": true, "helpfulness": "0/0", "author": "Mike Falconiero"}, {"rating": 5.0, "review": "Works perfect for exactly what it's supposed to do. Easy to set up and transfer from tv to tv! Would recommend to anyone without a smart tv that uses online streaming.", "verified": true, "helpfulness": "0/0", "author": "baysidetigers"}, {"rating": 4.0, "review": "Chromecast to me is a device that has potential, but is not there yet in this period. It is not as easy to use as my Roku streaming player and does not have the programming and ease of Ouya with XBMC. So why buy it? In short, Youtube. It is the best device for youtube, and there are full movies and other content on Youtube that makes it worthwhile. I know that everyone says that more programming is coming, and yes it has trickled in, but only when Google stops controlling the programming and limiting it to its business partners will this really be a dynamic device, IMHO. I have two of them, and I hardly even use them. I do not believe that this device will rule my living  room or bedroom, and unless you have no streaming devices at all or are a Youtube junkie, it will not be the go-to device in your home either.", "verified": true, "helpfulness": "1/1", "author": "komboa"}, {"rating": 5.0, "review": "Works like a charm. Bought this for a christmas gift but ended up keeping a second one for a different television. Now I can choose where I want to send the video.", "verified": true, "helpfulness": "0/0", "author": "Jason Lucas \"Utter V\""}, {"rating": 4.0, "review": "Really easy to setup, it does require changing networks to the device to temporarily start the setup, which could be cumbersome if you are using the same Chromecast in multiple locations.", "verified": true, "helpfulness": "0/0", "author": "EJ"}, {"rating": 5.0, "review": "I now have two of these on two different TVs in my house.  They were easy to set up and go.  I have used it for Netflix and HBO go so far.Very happy!", "verified": true, "helpfulness": "0/0", "author": "PKSmart"}, {"rating": 4.0, "review": "It works for basic apps. Found the packaging misleading a bit regarding 'fully supports iOS.' It does not, only certain apps. But, if you want that buy Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Scott Leonard"}]