[{"rating": 1.0, "review": "Only works with youtube and netflix, there are no options to stream directly to the device/tv just uses pre installed netflix and youtube apps", "verified": true, "helpfulness": "0/1", "author": "Kampaipost"}, {"rating": 4.0, "review": "What it does (Youtube, and I assume Hulu Plus and Netflix, which I don't subscribe to) it does very well.  I wish it did regular Hulu, but just being able to play Youtube videos on the big screen so easily is probably worth the price.", "verified": true, "helpfulness": "0/0", "author": "Mike Van Pelt"}, {"rating": 4.0, "review": "Watching all the Youtube videos on a big screen TVEnabled all my PC and Andrio devices to control my TVGreat price and easy to install", "verified": true, "helpfulness": "0/0", "author": "allen tir"}, {"rating": 5.0, "review": "This is really awesome, i can see movies from my laptop to TV without any disturbance.  Thanks to Google for such a nice player.", "verified": true, "helpfulness": "0/0", "author": "Bhsskara R Kummithi"}, {"rating": 5.0, "review": "Supposed to work out of country - didn't.No solution by phone.Eventually worked it out by convo with a friend.Super device and with \"file manager\" extension you can \"cast\" all HDD files.", "verified": true, "helpfulness": "0/0", "author": "95rpm \"Jas\""}, {"rating": 1.0, "review": "First, let me preface this by saying that I'm a huge android and google fan. I use almost all of their services and have owned google tvs (sucked), multiple tablets and at least 5 android flagship phones (currently the note 3).That being said.. this device is a solution to a problem that does not exist.First, it needs an intermediary wireless network to ride on and communicate with your phone/tablet. This means it's completely worthless for travel unless you bring your own wireless AP, as you'll never get the proper speeds (and likely ports opened) to work in a hotel anywhere.Second, if this is really just intended for home use, there's a myriad of devices that all do what it promises to do, way better. Most modern TVs, rokus, game systems or even blu-ray players have at least the same functionality, if not more. You're limited to about 6 pre-determined apps, like NetFlix, Pandora, Hulu, Youtube, etc. My TV does all of those already, plus it has Plex, HBO Go, etc. If it had screen sharing and let me broadcast anything, then it would be worth somethingThird, it DOES have wifi-direct! but that's only for initial configuration, what a waste.Finally, here was my ideal scenario in which it would fail: On travel for work, have some downtime at my hotel, don't want to watch their TV. Plug this into the HDMI port, connect to my phone which has unlimited LTE data and stream my media from home (plex), HBO Go, Netflix or whatever, without relying on the hotel's wifi. Nope, that's not going to happen with this device.", "verified": true, "helpfulness": "0/0", "author": "AEPOLS"}, {"rating": 4.0, "review": "This device works great for the price. Much less expensive than many of the streaming set top boxes. The setup was easy, Though the directions could have been better at explaining what to do. Audio and video quality is great even in HD.", "verified": true, "helpfulness": "0/0", "author": "Jonathan P"}, {"rating": 4.0, "review": "The Comcast DTA wasn't cutting it, and after 2 units and multiple reloads.....it wasn't getting any better. The CC dongle set up took about 3-4 tries, but finally found my network and away I went. I can use my Droid to pick Netflix programs, but have a Kindle Fire on the way for a bigger screen to work with........Netflix TV series run episodes automatically, and I can always go back if I drift off.....:)", "verified": true, "helpfulness": "0/0", "author": "NWG"}, {"rating": 5.0, "review": "For college students with WiFi, this is a great way to \"get cable\" without having to have a smart TV or a cable subscription. With Hulu, Netflix, and Pandora, this is a quick and easy way to get big-screen entertainment on a budget. I look forward to more capabilities, and the ease of sending items from your smartphone to the device is brilliant.", "verified": true, "helpfulness": "1/1", "author": "Sean P. Harrington"}, {"rating": 5.0, "review": "My original Roku is showing its age and I don't want to spend $100 for the ethernet model. I selected this as my iPad can mirror it -- and I'm not disappointed. For $35, well worth the effort.", "verified": true, "helpfulness": "0/0", "author": "C. Carmichael \"Chris92057\""}]