[{"rating": 5.0, "review": "It's really great product . I like it .It new expierence for me and I will get aunder one as a gift to my friends.", "verified": true, "helpfulness": "0/0", "author": "Maitham"}, {"rating": 4.0, "review": "google chromecast is great. Really easy to set up. Download video apps to your phone and stream to your tv!", "verified": true, "helpfulness": "0/0", "author": "Kieke Gomez"}, {"rating": 5.0, "review": "we've enjoyed chromecast so far. it is quite easy to set up. would recommed that anyone on the fence try it!", "verified": true, "helpfulness": "0/0", "author": "Sweetcove"}, {"rating": 4.0, "review": "Casts from my tablets 2the tv and costs less than Apple TV. It works w/ hulu plus n apps but not the chrome browser for tablets, which kinda sux... I can airplay 2 my Apple TV and use my browser. It is a fairly new item so I,m sure there will b more apps 2 stream n maybe an update or improvement will allow a chrome browser  for tablets , to chromecast to a tv,  hint, hint, nudge, nudge ,nod, nod...............", "verified": true, "helpfulness": "0/0", "author": "Jeff gruetzmacher"}, {"rating": 5.0, "review": "was very happy to receive this order. I ordered 2 and am ordering another! This was a terrific purchase as a gift!", "verified": true, "helpfulness": "0/0", "author": "Momma Tay \"Momma Tay\""}, {"rating": 4.0, "review": "I will recommend this product. This is a good product for streaming media to any TV with a HDMI port.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Marvin Davis"}, {"rating": 3.0, "review": "It is great but we have to restart our phones to get it to work.  We can't just turn it on whenever we want.  I have to re-start my iphone or totally reset the internet to get it to work most times.", "verified": true, "helpfulness": "0/0", "author": "tiffykatmeow"}, {"rating": 5.0, "review": "Great idea w/ a reasonable price point. More & more apps are & will be providing Chromecast support (Hopefully in the near future) according to the reviews I've read.Even if there are no more apps available for casting I'd still be happy w/ the selection that I currently have.Way to go Google!", "verified": true, "helpfulness": "0/0", "author": "Richard Kabureck"}, {"rating": 4.0, "review": "Great item, works pretty well.  Can't wait for more content!  Netflix works pretty well on it, and casting from Chrome, but we need more.", "verified": true, "helpfulness": "0/0", "author": "DanM"}, {"rating": 2.0, "review": "Do not purchase this unless you make sure it will work with your android or kindle. will not work with most and wont work with kindle at all.", "verified": true, "helpfulness": "0/0", "author": "mammie"}]