[{"rating": 5.0, "review": "I have a old LCD tv and did not have any way to connect my Samsung Note 2 with the TV. At the price point, Google Chromecast is a boon. Easy to set up and can connect to the TV's USB port for power - no dangling cables.Upside - Online content or content from Google playstore can be played directly on the large screen TV. Basically, I don't need to buy a TV with internet connectivity anymore.Downside - Does not have apps that plays content / media directly from the phone. Cannot replicate the screen on the TV, so you cannot play games on the large screen. I hope Google addresses both these items soon.At the price point, I don't see why anyone will go for an apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mitesh Kumar"}, {"rating": 5.0, "review": "The Google Chromecast does exactly what it claims fast and easy. I'm hoping more apps are made available, it works so well. The only drawback is that the Google Chrome Web store is not available on all formats in order to use the add ons and extensions for the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "papa george"}, {"rating": 5.0, "review": "Good product,More features are required to take full advantage of the product.OTG cable is need to properly initialise it.", "verified": true, "helpfulness": "0/0", "author": "Clare D"}, {"rating": 5.0, "review": "What a cool gadget, now we don't have to crowd around the iPad when we want to share a funny. Everyone in my house (even the kids) have found no problem with being able to use it.", "verified": true, "helpfulness": "0/0", "author": "Travis B"}, {"rating": 5.0, "review": "I am impressed with this little gadget. I am sure google has a lot more to come this gadget. currently it only does few things. I hope they allow the stream video from external source. With iPad it has very limited use", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 1.0, "review": "I don't get it, how can google come up with the product with these limitation. i can get it to work with my 1 pc but not the other. contacted google support and they claim that chromcast has trouble working with firewall and anti-virus SW.", "verified": true, "helpfulness": "0/0", "author": "JMP \"jmp_industry\""}, {"rating": 5.0, "review": "Buy this, if you have doubts forget them now! Seriously the best money I've spent in a while and no regrets!", "verified": true, "helpfulness": "0/0", "author": "rene bonilla"}, {"rating": 5.0, "review": "This is one of Google's best inventions. I've been using this on a daily basis to stream YouTube and Netflix to my televisions.", "verified": true, "helpfulness": "0/0", "author": "keryx88"}, {"rating": 5.0, "review": "A very simple device, it was easy to set up and get running. My wife who is not particularly tech savvy was able to figure out how to stream Netflix from her phone to the TV using the Chromecast with absolutely no directions from me, which made me happy.My only complaint is that I wish it had 5 GHz networking since I live in an apartment with a lot of 2.4 GHz wireless networks, but I have not had any issues with streaming performance over 2.4 GHz yet. I've had it for about a month now and it has been working great. Sometimes takes a while to start playing, but once it starts I have never had it buffer or stutter on playback.For the low price I am very pleased. Stop thinking about it and just buy one.", "verified": true, "helpfulness": "0/0", "author": "Garrett"}, {"rating": 2.0, "review": "Packaging and instructions were very good, but repeated trials always ended with \"extension failed\".Reassembly made no difference. I am excusing the poor performance, blaming the wi fi signal strength.Does Chromecast have any other uses ?  I was enthusiastic about the original purpose . John B", "verified": true, "helpfulness": "0/0", "author": "John M Birmingham"}]