[{"rating": 5.0, "review": "I love this thing.The instructions on how to work it were very clear, you actually have to download a \"chromecast\" app on your devices, but its totally worth it.Many of the entertainment I is on YouTube, so this makes it so much enjoyable to be able to watch it on the TV.If you use the Chrome browser, you can also chrome cast tabs, which comes in handy when watching something on a site that isn't YouTube.The ONLY thing that seems to not work, is Amazon Prime. It will not display the video on there, which is a bummer, because I would have to hard-wire the laptop to the TV via an HDMI to watch anything on Amazon Prime.But that's kind of understandable, since Amazon has the \"Fire Stick\" which allows you to watch your Prime stuff on your TV.Aside from that, its fantastic, my housemates and I use it all the time to share videos and what not to each other.We love it.", "verified": true, "helpfulness": "0/0", "author": "Ashraf A. Dawod \"Ash\""}, {"rating": 5.0, "review": "Best device for anyone who no longer wants to be ripped off by crummy cable companies. Unfortunately, you still need them for internet. But at least you're not getting as ripped off. I also own Roku and Apple TV (which are both more expensive than this product I believe) and this is by far my  favorite.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "Love it exactly what we needed for movies", "verified": true, "helpfulness": "0/0", "author": "Dorren Morales"}, {"rating": 5.0, "review": "So far, awesome.  I can stream netflix, youtube, and everything else on my screen in HD to a non wifi flatscreen.  Best money ever spent.", "verified": true, "helpfulness": "0/0", "author": "Warren Ellis Jr. \"firehawk6998\""}, {"rating": 1.0, "review": "Not compatible with what I wanted to stream from my iPad.", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 4.0, "review": "great but i need it paired so i can use it on both tvs", "verified": true, "helpfulness": "0/0", "author": "MichaelRettig"}, {"rating": 5.0, "review": "Bought this for my technologically-challenged father for Christmas this past year, and he just loves it. Very easy to set up and even easier to use. He was so excited about it that he actually got rid of the cable & doesn't miss it at all!", "verified": true, "helpfulness": "0/0", "author": "diabia4"}, {"rating": 5.0, "review": "Thos product is great you connected it to you tv and download the app on your fone or laptop or tablet and you can put movieMusic video,or home work but if you juat want the bigger screen it a great product.the only important thing you have to have for this product to work is WiFi. And as for the vendor that i got it from it was a good i got it on time and well for and awesome price .", "verified": true, "helpfulness": "0/0", "author": "Maria S. Suazo"}, {"rating": 5.0, "review": "AWESOME  Everyone should own this", "verified": true, "helpfulness": "0/0", "author": "Maureen M."}, {"rating": 1.0, "review": "I could not get this to work with my Netgear R7000 Nighthawk Router. I tried reconfiguring the router several times following the suggestions on the Troubleshooting site for the Chromecast, but nothing worked. My router is not one of the routers that the Chromecast has been proven to work with.", "verified": true, "helpfulness": "0/0", "author": "mcdanief"}]