[{"rating": 1.0, "review": "iI have a sony KDL-40VE5, and the google chromecast doesn't work on it, i try in another tv ( most recently model) and it works well and fast, so i think i made a bad purchase.", "verified": true, "helpfulness": "0/1", "author": "Hugo E."}, {"rating": 1.0, "review": "don't even think to buy this useless chromecast.i wish i could give this product 0 satrs . DO NOT BUY THIS , SAVE YOU MONEY !GET A REAL STREAMERAGAIN . DO NOT BUY THIS PRODUCT !!!!", "verified": true, "helpfulness": "0/4", "author": "amit"}, {"rating": 3.0, "review": "I saw the commercial on TV, was very impressed, pulled my phone from my pocket and ordered on amazon immediately. If you read ANY reviews for this Chromecast then you know the problems. The commercial makes it seem like you just plug into a HDMI port and start streaming video but there is still the power plug which they do not show you on TV. Also, you are limited to streaming YouTube, netflix, and I think google chrome browser. You CANNOT stream your own personal videos ie from camera phone. Great price and the videos that you do stream are excellent HD quality and it WOULD be 5 stars if it were not the power source surprise after opening the box.", "verified": true, "helpfulness": "0/0", "author": "Timbofittz88"}, {"rating": 5.0, "review": "This is the best purchase I've made on amazon. It plays Youtube, Netflix, and movies from your computer flawlessly. Even if you have a slow internet connection, this doesn't require buffering every 5 seconds. If you are thinking about buying this, DO IT! You won't regret it.The only con I can think of is that there aren't a ton of apps that support casting to your Chromecast yet. I expect that to change in the future. But if you are planning on just using it for Netflix like I do, that's no problem.", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 5.0, "review": "I had a regular LCD TV; then I purchased a smart TV and loved it. So by purchasing the Google Chromcast, I turned my older TV into a smart TV and love it! I now watch streaming video in every room!", "verified": true, "helpfulness": "0/0", "author": "Kev"}, {"rating": 4.0, "review": "Works great most of the time, and I didn't have to upgrade my TV. Setup took a few minutes, but wasn't difficult.It would be 5 of 5 and perfect, except for two little things. Apparently it buffers a bit, so sometimes when I try to control Netflix from my tablet the TV keeps running the show for a couple of minutes. And sometimes there is a momentary glitch, where the sound isn't synched up with the image (someone else told me this happens with Netflix, so it might not be the Chromecast). Would I buy this again? DEFINITELY! Would I recommend it? HIGHLY.", "verified": true, "helpfulness": "0/0", "author": "Ken Coomes"}, {"rating": 5.0, "review": "I GOING TO BUY MORE GOING TO ORDER ONE RIGHT NOW . WORKS GOOD BUT ONLY WORKS IF YOU ARE USING GOOGLE CHROME", "verified": true, "helpfulness": "0/0", "author": "robert freeman"}, {"rating": 4.0, "review": "It's simple and easy to use with Netflix and youtube.  I have an older TV, but the Chromecast is still able to change the channels on its own once you tell it to play a video.I only wish it had 5ghz wifi.", "verified": true, "helpfulness": "0/0", "author": "mrks"}, {"rating": 5.0, "review": "It is Chomecast - do I need to say more??? Cheap streamer. Upon launch, it had just a few apps that supported casting, but now that the SDK has been made official, and released by Google, apps like AllCast allow you to stream even local media! Woohoo!!! Works reliably, every single time. I haven't had to reboot this since I bought it.Note:Doesn't work on 5Ghz WiFi networks - don't even botherCurrently needs the USB power adapter on almost all the devices (not clearly indicated in the advertisement)", "verified": true, "helpfulness": "0/0", "author": "jojo"}, {"rating": 3.0, "review": "I bought the chromecast under the impression that it was going to be able to mirror my devices. I have kindle fires and iPads. Well after setting it up I found out that it only mirrors netflix, YouTube and your chrome browser. I was a little bothered at first but then I remembered it was only $35 and all I really wanted to do was show netflix on my tv and I will be able to do that. I am also worried because i don't think netflix is built in to the chromecast so it won't do anything unless you have a device that has netflix on it. I've only had it a few weeks so I will have to keep playing with it and post an update if I find out something new", "verified": false, "helpfulness": "0/0", "author": "Sandcar13"}]