[{"rating": 5.0, "review": "Fantastic product that is always reliable, almost never buffers, and it was super cheap!Setup was a snap, and once it's done, you'll never need the Chromecast app again, just open Netflix or YouTube and click the Chromecast button, and you're done.", "verified": true, "helpfulness": "1/1", "author": "Ryan Romel"}, {"rating": 2.0, "review": "Where do I begin?  I am pretty disappointed with this product.  A lot of people had some great things to say about it... maybe it was earlier on in its evolution.... I think they've taken away some functionality because of piracy laws and crap.  This thing really doesn't do much. My Sony BluRay player with wifi has TONS of apps and I was hoping for a quicker and smoother netflix interface for only $35.... Nope.... I got Netflix running from using my iPhone, and it looked like 720p!  Then I noticed Google never promised 1080... 720 technically is HD... What a letdown.... Then I couldn't control netflix from my iPhone any more.  The friggin thing went rogue.  I had to physically unplug the Chromecast to stop what I was streaming.  I also tried \"Casting\" from my Computer. Slow and didn't even work most times.  Very Very bad. I am so shocked Google would put out junk like this. Just complete garbage.  I'm not giving it a 1 because at least it was cheap.Pro's:  Cheap  Small, could maybe use for travel?Con's:  Just about everything.  Little functionality, and what is supposed to work doesn't work well  Signal strength very weak.  I have other devices right next to it that have a good signal but not thisOverall:  I'm so sad to see Google put this out... Really damaged the brand in my eyes.  I guess when you're considering mining on asteroids and random stuff like that they've spread themselves out too thin and aren't focusing on making what they do make well.  Sometimes less is more Googy.", "verified": true, "helpfulness": "0/2", "author": "JJ"}, {"rating": 5.0, "review": "You just plug it into your device, and stream things over wireless from your phone or any computer. So totally awesome!", "verified": true, "helpfulness": "2/3", "author": "Elena E. \"shiana\""}, {"rating": 5.0, "review": "Oh my goodness, is this thing ever awesome!  Even though I'm on Linux, which can cause compatibility issues with just about everything, this works perfectly!  Only took us about 15 minutes to set it all up.  Love being able to stream Netflix with zero trouble.  Love saving money on my cable bill even more!", "verified": true, "helpfulness": "0/0", "author": "Constant Reader"}, {"rating": 4.0, "review": "This works really well, my only real issue is I don't have a good use case for it. I expect that will change over time.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey Tschiltsch"}, {"rating": 5.0, "review": "I can't say enough about this little device. The convenience of not having another box, or just being able to find what I want to watch/listen to on my phone or tablet and send it to my TV... For iOS users, it supports Netflix, Hulu Plus, HBO Go, Pandora, and Google Play Music. Being able to play my music on my TV with just a couple clicks on my phone is unbelievable and I plan on buying one of these for every TV in my home.", "verified": true, "helpfulness": "1/1", "author": "Kevin W."}, {"rating": 3.0, "review": "beautiful in Netflix, chrome and youtube, and that's it.....it would have been 5 stars if it worked with other apps, or ALL apps.", "verified": true, "helpfulness": "1/1", "author": "Naticio"}, {"rating": 1.0, "review": "This worked at first, and I really liked it. Went to the bathroom, came back, and it was dead. Google support was absolutely useless. Its Thanksgiving, and I still don't have a replacement. Seriously Google?", "verified": true, "helpfulness": "0/0", "author": "Jack Mayo \"Jack\""}, {"rating": 5.0, "review": "Best purchase ever! So useful. Once all the subtle bugs ironed out by Google, this might end up becoming the most useful product ever. Waiting for other video applications to support this. Especially TED talks app.", "verified": true, "helpfulness": "0/0", "author": "VK \"amazon shopper\""}, {"rating": 5.0, "review": "My first device I bought from Amazon was defective and I decided to give it another try because I heard soon you will be able to mirror your phone to your tv. So i went to best buy and picked up another one and Im glad I did. My previous one had audio issues and this one works perfectly. Setup is easy, just plug it in and run the setup from your computer or mobile device. You are connected withing 5 minutes and start enjoying streming perfect quality video and audio from these supported apps or chrome browser: Vevo, Red Bull.TV, Songza, Plex, PostTV, Viki, Avia, and RealPlayer Cloud, Netflix, HBO Go, Hulu Plus, Pandora, YouTube, Google Play Movies, and Google Music.Developers everywhere are developing new apps for crhomecast. This cheap little device has a lot of potential and will continue to grow. This is a must have simply because of the price and soon it will be a must have for its features.", "verified": true, "helpfulness": "0/0", "author": "WiseShopper"}]