[{"rating": 5.0, "review": "Streaming from my tablet and computer have been incredibly easy.  Once the device is plugged in, you use a supported app and can send it from your tablet to the chromecast through your wifi connection.  The picture is clear and in HD.A few warnings- if your wifi connection is slow and you normally have lags in viewing films on your tablet/pc, you will have the same lags in the chromecast.  It's not the fault of your chromecast, it's your wifi.  Second- It does use your battery a bit to watch/stream the video, so plug in while you are streaming.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow it works as stated! Does not happen often anymore in the world of electronics. Best part about it is it's $35!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Robert C. Loane Jr."}, {"rating": 5.0, "review": "The chrome cast  works just like you said it would,it's a great product! I'm going to save a bundle. Thanks a lot.", "verified": true, "helpfulness": "0/0", "author": "Kelly M. English"}, {"rating": 4.0, "review": "If you are looking for a device to stream anything to your TV, this is not what you are looking for.What this device does is allow Chromecast enabled sites / apps to stream direct to your Chromecast, freeing up your laptop / mobile device.  So if you are watching (say) a Netflix show on your tablet, and click the new little Chromecast icon, the stream will switch over to your Chromecast, and you can get on with other stuff on your tablet.At the moment, sites supporting Chromecast are limited.  But they do include YouTube, Netflix, Hulu Plus, Plex, and a few others.  And there should be a lot more appearing soon.So if you watch a lot of Netflix, or Hulu Plus, or Youtube ... this is $35 well spent.  Just understand what you are getting before you buy this, so you won't be disappointed.  And no, it doesn't support Amazon Prime!One other issue to note is HDMI switching.  Even if your TV supports HDMI CEC, the \"standard\" that allows for automatic switching between HDMI inputs, you will still end up needing to manually switch inputs using your TV remote.  The best you can achieve for automatic switching is for the input to switch to either the TV or the Chromecast when one of them powers up or down.  You can't have it automatically switch from TV to Chromecast when you watch a Chromecast stream, then back when the stream is finished.  This isn't a Chromecast issue, this is just the nature of HDMI switching.  Maybe one day the industry will sort all that out!", "verified": true, "helpfulness": "0/0", "author": "Hugh M"}, {"rating": 2.0, "review": "The way of operating is not ideal, you need to access to phone to pause,play, turn volume up/down in the middle of the movie when your phone's screen is black out in standby mode. While most movies from Netflix has subtitle for Apple TV, but this one has much fewer. Despite it's price, Apple TV is a much better option as a media box, easy operation and hassle free.", "verified": true, "helpfulness": "0/0", "author": "Kenny"}, {"rating": 4.0, "review": "Very useful for home and office use.  Note: this device connects to your phone and tablet using wireless and not blue tooth, so you must have a wireless connection setup to allow them to talk to each other.  I planned on using it for my boat, which won't work unless I use my phone as a tether to create a wireless SSID and point my chrome cast to it.", "verified": true, "helpfulness": "0/0", "author": "Robert G. Dahlin"}, {"rating": 5.0, "review": "No complaints, great product and works surprisingly well over wifi. Have experienced no wireless issues with this device whereas \"smart tvs\" and similar devices have had problems with the interference in my apartment. Works as well or better then advertised, you should buy one.", "verified": true, "helpfulness": "0/0", "author": "John Spaetzel"}, {"rating": 5.0, "review": "I love it , i cant explan why biy really i love it more than my girlfriens i wich i could by onther one", "verified": true, "helpfulness": "0/0", "author": "abdulrahman alolayan"}, {"rating": 5.0, "review": "I can now get Netflix on the television in my office.  I can still be on the computer with myTablet close by as well as my Smartphone.  I love electronics", "verified": true, "helpfulness": "0/0", "author": "Carole Helmig"}, {"rating": 1.0, "review": "Hate to say this. I am a big fan of google, but unfortunately google chromecast is not appropriately configured to work well in a Mac. Ninety-percent of the time, it tells me that the device is disconnected when it isn't. Have tried all the different methods for troubleshooting to no avail.Avoid. Would not recommend.", "verified": true, "helpfulness": "0/1", "author": "mayo"}]