[{"rating": 5.0, "review": "Works on IPad using IPhone data to watch videos on my TV.  Could not get it to work just off Iphone.", "verified": true, "helpfulness": "0/0", "author": "Gary L Huff"}, {"rating": 1.0, "review": "Should have researched this more.  Must stream thru PC which prevents one from multitasking while watching a movie. Also, screwed up my laptop as you must download Chrome before it will work", "verified": true, "helpfulness": "0/0", "author": "Pyrowidow"}, {"rating": 1.0, "review": "so disappointing.  was recommended but has proven near impossible to connect to my TVi have asked some hi tech people to helpnot happening.", "verified": true, "helpfulness": "0/0", "author": "Malka Edelman"}, {"rating": 5.0, "review": "Fine. It's very good", "verified": true, "helpfulness": "0/0", "author": "erik quirino"}, {"rating": 2.0, "review": "It doesn't work more than half of the time.", "verified": true, "helpfulness": "0/0", "author": "G.Cheeks"}, {"rating": 2.0, "review": "Not sold on the whole connected TV... It's nice when it works but the wireless connectivity on it isn't that great.  My phone works great but then when I cast it to this it always tends to buffer.", "verified": true, "helpfulness": "1/1", "author": "M Schaefer"}, {"rating": 3.0, "review": "I am using it but it seems to stop a lot and play catch up.", "verified": true, "helpfulness": "0/0", "author": "Richard Waldron"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "anthony fordyce"}, {"rating": 4.0, "review": "there are some limitations.  you can't just stream anything.  you can stream anything supported websites.  and you can stream your chrome browser tab from the computer or you android screen.  however, if you are playing video on the browser, the stream isn't smooth if it is HD.  From a supported website, HD works great.  also you can't play local media. there are workarounds using the chrome browser but same issue applies to HD content; the video will stutter.great for the kids.  i can select their youtube videos from my phone then shoot it up to the tv.  my tv has a youtube app but search videos is a pain through that.", "verified": true, "helpfulness": "0/1", "author": "toolguy"}, {"rating": 3.0, "review": "Good device, tho the casting apps and general technology are still a bit awkward.- It has its own DNS hardcoded, so you won't be able to cast through HOLA plugin or another method or proxied content (as in to see US Netflix from another country).- Several times I've had it disconnect and had to reconnect.- Switching between seeing a movie on the tv and a device usually resets the movie position back to zero, or to a wrong time.Plenty of small things that will no doubt get better with time and general adoption, but still not perfect.", "verified": true, "helpfulness": "0/1", "author": "Nick"}]