[{"rating": 5.0, "review": "I love this thing.I'm no longer forced to watch network GARBAGE.It is easy to set up if you already have a wireless switch installed.Install is fast in windows, and with a little more effort you can install it in Mageia.", "verified": true, "helpfulness": "0/0", "author": "food for thought"}, {"rating": 5.0, "review": "Bought one of these over Thanksgiving and it is awesome. Sends a great picture and is super easy to setup. My dad was so impressed he's thinking about getting one for my mom to use with her slingbox.", "verified": false, "helpfulness": "0/0", "author": "Cyber_monkey"}, {"rating": 4.0, "review": "Well thus far with this being a relatively new product there are few apps except those mentioned that work with it but being able to watch YouTube documentaries on my big screen is much better than starring at my note3. All in all it does everything it says no glitches absolute plug and play setup via some required software downloads.  Amazing google a 35 dollar product that brings our devices to our television in an easy non expensive way.  Genius.", "verified": true, "helpfulness": "0/0", "author": "Hubbisse"}, {"rating": 5.0, "review": "Easy install, works extremely well. I look forward to Chromecast being supported by many for apps as it develops a following", "verified": true, "helpfulness": "0/0", "author": "Ralph Candiloro"}, {"rating": 2.0, "review": "Streaming from Chrome Browser via the Google Cast Plugin doesn't work. Anyone know of a better solution? Youtube streaming is about all this thing is good for. Not really worth 35 bucks", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 1.0, "review": "Difficult to set up with iPhone and iPad. Worked for a couple of days. Now I am unable to cast (stream videos) from you tube. Will have to call google whose support was not the greatest in the first place. Buyer beware", "verified": true, "helpfulness": "2/3", "author": "Gregg A. Tashker"}, {"rating": 5.0, "review": "Easy to set up and I am already watching netflix from my Kindle Fire HDX. Just needed to download Chromecast app from  1 Mobile market.  From amazon  app store download ES3 downloads manager to get to the app download to appear on your apps", "verified": true, "helpfulness": "2/2", "author": "scottkwimer"}, {"rating": 4.0, "review": "Love this product for streaming Netflix from my laptop and streaming Pandora from my Android Phone.Waiting for them to fix Netflix Android app as only the main account can sign on.  Netflix looses the Joe Cool factor for that and you can't just automatically send the stream to the Chromecast from your laptop.  It loads it on the laptop and then you have the opportunity to send to the Chromecast.  Final software flaw when using a Chrome Browser and sending it to the ChromeCast, the Mouse does not show up on the big screen at all.  Software updates have been coming out but it needs some tweaking.Install can be a little frustrating because the first handshake takes its own sweet time.  Installed 3 of these and they all keep saying can't find it ... just have to keep trying until it does. (about three times or so).  Also,  it comes with an AC adaptor, use it, DO NOT try plugging it into the USB on TV or IT WILL FRY the Chromecast Unit.", "verified": true, "helpfulness": "0/0", "author": "MDr"}, {"rating": 5.0, "review": "Googe Chromecast is my new favorite thing. Before i was using my laptop to connect Netflix to the TV and this is not only easier but much clearer. Also a great gift too!", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "So, you don't have the budget to buy the lastest Smart TV? Then convert your good'ol LCD TV with Chromecast! Wireless video streaming. Your TV instantly turns into a Smart TV :D", "verified": true, "helpfulness": "0/0", "author": "Runer"}]