[{"rating": 3.0, "review": "Not much better content than prime via Play station except navigating and voice control much better.", "verified": true, "helpfulness": "0/0", "author": "dan schmitz"}, {"rating": 5.0, "review": "Easiest electronic device to set up ever. Voice activation works great. fire is amazing.", "verified": true, "helpfulness": "0/0", "author": "Drew A. Monardo"}, {"rating": 5.0, "review": "Amazon Fire TV is a great substitute cable TV.  It is easy to set up.  The help for it is great.  Right after we e-mailed for service they called us and walked us through our difficulties.  We can take it with us and set it up in our second home also.  Picture quality is great.  Selection is varied.  With prime much is free and others are nominal.  Coordinates easily with our kindles.  The only thing I would like is more current sports coverage. The cost of the unit is little considering what it gives us.  Also it is nice to be able to watch with no commercials.", "verified": true, "helpfulness": "0/0", "author": "KassieS"}, {"rating": 5.0, "review": "Great interface (much better than Netflex via Wii), the voice request works great. Highly recommend the device", "verified": true, "helpfulness": "0/0", "author": "J. Erickson \"Jim in Plano, TX\""}, {"rating": 1.0, "review": "No youtube on it...does not worked for me....", "verified": true, "helpfulness": "2/14", "author": "Bioleta Sanchez Kuhl"}, {"rating": 3.0, "review": "Asking to purchase too much.  Just need a connection to stream, not purchase shows that just aired.", "verified": true, "helpfulness": "0/1", "author": "Giovanni"}, {"rating": 5.0, "review": "Love it! I watch shows I had always planned on watching. I also listen to music", "verified": true, "helpfulness": "0/0", "author": "Joanne Glaser"}, {"rating": 5.0, "review": "I waited 2 months before writing this to ensure an accurate rating. Once I did the initial setup (which was easy) I was impressed by the look, feel and ease of the Fire TV. The menu screen through the voice search was easy to navigate and worked very well. I did hold off though as I stated earlier as so many times the bugs begin to come out.After 2+ months of use I have to say I have zero complaints. The unit works great and I still love the look and feel of the operations. I am a Prime member and I am absolutely satisfied with the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Gary Scott Gebert \"Gary Scott Gebert\""}, {"rating": 5.0, "review": "I was a long time getting my Amazon Fire hooked up because I thought that it would be difficult and I should wait for my son to come and do it for me. I finally gave in one evening that I had nothing that I wanted to watch on Netflix and decided to do it myself. I could not believe my eyes. I had it on the screen in less time than it takes to open the box!! Great job Amazon. I love my Amazon Prime credit card because it allows me to save a good amount of money on purchases on-line and with the Fire a lot of the things are free. I am retired and on a fixed income so I really appreciate not having to pay cable bills for tons of 'stuff' that I do not want or need. I always find something to watch on Amazon. Thank you guys for a great job!", "verified": true, "helpfulness": "1/1", "author": "Joan S. Hamlin-Chapin"}, {"rating": 5.0, "review": "Easy to hook up.  Plug in and play!", "verified": true, "helpfulness": "0/0", "author": "mcmary2"}]