[{"rating": 5.0, "review": "Couldn't get hd and surround sound on streaming video. Now I can! Worth every penny and more. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Bernard"}, {"rating": 5.0, "review": "I like it. It's easy to use and the format is good. And because I belong to Amazon Prime I get lots of free movies!", "verified": true, "helpfulness": "2/2", "author": "Linda J Williams"}, {"rating": 5.0, "review": "It works great with all the apps you can download.I would deffenetlly recomend.Only think I would like is to be able to play my iTunes content.", "verified": true, "helpfulness": "2/2", "author": "Rafael E. Guzman"}, {"rating": 4.0, "review": "I wish I can just load any Android app without using workaround... you can install apps via ADB but it's cumbersone and many apps do not work well in landscape...", "verified": true, "helpfulness": "0/0", "author": "Josetron"}, {"rating": 5.0, "review": "The voice-activated search works very well.  A wide assortment of movie selections available.  The only drawback is a lot more movies are paid than free", "verified": true, "helpfulness": "1/1", "author": "Dean Z. Douthat"}, {"rating": 1.0, "review": "This thing is horrible.A lightning storm last week zapped out Apple TV2 and so i read a bunch of reviews and watched a bunch of youtube reviews and thought i would order one of these to replace it.Bad idea.Every 30 minutes it starts to glitch and flash all these different screens.I am not an apple nut but they do make a solid product.This product from amazon randomly stops in the middle of a show and it will start jumping to different programs and the only way to stop it is to unplug it from the wall.I like the remote better than our old apple TV2 but i am returning this Amazon Fire.  I am disappointed in the inconvenience this is causing our family.", "verified": true, "helpfulness": "4/15", "author": "nwchal"}, {"rating": 5.0, "review": "As easy and instantly familiar a device as is possible! It's intuitive, seamless, and even my four year old navigates it without help! Sets up in less than a minute, and you're off! How did we live without it?", "verified": true, "helpfulness": "1/1", "author": "Amazonfrequentbuyer"}, {"rating": 5.0, "review": "It's incredible how fast it loads and starts the movie...much faster than a Blu Ray Player. While Blu Ray may have a very slight advantage in image quality (very slight and not noticeable without a direct comparison from the BR disc to Fire TV), the audio feed difference is imperceptible (I am feeding my pre amp processor with a high speed Amazon HDMI cable.)When you combine it with Amazon Prime you get to watch a bunch of movies for free and get 2 day shipping, which makes it even better. My box is hooked up directly to the router so I can't comment on WIFI mode.The image and sound is much better than my HD cable feed...so far I have not experienced any drop outs, pixelization or picture freeze, all of which are common on a NYC cable feed - whoever the provider is.The rewind functions work flawlessly, so if you are watching one of those complicated caper movies, or miss some dialog, no problem as there are 4 rewind speeds to take you back as quickly or as slowly as you desire.The best $99 I have ever spent on an audio video device!", "verified": true, "helpfulness": "2/2", "author": "Sandra E. Russell"}, {"rating": 5.0, "review": "IT'S GREAT. NEED TO PLAY WITH IT AWHILE, TO FIND ALL IT WILL DO.LIKE THE IDEA OF GETTING RID OF CABLE", "verified": true, "helpfulness": "1/1", "author": "PETER Smith"}, {"rating": 4.0, "review": "I find the voice search to be less than expected. Its a new product, I am hoping the designers will make it work better.", "verified": true, "helpfulness": "0/0", "author": "Greg"}]