[{"rating": 5.0, "review": "I am a youtube fan and the only purpose i use it for is viewing youtube vdo's on TV and it does a great job", "verified": true, "helpfulness": "0/0", "author": "tarun"}, {"rating": 5.0, "review": "As advertised.", "verified": true, "helpfulness": "0/0", "author": "Cam Edgar"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Norman Michael Capiral"}, {"rating": 5.0, "review": "We have been using our chromecast now for a little while and have not had one issue! It was easy to set up and is easy to use!", "verified": true, "helpfulness": "0/0", "author": "renee kelley"}, {"rating": 5.0, "review": "A solid alternative to cable. Works on wifi and has a handy app.", "verified": true, "helpfulness": "0/0", "author": "ThinkingWoman \"Tree Buyer\""}, {"rating": 4.0, "review": "So I ordered this on Saturday (before Mother's Day), and it arrived a day early, Monday! I was so excited that I installed it immediately and finally got to watch Netflix on my TV without the hassle of connecting my computer to it. Awesome! Messed around (used it in other various ways via its intended purposes) with it yesterday (Tuesday), and now comes today/tonight, Wednesday, and the reason I'm giving it 2 stars for now: IT'S ALREADY CAUSING PROBLEMS.I've done literally everything I can think of from unplugging/replugging it and the USB/AC power (tried both), using the software I got to set it up, changed inputs like a madman, but still to no avail. No one has touched it since last night when it was working perfectly fine, it's just simply not working. I don't know if the TV no longer recognizes it or not, but it just simply refuses to work. Had it continued to work, it would have easily received a 4 or 5.Will edit review/stars when I get a hold of CS from either Amazon or Google, whoever is now responsible for replacing this defective one I was sent.EDIT (same night): Apparently I didn't unplug the TV from the wall, and this, for whatever reason, was the solution to my problem. I assure you, NOTHING has touched Chromecast in any way since I tried to connect normally tonight. Still a very strange (and annoying) problem. I have put 4 stars back on the review; one taken off for the small irritations I have with it, including the 3-years-later-\"experimental\"-tabcasting. It should be a bit out-of-beta by now and I'm frustrated with how much it still continues to lag.", "verified": true, "helpfulness": "0/0", "author": "Polarthief"}, {"rating": 5.0, "review": "Second Chromecast that I own.  Works well.", "verified": true, "helpfulness": "0/0", "author": "Rain Man"}, {"rating": 1.0, "review": "This item is a little difficult to set up- you will need several apps on any of your devices to be able to cast, and not all websites or devices are user friendly. Once I managed to cast what I wanted, it works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Raven7 \"Raven7\""}, {"rating": 1.0, "review": "Had a lot of installation problems with this item.  Worked for about 3 months and then the connection got so loose that it wouldn't stay connected.  Get the Fire Stick instead.", "verified": true, "helpfulness": "0/0", "author": "LaLa"}, {"rating": 5.0, "review": "Came super fast. I bought it as a gift so not sure how well it's worked for him, but I also own a chromecast and I love it. It's made streaming through netflix through my phone a breeze and I love its flexibility.  Really dig this product and the fast shipping!", "verified": true, "helpfulness": "0/0", "author": "Phrozen Legacy \"CB\""}]