[{"rating": 4.0, "review": "The product is fantastic. Hookup was simple and straight forward.Child's lay.Yes,I would indeed recommend it to family and friends.", "verified": true, "helpfulness": "0/0", "author": "D-DWAGG"}, {"rating": 5.0, "review": "Why bother I don't have enough to say to meet the minimum, which is sad.  And they'll reject it because I just pad it out add in more words, like a 2nd grade essay.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works well with youtube and netflix but not beyond that - which is as advertised. The only thing I am having difficulty with is accessing the unit from multiple computing devices. Based on instuctions it would appear that this is supposed to work but I have not been able to get it to work yet.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 4.0, "review": "Very good product! But, it should be compatible with more Apps in the phone (like Chrome browser for example). In the apps that it works, the overall experience is excellent!", "verified": true, "helpfulness": "0/0", "author": "Igor Diamant"}, {"rating": 5.0, "review": "Works great best investment ever!! The only thing is it doesn't have enough apps as of yet to do more with chromecast", "verified": true, "helpfulness": "0/0", "author": "Simon"}, {"rating": 1.0, "review": "Not what I expected, Hot as a pistol. Might find a use down the road but concerned about working temperature and efficiency/life span of product unless engineering intended it for supplemental winter heat source.", "verified": true, "helpfulness": "0/1", "author": "Stuart V."}, {"rating": 4.0, "review": "I love thispicture quality is goodEasy to connectBut gets stuck when playing YouTube play list its okay when u play one by one", "verified": true, "helpfulness": "0/0", "author": "SHAWN K FRANCIS"}, {"rating": 3.0, "review": "Is ridiculous to sell a product without apps.DON'T BUY this until GOOGLE put more apps in the market. There are only few apps", "verified": true, "helpfulness": "0/0", "author": "Ricardo R, Diez-Pena"}, {"rating": 5.0, "review": "I find it perfect for mobile streaming. The only thing missing is the open sdk for developers to create apps for it.", "verified": true, "helpfulness": "0/0", "author": "Emanuel Abrantes"}, {"rating": 5.0, "review": "Google always surprising us!Excelent product, easy to install and to use.  Capture easily the wifi signal.Hope Google adds another apps", "verified": true, "helpfulness": "0/0", "author": "Marcio H. S. Andrade \"Biomedical Equipment Course Coordinator\""}]