[{"rating": 1.0, "review": "Box works great, easy set up, but so far 99% of everything I find to want is not free, even on netflix. Blah", "verified": true, "helpfulness": "9/22", "author": "Jason Taylor"}, {"rating": 3.0, "review": "I was curious about the Fire and I will say this, if you do not have a streaming device yet (Roku, AppleTV, Game Console) the Fire could be the right purchase for you.I currently have Tivo, Apple TV, and Game Consoles that all do pretty much the same thing, so it really doesn't bring anything new to the party.  I might change my tune when the game controller is released.  I think there is a HUUUUGE potential there, but trying to play games with the remote is fairly awkward right now.Overall speed and picture quality is good, sound is good.It's worth a look, but don't expect anything earth-shattering, at least not yet.", "verified": true, "helpfulness": "0/2", "author": "Jaime Wojick \"jwojick\""}, {"rating": 5.0, "review": "I love it it is so much better than the others ones are. I have watched it every day since I got it", "verified": true, "helpfulness": "1/2", "author": "Jonnie"}, {"rating": 1.0, "review": "Does not come even close to Apple TV.  Feels like I'm using a windows 95 product in the age of ...well 2014. Sending it back.", "verified": true, "helpfulness": "5/22", "author": "EddieNN"}, {"rating": 5.0, "review": "got it as present for my birthday from my wife. best one she ever bought for me!great tool. works fast. no fall down and no delay. you can install any apps from the app store.intuitive and innovate.never been satisfied so much from a gadget.", "verified": true, "helpfulness": "2/2", "author": "Elad Eliahoo"}, {"rating": 1.0, "review": "All the bad that everyone is saying is absolutely the truth. Search only searches amazon that costs you. It only searches amazon, no Netflix, vudu,  hulu or any other feature. There is no easy way to surf the web.  They claim that it plays games well DL 2 games Anthe memory is full so you only get a few good games. You can't access your own media. There is a USB port in the back don't know what its for except maybe a keyboard of sorts which I think you can do with Bluetooth. I will be returning mine and someday if they figure it out I would buy another. All the free stuff on amazon prime is hidden except for e 150 or so they show you on the main screen. I will also be returning my prime membership. The price went up 20 dollars this year, what about the next. I don't mind waiting an extra day for my orders.  Which most things take three days anyway.  Way to go amazon your getting 200 dollars less from me.", "verified": true, "helpfulness": "6/21", "author": "Hogan"}, {"rating": 5.0, "review": "I had roku and used to watch Netflix.  But my husband bought a smart tv two years ago and thought I could say good bye to my roku.  However, my pansonic smart tv couldn't stream lots HD video.  So I had to use my PS3 to stream Netflix and youtube.  Anyway, I have high speed internet but still couldn't stream with my smart tv.  So we bought amazon fire, now I can watch all hd videos any time I want.  The video quality is awesome.  I recommend for those who watch lots youtube, Vimeo and Netflix.", "verified": true, "helpfulness": "1/1", "author": "Pufferfish"}, {"rating": 5.0, "review": "We had been looking at various streaming video boxes (Roku, Apple TV, PS4, etc.) but hadn't found one that we were overly intrigued by... until Amazon Fire TV came out.  We have a Wi-Fi enabled blu ray player that we can access Netflix and a few other apps through, and it is terrible.  It takes a long time to load, and almost every time we try and use it, we have to reset the Wi-Fi connection or the blu ray player or BOTH.  Sometimes, it still won't connect.  With Amazon Fire TV, we don't have the connectivity issues.  It loads every time, and loads much, much faster than our blu ray player.  We couldn't be happier about our little Fire TV box!", "verified": true, "helpfulness": "0/0", "author": "Casey Bargdill"}, {"rating": 5.0, "review": "I've been trying to get something that let's me watch my amazon prime videos on my tv. I know some of the video games consoles did this but they were expensive and I don't play video games. I'm so happy they made this device as it changed the way I watch tv.", "verified": true, "helpfulness": "0/0", "author": "Rudi"}, {"rating": 5.0, "review": "No tech review here, plenty of those already. Awesome product for Amazon Prime members. Best money I've spent in a long time.", "verified": true, "helpfulness": "0/1", "author": "Barry A. Sigars"}]