[{"rating": 1.0, "review": "Though the initial setup of this took time, I initially felt this is a good buy. It only works with the pre-defined apps that have been created, casting a chrome tab with an extension was painful. Chromecast streams the videos with lots of latency and trust me I have a high-speed internet which works absolutely like a charm. Better fix this google and I am not recommending this to anyone before google brings up more apps.", "verified": true, "helpfulness": "0/0", "author": "N. Balachandran"}, {"rating": 5.0, "review": "Performs exactly as advertised. Couldn't ask for anything more in a product. My congrats to Google or whomever invented it", "verified": true, "helpfulness": "0/0", "author": "John J. Shelton"}, {"rating": 5.0, "review": "And the next time that Amazon has them on sale again, I plan to pick up a couple more.  DirecTV does not allow HBO GO to be streamed on the Roku for some really irritating reason.  This was a very cost effective solution to that problem.  Very easy to install and works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "D. Sherlock"}, {"rating": 2.0, "review": "Hooked up easily, supplied power from USB on the TV, no issues joining my network. It works fine for Youtube, but I had numerous issues losing the connection - which meant the TV kept playing while I scrambled to reconnect. Other services were spotty. Overall, the whole experience felt very beta.I picked this up to see how it worked. I have an apple TV and a few rokus - so I wanted to see if google brought anything new to the table. Overall, I prefer the Roku experience. Just $10-20 more and an actual remote to control playback, and a nice UI that does not require a computer (or phone/tablet). People seem excited about the upcoming possibilities for apps - but the Roku just works now. I will be selling the Chromecast... The jury is still out on the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Seth"}, {"rating": 4.0, "review": "I got this product wanting to get a streaming device so I wouldn't have to use my laptop to stream netflix and whathaveyou on my TV. This gives me exactly what I want because I am able to stream youtube, music, and netflix all on my TV while using my smartphone as a remote. The product itself is great and works great.The only trouble I had was when I took it out of the box to set it up. I read the instructions and plugged it into my TV using the HDMI port and the provided USB cable to power it from the USB port on my TV. What happened is the thing did not work at first. I was very upset and thought it broke while shipping or maybe they sent me a faulty one. After doing some research online, I found that there is something you need to do sometimes when you first get it or whenever it acts up.For anyone who has this problem, plug the power source into the cromecast FIRST, wait for the red light to become a flashing white light, THEN plug it into your TV. This is the form of reseting it. Your device is NOT broken, it most likely just needs to be reset. Hope this helps. Product is great though. Works like a charm", "verified": true, "helpfulness": "1/1", "author": "Alex Guigli"}, {"rating": 5.0, "review": "Thank you so much Google for making something as wonderful as this. The Chromecast makes it so much easier to enjoy watching youtube videos and Netflix! It;s so incredibly easy, and I don't know why I was living before this haha!", "verified": true, "helpfulness": "0/0", "author": "Sara Faure"}, {"rating": 1.0, "review": "Needs plug ins, cord, wires.  Does not get feed from aerie or hulu plus.This is a piece of meaningless, junk.DO NO PURCHASE.  A huge waste of time.And this seller does not take returns.  Tried...cuts off after 30 days.It takes 30 days to figure this thing out as it comes with NO INSTRUCTIONS.BUYER BEWARE!", "verified": true, "helpfulness": "0/4", "author": "Mary Gallina"}, {"rating": 2.0, "review": "I purchased Google Chromecast thinking, \"what have I got to lose for $35.\" I brought it home and got it set up. The set up was very easy, and we were up and running in minutes. It was working great and we we're watching Netflix like crazy. I liked the fact that I could cast from my iPad and still do other things. Here's where the problem comes in, and it's a big one. Seeing as I only have two HDMI ports on my tv, I had to swap it out for our Bluray player. I did this after having my Chromecast for about a week. The device got so hot that the weight of the device and power plug BENT the metal HDMI plug. It continued to work for about another two weeks before it died all together. The only reason I'm giving it two stars is because it was great fun and easy to use before it conked out on me. I now am the proud owner of an AppleTV and I'm very happy with it.", "verified": false, "helpfulness": "0/0", "author": "Sarah B."}, {"rating": 3.0, "review": "Google chromecast is interesting product as Google learns to make hardware.  But very limited can only (as of jan 2014) use with google chrome on your PC/Mac and a few apps.  Expect new options late 2014.  Still okay buy at $35 but waste if you already have AppleTV or similar media player", "verified": true, "helpfulness": "0/0", "author": "Charles C."}, {"rating": 5.0, "review": "Works great. Needs more ability to sling from ipad. Works better with android. Streem is good. Nice if had a port for ethernet", "verified": true, "helpfulness": "0/0", "author": "tim"}]