[{"rating": 4.0, "review": "I love this Amazon fire TV! I really bought this for my kids to use during their TV time in the morning. My two sons are five and four years old. We use a lot of on-demand shows for them, but they only last about 20 minutes and then my husband and I are up out of bed to put the next show on for them.  We are both not morning people, so anything that could possibly help my kids watch TV on their own in the morning is a godsend.  Amazon fire TV has worked out exactly as I had planned. Actually, probably a little better than I even imagined. The boys both know how to work it and navigate through the screens. I also taught my 5 year old how to flick something to the fire tv from the kindle hdx.The only reason I am taking one star off, is because I would appreciate more apps. My boys love the sprout or PBS app, but it is not available on the fire. Also, the speech option only works with prime. I can live with that, but it would be nice if it worked within other apps as well. Last complaint, I would like the fire to have the streaming prime music option. I believe this will be available soon though.I set this up in under 5 minutes. I've never had a media player before so this is all new to me. However, it was super easy to get it working. I love how it picks up my wireless networks. I think the kindle hdx and fire tv blow the apple iPhones and iPads out of the water as far as wireless network reception. We have to use a wireless booster in my house, but the fire tv will still work on the regular wireless network even with a low signal. That's impossible for my iPad to do. So kudos to amazon for making my life a little easier with better reception.Overall, this was a great buy for our home. It lets my husband and me get some more sleep in the morning and the boys love it. I can't compare it to other media players, but I'm very happy with my pick.", "verified": true, "helpfulness": "0/1", "author": "Tammy M \"Mommy of 2\""}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Sullivan"}, {"rating": 1.0, "review": "Old shows and movies on prime. Hulu is a tiny bit better. I thought I would have access to lots of cable tv shows but they have to be purchased. I also thought I would be able to do with out being sucked in by the cable giants but I had to put cable back on my tv anyway.", "verified": true, "helpfulness": "2/5", "author": "Dev"}, {"rating": 1.0, "review": "Edit: Remote no longer works. Tried new batteries and resetting the box but that did nothing. Can't wait to see how long it'll be until I get a new remote.The box itself is very nice. The main issue for the 3 star review is their lack of a decent browsing system.Sure, you can click on \"Prime\" movies but you'll only see X amount and you can't sort/filter them by genre/type. Want to watch kids movies? Tough. You need to browse through an endless amount of crap in hopes that you see one. Yes, you can click on other categories however good luck with that. Just about every single show I click on to watch has a fee. If you can manage to find what you're looking for, outside of the Prime category that's filled with D grade movies and can't be sorted/filtered, there's a very big chance that there'll be a fee to watch it. $2 per episode to watch a cartoon from the 90s? $5 to rent a movie from the 80s? It's a massive rip off and, quite frankly, I don't even use the Amazon section anymore because of it.The search feature works nice and it always finds what I need. However, you can't search by type so there's no way to filter out Prime content from pay content unless you click on every single result in the hopes that something might be free (which about 95% of the time it isn't.)So what would it take to get 5 stars?- The Prime category needs to have a sort feature so people can browse Prime stuff via genre. This should have been 100% common sense to the developers of this but they obviously dropped the ball on it.- The cost of the movie/TV show needs to be displayed along side the picture in the browsing section. Why make people click on a show just to see what it costs? It's a waste of time. I'm not going to pay $2 per episode to watch it whether I have to click on it or not.- Search needs more options. Why can't I search for Prime only stuff? Because Amazon wants your money, that's why.I no longer use the Prime features of this box because it lacks far too many basic features. I have a Netflix subscription and I'm happy with that. Tried out Hulu Plus but it was extremely buggy on this box because of the commercials that Hulu forces you to watch.If you're a Prime subscriber and you're looking to buy this because of the 'massive amounts of movies and tv shows' that Amazon offers to their members, I'd probably advise you to rethink your decision. There's a very big chance that you'll be disappointed and just end up doing what I did and switching over to Netflix.", "verified": true, "helpfulness": "3/4", "author": "Adam"}, {"rating": 4.0, "review": "I cancelled all my cable movie channels.  Then I got this, and with Netflix I've turned into a drooling couch potato.  Loses WI-FI connection too often, but I'm patient and just reboot.  Other than that, it's great!", "verified": true, "helpfulness": "2/2", "author": "Scott Ekman"}, {"rating": 5.0, "review": "Bought it for XBMC...I stream movies from straight from the interweb, play movies from my PC through my LAN, play Amazon Prime movies, Netflix, YouTube and even games. I even cut my cable. Best money I've spent in awhile. Great buy!!!", "verified": true, "helpfulness": "1/1", "author": "Frank H."}, {"rating": 5.0, "review": "Though I had to return this as it would not work with my location (end of the line for internet in a tourist area, very slow May- Sept with lots of buffering) this is a very nice item. More or all units need voice search as good as this. I was charged a $20 restocking fee which after contacting Amazing Amazon Customer Service was refunded. I have Prime and nowhere did I see a restocking fee mentioned. I recommend this if you have good internet service, I would buy again if it would work here, and I hope this helps someone.", "verified": true, "helpfulness": "0/2", "author": "Addicted Montanan Amazoner"}, {"rating": 5.0, "review": "Faster than Roku and Apple TV. Amazing content.", "verified": true, "helpfulness": "1/1", "author": "Joe Barhoum"}, {"rating": 2.0, "review": "Fast but it sucks becuae the USB port will not work with external drive,, forces you use Amazon services,, only good for Amazon service and Youtube", "verified": true, "helpfulness": "1/3", "author": "John M. Green \"jgreen\""}, {"rating": 4.0, "review": "This was a great purchase I got for my dad to use to replace his Satellite TV, since he only watches about 3 channels.  Very fast and intuitive process. Only have had one issue so far - with Amazon instant videos not playing - but that was fixed easily enough with customer support!", "verified": true, "helpfulness": "0/0", "author": "D. Johanson"}]