[{"rating": 4.0, "review": "Lets start with the pros.1. You can control it using your TV remote (as long as your tv remote allows you to program it for a STB)2. Amazon prime content loads really fast (the downside to this, is that I have watched more Daniel Tiger's Neighborhood that I care to admit)3. Setup is simpleCons1. interface that mixes apps, purchasable content & prime video is confusing (the interface could have lots of improvements)2. Could go to sleep when I turn off my TV like the fire stick does.nice to haves that could be added1. If amazon could either join Ultraviolet and allow those to be streamed to this device, or if not that if I could stream videos longer than 20 minutes from my Amazon cloud drive. Basically it would be nice to be able to have my own movies/tv shows treated the same as prime content.2. it would be nice to be able to create a slideshow from the pictures on my amazon cloud drive & from music I have purchased through amazon. Kinda like I do with iphoto & itunes, but this one I can stream to my fire tv or fire tv stick.3. I would like to see the fire tv support wii controllers out of the box like it does with ps3 controllers.", "verified": true, "helpfulness": "0/0", "author": "Daniel B. Weber"}, {"rating": 5.0, "review": "Awesome device, quad processor really makes a difference.  You will not be disappointed !!!!", "verified": true, "helpfulness": "0/0", "author": "charles lang"}, {"rating": 5.0, "review": "We recently installed Fire tv on three separate televisions and really  are pleased. It is great to have them on all the same operating systems, makes for ease of use is super convenient!", "verified": true, "helpfulness": "0/0", "author": "Laura Doub"}, {"rating": 5.0, "review": "The unit is very small and compact.  It's very easy to install and use.  Voice recognition feature worked well (but only works on Amazon videos, not Netflix, Pandora, etc).", "verified": true, "helpfulness": "0/0", "author": "Kiki"}, {"rating": 5.0, "review": "Love love love my fire stick tv......  I've had it for 4 months now and I can't complain", "verified": false, "helpfulness": "0/0", "author": "Yolanda"}, {"rating": 3.0, "review": "I just got this as a Father's Day gift ( what a good son I have ). I got it set up quickly -- it connects to my wireless network but I guess I have to buy something to get a better connection as it stalls a lot even though the signal is very strong. Maybe it's Verizon's \"high speed \" DSL -- who knows. This morning I tried out the music section -- it shows all my tunes I've bought and stored on Prime but I can't get them all to shuffle so I can listen to ALL my stuff without selecting albums, artists, or genres.  And I DON'T want to be forced to endure Amazon's  playlist selections all the time. If I can get that sorted out it would be great. As for watching Prime movies , it'll probably be great once I get the buffering fixed.I'll try to update this later when I get things sorted out.UPDATE, June 30th -------- I went to that \"bullseye\" store on Sat and bought the Netgear Powerline 500, Model #XAVB5201, two plug-in adapters that came with (2) 6' sections of Ethernet cable. It was marked down to around $50, a little more than Amazon's price, but I had \"instant\" delivery. Setup took all of 10 minutes, most of which was spent opening the box. I now have a wired connection from my upstairs router to the Fire TV over my home wiring! Watched a movie -- smooth as silk with great sound.  Now I'm going to look at cutting way back on my DirecTV programming. This thing is great!", "verified": true, "helpfulness": "0/0", "author": "J. Smith \"ProPhoto\""}, {"rating": 5.0, "review": "Very easy to setup and use.  I bought it for my husband for Father's day, and he is catching up on the show \"Justified\".  It's great that it is WiFi and can be connected to the TV - no cable from FIOS or a another supplier needed.  He uses it in a place were we don't have a cable connection.  Reall great.  The voice command works beautifully, and navigating the menu is very easy.", "verified": true, "helpfulness": "0/0", "author": "Gunda"}, {"rating": 5.0, "review": "I love the Amazon Fire TV! It's easy to set up and operate, and I can navigate easily to and from all of my favorite programs from Amazon, Netflix, Hulu and You Tube! This is one of the best products I have ever purchased!", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Switched to the fire when my roku died, am very pleased with the decision to switch. The interfaces is different as expected and took a little getting used to, overall I will recommend this to anyone that asks.", "verified": true, "helpfulness": "0/0", "author": "second time student \"2nd time college student\""}, {"rating": 5.0, "review": "This is a cool little device that works very well.  Good-bye to cable.", "verified": true, "helpfulness": "0/0", "author": "Robert"}]