[{"rating": 5.0, "review": "Awesome! And fast! Only complaint is that HBO is not available for all cable providers yet!", "verified": true, "helpfulness": "0/0", "author": "Staci"}, {"rating": 5.0, "review": "I recieved the Amazon Fire as a Christmas present... I love it! This is better than the Roku .", "verified": true, "helpfulness": "0/0", "author": "Natalie Smith Jermyn"}, {"rating": 5.0, "review": "I get what I want, when I want it, without the high cost of cable! The voice search works very well.", "verified": true, "helpfulness": "0/0", "author": "Chuck T"}, {"rating": 5.0, "review": "I bought Fire tv for my husband as a Christmas gift. I decided on the Fire tv instead of the stick because I wanted to be able to use our speaker system that we have already hooked up to our television. We love it. It was very easy to set up, and is so easy to use. The interface is very intuitive, and the voice search is great. There are many titles available at no cost with the Amazon Prime membership. We have even played some of the games on it (without the extra game control piece) and enjoyed those. We get data internet through our cable provider and get 250 Gb/month and have had no problem. This was a steal at the sale price of $79 that we paid, but would have been well worth the regular price of $99.", "verified": true, "helpfulness": "0/0", "author": "Katy"}, {"rating": 5.0, "review": "It's working great especially for the adults and kids. It's so good we purchased 3 one for each room. Who needs cable when you have an Amazon TV. Would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Roman Sanchez"}, {"rating": 5.0, "review": "We love our new Amazon Fire TV. We got rid of our cable and this is all we have now and it is more than enough! Easy to set up and use. We bought the bundle that included the game handle. Kids love that too! We are buying another for our bedroom.", "verified": true, "helpfulness": "0/0", "author": "I.oldroyd"}, {"rating": 5.0, "review": "While I have only had a day to explore the box I am declaring it the best on the market. There are obvious flaws with most other systems that immediately take them out of the race. The roku is a strong competitor. I have been a big cheerleader for the roku system since it first came out. I bought a roku 3 and became so disgusted with their customer service that I am returning their defective Bo's for a refund rather than an exchange.ProsFastest system out there.Amazon has the best reputation for customer service.Picture is fantastic even with SD. Out of the world with HD.Easier to navigate over all. Especially easy with Prime. With the Roku I did not realize some of the options available on Prime.Easiest setup possible. Not quite plug and play but close. It only takes a few minutes and is impossible to screw it up.Wonderful out of the box screen saver. It is HD landscapes.The remote is ergonomic and simple.Given a little more time I will find more pluses, but you get the gist of the quality.Very minor consI don't care for the style of the remote app. I hope they offer a different style soon. Many people will disagree as it is the simplest remote to use that I have ever seen. It just doesn't fit my style preference.Netflix is not as simple as it was on the roku. But, it is easy and simple to use..", "verified": true, "helpfulness": "0/0", "author": "Nibbet1"}, {"rating": 5.0, "review": "Got rid of cable love fire tv and amazon prime", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Christmas gift for my daughter and so far we absolutely love it!! Very user friendly and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Kelly H"}, {"rating": 5.0, "review": "Awesome device and very happy with it!", "verified": true, "helpfulness": "0/0", "author": "vibrant66"}]