[{"rating": 4.0, "review": "It is okay...satisfactory...had troubleunderstanding how to use it at first...as am not into technology as much as youngerpeople....but it is okay now...do use itquite a lot....but the TV I watch is not themore popular shows....so I do not use itfor the TV part as much ss the movies.....", "verified": true, "helpfulness": "0/0", "author": "Gwen Richards"}, {"rating": 5.0, "review": "really easy to use and really convenient to have i would recommend this", "verified": true, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "Easy to install and I was readily able to stream from my tablet onto our 48\" TV with no issues.", "verified": true, "helpfulness": "0/0", "author": "jsure"}, {"rating": 2.0, "review": "Does not work with WatchESPN app on Android.  Worse, does not work with Google Photos app on either Android or Chromebook, in spite of Google assertions to the contrary.  By navigating through the increasingly confusing welter of Google image-related sites and apps one can cast some photos (from Google+, under certain conditions) but not from the much hyped new release of the Photos app, at least not from my Samsung Galaxy Tab 4.  I would give it 1 star except that it works fine with Netflix; but I already have many other options for watching Netflix (Roku, DVD, smart TV, Chromebook, etc.)I have returned the Chromecast to Amazon and will not be buying another one until the WatchESPN and Google Photo app issues are resolved.", "verified": true, "helpfulness": "0/0", "author": "william spurlin"}, {"rating": 5.0, "review": "Love every minute of this item. I am still in awe of how this works, and I installed it myself!!! It is an awesome item and I'm still finding more that I can do with this, AND I'm a 78 year old women. 😉", "verified": true, "helpfulness": "0/0", "author": "Janith Barrows \"Jan Barrows\""}, {"rating": 5.0, "review": "A little confusing for me, But I'm old. My son set it up in seconds and it does everything  that is stated.Actual the set up was very simple for my son. I enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Teri"}, {"rating": 1.0, "review": "This thing blows major chunks", "verified": true, "helpfulness": "0/1", "author": "Ari"}, {"rating": 5.0, "review": "Arrived as promised. :-)", "verified": true, "helpfulness": "0/0", "author": "Calvin"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Elliot Lipson"}, {"rating": 3.0, "review": "Few options", "verified": true, "helpfulness": "0/0", "author": "Priscila Antoniazzi Calomeno"}]