[{"rating": 5.0, "review": "I got this for my sister who is not overly tech savvy. She loves it and never has any problems running it with her phone.", "verified": true, "helpfulness": "0/0", "author": "pinkobob"}, {"rating": 5.0, "review": "A much easier way to watch Netflix on your tv at home.  We have a bunch of iOS devices and whenever we wanted to find something to watch in the past it was a little tedious using the TV remote and menu, not very intuitive.  With the Chromecast you can look for your Netflix or Youtube content in the app and tap the Chromecast tv icon in the app.  The Chromecast then queries the appropriate source and displays it.I ended up buying a second one so we would have Chromecast capable tvs in the bedroom and the living room.  I also bought one for my parents and brother.", "verified": true, "helpfulness": "0/0", "author": "B. Barnes"}, {"rating": 4.0, "review": "This is nice device if you do not have cable also works good as wireless proctor to she thing s from the computer to the TV screen. Only down side is that both the device with the video and the chromecast must be on the same wireless network. The chrome cast does work if the computer is wired. Even if they are on the same IP network", "verified": true, "helpfulness": "0/0", "author": "MarcusNT"}, {"rating": 2.0, "review": "The TV Ad makes Chromecast look like a \"must have\" gadget for every family. Not so. I can watch Netflix and YouTube on my Blu Ray Player or Smart TV, I don't need Chromecast for that.As for watching shows on my big screen TV from my PC, that works just fine from my desktop, but I don't want to be jumping up and down and heading to my PC every time I want to pause or watch something else - There's no way to do that from a tablet or a phone. Yep, that's right, the Chromecast only works for the installed apps on Nexus 4 or Nexus 7. These are both Google products with the Chrome browser. How can it not be compatible with Android devices?I'm not saying there aren't workarounds out there for some of the things I've run into, I'm guessing there are. I just expected more from this \"out of the box\" and wasn't about to spend my time figuring out how to make it work.  I'm hoping Google is busy perfecting the Chromecast and future updates will allow for more functionality. In the meantime, as far as I'm concerned, even $35 is too much based on what it can do right now!", "verified": true, "helpfulness": "0/1", "author": "Denise Hamlin"}, {"rating": 3.0, "review": "I bought this device hoping that it would do something basic for me, which is to allow me to see my iPhone's desktop on my home TV. Well when it came out, dummy me didn't realize that Google gave Netflix and YouTube access to its capabilities. I also didn't realize (or didn't think) Google would show preference to opening up its capabilities to Android devices first, if not exclusively. Right now I can use my laptop (Windows 7) and \"see\" it's desktop on my TV, but yet I STILL cannot \"see\" my iPhone's desktop or most other apps on it on my TV, once again, only select apps are Chromecast compatible on iOS devices and once again, preference shown towards Android devices. It would be amazing if I were able to show a PowerPoint or PDFs on my TV using my iPhone... great for training and sales pitches. 3rd party vendors are just now, over a year later, getting access to Chromecast's operating system but yet Google is strangling the flow of Chromecast apps out there coming to market. This is so reminiscent of Apple and their death grip on proprietay-ness.", "verified": true, "helpfulness": "0/0", "author": "A. OConnor"}, {"rating": 5.0, "review": "Love how easy setup and use of product is. Just need more apps to support the chromecast for smoother feeds.", "verified": true, "helpfulness": "0/0", "author": "That MurF D"}, {"rating": 3.0, "review": "You cant just play anything from your phone/ipad/tablet.  I thought I would be able to watch my own vidoes and look at my pics on the TV? No such luck... only thing I can do is watch Netflix and YouTube.  And its always got to reboot or reconnect... it wasnt a lot of $ so not that upset just thought I would be able to do a lot more with it than I can...", "verified": true, "helpfulness": "0/0", "author": "David Degrappo \"Graps\""}, {"rating": 1.0, "review": "So far I am not impressed.  Shipping and packaging were good but using it is another issue.  It is very limited on what you can stream to it and when I streamed a youtube video from my laptop to it, it was so choppy it was really unusable.  they have a long way to go, I say wait.", "verified": true, "helpfulness": "0/1", "author": "Stephen Ward"}, {"rating": 5.0, "review": "this product is awesome. works perfectly without a snag. I get to watch Netflix, hulu plus and all my videos from my iphone on my tv.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "And she digs it.  It's nice to control everything from my phone.  Galaxy S4.  I can do literally everything to the TV from my phone now.", "verified": true, "helpfulness": "0/0", "author": "some guy on the internet"}]