[{"rating": 5.0, "review": "Easy simple directions and hookup. I watch Netflix on TV ! I highly recommend you get one. Watching on the big screen sometimes is nice.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"grandma2\""}, {"rating": 5.0, "review": "Love it.. Hopefully there will be soon more apps that will be compatible with this device. I am using it with a lg la740 tv", "verified": true, "helpfulness": "0/0", "author": "Andre"}, {"rating": 5.0, "review": "I have one of these and currently love it. It's so affordable at $35 (presently) that it was easy to justify purchasing it. I have been using it in the bedroom where I do not have a cable box - they just want so much money for an extra room. I use my smartphone (Android and iOS compatible) to tell the Chromecast what to play from Hulu, Netflix, and other apps.PROS:-The Chromecast is super affordable, why not buy one to play around with. It also makes a good housewarming gift!-The Chromecast gets its instructions from your smartphone or tablet, however it does all of the streaming on its own - your phone or tablet don't need to be nearby for the TV to continue enjoying the program.CONS:-There's no remote control; you MUST use a smartphone or tablet to tell the ChromeCast what to play.-You can't (at the time of writing) play videos that existing on your phone - they have to exist in a compatible app.", "verified": true, "helpfulness": "0/0", "author": "Steven Taylor"}, {"rating": 5.0, "review": "Works well and also works through your audio recieber too. Took a few times to get it right but wasn't too difficult. Nice to stream Google play through a good stereo and speakers.", "verified": false, "helpfulness": "0/0", "author": "Dino A. Cantillo"}, {"rating": 3.0, "review": "It works, I thought it may have a few more features, other than just slinging  a web page to. hopefully some third party apps become available", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "I'm seriously considering dropping those premium channels.  This device works nicely even with low internet speeds. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "myriamw"}, {"rating": 1.0, "review": "I couldn't determine whether it works, but it is definitely not plug-and-play. The setup program asked me to reconfigure my Verizon router in one or more of three different ways. I don't have time to try what-if scenarios, I just returned it. Every handheld device I've tried can stream Netflix from the other end of the house without my messing with router settings, so why can't Chromecast stream from across the room?", "verified": true, "helpfulness": "2/2", "author": "Gary"}, {"rating": 4.0, "review": "I pretty much bought this because I wanted to watch HBOGo from my HDTV, seeing how PS3 doesn't have an HBOGo App. Overall, I have been pretty satisfied with how its performed. It works in any HDMI port and if your TV has a USB port, you can power it right from your TV (otherwise you'll need a USB wall charger). It works great streaming HBOGo and has major apps like Netflix, Youtube and Hulu covered and it's cool to be able to stream from your Chrome web browser on your laptop or desktop to your TV. The downside is that Roku supports alot more apps than Chromecast, but I'm hoping that will change soon with Google recently releasing a SDK. But in the end, for this price, it works great and is just what I was looking for.", "verified": true, "helpfulness": "0/0", "author": "Stephen Saporito"}, {"rating": 5.0, "review": "This is the best part of the Chromebook.  Where I've been disappointed with it, I LOVE the Chromecast feature.  Well done! Don't hesitate on buying this...it's really great and a good price.", "verified": true, "helpfulness": "0/0", "author": "Christa"}, {"rating": 5.0, "review": "Very good, but it should be a ton on/off Switch. Easy to config.very good image quality.no bugsgreat", "verified": true, "helpfulness": "0/0", "author": "Cezar Augusto Pirrho Loureiro"}]