[{"rating": 5.0, "review": "For the price, you can't do better! Yes, it has limited capabilities, but what it does, it does exceedingly well.Get one and see.", "verified": true, "helpfulness": "0/0", "author": "Scott Benjaminson"}, {"rating": 4.0, "review": "Is very well.", "verified": true, "helpfulness": "0/0", "author": "José Cumbe"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/1", "author": "Jason Guan"}, {"rating": 5.0, "review": "My chromecast works great. No issues with connectivity. Works well with Netflix, HBO GO, and other apps supported with Chromecast. If your a XBMC user then I would highly recommend this. You have to download some files to your android device but it's pretty simple. Youtube has videos of how to do it. I'm glad I bought this!", "verified": true, "helpfulness": "0/0", "author": "Jessy"}, {"rating": 5.0, "review": "Great product!! Casts Netflix and HBO Go from iPhone to my tv. Works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Tis_McGee"}, {"rating": 5.0, "review": "I love it. When I first purchased the Chromecast, it was not compatible with my Cable provider's Wi-Fi (Comcast) I have since moved to Florida and it works great watch Netflix several times a week great to have TV volume control while viewing.The router can not be more than one room away from receiver though.", "verified": true, "helpfulness": "0/0", "author": "Allan F. Hueg"}, {"rating": 5.0, "review": "excellent product with quick deliver and respond from company. what more can you say.", "verified": false, "helpfulness": "0/0", "author": "Armando"}, {"rating": 4.0, "review": "It's a good device but limitations. Also it does not work very well with my new Samsung TV and I have to restart it to work.", "verified": true, "helpfulness": "0/0", "author": "Muktesh"}, {"rating": 3.0, "review": "I tried to like it. Really hard. I love the format of the device, I wanted to travel with it, but....I feel like I've returned to AppleTV 7 years ago. The inability to video fling full screens, the hassle of having to use Chrome and the absence of apps means you have a crippled device that needs another device for help.I return to carrying the Little black AppleTV which, while it suffers from being unknown, at least it isn't only lightly-functional as well.", "verified": true, "helpfulness": "0/1", "author": "Dave Cooper"}, {"rating": 5.0, "review": "Perfect!!!", "verified": true, "helpfulness": "0/0", "author": "monica almeida mendizabal"}]