[{"rating": 1.0, "review": "The simplicity of this device is both it success and failure.My home network is fairly standard for a business man with the exception that I often connect to my office.  Other than a solid firewall and a fixed IP address everything else pretty standard.  I use a Cisco router that doesn't support Universal Plug & Play and a hot company connection means I need to use my company DNS (Windows Active Directory) servers or I can't find  the corporate resources I need.  DHCP is disabled to prevent casual, unwanted connections.  I use WPA2 Enterprise instead of Personal because I initially login via a radius server for authentication.Chromecast doesn't work on my network, it;s not really very different but for Chrome cast to work, it's all wrong.  Chromecast absolutely cannot be used where the network is complicated in any way.  it allows only an automated configuration and that works on only the most basic of networks where the configuration is exactly what it expects to find and the lack of any way to  manual configure it is a show stopper.So the takeaway is :-If you take one to the office expecting it to work, it almost certainly won't.If you don't have a DHCP server to issue an address, it won't work.if you disable UP&P; for security or you're router lacks UP&P; capability it won't workIt will (eventually) work on most networks without WPS capability but it's slow to connect for some reason. This is odd, it doesn't need or use WPS for anything but if it's disabled or the router lacks WPS it connects much more slowly.If you use anything other than WPA2 Personal (or none at all), it won't work.If yo need a DNS source other than Google you're out of luck, it won't do it.In short, it only works with one network configuration, if yours differs by any of the above, it won't work.It seems a shame, had the developers taken a few minutes and included a few lines of code to enable manual configuration it would probably work almost anywhere, probably even most cooperate networks.AFH", "verified": false, "helpfulness": "3/5", "author": "Al F. Havemann \"AFH\""}, {"rating": 4.0, "review": "12/11/13-Further Update: Chromecast has one big advantage over Apple TV. You can cast content to your TV as the SAME TIME you are using your iPhone vs. the Apple TV. If you use your phone to stream content to an Apple TV you are only allowed to stream content you are watching and you cannot do anything else with your phone while streaming. So the Chromecast advantage is it allows me to check text, e-mails, surf the web or use apps while casting at the same time. You can literally cast Netflix to your TV while watching another video like ESPN on your iPhone at the same time if you wanted to do this.12/4/13-Finally found phone number for Google Chromecast Support. After speaking to rep for 40 minutes still couldn't set up Chromecast using iPhone vs PC liked I tried 1st day (see below) until rep gave up and was just going to e-mail me list of things I should try after our call. I looked at my firewall settings on gateway(modem/router). Security was set at Max/High and this prevented set up. I set to Medium and Chromecast set up completed in about a minute. The rep never suggested looking at firewall settings and put me on hold several times trying to find answer to set up issues. I was now finally able to cast from PC or iPhone. The cast button now shows up within HBOGO, Pandora, Netflix & YouTube Apps on iPhone. I was able to put firewall back on High Security after set up and Chromecast worked properly.But the next day my iPhone refused to acknowledge Chromecast was set up even though TV showed Ready to Cast. Casting from PC worked but not the iPhone. I started to set up like a new device using the iPhone and suddenly the Chromecast showed up as Ready to cast. So it does not work as seamless like the Apple TV.I also had issue trying to pause after phone went to sleep while casting. Since you are not streaming but actually casting you cannot use pause button within apps but must wait for Chromecast to be recognized and use that pause button. When I was able to pause however it started up again and It would not allow me to just display on iPhone or eject until after numerous attempts.12/2/13-Original Review Posted: I used my PC during 1st installation set up attempt vs iPhone. Suggest you use your iPhone for initial set up if this will be your primary casting device vs. a PC. The Chromecast works just fine after setting up using the iPhone.For starters I have iOS version 7.0.4 installed on an iPhone5 which is Apple's most current version. All Apps are most recent versions.I downloaded the Google Cast extension for Chrome on iOS/iPhone. The support.google.com/chromecast/troubleshooterpage indicated the Cast button should be shown within the HBOGO, Pandora & YouTube apps but it is not. I went so far as to delete the apps and re-install trying to fix the casting issue but this made no difference.I am able to cast from within the Netflix app for iPhone only. However, it takes numerous attempts get casting to work as well.I was able to cast once after installation from the PC but now keep getting the message \"Connected to network but can't access the internet\" or \"Brain Freeze, were sorry but something could not load\".And the most annoying thing is the Chromecast keeps knocking off my PC from the wifi network like during the installation process. I have to manually reconnect to my network. This NEVER happened before Chromecast (12/3 I fixed this issue by unchecking connect automatically on start up button which was making Chromecast my desired home network. I hit this button when I had issues trying to set up and thought this might be the reason for set up problems which was really firewall settings)I also have Apple TV. Compared to Chromecast the Apple TV is much better and works seamlessly with about 10 times the more available content but will run you 3X the cost of Chromecast. Depends on your needs.", "verified": true, "helpfulness": "0/0", "author": "Mr. Bill"}, {"rating": 5.0, "review": "How can you go wrong at this price (especially if you get 3 months of Netflix free).  Integration with phone apps is great.  It's as if the YouTube and Netflix iPhone apps were designed with Chromecast in mind.", "verified": true, "helpfulness": "0/0", "author": "George Lincoln"}, {"rating": 5.0, "review": "Greatest little boxEven better when its 23 dollars after 6 dollar movie crediti now have 3 i am going to hand out for xmas this year", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "For $35 I can't think of any reason why you shouldn't buy a Chromecast. I'm not going to write a novel repeating what everyone else has said. Just know that this little device is user-friendly, convenient, and reliable. I expected something so cheap to cast poor quality or laggy internet videos and webpages - boy was I wrong! I can even watch movies that I have saved on my laptop using the control+o command in chrome (so long as they are mp4 format of course), and the videos are crystal clear and run smoothly. I'm recommending this to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Mandi"}, {"rating": 1.0, "review": "Returned it.  The connection between the device and my PC kept dropping.  I added the \"dongle\" as instructued to improve the connection and it still dropped every 2 min or so.  The PC was only 5 feet away if that.  This seems to be another not ready for prime time release from Google.  I don't understand why they launch half baked products.I do not recommend this product.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I LOOK AT MOVIES ON IT LIKE HBO GO, NETFLIX and, Pandora. (BTW YOU HAVE TO HAVE HDTV) WORTH THE MONEY", "verified": true, "helpfulness": "0/0", "author": "Ricardo"}, {"rating": 1.0, "review": "Doesn't work with Windows 7; impossible to set up, even with online help and forums. I bought a Blu-Ray player instead.", "verified": true, "helpfulness": "1/4", "author": "Anna Garden"}, {"rating": 1.0, "review": "This thing was garbage. The playback stuttered and the audio and video would not stay in sync. I gave it to a friend as a gag gift.", "verified": true, "helpfulness": "2/5", "author": "M. Smith"}, {"rating": 5.0, "review": "I love this thing.I'm no longer forced to watch network GARBAGE.It is easy to set up if you already have a wireless switch installed.Install is fast in windows, and with a little more effort you can install it in Mageia.", "verified": true, "helpfulness": "0/0", "author": "food for thought"}]