[{"rating": 2.0, "review": "Maybe I am too used to Netflix.  When I go on Fire TV, scroll though and find something I want to watch, I find out that I have to either rent or buy it.  It is frustrating.  On Netflix, my subscription allows me to watch anything they have, no extra price.  I expected the same with Amazon Prime and Fire TV.  Don't get me wrong, I understand that they still have to sell movies, but why are paid shows and free shows mixed together, thus leading to disappointment when I find something I want to watch.  At least Netflix is clear cut.  No I find that I hardly go onto Fire TV because pretty much everything I want to watch is not free.  I will probably end up selling this device...and I would NOT recommend it to anyone.", "verified": true, "helpfulness": "2/7", "author": "Kobayashi Maru"}, {"rating": 2.0, "review": "Disappointed in quality and cost to use", "verified": true, "helpfulness": "0/9", "author": "Bill"}, {"rating": 4.0, "review": "So easy to set up and enjoy in minutes even for novice techies. Download speed is good and picture quality is excellent. Easy to maneuver between options. My cable provider, Xfinity, does not support this platform for some of my apps which leaves me disappointed with them.", "verified": true, "helpfulness": "0/0", "author": "rapid reader"}, {"rating": 5.0, "review": "Great product. Cut off the cable tv due to their high prices which kept going up in price every month (price went up by $55 in three months).Wife and daughter didn't like it at first, until they realised they could watch episodes of shows that they missed.I own 2 of these now.", "verified": true, "helpfulness": "0/2", "author": "Imperion1"}, {"rating": 4.0, "review": "The FireTV is a better product then most out there, but it also has some usability issues.  I have had the box for a couple of days and so far I have discovered that the FireTV remote does not control some applications once the app is up and running.  the biggest miss is that once you launch NetFlix the remote no longer works, the only way I was able to stop the movie was to unplug the FireTV BAD BAD BAD.  I have found similar issues with internet radio apps. Come on Amazon these are basic usage models...please update the software to enable the remote to control all apps while the app is in use!Update: Now having used and played with firetv for a while it would be wonderful if Amazon would link and sync the music profiles and play list between Amazon Prime music/my music and firetv music!", "verified": true, "helpfulness": "1/1", "author": "Paul Mahoney"}, {"rating": 5.0, "review": "Love this, and as a Prime member, I have not had to add Netflx nor Hulu Plus ...yet! Goodbye cable.", "verified": true, "helpfulness": "2/3", "author": "David"}, {"rating": 5.0, "review": "Great device for streaming.Strong hardware that can handle everything you throw at it", "verified": true, "helpfulness": "0/1", "author": "Shahari"}, {"rating": 5.0, "review": "Once we figured out that our WiFi password was to complicated, we made the necessary changes and it has worked great.", "verified": true, "helpfulness": "0/1", "author": "Juneau"}, {"rating": 3.0, "review": "nice device. HBOgo wasn't really available. formatting is terrible. not as many amazonprime conent. voice deal is a joke. other than that fire tv is good to pretty good", "verified": true, "helpfulness": "0/3", "author": "jason waldrop"}, {"rating": 5.0, "review": "I LOVE this device!!!!  The coolest part is being able to search by voice command.  I use my Fire TV each and every day, either for listening to music while I work or watching TV or movies.  I got rid of all but basic cable after getting this.  In fact, I got two of them so I can watch in the den or bedroom, and they are somehow synced so that when I stop a show in one room and shut down that t.v., I can resume where it stopped in the next one.  And it automatically downloads my Kindle camera and uses my photos as a screen saver.  I'm totally sold on it!!", "verified": true, "helpfulness": "0/0", "author": "Harley Figge"}]