[{"rating": 5.0, "review": "By now a review isn't necessary as many others have sufficiently reviewed it, but I really do love this dongle.  Primarily, I use Google Play Music as my music storage and player.  I really enjoy being able to switch from watching TV to playing music with almost no effort.  Just push the cast button in the music app and start playing my music on my home system.  The TV input switches as soon as I cast something, so there is no need to get the remote and switch to the correct input first.  Now, if Google can get some more apps on board (like Showtime, which is doubtful now with the Amazon contract) it will be that much better.", "verified": true, "helpfulness": "0/0", "author": "Dale K"}, {"rating": 5.0, "review": "Just a few words: Excellent.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Very few apps for the IOS user to utilize. Taking it to another location required a new setup that sometimes didn't work using only my Ipad. Setup was always successful using my laptop however. Always a delay awaiting the connection to establish. Displaying the desktop using the app store browser was virtually unusable.", "verified": true, "helpfulness": "0/1", "author": "Wayne Whaley"}, {"rating": 4.0, "review": "Doesn't do it everything, but close enough.", "verified": true, "helpfulness": "0/0", "author": "Bader Koot"}, {"rating": 5.0, "review": "Bought 2 of these, I will be buying more. Enough said!", "verified": false, "helpfulness": "0/0", "author": "Dr. Vlad"}, {"rating": 3.0, "review": "I've had two Chromecasts for several months now. I run it from my Samsung Galaxy S4 smartphone, and I have a subscription to Netflix, which I also run from my smartphone.  While I like the convenience of being able to watch the movies and TV shows I want to watch, I have to say that the Chromecast does not work as well as I would have hoped as a product from Google. I constantly get a message that says the the Chromecast cannot connect to my wifi, even though my phone and my home computers have no trouble. I also get a message that says it connects to the wifi, but cannot connect to the internet. Again, my phone and computer have no trouble with internet access. Netflix is always \"losing\" the device, and when it does, I have to reboot the Chromecast.  Also, when watching stuff through the Chromecast from Netflix, the shows I'm watching are constantly buffering.  I thought the problem was Netflix, but when I watch Netflix directly on my home computer, I have not had any issues. That leads me to believe that the problem is the Chromecast. I would have expected something from Google to be a bit more consistent.", "verified": true, "helpfulness": "0/1", "author": "David P. Bretz \"DB\""}, {"rating": 5.0, "review": "Love the convenience - never used a product like this before but it's awesome!", "verified": true, "helpfulness": "0/0", "author": "Janette Stell"}, {"rating": 5.0, "review": "It's amazing how often we use the Chromecast. Not just for Netflix streaming but casting internet pages, video, pictures etc! No need to have a computer directly hooked up to your TV anymore, which helps de-clutter the space. Really user friendly device overall.The one downside is that there was sometimes a connection issue when trying to draw power for the Chromecast from the TV, so we do have to plug it into a regular outlet. Not a deal-breaker by any stretch, but a little annoying.", "verified": true, "helpfulness": "0/0", "author": "G. Schultz"}, {"rating": 2.0, "review": "It is a great product as long as it works. When it fails you cannot get a straightforward answer. They do not honor their warranty and want to charge your cc for $35 until they get the product back. What a joke. Just send an rma get it back then send the new one. I have waited almost 3 weeks and nothing but email after email. Plus they lose your info over and over.Also they apologize a thousand times and you get one cs after another. When you say what you want them to do it takes longer to get a reponse from them. The Asus group who allegedly holds the warranty does not even have the Chromecast listed. Where do you go from there? Nowhere. You cannot even contact google about it. In most cases (blogs) you will see the average breakdown time is 6 months. You cannot return it, because of the Asus warranty, but you get nothing from them. Millions made and a whole lot of dissatisfied users. Google do a better job. The product is great, your CS is not.I give 2 stars for service and 5 for the product.", "verified": false, "helpfulness": "0/1", "author": "Senora"}, {"rating": 5.0, "review": "Must have for streamers. Watched FIFA WC 2014 on my TV, it was brilliant. Even with its limitations it was great.", "verified": true, "helpfulness": "0/0", "author": "S. Yedavalli \"Yash Yedavalli\""}]