[{"rating": 5.0, "review": "Excellent just excellent it could have better features but in the end and most of the time is the only thing you are going need to stream your favorites shows", "verified": true, "helpfulness": "0/0", "author": "Luis Munarriz"}, {"rating": 1.0, "review": "good idea but no good with restrictions on using appWhat is point when u cannt play or view anything from computer  unless it is viewed throu chrome", "verified": true, "helpfulness": "0/0", "author": "nanda"}, {"rating": 4.0, "review": "Not enough apps yet but it has a great quality. For 35 dollars it is a great deal ! !", "verified": true, "helpfulness": "0/0", "author": "Fernão Guerra"}, {"rating": 1.0, "review": "a one trick pony! this is a joke when it can only stream netflix and you tube only! my tv is smarter than this.", "verified": true, "helpfulness": "0/0", "author": "oggie"}, {"rating": 5.0, "review": "Great Device, useful for more things than you could possibly realise. Students especially its great for group projects when you need to get something on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Paul Prout"}, {"rating": 5.0, "review": "The google Chromecast is easy to use, great video reproduction and easy to install.What is better than watching Breaking Bad streaming from NetFlix on the 60\" LCD?", "verified": true, "helpfulness": "0/0", "author": "Philippe Clement"}, {"rating": 5.0, "review": "Very useful, clever and inexpensive product. Great for YouTube casting, sharing a big screen is always better than watching videos on a small smartphone display.", "verified": true, "helpfulness": "0/0", "author": "Polczer Gabor"}, {"rating": 4.0, "review": "Pretty much perfect for what it does – especially Netflix – but it still doesn't do enough.  Open up the APIs, Google!", "verified": true, "helpfulness": "0/1", "author": "Michael Schaap"}, {"rating": 5.0, "review": "This product does everything it's suppose to do. Plan to purchase more for my other tv's so I don't have to move around the one I have. The only small issue is that the show or movie that is playing on the tv continues if try to pause or switch to new show. Quick fix is to unplug from tv and it resets itself.", "verified": true, "helpfulness": "0/0", "author": "Curtis Lane"}, {"rating": 3.0, "review": "Only 3 Stars because it doesn't work with the most Apps in Germany now.we are waiting for Updates  this time.", "verified": true, "helpfulness": "0/0", "author": "schuetzi13 \"schuetzi13\""}]