[{"rating": 1.0, "review": "No support for universal remote.  The search only searches Amazon Prime, not any of the other services like Netflix or Hulu.  Third party apps are slow and clunky.  Amazon Prime doesn't add any benefits or movies not already available on Netflix.  YouTube App is horrible, yet the only one that performs reliably.  This thing's performance is a total dealbreaker for me.", "verified": true, "helpfulness": "0/1", "author": "J. Guenther"}, {"rating": 2.0, "review": "Although technically, the box works fine, I really don't like the way Amazon relegates all other streaming services to the back burner, such as Netflix. Amazon tries to promote it's own streaming service while making others somewhat inconvenient. To activate Netflix, you have to open a selected Netflix application, and of course, audio search doesn't work in anything but Amazon prime, although they blame that on licensing issues. In any even, I recall when I had a Roku box, all of the streaming services, including Amazon prime, Netflix, Hulu etc all were equally accessible and convenient. I believe Amazon is under the mistaken impression that people have some kind of loyalty to one streaming service over the other, which I doubt is the case. For me, I use both Amazon Prime and Netflix and would appreciate a platform that makes it equally convenient to use either. Although I bought an Amazon Fire box last year, and it works fine, I'm ditching it for a Roku 3. This is the first time I have not liked an Amazon product/service", "verified": true, "helpfulness": "2/2", "author": "Eric Cohen \"patent attorney\""}, {"rating": 3.0, "review": "It was very user friendly, however the price isnt so consumer friendly", "verified": true, "helpfulness": "0/0", "author": "robbie"}, {"rating": 3.0, "review": "Have no idea why I bought this. Have Roki. Have Apple TV. Can Mirror TV. Have Smart TV.Dumb purchase?", "verified": true, "helpfulness": "0/1", "author": "XandroniX \"Western MA Buyer\""}, {"rating": 3.0, "review": "It is pretty awesome working with Prime. But, like Apple, Amazon is trying to shove it's own services down your throat, as expected. For example, either Vudu/Ultraviolet won't make and app for it, or Amazon won't allow them to do so. In addition, the voice search works great with Prime, but not much else. So, yeah, it's a $70 paperweight while I switched to the Roku 3. At least is was on sale when I bought it.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey P. Wilson"}, {"rating": 5.0, "review": "Love this product.  We have had it for several months and have been thoroughly pleased. I was able to set it up in minutes and actually carried it with us to use on vacation this year. My six year old uses it without difficulty.  It segregated Prime viewing from rentals and purchases, which allows us to find something without worrying about charges.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Patterson"}, {"rating": 5.0, "review": "This is a terrific little device. I might need a second one.", "verified": true, "helpfulness": "1/1", "author": "Mark Eastwood"}, {"rating": 5.0, "review": "Love it watch Netflix others are more expensiveOrdered sling can't wait", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"CCS Enterprises\""}, {"rating": 5.0, "review": "I have been watching and waiting for a realistic replacement for cable tv...my current cable bill is 230 a month and really i only watch a few channels, i have netflix and hulu plus and watch them more than i do the tv but there are weekly tv shows that i like and not all of them were available online and i suspect that may change as time passes although i expect cable companies will become nasty about the number of subscriber they're losing as more and more people get wise to their schemes. Cable companies have major influence over networks and producers of television and film industries, i expect them to deliver ultimatums soon.Amazon TV is very very good...the box itself is technologically speaking, perfect...what it is though is just the gateway to online services and that's where things have to grow if this market is to challenge cable and satellite...when it does the people offering those online services will become the next cable like monsters and prices will go crazy for subscription services. I hope not but it's historically accurate.The device seems trouble free and menus are simple to navigate and use for the tech savvy and maybe even some that aren't...i'd like to see expanded options on the remote to make finding favorites a bit faster with either dedicated buttons or programmable options. The voice search option is fantastic but should be an ongoing project that allows its use to expand to other functions.It seems that hollywood is limiting what it releases to companies like amazon and netflix to movies that don't do too well in theatres, the B grade stuff mainly...until it's old news. I'd like to see theatres remain because that's just a good time but movies at home need to be good too and not a year or two later. I hope that movies and music companies can figure out a business model that works for everyone...Overall...the device is as good as it needs to be, waiting won't get you anything better in hardware, the improvements are now on the consumers in that we need to increase our numbers and show some demand for streaming services beyond what's available now so the waiting part is over and  we need to take part.Five million amazon/apple/roku tv subscribers will attract better services online, five thousand will not. Time to jump on the bandwagon folks.", "verified": true, "helpfulness": "2/2", "author": "J. Parkes"}, {"rating": 5.0, "review": "its great and you could take it anyware", "verified": true, "helpfulness": "0/0", "author": "EDITH"}]