[{"rating": 5.0, "review": "This is such a great item, turned my tv into a smart tv, cheaper than buying a new smart tv.set up was easy, and this can travel with you as well ! Love it !!", "verified": true, "helpfulness": "0/1", "author": "Diane  snoderly"}, {"rating": 5.0, "review": "I bought this little gadget with the idea that I would just test it out for its novelty. It arrived quickly and I plugged it into my television and was pleasantly surprised with the lovely images that appeared on my screen. The setup was quick and painless and with a little research figured out casting a tab from my computer, streaming Songza and watching movies on Netflix, Hulu and Youtube. All of the sudden I started realizing the implications of this little gadget. During the holidays the family sat around the television and we easily searched for and watched entertaining youtube videos together on the large screen. My parents who might not see these things were highly entertained. What was also nice was that between 2 laptops and an iPhone we were able to have multiple people contribute with favorite vids.I want to add that my television is considered a smart tv that already has the youtube, Hulu and Netflix apps installed on it. Honestly I have a hard time with it because I'm not willing to invest the $80+ that is required for a keyboard setup etc to make interacting with those apps easy. The Chromecast is the answer. Find what you want on your computer, iPhone, Android, and/or tablet and then cast it to your tv without having to slowly enter your search into the onscreen fields of your smart tv. It's portable, so take it with you when you are visiting others, or on vacation. Don't pay the exorbitant prices for movies in the hotel room, get yourself a Chromecast and all is good.", "verified": true, "helpfulness": "0/0", "author": "Peri A Moritz"}, {"rating": 2.0, "review": "If you have an iphone and ipad, this does not do you any good unless you just want to watch netflix. The apps that can be shown on TV are only a couple. Pay more and get an Apple TV or Roku 3.  I was very disappointed in Google after buying three of these for my different TVs. All I can say is C'mon Google- put some finishing touches on your products before you release them. You have billions of dollars and a few engineering friends and I could put out something with a better user experience.I kept the products as I hope Google comes around and adds more functionality.", "verified": true, "helpfulness": "1/1", "author": "Guru1 \"Guru1\""}, {"rating": 5.0, "review": "What I like about it: it's small, travel sized, only has a onetime fee of just 35 bucks works on any TV that has that HDMI( what ever it's called!) port.  Very easy and quick instillation; and I am not an electronics wiz.It plays just about any, yes just about any streaming video in FULL SCREEN on my TV from any chrome browser website.Also installing the chrome browser and cast extension (so I can cast from the chrome browser to the device and therefore mt TV) was not difficult for me.Ok now the even more convenient part, cast streaming video directly from your smart phone or tablet through certain apps like YouTube, Netflix, HBOGO and RealPlayer to your TV in FULLSCREEN.Now the quality of the picture on the tv in my experience is superb; very sharp very clear the large majority of the time. (See below for more on this)What I Don't Like:For streaming content from apps on your phone or tablet, the app must be enabled with chromecast or you cannot cast it. Please note: You can however stream from any website in a chrome browser.To cast from a website on a chrome browser, must be done from a computer. (This doesn't bother me but it may bother you and it certainly is not as convenient as from a mobile device).And I have noticed that sometimes the video cast from the website is not excellent and sometimes a bit blurry. I have not noticed this often and I am not sure why this happens. Video cast from an app on the mobile device has NEVER disappointed me; picture is perfect!ALSO the Chromecast needs power so either plug into a near outlet OR USE THE USB and plug into to your TV if it has a USB port,  I used the USB port on my WII and that works for me.", "verified": true, "helpfulness": "1/1", "author": "Vanessa Vargas"}, {"rating": 3.0, "review": "Somehow through all the advertisements and watercooler discussions I've had about the function of this device, I missed the fact that HDMI does not offer power...This dongle must be plugged in to function.I thought that it was going to RID me of a cable being a wireless receiver!Anyway, it's not so bad - it comes with a short USB cable, so if you have a USB input close by you can power it that way.Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Aaron Bosworth"}, {"rating": 3.0, "review": "They sell this like it will let you stream \"anything\" from your computer to your TV but it actually has a lot of limitations. All it does is remove chrome from the video it's broadcasting, so depending on what you're playing it may or may not be effective. Sometimes the screen image is smaller on your TV than the actual screen. Sometimes there's a lot of lag. It works much better with Google streams such as YouTube than it does for other non-Google products (big surprise there!). For $30 I guess you can't expect much more. Good for showing YouTube videos to the kids on the TV.", "verified": true, "helpfulness": "2/3", "author": "RaeLehman \"mom, designer, nerd\""}, {"rating": 4.0, "review": "Have had good luck with the Chromecast when using YouTube, but tried to use it with Amazon Prime and it was laggy and choppy. We went back to hooking the laptop up to the HDMI port instead of using the Chromecast for Amazon Prime video.", "verified": true, "helpfulness": "0/0", "author": "Bert Poly \"polygrfx\""}, {"rating": 5.0, "review": "exellent product, i used with my iPhone 4S and iPad mini 2, and works great!!! recommended to everyone who likes Youtube, Pandora, Netfix", "verified": true, "helpfulness": "0/0", "author": "leo"}, {"rating": 5.0, "review": "The Chromecast is a capable, powerful, inexpensive little device, and I find it very handy so far.  I'm amazed that some people (including a tech blogger I generally respect) are complaining that it's difficult to set up and generally of little value.  I think that many people, including the blogger, misunderstand what the Chromecast does.  The key concept is, the Chromecast does the streaming, not your phone.  Your phone only serves as a remote for netflix, pandora, etc.  Once you start playing media on the Chromecast, you can turn your phone off, or flush it, and the media continues.  This is a unobtrusive, simple way to stream video or music to any TV with HDMI inputs.", "verified": true, "helpfulness": "0/0", "author": "barotropic \"albedo\""}, {"rating": 4.0, "review": "Got one from BEST BUY during thanksgiving! Very useful and handy. Can setup, stream from iPhone very easily. If you can install chrome browser in your mobile phone/device then you can stream. I cold not with surface tablet as surface rt doesn't allow chrome to be installed. The cool thing that I like about this device is, it just uses the mobile device or iPhone like a remote control. You can switch off the phone after you start the streaming. The device directly talks to your WiFi once the streaming is initiated. It was so useful that I bought second one from Amazon for the bedroom TV. It doesn't use the mobile for continued streaming, so no worries on consuming data or draining your battery. The HI definition consents are simply amazing. Have not noticed any lags, make sure you have good wireless N router with reasonable range coverage if your TV is too far from your router. Worthy purchase. Note: Internet Explorer IS NOT SUPPORTED.", "verified": true, "helpfulness": "0/0", "author": "Pandian \"Pandian\""}]