[{"rating": 1.0, "review": "I am very frustrated and disappointed by virtually no instructions to help you.You better be a computer nerd if you buy this unit.", "verified": true, "helpfulness": "2/7", "author": "Rak Kumar"}, {"rating": 2.0, "review": "Got the product today, but greatly disappointed with the results. Great idea from Google, but poor execution. Slows down the refresh rate from youtube. Picture is jerky and freezes often. I had great expectations from the product after the reading raving reviews. this is a Beta product and not suitable for commercial product. A lot more work needs to be done to make this somewhat workable.", "verified": false, "helpfulness": "0/0", "author": "Sanjay Mehra \"XXXX\""}, {"rating": 3.0, "review": "There is significant lag time between pausing it on your phone/laptop and the TV pausing. That is when it's working, sometimes the pause/play/stop buttons don't work at all and I would have to force close the Netflix app then go back into it.Another down side is it doesn't play any Amazon Instant Prime videos. I knew ahead of time it would only play videos from Netflix and YouTube when using my phone, but I thought it would play Amazon prime videos when I stream them using the Google chrome browser on my laptop. Sadly, it does not.I'm sure they will have more apps in the future but right now it's just not really as good as I had hoped it would be.", "verified": true, "helpfulness": "0/0", "author": "janice"}, {"rating": 4.0, "review": "and at low price of $ 35. and three months of netflix  nothing better than that  good buy !!!!!! c", "verified": true, "helpfulness": "0/0", "author": "Jayshree Vaswani"}, {"rating": 4.0, "review": "First time setting up and using a streaming device for my TV.  Not a gamer and haven't even bought a blue ray player yet but thought the Netflix option was too good to pass up.  Unfortunately, Netflix is really lacking in up to date newly released quality movies.  For goodness sake they don't even have Smokey and The Bandit or some of the other old classics available, Really? what's the deal with such limitation.  Hopefully the Chromecast options will be increased and I'll be able to use it with Hulu or maybe even Block Buster online.  Looking at the Google Store does net some additional options for movies but again not the full range I'd like to have access to.With that said, the Chromecast worked perfectly and the quality of picture, sound etc is very very good.  No complaints.  I have one in my media room and will likely add one to my family room.  Can't beat the cost for the option.  With a Best Buy purchase you get 3 months of free netflix as well.  Pays for itself if you just watch a few movies.", "verified": false, "helpfulness": "0/1", "author": "TX Viewer"}, {"rating": 5.0, "review": "Great for on the go or just at the house.  Fantastic for streaming Netflix and YouTube.  Streaming to the TV from Chrome is fairly consistent as well.  Could charge double and still be worth the money.", "verified": false, "helpfulness": "0/0", "author": "Nicholas Case"}, {"rating": 5.0, "review": "it is affordable and easy. im loving it. i have bought it from best.buy. its been two weeks now - it is pretty cool.", "verified": false, "helpfulness": "0/0", "author": "sohan"}, {"rating": 5.0, "review": "This is a very simple dongle that turns any TV into a \"smart\" TV (Though smart TVs are not very smart anyways). Installation is a breeze. Just follow the steps and you should be fine.Reponsiveness is a bit slow with the iPhone 5. It takes a few seconds for the app to start playing and there is a lag time between the time you hit pause in the App and the video actually pausing. Other than that, it's a pretty solid device.For $35, it's a bargain.", "verified": true, "helpfulness": "0/0", "author": "Erik"}, {"rating": 4.0, "review": "If you're missing \"smart\" features on your TV with an HDMI input, the chromecast is an option that I recommend for the price. When a controlling device, such as a smartphone or tablet, is connected to the same network, each supported app will have an additional option to \"cast\" the content. When a content is selected, the chromecast will request and receive the stream from the associated server and play the file. The downside to this is that local content playback is not supported at this time (unless you play a movie file on Google Chrome and cast the tab to Chromecast).Currently, the only \"apps\" supported are Netflix, Youtube, Chrome Tab Casting, & Google Play/Music.The apps for Netflix, Youtube, & Google Play acts a controller & content lookup/queue management agent which is convenient considering only 1 \"remote\" is needed.As for the Chrome Tab Casting extension on Google Chrome, you are able to screenshare what you're viewing on your PC (connected within the same network). The quality is dependent on the strength of your wi-fi signal but there are workarounds if the buffering is severe, such as lowering the quality of the packets that are sent from PC to Chromecast.Overall, it was a good purchase at $35 based on the current apps that support the device. For my purposes, it accomplishes 80% of what a smartphone-based streaming ecosystem should be, but others may be disappointed in the lack of app support. I was able to purchase 3 units for TVs both with and without \"smart apps\" capabilities so that I could somewhat unify the systems within the house (since you can control which content can be viewed on certain TVs).With proper support from Google, I believe this will be a great investment for the future to somewhat resolve the \"fragmentation\" issues of Android OS & Electronic Manufacturers.", "verified": true, "helpfulness": "0/0", "author": "Parkness"}, {"rating": 5.0, "review": "Works very easily and as advertised.  I wish there were more apps that took advantage of it, but it's very early. I expect most apps to start building support into them.It's very easy to use.  My 4 year old is able to start Netflix on my iPad, and knows the button to cast to the tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]