[{"rating": 5.0, "review": "It took us about 5 minutes to download the app and about a 5 minute learning curve, and we are by means tekkies.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Douglas L. Partlo \"Papou\""}, {"rating": 4.0, "review": "I had my doubts about this but so far so good.  I live in an old house w/cement walls and have always had issues w/the wifi signal getting to my smart tv.  I can finally watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kay Mena"}, {"rating": 5.0, "review": "I went ahead and ordered one of these on a hunch that it would play files based on the fact that Google Chrome (the browser) is a pretty good media player in and of itself. I have tried this on both my PC and Mac with success.  Once you have installed the software as described in the instructions there will be a chromecast button on the top right of your browser all of the time.  Simply drag and drop the file that you want to play into the browser and when it starts playing go to full screen on your browser and you will have full audio and video on your TV", "verified": true, "helpfulness": "1/1", "author": "Intimate_Things"}, {"rating": 5.0, "review": "A thousand percent better than Roku!  We purchased a Roku (and returned it) from Amazon.  This amazing little plug-in is spot on!  Streaming has become a cinch!", "verified": true, "helpfulness": "0/0", "author": "Marie A. Mancini \"Marie Mancini\""}, {"rating": 5.0, "review": "I absolutely LOVE this! I'm ordering another for the bedroom TV set! I would recommend getting if you don't want to mess with HDMI cables anymore.", "verified": true, "helpfulness": "0/0", "author": "Ryan C. Harris-Hernandez \"Ryan C Harris-Hernandez\""}, {"rating": 5.0, "review": "bought as a stocking stuffer for my wife and am really impressed with its simplicity and quality of video.  we have a 60 inch flatscreen and Netflix comes in very clear.  there's a slight delay between what's on your laptop versus the screen but not really an issue for me.", "verified": true, "helpfulness": "0/0", "author": "Amit K. Singh"}, {"rating": 4.0, "review": "Works as advertised.  Easy to set up, however, if you have a hidden network you will have to unhide it.  If you have MAC filtering turned on, you will have to look around for the device's address.Biggest negative is that it Youtube doesn't cast all of their videos properly.  Some videos end up playing on BOTH the TV and computer - eating up bandwidth.  Also not compatible with Silverlight as of this writing.Would have given it 5 stars if it were not for the above shortcomings.", "verified": true, "helpfulness": "0/0", "author": "R.L."}, {"rating": 1.0, "review": "First things first.  I love the idea of the chromecast.  However, there is one very HUGE drawback to it.  It does not actually stream content from your phone.  All your phone really is, is a remote control for it.  To do anything with it, you have to have a WIFI internet source (which CANNOT be your phone).  All the ads and literature imply that you are playing stuff from your phone.  Then you read the description of the package very closely and decipher the cleverly word description and find out that your phone merely controls it (i.e. your phone is an overpriced remote control for it).  Now if you have a good, high speed, unlimited data, wifi internet access, then these facts will not really matter to you.  This thing will work just fine for you then.  However, for much of Rural America, this is simply not an option.  Our phones out here ARE our internet access.  My phone has a good 4G connection and has an unlimited data plan, but without another good internet source, this device is rendered useless. You can't even stream videos and pictures that I have taken on your phone through it.", "verified": true, "helpfulness": "0/0", "author": "Contrary One \"wagsmd\""}, {"rating": 5.0, "review": "What a joy to get an afforordable tool that not only lives up to its promises, but is even better than expected.  I though it was just like a remote, I was not anticipating that I could use my phones functions while the chrome cast streamed tomy TV.  Its a lot of fun.", "verified": true, "helpfulness": "0/0", "author": "Dayman_fanatic"}, {"rating": 1.0, "review": "The product was shipped quickly. however i could not get it to work. it would not connect to my laptop. i called google and what not and still i couldn't get it going. i ended up giving it away. i wasted my money for nothing. this company did nothing wrong. it just wasnt't meant to be i guess.", "verified": true, "helpfulness": "0/0", "author": "Bear"}]