[{"rating": 5.0, "review": "This is what I want everyday !!My father has a big screen TV.He wants to see Youtube clip on TV.But it was not smart TV.So~ I bought the device(Chromecast) for him.After installation, he sent the clip to TV.He was satisfied with my gift.", "verified": true, "helpfulness": "1/1", "author": "ryusunjong"}, {"rating": 3.0, "review": "Very useful especially when you are at home whit your friends BUT only work whit youtube and Netflix because Google store don't have any app for this", "verified": true, "helpfulness": "0/1", "author": "andres"}, {"rating": 4.0, "review": "It works great and amazing functionality for the price. I still use my roku mainly but when I want to stream something from an online website to my computer this is definitely the best way.", "verified": true, "helpfulness": "0/0", "author": "David McMurray"}, {"rating": 5.0, "review": "Super easy to connect, works great for streaming stuff from the net to TV.  My favorite feature is actually the \"beta\" function that allows one to stream browser contents to TV.", "verified": true, "helpfulness": "1/1", "author": "Robert C See"}, {"rating": 3.0, "review": "The first Chromecast device Amazon sent me did not work. I spoke with Google support and they told me the device was defective and I should return it to Amazon. Amazon was very good about the return and replaced the device with another one. However, the second device also was defective. I spoke again with Google and they instructed me to return the device to Google and they would replace it. Both Google and Amazon were excellent to work with.Third time was the charm.  The replacement Chromecast device sent from Google works great.  Set up was a snap. Everything worked exactly as advertised. I'm now able to broadcast whatever is on my laptop to my TV using the Google Chrome browser and the new Google Chromecast device.  Just remember to download the Google Chromecast add-on to the Chrome browser.I rated this transaction as 3 stars because of being shipped 2 defective devices from Amazon. Fortunately, Google is really good about helping if there are any problems.I love Google Chromecast and would highly recommend you try it.  It's the perfect add-on for a flat screen TV.", "verified": true, "helpfulness": "1/1", "author": "GrampaMike"}, {"rating": 5.0, "review": "Stream movies in a chrome tab to your TV. And for only $35! Or stream Netflix - controlled with your phone. Just too cool for the price.", "verified": true, "helpfulness": "0/0", "author": "A. Miller \"Beefbag\""}, {"rating": 5.0, "review": "Huge bang for your buck with this, right now I have access to YouTube and Netflix and very easy to use. Great for people who aren't technically inclined.", "verified": true, "helpfulness": "0/0", "author": "Bryan Miller"}, {"rating": 2.0, "review": "Disappointed with the apps that will work with the device.  Works fine with Youtube and Netflix, but that is about it.  Wanted a device that I could project my browser onto a TV.  This device is great, but is incredibly limited by its lack of compatibility with almost any app.  Very disappointed.", "verified": true, "helpfulness": "3/3", "author": "Joel"}, {"rating": 5.0, "review": "I can watch all i want in 1 seconds without a cable, so its perfect to me this Media Player, only you need its wifi, that is all", "verified": true, "helpfulness": "0/0", "author": "Francisco"}, {"rating": 1.0, "review": "I'm sorry.  I guess I am truly an idiot.  Can't make this thing work.  Maybe my TV is too old?  Maybe this thing can't get a signal?  Me No LIkey this thing.  A total waste of my $$$.", "verified": true, "helpfulness": "0/0", "author": "DELLA"}]