[{"rating": 5.0, "review": "This has changed the way we use our TV.", "verified": true, "helpfulness": "0/0", "author": "Zachary J. Byrnes \"PsyStal\""}, {"rating": 4.0, "review": "Works okay for video and pictures, much better for audio.  Easy to setup and use.  Limited to Google products: Google Chrome; Google Play Music.Runs hot.", "verified": true, "helpfulness": "0/0", "author": "DHL"}, {"rating": 5.0, "review": "I have a Roku for Amazon prime and netflix, so I'm using Chromecast for specific applications.  I'm on vacation and have been accessing my Comcast premium channels through their xfinity app and it works perfectly.  I also can watch wildlife cams on the big screen which has been a significant improvement vs a computer screen.  The sound is great too.  I love the Roku but this has definitely delivered incremental opportunities for viewing things on a big screen at a great price.", "verified": false, "helpfulness": "0/0", "author": "obxbarb"}, {"rating": 1.0, "review": "If I were Google, I would NOT be in the hardware business. I have tried multiple times to get this thing to work. I have exchanged it at least 3 times.  I have spoken to Google customer support. Do you know what they told me? \"The Chromecast device needs to be within 15 to 20 feet of the router\". That is quite a restrictive requirement! I would not recommend this product to anyone!", "verified": false, "helpfulness": "4/4", "author": "Anonymous"}, {"rating": 5.0, "review": "muy bien el producto", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Good, but should be compatible with a lot more applications. What is the reason to be \"locked\" ???", "verified": false, "helpfulness": "1/1", "author": "NIKOLAOS THEOFILOU"}, {"rating": 4.0, "review": "Good product wish it had more app", "verified": true, "helpfulness": "0/0", "author": "mark josephs"}, {"rating": 5.0, "review": "Wonderful product", "verified": true, "helpfulness": "0/1", "author": "B100"}, {"rating": 1.0, "review": "Tried setting it up on three different networks, always returned message could not find any chromecasts. Just missed the deadline to return to amazon.", "verified": true, "helpfulness": "0/0", "author": "nick alfonso"}, {"rating": 3.0, "review": "It doesn't work very well. Quite laggy and slow :(", "verified": false, "helpfulness": "0/0", "author": "Daniel Spence"}]