[{"rating": 3.0, "review": "The image quality is below standard. The advertisement spells the resolution to be 1080p; however I find it to be 640 by 480p. It's even below 720p. The picture is fuzzy, the deepness of color is missing, Besides the picture quality, the unit works fine, I will only buy the unit if Amazon improves the picture quality to true 1920 by 1080p. This why I am giving it three stars.", "verified": true, "helpfulness": "0/1", "author": "Gurnam Singh"}, {"rating": 5.0, "review": "I've just had this for a few weeks but so far it's so easy to use.  I'm thinking about getting rid of DVR.", "verified": true, "helpfulness": "0/0", "author": "Guy Kincaid"}, {"rating": 5.0, "review": "Remote worked nicely and now I can see my shows with ease.", "verified": false, "helpfulness": "0/0", "author": "Phillip Hernandez"}, {"rating": 5.0, "review": "Very good images and easy to use once set upThank you", "verified": true, "helpfulness": "0/0", "author": "cherif cisse"}, {"rating": 5.0, "review": "Amazon Fire TV Works great and was shipped on time.", "verified": true, "helpfulness": "0/0", "author": "Jeffery E. Catalucci"}, {"rating": 5.0, "review": "Great!!!", "verified": false, "helpfulness": "0/0", "author": "michael"}, {"rating": 5.0, "review": "Love it canceled my dish tv.", "verified": true, "helpfulness": "0/0", "author": "Deborah K. Baker"}, {"rating": 4.0, "review": "Great way to make your tv a smart tv on models that do not have this feature and to free up your computer while watching movies online. Only quirk, prime is good only in the US, reason why I am not subscribed since I live overseas. However, I'm enjoying the 30 day trial period while visiting my sister in California. Wish Amazon would consider having prime members overseas access to view movies.", "verified": true, "helpfulness": "0/0", "author": "Gusto \"Gusto\""}, {"rating": 3.0, "review": "The user interface is confusing.  The large icons make it hard to scroll and find things.  Needs work.", "verified": true, "helpfulness": "0/0", "author": "William Kelley"}, {"rating": 1.0, "review": "Never buy a REFURBISHED Amazon TV, this crap I received won't pass the load screen. :(Need help to fix this !Saving 5 dollars is not worth the trouble !", "verified": true, "helpfulness": "1/2", "author": "Kamau Stewart"}]