[{"rating": 3.0, "review": "Bought as a gift.", "verified": true, "helpfulness": "0/0", "author": "D. Taylor"}, {"rating": 5.0, "review": "Delivered fast and worked great", "verified": true, "helpfulness": "0/0", "author": "Keri"}, {"rating": 5.0, "review": "this device is awesome", "verified": true, "helpfulness": "0/0", "author": "hilly bartley"}, {"rating": 2.0, "review": "I'm not happy with Chromecast, mostly because my iPad is my TV remote. It can be slow at times and sometimes I have to reboot the iPad to get Netflix to work. Maybe not the Chromecast's fault, but still a pain. Also, I do not like that it doesn't get Amazon. This is just after a few weeks of using the stick, maybe I will grow into it, but I wish I would have bought another Roku or Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Lori Phillips"}, {"rating": 5.0, "review": "LOVE my Chromecast!  What a fantastic way to stream what is on your computer directly onto your television.", "verified": true, "helpfulness": "0/0", "author": "Natasha"}, {"rating": 5.0, "review": "We use this for YouTube and Netflix all the time.  Very simple to use and has a great picture quality.As I write this review on Amazon, I do have one complaint: Amazon Prime does not support Chromecast.  Sure you can hack the system and maybe make it work, but Amazon is missing the boat here.", "verified": true, "helpfulness": "0/0", "author": "Dan H."}, {"rating": 3.0, "review": "Needs better support for Chrome browsing.  Also MS doesnt support Chrome on the Mac so you will have audio issues with applications that use MS Silverlight (Netflix and Amazon Instant Video).  In reality its netflix and Amazon's problem for handing their streaming technology over to an inept company like microsoft, but none the less you will still suffer if you want your chromecast to work from a Mac", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "Excelent item", "verified": true, "helpfulness": "0/0", "author": "Diego Perez"}, {"rating": 4.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Castro"}]