[{"rating": 4.0, "review": "Great gadget wish it had more instructions when it came but I love it all the same, my phone is my remote that rocks", "verified": true, "helpfulness": "0/0", "author": "jessica heard"}, {"rating": 5.0, "review": "I received it just a few days after I ordered it and had it up and running within twenty minutes, at this time I only use to stream movies from Netflix but it is so convenient to pick the movie on my laptop and watch it on a large screen TV.", "verified": true, "helpfulness": "0/0", "author": "Dennis J. Deardorff"}, {"rating": 3.0, "review": "My husband and I watch a lot of Netflix, which was our main reason for purchasing the Chromecast. We tested it out at my parents' house and it worked great but unfortunately, when we went back home to France after the holidays, we were no longer able to use it. We have a VPN service and the hardware of the Chromecast prevents streaming through anything but a normal internet connection. We are still able to use it for YouTube videos and such, but anything like Pandora or Netflix will not work through the VPN. I highly recommend it for anyone in the US who wants an easy, wireless way to stream media from their devices to their TVs but don't try to use it abroad unless all you want to watch is YouTube.", "verified": true, "helpfulness": "0/0", "author": "Nicole A Stich"}, {"rating": 4.0, "review": "My chromecast was easy to install and it was working from my Samsung S3 with the first try.I have problems on my laptop where my Google Chrome browser can not find the device.This is because I have multiple network adapters and for some reason the app checks only the first adapter.This can be solved so that you just set the wifi adapter on top. This can be configured under Control Panel\\Network and Internet\\Network Connections then press ALT then advanced settings. There you can put your WiFi adapter on top.", "verified": true, "helpfulness": "0/0", "author": "Smail"}, {"rating": 5.0, "review": "It works so well even with not so fast wifi and lots of free channels to browse and super cheap! Its got a lot to offer besides netflix or HBOgo. Not a one trick pony!", "verified": true, "helpfulness": "0/0", "author": "Jaykm"}, {"rating": 1.0, "review": "You're required to update the device when you first set it up, but the update hung on 100% and has been stuck there for hours.  I've never been able to use it.  This product is garbage.", "verified": true, "helpfulness": "1/1", "author": "AC360"}, {"rating": 5.0, "review": "Bought this for my dad (who loves to watch his foreign soap operas and movies on his iPad) and now he can see them clearly and on the big TV screen. The whole family loves using it too! We can play practically anything from our laptops, phones, tablets, etc. Hope Chromecast expands to more apps, besides YouTube and Netflix. Amazon Prime Video and Hulu would be great additions. Overall, great to have and for only $30!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 4.0, "review": "It's awesome to finally be able to do Smart TV stuff on my non-Smart TV and for so little money. Initial installation is frankly complicated. Had to do some tweaking to my home router. Netflix, YouTube, Google Play Music... everything works great. Image quality is beautiful. I use it to entertain guests. One -kind of big- issue is that wifi reception is not as great as I expected it to be. I had to relocate my home router whenever I connected the Chromecast to the farthest TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Shnrz"}, {"rating": 4.0, "review": "This is great if you rely on services like Netflix for your movies.  We used to watch movies through our Wii but it was only connected to one TV and was a pain to move if we wanted to watch it on another TV as we have a 2 story house.  I got this for the master bedroom so now I just pull up a movie on my tablet and then send it to this device and watch it on the big screen.  This works really well Netflix and Youtube, not sure about other services.  You can stream content from your browser or other video player on your computer or tablet but it is just barely acceptable.  I know that Google is adding more Chromecast friendly apps but I have not tried them.  I imagine that in not too distant a future, anything you can play on your pc/tablet will work well with this device.  For the price, its well worth it.  Apple TV is similar to this but costs 3-4 times more.Pros: Works well with new Chromecast friendly apps being added.  Inexpensive.Cons: None really.", "verified": true, "helpfulness": "0/0", "author": "IShopOnLine"}, {"rating": 5.0, "review": "The Chromecast is easy to set up and it delivers an excellent picture. You can't beat the portability or the price.", "verified": true, "helpfulness": "0/0", "author": "stockjock"}]