[{"rating": 5.0, "review": "Next best thing to chocolate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon. Fire TV  is fantastic if you are a prime Amazon holder you need this device, with all the free videos on prime you'll never get bored using this device !", "verified": true, "helpfulness": "1/1", "author": "Ronald E. Richard"}, {"rating": 4.0, "review": "Overall a great streaming media player.  I can access all the online content that I'm looking for, including the basics like Amazon Instant Video, Netflix, Hulu, Crackle, YouTube and Pandora (what I consider the \"must have's\").  But there are also some nice bonus apps like Vimeo, Vevo, and Revision 3.  There is an iLoveRadio app as well, but as I absolutely refuse to endorse the use of the word 'heart' as a verb (it's a noun people!  You SEE the heart, but you SAY 'love'), I did not test that app.  Sadly, there is no Slacker app, which I used almost as much as Pandora on my Blu-ray player.  With Serviio installed on my computer, I can access all my personal videos and music via the free Vimu Player for Fire TV.  My photo collection is easily accessed with the Amazon Cloud Drive installed on my computer.  Flixster gives me access to new movie previews, as well as my UltraViolet collection.  (Though the quality of UV movies is quite atrocious, and I'd really prefer to watch the original DVD or Blu-ray than the UV copy.)The built-in Wifi connection works every bit as good as a hard wired connection, which is nice because my Blu-ray player has always seemed to work better over wired than wireless.  The Fire TV device is snappy and very responsive to commands, and the Voice Search actually works extremely well.  I've had only a couple missed guesses so far, and there is always the text entry if needed, which I find far more usable than the text entry mode on my Sony Blu-ray.There are still a few improvements needed, though, including full access to Amazon Music, both Prime content and my own Cloud content; the screen saver doesn't kick in when paused on a Netflix movie, which could damage a plasma or OLED TV if left paused for too long; the Slow speed setting for screen saver images is too fast, the Medium setting is WAY too fast, and the Fast setting is \"Did you see something?\" (10, 20 and 30 seconds would be much better intervals for those settings); the Voice Search should include Netflix, Hulu and Crackle as well as Amazon content, and be sorted into those categories; there needs to be a way to see ONLY Prime movies and TV shows in both search results and in the category browsing.  All of these issues are correctable, so I reeeeally do hope they're addressed in a firmware update soon.My biggest complaint with Fire TV is the price.  Most of the truly useful features of Fire TV (I don't consider the gaming at all useful) can also be done by just about any Blu-ray player in the $100 range, which has the added advantage of also being able to play Blu-ray disks, still by far the highest quality source of video content available.  This device should be priced at just $50, for which it's a definite must buy.  At $100 though, it's still an excellent device, but the value goes down quite a bit.", "verified": true, "helpfulness": "0/1", "author": "Jim Simon"}, {"rating": 5.0, "review": "AMAZING. NO BOOTING AND MORE TO THE POINT NO REBOOTING. THE RESPONCE TO THE REMOTES COMMAND IS INSTANTANEOUS. IN ONE CLICK YOU SEE ALL THE SHOWS AND MOVIES AVAILABLE AND ONE CLICK LATER YOU ARE WATCHING WHAT YOU CHOSE, ALL IN AN INSTANT. IF YOU ARE WATCHING A SERIES, WHEN NEXT YOU WANT TO WATCH AGAIN IT AUTOMATICALLY STARTS WHERE YOU LEFT OFF. THE VOICE COMMAND IS EVEN MORE AMAZING. SAY THE NAME OF A MOVIE OR SHOW AND THAT IS WHAT YOU SEE.", "verified": true, "helpfulness": "0/0", "author": "ahl"}, {"rating": 4.0, "review": "I have been a Prime member for a while just to take advantage of the free 2 day shipping, but never really used the streaming video service until I got my FireTV.  I really like it.  The interface is easy to use and content is easy to find.  There is a LOT of content available on FireTV, but not all of it is free with Prime.  Pay close attention to whether content is Prime eligible or not.  It is clearly marked, but it doesn't exactly jump out at you.  This could become an issue if someone who is unfamiliar with the difference is using your FireTV.  It is directly linked to your Amazon account, so if you use one-click purchasing, someone could buy a LOT of content without even knowing that they're costing you a lot of money unless they're paying close attention.It's pretty clear that Amazon is trying to create their own ecosystem to compete with Google and Apple.  I am an Android kinda guy (Google ecosystem, not Amazon's version) so I don't get the full potential out of FireTV.  A lot of my content is stored via Google Play, and the FireTV will handle it, but it is done via the YouTube app.  I imagine the experience would be similar for someone deeply invested in Apple.  Chromecast or AppleTV may be a better option for someone who doesn't really have a lot of buy-in to Amazon.If you are heavily invested in a different ecosystem and already have a Netflix account, FireTV may be of limited value to you, especially if you are not also a Prime member.  If you are deep into Amazon's ecosystem (or not really partial to any) the FireTV is a great addition to your media consumption.  If you already get most of your content from Google Play or iTunes, the FireTV may be just another place trying to suck money from your wallet.  For this reason I'm going to give it 4 stars.  I can't really blame Amazon for trying to wall off their own world, but it is not as universal as it could be for all users.", "verified": true, "helpfulness": "0/0", "author": "M. Orzel"}, {"rating": 5.0, "review": "Finally kicked my cable company to the curb!!! I'm streaming Amazon Prime, Netflix and Hulu Plus with this box and I have more to watch then ever before and it cost just a fraction of the price! LOVE IT!!!!!! <3  My boys love all the games too! Go for it!", "verified": true, "helpfulness": "0/0", "author": "T. Hayes"}, {"rating": 3.0, "review": "Would be really great if it didn't just keep taking you back to the Amazon Prime site when you 'ask' it to search...it won't search every app, like Netflix, etc. Anyway I couldn't make it do that- called and asked for help and they didn't seem to know what I was asking or couldn't figure out how to do it either --- Had a really hard time getting it set up because you have to register it with the email account that has the Prime membership in the household  - so if you have more than one member of your household and you buy this with your Amazon account you have to unregister it and then register it with the email in the household that has the Prime.  Kinda crazy I think.  I don't use the voice search because it will only search Amazon Prime and most of the free shows I watch are on Netflix but it won't search every app you have... should have stuck with another Roku.", "verified": true, "helpfulness": "0/1", "author": "Helen Stevenson"}, {"rating": 5.0, "review": "We've had out Amazon Fire TV for about a week now, and we love it! It was extremely easy to set up and connect to our wifi. We're able to stream so much...we're very satisfied!", "verified": true, "helpfulness": "0/0", "author": "natthecat21"}, {"rating": 3.0, "review": "Already had Roku 3, saw that Fire had an optical connection which I needed for my older Stereo to get 5.1 surround sound which I couldn't get from my Roku. I'm a little disappointed in Fire, less apps and is not as friendly to get around vs Roku. Yes, way more games but that's not what I do ... feels like they really pushing using Amazon Prime, which I have BUT most of my movies are on Vudu which Fire DOES NOT carry so beware. Voice command is really cool but the head phone jack on the Roku is cool too. If it wasn't for the Optical connection, I would move the Roku back, hoping Fire at some point allows Vudu as on of it's app .. better have NFL Now when it comes out next month.", "verified": true, "helpfulness": "2/2", "author": "Matthew M Jauregui"}, {"rating": 1.0, "review": "not worthed-", "verified": true, "helpfulness": "0/10", "author": "Nino"}]