[{"rating": 5.0, "review": "It's all about simplicity. This is a no brainer for those who don't have anything remotely similar. If your tv is \"dumb,\" and you don't own a roku, apple tv, ps3, etc. Then this is a no brainer! Even if you have one of those stand alone products with the netflix and youtube apps, I'll tell you why you should still buy it. Products allowing you to play netflix or youtube on the big screen are not new, but that's not the point of the chromecast. The chromecast is all about the \"HOW.\"Because of this dongle, I'm watching more and more netflix and youtube on the big screen. You know why? Because chromecast is the closest thing to feeling like the app is a part of your regular cable line-up. In the past, If I'm browsing and messing around on youtube, I do not bother to fire up the PS3, and if I own a google tv or apple tv, I probably wouldn't bother turning on those boxes either. It's just faster to browse with your keyboard and just watch the clips on your notebook. In the past, watching Netflix on the big screen is something I had to prepare for. I have to browse and search on my smartphone or notebook first, add the movie that I want to watch to my que, then turn on the ps3. Because highlighting letters with your controller pad is stupid and impractical. And the funny thing is my TivoHD has a netflix app too, but highlighting letters on the tivo remote was even more excruciating and worse than the ps3.Hence, this is why the \"HOW\" part of the chromecast is so awesome. You're already browsing and searching with your smartphone or tablet, now just hit play. No need to power up anything else. No need to buy mouses, air-mouses or media center keyboards for your roku or ps3. YOUR SMARTPHONE DOES IT ALL!!!! That's the point folks! No extra mouse, keyboards, or accessories cluttering your coffee table. And you can still use your smartphone to do anything else you want. The chromecast is processing the video from the cloud. Your smartphone is free! That's why I say it's the closest thing to feeling like Netflix and Youtube are a part of my cable line-up. I can get to these apps quickly! No need to power on anything else or fetch keyboards and controller pads. That's why we hardly watch youtube on the big screen. The hassle is not worth it for short videos. With chromecast, we've been watching more youtube. When a few of my family members are sitting around, I always take the opportunity to cast a few funny videos, or share interesting videos I've seen. In the past, would I bother to ask everyone to huddle around my notebook, fire up the PS3, or hdmi out my notebook to the big screen? NOPE. Another cool thing is that anyone with a smartphone can start casting videos too. You can show a funny video, and your friend or family can try and top you with a funnier video from their smartphone. This is something that you cannot experience with any other product out there.Of course, they need to develop this and add more apps. As it is with just Netflix and Youtube, it's already worth the $35. When they develop more apps, especially an app that will allow us to play our own videos and view photos from the cloud, then this dongle will be the bargain of the century. Right now, you can play local videos by loading the video into your pc's chrome browser, then cast the tab. But this uses your computer's processor and if you view in full-screen, then you can't do anything else with your computer. I consider this a \"work-around\" and I hope they give us a dedicated app soon. Also, this \"work-around\" is not possible on your smartphone or tablet. Even if it was possible, it would use your phone's processor and eat up its battery. So those complaining about this, just be patient and wait for a real dedicated app.We are creatures of habit, and this chromecast happens to be very compatible with my habits. I understand my review may not sound appealing to someone else who has different habits. But if you can relate to some of the things I just wrote about, then buy it, you won't regret it. If you don't like using your Smartphone for everything, then don't buy it. But then I would have to ask, why did you buy a \"smart\" phone? I think you would be missing out on it's capabilities. You paid up the wazoo for your smartphone. Use it for something else other than texting! I read a review where the person said they rather have a dedicated remote because they don't always have the smartphone on them. Seriously, think of what you're saying folks! If I called you right now, you wouldn't pick up the phone because it's placed somewhere far away? I don't know anyone who stashes away their cell-phone to the point, they can't hear it or reach it. C'mon, stop resisting! This chromecast is awesome and it simply makes sense! The more you resist, the more you don't make sense. LOL!-------------SET-UP TIPS--------------If phone set-up isn't working, go to notebook. Vice versa, if notebook isn't working, then set-up on phone.-When it fails and says TRY AGAIN, close the app.-Disconnect router, reconnect router. (sometimes, magical things happen when you disconnect. The router just figures itself out.)-Disconnect chromecast power, reconnect chromecast.-Start Set-up App again and try it again.I have two chromecast and my first set-up was one shot and smooth. My second chromecast took some fiddling, but I did those steps above and it connected. I also took it to a friends home and tried it on his network. When it failed, I did those same steps above and it worked again. I highly recommend doing these disconnecting/reconnecting tips before spending hours on the phone with a rep.-----------------------9/11/2013 UPDATE TIPS------------------------In my review I mentioned that your notebooks is rendered useless when you cast full screen to your big tv using the chrome browser. I learned that if you hit the ALT+TAB buttons, you can regain your notebook while the tv is still casting your movie in full screen. Awesome! Keep in mind, this is still a \"work-around.\" It's not ideal to watch a movie because the streaming is crappy and your PC is processing. Ideally you want the Google folks to create more apps like Hulu, Amazon Prime, etc. Casting from the browser is ideal for photos, presentations, etc. I wouldn't recommend it for movies.-To cast Amazon prime in your chrome browser (from your notebook of course), uninstall microsoft silverlight. Next time you play an Amazon movie, it'll ask if you want to install silverlight or use adobe flash. Choose adobe flash, and enjoy!", "verified": false, "helpfulness": "1/1", "author": "GhostFaceReviewer"}, {"rating": 5.0, "review": "Thank you Amazon, for getting our Chromecast here without a scratch!! It works wonderfully!!! Will NEVER go to Best Buy again to buy ANY product - staff is dishonest and hoarding the Chromecasts when they arrive, either lying about the number in stock or limiting the number available to customers.Google has truly outdone themselves - picture is beautiful and works from computer, tablet, and android phone (running Ice Cream Sandwich, not even Jelly Bean!!) I'll be ordering a second one shortly =)", "verified": true, "helpfulness": "1/2", "author": "Pocchari"}, {"rating": 1.0, "review": "I guess I am joining the 154 one star reviews of this product. The product was non-functional out of the box. Black screen with a little colored bar to the left of center screen. Tried the power plug and USB port and got the red power light on the device, but no \"Set Me Up\" screen. I ordered the device back in July, and just got it today. Over 40 days waiting for a piece of non-operational hardware. This product is not ready for \"Prime Time\", Fix the issues, make sure the product isn't DOA. Hopefully Amazon will respond in a professional manner and refund my money as I will stick with my Apple TV.Dan", "verified": true, "helpfulness": "1/3", "author": "Poet & Don't know it"}, {"rating": 5.0, "review": "Just installed device using MacBook in 1 minute.  The chromecast is great for casting chrome browser onto TV.  I have many clients that want this feature ...in past had to run hdmi, VGA through walls to TV if they didn't have Apple TV and Mac (AirPlay).My 3 year old daughter began casting Netflix from her gen 1 iPad during my tests!I just ordered 3 more.  Main use for me is to project chrome browser screen from MacBook or laptop to large tv.  My kids may use the Netflix streaming though.Great for windows users who want the MacBook/apple TV mirroring for only $35!", "verified": true, "helpfulness": "0/0", "author": "Adrian E Stealey"}, {"rating": 5.0, "review": "Just love the simplicity and easy of use.. was able to set it up in about 60 seconds.. the quality is stunning @ full 1080p..", "verified": true, "helpfulness": "0/0", "author": "Samir Gosavi"}, {"rating": 3.0, "review": "If you want the convenience of generally casting from your devices to your TV, and can buy this with the Netflix promotion, then it's a deal.However, given all the hype around this device when it was introduced, it's only OK.Generally, the rule of thumb is this will cast anything viewable within a Chrome browser to the TV you insert it into.  However, if you, like me, do a lot of your browsing in Chrome browser's incognito mode, you'll be disappointed that, at least for now, you cannot cast your content in incognito mode.Also, text quality could use improvement.Frankly, you can get equal, and sometimes superior, video quality using a video / AV cable connecting my computer(s) to my TV.  But Chromecast makes wireless casting convenient.I'm on the fence when it comes to recommending this device to my friends.", "verified": true, "helpfulness": "1/1", "author": "DasShopaholic \"Out-of-hand shopaholic\""}, {"rating": 5.0, "review": "Got this for my parents so it needed to be 1) reliable and 2) have a small footprint. Couldn't get better than Chromecast!Equipment: My parents have a 42\" Sharp Aquos LCD from 2007ish. It works. However, Chromecast didn't work on the 2011 15\" Toshiba Laptop (forget the model) running windows 7. When that didn't work, my father installed chromecast app on his Samsung 3 smartphone and it worked immediately!setup time: as soon as we did it on the smartphone, it took 5 minutes. (laptop trial and error process took a while so if it doesnt work right away as in the first 3 tries id recommend just do it on your phone).", "verified": true, "helpfulness": "1/1", "author": "Leonardo Rafael Camargo \"colombiaaaa\""}, {"rating": 2.0, "review": "Love the Chromecast which arrived today. But I'm feeling a bit mislead/ripped off.WHen I placed my order there was a \"3 free months\" of Netflix offer attached to the deal. It was one of the main reasons I bit on the deal. Already having a netflix account saving $24.00 bucks made the Chromecast a very good deal.Well -- after looking for a redemption coupon and checking my order history I learned the free Netflix deal was rescinded AFTER my purchase. No email updating me to that fact (I ordered a few months ago on the day it was released/announced).I'm happy with the device but feeling a bit burned -- like a bait and switch. ;) Oh well, live and learn.", "verified": true, "helpfulness": "1/2", "author": "Barbara A. Blackburn \"JollyRB\""}, {"rating": 4.0, "review": "Wish there were more app support for the casting. Google has promised that there will new apps joining the chromecast soon. I would love to see Hulu+, Spotify, Pandora and more", "verified": true, "helpfulness": "0/0", "author": "rakesh"}, {"rating": 5.0, "review": "I bought the Chromecast because I have decided I don't need cable TV any more and was looking for ways to use by big flat screen TV to watch the shows that I normally view on my Ipad.  I saw the reviews for the Chromecast, bought one, plugged it in, spent 5 minutes  setting it up and bam! I'm watching Netflix, YouTube and browsing newsclips from my Barcalounger lounger! Can't wait for Hulu and other services to join the bandwagon.", "verified": true, "helpfulness": "0/1", "author": "Brian P.D. Smyth"}]