[{"rating": 4.0, "review": "Works great. I've had a couple of issues to broadcast but after a couple of tries it works (hence the 4 stars instead of 5). It is a really nice alternative to broadcast!", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "Great product from Google. However, they are starting to annoy us with ads. :/", "verified": true, "helpfulness": "0/1", "author": "Tiago Oliveira"}, {"rating": 5.0, "review": "Great for the kids", "verified": true, "helpfulness": "0/1", "author": "yung ezzy"}, {"rating": 5.0, "review": "buy one. now. its amazing.", "verified": true, "helpfulness": "0/1", "author": "Zachary R. Voss \"Zach Voss\""}, {"rating": 4.0, "review": "This product came very quickly and has a lot of potential for growth. If you are on the edge considering getting this item, do yourself a favor and get it. As well as using Netflix or Hulu for streaming, you can cast videos from YouTube on your mobile device with your friends and family.Pros: A device with a lot of potentialGreat and cheap way to watch movies or streamWide variety of supportBeing able to cast a tab from a browserPlex capabilities (look it up if you are curious)Cons:If you are going to use this in a place with a changing wifi password, prepare to spend 5-10 minutes each time you change the wireless code. This can be irritating.No security, anyone on your network can cast to you, leading to some disruption possibilities.Conclusion: Go for it, this might be just what you need, if this isn't what you want, you can return it. Amazon Support is great like that!", "verified": true, "helpfulness": "1/1", "author": "Ian Bossler"}, {"rating": 4.0, "review": "Good one device, its pity that some websites have restrictions to cast the media on GC.", "verified": true, "helpfulness": "0/1", "author": "Fahri Karimov"}, {"rating": 5.0, "review": "So far it works great, I use it with the cellphone and youtube, fast response, better than my HDTV samsung built in youtube app", "verified": true, "helpfulness": "0/0", "author": "Aroldo"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "Christian Valerio"}, {"rating": 4.0, "review": "That's ok, do what promisses.", "verified": true, "helpfulness": "0/1", "author": "Tiago"}, {"rating": 5.0, "review": "I use my Chromecast daily. I really enjoy the product and the services that this little product allows. I stream from my Note 3 and love watching movies and tv with Chromecast. Get one if you haven't already it's a great product.", "verified": true, "helpfulness": "0/2", "author": "Jesse Girdler"}]