[{"rating": 5.0, "review": "Easy to install, easy to operate and A wide variety of material to access.  I'm not good with directions or electronics but with the Fire TV I didn't need to be. I'm enjoying this purchase very much.", "verified": true, "helpfulness": "0/1", "author": "Mary Lou McLaughlin"}, {"rating": 5.0, "review": "Amazing product! Easy to use. Commercial free viewing. Does not require cable. Must have for entertainment at its best!", "verified": true, "helpfulness": "0/2", "author": "Saundra W. Grace"}, {"rating": 5.0, "review": "This is the easiest thing I have ever bought to use!  I love the speak to find!  Excellent product!", "verified": true, "helpfulness": "0/2", "author": "Stephanie Turner"}, {"rating": 3.0, "review": "I purchased this to watch movies. After receiving and using I find that almost all of the movies Amazon has listed that I wanted to watch Amazon charges you a few dollars to view. I was under the impression that if you had the Fire TV box it was included, boy was I wrong. The first Fire box was defective and failed in the fist few days but Amazon took take of it right a way. I would have given it Two Stars but it is not that I don't like it butvery disappointed in what is included. I find NetFlix a better choice.", "verified": true, "helpfulness": "0/2", "author": "GL"}, {"rating": 3.0, "review": "Mx3 box is way better.", "verified": true, "helpfulness": "0/1", "author": "ron"}, {"rating": 4.0, "review": "Overall, I am very pleased with my Fire TV, but it is not a perfect device.  I have had several streaming devices for the various TVs in my house:  Roku 1, Roku 3, Fire TV, and Fire TV stick.The Fire TV is very fast for most apps and streaming starts very quickly.  I opted for the Fire TV (instead of the Fire TV stick) for my main entertainment center because I have hard-wired Ethernet. I use it primarily for watching Netflix, Youtube, Plex, Slingplayer, and Amazon Instant Video.The Fire TV generally meets my needs and expectations with the following notable concerns:1)  Still missing some essential apps that are available on Roku:  Fox Now, FX Now, Vudu2)  No HD Ultraviolet streaming.  As I mentioned above, Vudu is not available, but Flixster is.  However, the Five TV version of Flixster does not support HD streaming.3)  Plex does not support 5.1 channel sound on Fire TV.  This is not an issue on my Roku 3.  There is some technical limitation on the Fire TV video player that causes this issue.  Plex and Amazon seem to be blaming each other for the issue, but bottom line is that it just works on my Roku 3.4)  I use a Harmony remote, so the voice search is pretty much useless to me.  I don't want to use an extra remote just for voice search.  However, I do have an Amazon Echo.  Seems to me that there should be an easy way to leverage this to do a voice search on the Fire TV.5)  I wish there was a way to customize the interface and hide categories I don't use.  For example, I don't ever game on the Fire TV, as I have several game consoles that I use instead.  It would be nice to hide that category.  The recent addition of favorite apps is a positive step.6)  Slingplayer interface is very clunky.  The orignial reason that I purchased a Fire TV is that I could control the Slingplayer directly from the remote and not have to use an app on my phone (like is required for the Roku app).  However, in practice, the app is so poorly designed and thought-out that I vastly prefer the Roku version (phone and all).If it seems that I spent a lot more time on the negatives than the positives, I apologize.  This is a very fast device that just works 99% percent of the time.  Overall, I am very pleased and it seems like most of the issues that I have can be worked out with software updates.  I understand that some of the issues I am having with app availability and interface are not solely an Amazon issue, but they do effect my user experience, so I feel that it is important for me to address them in this review.", "verified": true, "helpfulness": "1/2", "author": "W. Rogers"}, {"rating": 5.0, "review": "we love it!!  Picture quality is great  and my husband loves the voice control remote.", "verified": true, "helpfulness": "0/2", "author": "Jacqueline Laughlin"}, {"rating": 5.0, "review": "Easy to use and provides a lot of viewing options. Combined with a digital antenna we have been able to eliminate our cable bill. Took advantage of the sling TV promotion and received the fire TV box for half price. May or may not keep Sling long term, but it is has really helped with the transition for only 20 dollars per month.", "verified": true, "helpfulness": "0/2", "author": "Rhonda"}, {"rating": 4.0, "review": "I use it almost everyday. Prime videos are meh! but installed 3rd party app that made it all worth is.4 stars only 'coz some prime videos will error and had to unplug and plug to reboot system in order for the video to work.", "verified": true, "helpfulness": "0/2", "author": "Aldrich Alonzo"}, {"rating": 5.0, "review": "Love it!!!!", "verified": false, "helpfulness": "0/1", "author": "Stone"}]