[{"rating": 2.0, "review": "I haven't left a review here before but I felt compelled to after my experiences with the Chromecast. I'm reasonably tech-savvy and normally don't have too much trouble with networking but this thing has left me stumped. I can \"see\" the Chromecast but I'm unable to connect to it with any of my devices. I wouldn't complain about something like this usually; I'm well aware of the gaps in my knowledge and would just shrug my shoulders and get over it, or at least have patience until there was more troubleshooting info available on the forums. Having said that, the device was billed as really simple to set up, and it seems that Google's tech support expects that it will be a pretty foolproof process; if you've gone through the troubleshooter, their advice is to \"try/get a new router.\" There's not really any support.I'm not out too much cash as I received the Netflix promo, and I figure one of these days I'll get some use out of it once it gets a larger install base and Google compiles a more detailed support guide. It just really sucks that I got more help from the Chromecast subreddit than I did Google. I'd be wary about paying full price for it right now.", "verified": true, "helpfulness": "7/11", "author": "Nathan C"}, {"rating": 5.0, "review": "Love this little device.  Use it for casting Netflix and YouTube on the TV with ease.  Better definition that watching Netflix through the Blu-ray. Great buy and recommend it without hesitation.", "verified": true, "helpfulness": "0/1", "author": "MLC"}, {"rating": 5.0, "review": "When you are thinking of purchasing this...think of what it is meant to do.  This is just supposed to be a simple streaming device, and it does this masterfully.  It is NOT going to be like your Apple TV/Roku/Xbox 360 in terms of having apps and other things to keep you entertained.  The CC pairs with your device through your WiFi network (takes like 1 minute to set everything up once you plug it into your TV) and basically takes directions from whatever device you want to use.  Tell your Chromecast to stream Netflix from your phone, then pick up your tablet in the next room and pause the streaming.I bought this because it is $35 and I got 3 months of Netflix, so I thought \"what the heck\".  I don't necessarily need it because I have other streaming devices and only one HDTV (student).  So if you have an Apple TV/Roku/Xbox 360 and you are going to use the CC on the same TV, don't except to have any additional functionality besides \"casting\" things up onto your TV.  Your other streaming devices have more supported apps right now (I'm sure CC will be supported by almost every major streaming app in the near future).  Don't expect something out of the device that it is not.", "verified": true, "helpfulness": "0/1", "author": "L.S."}, {"rating": 4.0, "review": "Had no problems with setup, seems that issues with the Netflix app for Android have been fixed. (black screen)My current setup is Charter cable internet (30 megabit line) via an SBG6580 modem+router combo, devices that communicated without issues are a laptop (1st-gen Core i3, 8GB RAM, discrete graphics), HTC One, HTC One X, Samsung Galaxy S 4, Nexus 4, and Nexus 7. I have the Chromecast drawing power from the AC outlet.Once more software support arrives (Hulu, HBO Go, Pandora, etc.) this little $35 dongle will wipe away all the $100+ boxes. Right now, if you have a Roku or Boxee, it's hard to recommend the Chromecast. It's faster to start up a YouTube cast or Netflix cast through this device than it is to fire up a game console, so if you don't want everyone to crowd around your phone/tablet/laptop to check out a video, this will be a better option. Then anyone with a smartphone can queue up the next video!It's changed the way I watch YouTube, and I've never had a Netflix account before, so I'm enjoying that.I do get weird HDMI-CEC behavior. It won't turn the TV on automatically, and sometimes it will glitch and reload the current input when I play a YouTube video after another. I think it's Chrome for desktop switching the control over to a different tab, which is triggering HDMI-CEC to switch inputs to the Chromecast (which is already selected). Anyways, could also be a problem with my TV... I got the Chromecast plugged into HDMI2 on a 32\" 720p LG HDTV purchased about 3-4 years ago.", "verified": false, "helpfulness": "0/0", "author": "Jimbo \"JimboLodisC\""}, {"rating": 4.0, "review": "its a great idea .. the china copy sold on ebay isnt locked into google products .. it allows any app to cast to the dongle ..until goggle gets more apps to use I would wait .. the only app is paid google music and movies with netflix ..or anything that will display in chrome browser ..pretty limited .. cant play video file on your laptop or tablets thru chrome ..", "verified": true, "helpfulness": "0/1", "author": "Larry Higgins"}, {"rating": 5.0, "review": "I recently got the Chromecast and have been pleasantly surprised by it's simplicity and quality.  I have been able to stream from my phone and laptop with ease, and it didn't eat up the batterylife on either.  Set up was pretty simple, and just have to make sure you are on the same network so can stream.  When casting items from laptop, cursor doesn't show, but that can be a plus.  Wish I could stream more stuff from phone, but hopefully that will come later.  Overall, very happy with value for Chromecast.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer \"QC and Wolverine\""}, {"rating": 2.0, "review": "So far I have an ok experience with chromecast. Issues,From the package device was not working. I had to follow the troubleshooting steps.If I make it full screen it becomes full screen on tv, but then I can't use the laptop, else I have to minimize.Video streams on both laptop and chromecast. If chromecast is gonna do it directly from the URL then stop streaming on the browser. Now I have to hide my laptop monitor somewhere.Audio on chormecast seems to have a bit of lag compared to laptop.Streaming is just normal not great even with the booster that comes with the package.I used it once kept it attached to the tv. When played after 2 days I had to redo all the troubleshooting steps once again to get it working. This is a show stopper for me.I am not sure these are all issues with the device I have, but so far I am not very happy with the product.", "verified": false, "helpfulness": "9/11", "author": "Aneesh D"}, {"rating": 5.0, "review": "Works great with youtube and netflix if you try to use it with anything else it lags so make sure you only use it with these two programs", "verified": true, "helpfulness": "0/1", "author": "Loan Nguyen"}, {"rating": 5.0, "review": "First off, heads up.  For some reason, reviews from other products are being aggregated here.  That's why you see so many low ratings.I'm giving it a 5/5.  The thing cost me 35 dollars, and came with 3 months of Netflix.  It took a month to ship, but it was well worth the wait.Set-up:1.  Very easy, plug it in, and make sure to plug the micro USB jack to a power source (power outlet, or TV's powered USB port).  The adapters/cables are included (HDMI extender, micro USB cable, and power adapter).2.  You then visit the Chromecast setup website using a wireless device (laptop or smartphone).  It will detect the Chromecast, and allow you to link it to your wireless network.3.  Install the Chromecast extension (laptop), or the Chromecast app (phone), and you're good to go.  An icon pops up that lets you \"cast\" or \"beam\" whatever is in your immediate browser tab (Chrome) or app (phone) to the Chromecast-TV.Additional info:You can change additional settings by using the Chromecast extension, it will ask you if you want to stream via 720p or 720p+, as well as various wide-screen adjustments.Examples of websites I was able to stream: Netflix, Youtube, Twitch, Google.com, and Wimp.com (basically anything openable in a Chrome tab).Example of an app I streamed from the phone: Youtube.I currently have a Roku ($40), which is primarily used for Netflix, Twitch, and local media.  Streaming is dependent on the channel already existing in the Roku library.On the Chromecast, you can also play local video/music files by opening them with Chrome.  There is also a third party app being developed that lets you do this with a phone app.  So the functionality replicates the Roku, however the Chromecast has the advantage of streaming any content that can be full-screened within Chrome.For my uses, it doesn't get any better than this.  5/5 stars, well done GOOG.", "verified": true, "helpfulness": "1/1", "author": "K. LIU"}, {"rating": 5.0, "review": "There are some nits to pick: no 5GHz WiFi, a USB port on the end so it almost undoubtedly will show around the side of your TV if it's below 50\" in size, currently a low number of streaming options, and a few others.Whatever.It's a $35 dongle that won't take up any shelf space and which will allow you to watch your Google Play content on your TV. For that alone, it's well worth it. Note also that Netflix works great on it, as does YouTube, as does displaying Chrome tabs from your computer (Mac or PC). Other content is coming.If you already own a Roku or Apple TV, it's a much more marginal purchase unless you have a lot of Play content and/or want to show your Chrome tabs but don't have a Mac/Apple TV combo. Still, for $35, how wrong can you go? I use mine daily and am happy with it. I'll be happier once 5GHz is supported and once they move the micro USB port to the side, but I'm happy enough to heartily recommend this at the price.", "verified": true, "helpfulness": "1/1", "author": "Joe Wood"}]