[{"rating": 5.0, "review": "I was in the market of purchasing a smart TV; then came along Amazon Fire TV I was skeptical at first so, I figure why not, it's easy to use and small enough to hide does not take room at all, over all it's like having a Smart TV, yes I would recommend this Item to all my family and friends now they can Purchase a simple LED TV with HDMI hook ups and your set to go saving a bundle of monies; when purchasing this Item don't forget if you don't have WIFI then purchase a RJ45 network wire to hook it up;Works good with my 12 year old LCD flat screen TV", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Overall Fire tv does pretty well. It serves the purpose that it was made for. However it does not mirror on my Samsung tv through my kindle fire HDX. I have to power off the amazon fire tv first to get it to mirror. Their support tried helping but to no avail. I exchanged the fire tv and the new one does the same thing. For this reason I'm disappointed in the product.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 2.0, "review": "I'm not sure what all the hype was about.  It is a wi-fi video streamer.  It does have a nice quality in the picture and sound but in hind-sight I probably should have just subscribed to Netflix and saved my money to purchase additional wi-fi enabled TVs. Unfortunately most of the content my kids like to watch is sorely missing from the Amazon Prime free line-up. As a result my ability to dump my cable TV completely isn't happening.  I feel like this is just a box to position more more pay-for content in front of my family.", "verified": true, "helpfulness": "1/2", "author": "R. Dixon"}, {"rating": 5.0, "review": "Fantastic!!  Fire TV works as advertised.  My Prime account was pre-programmed, the voice search works like a charm and navigating is easy. For a non-tech person like me I was concerned about set-up, but it was a breeze. The greatest difficulty I had was opening the battery casing on the remote.", "verified": true, "helpfulness": "0/0", "author": "R. K. Reed \"film fan\""}, {"rating": 5.0, "review": "This is so easy to operate.  It was super easy to connect to my television so I was able to start using it right away.  I love being able to speak the name of a program or actor and having it search and find what I'm looking for.  Great product by Amazon!", "verified": true, "helpfulness": "0/0", "author": "Marjorie Harris"}, {"rating": 5.0, "review": "Awesome is all I can say.  I'm an old man, so I was nervous about my lack of techno savvy; but found this quite simple.  I must admit that I do miss paper instructions and that I'm still learning this device.  We got it so we could watch Prime & Netflix streaming videos on our big screen ..........and that's awesome.  The voice command works!  It's cheap:  buy it!", "verified": true, "helpfulness": "0/0", "author": "Bogie777"}, {"rating": 5.0, "review": "Absolutely love it!!! Easy to hook up and I am technically ignorant. Easy to use. Love the voice activator. I can also look up on my Kindle and flip right over to the TV. This thing is great. I've only had a few weeks and you've added  New movies and series. My husband uses more than I do. I think we'll dump cable!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I live down south in the winter and up north in the summer. I purchased the Apple TV a couple of years ago down south and I recently purchased the Amazon Fire TV a couple of weeks ago. The set up could not be easier the product works amazingly well. I really like to 'ask' for my movies versus typing out your favorite movies. It's so much quicker.", "verified": true, "helpfulness": "0/0", "author": "Richard Parent"}, {"rating": 5.0, "review": "Love it use it all the time. I have Netflix and hulu plus and amazon movies on it.thank you. No yes or no here", "verified": true, "helpfulness": "0/0", "author": "Tjelliott \"I like war stories and western\""}, {"rating": 4.0, "review": "Great picture; voice commands work great.  My only objection is so far, every movie I want to watch is not on the Prime selection list.", "verified": true, "helpfulness": "0/0", "author": "Deblim"}]