[{"rating": 2.0, "review": "I'm an imagery scientist (engineer) and a strong supporter of the Google echo system so I'll say my opinion is somewhat scientific and objective. The truth is that I was very disappointed on my initial testing with Netflix. It takes a while to load Netflix (twice as more than on a PS3/Xbox), it loses frames, to the point where most of the movie doesn't flow smoothly -it looks jumpy-. The initial two minutes had a lot of pixilation, many scenes lose sharpness and color gamut (contrast). On a couple of very fast scene on Transformers: Dark of the moon I had like 40 seconds of plain awful blocking or pixilation. I've never seen blocking so intense and for so long ever before, not even when streaming from a cellphone. The surround sound wasn't there all the time either, and on some scenes it was hard to understand the dialogues. These are deal breakers on a streaming device and I hope people can get over the hype. This device needs a lot of work.Bad value for the price because it is cheap, but it does only one thing: streaming. It is pretty bad on doing it so.Lack of features is evident: it only streams (compared to an apple TV or PS3)Ease of Use: The fact that you can only control the chromecast from other devices makes it a bit cumbersome and clunky.Ease of Set Up: the fact that you have to download apps or use a computer to set it up makes the set up a bit choppy. My TV did not had USB. The provided power supply is a big box, I had to unplugged a couple of devices to make it work. The cable of the power supply is of very cheap material, and it tangles very easily.", "verified": false, "helpfulness": "1/2", "author": "rdniev"}, {"rating": 2.0, "review": "All the \"other\" reviews candy coat the fact that at this stage it's an inferior product. When casting to my HDTV 10 feet away from my windows 7 laptop I get a lousy \"standard\" picture and lag time. The fact it also has issues with quicktime/silverlight/netflix and other plug ins is ridiculous. While it seems small, the girth of the unit requires the use of the extention cord to fit alongside other HD cords. Hey, what do you expect from the folks who brought you a\"spy\" droid. Of course it's really just a way to get you to use Chrome. Apple user? Forget it.", "verified": true, "helpfulness": "0/0", "author": "Sam Gummy \"bosho12\""}, {"rating": 5.0, "review": "I like this item; it dose everything it is supped to. Easy to set up and use.It is, however, limited to only sites that are compatible to Chrome cast. I only hope that more will be in the future.", "verified": true, "helpfulness": "0/0", "author": "Thomas Sauvageot"}, {"rating": 1.0, "review": "After spending quite a bit of time with this, I found out, because I have AT&T; U-Verse, I had to pay them to get it to work or buy an extra router and hook that up. would like to have know ahead of time that it did't work with 2wire routers. Also, the help for troubleshooting would give me choices of 3 different error messages on set up, none of which was the error message displayed on the screen.", "verified": true, "helpfulness": "2/3", "author": "Michael Bailiff"}, {"rating": 5.0, "review": "I was skeptical about how this would work. Such a little gadget but it works perfectly. Very happy after using it for the past few weeks", "verified": true, "helpfulness": "0/0", "author": "Dee Cook"}, {"rating": 5.0, "review": "Easy to set up, good picture, very portable. I hope more services add support, but for now Chrome and Netflix are good.", "verified": true, "helpfulness": "0/0", "author": "Marc Cooper \"mcoope3\""}, {"rating": 4.0, "review": "Wish allcast app still worked.  If it did this would be a 5 star,  come on google give us the ability to stream locally stored videos and pictures!!!!!!!!!!!!!Otherwise this currently works great if you have netflicks or if you are a big youtube fan.  Otherwise untill I can use this to stream from my phone this is about all it currently can do.  I am sure more is to come so I still say buy.  (I also got 3 free months of netflicks with my purchase.  I bought the day it came out)", "verified": true, "helpfulness": "0/0", "author": "Snowbo83"}, {"rating": 4.0, "review": "This is an awesome tool.It makes so easy to transfer videos from youtube or netflix to bigger screen/TV.Amazing.Bad part: can no longer transfer own videos or pictures from laptop/smartphone to TV via ChromeCast.", "verified": true, "helpfulness": "0/0", "author": "JS"}, {"rating": 2.0, "review": "The unit I received didn't work for me. The connection to this device from my iPad and HTC One kept on dropping.This product does not support Wireless-N 5GHz band and all my devices at home (my iPad, MacBook Pro, HTC One, Samsung Smart TV, Synology NAS, Samsung Bluray player) are connected either via LAN or via 5GHz band. I suspect this could be the reason why this didn't work properly.As a product, my feelings are explained below.Pros:- Price is great; it costs only $35 compared to most set-top boxes which cost around $100- Form factor is very small; it is a HDMI dongle and you can put it in your HDTV's HDMI port although you need to power it from a USB source.- It can cast contents from Chrome web browser (laptop or desktop) but mobile chrome is not supported. You can cast YouTube, Netflix and Google Play contents from mobile devices.- It is not a screen mirroring device (like AirPlay of AppleTV); it uses cloud. i.e. you can stream a YouTube video from your mobile device and can switch off the device, the play on your TV won't stop. And, you can manage that video from your chrome browser.Cons:- Works only in USA at the moment and Google has a bad habit of keeping things in \"beta\" mode for very long time (e.g. Gmail).- Supports only 2GHz band of your WiFi. This is one of the significant limitations. A device made in the year 2013 has no support for 5GHz; are you kidding? We are talking about WiFi AC standard and this crap doesn't support part of Wireless-N (5GHz)!! This will have impact on 1080p video (sampled at 20+ mbps while shooting) streaming for sure.- Very limited app support at the moment; it only supports YouTube, Netflix and Google Play (music and video). heck! my TV has both YouTube and Netflix app built-in and my android phone has YouTube Remote App; another $35 on such a device is not worth (at least at this moment).- HD video streaming is not as smooth as expected. It has lags and I could see framing issue in the videos (looks like some of the frames reach with some delay) while casting a 1080p YouTube video from my HTC One to TV.- Heavy dependency on High speed internet (and yet it does not support 5GHz band!!)- You cannot play your local files (audio/video); heck! my android device can play those using a DLNA-UPnP app. And, most HDTVs come with DLNA feature, so this is not a compelling need from this device, but it would definitely a nice-to-have. Plus, many people tried playing local content by opening those in Chrome browser and then casting it, but result is not good. The contents are too slow.", "verified": true, "helpfulness": "1/1", "author": "Niranjan Nanda"}, {"rating": 5.0, "review": "Easy to setup and use.  Works great to view photos and movies on your TV while streaming from your phone or tablet.  I am going to order another one for my other TV.  Also you cannot beat the price for this product.", "verified": true, "helpfulness": "0/0", "author": "Jason"}]