[{"rating": 4.0, "review": "Very easy to use but when i stream HBO-Go the voice/picture aren't in sync. Sometimes that happens with Netflix streaming but clears up after a short while. I love being able to stream onto the TV instead of just my small laptop!", "verified": true, "helpfulness": "0/0", "author": "weimiegirl \"Debo\""}, {"rating": 2.0, "review": "So much has potential. But it doesn't do anything that my TV doesn't. Unless they start allowing mirroring from your phone or allow more video or at least pics from your phone then it is useless. Google, please work on this!", "verified": true, "helpfulness": "0/0", "author": "Jesse R."}, {"rating": 5.0, "review": "Works great for Netflix and Youtube. I hope it expands to offer other streaming capabilities in the future. Set up was fairly easy, although it took a very long time to download an \"update\".", "verified": true, "helpfulness": "0/1", "author": "J. Stanton"}, {"rating": 5.0, "review": "I bought one for my main entertainment center and one for the bedroom - both get used heavily on a daily basis. If you're at all in the Google ecosystem (YouTube, Google Play Movies/TV, or Google Music), this is a no-brainer. I still can't believe the price.With the SDK coming to indie developers, I can only imagine this will become more and more useful.", "verified": true, "helpfulness": "0/0", "author": "RJV \"RJV\""}, {"rating": 4.0, "review": "The device is great. Though I have seen some mixed reviews on quality of streaming (Lag and breakage), I didn't observed any. Solid 720p on my 40\" TV is great. It works so seamlessly and I love it.The only issue I feel is the limited Apps through which you can stream data from a mobile. When it comes to laptop, the \"Cast the Tab\" option opens endless possibility. By opening the Apps like games would truly be great. (Developers already have a piles of Apps created and Google is little conservative is opening the flood gates) Finger crossed.Its a steel for ~30 bucks.", "verified": true, "helpfulness": "0/0", "author": "Barney"}, {"rating": 4.0, "review": "Still a few bits to work out. Obviously raw streaming seems very taxing on the device. It seems like a little software ad on would make this leaps and bounds better.I use it mostly to stream flash/html5 videos to my TV from my computer without having to worry about being tethered via an HDMI cable. It works well enough for that,", "verified": true, "helpfulness": "0/0", "author": "J. McCracken \"DMax12\""}, {"rating": 4.0, "review": "This works great I do have to reset it almost every time I want to use it- but I love it", "verified": true, "helpfulness": "0/0", "author": "Cory Grover"}, {"rating": 2.0, "review": "What they don't tell you is that -- although touting its small size -- you have to connect it to power and probably as adapter also. I have a laptop with WiDi that can throw my computer screen to my SmartTV without this. and it doesn't work well. I hope to be able to learn to use it better, but as of now it was a waste of money.", "verified": true, "helpfulness": "0/1", "author": "Sean T. O'Brien"}, {"rating": 4.0, "review": "You get what you pay for with this product. It's VERY good in streaming to your TV, however... It only works with a hand full of apps at this time. Here is a list of apps this device works with as of 12-3-13. YouTube app, YouTube.com, Netflix app, Netflix.com, Google Play Movies & TV, Google Play Music, Hulu Plus, Pandora and HBOGo. Google is going to allow 4rd party apps to this this device later on in 2014.", "verified": true, "helpfulness": "0/0", "author": "Dave B-35405 \"hi sir hi\""}, {"rating": 3.0, "review": "Cannot stream local videos. Google blocked this aability just after I made the purchase. I bought it specifically for watching my personal videos on the TV.", "verified": true, "helpfulness": "0/0", "author": "Edward E. Hagins"}]