[{"rating": 5.0, "review": "This little baby is the most fabulous innovation by Amazon I have ever come across.  I think that 90% of the junk on TV is JUNK! This tiny box brings me my choice of great movies (Prime, of course) and the few good programs of TV and I can see them all through my TV.  I can even scan through all the photos on my iPad as well as any TV episodes I have downloaded. Thank you, Amazon. My favorite place to shop!", "verified": true, "helpfulness": "0/0", "author": "Dorothy Lesher"}, {"rating": 5.0, "review": "Wow! Once again, Amazon really knocks my socks off. Until 2011, I thought Amazon was just another E-tail business. What made the difference for us was Kindle. My wife wanted a Kindle mainly for her long commutes. We just read paper stuff back then. I immediately followed hers with my first Kindle that year. Now, I also have a Kindle Fire HD, and I don’t know how I ever lived without it.But fast-forward to Kindle Fire TV: I sort of understood what we could do with it, but when I connected it (easy!) and fired it up, wow. Like the Kindles, it solved a lot of problems I didn’t know I had; like how to see the kinds of movies and TV shows we like, instead of the stock noise and car crashes and ogres and aimless sex clone shows being spewed out today. Now my wife can get a Jane Austen classic with a voice command! I can get Maigret on the tube with little more than a grunt.Setup was fantastically easy. We attached the Fire TV to a Samsung 47” TV that has Time Warner Cable usually running on it. It has two HDMI ports. All I had to do was to plug in the Fire TV, plug the HDMI cable to the second HDMI port, turn on the TV with the Samsung remote, chose the second port, and sit back and peep out show after show of exactly what we wanted to see, rather than clones of clones of shows with only the names changed. Once again, Amazin’ Amazon demonstrated its technological finesse and careful design and follow-through with a wonderful, easy to use product.", "verified": true, "helpfulness": "0/0", "author": "Chitwah \"Stanjbass\""}, {"rating": 5.0, "review": "I am not an avid TV viewer. Received this as a birthday gift. Very easy set up and functional  Suspect this would appeal toa generation of TV viewers who are tech savvy.", "verified": true, "helpfulness": "0/0", "author": "amur47"}, {"rating": 5.0, "review": "Awesome! So easy to hook up. All you need is an HDMI cable and WiFi.  Now watching something on Netflix or Hulu or a movie is just like changing a channel. I love it!", "verified": true, "helpfulness": "0/0", "author": "Mary J. Barbour \"Thing One\""}, {"rating": 5.0, "review": "Love it! Use it every day.....had a problem. requested a call via the TV and was called within SECONDS!  Spoke with a HUMAN who was very helpful and had us back up and running very quickly.  Would recommend to any one who has Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "has it all and then some in terms of tech specs and speed. works fine, great integration of prime, also great wit other apps (youtube). easy-sh to cast from kindle fire to screen. doesn't have amazon music yet. i like to watch movies from prime, stream from plex and my son loves to watch COD youtube clips. does all that very very well. it would be nice if the speech thing would work on all the apps not just in prime. haven't tried games yet.waiting for the smartphone to complete amazon immersion..........Edit** you can cast your kindle fire HDX to your tv through the fire tv and thus listen to your music, not bad. App would be easier though.", "verified": true, "helpfulness": "0/1", "author": "constantine"}, {"rating": 2.0, "review": "Great performance but it's only prepared to waste money on Amazon content. There's a lot of apps to be added yet.You cannot control TV volume through HDMI-CEC, Netflix app is an old one.It seems to be very powerful in HW specs and User Interface experience ... but its software don't let it to be as promised.", "verified": true, "helpfulness": "1/3", "author": "Juan Luna"}, {"rating": 5.0, "review": "This was so easy to set up.  The size of the device is great, I didn't have to find room for it.  But the best feature is the speach recognition!  Way better thatn Siri on my phone.  The menu is easy and I even liked the quick tutorial.", "verified": true, "helpfulness": "0/0", "author": "LadyJay55fl"}, {"rating": 5.0, "review": "The biggest drawback is that the kids can order literally anything and my bill has gone up for the month. That being said, we absolutely love this system. Get the game controls to go with it; you'll be glad you did.", "verified": true, "helpfulness": "0/0", "author": "tfritz \"tfritz\""}, {"rating": 5.0, "review": "very please with fire TV, let my cable TV go and enjoying prime!! all the tv shows and movies available on prime are the ticket for eight dollars a month. thank you", "verified": true, "helpfulness": "0/0", "author": "TJF"}]