[{"rating": 4.0, "review": "some limitations, however third purchase!", "verified": true, "helpfulness": "0/0", "author": "ripvg"}, {"rating": 3.0, "review": "Works ok. For some reason it plays music at its own pace.  It starts out directly synchronized to your device but after a few songs it seems to be doing its own thing.  Cheaper alternative to Apple TV which I use almost exclusively.  Good for Android users I suppose", "verified": true, "helpfulness": "0/1", "author": "Jason Griggs"}, {"rating": 5.0, "review": "use it on my xbox one as TV. hook up my surface to it", "verified": true, "helpfulness": "0/0", "author": "RED"}, {"rating": 4.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Deverton"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Schurger"}, {"rating": 4.0, "review": "This is a great invention. If you are planning on using this at home, it could easily replace your cable with Netflix. My only warning is that if you plan on using this at a hotel or a college or any other place where you have to have a username and password to access wifi, it will not work. If you are using a home wifi, even if it is password protected, it will work wonders for you.", "verified": true, "helpfulness": "0/0", "author": "Frasier Dew"}, {"rating": 5.0, "review": "My friend love it! He keeps saying its on HD. lol", "verified": true, "helpfulness": "0/0", "author": "Leand G."}, {"rating": 5.0, "review": "I basically stopped using my WD Live since I plugged in my ChromeCast!", "verified": true, "helpfulness": "0/0", "author": "EZEQUIEL SANTAMARIA"}, {"rating": 5.0, "review": "What an awesome gadget.  So simple to use and never any glitches or issues.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Seiden \"newbie\""}, {"rating": 4.0, "review": "I've owned my Chromecast for about a year now and I really love it. Its not fun having to plug and un-plug video games and DVD players in but this was really easy to use. I had it set up within a few minutes and even after changing my wifi password, I had my Chromecast synced back up in a few more minutes.Why I give this 4 starts instead of 5 is because it doesn't play Amazon Prime video, which is a shame. I'd be willing to change my rating from 4 to 5 stars if thats Amazon's fault.", "verified": true, "helpfulness": "0/0", "author": "Rainbowfish"}]