[{"rating": 3.0, "review": "Apparently the Chromecast works great with newer computers with Windows 7, but casted video was very choppy from my older laptop with Windows Vista. I'm blaming this on the Windows version and/or the laptop hardware because my wifi speed is not a limiting factor.", "verified": false, "helpfulness": "0/0", "author": "Christopher A."}, {"rating": 5.0, "review": "Love it!!  We watch NetFlix movies ALOT more and I love streaming my Pandora to have music playing when I am cleaning the house or getting ready for work im the mornings.  Highly recommend!!!", "verified": true, "helpfulness": "0/0", "author": "ChevyGirlKS"}, {"rating": 5.0, "review": "Great Value, loving this thing!!!  netflix could use auto Next episode, and volume control con app. Still worms lime a charm.", "verified": true, "helpfulness": "0/0", "author": "Claudio C."}, {"rating": 3.0, "review": "I bought 3 units, 2 units Works fine but the third one returns an error while trying to stream and there is no help to solve it.", "verified": true, "helpfulness": "0/0", "author": "Damian Sciarra"}, {"rating": 4.0, "review": "It is an excellent product, but i am hoping google bring a better compatibility with more app and smartphones and tabs", "verified": true, "helpfulness": "0/0", "author": "Juan Leon Rendon"}, {"rating": 1.0, "review": "I tried multiple times but couldn't get it to work, which is disappointing. It spun trying to update the software.", "verified": true, "helpfulness": "0/0", "author": "Preetham Morkonda"}, {"rating": 4.0, "review": "It is definitely easy to install and use.  Just wish you could do more with it.  The limitations need to be changed.", "verified": true, "helpfulness": "0/0", "author": "Kerry"}, {"rating": 2.0, "review": "Easy set up but the device likes to buffer all the time. Every other device in my house has no problem but when i go to use this chromecast it always buffersAfter posting about the buffing problems, i found some solutions and am going to try them when i get home.", "verified": true, "helpfulness": "2/2", "author": "kris foust"}, {"rating": 5.0, "review": "This is by far the best little device on the market!Crystal clear display right on your TV from your phone.I have HBO and Netflix. Have no complaints on this one.", "verified": false, "helpfulness": "0/0", "author": "Giovanni P."}, {"rating": 5.0, "review": "we love this device, get to put anything from the phone or the tablet on to the big screen, AWESOME!", "verified": true, "helpfulness": "0/0", "author": "RShaunSmith"}]