[{"rating": 5.0, "review": "Works smoothly and easy to operate. I prefer streaming from the Chromecast app itself (mirrors the phone screen as is), rather than using the dedicated buttons inside the other apps.", "verified": true, "helpfulness": "0/0", "author": "Asaph"}, {"rating": 5.0, "review": "Turned my tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "pdiddy"}, {"rating": 5.0, "review": "Totally in love! Chromecast rocks!", "verified": true, "helpfulness": "0/0", "author": "GMJB"}, {"rating": 4.0, "review": "Use it every day, can't wait for more apps to push!", "verified": true, "helpfulness": "0/0", "author": "Kiwi"}, {"rating": 1.0, "review": "I couldn't even figure out how to set it up. The advertisement basically says plug it in and you can start watching all this stuff.  Not really.  Plugging it in was easy.  Everything after that was a mess.  First of all it doesn't run off the TV, it runs off of a smart phone or laptop.  That's how you control it.  I couldn't even set it up.  I got through the set up once and then had to download an app. First I had to delete a bunch of stuff off my phone to make storage space for the app. Then it needed to run an update which required even more storage space so had to delete more stuff from my phone. Finally got through the set up and it showed me a video on how to \"cast\" things. I cast Netflix (I think) and a couple of other things. Then I lost the app and had to go back in. When I went back onto the app it said that I needed to set up the TV that I had just set up. Then it knocked my internet out to the point that I couldn't even find my wifi on the list. I finally gave up.  I gave it to my daughter to try and she couldn't even set it up from her smart phone because it wouldn't download the app.  She got it on her husband's phone but it is so ridiculous that she said I should just return it.  Who wants to use their phone or laptop as a remote for their TV? Even if you can figure out how to get it set up you need a college degree in Chromecast just to work it. If I could give it negative stars I would. I have an Amazon Fire TV box and I LOVE it (even though I have to reset it periodically).  So in my humble opinion, just pay the extra for that because it really is as simple as plugging it in and watching TV.  AND it comes with a real remote!", "verified": true, "helpfulness": "0/2", "author": "Mary Stephenson \"escape (into books) artist\""}, {"rating": 5.0, "review": "cool", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "omg i love this thing. i used to stream netflix through my Wii, but that thing is on the fritz now. i got the chromecast just in time. also it is fantastic to use with other apps like watchESPN and youtube. with the new beta version of chrome for android, you can cast any video that comes through the browser. this is really nice when the wife and i are feeling kinky and want to watch something naughty ;)", "verified": true, "helpfulness": "0/0", "author": "Evan Kostishak"}, {"rating": 5.0, "review": "Works as advertised, worth the cost. We carry one to Florida with us and use it there. We are not techies, but it was an easy set up.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Teichman, Jr."}, {"rating": 5.0, "review": "Everything ok", "verified": true, "helpfulness": "0/0", "author": "Andres Garagorry"}]