[{"rating": 4.0, "review": "Great price for a wireless streaming device albeit limited to Youtube and Netflix through Google Chrome - wish it would support other streaming video content from other sites on the web - perhaps in a future update?  Packaging design is quite nice with 1-2-3 instructional text and visual drawings on one flap of the box.  The web page for setup is fairly straightforward - had a little hiccup with the wifi configuration as the sequence for setup not quite clear, but overcame it and once connected everything runs smooth.  We have it powered via USB cable connection next to the HDMI connection on the side of our LG plasma television.  Really nice quality video.", "verified": true, "helpfulness": "0/0", "author": "B. Chin"}, {"rating": 1.0, "review": "My in-laws asked me to set theirs up. After about 4 hours of troubleshooting and reading forum posts online I was able to determine my router settings had to be changed. Instead of using the default DNS settings I had to change it to \"automatic\". Then it still didn't work so I rebooted and re-ran the setup and was finally able to connect. NOW it appears that I cannot view Amazon instant video on it, and in fact it appears the only apps it works with are Youtube and Netflix which I can't believe! If it works with anything else I cant figure out how. There is virtually nothing in the way of support.Update:My dad got one. He is one of these people with nothing but Apple, including routers. After spending a total of three different days of about 4 hours each at my Dad's house trying to make Chromecast work with his Apple Airport routers (Timecapsule and Airport Express) I finally gave up (Chromecast can connect to the network but can't access the internet.) I also spent several hours outside of that reading through forums and Apple support. None of the solutions others found worked for me and the Apple routers are incredibly difficult to adjust settings on. Bottom line - If you have an Apple router, unless you are an Apple techy type - you may want to avoid this thing and just buy Apple TV.I brought my dad's home and will mess with it on my set. What's most annoying is that I can't watch my Amazon instant video with it from the iPad. Perhaps it will work from a Chrome browser tab.Update: so over a year has passed since I plugged this into my TV and virtually nothing has improved. The number of apps that support this is ridiculously small. Still can't watch Amazon, still can't stream from Chrome on iPad. Am thinking about getting a Roku. Chromecast is good for netflix and Youtube. If you want to use it for anything else, better make sure it will run on your device first.", "verified": true, "helpfulness": "0/1", "author": "Tranzition Zoner"}, {"rating": 1.0, "review": "DOES NOT WORK FOR S***..GOOGLE REALLY YOU HAVE TO DO BETTER CAUSE THAT HAD TO HAVE BEEN TO WROST PRODUCT EVER..", "verified": false, "helpfulness": "0/5", "author": "Jon Campbell"}, {"rating": 2.0, "review": "I have an older TV with an HDMI input.  The resolution my TV likes is not supported with Chromecast, so I get a green-tinted  screen.Have an email out to their support team to see if there is any way to change the output, but I am doubtful.  So, if you have an older HDMI TV, check the website for supported output formats.  Website is no so helpful in this regard.Update: Customer support was quick in responding, my TV resolution is not supported.  As I feared.", "verified": true, "helpfulness": "0/1", "author": "Maine_Guy"}, {"rating": 2.0, "review": "I was expecting this to do more than just some youtube casting and tunes casting. oh well, i will chalk it up to another google device for the low tec", "verified": true, "helpfulness": "0/1", "author": "lyle mattson"}, {"rating": 5.0, "review": "Very satisfied with my Chromecast. HBO Go & YouTube have worked almost flawlessly. Tab casting from Chrome is a little spotty with it freezing but I can definitely deal with it. I have recommended Chromecast to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Roger Reed"}, {"rating": 4.0, "review": "good for it's price point, 1080p hdmi output, and the name behind it, after all.bad for it's firmware.  very weak sauce.  it still has a lot of potential and the 1080p for that price is terrific.  i tried roku's LT model and was shocked to find the 720 limitation.  Roku's 1080p offerings are obviously much more feature rich, but again, the three big factors here for me was resolution, price and name.Easily 5 stars with the right firmware.  I wonder if there are third party FW's i can try....", "verified": true, "helpfulness": "0/0", "author": "transcend"}, {"rating": 5.0, "review": "Very useful and super easy to setup.  Combined with a smartphone, this does 90% of what I use my Apple TV for at 35% of the price.  I ended up buying a bunch of these as Christmas gifts this year.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 1.0, "review": "not as advertised not enough limited use need more channels garbage for google they job to compete with apply TV", "verified": true, "helpfulness": "0/5", "author": "david"}, {"rating": 4.0, "review": "It can take over your TV. I'm not sure how it does it, but every once in a while it will just start playing something from Netflix for no reason. Even when the Chromecasts HDMI input is not selected on the TV, it will force the TV to that input and start playing.Chromecast is lacking, thats the best way I can describe it. It just doesn't do enough, if you have a Roku, I would stick with that for now until Google adds more features to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Charles"}]