[{"rating": 5.0, "review": "This is an awesome little device. I still have not accessed as much as I would like to with this, yet, but what I have found and been able to use is amazing. I love that I can stream almost anything I can get on my computer to my TV!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works perfectly! Great article. Highly  recommended", "verified": true, "helpfulness": "0/0", "author": "gonzalo"}, {"rating": 3.0, "review": "There is so much potential for this device, but it feels like we are still a year away from reaching it.  I wanted to be able to share anything I could see or hear on my computer or phone on the TV.  I felt frustrated at not being able to do that.  There are a limitted number of apps that can \"Cast\" and on the computer you had to be able to open the content in a web browser.  So no chance to show a PowerPoint or Excel window on the TV.  And no chance to show whatever was on your phone screen.The device works great for the limitted situations where it is designed to work.  But there are so many other things it leaves out.", "verified": true, "helpfulness": "0/0", "author": "SWP \"swp\""}, {"rating": 1.0, "review": "you have to have windows 7 or 8 will not work on windows vista", "verified": false, "helpfulness": "0/0", "author": "james bolick"}, {"rating": 5.0, "review": "best thing ever", "verified": true, "helpfulness": "0/0", "author": "homeofthefree"}, {"rating": 5.0, "review": "It's excellent!!!", "verified": true, "helpfulness": "0/0", "author": "Carlos Villadiego"}, {"rating": 4.0, "review": "Liking it more and more as apps are made compatible and content arrives. I especially like the desktop mirror function, since you can't get everything from a phone you can on a PC.Every now and then I get poor visuals - vertical discoloration lines etc. on the screen, but they generally go away pretty quickly. Not sure what's causing that, but overall a good product.", "verified": true, "helpfulness": "0/0", "author": "Ardiac"}, {"rating": 4.0, "review": "I love it  and it does exactly what it should, but there is no interface on it. You cannot use it without a computer of phone sadly. That is my only complain and dissapointment.", "verified": true, "helpfulness": "0/0", "author": "Spencer yonce"}, {"rating": 5.0, "review": "I bought this to use in conjunction with PLEX media server, so I can only review on that. Setup is dead simple, and once tied to my plex server streaming movies is so simple I cannot believe I waited so long to try it out. I have the Chromecast plugged into a HDMI port on my receiver and it works perfectly so don't feel you have to plug it into the TV if you have a surround sound setup.I have only tried out things like youtube streaming and those things do seem a little bit of a solution looking for a problem, but once you add something like PLEX media server this becomes a out of the park product!", "verified": false, "helpfulness": "0/0", "author": "1lostlobster"}, {"rating": 5.0, "review": "Very Good", "verified": true, "helpfulness": "0/0", "author": "Ricardo J. Dias"}]