[{"rating": 2.0, "review": "Works for me with HDMI but I need to force 720p to work with a VGA converter and whenever I try that, it says - unsupported resolution.", "verified": true, "helpfulness": "0/2", "author": "Narendran"}, {"rating": 5.0, "review": "Easy setup, great product!", "verified": true, "helpfulness": "0/0", "author": "Joe Rapert"}, {"rating": 4.0, "review": "I love the amazon fire tv. My grandson is 8 and he played games on it all weekend. The only things I don't like about it is Netflix. When I first receive it the older Netflix was on it and it was great, this new version of Netflix doesn't work too well. The reason I purchase it was to watch Netflix. Please fix this and I will be totally satisfied.Thanks", "verified": true, "helpfulness": "1/1", "author": "glinda121"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "marie flannery"}, {"rating": 5.0, "review": "After years of wanting to cut the cord with my cable company, I finally decided on an Amazon Fire and Amazon Prime to enable me to stream content instead of relying upon cable. There are tons of options on Amazon Prime that are available for viewing at no charge beyond the Amazon Prime membership and are appropriate for 2-5 year olds (exactly what I was looking for). The Amazon Fire TV is very easy to set-up and use. I love it!", "verified": true, "helpfulness": "2/2", "author": "Sherry L. Barr"}, {"rating": 5.0, "review": "Awesome, better than the Roku. And was told ours is better than the Apple TV too!", "verified": true, "helpfulness": "0/1", "author": "Asher Mikesic"}, {"rating": 2.0, "review": "Unable to view my OWN media. I think the device is well-made, seems intelligently handled, and is thoughtfully done. But it has one MAJOR need that it can't do: playing media that I already have.", "verified": true, "helpfulness": "1/2", "author": "Brian Fahrlander"}, {"rating": 3.0, "review": "The Prime video selection is weak", "verified": true, "helpfulness": "0/0", "author": "khartman1"}, {"rating": 2.0, "review": "you need more apps", "verified": true, "helpfulness": "1/1", "author": "Sadi C."}, {"rating": 5.0, "review": "I thought apple TV was great till I got fire tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]