[{"rating": 3.0, "review": "Most of my devices connect the 5Ghz wireless band, but Chromecast will only connect to 2.4Ghz band.  Very frustrating to reconnect devices to 2.4Ghz before sharing to Chromecast.**Update on this product -- it turns out that it was my DSL modem that was causing my dissatisfaction with this product. Now that my DSL is working properly, I am able to stream to this device using Chromecast without switching my wireless device to the 2.4Ghz band.One drawback is that you can only stream Netflix, YouTube and now RealPlayer -- other streams are not available.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Durbin"}, {"rating": 5.0, "review": "This is the best thing I could have done for my tv! I watch Netflix and HBOGo from my phone, the sound and video quality is awesome!  I just ordered another as gifts for two friends and a second one for my bedroom!", "verified": true, "helpfulness": "0/0", "author": "Rachel J"}, {"rating": 5.0, "review": "Simple fast and quick to set up. The only problem I had was me but when you follow the instructions given is a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Hector M Flores-Ortiz"}, {"rating": 4.0, "review": "Seems to do what it claims once you figure out the setup - has a lot of possibilities to come", "verified": true, "helpfulness": "0/0", "author": "jackvamp"}, {"rating": 4.0, "review": "Installation went easily and it was up and running quickly.  Streaming from you tube works very well with the video and audio working without any skips or pauses.  Attempting to stream direct from the chrome browser is not so good and appears to suffer from not enough bandwidth/processor power.  I'm running it on an older Windows XP laptop and that \"may\" be the source of the problem.  Haven't tried on a more up to date machine yet.", "verified": true, "helpfulness": "0/0", "author": "E. Bourgoine"}, {"rating": 5.0, "review": "Easy set up, works great! Well worth the money to turn any TV into a smart TV. Great for viewing home videos & movies from laptop.", "verified": true, "helpfulness": "0/0", "author": "Chrystal Veld"}, {"rating": 1.0, "review": "This product is heavily tied to the Chrome browser. It doesn't offer anything special than what Roku and other similar products offer. Was expecting a more innovative product from Google", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing works great. I had it up and running in just a matter of minutes. It is a great addition to my home entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Glenn Jones"}, {"rating": 5.0, "review": "Love chrome cast and how it has allowed us to make every tv in the house a smart tv. A must for any connected house.", "verified": true, "helpfulness": "0/0", "author": "Casey B."}, {"rating": 5.0, "review": "Finally a good product from google and enjoying it very much.Cons = sometimes it hangs or little bit slow in sharing", "verified": true, "helpfulness": "0/0", "author": "Ajay kumar Batta"}]