[{"rating": 5.0, "review": "I've had it about a week and I think it's great!  Menus are easy to navigate, remote is responsive - for instance, using the YouTube app on here is much easier than the app on my parent's smart tv.  I have an older model HD tv not a smart tv which is why I bought this.  I even just splurged and bought the game remote and downloaded a game for the fire as well.  Something I never planned on doing.  I'm not sure why certain reviews state that people have had a hard time using for anything other than Prime - not my experience at all.  Recently Used apps are right at the top so I rarely have to look any further.  So far I've used it for music, Netflix, Hulu, Prime, YouTube, and a game and no complaints so far.  It's so small and the box and the remotes are very sleek.  Voice search works pretty well also although I haven't used it much.  No complaints from me!", "verified": true, "helpfulness": "1/1", "author": "Nikia"}, {"rating": 5.0, "review": "Great device I wish Amazon premium would have more free movies.", "verified": true, "helpfulness": "0/0", "author": "george garba"}, {"rating": 5.0, "review": "Amazon Fire TV meets all my expectations.", "verified": true, "helpfulness": "0/0", "author": "Carmen Sosa"}, {"rating": 5.0, "review": "We started out with a couple of appleTVs.  Long story short, we're much happier with these.", "verified": true, "helpfulness": "0/0", "author": "Steve H"}, {"rating": 5.0, "review": "Great.the more I use it the better I like it", "verified": true, "helpfulness": "0/0", "author": "Dan Stacy"}, {"rating": 5.0, "review": "So easy to use, I was able to put it into the hand of a house guest without instructions.", "verified": true, "helpfulness": "0/0", "author": "K. Darrow"}, {"rating": 4.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Ernest Banes"}, {"rating": 5.0, "review": "Surprisingly fast. Honesty, the game part works for average gamers like still young kids, no need for Xbox or PS.  Easy to set up as wall.", "verified": true, "helpfulness": "0/0", "author": "Marcelm"}, {"rating": 5.0, "review": "Awesome for cable cutting. Only needs hbo instant access (currently only apple products).", "verified": true, "helpfulness": "0/0", "author": "Tyler Schock"}, {"rating": 5.0, "review": "Nice interface. Fast. Very happy with device. Will but another for TV upstairs", "verified": true, "helpfulness": "0/0", "author": "Phatty2x4"}]