[{"rating": 5.0, "review": "The Chromecast HDMI media player is the perfect choice for streaming video to a TV when you do not have a connected TV and when you don't want to lug around a laptop and connect it all the time. Once you set it up, you are good to go.", "verified": true, "helpfulness": "0/0", "author": "Van"}, {"rating": 1.0, "review": "Google pulled a bit of a bait-and-switch when they decided to block general development and blocking the ability to play any local content from your computer. Google sold out to cloud content providers and neutered this device. I've had two since they were released, and can't recommend them to anyone.", "verified": false, "helpfulness": "1/1", "author": "JB"}, {"rating": 5.0, "review": "I am easy to please. This product is so easy to use it basically installs itself. I wish Microsoft could make things this easy. My kids bring up stuff on youtube and watch it on the tv via this device. That's all I wanted it for. That's what it did. $35 is a small price to pay. I've cancelled my cable contracts and just use this.", "verified": true, "helpfulness": "0/0", "author": "Parola138 \"We bite\""}, {"rating": 3.0, "review": "sometimes, I consistently get an error while playing YouTube videos.When I use the HDMI cable the problem disappears.I hope Google fixes this issue soon.Other than that, it is a good wireless streaming device.", "verified": true, "helpfulness": "0/0", "author": "enoxos"}, {"rating": 1.0, "review": "Couldn't get it to work. Wouldn't stream shows . Tried several times @& different locations.  I guess we will stay with Apple TV", "verified": false, "helpfulness": "0/1", "author": "chester d lockard"}, {"rating": 2.0, "review": "It was on sale, so I tried it. I should have read more. It is not for me - it eats up my wireless bandwidth. Why would I stream to my smartphone, tablet or laptop and then stream to my chromecast. Works OK for some apps, but not for me. Maybe I don't know what I'm doing, but maybe I do.", "verified": true, "helpfulness": "0/0", "author": "HepCat \"ramblin wrecker\""}, {"rating": 4.0, "review": "it is a nice little addition to the bedroom, when your sick and bored you can netflix a movie or watch youtube...but that's the extent of it.. I have no complaints...for the price i got what I wanted and needed at the time... Thx Amazon.com", "verified": true, "helpfulness": "0/0", "author": "Amira"}, {"rating": 5.0, "review": "I have a roku in my living room but didn't want to drop another $90 for the tv in my bedroom. This was the perfect fit. Works awesome. My only complaint is that HULU wont work from my tablet because the anrdoid version is too old, but that's more Toshiba's fault than google's. Still, for the price, this is a great little gadget.", "verified": true, "helpfulness": "0/0", "author": "Sinasazi"}, {"rating": 5.0, "review": "Easiest bit of technology I've ever bought. All our devices can now throw stuff up on large HDTV. Even supports audio. Smart phones, tablets, Mac and PC all work.", "verified": true, "helpfulness": "0/0", "author": "upstater"}, {"rating": 5.0, "review": "Once you figure out how to use it (rather obtuse, picture manual) it is a useful product.  I use it to send Netflix from my Android phone quickly and easily.  For me that means not having to turn on and view through my DVD player, which takes the place of a Smart TV.And with more apps and services being added all the time, it seems to be a good investment.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]