[{"rating": 5.0, "review": "Easy to set up.  Works great,  very user friendly. That's all I have to say about that I am out", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "A major disappointment. Try to show a video from Youtube or netflix on IOS, and 1/2 the time it cant find the chromecast, the other 1/2 the time I have to literally restart my iPad and the chromecast button MIGHT show up in the interface for the app.  Bought mine straight from Google Play.", "verified": false, "helpfulness": "0/0", "author": "Greg LaPalomento"}, {"rating": 5.0, "review": "I have Netflix but wanted to try something different like you tube which is not offered on Netflix. Chromecast was just what was needed and streams just fine,Thank you", "verified": true, "helpfulness": "0/0", "author": "dfern22"}, {"rating": 5.0, "review": "This is great if you watch a lot of Netflix and YouTube.  I love this product!", "verified": true, "helpfulness": "0/0", "author": "dfel"}, {"rating": 5.0, "review": "My boyfriend and I enjoy streaming movies from Netflix, and he told me about this gadget. Now, instead of watching the movies on a 20 inch monitor, we can easily stream them to the 48 inch tv. No resolution seems to be lost in this. I would recommend to anyone who streams movies.Addition 12/6/14I still rate it 5 stars, even though I found out I can't stream Amazon Prime instant video. I just bought this item again for my sister who used to connect her laptop to her TV via HDMI cable to stream Hulu and Netflix. It took her no time to set it up and she loves it, too. She no longer has to physically tether her laptop to the TV and can have it next to her for easier control.", "verified": true, "helpfulness": "0/0", "author": "Phoenix"}, {"rating": 5.0, "review": "the only problem is my WiFi", "verified": true, "helpfulness": "0/0", "author": "roni"}, {"rating": 5.0, "review": "Amazing product!", "verified": true, "helpfulness": "0/0", "author": "Oscar Gutierrez"}, {"rating": 5.0, "review": "Absolutely love this! Easy to connect and works fast! Love that I can watch my Netflix shows with it! Very happy with purchase. :-)", "verified": true, "helpfulness": "0/0", "author": "JRho"}, {"rating": 4.0, "review": "We like this product but it isn't super easy to use compared to other products some of our friends have (from Roku). Right now, my husband is controlling it via his computer in the office because he doesn't have a remote or smart phone, so it isn't super convenient but it works for now. I've tried downloading the app to my smart phone and it again - is not super easy to use. We're not very tech savvy but we will figure it out and hopefully use it more once it's easier to use.", "verified": true, "helpfulness": "0/0", "author": "skc2012"}, {"rating": 5.0, "review": "This little device is a fantastic compromise for those with older model tvs that do not have Smart TV capability.How it works is you plug Chromecast into a HDMI connection (you must have one HDMI slot free on your TV), and then it sources your wifi signal and gets your older model TV online. It requires you to use a tablet to use it properly .. so basically you turn on your TV, flip to Chromecast through your TV's source list, then open up the Chromecast app on your tablet and what you see on your tablet, you see on your TV now. That includes apps like NetFlix, Youtube, etc.The easiest way to understand how to use Chromecast is to consider your tablet like your television's remote control. You use the tablet to set what you want to see on the big screen of your TV.At the moment, in Canada, apps are limited. But the product is being heavily invested by Google, so expect more and more apps and choices to pop up as the system matures. With some fancy footwork, you can also set up your DNS to get U.S.-side apps, but you'll have to (pun intended) google to get more info on that.For those tired of paying high cable fee rates, this is a wonderful alternative to modernize any TV in your house into an Internet capable smart TV.", "verified": false, "helpfulness": "0/0", "author": "Ny-er"}]