[{"rating": 2.0, "review": "Hard to handle, instructions aren't clear. When plugged in, volume is down for everything else. Return was easy, awaiting credit.", "verified": true, "helpfulness": "1/1", "author": "William Nussbaum"}, {"rating": 4.0, "review": "Did what I wanted it to. This thing is the tits! Bam I got my show on my tv from my phone!", "verified": true, "helpfulness": "0/0", "author": "Todd Orlando"}, {"rating": 5.0, "review": "If you use Google chrome as your browser, this is great. I am showing my family videos on the TV all the time with the click of a single button. The fact the device is AnyNet+ is great too, since the input will switch to it automatically when you send something to the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Deviantlucifer"}, {"rating": 5.0, "review": "It was so easy to set up and I'm not a techy. I love that it is portable to any TV with an HDMI port and WIFI. We will take it with us on trips.", "verified": true, "helpfulness": "0/0", "author": "DaPlumba2007"}, {"rating": 5.0, "review": "The only downside is more options need to come available...  I used every day..  No more tv subscription ...  Any device", "verified": true, "helpfulness": "0/0", "author": "John S."}, {"rating": 5.0, "review": "This was my second purchase. It works great to me. I cast my favor movies or tv series from my ipad or my computer to share good time with my families and friends.", "verified": true, "helpfulness": "0/0", "author": "TH \"love Shopping\""}, {"rating": 4.0, "review": "I personally do not have cable connected to my T.V. so this actually gives me a reason to use the nice T.V. hanging in my room. It sends the signal to your T.V. to find the item you are watching and play it. It is a really great product and allows you to watch things from Netflix, Hulu Plus, HBO, YouTube, and other apps that are listed as being compatible. You have excellent quality, depending on your internet connection. The device you are using can be used as a sort of remote to scrub back and forth or play something else. It's not perfect as it is only as good as your internet and sometimes when you rewind you have to wait for it to buffer like when watching a video on the internet (it shouldn't take that long though). There is some delay between the controls on the device you are casting from and the T.V. I also get annoyed with Netflix because the remote control will go away. With the HBO I can easily re-access those controls, but I have not figured out how to do that with Netflix without some difficulty. I have had a time or two where my T.V. was not syncing with the app or it froze in the loading process, but it really isn't that frequent to bug me. I mostly use it with Netflix, Hulu Plus, HBO, and YouTube and all from my iPad so that is all I can contribute. Also, you cannot use it with Windows phones because they don't make apps for those phones and most likely never will (some kind of issue between windows and Google). Hope this helps!", "verified": true, "helpfulness": "0/0", "author": "ebetanco"}, {"rating": 5.0, "review": "Super cool! Setup with my phone and my tablet was very easy. Now I can watch video on my tv and can hear my Google play music on my tv as well!", "verified": true, "helpfulness": "0/0", "author": "Agustin Alejandre jr."}, {"rating": 5.0, "review": "Amazing product! It has changed the way that I view and play all of my media. The list of compatible apps continues to grow. It is portable and you can't beat the price. Buying multiple for separate rooms is something think about depending on the size of your house. Can't rave enough about this product. Buy one NOW!", "verified": true, "helpfulness": "0/0", "author": "Amanda Charron"}, {"rating": 5.0, "review": "This is great streaming device. When the kids want to watch Netflix we take it out our main tv and pop it in theirs. It is so convenient.", "verified": true, "helpfulness": "0/0", "author": "Language"}]