[{"rating": 2.0, "review": "It did not work on my TV. Followed directions exactly and did not get a prompt like it said would display on screen to allow player to work.", "verified": true, "helpfulness": "0/0", "author": "William E Davies"}, {"rating": 5.0, "review": "I absolutely love this thing. It used to be a real pain hooking the laptop up to the TV all the time to watch streaming content on it. This solved that problem and the setup was easy and only took a couple of minutes. If you run any AV software on your computer make sure you trust the app or disable it or it will most likely give you issues.Once it's setup you can just flip to the HDMI port on your TV that Chromecast is plugged into and start streaming within seconds on the TV. For the price it was a no brainer for me. I love the thing and may pick up a few more.I'd recommend this to anyone who's looking to improve their online streaming media experience.", "verified": true, "helpfulness": "0/0", "author": "Jeremy McGuire"}, {"rating": 5.0, "review": "About the only thing to fault here is that there are not more apps which use its features. I will continue to wait anxiously for this to occur. The technology itself is simple, great and, to my mind, beats its competitors (Roku, AppleTV, etc) in simplicity.", "verified": true, "helpfulness": "0/0", "author": "Dennis J. Streveler"}, {"rating": 5.0, "review": "I like it because it allows me to see on my tv channels from the internet and the marvelous youtube", "verified": true, "helpfulness": "0/0", "author": "Ralfhy Rodriguez"}, {"rating": 5.0, "review": "I've never been one to watch videos on a tablet or smartphone. I don't know why, just didn't enjoy it. This device will bring your favorite shows to the big screen - and cheap! While it seems like your using your phone or tablet to stream videos to the television, you're really just using your device as a remote - telling your wifi to stream the program to the Chromecast.  The video quality is superb, the interface that you use on your device is familiar because it's the same one that you are used to. Now there is simply a little chromecast icon at the top that you use to select where you would like to watch your video. I've had DVD players with netflix streaming included. The difference here is that searching, selecting and playing the videos is SOOOOO much earsier with the interface on your phone as opposed to maneuvering around a on-screen keyboard with a 4 way selector on the dvd remote.  I found the set up to be quite simple. All in all, this product has actually changed our lifestyle. I wish I wasn't in a contract with my cable provider - I would cancel it tomorrow if I could.", "verified": true, "helpfulness": "0/0", "author": "Scott C. Quimby \"Scott\""}, {"rating": 5.0, "review": "The chrome was very easy to set up and it makes watching Internet TV a breeze. I love google chrome.", "verified": true, "helpfulness": "0/0", "author": "Petula A. Fraser"}, {"rating": 5.0, "review": "We can watch our favorite web shows, YouTube videos, or anything else from a phone or Ipad!  And it is so easy to use.  Love it!", "verified": true, "helpfulness": "0/0", "author": "C. Metcalf \"Homeschool Mom\""}, {"rating": 1.0, "review": "Apparently my not-that-old macbook is running too old a version of IOS.  Tried to return and was outside the window.  Oh well", "verified": true, "helpfulness": "0/0", "author": "W. Byrd"}, {"rating": 5.0, "review": "It does exactly what it is reported to do.  No complaints from me at all, great product. No disappointments to report.", "verified": true, "helpfulness": "0/0", "author": "Dennis Myles"}, {"rating": 3.0, "review": "I recently put a TV in the bedroom and ran into the problem of always moving the PS4 into the other room at night to watch Netflix. I heard a lot about Chromecast and decided to give it a try. The price I got it for was $29.99 which was fantastic. It was easy to set up, but I wish it came with a longer usb cord to power it. It was not nearly long enough for what I needed but it's not their fault. The quality of the video streaming is great and is pretty quick. I did not really care for using my phone to navigate Netflix though. I wish there was a dedicated remote to navigate, but then again it was only $29.99. While my experience with Chromecast were positive, I brought it back and decided to spend a total of $59.99 for a blue ray player that was able to stream Netflix. I found much more value in spending the extra bucks for a blue ray player than just having chromecast. Over all a great product, but there is much better ways to stream for your money.", "verified": false, "helpfulness": "0/0", "author": "SuperLee"}]