[{"rating": 1.0, "review": "Great if you want Amazon spying on you...and no, I'm not paranoid...just facts.", "verified": false, "helpfulness": "2/24", "author": "flbikerman"}, {"rating": 5.0, "review": "The only thing I don't like about the Fire TV is, there's no on off button. It kind of goes off by itself when there's no activity. But over all I absolutely love it!", "verified": true, "helpfulness": "2/3", "author": "Trese"}, {"rating": 5.0, "review": "Instantly replaced my Xbox 360.Voice search - works perfectlySpeed - is amazing, minimal bufferingApps - good enough (Lack of HBO hurts)", "verified": true, "helpfulness": "2/2", "author": "Abhay Saxena \"Abhay\""}, {"rating": 2.0, "review": "BECAUSE A LOT OF APPS THAT YOU ADVERTISED ARE NOT FREEEEE!", "verified": true, "helpfulness": "1/17", "author": "BRAD"}, {"rating": 2.0, "review": "It works fine and the voice command is a great feature, but you have to pay for almost everything you watch - regular TV shows for $2 & $3 dollars a episode ?? . . I watch most everything on my Roku 3 for free", "verified": true, "helpfulness": "2/9", "author": "James Minorinterlake327"}, {"rating": 5.0, "review": "Literally took me only 2 minutes to set up and I was ready to go. So simple to use as well, my mother is able to use it with no problem and she is one that cant figure out how to use her cell phone. It has allowed me to cut the cord with my cable company where I was paying nearly 300 a month whereas now I only pay my annual Prime fee of $99. Sure u can pay for other movies and extras but with Prime there are so many free options its not needed. I was already quite fond of using Amazon video and Prime thru the Wii but this is much better with awesome features. I rarely write reviews but I just had to rave about my purchase as I am highly satisfied.", "verified": true, "helpfulness": "1/1", "author": "Tommie Walton"}, {"rating": 5.0, "review": "fast and product as promised.", "verified": true, "helpfulness": "0/2", "author": "california hardwood producers"}, {"rating": 5.0, "review": "I would drop rating to a 4.5 if possible just because it's hard to locate ALL the free Prime movies and shows from the menus on TV screen, so I have to access Prime via laptop and create a watchlist.  Just a little inconvenient.  Amazon Prime offers hundreds of titles, dozens of genres, and no commercials!  I'm delighted with the selection and ease of setup.  I can see a variety of movies recent and older, plus animated short works, travel, history...much to keep me company while working on crafts and household activities, plus titles for movie night with friends.  Thanks!", "verified": true, "helpfulness": "1/1", "author": "Reader Cat \"Reader Cat\""}, {"rating": 1.0, "review": "I could never get this hooked up to my tv and couldn't locate easy-to-find technical assistance.", "verified": true, "helpfulness": "1/11", "author": "Hunter"}, {"rating": 5.0, "review": "This is the best media streamer ever. I bought Generic android mini pc's before. But the quality and ecosystem of amazon is second to None. Thank you amazon for making this device and entering in the Media Streaming game.", "verified": true, "helpfulness": "0/0", "author": "Luis"}]