[{"rating": 5.0, "review": "This is great! I love being able to cast things from my laptop, iPhone and iPad. Once it was set up, by 5 year old son is able to turn things on to the TV without problem. I've had a Ruku for years, and like this much better. I wish though, that they would speed up on making more channels for it.", "verified": true, "helpfulness": "0/0", "author": "Lorin \"SwimCoach\""}, {"rating": 1.0, "review": "Extremely limited functionality.  I ended up returning it.", "verified": false, "helpfulness": "0/0", "author": "disappointed"}, {"rating": 4.0, "review": "Maybe it's because I'm highjacking my internet from a neighbor, but it doesn't like to connect forever/very well sometimes. But I can also annoy my boyfriend by being in the bathroom and putting annoying youtube videos on the tv at full volume. Also he paid for it so it's like I got a neat toy to annoy him with for free. I also misplaced it recently... maybe he hid it because I kept playing weird songs on it. The jerk.", "verified": false, "helpfulness": "0/1", "author": "Christina"}, {"rating": 5.0, "review": "I love Google Chromecast. I already had two on other TV's in the house and got this one for the bedroom. If you download video-stream you can play files from your computer straight to your TV, its prefect if you have a lot of movies or TV shows saved on your computer. Buy it, buy it now.", "verified": true, "helpfulness": "0/0", "author": "Ray Otis"}, {"rating": 5.0, "review": "best item ever invented for tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Othman Rashed"}, {"rating": 4.0, "review": "It works great....my negative review would go to amazon prime for not being compatible with chrome cast. They want you to buy their Kindle crap and this is a way for them to try and force you to do it. Well not me or my family, most of us have canceled our amazon subscriptions and will only use google play to purchase movies now....amazon is really showing their azz with this one.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "Excellent, exactly what I needed", "verified": true, "helpfulness": "0/0", "author": "Billy Nguyen"}, {"rating": 5.0, "review": "This product is incredible. It is by far the coolest thing I have ever purchased for myself. Do yourself a favor and throw your Roku out the window and order a Chromecast! (If only it would stream Prime video....hmmmm)", "verified": true, "helpfulness": "0/0", "author": "Ashley Lundgren"}, {"rating": 5.0, "review": "At this point, you have read all the reviews and videos. Best $35 you can spend plus mine has lasted basically a whore year. Constantly being used and all components have yet to fail.", "verified": true, "helpfulness": "0/0", "author": "Wish"}]