[{"rating": 4.0, "review": "Works well with some features but Google needs to update so pictures and all music can be shown/played through it.", "verified": true, "helpfulness": "0/0", "author": "Johnnyo22"}, {"rating": 5.0, "review": "Family loved it. Works like a charm and easy to use. Will order more very soon  Great simple product. Yeah.", "verified": true, "helpfulness": "0/0", "author": "Kathleen A. Lee"}, {"rating": 5.0, "review": "Fantastic device to add to your technology collection. Loads fast and smooth with an incredibly vivid picture. Apps are easy to use and is very handy to be able to change everything from your phone. In many ways is better than my smart tv", "verified": true, "helpfulness": "0/0", "author": "Yo man Smitty"}, {"rating": 5.0, "review": "awesome streaming device.  hotwired a Kindle Fire to run the software.  does what it says it will at a great price.", "verified": true, "helpfulness": "0/0", "author": "Jakob Mann"}, {"rating": 3.0, "review": "The chromecast is a very nice Idea.It was very easy to set up with my android phone.My first dissapointment was that in order to use one of the apps (e.g netflix) you HAVE to keep the broadcasting device on.It's very easy to have only little to almost no battery in your phone. so that's kind of upsetting.It's able to broadcast your chrome tab, and (experimentally) all the screen (that might be usefull for presenting powerpoint slides on a projector or screen).I would have waited for the \"next generation chromecast\" (maybe I still can have it because the chromecast updates itself). or maybe (more likely) Google will shut down the project due to lack of success and smart TVs start to be the norm for the majority.If you have a computer (haven't tried mac) or android phone (haven't tried iphone) and an old LCD tv you wish to turn into netflix capable, this could be a smart/cheap choice.", "verified": true, "helpfulness": "0/0", "author": "OPLCI"}, {"rating": 5.0, "review": "The device is very easy to set up and use, and it worked exactly as I expected it to.  I am somewhat of a 'Techno Peasant' so I didn't need alot of features that are available on other streaming players.  If you need a lot of features, read the reviews for other devices before deciding on this one.", "verified": true, "helpfulness": "0/0", "author": "Michael J Cassel"}, {"rating": 5.0, "review": "Super easy to install & use! Now all the movies we bought for the tablets can be played on the big screen!", "verified": true, "helpfulness": "0/0", "author": "MICHAEL"}, {"rating": 5.0, "review": "of all the things my husband received for Christmas, this was by far his favorite.  the set up is super easy and quick and now we can easily stream netflix from our computer/phone without ever having to get up from the couch.", "verified": true, "helpfulness": "0/0", "author": "M. Choi"}, {"rating": 5.0, "review": "Very straightforward setup.  Seems to work with most sources as long as they are in chrome browser. word word word", "verified": true, "helpfulness": "0/0", "author": "ShuttleGlen \"Glen\""}, {"rating": 5.0, "review": "This is an amazing product. I highly recommend it for transferring what's on your computer to your TV. Buy it.", "verified": true, "helpfulness": "0/0", "author": "Mike"}]