[{"rating": 4.0, "review": "Good thing is it connects to HDMI, no need for MHL. Has good quality picture and sound. Good Wi Fi connection. Only negative is it has limited apps. I'm sure Google will add more apps as time goes on. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Archie"}, {"rating": 5.0, "review": "Easy to set up, easy to use and can be used in conjunction with many devices. Best Christmas gift I have bought myself in awhile.", "verified": true, "helpfulness": "0/0", "author": "Soraya W. Malvaiz"}, {"rating": 5.0, "review": "Great product!  Easy to install.  Love watching my movies on my flat screen, while streaming from my iPad.  Thank you!", "verified": false, "helpfulness": "0/0", "author": "carol"}, {"rating": 5.0, "review": "The product works great for all the obvious applications. It works great on my iOS (iPad) and Android (Droid Ultra Maxx) devices. The nice thing is that you can use this with spare monitors that have an HDMI input. This is great if you want to add a third monitor to your desktop setup, or if you want to re-purpose a flat-screen monitor for the kitchen or as a bedroom \"TV\" (but better.)", "verified": true, "helpfulness": "0/0", "author": "Robert Hernandez"}, {"rating": 4.0, "review": "Easy to set up and works well. Not used very often but for the price a nice feature to have available", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 1.0, "review": "Only works through Chrome which is pointless. I can't even view my power point on the TV! Have repacked it and put it away, waiting for updates whenever they come out", "verified": true, "helpfulness": "0/1", "author": "Nitin Puri"}, {"rating": 5.0, "review": "Streaming video from a tablet and a smartphone is utterly convenient and works perfectly. It changed my viewing habits too. Very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "I. Koppel"}, {"rating": 1.0, "review": "I bought this as a gift for my husband.  It doesn't work very well.  Doesn't perform as well as I thought it should.  The streaming is very choppy.", "verified": true, "helpfulness": "0/1", "author": "kathy"}, {"rating": 3.0, "review": "Unfortunally the chrome extension is not available for tablet And Smart Phone so It is not possible cast The browser from these components", "verified": true, "helpfulness": "0/0", "author": "GUGLIELMO SANTINELLI"}, {"rating": 4.0, "review": "I love my Chromecast. Bought it months ago when it was only able to work with Netflix, You Tube, and Chrome Browser.Pros :Small and fits perfectlyCan't beat priceEasy to installWorks with what is programmed for it.Easy to installOnce on Wifi updates itself direct from Googleand more...Cons: mostly info you need to know before purchase-Needs Wifi access.-Need to be aware it needs power via micro USB cord. There aec2 in the package. 1 short so if you have a HDMI port close to USB port in back of TV you are good to go. If not the longer one  with a plug. If powered by USB on TV one TV is off so is Chromecast. If plugged into outlet be aware to unplug it (it may overheat over time of left power on over time)-Google has not opened this up to developers to make their own apps to work worth it.", "verified": true, "helpfulness": "0/0", "author": "Rx Gadget \"RxGadget\""}]