[{"rating": 5.0, "review": "FINALLY!!! A piece of technology that is TRULY easy to install!! Not only is it simple to hook up but also very easy use!", "verified": true, "helpfulness": "0/0", "author": "jol ro"}, {"rating": 3.0, "review": "I'm not completely sold on this device.  Friends had the Roku box and Chrome cast device so I wanted to best them and go with the Amazon Fire box.  The biggest thing is that I can not get it to Miracast from my Galaxy S5 phone or my 2014 tablet.  I have called Amazon a couple of time and they were not able to fix it.  I did come up with a work around.  Load everything up on the Amazon cloud then access it through the Fire TV.  Something about not being compatible with these new Samsung devices but they are working on it.  They promise me that the next updates will include a fix.  Miracasting is handy when you have friends over and they want to show you things on their phones or tablets.Second thing is that the voice control only works within the Amazon system.  Meaning if you try to do a search on YouTube, it will not find what you are looking for.  It doesn't work on any apps you have loaded on the Fire TV box so that is kind of bad.All in all it is a nice device and I plan to play with it more.Found out that you have to pay for a lot of movies and TV shows that you look for.  Brady Bunch for the wife etc.  I thought all of these would be free since I had Amazon Prime but not the case.So all in all I have mixed feelings about it.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "SWEET PIECE.", "verified": true, "helpfulness": "0/0", "author": "K. Green"}, {"rating": 4.0, "review": "I've had AppleTV and Roku3 and I like FireTV the best.PROS:The interface is much fresher, more informative, and easier to navigate than the others.Separate Apps section implies it will be easy to add apps in the future.Voice search works great.Picture appears clearer than AppleTV.Movie rentals from AmazonVideo have a 72 hour watch time from when they are started. Yeah.CONS:Doesn't seem possible to buy an entire season of a series on AmazonVideo, only individual episodes, though it is possible on the website.Also had problem buying HD version of one show (Fortitude) on AmazonTV but was able on the website. That's been fixed.SUGGESTIONS:Add backlighting to remote keysAlso on remote, when playing a program make it so a right click on the navigation wheel fast forwards and a left click rewinds--just like the dedicated forward and rewind buttons. Double-click on nav wheel already pauses, and another click re-starts--so just add forward and reverse.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome device. Save a lot of money", "verified": true, "helpfulness": "0/0", "author": "Luke Baker"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "John Sull \"JS\""}, {"rating": 4.0, "review": "It's solid, well-made. The packaging is ingenious and lives up to its claim to be \"frustration free.\" It's fast. I first believed I was imagining it, but the screen clarity is amazing and much better than my Rokus. I deducted a star because it doesn't offer 2 channels I favor (I asked before I bought and was told they were included). It's ok, I can use Roku just for that.", "verified": true, "helpfulness": "0/0", "author": "shopper#1"}, {"rating": 4.0, "review": "Great box -small -good", "verified": true, "helpfulness": "0/0", "author": "Larry Mick"}, {"rating": 5.0, "review": "I had to disconnect my cable because I just became disabled. I'm trying to lower all my bills. My brother-in-law was horrified thinking of me without cable.  So...he purchased the FIRE TV for me. I'm thrilled with it. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Linda in NJ"}, {"rating": 4.0, "review": "The only thing I don't like is all of Amazon stuff does not buffer or is not laggy. But all other services do netflix hulu sling not always but sometimes. Twice as fast as the fire stick.", "verified": true, "helpfulness": "0/0", "author": "R. Fell"}]