[{"rating": 4.0, "review": "The box is not too bad for a first try by Amazon. I do wish it had a few more options such as accessing your Amazon Music collection or a Amazon Music App.", "verified": false, "helpfulness": "0/1", "author": "Monkeybutt"}, {"rating": 5.0, "review": "I love using this device to find and watch movies and to play the many games and apps provided. Great", "verified": true, "helpfulness": "0/0", "author": "Barbara Dunn Johnston"}, {"rating": 1.0, "review": "I do much better with my Directv Genie, than this Amazon Fire TV. With the Fire I have to pay for everything!! Very disappointing.  I sent it back on the 13th of May and you received it on the on the 20th. Hope to hear from you soon.Patricia Gaffney", "verified": true, "helpfulness": "3/10", "author": "Kindle Customer"}, {"rating": 5.0, "review": "It was very easy to set up.  The voice search feature is great, easier than fumbling through menus.  I have Netflix & Hulu and I have no problems using them with this system.  Dump cable and buy this.", "verified": true, "helpfulness": "1/1", "author": "Mad Sonic Player"}, {"rating": 1.0, "review": "I am looking for something that can store my programs where I do not have to be on the internet;  while I am watching a movie-like when you rent a movie for 72 hours, That would be great for all movies I watch on Prime", "verified": true, "helpfulness": "2/9", "author": "Brad"}, {"rating": 5.0, "review": "I am usually a bit leery of new gadgets, don't alway have the best luck with them which is undoubedly \"user error\" :)  This one was just as advertised - super simple to install and use.  Tiny so you don't see it on the TVconsole/stand and it 100% works as they say it will.  Its so convenient to just stream the videos and the PRIME library is free and has a decent selection.  Haven't tried a rental yet but I have no doubt that it will be just as easy.  It connected right up to our wireless without a hitch.  Its a lot like a Kindle - once you have one, you don't want to go back to the old ways!", "verified": true, "helpfulness": "1/1", "author": "C. Kane"}, {"rating": 5.0, "review": "Bought this product after much research.  The first unit must have been faulty because the audio had a tinny ring which was very annoying.  I tried several speakers, TVs, & cables to no avail.  So I returned for another unit.  This time I ordered the recommended HDMI cable ( http://www.amazon.com/gp/product/B003L1ZYYM/ref=cm_cr_ryp_prd_ttl_sol_2 ) and the new unit worked perfectly.  I am so pleased with the Fire TV.  It is so small about the size of 2 CD cases stacked.  It is very easy to connect and begin watching.  It starts up and runs through the setup, shows the home network to connect to and bada bing bada boom.  Go to Netfiix and sign into your account.  So easy.  The Voice Search is incredible!  I am in my 60's and it is very easy to use this product.  For years I have had Netflix and what a pain to always have to hook up my laptop to the TV to watch movies.  Don't forget to switch the input on your TV to the alternate source (such as HDMI 2) to be able to access the Fire TV.At the same time, I ordered the Kindle Fire HDX 7\".  I am an avid reader and these two products work hand-in-glove.I rarely rate products, but these are over the top in quality and features.  My son bought this for me and I highly recommend that you \"kids\" get these for your parents. :)  It keeps me busy and out of my kids' biz.  Haha!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "This has worked out very well for us.  We have watched several movies already.  It is easy to use and I have also used the voice control with great success.", "verified": true, "helpfulness": "0/0", "author": "James W. Ingleson"}, {"rating": 5.0, "review": "The Amazon FireTv is a really cool device especially if you are a Amazon Prime member. I am able to watch Hulu Plus and Netflix content in stunning HD quality and also listen to music on Pandora. The device was easy to set-up and the sleek interface makes it easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ariyonne Marshall"}, {"rating": 5.0, "review": "I love the feature of voice search.  I like it much more than Roku.  Amazon Fire TV does not dissapoint!", "verified": true, "helpfulness": "0/0", "author": "Patty Huffman"}]