[{"rating": 5.0, "review": "This device is great and just $35!  We were very frustrated with trying to watch netflix through our blu-ray player.  The blu-ray was just too slow. We use the chromecast with our ipad and it works great.  We're not that tech savy so that is all we use it for.  I'm sure there are other good uses that we don't really know about.", "verified": true, "helpfulness": "0/0", "author": "Lanell"}, {"rating": 4.0, "review": "Needs more apps.  Plain and simple.  Not compatible at this time with Windows 8 smart phones.  You might be better off with a Roku.", "verified": true, "helpfulness": "0/0", "author": "Larry Albert"}, {"rating": 1.0, "review": "First off, I am very much a techie...which was for better or worse.  I never got it to work, and here's the summary:1.  Device plugged in to receiver HDMI and powered up, and I followed the onscreen setup proc, which basically is to download an app from google.2.  Ran the app; my laptop could see the device for setup...a good start3.  The Chromecast apparently could NOT find my WiFi network...which is nuts, since the device and my laptop were communicating on it.  No \"help\" really available in the app.  No good help available online.4.  Called google support and their first tier person was of limited help. Said that my Linksys router was on their \"known issues\" list.  Said she could send me an email giving more info, but I needed to call Linksys to get further help.TIME OUT:  I have a WRT54G router...one of the most popular WIFi router ever produced.  And it is several years old...no way Linksys was going to provide tech support!  Waited for the email...which didn't arrive.5.  Fooled around w/ my router settings.  I have my router set to a non-standard channel (to avoid interference w/ other nearby routers).  Changed that back to channel 1, and the Chromecast connected!  I thought I had it working!6.  Chromecast device told me to stand by while it downloaded an update.  It then began to slowly count up from 0% downloaded, up to 13% downloaded...where it stopped counting up, and just spun on-screen, for an hour.7.  I gave up and went online to do a return to Amazon.  Which I am doing.8. The email from google tech support arrived in my gmail account 3 hours after the tech support rep said she was sending it.Jeez, Google...how badly could you do this?  How could you give so little help online?  How could your app have so little help built in?  And how could you possibly be incapable of working with such an incredibly popular router?  Or on a non-traditional WiFi channel (when I have NEVER had a problem with dozens of other WiFi devices)?  FAIL!!!!", "verified": true, "helpfulness": "0/2", "author": "Larry in FL"}, {"rating": 5.0, "review": "best $35.00  I have spent in a long time,  It sets up quickly and easily,  take it with you to moms", "verified": true, "helpfulness": "0/0", "author": "James S Campbell"}, {"rating": 5.0, "review": "To use at city and public meetings. many ppl use there cell phone and pass it around to show, now its beamed to the TV and the meeting goes so much faster and smother", "verified": true, "helpfulness": "0/0", "author": "kenneth l. morris"}, {"rating": 5.0, "review": "I love it! I can watch all my shows on my TV now with this and not have to strain my eyes watching ona tablet.", "verified": true, "helpfulness": "0/0", "author": "katherine mitchell \"Katherine\""}, {"rating": 3.0, "review": "Unless you don't want a box to stream to, like a Roku, then I guess this works. Setup is a little wonky. I returned it for a Roku.", "verified": true, "helpfulness": "0/0", "author": "RJT378"}, {"rating": 2.0, "review": "too many limits and cannot see my photo gallery. I wanted to see my stuff Not Googles stuff hate your rules", "verified": true, "helpfulness": "1/2", "author": "Joseph A  Kaddis"}, {"rating": 4.0, "review": "I really like the Chromecast. Set up was amazingly simple. Using it is very easy. The only downside is the limited number of apps that link with it.", "verified": true, "helpfulness": "0/0", "author": "Carlo E Atene"}, {"rating": 5.0, "review": "Works as promised and easy to install.  I am enjoying my Netflix movies on my tv.  I wish more thins were this easy to operate..", "verified": true, "helpfulness": "0/0", "author": "Julio Leal"}]