[{"rating": 4.0, "review": "very convenient", "verified": true, "helpfulness": "0/0", "author": "Vipul Sarawgi"}, {"rating": 5.0, "review": "I love how easy it is to use my phone and then cast a video from Youtube, HBO Go, or Netflix to my television.  My only complaint is that the device doesn't support certain audio codecs, so many of my home media must be watched using a separate device, but for $35, you can't go wrong with getting one.  I plan on buy one for every television in my home.", "verified": true, "helpfulness": "0/0", "author": "J. DeFalco"}, {"rating": 5.0, "review": "This is the most brilliant piece of electronics I have ever bought. It has changed my life, it has changed my media usage.", "verified": true, "helpfulness": "0/0", "author": "UDB"}, {"rating": 5.0, "review": "The best thing you will ever buy", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 2.0, "review": "I find the service unreliable, difficult to start most of the time.  When it does finally start, the image is intermittent; on 2 occasions in the less than a 3 days I've owned it, it has frozen in the middle of a cast requiring me to restart my browser.", "verified": false, "helpfulness": "0/1", "author": "Corey Davis"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "James Mramor Jr."}, {"rating": 3.0, "review": "It's a neat little device, but it's got some glaring omissions. I wish it had Amazon Prime video capability. Youtube and Netflix are indeed nice, but when pretty much every other streaming box does Amazon, this little guy should too. I also appreciate it's form factor, but having to plug it into USB on my TV is a bit of a pain. Anyway, there's not much that can be done about that. It's just a little cumbersome without a remote. Sure, I've always got a phone or tablet lying around, but that involves changing apps between services, making sure my phone is on WiFi instead of cellular, etc. I just like a remote better.Overall, It's a neat little toy, but if I had to do it again I'd get a Roku or something a little more robust.", "verified": true, "helpfulness": "0/0", "author": "joebus"}, {"rating": 5.0, "review": "nice to work with my android phone and tablets", "verified": true, "helpfulness": "0/0", "author": "S. WONG \"Looking for honest sellers\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Ruben Dario Preda"}, {"rating": 5.0, "review": "This little device will cast the display on my chromebook onto the big screen in the livingroom.  I bought this to use with my Asus chromebook.  It was simple to set up and works very well.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Goff"}]