[{"rating": 2.0, "review": "It works only sometimes when I attempt to stream from my iPhone.  It also doesn't allow for streaming from all your apps.I tried the Hulu and didn't like it.  I am going to stick with my AppleTV.", "verified": true, "helpfulness": "0/1", "author": "SV"}, {"rating": 5.0, "review": "Never seen it buffer, because the way it streams is so unique compared to similar devices. The price tag is unreal; the options are quite large if you have Chrome on your Mac and PC", "verified": true, "helpfulness": "0/0", "author": "Adam K"}, {"rating": 5.0, "review": "I bought this as a gift for a friend when it first came out, and they loved using it to watch Youtube videos on the TV with.  It's compatible with a Chromebook as well, so if you want to show your computer stuff on the TV this gets the job done.  It's still improving and being updated, which is more than you can say for most electronics (cough, Apple, cough) and you don't have to buy newer version to keep getting the updates.Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "mathewgogo"}, {"rating": 5.0, "review": "This works great and now you can stream without wifi and also do screen mirroring. They really improved it a ton.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "NiceJust like apple tvEasy to useBought another oneA bit lag but it is all good!:)", "verified": true, "helpfulness": "0/0", "author": "rhaneem"}, {"rating": 5.0, "review": "got rid of cable!", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 4.0, "review": "Hook it up and step up was seamless. Love the integration with Plex media service picture was flawless. Nothing bad to say about it yet.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Winfree"}, {"rating": 5.0, "review": "awesome awesome awesome … no longer need a cable box.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "This is one of the best \"tech\" devices I've purchased in recent memory.  I also own an Apple TV which is what I was using to stream my media to the TV/Entertainment system, now the Apple TV is up in the 2nd bedroom and the Chromecast is my goto device for streaming.  Mind you this may not apply if you own a iPhone or other Apple device, but if you're running an Android device and want to get great content sent to your wifi network then this thing is what you need.For a paltry 30 bucks I can send video, music, pics, browser mirroring, etc . . . to my entertainment system.  All it takes is one starting the video/song on your device, then push one button and bam....you're watching it on your big screen.  The Apple TV does the same thing basically, but it will run you 100 bucks instead of $30.  To be fair the Apple does offer a hard wired lan connection that the Chromecast does not (wifi only) but it is not a problem, if your wifi is worth it's salt streaming will be seamless without hiccups.  If you are having problems using wifi then go get a better router!  :)I heartily recommend the Chromecast, it's the bees knees.  Get a 2nd one right from the start, or one for every TV in your house!", "verified": true, "helpfulness": "0/0", "author": "Chris Rud"}, {"rating": 5.0, "review": "Awesome product. If you are doing this the old school way getting the laptop and plugging into your HDMI you need to stop and get a chromecast", "verified": true, "helpfulness": "0/0", "author": "Ray Ortega"}]