[{"rating": 5.0, "review": "especially now that they've released the sdk, we'll start to see some great unexpected uses for this. i especially cant wait till amazon prime video adds support.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Z. Hoffman"}, {"rating": 3.0, "review": "It works on and off. disconnects quite often, but when it works its great. I wish they come up with a device more stable", "verified": true, "helpfulness": "0/0", "author": "Treno B."}, {"rating": 3.0, "review": "I bought one of these last year and was sorely disappointed with its locked-down, forced partnerships with online streaming companies and promptly returned it. Lack of local media sharing capabilities really was the deal breaker for me. They seemed to have listened to all the complaints, and woken up to the swell of competition coming out of cheap overseas devices.EDIT 03-15-14: WARNING, Google just forced an update download on this unit. This unit will no longer setup without an internet connection, and will not function at an isolated guest network AP. Be aware, if you are planning to use this device on the road, such as at a hotel or other place where you will not have administrative capacity to configure the wireless router, this device will probable have problems, where as Tronsmart & Cheerlink like devices will function. Tronsmart & Cheerlink both function over their own AP network (in otherwords, they create their own little WiFi network), so they can function even in places without any other equipment, just a phone, a TV, and the HDMI adapter. Google Chromecast REQUIRES an external WiFi router to be connected to. It will not even setup without an internet connection. Google, one step forward, two steps back.I GAVE it a better rating after repurchasing it and testing out its capabilities. It can now cast local streaming content from the various apps that are available that perform this type of streaming. It comes packaged with a small extension for poorly designed TVs with tight fitting HDMI port on the back. Also comes with a standard wall jack adapter in addition to the USB for power, whereas most of the other devices I've purchased only comes with the USB cable, or is a split cord with WiFi/antenna unit. The setup is NO LONGER straightforward, due to the recent forced update download.Only three small drawbacks I see so far with this unit.[1] I can not connect this if I am using a hidden non-broadcasting SSID on my network. The other similar casting devices I own can.[2] Forced upgrades. The other devices I own require me to upgrade the firmware/software. Chromecast does it automatically without my permission or consent. This worries me. This type policy leaves the unit open to abuse. If some CEO at Google decides to take this in a new direction and changes the functionality that I don't like (for example, implementing DRMs or collecting market research data, etc.), there's not a whole lot I can do about it. I'll have to be lucky enough to catch wind of it before I plug mine in and be careful to only use the device when it can't connect to internet. It is also a poor way to do it, for technicalities. If I happen to be on a really terrible internet connection, the update could take a long time, and I might prefer to do this when I'm on a better connection. If I need the unit to simply function, for example, I'm late for meeting where I need to use this unit for a presentation, this would not be an appropriate time to perform an update. Bottom line, updating ought to be my choice of whether, when and where.[3] I still can't mirror my phone for those situations where apps are not supported but I want to throw their image up on the TV anyway. From what I hear we aren't too far from it though as the SDKs were released (Koush was working on one). EDIT 03-15-14: I now see some Apps coming out for mirroring. Unfortunately, due to the recent update Google forced on my unit, it will be sometime before I can get a chance to reconfigure my Chromecast to test this functionality.Hopefully, other large companies will learn from this earlier fiasco, and stop trying to force subscriptions & partnerships on it's customers. Such actions will only invite smaller competitors to develop solutions that the customers want, that these larger corporations try to lock down. Now that the SDKs are available, they will see how much better this strategy is. People will figure out new and wonderful ways of using this technology, and Google can reap the benefits together, with increased unit sales and visibility, instead of fighting against the customers for control and losing in public relations.A step in the right direction. Open it up. If everyone shares in it's development, everyone gets a bigger benefit from it. Even you, Google. It's a win/win.", "verified": true, "helpfulness": "0/0", "author": "Yu"}, {"rating": 5.0, "review": "I love this product.  It has saved me from having to go through the aggravation of disconnecting one of my two monitors, connecting another VGA connector, setting up the resolution and then streaming the show/movie while still using my computer speakers.  With this, I can remotely transmit it from my phone (Galaxy S3), desktop, or laptop to my TV with very little aggravation and effort.  It's easy to use and automatically updates.  It's hidden behind my TV and has a great form factor. I definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "M. Rodrigues"}, {"rating": 4.0, "review": "Pros:cheap streaming playerplays YouTube netflix and a handful of other stuffCons:You have to a a smart device or a computer with Google chrome to be able to use it.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "The chromecast is works very well. I was a bit skeptical at first, but the set-up was very easy and the use of it is even easier. Once everything is set-up with your devices, there is nothing left to do but to enjoy it all through your TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I gave this as a gift to my daughter's boyfriend, so I can't really tell you how wonderful it is, but I can tell you that he is very happy with it. He researched Chromecast, Roku, and AppleTV and decided this was the best one for him, so I obliged. He uses it for Hulu Plus and Netflix and has not experienced any problems. Not much of a review, but I know he loves it.", "verified": true, "helpfulness": "0/0", "author": "Kristen Hagen"}, {"rating": 4.0, "review": "I enjoy using this player almost every day.  The one downside to it is the somewhat limited application support, but I do not see that remaining an issue for long.  Netflix, YouTube, and Pandora support it quite well!", "verified": true, "helpfulness": "0/0", "author": "Andrew Z"}, {"rating": 3.0, "review": "Worked on one of two computers for the first few weeks, but with intermittent connectivity. The device would lose its connection to our wireless network periodically, sometimes once every few hours, but at other times several times per hour.About a week ago I think it perfomed a self-upgrade as it went into a reboot cycle on its own. After that, the one computer that it did work with could no longer connect, but the computer that was previously having trouble with it started working. So, at least we have one computer that works with it.The stream quality isn't all that great, as it drops frames more than I'd like. For casting websites and the like, its OK, the lag and dropped frames aren't too bad, but for streaming video from the browser, it's sometimes OK, but sometimes unusable.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 4.0, "review": "it took a little time to figure out how to install on tv, once installed it worked well, i would recommend to anyone without a smart tv", "verified": true, "helpfulness": "0/0", "author": "Carolyn W Vanderwerf"}]