[{"rating": 5.0, "review": "I bough it directly from amazon and it was delivered pretty quickly, It's very useful if you don't have a smart tv because it basically turns your normal tv with hdmi into a smart tv, or even if you already have a smart tv it's useful, you can look for videos on web pages and most now support to send the video directly to the chrome cast, and I don't mean only web pages like youtube, I mean third party ones that doesn't even have apps for smart tv,I never had any problem with it and I love it.On a side note, it draws power from the USB connector on the tv, but if it doesn't have one it comes with a wall plug, also remember to use the hdmi extension since it acts as an antenna for the WiFi and have better signal", "verified": true, "helpfulness": "0/0", "author": "Alfredo De la rosa"}, {"rating": 2.0, "review": "I have had this about a year now and it was not worth getting.  I have constant trouble maintaining a connection between it and my Google Nexus 7 tablet.  Having to \"cast\" everything from my tablet or my computer is not much different from just connecting a cable from my laptop to my hd tv.  I'm getting rid of this thing and getting a Roku.", "verified": false, "helpfulness": "0/0", "author": "Bruce Chambers"}, {"rating": 5.0, "review": "Excelente!!!", "verified": true, "helpfulness": "0/0", "author": "LCC \"LCC\""}, {"rating": 5.0, "review": "I bought this for my husband for father's day. It's even better than we expected! It was very easy to set up and we've used it non-stop for the last four days. Would definitely recommend", "verified": true, "helpfulness": "0/0", "author": "K. Kaligian"}, {"rating": 5.0, "review": "Can't live without it now", "verified": false, "helpfulness": "0/0", "author": "tmunir6"}, {"rating": 3.0, "review": "Works fine about 40% of the times. It keeps loading a video,is stuck at 50% for like 4-5 minutes... takes the fun out of watching movies/series.I thought that the problem was with my internet. However, the same videos load great on my laptop/iPhone.Connectivity issues are frustrating. Setup is extremely easy.I believe it's coz the wifi router is a little away from where the chromecast is. But just doesn't work for me!", "verified": true, "helpfulness": "0/0", "author": "kimaya kamat"}, {"rating": 4.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Jorge Alfredo Niebla Ojeda"}, {"rating": 3.0, "review": "It's picky with its signal", "verified": true, "helpfulness": "0/0", "author": "JTJ"}, {"rating": 3.0, "review": "good that is all", "verified": true, "helpfulness": "0/0", "author": "iluminado"}, {"rating": 3.0, "review": "I don't know what I expected. I think I was dazzled by the hype. It's okay, but it's not that fabulous. In fact, the only thing that it does that I couldn't already do is mirror my phone screen so that I can show a slideshow of my photos. This is practically the only thing I use it for. I suppose for $30, that's okay. Oh, worth noting, sometimes I just randomly disconnects. Pretty annoying when you're in the middle of showing vacation photos to a group of friends and family.I was really disappointed that I can't use it without WiFi access. I was hoping I could use my phone data and phone connection rather than WiFi. But, that's not the case. If you think you can use it using your phone data, then, hopefully you read this and realize you can't before you're like me and make the purchase anyway. Shame on me for not reading the details more closely!The one good use: my TiVo's Amazon app won't let me access the \"free\" Prime movies. But, with this, I can just stream them. That's nice.I suppose if you have an old TV without TiVo or other similar type program that has apps for Hulu, Netflix, etc, then this would a hugely awesome product. But, if you already have access to those things, this isn't all that necessarily, imo.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]