[{"rating": 5.0, "review": "I've had a Sony WiFi box for a couple of years and it was very reliable for watching Netflix Streaming until about 6 or 7 months ago, then there was constant stopping and buffering to the point that I called Netflix to see if anyone could explain to me why Amazon Prime streaming was 30 times faster than Netflix streaming.  The customer service representative told me it must be my equipment, but couldn't explain why my equipment worked just fine for Amazon Prime streaming.  I had read that Comcast and a couple of other companies were throttling back the streaming speeds unless they were paid a very large fee for the extra speed and that Netflix had refused to pay it.  I've read since that Netflix developed their own system...it still doesn't stream well through my Sony WiFi box.An Internet friend posted on Facebook that her computer whiz son had told her of the Google Chromecast device.  On her testimony that the Chromecast device solved her Netflix streaming problems, I purchased one.  The good news--it works great!!!It does not have it's own tuner or remote control, but rather, a smart phone or tablet with the Chromecast app. and the Netflix app. is used as the tuner and remote control.  Once the program is chosen (i.e. Netflix, YouTube, etc.) the device you use to select the programing can be used for other apps or turned off for that matter and the program continues to play on your television without using your phone data or battery.Setup is easy!  I have not experienced any occasion of loss of streaming or slow up from buffering other than the initial buffering of about 3-5 seconds.", "verified": true, "helpfulness": "0/0", "author": "William L. Benedict"}, {"rating": 3.0, "review": "does a good job streaming from your computer to a TV, but need both computer & tv to watch", "verified": true, "helpfulness": "0/0", "author": "tomh"}, {"rating": 5.0, "review": "This thing is awesome. Easy to install, works great. I have been watching new shows and movies as well as shows i haven't seen in years.  I will be ditching cable as soon as I get an antenna for local channels. The only thing that would make it better would be an app for streaming live tv. Gave it a five because there is no six!", "verified": true, "helpfulness": "0/0", "author": "Don C. Edgar"}, {"rating": 1.0, "review": "The Chromecast needs more evolvement. The reception was extremely choppy, and there weren't near as many channels as the ROKU offers. I tried watching live TV through the Chromecast, and the reception wasn't near as good as the computer I have hooked up to my TV. I am a bit spoiled because I have ROKU devices on every TV throughout my home. I have never had a problem with any of my ROKU devices.", "verified": true, "helpfulness": "0/0", "author": "Tahoe Karen \"Karen\""}, {"rating": 2.0, "review": "Look, the idea behind this thing is pretty cool.  But it just doesn't work that well.  The first day I had it, it took an hour to set up because the app that you have to download froze my computer several times (it then encourages you to download a few other apps, and to download all the apps on all your devices, which I have no desire to do).  I finally got it set up, and now every time I turn my TV on I have to log in from scratch again - there is no option to \"save password\" or \"auto connect\" to the wireless.  Every time you have to run the setup, your internet on your computer goes down for about a minute.  And the streaming quality is great - about half the time.  But it will randomly freeze and then reload at quality so poor I miss my mom's black and white dial TV from the 60s.  Some websites work better than others - Hulu basically just doesn't work at all.  I've moved it around so its closer to my router, or closer to my laptop, or farther, and nowhere works.  I thought maybe it was user error but none of my friends can get it to work either.  I'll be returning it to Best Buy within a few days.", "verified": false, "helpfulness": "0/1", "author": "Catherine"}, {"rating": 5.0, "review": "At home I have this plugged into the HMDO port on the side of my Panasonic HDTV. I couldn't plug it into the back since the TV is mounted on the wall. It does a great job bringing me almost everything I get from a Roku box, which I have in another room.", "verified": true, "helpfulness": "0/0", "author": "Marc"}, {"rating": 5.0, "review": "LOVE IT!!!!!  CAN PUT YOUTUBE FROM MY PHONE TO MY TV!!!!  Can also do Netflix and more. Google did it again!!", "verified": true, "helpfulness": "1/1", "author": "Stephen P. Harris \"Jesus Freak\""}, {"rating": 4.0, "review": "Really enjoy watching Netflix now that I have this product.  Easy to install, did oit myself, with no problems. A good product.", "verified": true, "helpfulness": "1/1", "author": "Christine DiComo"}, {"rating": 5.0, "review": "I love this little thing I can use in every tv in my house specialy my office tv that I don't have cable access. Google need to put more apps for this and like that you don't going to need more cable tv in you house", "verified": true, "helpfulness": "0/0", "author": "Sharon D. Jimenez"}, {"rating": 4.0, "review": "Chromecast is a very good product. The only problem that I have with it is that you cannot cast all video streaming apps that are available (such as Xfinity TV GO). Also, casting from a computer (rather than a tablet) is prone to buffering problems. However, I can't hold that against Google because casting from computer web browsers is still in beta.Overall, it is a good product. Just make sure you are not hoping to cast videos from apps that are not supported.", "verified": true, "helpfulness": "0/0", "author": "Aaron Kenter"}]