[{"rating": 1.0, "review": "So even if you are purchasing it as a gift being shipped to their address, as I did, the card you used to purchase it with is pre-linked to the box for the future purchasing of movies, apps, etc. I started getting notifications that a bunch of purchases were being made with my credit card! It was a huge mess to fix. Buyers beware!!! AppleTV is 1,000 times better!!! Especially if purchasing as a gift- no hassle!!!", "verified": true, "helpfulness": "5/7", "author": "Jennifer"}, {"rating": 4.0, "review": "Amazon fire TV reviewSo let’s get to the cons of the fire TV. Couple things I’ve seen so far are that the memory for the unit is so small.  My question was so what happens when you fill that memory up the memory. I was told that you have to delete it stuff. Come on now I don’t think that’s right.  I did notice that there is a USB drive. So maybe down the road there will be an update that we can use this to add more memory. The other con would be if you can’t download a movie or show and are streaming it. For example Amazon prime buffers every minute. So you can’t really watch the movie. That is if you have Internet connection like I do. I don’t have the best Internet service.  It’s not fast enough but its fast enough to play online multiplayer games if it’s on an Xbox or on the PlayStation. But if you’re watching Netflix it will buffer in the beginning when you’re watching a show or movie. But usually don’t buffer anymore. So to the pro first thing I’ve seen that I liked was set up was quick and easy. The guide and menu to get around isn’t that hard to navigate around.  On top of that you can always use the speech option to find something if it’s a movie or TV show or game or even an app. that’s a very nice feature to have. I haven’t tried the game part of the fire TV. But on that still need to buy the controller for that to post a review. But all for the hundred dollars more less after they get these things fixed. This this product from Amazon I think it’s definitely a good buy in my book.  But back to the memory on Amazon it says 2g but in the info about the product when it's connected it says just shy of 6 GB. I hope we will be able to use the USB drive to add on as much memory as we want. Because with today with technology memory is one key point I look at when I buy a product like this. so these are the reasons why I did not give it five stars when it gets fixed it will definitely be on the top with the other products it contends with.", "verified": true, "helpfulness": "1/1", "author": "jasper"}, {"rating": 5.0, "review": "Great device even if you have a smart t.v.", "verified": true, "helpfulness": "0/1", "author": "Christopher Hernandez"}, {"rating": 5.0, "review": "Great product. Works fast, no lag. Great quality!", "verified": true, "helpfulness": "0/0", "author": "Ernest F. Pena"}, {"rating": 5.0, "review": "This was so easy to hook up to my Panasonic TV. I think the offerings are exactly what I was looking for that I immediatly joined Prime quickly followed by Netflicks. The first time I down loaded a movie I thought I made a bad decision as it indicated I had a slow internet speed and kept buffering till the down load was complete. Since that time downloads seem almost instantaneous and no more problem.", "verified": true, "helpfulness": "0/0", "author": "Dymond Dave"}, {"rating": 2.0, "review": "The first one didn't work I hope the replacement works right.", "verified": true, "helpfulness": "0/1", "author": "Jaime Carlos"}, {"rating": 5.0, "review": "Great product, fast delivery", "verified": true, "helpfulness": "0/0", "author": "michael michaud"}, {"rating": 5.0, "review": "I have had my FireTV about a month, and I have gotten rid of cable. It connected right out of the box and I have had no issues with it. The voice remote works well and I have never had it come up with something that was really far off of what I was searching for. I had no problem installing the batteries for it or getting the back off of the remote. It has a nice soft feel and it is responsive even when I am in bed and don't have a direct line to the box from the remote. I haven't had connectivity issues with the internet that are noticeable, and I don't have super top-of-the-line internet either, just regular 6mbps internet from AT&T.; I don't hardly ever experience buffering or loss of signal even when I am also using wifi on the phone and laptop while watching television. I would recommend this to everyone who is looking to cut the cable, and now with Sling available all the ESPN people can have that a-la-carte. It is fantastic and I am getting a second one for the bedroom.", "verified": true, "helpfulness": "1/1", "author": "Cora Mackenzie \"coramackenzie\""}, {"rating": 1.0, "review": "I didn't know about the product beforehand.  I received it as a present.  I hooked it up and checked everything out.  It appeare that you have to pay for everything even old TV shows.  I will really have no use for the product.  Am I missing something?", "verified": true, "helpfulness": "0/6", "author": "vincent Apesa"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]