[{"rating": 1.0, "review": "One of reasons I bought this was to watch live sports games especially MLB. I have also used a desktop PC or laptop and experience no lagging but on the Fire TV it can be pretty tough. I have tried using both wired and wireless with no difference. If you are using this for none Amazon shows it does not work very well.", "verified": true, "helpfulness": "0/0", "author": "Ryan T Edwards"}, {"rating": 5.0, "review": "No problems. it works great.", "verified": true, "helpfulness": "0/0", "author": "J. Kee"}, {"rating": 5.0, "review": "I bought and installed an Amazon Fire TV unit a few days ago.  Everything I needed was included except for the HDMI cable.  Setup was very easy.  The only problem I had was music setup and a chat line with customer service solved the problem within a few minutes.Now, when using Netflix, I am not pausing for downloads, I am not getting connection errors, I just get the content I want when I want it.  The remote is downright beautiful.  It is simple to use, and it even feels good in my hand!  The voice search has worked perfectly.  This is awesome!  A+ Amazon!", "verified": true, "helpfulness": "0/0", "author": "Chris W. Hayes"}, {"rating": 2.0, "review": "Device works pretty well. Has lots of stuff, games, movies, tv, different apps/providers. But, I can do all this with my xbox one, smart tv or any smart device. Was hoping connection was better. Digitized video images or lagging video even while I can watch on other devices without those issues. Stopped using it after a few days time.", "verified": true, "helpfulness": "0/1", "author": "Jonathan Kirby"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Scott Eicher"}, {"rating": 5.0, "review": "Great for watching NBA playoffs!", "verified": true, "helpfulness": "0/0", "author": "Jon Caranto"}, {"rating": 5.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "John Rebmann"}, {"rating": 5.0, "review": "Best ever", "verified": true, "helpfulness": "0/0", "author": "Pete Maggio"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Janet M"}, {"rating": 5.0, "review": "Loved it works great and easy for the kiddos to use", "verified": true, "helpfulness": "0/0", "author": "David Crow"}]