[{"rating": 5.0, "review": "Excellent product!! $22 + tax is what I paid 3 weeks ago. I'm ordering 2 more when it goes on sale again!!", "verified": true, "helpfulness": "0/0", "author": "Cheech Rhein"}, {"rating": 5.0, "review": "I love the device, easy to set up, and works smoothly.  Only thing is, good luck on getting the $20 Google Play offer.  It does not exist.  The instructions tell you to got to chromecast.com/offers and there you will find 5 other freebies but not the $20 credit.Update: 12-22-14,  Contacted Amazon by email in regard to the advertised credit and they took care of the issue in-house.  Amazon customer service is amazing!Update: 03-02-15  This is truly a great little device. Stays hidden and out of site requiring nothing from you but to enjoy its benefits. The best part is that you can use a tablet or smartphone for your Netflix, Youtube, Nick, etc. to watch without hassles.", "verified": true, "helpfulness": "1/1", "author": "PapaJ \"Jesus is Lord\""}, {"rating": 5.0, "review": "Makes your dumb TV smart, assuming you have HDMI and  USB port cupcake!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it, works like a charm. Works as intended and advertised.", "verified": false, "helpfulness": "0/0", "author": "James"}, {"rating": 1.0, "review": "Works great! Did NOT come with $20 credit in the play store as advertised. It's been a week since I've reported it to Google and have been told that my \"concern has been elevated\".Also, if this is your second Chromecast they will not honor the 2 month free Hulu and 1 month free Google Music. You will however get 1 month free foreign language TV. Yay.", "verified": true, "helpfulness": "1/2", "author": "Belldl"}, {"rating": 5.0, "review": "Excelent product and cheap", "verified": true, "helpfulness": "0/0", "author": "Nataly R."}, {"rating": 5.0, "review": "Priced perfectly. No problems. Allows us to share more time together viewing as a family.", "verified": true, "helpfulness": "0/0", "author": "Carla Myers"}, {"rating": 4.0, "review": "My review won't cover too much over what has already been reviewed.  That said, I will give you my experiences for what they are worth.First, this device is a not Miracast compliant.  It's connectivity is proprietary.Second, the device does far more than most think it does.  Often we hear that it doesn't support Amazon Instant Video, but it does!  It can do so in two ways.  First, there is an application in Google Play for Amazon Instant Video.  It works great.  I can run my Prime account on it and cast my Amazon library all day long!  Also, you can use the Chrome browser on your PC to cast Amazon Instant Video.  This works fine as well.Any video that you can run on your Android and that you can run within your Chrome browser (that supports casting) will work just fine.There are applications that support Chromecast natively (like NetFlix and YouTube) and applications that don't.  It doesn't mean you can use the non-native applications.  They cast just fine.Regarding surround sound.  You must plug the Chromecast into a surround sound HDMI port, otherwise it will only produce Stereo.  Now, I first tried using the Chromecast on my Panasonic HDTV and plugged in into the HDMI port routing the sound to my Pioneer receiver.  I use a digital fiber cable to pass the sound from the TV to the Receiver.  It only passed stereo.  I still don't fully understand why, but I plugged the Chromecast into the receiver instead and got perfect 5.1 surround sound.  I think it only passes surround sound through HDMI audio.  Anyway, my solution worked just fine.One issue is that you cannot go too far from the Chromecast with your casting device.  It will lose the signal.  Remember that if you are casting video from your phone and walk to the frig to get something to eat.The Chromecast is kind of fat so you need to use the extension dongle if you are plugging into a tight spot with other HDMI cables plugged in.  I needed it for the Pioneer Receiver.It uses USB to charge it.  Either plug the device into a wall outlet using USB or you can plug the USB charging cord into a USB device like your TV.Quality if the picture is first rate.  No issues.  Same with the sound.I have had very few issues.  I use a Nexus 5 phone.  I had NO issues with Kit Kat OS but when I upgraded to Lollipop 5.0, it occasionally lost it's connection.  Not often but sometimes. Lollipop 5.01 is coming out soon and I hope that stabilized the phone.  This is probably not the Chromecast's fault but my OS on the Nexus 5.  WiFi issues on Lollipop 5.0 are a known bug.I cast Pandora and other music from my music file collection to Chromecast.  Sound is fantastic.  No issues.So, hope this was not too long or too short but that's the gist of my experience.Thank you.", "verified": true, "helpfulness": "0/0", "author": "US Hondo \"Ironman\""}, {"rating": 5.0, "review": "My wife is extremely into her TV shows, so I bought this for her as an anniversary gift. First of all, it was very economical, only $32 when I bought it. Secondly, it integrates with almost everything: iPhone, iPad, Android, Mac, and PC. Many apps also integrate with it: Netflix, Hulu Plus, Google Chrome (on PC or Mac only), the ABC app, Amazon Prime, etc. It works extremely well and most apps will even allow you to change the volume or pause the show from your device. I am in love with this device. It is also a very low-powered device, so it is a lot more economical to use for streaming than a PS3 or other bulkier device (PS3 is what I used to use).There are a few small downsides, but they aren't faults of the device itself.1. Netflix is kind of finicky. You have to switch chromecast back to your device and then close the app, otherwise it doesn't disconnect. Even then, Chromecast will still show the Netflix banner on your TV until you do something else with it. Kind of annoying, but this is a problem with the app, and not with Chromecast.2. I wasn't able to get Chromecast to work with Linux.3. Some things, like the Xfinity website, can only be cast from a computer via the Chrome Chromecast plugin. This is okay, but it would be nice if the Xfinity Go app supported Chromecast.All in all, very user friendly, very useful, and easily worth the price.", "verified": true, "helpfulness": "0/0", "author": "Nik"}, {"rating": 5.0, "review": "I love the Chromecast. Use it all the time!", "verified": true, "helpfulness": "0/0", "author": "Brandon"}]