[{"rating": 5.0, "review": "Amazing device.  Pretty simple for beginners is a real plus.  Very reliable in terms of having to reset.  Batteries don't seem to last long in remote.", "verified": true, "helpfulness": "0/0", "author": "CHEYENNE"}, {"rating": 5.0, "review": "Shows load fast, i like the microphone search.", "verified": true, "helpfulness": "0/0", "author": "steve"}, {"rating": 5.0, "review": "I think this is a cool Pandora box, I was truly impress on the availability of entertainment this little black box provides.", "verified": true, "helpfulness": "0/0", "author": "Toodannice"}, {"rating": 5.0, "review": "Sooooooo awesome!!  no need for cable thats for sure!!", "verified": true, "helpfulness": "0/0", "author": "Ahna Vaoifi"}, {"rating": 5.0, "review": "Excellent product. Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "ptaylor063"}, {"rating": 4.0, "review": "Amazingly simple to set up and use (there's actually nothing that needs to be \"set up\").  Plug it in, it finds your home network by itself, and start watching.The selection from Prime Videos is not as large as Netflix or Hulu, but you can get those on the Fire TV too if you want.  If you have a large selection of your own videos, photos or music on your computer that you'd like to stream to the Fire TV I'd recommend Plex (download the free Plex server to your computer and the Plex app to your Fire TV, and all your media streams to your TV.)My only gripe with Fire TV is that -- like the Kindle Fire itself -- the user interface is set up to be primarily a advertisement for Amazon stuff.  Fire TV would be a much better product if the home screen could be more customized to users tastes.  Really Mr. Bezoz -- you don't have to put the salesman in front of us all the time.  We won't forget you.Still, it's fast and simple and so far (almost unbelievably) everything works every time.", "verified": true, "helpfulness": "1/1", "author": "Tom Ryan"}, {"rating": 5.0, "review": "Was just surprised that a free TV show wanted me to pay to watch episodes. So, I would suggest that you make sure everything is working properly because I don't see how you suppose to pay for free TV, and the purpose of buying the Amazon product was to make sure if I did miss an episode I had an option to go back.", "verified": true, "helpfulness": "1/1", "author": "Darrell Carter"}, {"rating": 4.0, "review": "I own a Roku 3 as well and have to say, I like the Fire TV better.  While they are both easy to navigate, the FTV is faster and the build quality feels more premium.  One thing I wish it had that Roku 3 has is the ability to connect headphones to the remote.  It's a nice option.  One thing I don't like is there is no way to easily distinguish between Amazon Prime shows and regular videos.  What I do to get around this is log in with my laptop, select all the Prime shows I am interested in and move to my watchlist.  If they fixed this which I know they could, I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "m7"}, {"rating": 5.0, "review": "Amazing product. I've had it for less than a month and still exploring all the wonderful functions. I take it with me when I'm on the road (use in hotels or other family members homes when I know kids will be around to enjoy).  You can use the iPhone as your remote and the microphone feature is nice.", "verified": true, "helpfulness": "0/0", "author": "Yvette Garcia"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Stephen D. Newfield"}]