[{"rating": 3.0, "review": "much of what i want to see has a cost attached, I expected more free TV content.", "verified": true, "helpfulness": "1/2", "author": "LIONEL E. AUDET"}, {"rating": 2.0, "review": "It is a waste of money. Everything I have tried to watch I would have to pay for. Yes I have a prime membership.It's just as easy for me to stream from my pc to the TV.Easy hook up and runs other apps though. Then again my surround sound runs all the same apps.", "verified": true, "helpfulness": "1/3", "author": "Brian Mercer"}, {"rating": 5.0, "review": "I didn't think my IP would be fast enough for the Fire to work, but it does. It's even easy for my wife to use and she can't operate a DVD player. I don't use it daily, but we use it a lot. It's worth the money.", "verified": true, "helpfulness": "1/1", "author": "Rick L. Warren \"tonopahrick\""}, {"rating": 4.0, "review": "Great product....should have purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Ulric Scott"}, {"rating": 5.0, "review": "love this I turned off all move channels and saving money.", "verified": true, "helpfulness": "1/1", "author": "carb2"}, {"rating": 5.0, "review": "My life is complete!", "verified": true, "helpfulness": "1/1", "author": "ozark705"}, {"rating": 5.0, "review": "We love it.  We also have a chromecast but this is so.much easier to use. Would recommend highly.", "verified": true, "helpfulness": "0/0", "author": "Sandra Kennedy"}, {"rating": 5.0, "review": "Just received my new toy the Amazon Fire TV. So far it's amazing! It's lighting fast and the voice controller is so easy to use our 4 year old is finding his programs without problems. Great parental control features and easy to navigate. We also have an Apple TV and have problems accessing Pandora and anything related to Amazon (Initial reason for purchasing the Fire TV.) Apple TV allows access for a few minutes then kicks us off harshly :( We were able to use Pandora flawlessly for hours last night. We are able to access Amazon prime videos and Netflix without any problems. The remote is easy to use and has a non-slip surface which I'm happy about as the Apple remote slips out of my hand often. I like the fact that Amazon is giving other companies a run for their money. Congrats to Bezo's and his staff for being so innovative throughout the past years. This is another excellent product on the market and faster than other similar products. You can access cooking recipes, music videos, purchased and free prime movies, and tons more information. A must purchase if you are into technology or making your everyday life more simple to navigate.", "verified": true, "helpfulness": "1/1", "author": "Kris W."}, {"rating": 4.0, "review": "just  got it still trying it out", "verified": true, "helpfulness": "0/0", "author": "velinda"}, {"rating": 5.0, "review": "It works great and we love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jane Smith"}]