[{"rating": 5.0, "review": "Love it, works great I have the whole house chromed out plus it's Google so you know it's going to have a great additions in the future.", "verified": true, "helpfulness": "0/0", "author": "ben franklin"}, {"rating": 4.0, "review": "The device works fine, it will be better when there are more apps. The netflix code did not work, not sure what to do about that.", "verified": true, "helpfulness": "0/0", "author": "Moby"}, {"rating": 5.0, "review": "This product has so much potential, the developers just need to keep working on it.  Currently you can only use it with a laptop or an Android device.  It will stream Netflix and anything from your Chrome Browser, but that is about it.  It is essentially a wireless HDMI link that can only display your browser and Netflix . . . FOR NOW!  Please pay attention to the \"for now\" part, this is a recent device, and the potential is endless.  They can integrate this to work with almost anything, and we know it because AirPlay essentially does the same thing.", "verified": true, "helpfulness": "1/1", "author": "Average Guy Reviews"}, {"rating": 5.0, "review": "We had no streaming devices at the time, so this device is gold for us. It's super easy to cast from a mobile device or your computer. I can't wait until they add more apps!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"Becca\""}, {"rating": 4.0, "review": "Setup required a little router tweak--my router only broadcasts the UPnP every half hour or so, so it took some time for Chromecast and the router to find each other enough to allow setup, but after that it was utterly brainless to set up.Netflix is flawless. Youtube is perfect. I have all three wireless devices (desktop computer, television, router) within 15 feet of each other with super strong connections, and Cast-this-tab worked GREAT on Hulu plus as long as I wasn't downloading or streaming anything massive. Occasionally sound and video would get a tiny bit out of sync, I'd pause the playback on Hulu, wait for it to catch up and then play again and it would correct--unlike many applications where once the sound is out of sync, you are out of luck.This has given our TV new life. I can now watch a video and do full-screen applications at the same time, which my kids are very happy about. Right now I'm leaving a review while my son watches our muppet playlist on Youtube, snuggling next to me.Adding this to my list of things that do not suck.Oh, we lost connection once (probably the router's fault) and turning the TV off and back on fixed it completely.We don't have cable and pretty much only used the TV for video games until my eldest moved out, so it's been unused for nearly a year. It really is bringing new life to our tv.Warning: The $35 pricetag is great...but it may end up with you buying new furniture, hiring electricians to put plug sockets in new places, and that isn't cheap....Addendum: I've knocked a star off. With use, bugs have cropped up. Netflix does not always load consistently, Youtube has issues with more than 30 items in a playlist. Extensive troubleshooting has not yet resolved these issues, but we've found some workarounds (reboots, opening up the app and finding the chromecast seems to \"kick\" it into gear). They're going to be replacing it soon, and we'll see if that helps.", "verified": true, "helpfulness": "1/1", "author": "J. Rosenberg \"Jenrose\""}, {"rating": 5.0, "review": "Great product....Free Netflix  3 months is great...Works great with YouTube , Netflix and chrome even local files work great....Thanx google...", "verified": true, "helpfulness": "1/1", "author": "paul"}, {"rating": 4.0, "review": "First, a quick recap: Chromecast is a $35 streaming dongle that plugs into your TV's HDMI port. You can use it to stream online videos from YouTube, Netflix and elsewhere, and use your computer, mobile phone or tablet as a remote control. It doesn't have any kind of separate app store or user interface on your TV - everything gets controlled from the PC or mobile device. The key word here is control: Your phone doesn't stream videos directly to your Chromecast dongle. Instead, it just tells the device which video it should stream from the cloud. That means that you can use your phone for something else, or even turn it off, once the stream starts. This kind of remote control capability only works with apps and sites that directly support Chromecast. In addition to that, users can also stream any web content directly from their computer's Chrome browser, as long as they have a special Chrome extension installed.I set up Chromecast three times: First, with a unit loaned from Google in my office, then with the same device at home and finally with a Chromecast I bought for my own use. Doing so taught me that the setup can be remarkably easy if you follow Google's directions and download the setup app on your computer or mobile device. I chose to ignore these recommendations, tried to set up the device with my Nexus 7's Chrome browser and got stuck. Go figure. But enough of the complaining. Just get those apps, and the setup is literally done in two minutes. Just plug the dongle into your TV, connect it to a power source (I'd recommend not using your TV's USB port but the extra charger that comes with the device; more on that later.) and fire up the app on your computer or mobile device. Enter the password of your local Wi-Fi network, and you're all set.Chromecast is a great device for Netflix viewing: Streams look as good as on any other device I've tested, and I actually found that navigating the Netflix catalog on my computer or mobile device worked much better for me than on a connected device. Also cool: A friend of mine came over, took out her iPhone, connected to our Wi-Fi network, and streamed something to our TV using her Netflix account. No complicated account switching was necessary. It's a small thing, but the fact that the dongle isn't tied to a single Netflix account makes it a whole lot easier to enjoy movie night with friends. The one feature I missed from Netflix on Chromecast was the same kind of post-play experience Netflix is now offering on other devices. The next episode of a show doesn't start automatically, forcing you to instead bust out your phone again and manually select what to watch next.The other major use case for Chromecast right now is YouTube, and I streamed my fair share of videos from that site in the last few weeks as well. Overall, streaming worked once again really well, and even more than with Netflix, I quickly found this setup to work much better for my needs than YouTube's TV app on other connected devices. I did find a few things that YouTube could do to improve the experience. First, beaming videos to Chromecast from your PC is currently only supported if you are on YouTube.com, and not if the video is embedded in a third-party website. That means that even on Google+, you need to click through to YouTube.com before you can start watching on the big screen. Also, YouTube's mobile app currently has a neat feature that allows you to add videos to a queue of things to be played next on TV, something that you can even do with multiple devices at the same time - think YouTube party. However, there's no support to queue up videos from the Chrome browser yet. In one or two cases, I ran into issues of videos giving me \"unsupported video format\" error messages, but overall, playback was pretty smooth. I even played back an entire VOD movie from YouTube.com via Chromecast without any issues - and this was the first time it really made sense to me to pay for a video on YouTube.As mentioned before, Chromecast does offer the ability to stream a tab from your PC's Chrome browser straight to your TV. This is similar to screen sharing in a teleconference, meaning that the browser captures everything in a new video - something that is quite resource-intensive, and even on my 2012 Macbook Pro led to a few performance warnings when streaming video. The idea behind this screencasting feature is to enable you to stream anything that's not available through a native app yet. I tried it with a few Hulu streams, and while it worked, it definitely degraded the quality to a more VHS-like experience, complete with a few skips every now and then. I found that it worked well enough to watch animated fare like the Simpsons, but that it was a bit too painful for shows I'd rather watch in HD on a Hulu Plus-capable device. I also tried to play a few local videos by simply dropping them onto the Chrome browser tab, and experienced similar mixed results. This may be acceptable if you don't have any other way to get local videos onto the TV, but it's definitely not great, which is why Google still calls this feature beta. Luckily, there are a number of apps in the works that will enable you to play local content without compromising on picture quality. I did on occasion use the browser-based streaming to listen to music from Rdio.com via the browser, which was far less taxing on my Macbook, and the Rdio player actually looked quite nice on the TV. However, even with this, I occasionally encountered some weird glitches, including changes in tempo for a second or two.", "verified": false, "helpfulness": "5/6", "author": "James"}, {"rating": 4.0, "review": "I got it and hooked it up in just minutes. No issues with connectivity, no problems with the App. I immediately had it streaming Netflix and it seems to work perfect.The only reason I dropped 1 star is that it needs more apps to stream.", "verified": true, "helpfulness": "0/0", "author": "Curt Christianson"}, {"rating": 5.0, "review": "I wanted to stream Netflix on my older 50\" 720p plasma TV, and this little gadget fits the bill perfectly for a low cost. It requires a microUSB cable (provided) to power it, which can be plugged into either a USB port on your TV if available, or into a 120v wall adapter (also provided). It cannot be powered directly from the HDMI port alone, even if you have an MHL-HDMI port (source: Anandtech.com).We already have a Roku 2 XS in our living room, which does a considerable bit more than the Chromecast. But it's bigger and bulkier, it costs more, and it does a lot more than what we actually need. If the Chromecast ever gets Amazon Instant Video and Hulu Plus added to it, it will be our perfect little bedroom player. It can already play videos from those sources through a Chrome tab, but you need a desktop or laptop computer to supply that to the Chromecast; you can't currently cast a Chrome tab from your smartphone. Hulu and HBO are already working on getting their apps added to the Chromecast according to various online news sources, as well. Also, for Amazon/Prime Instant Video being cast from a Chrome tab, make sure you are using Flash as your video plug-in for Amazon and not Silverlight, as Silverlight (and Quicktime) videos can't be cast from a Chrome tab to the Chromecast. If you are already using Silverlight (you'll know when the video won't cast properly), the solution is to go into your browser and disable the Silverlight plug-in in your settings. Then reload the Amazon video page and choose Flash as the player when it prompts you. Once you have done that, you can then re-enable Silverlight in your browser settings.One thing I like about the Chromecast over the Roku 2 XS is the Netflix loading screens. You get a nice big cover image of the show (like a DVD's cover art; not just a still image grabbed from the playback) with the name of the episode on it instead of just looking at a loading bar. Incredibly slick, to say the least.The use of a smartphone to control the device may seem a bit off-putting at first, but since we already have our smartphone by our side nearly all the time, it's nice not having to worry about an extra remote. If you've ever used the YouTube-to-XBox360 streaming feature, the Chromecast works exactly the same; you start up the video app on your phone, and then you click the little TV icon and it transfers over the streaming duties from your phone to the Chromecast. A big plus to this method is that it truly does TRANSFER the duties over; your phone does not act as a middle-man, but rather, the Chromecast connects and steams directly through your wifi with its own video app, and your phone just switches into remote control mode.I highly recommend picking up this device if you currently have a non-smart HDTV that you'd like to add Netflix, YouTube, and Google Play Video capabilities to it for a low cost ($35 at the time of this review). It's hard to go wrong for this price, especially with a Google product that has the potential for so much more capability down the road still.", "verified": false, "helpfulness": "8/11", "author": "Davey B. \"Gadget Geek\""}, {"rating": 5.0, "review": "The minute this shipped, I received my Netflix discount code in an email.  I was already paying for Netflix so I saved $24.  I already have a Roku box and a \"smart\" Blu-Ray player.  I got this little guy because it looked cool.  It's a toy so I can stream You Tube from a browser vs a crappy app.  However, what I never thought of was Netflix, I usually search on my laptop or the iApp for something to watch via Netflix because the interfaces on streaming devices is just so awful, with this little guy, I have no need for those devices. I can use the iPad/iPhone or laptop to search and stream.  I may even give Hulu a whirl whenever I remember it exists.", "verified": true, "helpfulness": "1/1", "author": "RachelKati \"I shop, therefore I am\""}]