[{"rating": 5.0, "review": "Great addition to my already \"smart\" 70\" Vizio TV. Voice search is EXCELLENT Bought (2) of them.", "verified": true, "helpfulness": "0/0", "author": "Don Buckshot \"Buckshot1938\""}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "BAMBI BEE"}, {"rating": 1.0, "review": "I am so disappointed in Fire TV and I cannot see any reason to use this over any of the other streaming media devices. It is geared 100% for streaming amazon content to the exclusion of everything else. The other streaming devices I have used allow you to install your apps, arrange them on your menu screen, and just watch whatever you want in whatever app you want. Amazon Fire TV is basically like being stuck in the amazon app, constantly bombarded with tv shows and movies on your main screen that you have no interest in.  I also feel like I'm operating it with blinders on to force me to only buy content through amazon's pay per view model. There is no option to arrange or remove things from the menu screen and the whole thing is just a mess to me.  I have already purchased dozens of tv shows and movies through VUDU using my ROKU and I have no way of accessing them through Amazon Fire TV. I really wanted to switch to this from the ROKU but this is a huge step back.", "verified": true, "helpfulness": "1/1", "author": "Adam Poole"}, {"rating": 4.0, "review": "Nice box but I wish you could use a flash drive to play movies on it.  I have the MX hate it but you can use a flash drive with it.  Wish I could find one that does it all and has a good picture.  Had questions called Amazon, great customer service!!", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 1.0, "review": "it wont com on sam", "verified": true, "helpfulness": "1/2", "author": "Sam Dalton"}, {"rating": 5.0, "review": "The Amazon Fire tv is very fast. You must have prime to enjoy it to its fullest. The good and the bad. The good faster processing chip and the ability to play games. The bad 8gb of internal memory not enough for games and apps. So you will have to uninstall most of the apps and games when your finished them.  Just wish they had crunchyroll so I can watch anime and I wish they had a combo deal for the Amazon fire TV for the controller to get both. Instead of buying both separate. It's very easy to use this device. The voice feature is very helpful. No airplay feature built in and they do have apps for airplay. Haven't tried them yet. Best of the apps on the Fire TV sling tv and twitch  and Spotify. There are a lot more apps for this machine more than any other streaming devices on the market.My rating 8.9/10", "verified": true, "helpfulness": "0/0", "author": "Jay Williams"}, {"rating": 5.0, "review": "It was easy to install.  Not happy with all the boxes for directv,tv remote and now amazon fire remote.  Love to see them work as one.How do you turn off the fire box when done?  Rest is great", "verified": true, "helpfulness": "0/0", "author": "L.C."}, {"rating": 4.0, "review": "We just dropped our Direct TV and we were looking for something different.  Haven't figured out the best way to navigate the video lists yet but we do like the basic features.  Since I don't mind watching a movie on my Kindle Fire 8.9 screen, it was nice to find out we could both watch different videos (movies or TV shows) if we didn't agree on what to watch.  The photos that you run when we pause a movie are spectacular!  Sometimes we spend a little extra time on pause just to see the photos.  God's creation is awesome!  We appreciate you giving us views of things we would never otherwise see.  Hope you keep adding photos.", "verified": true, "helpfulness": "0/0", "author": "Lynn Trickle"}, {"rating": 4.0, "review": "Required stronger WiFi router", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A. Howard"}, {"rating": 5.0, "review": "Very satisfied.  I have not had the product that long but it appears to work good.  I purchased it when on sale.  The voice search works without any problems.  Setup was easy and took no time at all.  I do wish there was and Android app for Amazon Instant Video like there is for the IPAD. It would also be nice if the voice search feature worked with the Netflix app.  The voice search is a nice features and has been very accurate in searching for shows and movies.  I am planning on buying a Fire TV Stick for my second TV in the near future.", "verified": true, "helpfulness": "0/0", "author": "Ray"}]