[{"rating": 5.0, "review": "Purchased for total price of $12 with gift cards and discount codes. I think it would still be a good buy at full price.Sometimes watching Netflix, it would buffer a few times, but no worries here", "verified": true, "helpfulness": "0/0", "author": "Herman"}, {"rating": 4.0, "review": "I think i very good, in My case i was needing something like that, i used the ipad to put a movie at the chromecast and them i give it to mi litle girl 28 month. And all are happy", "verified": true, "helpfulness": "0/0", "author": "felix german"}, {"rating": 5.0, "review": "If it weren't for Game of Thrones I would no longer need cable, seriously. The best 35.00 I ever spent.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 1.0, "review": "Its really useless. It requires you to manipulate a whole other device to make it work. Making you have worry about battery usage on the device you are using to stream from. Also, it heats up like crazy", "verified": true, "helpfulness": "0/1", "author": "Richard Inga"}, {"rating": 3.0, "review": "Little hard to connect with the unit when I take around different TV set.  We had problem with home wifi when we use CHROME CAST .", "verified": true, "helpfulness": "0/0", "author": "Twin"}, {"rating": 3.0, "review": "this doesn't really do anything that I can't do with my android tablet or smartphone. For some reason, my TV won't release the HDMI input that the Chromecast was plugged into - it cannot be used for a different input until it has been unplugged for some time. And it screws up an HDMI switch I bought to use multiple inputs with a single HDMI port. Nothing else will work until the TV has \"forgotten\" the Chromecast. It's only $35, but you probably don't need it.", "verified": true, "helpfulness": "0/0", "author": "T. E. Schlemmer \"Schlem\""}, {"rating": 5.0, "review": "The Best 29,99 i ever spent. With Plex Media Server+Plex for andriod i can watch all my Videos from PC and with aVia all of the local videos from phone and tablet.", "verified": true, "helpfulness": "0/0", "author": "Dmitry Podkopaev"}, {"rating": 5.0, "review": "Very good device eliminates spending a few hundred more on a smart tv.. Great device Google... Thinking of buying a few more for that good price...", "verified": true, "helpfulness": "0/0", "author": "Gary Dwayne goodman"}, {"rating": 5.0, "review": "No headaches, it just works. More reliable than my Samsung smart tv, faster, and more convenient through its implementation . I ended up buying 3 for friends and family", "verified": true, "helpfulness": "0/0", "author": "Alvin Lim"}, {"rating": 5.0, "review": "This thing is cool. I can control from my iphone or laptop. Make sure to read up on how it works so you know what you are getting. While you control it with your phone or computer it actually connects directly to the internet through wifi. So instead of your phone or computer streaming a show or movie and then sending the signal to your tv, you start by streaming on your phone or tv, but then once you press the button that connects your device to the chromecast, the chromecast will pick up the signal from the internet and start streaming so that you can even turn your device off and the show will keep playing. It won't mirror your device but if you get the chrome browser it will bassically mirror whatever you are browsing.", "verified": true, "helpfulness": "0/0", "author": "Kevin C Deasch"}]