[{"rating": 5.0, "review": "We got rid of our cable and now use Chromecast and an antennae to watch all our tv. There are more apps adding Chromecast capabilities all the time.", "verified": true, "helpfulness": "0/0", "author": "SurferGirlSD"}, {"rating": 1.0, "review": "Love google, hate this product. MK809IV is so much better and so much more familiar.Android is android. Leave it looking like a phone/tablet setup", "verified": true, "helpfulness": "0/0", "author": "Bri"}, {"rating": 3.0, "review": "Cuts in and out too much in our house.", "verified": true, "helpfulness": "0/0", "author": "T. Johnson \"Pat\""}, {"rating": 5.0, "review": "WONDERFUL", "verified": true, "helpfulness": "0/0", "author": "EduardoRivas Solis"}, {"rating": 4.0, "review": "can get a bit laggy, but works very nicely overall and gets the job done.", "verified": true, "helpfulness": "0/0", "author": "Allena J. Ji"}, {"rating": 5.0, "review": "Very good wasted dollars", "verified": true, "helpfulness": "0/0", "author": "Christopher May"}, {"rating": 4.0, "review": "This fits my needs for a streaming device perfectly. WatchESPN does not last for more than 2 minutes which is unfortunate because it's the one I would use the most.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 2.0, "review": "Swing and a miss again, Google.  You brainstorm something with great potential and functionality and produce a nice product, but then, when there's hicups and problems with it, instead of working hard to actually fine tune the product, your nerds crunch the numbers and decide it isn't worth the time investment and so never quite make anything perfect and move onto the next thing.  Perfect example in the Chromecast: use it long enough and you'll find the connection breaks with your casting device.  You have to reset the CC to get it reconnected.  Figure it out, Google.", "verified": false, "helpfulness": "0/0", "author": "bywayofpdx"}, {"rating": 5.0, "review": "Worked excellent as described.", "verified": true, "helpfulness": "0/0", "author": "Guy M. Mersereau \"Trapper John\""}, {"rating": 3.0, "review": "great way to bounce items to the TV from a tablet or laptop.", "verified": true, "helpfulness": "0/0", "author": "Matthew Sharp"}]