[{"rating": 5.0, "review": "Our Fire TV is amazing. We enjoy the access to movies and television shows. It is easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very nice. this is a great way to stream entertainment to your TV. it works well and has nice features like voice search that actually works.", "verified": false, "helpfulness": "0/0", "author": "Mystery Buff"}, {"rating": 5.0, "review": "We're really enjoying the movies and shows we can't normally see since we don't have any kind of satellite or cable.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Stricter"}, {"rating": 4.0, "review": "I've used the device now for a couple of months and really like it. I did have to return the first device because I had trouble accessingFire TV from my Samsung TV and tech support did not succeed in helping me configure the device to access Fire TV reliably. A replacement device has worked much better but not flawlessly, Sometimes I still have to try several strategies to display Fire TV but not too often.As a streaming device, I like it much better than the Bluray DVD player it replaced. The remote is simple and effective, response is generally very fast, and Amazon content is good and improving. I also use NetFlix and access to that app is also generally good. I've had to re-sign on to NetFlix twice which is irritating but trivial.The install was about as easy as it gets. I bought the plastic mounting bracket and think that was a good investment.I really like watching steaming media and think that I will probably pull the plug on Comcast media content when, and if, I can get the news, science, and history content I also value in a streaming context. That may already be true and I just haven't discovered it yet. That's OK. I am not so anxious to have the optimal TV setup that I can't wait until a better configuration is revealed. There are other activities to enjoy in the meantime.Bottom line: Fire TV is one of the better purchases I've made recently. It ain't perfect but tell me what is?", "verified": true, "helpfulness": "0/0", "author": "Jim Worthy \"Jim Worthy\""}, {"rating": 5.0, "review": "The best out of the choices that are currently available.  The voice search makes such a huge difference.  I am a previous Apple TV owner.  Glad I made the switch.  Nothing wrong with Apple.  But some of the things I like better include:1) Smoother navigation and search, even without voice search2) Remote more powerful and user friendly. Apple remote needs to be pointed directly at box.  Can click willy-nilly with Fire remote and it still works.  Also have to make more clicks for functions with Apple remote (so annoying), which can be made with 1 max 2 clicks using Fire remote.3) Has app store to download additional streaming channels.  Apple does not. And I found a couple of nice additions not available with Apple.4) There is even a fairly inexpensive app (~$2) that you can download to stream content from Apple devices (both iPad and iPhone) to TV just like with the Apple TV.  So I can still stream my favorite video podcasts to my television.5) If you have a Prime subscription, then there is a large volume of movies available to stream for FREE, although nothing current.  But still a decent selection compared to Apple where you have to pay for everything.I'm now a new Fire TV convert.  Hopefully this helps others comparing streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Leslie Turner"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "samantha pierre"}, {"rating": 5.0, "review": "This was everything it was advertised to be!  It was easy to hook up and having access to all the material-TV, Video, Movies and Music that comes with my Prime account is awesome.  Now my daughter and I watch TV together instead of her accessing the Prime material on her laptop or tablet in her room.", "verified": true, "helpfulness": "0/0", "author": "M. M. Enyart"}, {"rating": 5.0, "review": "Amazing! It will interesting to see what Amazon's long term plan is for Fire TV, this could be a game changer.", "verified": true, "helpfulness": "0/0", "author": "Matthew A. Fowler"}, {"rating": 5.0, "review": "Love mine. Only thing missing is access to Google Play Movies.", "verified": true, "helpfulness": "0/0", "author": "Lloyd"}, {"rating": 4.0, "review": "I wasn't aware this didn't have RCA audio out so I had a choice of returning it or getting a newer receiver. I decided to keep it and got the Yamaha RX-V375Yamaha RX-V375 5.1 Channel 3D A/V Home Theater Receiver (Black). The Roku box was always hot, using up energy, so I like the Fire as it stays at room temperature. The picture is more vivid than with the Roku but I miss the numerous channel choices on the Roku. If we didn't have Prime I would stay with Roku. I would like to see Prime catch up with Netflix for program searches. I haven't used the voice search much but what little I have didn't inspire me to use it more often. A matter of personal preference, not functionality. I search for programs primarily with the computer online at Amazon. Can you get YouTube channel on the Fire? I don't know, I've a lot to explore.", "verified": true, "helpfulness": "0/0", "author": "Richard"}]