[{"rating": 3.0, "review": "Got a good deal and it works as a limited streaming device, but really should have better instructions and better options.  I've been on-line multiple times trying to get better instructions and get just the same Google videos and basic instructions.  I haven't been able to find the answers to my more detailed questions and there is no help desk to call.  This should be easy.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Simply amazing", "verified": true, "helpfulness": "0/0", "author": "Thom Simmons"}, {"rating": 4.0, "review": "Not enough features yet to fully justify the purchase if you aready have an hdmi cable and laptop.", "verified": true, "helpfulness": "0/0", "author": "Alpinstang"}, {"rating": 5.0, "review": "This might be just me, because I don't have a Smart TV, but that HDMI jack makes my Chromecast SO worth having. Now they have a Karaoke app too! I watch Hulu, YouTube, HBO Go, Netflix, etc...", "verified": false, "helpfulness": "0/0", "author": "Kim McG"}, {"rating": 5.0, "review": "works great for streaming netflix and youtube.  it has many other uses but i mostly use this product for those two uses and it does it well! I use it with my iPhone 5 and it allows you to use your phone at will while watching streamed images.", "verified": true, "helpfulness": "0/0", "author": "Jorge '84 \"Jorge Sanchez\""}, {"rating": 5.0, "review": "Hate to be all positive an glowy here - but ChromeCast does work, and works well. It is the ONLY way I can watch a few things - like HBO!  I also have a roku and a sony network media gadget in another location.If you have one of these, or are considering one - also get PlayOn. It works seamlessly with it, and it provides a very convenient way to locate and play almost ALL of the videos on the internet.Cut the cord - get a decent internet link and you are good. A somewhat speedy PC works also - mine is fast enough - but it slows a bit on some transcoding. PlayOn has a recommendation on their web site. And it doesn't have to be a pricey PC - just one with a FAST processor. That is especially true for the HD streaming.", "verified": true, "helpfulness": "0/0", "author": "Carl Scheider \"Carl Scheider\""}, {"rating": 5.0, "review": "it works fine, but sorry , not serve as a hdmi cable where you can see everything that I have on the screen of my device.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Leitón"}, {"rating": 5.0, "review": "Very good quality built I definitly recommended", "verified": true, "helpfulness": "0/0", "author": "Ignacio Costas"}, {"rating": 5.0, "review": "Very cool device and does exactly what I want it to do.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Perfect and great value...", "verified": true, "helpfulness": "0/0", "author": "LEIGH ANN GRIFFIN"}]