[{"rating": 5.0, "review": "My son and I use Chromecast to watch movies and stream video from our tablet to the TV. Works great", "verified": true, "helpfulness": "0/0", "author": "C. Gregg"}, {"rating": 5.0, "review": "One product that is helping people cut their cable TV tether is the Google Chromecast, which allows you to stream media from services such as Netflix, YouTube, Hulu Plus, Pandora, and HBO to your TV.The Chromecast looks like a tubby memory stick, but it has an HDMI connector on one end, which plugs into your television or display, and a micro-USB port on the other end for power.The Chromecast supports apps on your Android and iOS devices as well as content via the Chrome browser on your computer. The number of apps available for the Chromecast is growing, as are the number of movie, TV show, and music services supported.In addition to streaming video and audio, another really cool thing you can do is cast content from your computer to your display. Using the Chrome browser--note that you'll first need to install the Chromecast extension--simply select the Cast icon and supported media displayed in your browser window will be mirrored to your display.In my video review, I show in detail what's in the box, how to set it up, and a few features.While some features on the Chromecast are still in beta development, the supported features, apps, and media services are growing over time, making the Chromecast an amazingly inexpensive way for people to cut their cable TV tethers.", "verified": false, "helpfulness": "1/1", "author": "Kendall Giles"}, {"rating": 5.0, "review": "Works great!! Wish it worked with a few more video based apps  but works great none the less. :)Thanks", "verified": true, "helpfulness": "0/0", "author": "Robert Hamblin"}, {"rating": 5.0, "review": "i wish i had bought this earlier.  it makes any tv a smart tv.  occasional buffering issues, but i think thats more b/c of my internet.  would recommend to friends.", "verified": true, "helpfulness": "0/0", "author": "George Quicano"}, {"rating": 4.0, "review": "Love it! They just need to expand the apps that it is compatible with. I can't seem to get it to work with my Chrome browser on my Linux system.", "verified": true, "helpfulness": "0/0", "author": "johnjoneill"}, {"rating": 4.0, "review": "This works great but lacks limitations due to hotel wifi dont work with it. You can't display everything but what it does display it does a good job.. you must have Google Chrome to display anything but YouTube or what not. Just hit the Window with the waves on the lower corner", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 3.0, "review": "Ok but doesn't hold a candle to Apple TV.As an example will not fully mirror computer screen independent of Chrome Browser. Therefore, without using the app within Facebook cannot use Chromecast for Slingbox.It's \"ok\" and it does work but would rate it fair-good. Setup was not as easy as it should have been.", "verified": true, "helpfulness": "0/0", "author": "pcdave"}, {"rating": 4.0, "review": "Purchased for my daughter's bedroom. Works well, my only wish is that there was an app for the kindlefire. She can only use it with my ipad or iphone.", "verified": true, "helpfulness": "0/0", "author": "Lisanetta2U"}, {"rating": 5.0, "review": "Excellent I highly recommend it. I use it every day, I'm happy with my device, so do not think more.", "verified": true, "helpfulness": "0/0", "author": "denny capellan"}, {"rating": 5.0, "review": "So easy to set up! Turned my normal hdtv into a smart tv! Easy to control right from your smartphone. I have two of them. And it transfers from one room to the other too.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Douglas"}]