[{"rating": 3.0, "review": "Works well however unable to get the blaze tv which I have a subscription for. I have to keep roku for that purpose. You might consider having more apps that you can download. Overall it works pretty well.", "verified": true, "helpfulness": "1/4", "author": "donna laugesen"}, {"rating": 4.0, "review": "I have a smart tv but decided to add the kindle fire because I wanted the super HD quality where possible. It's true, not only do I get super HD quality, but I like the ease of using the kindle fire remote and it's features with exception of the voice activation feature.  When I use the voice activated feature, it will only pull up movies and TV shows that are available for rent or purchase. The voice activation will not look for movies in Netflick or Amazon Prime, unless I'm doing something wrong. So, for me the voice activation is useless. I also have a Apple TV.  I love the Apple TV equally as well, but Apple doesn't have amazon prime streaming.", "verified": true, "helpfulness": "0/0", "author": "Marti H. \"Martha L. Hamlette\""}, {"rating": 2.0, "review": "I use subtitles in Spanish, it appears you have to rent the movie before you find out if it's available and I haven't found any movies that it was available on. It should be clearly stated what is available before you spend your money.", "verified": true, "helpfulness": "2/5", "author": "Lawrence Fay"}, {"rating": 5.0, "review": "It's the bomb I can watch the old shows  some I couldnt remember watching like whoopi and land giants lost space i watch threw hulu good job amazon", "verified": true, "helpfulness": "0/0", "author": "mrswowie"}, {"rating": 5.0, "review": "got to get Prime but it's worth it....  Plenty of apps (Need MLB TV)  Some draw backs but they can be overcome.  Use Chromecast for the MLB but Fire TV for all the rest.  Keep improving the system, not re-issue a Fire TV 2!", "verified": true, "helpfulness": "0/0", "author": "Nunzio A Casillo"}, {"rating": 2.0, "review": "Works, but not as well as expected. I was looking forward to an easy to use addition to the TV.  No search mode for Amazon that I have been able to find. Also you should get the game control", "verified": true, "helpfulness": "1/5", "author": "Jon"}, {"rating": 5.0, "review": "Frist the set up was very simple and easy, just connect the device to the tv when it comes on connect it to the internet and your ready. Since I'm a Prime member we have access to all the Prime movies and Tv shows at no cost. I thought searching for the Prime shows would be difficult I'm glad I was wrong. All you have do is speak into the remote and say \"Prime Shows\" and it will bring up all the Prime shows that are available. The only downside is that it will show anything with \"Prime\" in the title, small price to pay for \"Great Tv\". Way to go Amazon!!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "it is pretty good very fast it would be nice if we could surf the internet with it also please add that to the box it is better than the rest of the boxs out there", "verified": true, "helpfulness": "0/0", "author": "LARRY MORSE"}, {"rating": 3.0, "review": "The device works fine, but the reason I bought it was the audio search ability. I now find that the audio search does not work when you are using Netflix. Therefore the device is no better than the ROKU I had.", "verified": true, "helpfulness": "0/2", "author": "HLW"}, {"rating": 5.0, "review": "I am very satisfied with the performance of this unit and the very low monthly charges for apps. like Netflix,etc. If you have high speed internet and HATE CABLE-GET THIS PRODUCT", "verified": true, "helpfulness": "0/0", "author": "Dewey R Lineberry jr."}]