[{"rating": 4.0, "review": "User friendly. I was able to connect every thing with ease. Only complaint is that the light stays on. Seems to have its own mind. You have to back all the way out of everything and then wait on the internal timer for it to shut off. I have had this for some time and the updates have improved the look. I am pleased with it. Hardly any disruptions and it is fast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this thing is neat", "verified": true, "helpfulness": "0/0", "author": "Melanie Downing \"beastalot\""}, {"rating": 5.0, "review": "Got rid of cable and am loving my fire tv.", "verified": true, "helpfulness": "0/0", "author": "jubilitious81"}, {"rating": 3.0, "review": "The loading speed is great and the search function is amazing. I brought the Amazon Fire TV and the Roku the same time. The Roku has far more content and versatility, the Fire isn't bad, especially the games. Once it get more content, it'll be 5 stars", "verified": true, "helpfulness": "0/0", "author": "Shawn McDonald"}, {"rating": 5.0, "review": "A great way to free yourself of cable.The box is easy setup and has been running hours a day no hick ups at all.", "verified": true, "helpfulness": "0/0", "author": "C. michels"}, {"rating": 5.0, "review": "Works great. Voice search for movies is much better than I expected. Love it with my Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "James H."}, {"rating": 5.0, "review": "Finally getting the most out of my prime video benefit.  Picture is flawless.  Device is easy to use, great interface.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It works as expected... I bought the Amazon Fire tv as well only difference is the voice recognition. Next time I would only buy the stick to save $$. My seven years old can control it with no problem. Bye bye cable!", "verified": true, "helpfulness": "0/0", "author": "Racquel"}, {"rating": 5.0, "review": "Great  product, easy to use. Love the way you can add to your \"Watchlist\" by going on line to amazon.com with your computer. Next time you fire up your TV Fire your \"Watchlist\" is updated.", "verified": true, "helpfulness": "0/0", "author": "ALFRED E WALLACE JR"}, {"rating": 5.0, "review": "Seems like a keeper!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]