[{"rating": 3.0, "review": "It was pretty easy to set up...using a PC. I could not do the initial setup using a Samsung Galaxy S4. Once it was on the network, our Android devices could see it, but it could only be used for \"select apps\"I purchased this for my mother so she could look at the photos and videos from her phone on her TV. This required a $3 app. I was not happy about this, as the app is not very simple to use.", "verified": true, "helpfulness": "0/0", "author": "D. Franken"}, {"rating": 5.0, "review": "we have an older TV that's not internet capable, so decided to try.  it took a while to set-up, but it's great.  we can now watch Netflix, HBO go.  highly recommend", "verified": true, "helpfulness": "0/0", "author": "Les Pepl"}, {"rating": 3.0, "review": "I got it on sale just to see what it does.  Installation was easy even though I didn't like that it needs to be connected to a power outlet as well (from the photo I thought it worked like a flash drive where it would be powered from the USB port).  Once installed, I followed the online instructions to download the app on my iPad.  The installation was fairly easy. Using the app, you can then view some media on the TV instead of your Apple device.  Unfortunately, it only supports 'casting' from the web browser or YouTube.  Nothing else worked.  For example, I wanted to view some videos from Facebook on TV, but these were not on YouTube, so I was unable to view them. After viewing a few YouTube videos of TV, I did not use Chromecast again!  Now it's just dangling on my TV as I'm too lazy to take it out!", "verified": true, "helpfulness": "0/0", "author": "Mike Nasser"}, {"rating": 1.0, "review": "I bought it for a second tv since I now have an Apple TV. Not worth the bother. Netflix NEVER works with android phone. Sometimes with the ipad. So just save time, stress and money and buy the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Santiago Martinez Caro"}, {"rating": 5.0, "review": "I love this Google chromecast accessory, it works perfectly. I guess that having a good high speed home wireless network helps, the streaming is fast and the quality is excellent. I would like a few more applications for it, or an app that would allow anything displayed on your android device or laptop to be mirrored on the TV, then it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "English"}, {"rating": 1.0, "review": "One of the things not mentioned in any reviews was the fact that the Chrome needs to be within 20 feet of the unit you intend to cast on.Works fine for streaming You Tube videos, even outside the 20 feet range. Casting a tab is a losing cause. Did not subscribe to any services that have the cast option.AMZN Instant Video a superior product, IMHO", "verified": true, "helpfulness": "1/2", "author": "Robert Burchett"}, {"rating": 3.0, "review": "I really excepted more instruction. For some one not tech savy,  they would have a hard time useing the device. So clear instruction and maybe examples of how can use would be better.", "verified": true, "helpfulness": "0/1", "author": "Kim King"}, {"rating": 2.0, "review": "I have an Apple TV and love it. Love the AirPlay mirroring function for my iPhone and iPad.... since I have a child I don't get to use it very often and wanted to see if I could save a bit of money and get Chromecast to at least stream movies and also my Yogaglo account. The only apps that work were Netflix and YouTube. Thanks, but no thanks. Not worth it to me. I'd rather pay the extra 65 bucks for something more useful. Perhaps someone using the Android OS will enjoy it.", "verified": true, "helpfulness": "0/1", "author": "Candace"}, {"rating": 4.0, "review": "Simple to use. Easy to load apps on ipad2 and Samsung gs3.Only negative was that all the advertising shows just the usb.  What they don't show is that it has to be powered - by an adaptor plugged into the wall.", "verified": true, "helpfulness": "0/0", "author": "eric roll"}, {"rating": 5.0, "review": "It's an excellent product which converts your normal tv into a smart tv. It's interface is easy and integration with all the devices is seamless.", "verified": true, "helpfulness": "0/0", "author": "Neeraj"}]