[{"rating": 2.0, "review": "Very limited capability. Need to Improve performance. Overrated by ads, but very inadequate. It wont work in some parts of Arizona and Texas. If you havent bought yet, DONT!", "verified": true, "helpfulness": "0/1", "author": "r. Francis sanguyo"}, {"rating": 5.0, "review": "This was just such a convenient way to get Christmas shopping done!  All products worked and in good condition.  So nice to do in the comfort of your own home and have the items show up on your doorstep.  Not even counting how much gas that I saved.", "verified": true, "helpfulness": "0/0", "author": "Don Flower"}, {"rating": 1.0, "review": "As i own a smart TV and so already have amazon prime, youtube and netflix, I purchased Chromecast for the sole purpose of casting tabs from Google Chrome Browser.. rationally figuring that anything i can watch on the laptop or the tablet (Nexus 7), i can watch on the TV.Not so.Tablet:Nexus 7 does not support the casting of Chrome tabs, making the whole \"relaxed on the sofa and throwing a video to the TV\" largely a joke,Laptop:I have an i5 based laptop, not a slouch by any means, and this only can cast SOME videos, and those only in the small in-page view player. As soon as I attempt full screen mode. the screen goes blank.Bottom line:With pretty much all new TVs being smart, this is an obsolescent device that is worthless until the casting of tabs works seamlessly across phones, tablets (android & ios) and flawlessly from laptops.", "verified": false, "helpfulness": "2/5", "author": "Ian"}, {"rating": 5.0, "review": "This product has made our life easier.  there is no need to use hdmi or connect to Xbox to use Netflix.", "verified": true, "helpfulness": "0/0", "author": "Trisha Hearn"}, {"rating": 2.0, "review": "Yes it streams as advertised, but just too limiting with the available \"free\" options right now. I'm sure it will increase in time.", "verified": true, "helpfulness": "1/1", "author": "Matthew Waitkus"}, {"rating": 4.0, "review": "i'm impressed with the chrome cast great price and easy to set up. i'm using my laptop to stream netflix on my t.v", "verified": true, "helpfulness": "0/0", "author": "jnnll"}, {"rating": 4.0, "review": "Well, so far I am pretty happy.Pros:=====- SUPER easy to setup with your phone to enter your wifi network credentials- when you get a good signal, the video quality is excellent- nice screen saver photos when not in use- adding apps much faster now, just found a new one to show photos local to my phone (Avia)- small and portable, and installs out of sight- controls are responsive from the phoneCons:======- playing local phone video doesn't really work, even with Avia because of too high of bit rate- Even with wifi router 10ft away from both it and my phone, it sometimes went into low resolution YouTube mode.  Not sure if that's just YouTube lag?  I have a 12Mbps downlink speed so it's not my Internet.  That speed is verified on the phone over wifi with speedtest app.- I heard my Dad had compatibility issues with his router, but it was old he said so he ordered a new on.  I'll update when I find out more.If I can figure out my YouTube issue, I would make it probably 5 stars.  I love being able to show kids cool videos like SciShow on the family room tv!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Eradicatore\""}, {"rating": 5.0, "review": "I bought this as a birthday gift. My son is having difficulty figuring out how to use it. But, I think he got it figured out since the last time we talked.", "verified": true, "helpfulness": "0/0", "author": "Tretre3 \"Tretre3\""}, {"rating": 5.0, "review": "I love this product. I can stream from my phone or laptop to my tv. How awesome! I would recommend.", "verified": true, "helpfulness": "0/0", "author": "Kathy Sullivan"}, {"rating": 5.0, "review": "Only took a few minutes to plug in and set up.  The video quality is great!  Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Chelsey Aprill"}]