[{"rating": 5.0, "review": "I'm extremely pleased with Amazon Fire TV. It's easy to use and have enjoyed numerous movies.Love the voice features, finds exactly what I asked for.", "verified": true, "helpfulness": "0/0", "author": "pb"}, {"rating": 4.0, "review": "If you are already a prime member you dont seem to get a year of prime free... bummer", "verified": true, "helpfulness": "0/0", "author": "dillon alexander"}, {"rating": 5.0, "review": "I love it!!! Best Christmas gift to myself!", "verified": true, "helpfulness": "0/0", "author": "Mary Coyne"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Sis Chris"}, {"rating": 5.0, "review": "It is nice to be able to watch Netflix, Amazon prime, VUDU, etc. on my television rather than laptop. Easy to connect with home WiFi network and Apps. It is fast and easy to navigate through software. Hardware has a small, sleek, and high tech design, which looks great next to tv.", "verified": true, "helpfulness": "0/0", "author": "Sarah Matsubara"}, {"rating": 5.0, "review": "I use it all the time! You do need to update the software as soon as you get it though. It's fun to play games on even without the controller and watching Netflix and instant video from Amazon prime is great.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "This did not meet my expectations. It far exceeded them! It arrived sooner than promised in excellent condition. It was set up and working in minutes and is easier to use than my Smart TV. The voice search worked the very first time I tried it. Well worth the price!", "verified": true, "helpfulness": "0/0", "author": "Bobrun \"Bobrun\""}, {"rating": 5.0, "review": "This is the first step to cutting the cord with Comcast!!! Like it so well I bought one for my friend and a stick for my son.", "verified": true, "helpfulness": "0/0", "author": "Janet Smith"}, {"rating": 5.0, "review": "Have not had it long enough but it seems to be doing everything it promised to do.", "verified": true, "helpfulness": "0/0", "author": "James Johnston"}, {"rating": 5.0, "review": "Resolution on screen is fantastic!", "verified": true, "helpfulness": "0/0", "author": "Eliseo G."}]