[{"rating": 4.0, "review": "It was okay.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "If you have a Mac computer don't waste your time get an apple TV it's way better. But if you don't it is a good product. I just hate the delay though.", "verified": false, "helpfulness": "0/0", "author": "Randy"}, {"rating": 4.0, "review": "Fun for video apps", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"carol\""}, {"rating": 3.0, "review": "The chromecast is good but will never be a main media player.Pros:Streams Netflix and Hulu super quick and I like playing things from my iphone or ipad.It's very small and if you have a free USB port you would almost forget where it is because you'll never see it.ConsA lot of times I'm unable to see the chromecast from my phone even though it's been on the same wifi for hours..When I'm in the middle of a show or movie and I want to pause it, I open the app and the connection is lost so the show keeps going and going and going... all while I sit there and curse the app that has no idea what is going on on my TVAll in all if this had Amazon Prime Video it would be a must to have such an easy unit but until that happens this is only a 3 Star and the Roku will be my main and favored media player.", "verified": true, "helpfulness": "0/0", "author": "K. Roberts"}, {"rating": 4.0, "review": "es un poco lento", "verified": true, "helpfulness": "0/0", "author": "Andry"}, {"rating": 3.0, "review": "Chrome browser (required) crashes frequently on my Mac and the signal strength is weak so the picture can be \"jumpy\" rather then a fluid video stream. I guess that is why it is still a \"Beta\" product.", "verified": true, "helpfulness": "0/0", "author": "R. Weinberg"}, {"rating": 5.0, "review": "Awesome thing", "verified": true, "helpfulness": "0/0", "author": "juan david"}, {"rating": 5.0, "review": "It's just great, my second Chromecast. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Marco F. Mesquita"}, {"rating": 5.0, "review": "Works well with net flicks easy to set up", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 5.0, "review": "Working good!", "verified": true, "helpfulness": "0/0", "author": "Jose Guimaraes"}]