[{"rating": 4.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "larry t."}, {"rating": 1.0, "review": "I tried to love it. The idea is good. But the software execution is frustrating as hell. We followed directions. Plugged the powered stick into the HDMI port of the TV. Downloaded Cromecast from Google. Used Chrome browser on the PC. Watched the YouTube videos. Loaded/installed all the plugins. The software found the Comcast modem just fine. Everything seemed to be working -- except we could not get it to \"cast\" a single video from YouTube or from anywhere else. And I consider myself tech savvy. I worked for in Silicon Valley for 20 years as an engineer. I can remember sitting on an airplane listening to AMD execs talking about flash memory long ago. So after apparently doing everything right the Chromecast device was repackaged and taken back to Best Buy (they price-match Amazon) because the frustration level just wasn't worth it. And in exchange we opted for Roku 3 - which worked easily and the first time right out of the box. No browser in Roku and it's more expensive - not to mention that you need an HDMI cable too. But the frustration was such that it wasn't worth the effort. I suspect one day Roku will have its own stripped down browser app at about the same time Google imports more foreign engineers and finally figures out how plug-n-play is supposed to perform.", "verified": false, "helpfulness": "0/1", "author": "Bad Rad"}, {"rating": 3.0, "review": "I'd seen the advertising, watched some of the instructional videos, and read plenty of reviews about Chromecast but I was still disappointed by this product.  It's very simple to install, though not immediately obvious how to do so, and the available functionality is minimal at best even though I have numerous tablets and phones that are all modern Android.Setup & Installation:------------------------------I was actually really surprised how bad a job Google did presenting/describing this.  I'm extremely tech savvy, being a computer programmer by trade and a tech geek in general, yet it took me a little hunting to figure out how to initially setup the device.  It's simple enough to plug into your TV and the wall, and easily identifiable when you switch your TV's video input to the device.  Once you do so however, the only instructions are to go to a specific website on your computer, tablet, or phone.  I did so on my computer and was presented with the basic info website for setting up the device.  What they don't make obvious is that at some point you're going to download and install a program on your computer, find the Chromecast dongle with it, setup the WiFi access on it through the program on your computer, and then you'll have functionality.  The website had what effectively amounted to advertisements for the browser plugin to allow you to cast your screen (I was using Chrome) but doesn't indicate that the \"download the app\" button isn't for an identical standalone program.  Google clearly slipped here, and \"app\" is something that's installed on a tablet or phone whereas an \"application\" or \"program\" is what's installed on a PC.  By calling both an \"app\" it seemed that the browser plugin was all I needed.  Furthermore, the language on the website even says that all I needed to do was to install the Chromecast browser plugin to \"get started\".  This was a blatant falsehood, a program MUST be installed on your computer to setup the Chromecast device the first time, and only then can the browser plugin or tablet/phone app be used to connect to it.  After giving installing the \"app\" on my computer a shot, it did become clear quite quickly that it wasn't actually an app at all and was likely what I needed.  I was using a Windows laptop to install this program on, and I was very disappointed in what has become a standard Google problem with their installation programs.  I opened the downloaded program from my Chrome browser by clicking on the completed download item in the bar at the bottom and it opened the program like I would expect.  Instead of opening an actual window though, it popped up an overlay that ran through the \"downloading\" and \"installing\" steps like some programs do.  That's perfectly fine since it goes by quickly and I didn't even notice that it wasn't an actual window at first.  The problem was that after the \"installing\" step it asks you to accept a standard \"we can use your data for anything\" agreement.  I'm fine with the agreement itself, but the non-window it was presented in pops up behind every window you've go open (like my browser).  Since there's no actual window associated with this pop up, it looked like the installation just stopped and didn't work.  I made a lucky guess, minimized all my windows, and found this underlay(?) that would allow me to continue the install.  The setup itself using the program was rather painless, with each step after the program was started being reflected by both a screen change on the TV as well as the change in the program's window (it actually has a window once it's installed and fully running).  The lag time in these changes however was oddly disconcerting.  The TV showed a new screen with information about the next step almost 3 minutes before I saw the window on my computer changing from a spinning icon \"thinking\" screen into the screen reflecting the next step.  This happened in 2 of the 5 steps required to setup the device.  Each step was however extremely painless, including the fact that my device had to download and install new firmware as part of the setup (less than 10 minutes start to finish, most of the time waiting for the computer program to catch up).Features:------------This is probably one of the most controversial tops about Chromecast, drawing the most arguments regarding comparison to other similar products like the Fire Stick and Roku.  To put it bluntly, Chromecast does almost nothing yet is the same price as these other products.  The Chromecast device makes no attempt to do anything at all itself, it merely serves as a way to wirelessly display the screen from your browser, phone, or tablet.  The products it's competing with however all attempt to provide a full TV content interface that can optionally support wirelessly displaying the screen from some phones, tablets, and computers.  Toward this end, there are two competing wireless display \"standards\", Chromecast and Miracast.  Miracast is an actual standard developed between companies that almost all Samsung and Amazon products support, with Windows support coming soon or available in limited varieties.  Chromecast however is a Google only thing that some companies have been trying to support.  Chromecast is built into Android 5 natively for most devices, and is supported through the Chromecast app on tablets and phones for a number of Android version (and apparently some iOS versions).Use:--------------Chromecast as a product is relatively simple, focusing on wirelessly displaying a screen and nothing else, but it doesn't do that in a particularly user friendly way.  Instead of forcing the screen on your device to landscape mode when start natively sharing your screen out of Android, or when sharing through the Chromecast app, it instead keeps the screen in portrait layout if that's how you started the app (like every person does on their smartphone).  On the TV you see a narrow video with large black bars on either side as it keeps the aspect ratio of the video that matches your phone.  This seems smart-ish, but most of the time you want to see full screen which is what it does when you turn the phone to landscape (assuming you're allowing the orientation to adjust and don't have that off).  Google being stupid about the looks of things, their new Material design immediately makes everything unusable when you do this since they have a gigantic bar across the top of both the phone and TV screens that covers the top 1/3 of anything you might want to be looking at.  Basically it's pointless/worthless to use the Chromecast app other than to start and stop sharing your screen if you don't have native support already.  From apps the functionality is hit or miss.  The Chromecast app lets you literally duplicate your screen onto the TV, but Chromecasting from apps that have support for it on their own causes a special video presentation format to show up on the TV that doesn't necessarily match what you're seeing on your phone/tablet. This is a much better way to do it, but requires special support be added to the apps themselves to do it.  Youtube for example gives you a set of controls for the video you're playing and the usual list of \"related\" videos while it plays the video full screen on your TV regardless of the phone/tablet orientation (that's actually nice that they ignore the orientation).  Coursera does the same thing, but doesn't provide the list of \"related\" videos.  Some other apps however don't do quite so good of a job in their presentation so the whole usage is inconsistent between apps and there aren't really any standard set of capabilities.Summary:---------------------Overall the product is only useful if you have an Android phone and some specific apps you want to watch video from on your TV, or if you have something in the Chrome browser on your computer you want to show on your TV.  It's not even slightly comparable to a Roku stick that's only slightly more expensive and has tons more useful features, and is basically useless if you're trying to use it with an Apple device or anything in Android other than the handful of apps that have their own support for it.", "verified": true, "helpfulness": "4/4", "author": "Michael Alexander"}, {"rating": 5.0, "review": "Wow.  I'm pretty impressed by this item.  Don't forget to add 'Videostream' (by Google) to your Google Chrome account, that is so that you can stream any file on your computer/storage device to your television via the Chromecast device.  Really neat.", "verified": true, "helpfulness": "0/0", "author": "Knappster"}, {"rating": 4.0, "review": "Works pretty good. Can be buggy at times when using it with an iPhone. Works great with my Nexus 7 tablet.", "verified": true, "helpfulness": "0/0", "author": "Eli"}, {"rating": 1.0, "review": "Product sucks-does absolutely nothing oh wait it does cut into my t.v. programs at Radom.Has never gone past face page yet.Will not run from my android device as it was represented to do.complete waste of time&money.;", "verified": true, "helpfulness": "0/0", "author": "Michael Rebisch"}, {"rating": 5.0, "review": "If I owned more TV's I'd own more Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 4.0, "review": "Cheap and easy to use. Chromecast app on my phone and tablet crashes, forcing me to restart occassionaly.", "verified": true, "helpfulness": "0/0", "author": "Ik Choi"}, {"rating": 3.0, "review": "neat!", "verified": true, "helpfulness": "0/0", "author": "Kristen Walker \"Kristen Walker\""}, {"rating": 5.0, "review": "Good for tv", "verified": true, "helpfulness": "0/0", "author": "Dean Alves"}]