[{"rating": 5.0, "review": "So much simpler than the \"smart\" Blu-ray player I have, which was getting dumber when it came to the apps. Hooked it up within five minutes, easy to make selections, easy to put to sleep.", "verified": true, "helpfulness": "0/1", "author": "MtnKat"}, {"rating": 4.0, "review": "At 1st, we thought we don't like it BUT after the new software update we KEEP it...Until now, in my account, it said that I will return it BUT I will keep it forever.Amazon, please erase in your system that we are going to return it.Please, after exact 30 days since your subscriber said that he/she will return it but didn't, you have to automatically erase that status for the system to know that he/she's not returning it anymore.Thanks", "verified": true, "helpfulness": "0/2", "author": "C. Miemban \"sir1BMW\""}, {"rating": 1.0, "review": "Piece of CRAP that does not work. No instructions and customer service is a joke. Don't waste your money and get Netflix !!!", "verified": true, "helpfulness": "1/5", "author": "Jamie Marie"}, {"rating": 5.0, "review": "Great device. Got it to watch Netflix and ended up doing so much more with this device. The whole family plays games on it together and it's great for picking out on-demand content that isn't normally on TV.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome product. Lives up to the hype.", "verified": true, "helpfulness": "0/1", "author": "Marc D Perich"}, {"rating": 5.0, "review": "I have both Apple TV and the Amazon Fire TV & a stick. I wanted to compare.AMAZON WINS! The connection is smoother and simpler, even when wifi signals are low.Besides, with Amazon Prime, you get more value than Apple TV's iRadio.I am an Apple fan, but Amazon is taking the lead !", "verified": true, "helpfulness": "0/1", "author": "Mark C \"Mark\""}, {"rating": 1.0, "review": "If I tried to watch a movie after an interruption, it would not allow me to automatically resume from where I left off.  Had to return the unit.  Do not know whether this was a defect or a permanent problem of the device.  Did not want to fool with it.", "verified": true, "helpfulness": "1/3", "author": "pluie"}, {"rating": 2.0, "review": "FireTV Is Not So Hot.I am an avid shopper and user of Amazon products and I am a prime member, but the FireTV is NOT what so many reviewers rave here.I am not going to waste my time in this review telling you things about the FireTV that others will, but let me tell you about something so few have talked about and I will give it to you in detail here....  The MENU.... it is horrible.I spend more time menu diving in the FireTV menu than a homeless man dumpster dives for fresh fish in a dumpster.When I tell you this is the worst menu I have ever seen, I am comparing it to all android streaming boxes as well as the Roku devices, past and present.  In fact, no comparison is needed to realize this menu is very inefficient.NO FAVORITES SUB MENU/ NO FAVORITES ICON TRAY - unacceptable !!!===========================================================NOBODY mentions in their reviews with any detail that there is NO FAVORITES section in the menu... you must fish EVERY time, deep into the menu, to extract an application IF you have not recently opened it.  There IS ONLY a RECENT apps section, but that is it.  And it changes with EVERY app you open, EVERY time you open an app.  So it is a \"FLOATING MENU\" so to speak and it bumps your items down the list.  So, if you open 30 apps, but you want to return to your favorite one, you must scroll 31 positions to get there.  The scrolling feature zips so fast if you continuously press, you may miss what you are looking for.  If you click one by one, you click 31 times to get there.  This is not even the real pain, YET.  Keep reading.SEARCHING MOVIES/MOVIE MENUS & VOICE SEARCH (voice search useless)==============================================================SO, you want to search a movie, you think you will save time using the voice search... NOT!  It only voice searches Amazon movies, NOTHING else.  NOT music, NOT Netflix, NOTHING.SO, you get to the Netflix App menu or other vendor App menu.  Guess what?  The menu of movies fits ONLY 4 titles wide on your TV screen and you must click ONE BY ONE through 1000 titles, or speed scroll which goes so fast you cannot see the titles.  I am not kidding, the relative speed would be approximately 15mph if a car were driving by the front of your TV, precisely.  Not only this, on my old Roku XS, I can click one by one, click one exact row at a time, or speed scroll smoothly.  With FireTV, you cannot scroll one row or group at a time.  Again, go very slow one by one, or too fast to see.  It takes so much frustration to hunt movies and apps, I really don't know how to put it into words.PRIME MUSIC - NO APPLICATION AS OF JULY 2015==========================================Now, to this point, you went 31 clicks to get to your favorite app in the RECENT list, or you went 10 clicks to get to the music in the FireTV doing your menu diving (No Joke).  Now you have scrolled like crazy  just to get to the music without doing any music searching itself.  When you get there, you now have a \"recently played\" menu again, which is ever changing.  NOT a favorites.  You do, after a few more clicks, have an artists or albums category... FINALLY, categories you can use.  But, you cannot manipulte these lists within the FireTV.... read further.......You now want to listen to Amazon Prime music, like me, you are a Prime Member wanting to listen to your favorite songs through Amazon Prime.  Guess what again?  You can listen to your Prime Music, but you CANNOT use a Prime Music Application to manage ANY of your songs, because THERE IS NO PRIME MUSIC APP!!!  None, notta, zip, zipper.  Once you listened to say, ELVIS, when you turn off your FireTV, then return to it later, you want to listen listen to Prime Music, you must go to RECENT items, click ELVIS, or NO OTHER MUSIC COMES UP if you entered from within the RECENT items menu, only Elvis will open up in a music player.  SO, to listen to other Prime songs after listening to Elvis (or while still listening to Elvis), you now must menu dive 15 more clicks into the FireTV menu, not a music player menu.WOW!!!  Lets reiterate what I just explained in case the previous explanation was not as clear as I had hoped:  Lets say you got lucky when you first turned on your FireTV for the day, and it was Elvis in the RECENT items that you did want to listen to.  When you finish listening to Elvis, you cannot key back or up one key (one click) to a music menu to choose the next artist. YOU MUST COMPLETELY BACK OUT OF THE MENU, returning to the home screen in the FireTV, scroll several times to music, then start fishing for music again.The only way to manage your prime music is to turn on your MAC/PC, startup the Amazon Music Player, and create your song lists there on the computer.  Your Library is only managed in this way, Amazon stores that info on their server, then kicks out that info (including your music library) to the FireTV.  But you can NOT use the FireTV to manage the music.To compare, when you listen to Pandora, you actually enter the Pandora Music App, and while listening to a Pandora station, you have several icons to select that allows you to manage a function within the application while listening to a song.  You can simply continue to listen to your Elvis station, hit the BACK/RETURN key, and select another Pandora station, artist, or genre and immediately listen - ALL while staying within the Pandora App.  You can also save info, make favorites, etc, using an actual application to manage your music.With Amazon Prime music, there is NO App to allow management of your Prime music, creating favorites, etc.  And again, if you entered from the RECENT list, it only opens the one single artist you were listening to.  To get to all your songs, you must revert to the FireTV menu, not a Prime Music App.Sparing myself more typing here, the LACK OF LOGIC that I have just explained about the menu design of the FireTV to search movies and  Amazon Prime Music is the same LACK OF LOGIC used throughout the entire menu system.  It is a nightmare.Throw on top of this, in the RECENT items at the top of the menu, which is your ONLY way to quickly open an App, there is also a \"Tutorial\" and a \"Top Apps\" icons that are STUCK IN THE RECENT MENU....they are ALWAYS THERE.  You, the owner, cannot remove them even if you have NEVER used them. (keep in mind, the \"tops apps\" are NOT anything YOU decided are \"top\", but some fruit cake marketing team decided, most of which are Games?!?!?!*@*!!!),WOW again.  Want games, get a gaming rig.... people don't buy Audio/Visual streaming devices to game yet it is permanently stuck in the RECENT items menu when you NEVER even used them.IN SUMMARY...Honestly, if you are the type of person that is NOT concerned with organization, fishing menus does not bug you, then you will probably be like the many people giving this thing a positive review for it has a nice presentation (cosmetically) and it is VERY fast.  But that is all that is positive to this device.If you are anything like me, an organized thinker, with an organized home, using good applications for photo editing, music mixing, or even if you are a casual person who enjoys simple straight forward apps like the OLDER versions of Netflix and the currently excellently designed Pandora, then you will HATE navigating this FireTV.I returned my Not-So-Hot FireTV, along with the defective remote Amazon FireTV sent me, and I got a new ROKU 3 instead.  Honestly, I have not looked back.If you choose the Amazon FireTV,  Be Warned and Best Wishes.", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon Fire is a wonderful form of entertainment. The movies that are available to you are the top in the industry. My husband and I are very satisfied with it and we recommend it to family and friends.", "verified": true, "helpfulness": "0/1", "author": "Smitty8498 \"Mom with a functional mind\""}, {"rating": 5.0, "review": "The BEST,Better than My DVD PLAYERS,Everthing movies, games are at my finger tips .FIRE TV is way more  Than expected,Amazons Did A Great Job ,Thanks Again", "verified": true, "helpfulness": "0/1", "author": "Danny William Palumbo"}]