[{"rating": 1.0, "review": "The Chromecast has very limited functionality.  If its primary goal is to allow the user to view YouTube, Hulu, and NetFlix on the big screen, then it falls short.  Although Apple TV ($99) is more expensive, the Chromecast ($35) should be at least 33% of what Apple TV can do.  It does not even come close.  I am returning the product.", "verified": true, "helpfulness": "0/1", "author": "Jose Santos \"BigJoe\""}, {"rating": 5.0, "review": "I did not want to spend 50 plus dollars on the high end stream devices, so decided to give this product a shot. With my new tablet it was the perfect combination as I can stream movies, shows, pictures in my tv. I even down grade my cable programming as hulu and netflix gives me the choice on what I want to watch versus all the junk channels that the cable package offers.", "verified": true, "helpfulness": "0/0", "author": "Alfredo Banos"}, {"rating": 1.0, "review": "I was very excited when I got this little gift...until is just stopped working. I opted to get this instead of the Apple TV but now I changed my mind. When I received it, everything worked great and I was able to stream my movies directly to my tv. After about a week, the chromecast just stopped working. I sent a Email to them and still have not gotten a return message.  I do no recommend this product unless you want a piece of electronic sitting around collecting dust.  Very disappointing", "verified": true, "helpfulness": "0/1", "author": "Cali Marie Defilippo"}, {"rating": 5.0, "review": "I bought this for my dad and it was so easy to install and use. He loves it thanks again Google!", "verified": true, "helpfulness": "0/0", "author": "Autumn Elizabeth Rosenberg"}, {"rating": 5.0, "review": "Nice to get a product that exceeds expectations.  This is an inexpensive way to make your non-smart TV SMART!  Share photo's, clips, etc from your phone/computer/Ipad, connect to Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Mark K"}, {"rating": 5.0, "review": "This is an awesome device. I was so skeptic at first. Now. I barely watch cable TV. I mostly use it to watch programs from Youtube, Hulu plus, and others on my tv. There are so many travel programs on Youtube that now I watch on TV. For $35, I can say it was one of the best bargain deals I have had.There is only one thing I wish I could do with Chromecast and that is to watch Amazon prime streaming. As they are adding more apps, I hope Amazon would be one of them.", "verified": true, "helpfulness": "0/0", "author": "Roya Yazdani"}, {"rating": 4.0, "review": "So far, I really like the Chromecast.  It was easy to set up and is easy to use.  Would give it 5 stars if only it were compatible with more apps, i.e. Acorn TV in particular.  Its price is a plus, too.", "verified": true, "helpfulness": "0/0", "author": "patalice"}, {"rating": 2.0, "review": "Bought it primarily to get amazon instant movies and then found that it would not provide that service.my error for not reading the capabilities before purchasing.works well for pictures and Netflix if that is your goal.", "verified": true, "helpfulness": "0/0", "author": "Larry68"}, {"rating": 4.0, "review": "Using with an ipad, been watching youtube videos and browsing the web.  Hooks up on an HDMI port on the tv, the USB port isn't working to supply power. So I have to use the power cord", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 4.0, "review": "I like the device, I like the apps that it does use (although there are too many with additional subscription fees and not enough that are free).Also, there aren't enough apps that it works with and it doesn't work with my tablet yet (hopefully the keyword is yet). I have to use my computer and not my smaller device in my living room until they add additional devices.", "verified": true, "helpfulness": "0/0", "author": "Jo Anne Urspruch"}]