[{"rating": 5.0, "review": "Elegant to set up and operate! couldn't be much easier and it works very well! love the Green packaging as well.  Best streaming tool on the market.. beats Roku, Playstation, Google, X-Box hands down..", "verified": true, "helpfulness": "1/2", "author": "Annie Capik"}, {"rating": 5.0, "review": "smooth as silk operation, quick selection process, inclusion of other top vendors, Netflix, HULU etc. Browsing is a little difficult to get used to. I showed it my friends from So. Oregon who were here for a night on their way to Seattle and they were impressed. As the content of network TV seems to becoming erratic in \"season\" starts and stops TV on demand is going to be the wave of the future for sure.", "verified": true, "helpfulness": "0/0", "author": "Paul Samuelson"}, {"rating": 4.0, "review": "Easy to use and navigate. No issues with streaming HD ( even with Netflix). It offers a small variety of other programs along with a few games but at a cost. You start out with 1000 coins but can be used up rather quickly.", "verified": true, "helpfulness": "1/1", "author": "dave"}, {"rating": 5.0, "review": "Set up was flawless, and the menus are very easy to use and intuitive. Streaming is quick and smooth - no freezes. Love the way I can mirror cast from my Kindle which is great for playing my music through our AV system. Replaced a Chromecast because of this. Chromecast is good but there is a big flaw with it because it has no audio out. If your TV doesn't have an audio out then you have to make do with sound through the tinny TV speakers. If a web browser was added to Fire TV, then it would be the killer product.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I was already to buy this, but as with most things I wait week to hear people's reviews. When I found out the voice search didn't work with anything but Amazon prime I decided I would wait. And although I am a casual gamer, and not willing to put out 500 bucks on an Xbox station, I was all looking forward to being able to use this and replaced by Roku 3 and play some games. But I realize Amazon wants to push their products first. So maybe with the second version they will update it all. Also eight gigs of memory it's not enough for anyone is can be loading games on here. And the bump up against the wall really fast.", "verified": true, "helpfulness": "1/8", "author": "blair \"masterblair\""}, {"rating": 5.0, "review": "I'm sure that this is not the right device for everyone, but it is a perfect fit for me.I am not a techie or even close to it, but a 1.5 years ago I joined the ranks of the \"cable-cutters.\" I don't own a smart TV; I don't even own a blue-ray player. I have been perfectly happy using my Costco brand TV with a built-in DVD player with an antenae hooked up. I own an original Wii, and a few years ago I was excited to find out I could use it to stream Netflix. Over the next few years, I was also able to stream Hulu and Amazon. With these 3 services I decided to test out quitting cable, and I haven't looked back since.Lately though, I've been having issues with buffering and streaming on my Wii- Hulu was the worst. So I have been thinking about getting a dedicated streaming device. I eliminated AppleTV quickly- I'm an android user, with a gen 2 kindle fire tablet, and any digital movies I do own, I bought through Amazon. Since AppleTV doesn't have Amazon, it was a no-go. I also eliminate Chromecast since I read it doesn't easily stream Amazon- and I am a non-techie and unless there's a button on the homescreen I can't manage it.So that left me with Roku. I'm sure there are other devices out there, but I'm not smart enough to figure them out. The Roku stick version needs power from your TV apparently- and I'm sure my TV is too cheap to have this. I also ready the older Roku versions had clunky interfaces- my Wii has a clunky interface, and I am certainly not going to pay money to \"upgrade\" unless it's actually going to be better. That left me with the Roku 3 which was essentially the same price as the Fire.For my not very distinguishing eye, they both seemed like they would work just fine. What sold me was the ability to play a few games here and there on the Fire. Since I don't use my Wii for actual gaming, except once every few months, I figured the Fire's gaming ability would probably be plenty for me. I could sell the Wii and all the accessories and games I had, and it would offset much of the cost of the Fire.So I've had the Fire hooked up for several days now, and it works great for my needs. It was super simple to set up, and even with the needed update, it was ready to go within 20 minutes. I've streamed on Hulu, Netflix, and Prime and all have worked flawlessly without any buffering issues. I've also played a few games and they too have worked even without the extra controler. A few of the games I have on my Kindle tablet showed up automatically when I set up my Fire which I thought was pretty cool.If you're like me, this is a great device. If you are using your smart TV, blue-ray player, or old school video game system to stream this is a definite upgrade. I am the market segment that Amazon was going for with this device. I also think that once Free Time is up and running, this would also be great to put in a kid's room. I might consider buying one for my 4 year old nephew for Christmas.A final note- something that none of these devices do that I wish they would: I wish I could have a universal remote to operate my TV and my Fire. I'd like to be able to stream local TV stations, since the train that runs by my house interferes with the signal. I also long for the day I could stream ESPN or other aps without having to pay for an entire cable package- I know why they don't offer this, I just don't like it. Since no current device solves for these issues, I can't mark down the Fire for them. But I would switch if there was a device that did these things.", "verified": true, "helpfulness": "1/2", "author": "Sarah"}, {"rating": 5.0, "review": "My Blu ray with Netflix had problems downloading even though I had the ATT U-verse 16mb internet connection.The Fire TV does not have any problems loading Netflix and has superior sound and picture as well. It solved my slow Netflix problem. I also liked the voice command feature. Fire TV costs more, but you get what you pay for. A dedicated video processor is just what I needed.", "verified": true, "helpfulness": "2/2", "author": "painless"}, {"rating": 4.0, "review": "I have to say that this is by far the best streaming device out there (especially if you are a prime member).I own a roku, apple tv and WHD streamer and I have to say Fire TV is the best one yet.The fire tv is faster at loading content, and is nice over all.Gaming is a very nice addition, you can play the tablet games on the big screen with a controller and and is great.One draw back to this is that once you have downloaded a few maybe 6 apps or games you need to delete one to download another. This is true for games like modern combat 4 and the like. very big games. wish they can open up the usb port to allow for more storage space.I am a happy customer though.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Ruiz"}, {"rating": 3.0, "review": "When asking for a title verbally it does not reflect the various apps that you have to obtain the title.  Example:  Can get title on Hulu and or netflix for free but system will only reflect amazon where it can be obtained for charge.", "verified": true, "helpfulness": "1/1", "author": "rwtarver"}, {"rating": 5.0, "review": "I've own a Google TV (Visio Co-Star), Roku 3 and this FireTV at the moment and I can safely say the FireTV tops all of the set top boxes.I mainly got the Fire TV because I'm a tech junkie. I don't even watch that much TV, maybe 2-3 hours a week. All of the content available in the FireTV is available through my GTV or Roku, so why get this? Well, because it's better and faster.Better because it offers a better platform for development since this is built on Android and HTML5. It does make porting of apps easy and creating additional content. In other words, it has a lot of potential from a development side and since it's Amazon, there will be many who jump onboard. Sure, it doesn't have some crucial apps at the moment such as HBO GO, but give it some time and it'll get there. It's not up to Amazon to make all of these apps.Faster makes a difference when it comes to STBs because it allows for faster processing/buffering. For example, I mainly use Plex  to stream my media and it's 2-3x faster on the FireTV than it is on my Roku3 and GTV. Not to mention the interface is way nicer than the Roku but on par with the GTV. The games are pretty smooth as well, but I'm not much of a gamer so it was really only a test to see how well it can handle the graphics.I'm impressed with the FireTV and I think it'll only get better with time. The platform has so much potential and the hardware is there to meet the needs of future development. The design is compact and since the remote works over Bluetooth, you can put this device anywhere you want. The remote is small and has a nice texture to it so you get a better grip than the regular plastic remotes. The buttons have a nice layout and the voice search works surprisingly well.If you've been on the fence, I think you should take a leap of faith because I'm confident you'll enjoy this. There are many reviews that give 1-2 stars but most of these people don't even own the product. I think the vast majority of actual owners are enjoying their new FireTV.", "verified": true, "helpfulness": "2/2", "author": "nathan"}]