[{"rating": 2.0, "review": "I don't love it because I thought it would allow me to mirror my phone screen on to my TV and still use my phone's wireless data connection but it only connects by WI Fi which disables mobile data.  I'm not impressed by this device.", "verified": true, "helpfulness": "0/0", "author": "CottonFog Farm"}, {"rating": 5.0, "review": "Compact and easy to use. I got one for myself and plan on buying more as gifts.I am very satisfied with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Bane"}, {"rating": 5.0, "review": "Excellent idea, easy to install and simple to use.  Nice work Google, I will enjoy streaming YouTube on my tv...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great product for a google companyi buy lot of them for my friendsall used and love it so much", "verified": true, "helpfulness": "0/1", "author": "Khalid Alsaigh"}, {"rating": 4.0, "review": "This gives me the ability to send pictures and video wirelessly to our TV. There were a Picasa 3 extension for it (I use Windows 7 on a laptop) it'd be perfect and rated 5 stars.", "verified": true, "helpfulness": "0/0", "author": "tompr"}, {"rating": 5.0, "review": "I had a little bit of a time setting it up but after I got past the hick-ups it went though real easy.  NOTE: it you are getting one of these and you are going to uses your laptop make sure you are in wireless mode first than switch back over after you have completed the setup if you do not you may be pulling your hair out.  But over all this is a great little toy for the big boys", "verified": true, "helpfulness": "0/0", "author": "John Lenox"}, {"rating": 5.0, "review": "I love this. Seamlessly transitioning from watching something on my iphone or ipad to the TV and best thing about it... you don't need to change the source on your controller! Turning on the Chromecast button via any app will automatically log it on your TV. Also...when you aren't watching something, there are gorgeous backdrops on your TV.I would've bought this if it were over $75", "verified": true, "helpfulness": "0/0", "author": "E Tanners"}, {"rating": 4.0, "review": "I have used Apple TV, and I wish I could view my whole desk top, not just Chrome... or at least Vudu.", "verified": true, "helpfulness": "0/0", "author": "WynBrks"}, {"rating": 2.0, "review": "So I'm one of the few ppl that works with Google/android type products, but it is very limited in the apps that will cast and the few they suggest only work occasionally. The codecs for the tips of video, music, and pictures are limited so the apps they suggest to cast your own stuff doesn't show. So if you are looking to watch Netflix, Hulu, or YouTube on your tv from your phone, then this is the product for you. If not, don't waste your money.", "verified": true, "helpfulness": "1/1", "author": "Ms. Smith"}, {"rating": 4.0, "review": "ProsInsanely easy to set upWorks wellComes with hdmi extender for TVs with less accessible portsWhen a show is loaded on the device you don't have to continue to \"cast.\" For instance once you load a Netflix movie from your phone onto the chromecast. You can do other things on your phone, or your phone could die and the show would still playConsIt would be nice to have some interface and selection on the tv rather than have it all on a separate deviceSometimes the remote loses sync with the chromecast but I feel that is something that can be fixed with a bug update", "verified": true, "helpfulness": "0/0", "author": "Kevin Hoag"}]