[{"rating": 5.0, "review": "This is one of the easiest products to set up and use. If you are looking for a cheap and good TV streamer I would go with this product over a ROKU (And i own both).", "verified": true, "helpfulness": "0/0", "author": "jonathan m hislop"}, {"rating": 4.0, "review": "I have had this product for around a month now and I am really happy with it. It's really simple to install, you just plug it in to a HDMI port and USB port of your TV download the chromecast app to your phone or tablet follow the instructions to set it up and your done.This device is meant to be control by your mobile device so have that in mind. I haven't tested all the apps that work with it but the ones that I have performed in a very good manner. People from outside the USA beware that netflix will only work with your local netflix version and that if you're using some sort of VPN to access other country's content you will find problems. There are ways around it that you can find on the web but it might be a little bit technical for some folks, so I recommend to do a little research before hand if you're planning to use Netflix from outside the US.Very good product for a very low price if you take in consideration what it does. I will eventually buy another one so I can have this in more than one room at a time.", "verified": true, "helpfulness": "0/0", "author": "Olaso"}, {"rating": 4.0, "review": "a good product for $35...you have to go through a registration type process..works great with youtube and Netflix...no choppy delays when watching something....amazon streaming i think does not support chromecast... tried cbs.com tv shows,and you will get a slightly signal choppy delay when watching something....good luck!", "verified": true, "helpfulness": "0/0", "author": "bw"}, {"rating": 5.0, "review": "This will be the best $35 you will ever spend! YouTube, Netflix, Hulu, crackel.com., any vidio streamed to your tv in a matter of seconds. Purchase this and an antenna, and drop your cable provider, I did!", "verified": true, "helpfulness": "0/0", "author": "correy adkins"}, {"rating": 5.0, "review": "Using my PC to set it up was a problem because of the firewall on it but once I decided to try setting iy up using an IPhone it all went very well. Product is easy to use once installed and has great picture quality. I have casted Netflix and  Youtube videos from an iPhone, Android phone and the Chrome browser on several of our laptops.", "verified": true, "helpfulness": "0/0", "author": "Buyer 1"}, {"rating": 4.0, "review": "The product is as advertised.  Hopefully more streaming web portals come on line with the chromecast network.You can still do tabbed viewing but tabbed is not quite as good as straight chromecasting from a chromecast network.Youtube and, Netflix are examples of services that have been optimized for chromecast.  While other video streaming services may not be.As I said, you can still watch it, however it may be a little hitchy.", "verified": true, "helpfulness": "0/0", "author": "Mick Jones"}, {"rating": 2.0, "review": "I am so sad to write this review. I had really high expectations for the Chromecast, but alas, we are sending it back. Despite having our ISP send us a new, better wireless router, a lengthy conversation with Google support staff (for the record, they were wonderful) and several hours of extremely frustrating independent troubleshooting, we could not get the Chromecast to connect to our network for any length of time. It worked for a couple minutes  here and there, I think the longest we ever got it to work was for like an hour--and let me tell you, that hour was BLISS, but it would always disconnect and we'd spend a long time trying to reconnect.I read and heard a lot of conflicting information including:1. Verizon FiOS routers don't \"technically\" support Chromecast.This was directly from the mouth of Google tech support. She explained that it may work, which attributed our on-again, off-again connection, but that we'd have to do a lot of network re-configuring to our router security settings for it to work long-term and even then it isn't \"technically\" supported. BOO!!2. Chromecast has a horrible network card and will have a hard time connecting to the router unless it's really close by.Sadly for us, our router is on a different level of our home and despite having a WiFi range extender, it just wouldn't connect to it.3. Chromecast only supports a 2.4ghz wireless signal.Which means if you have a 5ghz or dual-band router, the 5ghz signal could interfere with the Chromecast and cause it not to work.4. Chromecast only supports WEP security.If you have WPA or WPA2 security, it won't work.So, overall I'm extremely disappointed. I'm giving 2 stars because I feel that Google customer support was helpful, friendly and easy to reach. Furthermore, for the rare instances when it actually connected and worked, this thing is awesome. Maybe one day I'll buy it again, but for now I'm returning it.", "verified": true, "helpfulness": "1/2", "author": "Melundie"}, {"rating": 1.0, "review": "it didn't work.  Many calls to the vendor.  Big problem to get all the stuff to return it and then wait for to give us a replace one. still waiting.  Plus not a good deal, same price at the store.", "verified": true, "helpfulness": "1/2", "author": "Sherill A Shreefer"}, {"rating": 1.0, "review": "Be aware that a limited number of apps are available to use chromecast and not everything that you can get via the internet works either.", "verified": true, "helpfulness": "4/4", "author": "Cutting96"}, {"rating": 5.0, "review": "Works great and it's really easy to use. Now i'm missing more apps that work with the chromecast, for now it's enough.", "verified": true, "helpfulness": "0/0", "author": "Manuel Salazar"}]