[{"rating": 4.0, "review": "This is a fairly nice device, but it hasn't quite grown to be as useful as I had hoped it would be.I think partly its google's fault for not doing more, but also because a bunch of the other major guys decided to make their own instead of just adopting a standard.In general, this would be a MUCH more useful device if it would have been a pass-through switch instead of a separate device.If you could just start it, or maybe even have it do its own picture in picture, I think it would have been a much more used device.  As is, I usually forget I have it.A bonus though:  the deals you can get through it has made it a pretty good deal, even if it didn't get as much use as I had hoped.", "verified": true, "helpfulness": "0/0", "author": "Chris H"}, {"rating": 5.0, "review": "So easy to install. Go to YouTube for a quick video. Great product and affordable. Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "The Gamecock"}, {"rating": 5.0, "review": "Installed in minutes, great video, no audio, from either Windows or Android.  Wait, that is suspicious.  Moved to a different HDMI port on my receiver.  Worked FLAWLESSLY.  So happy with this. Thank you Google.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Worked for about a week and then nothing. Waste of $30!!", "verified": false, "helpfulness": "0/1", "author": "Sean T"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Alvaro"}, {"rating": 4.0, "review": "Google Chromecast i awesome ... wish they would make the Chrome browser on iPad work too.", "verified": true, "helpfulness": "1/1", "author": "Rickie K Helmer"}, {"rating": 5.0, "review": "No regrets whatsoever, the convenience of casting a movie/video onto your TV, and you can still use your phone.", "verified": true, "helpfulness": "0/0", "author": "Levi"}, {"rating": 4.0, "review": "Fantastic being able to easily cast YouTube, Yahoo, and other browser-based videos. Limited compatibility with Apple iPhone and iPad, however, requiring us to control many things from our desktop across the room. A minor inconvenience, but an inconvenience nonetheless. Drops sync with the wireless router occasionally as well. Since that never happens with Netflix streaming, I can only assume it's something specific to this unit. But for thirty bucks it's hard to complain!", "verified": true, "helpfulness": "0/0", "author": "Sean Mccoy"}, {"rating": 5.0, "review": "This was a present for my son.", "verified": true, "helpfulness": "0/0", "author": "Roland G. \"Bookworm\""}, {"rating": 4.0, "review": "This was easy enough to set up and use. My only complaint is that you have to have wi-fi to use it. I was hoping that I could just connect directly with my tablet and watch shows I had downloaded. It's not a problem at home where I have wi-fi but if my internet was ever down or I was traveling and using a tv at a hotel, this will cause issues with me. I hope they make a work around for that feature. I would give it a 5 star rating if that happens.", "verified": true, "helpfulness": "0/0", "author": "J. Z."}]