[{"rating": 1.0, "review": "It deserves no stars. It is inexpensive but I'm still at a loss. The stick plays video and lags. That is horrible it defeats the purpose. Making movies unwatchable, there for the stick is useless. I would like my money back. But I waited awhile trying to give it a chance and find the pros in it. There aren't any. Don't waste money on this wait for better technology or try another option.", "verified": true, "helpfulness": "0/0", "author": "D. P. \"DP\""}, {"rating": 5.0, "review": "Amazing product - Streams flawlessly and with incredible picture and sound quality.  I cannot recommend this product enough.", "verified": true, "helpfulness": "0/0", "author": "Sanderson"}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "alllen wagner"}, {"rating": 5.0, "review": "Amazing how easy it is to start up. Great to take along when traveling.", "verified": true, "helpfulness": "0/0", "author": "F. Simon \"simon\""}, {"rating": 5.0, "review": "on my second, long story what happened to the first one. anyway use it with a android tablet and a iphone. biggest negative is how difficult it is to watch Amazon Prime shows", "verified": true, "helpfulness": "0/0", "author": "bill"}, {"rating": 5.0, "review": "I can watch netflix on my tv, with  my phone and pad, sweet", "verified": true, "helpfulness": "0/0", "author": "shon shumate"}, {"rating": 5.0, "review": "Great item to have for guest!", "verified": true, "helpfulness": "0/0", "author": "Kimon Hutchinson"}, {"rating": 5.0, "review": "This is a great product and tool for casting just about anything and everything from your phone or your computer to your TV.You can stream everything from within the chrome browser.  Everything from youtube, to movies that you watch Right formLikewise, you can stream the same, if not more, from your phone.  You'll get better quality video streaming/casting from your phone because there's a lot more apps that are compatible.  This is because it's android and android has a lot more flexability and control with Android.As opposed to microsoft, there is a lot that you can do, but some advanced functionality is still in beta in windows.  There is a lot of stability with windows, it's just that they have an additional Casting Beta app that is seperate.  Which is actually kinda nice to be able to test out and work wit what's coming soon or what will be updated.However, to each their own.  I enjoy casting from both, but have more of a preference to the phone.  Probably because I'm not weighed so to speak by the laptop;  as the phone offers more flexibility.Regardless, I also like the FireStick as well.  I use the Fire Stick more than the Chrome cast.  Moreso because the Firestick doesn't require you to be bound to your phone or computer to use it.  And it comes with its own remote.  Everyone has their own preference though.", "verified": false, "helpfulness": "1/1", "author": "ZiggyZ"}, {"rating": 5.0, "review": "LOVELY! Came super fast. Easy set up. So much better than fighting with the wii trying to watch Netflix. No connection interruptions or anything so far.", "verified": true, "helpfulness": "0/0", "author": "Seana Thomas"}, {"rating": 1.0, "review": "Worthless piece of junk!  Does not work with samsung s3 mini, so does not work with most android devices won't mirror screen. The chromecast app does recognize the device and does connect, But a \"beta testing\" warning pops up and says all functions may not work, however nothing works, just errors and no casting, making this device useless.  Will not work with linux. Very frustrating to use. I am very disappointed as I like Google and it's products.I bought this thinking that it would work as well as the youtube cast button when using the youtube smart tv app which does work well.", "verified": false, "helpfulness": "0/2", "author": "David"}]