[{"rating": 5.0, "review": "This device is by far the best smart device I have ever used. With it's integration with Netflix, Hulu, Plex, and much much more, it is incredible. Video and Audio Quality were perfect, and the price was insane. Roku devices, AppleTV, GoogleTv, etc. are in the prices of close to $100 or more for a really good one, this is far more convenient, just as good or better quality, and only $35!!!!", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 2.0, "review": "I have nothing against Google's Chromecast as such but I just could not make the connection that some of my friends have made with it.", "verified": true, "helpfulness": "1/1", "author": "Jimtx"}, {"rating": 5.0, "review": "I bought my sister an AppleTV and bought my ex-girlfriend a Roku (3rd edition).  Both were decent at what they did, but this device works even better for my use-case.  Two of these still cost less than one of the others I mentioned while delivering comparable performance.  After a quick on-screen configuration (which was facilitated by my phone's Chromecast app) I had them both working.I rate the device a 5, but Google's tech support is somewhat lacking with the device.  I had two issues:1)  I had to search for a bit to find out that the device only supports the 2.4GHz wireless band.  After re-enabling it on my router (I was set up for 5GHz only in my house) I had them connect successfully.2)  After a reset I could see the devices for about 1 minute, after which I couldn't communicate with them anymore on my phone.  They were both on and showing as connected to the router but I couldn't see them.  After much internet searching I found an article mentioning that these devices use uPnP/Multicast to communicate with other devices.  I reconfigured my router to allow uPnP and they started showing up as expected.  Still, it was exceedingly confusing and the provided documentation made no mention of this (that I could find.)", "verified": true, "helpfulness": "1/1", "author": "Anthony Fenili"}, {"rating": 5.0, "review": "This gadget is so incredible... not something you would ever have thought of on your own; being able to cast videos and music straight from your phone  to the television! we use it all the time!!", "verified": true, "helpfulness": "0/0", "author": "E Robinson"}, {"rating": 5.0, "review": "I am one of the many who are \"technology challenged\" and I was able to hook this up and get it running in no time.  The best thing ever for me!  No more waiting for DVD's in the mail, no more having to drop DVD's back in the mail.  I love this thing.", "verified": true, "helpfulness": "0/0", "author": "Jackie Bonney"}, {"rating": 4.0, "review": "Works great when it works, fast and smooth.The problem is that it doesn't wake up if not used for a day or so, the only way to do so is to power cycle.Wifi 2.4ghz only, no 5ghz support.", "verified": true, "helpfulness": "0/0", "author": "Moshe"}, {"rating": 5.0, "review": "This is some of the best spent money ever.  We love how simple it was/is to use and that we can now watch sooo many more things on our tv screen.  I would recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "J. A. McKeown"}, {"rating": 5.0, "review": "Good product, good price.  Very cool.  I don't use it all the time, but I'm glad I'm able to use it when I can.  For the price it is a great deal.", "verified": true, "helpfulness": "0/0", "author": "Jeff Flotta"}, {"rating": 4.0, "review": "Great technology, good price. Still some bugs that have to be worked out..problems restarting movies when they go to the next episode on Netflex", "verified": true, "helpfulness": "0/0", "author": "Marlowe the Great"}, {"rating": 1.0, "review": "Super hard to connect if you have a fast internet connection. And it delays videos if they are not on YouTube.", "verified": true, "helpfulness": "0/1", "author": "Brayan Torres"}]