[{"rating": 5.0, "review": "Everything was as expected.", "verified": true, "helpfulness": "0/0", "author": "Moncho"}, {"rating": 5.0, "review": "I like it a lot!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "You will like this little device.  Not only can you put anything in Chrome on most TVs - you can cast your whole computer screen to any TV.  You can do this from any PC, laptop, or device on your network.  It works very well for me.", "verified": true, "helpfulness": "0/0", "author": "Harold N. Orndorff"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "jekay"}, {"rating": 3.0, "review": "I tried streaming a couple of times from my cell phone and it worked fine but other than that I don't see a real use for this device. Not sure what was the rationale behind making such a device.", "verified": true, "helpfulness": "0/1", "author": "rk"}, {"rating": 4.0, "review": "It's a good device. I found it very helpful while watching Netflix, Youtube, and even at presentations. All you need is the right app and you can do a lot with this. The big con - you can't access it's advanced config freely, thus you're stuck with the basics.", "verified": true, "helpfulness": "0/0", "author": "Apolo Andres Pino"}, {"rating": 5.0, "review": "Currently watching ! Love it", "verified": true, "helpfulness": "3/3", "author": "Wendy Gonzalez"}, {"rating": 5.0, "review": "I love that can download also any chrome app and play it on your TV. Its very consistent and the picture comes through very clear. In addition, I do can work on my laptop well watching a movie at the same time.  I only had one problem and all I did was reset the chromecast and it fixed. I would definitely recommend for friends and for lazy college students.", "verified": true, "helpfulness": "0/0", "author": "Tahira"}, {"rating": 5.0, "review": "Surprisingly easy to set up and transmit to through Youtube or other apps", "verified": true, "helpfulness": "0/0", "author": "Tandy"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Victor"}]