[{"rating": 5.0, "review": "absolutely love my chromecast.  Streaming is so easy.  I teached my 6yr old niece to use it with no problems.For the people that are having issues streaming, most likely your WiFi needs an upgrade or your Internet speed is not very good.", "verified": true, "helpfulness": "0/0", "author": "Tom Pescatore"}, {"rating": 5.0, "review": "This little device turned my dumb Sony TV into a smart TV! Setup was as easy as advertised. So far, I've streamed YouTube, and my home movies via Plex Media Server. I use my Android phone and tablet PC, my wife uses her iPad to cast videos to this. Cool device, great price!", "verified": true, "helpfulness": "0/0", "author": "Peter Filippone"}, {"rating": 1.0, "review": "Could not get to work may be because of my limited knowledge of the computers, instructions seemed easy but could not get to work", "verified": true, "helpfulness": "0/0", "author": "George Verdugo"}, {"rating": 4.0, "review": "Love this new tool! Got the Chromecast User Guide with it to learn more. If you are expecting to use it with Prime free videos, check that out first...you may not be able to. Watching You Tube videos on the TV is so wonderful. My phone is my remote...too cool!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Hate it. Very limited functioning. Could only get it to stream Netflix. Wouldn't stream Amazon Prime or You Tube form my phone or iPad. Piece of crap. ROKU seems to be the way to go.", "verified": true, "helpfulness": "0/0", "author": "Dr Brown \"gibbroster\""}, {"rating": 5.0, "review": "wonderful little device that turned my TV into a smart TV", "verified": true, "helpfulness": "0/0", "author": "Yan Feng"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Miroslaw"}, {"rating": 5.0, "review": "Excellence, is what you get from this Google Chromecast HDMI Streaming Media Player!! \"Adios,\" to that old cable company and \"Hello,\" Google!! Since having it, my checking account always looks good.. Savings, is one word to describe it!!", "verified": true, "helpfulness": "0/0", "author": "felrodrios"}, {"rating": 5.0, "review": "It is easy to use.  Safari and Firefox do not support it, you must use Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Schenectady Skip"}, {"rating": 5.0, "review": "It doesn't come with instructions so download the app for quick and easy setup to your WiFi network. I've only used it with Netflix so far anI it is working well!", "verified": true, "helpfulness": "0/0", "author": "tags94"}]