[{"rating": 5.0, "review": "I use this for practicing yoga via YouTube and watching Netflix. Tried watching Curb yr Enthusiasm via Chrome on a laptop but tab casting was really slow and laggy. All in all, for $35 I got my money's worth!", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 5.0, "review": "I've had this item for several months and it's been great.  Setup out of the box was easy. Makes YouTube and Google Play videos a snap!!", "verified": true, "helpfulness": "0/0", "author": "gman"}, {"rating": 5.0, "review": "Streams best off of the android app, although it also does a great job from chrome on the desktop. 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Marshall"}, {"rating": 5.0, "review": "I have found this device to be very entertaining. I really do not use it too often but when I do I have found it to work superbly. Hook up could not have been any easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I LOVE CHROMECAST!! It can do everything I want it to very well! The only thing I wish Google would do is make it able to be powered by the HDMI port, but otherwise you should get this thing!", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 5.0, "review": "Love this little gadget. So do my two young children. Well, they don't know that it's the Chromecast they love, but they love the videos I stream from YouTube.com to our TV. Being able to queue videos is a huge convenience as well.", "verified": true, "helpfulness": "0/0", "author": "Charles Howard"}, {"rating": 3.0, "review": "Please create more apps...……… the  only good apps until now is netflix but You have to pay for that c", "verified": true, "helpfulness": "0/0", "author": "Luis Carlos"}, {"rating": 4.0, "review": "I have an older LCD. Vizio 47\" HDTV, but it was before the advent of smart TVs and WiFi connectivity. I didn't want to buy a new TV just to YouTube and what not. The only reason I left a star out is the limited number of apps that allow for Chromcasting. Thankfully Pandora and YouTube are on the list. I am sure It will grow.", "verified": true, "helpfulness": "0/0", "author": "Rabid Dingo"}, {"rating": 2.0, "review": "I give it a 2 because my friend has one and her's ALWAYS works. My Chromecast ALWAYS freezes, when i'm streaming from my macbook or my phone. I cannot watch one show even five minutes and it reboots itself or freezes. I reset it, I restart it, I close out of the App. I restart my computer and reset everything from the beginning. Yet again nothing...I am beyond frustrated. It is lovely when it works and I hope it works for you but I give up after 3 weeks of constant interrupted play...", "verified": true, "helpfulness": "1/1", "author": "sadface"}, {"rating": 2.0, "review": "Meh. I can send YouTube, Netflix, or Hulu to my TV with this device. Its underwhelming to say the least.", "verified": true, "helpfulness": "0/0", "author": "SC Sully \"CineCal\""}]