[{"rating": 4.0, "review": "I was dragging my foot about buying a Chromecast device simply because I own a Roku 3, Apple TV and a Blu-ray player with apps. But when I was going on a road trip and wanted to have my Hulu Plus, Netflix, and YouTube available to share with others on a bigger screen, the Chromecast seemed like the perfect solution.I managed to get it for under thirty bucks which made me happy, but was disappointed that Amazon Instant Video support is lacking with the device. Even so, the price and functionality on multiple TVs seemed worth it to me.Used with my Chromebook, these are the 10 Things I discovered, using the Google Chromecast:1. Installation is a breeze if the Wi-Fi network you are using is a good one.2. The Chrome browser extension is easier than the iPhone app to use. (I had issues with getting the app to connect with the Chromecast when using my iPhone, but not with the Chromebook and another Windows laptop.)3. Video streaming lags at times (not on the device you're streaming from, but on the larger screen connected to the Chromecast) producing choppy video quality on the HDTV.4. Downloaded videos stream better to the Chromecast than live streaming from the web.5. Having access to Hulu Plus, Netflix, and You Tube via the internet, and being able to mirror them on the big screen is pretty cool!  Especially since this will work with any HDTV with a HDMI port, versus with the much more expensive Apple TV casting only from iOS devices.6. I really miss having Amazon Instant Video!7. The Chromecast is easy to setup, use and is so highly portable, I can see where it would be a great gift for guys and gals who are 12 to 25. (And those of us who are gadget geeks and just need more of them.)8. Chromecast will not replace my Roku in my daily use, as the streaming quality isn't as good and it lacks Amazon's connection.9. Chromecast has a cheap price, but it's quality built!10. While Chromecast won't replace my other streaming devices in this cord cutter's home (I don't have cable TV), it's a great gadget to throw into my laptop bag to bring with me on the road or to use to share projects at work.After using the Chromecast device I wrote a book - Simple Guide to Over-the-Air Free TV, which mentions Chromecast as one way to enhance over-the-air FREE TV programming options for folks who drop cable or satellite TV.Overall, this is a great gadget that I hope will just continue to improve. In the next version of the device, I hope they add Amazon functionality and improve the iOS app. Either way, I'd say 'buy it' if you simply want to mirror your laptop onto a larger screen and do it wirelessly. Sharing streaming content is just the icing on the cake.", "verified": true, "helpfulness": "0/0", "author": "Andrea Polk"}, {"rating": 3.0, "review": "It works well with Netflix, but not much else. If I try to stream something other than Netflix I can't get the sound to go through the tv.", "verified": true, "helpfulness": "0/0", "author": "Ttaster"}, {"rating": 2.0, "review": "I can't use but the apps that chrome cast come within I like difrent apps that I have that I like to see on the screen", "verified": true, "helpfulness": "1/3", "author": "Ouri semah"}, {"rating": 5.0, "review": "Set up is easy, it takes less than 5 minutes, and most of the time you don't do nothing it does everything almost everything for you. All you need to do is plug it in and plug the USB to power the device. I have tested the device with Samsung Galaxy S4, S5, Note 2, Asus TF101 and samsung laptop had no issues. Everything plays smoothly and the best part is that it does not use a lot of the phones battery if it is being streamed from the phone.The only con I have seen so far is that when I watch a movie from a server from Europe the movie needs to be preloaded before I can watch the movie  without lag.Overall love the device, and applications that it features. Test Google Chromecast before you buy Apple TV, or Roku.", "verified": true, "helpfulness": "0/0", "author": "Damian Marynski"}, {"rating": 5.0, "review": "First I would like to mention that the chromecast is very easy to setup, the WiFi connection is strong and I have never had it drop on me.It is great for Netflix and watching Youtube. The real strength however, lies within the open SDK now....more apps are starting to develop for functionality with the Chromecast, and my experience with it although limited has been great.I was originally considering purchasing a small Intel NUC PC or Gigabyte Brix PC (which would have ran me easily $500-$600+). My only goal was to be able to play movies that I have downloaded onto my TV. My laptop has an HDMI input but it is getting old and I also like to use it while I watch movies.Then a friend recommended I get a Chromecast and use the beta Plex app. He showed me how it worked and I was awestruck, not only by how well it worked but also by how much money I could save!  ~30 dollars for a Chromecast and ~5 dollars for the Plex app. I simply setup the media server (which is very simple to do BTW) on my Desktop PC in my bedroom and then showed the media server where I keep all of my movies on my Desktop.The app works flawlessly, it always connects to the PC instantaneously....it pulls metadata for all of my movies automatically( movie name, cover art, synopsis, runtime, language, format etc) and with the Chromecast beam button it simply plays on my TV. Hassle free and cable free, this is the future of media sharing folks. I believe there is even a functionality where you can share media with friends if there server is up...but I haven't tried that yet.In sum, the Chromecast works as advertised. The Cheap price, Open SDK and easy installation make it a no brainer in my opinion. I highly recommend this product and the Plex App, I am really looking forward to what new functionality other apps will build into the Chromecast!TL;DR - This thing is dope, it turns your dumb TV into a highly customizeable one. The cheap price and perfect connectivity make it a steal at this price!", "verified": true, "helpfulness": "0/0", "author": "Vladimir T. Kostek"}, {"rating": 4.0, "review": "This thing works great and is a lot of fun. But not for colle students it doesn't hook up to most campus internet services unless you have your own wifi.", "verified": true, "helpfulness": "0/0", "author": "David Morar"}, {"rating": 2.0, "review": "The device works but even though I have a very good wifi/internet connection (20 MBPS) in the room where the TV is located there still is some delay and the picture quality is lower than expected.I ended up connecting my laptop directly with an HDMI cable and the result is a perfect picture, no delays.I would try the chromecast media player first and return it if it does not work properly.", "verified": true, "helpfulness": "0/0", "author": "Peter A. Siemsen"}, {"rating": 3.0, "review": "but not bad.  The Chromecast is limited in what it streams.  Unlike the Apple TV (which, in all fairness to the Chromecast has expanded over the past couple of years), there are few apps to watch - Netflix, You Tube, Hulu, and a couple of others.  My primary reason for purchasing was to be able to watch sports programming (NBA, MLB TV) in a room other than the living room.  Those apps are not part of the Chromecast package.", "verified": true, "helpfulness": "0/0", "author": "BC"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Jasjit Mangat"}, {"rating": 4.0, "review": "This needs more apps for Iphones.  I love the concept, but I am struggling because I can watch shows on my Ipad and Iphone, but cant put them up on my TV becuase they don't have the correct chrome extensions yet.  I have the Roku, but wanted to increase the capabilities my smart tv had in the bed room... not there yet.", "verified": true, "helpfulness": "0/0", "author": "MsHawaiiInNE"}]