[{"rating": 5.0, "review": "I can do do nuch more than I thought i could!!!", "verified": true, "helpfulness": "0/0", "author": "William Norton"}, {"rating": 5.0, "review": "Works very well and I use it with multiple apps. very handy for someone without cable.", "verified": true, "helpfulness": "0/0", "author": "Adam Hendricks"}, {"rating": 5.0, "review": "Google chromecast is a sweet deal. Will stream any chrome browser to your tv. Will also stream supported apps without the browser interface, like Hulu, Netflix, and YouTube.I love it.Also it was very quick an easy to set up on my phone and laptop, and literally all I had to do was plug the chromecast into the back of my TV.", "verified": false, "helpfulness": "0/0", "author": "Michelle Kantor"}, {"rating": 5.0, "review": "I've been using chromecast for over 6 months now. I stream youtube, netflix, hulu, movies from my computer and tablet. All in HD! it was easy to install and setup, it took less than 5min.", "verified": true, "helpfulness": "0/0", "author": "Ciro"}, {"rating": 1.0, "review": "it does what it says however in the instructions they say it will get hot. well it will burn your hand and i felt it was a fire hazard.  im big on not putting anything in fire's way", "verified": false, "helpfulness": "0/0", "author": "john w"}, {"rating": 5.0, "review": "A great purchase! It works great! Brand new box with everything in it!", "verified": true, "helpfulness": "1/1", "author": "Mai Der"}, {"rating": 5.0, "review": "i really love this tiny wonderfull its great", "verified": true, "helpfulness": "0/0", "author": "Carlo Cesar Carias"}, {"rating": 5.0, "review": "Very good equipment, I recommend!", "verified": true, "helpfulness": "0/0", "author": "FRANCISCO R."}, {"rating": 4.0, "review": "Works well 95% of the time, but is prone to lagging and freezing. I imagine the faster your internet speed, the less likely you'll have to deal with these issues. As a whole, an excellent addition to your television if you're looking to use Netflix, Watch Espn, etc.", "verified": true, "helpfulness": "0/0", "author": "Rick Nabors"}, {"rating": 5.0, "review": "That's neat!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Becker"}]