[{"rating": 3.0, "review": "I have been using the FireTV now for about a month. I also own and use the ROKU3. Between the two, I find the user interface much more useful in the ROKU3. The FireTV seems to make it difficult to find content other than Amazon content. And even then, the Amazon content is laid out in such a way that it is confusing (not impossible) to find which is free and which is paid. I understand Amazon wants to push its content, but maybe allow Users to decide if they want to opt for AMAZONfirst instead of What I Really want to watch. Amazon has hundreds of thousand of videos available. But most people don't go thru hundreds of thousands of videos to decide what they want to watch. They go by category. Dramas, thrillers, documentaries, etc. I wish Amazon would have that option. And there are hardly any App on this box - other than the You tube, Netflix and HuluPlus, the rest are pretty lame. Anyway, I struggle along with this FireTV box, but I find myself just going to the ROKU3 when I know exactly what I want to watch.", "verified": true, "helpfulness": "2/2", "author": "Viji R"}, {"rating": 3.0, "review": "Admittedly the only reason I purchased it was because it came with the Showtime app, something that is missing from our XBox.  I was quite disappointed to find that, while my Kindle Showtime app is compatible with the Xfinity subscription, the Fire TV is not.  The Showtime app only has a few cable companies listed, and none of them are the major 3 companies in my area: Dish, Directv or Comcast/Xfinity.  I may have missed the listings on the site, but I was very disappointed with the purchase yesterday.", "verified": true, "helpfulness": "0/0", "author": "cab0906"}, {"rating": 3.0, "review": "Fire TV is my fourth try at a streaming device. Obviously if I'm on my third one the first two had problems.Try 1: Smart DVD Player - closed captions don't work with streaming, interface is clunky and slow.Try 2: Google Chrome - doesn't work with Amazon Prime.Try 3: Roku Streaming Stick - worked great at first, closed captions, Prime and Netflix work. After two weeks Netflix freezes the system.Try 4: Fire TV - No closed captions on Prime. No way to restart system without unplugging.I'm trying to decide if I should keep both the Roku and the Fire so I can have a combination of Netflix and Prime, but it seems silly that I should need two devices that do the same thing.Another detraction from both the Fire and Roku is that they need external power. A plus for the Chrome was that it drew power from the TV. Neither have a restart button either which would be helpful for network freezes.I have done trouble shooting for all devices and can't get the above problems fixed.I suppose I will wait for the next streaming device to be released and hope that it actually does what it is supposed to.", "verified": true, "helpfulness": "1/2", "author": "J. Berky \"Self-Proclaimed Nerd\""}, {"rating": 5.0, "review": "UPDATE++ June 23, 2014 .......After further research I found out that due to copyright material the Fire TV will look for connected devices that it thinks might be used to record the data you stream. In my case I had an older HDMI cable that did not allow the copyright protection code to pass through. I had a newer HDMI cable I switched over too and all is good now.  Amazon customer service was also prompt in getting back to me with my issue and I explained to them my problem and fix. I give it a 5 star rating! Great job Amazon!June 22, 2014........Voices search works well, navigation is relatively easy, and it is very quick in starting up your chosen video. No buffering at least in my case. That's all good....but when trying to access a video that you just rented or purchased the unit goes to a black screen and will not play any videos in your library. I did a factory reset, cleared data, cleared the cache, but it still will not play purchased or rented videos. Customer services says update will fix this once they have one???? Anyone else have this problem? Sad that I have to use my Sony blu-ray players amazon app to watch movies I've rented or purchased. Fire TV works fine on anything that's free.", "verified": true, "helpfulness": "1/2", "author": "cd1"}, {"rating": 4.0, "review": "I order it thinking this was going to replace my roku unit but unfortunetly that's not the case. I do like the voice command. the first thing that I was not happy about was that I can't play my movies that I have on my USB drive. It does say I can put them in the cloud but that to me is a waste of time and space. Also I was thinking that there would be more APP's like the roku  has not just games seems like there are to many games and not enough program app's.The Amazon Prime section for movies is confusing sometimes I can't if it is prime or not.The menu screen is a little confusing or I'm just use to Roku.Hopefully they will work on getting the USB port to work.", "verified": true, "helpfulness": "0/0", "author": "George Henry"}, {"rating": 4.0, "review": "Much more stable than my earlier hookup, which was through a blu-ray player. I saw some thorough reviews at the Amazon sales site and I checked some other sources. All were positive, and the price was right.", "verified": true, "helpfulness": "0/0", "author": "The Great Weldini"}, {"rating": 2.0, "review": "For my parents, Fire is essentially plug and play.  Setup is a breeze and the interface is fast and slick.  The voice search function is pretty cool.  Amazon had a chance to hit this one out of the park, but for reasons that make no sense to me chose to cripple their box with old technology (no Gigagbit ethernet ports), no ability to play the array of media files that many, if not most, media players play natively, no native ability to support streaming from your NAS, and, on what good have been the one distinguishing feature -- accessing Amazon's vast free content for Prime members -- not even present!  I have a KDLinks HD720 on my main \"audiophile\" home theater system and it works flawlessly, but doesn't access Amazon Prime content because its Linux-based.  I figured that I would get the Fire for the bedroom so my wife could easily access the Prime free content, and the voice search was cool.Although I knew about the weak media player performance of Fire, I also read that Plex, which I use on my NAS, iPad, iMac, etc. solves the problem of streaming my content from my NAS in any format that Plex will handle (almost everything).  Plus, as I said, I liked Fire's supposedly easy access to the free movie content through Amazon Prime, like I do with the iPad app. Wrong. First, as others have pointed out, unlike it's own Apple App Store app, there is no way to sort the free Prime content from the Pay content . . . What? Amazon's app for the iPhone has more functionality than it's own app in it's own box? WTF? Second, although the majority of my video content on my NAS plays just fine through Plex's app on Fire ($4.99), enough movies either don't play at all or don't play the soundtrack, just the video (some AVI, some MKV) to be very annoying. Those same movies play fine on every other device on which I have Plex installed, as well as my other media player. Therefore it is clearly a Fire problem. This device has great potential, but its usefulness is limited now. My KDLinks HD 720 plays everything there is, including DTS-HD 5.1 music files! Getting disorganized access to Amazon Prime is not worth its inexcusable lapses as a media player. It's definitely going back to Amazon, and I'm getting another KDLinks for the bedroom. Fire has the potential to be great, but its definitely not ready for \"prime\" time, pun intended.", "verified": true, "helpfulness": "2/5", "author": "dannarenee"}, {"rating": 2.0, "review": "Has hard time connecting to remote have to reconnect a few times for it to connect to remote need a new box having tbl since purchase", "verified": true, "helpfulness": "2/3", "author": "raymond"}, {"rating": 5.0, "review": "I had Roku and always had problems with it, so I decided to try the Amazon Fire TV. I love it!!!It is so easy to navigate and I have yet to have any problems with it.", "verified": true, "helpfulness": "0/1", "author": "JP"}, {"rating": 1.0, "review": "first, it totally messed up my High Def TV viewing. Secondly, every time I wanted to use it, I had to first unplug it and then plug it in again. Too much trouble!", "verified": true, "helpfulness": "2/7", "author": "Nomad8 \"Bryan Flemming\""}]