[{"rating": 5.0, "review": "I love it is the 2nd one i bought  ! Will not go back to cable !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "valuree wigfall"}, {"rating": 4.0, "review": "My old streaming device was not cutting the mustard hardware wise.  Instead of purchasing a newer model of that particular brand due to \"lock-up\" issues with the older one, we went with Fire TV.The Fire TV has less \"channels\" available, or maybe I do not know how to find and add them.  The user interface is not very intuitive for an old guy like me.  Maybe I'm just used to the \"other\" devices interface.Can not seem to use the voice commands for anything other than searching Amazon, which only searches Amazon.Much superior hardware specs and functionality than my old device, but I find it frustrating to navigate, and did I mention that it seems there is not as many \"channels\" available?", "verified": true, "helpfulness": "0/0", "author": "J_Hatch"}, {"rating": 5.0, "review": "What's to not like? This thing is amazing! I knew I had a great product already by just the packaging. That might sound silly, but even that is very cool. The device itself? Does everything it should ... easily. From set up to using; flawless. I love the mic on the remote to search. It is very accurate.", "verified": true, "helpfulness": "0/0", "author": "LarryPD"}, {"rating": 4.0, "review": "Nice features, just needs more apps, other than that it is a great device", "verified": true, "helpfulness": "0/0", "author": "Joseph R. Anderson Jr. \"JD McNugent\""}, {"rating": 5.0, "review": "Very inexpensive way of turning your high definition TV into a smart TV. It's a lot easier to use then a smart TV apps. Takes less than 15 minutes to unpack, install, and start streaming shows or movies. I don't use gaming, but if you enjoy the selection of games looks enjoyable. Looking forward for more apps to become available. I know my wife would love streaming her soap operas on the fire Tv, it would be great if they will offer network apps. I usually don't spend a lot of money on app but I would purchase her Network app for soap operas. If you know how to operate a smartphone you will enjoy the Amazon fire TV. I think I know what I'm giving as Christmas presents this year. How sweet would that be, Christmas shopping done in10 minutes.", "verified": true, "helpfulness": "0/0", "author": "rich"}, {"rating": 5.0, "review": "Still trying to figure it out?", "verified": true, "helpfulness": "0/0", "author": "chyrl"}, {"rating": 5.0, "review": "Great little device, lot's of movies and tv shows to watch especially for prime members. Voice command is a great feature.New movie prices are competitive with cable on demand pricing.There are also lots of apps you can get free like espn Pandora YouTube and many more.", "verified": true, "helpfulness": "0/0", "author": "David T."}, {"rating": 4.0, "review": "I really like the Amazon Fire TV...the voice activated searches are great. The only downside about it is that i wish it had more free movies. The slide show when it \"sleeps\" is awesome. Definitely glad we have it.", "verified": true, "helpfulness": "0/0", "author": "Peanut2"}, {"rating": 4.0, "review": "I am very happy with the Fire TV so far, though I have only had it for a few weeks.  I love the very small footprint it has.  The only issue I have had so far is that of the Dolby Digital Plus (DD+) over HDMI not being compatible with my Pioneer Elite audio receiver, which I resolved by using the optical audio output (i.e. toslink) to receive the Dolby Digital output.  Hopefully, the device's programming will be updated to send regular Dolby Digital over the HDMI connection.", "verified": true, "helpfulness": "0/0", "author": "Ben  Amberge"}, {"rating": 1.0, "review": "If i was able to get on hbo or any other website to see movies it would be great.. But only having Netflix or have to have an account with Amazon Prime not worth it", "verified": true, "helpfulness": "2/3", "author": "Susana"}]