[{"rating": 5.0, "review": "I've been using my Fire TV for a few months now and I adore it. I originally bought it for downstairs but it's been in my bedroom keeping me up late since I took it out the box. I use it for apps like Netflix and Hulu mostly, since I'm more familiar with the two.Other than that, I love the Prime content is identified for me and I can easily find shows available for watching free with my membership. I occasionally use other apps like YouTube, Showtime and a bunch I haven't heard of before getting the box. It's been a great way to watch programs I can't find on demand such as Asian dramas. I need to explore the apps more so I can get rid of cable all together.Though it's of no interest to me, my family like to play the game apps. Soon I'll venture and use it for music.", "verified": true, "helpfulness": "0/0", "author": "Vee"}, {"rating": 1.0, "review": "Not worth it! Turned it on, set it up and went to watch netflix, WOULD NOT STREAM ANYTHING. I restarted it and it never turned back on. Sending it back and buying a Roku 3 instead. Don't bother wasting your money.", "verified": true, "helpfulness": "1/2", "author": "MheKayla"}, {"rating": 5.0, "review": "UPDATE: 04/15/2015Newest OS release solves my sleep function complaint. Hold down the home button and you can select \"Sleep\" \"Mirroring\" and \"Settings\" and it displays the time. I am EXTREMELY pleased that they added this! Vastly improves the user Experience.I'm cancelling Xfinit Crookcast. Amazon Fire TV is everything that a device should be. Tons of free prime programming, easy to use, versatile, RIDICULOUSLY FAST, easy to use interface, easy in-device movie purchasing, latest releases available, and so on. Wishlisting is so easy, and whatever you wishlist on your account, be it through a browser or kindle, is all synched to your Amazon account. I especially like how if you have a Kindle Fire HDX you can see information through IMDB on the kindle while watching the same show/movie. App support is always a bonus (Youtube and crackle! I use these ALL THE TIME!) and voice commands work perfectly fine for me. Whoever has issues... you must talk with cotton in your mouth... Another amazing thing is how SMALL the unit is. I was expecting something much bigger, even though the specifications said it was pretty small and the size really doesn't make a huge difference since I won't be walking around with it in my pocket. The remote control is simple, elegant, sleek, and easy to use. It's everything a remote controller SHOULD be- easy and simple. Xfinit Crookcast controllers have about 80 buttons, of which 1/2 don't work most of the time. This has 8... you're doing it right Amazon... you're doing it right...I bought the fire TV when it was on sale... and now I wish I would have bought a few to give to some family members as a present.....Something else to note is that the instructional video that starts once you power up the device is very cute and extremely useful- it guides you through the device and covers all the essentials. I am extremely tech-savvy, and I can say that this device is extremely novice friendly. There isn't a ton of options to confuse the user and the device is already set up optimally (I haven't had a need to change any settings).Do note that a lot of recent TV shows are NOT free to watch, however at $2/show in SD or $3/show for HD, it's still way cheaper than paying $110/month for basic cable through Xfinit Crookcast (or just buy the whole series for $10-$30). Still ends up being cheaper than dealing with the outrageously expensive HD cable pricing, especially in California Bay Area. Also, if you are INDEED one of those TV junkies that likes to have certain local programming available... there are some apps out there that I won't name (not sure if I can, so I won't)- Several apps are available to watch local TV programming for $20/month. Gives you what you normally get with Basic cable for a fraction of the price and all in HD! Just install and run just like Youtube or Hulu+ or Crackle. The rest of the \"local\" programming you can watch for free in HD with an antenna.A few complaints:You can't set the \"sleep\" function as a \"screen saver\" - i.e., after 5 minutes of inactivity, have the unit go to sleep automatically to save on power/not have the light complaining at you while trying to sleep at night and there's a light-show going on in your room.Lists of movies/shows (over 150 at times) can be bothersome to have to scroll through! There should be a page jump feature... like if you double click left/right you can jump 10 results, or if you press the fast forward/reverse buttons you can jump 10 pages. Such an EASY feature to add but they didn't :-(Remember how I complained about the lack of a simple \"sleep\" function without having to go to the settings within the device? Couldn't have killed Amazon to add a 9th button to the controller... namely an ON/OFF button.In any case, I highly recommend the Fire TV, especially for prime members. Unsure about non-prime members, but at $50/$100 a year, there really is no reason to NOT be a prime member! Basically $8/month for watching TV. Add $20 and get all the perks of cable TV. $8 more for Hulu+ and you get everything that -you- want rather than paying for a whole bunch of infomercials and crappy programming with other providers.", "verified": true, "helpfulness": "2/2", "author": "Anthony Mardirosian"}, {"rating": 5.0, "review": "Easy to hook up, voice command works great, so far it looks like a fantastic streaming device...love it!", "verified": true, "helpfulness": "1/1", "author": "M. MCCANN"}, {"rating": 5.0, "review": "When I subscribed to Hulu, I honestly thought it was one of the channels offered by our Blu-ray player. When I discovered that what I had remembered as Hulu was actually Vudu, I started campaigning for a Fire TV device. My husband was skeptical, but after I took advantage of a discount on Amazon Prime, it looked even more appealing, and he surrendered. Although I'm sure we have not exploited most of what it offers, we've been very well satisfied with the features we have used. It streams Netflix just as well as the Blu-ray player and is very satisfactory for Prime Video. We've accepted the fact that we can stream Hulu only in the daytime, but that's better than nothing (if we had a better Internet connection, I assume this wouldn't be a problem).I especially love the remote, which is so attractive and feels so good in the hand, with buttons that are a good size (unlike the tiny ones on our TV remote). We haven't really experimented much with voice search, but it seemed to work well when we did.A friend recommended Roku instead, warning me that the text on the Fire was difficult to read, but I have not found that a problem at all.", "verified": true, "helpfulness": "1/1", "author": "Suzanne S. Barnhill"}, {"rating": 1.0, "review": "In sure the device is great... Mine was just DOA. I put in a ticket for an exchange, so I will update once I receive a replacement. Super bummed that I have to wait even longer to try it out...", "verified": true, "helpfulness": "1/1", "author": "Michael Andrew Livingston"}, {"rating": 1.0, "review": "I have both roku and fire tv...Roku is way better, hands down. Don't waste your money on this. The only thing that is really great about the fire tv is the screen saver. The nature pics are very relaxing.", "verified": true, "helpfulness": "2/4", "author": "Andy Natusch"}, {"rating": 5.0, "review": "Amazon fire works very well, not hard to set up. I wish that the movies were a little more up dated", "verified": true, "helpfulness": "0/0", "author": "Sebastian Caltabiano"}, {"rating": 5.0, "review": "The first FireTV that I ended up receiving ended up dying after 3 hours of use, however, Amazon was very quick to resolve the situation and I had a new FireTV within 2 days!  In the last 2 weeks I have used my FireTV almost every day after work and it has worked flawlessly ever since.  As others have said, the voice search feature is really easy to use.The only thing that seems odd is that some movies do not let you rent them through the FireTV, however, if you access amazon.com, you can generally rent the movies you were looking for.  These rentals obviously show up under your movie list just as they would under your account here on amazon.com!", "verified": true, "helpfulness": "1/1", "author": "Jeff"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lovella Ware"}]