[{"rating": 4.0, "review": "Thoroughly enjoying Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "ktmillerfla"}, {"rating": 5.0, "review": "I love it so much, I'm getting another one.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Hutchinson"}, {"rating": 5.0, "review": "Amazon fire tv is AMAZING , there is so much to watch and do with fire tv , you can never get bored. I was paying so much in cable bills and could never find anything good to watch. Fire tv with prime is the best investment I've made. I can keep my photos on it and the family enjoys the games . I've had it for a month and still find new apps new games new movies whole tv series . And much much more. Get rid of you cable provider now and get Amazon fire tv. You won't regret it", "verified": true, "helpfulness": "1/1", "author": "flex"}, {"rating": 5.0, "review": "One of the best.", "verified": true, "helpfulness": "0/0", "author": "Daddyrose"}, {"rating": 5.0, "review": "Five minutes out of the box to streaming....what's not to love?  The voice recognition is super intuitive, love it!!!", "verified": true, "helpfulness": "0/0", "author": "sah1109"}, {"rating": 5.0, "review": "Wonderfully simple to use; the voice recognition is excellent. A great product that we use daily.", "verified": true, "helpfulness": "0/0", "author": "Dr. James E. Kelley \"bluegrass nut\""}, {"rating": 4.0, "review": "My favorite streaming device. Excellent video quality, wifi and responsiveness within the different services. However intentionally broken. Voice should work across platform not just for prime. If Google can do it so can you.  The wifi remote has no apps and NO OPTION other than the actual Fire Tv remote! Total fail. Doesn't work with my Logitech remote or ANYTHING other than The Fire tv remote. I love the box and the service but the total lack of support for options for the remote is ridiculous.", "verified": true, "helpfulness": "0/2", "author": "Themachinist"}, {"rating": 1.0, "review": "what waste of money. I already had my computer hooked up to my TV via HDMI and the games are really lame and WAY WAY overpriced!. DO NOT GET THIS", "verified": true, "helpfulness": "3/13", "author": "Jeremiah Schrimsher"}, {"rating": 4.0, "review": "So I already have 2 Fire TVs: one in my room and one in my son's room. I'm currently debating on buying a 3rd, for my newly added game room. My only complaint is the PIN. I set it up so that my son couldn't BUY anything (he bought 2 episodes of PAW Patrol before I added the PIN. But now, we can't even select an Amazon Prime movie or video to watch without me having to input the PIN. I've even tried turning the PIN off through my account and it still, to this day, asks for it. I have (or my boyfriend has) misplaced that itty bitty remote a few times now, and when that happens, I can't send a show from my Kindle Fire to my Fire TV because it wants me to input the PIN (remote required). Adding different options/scenarios for PIN requirements would be a much appreciated feature!", "verified": true, "helpfulness": "2/4", "author": "hhebe"}, {"rating": 5.0, "review": "*Updated*In a moment of bitterness, I wrote a review recently that did not reflect the overall product of the Amazon Fire TV. I would like to clear some things up, and give a fair assessment of this product. First off, the device itself: It has a very sleek, thin design, that almost disappears by camouflaging into my black TV stand. Love the size, as it is unnoticeable!The interface itself is wonderful, very smooth, easy to navigate, and is packed full with all my favorite apps I use to watch movies, TV shows, and music. I have also downloaded a plethora of games, for my nephews to enjoy when they visit.The additional features Amazon Fire TV comes with is what separates it from other streaming box competitors, the voice search, optional game controller, and the synchronicity between amazon devices.The voice search works flawlessly, and predicts my exact phrase every single time. Such a time saver for the inpatient customer! Quite astonished on how well this works. The ASAP (Advanced Streaming And Prediction) feature is always on the money too!I have not yet myself purchased the controller, but I have heard great things about it from friends that own one.The Amazon Fire Tablet, push-to-second screen is incredible as well. The tablet displays relevant information on the movie/TV show pushed to the fire TV, and it works perfectly. It is an essential counterpart for convenience, which I use to scroll through the large library of media files right in my hands. Once I choose what I want to watch, I just simply push it it to the Fire TV.As an Amazon Prime member, both the Fire tablet and the fire TV is a must-owned product.But overall, what really makes this product, and all products made by Amazon, is the company itself. My initial review, I mentioned the remote control. I had a unpredictable, isolated incident, in which the batteries used to power the remote somehow leaked, resulting in the remote nonfunctional. This is a freak incident, that is out of the control of the Amazon company. I did not contact Amazon about the incident, due to my busy schedule working full time, and being a student in an accelerated nursing program. This was the only thing mentioned in the review. Mind you, I did not contact Amazon about it. But after writing the review, AMAZON CONTACTED ME ABOUT IT, apologized about the misfortune, and OFFERED ME A REPLACEMENT.In my honest opinion, most companies, corporations, stores, etc. these days always claim to offer superior customer satisfaction. Although they preach this, not many companies really go the extra mile to ensure customers are fully happy and satisfied. I even consider most corporations are all about profitability, and fail when it comes to standing by the products they sell. They neglect even their most loyal customers, and don't really make it easy when difficulties arise concerning their merchandise and customers. However, Amazon has been BY FAR, the best experience I have ever had with a company. Rarely do I ever have any problems with any of the third-party products I purchase through Amazon. Never had a problem with shipping dates, costs, compromised products through Amazon. Amazon is an amazing company, and I have had such a profound experience with Amazon, I say with confidence they have a loyal customer for life with me. Everything about Amazon is perfect.Amazon Prime - Two day shipping, access to Prime Instant Video with a library of a ton of movies and TV shows. It has more features than I can use or handle (Kindle book rentals, unlimited streaming music, etc.)Fire Tablet/Fire TV - Superior to the competitionBut overall, the most gratifying and superiority lies within the customer service. HANDS DOWN THE BEST CUSTOMER SERVICE OFFERED BY ANY COMPANY/CORPORATION.Thank you Amazon, You 'effin' rock!", "verified": true, "helpfulness": "1/5", "author": "Joshua C Arnez"}]