[{"rating": 4.0, "review": "great streaming tv dongle device.no interruption.con:not great for gaming", "verified": true, "helpfulness": "0/0", "author": "Pepper"}, {"rating": 5.0, "review": "I love this item! The chrome cast lets my family to watch shows from the iPad or laptop. As more companies integrate the chrome cast into their product, it will replace TV as many of shows and movies can be watched online.", "verified": true, "helpfulness": "0/0", "author": "The Honest Review"}, {"rating": 5.0, "review": "Very cool.  You will be shocked at value of this thing while it won't claim any space in your TV room.", "verified": true, "helpfulness": "0/0", "author": "J. Horne"}, {"rating": 4.0, "review": "This is a great little device which allows me to watch movies etc from my tablet to my big screen without a problem.  I also like to watch certain youtube videos on the big screen vs. my tablet or phone.  I cant tell that it is being \"cast\" because the clarity is great.", "verified": true, "helpfulness": "0/0", "author": "George R. Brunell"}, {"rating": 5.0, "review": "works very well. easy to install. comes with everything you'll need. fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Amy O'Brien"}, {"rating": 5.0, "review": "the simplest way to save TV cable expenses.", "verified": true, "helpfulness": "0/0", "author": "Freddy D."}, {"rating": 5.0, "review": "My daughter talked me into this.  Now I can't live without it.  Use it every day.", "verified": true, "helpfulness": "0/0", "author": "Joe Bergmann"}, {"rating": 4.0, "review": "It's a lot of functionality for a low price. The setup is surprisingly nice. But it simply doesn't work reliably. Apps and the Chromecast give a variety of error messages that aren't helpful. Nice when it works, though.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 2.0, "review": "You get what you pay for it'sPros cheep and it is out of the wayCons needing another device to use it (phone,tablet,pc) also load speeds arnt great and stream quality isn't the bestIf I new the cons I wouldn't have bothered with it I bought a smart blue ray player and a fire tv box both blow it away and stand alone because of the remote and the ram quantity and processor speed needed for true HD streaming", "verified": false, "helpfulness": "0/0", "author": "Jonathon rosalia"}, {"rating": 5.0, "review": "Great little thing. I use it all the time with my iPad.An update for 4K would be great as now I do not think it can support 4K. Also, it would be nice if it drew power from the HDMI port rather than having to use a separate USB port.", "verified": true, "helpfulness": "0/0", "author": "ajpug"}]