[{"rating": 1.0, "review": "Why did you not indicate that this does not work with FIOS UNLESS i disable part of the router? Does not work with Windows 8?  Seriously, I'm returning this paperweight.  I did not have to disable anything to use the Sony Media player- why does Google need so much access?", "verified": true, "helpfulness": "8/10", "author": "Fnu_Mnu_Lnu"}, {"rating": 5.0, "review": "Nice item , good quality, truly does the job at a great Price!, & waiting for new apps to come.", "verified": true, "helpfulness": "0/0", "author": "etijerina"}, {"rating": 1.0, "review": "The deviceworked fine for about three months after that it started giving all sort of issues like green screen, no sound, no chrome cast, the app for the music doesnt work neither. I know how this things work and it was not on my behalf. would never buy it again, now i have a piece of electronic junk.", "verified": true, "helpfulness": "0/0", "author": "Bernardo"}, {"rating": 5.0, "review": "This is a very simple but effective device that does exactly what it says it does.  It's features are minimal however the price is so low that it's hard to find fault with this device.  I bought two and have both of them powered off built in USB ports which is great since if I had to connect this to an outlet I'd have reduced the star rating by at least one.  Rumors are that more services will be added beyond the current Youtube, Google Play and Chrome browser and this will make this even more useful.", "verified": true, "helpfulness": "0/0", "author": "Paul H"}, {"rating": 5.0, "review": "Had my Chromecast for a couple of weeks now and really don't know why you wouldn't want one. Netflix, Hulu+, more coming and just about anything from your desktop or laptop, Even my wife who is not into tech has grown to love it watching several shows and movies. Would love to see Amazon Prime sorted out better but even using Googlecast from the browser is very workable. For $35 what's not to like.Raymond", "verified": true, "helpfulness": "0/0", "author": "Raymond"}, {"rating": 1.0, "review": "i PURCHASED IT TO WATCH ALL SERIES OF THE sOPORANAS AND COULD NOT GET IT  ALL ONE CAN GET IS FACEBOOK AND NETFK[LIX WHICH I ALREADY HAVE WITH MY BLUSRAY PLAYER  IT'S A JOKE", "verified": true, "helpfulness": "2/8", "author": "ron kingsbury"}, {"rating": 3.0, "review": "The idea is awesome. However it only works for some applications.1.  If you use your ipad you cant have the ipad 1 because the ipad 1 does not support the ios upgrade that the Netflix and youtube apps needs to update.2.  Only Netflix, youtube, and hulu works with it. I bought the device thinking my tv will simply mimic what is on my computer or ipad. but it only streams from certain apps.3.  Sound is an issue when I attempt the web browser casting. I thought this would be a way around only having certain applications that worked with the device. It does display my computer screen, but no sound is transmitted.With that said I hope there is more versatility with different applications in the future. That would make my rating go up. For now im better off using my hdmi cable to plug in my laptop", "verified": true, "helpfulness": "0/0", "author": "David Moore"}, {"rating": 5.0, "review": "Google is doing great things  with there products always looking into the future and thinking ahead way to go GOOGLE!", "verified": true, "helpfulness": "0/0", "author": "Tommy L Williams Jr"}, {"rating": 5.0, "review": "Excellent product. HULU works well. I will be buying on for each TV in the house. Should cost more than 35.00", "verified": true, "helpfulness": "0/0", "author": "Alejandro Barrios"}, {"rating": 4.0, "review": "So i got this since my computer is in my living room and my friends and I enjoy sharing youtube videos we find with each other. However i found out my 42\" HDTV (which is only 3 years old) is NOT HDCP compatible. I wont go into detail about the evil that is \"HDCP\" ill let you google/bing that and find out. but basicly most tv's made outside of 2010 are most likely not HDCP compatible which means this will not work. you will get a black screen, no sound, nothing.However lucky for me i have spare tv's in other bedrooms which ARE hdcp compliant; and this works fine on them. playing video on your computer/in your browser and 'casting' it to your tv however is laggy. skippy. jumpy. casting from your phone or mobile device is flawless and works just fine.if it wasnt for this new compliance bull crap this would be amazing on any tv; but make sure your tv is HDCP complaint first.", "verified": true, "helpfulness": "0/0", "author": "Frank Castle"}]