[{"rating": 5.0, "review": "Awesome tool!!", "verified": true, "helpfulness": "0/0", "author": "Michael A. Penzo"}, {"rating": 5.0, "review": "Better than advertised.  We enjoy the Amazon Fire TV and with the Prime it's even better.", "verified": true, "helpfulness": "0/0", "author": "Tom \"I do a lot of commuting and this makes life a little easier.\""}, {"rating": 3.0, "review": "Amazon Fire was easy to set up and extremely easy to us as was promised.  It is amazing in what it does.  I'm truly impressed.  I was disappointed in two things.  First of all, there are not as many free movies available as I thought there would be with Amazon Prime, at least not the ones I want to watch.  Also we wanted to subscribe to Watch ESPN, but could not because our server, Direct TV, was not available with Amazon Fire.  Practically every other server was there, but apparently Amazon has partnered with Dish TV to offer some of the subscriber services, so they left Direct TV out of the mix.  I think that is very unfortunate as there are millions of Direct TV users.  So, that was a HUGE disappointment for us.", "verified": true, "helpfulness": "0/1", "author": "Bonnie Hamilton"}, {"rating": 3.0, "review": "I have to unplug and plug it back in every time I want to use it.  Same with Ruko 3.", "verified": true, "helpfulness": "0/1", "author": "Richard A Miles"}, {"rating": 5.0, "review": "So far Amazon Fire TV is much faster and better quality than using my Sony blue ray box.  There is less buffering and you can add apps to the ones already loaded.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Plier"}, {"rating": 5.0, "review": "Exceeded my expectations!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "The Fire Tv is easy to install, and ready to go right out of the box. Plenty of great apps to choose from. This is a great product. It turns a regular television into a smart tv in minutes.", "verified": true, "helpfulness": "0/0", "author": "Cy Williams"}, {"rating": 4.0, "review": "Very happy with the Fire.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Works just fine.", "verified": true, "helpfulness": "0/0", "author": "Paul Gilbert"}, {"rating": 5.0, "review": "Love this!  So easy, just plug in and go!  Just make sure you also order an HDMI cable as it's not included.I'm enjoying watching Amazon Prime movies and Netflix movies and shows!  Also, enjoying free shipping with the 30-day Amazon Prime free trial.", "verified": true, "helpfulness": "0/0", "author": "NanaK3"}]