[{"rating": 5.0, "review": "Almost at an impulse-buy price point, these things offer a remarkable value for $35. Sharing a TV for crowd sourcing youtube videos among friends, turning your TV into a big screen projector for your laptop, controlling Netflix from your computer while being free to use it for other purposes ... it's just amazing. Set-up is a cinch. If your TV lacks a USB port to power it then you use the included power cord so installation is always a success if you've got a spare HDMI port. Network configuration is easy if you are accessing wifi directly. The only down side isn't the device's fault ... when there's an interstitial web site for setting up wifi (as in a hotel room) then the device can't gain access. It's so small that I carry one with me with I travel. Why do I have five? Because I think they're so cool that I've purchased three and given them away. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Travis Good \"Travis Good\""}, {"rating": 5.0, "review": "We bought the Chromecast when it was first released, and have since bought several others as gifts for friends and family. This is the most user friendly and cost effective way to stream Netflix and HBO Go to your tv, with the added bonus that you can broadcast anything from the Chrome browser on your computer. Our household already had this functionality, but the Chromecast simplified the process with a much smaller product. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Janet L. Grayson"}, {"rating": 5.0, "review": "I started with one and now have bought 3 more of them I love them so much. Its fun when people come over and all connect to the same tv to start queuing up videos to watch off youtube.", "verified": true, "helpfulness": "0/0", "author": "Bennett Giesler"}, {"rating": 4.0, "review": "love it ,was easy to set up .I have no prolem with it so far. just works great for me.", "verified": true, "helpfulness": "0/0", "author": "Rudy"}, {"rating": 3.0, "review": "Got this as a gift for the holidays - it was a somewhat rocky install on both my iphone and chromebook. The unit had to do updates which took some time. After setup, it becomes clear what this does and what it DOES NOT do. If you want to watch home videos to your tv, that (at least right now) isn't doable unless you have the files stored online and have the right app and settings to cast them. I wanted to show my family some videos I had on my iphone and wasn't able to do so. I converted the videos and uploaded them to Google docs and they still wouldn't play right (fuzzy and/or no sound). This item can easily be replaced by a plethora of current/older tech that (IMO) works far better - hopefully Google will get Amazon (hint hint) to add the ability to stream videos and add more apps/providers. This item is also 100% dependant on your wireless speeds - high res video will stutter or get blocky over time.", "verified": false, "helpfulness": "0/0", "author": "Roy Fox"}, {"rating": 3.0, "review": "Yes, isn't works great but we expect they improve the software so we can cast anything from our cellphones or tablets", "verified": true, "helpfulness": "0/0", "author": "ALFREDO JARAMILLO"}, {"rating": 5.0, "review": "Awesome this is by far the best device for tvs that don't have wifi just make sure you have more than 3 hdmi inputs on your tv google has really stepped up their game took 10mins to setup", "verified": true, "helpfulness": "0/0", "author": "Donald Daniels"}, {"rating": 3.0, "review": "Interesting device but limited.  A Roku for $50-$75 with remote control included and more options is a better value at this time.", "verified": true, "helpfulness": "1/1", "author": "Michael D. Mayer"}, {"rating": 5.0, "review": "It is magical. Easy to install. Fast and pretty straight forward. Also new apps had been added to get more out of it.", "verified": true, "helpfulness": "0/0", "author": "Emiliano Suarez"}, {"rating": 5.0, "review": "I already have a chromecast, but wanted to spread the wealth. I bought this as a gift. the item was in perfect/new condition and the shipping was SO quick! especially arriving before christmas. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Thomas Denson"}]