[{"rating": 4.0, "review": "I purchased this as deal with PRIME. Have not used it much, because I thought it had the capability to permit movies beamed fro my MacBook.", "verified": true, "helpfulness": "0/0", "author": "William P Hush"}, {"rating": 3.0, "review": "Still new to it but don't like to have to pay to watch each episode", "verified": true, "helpfulness": "0/0", "author": "loni pheifer"}, {"rating": 5.0, "review": "Thank very much, very good service, and very responsible in sending to recommend. Thanks again Amazon", "verified": true, "helpfulness": "0/0", "author": "amadeo pettinaroli"}, {"rating": 5.0, "review": "Thank you", "verified": true, "helpfulness": "0/0", "author": "Turtle Kientz \"Buzzy\""}, {"rating": 1.0, "review": "This product is  terrible. It is so laggy, it's either buffering, or just doesn't lay the video all together. I know it's not my internet, I'm getting 50mbs, and none of my other devices have a problem. We are an internet only house, we run two cell phones, a laptop, kindle, Xbox, and a Roku. They all work fine,never a problem. The Amazon fireTV works for crap. The games work fine, because they are downloaded onto your memory. You're asking to move mountains to get Hulu to work. HBO is very slow and buffers. Netflix works better. Of course the Amazon content works the best, but not all the time.What is weird, is that Hulu works good, in the morning, before work, but not at all as the day goes by. But again, the Roku never drops the ball.The games don't out weigh the cons to make this thing better than the Roku. If I could do it all over, I would have gotten another Roku 3.There is going to have to be a huge turn around in service to get me to give a higher review. I'm really considering selling it, or just cutting my losses and getting another Roku.", "verified": false, "helpfulness": "1/3", "author": "S. Setzco \"risen\""}, {"rating": 5.0, "review": "I just love the Amazon Fire TV box. The menus are fast and the videos are smooth. I also subscribed to SlingTV.  WOW !!! what a combination. Sometimes I forget that I am watching TV over the internet.  As soon as the weather permits, I will be connecting the antenna on my roof to my digital signal ready TV in order to get local channels. After that, no more DirecTV. THANKS to AMAZON and SLINGTV, the future is now.", "verified": true, "helpfulness": "1/1", "author": "BRIAN H"}, {"rating": 2.0, "review": "The unit itself is great. It is fast, easy to use and the voice search really works. However I feel completely ripped off by the lack of content. There are very few new apps being releases and updates are rare. A lot of basic apps are missing like Rhapsody for example (Samsun Smart TV has it) . The watch March Madness app is available for every Amazon platform except fire TV. There are hardly any good games and rarely any new ones. This is an Android device right? The other Amazon platforms have large app selections. There is no excuse for the lack of apps. If I could return it I would. Amazon has really dropped the ball on this.", "verified": true, "helpfulness": "0/2", "author": "Robert Davidson \"Bob\""}, {"rating": 4.0, "review": "Still learning how it works. No instructions. Remote seems a little touchy. But the voice activation part works great.", "verified": true, "helpfulness": "0/0", "author": "Carolanne Mussey"}, {"rating": 5.0, "review": "Seriously one of the coolest pieces of tech I've owned in years. Fun and easy to use...", "verified": true, "helpfulness": "0/0", "author": "SilentKoala"}, {"rating": 5.0, "review": "I have purchased FireTv as a part of the SlingTV deal but after having it for some time, I would gladly buy it even for the full price.If you are a person who will never pay for any subscription, you can still side load Kodi (XBMC) but the main functions such as Prime TV and Netflix wont be much of a use. We are using all 3 and playback in full 1080p works without any problems or lag. Plex is also supported. I'm glad that I have got mine at this time as in the previous software release the device did not natively support bluetooth headphones but looks like Amazon has listened to cries of all the techies at various blogs and added the support just now. If you can not see it in the settings, run the firmware update. The sound is great on my stereo system connected using optical cable (can be hdmi) and at night when the kids are asleep I can connect by bluetooth headphones and it sends the sound to it right the way. Very easy to use and works great. Sending screen to the fire tv from apple and android devices works without any glitches as well. I love that when my kid watches youtube on a tablet I can click a link and send it to the big screen. This works for Apps like Spotify and Netflix too. I think that this is a first Android device I feel like I dont have to root since it allows to side load other apps. The only problem is adding other installers like Google Play. If you really want to root the device, you still can. you will have to find one with older firmware and that will be missing some functions such as support for bluetooth headphones. The device also has an e-fuse in the newer firmware and checks for unlocked bootloader and custom roms. If it finds it, it blows the efuse and then you can recover to the supported firmware only.The hw specks and looks are also pretty impressive. Quad core arm based cpu and very sleek and polished look. The only bad thing is the hole I have in my media center after pulling the Media PC it replaced :-)", "verified": true, "helpfulness": "1/1", "author": "Alex J Sir"}]