[{"rating": 5.0, "review": "I'm mildly obsessed with this thing.  We have a smart TV in our living room and I got spoiled with being able to watch Netflix whenever my heart desired.  I decided to get this to use on the TV in our bedroom.  Only 30 bucks, why not... It is faster than the Smart TV! Now I get annoyed watching TV on the smart because of buffering.  Also, I am not at all technically savvy but setup was super easy and took about 10 minutes.  Now all I have to do is switch the TVs input, grab my smart phone and pick something to watch.  No, you can't do everything you could on a computer... I have a computer for that... I wanted something cheap to easily watch Netflix and YouTube and it is perfect for that.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "We bought it for vacation, using the chromecast along with Plex, we have access to our entire media library.  It works flawlessly.  Great purchase and will be using it at home.", "verified": true, "helpfulness": "0/0", "author": "PattonD"}, {"rating": 4.0, "review": "The only reason I did not give this 5 stars is because the Amazon Instant Video application is not available for this yet. Great product, use the youtube for my Yoga :)", "verified": true, "helpfulness": "0/0", "author": "Rachelle98924"}, {"rating": 1.0, "review": "I thought this would be a neat addition to my Media center. I already have an Apple TV, but I liked the Youtube and Google Chrome streaming aspect of it. I ended up returning it because i found it to be too limited with the apps it offers, Apple TV and Roku both offer much more functionality and are much more useful. You might say, \"well, this is only 30 bucks, compared to close to 100.00 for an Apple TV\" But the extra 70 is well worth it for the Apple TV...Just compare the features... This is a waste for now, maybe when more apps come on board this will be more useful.", "verified": true, "helpfulness": "2/4", "author": "S. TIERNAN"}, {"rating": 5.0, "review": "This was the best 35 bucks I've ever spent. All tech should be this easy to use, setup couldn't be simpler.", "verified": true, "helpfulness": "0/0", "author": "Umbra"}, {"rating": 5.0, "review": "It was very easy to set-up. It works beautifully. My husband loves connecting his IPad & watching HBO movies. Was a great gift.", "verified": true, "helpfulness": "0/0", "author": "Barbara Farris"}, {"rating": 4.0, "review": "This device is cheap, delivers great video and audio quality and it's really simple to use. The best is that it's improving everyday (i.e. Chrome Beta for Android now supports streaming of any video feed played in the browser). Still has some minor flaws, such as suddenly losing connection with the device and for some reason had to use my laptop to configure it (tried three times with my Android smartphone and was not successful).", "verified": true, "helpfulness": "0/0", "author": "Jose Guilherme Cabral Bonatto"}, {"rating": 3.0, "review": "I bought at least 7 of these for x-mas presents. Bought on for myself as well. I can use the NetFlicks but that is really the only thing we really use it for. Buy a TV that has the apps instead.", "verified": true, "helpfulness": "1/1", "author": "Steven Tracy"}, {"rating": 3.0, "review": "I tried setting this up on my desktop which doesn't have Wifi--fair enough.  I went to my laptop to set it up, but it doesn't support Linux.  I finally used my wife's computer with Windows to set it up using the downloadable app instead of the Web UI.  I have a Netgear 3700 wifi router that supports 2.4Ghz and 5Ghz.  Both are turned on with the same ssid and both have the same password.  Chromecast does not support 5Ghz, but when I configured it, it properly talked to the wifi signal from the laptop and I configured the correct parameters for it to talk to my wifi router.  It refused to talk to my wifi router.  I went through all the support posts including wifi opitons, client isolation, vpn and proxy settings, UPnP settings, IGMP, etc.  No luck.  My next step is to turn off the 5Ghz network altogether, run through the setup and hope it connects, and then turn the 5Ghz back on with a different password after it's configured.", "verified": true, "helpfulness": "1/1", "author": "Dr. Gregory A. Bolcer"}, {"rating": 2.0, "review": "Unless you travel a lot, I don't see the point of this. My Roku 3 loads much faster, has a friendly user interface, and free local content support. I sent the Chromecast back.", "verified": true, "helpfulness": "0/0", "author": "MLB"}]