[{"rating": 5.0, "review": "This device works so well, it lead me to watching more internet programming and less broadcast programming. I stopped subscribing to cable years ago because the value just wasn't there for me anymore. Using this to stream Netflix and Youtube. I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great! Very easy install. The Chromecast of Google is the perfect tool for the entertainment in home. Is small but strong. Very good price", "verified": true, "helpfulness": "0/0", "author": "Encel Sanchez"}, {"rating": 1.0, "review": "I really do not expect much from google but this device has no any sense. Many movies from youtube aren't available via it. And I think youtube is the main source for chromecast.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this to give us more options in what can be shown on our TV.  Have used it primarily for streaming Netflix or Youtube either from a laptop, android phone & android tablet.  It has worked great for everything that it is designed to do.  I am considering purchasing another for another tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Michael James Willett"}, {"rating": 4.0, "review": "It was simple to connect, following instructions online and connecting to wireless router.  Amazing product.  I use it all the time when I want to listen to music with great sound through my HDTV versus through my laptop speaker.", "verified": true, "helpfulness": "0/0", "author": "steve sanderson"}, {"rating": 1.0, "review": "Took a while to get the bearings on the installation. Its not as smooth as they claim it to be.For a start the basic clarification that the dongle must always be connected to USB power source is not mentioned. How lame?Netflix doesnt work.Went to below site to get fix - [...]none of said fixes work.honestly, the chromecast device is a big disappointment for me. It fails to live up to its promise. Netflix doesnt work and chromecasting of youtube and chrome browser based video sucks. I have a 75mbps/35mbps Fios connection.Instead of blaming netflix - which is the most widely distributed TV/device app, i think google folks should spend their creative minds' energy in problem solving this or work cooperatively with netflix folks.BIG LETDOWN!!!!", "verified": true, "helpfulness": "0/1", "author": "Sairaman Kalpathi"}, {"rating": 1.0, "review": "Bought this to stream netflix on my hdmi tv and my chrome book. I could not get it set up even using my chrome book even though it uses Google browser. Sent it back!", "verified": true, "helpfulness": "0/1", "author": "E. lydon"}, {"rating": 5.0, "review": "I mean where can you get a streaming tool and turn any tv into a smart tv?  Nowhere but this device.  I got one for my mother who has a non smart tv and it really fit the bill.  I also got one to just to take to parties.  It is awesome you just plug it in and people can load up the you tube que with music from their android devices.  totally cool", "verified": true, "helpfulness": "0/0", "author": "R. Tolliver \"The King Of The Real\""}, {"rating": 4.0, "review": "This device can stream good content.  It glitches to my big TV but I think that is a format issue.", "verified": true, "helpfulness": "0/0", "author": "Shaun M Boudreaux"}, {"rating": 5.0, "review": "Chromecast works even better than advertised. It's a GREAT addition to our entertainment system - easy to use and powerful.", "verified": true, "helpfulness": "0/0", "author": "Dana"}]