[{"rating": 3.0, "review": "I hooked this thing up today and have taken it for a test spin. Setup was quick and easy. Getting my browser to work with it took a little more fiddling, but that's just because I didn't want my work email associated with my youtube etc... nevermind. Anyway, Chromecast works basically as promised. It's sort of neat that I can pull up a youtube video on my phone or tablet or computer and get it playing on my big screen.It was apparent right away though that the image was cropped on my screen. I'm running a 1080p stream to a 1080p screen, and don't have this issue with my PS3, Xbox, Blu Ray player, or Boxee or Roku. I streamed my screen as well, and sure enough it wasn't a true representation of my laptop screen. Didn't matter what I streamed from either - I tried doing so from my phone, and the youtube video was cropped on all sides - looked zoomed in. I played around with my tv settings, and it didn't fix the issue. There's no settings to be found for fixing it either.Even zoomed in, it was a nice quick way to send youtube to my tv (even though I have other methods) - it's easily the fastest way considering the time it takes to fire up other devices. Hulu was also zoomed in, and the performance was choppy. I noticed I had to have the video playing in my laptop at the same time and I couldn't close the lid on my laptop. If I went full screen, Hulu would show full screen on my tv, but I couldn't do anything else with my laptop. The video on my laptop was not synced with the video on the screen. So if I want to watch hulu and do other stuff with my laptop, I have to watch it in the browser window which you can see on the tv screen rather than full screen. Full screen crops the video anyway though like I said, so there's really no good way to watch hulu I don't think. Unless I'm missing something.Netflix had the same issue as Hulu with the cropping and full screen. Youtube didn't have the full screen issue where I couldn't do anything else with my laptop... just the cropping.This is a decent little device for the price, but I probably won't use it for much besides youtube streaming. I'd say for what it costs, if you plan to only use it to stream Youtube, it's worth the money. Otherwise, save your hdmi port for something better. If I had a time machine, I would probably not buy it again since I don't really need it. In fact, I may relegate it to the bedroom tv that never really gets used. I'm going to hang on to it though to see if they release updates for it that make it better. So far, a pretty \"meh\" experience.", "verified": true, "helpfulness": "1/1", "author": "M. Armstrong \"Trigger\""}, {"rating": 1.0, "review": "Total crap! Nothing works. It is not synched with the audio. It is slow it buffers for ever . use an HDMI cable!", "verified": true, "helpfulness": "2/6", "author": "Giovanni Reggioli"}, {"rating": 2.0, "review": "Extremely disappointing. Google needs to give this product support before it is obsolete due to almost zero apps and almost zero compatibility with google products.", "verified": true, "helpfulness": "1/2", "author": "Jill Hoffman"}, {"rating": 5.0, "review": "I've had this for a few years now. Honestly, I have only been using it for Netflix. And not very often. My challenge has been the wires and components of the television, DVR, DVD, Blue tooth. What goes where has been pretty intimidating for me. Not so for the computerized set-up of things (I hope that makes sense).So, we've been using it to watch a popular Netflix series these days. I have my husband or son set up the wiring stuff. Then we watch. Well, today, my husband used it to watch videos from his computer. Something I so did not know how to do (he didn't either at the time). He figured it out.I had two \"Eureka\" discoveries with it today. First is that plugging the unit into the USB of the television so it is connected all of the time. The second, and I so celebrate my husband teaching me this, is to use it in conjunction with Google Chrome OS. Oh, it was so easy once I understood it! I had a ball streaming all kinds of videos /shows from my computer to the big screen!! It really is terrific.I've struggled for a long time because I prefer the big screen, but I didn't get that the computer (I'm telling you, the Google Chrome is the ticket) could stream on the television. And it really is simple! I don't want to watch stuff on my computer screen. I want the full monty, LOL!I KNOW I am going to use this a LOT more now that I better understand how to use it to my advantage. I think I'll be watching a lot less real television and more stuff via Chromecast. I may even get rid of cable (at $230/month). This is well worth the purchase!", "verified": true, "helpfulness": "0/0", "author": "RoZ \"rzagaja\""}, {"rating": 5.0, "review": "This product has great features and is comparable with the apple tv.  The price is definitely competitive at 35 dollars!", "verified": true, "helpfulness": "0/0", "author": "Gavin D Washington"}, {"rating": 5.0, "review": "Simple, cheap, effective, software works great. I have had it a few weeks and don't use it a lot, but I've watched three or four movies through it (through Netflix) and I've shown a few Youtube videos to my wife and kids and everything operated fine. My daughter spent part of her time out of school this week to do a marathon viewing of One Tree Hill and she reported it worked great for her as well.I do not use it beyond that and at this time, I don't plan to. I can report that I've had few if any issues at all. Sometimes it loads a little slower than I'd like but I can blame my ISP's spotty cable internet for that. Still, it's a tremendous bargain compared to Apple TV (and I have an iPad, an iPhone and I am writing this review on an iMac, so I am not an Apple hater). My daughter has a windows phone and couldn't find an app for it, though she does have an Android-based B&N; Nook HD+ that runs it just fine.EDIT: After several months, I've taken to watching HBO Go through it and it works well, too. Its memory of where you stopped watching is a little spottier than it is through Netflix, but shows play great through it. I am disappointed that Showtime doesn't offer support for it through an Apple app. I've read you can \"cast\" from your computer if you log into Showtime Anytime, but my computer stays on a desk in another room and I have no idea how to set this up and don't care to work to figure it out. Still keeping it at 5 stars because it's very good for what it is and the device can't be blamed for Showtime's lack of support.", "verified": true, "helpfulness": "1/1", "author": "jbrianb"}, {"rating": 4.0, "review": "Great device, hbo go just came to it, much cheaper than the Apple TV. I like how I can stream from the Chrome web browser. If you have Google Chrome open, all you need to do is press Ctrl + O, and you can open any file in the web browser.", "verified": true, "helpfulness": "0/0", "author": "mcmanuspop \"Bobby D\""}, {"rating": 5.0, "review": "Amazing device. Simple to use and, NO MORE CABLES. Clutter free has taken the next step in cable free technology.", "verified": true, "helpfulness": "0/0", "author": "Sean D Fox"}, {"rating": 3.0, "review": "I expected more for the device especially comparing it to Apple TV. Not sure it was Google's intent to challenge Apple but it has potential.", "verified": true, "helpfulness": "1/1", "author": "Paul"}, {"rating": 5.0, "review": "I love it! It allows me to watch what I want, when I want for about 10% of one month's cable bill.", "verified": true, "helpfulness": "0/0", "author": "ms s porter"}]