[{"rating": 5.0, "review": "It is a really nice companion to a tablet. being able to use my nexus 7 to find videos and send them straight to my tv is really awesome! I've noticed a few bugs mostly pertaining to the youtube app encountering errors when I try to send a video to the chromecast but has only happened a couple of times and I use this thing almost on a daily basis.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Just got this an hour ago. I am watching my stuff on tv right now.  So far it is working great and I am loving it.  This is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Joseph B."}, {"rating": 4.0, "review": "I think this is a great thing. It was very easy to set up. At first it wasn't working but then realized I had not pushed it in all the way. My onLY gripe is that you can't use it for Amazon Instant Videos but I assume that is not Google's fault. I read that you could watch Amazon Videos by casting from the Chrome browser and tried it but it was not very good - and you can't do that from an iPhone so what's the point. If I have to use my laptop I might as well just connect it directly to the tv and get a better image. For Netflix it's great. It also works great with  YouTube, the PBS app and a bunch of others. I like how well and easily it works with my iPhone and iPad.", "verified": false, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "An incredibly versatile device for getting media easily to your TV, especially if you like Android.Can't wait to see what the next iteration of the device will be like!", "verified": true, "helpfulness": "0/0", "author": "Aum Shantih"}, {"rating": 4.0, "review": "I had read online about the Chromecast, and decided to give it a try. I own a android phone (Samsung Galaxy Note II), so bought it when the price was $25-$30. I am a college student, so got some sort of discount don't remember how much but was a good deal!*First Review after owning the device a few months*First thing i did was check to see if it was rootable(mine wasn't), I really wanted to be able to send local media to my Chromecast which wasn't possible early on without root. So, after finding out my Chromecast couldn't be rooted i went ahead and plugged it in. Set up was easy and painless, just asks you if you see the code on your screen and then you enter your WIFI password. Only useful apps when i got it (for me anyways) was google music and netflix. Both worked great! Now there are many great apps that I use with my Chromecast; localcast, allcast, web video caster, and much more!*Only reason i don't give it 5 stars*It seems that the Chromecast can set up its own WIFI hotspot (when you set it up it does this), I would like to be able to send local media directly to my Chromecast without going through my router and bogging it down (I own a older router, maybe with a newer higher quality router it would work better). Another benefit to this would be less lag when sending local file, since most of the time you would be right there in front of your TV to view the content.", "verified": true, "helpfulness": "0/0", "author": "A YOU \"garrettwc\""}, {"rating": 5.0, "review": "So far, I'm very happy with this, but I haven't used it a lot. After I have, I'll update this review.", "verified": true, "helpfulness": "0/0", "author": "gizzy"}, {"rating": 5.0, "review": "Can't go wrong with Google. Simplicity, quality, and works right out the box. One thing that was a treat and I believe you Magnavox Tv lovers will enjoy. If you download netflix app on your phone and chrome cast a movie from your phone. It automatically switches to the correct HDMI port on the Tv and launches without any intervention of a remote. My other TVs I have to change the input source by using the remote.", "verified": true, "helpfulness": "0/0", "author": "KENNY D"}, {"rating": 1.0, "review": "what a disappointment! if one can't cast their own stuff from their phone, it's useless. Aps such as netflix have to be on your phone to cast to the tv. I already have stuff for this.", "verified": true, "helpfulness": "1/4", "author": "tracy hannah"}, {"rating": 5.0, "review": "Love my chrome cast!!!!! The low price is definitely the biggest plus. I was already a heavy pled user and now that i have a this it made it even better I can watch all my videos and movies on any tv in the house since they all have a chromecast now, the kids love it and I have no complaints for this thing just gets better over time. Hbo go works like a pro and netflix too, every tv even the simplest ones are now smart tvs with endless entertainment!", "verified": true, "helpfulness": "0/0", "author": "Se7en"}, {"rating": 5.0, "review": "Amazed at how much capability fits into this little unit.  Easy to set up and works as advertised. Found it fully compatible with my SamSung tablet", "verified": true, "helpfulness": "0/0", "author": "Scott R"}]