[{"rating": 5.0, "review": "great product, thanks!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "luis solorzano"}, {"rating": 5.0, "review": "I am so happy we can now \"cast screen.\"  It works great!!!", "verified": true, "helpfulness": "0/0", "author": "janet"}, {"rating": 5.0, "review": "Excellent. I am using chromecast everyday. Easy to use and setup completed in 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Edamito Pelex"}, {"rating": 5.0, "review": "i have 2 roku's i needed something smaller for my bedroom i got say i am very impressed works great", "verified": true, "helpfulness": "0/0", "author": "alison"}, {"rating": 5.0, "review": "A fantastic device, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Grant"}, {"rating": 5.0, "review": "Streaming Media Player worked great. I am very interested in streaming and wireless components. I followed the instructions on how to set up my computer, IPhone and Tablet with no issues. I suggest anyone who purchase this item to be patient and take their time.", "verified": true, "helpfulness": "0/0", "author": "Captain"}, {"rating": 5.0, "review": "1. Relatively inexpensive ($35) compared to other options (Roku, Apple TV,...)2. Easy to setup (takes only 5 min)3. Can control using multiple devices (smartphone, PC, tablet) on multiple platforms (iOS, Android, Windows)4. Can stream anything on the Chrome browser (duplicating what's on screen)5. Can cue up multiple play items6. Doesn't consume battery on the smartphone (initiate streaming and move on to do other things or even put the phone in suspension mode7. 3rd party apps will continue to make this device more useful and will eventually allow streaming of anything on the PC or phone to the TV8. Tiny footprint that can easily hide away in the back of TV (if the TV has a USB port, then the device can be powered by a USB cable without a power supply connected to the wall outlet)9. Can connect it to an audio device/receiver and stream Spotify or Pandora continuously without turning on the TV- this is a very good feature!10. No additional service fee or subscription fee other than services that you choose to pay for (such as Netflix or Google Play)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Totally worth it! It works really good!", "verified": true, "helpfulness": "0/0", "author": "Andre Teodoro"}, {"rating": 5.0, "review": "I completely love my Chromecast!  It is easy to install, very user friendly and gives me the freedom to watch so many different shows/movies, etc.  I use it daily!", "verified": true, "helpfulness": "0/0", "author": "Catherine A. Mounts \"cathyM\""}]