[{"rating": 2.0, "review": "I am unsure if it is my wifi, my apps or just the device - but a hard reset by unplugging it (even w/ latest firmware) still has to take place from time to time, otherwise it does what it says. Unfortunately, Google also got me for a $11/month Play subscription, so - after 2-3 months, I am really out $35 + 11 + 11 + 11, which as you can see, adds up quickly. Add Netflix and you start to see why it is hard to take people away from cable high prices they are already paying and getting news (CNN/FOX/FBN/CNBC,etc).", "verified": true, "helpfulness": "0/0", "author": "commops7"}, {"rating": 5.0, "review": "Quality product- we put this in a guest bedroom and everyone loves it. They control it from the app on their iPads. Thx!", "verified": true, "helpfulness": "0/0", "author": "BBSTR"}, {"rating": 5.0, "review": "Seamless interaction with Netflix and YouTube.  Phone is a remote for Netflix.  Forget my opinion; my wife likes it.  Enough said.", "verified": true, "helpfulness": "0/0", "author": "rgest"}, {"rating": 5.0, "review": "This was a Christmas present to my son.He says he is very pleased with it & uses it often.", "verified": true, "helpfulness": "0/0", "author": "James Peters"}, {"rating": 2.0, "review": "I was under the impression that if you can watch it from chrome browser you could watch it on your HDtv through the chromecast.  This would be true if it wasn't for the necessary software player requirements on your nexus.  Apparently some videos require the use of a secondary video player software to be played.  This secondary software is no longer available for use on the nexus (yes it used to be available).  It is essentially a software hardware battle between companies.  Open source software really does shine when you encounter this type of chest bumping between the big corporations.Aside from the above....  The connectivity with the chromecast and the nexus seems very poor.  Sometimes it works and sometimes it does not.  I find it MUCH more simple to use my HDtv's web based apps to play what I want rather than using the Chromecast.  I have left the Chromecast in the TV's port but unplugged it.  I don't even use it.I will probably take it along when I go on a trip so it could be used in a  hotel or something.  Hope it works then.The good news is it wasn't that expensive.  So not  a big loss.", "verified": true, "helpfulness": "0/0", "author": "Allen Matthews"}, {"rating": 4.0, "review": "Unit works well.  Had set up difficulties (due to MAC address authentication) however Google was able to help me resolve the issue, but took over 30 minutes.There is a huge delay with some of the streaming.Otherwise is pretty neat.", "verified": true, "helpfulness": "0/0", "author": "Robert59"}, {"rating": 5.0, "review": "Just got these hooked up. Did not have a smart TV in the bedroom, so I was unable to get Netflix, but with this I can send it from my phone to the bedroom TV.....cool little item !!!", "verified": true, "helpfulness": "0/0", "author": "DON"}, {"rating": 3.0, "review": "It works great with Youtube and the \"supported\" channels. It was my mistake for not better understanding the product ahead of time. I bought it thinking it would work with amazon prime. Otherwise I'd have given it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Scott Miller"}, {"rating": 3.0, "review": "I haven't had time to really try it out.  It was very easy to connect to my TV.  I hope I can watch more program at a later date", "verified": true, "helpfulness": "0/1", "author": "StellaDora"}, {"rating": 3.0, "review": "Easy set-up even for a tech dummy like me. Easy to do the you-tube app and the Amazon Prime IV's . Also had no problem showing the videos on my ipad on the tv screen. The downside. to me anyway. is that Netflix, hulu, MLB and most other apps are prescription accounts. If you're into those and the price suits you. It's a great deal @ $35.", "verified": true, "helpfulness": "0/0", "author": "Wayne Hoffman \"Biggie\""}]