[{"rating": 5.0, "review": "Just writing a quick note to say that the Chromecast works very well with the Spotify Web Player. I use my Xbox 360 for most of my web streaming (Netflix, Hulu), but had no way to play Google Music or Spotify wirelessly through my sound system. Casting the web player tab in a browser works flawlessly - no stutter, great audio quality. Also, setup was incredibly easy. I do hope Spotify integrates native functionality into their app, but for now, casting the tab is a great solution.", "verified": true, "helpfulness": "1/2", "author": "Benedict"}, {"rating": 4.0, "review": "Chromecast is what I call Poor Mans AppleTV. With no Remote or UI, no extra equipment to fit you already cluttered TV station, for only $35 its definitely a product to have.Setup was a Jiff, super easy as long as you have laptop or android device. It currently doesn't support Iphone/ipad setup. I've 2 TVs both 2010 models and both needed external power for this dongle as HDMI prot is not good enough. Luckily they both have an extra USB port on the TV itself so I didn't had to figure how to get power source to it.Once plugged in and setup, get the latest Netflix app update and youtube update and latest chrome for you ipad and you are all set. Easy to use that my 3 year old kid can operate.The video quality is not that great as there is no video rendering capability like AppleTv does. Sometimes I saw lag in the video and it takes a while(few seconds but noticeable delay) for action you performed on your Ipad to show up on the TV.I like the device. It's not perfect but for the price I'm not complaining, plus I was one of the early ones to order so got my 3 months of Netflix free as well, but even without that, it's a sweet deal.One more thing, I want to Thank Amazon. A friend of mine ordered on Google Store 30 minutes before I did on  Amazon on Wednesday. I got mine delivered with no extra cost (of course Prime member) on Friday. He payed $5 extra for shipping, and he got notified that his will be delivered on 2nd week of August. Amazon Rocks!I see many application for it, best for travel. Plug it to you hotel TV and you don't have to suffer the crappy programming they have. Use it on the extra tv that you have and not pay for the additional set top box like I currently do with Comcast.Google Chromecast HDMI Streaming Media Player", "verified": true, "helpfulness": "0/0", "author": "goldy"}, {"rating": 5.0, "review": "I ordered this Chromecast the day it came out and it has worked beautifully for the week I have had it. The Netflix and Youtube integraation is awesome and my family loves using eachof their phones to add youtube videos to the queue whioch then play directly on the chromecast.", "verified": false, "helpfulness": "1/2", "author": "Aravind Reddy"}, {"rating": 5.0, "review": "As more and more apps support chromecast on mobile devices, this product will only get better. So far, I have not had any probloems with it and plan on getting more for all of mt tv's. Highly recommend this product.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Setup was a breeze. I took the Chromecast out of the box with the included USB cable, plugged it into the side HDMI port on my TV, plugged the USB into the port right next to it. A few moments later I had downloaded the Chromecast app from the Google play store, it had me select the wireless network to use and then I was good to go.I've tried all of the available apps that work with Chromecast thus far (Netflix, YouTube, Google Play Music & Movies), and they all work without a hitch. You just click the little icon in the upper right of each app, it connects and either waits for you to select something, or starts playing what you already have selected. I was especially excited that my 6k+ songs stored in Google Music stream perfectly as well.The part that made me most excited about all this is you don't need to start or stop apps like you have to with most SmartTVs, you just hop on a phone or tablet, select what you want, and off you go watching/listening to stuff on your TV. Even better is it will actually turn your TV on for you if you have HDMI CEC enabled which is quite handy.Having used the Chromecast for the past couple of days, I can say this was one of the best purchases I've made in a while and I would recommend this to anyone who extensively uses Google services especially, as it will not disappoint.", "verified": true, "helpfulness": "1/2", "author": "Joseph Young \"Tech Connoisseur\""}, {"rating": 5.0, "review": "HelloI ordered this on 24th and received it on 30th. Setup was simple no major issues, I was looking for MAC address on the product but it is not listed there. Following are the steps I took for setups.* Install Chrome Cast app on my smartphone.* Plug in included power supply on chrome cast and plug device into HDMI port.* Switch input on TV* Open Chrome Cast app on phone, press setup.* Named device (not requirement)* Added Chromecast to my network, this is where I found MAC address it was listed at the end.* Chromacast connected to my network, setup complete.After using the product for about an hour, my opinion is that this is great product. But currently it is in early stage so there are not many services available for native supportNetflix and YouTube works perfectly no problems at all. When casting through PC via chrome browser works well also, but with little lag. As long as casting is done using supported services using PC, or mobile device it works very well.Currently when casting using chrome browser, you see the tab that you are casting but for me that is useless because if I am watching streaming video on any site except youtube, you see the tab and video in small screen but as soon as you make the video full screen casting video is not visible only audio.I also tried casting desktop (experimental) and you will be able to see video full screen, but these option is basically mirroring and audio will come through PC speakers, instead of TV.Bottom line as long as this device is used for currently supported services(Netflix, youtube) it works perfectly well. For me this was more of impulse purchase specially due to cost. If you have Smart TV, Apple TV, PS3, Xbox or any other web enabled media player there is no need to purchase this, since all these device already have Netflix and YouTube built in.It might be useful in future as soon more service are natively supported.Sorry for any grammar error.Thank you", "verified": true, "helpfulness": "5/7", "author": "HelloAmazon"}, {"rating": 5.0, "review": "I have had this for only one day but I love it already.SET UPIn a word, easy. I had it setup in about 15 minutes from out of the box to watching YouTube on my TV. (I had an existing wifi network)PerformanceI saw only minimal lag from the time of sending video to my TV and it showing up, after that I had no issues with stuttering or jerky video. I have about a 3 mb/s internet connection and a 42\" TV and the quality was quite good.ApplicationsI would like to see more support for Chrome on Android, as of now you can only share a chrome browser tab if you are on a computer, not the tablet or phone as I understand it. I assume this is coming in the future along with other great apps, but for now Netflix, YouTube, Google Music and Movies and anything you can find on Chrome is enough to make me happy with this purchase.Price - You can't beat it.I am thinking about getting another one as well as buying one for the parents.", "verified": false, "helpfulness": "1/2", "author": "Travis"}, {"rating": 4.0, "review": "I have been using the wii console for netflix but the control is tricky.  So I bought the chromecast immediately after reading about it being available.  It does what it's supposed to.  I did have to do some of the steps in the set up twice, probably due to speed of the wifi connection, I'm not sure.  I was using an \"unsupoorted\" macbook, but it worked fine.  I took one star off because it seems to only work for a limited set of apps, and can only run off of chrome.", "verified": true, "helpfulness": "1/1", "author": "Q. Shang"}, {"rating": 1.0, "review": "A friend just got this from Amazon and invited me over to check it out.  We were so excited and were planning on buying a few of these since the price is just right. We quickly realized this is too good to be true:We tried Netflix and was not able to watch anything. The picture was very choppy with out of sync audio.  It kept on buffering and we could only watch 2 to 3 mins at a time before buffering again.  He has the Roku and AppleTV on WIFI there and both work flawlessly with HD quality pictures.  We then rebooted his WIFI, hoping that it may help but the Chromecast kept on buffering.  We then tried youtube and it was worst.He got a replacement yesterday from Amazon and it didn't help. Save your $35 dollars and buy a Roku and AppleTV.  This is really a worst streaming device on the market and I don't understand why lots of folks gave it great reviews.", "verified": false, "helpfulness": "9/62", "author": "HLN"}, {"rating": 4.0, "review": "Great capabilities. Very easy to unstall and use.My Samsung Galaxy S2 could drive my 55\" TV from more than 50 feet away.  But anyone with chrome cast  can take the TV over.  It's like someone else having a second remote for your TV and changing the channel without your approval.  If it had a password protected login, it would be perfect.", "verified": false, "helpfulness": "3/7", "author": "Bruce S. Johnson"}]