[{"rating": 2.0, "review": "I love Amazon but unfortunately I couldn't bring myself to see any real value to this product. This is your standard streaming box that has been out for a long time now (like Roku) and their best selling point (voice search that actually works) only works with Amazon video and nothing else. Otherwise, this thing does everything my PS3 already does for me. For these reasons I returned the fire tv. My suggestion is that there are cheaper boxes out there that do the same thing if you really need one.", "verified": true, "helpfulness": "0/0", "author": "litta015"}, {"rating": 4.0, "review": "I would give five stars if prime would allow free viewing of new releases.", "verified": true, "helpfulness": "1/3", "author": "T. vanburen"}, {"rating": 5.0, "review": "I'm impressed with the easy installation and setup.  I'm even more impressed with the search functions, content availability, quality of video and especially the price! I've checked Roku and Chromecast, but based on reviews it seems the Amazon Fire TV is the best.", "verified": true, "helpfulness": "1/1", "author": "vic"}, {"rating": 5.0, "review": "Just as good or better than Roku.... AND you can talk to it!", "verified": true, "helpfulness": "1/1", "author": "Loren Shirk"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "1/1", "author": "Harold Fields"}, {"rating": 5.0, "review": "Great device.  Love the voice search!", "verified": true, "helpfulness": "1/1", "author": "Shelley"}, {"rating": 5.0, "review": "Love it!  Great free shows/movies to watch and very easy to order ones from the list.  Super easy remote and the easiest set up ever.  My wifi doesn't have the strongest signal for the location I have the Fire TV set up in, I haven't hard wired it yet - but it is an option.", "verified": true, "helpfulness": "0/0", "author": "N. Sjulin"}, {"rating": 4.0, "review": "This device is great. Its sleek, fast and easy to set up. Took less than 5mins to set up. Voice search is amazingly fast. If you have an Amazon Prime account, this is definately a must own product. Great Job Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "G. Woods \"Rizz\""}, {"rating": 4.0, "review": "keeps our famiy entertane", "verified": true, "helpfulness": "0/0", "author": "dlc"}, {"rating": 5.0, "review": "Keep adding more apps :)  We would like to have the Mormon Channel and streaming news.", "verified": true, "helpfulness": "0/0", "author": "???"}]