[{"rating": 4.0, "review": "It's not bad thought there might be more free content in the internet that one could view not so much", "verified": true, "helpfulness": "0/0", "author": "Mike Mullett"}, {"rating": 5.0, "review": "I have had this for awhile and I am still enjoying it immensely. In my attempt to save money, I opted not to get cable and sign up for HuluPlus in addition to my Netflix subscription. Since I don't own a computer, I was watching all of my shows on my tablet; enter Google Chromecast. All of my Netflix movies and show, without the sore elbows (from being propped up in bed)=Priceless. The set up was very quick, and I was casting before I knew it. Though I love it, the only flaw I have encountered is that sometimes shows will say \"loading\" and never load. When that happens, I unplug the Chromecast from my TV and let it rest. I plug it in later and I am good to go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Queen of Bookdom\""}, {"rating": 5.0, "review": "Great Device! plenty of apps that connect to it and videos can still be streamed from the Chrome browser off any site if an app isn't available.", "verified": true, "helpfulness": "0/0", "author": "Awlstar"}, {"rating": 5.0, "review": "I finally got a friend in the States to forward me a Chromecast, as I'm in a country not supported yet.I've been looking forward to getting it to see how well it would work as a Techno-junkie!Really happy with it, and as more services support it, I hope it only gets better.We even took it on a trip recently and used in a couple of hotels using an iPhone as the WiFi hotspot!!", "verified": true, "helpfulness": "0/0", "author": "Gus Ferguson"}, {"rating": 3.0, "review": "install wasn't easy and took sometime to hook it up - i expect it to go fasteroverall usage is quite limited to YouTube and Netflix so broadcast other TV apps is the next thing i am looking forwould recommend only after warning of what not to expectbut yes would buy it again", "verified": true, "helpfulness": "0/0", "author": "Yair \"Yair\""}, {"rating": 3.0, "review": "But it is a bit difficult to use and the video sites are limited.  However it dose work and the price is right.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "it does stream certain apps on you laptop or smart phone to tv's.but would be hard for a kid or your average person to operate.had a few issues trying to sync it with my cell.laptop would not sync up.in order to stream,you have to power up the key,swith to your hdmi source,turn on the chromecast app on your phone,run your movie app such as plex,youtube,ect,then click on the chromecast icon to send to your tv.takes so long just to watch a damn move.waste of money,should have bought a roku instead.SAVE YOUR MONEY", "verified": true, "helpfulness": "1/1", "author": "tim"}, {"rating": 1.0, "review": "I bought this about two months ago and since i didn't have enough time to test it, i just found out that i made a mistake!basically you have to have your cellphone or laptop charged and handy to be able to use this and the device has a lot of time out errors, from time to time you have to disconnect and connect the device since the device can not connect to the wireless and guess what? there is no remote or reset button!! i wanted to return this but Amazon does not accept since it has been more than a month!I don't recommend this.", "verified": true, "helpfulness": "1/1", "author": "Am"}, {"rating": 5.0, "review": "We got one of these players as a gift and they're great. We even got one for my father (early 60s) and he and my mom are hooked. Also, a great alternative for those unwilling to pay for cable tv (cord cutters?).", "verified": true, "helpfulness": "0/0", "author": "Romina"}, {"rating": 5.0, "review": "I found myself using my android phone a lot, so i figured why not get a chromecast. Best decision of my life. It is a great size, and very affordable.", "verified": false, "helpfulness": "0/0", "author": "Josue"}]