[{"rating": 5.0, "review": "For $35 there is no way that anyone could go wrong going with the chromecast to help satisfy basic streaming requirements (Netflix, Youtube, HBO go, Music, etc.). The best thing is Google opened up the SDK so there will be a flood of new apps added to the ecosystem over the next few years. In the near future it will probably be able to send almost anything from your phone to your big screen for nearly nothing.", "verified": true, "helpfulness": "1/1", "author": "Tyson Quick"}, {"rating": 2.0, "review": "Hey google how about you charge $100 for a product that works rather than $30 for a piece of s***e", "verified": true, "helpfulness": "0/3", "author": "Garrett Quinn"}, {"rating": 5.0, "review": "It was just ok to set up, I would have gotten one for my mother except that it got disconected to my husband phone and I know she do not have the patience to set it up every time that happens.  In my case I cut my cable and my bedroom tv was just collecting dust, now I can view my shows with Hulu Plus just the next day.  I specially like that I can see some videos on you tube and my husband can also see some, we always listen music on you tube and whoever is on the computer gets to look for whatever the other one wants, now we can each pick videos and play them on the tv.  I wish it was a little simpler to set up, although for $35 what am I complaining about.  Happy Customer", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this chromecast, so easy to use and setup. I bought this for my mother so she could alleviate her dependence on the blood sucking cable companies. This thing seamless operates with her iphone and ipad. Works great with multiple apps and have had zero issues so far, bought two of them!", "verified": true, "helpfulness": "0/0", "author": "Samantha Greenberg"}, {"rating": 5.0, "review": "I love this...I use it to watch Netflix in my bedroom, and am very pleased.  I have not tried to cast from my phone yet, just my netbook.", "verified": true, "helpfulness": "0/0", "author": "Helen Mayer"}, {"rating": 4.0, "review": "I really enjoy the Chromecast and how widely I can use it for Youtube, Netflix, etc. I just wish it had come with a little instruction booklet, and a phone number to contact customer service, instead of having to do it all online.I get it-- this is a piece of technology geared towards younger people like myself. But I also bought this as a gift for my parents who are in their early 50s and do quite well with technology. However, I can just imagine them being baffled as to whom they should call in case something goes haywire (the way it did with mine).Customer service was very prompt with assisting me in troubleshooting the problem (pink screen problem) and we were able to reset it to get it working again.A note of improvement** It would also be nice if this would some day allow one to cast the entire computer screen, regardless of a browser being used.", "verified": true, "helpfulness": "0/0", "author": "Matthew O."}, {"rating": 5.0, "review": "Our family is really enjoying the ability to stream shows from any of our computers or phones to this device.  Very easy to set up, very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Rick B"}, {"rating": 5.0, "review": "Is the best streaming device I ever bought. It has a excellent wireless reception, very portable, It seems a USB drive,  100% recommended.I hope Google unlocks new contents soon.", "verified": true, "helpfulness": "0/0", "author": "Victor Jose Cala"}, {"rating": 5.0, "review": "This is the greatest invention since the last greatest invention.  It does what it says.  Syncs up to your computer and then every program you want to watch on your computer, a little box gives you the option of playing it on your TV.  I particularly like that I can watch You Tube movies.  There is such a variety and this is the only reliable way I have found to watch.  Many TVs offer You Tube as a WIfi option but they usually break up, stop etc.  I never had this problem with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "L. Fortunato \"Avid Reader\""}, {"rating": 2.0, "review": "I try to use it to transfer programs from my computer to the smart tv, however the quality is poor, to slow.", "verified": true, "helpfulness": "2/3", "author": "Elizabeth Montalvo"}]