[{"rating": 5.0, "review": "It's awesome and cheap. Get it. Really....it makes life easier without all the wires and boxes.", "verified": true, "helpfulness": "0/0", "author": "rosshawk"}, {"rating": 5.0, "review": "With this handy dongle, I never have to watch television again. I just download the apps onto my iPhone and then stream through the Chromecast. It's also very easy to connect the Chromecast to my laptop through Google Chrome, although the buffer time seems to be a tad longer when I use Google Chrome as opposed to the apps on my phone.", "verified": true, "helpfulness": "0/0", "author": "Tarantallegra"}, {"rating": 3.0, "review": "Beginning to drop a lot lately.", "verified": true, "helpfulness": "0/0", "author": "Mellow"}, {"rating": 5.0, "review": "You can take my kids and my wife, but please don't take away my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "SailorBoy"}, {"rating": 5.0, "review": "Love this Chromecast, I can cast my computer and phone to my TV, with no problems and more apps are being added for use with the chromecast over time", "verified": true, "helpfulness": "0/0", "author": "B.N."}, {"rating": 3.0, "review": "This is my second chromecast. First one died after 3 days", "verified": true, "helpfulness": "0/1", "author": "Francisco Leon"}, {"rating": 3.0, "review": "Decided to stop working on me and when I talked to google they said it was a Netflix problem. Called Netflix and they said it was a Google problem. It would not connect to my internet no matter what I did. Returned it for a new one but never use it now that I have a smart blue ray player. It's nice to stream YouTube or Netflix.", "verified": true, "helpfulness": "0/1", "author": "Brice W."}, {"rating": 1.0, "review": "had this for about 6 to 7 months all of a sudden stopped working don't know how to get ahold of anybody to replace it I called Google there trying to see what they can do it would be nice if the buyer or seller sorry could get a hold of me to replace it.if so will raise my reading 25 starif so will raise my reading 25 star", "verified": true, "helpfulness": "0/2", "author": "Derek"}, {"rating": 4.0, "review": "Movies all day with this, I'm loving it!!", "verified": true, "helpfulness": "0/0", "author": "Ana"}, {"rating": 5.0, "review": "This device has opened up so many possibilities for us.  It was easy to set up and very easy to use.  Love the ability to stream Netflix and other sites to our TV... but honestly... I could sit and watch the beautiful photos and works of art on Chrome for hours.", "verified": true, "helpfulness": "0/0", "author": "brenda gregory"}]