[{"rating": 5.0, "review": "Really enjoy the Fire TV.  Can watch Prime Movies anytime we want.  Would make a nice family gift.", "verified": true, "helpfulness": "0/0", "author": "Crafty"}, {"rating": 5.0, "review": "Sideload XBMC and your mediacenter is complete. The FireTV rocks it like a champ. AND with Amazon's prime selection of movies and shows, heck, even a nerd like me barely NEEDS the XBMC!!! The interface is sleek, functional and the remote is pretty sexy too! TOP MARKS for this piece of hardware!!!-Mario", "verified": true, "helpfulness": "0/0", "author": "Booticus \"Mario Roberti\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Leroy E Sizemore"}, {"rating": 5.0, "review": "Excellent gadget....!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jorge Quiñonez"}, {"rating": 5.0, "review": "I reduced the channels I was paying for, canceled Netflix.  Lots of variety on this especially if you have Amazon Prime.  Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Any ideas on how this could interface with the introduction of the Fire TV stick?Or would that just be redundant in the same residence? But have the ability to have the same applications on other TVs/PC's/Tablets ...Thoughts?", "verified": true, "helpfulness": "0/1", "author": "AFIREINSIDE"}, {"rating": 5.0, "review": "i m glad i got rid of cable tv.", "verified": true, "helpfulness": "0/1", "author": "Andy Peng \"ank444\""}, {"rating": 4.0, "review": "It is a good device, fast connection with TV, easy to operate. However sometimes the screen goes black without explanation and one needs to start the show again from the beginning. Happened 3 or 4 times in two weeks", "verified": true, "helpfulness": "0/0", "author": "Mr. Peebles \"Camaleon\""}, {"rating": 5.0, "review": "Easy install. I unplugged all my chrome cast. Don't get me wrong, Chrome Cast is good. Amazon Fire TV, however, is wonderful.Although I don't use it often, it handles almost all my online memberships.", "verified": true, "helpfulness": "0/0", "author": "Roger Carlsen \"Rogie Boy\""}, {"rating": 2.0, "review": "I really wish the FireTV Stick was rolled out at the same time.  I imagine I would've saved myself a considerable amount for roughly the same thing.  WiFi instead of hard-wired is about the only drawback I see, but for Prime members, like myself, I could pre-order this item for $19.  I went back and forth before I purchased the Fire TV in August during a promotional price of $84.  Disappointed in Amazon (or maybe myself) for not holding out more for the Stick version at 25% of the cost.", "verified": true, "helpfulness": "1/1", "author": "Andrew"}]