[{"rating": 5.0, "review": "One can use it as wireless HDMI connection with Chrome or use it with android apps. Not many choices with useful apps, but hopefully that will change.", "verified": true, "helpfulness": "0/0", "author": "sivab"}, {"rating": 1.0, "review": "I had high expectations to use this with my Samsung Galaxy S3 as I already had purchased the Samsung AllShareCast Dongle for one of my TVs,  Which was almost double the price at the time I purchased it..There is no way to screen Share like the Samsung AllShareCast Dongle can do very easily.My friend also purchased the Chromecast and can't get it to work with his brand new Google Chrome Tablet purchased their own products don;t work together.If you have Samsung phones or tablets use the Samsung AllShareCast Dongle the price has dropped $55 or less.The Samsung is simple to install and will share your screen for any program not a selected few apps", "verified": false, "helpfulness": "0/0", "author": "Wayne F"}, {"rating": 5.0, "review": "Great so far. Waiting for more upgrades.", "verified": true, "helpfulness": "0/0", "author": "Irwin G. Liwag"}, {"rating": 5.0, "review": "Does exactly what it's supposed to do. Wish it drew power from the TV instead of needing a plug, but works great with my iphone and ipad.", "verified": true, "helpfulness": "0/0", "author": "Marisa"}, {"rating": 2.0, "review": "I purchased Chromecast with the premis that I could cast (stream) any web tab to my TV. **WRONG!** I wanted to cast Hulu (regular) to my TV but guess what...Chromecast does not cast Hulu. Chromecast advertises that it will cast any web tab within Chrome to your tv...not correct. It will cast HuluPlus but not regular Hulu. Sure, it casts YouTube, Netflix, Crackle, etc but I already have those through Roku. So, Chromecast really does me no good.", "verified": false, "helpfulness": "0/0", "author": "scottm1168"}, {"rating": 5.0, "review": "nice", "verified": false, "helpfulness": "0/1", "author": "valter"}, {"rating": 5.0, "review": "Easy to set up and use. This product seems to work best with Netflix and Youtube.", "verified": true, "helpfulness": "0/0", "author": "Lesa P"}, {"rating": 4.0, "review": "Work fine, the PC full screen casting is not só good.. There is a delay that do nota allow to ser videos.. But the overal is really good", "verified": true, "helpfulness": "0/0", "author": "Leandro moraes rizzo"}, {"rating": 2.0, "review": "did not do what I thought it would, no different that my roku", "verified": true, "helpfulness": "0/0", "author": "Gary L. Ebert"}, {"rating": 5.0, "review": "excellent, has solved a need for my personal use in", "verified": true, "helpfulness": "0/0", "author": "Romel Ant Rodriguez"}]