[{"rating": 5.0, "review": "I love this thing!  I have this, the FireStick, and and 3rd Gen Apple TV.  I actually have this connected to a Vizio \"Smart TV\" that I have found isn't so smart.  Netflix is better, Prime is better, etc...  I bought this with the deep discount signing up for SlingTV.  I thought, I wouldn't renew on Sling, but I will.  A lot of my fav channels are there.  Also, it has a USB port, so you can watch things with the VLC app that you can't do on the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "DnAustin"}, {"rating": 5.0, "review": "This is a great :  easy to navigate only thing is needs to be more freedom to get apps", "verified": true, "helpfulness": "0/0", "author": "GARY V. BRITT"}, {"rating": 4.0, "review": "I like the design as well as the hardware. Mainly using it for xbmc /kodi and it works well for that. I just wish Amazon would not have blocked root access on firmware updates. This box has a ton of potential uses and sales would sky rocket if they re-enabled root.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Well this thing is the bomb! This box is a legitimate alternative to cable, already comes with Netflix and other apps installed and extremely easy to install new apps, there are other streaming tv apps that you can download for free that are pretty good too (pluto tv), I read some people have even side loaded Kodi onto the box.  All in all, worth the price, haven't had any issues with it, the remote works well, compared to the fire stick, the box definitely is a step up with faster navigation in the OS and also better wifi connection I think too (faster streams), if you're thinking about a box to run Netflix, small party games and/or other streaming video apps, this is a great option!NOTE: If you are specifically getting a box to run Kodi, I think there may be better options out there (MX III box, Beelink..etc)", "verified": true, "helpfulness": "0/0", "author": "A. M. Green"}, {"rating": 5.0, "review": "Got this for my daughter. She and the grandkids love it!", "verified": true, "helpfulness": "0/0", "author": "Steven G. Cleveland \"stevecleveland\""}, {"rating": 4.0, "review": "I really like Amazon prime so far I've had a few disappointments but overall it's been pretty cool two day shipping is really great Iwas surprise to see that some of the older movies had a extra charge .", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 4.0, "review": "Just what was needed to provide choice s", "verified": true, "helpfulness": "0/0", "author": "Robert g grady jr"}, {"rating": 4.0, "review": "All and all, the Amazon Fire TV is a great product however, there are some issues that still need to be worked out.As for the positives:- The wifi works very well and is able to maintain a strong signal allowing for a smooth, sharp picture quality.- The remote control is super easy to use and it feels nice to the touch.  Also, the remote is not a line of sight remote control so you can use it  from anywhere in the room and because of the simplicity of the controls, you don't even have to looks at the remote to use it.- The layout of the App screen is fantastic and again, user friendly.- The voice search works well.- Lastly, the small size of the device is incredible. Really amazing to think that you can get so much entertainment from such a small little box.Now for some of the improvements that are needed:- From time to time, in my case this has happened about 4 times in the past year, my Fire TV has had to be completely re-set because the apps stopped working. This is a bummer because you have to reinstall all of the apps again and re-sign in to all of the apps, Netflix, Hulu, etc.- A certain number of the videos that I have purchased, can no longer be accessed by my Fire TV box?!  I can access them online but, it's as if those titles do not exist when I search for them on my Fire TV.  I must admit, I haven't called Amazon for support on those issues but, try to find a phone number for Amazon!  That's a whole other issue, in and of itself.- Doesn't support 4K streaming yet.", "verified": true, "helpfulness": "0/0", "author": "Jim Carrillo"}, {"rating": 5.0, "review": "=)", "verified": true, "helpfulness": "0/0", "author": "Judith Potter"}, {"rating": 5.0, "review": "Works for me", "verified": true, "helpfulness": "0/0", "author": "Nreimonenq"}]