[{"rating": 4.0, "review": "First, the bad.I was surprised that Amazon cloud player was not in the home menu.  It would be great to have my own songs playing on TV.  I used Pandora, instead.I was also surprised that there is no shopping app and SILK web browser, yet.Keyboard do not allow qwerty, annoying inputs. No voice inputs either.  No keyboard capability from HDX tablet via bluetooth.The Good.  Sound and screen quality is excellent. Super responsive. Remote easy to use and intuitive buttons layout. Easy menu navigation, although screen jumping sub menu is a little confusing.", "verified": true, "helpfulness": "2/2", "author": "vince"}, {"rating": 3.0, "review": "CONS:It's All About Amazon Video On Demand... I guess i should have expected this!Voice search only searches Amazon Video on Demand.Interface is easy to navigate, but a bit busy like Netflix. Amazon Fire TV seems to be more about Amazon Video on demand than the other apps, which is fine if all you watch is Amazon Video on Demand, or if you buy/rent from Amazon.Not bad, but the Roku box offers much more variety, and it's easier to navigate through your real favorite channels (Not just Amazon.)", "verified": true, "helpfulness": "2/5", "author": "Moises Lopez"}, {"rating": 1.0, "review": "No 4K support, yes it is coming soon!!!, TVs here, computer monitors also already here, many new 4K cameras coming out...No 3DNo UISB 3.0 supportNo 1 GB Ethernet supportNo The BlazeNo True real keyboard supportNo Apple Airplay support, once you use it you see how great it can be...", "verified": false, "helpfulness": "8/53", "author": "joanne"}, {"rating": 5.0, "review": "Absolutely love this! If you have any media on Amazon, then this is the device for you! The voice control is flawless and the photo viewing, game playing and movies/tv is amazing. Above all, this thing is easy and lightning fast! I've already order two more for family members.", "verified": true, "helpfulness": "3/4", "author": "Michael"}, {"rating": 3.0, "review": "Thanks for letting me know if works in Mexico since its supposed to be better than Chromecastand I'd love to watch Amazone prime TV series", "verified": true, "helpfulness": "0/3", "author": "Glen's Mom"}, {"rating": 4.0, "review": "Anyone in the market for a used Google Chrome Cast?  Amazon hit a home run with this offering.  Truly simple setup, thoughtful and intuitive menu layout, great speech recognition, beautiful screen savers and overall video quality.  I'd give it 5 stars if it had a browser.  Best 100 bucks I've spent on a gadget in a very long time.  I'm no push-over, I added Fire TV to an entertainment system in which I have invested over $12k and this product is right at home!", "verified": true, "helpfulness": "3/3", "author": "Karl Foertschbeck"}, {"rating": 4.0, "review": "Alright after only half a day using Fire TV, really using it,  I will say this: I love it.  I was disappointed initially before I received it because they have already run out of game controllers, and I won't get the amazon controller until next month. The games are actually the real sell for me on this system. So, not receiving the game controller for a month is not so great for a product barely a week out of launch. With someone's suggestion I bought an Ouya (it's bluetooth) and it does work pretty well, but the amazon controller has all the features and the mapping I want.The Good:Interface - simple and user friendlyApps - easy to download and use; all the best apps available (except HBO GO)Games - already lots of free onesPrime features - all of amazon right there for youSetup - very simple and quick, just a breezeVery fast selectlon and loading whatever you are doingThe Bad: (small gripes here)No batteries out of the box ( I know, 2 AAA batteries, but they weren't there)Freezes on a game or two and needs rebootBooting up is a bit slowNot enough games or apps right now ( I know this will change)That's it.  I love this system already. For me, I can play these casual games on my big screen - all so far for free - and navigating the system with apps, movies, games, is just a breeze. I already have a smart TV and I could get these apps already - I wanted the games.  That said, I love using fire better than my smart TV, it's just that easy.Review out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This item arrived very fast & set up was exactly as instructions stated. Immediately worked & well. Some apps are to be downloaded into FireTV box but do so very quickly. Very versatile item with so many accessible programs that match up with programs 7 memberships you already have.Image is dynamic & to watch it on our big screen HD TV makes it even more worth the money & decision to get. Practically installs itself.Thanks AMAZON! You've outdone yourself!", "verified": true, "helpfulness": "1/2", "author": "H. Graf"}, {"rating": 4.0, "review": "Fastest hardware out there that I know of for this price range. Much faster response time than apple tv or Western digital or roku box or samsung smart blu ray player due the latest HW spec including the quadcore cpu inside.  Very fast response time.  Nice initial set of apps but will improve over time.  I bought the controller with it and they gave me 10,000 coins which is about $10 credit to buy apps.  controller worked well and was responsive as well.Really the shortcoming comes in the form of personal photos and home movies.  If not loaded to the amazon cloud, you can't access it.  This is stupid.  it provides a USB port with no description of what it is for.  On most boxes, it is to connect a storage device. If you connect a storage device to this device, you cannot access the storage device. I understand amazon wants to make money selling content but they should allow USB storage devices to connect and access.  Western digital box and samsung smart blu ray player does, why not amazon?", "verified": true, "helpfulness": "1/2", "author": "PKK"}, {"rating": 3.0, "review": "I've been playing around with this for the past 3 days and, for the most part, I like it.Coming from a Roku XDS, it's amazing just how fast the hardware is. The UI is fast. Every app, including YouTube, runs like butter. No weird crashes or lock ups. BUT, it has one thing that none of Roku's or the VIZIO Co-Star ever had; it \"blinks\" every 7-10 seconds no matter what I do.  I'm going to try a new HMDI cable tomorrow, which I shouldn't have to do, since all of my other devices work just fine with the existing cable.  If the new cable does the trick, then I'll update this review.  If it doesn't then they are both going back to Amazon.", "verified": true, "helpfulness": "1/2", "author": "Onsoku \"living in the 93036\""}]