[{"rating": 4.0, "review": "Not quite as easy as advertised but, once it's hooked up, it works well.  I recommend patience and a nearby lap top for reference.", "verified": true, "helpfulness": "0/0", "author": "smcdiniowa"}, {"rating": 3.0, "review": "I bought this to travel with me for use in hotels and at friends houses. Its very nice to be able to watch what I want when I want. CONS: very limited app support at the time..", "verified": true, "helpfulness": "0/0", "author": "Peter V."}, {"rating": 5.0, "review": "This little thing is awesome.  For $35 its worth it now, but it will be included in upcoming AndroidTV boxes/sets, so...whatever, its $35.  The hardware is weak so don't expect smooth transitions or anything, and it only supports h.264 so not every local file is supported, but again, its $35.  If you have a decent tablet/phone its the easiest way to \"smarten\" your TV.", "verified": true, "helpfulness": "0/0", "author": "Nerdrow"}, {"rating": 1.0, "review": "Used it the first time, and after some time to setup, it worked great.  The second time, after about 1 hour of trying over and over again, it worked.  The third time, after trying 1.5 hours to get it to work, it did not.", "verified": true, "helpfulness": "0/2", "author": "Rodney W Hennig"}, {"rating": 5.0, "review": "Only problem was not being able to get it to work thru surround sound system.", "verified": true, "helpfulness": "0/0", "author": "barbara fiacco"}, {"rating": 1.0, "review": "Evidently this doesn't work with our Internet which is faster this is made for the old-style Internet bad product", "verified": true, "helpfulness": "1/4", "author": "Mww79701"}, {"rating": 5.0, "review": "Love to be able to stream netflix in the family room without a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Dwalline"}, {"rating": 5.0, "review": "SWEET DEVICE, MAKES WATCHING YOU TUBE VIDEO'S ON TV EASY", "verified": true, "helpfulness": "0/0", "author": ":)"}, {"rating": 5.0, "review": "Great device", "verified": false, "helpfulness": "0/0", "author": "Deborah U."}, {"rating": 5.0, "review": "Very nice!!", "verified": true, "helpfulness": "0/0", "author": "Ricardo de Almeida Gonzaga"}]