[{"rating": 3.0, "review": "It does what it's supposed to, and it's almost embarrassingly easy to set up. The drawback is that it really hogs your bandwidth. I'm trying to fix this, and I'll post something if I find a good way. If so, this jumps up to 5/5 immediately.", "verified": true, "helpfulness": "1/1", "author": "G"}, {"rating": 4.0, "review": "Finally I can watch Google Play Movies on the big screen in Full HD. Setup was intuitive and easy and you can't go wrong with the price of this nifty device.", "verified": true, "helpfulness": "1/1", "author": "A.J. Presto"}, {"rating": 4.0, "review": "Very easy to configure, simple to use & value for money with amazing built quality. Loving it..Best offering from google.A must buy...", "verified": true, "helpfulness": "0/0", "author": "Tanmay Amin"}, {"rating": 5.0, "review": "Much better and cost effective than any other similar streaming device in the market. Works seamlessly with YouTube and Netflix through a smartphone. New chrome browser plug in also lets you stream local media directly from your laptop to the TV which takes care of one last missing feature within Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Akshay"}, {"rating": 5.0, "review": "Listen, we all know cable is overrated. Also, not everyone has a smart tv. But everyone loves free stuff! Get yourself a nice hd flatscreen, don't pay for the smart tv!!! Most of the time it's limited. This is unlimited. You can stream anything you want from your laptop. With the chrome cast extension, you can stream any tab you want. Plus Google is constantly making updates, so who knows what else we'll be able to do with this thing! Some Google apps are already synced with this such as Netflix, youtube, RedBull, Viki, Google Play, HBO Go, Hulu Plus, MLB TV, Crackle, VEVO, Plex, Pandora, etc. That's more than enough streaming apps for me! (Especially MLB TV). Now all you need is that free wifi.... :p", "verified": true, "helpfulness": "1/1", "author": "Franky"}, {"rating": 1.0, "review": "Can't send back, other products out there , this one worked in February and went unused for a month and it's broke now, bummer. I spend a bit of cash with Amazon and wish they could send another. Shrug, lesson learned.", "verified": true, "helpfulness": "0/1", "author": "mark sellars"}, {"rating": 5.0, "review": "these just work great, though I have it connected to a smart TV chromecast apps are more reliable then the smart tv apps, and load a lot quicker.", "verified": true, "helpfulness": "1/1", "author": "Christopher S. (Czar)"}, {"rating": 2.0, "review": "When it works its great.  After I found out I couldn't cast local media I kept it for watching tutorials.  The initial tutorials(BlenderCookie) in the series are on youtube and they work fine. The following tutorials are for paying members and are not hosted on youtube.  When I try to cast them with my chrome chromecast button it rarely works(black screen).It seems like in an effort to fight piracy the functionality of chromecast is seriously crippled.  In a fully functional state Chromecast would be well worth its price.  As is $5 would leave me feeling like it was a fair trade rather than a tease.", "verified": true, "helpfulness": "0/1", "author": "I. Macy \"Herkamer\""}, {"rating": 5.0, "review": "Arrived very fast. Amazingly easy to install. Stupid simple to use. Now you can watch Youtube kittens on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Kurt Schlieter"}, {"rating": 4.0, "review": "it works good for me, just gets kind slow not sure if its the wifi or the item but thank you im sure to recomend this item to others", "verified": true, "helpfulness": "0/0", "author": "Milton"}]