[{"rating": 5.0, "review": "Cool!", "verified": true, "helpfulness": "0/0", "author": "Molly Thompson"}, {"rating": 5.0, "review": "This is one of the best and most useful gadgets I have ever purchased. I spend most of my time on my mobile devices and laptop.  Hardly ever touch my dvd player or even televisions at home. Being able to just beam what ever is showing on my mobile to my huge TV set in any room in the house is so convenient and awesome. It's great for a lot of things to.  Easy to sit at home and share pictures with my family and friends without the need to mess around with cables. For work it's great I can practically make presentations from my mobile as well directly to the television in my boardroom and walk around with the tablet in my hands.It's now my best way to watch a movie, my tablet or phone becomes a huge remote control.This device is brilliant and I got it used for about $20!!!!!  Best bargain ever, would have paid 5 times that for it.", "verified": true, "helpfulness": "0/0", "author": "Stan The Man \"Stan\""}, {"rating": 3.0, "review": "(summary, often times my smart device and chromecast aren't on the same page.  App development is needed)My livingroom consists of a home entertainment system connected to my desktop.  After receiving this product I had hopes of using it to replace my daily internet viewing.  It is a good idea to sit on the couch and use my tablet to enjoy the things I commonly view.This product contains that potential however the details are wrong.  Programs do not interact well with chromecast, often times I find the volume turned down on one program and the setting remains unto another yet the later program does not have a volume control.  So I'm sent searching through my programs to find the last one used to turn the volume up.Secondly syncing is far from seamless.  While browsing youtube and adding to my queue, there is no quick easy way to return to the video I am watching and control it.  Rather I am left with a video that can't be paused.Pandora is easily left without a proper sync, if the tablet or phone is left locked it somehow forgets that it is synced with chromecast and operates independently.This is a ground breaking design for anyone who wants internet use on their main system.  Google just needs to get on their app developers to fine tune the system.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 4.0, "review": "Great for Netflix, YouTube etc. Faster than the smart TV apps. Reasonably good for watching videos from other sites.", "verified": true, "helpfulness": "0/0", "author": "Siddhesh Shirsat"}, {"rating": 5.0, "review": "Cool accessory well worth $35.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Works perfect!", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "My dad loved this Christmas gift.", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 1.0, "review": "To me it's a waste of $30.  My old Logitech Revue does much more much easier. Tried this and returned it. Perhaps it depends on one's goals and interests.", "verified": false, "helpfulness": "0/0", "author": "LS"}, {"rating": 5.0, "review": "awesome just about sums it up!", "verified": true, "helpfulness": "0/0", "author": "dennis ortiz"}, {"rating": 5.0, "review": "Good quality video from Youtube and Netflix,Chrome browser casting was not very high quality.Would have liked to see more options for streaming from different hardware and apps.", "verified": true, "helpfulness": "0/0", "author": "N. Tulsian \"Movie Lover\""}]