[{"rating": 4.0, "review": "Fast and easy to use .", "verified": true, "helpfulness": "0/0", "author": "PHILLIP MONACO"}, {"rating": 4.0, "review": "I love this! We watch Hulu, Netflix, and Prime and we rock out to Pandora on our Fire TV . My only complaint is Hulu is constantly laggy and choppy. Works fine on the Roku and XBOX but not on the Fire TV. Hopefully they will release an update that fixes it soon!", "verified": true, "helpfulness": "0/0", "author": "Survival Dude"}, {"rating": 5.0, "review": "Great for Dumb tv's. Wish there was a little more content with Prime movies but Im sure that will come.Very fast. Lot better than hooking up the laptop. Nifty little remote, if you can find it.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 1.0, "review": "problems as soon as hook-up...kept reading licensing error when trying to view a program...sat on hold after reaching customer service for fifteen minutes while they research the issue...never picked the line back up...returned the product.", "verified": true, "helpfulness": "0/4", "author": "Matt"}, {"rating": 4.0, "review": "We enjoy the Amazon fire.I just didn't realize a lot of shows would cost extra to watch.", "verified": true, "helpfulness": "0/0", "author": "D-dawg"}, {"rating": 5.0, "review": "Now I can catch up on all the shows I've missed!!! Works great.", "verified": true, "helpfulness": "0/0", "author": "Philip b Proulx"}, {"rating": 5.0, "review": "It Was perfect so easy to use and it worked perfectl, muy daughter loved it, petite and you ca not tell its a device i am going to buy another one", "verified": true, "helpfulness": "0/0", "author": "lissa"}, {"rating": 5.0, "review": "This thing is so flippin' fast.  The image quality is better than my satellite, and menus are easy to navigate.  I was set up in a couple of minutes all of my Prime Videos were ready to go.  I don't have the most reliable internet here, but there hasn't been a buffering problem.", "verified": true, "helpfulness": "0/0", "author": "Rick B \"just a guy\""}, {"rating": 5.0, "review": "I love love love this thing. We cut our cable cord and went with Netflix and Hulu. I have been a prime member for years. We were streaming on our tv through our computer. Got this as gift and the video quality is amazing. It plugs directly into the modem though, as It isn't wireless. But I love it. So glad to have it.", "verified": true, "helpfulness": "0/0", "author": "trace iam \"trace\""}, {"rating": 3.0, "review": "I like it very much for what it is but what is the big deal to let the usb play media? really why do we have to resort to rooting or jailbreaking devices to get simple uses to work....android and apple c'mon stop already. i want to stick a usb etc device in my unit and play something i want to. wth this device would be awesome if it let us just use it and not restrict features...i really want this to be my go to device AMAZON unlock it to do what it can stop being a follower.  Let us use it otherwise it just adds another device that my xbox/ps4 can do easily....tactics like this is why things fail!I dont want to root and deal with all the headaches so i could install extra software that honestly my wife or kids will be lost, and frankly i dont feel like keeping up with xda about the latest versions etc....my phone and tab are enough!", "verified": true, "helpfulness": "1/1", "author": "Ruben_NYC"}]