[{"rating": 5.0, "review": "was a gift for christmas and he hasnt stopped using it so a keeper.", "verified": true, "helpfulness": "0/0", "author": "ajchobot"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Roni81"}, {"rating": 5.0, "review": "awesome TV experience", "verified": true, "helpfulness": "0/0", "author": "avkapevi"}, {"rating": 1.0, "review": "I can only give this one star at this time because Amazon in their infinite wisdom decided to deliberately prevent the system from being rooted.If I buy hardware, I expect to be able to do whatever I want to with that hardware, and to be artificially locked out of a system for no reason is unacceptable.  This is like buying a piece of paper then being told that I can only write words on it.  That drawing a picture on it would be a violation of the EULA and that doing so would make the paper self destruct.", "verified": true, "helpfulness": "1/5", "author": "Orcus"}, {"rating": 3.0, "review": "I was disappointed that I received a device that was seven software versions behind.  I called Amazon and was told I would be hearing back from someone.  I have not heard back from anyone.  I have been a Prime member for a long time and am very disappointed.", "verified": true, "helpfulness": "0/2", "author": "PMRoberts"}, {"rating": 5.0, "review": "I really injoy my fire tv!  I was watching the movies right on my kindle fire; but this is so much clearer and of course larger, since it is on the tv.  I love it!", "verified": true, "helpfulness": "0/0", "author": "draelink"}, {"rating": 4.0, "review": "It was difficult to get netflix working, but everything else was great. I should have ordered it sooner.", "verified": true, "helpfulness": "0/0", "author": "abraham s jarrell"}, {"rating": 5.0, "review": "So very easy to use, exactly as advertised!  We love it.", "verified": true, "helpfulness": "0/0", "author": "book collector"}, {"rating": 5.0, "review": "Easy to use, high quality equipment, nice and clear picture. Pleasantly surprised. Recommended.", "verified": true, "helpfulness": "0/0", "author": "vandros"}, {"rating": 5.0, "review": "This product is absolutely amazing!Reasons why I got this product:1. Quad core processor.2. Separate GPU.3. HDMI4. Wired and Wireless Network.5. Streaming Services (Hulu, Netflix, Flixter, Crackle, Prime, etc)6. Apps + Gaming.Now for the real reasons:- Android Based  :)- Ability to side load other Apps (Developer Mode)- Ability to turn this little box into a full fledged Media Center!! :)  Kodi!!  Hint hint!On the test bench:I was able to stream via LAN (10/100) with XBMC (Kodi) side loaded.What blew me away was the fact this little box can handle Bit rates higher than the advertised 20 Mbps! No Joke!I was able to go up to 40 Mbps bit rate with no lag or jitter and I am sure it can handle much more.Audio:So one little issue I encountered was the AC3 Plus playback is not compatible with many older system AV Receivers.I had to hook up to a newer system with HDMI inputs that it supported the AC3 or E-AC3 audio codecs.One thing to note it only supports MP4 containers on the playback with AC3 audio via HDMI. Don't use Toslink or S/PDIF just stick with HDMI, otherwise no multi-channel audio.Overall, Excellent little box with the best of both worlds.  It's a must buy,  hands down. :)", "verified": false, "helpfulness": "0/0", "author": "V. Rodriguez"}]