[{"rating": 5.0, "review": "Great gagdet!", "verified": true, "helpfulness": "0/0", "author": "ricardo"}, {"rating": 5.0, "review": "Everything works perfect.", "verified": true, "helpfulness": "0/0", "author": "Jeremías"}, {"rating": 5.0, "review": "Fantastic! We had trouble setting it up initially as you have to have something on your router disabled in order to make it work. We weren't able to finagle that from our ipad, so we called our internet provider and they righted that issue in about 30 seconds (there are also lots of videos online that show you how to fix that yourself, but we don't have a computer and thus, we can't access our router. Perhaps there is a way to do that through an ipad, but we didn't bother). What I also love about this is that you can use your ipad for other things while you are streaming a show/movie. Also, a surprise to us was that your streaming device's battery isn't drained when you are watching your movie/tv show. Very neato.This little $35 device is saving us from a $150 per month cable bill. We just pay for our internet ($42/month, which we would have regardless) and a Hulu+ subscription ($8/month). Thank you, Google! :)", "verified": true, "helpfulness": "0/0", "author": "cashmandu"}, {"rating": 4.0, "review": "It exceeded my expectations, but still needs to correct some random disconnects.", "verified": true, "helpfulness": "0/0", "author": "Joaquin Duarte"}, {"rating": 4.0, "review": "great product. no compare with the appletv but for the price is worth it.", "verified": true, "helpfulness": "0/0", "author": "francisco"}, {"rating": 5.0, "review": "I bought this to stream random you tube and Web pages on a second TV in our living room and it works great! Great value. The changing background screen when it's not in use is a nice touch. We leave it on if we are in the room. Super easy set up!", "verified": true, "helpfulness": "0/0", "author": "Tony Bird"}, {"rating": 5.0, "review": "I had the Roku 2, and even though it was a great piece of technology, it doesn't reach the simplicity and convenience of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Manuel Avila"}, {"rating": 5.0, "review": "Great device, wish amazon could be chrome cast and other streaming services.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey Bricker"}, {"rating": 5.0, "review": "great product, thanks!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "luis solorzano"}]