[{"rating": 5.0, "review": "Fire TV what a great product,  easy to setup, great movies and games, I just love it!!!!", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 5.0, "review": "What a great product.  Easy to set up and use and works like a champ.  Love it.", "verified": true, "helpfulness": "0/0", "author": "William J. Munizza"}, {"rating": 5.0, "review": "As advertised, this unit was simple to install.  Quality is very good.  The voice search feature is very accurate and easy to use.  Well received.", "verified": true, "helpfulness": "0/0", "author": "Automat54"}, {"rating": 4.0, "review": "My olly wish is that there was a clean way to sort through the free prime moves and the pay movies", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 3.0, "review": "There is no internet access to download apps or do anything else, my kindle does more. Will be returning it until they remedy that.", "verified": true, "helpfulness": "0/0", "author": "kgirl"}, {"rating": 5.0, "review": "Awesome product.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Ashok Manandhar"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "w1knight"}, {"rating": 4.0, "review": "The Fire TV is great overall. The remote feels fantastic, is easy to operate, and the interface is extremely responsive. Basically all of your major streaming applications are available, including a (finally!) usable interface for Prime videos.Bonus: You can sideload applications, like XBMC.Downside: No native DLNA player. I've had to sideload XBMC to stream local media, or use a network TV tuner. If they could add this feature, then the Fire TV would be a dream come true.", "verified": true, "helpfulness": "0/0", "author": "Leein3D"}, {"rating": 5.0, "review": "I love the box. I move it from tv to tv depending on what l'm doing. Extends my FIRE beyond what I thought were its limits. Great buy!!", "verified": true, "helpfulness": "0/0", "author": "ART"}, {"rating": 5.0, "review": "Great product. Turns your HDTV into a smart TV. But, you need to have Wi-Fi or high speed internet for it to download quickly. Will not increase download speed.", "verified": true, "helpfulness": "0/0", "author": "Carol L."}]