[{"rating": 5.0, "review": "Easy install. Works great! Would recommend.", "verified": true, "helpfulness": "0/0", "author": "SARAH FRANCO"}, {"rating": 5.0, "review": "Everything is asked for and more! No glitches or anything plus easy set up! Fast delivery!", "verified": true, "helpfulness": "0/0", "author": "Peyton Hughes"}, {"rating": 5.0, "review": "recomendable", "verified": true, "helpfulness": "0/0", "author": "ezequiel aquiles"}, {"rating": 1.0, "review": "Nothing wrong. I ordered the wrong thing. I wanted the fire!", "verified": true, "helpfulness": "0/6", "author": "Lynn R Parker"}, {"rating": 5.0, "review": "So much fun! Easy to use.", "verified": true, "helpfulness": "0/0", "author": "A Steve"}, {"rating": 5.0, "review": "Love the chromecast. Plenty of apps and easy to use!", "verified": true, "helpfulness": "0/0", "author": "lee woodworth"}, {"rating": 5.0, "review": "Chromecast is a part of my life. It has been since it's Alpha stages and it has yet to disappoint.  I just wish Google would send me an extra for my second TV. Haha. This is a must have.", "verified": true, "helpfulness": "0/0", "author": "Julio C."}, {"rating": 5.0, "review": "Pros:-Setup is fantasticly simple, and easy.-Very nice design, and the style of pulling beautiful pictures for the display is very classy.-Works with the apps I normally use.-Multiple chromecasts can work in a house without interfering with each other.Cons:-Using multiple devices connected to the same chromecast can start causing odd errors like repeating the same video when the next video is queued.-If you care, it does get really hot after use but that's not really a con because your tv is also causing heat too.  Just make sure not to cover it and leave room for ventilation.Overall: This device is affordable and adds a whole new ease of entertainment viewing.", "verified": true, "helpfulness": "1/1", "author": "Alexander"}, {"rating": 5.0, "review": "We have Chromecast for each of the TVs in my house and we love it! My favorite use for it is to periodically cast to my roommate's TV and blast the My Little Pony theme song. I have to lock my door now when I sleep but it's totally worth it.", "verified": false, "helpfulness": "0/0", "author": "SMarieS"}, {"rating": 5.0, "review": "Very handy little thing, i can now stream movies or videos to my tv from my cellphone or PC", "verified": true, "helpfulness": "0/0", "author": "Carlos Eduardo Pérez"}]