[{"rating": 5.0, "review": "I don't have a smart tv so I bought the chromecast to get netflix it works great with my computer.", "verified": true, "helpfulness": "0/0", "author": "Robby"}, {"rating": 1.0, "review": "I down loaded the app. Connected to my WIFI and on the  Tv all it said was my comcast chrome name and waiting for instructions. I played a movie on the enternet; but no picture on the Tv. I did every thing right. I have comcast exfinity as my WIFI provider. I saw the reviews after I purchased this and I should listened to them. I am a active customer of yours and I have purchased many items from you but now I will consider Walmart for my next purchases", "verified": true, "helpfulness": "1/4", "author": "STEVE"}, {"rating": 3.0, "review": "I'm not going to be one of those people that complains about the fact that it doesn't have enough apps, because that's not about the exact item. Instead, Im actually going to review itFirst, let me just say that it works, it does what it says it projects the certain apps onto the screen, and works well. But it could be much better. One issue is that you have to have recent software to run the app, so if you have anything lower than an ipad3, or an iPhone 4, you can't even download the app.Second, there is no way to turn the device off. If you plug it into the TV, it turns off when your TV is turned off, but if you plug it into an outlet, you have to unplug it to turn it off.Third, I have an iPhone, and when you are playing something on Netflix, you have to leave your phone on to have any control. If you click into another app, or click your phone to sleep mode, the remote feature stops working. The show you are playing will still run, but if you go back to control it with the remote, it will say you are no longer on the same network and that the remote feature won't work. So the only way to then regain control is to turn off the chrome sat (unplug it) and restart the process.So in conclusion, if you don't mind leaving it on 24/7 and you don't mind your phone or tablet battery getting drained while you watch, it's a great product. But too be honest I'm sort of disappointed with it, they should have made this device 49.99 and added a power button, and fixed the software on it.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 2.0, "review": "I am flabbergasted that Google dare to launch a product that clearly, still light years away from Apple TV. It is always a pain to connect my Google Chrome to the gadget, and mostly, have to connect again whenever changing tabsWhen I bought it, I did because of the brand, thought Google wouldn't release something that it is not ready. (Yes, I have contacted Google assistance, but I wanted something easy and simple to connect, not to go through a painful { restarting chrome, booting the laptop} process every time)Do not recommend", "verified": true, "helpfulness": "0/2", "author": "Rodbm"}, {"rating": 5.0, "review": "For those who can remember the times of show & tell, this is it.  You show, tell, and a show & tell and show & tell ....", "verified": true, "helpfulness": "0/2", "author": "Ivanelle Guerra"}, {"rating": 1.0, "review": "Bought this because CyanogenMod for Android had the ability to stream any media content to Chromecast. This made the Chromecast pretty handy as a Miracast alternative and I don't need the MHL (HDMI) cable anymore. This was very, very useful. In fact, my system was set up so that I could display presentations to the projector for work functions the moment I step into the conference room for a wow effect with my audience. For this utility the Chromecast was perfect for $35.A week after I bought Chromecast, Google sent an auto-update over the Internet (that you can't disable) that broke my setup. I went to search (ironically) on Google to find out how to fix this issue. Unfortunately it was ugly. Google caught on to CyanogenMod's ability to stream anything and this apparently misaligned with Google's business strategy. The response from Google was that these APIs were still considered experimental and can change any time. The fact the stream anything feature was intentionally disabled and no replacement \"experimental\" APIs for developers to use was disingenuous.Unless you're only interested in _specifically_ Youtube or Netflix (or one of the few handful of specific applications sanctioned) the Chromecast is really not going to be what you want.Let's say that you actually want to use Chromecast because you love Youtube so much and that's all you ever wanted to use it for. The following are three experiences that you're going to have depending on your technical experience level.Newbie user: You want to set up once and ignore it for the rest of your life.Follow the instructions and you can watch Youtube or Netflix on your home TV. Make sure that you have a wireless router because Chromecast needs it. Once set up, you just need to install Chromecast application on Android or on your PC then select Chromecast option from a Google sanctioned application to start streaming.Intermediate user: You want to play something at a friend's home.Do the newbie step all over again.(If you're using Android, make sure to disable the Google privacy settings for the Chromecast application otherwise the app can't discover the Chromecast dongle).Advanced user: You want to play something while watching at a hotel on a road trip.Oh my... this is going to blow your horns. The problem is Chromecast needs a Wi-Fi router to work. Who brings with them a \"portable\" router with them on road trips? Using your phone/computer at the hotel you will be presented a web page to log in. Once logged in you can then surf the web. The problem is Chromecast only understands how to log into Wi-Fi routers using the WPA2 password you give. It does not understand how hotel log in screens work.Option 1. Change the MAC address of your phone/laptop to use Chromecast's MAC address and then log into the hotel's log in page. After logging in with your phone/latop, you can then tell Chromecast to connect to the hotel's Wi-Fi. The hotel's log in page will no longer show up for Chromecast because it thinks it's already registered so now Chromecast can use the Internet without any more problems. You may have to do this a few times a day because the log in may expire after some idle time passes.Option 2. Bring your laptop installed with Windows. Buy/install Connectify for Windows to make your PC a Wi-Fi router using only one Wi-Fi device. Use your laptop to log into the hotel's Wi-Fi router and make your Chromecast log into your laptop as Wi-Fi router. Now your Chromecast can reach the Internet through your laptop.ELI5: For those curious about how the heck a laptop can connect to one Wi-Fi router and yet simultaneous become a Wi-Fi router itself, the technology works by having the network driver switch between being a Wi-Fi client and server so fast that the end user can't functionally tell the difference. Though there's no limit to the number of networks you can join simultaneously, the total Wi-Fi bandwidth is still limited so your internet doesn't get faster. (Source: [...]Note: The technology is probably patented by Microsoft which only exists in Windows and a feature that Connectify exposes. It would explain why it's not in Android/Iphone. Haven't checked, but maybe it exists on the Windows phone since that's just a port of the PC operating system. Would be quite nice as a workaround to set up your phone as a hub for Chromecast to connect and using your phone to log into the hotel Wi-Fi. What would be nicer is if Chromecast could be changed to log in itself.The Chromecast team needs to listen to user feedbacks or this product is going to tank hard. This product needs to be made way easier to use than what was described above. All I wanted was a plug and play device to play anything I wanted. Even playing only what Google wants is still too much work for the average working person to use for traveling.", "verified": false, "helpfulness": "2/6", "author": "Dr. Who"}, {"rating": 5.0, "review": "No problems with it and I am suprised by the streaming quality. Videos fron YouTube, Chrome, and HBO Go look spectacular on my LED Smart TV. Waiting for more 3rd party apps namely Android casting.", "verified": true, "helpfulness": "0/0", "author": "MattyAZ"}, {"rating": 5.0, "review": "Works great!  Good price. Makes downloading and streaming of movies, videos, and tv shows very easy.  Instructions were clear and simple.", "verified": true, "helpfulness": "0/0", "author": "Linda B."}, {"rating": 4.0, "review": "I actually purchased this directly from Google on the first day it was available. I could not pass it up due to it's very low price. The device (dongle) is VERY easy to set up - it only took me a few minutes to set up after I downloaded the the app onto my devices and Windows PC. The device does need to be powered somehow, so you have a choice. You can plug in the HDMI end into an HDMI port on your TV and plug the USB plug into a USB port on your TV. Please note that not ALL TVs can handle powering this device via the USB connection. It all depends on your TV. I have an LG LCD TV that's several years old, but hooking it up that way on this TV works perfectly. No problems at all powering it via the USB. Google also includes an AC power plug, so if you can't power it through your TV, you can just plug it into an AC outlet.You do have to use apps from your device to use it. (Your device acts as a remote for Chromecast to stream to the TV). For example, you would open the Netflix app on your phone or tablet, find what you want to watch, and then choose to \"cast\" it to your TV. Same goes for YouTube, Google Play Movies/Music, and any other Chromecast app. It's compatible with both Android and iOs.My experience with it has been very fluid, fast, and barely any lag. Before casting, you do have to switch to the HDMI port you chose during initial set, but it's very simple and quick. Then you go to your device and open the app that you want to stream from. From within the app, you can choose to \"cast\" the video to the Chromecast. I've tried many casts from YouTube, and the lag time from selecting \"cast\" to the time it starts playing on my TV is literally a couple seconds. I haven't had any issues at all, so it works great for me. I've noticed NO buffering whatsoever. Another plus is that it's tiny and hides on the back of your TV, so no extra boxes laying around. It doesn't take up any extra space.The only reasons I rated it 4 instead of 5 stars is:  There aren't many apps that can stream to Chromecast yet, however, there were recently 10 more that added the capability; one being Plex, which I love, so that you can stream all of your PC's local media through the Plex app, onto your big screen TV. This is a feature that many people have wanted, so it's finally available! There's another new Chromecast app called Avia Media Player, which even allows you to access your DropBox files. New apps were added very slowly at first, but this week, 10 new apps were added, and Google is working with many other companies to get them set up through Chromecast. Pandora was recently added as well, so you can stream your music to your TV.I am hoping that MANY more companies add apps to Chromecast, and, the way it's going lately,  I think there will be many more to come. It just takes some time to test and for apps to make sure they work well with Chromecast.The device also offers experimental features such as casting what's on your Chrome tab to your TV, as well as casting your entire computer screen to the TV. For some reason, I haven't been able to cast from my laptop yet, but I keep trying and am hoping it will soon work. My issue is that the Chromecast isn't finding my laptop, though it could be due to some of my firewalls or security. I haven't really checked into that yet, though.that's not very tech savvy. You would just have to show them how to open/navigate the apps on your device, and how to cast theSo, overall, I think this is a great little device with tons of future potential, and it couldn't be easier to install/set up for anyone videos from those apps to the TV. You really cannot lose with the low price!***Update 2/16/14: Google just recently publicly released their development kit, so now all app developers can add cast functionality to their apps. It's no longer restricted to beta testers. This means that tons more apps should soon be able to cast your TV. I'll update again in the future once more apps become available.", "verified": false, "helpfulness": "0/0", "author": "A. Glass"}, {"rating": 5.0, "review": "It doesn't contain Netflix, but it lets me project Netflix I've opened in my Chrome browser onto my flat screen t.v.One caveat:  It only projects to the t.v. what you can see in your Chrome browser.  It won't project any other program, not your desktop, not word, etc.But, projecting Netflix or Amazon Prime videos opened in Chrome is plenty for me.", "verified": true, "helpfulness": "1/1", "author": "R. Caniglia"}]