[{"rating": 2.0, "review": "It's harder to use than expected. I returned it after one day because it's quite limited with the iPhone and the Mac that I own.", "verified": true, "helpfulness": "0/0", "author": "Miro"}, {"rating": 5.0, "review": "Is working very well and I like it a lot", "verified": true, "helpfulness": "0/0", "author": "Juancarlos Martinez \"JCM\""}, {"rating": 5.0, "review": "I like this item very much.I use all the time great packing also thank you", "verified": true, "helpfulness": "0/0", "author": "Aristoteles Zelaya"}, {"rating": 5.0, "review": "This thing is legit.", "verified": true, "helpfulness": "0/0", "author": "nick Lancaster"}, {"rating": 5.0, "review": "Have to reboot sometimes but love the ability to watch Dramafever and Hulu on my TV : )", "verified": true, "helpfulness": "0/0", "author": "Kpop Fanatic"}, {"rating": 1.0, "review": "I have had this for a little over a year and it has been very inconsistent.  It sometimes freezes and other times it just doesn't want to cast.  This morning it worked, but now I only have sound and no picture.  I have gone online to look for support (this is not my strength) and I can not find support regarding this issue.  I am planning to just get rid of it and try the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 1.0, "review": "This was a total waste of money. Had to constantly reboot or reset it to get to even work. Constantly buffering. The wait time just to watch a movie load up after all of the rebooting and reacting was soooo frustrating. I have a good wifi signal in my house. Even with the HDMI expander it still dropped its reception  - go with Amazon Fire box - a superior product. This thing burnt the mother board one sisters flat screen tv . Google needs to pull this from the market.", "verified": true, "helpfulness": "1/1", "author": "Terrance Lark"}, {"rating": 3.0, "review": "I have been able to get it to work about 25% of the time with my hardware.", "verified": true, "helpfulness": "0/0", "author": "Slim Jim"}, {"rating": 5.0, "review": "I use this every day. I am not even going to go into the list of things I use on this. Its a LOT. Its not as fancy as lets say the WD media player but allows you to use any device you have to use it, not just a remote and network storage device.", "verified": true, "helpfulness": "0/0", "author": "Chogardjr"}, {"rating": 5.0, "review": "This product arrived earlier that I expected. It is nice and I look forward to using it.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]