[{"rating": 5.0, "review": "Works great. Made my tv into a smart tv. Who needs to spend top $$$ to get a good product.", "verified": true, "helpfulness": "0/0", "author": "Javier Sande Lago"}, {"rating": 4.0, "review": "This is easy to use--just plugged it into the back of my tv. Netflix works well except I probably need to increase my wireless internet speed because sometimes the programming breaks up", "verified": true, "helpfulness": "0/0", "author": "Beth Alley"}, {"rating": 5.0, "review": "The initial setup should have been simple but it was not. The software needed to be updated but the seller didn't tell me. It took hours to figure that out. Now, it's a great and simple tool. I'm looking forward to Amazon Prime be becoming available.", "verified": true, "helpfulness": "0/0", "author": "A. Malin \"malinrebate\""}, {"rating": 5.0, "review": "Great user experience. Product gets out of the way and makes the experience a joy to use for Netflix, YouTube, and Songza. Could be faster. Estimate a 1-3 min wait before Netflix casted.", "verified": true, "helpfulness": "0/0", "author": "Abe"}, {"rating": 1.0, "review": "It worked fine at first, but an update to Chromecast in December 2013 resulted in repeated 16003 error codes when trying to watch Netflix from a Galaxy tablet.  The problem only happens with Netflix.  Netflix says it's NOT their problem.  Google customer service says they know about the problem, but there's no permanent fix for it yet.There are many suggestions on various internet forums about the problem, but none of the recommended solutions work for more than a session or two.  After that, you have to do a factory reset on CC or reinstall the Netflix app on your Android device to watch Netflix.It's really a disappointment.  It worked so nicely at first, but now it's pretty much useless.UPDATE:  There's a workaround for the problem.Start a Netflix movie on your tablet WITHOUT casting to Chromecast. After the movie has started on your tablet, click the Chromecast icon to watch it on your TV.  Once a movie is playing on the TV, you can switch to another movie, too.", "verified": true, "helpfulness": "1/1", "author": "Patricia M. Crabtree"}, {"rating": 3.0, "review": "I thought that I would br able to stream everything from my phone, such as when I go online or pictures from my phone.  You are limited to You Tube and Netflix and things like that.  I don't use it as much as I thought I would.", "verified": true, "helpfulness": "0/0", "author": "D. Westbrook"}, {"rating": 5.0, "review": "What an amazing little device! The combination of using both the Chromecast and putting an outdoor antenna up, I am cancelling my Directv! Very excited about that!!", "verified": true, "helpfulness": "0/0", "author": "Stellar"}, {"rating": 3.0, "review": "I bought the chromecast from best buy. When i got home, i followed the whole set up steps with no issues. (This is the important part) in order for my router (belkin 334) to recognise my chromecast, i had to call in the belkin support team so that they could help me change some settings that would allow the router to see chromecast. It took a while but finally i was able to set everything up and cast netflix. After a few weeks of successfully casting, my computer started having a problem connecting to my network, it was also not finding the chromecast. I contacted the chromecast support team and their troubleshooting was not working. I called the belkin router people and they said i had to reset my router. Once i reset, everything worked. But problem is ... This is a repetitive problem....my device (chromecast) is always missing, my computer cannot detect it and sometimes my computer will not even connect to the internet. So i have to Reset Reset Reset... I have a feeling my router will disfunction one of this fine days. Thats my truth.", "verified": true, "helpfulness": "0/1", "author": "Kashizzle"}, {"rating": 5.0, "review": "I really like my new Chromecast, and not just because I'm a Google Fangirl, either.  I love that I can stream Youtube videos and Playlists.  Casting from my computer is a little choppy but I believe that is due to it being on the wireless network and a little on the old side.  I suspect it would be better if it were hardwired to the router.  And unlike my other device I can watch Netflix under my own user name and don't mess up everyone elses recommendations.  If only I could watch my Amazon account I could move my other devise to another TV and expand the goodness.All in all, I would recommend a Chromecast to anyone looking to expand their entertainment choices.  You can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Nila Repard"}, {"rating": 2.0, "review": "This is a great idea for streaming media player on big TV, but there is a huge problem with the software and connection.  I have purchased 5 of Chormecast, and I am having problems with 4 of them already.  Two of them are hard to setup and get it connected TV.  I had to press the reset button all the time because they were not able to connect to the TV.  All four units disconnected after few days of usage, and I had to set up the connection to the TV again and again.  This is bad!", "verified": true, "helpfulness": "0/0", "author": "Dr. Waltski \"Veterinary Clinic\""}]