[{"rating": 4.0, "review": "Overall I am pretty satisfied with my purchase.  It is a speedy machine and I love the ability to use voice search.  I haven't bought a game controller yet as I have several other home consoles, but I may buy one in the future.  I would have given it a 5 out of 5 stars but I don't quite like the manner in which they provide access to Prime content.  It feels like I need to search more for movies and shows that I know are free with Amazon Prime.  The Amazon app on other platforms has an actual area that mainly includes the free content and it would be great if they did the same here.", "verified": true, "helpfulness": "2/2", "author": "Lloyd R. Milton \"Lloyd R Milton Jr\""}, {"rating": 4.0, "review": "i bought this as a gift for my son and he loves it so i guess i am on the hook for $99 a year!!!  lol", "verified": true, "helpfulness": "1/1", "author": "bette read"}, {"rating": 5.0, "review": "Very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 4.0, "review": "As with most things Amazon, this is a nifty gadget.  Comes out of the box ready to go, not a heavy learning curve getting started using, etc.My only complaint is that some of the older content I want to watch (like old PBS, old movies, stuff like that) is available only for a rental fee.  That's a bummer.", "verified": true, "helpfulness": "4/4", "author": "AGP \"chinsbob\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Suzanne Meinecke"}, {"rating": 3.0, "review": "This would be a 5 star review but the remote batteries are dying DAILY and there is no forum on Amazon where I can figure out how to address this issue.", "verified": true, "helpfulness": "1/1", "author": "Jennifer"}, {"rating": 5.0, "review": "Wonderful product! Considering getting these for all of our TV's.  So easy to use and so much great content and apps. Would definitely recommend this to any TV/movie lover!", "verified": true, "helpfulness": "2/2", "author": "Sheila D. Schutzenhofer \"disneyfan822\""}, {"rating": 5.0, "review": "I LOVE LOVE LOVE IT ! OPENS THE WORLD TO SO MUCH !", "verified": true, "helpfulness": "0/0", "author": "Jeanna Wozniak"}, {"rating": 3.0, "review": "System requires very strong internet connection for use. The apps have to be downloaded on the system. It can not be used outside of the US.", "verified": true, "helpfulness": "2/4", "author": "nelstar"}, {"rating": 1.0, "review": "This is by far the worse OPErating system ever written.. unfortunately I bought two of those phone s, almost impossible to use without getting upset ..if I had known how bad it is I would have never bought.. don't car if it was free...total junk.", "verified": true, "helpfulness": "1/8", "author": "NuJon"}]