[{"rating": 5.0, "review": "This was a great buy. Easy to hook up, easy to access Netflix and has good variety of free movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love it. No more cable or Satellite bills. Can watch so much and listen to music easily. Hope the price comes down a little more so I can by a couple more for the bedroom and garage TVs.", "verified": true, "helpfulness": "0/0", "author": "Jason Powers"}, {"rating": 4.0, "review": "Wish it was easier to identify which movies/shows were free.  But easy to use.", "verified": true, "helpfulness": "0/0", "author": "Paul Mangefrida"}, {"rating": 5.0, "review": "Loving it!", "verified": true, "helpfulness": "0/0", "author": "Aggie \"Aggie\""}, {"rating": 3.0, "review": "Would rate this a 5 star if it worked with Surround Sound.  It doesn't and Amazon is aware.", "verified": true, "helpfulness": "0/0", "author": "JRob"}, {"rating": 2.0, "review": "I I much rather prefer the XBMC midnight to whereas the repositories that I put on I do not have to pay for I can watch tons of movies absolutely free and do not have to worry about payment for purchasing them.  it seems the only thing thats good on the Amazon fire TV is the Netflix I don't like that Amazon makes you pay for absolutely everything and as far as the the button on the remote that allows you to search with your voice that is absolutely horrible everything that you search for automatically brings you to the Amazon movie search and you have to purchase or rent everything nothing on this is free I hate it.  it was found out that there is not even a power and found out that there is not even a power button it have to go in standby mode,,and I cannot to express how frustrating it was everytime when the fire  tv froze  up on me , this happened about 4 times in one night. I am not satisfied with Amazon fire TV I'd much rather stick with the xBMC Android system midnight 2. you have to watch YouTube videos to understand how it works in downloading repositories to get what you want but the entertainment is only limited I am a fan of the midnight to XBMC Android system so much better!!!", "verified": true, "helpfulness": "0/3", "author": "Steve"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Derrick Brown"}, {"rating": 5.0, "review": "Does everything it says it does. The voice command works excellent. Worth the price !", "verified": true, "helpfulness": "0/0", "author": "Michele J."}, {"rating": 5.0, "review": "This device works very well, especially with any of the Amazon applications like Prime and Audible.  Still trying to figure out if it can be hooked-up to one of the Brookstone projectors.  The backgrounds are very cool on a hi-def TV.", "verified": true, "helpfulness": "0/0", "author": "cfuentes"}, {"rating": 4.0, "review": "Like it a lot fast, hope they get more 4k shows", "verified": true, "helpfulness": "0/0", "author": "RICK C."}]