[{"rating": 2.0, "review": "Another product that doesn't seem to work for me.  More frustration on the homefront.", "verified": true, "helpfulness": "0/0", "author": "Scott E Wagner"}, {"rating": 3.0, "review": "Please keep in mind that I purchased this from Best Buy and my review is only about the device itself. I will first start by saying that this is not what I expected and I paid 37 dollars with tax. I am happy that I bought it from a retail store rather than online because it made the return process that much easier. In general, I purchased this for casting what my Android cell phone would see to my TV. But, I found that after testing the device that my cell phone would not work with the screen casting. It seems that part would only work with certain listed higher end cellular devices. Also, everything online stated that it would only work with 4.4.2 KitKat or higher? Lastly, the screen casting wouldn't work with my type of HD-hdmi type TV. I was not impressed with the quality of Netflix using the device, as I could see many of the pixels. Also, I'm not sure why Pandora didn't work. It kept saying \"Server issue\". So, that may have been with Pandora itself. I personally had high hopes for this device and I'm sure it will work better for the higher end cell phones and for certain TV's in my honest opinion. I might try it again later in the near future. But, for now.... I returned the device.... and I will just stick with my Roku for the time being.", "verified": false, "helpfulness": "0/0", "author": "Neal J Brandon Jr \"Neal Jay Brandon Jr\""}, {"rating": 4.0, "review": "Great, cost effective device.  only caution is setup can take some time so be patient.  It requires add on extensions to work with various apps so you need to download those and test them out.  Oddly enough, the Chrome browser was the only one that didn't work right, I ended up re-downloading and installing Chrome browser and it worked fine.  It occurred to me if the user was expecting full plug n play it may disappoint.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Installation was fast and painless. Since I have Fios, throughput for clean video was not a problem. Not the first choice for everyone because you need a phone, tablet or laptop to control and send content.  But it more than met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 2.0, "review": "I really like it but half the time it doesnt work!", "verified": true, "helpfulness": "0/0", "author": "Jamae"}, {"rating": 3.0, "review": "Worked for a couple of days and quit.  Unable to connect to Wi-Fi.", "verified": true, "helpfulness": "0/0", "author": "eleungus"}, {"rating": 4.0, "review": "Chromecast is okay. I had a little trouble setting it up but watched You Tube tutorials that took me through it step by step. I would recommend it for the price.", "verified": true, "helpfulness": "0/0", "author": "Oz"}, {"rating": 5.0, "review": "This is a great device! Get one. Just do it. Streaming from your phone or computer makes looking at family photos so much easier. I bring it to all the family gatherings at my neighbor's house so we can share together. The Chromecast app for Android makes it a snap to change WiFi networks. And it's so small and light it's really easy to bring along. Because it can draw power from even our older TV it has a slight advantage over the Amazon Fire Stick. But I love the remote bundled with the Amazon...", "verified": true, "helpfulness": "0/0", "author": "W. G. Leonard \"labguygus\""}, {"rating": 5.0, "review": "Perfect !", "verified": true, "helpfulness": "0/0", "author": "Vien Buu"}, {"rating": 4.0, "review": "Streaming is slow is tv is connected via wifi. With Lan cable it works better", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]