[{"rating": 5.0, "review": "I have been frustrated for some time that my Google TV wouldn't stream Hulu shows. This solved that problem in a slick way. Has proven useful for other items as well, such as YouTube and NetFlix.", "verified": true, "helpfulness": "0/0", "author": "Charles M. Krutsinger"}, {"rating": 5.0, "review": "Does exactly what it advertises. I use it for Netflix primarily. I can rig a Chromecast to my projector and have fewer cords running around as well as a remote in the form of my phone.", "verified": true, "helpfulness": "0/0", "author": "Matt C"}, {"rating": 3.0, "review": "Once this streaming device is setup it works great with the compatible mobile apps such as netflix and HBO GO. Unfortunately for me the setup process was not as seamless as the chromecast site led me to believe. My review of course is limited to my smart TV brand and model which is an LGTV from 2012 the  LM6700 series.So I installed the chromecast app and walked through the setup process of syncing to my wireless network and creating a new chromecast network to stream through from my iPad. I saw the chromecast icon in my apps now but I could not seem to get the setup screen on my smart tv to display as indicated in the instructions. I tried all 4 of my hdmi ports but I was getting nothing. So I did some google research and finally found out I should try using the hdmi port adapter that comes with chromecast device and I restarted the device a few times until it started to blink a white light and then finally got the startup screen to setup my lgtv with chromecast. So something the instructions don't tell you is that a red light in the device means it is not connecting to the network properly and to try something different. Once setup it streams great HD videos from any compatible apps on your mobile devices great.", "verified": true, "helpfulness": "0/0", "author": "Chris Z"}, {"rating": 3.0, "review": "This is a good piece of equipment I can see being used in many homes. For a very low price, it allows you to watch NetFlix and other streaming service on your TV, beamed from your laptop, tablet, or mobile device. You can also beam some webpages and use your laptop on your TV, so to speak.While it worked as advertised, I decided to not use it regularly for two reasons: (1) I want to use my laptop frequently while watching TV. With this, both devices had to be left alone. (2) It doesn't work as easily or smoothly as my Roku streaming player.I'd say it's worth trying, but not everyone will keep using it.", "verified": true, "helpfulness": "0/0", "author": "MusicSmith1"}, {"rating": 3.0, "review": "Works great for Netflix. But would love if it also worked with Amazon videos!!!!!!! Since Amazon sells it one would think you could stream their videos.", "verified": true, "helpfulness": "0/0", "author": "nan"}, {"rating": 5.0, "review": "Works kind of like a remote control for your media.Very easy to set up.I was disappointed I could not use it with my Kindle fire HD and had to buy a new tablet to use it", "verified": true, "helpfulness": "0/0", "author": "airchamp \"ariel\""}, {"rating": 5.0, "review": "I got 2 of these one was a gift ,best thing ever for the money. I use mine to stream movies off of youtube etc etc. I recommend you get one you won't be disappointed. From your PC to the big screen it still amazes me & wireless to boot.", "verified": true, "helpfulness": "0/0", "author": "Steve La Londe Jr"}, {"rating": 4.0, "review": "App support isn't great, but 99% of the time you'll just be using the big names it does support, and app support I'd growing", "verified": false, "helpfulness": "0/0", "author": "Eric Schwemberger"}, {"rating": 4.0, "review": "I love how this works I just hope google will update it to be able to support more ways to share your media.", "verified": true, "helpfulness": "0/0", "author": "Billy Williams"}, {"rating": 5.0, "review": "If you need to watch on a bigger screen and don't want to go through the hassle of going to cable/satellite tv, get this unit and all the stuff you used to DVR will be at your fingertips.  Simple and easy to use, and even if you have a problem, customer service will walk you through the installation.  It's a godsend for those who are tired of watching on your smartphone or computer.", "verified": true, "helpfulness": "0/0", "author": "Arnold Kim"}]