[{"rating": 5.0, "review": "Works great on my PC", "verified": false, "helpfulness": "0/0", "author": "James S."}, {"rating": 5.0, "review": "Good product. Works great", "verified": true, "helpfulness": "0/0", "author": "JDH"}, {"rating": 5.0, "review": "worth every penny!", "verified": true, "helpfulness": "0/0", "author": "sparrow"}, {"rating": 5.0, "review": "Love it! Great way to stream internet vídeos to your TV. I hope more apps and websites are available to stream soon.", "verified": false, "helpfulness": "0/0", "author": "mr.kennedy0"}, {"rating": 3.0, "review": "Its should have the capability of linking directly to my phone without a router.", "verified": true, "helpfulness": "0/1", "author": "Del Doty"}, {"rating": 5.0, "review": "First off this a super little device that will easily replace the built in streaming options that ship with my Vizio TV. Much nicer to use my smart phone to fling content than the clunky built in TV UI. High quality streams that start fast. I hope more apps include Chromecast support, especially Amazon VOD. This should be the thing that pushes Amazon into releasing a non-Kindle VOD player. The marketing material sadly leave off any mention of Linux, but this works perfectly fine casting URL's and tabs from Chrome on Linux. I am a bit disappointed that I have not received the promised 3 months free Netflix promo code. Google ended the promo quickly, but should at least honor it for devices purchased the first few hours of release.", "verified": false, "helpfulness": "1/1", "author": "WARREN Avram"}, {"rating": 4.0, "review": "Its a good product but I think that they will improve it son.", "verified": true, "helpfulness": "0/0", "author": "Bud Spencer \"Sam\""}, {"rating": 3.0, "review": "This gadget is fine but it needs a lot of improvement. it is limited to some applications.", "verified": true, "helpfulness": "0/0", "author": "Hani"}, {"rating": 3.0, "review": "Its ok but a little quirky, need to spend more time with it. But for the price you cant go wrong.", "verified": true, "helpfulness": "0/0", "author": "sean"}, {"rating": 5.0, "review": "Very easy to use and cast webpages onto my TV. Great buy for the price!", "verified": true, "helpfulness": "0/0", "author": "H. Rao"}]