[{"rating": 5.0, "review": "This little gadget is great and easy for those of us who are electronically challenged. My husband says it's the best $35 I've spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "donnabicycle"}, {"rating": 2.0, "review": "I have Verizon FiOS, and ChromeCast does not work with FiOS right out of the box.  You have to turn on UPnP (off by default) and turn off IGMP (on by default), and then it is flakey, at best.  After enabling UPnP and disabling IGMP, I still couldn't get it to connect, but I kept reading different chromecast forums, and someone suggested to use the setup app on your android phone.  I used that, and I had to reboot the chromecast device a few times, before it would finally connect to my network.  Then, it connected and updated its firmware, and when it rebooted, it couldn't connect to my network, again...so I had to reboot again, and it did connect.Also, the device does not have any stand alone apps built into it...you have to \"cast\" (aka broadcast) audio and/or video streams to it, from apps on your phone, tablet, laptop, or other wifi enabled device.  So, it will not work by itself.  Because you have to broadcast multimedia streams to it, this is why you may have trouble getting it to run on your network equipment...because the equipment has to be configured to allow network broadcasting.Bottom line:  I prefer my Roku!  The Roku is a stand alone device, and easily connects to any wifi or wired network...no fooling around with UPnP...and, no reliance on another device for your multimedia streams.  I'll probably keep the chromecast, in case I do any travelling and want to watch netflix on a hotel room tv...but, that's probably all I'll use it for.", "verified": true, "helpfulness": "1/1", "author": "Carl Sullivan"}, {"rating": 5.0, "review": "Having this has already saved us $100 on cable. Works well with all of our electronics and we are getting another. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Lisa D Thomas-Sherrill"}, {"rating": 3.0, "review": "The title says it all. The Chromecast has its pros and cons.Pros:You can cast any tab in your Chrome Web Browser and the quality is very good. It's neat to check the weather, sports, gmail and anything else you would like from your laptop or other device. It was also very easy to setup!Cons:For being a wireless HDMI adapter, it's very choppy when running Flixster, Hulu and Netflix... Even when turning down the resolution... Which I shouldn't have to... My router is only 1 years old and any device I own gets amazing connection. I'm very dissapointed in this area if you can't tell. The other downside is it only can cast from a web browser. So if you purchased this device thinking you can stream movies or music from your desktop, think again.Overall this is a good device but Google could have made this much better. Seeing as this is their first attempt in a streaming media device it will only get better. Right? RIGHT? I hope so too.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 4.0, "review": "Good, innovative device. Its works great if your ok with only having netflix and Hulu. I was very disappointed to find out it doesn't support Amazon instant video. I got this for my daughters room instead of paying for another directv box. She loves Dora the explorer and Amazon instant is the only one that streams it now.", "verified": true, "helpfulness": "0/0", "author": "James Barnes"}, {"rating": 4.0, "review": "I'm haven't worked with it long.  While I have more cons than pros at the moment, most of them are just because I'm still figuring it all out.  So far:Pros:*  Easy to setup* Quality is good (when working as expected)* lots of potential. APIs are out there and there are tons of apps waiting to come out (see below)* Comes with all you needCons:* They don't show the USB power supply you need to get it working.  It's included, and you can use the USB port on your TV instead, but the ads make it look like just a dongle* Don't expect an AppleTV killer here.  The unit has no real brains but rather allows you to use apps on other devices on your TV.* Google has been stingy with approved apps so far.  Only about a dozen.  Many apps have been written with their APIs but Google is no letting them out the door for some reason.  They promise 'soon'.* You can only view LOCAL FILES with Plex (paid version) or via the Chrome browser.  The quality via the browser is not as reliable as from apps, so it's not going to be a media hub without Plex or some upcoming app.It's really a nice device but, until Google frees the reins on developers, it's a device that doesn't win the race.  Hopefully, we'll see apps come out soon, before some other device steals it's thunder.  For simple computer screen and approved app use, it's great!", "verified": false, "helpfulness": "0/0", "author": "MMS"}, {"rating": 3.0, "review": "This works great with YouTube et al, but not so well with other streaming video sites.  On other sites the picture can be jerky, the audio out of sync with the video and it will sometimes just stop working in the middle of the cast for no reason, even though it had been working perfectly the second before.  I tried watching something from PBS yesterday and finally just gave up, but the day before I watched a TV show with no problems.  But it is still in the Beta stage, so hopefully this will improve.", "verified": true, "helpfulness": "0/0", "author": "Valueminded \"leadpedal2\""}, {"rating": 5.0, "review": "Finally bought it from Walmart 30 miles away after it being sold out at all electronic store. I really love how clear the videos are, even those not streaming from youtube or Netflix. I really hope Google makes a separate keyboard to control the TV through chromecast, that would be so awesome!", "verified": false, "helpfulness": "0/0", "author": "ag"}, {"rating": 1.0, "review": "Your supposed to be able to mirror web pages on your TV and play Video's.  While it plays Netflix, Youtube & Hulu by casting them directly to your TV screen it will not play other videos from a web page without hesitation and glitches.  I was hoping to be able to view the network full episodes they offer.  But this device does not do that without problems.  If you're looking for something to cast netflix from your devices then this will work for you.  But it is not good for mirroring your computer to your TV screen as it advertises.I returned it disappointed Google offered such a poor product; oh and it only work with a chrome browser.", "verified": true, "helpfulness": "1/3", "author": "Buster"}, {"rating": 4.0, "review": "This little device is exceptional. Very useful in playing content on TV. Netflix, YouTube, Google Music Play All Access, Pandora etc. Four star because it is not very smooth when multiple devices are connected to the same chromecast device. Some times it just starts over the you tube queue. Sometimes when you connect your device to chromecast, it just stops what's it is currently playing.", "verified": true, "helpfulness": "0/0", "author": "lobo"}]