[{"rating": 1.0, "review": "There are a lot of people confused by the Cast resolution settings in Chrome vs the (nonexistent) HDMI resolution settings.  The HDMI output of the Chromecast device appears to be fixed at 1080P as soon as it hits the welcome screen.  The output is at a lower resolution as it boots, and is viewable for a moment on lower than 1080P resolution displays.If your display, or any devices between your display and Chromecast (receiver, etc.), do not support 1080P, then you will get no joy.  The Casting resolution issues are purely about the quality of the display that you get and not about a failure to display at all, so are less of an issue than HDMI resolution.Google needs to either fix this issue or be clear about the system requirements, as they are entirely focused on the requirement of the machine running Chrome at the moment, and not the Chromecast device or connected display.Google has also advertised devices as connectable which are not at this time. No iOS device support on release even though they clearly state that it's available.", "verified": true, "helpfulness": "8/36", "author": "C. Stauduhar"}, {"rating": 5.0, "review": "great product, great concept.Wish google can make this last.waiting for more apps and more programs.Can this be android system?", "verified": true, "helpfulness": "0/1", "author": "zRocket"}, {"rating": 5.0, "review": "This little device is by far one of the coolest things I have ever purchased, and it works wonderfully. For anyone who utilizes the Google ecosystem, this is a must have. I currently subscribe to both Netflix and Google Music All Access, and this thing is worth it for those two services alone. The ability to painlessly control playback of my entire music library from my pocket is a dream. I've been waiting a very long time to be able to do this, and Google has nailed it. Netflix works great also. I no longer need to haul my PS3 from room to room when I want to watch something. Of course this isn't an issue for anyone with a Netflix capable device in each room already, but it solved my problem. And anything else stored locally on my computer can be streamed directly to the device through Chrome. I have it all! The Chromecast is already a home run, and it will only continue to get better as more developers hop on board. A must buy.", "verified": false, "helpfulness": "0/1", "author": "Pat"}, {"rating": 5.0, "review": "Setup was very easy.I had been looking into possibly purchasing a wireless HDMI transmitter which would have cost at least a couple hundred bucks, in order to be able to stream some web content (e.g. korean dramas from a popular online site), but decided against it as I strongly suspected that it would probably not work too well through walls.Basically, with this Google Chromecast, and it's tab casting feature, I am able to view those Korean dramas on my big screen tv seamlessly and easily.  Quality is pretty decent, although I just realized that the default setting at the aforementioned site is only 360p (I'll most likely do some experiments with setting it to 480p/720p). But even the 360p setting is very watchable on my 50\" tv. Interestingly, in my particular case, my computer is connected via wifi, so basically my computer is streaming the video via wifi and then casting the video via wifi to the Google Chromecast gadget. So even though it's maintaining two concurrent wifi streaming connections (from Internet to computer + computer to the Google Chromecast dongle), it's very acceptable in terms of the video quality and performance.Once I had enabled the HDMI-CEC feature on my plasma tv, the Google Chromecast gadget will actually turn on my tv and switch to the correct hdmi input automatically, which is *very* cool.So I can cast a YouTube video to my television and it will automatically turn on my tv and start displaying the video. Without the HDMI-CEC feature, I would normally have had to manually turn on my tv, switch the hdmi input to the hdmi input corresponding to my Google Chromecast gadget. Note that your television has to support HDMI-CEC and you may then have to manually enable it (check your tv's menu settings). For my television, the option was called: AnyNet+ (HDMI-CEC), and I had to explicitly enable it.So far both Chrome casting, via YouTube and Netflix, and Chrome browser tab casting have worked almost flawlessly.Helpful Tip: I changed my computer monitor's resolution setting from 1920x1200 to 1920x1080, so that the Google tab casting feature would work better with my 1920x1080 tv. Prior to this change, sometimes the video subtitles would get cut off, in fullscreen mode, due to the differing resolutions between my computer monitor and my television.  Hopefully, Google will update their tab casting feature so that the user can specify that he/she wants to cast the full screen to either a 1920x1080/720x1280 screen target, instead of using the computer monitor's fullscreen resolution.The one downside, is that once you start the playing the video, there's no easy way to do a 10 second rewind or pause the video (bathroom break, etc). One workaround is to use the Wyse PocketCloud app from my iPad/iPhone/iTouch to remotely login to my computer to pause playback, but this is a bit awkward..As an aside, I think I made the cutoff for the free Netflix 3 month promotion by about 8 minutes, so my effective price for this dongle was about 11 bucks ! :).", "verified": true, "helpfulness": "2/3", "author": "Gino Lee"}, {"rating": 3.0, "review": "It's ok.  That's the best I can say.  It's nothing impressive.  It barely works.  It's pretty useless with iOS, unlike what it says.  So you can watch netflix, big deal, so can 10 other things I own.Now the price is going up on it?  Don't waste you time, until they add more compatibility.", "verified": true, "helpfulness": "3/12", "author": "Nicholas Revitzer"}, {"rating": 4.0, "review": "Like many people, I ordered Google's Chromecast as soon as it was available, swayed by the $35 price point. After setting it up, I'm not disappointed at all with this purchase.The Chromecast's main draw is the ability to immediately stream (\"cast\") content from an Android phone or desktop PC running the Chrome browser to an HDMI-compatible TV. Right now, the Chromecast is compatible with the Netflix, Google Music, and Youtube apps, and you can also cast Chrome tabs.Setup is a fairly easy process, as long as your wi-fi works: just plug in the Chromecast into your TV, switch to the correct HDMI input, and follow the prompts on screen.All in all, the Chromecast works well, albeit sometimes stuttering or requiring a quick refresh when using it for web browsing. Right now the device is more about the potential (new developments are occurring almost weekly, with Cyanogenmod announcing Chromecast support in future versions) than what it's capable of. Either way, it's a great little device.", "verified": true, "helpfulness": "3/5", "author": "C. Wang"}, {"rating": 4.0, "review": "Got mine from back order last week and I must say, I'm quite impressed. The ease of use is astonishing. Some people claimed problems setting this up with an iOS device, I had no problem whatsoever setting this up with my iPhone and then linking it to my tablets, desktop and laptop. No matter what I'm doing I can throw a browser window on the screen, whats more - if it's something like HBO GO, I can just hit the maximize button and it looks perfect on the tv (No frames or borders).One problem I did have was based on the bandwidth of my router. I suggest a dual channel if you're going to stream a browser window. Run the computer off of the 5 ghz and the Chromecast will pick up the lower frequency. Once I replaced my router I had zero lag issues.All in all a great product and easily portable.", "verified": true, "helpfulness": "3/4", "author": "David M Centrella"}, {"rating": 5.0, "review": "With the Netflix credit, this device is extremely affordable. As soon as more applications begin to follow suit, I'm sure it will be great.", "verified": false, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is one of the best buy for 2013..I good and you know its going to get better..I am ordered 3 more for each TV in my house..Here is my YouTube Video link [...]", "verified": false, "helpfulness": "3/4", "author": "Charlie"}, {"rating": 3.0, "review": "hopefully there will be an update to allow small apps without a need for a pc/smart phone other than to be a remote.Does what it says, but seems like it should be able to do more. Be nice to add support for the whole PC instead of just chrome, that way you can stream your gaming or other apps.", "verified": true, "helpfulness": "0/5", "author": "mdambach"}]