[{"rating": 4.0, "review": "Great product. Works the way it says. User friendly. Only wish it could stream local files without having to convert them through third party services.", "verified": true, "helpfulness": "0/0", "author": "Palmer"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Kenneth Warwick \"A reader\""}, {"rating": 1.0, "review": "Don't waste your time and money if you hope to stream Amazon Prime via an iOS device (iPhone, iPad, etc.). It will not work. Not consumer friendly due to Google, Amazon and Apple not working together.", "verified": false, "helpfulness": "1/2", "author": "Karin Mack"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Mike Franklin Jr"}, {"rating": 1.0, "review": "Cool. Now you can easily watch your android phone videos on your TV with Chromecast. Right?  WRONG!!!  No, you have to find another file explorer app, install that.  Then install add on for that.  Then browse through all your phones folders and files and hope to find where your videos files are stored. Find the one you want.  Open with the file explorer... and so on.  Ridiculous.  Way to support your own products Google. :(But you can watch videos from vudu, and netflix, and whoever happens to make an app that supports Chromecast. Then use your phone as the remote control, where every app works differently.  Good luck pausing and rewinding to hear something you missed. Wow...", "verified": false, "helpfulness": "1/1", "author": "Kevin Finck"}, {"rating": 5.0, "review": "If you do streaming, you need this.", "verified": true, "helpfulness": "0/0", "author": "suzieq413"}, {"rating": 5.0, "review": "I love this product.  Works as advertised with Apple Extreme and iPhone.", "verified": true, "helpfulness": "0/0", "author": "Piotr"}, {"rating": 4.0, "review": "Works great but sometimes doesn't recognize", "verified": true, "helpfulness": "0/0", "author": "Somashekarappa"}, {"rating": 4.0, "review": "LOVE IT!Had an older tv non wifi. This has given me another 2 years before an upgrade", "verified": true, "helpfulness": "0/0", "author": "Erick C"}, {"rating": 5.0, "review": "Very happy with product", "verified": true, "helpfulness": "0/0", "author": "Evie"}]