[{"rating": 2.0, "review": "I unfortunately did not have this great experience that everyone else does.  The image is blurry, and jumpy, and the sound does not match up with the people talking.  I will just stick to running a cable to the TV, for perfect picture and sound everytime!  While $35 isn't much, it was a waste of money.", "verified": true, "helpfulness": "1/1", "author": "Richard Howie"}, {"rating": 5.0, "review": "We regularly watch netflix through this.  Easy to control with our phones or ipads and once the content is streaming we can use our phones // tablets for other browsing or apps.  We also have occasionally cast web pages.  We like no longer needing to have our ps3 on.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fantastic. Bought two immediately. Being able to quickly cast up to the tv is great. Kids love it. Would like better casting of desktop but that is still in beta, no doubt it will be better.  YouTube and Netflix was the real reason I got these and they run perfect.", "verified": true, "helpfulness": "0/0", "author": "Brandon Cariveau"}, {"rating": 4.0, "review": "I have a question......I have chromecast and works great with Netflix YouTube but it says I need to get an extension to work with HBO GO.  I downloaded the one market app n downloaded chrome but I'm still having problems cause I can't get into chrome web store.  Someone please help me. I'm subscribed to HBO GO also so it works on my Kindle fire hd 2nd gen but can't cast it.  Someone please give me instructions on how to get the right Google chrome and get to the webstore.  Yes I have it on my pc.  I have Google Cast on pc and sync to phone/tablet.  I even bought Google sync on kindle app. Thank you.", "verified": false, "helpfulness": "1/1", "author": "Michael Kalinoski"}, {"rating": 1.0, "review": "Update 3 months later- After \"gifting\" this useless device to different family members I have spent hours helping them understand how this silly little device \"works\" (without letting them know my true thoughts, telling them it's cool. LOL)The biggest complaint from each of them is \"Why do I need this\" even after demonstrating it to them.Aside from it not being a stand alone device the ONLY way to control what you are watching such as simply selecting what you want to watch, Play, Pause,FFW, and Rewind or any other control other than actually turning the volume on the tv up/down using the TV remote, is to use the casting device! So that makes a total of a minimum of THREE devices just to have the limited basic functionality! And did I mention they have NO support line! Need I say more.Really underdeveloped device. Very tech savvy and did my homework but thought I could figure \"suitable\" workarounds for this device's short comings but there was nothing satisfactory. The device itself does nothing without a \"compatible\" device to stream from and even android dlna apps don't work. This is pure garbage if you know anything about what this device promises. Why would I want to tie up my cell phone or computer to stream netflix, hulu and the VERY few other apps it supports. To top it off there NO phone number to call for support and I see why! My father always told me \"you get what you pay for\" well in this case he was slightly incorrect. With this you get LESS than what you payed for! This is not sour grapes because I own a great Google TV and totally satisfied. I bought TWO of these things so family members could have a cheap solution to at least get some of the capability I have. I DO NOT RECOMMEND THIS AT ALL!!!! Invest in a smart blu-ray player that you can find on sale for about $20 more!", "verified": true, "helpfulness": "1/6", "author": "James Collins"}, {"rating": 5.0, "review": "absolutely amazing. love watching youtube and Netflix. It is the perfect size and I can carry it around with me", "verified": true, "helpfulness": "0/0", "author": "Dayanara Urena"}, {"rating": 3.0, "review": "It work only with Netflix and youtube so far, I hope. What about the media in my device?Nevrless still do really good with those two programs.Looking forward for an update that wide the options.", "verified": true, "helpfulness": "0/2", "author": "meme"}, {"rating": 5.0, "review": "The Chromecast is a useful, though somewhat limited, device for casting multimedia directly from your computer or android device. In the box is the actual Chromecast, a USB to micro USB cable and a power plug.The Chrome cast plugs into a free HDMI port in the back of your TV. It needs power so it can either be plugged into a USB cable in the back of the TV, or you can plug the included USB cord into the power plug (included) into a wall outlet.Installation is easy. You simply plug the Chromecast into your TV, turn your TV to the required HDTI outlet and the Chromecast prompts you through installation.  In less than 5 minutes i was casting things from my PC and tablet to the device.Anything that casts content to the chromecast must be on the same WIFI connection as the Chromecast.Casting from PC requires you to have Google Chrome installed and the Chromecast Extension activated on the browser. Casting from your Android phone or tablet requires you to install the Chromecast app. All of which are free and easy to install.Right now the primary apps that can cast from your Android device to the chromecast include Netflix, HBO GO, Hulu Plus, Youtube, and Pandora. Those apps have a cast icon in them when they are open, so when you want to cast to the Chromecast, you just push the button and you are off and running.You can cast  anything from your computer's broswer. So if you happen to have Amazon Prime streaming, you can stream from your PC and then cast to your Chromecast.Also, though the Chromecast does not have native ability to view videos from your PC, since the Chrome browser can natively play videos in it, you can simply drag your videos to the browser or open them as files. Since they'll play in the browser, and you can cast from the browser to the Chromecast, you can then view videos and content from your PC on the Chromecast.This also means that you can use your TV as a large screen for browsing the web, viewing content from websites like Prezi and Google Docs.The Google Chrome app for android devices does not currently support casting, but I hear that is coming.There is also no native app for the Kindle Fire, but there may be a work around, and when I get time i'll try that out and post my results then.I like this Chromecast so much that I am going to cancel my Xbox Live Gold subscription as most of the multimedia content I use that for is available through Chromecast.", "verified": true, "helpfulness": "3/3", "author": "Tom B."}, {"rating": 1.0, "review": "The ONLY reason this gets 2 stars is because of the price.  If it were more expensive, this would be a 1 star item.There is a lot to complain about:- Tab casting is nice (though a bit flaky at times).  Too bad I can't tab cast off of my tablet or phone, which is what I really want to do with this.-  Can't power itself off the HDMI (yes, I hooked to a 1.4a device, still had to use USB).  Luckily there is always something around with an open USB port so I didn't have to plug it into the wall.-  Google killed local streaming.  No tab casting on mobile browsers + no local streaming anymore killed 80% of its use.-  No Amazon Prime streaming app, only can be done through tab casting.  Crap.-  The Chromecast App is a freaking joke; just a setup App.Such a limited device - I'd rather spend a little more on a much more capable device (which I have). I have an Apple TV 3, PS3 and Roku 2 XS...devices that are all far more powerful/useful than the Chromecast.  I downgraded the Chromecast to our TV in the loft that rarely gets turned on, just so I'd have something I could stream to there.My hope is that Google will get their software together and make this a better device because right now it just sucksEdit:Months later and I'm downgrading to 1 star.  What a piece of junk.  We started using Netflix streaming and boy what a POS it is on the Chromecast.  Takes forever to load and random buffering.Before I get blamed on my ISP / Wireless network, I have no issues streaming Netflix on my iOS Devices, Apple TV 3, PS3 and Roku 2 XS.  ONLY on the POS Chromecast.  It shows full wireless signal bars on it.  I tried with and without the extension dongle.  My wireless network is very robust (using a Linksys E4200 V2 router, not some cheap POS).  No overlapping wireless signals in the area as our homes are spread apart pretty far and inSSIDer found nothing in the area.  Unplugged all 2.4 devices that could interfere - and again, NONE of my other wireless devices have problems, only the stupid Chromecast.Don't buy this junk.  It may be cheap but if it barely works why bother?", "verified": true, "helpfulness": "1/2", "author": "Nitrousbird"}, {"rating": 1.0, "review": "It does not get along with my router and this seams to happen allot seeing they directed me to a list of routers it does not get along with and technical manuals on this that make no sense.", "verified": true, "helpfulness": "1/2", "author": "Syl"}]