[{"rating": 5.0, "review": "its amazon fire whats not to like, easy install don't forget to order your HDMI cord.", "verified": true, "helpfulness": "1/1", "author": "Shelly Quick"}, {"rating": 5.0, "review": "My wife and love Amazon TV.", "verified": true, "helpfulness": "0/0", "author": "Rick Billings"}, {"rating": 5.0, "review": "love it,,,,goodbye to Cable 4ever!  lots of apps; also, lots of great kids games.", "verified": true, "helpfulness": "1/1", "author": "bill"}, {"rating": 5.0, "review": "Great product, highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Jeff Redman"}, {"rating": 4.0, "review": "great invention", "verified": true, "helpfulness": "0/0", "author": "G.W."}, {"rating": 5.0, "review": "I love love love my fire tv. It's easy to use & functional. I think anyone, young or old, would love this product. I use it daily and have yet to have a problem with it. I love the voice search feature. It's very accessible. Great product.", "verified": true, "helpfulness": "0/0", "author": "Maggie"}, {"rating": 3.0, "review": "I would give it five stars, but it does not allow you to get some of the best channels  (Disney, Showtime, History, and more) if you are a DirecTV subscriber. Because of that my 3 star rating is generous.", "verified": true, "helpfulness": "0/0", "author": "Scott Vandivier"}, {"rating": 3.0, "review": "I bought the Fire TV on sale after my Roku died without much warning. I read a bit on the comparisons, but I've been in no way dissatisfied with the Roku's performance. The main selling point for me was the Prime integration and the overall specifications of the Fire TV. The fact that it's Android based also helped somewhat, as I expected to see a lot of existing apps appearing to fill any voids.My first unit was DOA. Customer Service was extremely responsive and helpful, but it took a week to get a replacement unit. The second unit has been fine, setup was easy and getting up and running took almost no time.I have noticed a lot of choppiness in video playback, at one point it became so bad I had to do a soft reset. I am also disappointed in the small number of apps and the limited way to actually find useful ones. Overall the unit still just seems like a new platform, I certainly hope that over the next few months it will become stable and more robust, the potential is definitely there. Really looking for HBO GO, too!", "verified": true, "helpfulness": "1/1", "author": "miro"}, {"rating": 5.0, "review": "The High Definition graphics are the best. The remote is very easy to use, I specially like the voice recognition function.", "verified": true, "helpfulness": "0/0", "author": "Edwin Aviles"}, {"rating": 3.0, "review": "would love to turn off seach for pay movies.  I have Netflix and Amazon Prime but do not want my kids to buy movies.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}]