[{"rating": 5.0, "review": "This is such a terrific product!!! My husband is always on me to look things up for him on the internet because he is not interested in becoming computer savvy and then insists I read the pages to him because the print is so small. With this gadget everything I put on the computer can be shown on the television so now he can see what I pull up and he can actually read it in a print size that works for him. Additionally, the shows I can \"cast\" onto the tv that we can't get on the cable really give us the freedom to watch a much wider variety of programs. On top of that, since we have  a Wii connected to the living room tv you would be stuck there once you started watching a program. Now, with the Chromecast, we can start tv in the living room and then move into another with the computer and continue watching the same show on another tv. Further, it's possible for each of us to watch what we want--he can watch Netflix in one room and I watch Hulu in another on that tv. No more small screen viewing for us.", "verified": true, "helpfulness": "1/1", "author": "Debra"}, {"rating": 4.0, "review": "Love this product. Shipping was fast and instruction are on the product once plugged in. No paper instructions included.  Might hv to be a bit of a techi to get it installed but patience and a bit of reading the screen will get you there", "verified": true, "helpfulness": "1/1", "author": "Carol dekubber"}, {"rating": 5.0, "review": "Excellent five stars :)", "verified": true, "helpfulness": "0/1", "author": "sebastian valerio R"}, {"rating": 5.0, "review": "Works great, easy to use easy to instaa.", "verified": true, "helpfulness": "0/1", "author": "fernando espriu"}, {"rating": 5.0, "review": "love watching my shows at in the TV, Netflix HBO hopefully can stream more apps", "verified": true, "helpfulness": "1/1", "author": "pablo13"}, {"rating": 5.0, "review": "Goggle da best!", "verified": true, "helpfulness": "0/1", "author": "Nhi H."}, {"rating": 5.0, "review": "easy to install", "verified": true, "helpfulness": "1/1", "author": "gourav kumar"}, {"rating": 5.0, "review": "Excellent device. Beyond my expectations", "verified": true, "helpfulness": "0/0", "author": "Ravindra Reddy"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "taylor francke"}, {"rating": 5.0, "review": "Love this thing, need to order a second one!Love hbo go", "verified": true, "helpfulness": "0/0", "author": "DACID"}]