[{"rating": 4.0, "review": "So this is not exactly an Apple TV or a Roku.  It does stream videos from Netflix and Youtube and that's about it for most people.  Once you accept what it is then it's actually not that bad.  You can fire up the videos and still use your phone or tablet to do what you need to do on the side.If you are looking to buy this just be aware that it does not project your tablet/phone.  You simply use your phone/tablet as your remote to fire up the video, and then the Chromecast will take over and stream the video itself.  That's all it does.", "verified": true, "helpfulness": "1/1", "author": "laughtalk"}, {"rating": 4.0, "review": "i already own smart tv. this is much faster than the tv to play youtube, netflix from ur cell phone, macbooks etc. only drawback is u cant play local files on your laptop or cellphone. multiple devices can stream at same time without even having to pair.", "verified": true, "helpfulness": "0/0", "author": "r pot"}, {"rating": 5.0, "review": "Ever since our Wii broke, I use it all the time (everyday), for streaming Netflix and youtube...I would recommend this product and Amazon...", "verified": true, "helpfulness": "0/0", "author": "Sue Miller"}, {"rating": 2.0, "review": "Price is right and its tiny, then you find out it needs to plug into the wall with its own power source. Wasn't willing to run a extension cord through the wall just for this little guy. kind defeats the compact size of the design. disappointing.", "verified": true, "helpfulness": "0/0", "author": "Richard Zaragoza \"Richard Zaragoza\""}, {"rating": 5.0, "review": "The Chromecast works very well.  I have a smart tv, but use this as well at home and for travel.  It is simple to use, it syncs with your wireless connection.  Once you have the tool in chrome you just click a button to watch.  I also like the images that it displays when it's not in use.  For the price you can't really complain either.", "verified": false, "helpfulness": "0/0", "author": "flutek"}, {"rating": 3.0, "review": "I rate this at 3 stars only because I am trying to use it with my desktop computer.  This device really is not intended to be used with this computer, so it is not surprising that it is inconvenient trying to use it this way.  I'm sure it works much more satisfactorily with a laptop or tablet.", "verified": true, "helpfulness": "1/1", "author": "Roland F. Hartley \"Kyro\""}, {"rating": 3.0, "review": "Thats all.Only with a Google Chrome Browser, netflix, youtube, it works \"fine\". Sometimes doesnt leave setup. It overheats quite", "verified": true, "helpfulness": "0/0", "author": "Alejo163"}, {"rating": 3.0, "review": "I know this is bleeding edge, but with only streaming from Chrome on a PC and built in Netflix, it hasn't lived up to my expectations.  I was hoping I could stream from my tablet, but that is not the case.  Hopefully more streaming options will come up in the future.  Great idea.", "verified": true, "helpfulness": "0/0", "author": "chadginoza"}, {"rating": 5.0, "review": "This is a great wireless connection from your computer to your TV. I watched several football games the first weekend I got it on ESPN3. Easy to set up.", "verified": true, "helpfulness": "1/1", "author": "Robert D. LeBowsky"}, {"rating": 4.0, "review": "boy things have changed they have wireless connection... love this item Wish it used 3G/  right from phone to tablet", "verified": true, "helpfulness": "0/0", "author": "Thicrae"}]