[{"rating": 3.0, "review": "Home Wi-Fi saw the device but could not activate it using Windows 8.1.  Looked on the internet and saw many, many recommendations to change my router settings.  Tried them all to no avail.  Purely by accident I had to boot up my Windows 7 laptop for retrieve some forgotten files.  The device immediately was recognized and began to update itself.  Same device same home network.  Only difference was operating system.  Windows 7 versus Windows 8.1.  After the device updated itself I then booted my Windows 8,1 system and voila there is was.  Google really should find a better way to do updates than via it's own device unless they make it OS neutral.", "verified": true, "helpfulness": "0/1", "author": "Carl A. Echols \"boomer46\""}, {"rating": 5.0, "review": "it does everything claimed, it does it well.  It even turns on my TV when I start a cast!  :)  Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Gary E. Wilson"}, {"rating": 5.0, "review": "Does it exactly what I wanted it to to: streams Netflix and Youtube (as well as other programs I have not used yet) on TV effortlessly.  Just a quick set up is required.", "verified": true, "helpfulness": "0/0", "author": "Mayor With A Beard"}, {"rating": 5.0, "review": "Although limited in the content you can stream, this is a handy solution to deliver content like Netflix.  I used this on TV's around the house that didn't have a smart receiver attached.  By setting up the device once, I am able to move it throughout the house and control it with my phone/laptop/tablet with ease.  I can even control the volume remotely.5 stars!!!", "verified": true, "helpfulness": "0/0", "author": "normster"}, {"rating": 4.0, "review": "I am an owner for about 20 days now.  Here is what i can and cannot do as of Dec  15, 2013:1.  Without going thru the browser, it can stream to your TV EVERYTHING you see on your computer EXCEPT FOR THE SOUND (click on  \"cast this tab to...BETA\"  then select the \"experimenta'l\" option)2. It can stream everything you see in your (google chrome) browser including the sound.I have noticed that there are times that it gets disconnected,  does nto happen too often but it does happen - meanwhile your laptop plays.  So it is NOT PERFECT.Once they are able to send sound to the the TV along with the pic without the browser then it would be AMAZING.Yes, it is worth owning one.  Thanks.", "verified": false, "helpfulness": "0/0", "author": "gg"}, {"rating": 4.0, "review": "Google's support for apps is severely lacking at the moment (though this is as-advertised). Excellent way of viewing YouTube or viewing web pages together.", "verified": false, "helpfulness": "1/1", "author": "Clare Davidson"}, {"rating": 4.0, "review": "It works very well with YouTube. Very easy to set up. Casting tab does not work very well (beta). I would have given it 5 stars if I could do more with it. I am waiting for the next software update for more functions.", "verified": true, "helpfulness": "0/0", "author": "mwhmkd \"mwhmkd\""}, {"rating": 1.0, "review": "This might have been a great product, however Google made a mistake they valued the wrong clients over the customers who would be using this product.  This product does not product an HD picture its 720, so Strike one, This product requires an internet connection to work, (if you have anything less than super high broad band sadly, you will not appreciate this product at all)I really wanted to be able to easily display our own video without attempting to use the internet to upload then download to our TV.Strike Two...This product was neutered, because of corporate interests in DRM technology, they are so worried that someone might stream a movie that did not come from a paid subscription service, IE, they want you to become a customer of a paid subscription service, so were devalued as a consumer.Strike Three.When Digital Rights trump the consumers right to use the products they buy this is the last straw, This is like buying a blender and then having someone say sorry, but you cannot use that blender to make a strawberry smoothie, because someone owns the patent on making strawberry smoothies So sorry but you cant your the product you purchased to do what you want to do without us giving you an authorization to do so.All I wanted to be able to do was to stream a video from my iPad directly to the TV we do not have fast internet in fact we cant even watch a youtube video, without it breaking up.So, we needed a solution which would allow us to use a device to directly stream the content to the TV, but Google values its corporate masters over the end user.I am sick of this corporate greed and cheap valueless products that are advertised on TV as if they are the latest great thing.This is the worst product I have ever seen its just garbage and trash.", "verified": false, "helpfulness": "7/12", "author": "M. franklin \"The Real Granny is in Town\""}, {"rating": 5.0, "review": "This is a great device to allow one to use Netflix and other streaming services from any HDMI-capable TV in your house.  We use it with Google Chrome (from laptop computers) and the iPad app, and both work great.  Definitely a great device at a great price.", "verified": true, "helpfulness": "0/0", "author": "J. Mangum \"AstroDude\""}, {"rating": 3.0, "review": "The chromecast was delivered as advertised.  It installed properly but is choppy during streaming.  It freezes up alot.  Some streaming items work perfectly but others are not good at all.", "verified": true, "helpfulness": "1/1", "author": "mothoma9"}]