[{"rating": 1.0, "review": "From a purely engineering design perspective is a great product. But we are trying to use this product with Netflix outside the US, and Google controls the IP addresses so it does not aloud the Chromecast to use the routers IP settings to be used. So if you intend to use this gadget overseas, be warned that you will not be able to access all the movies available. Kind of like the Sony sindrome with the minidisk, a great product but so much constrained by the big movie and music companies that Sony lost its technologicql advantage.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love the Chromecast however Google needs more partners the 14 apps are no where near enough!! This really is great for watching movies from any laptop but no smartphones.", "verified": true, "helpfulness": "0/0", "author": "cpeay"}, {"rating": 5.0, "review": "The Google Chromecast is a very unique and interesting product that is very reasonably priced. Very Satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "So SO So happy with this tiny device!  I can't believe that I can stream movies from Netflix and Hulu from my phone (or ipad) to the TV wirelessly!  It is excellent.  I do not have cable and live in an area with no \"free\" stations.  This product was SO SO SO worth it!  Everything I needed was in the box, set up took a few minutes, it works effortlessly. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Sada"}, {"rating": 5.0, "review": "bc Charter was unable to provide service that didn't break daily multiple times, i was forced 2 get ATT U-verse, which is only available at its slowest speed where i live (instead of 40 ms ping, more like 200ms ping).  Turns out, by running Netflix thru my 'droid smartphone, I can get HD (which I can't get thru my lapton/HDMI connection).  Plus don't need a laptop and easier 2 control.  and NO hdmi cable.  BUY IT!", "verified": true, "helpfulness": "0/0", "author": "Jacob Reames"}, {"rating": 2.0, "review": "I have owned the chromecast for about a month and am very disappointed. Though a great idea and very affordable, the device hardly works. I have a iphone 5, a 'new' ipad (not sure what this generation is called), a droid 4, and an NP computer running windows 8. The ipad usually works, the iphone, android, and computer do not consistantly work. Currently, after very good tech support phone help, the device no longer connects to my wi-fi router, which is on the approved list (and worked up until today). This was a terrible purchase. I very much hope that the device receives an update in the near future and begins to work well. After seeing the apple tv, I know what capibilities something like this should have, but it doesn't. The idea is outstanding, the product is not. I would not recommend this to a friend, but an enemy I would buy it for. On the plus side, google tech support is 24hours/day and very friendly.", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 5.0, "review": "Item exceeds expectations you can stream fr PC to.tv in seconds set up is easy I highly recommend this product", "verified": true, "helpfulness": "0/0", "author": "Trey Leonard"}, {"rating": 1.0, "review": "The only real benefit with this device is that it will allow you to play YouTube from your phone.  I was really hoping this would let me watch Amazon Instant Streaming.  No such luck.", "verified": true, "helpfulness": "0/1", "author": "Kelly Ruppel"}, {"rating": 1.0, "review": "They have a way to go with this thing. seems to lag and the voice doesn't keep up with the video. Sometime it's ok. Haven't figured it all out but if I am streaming some video from an amazon connection, forget it. youtube - ehh, it's about a B-.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "My family is using this regularly with great success. Even the luddites are comfortable! And transferring from the little screen to the TV is quite helpful.", "verified": true, "helpfulness": "0/0", "author": "Myron Thornberry \"MDT\""}]