[{"rating": 4.0, "review": "The only reason I didn't choose 5 stars is that it isn't usable with amazon instant movies!  If it did it would be perfect.", "verified": true, "helpfulness": "2/3", "author": "Bargain Hunter"}, {"rating": 5.0, "review": "I love my Chromecast. I used to always watch TV streaming on my 13\" laptop because plugging in the HDMI cable was a bit of a hassle. Also, I couldn't use my laptop for anything else while the show I was watching was playing. I think my favorite feature with the Chromecast is that if I cast a tab that I'm viewing (say hulu), I can still switch tabs or do something else and the tab I cast continues to show on my TV without interruption. I've noticed that if I cast a chrome tab it may sometimes lag a bit, but if I just pause and go again it usually fixes itself. If I stream netflix directly from my account with my phone it runs flawlessly however.", "verified": true, "helpfulness": "1/2", "author": "K"}, {"rating": 5.0, "review": "Great device and ceap.  Love the integration between the Google products!  Very easy to use and setup. I use it with my phone, tablet and PC!", "verified": true, "helpfulness": "1/1", "author": "Cliff"}, {"rating": 2.0, "review": "This is a redundant purchase. I am sure it is a good useful product but you can purchase Playon Premium for $60 and get Mymedia, Playmark, Playlater, and Playcast. You can stream anything you want on any device anywhere, so why bother with Chromecast? I am sure it's great, I just don't understand the obsession with a product that only delivers limited uses at best when you can spend $30 more and get everything.", "verified": false, "helpfulness": "1/3", "author": "i dont wanna"}, {"rating": 5.0, "review": "This thing is awesome - I know, I know, it does what a Roku does. BUT, it does it in a much smaller and easily portable format and it just works - all for $35 or less! Install was a breeze and I am thrilled to have this in my house. I just bought a third one. Funny thing is, some of our tvs are smart TVs and that is all good, but the Chromecast gives me the option to take streaming to hotels, transfer around rooms of my house (VERY useful when you have company) and just generally saves me a lot of effort of having to find a place to watch some of my streamable TV (or radio). I am really hoping to ditch cable TV at some point and this little guy will be instrumental in getting me there.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Avid Reader\""}, {"rating": 2.0, "review": "Great concept but exceedingly slow and or unresponsive. Maybe I expect too much, but it does not respond or it freezes with my Samsung Galaxy phone. Also just leaving it plugged into my television (not turned on at the phone), blows my TV reception.Other than that, it`s a great product.", "verified": true, "helpfulness": "1/1", "author": "Ted \"author of The Bouchard Legacy\""}, {"rating": 4.0, "review": "It works well and installs easily. If you keep it plugged in, your internet service might require a daily reset of the router because your service can detect it and if it's inactive they don;t want it on the system. Just unplug it if you don't want to reset the router overnight. Also ITUNES doesn't like it unless you load songs ONE AT A TIME. VIDEOS run well and anything that you can run on your web command line looks and sounds OK. The quality can be 1080 most of the time. The streaming stuff works OK. I recommend it if you're not too particular. GAMESTERS beware! Don't know about all that...$35 isn't much for something that works well.", "verified": true, "helpfulness": "1/1", "author": "amazon chump"}, {"rating": 4.0, "review": "It's easy to use and setup and the picture quality is great. I just wish they had more channels to watch.... supposedly they will add more... but it's been out awhile with no other updates.", "verified": true, "helpfulness": "1/1", "author": "Brandon"}, {"rating": 5.0, "review": "For the cheaper flat panel TV's that don't have built in wi-fi, this product is a no-brainer.  Easy to install and easy to use.  My daughter even installed the Chromecast app on her iPod Touch so we can use that as our streaming source and not tie up the family laptop.  $35 for the hardware and $8 a month for a Netflix account = movie nights on the cheap!", "verified": true, "helpfulness": "2/3", "author": "Kirk Hubbard"}, {"rating": 2.0, "review": "This is sad. Just bought the chromecast a day back for 35$ plus taxes and now its for 30$.. Y U DO THIS AMAZON", "verified": true, "helpfulness": "1/24", "author": "Rochit"}]