[{"rating": 5.0, "review": "Nice to have to watch a free movie every now and then.  Had system up and running in 2 minutes.", "verified": true, "helpfulness": "1/1", "author": "James B. Allen \"Jim\""}, {"rating": 5.0, "review": "Just replaced all of my AppleTV's with FireTV's (2 FireTV's, 1 FireTV stick). No comparison. Streaming performance is great, interface is so much snappier and easier to navigate (once you get used to it), and there are many more apps. Also, since I get all of my music from Amazon, my entire music library is already on there. No need to have a computer running in the background. Only thing I miss is airplay, but there are apps for that.", "verified": true, "helpfulness": "0/0", "author": "Alex Guichard"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "very satisfied", "verified": true, "helpfulness": "0/0", "author": "sherman waits"}, {"rating": 4.0, "review": "Unit was very easy to install. Only problem that I have found is that you have many movies to choose from but no standard listings.", "verified": true, "helpfulness": "1/1", "author": "James Velez"}, {"rating": 4.0, "review": "I would like to know how to do general searches within each category, i.e. free prime movies.  Sometimes I don't have a particular movie I want to see and would like to browse a list.", "verified": true, "helpfulness": "1/1", "author": "Donna Hosoda"}, {"rating": 3.0, "review": "Christmas gift from family and I think its \"Great\"!I just wish you could leave the Amazon Fire TV box on and shut the TV off, to listen to the music (from your playlist) on your stereo receiver.", "verified": true, "helpfulness": "0/0", "author": "James E. Olsick \"jimmykat43\""}, {"rating": 4.0, "review": "Makes your search super fast with its quad processor. I love it, but there is the CAUTION if you don't notice the charges for certain programs. It improves your viewing pleasure if you already subscribe to programs like Netflix, Hulu plus, etc. My thought is that the charge amount be made twice as large so I don't have a surprise at the end of the month and don't allow your kids free reign on the gadget. It is easy to set up and run. I thought there weren't enough instructions, until I realized, it really is a no brainer.", "verified": true, "helpfulness": "1/1", "author": "Patricia J. Lauterbach"}, {"rating": 5.0, "review": "This is great addition to our entertainment center. Came quick and better than expected", "verified": true, "helpfulness": "1/1", "author": "Nate Burrell"}, {"rating": 5.0, "review": "So easy to navigate. So many options.", "verified": true, "helpfulness": "0/0", "author": "SmartMom"}]