[{"rating": 5.0, "review": "the device is awesome! I just hope it's able to run full hd.no more cables and long annoying connections, just hit and play", "verified": true, "helpfulness": "0/0", "author": "Yasar Z. Zaben"}, {"rating": 4.0, "review": "I like amazon fire tv best, gives my Amazon programming and access to Netflix if I thought I needed it.", "verified": true, "helpfulness": "1/1", "author": "april36"}, {"rating": 4.0, "review": "Easy to install, easy to use. Great value for the price. Still waiting for the NBA Game Pass Chromecast support (why has it taken so long?!)", "verified": true, "helpfulness": "0/0", "author": "JL Mejia"}, {"rating": 5.0, "review": "works excellent was able to download the app on my phone to control it and hooked it to the WiFi no problem. I watch Netflix and Hulu no problem and love the screen saver pics.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 4.0, "review": "The device is great, but lacks improve software", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Bad , watch out !! the price more than $ 10 !!!", "verified": true, "helpfulness": "0/5", "author": "Orangel"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Ahmed alamri"}, {"rating": 5.0, "review": "I use this all the time.  Big Youtube/Netflix consumer and have my laptop next to my couch at all time.  Buffers are solid as long as you have a good service.  Our Charter maintains at a consistent 20 so only a rare hiccup in buffering.  Set up was very simple on my laptop and cell.  When not being used the backdrop changes scenes (to prevent dreaded burn-in images) every minute or so, drawing from G+ I think.  Almost doubles as hanging wall art with a little, digital clock in the lower right corner.The only con would be if you're going to use it to cast (aka mirror) your desktop.  There's about a 5-15s lag when used (I think this feature is still in beta). You can cast the desktop or just one tab.  Not really worth it and have only tried a couple of times.  Since it's only in beta maybe it will improve over time.  Otherwise just get an HDMI cable which should only set you back $5-$50 depending on how long of a cable you need (don't be a chump and buy the high-end brand, lookin at you monster cables).", "verified": true, "helpfulness": "0/0", "author": "Owens8477"}, {"rating": 5.0, "review": "This is an awesome gadget! We stream movies from NetFlix and music from Pandora to our TV using this little marvel. And the price is great.", "verified": true, "helpfulness": "0/0", "author": "Grandma"}, {"rating": 5.0, "review": "I'm low tech and this was easy to use...have canceled Netflix which I rarely use...much more fun to search and play videos right away on uTube. Great family fun to watch family videos.  Only just discovered this gadget and will be sending this out as Christmas gifts!", "verified": true, "helpfulness": "0/0", "author": "kokokonami \"kokokonami\""}]