[{"rating": 3.0, "review": "Just trust me on this one- this is NO ROKU. Sure, you get it for $10-$15 cheaper than a Roku, but with a Roku, you can browse content using just the remote. The Chromecast requires a phone or table to browse and navigate the content. Sure, most people HAVE a smartphone, but that's just another thing to waste energy. I own 3 Rokus and 1 Chromecast, and the Chromecast gets used almost never. Just about everything it can do, the Roku can do too. And more.", "verified": true, "helpfulness": "0/0", "author": "JDK"}, {"rating": 5.0, "review": "Good packaging, no issues, easy step by step instructions on how to connect and use the device.  Well worth the cheap cost to provide affordable entertainment on a single TV.**Check your wireless router's compatibility before purchasing though.", "verified": true, "helpfulness": "0/0", "author": "Alyssa J."}, {"rating": 3.0, "review": "Nice gadget but everything streamed must be done via the Chrome browser.", "verified": true, "helpfulness": "0/0", "author": "C.L. Dawk \"Clifford Dawkins\""}, {"rating": 5.0, "review": "I didn't use it much at first but now I've come to really enjoy how easy it is to stream Netflix or YouTube from your phone.", "verified": true, "helpfulness": "0/0", "author": "Ana F."}, {"rating": 5.0, "review": "Awesome device.  I'm from MA and live in NJ so I have a sling box hooked up to my parents tv back home and I can watch all Red sox/patriot games/local programs from my sling player on my ipad which then broadcasts to my tv.  Picture is great too!", "verified": true, "helpfulness": "0/0", "author": "Robert J. Connaughton \"Rjc\""}, {"rating": 5.0, "review": "Great device. I use it along side the ROKU streaming stick for even greater streaming experience", "verified": true, "helpfulness": "0/0", "author": "Bonita from the 505"}, {"rating": 1.0, "review": "Stuck on updating for days at 0% and never finished.  I see others are reporting the same problem.  Spent hours trying everything that was recommended but got nowhere.  I had high hopes for this.", "verified": true, "helpfulness": "0/0", "author": "IrisD"}, {"rating": 5.0, "review": "Works just fine.", "verified": true, "helpfulness": "0/0", "author": "ELSIE MARTINEZ"}, {"rating": 4.0, "review": "Good quality", "verified": true, "helpfulness": "0/0", "author": "Hani Samaha"}, {"rating": 5.0, "review": "Excelet product, use to stream youtube. Worked great off the box (plug and play)", "verified": true, "helpfulness": "0/0", "author": "Andrew R. Levene"}]