[{"rating": 5.0, "review": "Great product only thing I gotta say I don't like is I can't watch my stuff I orDer through amazon on it so most likely I'll be using a different service to rent my digital products", "verified": true, "helpfulness": "0/0", "author": "anthony"}, {"rating": 5.0, "review": "I love using my chromecast. At the price, its a steal. Suddenly, you can turn any TV into a smart TV. I actually own a Vizio SmartTV, and I still have the chromecast plugged into it. I prefer to use the chromecast when I can because it tends to be a smoother user experience, and has a wider variety of things I can cast to the TV. It is also nice to be able to switch contexts on my phone instead of having to go through the TV to a different baked-in app to watch something.I don't have it hooked up to a device with great speakers, so unfortunately the music casting functionality is lost on me, but I have friends who use it just for that and it works great with their setup.", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 5.0, "review": "Love gets access to a lot of great things enjoying it and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "adourose"}, {"rating": 5.0, "review": "adds to viewing enjoyment", "verified": true, "helpfulness": "0/0", "author": "career girl"}, {"rating": 5.0, "review": "I like it.  However, the choices of providers is limited.  Need more programing with real sports on them.", "verified": true, "helpfulness": "0/0", "author": "Arthur A. Busch"}, {"rating": 5.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "Cinthya Clarke"}, {"rating": 4.0, "review": "I can now watch just about anything that is on my laptop on tv screen. However, it does not always work. Don't know if I need another app or if the speed of my internet is too slow.", "verified": false, "helpfulness": "0/0", "author": "libros2012"}, {"rating": 5.0, "review": "Everyone should get one!! It's the best for people who have Netflix!! If you like Youtube, it will be even better on the TV screen. My son was the one who turned me on to this, and my husband and myself have never been happier with this small little thing that fits right on the back of the TV. If you have Facebook, you can view all the streaming videos in the comfort of your bedroom on your TV!. I got 2, one for me and one for my son, and I think this is the smartest use of $60 that I have had in a long time.", "verified": true, "helpfulness": "0/0", "author": "S. Sinclair \"Mommy1\""}, {"rating": 5.0, "review": "We love our Chromecast! Works great!", "verified": true, "helpfulness": "0/0", "author": "Kimberly Hargett"}, {"rating": 3.0, "review": "Doesn't work with net flix😳 it gets errors and the desktop streaming is choppy and slow.. Roku is better google is a huge company... They could afford to put out a better product..", "verified": true, "helpfulness": "0/0", "author": "Cobratac"}]