[{"rating": 4.0, "review": "Just the ideal gadget at my living room!", "verified": true, "helpfulness": "0/0", "author": "wenceslao jaimes"}, {"rating": 4.0, "review": "I think this is a great product. I got rid of cable and my TV had no use until I bought this chromecast. I can send videos from my iPhone apps such as Netflix, Hulu, and Youtube and close the app to view text messages or any other app, it's fantastic! I only wish there was a way to send files on my computer to the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Matthew park"}, {"rating": 5.0, "review": "The item is a AAA+", "verified": true, "helpfulness": "0/0", "author": "Antonio G."}, {"rating": 4.0, "review": "Chromecast just works. It does what it says. Streams from Netflix, YouTube, casts tabs from Chrome browser. It does what it says nothing more nothing less. If you want a more robust streaming device do not buy this. If you want something very simple to use and setup then Chromecast is for you. As for some people that complain that you cannot stream your own videos...you actually can. I researched this and found a few ways to do this. Extension for chrome browser and Real Player on your smartphone will also do this. So for $35 chromecast gives you a lot of bang for your buck. Only reason I give this 4 stars is for the occasional hiccup, freeze up etc but other than that it is a great little device.", "verified": false, "helpfulness": "1/1", "author": "Michelle"}, {"rating": 5.0, "review": "Excellent. And new features are still being added. If you have a WIFI laptop nearby, bring up Chrome browser and display any tab on your Chromecast-connected TV. And there is word new features are being added in the future.", "verified": true, "helpfulness": "1/1", "author": "CWG"}, {"rating": 5.0, "review": "Had one in my living room and decided I needed another for my bedroom. It basically gives you the abilities a Smart TV offers. Simply by using your home Wifi. With user friendly  device integration like your mobile device, tablet and laptop. Things we already use. You can cast a movie on Netflix from your phone onto your TV or a video from YouTube and share it with friends with the benefit of seeing it all on a larger screen(great for youtube)  in the moment. HBO, Music, Hulu and etc are all much more convenient without having to psychically go through a menu on your TV or using remote buttons. Just launch an app and Cast.All this without the big bucks of the smart tvs and the hassle of looking for your remote or using the often laggy buttons of a \"Smart TV\" remote. I own a Vizio smart TV(living room tv) and have a Vizio \"dumb\" TV in my bedroom. I can watch Game of Thrones in HD in the living room and go to bed and resume without having to do much but turn on the TVs and press Play on my phone.Easy setup too. Wires tuck away neatly behind TV with provided velcro strap, plugs in directly into an HDMI input. Dedicated USB port and WiFi is necessary. Android and Apple compatible. PC friendly.", "verified": false, "helpfulness": "1/1", "author": "Daniel R."}, {"rating": 5.0, "review": "This thing is better than I expected.  You will be addicted to playing youtube videos from your phone.", "verified": true, "helpfulness": "0/0", "author": "PervasiveAmazonBuyer"}, {"rating": 5.0, "review": "For the price, this is wonderful. I am able to stream almost anything from the internet by just clicking once on an icon. So glad to have this!", "verified": true, "helpfulness": "0/0", "author": "Baby boomer"}, {"rating": 5.0, "review": "I love this thing!!! With this price, its a must have.  I have a smart TV already but this is very useful because you don't have to struggle with you remote control to search for videos (Typing into the remote drive me crazy).  I am will buy another one as gift to my parents.  The picture is a lot better than I expected it to be. Go google Chrome Cast!", "verified": true, "helpfulness": "0/0", "author": "Ahmed Gadir"}, {"rating": 5.0, "review": "Google has hit a home run with there Chromecast HDMI streaming media player. These work great with all of the smart phones that we have in our family. They allow you to quickly stream and view a movie or pictures on your large screen TV. They plug into an HDMI port on your display or TV. They are then powered from a small supplied, power supply, plugged into an electrical outlet. The Chromecast is then connected wirelessly to your network. There is a software app that you download and run on your phone or supported device that is also is connected to your network. When the app is ran, you should be able to see the Chromecast device on your phone or other supported device. You can then stream the content from your supported device, through your network to the Chromecast device, then to the TV. It makes sharing movies or pictures with your family and friends a breeze.", "verified": true, "helpfulness": "0/0", "author": "H. L. Bath \"hlbath\""}]