[{"rating": 4.0, "review": "It works will with out Phillips TV. You can access Netflix and Amazon Video and a whole lot more", "verified": true, "helpfulness": "0/0", "author": "Edrica"}, {"rating": 5.0, "review": "The fire tv has been a great addon to my movie and music enjoyment! The netflix, classic tv, and pandora apps are awesome! Thanks for a great product.", "verified": true, "helpfulness": "0/0", "author": "David Nelson"}, {"rating": 5.0, "review": "Overall extremely satisfied, I had one issue with making it work with my Samsung SmartTV and Amazon technical support was excellent in resolving the issue. I purchased this because I wanted a powerful processor and a better interface for my Plex Media Server at home.I think the product has very good value and it has been hassle free. Amazon hit it out of the park with the unit.", "verified": true, "helpfulness": "0/0", "author": "R. Pearson"}, {"rating": 3.0, "review": "Not having a lot of luck using this. Seems to \"skip\" a lot.", "verified": true, "helpfulness": "0/0", "author": "Bettye M. MacCalla"}, {"rating": 1.0, "review": "sent it back - could not get it to work", "verified": true, "helpfulness": "1/1", "author": "cubfan962 \"cubfan962\""}, {"rating": 3.0, "review": "Good interface.Very limited number of apps available. Hope they comeup with more apps.", "verified": true, "helpfulness": "0/0", "author": "PurpleHound"}, {"rating": 3.0, "review": "Wish the voice would work with all apps. Spelling was slow.", "verified": true, "helpfulness": "0/1", "author": "Susan Vigneron"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very impressed with the menu transitions and how well integrated Prime Video is.  I bought this with the Sling TV prepay promotion. It's a satisfying cable cutter so far.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "I was given this as a gift. I love it! I am able to binge watch my shows and catch up on movies that I missed seeing. It has everything! I don't need cable anymore.", "verified": true, "helpfulness": "0/0", "author": "Belinda"}]