[{"rating": 5.0, "review": "I love this product. .", "verified": true, "helpfulness": "0/1", "author": "Juan Castro"}, {"rating": 5.0, "review": "I own 2 Roku devices, a TCL Roku TV, and a Roku 3, as well as this Fire.  I can honestly state that the extra channels, and superior search engine that Roku offers is not a sufficient reason to purchase it over the Fire.  The Roku 3 also has the advantage of the headphones in it's remote, but this feature is annoyingly unrefined, and suffers from constant static, comes in, and out in volume, and drains the remote's batteries very quickly.The Fire, however, has a rich interface that I can't say enough about.  The voice search works very well, and saves you a lot of time trying to enter in a search with a remote, very painfully, one letter at a time.  The applications on the Fire (plex in particular), also seem to be much more rich, and easier to navigate.  I do wish the home/start screen was a little more orientated towards my apps/channels, but it is still much more pleasing to behold than the Roku.  You can also feel the difference in processing power between the two devices, with the Fire feeling very snappy in comparison.Honestly, I don't regret either purchase (Roku 3, and Fire TV), both are excellent in their own right, but hindsight being 20/20, I'd rather have two Fire TVs today.  It simply works, and feels much more refined, and clean.  Whereas the Roku feels clunky about just about everything (especially the remote) save for that excellent search engine, that I really wish had a voice to text feature.  Kind of wish I could breed them.", "verified": true, "helpfulness": "0/1", "author": "Lester Voncleese"}, {"rating": 5.0, "review": "upgraded from my apple tv. This is so much better! fast and easy setup", "verified": true, "helpfulness": "0/1", "author": "Brandon Kim"}, {"rating": 2.0, "review": "I guess I was under the impression that there were movies on there like prime that I could watch for free.  I should have sent it back, too high. It just sits there.", "verified": true, "helpfulness": "0/4", "author": "Vicki L Pulley"}, {"rating": 1.0, "review": "I JUST OPEN THE BOX AND INSTALLED EVERYTHING AND CANT GET MY NETFLIX OR HULU GOING ON THIS CRAPBOX, TRIED REBOOTING AND IT STILL CRAPPED OUT ON ME. CAN DO ONLY YOUTUBE AND PRIME PROGRAMS. CANT CAST MY SMART PHONE SCREEN EITHER. THANKS FOR WASTING 2 HOURS OF MY LIFE, JERKS. WILL RETURN FOR REFUND AND GET A GOOGLE CROMECAST!!!!!!!!!!!!", "verified": true, "helpfulness": "3/8", "author": "whatever"}, {"rating": 5.0, "review": "I absolutely love fire tv. I also have hulu plus along with Amazon prime. I did a 6 month review before canceling verizon fios and going with fire tv. My only gripe is I dont yhink I have enough bandwith. I currently have 2 fire tv boxes, and 3 fire tv sticks, with 1 other smart tv. Thats a total of 6 streaming tv's, 1 laptop,  1 computer, 3 tablets, and 2 cell phones. I currently have fios 75/75 internet speed. Once I connected my 6 tv's, ive notice things now take forever to download. I never have more than 5-6 devices working at the same time, but I may have to up my internet speeds to handle everything. I do get some pauses every now and then but no real buffering issues. Im kind of surprised its held up this well so far.", "verified": true, "helpfulness": "0/1", "author": "Julian Wilson"}, {"rating": 5.0, "review": "I love our fire t.v. box its great and we have a blessed time using it, love the games and music  my wife love's the movie's on prime.ps.the fire t.v. has photos and videos of your own personal vortex", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I thought it would haveore access to you tube and stuff outside of Amazon only services", "verified": true, "helpfulness": "0/4", "author": "Jospeh Heffernan"}, {"rating": 3.0, "review": "It's all right but didn't really resolve my streaming issue. I was hoping Netflix would stop buffering constantly but it still buffers. Seems to get started quicker than my blue-ray player at the same tv, both of which are a wireless coneection. Doesn't happen all the time but is worse in the evenings,", "verified": true, "helpfulness": "0/2", "author": "Judith A. Sandage"}, {"rating": 3.0, "review": "I like it. Sometimes it pauses and has to catch up and that's kind of a pain. The other thing I don't like has to do with Amazon Prime. It's crazy how you charge for some very old movies that are on TV all the time. Also, TV shows, you may show Season 1 and 2 but then charge for the remaining Seasons.", "verified": true, "helpfulness": "0/1", "author": "Bill"}]