[{"rating": 5.0, "review": "Good product definite choice if you have prime", "verified": true, "helpfulness": "0/0", "author": "Ashley Price"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Richard L. Meyer"}, {"rating": 4.0, "review": "Great product.The voice search actually works very well and I am surprised at how much I use and love it.I like that it when you search for a TV show, they will display the various ways to view it (free on Hulu when available, purchase it in HD/SD from amazon etc...).It's fast.The remote feels goodThe setup is painless.You can install the PLEX app (to stream your local movies)You can now view HBOgoHas built-in Amazon prime TV/movies streaming and a better display than reported in the initial release.Downside: ShowTime Anytime does not currently work with my cable provider (really!?!?!?) - Direct TV (Dish is also not supported). Roku remains the maximum compatibility device (has no content of their own/no-conflict of interest) and has been the longest at providing a streaming box.Does not support GoogleCast.  You wouldn't expect Amazon to support that since it's a competing content provider.Neither does Roku but I could see Roku supporting ChromeCast in the future (no conflict of interest).If ShowTime Anytime was supported by my cable company (Direct TV), I would be 100% satisfied.As it stands, it's a pain in the ass to have to switch to a different device (chromecast stick) or my old rokuto view anything on ShowTime.", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 5.0, "review": "Way faster than my XBOX I was using for Netflix/Amazon/etc.  Has a ton of apps.  Easy to set up.  Now if only it would come with a dvd player!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like it .", "verified": true, "helpfulness": "0/0", "author": "LOI NGUYEN"}, {"rating": 5.0, "review": "Like it - although it doesn't have as many channels as Roku.", "verified": true, "helpfulness": "0/0", "author": "littleriverpat"}, {"rating": 5.0, "review": "it exceeded my expectation. Picture is great and sound is fantastic. Very user friendly and great craftsmanship...will buy again.", "verified": true, "helpfulness": "0/0", "author": "Fara S. Manshadi"}, {"rating": 5.0, "review": "much better unit then similarly priced competition easy to use and fun", "verified": true, "helpfulness": "0/0", "author": "STEVEN A CHIPMAN"}, {"rating": 5.0, "review": "Loving it so far!", "verified": true, "helpfulness": "0/0", "author": "Sissy"}, {"rating": 5.0, "review": "so far very pleased everything seems to work and find out if we got it hooked up right", "verified": true, "helpfulness": "0/0", "author": "donald ruiz"}]