[{"rating": 5.0, "review": "Awesome product.  And if you have a weak wifi  signal this is what you need it sends out it's own signal to pick up the wifi and gives uninterrupted viewing.", "verified": true, "helpfulness": "0/0", "author": "George 3."}, {"rating": 2.0, "review": "I hate to say it such a simple gadget has me stumped. I cant get it to work. I cant give it 1 star because I don't know if its just me or if the device is just faulty in some way. It does bring up the first screen but wont see my router. I know its not the router because it is even on the list that says is confirmed as working. I bought a new one just to be safe.Anyway the directions are next to nonexistent. I could not get anywhere with tech support. So this one personally i wont say is worth it.", "verified": true, "helpfulness": "0/0", "author": "J. Brewer"}, {"rating": 3.0, "review": "For $35 and the fact that i'm a techie (patient and able to diagnose problems and experiment) leaves me as a satisfied \"mostly Netflix\" customer so far.The device was so easy to install and enter passcode to my WiFi -- that took just minutes.  With the iOS app installed on my iPhone i could kick off a Netflix or YouTube (ah, that fireplace video!) in a jiffy.  HiDef, no freezeups.  Chromecast from the Crome broswer (from Windows, from iMac) was a breeze.But then, on day 3, i would try to cast from YouTube and only get the splash screen and video name during startup.  And then nothing else.  I also had the same problem from iPhone, iPad, and Chromebrowser (youtube embedded embedded caster, not browser tab-cast).I finally found that restoring the device to factory settings and re-initializing put me back on the air.  For how long?So, the device has rough spots, and is begging more apps to embed casting.  But if you are a Netflix adict and don't want to wire up your iPhone through an HDMI adapter wire and cool it off with ice cubes, then this is for you!  Then again, if you have a more-modern HD-TV with built in Netflix, why are you considering this device?", "verified": true, "helpfulness": "0/0", "author": "James Tomkinson"}, {"rating": 5.0, "review": "I dont have a smart TV and this lets me cast things from various different apps and devices to the TV. Exactly what I needed.", "verified": true, "helpfulness": "0/0", "author": "Amrish"}, {"rating": 5.0, "review": "This thing is awesome if you know how to use it! I love this thing! Can stream videos, Pandora, YouTube, and so much more from my phone, tablet, PC, etc. A REALLY good app for your phone, tablets, and computers I would highly recommend is called Plex. It basically creates your own \"Home Netflix\" and will database all you OWN collection of downloaded music, movies, TV shows, etc you have on a hard drive, ext hard-drive, etc. You can then stream from ANY device, and then stream to your chrome cast. Very cool little toy. My wife hated my \"new gadget\" until I showed her how to use it to watch HER shows. now she LOVES it. $35, you CANNOT go wrong. I ONLY wish it would power itself. My TV doesn't have a USB, so I couldn't power it from a USB spot, and needed to use the power cable. had hoped this was an \"all in one self powering device\" but it is not. It MUST get power either from a WALL Socket, OR USB slot. Just so people know.", "verified": true, "helpfulness": "0/0", "author": "Wicked"}, {"rating": 2.0, "review": "I have 2 of these.  I expected it to work better.  It seems to lock up alot.  I was able to start watching a show.  About 10 min it I tried to pause the video, it did not work.  I was using an IPHONE as the controller.  There was nothing I could do.  I had to restart the device.  I did use it a few more times.  I finally gave up.  It locks up more then works.  I will keep them handy and try again the next time there is a firmware update.  Until then I would not use them at all.", "verified": true, "helpfulness": "0/0", "author": "J.M."}, {"rating": 5.0, "review": "It works awesome!!!!!  And is very easy to install. I can watch the streaming movies from Netflix on my TV anytime.", "verified": true, "helpfulness": "0/0", "author": "Dibemomochikona"}, {"rating": 5.0, "review": "This is a great little product for what it does.  I use it as a \"netflix\" machine in my bedroom. Allows me to watch netflix on my television and essentially use my phone or tablet as a remote.  Note that its purposes are currently limited, and this is NOT a mirror service like Apple TV.I have not had any crashes so far.  WiFi connectivity works well, even though the device is all the way across my house and through multiple levels.I will note two things I do not like about the Chromecast: (1) the device itself gets pretty warm/hot to the touch; because of this, I unplug it when I am away from it; (2) external power is required (either in the form of USB or wall plug).", "verified": true, "helpfulness": "0/0", "author": "Tunafizzish"}, {"rating": 5.0, "review": "Works like a charm. can't wait until Chromecast gets more apps that work with it, but getting rid of cable was painless with this!Best $35 I have spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "September71"}, {"rating": 5.0, "review": "Like Apple's airplay, but for non apple (and also apple) devices. Comes in handy when we have something pulled up on on the laptop but want to stream it from the TV!", "verified": true, "helpfulness": "0/0", "author": "Christine Kam \"Poodle Lover\""}]