[{"rating": 5.0, "review": "I bought the Chromecast during the holidays just to see what it was all about. At $35.00 ($29.00 on sale), I had very little to lose. Set-up was a breeze and it wasn't very long until I started using it. I can now sit on the couch with my iPad and watch HBO and Netflix without having do deal with the pain of hooking it up to the TV. My daughter can even sign in to my Netflix account and control the TV through her phone. Although it's not perfect, as sometimes it stops while buffering, it's one of the easiest and cheapest ways to watch video from multiple devices on your TV. I can't imagine any video service not having this ability for their video streaming (I'm looking at you Cinemax Go). I love it!", "verified": true, "helpfulness": "0/0", "author": "J. Perkins \"mrradiotvfilm\""}, {"rating": 5.0, "review": "It's an easy and fast setup. But must be clear you have to have a google compatable phone, or labtop for it to work.", "verified": true, "helpfulness": "0/0", "author": "Kathy Johannes"}, {"rating": 5.0, "review": "Super easy to set up. Just connect it to HDMI and a USB power source and the instructions will show on the TV.Afterwards is a matter of using the apps you love (YouTube, Hulu, Netflix, etc) and looking for the Cast icon. Press it and enjoy watching your shows/videos on the big screen!", "verified": true, "helpfulness": "0/0", "author": "Epifanio Jimenez"}, {"rating": 5.0, "review": "Perfect- works great with you tube from my phone- kids love it! Def. well worth the small amount of money", "verified": true, "helpfulness": "0/0", "author": "c.w"}, {"rating": 4.0, "review": "I just got this product yesterday, had some hiccups setting it up through my Mac called up the customer care and they helped me through it. Everything worked fine after that, as I expected.After a movie I was just randomly playing music videos from youtube I saw some errors where the connection was breaking to the Chromecast and I had to click the cast button multiple times. Will give more updates soon!", "verified": true, "helpfulness": "0/0", "author": "arungeorge101"}, {"rating": 3.0, "review": "If you check the fine print, you will see that this device is not supposed to work with iOS5  (on the original iPad) or even on earlier versions of Android, I was eventually able to get it to have very limited functionality on my (iOS5) iPad It will cast YouTube videos, but that's about all that it will do. Had I known that before buying the unit, I might not have done so, but that limited capability is still a nice convenience considering the price.", "verified": true, "helpfulness": "0/0", "author": "ERW \"ERW\""}, {"rating": 5.0, "review": "This is a great device for the price.Once the SDK comes out and apps start flooding in then it could very well be the \"best\"", "verified": true, "helpfulness": "0/0", "author": "Joshua"}, {"rating": 1.0, "review": "Really disappointing.The configuration is supposed to be simple. However, I googled the problems. It seems that I have to change the configuration of my router to support this streaming device. Even my wifi network public with no password would not play the game with Chromecast. I have other things to do than calling the support for hours to get this fixed. Plus I don't want to reconfigure with Wifi and reset all the devices, phones, printers, tablets and Smart TVs currently configured. I would rather lose my $35 dollars.I bought a Roku box. It configured immediately and I am happy with it.I have two Apple TVs and a Roku box; Chromecast won't get into my house for now.Enjoy my business!", "verified": true, "helpfulness": "2/2", "author": "Yano"}, {"rating": 5.0, "review": "If you watch mostly youtube and netflix, this is an awesome product.  You can control from your cell phone, tablet, or computer.  Very small and discreet.  Definitely worth the price.", "verified": true, "helpfulness": "0/0", "author": "Celeste"}, {"rating": 2.0, "review": "I had high expectations from this thing. I purchased this and a Roku 2, the Roku was very easy to setup - connected to my network, it found my Plex server and no problems. This Chromecast refused to setup on my network. The first guy in customer service I talked to was helpful, but the second guy just seemed to want to get me off the phone. After fighting with this for several hours, I gave up. I gave it 2 stars because I'm sure this probably works for someone out there, not just me. The features seem nice, but please be aware of trouble, even if your router is on the supported list. I'll stick to Roku, less problems.", "verified": true, "helpfulness": "0/0", "author": "M. Armstrong"}]