[{"rating": 4.0, "review": "Easy to set up, great integration with Hulu + and Netflix on both iOS and Android devices. I really like it. The only issue is sometimes choppy video playback, but that may be a bandwidth issue on my network.", "verified": true, "helpfulness": "0/0", "author": "Sainted"}, {"rating": 3.0, "review": "it has a tendency to shudder, the screen won't be playing smoothly but will has pauses, and jumps.The idea is brilliant so I'm hoping its just my internet", "verified": true, "helpfulness": "0/0", "author": "Vonny3492"}, {"rating": 4.0, "review": "I was disappointed at first with the Chromecast as it basically only supported Youtube and Google media services (which I don't use).  But, now that it works with Pandora, Chrome browser on my PC, and other services being added it's really nice.  When the HBO Go app is added (which I hear is being worked on) and the ability to send music, video and images from my mobile device, I'll give it 5 stars.  It will also then replace the need for my Roku.", "verified": true, "helpfulness": "0/0", "author": "Tim Eckel"}, {"rating": 5.0, "review": "Shipped fast, works better than I expected and it synced perfectly with my iPhone. I was a little upset that there was no chromecast app available for the kindle fire and no application for HBOgo or Showtime Anytime. This would definitely be a perfect product with those additions, but you can't beat the price for what you get.", "verified": true, "helpfulness": "0/0", "author": "Danielle Todd"}, {"rating": 4.0, "review": "You can stream them, but it's unacceptably choppy. You see only a frame a second. Hopefully this will change at some point. Other than that, it's easy to set up and really cool for displaying your browser or youtube videos.", "verified": true, "helpfulness": "0/0", "author": "k-chi"}, {"rating": 3.0, "review": "It worked,  but picture and sound \"stuttered\" badly when I tried to run a streaming TV station through it to our TV set.  It may not have been the fault of the Chromecast, since it may just have been overloading our modem/router, which also was bringing the internet into my computer. But it wasn't doing the job I bought it for, so I returned it,  which Amazon took care of with absolutely no hassle.There wasn't enough information about this gadget available.  It proved impossible to set it up even from the Chrome browser in my computer, since I am running Windows XP and XP is not supported for the Chromecast.  (\"Yet\"?)  So I borrowed a laptop that ran Windows 7 to set it up, and then it proved I could only use it from THAT laptop even after it had been set up.", "verified": true, "helpfulness": "0/0", "author": "Paul F. deLespinasse"}, {"rating": 5.0, "review": "Very useful and easy to set up. I mostly use my phone now to control streaming video. This is a no brainer !", "verified": true, "helpfulness": "0/0", "author": "brado \"brado\""}, {"rating": 5.0, "review": "The Google Chromecast HDMI Streaming Media Player is the media streaming device that represents the best value, because of its high quality and its incredibly low price point. It is very small, unobtrusive, and well-constructed, and it provides access to a wide variety of entertainment content. The Google Chromecast is an outstanding Streaming Media Player, and I give it my highest recommendation.", "verified": true, "helpfulness": "1/1", "author": "KRMD"}, {"rating": 3.0, "review": "Easy to use.  My wife has figured it out.  Though sold by Amazon I have not been able to figure out how to make Amazon instant video work.  Works great for netflix and you tube.", "verified": true, "helpfulness": "0/0", "author": "Steve Johnson"}, {"rating": 5.0, "review": "Work great with my Samsung phone,I air play with my phone and other device as well I like that Raj", "verified": true, "helpfulness": "0/0", "author": "Raj"}]