[{"rating": 5.0, "review": "This was the #1 gift at my home this christmas. We recently purchased a smart TV and actually use this chrome cast on our regular TV more. Worth the price. As always, amazon has the most competitive pricing on this item.", "verified": true, "helpfulness": "0/0", "author": "KDonovan"}, {"rating": 3.0, "review": "I have a 2011 Mac book air, and got a very poor prformance, it looks that a more powerful version of Mac is need for better performance, which means I need to pay more money.", "verified": true, "helpfulness": "0/1", "author": "Tian"}, {"rating": 4.0, "review": "the functions are good if you can make it work smoothly. Using it with my Samsung galaxy S3 it seems to really be slow and hang up while streaming.  I have yet to try it from a computer (casting to a television), so that may make a difference in speed. But my father who doesn't seem to have any issues with the speed of it, he loves it. In fact, the complains that he is now watching way too much Netflix. Overall though, if it works for you it is a great product with great functionality.add edit:  I added a star to my original rating of three stars.  I found that using my computer the unit is consistently working great (instead of my Samsung galaxy S3), it's been a pretty flawless watching experience. So apparently it does not work so well with my phone as the chrome Source, but fine when it's from my PC. Cool thing is that the distance from the chrome cast to the PC makes no difference. If my kids asked me to start a movie up in the bedroom from my office downstairs, from my computer I can do that. However, it's not as handy if you want to  stop, pause, fast-forward, etc.... You have to go back to your computer (unlike using my PS3 controllers as a remote when I stream Netflix through the PS3). But, with this cheap little device I do save the \"wear and tear\" on my PS3. I am about to purchase a third one in a minute.", "verified": true, "helpfulness": "0/0", "author": "dc"}, {"rating": 3.0, "review": "Few seconds delay, lags quite often, and only certain videos will have audio. Nice idea but needs to be improved.", "verified": true, "helpfulness": "0/0", "author": "aclieu"}, {"rating": 4.0, "review": "It works great with Android phone. However, no matter how hard I tried, I can't cast it from Chrome (laptop).", "verified": true, "helpfulness": "0/0", "author": "Bau Kieu"}, {"rating": 1.0, "review": "Very disappointing that it does not cast chrome from the ipad and the cast from my computer was very broken up. Returned it right away. False advertising from Google.", "verified": true, "helpfulness": "1/1", "author": "Meghan Hamler"}, {"rating": 5.0, "review": "This is such an amazing and helpful product. We use it almost every day. I listen to my lectures from school on the tv while I do things around the house. We use it for music, games and even streaming Youtube and live sports coverage from the internet. Would definitely recommend. I got the product quickly and would recommend this seller.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 2.0, "review": "I found the instructions lacking and it took a lot of exploring websites maintained by people not related to this product to discover how to do what I wanted and it didn't do that well enough to be of value. Money wasted.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Gazin"}, {"rating": 4.0, "review": "It could not be easier to setup.  Almost too easy, if you like to tinker there is almost nothing to tinker with.  Step 1 plug it in.  Step 2 open the app and enter your WiFi password.  Step 3 no step 3. The only drawback is that it won't connect to 5ghz WiFi but if you have a dual band network you can have your phone or computer on the 5ghz network while the chromecast is on the 2.4ghz network (under most router configurations)Some people have complained that you have to plug it into a power source.... It's Not Magic!  It requires electricity to operate.", "verified": true, "helpfulness": "0/0", "author": "F"}, {"rating": 5.0, "review": "Samsung TVs don't have any good music apps. Now I'm able to stream my music in my TV and it's amazing. Great when combining it with the Google Music: All Access service.An amazing $35 gadget.", "verified": true, "helpfulness": "0/0", "author": "Guillermo Morales"}]