[{"rating": 4.0, "review": "So with all the modern-day consoles, what's the point of getting this?  I asked myself this question a number of times as I had it sitting in my cart - but I finally pulled the trigger as I said \"why not?\".It's small, it's neat, and it works.  At first I had quite a few issues getting this thing connecting to my WiFi but I discovered this thing doesn't support the 5 GHz band.  That's the only reason for deducting a star so far.With the recent addition of Plex - I now can pretty much do everything I need on this device.  Over the Christmas holidays our family sat around the TV as we surfed Youtube, Netflix, Hulu Plus (resubscribed!) and even a little from the Plex library.  Is it better than Roku or WDTV?  Hard to say, though as a fan of consoles and WDTV, I find this little device convenient as it is just simply is \"always on\" and I can cast to it anytime from my smartphone.  My phone is ALWAYS on me, so I don't have to go find a Playstation controller or my WDTV remote when I want to use it.With the great performance, ease of use, price and potential in the future for more apps, this was an easy investment.", "verified": true, "helpfulness": "1/1", "author": "William Vegas \"William\""}, {"rating": 4.0, "review": "So far I am loving the Chromecast Dongle. My family and I during the Christmas Holiday watched Forrest Gump via my Galaxy S3 and Netflix App with very minimal battery drain on my phone. During Christmas I had bought my Fiance a Sea King Kayak which had the Bar Code reader on the front showing a short video of it. I went on to Barcode Scanner, scanned it then commenced on watching the Youtube video on our TV. At first it did not work with my Laptop but I was able to set it up via my S3. One the phone updated I did a restart on my laptop to reset the connection and everything works great via the two.I only gave this a 4 Star because what I really wanted to do was use this in conjunction with my HDX 7 that I got for Christmas. Now you can use this via a \"Side Load\" and watch Netflix or other Apps however you cannot \"Cast\" Amazon Prime Videos which was what I was really wanting to do in the first place. However for 30 bucks and free shipping you cannot go wrong with this.", "verified": true, "helpfulness": "1/1", "author": "Scrappy"}, {"rating": 5.0, "review": "I gave this as a gift and now we all want to have one!  And the price is great, too.", "verified": true, "helpfulness": "1/1", "author": "Susan Westbrook"}, {"rating": 4.0, "review": "It is an excellent product for the price, but its functions could be better. I hope soon to add more supported applications.", "verified": true, "helpfulness": "1/1", "author": "monky"}, {"rating": 1.0, "review": "Let me start this out by saying that I am an avid techie. I own an internet startup and love gadgets. I am writing this based on my first experience setting up, using, and trying to use the device.I own several Roku devices, an iPad, two top of the line android tablets from top brands, one of the most popular android phones etc. My TV is a Samsung 55 inch 3D led etc. I've got piles of computers, notebooks, etc. I am an avid chrome user, I am an avid google app user, I am an avid youtube user, I have subscriptions to netflix, hulu, and amazon prime etc.To say I love streaming media, tech gadgets etc. is an understatement.I consider myself to be an intermediate to advanced user and can figure out pretty much any device quickly.Installing chromecast and getting it set up on my TV was fairly easy. Not much more difficult than setting up a Roku.And that is where the easy to use part ends.Everything after that is simply suck. I have used my phone previously over my wifi to connect to my tv for other apps and even watching youtube without chromecast... and the major difference between that experience is that it actually worked.Chromecast continually appeared and dissappeared connected and disconnected. I could not readily control the play of content like I can with a Roku remote and a Roku.Frankly figuring out how to use chromecast with my phone it was one of the most un-user friendly and worst experiences I have had with any app and with any digital media product.I would not recommend this to anyone. I was excited to start using chromecast after Santa stuck it in my stocking... but instead it turned out to be a techie lump of coal. It turned the thrill I had imagined it would be to a frustrating experience... kindof like sticking your tongue to a frosty metal pole.I would recommend Roku day and night over chromecast. Roku is easy to use, works well, and delivers a delightful experience.chromecast... is like the blind date from hell.However, I am a charitable guy and I plan on giving chromecast a second date... after the frostbite on my tongue heals from my first taste.", "verified": true, "helpfulness": "1/3", "author": "optimizeyourvideo"}, {"rating": 5.0, "review": "What are waiting for - just buy - oh so worth it. You won't regret it. I knew about the back order and waited almost 2 months. Still ordered.Gets better each time they update it!", "verified": true, "helpfulness": "1/2", "author": "Anthony Gnzalez"}, {"rating": 4.0, "review": "O Chromecast é um equipamento muito interessante pelo custo dele.Já soube que nos EUA existem váriás aplicaçoes, tais como, Netflix, You Tube HBO Go, Google Play, etc.Porém, ainda não ha muitas aplicações para o Brasil (apenas You Tube e Netflix). Assim que os demais estiverem disponíveis, será excelente.The Chromecast is a very interesting device at purchase cost.I've heard that in the U.S. there are several applications such as Netflix, YouTube, HBO Go, Google Play, etc..However, there are no many applications to Brazil (only YouTube and Netflix). So what else is available, will be excellent.", "verified": true, "helpfulness": "0/1", "author": "Luis Fernando Manzano"}, {"rating": 1.0, "review": "1. can't stream off solarmovie and I'm assuming any other streaming site that isn't in bed with google. Tried solarmovie and it plays sound, not video. (tried several video hosting sites via solarmovie, same result) Google blocks \"Pirate sites\"2. Can't play movies/music/anything off your own hard drive. I looked and looked, there is no feature that allows you to do this. WHY? (what if you have personal home movies, or digital copies of your own movies)3. You have to download Chrome, then install an add-on for chrome to use this. It's a huge hassle, nothing like the TV spot.4. I hope this was revealing enough for most of you to make the right choice and not buy a google product. I made the mistake of not reading reviews because I didn't want to spend the time, I should have read the reviews!5. I heard there was an app you could download that allowed you to stream your own files but google went after them by blocking it in their software so now it's obsolete. It seems they will do this every time someone \"fixes\" this problem and tries to use the product for it's intended purpose, playing ANY media from a laptop/phone/desktop hard drive, which is what it SHOULD do.6. I can't wait for the class action lawsuit. This product is a lie, it's a paper-weight. BUYER BEWARE.", "verified": true, "helpfulness": "2/3", "author": "Herbert Watson"}, {"rating": 1.0, "review": "It is not compatible with my network and can't do much from tablet.  Save your money and get Apple TV or other", "verified": true, "helpfulness": "1/4", "author": "Vinh Hong"}, {"rating": 5.0, "review": "I bought this to prevent my PS3 from being on constantly to simply stream video. My wife loves this device and uses it daily and loves how convenient it makes streaming to the TV. You can pick your video on the phone (android) tell it to play to the TV and it will turn on the TV and adjust the input to display the video with one simple click. Our only complaint is with the audio function. It currently defaults to max volume which catches us by surprise almost every time. Hopefully a future software patch will remedy this or make it optional to default to max, another set level, or last set level.The device has been selling itself at my house. Over the holidays 3 family members and friends have left my house to get their own chromecast after seeing how simple and useful it is.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]