[{"rating": 2.0, "review": "The amount of websites you can use this on is limited. I am glad that I only spent $35 on it.", "verified": true, "helpfulness": "0/0", "author": "piwhite1990"}, {"rating": 5.0, "review": "Cannot tell you how much I love this little piece of tech. It's always in use. Only real issues I had with it is sometimes gets too warm. I have to unplug and cool off, then it will pick up requests again.", "verified": true, "helpfulness": "0/0", "author": "Songfeather \"Angie m muller\""}, {"rating": 3.0, "review": "From time to time it has delay, the video freeze, and then it either jumps or plays fast to reach the current time of the actual video on the PC.", "verified": true, "helpfulness": "0/0", "author": "Shlomi Otmazgin"}, {"rating": 5.0, "review": "Works exactly as described, app and updates are rolling out at a great clip and is easily the best $35 dollars I've spent in a long time. If you're a Chrome user this is a no brainer - Must Buy", "verified": true, "helpfulness": "0/0", "author": "Reviewer \"Michael Z\""}, {"rating": 4.0, "review": "Easy to install & works great with my tablet or cell phone!! I would recommend this to anyone I know !!", "verified": true, "helpfulness": "0/0", "author": "Quintico Hunter"}, {"rating": 5.0, "review": "Very Nice device in $30, by using chrome browser from PC/ laptop unleash more options like screen sharing and playing movies in any player.", "verified": true, "helpfulness": "0/0", "author": "Sajjad Awan"}, {"rating": 4.0, "review": "yes it is great device and a new revolution started from ggogle to mprove the video display by another vision", "verified": true, "helpfulness": "0/0", "author": "Sami"}, {"rating": 5.0, "review": "Works great, is easily controlled with my tablet or my computer.Gets really hot after alot of usage so we tend to keep it unplugged when we aren't going to need it and since I have one in my teenagers room instead of a cable box - its really, really easy to make sure the homework is being done - i just pull it out of the TV and return it when I am shown the completed work.Also - the YouTube access is much more reliable than the Xbox 360/Xbone access which seems to be borked more often than not.", "verified": true, "helpfulness": "0/0", "author": "MAsh"}, {"rating": 5.0, "review": "Easy setup and installation and fun to use. Can't wait for more apps to support it. I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "BloodlineK20"}, {"rating": 5.0, "review": "Its small, cheap and easy to setup.  need I say more? Just make sure you meet the requirements and you will be happy.", "verified": true, "helpfulness": "0/0", "author": "James"}]