[{"rating": 4.0, "review": "When it's working 85% of the time, I love it. It's small, its convenient/transferable, and its easy. It's a bit buggy, however. Sometimes it will cause the TV to turn on at random, other times the TV will refuse to recognize it. I find that if I unplug and replug all the Chromecast parts, it reboots and works again, but that is not a given. You will need to have an updated OS on at least one of your devices to download the Chromecast app and get this started. But once it is set up, you can watch/listen to Netflix, Youtube, Pandora, etc, from any device.I do wish there was a quick way to stream from Amazon. I don't see the point in buying a separate device for Amazon streams. I see online that there is a possible work around but haven't tried it yet.", "verified": true, "helpfulness": "0/0", "author": "Alice in Wonderland"}, {"rating": 5.0, "review": "Works as indicated.  I can go watch a movie or something while my husband watches sports.", "verified": true, "helpfulness": "0/0", "author": "Debbie Montgomery"}, {"rating": 5.0, "review": "Waiting for the new model but this one is still great!", "verified": true, "helpfulness": "0/0", "author": "Rodney Smith"}, {"rating": 5.0, "review": "Great. Turns a non-smart TV into an internet ready one. Can watch Youtube, Nexflix, Hulu and a bunch of other things right from my iPad/Laptop.", "verified": true, "helpfulness": "0/0", "author": "Mel"}, {"rating": 2.0, "review": "I have a Samsung 50\" plasma TV and a Samsung Galaxy Tab 2, so it's slightly older tech. Perhaps that's why the Chromecast sucks. Here are my issues:1) No native support for local files. Yeah, there are workaround apps like Videostream (which I love), but Chromecast originally HAD support for local files and they turned it off with the update. That's crap.2) I can cast webpages from my computer but not from my tablet. The 'cast' widget at the top of Chrome doesn't exist on their mobile site, or at least, it's not in the place it's supposed to be and I haven't been able to find it.3) The connection between Chromecast and my TV drops randomly. It will just decide it doesn't want to talk to the TV and I'll have to remove it, unplug it, wait sixty seconds, plug it back into the TV and power it back on to make it work.4) The connection between Chromecast and my tablet drops randomly. [Please note, neither of these are HDMI port or wireless problems - I have troubleshot both of those; it is the Chromecast.]5) I have to select the apps on my tablet, there's no way to do it from my TV screen. I thought there would be a tile screen but there isn't.WHEN it works, it works nicely, but it's frustrating to have to use my tablet for the Chromecast remote and my TV remote for things like volume/etc. The fact that it doesn't work terribly well or stay connected long enough for me to watch more than half a TV episode at a time is a dealbreaker. I am going to buy a Roku 3 player and try that instead. Chromecast feels like a piece of tech that is badly in need of a firmware update.", "verified": true, "helpfulness": "0/0", "author": "Spookyevilone"}, {"rating": 2.0, "review": "Without internet this thing doesn't work. If I have internet there is no point in using chromecast.", "verified": true, "helpfulness": "0/0", "author": "Azamat Mashukov"}, {"rating": 2.0, "review": "It worked great the first day & stopped working after that.  The dongle is somehow not really connecting with the HDMI port. I've tried other cords in there & the port itself works fine. Sometimes when I try to turn on chromecast it says it can't find the tv, and sometimes it says it can & that it's casting, but I don't see anything on the TV itself. I'm pretty disappointed.", "verified": true, "helpfulness": "0/0", "author": "The Mysterious Woman"}, {"rating": 5.0, "review": "Works great for streaming from my desktop and Android devices. I suggest it to friends and family often to increase the streaming capabilities of their home theater systems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works good but freezes a lot of the time", "verified": false, "helpfulness": "0/0", "author": "Kari L O Bannon"}, {"rating": 5.0, "review": "Very useful", "verified": true, "helpfulness": "0/0", "author": "Orsan Awawdi"}]