[{"rating": 5.0, "review": "Great Product!Works well with apple products and pc.Would recommend it to people who are looking for streaming media player.", "verified": true, "helpfulness": "0/0", "author": "RQTS"}, {"rating": 5.0, "review": "There are very few things that work as well as this.  Setup was very simple.  It will pretty much divert anything you can watch on your other devices to the tv display.  Right now, I'm using this as the only device on one TV and its been fine.", "verified": true, "helpfulness": "0/0", "author": "BillyB"}, {"rating": 2.0, "review": "Until this happens, I'm not even going to use it considering I can stream my Netflix and YouTube from my XBox.", "verified": true, "helpfulness": "0/0", "author": "Mike Rush"}, {"rating": 4.0, "review": "Plugged it in, followed instructions and everything worked well. Would like it more if there are more applications that support casting.", "verified": true, "helpfulness": "0/0", "author": "Roy"}, {"rating": 5.0, "review": "Great buy you can stream from laptop chrome Browser or Stream Netflix from a smart phone no problem. Great supplement to cable.", "verified": true, "helpfulness": "0/0", "author": "Brandon Robertson"}, {"rating": 5.0, "review": "I bought this for my boss & my mom's Christmas present and our family has so much fun streaming Netflix, Youtube (& Etc) from her tablet to our TV.The set up was not too difficult (we had some difficulties but I think it was a problem on our part). It was fun to see how much features they put into it though. I definitely appreciated seeing a product that was fully designed and not just 'first time testing out product'. It wasn't on the pricey side so it made me feel good to have a full-featured product.For the future though, I really hope 'chrome' on tablets could stream videos as well. This wasn't too much of a problem but it sometimes bothered us. Especially watching movies from Amazon, you couldn't stream it from the tablet. (Which actually led me to find out you can't stream it through a desktop/laptop either because it does not stream Silverline Media-- although I believe Netflix is silverline... strange-- I'm not an expert on this side so i'm not asking for arguments/comments);;Great purchase though!! We definitely used it enough to be worth every penny and more", "verified": true, "helpfulness": "0/0", "author": "kelly lim"}, {"rating": 3.0, "review": "I expected more. Such as screen mirroring and more app functionality. I've heard rumors of more but until then I'm not too happy with chromecast. I've also had problems with interrupted connection for no reason. However, it is much easier to display my screen to the tv and I do use it a lot.", "verified": true, "helpfulness": "0/0", "author": "Blake Barnes"}, {"rating": 4.0, "review": "The product is good, gives you opportunity to use your tv with internet, but only with Neflix and You Tube, I will like it more if other possibilities were available", "verified": true, "helpfulness": "0/0", "author": "Luis Alfredo Solano"}, {"rating": 3.0, "review": "My wife bought this for me for Christmas, and while it did work for YouTube it didn't do what we really needed, which was Amazon Streaming, but they did refund the money quickly and without complaint.", "verified": true, "helpfulness": "0/0", "author": "Bazandsuz"}, {"rating": 3.0, "review": "bought this just to test it because i was interested in how it works. but seeing as how my i have a ps3 already connected to my tv, I don't need this chromecast to stream from my ipad.maybe i dont know how else to use it so im only giving it a 3 star.", "verified": true, "helpfulness": "0/0", "author": "Howard"}]