[{"rating": 5.0, "review": "Chromecast is awesome.At first I had some trouble setting it up but it was mostly due to our ****** Verizon router.Once that was out of the way, the setup took only a minute and I was enjoying YouTube videos on my TV and controlling them from my phone.", "verified": false, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 4.0, "review": "When I heard about the Chromecast dongle and the Netflix deal (which is no longer available due to initial demand), I readily hopped on, bought my device from the Google Play store and received my Netflix code for 3 months.  This made it a no-brainer for me.  As an owner of a Roku device, I knew there was going to be some overlap for services but I wanted to try it anyway.  Truly, for the most part (besides some stability issues with my Nexus 4) I have been nothing but impressed.I am streaming multiple ways from different devices:1) Google White Nexus 4 Phone Limited Edition 8gb - Unlocked running Android's latest OS Jellybean 4.32) Samsung Galaxy Note 8.0 (16GB, White)3) Macbook Pro 13\" running Mountain LionOut of all of my devices, I prefer to run Chromecast from my Galaxy tablet as this appears to be the most stable.  The picture quality is excellent and with our current Internet connection (which is fast at 50 up and 5 down), streaming does not seem to run into many delays.  It's fun to watch YouTube on a larger screen through this device.  Currently it only supports Netflix, YouTube and Google movies.  But Hulu, Vimeo and Instant RedBox are in the process of getting onboard with Chromcast.  One of the coolest features about this device is that once your start streaming, you are free to use your device any way you want to.  Once the stream is going you can check email, surf the web, etc .... the cast is already happening and is taking place in the background.  This technology kind of blows my mind.  :-)Set up is a breeze with guidance and good feedback through the entire process.  In under 5 minutes, you can be ready to roll with this device.Besides the stability with Nexus 4 (the Nexus 4 is crashing / shutting down during streaming) this thing is very cool and very handy.  The stability with Nexus is being addressed (interesting that it is a Google phone with stability problems - grin).  The problem really appears to be this: Putting some Android 4.3 devices to sleep while using Netflix causes freezing.  So I don't think I can blame Chromecast - seems to be a combo of Netflix and 4.3.4 stars only because of the Nexus 4 (Jelly Bean 4.3) issue.", "verified": false, "helpfulness": "1/1", "author": "Diana De Avila \"MS Gkygrl\""}, {"rating": 3.0, "review": "Pros:  Great for Netflix and YouTube viewing.  Clean image, no lagging.  Easy to set up.  Nice small form design.  Portability excellent.  Good price point.Cons:  Google Play Music does not stay connected once you select a song to play.  Chromecast software not available for Kindle Fire Hd so no casting from that device.  Browser function only works via PC, not via mobile device.  Casting video via PC is lousy (lip-syncing off, etc), as the software allowing PC casting is still in Beta testing mode.  Availability (as of this writing).Overall, the device shows a lot of promise.  Once more content developers get on board (Hulu, Amazon Prime, Pandora, etc), this product will shine.  If you need Netflix or YouTube access while travelling, this product is perfect as long as you have a good WiFi connection. You will not be able to browse the Net unless you have a newer PC or Laptop with you running the most recent OS.", "verified": false, "helpfulness": "0/3", "author": "LockjawAl"}, {"rating": 5.0, "review": "Got this finally, today. Setup was a breeze. Cast Youtube and Chrome tabs, they all worked perfectly. Had a problem with Netflix though. Evreytime I cast Netflix to Chromecast, it loads a long time and after that tells me that the video was not available. After that my internet slows down significantly. Had to reset my modem and router and Chromecast for my internet to return to normal. It happened when I cast from my laptop on win7 and my android tablet on ics. Googled the problem but it seems the only know problem so far is Netflix not working well with android 4.3. Other than the Netflix issue, I love the Chromecast. If anyone has any suggetions regarding the Netflix issue, feel free to comment.", "verified": true, "helpfulness": "2/3", "author": "Eric L"}, {"rating": 5.0, "review": "I have a newer extra tv in one of my rooms and my wife loves to watch Netflix when she is in that room. It is a basic HD TV, no smart TV. I was racking my brain on how to get Netflix on it. My wifes tablet didn't have an HDMI out, mine did, but then I couldn't use it when she was. And then Chromecast was announced. It works as advertised. Streaming is clear and precise. It was very easy to setup. I think Google has something here. And when they start accepting apps from 3 party developers who knows where it will go.", "verified": true, "helpfulness": "1/1", "author": "S. Strassburg"}, {"rating": 2.0, "review": "Very disappointing. Paid more than double as Google site is on back order. It's such a beta version that doesn't meet my expectations", "verified": true, "helpfulness": "0/8", "author": "\"Motives\" \"CL\""}, {"rating": 1.0, "review": "I was really excited my Chromecast finally came in.  It was easy to install the software on my computer and get it working but that is about all I can say about it.  The picture really is poor on the TV and sometimes it hangs up.  Quality of picture is poor and reliability is poor.  Oh and the content to choose from is pretty limited.  Wish it could play HULU.  It really is not ready for prime time but it holds a lot of promise.  I have a powerful computer and newer TV and still it did not work very well.  Most everything except for you tube is pay per view. If I knew what I know now I would not have purchased it.", "verified": false, "helpfulness": "5/21", "author": "Bill \"B\""}, {"rating": 1.0, "review": "Very disappointed to learn that I was not able to use this item. I was not made aware that uPnP had to be enabled and that AT&T; routers do not have the uPnP feature available.", "verified": true, "helpfulness": "6/25", "author": "Jake"}, {"rating": 2.0, "review": "The only thing that works well with chromecast is youtube and netflix. casting tabs is terrible, extremely glitchy and slow. You also cant play videos through chrome and cast them to your t.v the quality is terrible and rarely works without freezing.", "verified": true, "helpfulness": "1/11", "author": "Dalton"}, {"rating": 5.0, "review": "I like watching YouTube from my TV. Simple as that. I can't wait to see what else will be available to stream.", "verified": true, "helpfulness": "1/1", "author": "Terrence E Lee"}]