[{"rating": 1.0, "review": "Please do not buy chrome cast. It is useless, the streaming is not seamless (often buffering issues). No remote. Just worthless. I bought apple TV and that was the best $50 ever. Apple TV is much better.", "verified": true, "helpfulness": "0/0", "author": "anandrmy"}, {"rating": 5.0, "review": "Awesome product! Got it with no problem. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Giulio Sansonetti"}, {"rating": 5.0, "review": "Just keeps getting better and more updates and platform support continues to roll out.", "verified": true, "helpfulness": "0/0", "author": "kvandy15"}, {"rating": 1.0, "review": "it was used and didn't work", "verified": true, "helpfulness": "0/1", "author": "Joshua J Romero"}, {"rating": 5.0, "review": "Works great.  Plugged it into an open hdmi port & powered it with the usb on the tv and had it synced and casting in less than 5 mins.  Picture and sounds quality is very good and no complaints from me.  Will buy two more - one for another tv and one to travel with.", "verified": true, "helpfulness": "0/0", "author": "JustSayin"}, {"rating": 5.0, "review": "works great!!!", "verified": true, "helpfulness": "0/0", "author": "Mador"}, {"rating": 5.0, "review": "Love it!  I recently went \"unplugged\" and did not have a device to stream to my bedroom TV.  I was overwhelmed by the options and didn't want to pay too much.  This was the perfect device for me.  Best price and now I can stream Hulu and Netflix straight to my TV.  Super easy!", "verified": true, "helpfulness": "0/0", "author": "Jordan N Penner"}, {"rating": 3.0, "review": "A little touchy, and not as widely-compatible as I had hoped.  I guess it's my fault for thinking this was going to be more like a screen mirroring tool.", "verified": true, "helpfulness": "0/0", "author": "Ryan Goudge"}, {"rating": 5.0, "review": "I love my chromecast this is a close 2nd to dvr such a great device and you can't beat the price only regret I have is I didn't buy it sooner", "verified": true, "helpfulness": "0/0", "author": "Curt baby"}, {"rating": 5.0, "review": "Very  good", "verified": true, "helpfulness": "0/0", "author": "Jassem.a"}]