[{"rating": 5.0, "review": "Fire TV brought my LG smart TV and sound bar to life. Just another great Amazon electronic device and purchase.", "verified": true, "helpfulness": "0/0", "author": "Jones"}, {"rating": 4.0, "review": "I have a Roku and got this Amazon FIre TV and this is what I like and not so much likeWhat I like:* I like the voice search, screen saver, mirroring of Amazon Kindle or other Android Devices to TV.* I like the fast forward feature which is done really well.* Streaming seems to be really well done, I have not had any issues with network latency.* It is nice and compact, has great integration with Amazon Kindle HDX.* Screen saver is kind of cool and looks great on HD TV* Speed I love the response time of voice search and UI.* The weight, feel and quality of both the device and remote control.Not so much:* Although the user interface looks great, but I have issues accessing apps option (have to click so many time to get there)* Can not import apps from amazon (or at least I have not a way to do that yet) I would have liked to install coursera app on it.* Finding the last thing I was watching (last watched) is non-existent. So if I exit a movie I have to repeat all the steps I did to find it in first place unless I remember to tag it as add to watch-list* Exploring beyond what is recommended for Prime users can only be done with voice (for instance you have to say sci-fi prime to see those).* Sometime I want to watch something other what I usually do, but the interface focuses a lot on what historically the family watches) Would love to have the same kind of feature for genres.", "verified": true, "helpfulness": "0/0", "author": "ADONIS"}, {"rating": 5.0, "review": "Love my Amazon Fire TV.  Works well and compares favorably to Apple TV and ROKU of which I have both.  As a Prime member, I recommend this.  I find that I watch a lot less of Comcast cable.", "verified": true, "helpfulness": "0/0", "author": "Patricia B \"historical bookster\""}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "T. mulqueen"}, {"rating": 5.0, "review": "Amazon Fire is great and I love it. I was just disapointed that I did not get an invitation for the ECHO since I have been a prime member for years, Amazon Music, Cloud and purchase thousands of dollars of items through you site yearly. At least you tell me why I wasnt picked.", "verified": true, "helpfulness": "0/0", "author": "bingo63"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Everardo Gomez"}, {"rating": 5.0, "review": "Love this! Best purchase I've made in a long time. They've made it very easy for a prime customer to find content. Easy setup and simple remote. And I LOVE the voice search capability. I didn't think I'd use it, but I do all the time. Although, thinking a game controller should come with the device instead of a separate purchase, but overall satisfied.", "verified": true, "helpfulness": "0/0", "author": "Abby Dee"}, {"rating": 4.0, "review": "I would really like to see CBS app. That is one of the few channels I miss after cord cutting. I don't mind paying separately for it.", "verified": true, "helpfulness": "0/0", "author": "Gopinath"}, {"rating": 3.0, "review": "Buggy, slow, no help, needs mayday... :)DocAlright, after using for a longer period, I have to say that Amazon has responded rapidly. The system and engineers seem to be self correcting and responsive to input. The Fire TV System produces absolutely Beautiful graphics, and they have brought the Music from my Playlists  :) ! I will watch to see how it develops.Doc", "verified": true, "helpfulness": "0/0", "author": "DocSkaets"}, {"rating": 1.0, "review": "Used the box once about to return it, not many apps", "verified": true, "helpfulness": "2/5", "author": "Dwayne Escoffery"}]