[{"rating": 3.0, "review": "It was quite simple to install and easy to navigate. I was disappointed by the number of movies and TV series that I would have to pay for, even with purchasing Amazon Prime. I would caution those who would ask me about this product. Still considering returning it.", "verified": true, "helpfulness": "1/3", "author": "Kathy O'Connell"}, {"rating": 5.0, "review": "Great product, the only down I wish it had and on/off button on it.. but otherwise better then my apple Tv...", "verified": true, "helpfulness": "1/1", "author": "Jon Z."}, {"rating": 5.0, "review": "I love everything about it!!!", "verified": true, "helpfulness": "0/0", "author": "Devin"}, {"rating": 5.0, "review": "Love, love, love my Amazon TV!  It is so easy! Plug in and watch.  So much better than using my Blu-ray player to access Netflix, Hulu, etc.  No buffering.  Voice selection is a dream.  Good Job!", "verified": true, "helpfulness": "1/1", "author": "Summer murdock"}, {"rating": 5.0, "review": "WOW!  More expensive than Roku, but way more convenient.  Easy to use.  Very happy with it", "verified": true, "helpfulness": "0/0", "author": "Beach Bum \"Mark\""}, {"rating": 5.0, "review": "I prefer Amazon for my entertainment purchases so this device is awesome for me.  I can watch movies on demand and listen to my music all from the convenience of one device.", "verified": true, "helpfulness": "0/0", "author": "Troy Robinson"}, {"rating": 1.0, "review": "Not really a clear picture, just about anything that comes from it, is costing, we have netflix that comes through wii, nice and clear and easy to manipulate, but not the Fire, it is unclear in picture and is hard to find what you want and make the choice.", "verified": true, "helpfulness": "4/8", "author": "Paul W. Merrills"}, {"rating": 3.0, "review": "Looks great in every way except for one: no HBO Go.  I'll stick with my Roku until the day after this is resolved.", "verified": false, "helpfulness": "3/7", "author": "S. Mazzola"}, {"rating": 3.0, "review": "Fire TV works fine, but the instructions are limited. You now have access to aps. that you have never seen and don't know what they do. Amazon should send detailed information so you do not have a research project.", "verified": true, "helpfulness": "1/3", "author": "Dennis L"}, {"rating": 4.0, "review": "I think anything Amazon does, they do well!! However, I don't understand why Amazon neglected to include the headset jack on their remote control like ROKU did???  Such a simple feature that I'm sure is easy to include in near future models..AMAZON- you add that feature and your system has it all!!", "verified": false, "helpfulness": "0/0", "author": "Anthony F. \"aferrugio\""}]