[{"rating": 1.0, "review": "At first I loved it. It's easy to use, and the accessibility of applications is phenomenal. However, since the last update (Which I had no choice in doing as it happened automatically) everything has gone downhill dramatically. Netflix and Hulu both are basically unusable, and seeing as they are the main reason I have Amazon Fire Tv in the first place, that is unacceptable. It loses network connectivity all the time, even though both my tablet and laptop are on the same network without issue. In fact, the only service which seems to work as well as it ever did is Amazon Prime Video. If you are looking at this product, I highly suggest waiting until Amazon pulls themselves together,and makes an update that will upgrade their service without being at the expense of other video streaming services.", "verified": true, "helpfulness": "4/5", "author": "ryan otis"}, {"rating": 4.0, "review": "I have had mine since December 2014. I'm very pleased with it. I made the choice for the Amazon fire TV because I have Amazon prime I wanted Netflix and none of the other apps matter to me. I do not have a subscription to HBO so even if it had HBO go I wouldn't be using it.I do wish that it had the headphone jack in the remote like the Roku three does . I  hope that that will soon be an upgrade for the Amazon Fire TV.  Are you listening Amazon?", "verified": true, "helpfulness": "2/2", "author": "Tom"}, {"rating": 5.0, "review": "Execellentttt", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 5.0, "review": "I own  Roku and Amazon Fire is a thousand times better.", "verified": true, "helpfulness": "1/1", "author": "edward hoeg"}, {"rating": 5.0, "review": "Everything I needed in a media player. Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Dean Lichtenwalner"}, {"rating": 5.0, "review": "Easy to set up. Fast speed.", "verified": true, "helpfulness": "0/0", "author": "E.M."}, {"rating": 5.0, "review": "Fantastic system, ready to go right out of the box.  Simple, 2 plug-ins and you are ready for set-up.  Pick your language, follow a few on screen prompts and go!", "verified": true, "helpfulness": "1/1", "author": "Edward Linstrom"}, {"rating": 5.0, "review": "It is so easy to use.  I am very pleased.  I don't know why I waited so long to get it.", "verified": true, "helpfulness": "0/0", "author": "nancy trimble"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "brian cosgrove"}, {"rating": 3.0, "review": "Great product but there are no options to switch the language, if you purchase a dvd you have these options, if you purchase a digital copy of a movie, you do not.", "verified": true, "helpfulness": "1/1", "author": "J"}]