[{"rating": 5.0, "review": "I uninstalled Microsoft Silverlight on my PC and stream amazon videos using adobe flash insead. Works like a champ. So long cable.", "verified": true, "helpfulness": "0/0", "author": "Matthew Benson"}, {"rating": 4.0, "review": "I only wish I were able to stream music from my PC. It would also be nice if there were more apps available.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "This little gadget makes it easy to view NetFlix from any enabled device in the house. Simply start NetFlix and then hit the cast button at the bottom of the NetFlix player. Poof, it appears on the TV. You can then control (pause, fast forward, reverse) on the device and if you wish you can then do other things on the device while the movie continues to play on the TV. Can also cast other things such as YouTube. Cheap and it works. No more cable between the PC and TV to watch a movie. Just \"cast\" it.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Great product! Works great with Netflix and YouTube. Let's hope Google brings more support soon. Recomended for anyone who needs to bring Netflix to other TV in their home.", "verified": true, "helpfulness": "0/0", "author": "JPRR \"JPR\""}, {"rating": 5.0, "review": "You can read about the features and specs from the product page. The main things I love it for:- Ability to cast to your tv set whatever you can load in a browser on your desktop or laptop. No missing plugins, file formats incompatibility and ridiculous remotes to deal with (as was the case with Boxee).- Price.It would certainly be nice if the ease of casting was the same from tablets and phones as from a pc, but hey, together with the price that would be communism and we don't want that!", "verified": true, "helpfulness": "0/0", "author": "Ognian Bozikov"}, {"rating": 5.0, "review": "I was impressed how quickly the chromecast arrived.  I bought it on sale on Thanksgiving and it arrived within days.It was easy to set up and executed as advertised.  I would like the ability to broadcast (chromecast) from devices other than my desktop but I understand that might be coming.Compared to more expensive options like Apple TV and Roku, I found this to be an inexpensive first foray into integrating my HDTV into my web experience.", "verified": true, "helpfulness": "0/0", "author": "Barry McDonough"}, {"rating": 2.0, "review": "This device doesn't really do what it says in the advertisements.  In fact, it is next to useless in my opinion.  My biggest complaint is the slow response.  Watching a movie from Amazon or Netflix was next to impossible, especially in HD.  Youtube was a little better, but it still took a long time to buffer.  My guess is that, since it is using the same wireless from the PC to the TV that is being used from the Internet to the PC, it is overloading the bandwidth.  So a hardwired connection to the PC might help.  But that defeats the purpose of being able to stream from a Laptop to your TV.So, while I will give Google a lot of credit for coming up with a great way to stream information from a PC to a TV, it has a lot of bugs and the wireless technology currently deployed in most households (802.11 B/G/N) doesn't support it very well.", "verified": true, "helpfulness": "0/0", "author": "John G"}, {"rating": 5.0, "review": "I bought one and within two weeks bought another one. We are using this to replace our cable TV.  We do have netflix and hulu plus; if we had amazon prime we might have had a total win with this.  If you have a blu ray player you may not need this.  I like that I can control both devices with my cell phone, iPad, computer and my husband's phone.  It was totally worth the price; they have been on sale here and at best buy for about 25; definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Ashley Smith"}, {"rating": 5.0, "review": "Simple to connect, simple to use, and very inexpensive...a great addition to my wireless entertainment network. I Highly recommended chromecast.", "verified": true, "helpfulness": "0/0", "author": "V Dixon"}, {"rating": 3.0, "review": "Otherwise, worked as expected. Easy to initially set up. The picture and sound were good; better sometimes than others. As yet (1 week) I have not looked into tweeking the set up to see if it can improve.  As yet, not DVD quality, if that is your expectations.", "verified": false, "helpfulness": "0/0", "author": "Purchasing Mgr"}]