[{"rating": 5.0, "review": "I love connecting this to my TV, and watch tv series on netflix with just some taps on my phone, it's easier than connecting through HDMI from a computer.It's cool to watch youtube videos, netflix and any other video if you mirror through the chrome browser on your computer.You can play any movie you have on your computer. Just left-click on the movie, select the file \"open as default in\", and select chrome. The movie will open up in chrome browser and you can mirror that with the chromecast app for chrome.It literally takes 10 minutes tops to install the chromecast. I love to take it with me while I'm traveling.", "verified": true, "helpfulness": "1/1", "author": "Gioco"}, {"rating": 5.0, "review": "Does all I need it to do. Love it!", "verified": true, "helpfulness": "0/0", "author": "Sher Suki"}, {"rating": 5.0, "review": "This device is a very good way to cast some Internet things through your TV (by HDMI). It's easy to configure it and allows access to a wide range of Internet channels.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "As described", "verified": true, "helpfulness": "1/1", "author": "Bernard Hauser"}, {"rating": 5.0, "review": "Received very quickly, pleased with item", "verified": true, "helpfulness": "1/1", "author": "Robert D Lee"}, {"rating": 5.0, "review": "I can now watch Orange is the New Black. Great product.", "verified": true, "helpfulness": "0/0", "author": "Guy Browning"}, {"rating": 5.0, "review": "These are fantastic, simple and effective. Now if you could get the chromecast feature on more applications it would be even better. Great for streaming youtube from phone to TV.", "verified": true, "helpfulness": "0/0", "author": "Sir Walter Raleigh"}, {"rating": 1.0, "review": "Bought this and bought Apple TV .guess what's not working correctly and is essentially trash! I wanted chromecast for my gym monitor and it just can't stay connected to Internet it keeps giving me error messages and it is extremely hot all the time! I bought Apple TV and replaced it haven't had a problem with it yet", "verified": true, "helpfulness": "0/1", "author": "Colleen Son"}, {"rating": 4.0, "review": "Design and flexibility are great.  Reason I did not give 5 stars is that some apps are pixelating at times whereas other streaming devices and apps I use like Roku, slingbox, Netflix, Amazon Video maintain cleaner picture.  I'm going to double check my wireless network to be sure, but initial tests make me think it is the Chromecast.  But, for $35, I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Tony Jerig"}, {"rating": 4.0, "review": "It's a chromecast!  Plug it in, connect it to your network, away you go.  I couldn't get the installer and original setup to work from my laptop, but it worked fine from my phone.  I'm betting on my system not requesting a new IP when it tries to connect to the chromecast's wifi setup system.  Either way, it works great and they're pretty cheap.", "verified": true, "helpfulness": "0/0", "author": "Mitchell Dodge \"GameCharmer\""}]