[{"rating": 5.0, "review": "this was my second Chromecast I like my first one so much, I wanted one for the bedroom", "verified": false, "helpfulness": "0/0", "author": "Kevin Phillips"}, {"rating": 4.0, "review": "A little finicky at times, but at this price I cant complain.", "verified": true, "helpfulness": "0/0", "author": "litMargin"}, {"rating": 5.0, "review": "Love that this is now supporting screen-mirroring in Beta. Compatible w/ many apps like Watch ESPN, HBO GO, YouTube, Netflix and others if you want an alternative to Cable. Doesn't do the best job supporting local files from phones and computers, unless you download a proxy server called \"Plex\" which works well enough. Easy to set up, takes like 5 mins max. You can also use tablets to connect to the Chromecast. Only $34 not on sale and a friend of mine bought it at Best Buy on sale for about $27 after tax. Good investment and great alternative to Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Chris L"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "kenny"}, {"rating": 5.0, "review": "Makes my life easier.", "verified": true, "helpfulness": "0/0", "author": "Mita Mia"}, {"rating": 5.0, "review": "Pair this baby with plex and you're set. Great substitute if you don't want to get roku.", "verified": true, "helpfulness": "0/0", "author": "Jessica Price"}, {"rating": 5.0, "review": "Great transaction, product works great", "verified": true, "helpfulness": "0/0", "author": "Thomas E. Meyer"}, {"rating": 2.0, "review": "Needs a dedicated remote control and on screen GUI to be prime time. Trying to drive this with a smart phone is way too clunky. Otherwise it's a great product. With a dedicated remote control and on screen GUI I'd give it 5 stars, and be happy to pay twice the price. Priced at the Roku entry price it would give Roku a run for it's money.I have Boxee Box, Apple TV, Roku 2 and 3 and just acquired an Amazon Fire TV - the Fire TV is IMHO best by a country mile. Voice search is a killer.Amazon Fire TV", "verified": true, "helpfulness": "0/2", "author": "Peter S."}, {"rating": 5.0, "review": "I didn't even know this was a thing. When I found out it was a thing, I immediately purchased it and have been enjoying it ever since. A much cheaper option for those considering Apple TV or Roku. Sure, there are far fewer options, but I just wanted to watch/use Netflix, HBO, Youtube, and Pandora on my TV, and that's what this device allows me to do. I have no complaints. It works great.", "verified": true, "helpfulness": "0/0", "author": "AgentPrice"}, {"rating": 4.0, "review": "It does the trick and allows us to stream Netflix to our televisions that don't have a Playstation 4 or Xbox 360 hooked to it.  Pretty easy to set up.  My only complaint is that there is not a Windows Phone or RT app to control it due to the constant feud between Google and Microsoft on Windows Phone compatible apps.  My wife can use her I-Phone or I-Pad to control it, but my Windows Phone and tablet cannot, so I may end up getting a Roku player instead since they have released a Windows Phone app for it.  With the low price tag on this product, we purchased a few of them as Father's Day gifts that were very well received.  Nice product!", "verified": true, "helpfulness": "1/1", "author": "dkilbo02"}]