[{"rating": 4.0, "review": "First.  I too was confused by having to \"pay\" for prime shows.  Solution is to just ignore the payment buttons at the bottom of the big pretty show button and click the big pretty show button.  It will stream the show for free.  I think this confusing setup is worth a half star demerit based on other's problems.I like it a lot.  Plex works fine.  I literally set up a Plex server yesterday with a sample movie and the fire tv found it instantly and streamed well.  Amazon Prime stuff streamed instantly and with good picture quality.  Pandora was great.  I ran it for six hours Saturday without interaction.  That is a really long time for Pandora to not require input.Bad...  why the heck can't I stream my amazon cloud mp3s?  There should be a tab just like movies, tv shows, etc...  It would let me stream my photos...  Poor decision there.  Be sure to go into settings and see if the sound is set up for surround.  It was just stereo out of the box.I've used Chromecast, WD Live, Xboxes and Playstations for streaming before.  I like this better.  May still try a Roku.It is missing channels that people care about.  They will come.  This device is going to have too big an installed base to ignore.  It is less than a week old.", "verified": true, "helpfulness": "3/3", "author": "J. L. Fitch"}, {"rating": 4.0, "review": "I have owned several generations of the Roku up to the Roku 3, so this review is largely based on experience with those.  Overall, I'm impressed with the polish and speed of this device. The remote is responsive and the voice search is very appealing.  For instance, I can speak the name of director and it will find all of those on VOD in the Amazon library.  The Miracast feature is very useful, especially for the kids who can start watching a movie on the table and send it over to the TV.That being said, I still may return the device.  I don't intend to use it for gaming, as I think big name consoles are  better for that.  The biggest downfall of this device has been reviewed extensively, and that is the lack of Universal search.  I have  Netflix, HULU, and HBO subscriptions, so this device lets me down on this front.  Having young kids, this is especially frustrating: I would love to be able to hand them the remote and and let them dictate by voice what they want to watch, and it post the free content first.  The lack of HBO application is also very frustrating, but I suspect that will be available in the next few months.  Overall, until universal search is available, I still think the Roku 3 may be the best option for the price (if Fire 3 were $50, I wouldn't hesitate to stock up on them, however).", "verified": true, "helpfulness": "1/4", "author": "Kindle Customer \"bigmbooks\""}, {"rating": 5.0, "review": "This works great, easy to set-up, tons of cool stuff to watch and explore, got it friday and used it all weekend whenever I could, watching netflix, prime, music videos on vevo, video games w/ the kid. Only complaint is when I tried to watch breaking bad on netflix, it wants to charge me 2.99 to watch each episode in HD when I already have a streaming subscription, so I can watch it free on my ipad but I need to pay for it on fire? perhaps it should be advertised as such.", "verified": true, "helpfulness": "1/1", "author": "Nathaniel D Gray"}, {"rating": 3.0, "review": "WHAT IT IS TODAY:Except for two features (a) Gaming, and (b) Voice-Control, it's a very `me-too' device. On the video side, the Roku 3 can do MUCH more. Pretty much everything else out there...Apple TV, Boxee Box, etc. can do at least as much as the Fire TV can. So net, net - very unimpressive. Now, lets take a look at the new features;(a) Gaming works well. I tried playing a game called `Riptide 2' using the Fire Remote, and it was fun. I can see that this device will definitely appeal to the casual gamer. Additionally, Amazon has created \"lists\"...which are nothing but curated lists of games for various segments...I saw games for `families', `weekends', etc. On the down-side, the library is extremely limited.(b) Voice-Control is cool, and generally works well. However, for the moment it searches through just Amazon's catalog of videos and games. Thanks to Prime's limited library, most items are paid (rent/buy on Amazon Instant Video). Again, the Fire-TV falls flat, in my opinionWHAT IT CAN BE:Two ways to look at this - (a) as a general consumer, and (b) as a techie(a) As a general consumer, the biggest grouse you are likely to have, is the lack of content. That said, Fire TV is new, and has a pretty decent lineup of apps at launch. In terms of the future, Amazon has released a SDK for developers to port their apps over. So I think it is safe to assume that we are going to see a boatload of apps come over to the Fire TV. Noteworthy is the fact that in the SDK, Amazon has opened up the Voice-Control API to developers. Meaning: in the future, your voice search will give you results from other apps as well. For example - a search for `Harrison Ford' will give you a list of his movies across your installed apps - Amazon, Netflix, Vudu, etc.(b) As a techie, there are no limits. Folks have already rooted their devices to make it do whatever they want it to do...Fire TV now runs XBMC, supports all kind of apps, launchers, etc. Google is your friend (this might not be relevant to the general consumer).I am still undecided about the Fire TV....and in fact, am leaning towards returning it. Couple of reasons:(a) Fire TV doesn't - and has no plans to - support your own content. So there is no way to hook my own music and video collection into the box (unless I hack into it). Amazon touts Plex as a way of doing this. But Plex requires that I keep a `media server' (basically, a PC running the Plex media server software) on 24X7, so that the Fire TV can stream from it. That's a ridiculous solution, especially given that the Roku can play some type of media files with a directly connected hard-drive. Oh and by the way, Roku supports Plex too.(b) I'm not a gamer; Voice-Control seems gimmicky at the moment(c) I already own a Roku (for streaming) and a Boxee Box (for my personal media) that already get me what I wantNet, net, given the number of connected devices I own, any new device needs to EARN a HDMI-port on my TV, and the Fire TV doesn't cut it - for now.UPDATE 4/9----------I ended up returning the Fire TV. As I said earlier in my review, my existing setup gives me more than what the Fire TV offers (for me - the lack of support for personal media is HUGE. I don't want to keep a 'Plex Media Server' running 24X7 just so that I can view my personal content; my 2-year-old Boxee Box plays all of my media - from my portable hard drive - like a champ). I'm sure the Fire TV will grow up to be great; absolutely no doubts about that. But for now, its got a long way to go to even catch up with whats already out there.", "verified": true, "helpfulness": "5/9", "author": "GNR"}, {"rating": 5.0, "review": "We switched from Netflix to Amazon Prime streaming exclusively a while ago. We had been using computer or XBox 360 clients for some time, and were not very satisfied with the Xbox client's performance. We ordered the Fire TV box as soon as we saw it, and could not be happier.Setup encountered a small glitch, in that when I gave Fire TV the credentials for my wireless network it failed to authenticate. I switched the router to open network and it worked fine right away. I discovered a few minutes later that my 2.4 Ghz band was set to WPA2 encryption, but the 5 Ghz band was set to some other setting I can't remember. I changed them both the the same encryption type and bam, no more problems!I was super pleased with the speed, responsiveness, and UI design of the Fire TV box. It just works and feels great right off the bat with no work required on the user end. The voice recognition works super well, and I normally have difficulty with voice recognition.I also picked up the Plex app for Fire TV. I am a brand new user of Plex, and I was blown away at how well it works combined with Fire TV. With 5 minutes of set up work and waiting an hour or so for scanning of my shared media on my computer to finish, I was able to enjoy all my archives on my TV totally flawlessly.I could not be happier with this thing. It does everything I need easily, at a great price, and has dramatically simplified my brain off leisure time.", "verified": true, "helpfulness": "2/2", "author": "Rikki Olson"}, {"rating": 3.0, "review": "Nice design, slim profile, blue tooth remote works well.  The voice search is nice but it only returns Amazaon listings which is a HUGE dissappointment.  I like the overall interface for Amazon streaming, with some noteable execeptions, one of which is there does seem to be a a rather overt attempt at getting you to spend more money than you need to by only displaying HD rental prices upfront.  If you want to rent in SD for a dollar or two less you have to navigate your way to \"More Ways to Watch\"  which is irritating.  Nice recommendations for programming based on your watching and others who watch similar programs.  The interface for Netflix is not so great - very small title icons - illegible, really.  Netflx is also defaulted to an autoplay mode for episodes which (on my set) loads the programs in a bad aspect ratio that cannot be adjusted, so all the text graphics are half off the screen.  There's no issue like this playing each episode from the main menu.  The programs do load quickly as stated.  Overall, a bit a buyers remorse but not enough to return or sell it off right away, but I'm not ditching the Roku box yet, I'll see how the software upgrades go for a bit.", "verified": true, "helpfulness": "1/2", "author": "S. Drake \"S. Drake\""}, {"rating": 4.0, "review": "I ordered and received this a few days ago (just after it came out) and was pleasantry surprised with how it works so far.  The layout of the apps are good, and it has all the things that I want (netflix, prime video, pandora, etc.).  My only complaint is that it is hard to find information on how the system works,  It doesn't come with any manuals other than how to do initial set up.  It does come with a help button that has tutorials on how to do things, but the sound on all the videos cuts in and out every few seconds so you can't really hear what they are saying.  The product is new so I have not been able to find any help online yet.  Thankfully the sound on the nextflix and prime shows are fine.  Also, I have not figured out how to download new apps to this yet.  This may be covered in the tutorials, but at this point does not help me.  Once the help feature bug is fixed I would rate this a 5 baring any long term problems with the product.***UPDATE***April 15th, I have updated my review to a 4 as I am happy with the device and it's performance.  I think the voice recognition is good and even works with my 4 year old who doesn't speak the clearest.  That said, I have it at a 4 because Amazon was not able to fix the issue with the tutorials.  I still cannot understand them as the sound cuts out every few seconds.  I called Amazon and they walked through some basic troubleshooting and this did not resolve the issue.  Because the tutorials do not work, this as forced me to spend time researching online how to more efficiently use fire TV.As far as the apps go I have figured out how to download new ones.  Now that I have had it a little longer I have found several websites that are helpful in understanding how the system works, but again I do believe that if those tutorials had worked than I would have not had to spend a lot of time finding these websites.", "verified": true, "helpfulness": "2/6", "author": "kt12883"}, {"rating": 5.0, "review": "Quickly made a TV that I wasn't using at all my favorite spot to watch movies and exclusive TV series. Really cool product. Super fast and looks sleek too. Content loads quickly and scrolling through options is a breeze.", "verified": true, "helpfulness": "1/1", "author": "gte888v"}, {"rating": 3.0, "review": "To illustrate:  The first thing I searched for was 'The Bletchley Circle' mini series.  Voice Search worked perfectly and found the TV show on Amazon.  Cool.  It cost $2/episode.  But Voice Search does not work with Netflix.  Out of curiosity I searched separately on Netflix and found 'Bletchley' for free.  Not cool.So now I must still search, separately, each service (Apple, Netflix, & Amazon) to find the best price.  I am not going to be seduced by Voice Search to pay more to Amazon.So I moved the Fire TV to an old 'dumb' TV in my bedroom to watch Netflix from time to time.  I can access Amazon from my smart TV if I ever want to.The Fire TV box is ok and it is nice that the remote does not require line-of-sight so the box can be placed out of sight.  The power supply 'brick' is a little awkward.  I see little advantage over my AppleTV/smart TV combination.  Voice Search is cool but a deception.  Because erything is included free on Netflix, I am going to start searching there first.  Amazon might get me to try again if they gurantee they will not charge more for a program than any other service.Fire TV has not changed my viewing as I expected.  I am disappointed. I jumbed the gun buying it before the reviews.I am an Amazon Prime member and the FireTV definitely knows it.", "verified": true, "helpfulness": "5/9", "author": "B. Killen"}, {"rating": 2.0, "review": "Even though we can use it on other devices, it is not supported for Fire TV.  It was one of the major reasons for me purchasing this item... I cannot believe that they don't reveal how limited the support is for Showtime.", "verified": true, "helpfulness": "3/8", "author": "Christopher Goldrick \"ChrisGBooks\""}]