[{"rating": 5.0, "review": "No problem here setup was so easy had it setup from out of box in under 5 minutes and that includes a update.", "verified": false, "helpfulness": "0/0", "author": "John poarshe"}, {"rating": 4.0, "review": "Love using it.  Just wish the Windows RT had an app for it.  Also wish it would have more options to play games on the tv from apps I already use.", "verified": true, "helpfulness": "0/0", "author": "Pandora"}, {"rating": 5.0, "review": "Great product, very easy to set up", "verified": true, "helpfulness": "0/0", "author": "Priscila Bravo I."}, {"rating": 5.0, "review": "Just on the amount you save in one month of not paying for cable this thing pays for itself. Get a Netflix account and you are good to go. Movies all on demand with no commercials. If you want to be cheap you can get other apps that do movies for free with commercials but how cheap can you get?", "verified": true, "helpfulness": "0/0", "author": "L. Landwehr"}, {"rating": 1.0, "review": "I hate to be a whiner, but honestly, it just didn't work. I'm an IT guy, that's what I do for a living. I walked through the initial setup, everything was fine. Then it downloaded an update for the Chromecast itself, and boom: dead. After that, it only connects to the wifi for about 5 seconds then disconnects. No other device can see it during that time (tried iOS, Android, Windows laptop). I am guessing it's some router issue. I am on holidays right now trying to set this up on the hotel wifi. \"It's so easy! It 'just' works!!\" I told my parents as I handed it to them as a gift. Hopefully when they get home to Ireland it will \"just\" work, but I've a feeling ti will be up to me to set it up for them the next time I am over there. Perhaps the more expensive (but easier to use) Apple TV would have been a better choice for them.", "verified": true, "helpfulness": "0/1", "author": "qmacker \"qmacker\""}, {"rating": 5.0, "review": "Simple to cast anything from the computer onto our TV!  Easy setup.  Great for streaming Netflix, Amazon instant video, YouTube, anything from the internet onto the TV.", "verified": true, "helpfulness": "0/0", "author": "RP \"GoldEnergy\""}, {"rating": 5.0, "review": "Really cool to be able and stream stuff to tv's that aren't newer.", "verified": true, "helpfulness": "0/0", "author": "D. Watson"}, {"rating": 5.0, "review": "Browser and netflix streaming was awesome from my nexus 7 tablet. Streaming from my iPhone 4s never worked, even though I downloaded Chrome, but oh well.Great for travel. Or one of those situations where you have poor wifi connectivity where the TV is (this happened while I was traveling - the router was in the kitchen and you could only get good enough signal to stream from there, but the chromecast had no problem playing video three rooms over). Or occasional home streaming.If you are looking for a permanent home solution to watch netflix or hulu, I'd recommend a roku or an apple TV because those come with remotes.", "verified": true, "helpfulness": "0/0", "author": "Aileen Chen"}, {"rating": 5.0, "review": "Love it! However, if you're watching Amazon video you have to switch one of your settings from Silverlight to Adobe Flash. That was a hard fact to find.Set up was easy. Everything works well. I had misunderstood what it works with - must be an internet page you're looking at - but that was my problem.", "verified": false, "helpfulness": "0/0", "author": "SueO"}, {"rating": 5.0, "review": "I own both the Google Chromecast and Fire TV Stick. As I mentioned in my review of the Fire TV Stick, both devices have advantages. What I like about the Chromecast is the easy interface in the iOS app and the fact that Google offers incentives from time to time, i.e. $20 Google Play credit and free movies. Casting from the YouTube and Netflix apps was seamless and the quality of the video was great.", "verified": true, "helpfulness": "0/0", "author": "Sergio Caballero"}]