[{"rating": 4.0, "review": "I bought the Fire TV because I already own an Apple TV and tend to be an Apple junkie, but I love Amazon so I thought I'd compare the two. I have to say, I'm really loving the Fire TV. It has access to the massive Prime Video Library, which is what is missing from my Apple TV. The setup was extremely easy, and the remote has an awesome voice activated control on it, another thing missing from the Apple TV remote. You can also pick and choose which apps you want on your home screen, which is nice. The only qualm I have with the Fire TV is that you can't mirror your computer or tablet onto the TV unless it is a Fire tablet or phone. I'd like to be able to mirror my computer, though I understand why I can't mirror my iPhone or iPad. Overall, I am really impressed with it and am enjoying the wide variety of apps.", "verified": true, "helpfulness": "1/1", "author": "NYCGal89"}, {"rating": 4.0, "review": "Awesome very smart remote with voice search and no line of site. Would have given 5 stars if no box to set up and a little pricier than the fire stick bought the firestick too, and I'm sure it does the same but without the little control box and cords.", "verified": true, "helpfulness": "1/1", "author": "Sir Mabin"}, {"rating": 5.0, "review": "Great product. Great price. Easy to set up. Easy to use. Very satisfied.", "verified": true, "helpfulness": "0/1", "author": "Jimmy Moore"}, {"rating": 5.0, "review": "Amazon Fire has been amazing. We love the content and the ease of use. I would recommend this system to anybody", "verified": true, "helpfulness": "0/0", "author": "Jeremy Severson"}, {"rating": 5.0, "review": "Love amazon fire tv! I have tried many different forms of media players, this has to be by far one of the best. Has the apps, the local networking support to pull from your own network with use of apps provided on box, use your cell phone to control it, voice control, and much more!", "verified": true, "helpfulness": "0/0", "author": "Travis Linares"}, {"rating": 5.0, "review": "Best purchase I've made in a while. Very well pleased. This along with Amazon Prime make for a very good deal.", "verified": true, "helpfulness": "0/0", "author": "Mason"}, {"rating": 4.0, "review": "Will it work off of a Verizon Jac Pac?", "verified": false, "helpfulness": "0/1", "author": "david l. welch"}, {"rating": 5.0, "review": "the best ever!!!", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 4.0, "review": "The speed and size of unit are great. Would have given a 5 but the interface in some places needs work.", "verified": true, "helpfulness": "0/1", "author": "Perkusion"}, {"rating": 5.0, "review": "Works great, just as I expected. The only down side is you can have a million channels and there may still be nothing on!If you have amazon prime, you get more free, not really...you paid for amazon prime. But it really makes it worth it. I have amazon prime and I believe for me, it is really a value. You need to make your choice.", "verified": true, "helpfulness": "0/0", "author": "Roger A. Locy"}]