[{"rating": 3.0, "review": "Pros:  - cheap and easy to use  - works well with most major media providers, such as Netflix and Spotify  - slide show of cool photos as a screensaver, although not customizable (to my knowledge)Cons: - tends to get rather hot after being in use for a few hours  - no way to turn it off other than to unplug it, no auto-sleep options  - drops connection regularly when watching Hulu or after being left on for more than a few hoursAs a side note, I will say most of the issues I had with the device could be merely generation I issues, although I expect a little more forethought from Google.TS;WTRM (too short; want to read more):I have a computer without an HDMI port, so this was a great way to connect my computer to the TV. However, I noticed it got quite warm after being in use for a couple hours, which seemed to increase the chance of the WiFi connection dropping. It doesn't automatically shut off, instead it draws power from your TV or wall outlet via USB and is on whenever it's plugged in (which also means you have to plug it in to two separate ports in order to use it- not exactly my definition of \"wireless\"). This was a minor annoyance, since I had it hooked up to the USB port on my TV. If I had been watching cable or playing a game and later decided to watch something via the Chromecast, it would already be hot and getting it to connect and stay connected could be a headache, depending on whether or not the planets were aligned in my favor. I also had issues with the connection dropping every time I attempted to watch Hulu (not really a surprise, since Hulu sucks for many other reasons on every device).On the plus side, Netflix worked like a charm, although I was not entirely impressed with the design. You have to stop casting every time an episode ended in order to play the next one, instead of just automatically playing the next one like it does on the computer or game console. I can't say this was entirely bad though, since it made it more difficult to binge watch shows (a guilty pleasure I tend to spend too much time doing).I eventually just gave in to the Apple-cult mentality and purchased an Apple TV (which cost 4 times as much but is 10 times better in quality). I loved this device the first week or so after I got it, but after purchasing the Apple TV, I have not used it since. However, if you don't have a Mac, an HDMI port on your computer, or a game console capable of streaming media to your television, this is the best bang for your buck. Though, I would still recommend waiting until they release the next generation, as there are still a few kinks they need to work out.", "verified": true, "helpfulness": "0/0", "author": "Victoria Ingman"}, {"rating": 1.0, "review": "Really useless unless you're a Netflix fan.  It's difficult to figure out why it took Google so long to release a reasonable SDK in February of 2014.", "verified": false, "helpfulness": "0/1", "author": "J. Miller \"J Miller\""}, {"rating": 1.0, "review": "Pros: Pretty standby backgrounds.Cons: Umm... read on.I was very excited to try this little device out, but have been really, really disappointed in it so far. It has the option of streaming the tab and the desktop of the computer, but with so much latency that it becomes unusably frustrating. This leaves the option to stream from the available apps, such as Youtube or Netflix, which is as good as your internet. Unfortunately, bluray players, TVs, and pretty much everything else you hook up to your TV now has the option to do the same thing, making this a $35 TV wallpaper producer.", "verified": true, "helpfulness": "0/1", "author": "Daniel Pearson"}, {"rating": 5.0, "review": "Cool stuff.  Simple setup.  Easy way to watch browser based shows.  Netflix is cool that it doesn't take the 'caster' CPU or bandwidth.", "verified": true, "helpfulness": "0/0", "author": "B. Anderson"}, {"rating": 5.0, "review": "I bought a 6' cable to go with my Google Chromecast Stick because I wasn't sure what came with it.  Turns out the cable that comes with the Chromecast works fine and is about 6\" in length.  Just wish Amazon Prime was playable on the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ynotm8"}, {"rating": 5.0, "review": "This is a good start in the  right direction, a seminal  piece of equipment no home should be without for sure.  Think about comfort tv without commercials", "verified": true, "helpfulness": "0/0", "author": "john rawson"}, {"rating": 1.0, "review": "it just doesn't work well enough UNLESS it is an animated movie- those are passable but shows/films with actual people are waaaaaaaaaaaaaay too glitchy and choppy.", "verified": true, "helpfulness": "0/2", "author": "mommy"}, {"rating": 5.0, "review": "I recommend this to anyone who owns a flat screen.  Movies, photos, and games.... works great for all of them.", "verified": true, "helpfulness": "0/0", "author": "John M Griffin"}, {"rating": 4.0, "review": "Like others I jumped on the Chromecast bandwagon.  It has a lot of potential but needs more apps developed to make it worthwhile.", "verified": true, "helpfulness": "0/0", "author": "Caredhel"}, {"rating": 5.0, "review": "Just Plug it in and program your TV and your ready to cast your favorite utube video or netflix video", "verified": true, "helpfulness": "0/0", "author": "Tanya Aguilar"}]