[{"rating": 2.0, "review": "I've used mine a little bit, but it's just as likely to bail on me as it is to work. Considering I only bought it so I could watch Netflix on my TV; an HDMI cord, a cheaper, perhaps more low-tech solution, still makes infinitely more sense for me than fighting Chromecast, my wifi connection, my laptop and my android phone all at the same time. Stick with a box, if you have to, this thing is a mess.", "verified": false, "helpfulness": "0/0", "author": "Matt Koester"}, {"rating": 5.0, "review": "When I first bought this device I figured $35 wasn't too much to waste if that's what it turned out to be. But this is a fantastic little gadget! Provides full HD picture on 46' screen and is very easy to set up and use. Well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "JMaggos"}, {"rating": 4.0, "review": "Love the chromecast. It works perfectly with my ipad on my vizio TV. They need to perfect the \"cast a tab\" feature and then this would be 5 stars for me. If thinking about getting rid of cable, I would recommend this over the appletv product, which is buggy and often frustrating to use.", "verified": true, "helpfulness": "0/0", "author": "deedeeg \"deedeeg\""}, {"rating": 4.0, "review": "Good product. Very good video definition when bandwith is OK. No all applications can be watched if your outside US", "verified": true, "helpfulness": "0/0", "author": "Luis Abarca"}, {"rating": 3.0, "review": "Exceedingly simple to setup and use...  That said, I have had a few issues.  I use this primarily on a receiver that is hooked up to hardwired speakers in the ceiling of my kitchen/living room area.  This makes it easy to cue up songs from different apps and stream directly to the house speakers.  Now I'm able to adjust volume and tracks from the comfort of my sofa.  I do run into an issue though, attempting to stop the playback of music.  If I close the app (or force close) on my android phone, it doesn't stop the music from streaming through the Chromecast.  A minor annoyance, but I need to physically unplug the USB power cable to shut it off.I do look forward to what others are able to bake into thier apps and use this for, but at the moment, it's a fun, fairly cheap novelty.", "verified": true, "helpfulness": "0/0", "author": "G. Gitchel"}, {"rating": 5.0, "review": "The Chromecast is an amazing device.  It's very easy to set up, and only requires an HDMI and USB port on the TV to get it powered up and ready to go.  Using a phone/tablet with it is awesome.  Simply bring up the show you want to watch on Netflix/HBO Go/Hulu+, and then click the cast button and you're watching it on your TV.  I haven't had any problems with it and it streams these services way better than my Wii U or Xbox 360.  This is an awesome product for an amazing price.", "verified": true, "helpfulness": "1/1", "author": "Curtis Clements"}, {"rating": 5.0, "review": "I love this! it works with my cell, table and computer. I dont need to have an extra service or wires", "verified": true, "helpfulness": "0/0", "author": "Kia222"}, {"rating": 4.0, "review": "I thought I'd give the Chromecast a try. I've been seeing it in ads and got interested. What the heck, $35 wasn't much so I bought one. I've been using it to watch youtube but I haven't used it with netflix yet. Plugs into an HDMI port and USB for power, you control it with your smart phone. Pretty cool! Works well as long as my network is stable. I like it and would recommend it to a friend.", "verified": true, "helpfulness": "0/0", "author": "Todd J. Linville"}, {"rating": 5.0, "review": "I LOVE the chromecast.  My boyfriend and I use it all the time to watch Netflix.  Make sure you've got a strong wifi signal or else the quality of the picture will be pretty crappy.", "verified": true, "helpfulness": "0/0", "author": "Kellene Kim"}, {"rating": 5.0, "review": "Tech savvy individual gives this one a thumbs up ---- easy to set up and easy to use guess where the future is headed.", "verified": true, "helpfulness": "0/0", "author": "John Popa"}]