[{"rating": 3.0, "review": "Worked perfect at first, even with NetFlix.  Hoping I get an update that fixes NetFlix.  But still works great with youtube.", "verified": true, "helpfulness": "0/0", "author": "Guy Watkins"}, {"rating": 5.0, "review": "This small, inexpensive device is wonderful.  While it \"Works With Netflix\" and some other named media, it really works with anything you can pull up on a tab on your computer, such as Amazon DVD Rentals, as log as your have a WiFi connection.  Just \"cast the tab\" and there it is on your television monitor.  Show your vacation pictures (don't tell your friends I recommended this), Powerpoint presentations, etc. on the Television monitor.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"UDZ BLND\""}, {"rating": 5.0, "review": "With plex and an Android tablet and phone, there is nothing better.  Works fast and easy.  Can plug directly into my LG LED projector and stream directly.  Can use with extra computer monitor (and with an HDMI Male Input to VGA+Audio Output Cable Converter) can have a TV with audio split out for speaker.", "verified": true, "helpfulness": "0/0", "author": "Greg Griffin"}, {"rating": 5.0, "review": "One of the coolest pieces of electronics I've ever had. Able to watch many things on my tv now via wireless access. Great product", "verified": true, "helpfulness": "0/0", "author": "Cody T."}, {"rating": 4.0, "review": "The chromecast is easy to use and SO useful! My husband and I use it every single day with iPhone, Galaxy S4, Netflix, YouTube, and a projector with a huge screen. We don't need TV anymore! My only complaint is that WiFi is needed... I'd like to be able to use the Chromecast to show photos to my grandma on her TV screen, but she doesn't have WiFi.", "verified": true, "helpfulness": "0/0", "author": "Laura Espinosa"}, {"rating": 5.0, "review": "What a terrific device!  From start to finish, I set it up in 5 minutes.  I am enjoying it already.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Arrived on time and works as expected.", "verified": true, "helpfulness": "0/0", "author": "CM"}, {"rating": 5.0, "review": "everithing is just easy as the product advertise says, now at home we just turn on the tv, select the HDMI video, click on the application in our iphones, or tablet, select the movie, or documental, or concert, etc. and sit back and enjoy!!!! Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Alison"}, {"rating": 5.0, "review": "WORKS GREAT. Google has even IMPROVED it since I purchased. INITIALLY it would ONLY CAST YOUTUBE OR NETFLIX, but now,after an update, I can now cast ANY TAB OPEN WITH GOOGLE CHROME STRAIGHT TO MY TV SIMPLY BY CLICKING THE CHROMECAST EXTENSION ICON!!  I LOVE IT!!  HIGHLY RECOMMEND IT!", "verified": true, "helpfulness": "0/0", "author": "BOB REYNOLDS"}, {"rating": 4.0, "review": "Easy to set up.  Up and running in about 30 minutes.  Now I just need to get a faster internet connection.", "verified": true, "helpfulness": "0/0", "author": "Seattle"}]