[{"rating": 5.0, "review": "Excelente producto", "verified": true, "helpfulness": "0/0", "author": "Sandra Campos"}, {"rating": 5.0, "review": "Love this for watching Netflix on the TV", "verified": true, "helpfulness": "0/0", "author": "BadgerGirl"}, {"rating": 5.0, "review": "Nice addition for watching Hulu Plus & Netflix and listening to Pandora.", "verified": true, "helpfulness": "0/0", "author": "Expo67"}, {"rating": 5.0, "review": "This is great. It kinda turns your regular TV into a smart TV.  Easy set-up: just download the software to your laptop or app on your smartphone and plug in to your TV HDMI port. The only down side is that there are not as many viewing options as I would like, particularly free ones. But you can watch Netflix (if you have an account with them), YouTube, Hulu, HBO (if you have HBO on cable), and can cast whatever is shown on your computer screen onto your TV.  It does tend to use a lot of CPU on the computer; I don't know why, but seems to be unavoidable. Overall, I like it and it's cheaper than other similar brands.", "verified": true, "helpfulness": "0/0", "author": "Sandstress"}, {"rating": 5.0, "review": "I love Chromecast!  I just want more apps!", "verified": true, "helpfulness": "0/0", "author": "NYCJF"}, {"rating": 4.0, "review": "I'm still trying to find the right wifi as mine will not work.  Will evaluate it later when everything is working.", "verified": true, "helpfulness": "0/0", "author": "Barbara J. Nihart \"barb\""}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "COL321187 - Diego Ademir Duarte Santana"}, {"rating": 5.0, "review": "if you're trying to decide whether to buy this or not, the answer is buy it.This is one of the best things to ever exist in my house. It can stream everything that it says it can, from almost literally everywhere.Setup is incredibly easy, all the instructions are right there for you and you don't have to be engineer to get it all quickly set up.My main use for it is YouTube. I can pick any video I want from either my laptop or my phone, and in one tap I can make it play on my TV. Works amazingly and as advertised!I don't have any other experience in any other video streaming sites. However, you can cast your laptop screen onto the TV. Who knows where that could be helpful?!Buy buy buy buy buy buy. One of the best products from Google ever. Go and buy!", "verified": false, "helpfulness": "0/0", "author": "A.A.Ron"}, {"rating": 4.0, "review": "Got it yesterday after I heard about the update with Android screen mirroring. I had to reconnect a few times.  But overall it works good with my LG G2.  It kept me from having to buy a cheap off brand miracast dongle so I was happy.", "verified": false, "helpfulness": "0/0", "author": "T. Pennington \"tap\""}, {"rating": 3.0, "review": "When it works, it's fantastic but more often than not I have to go through the set up process all over again in order to cast anything.  Big time sink when all you want to do is quickly put something on for the kids or sink into a good flick at the end of a long day. Does encourage grabbing a book to catch up on reading....", "verified": true, "helpfulness": "0/0", "author": "N. Priest"}]