[{"rating": 5.0, "review": "Just amazing.  I can stream from my PC to TV and my kids can watch a different movie on my PC at the same time!  Audio from the streaming movie goes only to the TV!You MUST HAVE a wirelessly connected device to set this up to a wired PC.  Not a big deal for me but could be for others.", "verified": true, "helpfulness": "0/0", "author": "half"}, {"rating": 5.0, "review": "Turned my old Plasma into a smart TV for a great price!", "verified": true, "helpfulness": "0/0", "author": "Mark A Blaisdell"}, {"rating": 2.0, "review": "Netflix isn't working.  That's the main reason I got this little guy.  YouTube works great, HBOGo works great, but not Netflix.  I've searched for hours online for a fix.  I've reset the thing many times.  I've changed every router setting I've found any reference to online.  Still doesn't work for Netflix.  I'm not the only one with this problem, either, according to Google's help forum.  I'll keep searching for a fix and gladly change this back to a 5 star once the fix is released.", "verified": true, "helpfulness": "0/0", "author": "S. B. H."}, {"rating": 5.0, "review": "Gamechanger. And pretty darn affordable.", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 4.0, "review": "worked very well", "verified": true, "helpfulness": "0/0", "author": "Ricardo Alejandro"}, {"rating": 5.0, "review": "Bought it because I wanted to try it. Gave it as a gift.", "verified": true, "helpfulness": "0/0", "author": "Fernando Luiz Rodriguez"}, {"rating": 5.0, "review": "My wife and I ordered the Google Chromecast HDMI since one month ago. High quality and delivered on time. We enjoyed it every single day. Thanks Google that creates such a wonderful device.", "verified": true, "helpfulness": "0/0", "author": "Paul Jiang"}, {"rating": 3.0, "review": "Very useful tool, but limited to a few program/apps/website. When the SDK is launch I think it will make a big difference", "verified": true, "helpfulness": "0/0", "author": "Kiriaco Jarami"}, {"rating": 5.0, "review": "The best of the best!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Chopin\""}, {"rating": 1.0, "review": "First time I used it fried", "verified": true, "helpfulness": "0/1", "author": "Bill Richard"}]