[{"rating": 5.0, "review": "I do not usually write reviews, but I had to for this. This Black Friday was a little light for me since I have been low on funds. I wanted to pick up a SmartTv but was unable to. I just opted for a same size, regular tv for a fourth of the price. I still had one problem though. I like to have parties where my friends and I change the songs. I did some soul searching on the Internet and found this. Probably one of the best buys I ever made. Now I can pass around my tablet that is hooked up to the Chromecast instead of people telling me what songs to play. It does not do a lot of things a SmartTv can do, such as, Amazon Instant Videos, but there are things Chromecast does that SmartTvs cannot do, that I find cater to my needs. The thing that sold me was that I could cast my Chrome internet browser tab, if I wanted to watch a movie on the internet that is not on Netflix, Hulu, Amazon, etc. (you know what I mean). Not just movies but what ever you have on your Chrome tab. I am a fan of League of Legends and I host some parties for the big LCS games, its nice not to just hook up my laptop via VGA and just to have my computer cast to my Tv. Chromecast apps are limited but I think google will expand them. They have Netflix, HBOGo, Pandora(big plus), Hulu, and others not worth mentioning. To sum up my experience I do not regret not getting a SmartTV. I recommend this buy to anyone that doesnt have a SmartTv that wants to upgrade to one, or a nice substitute to one. It does need a tablet or a computer to use, probably its only downside, it is not a stand alone device that you can navigate through with a remote. Hope this reviewed helped anyone in the same situation I was in and I wish you the best of luck. :D", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "This has been the solution to lack of HBO GO on the Roku box for Comcast/Xfinity. It was actually a pleasure to setup ( maybe because I'm a gadget freak) and the streaming quality is great considering you have decent internet speeds. I would recommend this product.", "verified": true, "helpfulness": "2/2", "author": "Woolly Kundiff"}, {"rating": 3.0, "review": "It is not what I expected but I am sure as with new technology it will expand with time along the way", "verified": true, "helpfulness": "0/0", "author": "Carl Dailey"}, {"rating": 2.0, "review": "They don't tell you that your Router must meet certain specs. Had to return it. Very sad about that. I had such high hopes.", "verified": true, "helpfulness": "0/0", "author": "Dude's Mom \"Dudes Mom\""}, {"rating": 5.0, "review": "love the product works great on any tv.  bought two for each of the kids room. now they can watch netflix on thier tvs", "verified": true, "helpfulness": "0/0", "author": "NC-Gaston"}, {"rating": 1.0, "review": "The promise of Chromecast was good but the device never worked for me. It couldn't connect to two different wireless routers I tried. Even enabling UPnP/disabling AP isolation as suggested in the help didn't work. Think the quality control/testing could have been better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Worked flawlessly, all the necessary cables, including flex connector for HDMI a nice touch for TV's close to the wall.  Looking forward to more apps and or directly from browsers or files", "verified": true, "helpfulness": "0/0", "author": "Jon A. Wright"}, {"rating": 5.0, "review": "So, very easy to use.  The cost was incredibly low for the value that this item offers.  Glad I ordered it.", "verified": true, "helpfulness": "0/0", "author": "Patti Schindler"}, {"rating": 1.0, "review": "While the packaging is worded \"Send video or anything on the Web to your TV from your smartphone, tablet or laptop\" the truth is you can not stream any video from your smartphone.  This is simply a lie, and what's worse, I am a die hard android fan and would rather have AppleTV than Chromecast.  This device does not send the video on my Smartphone through my Chromecast to my TV, period.This device should have allowed for screen sharing but Google dropped that ball, now I must repackage and return this paper weight.  I have a Google TV and wanted to try a Chromecast, you can only stream what you bought through Google Play?  This is a joke and I will be getting a second Google TV because Chromecast is worthless in today's market, and they wonder why no apps are being developed for it? EPIC FAIL", "verified": true, "helpfulness": "2/4", "author": "Michael Angotti"}, {"rating": 5.0, "review": "This thing is so awesome!!! It can turn your tv on too. There aren't a ton of apps that support this yet, but we are getting more and more. Once google opens it up there will be so much support for it and so many apps that use it. Using your phone as the remote is so convenient. never have to worry about finding a remote or dead batteries...", "verified": false, "helpfulness": "0/1", "author": "Julissa A."}]