[{"rating": 5.0, "review": "Got this for $7 with a $10 gift card on special sale.  Works pretty well ror PC and great with my moto g (1.5 gen LTE).  Ipad support severly crippled but thats not googles fault ;)", "verified": true, "helpfulness": "0/0", "author": "Todd A. Klick"}, {"rating": 5.0, "review": "We have 2 chromecast for our tvs and we use them every day to watch amazon movies and series, and videos from youtube from our phones, tablet or laptop. very convenient and easy.", "verified": true, "helpfulness": "0/0", "author": "Alfonso Lp. \"Technomaniac\""}, {"rating": 3.0, "review": "I loved the Chromecast the whole time it worked. Unfortunately, it just stopped working randomly. The HDMI port gets warped if you leave it plugged in, which you have to do to keep it on. The weight of the charging cord pulls the HDMI port out of the stick, which is probably the reason it no longer works. I hope they fix this in the future. Until then, I'm buying the wireless Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Jordan Wilson"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "bigLosser"}, {"rating": 5.0, "review": "Best thing since sliced bread. Easy to use!!!! All you need is high speed Internet  and you are ready to go.  I CUT THE CABLE CORD!", "verified": false, "helpfulness": "1/1", "author": "Book Lover \"Advent Reader\""}, {"rating": 5.0, "review": "One of the best technology purchases I've made. Ever. Easy to use. Software sometimes disconnects on my phone, but that my be my old phone.", "verified": true, "helpfulness": "0/0", "author": "Stan Grabowski \"Stan\""}, {"rating": 5.0, "review": "good product, I recommend it, now I enjoy sharing family contents of my computer, tablet or mobile", "verified": true, "helpfulness": "0/0", "author": "efrain gonzalez"}, {"rating": 5.0, "review": "I just love seeing streaming video on my big screen TV that I previously saw only on my small screen iPhone or iPad.", "verified": true, "helpfulness": "0/0", "author": "Dave Andrieu"}, {"rating": 5.0, "review": "Hello good fine", "verified": true, "helpfulness": "0/0", "author": "Saul Cifuentes"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Nicolás Toranzo"}]