[{"rating": 5.0, "review": "I am very happy with this purchase. It's so easy to set up and streams beautifully. I primarily use it to stream Netflicks and there is no jumpy playback or that annoying mis-synced voice effect.  The picture is bright and clear. Well worth the investment, especially since the price has been dropped below $30.  A+++++", "verified": true, "helpfulness": "0/0", "author": "Spritch"}, {"rating": 5.0, "review": "Works great! I love being able to just sit and watch shows on Netflix without having to get up and insert or remove discs. Great product.", "verified": true, "helpfulness": "0/0", "author": "jennifer drake"}, {"rating": 5.0, "review": "I got tired of moving my single xbox 360 back and forth between living and bedrooms so I purchased the Chromecast.  Fantastic little device for streaming Netflix, just plug it into the HDMI and USB ports on your TV, download the Chromecast app from Playstore, Apple store, etc and name your device.  Works seamlessly, no lag, no buffering. LOVE THIS!!!!! And waaaay cheaper than a Wifi streaming box from the store. I HIGHLY recommend this product.  Bought one for myself and one for in-laws! Thank you amazon and thank you google :)", "verified": true, "helpfulness": "0/0", "author": "Bunnypennyz"}, {"rating": 4.0, "review": "This works well with most of my devices(iPhone 5, iPad mini, my 3 year old toshiba laptop). The only problem is getting my MacBook Pro to work with it. The Chromecast setup software works fine and has no problems connecting to the Chromecast, but when I tried to play a video from youtube or stream a webpage google chrome doesn't detect it. However when I connect my MacBook to the network with an ethernet cable there are no problems.", "verified": true, "helpfulness": "0/0", "author": "Andrew D."}, {"rating": 3.0, "review": "This would be more useful if it worked with more appsThe device tends to freeze up after using it with Netflix for a long length of time", "verified": true, "helpfulness": "0/0", "author": "Angelica Ramirez"}, {"rating": 4.0, "review": "My son wanted this and was excited about receiving it, telling his brother all it's potential.  Can't vouch for anymore than that.", "verified": true, "helpfulness": "0/1", "author": "Penny Amack"}, {"rating": 5.0, "review": "Streaming from the phone to TV is a breeze! Set up is really easy. Will get one for each tv.", "verified": true, "helpfulness": "0/0", "author": "Toni D."}, {"rating": 3.0, "review": "needs more apps and to be able to work with more devices it was easy to set up and worked ok but kicked my router out and had to reset", "verified": true, "helpfulness": "0/0", "author": "Toby Harp"}, {"rating": 4.0, "review": "This does pretty much what is expected - I can stream Netflix and some other stuff from my phone onto my TV.  But I also have Apple TV on another set, and that is so much easier that I am dropping one star from this review.  It is a little sluggish to respond, and it seems I have to do a little extra clicking and waiting to get where I want to with it.  Once it's up and running, though, it works like a charm.  CHECK YOUR COMPATIBILITY - I was hoping to hook up my kids' Kindle Fires with this but it won't work.  For the price, as long as you are using compatible equipment, I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Rich the Writer\""}, {"rating": 4.0, "review": "I'm not entirely sure how I missed this, but the Chromecast does not supply the media.  I originally thought it was like a Roku or Apple tv, but then used your phone as the controller, but I was wrong.  It allows you to stream from your phone on to the tv. It does that well, but if you have any game console, you can already stream the biggies.", "verified": true, "helpfulness": "0/0", "author": "Brian Ahrens"}]