[{"rating": 5.0, "review": "This is my 4th streaming box & this one is a keeper. It is snappier than anything I have tried from the other manufactures and it is super easy to install XBMC on it.Get one & you will not be disappointed!", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 1.0, "review": "Unboxed, hooked it up and it locked up after/during downloading updates................would not reset even with Amazon Tech help. Waited several days while new unit was mailed.Sent second one....................same problem. Amazon finally figured it was a problem in software on their end. Tried again to get up and running and the remote refused to sync with second unit. Waited several days again for new remote, which they were going to charge me for until I complained. Did not even bother to try the new remote. Boxed the whole thing up and took it back to the dealer. Do not waste your time and money until Amazon works the bugs out.", "verified": true, "helpfulness": "4/9", "author": "Sheryl H."}, {"rating": 4.0, "review": "After owning our Fire TV for a month and a half we are quite happy.  We were wasting so much money on Satellite (paying for over a hundred channels that we didn't watch).  It is very easy to set up and use.  Our only complaint is that now we cannot watch the news.  I attempted to upload fox news, cnn and nbc.  None of these channels were available for Amazon TV.", "verified": true, "helpfulness": "2/2", "author": "Jennifer Cavallo"}, {"rating": 5.0, "review": "This is AWESOME!  Cable company wants too much to run cable etc. to bedroom tv.  I read the reviews on this Fire TV and decided to give it a try. I wish I wouldn't have waited so long, I WILL be putting them on the rest of the TV's in the house.", "verified": true, "helpfulness": "0/0", "author": "mrbill \"mrbill\""}, {"rating": 5.0, "review": "Am so excited to hook up Fire TV.  I haven't had the time yet, but i am ready.  Thank you for awesome service too.", "verified": true, "helpfulness": "0/1", "author": "michelle pharo"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/1", "author": "shelby"}, {"rating": 4.0, "review": "It's ok. It freezes from time to time and I have to unplug it and plug it back in. When I look for a movie to watch they have the prime movies mixed in with the movies you have to pay for, this is irritating. So I have to add movies to my watch list and just watch movies from there. Overall I like it and would recommend it.", "verified": true, "helpfulness": "1/1", "author": "Shanee N. Howleit"}, {"rating": 5.0, "review": "Canceled cable.....Who needs it when you have FIRE!!!", "verified": true, "helpfulness": "1/3", "author": "Dennis E. Roberts"}, {"rating": 5.0, "review": "Can you add memory to fire tv?", "verified": true, "helpfulness": "0/1", "author": "rawtech98 \"rawtech98\""}, {"rating": 5.0, "review": "Easy connect and setup.  Voice recognition works very well.", "verified": true, "helpfulness": "0/0", "author": "J@NC"}]