[{"rating": 1.0, "review": "Terrible sold it.", "verified": true, "helpfulness": "0/2", "author": "Matthew Tetreault"}, {"rating": 5.0, "review": "Saviour of non-cable user. What else can I say?", "verified": true, "helpfulness": "0/0", "author": "annouser"}, {"rating": 5.0, "review": "Can't live without it!", "verified": true, "helpfulness": "0/0", "author": "R. Stone"}, {"rating": 4.0, "review": "takes too long to connect to android devices - sometimes we get long pauses during streaming - the screen controls disappear on some android devices.", "verified": true, "helpfulness": "0/0", "author": "mike leibowitz"}, {"rating": 4.0, "review": "I like watching youtube videos - ALOT.And Chromecast has made it so easy for me to do so. now I just cast the video and keep searching for the next one if I want to and add it in the queue.And somehow I felt there are lesser advertisements, when I cast a video compare to when I am watching it over a hand held device.Also quality of videos is amazing.The only issue I face is, when I cast a video and then close the browser. it lose the connection between video playing and my device. and afterwards I don't know how to control it again, without casting something else. I wish there was a remote or something.", "verified": false, "helpfulness": "0/0", "author": "Ankur Chamadiya"}, {"rating": 1.0, "review": "Horrible only quirks on 1 tv out of 3.. I want to return it!!", "verified": true, "helpfulness": "0/1", "author": "katie schwander"}, {"rating": 5.0, "review": "works great", "verified": false, "helpfulness": "0/0", "author": "Purchaser"}, {"rating": 5.0, "review": "It's a very useful and a must companion for all", "verified": true, "helpfulness": "0/0", "author": "Krishna"}, {"rating": 5.0, "review": "Great device, allow you you broadcast to your TV from your computer from a single click. I use it mainly for Netflix. I open Netflix on my computer using Google chrome and click the button on the screen to send to TV and voila!! Netflix on my living room TV.Perfect for NON Smart TV that doesn't have embedded apps.You can also broadcast Hulu (In the US), YouTube and others. As long as you can see it in Chrome, it can probably be transmitted to your TV.NOTE: ChromeCast only broadcast the video, it doesn't send the whole windows page. It is a very clean image... Perfect", "verified": true, "helpfulness": "0/0", "author": "Olivier Labrie"}, {"rating": 5.0, "review": "One can use it as wireless HDMI connection with Chrome or use it with android apps. Not many choices with useful apps, but hopefully that will change.", "verified": true, "helpfulness": "0/0", "author": "sivab"}]