[{"rating": 5.0, "review": "This was soooo easy to use!  Great price, fast shipping.", "verified": true, "helpfulness": "0/0", "author": "jessbuck"}, {"rating": 5.0, "review": "It is great but Needs more apps to cast from (specially on IOS side)", "verified": true, "helpfulness": "0/0", "author": "Eduardo Rojas Solano"}, {"rating": 5.0, "review": "It is easy to install!! I love being able to watch Netflix on my TV instead if my computer. Wish I had done this sooner.", "verified": true, "helpfulness": "0/0", "author": "Patty Felix"}, {"rating": 3.0, "review": "Pros: Chromecast, in general, is an awesome tool. Works as suggested and easy to use. Also, simple installation to move to another tv.Cons: Chromecast works with certain apps only (YouTube, Netflix, hbo, etc), so don't expect to be able to cast the contents of your iPad to your tv. It has strong limitations in that regard. Plus,a lot of the compatible apps are ones you may already have on your smarttv.Just checkout the compatible Chromecast apps first, to determine if it's right for you", "verified": true, "helpfulness": "0/0", "author": "TMAlexander"}, {"rating": 5.0, "review": "Perfect !", "verified": true, "helpfulness": "0/0", "author": "Tiago Lemos Assis"}, {"rating": 5.0, "review": "Great!", "verified": false, "helpfulness": "0/0", "author": "Allen J Ahlbrecht"}, {"rating": 4.0, "review": "Gave as a gift and the person thought it was the best!", "verified": false, "helpfulness": "0/0", "author": "J.R. Williams"}, {"rating": 3.0, "review": "It works but I really dislike that the content is my mobile device - but then I knew that when I got it so no deductions for that. What I didn't know was that it will not play movies from my iPad unless they are from Google Play. This means even movies you own on DVD or BluRay that you rip and put on a device it will not play them. It will not play movies rented from iTunes, or from any other digital source except the Google world. That was the main reason I got this was for travel and playing movies from my iPad. Luckily my Apple TV is not too big and worked fine in the hotel with the help of my D-Link Systems Wi-Fi AC750 Portable Router creating a WiFi hotspot.I currently keep it attached to one of my computer monitors but that is really useless since I can already play content on that monitor anything that can be streamed from my iPhone.Maybe Android users will have a better experience, but it is not very good with an idevice. Maybe when I get an office TV it will be a little more useful since my Roku and Apple TV are staying on my main TV. I like not having to find my tablet or phone to watch Netflix.The price is its only savior.", "verified": true, "helpfulness": "0/0", "author": "M. McDonald"}, {"rating": 1.0, "review": "Despite what is advertised, this device does NOT work with Hulu Plus and a PC.", "verified": false, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 5.0, "review": "Awesome product, now i can stream media directly to my tv from my mobile or laptop.", "verified": true, "helpfulness": "0/0", "author": "Inwinder Kochhar"}]