[{"rating": 5.0, "review": "Good great awesome", "verified": true, "helpfulness": "0/0", "author": "Alexis Planche"}, {"rating": 1.0, "review": "poor ios support. I would have liked to just stream screen from iphone or ipad to TV but this doesn't do that.", "verified": true, "helpfulness": "0/2", "author": "djl"}, {"rating": 5.0, "review": "Thx", "verified": true, "helpfulness": "0/0", "author": "peter j crook"}, {"rating": 5.0, "review": "Works perfect as advertised but DO NOT buy if you use all windows products. My phone is Nokia which runs only windows and my tablet is as well. They are not cross compatible with windows devices unless they are PC's or Laptops. My wife has a HTC phone so it works great with it and her laptop, perfect quality and basically turns any TV you own into a PC/Laptop.", "verified": true, "helpfulness": "0/0", "author": "Taron Trent Clark"}, {"rating": 5.0, "review": "I am very pleased with this product. Super easy to setup. Just as described. Not sure why someone would pay more when this does everything you could ever ask! Great buy, will likely buy another for a travel Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Amery S English"}, {"rating": 4.0, "review": "Only works with some apps. A good buy for the money.", "verified": true, "helpfulness": "0/0", "author": "Frederick N."}, {"rating": 5.0, "review": "i use this device everyday to watch my tv shows and movies that i want. i really enjoy using my device to control my tv", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This product won't work with netflix.  There is limited help topics and I don't like it.  I am going to return it.", "verified": true, "helpfulness": "0/2", "author": "yetI haven't even played it yet"}, {"rating": 4.0, "review": "I like it for what it does today which is cast YouTube videos to TV. It's a great help as my smart TV YouTube app sucks. My daughter loves the fact that she can now watch cartoons from her YouTube playlist on to TV by herself.I wish more applications were supported like mirroring the whole phone screen (not just a specific app) to the TV screen. I cannot seem to cast my gallery (camera photos) to TV. That's a shame.It took me at least 10 attempts to connect my Chromecast device to home WIFI but finally it worked. The other issue is that more than half of the times I try connecting my phone to this device fail - not as smooth as I expected.", "verified": true, "helpfulness": "0/0", "author": "Drifter"}, {"rating": 5.0, "review": "Simple to use, inexpensive, abd a great way to get additional content to yout tv.", "verified": true, "helpfulness": "0/0", "author": "BP"}]