[{"rating": 4.0, "review": "It's a nice device but you can't do much with it. It has around five apps but it's new so that's what I expected. My only complaint for now is it can't play my music that I purchased on iTunes or any of the videos on my if they are not purchased from the Google Play Store. So all they need to do is fix that and add a few more apps. Then I will give it five stars.", "verified": true, "helpfulness": "0/0", "author": "L.Villalona"}, {"rating": 3.0, "review": "Poor App support, no option to use Cast Chrome browser from tablets, trying to go full screen will casting from Laptop Chrome browser doesn't work.", "verified": true, "helpfulness": "0/0", "author": "Neil Menzies"}, {"rating": 4.0, "review": "I love it, but wish they would hurry up already and make their SDK publicly available, and add streaming local content.  They also need to add back in a way to get root on the device since they indicated they supported the idea of the hacker community running with this.  This device has the potential to become the next \"Kinect\" of hackability and use cases if they'd only open it back up!!  Once they do those 3 things (which I believe will very likely occur) I'll add my last star.  Yes, I'm holding my star hostage, deal with it.", "verified": true, "helpfulness": "1/1", "author": "Cole Nave"}, {"rating": 4.0, "review": "It's got a few little glitches here and there, but honestly... for $35 what do you want? Turn a dumb TV into a smart TV lickety split!", "verified": true, "helpfulness": "0/0", "author": "Brooks Nelson"}, {"rating": 4.0, "review": "Happy with the device overall, once i got it working again. Worked fine initially, then didn't. Had to reinstall for some unknown reason. Hoping that doesn't happen again - very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "I heard about Chromecast from a friend and was anxious to try it. It's easy to set up and extremely easy to use. Anything you can stream on your computer can be streamed to your TV set. Much more versatile and cheaper than Apple TV. We have both, but prefer Chromecast.", "verified": true, "helpfulness": "0/1", "author": "tbrook"}, {"rating": 1.0, "review": "Not nearly as easy as the instructions suggested it would be. The Beta streaming feature was laggy and cumbersome. At a distance of about 15 feet with a wall separating the router from the computer, the Chromecast did not work at all.", "verified": true, "helpfulness": "1/2", "author": "tallou w kankanton"}, {"rating": 3.0, "review": "It's neat enough. Doesn't put my tablet's browser on the television. Works fine with a laptop. I already had a smart TV so netflix and youtube were a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Brian Ward"}, {"rating": 1.0, "review": "it is not working for me .. i tried many many many times to install it and make it work, i spent an hour with google support but with no luck, they say that my router settings has something wrong but i checked everything and did everything they mentioned but again not working .. i think that the device is good but it is not working for me and support are not good at all", "verified": true, "helpfulness": "0/1", "author": "Saged Hamdy Rizk"}, {"rating": 5.0, "review": "Chromecast is a perfect example of utilizing existing devices and technology to make something totally new with minimum addition.If you have a decent internet connection speed, Chromecast will work seamlessly for you!", "verified": true, "helpfulness": "0/1", "author": "Wing"}]