[{"rating": 1.0, "review": "They don't tell you that device requires a specific type of WiFi modem which I don't have, even though mine is only one year old. So, chromecast is sitting in its box until I find a modem to see if it delivers", "verified": true, "helpfulness": "2/2", "author": "bobkunath"}, {"rating": 5.0, "review": "Great to be able to watch all the internet videos on our large TV screen, and for such a low price - great purchase.", "verified": true, "helpfulness": "0/0", "author": "Shoham Eckhaus"}, {"rating": 5.0, "review": "A wonderful product. Youtube became suddenly more accessible for shared viewing with family and friends, and it changed the experience in a significant way.The product connects directly to the HDMI port of the TV (it also needs to be connected to power either through provided adaptor, or better through one of the TV USB - better because it switches off power when TV is off), and then you can use either your smartphone or computer to control what you view. The beauty is that you use smartphone/computer to select video to watch, and then play, and then the stream goes directly from Wifi to the Chromecast, completely freeing the smartphone/computer apart if you want to pause or change (you can even switch off the smartphone/computer).I found this a much better value for watching Youtube on TV and buying an expense Smart TV.Outside US, only Youtube work, as Netflix and other services available on the Chromecast require a US subscription and IP.", "verified": true, "helpfulness": "0/0", "author": "Tarik Hamou Hadi"}, {"rating": 5.0, "review": "I use this almost nightly to stream YouTube and Netflix videos from an iPad to my television and it works perfectly. Love it.", "verified": true, "helpfulness": "0/0", "author": "Kent McCrea"}, {"rating": 5.0, "review": "Shipping took foreverrrrrrr omg! The product is great indeed, I bought two of them fearing that the price will go up and not disappointed at all.  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Ivy"}, {"rating": 5.0, "review": "I bought this for $35, and I might get a 2nd just for the convenience (so I don't have to walk my lazy butt upstairs to switch the monitors). This product is great, especially if you are like me and forgo cable or satellite service for digital streaming like netflix, youtube and hulu. There are other services which will work with the Chromecast as \"native\" apps, but this is not all you can do with this device! I'll explain.From Android devices (In my household, Galaxy S3 and S4, Dell Venue 8) the native apps (I use youtube, hulu plus, and netflix personally) work flawlessly and quickly (from other reviews ios works great as well apparently, although I don't drink the Apple kool-aid myself). By \"native\" apps, I mean apps you can control on the monitor, directly from your android or ios device. The Chromecast is really easy to set up and use these with. Along with this however, you can stream just about any video content from a Chrome tab on a PC. I haven't come across any video I wasn't able to view in this manner, and I watch so much content online. My set up works like this: I have a central home media PC, and I use a local network remote application to control my PC from my android device. I can see the PC screen on my android with this, and I can watch any video content on the Chromecast without needing to physically go to my PC (super lazy guy here). It doesn't take much set up either.What I like about the Chromecast, is that it doesn't take up CPU power or battery life on the controlling device, like a similar \"mirroring\" device would. It uses the information you send it to get the source online through the router itself. This way you can play something on the monitor, and still use your device for other things, without being slowed down.I think this is an awesome device, at a great value. I'm sure soon, it will be cheaper and other options, from other companies will be available, but for now this is a great choice IMO.", "verified": true, "helpfulness": "1/1", "author": "archaictext"}, {"rating": 3.0, "review": "Not anymore... if you can just do a HDMI cable it is MUCH easier.... when you are on YouTube you can only cast one song at a time... you have to start it OVER AND OVER AND OVER  .... this may not be a big deal to you, but once you realize what I am saying, it will be...  It works GREAT with NETFLIX.  The first week i had this i was going to buy two more of them... Now that I know how inconvenient it is, I will just use a hdmi cable and hook it up to whatever room I am in...  No kidding guys, it either SUCKS or is good depending on how simple it has to be for it to work for you...", "verified": false, "helpfulness": "0/1", "author": "Anthony Frawley"}, {"rating": 5.0, "review": "You get a lot for your money from this devise. It is is simple and does things Apple TV won't.", "verified": true, "helpfulness": "0/0", "author": "Mark Wolfe"}, {"rating": 5.0, "review": "This is a simple and inexpensive way to play internet content on your television if you have a wireless router.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Ingenious device, perfect for my bedroom tv which i refuse to pay the cable company more money to get content on something I use maybe 15-20 min a night tops.", "verified": true, "helpfulness": "0/0", "author": "okuo"}]