[{"rating": 1.0, "review": "I bought fire TV with out reading the fine print. It does not suport MLB. therefore there is no reason for me to own one so I sold the same day I got it. Amazon let me know when you have a full service box like the ROKU 3.", "verified": false, "helpfulness": "4/12", "author": "Lee Ingham"}, {"rating": 2.0, "review": "It wasn't clear in Amazon advertising that a wireless computer output was necessary for this device to function. A waste of time.", "verified": true, "helpfulness": "1/5", "author": "Errol R. Flom"}, {"rating": 4.0, "review": "Sleek design, super fast, and love the plex application.Needs a similar option like apple's airplay for streaming non amazon sanctioned content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "While I was disappointed with the size of the receiver and remote (See Gary Busey' s tv ad), I still think Amazon did a wonderful job in boosting Prime  members\"enjoyment\". (Downside: I had to purchase new batteries to get the service working and the remote was peeling away at the top.)", "verified": true, "helpfulness": "0/2", "author": "Viewer Choices"}, {"rating": 5.0, "review": "My kids love it. its super fast no lag at all. The kids love the games on it especially with the controller", "verified": true, "helpfulness": "0/1", "author": "Chris A."}, {"rating": 2.0, "review": "The only thing I have been able to access is Netflix.  But it wants me to pay to play and I already have an account and should not have to pay to watch anything.  Unfortunately there is no one who can help me know what is going on.  The is a problem with Amazon.", "verified": true, "helpfulness": "1/2", "author": "Patricia"}, {"rating": 4.0, "review": "WOW!  This little box (size of a slice of bread) makes using Amamzon Prime and other on-line services a breeze.  Well worth the price!  The only complaint is no \"Off\" option within the menu selection.  The unit shuts off automatically after 30 minutes off being idle.", "verified": true, "helpfulness": "0/1", "author": "Karl"}, {"rating": 4.0, "review": "When you talk to the remote control it goes only to Amazon films, not to others, for example, in NetFlix.", "verified": true, "helpfulness": "0/0", "author": "Kiko Arocha \"Alexandria Library\""}, {"rating": 2.0, "review": "Too much buffering!!!! Not able to watch ANYTHING without constant interruptions!  VERY FRUSTRATING AND DISAPPOINTING!!!! NO RECOMMENDATIONS HERE !! SORRY!", "verified": true, "helpfulness": "2/2", "author": "Barbara Kay Holmes"}, {"rating": 5.0, "review": "Easy setup. Many movies and TV shows to watch. Tested and joined Hulu. Enjoy many British mystery series that I missed on Dish network.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]