[{"rating": 5.0, "review": "This is a neat compact device and it does the job flawlessly of streaming using my tablet as the conduit. Plus you don't have to keep the tablet occupied-once your program starts, you can use it separately. Highly affordable and recommended. I am going to order another one for a different tv too.", "verified": true, "helpfulness": "0/0", "author": "Just the Facts"}, {"rating": 4.0, "review": "I can't use my iPhone with it, my husband can drive it with a Samsung cel", "verified": true, "helpfulness": "0/0", "author": "silvia castro"}, {"rating": 5.0, "review": "It worked great, no regret in the purchase I would recommend it to others .", "verified": true, "helpfulness": "0/0", "author": "Rene`"}, {"rating": 5.0, "review": "Nice no complaints", "verified": true, "helpfulness": "0/0", "author": "ralph michel"}, {"rating": 5.0, "review": "useful", "verified": true, "helpfulness": "0/0", "author": "halil keskin"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "device Not at all supporting. Streaming is not good.", "verified": true, "helpfulness": "0/1", "author": "Sandeep"}, {"rating": 1.0, "review": "Just another gimmick from the goog. Streaming is iffy at best even with a fast service. Delays of minuets to get a video to play. No offerings of any interest and full of ads and ways to get even more personal info to google.  It's amazing how they try to suck your children into the ads and get them to give even more info. Kind of scary to have google enticing my children.", "verified": false, "helpfulness": "0/3", "author": "C. Maples"}, {"rating": 5.0, "review": "This is a little gem, which you should have if you like streaming videos. With this, you don't need Smart TV at all. Hats off to Google for creating this amazing device.", "verified": true, "helpfulness": "0/0", "author": "Siddhartha"}, {"rating": 1.0, "review": "Maybe it was just my luck but couldn't' get the darn thing to work for anything. The book that comes with it (you actually have to get it separately) DID not do any good either. It's a very picky system. Not for people that have high speed internet that do NOT live in the city.  Just bad.  Just get a Blueray player and get it over with.", "verified": true, "helpfulness": "1/3", "author": "A Moms Rantings \"Mom tested and Mom approved\""}]