[{"rating": 2.0, "review": "2 Stars for Amazon Prime streaming and build quality.I bought this primarily as a Plex client. BIG MISTAKE. Neither Plex nor Amazon would address the numerous streaming issues, including frequent video freezing and stuttering. Widely reported issues in Plex forums with AFTV and Plex. If you intend to use this with Plex, look else where.", "verified": true, "helpfulness": "2/4", "author": "Shanmugaraj Periyasamy"}, {"rating": 5.0, "review": "I am enjoying my Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Darlana Quinn"}, {"rating": 2.0, "review": "The device itself is fast and responsive, love the voice search.The bad is the content prices, so you pay for the box, you pay for the Prime, and when you find something to watch you have to rent it or pay for it again...whaaa? Its like paying for Netflix and then having to pay Netflix again for each movie you watch, plus the device...?Amazon TV packs together all the functionality of Netflix, Vudu, and hulu (+) into one, having a smart device such as a TV or Blu-Ray player with integrated apps would provide the same service this box provides. Although it is certainly a bit more convenient, it provides no more functionality than the previously mentioned devices. On the contrary, it adds a yearly bill for the Prime service. The content of which can be bought, rented or viewed from the already mentioned apps within your smart device.There is some free content with the channel apps dont get me wrong, but you will find it very limited and most of the new and best content is up for rent. Again, pay three times to watch anything. -If you got money coming out the nostrils then this is perfect for you, otherwise wait til they figure out that paying 3 times is not a good business plan.-and yes I'm keeping it anyways.", "verified": true, "helpfulness": "1/5", "author": "JL. Alfaro \"Joe A.\""}, {"rating": 5.0, "review": "This might be refurbished but it looks and works just like the 2 that we bought at full price.  Would buy another refurbished one before buying a new one!", "verified": true, "helpfulness": "1/1", "author": "C. Colley \"genealogy nut\""}, {"rating": 5.0, "review": "Still learning about it but so far I am very satisfied", "verified": true, "helpfulness": "0/0", "author": "dana barlage"}, {"rating": 3.0, "review": "Like the product but lots of hidden costs", "verified": true, "helpfulness": "1/2", "author": "Katherine A."}, {"rating": 5.0, "review": "I'm hooked with my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Juan C. Lopez"}, {"rating": 2.0, "review": "If you plan on using firetv as a plex client, you should know that firetv does not support mkv file with DTS. Hopfully they will fix this soon.", "verified": true, "helpfulness": "0/2", "author": "Tim Delesio"}, {"rating": 4.0, "review": "Works great I will recommend this to family and friends", "verified": true, "helpfulness": "0/0", "author": "kimberly wilkerson"}, {"rating": 2.0, "review": "Pros:1. A solid piece of hardware that stays put with cables plugged in2. Has optical audio output3. Has an Ethernet port4. Remote is Bluetooth and easy to use5. UI is beautiful and intuitive6. Setup was a breeze; comes connected to my Amazon account7. Voice search feature works well for what it is8. Super fast start up and video playbackCons:1. Lacks multi-channel audio support for most media types2. Voice search only work for \"purchasable\" content in the Amazon Marketplace3. Marketplace has a limited selection of applications and games; no Google Play support4. Initial setup requires you to watch a worthless ~5 minute \"help\" video without the ability to skip5. Ethernet connection is limited to 10/100Summary:I really wanted to love the Fire TV. It's interface is beautiful and the hardware is blazing fast. However, the audio playback of this device is severely limited. Most of my movies are encoded using an .MKV container with DD 5.1 or DTS audio. The Fire TV simply will not pass through multi-channel audio to my stereo receiver using any container. It's silly, my 2 year old Roku 3 has a very dated hardware and an inferior UI, but it supports DD 5.1 and DTS pass through naively. I promptly returned my Fire TV for a refund.", "verified": true, "helpfulness": "0/2", "author": "OLAN"}]