[{"rating": 2.0, "review": "The advertising for the Chromecast makes it appear that you can quickly and easily move anything you are looking at on your cell phone or laptop to your TV.  However, thats not even close to true.  You can watch a YouTube video on you TV from the phone or laptop but when that video ends the Chromecast disconnects.  You have to send each YouTube video you watch to the Chromecast and let it reconnect.. EVERY SINGLE TIME.I have had very good luck watching Netflix from my cell phone, no interruptions, excellent picture quality, but thats about the only thing I can use this for.  I have a horrible connection from my laptop to the Chromecast so I cant use it at all.  Finding the option to use the Chromecast from the laptop was another chore.  The instructions make it seem like you just plug and play, but nope, thats not true for the laptop. If you want to use the laptop you must download Google Chrome, but then it still wont work.  You have to find \"extentions\" and download the cast extention which then gives you the option to watch either YouTube or Netflix from the laptop on the TV.The idea that you can watch anything is no where near reality.  You have 3 choices; YouTube, Netflix or Google media items you have purchased. You can't see any of your photos on the TV, you cant watch any home videos you have on the phone, you cant see any documents, nothing. You should be able to play your music but not a single one of my hundreds of music files were compatible with the Chromecast, so the music doesnt work for me either.I can use it to watch one YouTube video at a time, reconnecting after each clip, and also use it to watch Netflix, but thats it.  For $35 I say it is worth the convenience of Netflix via cell phone, but I wish I had known all this before I bought it.Had it been advertised as just a \"Netflix by phone\" product I probably would have purchased it and been thrilled with it!  Instead I feel let down and am embarrassed that I told so many people I had purchased what I thought was going to be a TV-room life changing product.  It's not.  It just makes Netflix a little more convenient.", "verified": true, "helpfulness": "0/3", "author": "Scott \"Scott\""}, {"rating": 1.0, "review": "After the initial setup, none of my device((iPhone, iPad & Mac book) at home were able to connect to the device. It worked the first day, the next time I tried it just doesn't want to connect. The only solution I found was to restart the router every time which is not feasible. The whole experience is very frustrating and I am a techie. The only consolation was that it is only $35. If you are looking for a hassle free device which just works then it is not for you. The device is in its infancy and needs a lot of improvement.", "verified": true, "helpfulness": "6/10", "author": "Salman Khan \"Sam K\""}, {"rating": 5.0, "review": "This thing is great although the Netflix app doesn't \"autoplay\" the next episode of shows when you use it. I also got it when they were still offering 3 free months of Netflix, so the price was really only $11.  It is so much better using Chromecast to watch Youtube as well, as the \"streaming\" apps that my bluray has and the tv has are clunky and crappy to \"search\" for videos on. It is far better to be able to call up the video's on the phone or tablet or computer, and then send them to the tv.This thing is great!!! A Must Buy IMO.", "verified": true, "helpfulness": "0/0", "author": "V \"cloroxbb\""}, {"rating": 2.0, "review": "Full disclosure: I've used Roku for years, thought I'd try this because it's so cheap, and to personally \"beta-test\" it.  And I don't use my smart-phone for stuff like this, so if that's important to you, it's a point in Chromecast's favor -- I'm fine with Roku's dedicated remote.Chromecast works fine for Netflix and Youtube -- FORGET, for now, Google's promise of casting a Chrome browser tab to your TV with this, at least for streaming video, such as Amazon Live or the many sites with video clips. My laptop (a few feet from the Chromecast dongle) streams video just fine, but Chromecast, for now, really only works for those sites that have dedicated apps allowing direct streaming to Chromecast, the major ones (for me) being Netflix and YouTube. The Chrome browser tab broadcast to the Chromecast dongle is HORRIBLE for video, in the current Beta.Bottom line: Roku has Netflix AND Amazon Live Video, but not (in my current iteration of Roku, at least) YouTube. Chromecast has Netflix and YouTube but NOT (as far as I can tell) Amazon Live.  I believe both have HuluPlus. Roku's cheapest, at 50 bucks, is fine so the price difference isn't all that huge.So there you have it: Do you care more about Amazon videos, or about YouTube, on your TV?Also: Be aware that unless your TV has a spare USB port to power the Chromecast, you may need to use the AC adapter, which is included but makes the Chromecast dongle get alarmingly hot (which Google calls \"normal\" for the device).", "verified": true, "helpfulness": "1/2", "author": "Kerumbo \"Kerumbo\""}, {"rating": 4.0, "review": "I purchased chromecast from Google within a few hours of its release and got ~$24 netflix rebate, hence the effective cost was only $11 for me. At that price it was a no-brainer. I use ipad and airplay extensively at home, as I am a proud cord-cutter (no cable/satellite service).  Recently I moved from an iphone to android device after five years with various versions of iphones, and needed a quick way to stream stuff from android. None of the apps on google play store provided the ease of use and smoothness of Apple TV and airplay. Chromecast is a step in right direction. In contrasting it with airplay, the main advantage is that it doesn't stream from phone, but grabs the media pointed on the phone directly from the cloud. In my opinion it is much better than airplay, as it doesn't lock the phone. You can play one video on TV and browse other videos on the phone without disruption.  The disadvantage currently is the limited App compatibility on android. Only netflix/youtube and google music and movies are supported. That comprises 80% of my media consumption. For streaming videos from other websites, Ipad-airplay-Apple TV is my backup solution.I hope as the App selection expands and the platform evolves, it will be possible to completely ditch airplay and use only one platform for all media consumption.", "verified": false, "helpfulness": "0/0", "author": "AJ \"random opinion\""}, {"rating": 4.0, "review": "Chromecast does everything it is advertised to do and does it well.Setup is easy.  Plug the dongle into a HDMI port, power it via a mini-USB which can either go to a USB port on the TV or if you don't have one it comes with a wall unit.  Anything you use to charge a phone will work nicely.Set the TV to the proper port, then you can do the initial setup with any device.  You'll need to download the chromecast app for phone, tablet or pc.  First time through it will see the unit and prompt you to enter your wifi information.  Once it's on your wifi network, any of your devices can see it.You'll need to update to the latest version of Google Play, YouTube, Netflix and any other app that comes along with support for it (HBOGo in the works).  Then you need the Chromecast extension for the Chrome browser.  From there, anytime you want to display something on the TV instead of local screen just click a small chromecast icon within the app.It's that simple, everything works great, quality is fine.There are some limitations though...1) There's not yet an app I'm aware of to stream local media.  I know of at least a couple of these in the works.  Anything you can view thru Chrome will of course work, but Chrome's playback of local files tends to be limited and of iffy quality.  Another work around would be a plex server and point Chrome at that.  Quality again may suffer, and at this point you're talking about something you do not want to talk your mom or granny through in terms of setup.2) The chrome extension is only available on desktop.  The mobile versions do not yet have it.  Again, I have to think google would be working on this one.3) The wifi setup currently doesn't take into account the potential need for browser based logins to many (most?) hotspots.  This puts a real damper on the idea of using it in a hotel for instance.  Note that competing devices such as Roku and AppleTV will have this same issue.  Don't expect hotels to solve it for you as they'd rather you use their PPV entertainment options.Despite the limitations above, this product is a no-brainer for $35 if you want to utilize your TV as a display for any of your devices.", "verified": true, "helpfulness": "0/0", "author": "hellpuppy"}, {"rating": 5.0, "review": "Yesterday I receviced this device. I configured this chormecast device using my Iphone 5, I see in reviews that not many were able to configure it using iOS , i think they didn't switch it to chormecast wifi during configuration. Youtube works flawlessly without video buffering unlike my samsung smart tv which always buffers. Its one of the best innovvation from google, hats off to them for making it available for just 35$. Can't wait the Beta feature of chorme tabcasting to work nicely, i could see stutterring of video's from my win 7 core duo laptop when i do the tabcasting. I just anticipate lots of other companies start supporting chromecast with there apps in android and iOS platform.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Yesterday my back-ordered Chromecast dongle arrived from Amazon.  I hooked it up and then spent several hours trying everything possible to get the device to work with either my iPhone or iPad - with no success.  A friend suggested I connect to Chromecast via my desktop first.  By downloading Google Chrome and then the Chromecast download, my desktop PC recognized the device and started working.  From there, my iPhone and iPad could be used to control the Chromecast's use on my flatscreen.  I also discovered that by dragging a movie or program onto the Chrome desktop, that could then be seen on the flatscreen.  I am not a huge teckie so this was an adventure, but it now works great!  I do recommend it, but wish Apple made it easier to  connect to Chromecast.  I've read all the problems people have encountered getting their Apple devices to work with Chromecast - it is possible to do so and if I can do it, so can you!", "verified": true, "helpfulness": "0/0", "author": "Mike O."}, {"rating": 4.0, "review": "First off, I have been a professional developer for almost 25 years. I've seen the sausage being made for so long that I am accepting of minor issues because I realize the technical challenges that exist and that seeming ruin a device/service for most people. The Chromecast is an amazing device for what it can do, what it costs, and what it will do in the future.What it can do:Stream web content from Netflix, YouTube, Google Play. It can also mirror a your Chrome browser. That's it. Don't expect local media files unless you have some skills and want to play around with someone else's add-on project, or want to roll one of your own. Currently the best experience will be for those with Android phones/tablets. I've used mine with a Galaxy Nexus, a 2013 Nexus 7, and an iPhone 4. All worked as advertised. I understand though that device setup is not currently possible from iOS. I didn't try this, but once setup I was able to initiate a stream using YouTube on iOS.What it costs:$35. For that price nothing else compares. If you want something more capabil get a Roku3. It's $99 and does a lot more (thus the ~3x price).What is will do:This is the cool part for me and why I keep ordering more units. Google has published an open API and is encouraging developers and content companies to develop for the device. There are already many 3rd party projects out there is extend the capabilities of the Chromecast. From Pandora support to local files streaming to desktop mirroring and more. Some may knock Google for their recent shuttering of many useful products and services (BRING BACK LATITUDE!) but they've done the right this here by making a really simple device and then publishing an API so anyone can extend it.I've knocked off one star not because of the device itself, but because Google hasn't done enough to explain the limitations of the Chromecast. Thus too many people are getting it and are confused about what it can/can't do. This is a Gen1 device and it should be understood that there are rough edges and features that are still being tweaked.Final though - If you are a Netflix subscriber and have an Android phone this should be an automatic buy, just wait until a couple more of mine have shipped. :)", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The device itself is fine. But it's hard to just review this without reviewing the apps that partner with it. The Netflix app seems to freeze up a lot. The Google apps work fine. Would like to see more apps take advantage down the road.", "verified": true, "helpfulness": "0/0", "author": "J. Broccoli"}]