[{"rating": 2.0, "review": "I was disappointed because the streaming was very slow and limited. It may have preformed the way it was designed to but not in the way I expected.", "verified": true, "helpfulness": "0/0", "author": "Sandra J. Melton"}, {"rating": 5.0, "review": "Loving this product. Installing is easy, setting up is easy and most of all watching the digital media on TV from Android smartphone and tablet and desktop is very easy. Got addicted to it. :). Must have gadget.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple to install and easy to use.  Really a game changer.  It so great to watch Youtube videos on larger screens and utilize the audio equipment without all of the wires.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey E. Bains \"smoooth\""}, {"rating": 3.0, "review": "Set up on Apple devices is amazingly straightforward, but on PC with network set up. Wilress streaming is fantastic without any codes connected and great on Apple devices, but via Chrome on PC... Chrome based casting is not available on Apple devices... So it is still good and bad.", "verified": true, "helpfulness": "0/0", "author": "Hiro Makita"}, {"rating": 4.0, "review": "It has been a very good device so far, I really love the simplicity of use.The phone app has been a little bit buggy at times (freezing, or not working in 4.3 on my t999). But when everything does work, it's fantastic. I am wondering how long it will take to get more thrid party apps for it (like Playon).If the bugs get worked out fully, and more third party apps become available, I will probably buy one for every TV I own and suggest them to friends and family.Also, a small pet peave, I wish the micro USB power cord connected at a different location so that it wouldn't be visible under the tv. And, as long as I'm making feature requests, it would be fabulous to have a headphone audio out jack to use it as a music streaming device (with older amps, etc).", "verified": true, "helpfulness": "0/0", "author": "Maven1022 \"Maven1022\""}, {"rating": 3.0, "review": "It's cool and the setup is easy. If you only want to watch YouTube or Netflix (or Hulu now?). When I first put this in I wanted to stream movies from my PC. I already use PS3 Media Server which works well for most devices in my house. I bought this because of a new TV I have that is not any type of smart TV. When I plugged it in and got my browser streaming on the TV from my PC I was very happy. I quickly found out that not all video types are supported. It seems to play mp4 fine if you have a lot of those. I have MKV's mostly so 99% of the movies I had would not pass audio. After many attempts at getting this to work with different players through Chrome (VLC, Divx, etc.), I finally gave up. This is probably more of an issue with the Chrome browser at this point and it's inability to work with some audio streams. What did finally end up working was Plex. Plex is nice because it has its own web page which you can open in Chrome and it forces Chrome to use its player. Then you can cast that from Chrome which works and you can pick audio language and such. Okay problem solved right? Not quite. My movies are mostly 1080p. Now although the Chromecast can get 1080p (I believe), this is only through apps like YouTube and such. Chrome browser will only cast 720p. Boooo.Another really important thing is the fact that Chromecast requires wifi. It's not totally clear that this device only works on a wifi connection. I actually had to buy a wifi dongle for my hard-wired PC. Don't get me wrong, I needed it, but it was unexpected. I thought that if I could stream other stuff from my PC to devices on my wireless network then this would work as well. I was wrong.Anyways I give Chrome browser 1 star for having such a huge job in this and failing miserably. I'm giving Chromecast 3 stars because of its lack of streaming apps like Fling (which was awesome and then taken away). I also think it should be more obvious when purchasing Chromecast of these shortcomings.I can't wait for new apps that let me stream local media more easily. It's still a great device and I'm not upset that I bought one.", "verified": true, "helpfulness": "4/4", "author": "J. Ward"}, {"rating": 3.0, "review": "Very cool device but wish I could stream my Amazon instant videos and push pictures and videos in my private cloud to the device. I see loads of potential but only netflix, hulu plus and you tube apps are available.  Had issues connecting my router but after I updated the firmware it worked perfectly.Just need more apps now.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 4.0, "review": "This works well....it does exactly what it is supposed to....will be great when they provide additional capability.  Haven't had any problems.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Fantastic little device. Does exactly what it claims. No trouble to set up. Plan on purchasing more for Christmas gifts.", "verified": true, "helpfulness": "0/0", "author": "Johnny B."}, {"rating": 4.0, "review": "Works great with YouTube and Netflix. Unacceptable stuttering and delays when streaming from the browser. Hoping for Amazon Instant Video support SOON.", "verified": true, "helpfulness": "0/0", "author": "noone"}]