[{"rating": 5.0, "review": "I love my Amazon Fire TV.  I can watch movies from Prime or Netflix.  I can listen to Pandora or play a beautiful aquarium or a rainstorm.  I am very glad I splurged and bought it.", "verified": true, "helpfulness": "0/0", "author": "scnightowl"}, {"rating": 5.0, "review": "Excellent product. Arrived in brand new condition. :D", "verified": true, "helpfulness": "0/0", "author": "Jim E Underwood"}, {"rating": 5.0, "review": "I loved it works great.Thanks", "verified": true, "helpfulness": "0/0", "author": "Dewayne"}, {"rating": 5.0, "review": "We love our Amazon Fire TV. As former Roku users, we found the FIre to offer greater access to movies, tv shows and music. Thanks to our Amazon Prime membership, we have thousands of free movies to chose from. Long gone are the days of buying expensive cable packages with dozens of channels we never watched. With Amazon Prime, we get to watch what we want, when we want. I doubt we'll ever spend on viewed content via the Fire what we paid each month to Cablevision. FREE. AT. LAST.", "verified": true, "helpfulness": "0/0", "author": "Carolina girl"}, {"rating": 5.0, "review": "Fast with a very intuitive interface. Love this thing.", "verified": true, "helpfulness": "0/0", "author": "SpaceMonkey"}, {"rating": 4.0, "review": "The voice search feature is very nice and saves time. There seems to be too much bs apps and things though. I wish it could pull in live local channels.", "verified": true, "helpfulness": "0/0", "author": "Chris Hall"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Ofir"}, {"rating": 3.0, "review": "Pros:Acceptably Powerful SystemResponsive RF RemoteExcellent Keyboard and Mouse support via Logtiech Unifying Reciever.Able to install third party APKsWired LANSupports OUYA and Logitech(F310) controllersMinimal Video Mode Selection with Oversan optionsPrice(50 USD After promotion with Sling TV)More open and powerful than the Roku 3 at the same price-point.Cons:No Google Apps or services supportAdvertised as \"gaming\" and even got a controller made for it but only comes with 6GB of storage that is not expandable(No SD(H/X)C card slot)Not Gigabit Wired LANYou have to go into Settings and Manage Apps to run the Third-Party APK installed apps.Unable to use alternate \"Launcher\"(Home Screen)Only one USB portNo USB 3.x for StorageNo selectable Resolution options for use with MonitorsWireless LAN is attached to the USB Bus(Uses part total bandwidth and \"power\" allocation)No proper Android settings menu(WiFi, Bluetooth, Developer Options)Sleep option is buried in SettingsNo direct access to the Amazon Appstore(just some categories)Text Search is on par with an 80s arcade cabinetOn-Screen Keyboard insist on showing up, even when physical keyboard is presentDoes not support Direct Input(Older USB) Gamepads and Flight Sticks.Microsoft Bluetooth Keyboard doesn't seem to connect(No Bluetooth Input deice support besides gamepads?)USB Storage support mysteriously blocked?Can't sort installed app list by install size.Gets warm and \"cooling\" is laughableRecommendations:As soon as you can, learn how to connect to it from your computer with ADB command line and install ES File Explorer to the device. From there you can access Network Storage, Choose APKs to install, Manage Files, See a list of programs(and sort by size for when you're wondering which ones would be most productive to uninstall because you only have 6GB of storage), and it has a handy utility for finding what's using the most space(that 1GB video you downloaded and forgot about).Install Plex.Install a web browser(Firefox, Chrome, or Opera are good choices)Install VLCBuy a Logitech Unifying device and get a keyboard and mouse. Having an actual cursor and keyboard input is invaluable.Thoughts:According to someone on the internet, there will be an update to allow USB storage within the next few days/weeks/month.Only a hack of a solution to the storage problem. Should have come with an SD Card SlotA \"gaming\" device should have better, if not the same gamepad/input device support as my tablet of the same specs(LG G Pad 8.3).Should have come with a file manager.", "verified": true, "helpfulness": "1/1", "author": "A. Gift For You"}, {"rating": 5.0, "review": "love it. Love the search ability. voice works great. Love the games.", "verified": true, "helpfulness": "0/0", "author": "TG \"TG\""}, {"rating": 3.0, "review": "We have AppleTV on one TV and have the Fire on another. It is OK, quite surprised by the small selection of movies available. I ordered, or thought I ordered a how to book from Amazon for the Fire TV,and received Fire stick guide. Trying to return it was not as easy as I was led to believe it would be, being a Prime Member, Probbly wouldn't recommend it.", "verified": true, "helpfulness": "1/1", "author": "Cheryl Trowbridge"}]