[{"rating": 5.0, "review": "Plex via Chromecast = happy campers. I bought these for all of our tvs to cast media from my apples media center and they work great.", "verified": true, "helpfulness": "0/0", "author": "Cyle Caplinger"}, {"rating": 3.0, "review": "Not as easy to use as I was lead to believe.  Apple TV works better", "verified": true, "helpfulness": "0/0", "author": "G Scott Bittner"}, {"rating": 1.0, "review": "I've had my Chromecast since January 2014. It was working perfectly until today when my TV stopped recognizing it. That would make it seem like maybe it's my TV that's got the issue. Nope. The HDMI ports work fine. I've troubleshooted the hell out of this thing and absolutely nothing has worked. I unplugged it to reboot it. I held the button to reset it. I unplugged my TV. I tried plugging the Chromecast into an external power outlet. I moved the Chromecast to another TV and still the same issue. This thing is now less useful than a paper weight. After spending the better part of this evening trying to get it to work, I think I'll only feel better about this when I hear it being crushed under the tire of my car.", "verified": true, "helpfulness": "0/0", "author": "A. Kulik"}, {"rating": 5.0, "review": "This is the best hardware purchase I have made in the past few years.", "verified": true, "helpfulness": "0/0", "author": "Tanim Islam"}, {"rating": 1.0, "review": "Always refreshing", "verified": true, "helpfulness": "0/0", "author": "David Little"}, {"rating": 5.0, "review": "After 1.5 years of use our old Chromecast died. This is still a great way to watch movies via Netflix and cast other web pages etc onto a non smart TV. Cut the CABLE and Satellite dish, get this device and digital TV antenna instead.", "verified": true, "helpfulness": "0/0", "author": "Bruce Oly"}, {"rating": 4.0, "review": "Works for me!", "verified": true, "helpfulness": "0/0", "author": "Captain Retro"}, {"rating": 5.0, "review": "works well I love it", "verified": true, "helpfulness": "0/0", "author": "joseph  Squillace"}, {"rating": 4.0, "review": "great product and works great but you do need strong wifi to help keep a decent signal to your device.", "verified": true, "helpfulness": "1/1", "author": "David Lewis"}, {"rating": 4.0, "review": "Not using it as much as I thought.", "verified": true, "helpfulness": "0/1", "author": "Julie Milner"}]