[{"rating": 5.0, "review": "easy to use easy to setup.  works great.  fun to show off phone and computer to your TV magically .", "verified": true, "helpfulness": "0/2", "author": "Highspeedplay"}, {"rating": 3.0, "review": "I bought this expressly for the purpose of listening to my 20k google play songs through my living room tv. It works and it doesn't.The good:  1. Set up was extremely simple. I had no connection problems at all.  2. It is inexpensive.The bad:  1. It works (sort of) through my phone, a Galaxy S4. However, sound quality is intermittently poor. Sometimes it sounds like a Victrola circa 1920, with several popcorn poppers providing ambiance.  2. On random play, it will fairly often stall for unknown reasons.  3. Even though it does not stream from the phone, I detect a moderate battery hit, probably because of constant polling.  4. Using my laptop, when I \"tab cast\" google.play.music, I get video of the web page, but NO SOUND. No setting changes on either the tv or the computer made any difference, nor changing hdmi slots. I had no problem with video or sound on, for example, a youtube video, but google's own music player (the one you would think had been tested to death) is mute.Maybe these problems will be resolved with software updates, but for now this is of marginal utility.", "verified": true, "helpfulness": "3/4", "author": "LaChinchon"}, {"rating": 1.0, "review": "I was under the impression that it work for my kindle fire.  Now I find that I need an app that is not available.", "verified": true, "helpfulness": "6/10", "author": "Charles D. Springs"}, {"rating": 4.0, "review": "This does everything Google said it would do.  It took less then five minutes to set up and as the HDMI and USB ports are on the back of my TV it's completely invisible.  I purchased it primarily to watch NetFlix and Youtube on the TV rather then using my PS3 Fatboy.  The Fatboy is getting long in the tooth and the cooling fan for it generates enough noise to be distracting.  Now everything is quiet.  Being able to use the tablet or phone to pause, backup, or fast forward the video works as stated ... very cool.  The only thing that keeps me from giving the Chromecast five stars is that I can't stream my home video's from my phone or any other video for that matter to the device.  I can only see things getting better as developers start enabling this device on their apps however.  So I expect that in the near future I will be able stream personal content to the Chromecast and watch on my big screen tv.", "verified": true, "helpfulness": "0/2", "author": "T. Heck \"Checkmate\""}, {"rating": 5.0, "review": "It is a snap-and-go device. I plugged it to an HDMI port on my TV, it does not need separate power. Once I downloaded the Chrome plug-in on my PCs, broadcasting any content from the browser is just a click. Quality is breathtaking. Multiple devices can control the TV, regardless of which device is sending the content. Love it.", "verified": true, "helpfulness": "0/2", "author": "Rex"}, {"rating": 5.0, "review": "Even though we had the lowest price package for satellite TV we still did not watch it much - I think the commercials and re-runs were the downside to paying for television.... My husband saw this and read about and thought we should give a try. We have in the past hooked up our laptops to the TV and watched programs - but the downside was having to get up and pause it or wait for streaming - Oh we are lazy in our old age - but this handy little gadget lets you control everything (wirelessly) from the comfort of your chair. So we have only used it for a couple of days - but i'm thinking the satellite TV will be a thing of our past very soon. Highly recommend.", "verified": true, "helpfulness": "0/2", "author": "Nancy Cragg"}, {"rating": 5.0, "review": "My Dad has Apple TV and this is lots better- at about a third of the price.  Google eats apple again!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Only drawback is that it doesn't seem to send sound to the Tv during a Google Hangout.  Does fine with You-Tube and Netflix, so not sure why it doesn't work with Hangout.", "verified": true, "helpfulness": "0/2", "author": "John Gardner"}, {"rating": 2.0, "review": "My review:It sets up easily (only positive)Videos cast from my laptop were choppy, at best.I cannot cast from Chrome in iOS.  This was the feature I assumed would be available but it is not.Only YouTube and Netflix played decently...but I already have a PS3 so I don't really need this.", "verified": true, "helpfulness": "2/4", "author": "steve"}, {"rating": 2.0, "review": "The Chromecast is cute as a bug, as the children used to say, but alas neither my laptop nor my smartphone nor my Kindle Fire HD will get the thing up and running. I would give it a single star except for the fact that it's so danged CUTE. So I am going to keep it around until such time as I upgrade my phone or laptop to one that Google will deign to recognize, or else until I find a friend who can use it. For $35, why return it?", "verified": true, "helpfulness": "2/5", "author": "Beaver"}]