[{"rating": 3.0, "review": "Does not work without connecting to local wifi.  I was hoping to use this to stream from my tablet straight to the TV, but it only works with certain apps.  It is pretty cool, but just googles answer to the Roku and other streaming devices.  Also, needs power, meaning it is not self powered.  It needs to have a cord connected to a usb port or wall adapter which it comes with.  I really wanted something that would connect directly without other stuff needed.  I guess I should read up more about stuff before I order it.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 4.0, "review": "Overall a good buy...One should definitely go for the Chromecast...it has its share of minor issues as it is still in Beta version but will improve down the line", "verified": true, "helpfulness": "0/0", "author": "Mani"}, {"rating": 4.0, "review": "A very good streaming device. Good for travel, particularly when work is a series of hotel rooms. Some bugs still need to be ironed out.Pros:1 Portable2 Comes with power cable3 Works well with Netflix, HBO Go, Youtube4 Low costCons:1 Casting Chrome Tabs is buggy and simply wont work if your internet connection is spotty.2. No option for direct line internet. WiFi only.3. Audio/Video sync issues when casting tabs.", "verified": true, "helpfulness": "0/0", "author": "Anand Bhardwaj"}, {"rating": 4.0, "review": "I thought that it would be easier to use - I can hardly reach the appropriate outlet on my TV (it's BEHIND THE TV) to plug it in.  And I have to unplug something else to use it, so then I have to struggle to get the other device back in when I'm done.  I have to get my 16 year old to help me, and you know what that's like!  Check to be sure you have an unused outlet on your TV that is easy to access before buying this device!", "verified": true, "helpfulness": "0/1", "author": "Deborah Weaver"}, {"rating": 2.0, "review": "The chromecast device worked well for a while, but now appears to be caught in a power struggle between Microsoft, Apple and Comcast. Comcast bandwidth during evening hours appears slower when using Netflix. The Chromecast has trouble being recognized by iPhone or iPad. My Mac laptop can find the device, but trips over Silverlite. Once connected, the Netflix stream is constantly buffering. (Comcast?)I am going to try Apple TV next to cut the google partner out.. Next. Change internet provider.", "verified": true, "helpfulness": "0/0", "author": "C. F. Crowe"}, {"rating": 3.0, "review": "I love the concept, but the performance has been flaky.  First week, it worked great, no problems.  Then all of a sudden, it cant be found.  reset this, reset that, still no go.  Researched and found a list of routers it doesnt quite work with, mine was among them (D-link 605-L).  I found this odd as it HAD been working.  So I did the \"fix\" they recommend.  Ok, then it worked again.  A week later, it cant be found .  Dont know what to do now.", "verified": true, "helpfulness": "0/0", "author": "Susan L. Rambus \"hiker4life\""}, {"rating": 4.0, "review": "Good stuff!  For $35.00 you can mage any HD tv internet ready.  Works great with streaming from your devices to the tv.", "verified": true, "helpfulness": "0/0", "author": "David Thompson \"Dave\""}, {"rating": 5.0, "review": "Performs as promised.  Shipped quickly, Updated already by Google to add access to other streaming content.  Simple to use with your tablet or laptop interface.  Google scores again!", "verified": true, "helpfulness": "0/0", "author": "Phil Cee"}, {"rating": 3.0, "review": "It hardly manages to honor the basic functions advertised by Google. Installation and configurations was very easy. With few applications working we need to wait. Till then my Apple TV and Roku are worth its prize.", "verified": true, "helpfulness": "0/0", "author": "Tomy"}, {"rating": 1.0, "review": "It does not recognizes high speed wifi 5-G,so have tom go with regular wifi network. Downside ,it forces your tablet network to downgrade to regular wifi.Anyway it support only few apps ,which are normally available on the latest smart TVs . So unless you are stuck with older version of TV which has HDTV SLOT ( very unlikely) you should go for it.", "verified": true, "helpfulness": "3/6", "author": "mukund kulkarni"}]