[{"rating": 5.0, "review": "I don't usually write a review unless I am compelled to by the product itself. And this is one of those devices!People don't realize it but this device is much more than \"another streaming option\". I won't go into how this device plugs into HDMI, disappears from view, doesn't need a remote and is powered directly by the HDMI 1.4 port (or a USB port on the TV itself or a separate power adapter).The real beauty of this thing is it streams everything from the 'cloud', not from your device. You only use the phone, tablet or laptop to communicate with the dongle (which is on the same wifi) and tell it which youtube video or pandora song to pick from the cloud and then to pause, rewind and move forward (like a remote controller). And herein lies the true capability of this device. Suddenly, not only do I not need a separate TV box and remote, my streaming device is no longer a slave to the dongle (unlike Airplay). So, if I am watching a netflix movie and I get a call, my wife can use her phone to pause the movie. Any phone, tablet or laptop is a controller and a content streamer as long as it's on my wifi. And the handoff between devices is seamless and spans across Android, Chrome and iOS platforms. Imagine the possibilities when friends visit, parties are hosted, etc.It's this magic that people don't seem to realize is going to change the way we stream content forever. And of course, with the Googlecast SDK being made available to developers widely, I won't be surprised that everything from HBOGo to TED Talks to Hulu+ will integrate the 'Cast' button into their apps. Who needs a separate TV box and remote now?", "verified": true, "helpfulness": "3/5", "author": "Ankur Rakshit"}, {"rating": 3.0, "review": "If you have a Roku, AppleTV, game machine, connected smart TV, or computer hooked up to your TV then you have very limited uses for the ChromeCast. If you are new to the ipTV world then RokuLT @ $49 gives you more options (it is also easier to setup) and does not require a second connected device to be with you. If you always have a connected device then ChromeCast it worth it and will (someday) provide more options.Only 2  good reasons to get it:1. If you got the 3 months of Netflix then it is a no brainer to try this out otherwise wait until version 2.2. If you use two HD computer screens for work (I do) putting it in one will allow you to watch an online \"instructional\" video on one screen and take notes on the other.Unlike the Roku, AppleTV, and/or computer setup Chromecast does not support DLNA. Considering I have a number of DVDs and all my music on a NAS server, the NAS information is just about useless with a ChromeCast.", "verified": true, "helpfulness": "2/4", "author": "EWJ \"lovetoys\""}, {"rating": 3.0, "review": "Setup: Chromecast on front (AUX) HDMI port of Onkyo AV Receiver TX-NR515 to Panasonic Viera TC-L47ET5 (everything purchased from Amazon)Pros: Excellent TV picture and sound with Netflix and YouTube  Convenient program/movie selection via iPad  $35 price tag cheap even without Netflix Promotion  Free shipping with Amazon PrimeCons: Cannot set up Chromecast (yet?) from iOS device  Cannot cast tabs from Chrome on iOS devices  Chromecast doesn't pick up my WiFi from rear HDMI port of the Onkyo AV Receiver  Amazon delays 5-7 days to email the Netflix Promotion Code (for earliest purchasers)  Apps on iOS so far limited to Netflix and YouTube  Google-supplied HDMI extender cable only inches long and too short to relocate Chromecast device from rear of AV Receiver to  front In order to pick up WiFi signal.Experience: I managed to set up my Chromecast, but not without a few time consuming issues.  First came the unwelcome surprise that I could not set it up from the Chrome browser on my iPad.  I had to use a Mac or Windows computer.  But, my iMacs are upstairs, and my entertainment system is downstairs...TILT!  Ah, but we do happen to have an older MacBook running OS X 6.8.  So, I hauled it downstairs and installed Chrome on it for the setup.  OOPS! The setup requires OS X 7 (Lion) or later.  So, I tried, anyway, and despite the on-screen warnings, it worked...well, sort of at first.  Next, one must read the step-by-step directions carefully, especially the one to switch the WiFi network on the computer to the one running on the virgin Chromecast device.  OK, check! My Chromecast at that point was plugged into HDMI slot #5 in back of the Onkyo AV Receiver, and I had swiveled the receiver around 90° so that the Chromecast device was visible to me and to the WiFi source, apparently.  So, eventually the setup worked, that is until I turned the Onkyo AV Receiver back to its normal position such that the Chromecast dongle (even using the short extender that is supplied) was behind the receiver.  It was no longer able to pick up my WiFi signal in that position.  No real worry: I just relocated it to the sole front HDMI port of the receiver, and it picked up the WiFi signal easily.  By the way, the HDMI port on the receiver does not supply power to the Chromecast device, so the USB power is required with my setup.  I was able to use one of the two USB ports on my Onkyo receiver for the power source (the other one is used by a WiFi adapter).  Well, everything works now, and with my Logitech Link setup, I can select Chromecast operation by selecting the corresponding programmed icon on the Harmony app.  It should be noted that the extra HDMI and USB ports on the Onkyo TX-NR515 AV Receiver really facilitated the setup as an alternative to plugging the Chromecast directly into the Panasonic TV.  Now I await Google's promise to come up with more apps and to offer an iOS compatible version of Chrome so that I can cast tabs to the TV via the Chromecast device.  At this point, the Chromecast is a toy gadget in progress to becoming a really useful adjunct to my entertainment system, especially since I already have four other ways for playing Netflix and three other ways for YouTube on my TV (Apple TV, Roku, Vizio BluRay Disk Player, and the Viera TV apps themselves).", "verified": true, "helpfulness": "3/5", "author": "S. Goldstein \"toys for big boys junky\""}, {"rating": 3.0, "review": "Read a lot review and tried mine this weekend.First of all, it works. Of course at this stage, it only works on very limited apps, such as Netflix and Youtube. So far so good.My problem is the wireless setup. It connected to my main router, Linksys/Cisco, but doesn't work with my Amped Wireless Extender. I have a big house and my Linksys router signal is very weak for this Chromecast. everytime I try to connect to Amped wireless extender, screen shows: \"Chromecastxxxx connected to Amped_Wireless, but can't access the internet\". But my computer, iphone work with this extender very will. I will try to find a way to solve this issue otherwise I have to return", "verified": true, "helpfulness": "1/4", "author": "Mic"}, {"rating": 2.0, "review": "We have been researching this  Chromecast item for the last couple of days, it's funny how the same reviews are on all the sites that sell it. Saying its so great, Bestbuy, and Amazon need to be better gate keepers of reviews", "verified": false, "helpfulness": "6/31", "author": "djmindblender"}, {"rating": 1.0, "review": "One of the best initial best selling points for the Chromecast was the 3 months of Netflix.  I ordered mine the very first day July 24, the Netfix promo was clearly being offered.  In fact it wasn't until 13 or more hours later (the next day) that Amazon decided to retroactively cancel the promo for those that ordered after 5:31pm, which meant the promotion lasted all of about 4 hours.I've written Amazon, and their usual good customer service is not coming through, they continue to say that orders only in the first 4 hours or so (before 5:31pm) will get the Netflix promo.  (A four hour promo??)Interestingly, if I had ordered from Google, I would not have this problem, Google is giving buyers a full 20 hours longer than Amazon is to receive the Netflix promo.EDIT:  Amazon changed their minds.  Six days after Chromecast release, they added 24 hours to the order time (now 5:30 pm on July 25)in order to get the Netflix promo. This more closely matches Amazon's advertising of the promo on Amazon's website, on both the first and second day of the Chromecast release.", "verified": true, "helpfulness": "23/121", "author": "J. Bryant"}, {"rating": 5.0, "review": "Received my Chromecast yesterday and got it working within a matter of minutes.Sure you can do nifty things like stream Netflix or Youtube videos directly to it, but I can already do this through my Xbox or through the SmartApps on my TV or home theater.To me the cool thing is that you can stream the content of *any* Chrome (web browser) tab directly to your TV. What does this mean? It means you can stream ANY video displaying on your web browser. If you can fullscreen the video it will play fullscreen on your TV accordingly. The video (depending on the resolution) isn't going to be as smooth as it is in the native streaming formats like Youtube or Netflix, but it works.I have my Chromecast plugged directly to my TV, and through audio return channel (ARC) any audio played through it gets sent back to my home theater system. This is a huge benefit as I can stream tabs of Pandora or Songza and listen to the audio through my home theater speakers.I was lucky enough to order it early and get the Netflix promotion which applied a $24 credit to my Netflix, meaning this cost 11 bucks. But even at its full price I'd recommend the Chromecast. It simply doesn't get easier than this product!", "verified": false, "helpfulness": "2/2", "author": "B. Rodriguez"}, {"rating": 4.0, "review": "====08/14/13 UPDATE; ORIGINAL REVIEW BELOW=====I had to contact Amazon customer service via chat to obtain my Netflix incentive code. As best I can tell, it was never emailed to me. I have now successfully applied it to my account.The actual device: Tab casting: I wish somehow, my PC would not have to actually stream the video, too, in order to cast the video to Chromecast...just the streaming related commands. My PC gets really hot when streaming...and does shut down occassionally becasue of this. So, indeed, if you are not using your PC to actually WATCH a video, but only to cast to your real TV, why tax the PC's CPU to stream video, too? There are occassional stutters, too, but they do not happen a lot. Resolution of the casting tab on my TV sometimes degrades, too. This is likely due more to connectivity congestion rather than the device itself.Android tablet app: I have a Samsung Smart TV which has access to all the applications/streaming platforms available in the current app. So, really, except for a bit more convenience as remote control, until more 'channels' or apps are written to provide more content for the app, it really is just 'okay,' redundant to my content available via a Smart TV. It would also be great if tab casting could be available in a chrome browser available on these mobile devices (smart phones and tabs). You cannot currently tab cast on mobile devices.===============================================I'll update once I receive the actual device, but...1. You'll never get 5 stars out of me simply due to how Amazon (and Google) withdrew the Netflix subscription incentive within hours of releasing this product. Sorry people can do basic math Amazon, but this was a no-brainer. Why even offer such an incentive? This was quite a sore point for me in your product launch.2. Amazon was very specific in its time frame regarding those who had access to the Netflix incentive. However, the best a customer can see online is what DATE he purchased, not the time of day, which was critical here as Amazon 'cheapishly' withdrew the offer at 5:31 PT on 7/24. While I do *believe* I nabbed the incentive as I'm in the ET zone and definitely remember ordering during the day, it would be nice for Amazon to list the exact time, since that was critical in this issue.More once the product arrives.", "verified": true, "helpfulness": "1/10", "author": "JustAGuy \"JustAGuy\""}, {"rating": 4.0, "review": "Easy set up.  Gets concerningly hot very quick. I'm using the mains power source.Used with Netlix and YouTube from ipad and iPhone.  Not found a web browser that works yet or other video.  Expect other will add features in days ahead. Hope HBO GO is on quick.", "verified": true, "helpfulness": "1/1", "author": "Dean Gammell"}, {"rating": 4.0, "review": "Bought from a brick & mortar Best Buy on Friday July 26.(Item wasn't on display I asked a worker in the tv dept if the store had any, he checked with customer service and got me one.) At first, I could not get this thing to connect to my home network. It kept broadcasting the name of the Chromecast dongle as it's own network instead of connecting to mine. (Like using Connectify but without piggybacking on the network.) User error because I had-by accident-put in my router password instead of my network password *duh*. Once I corrected this the Chromecast was good to go. I ran the app on a low-end Acer laptop(windows 7),tested on a Hisense Sero Pro (Android) and an ipod touch (4th gen,IOS). Worked great with both Youtube and Netflix. On the laptop, using the Chrome browser to cast a webpage has a slight lag but a very clear picture. Trying to cast video is the same. But hey, these are still in beta right? For $35 dollars it's fine with me, and it seems to have potential as more apps become available. Plus I got the netflix deal! Now what I cannot figure out is how to change to Chromecast settings to allow it to connect to a different internet connection. In this case, a portable Virgin Mobile mifi. If anyone figures this out, post it please :)", "verified": false, "helpfulness": "1/2", "author": "molkohavoc"}]