[{"rating": 5.0, "review": "Great interface and the voice search is really near.", "verified": true, "helpfulness": "0/0", "author": "Jacob H."}, {"rating": 3.0, "review": "Locked up on occasion until I found that you could put it to sleep. Seems to lose its wireless connection occasionally and requires a restart to get it back. However, it is much better and cheaper than XFinity cable TV or Direct TV although I miss baseball on TV. I can live without sports.", "verified": true, "helpfulness": "0/0", "author": "Robert L. Fastner \"monkeyboy\""}, {"rating": 2.0, "review": "The Amazon Fire TV isn't a horrid device but the worst thing is it tries to lock you into Amazon's ecosystem. I don't know about you but being locked into anything only drives me away. Yes, it has Neflix, Hulu, Crackle and others but no Vudu. Yes, I know Wal-mart and Amazon have a hate for one another but there is no room for that in the business world. The alternative, Flixster is only SD rather than HD is not a suitable replacement for Vudu and my Ultraviolet collection I hold so dear. Every turn and every search via voice only leads to Amazon's content and although this is an Amazon Fire TV it’s still a bad thing as it doesn't allow for choice within your search across other offerings from other providers.  Next is the layout which at first is very confusing and very poorly done as everything is treated like an app rather than an imbedded service like the Roku 3. On the Roku everything is equal and laid out that with 1 click the service is opened and ready to use. However, with the Amazon Fire TV you open it as an app and require a second request to open it as an app which takes away from having a seamless feel to the device.  It takes a little time to get use to the device and once you do you start missing another major flaw with the device which is native DLNA support. Lots of folks have setup DLNA servers in their homes to stream their own content throughout the house which makes thing majorly convenient. The option of DLNA was omitted from the Fire TV but is found on the Roku 3 along with Vudu. The hardware itself is much better than the Roku 3 but the Roku 3 is nothing to laugh at as well but for whatever reason the Roku 3 runs more seamless and steady. The Amazon Fire TV I notice in the Neflix app will lose sync. Meaning the video will lag slightly then run like  its in fast forward to catch back up with the audio. No this not due to lack of bandwidth as I have 105 mbps download speed. No it isn’t my Wifi as the device has max signal. No it isn’t a throughput issue as well as other devices wirelessly can get the full rate of speed from the same distance which is 5 feet away from router. The wireless is running @ 5GHz but I noticed the same thing running a wired connection as well.  The only real advantage is the gaming aspect of the Amazon Fire TV but since I have a Wii-U and a gaming PC the gaming aspect means nothing to me. All in All the Roku 3 is a far better choice. I haven’t tried the Google Nexus Player but I know Roku 3 has most everything available in in and doesn’t try to shove its M-Go service in your face like Amazon does with its services which are overly expensive compare to other offerings. Being nickeled and dimed to watch a show for 1.99-2.99 is not my idea of saving money when other offerings offer the show freely within a flat monthly rate in a subscription package.", "verified": true, "helpfulness": "1/2", "author": "jayw654"}, {"rating": 5.0, "review": "I love having this on my TV.  The only draw-back that I can see is that I am not able to move around in Netflix as easily on the Fire TV as I am on my laptop and I don't know why that is, but it just is.  Otherwise, this is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Mspusscat"}, {"rating": 1.0, "review": "Can not get this to work correctly. Pretty disappointed in it.", "verified": true, "helpfulness": "0/1", "author": "John Ragsdale"}, {"rating": 5.0, "review": "Best Performing Streaming Media Player with Zippy Quad Core Processor. Love the remote.  It has no lag and the voice  search is very accurate.  Love the ease of use and the the GUI Platform.  Would buy it again!", "verified": true, "helpfulness": "0/0", "author": "bclark56"}, {"rating": 4.0, "review": "This is great product. The only problem I have is that there's no way to turn it off.", "verified": true, "helpfulness": "0/0", "author": "Parrales"}, {"rating": 5.0, "review": "I am so happy that I purchased this program.  I don't have cable t.v. and this allows me access to quality alternate movies and series.  I LOVE IT!", "verified": false, "helpfulness": "0/0", "author": "Carol Claybrook"}, {"rating": 2.0, "review": "Cannot search anything but Amazon content, completely useless to me as I subscribe to multiple services and don't feel like paying Amazon for something I can get for free on Netflix", "verified": true, "helpfulness": "0/0", "author": "Marc"}, {"rating": 4.0, "review": "I used very usally.I watching movie & TV show to AFTV connect NAS.", "verified": true, "helpfulness": "0/0", "author": "Teasung Go"}]