[{"rating": 4.0, "review": "I'm just waiting for the infamous SDK issues to be resolved, so developers can start releasing supported applications--Once that happens the item deserves the five stars.", "verified": true, "helpfulness": "0/0", "author": "jorge"}, {"rating": 1.0, "review": "Does not have a good customer support system.  Did not seem to work with Netflix or with older operating systems.  Seemed to work only on Windows 7 and above which is not indicated on the box.", "verified": false, "helpfulness": "1/4", "author": "Natalie"}, {"rating": 5.0, "review": "I was all set to return a Samsung smart TV, then bought this cast device and now I love my TV. My advise: buy a non-smart TV and buy a Chromecast :)Just caution: If you want to make use of tab cast feature to mirror online videos, use a powerful PC else the mirroring will be choppy.", "verified": true, "helpfulness": "2/3", "author": "reva badam"}, {"rating": 5.0, "review": "Setup was painless and took about 5-10 minutes. The backgrounds are really pretty and I had no problem throwing Hulu, Pandora, and Netflix from my Samsung Galaxy S3 to the TV via this Chromecast. It's actually much faster to use than booting up my roommate's 360 or PS4 to watch streaming media. I was surprised to find it does not drain my phone battery at all!This is a great, cost-effective product for people who don't have consoles or a blu-ray player to stream media from.", "verified": false, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 4.0, "review": "Absolutely one of the best products out there.Pros- Can stream anything from Netflix, You Tube, Google Play movies and host of other apps like Vevo, Revision 3 etc- Anything on Chrome browser can be streamed.- Easy of use- Easy set up. (takes less than 5 minutes)Cons- Slower on older laptops- Chrome on Ipad or Android Tablets streaming not available yet. I would give it 5 stars if Google can add this feature.Overall this is just amazing product that Google has made. I have recommended to many of my friends who have purchased this product.", "verified": true, "helpfulness": "0/0", "author": "Sri"}, {"rating": 5.0, "review": "This must be the most elegant and well designed piece of software/hardware Google has done. It's almost a page out of the Apple experience in set up... It Just Works.I live in a rural area, and skip transmitted and cable TV because of low value to me, so all I watch is on the web, and there is more than enough to enjoy between Netflix and YouTube (search on anything \"full length\"; and the sound is great as I play it back through my stereo system.Would be nice if (cough cough) Amazon Prime worked with this.And for only $35? So glad I did not bother with an AppleTV.", "verified": true, "helpfulness": "1/1", "author": "Alan Levine"}, {"rating": 4.0, "review": "Pros: Easy setup. Works great! The phone app is a great way to check time remaining on the kids movie from anywhere in the house.Cons: Too small to have it's own software so a phone app or laptop is required to 'cast' to the television.", "verified": true, "helpfulness": "0/0", "author": "Ben Mozrall"}, {"rating": 5.0, "review": "Love it you should buy it . It's worth the purchase and so easy to use and install. Peace yo", "verified": true, "helpfulness": "0/0", "author": "Sandro Quiros"}, {"rating": 4.0, "review": "This product is awesome. Works as advertised and arrived astonishingly fast. I have to admit that at first I had my doubts, but once you get the hang of it, it really does work great.", "verified": true, "helpfulness": "0/0", "author": "D. C. Masis \"Chino\""}, {"rating": 2.0, "review": "Well it works and is easy to set up.  HOWEVER, it really is just a wireless version of an HDMI cable casting from my computer to tv.....which IS a good thing.....just don't expect any new content.  My biggest disappointment was that Google has not added SOMETHING for all of us that got burned on Google TVs, you would think the link would allow me to just tap my Google TV into WiFi and go using the Google TV keyboard.....but  nope.  Having the allegedly smarter TV doesn't make any difference at all.  How disappointing. Perhaps they will upgrade the software later?  Here is to hoping!", "verified": true, "helpfulness": "1/2", "author": "Teri L. Mosier \"Deafer\""}]