[{"rating": 5.0, "review": "It's simple to use! I've had no problem with this thing at all. I got it for my parents, because they love watching Netflix, but sometimes wish they could watch it upstairs in their room. Their tv doesn't have Netflix built into it, so I get them this. It's cheap and effective! Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Victoria V."}, {"rating": 4.0, "review": "We are an Android/Google household so I may be a little biased, but I definitely think this is worth the price.  The developer kit has been made public so I'm expecting a lot more apps to add Chromecast functionality.  We mainly use it for Plex, HBO Go, Pandora, and  the Chrome browser (use it mainly to cast Amazon Prime Instant Video) right now.  It's very easy to use and it works very smoothly on my Galaxy Note 3, Galaxy S4, and through the Chrome browser on both of my PC's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love, Love, Love! I stream Amazon Prime from my kindle to my TV to watch with the whole family. Easy to set up after just plugging it in. I'm not tech savvy at all and even I managed to do it. It also works with my smart phone the same way. Overall, It doesn't seem to slow down the speed of the internet to other devices being use at the same time, which was an initial concern of mine. It's used constantly in our house.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Read about this device on-line and being the techno nerd that I am, I wanted one!  I love the fact that I can project from my computer or my iPad to our HDTV.  Right now, it seems like the device must be plugged into a power adapter to run but I'm not sure if it will eventually work without that or not.  I've used it about 5 times and have plugged it in to AC each time to get it to work.  I see this as a potential problem should I take it to a hotel or other place where plug ins are sometimes not easily accessible.  But, perhaps it hasn't had the opportunity to charge enough.  Guess I need to look at the directions again.  But, I do love the device.  It makes it nice for everyone to sit and watch from whatever location in the room - not hovered around the computer.", "verified": true, "helpfulness": "0/0", "author": "Angela D. Hance \"sweetlip\""}, {"rating": 5.0, "review": "This product is great, I thought it was very easy to use and install. I definetly reccomend this product to anyone who has netflix.", "verified": true, "helpfulness": "0/0", "author": "Daniel Santos"}, {"rating": 3.0, "review": "Works good but wish it had more apps that worked with my smartphone. Really good on my laptop. Happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 3.0, "review": "Allows you to stream netflix, HBOGo, etc... New apps are coming out for it all the time, and it's improving. But until they get the PC to Cast streaming capabilities working in any reasonable capacity, the potential of this product is extremely limited. Currently \"Live streaming\" directly from a browser is completely unusable. It's choppy, poor quality, and the audio ends up misaligned with the video.Still, at 1/3rd the price of AppleTV, and half the price of Roku, if you have need of something that will allow you to stream netflix to a non-Smart TV, or don't have a console capable of doing so, then this is a real nice cheaper alternative.", "verified": true, "helpfulness": "0/0", "author": "Sizzlack"}, {"rating": 5.0, "review": "I've been commercial and cable free for years.  I didn't even have a TV until recently.  My company's IT girl told me about this Chromecast for my TV and I ordered it immediately.  I was watching my TV programs on my 19\" laptop, streaming from a few websites and now I can watch my programs on my new TV just like I did on my laptop.  I love it!!  No cable bills for me ever again!!!", "verified": true, "helpfulness": "0/0", "author": "Regina Pegues"}, {"rating": 2.0, "review": "I bought this thinking that I could play my personal media on my TV, not just Netflix and Hulu. In fact, I can't play any of my Amazon movies even if I'm streaming them through Google Chrome. $35 wasted given our primary TV already comes with Amazon, Netflix, Hulu and more already integrated into it.Also, I expected it to hold a charge. It doesn't. That means I have to keep it plugged in all the time.I would have been better off buying a long HDMI cable, plugging it into my laptop and TV, and using my TV as an extention of my computer.The only reason I gave it 2 stars is that device allows me to 'cast' Netflix from my Android when using an older TV that doesn't already have the movie apps integrated. So yay, I can use Chromecast with an older TV. Marvelous. *sarcasm intended*", "verified": true, "helpfulness": "0/1", "author": "Bent West"}, {"rating": 5.0, "review": "Works great from any device that has Chromecast app installed. Can cast to any TV anywhere as long as you have an internet connection with a DHCP (will not work with static IP address). If you are in a hotel you would need to use your MiFi or other personal WiFi connection as most hotel connections are not compatible in my understanding. We have used it with our construction business to cast our website to a potential customer's big screen TV to show them slideshows of our work.", "verified": true, "helpfulness": "0/0", "author": "Scott and Christine Boyd"}]