[{"rating": 3.0, "review": "I'm sure Fire TV is as good as Apple TV, etc. The problem is with me. There is very little quality programming available in general. So although there is a lot to choose from, when you filter out all the garbage that's available, there was very little left to justify the expense.", "verified": true, "helpfulness": "0/3", "author": "Daniel Peterson"}, {"rating": 5.0, "review": "I really enjoy being able to watch old tv shows from the beginning and seeing old movies via Netflix or Prime.", "verified": true, "helpfulness": "0/1", "author": "Brenda Thompson"}, {"rating": 5.0, "review": "Very powerful, fast and efficient. The best part is finding something to watch on my kindle hdx and send it to the tv without having to get up!", "verified": true, "helpfulness": "0/0", "author": "Robert  R Gibson"}, {"rating": 5.0, "review": "I have had this streaming device since it came out, and I am very pleased with its performance.", "verified": false, "helpfulness": "0/1", "author": "Beverly Carlucci"}, {"rating": 5.0, "review": "It is great to have at home.... I have another produce similar to this one and I like this one a bit better...", "verified": true, "helpfulness": "0/1", "author": "Pamela M. Sanford"}, {"rating": 4.0, "review": "I can download different apps and watch Netflix service or hulu. The only thing that I am disappointed is that I can't watch amazon movies because I have to be a pay member. Which defeated the purpose of having a amazon fire tv box.", "verified": true, "helpfulness": "1/1", "author": "mimi"}, {"rating": 5.0, "review": "I can watch my favorite shows like \"Family Guy\" anytime I like; and its free on Hulu Plus!!", "verified": true, "helpfulness": "0/1", "author": "Sheila Mason"}, {"rating": 4.0, "review": "Decent device and ease of use. Rewind/_Fast Fowarding is not so good. Amazon needs to offer better selection of FREE content for members. Overall, 4 stars...lost 1 star due to the above mentioned.", "verified": true, "helpfulness": "1/1", "author": "leon pinkney"}, {"rating": 3.0, "review": "Great little device. I works fairly well, but I only rated it 3 stars because of one issue. I have many different wireless devices that connect to my network at home. While my main router is in the basement I have a wireless extension to better reach my whole house. Every device I have has had flawless connection on the top floor. However this is the only device that consistently buffers or stops playing because of \"slow\" connection. I know this can't be as I have many time ran a connection test with other devices and I get well over the minimum to stream video. I don't know if it's a defective device or a software issue but it gets pretty annoying.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Overall very great speed and fun to use the voice commands. I wish that you could sort through the videos available through prime only. I also wish there was a way for prime members to rent movies for cheaper than $5. But overall I'm really enjoying this!", "verified": true, "helpfulness": "1/1", "author": "AmazonUser"}]