[{"rating": 4.0, "review": "I use it with our new C720P Chromebook.  Very simple setup and easy to use.  It is a little anoying that we have to power via the USB port but we weren't using it for anything else so it isn't a big problem.", "verified": true, "helpfulness": "0/0", "author": "Dh135"}, {"rating": 5.0, "review": "This product has seriously exceeded my expectations. After reading online and seeing many people write negative feedback about this product, I was hesitant to purchase it. I am sure glad that I took the gamble. This product was a cinch to get hooked up with our WiFi router (D-link DIR-655). It has since turned my 6 year old Vista 47inch LCD flat panel TV into a smart TV. I couldn't be any more satisfied with this tiny toggle. I plan on purchasing a second Chromecast in the near future!", "verified": true, "helpfulness": "0/0", "author": "jordan velez"}, {"rating": 5.0, "review": "Works wonderfully! able to use my old Samsung S II to control my 55 inch tv, play music just wish for more apps!", "verified": true, "helpfulness": "0/0", "author": "Michaelmcd52"}, {"rating": 5.0, "review": "This is absolutelly fantastic", "verified": true, "helpfulness": "0/0", "author": "Juan Jose Castillo Lugo"}, {"rating": 1.0, "review": "Sound will not work. Period. Also seems they are a bit late seeing everyone else already has this feature. Tried it on several TV's and it would show the picture, but no sound. Tried it on the wife's phone as well. No go.", "verified": true, "helpfulness": "2/3", "author": "Chipawa \"honestindian\""}, {"rating": 5.0, "review": "Awesome for Netfix.  Run my TV with my ipad and watch Netflix all the time.  Woooo cool.  Like it!  Word", "verified": true, "helpfulness": "0/0", "author": "Steven Snellback"}, {"rating": 1.0, "review": "We use Hulu for movies and TV.  We bought this for a third TV to be purchased over the Holidays.  Chromecast on an old Android 2.3 phone didn't cast Hulu at all.  On a Windows 7 PC it casts Hulu but has major issues with poor frame rate.On You Tube everything works fine from both devices.  Only we don't have much use for You Tube.So we are going to buy another Roku box.  The two we have now just work without drama.", "verified": true, "helpfulness": "1/1", "author": "Robert M."}, {"rating": 5.0, "review": "Chromecast is a great product. I love Chrome cast watch anything from Netflix, Hulu, And YouTube. It's perfect! You can also do so much more with the Chrome cast than what's listed in the description box. The book , Unlock the Power of Your Chromcast by Aaron Halbert is a great investment too. It's a guide for your Chromecast with extra tips and tricks.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up, and get casting.  If you're curious about what it does, check out the google page on it.  If you're on the fence, go ahead and pull the trigger on it.  It's an easy way to get streaming TV in our spare bedroom that's not hooked up to the cable here.", "verified": true, "helpfulness": "0/0", "author": "H_Huck \"Huck\""}, {"rating": 5.0, "review": "The Google Chromecast definitely has a target audience. I bought this as a gift for my girlfriend since she does not have a SMART TV and was stuck watching Netflix and YouTube on her phone. The setup for the Chromecast was idiotproof in my experience and I had absolutely zero issues with it then (and continue to have zero issues). It definitely has a target audience of those without SMART TV's but can still be useful to those who do have SMART TV's as you can control the streaming from your phone, and even stream a few more things to it than your SMART TV probably has apps for. Everyday use is far too easy to have any complaints about and even controlling it from multiple different devices (for example, adding YouTube videos to the queue) is not difficult at all. The best part, however, would be the ease of connecting your devices to it since, well, you don't have to! If your device is on the same Wi-Fi network as the Chromecast, it will automatically add in the \"cast\" button in to the supported apps. All in all, a great product that I would buy again if need ever arose.", "verified": true, "helpfulness": "0/0", "author": "Doug Murphy"}]