[{"rating": 4.0, "review": "More of an observation and opinion on modern technology than a detailed review, let me say that we do live in amazing times.  Having a smart phone or wifi internet home connection opens doors that were unheard of even 10 years ago.  Who would have thought that 'roughing' it in 2014 would be having only terrestrial and satellite radio stations to tune to in your car?  Or that a cable TV subscription would be seen as basic entry level entertainment?Having just bought a Fire HDX tablet and then seeing this TV unit, I bought it to simply stay up with the modern wave of technology that continues to up its game.  I also have a Chromecast device on one of my TV HDMI ports and, when comparing that to Amazon TV, it's no contest.  Fire TV is quicker, more easily navigated and provides an ease of use not found with the older (obsolete?) Chromecast.  Interruptions in wifi are a nagging problem on occasion with both devices but in the main, I'm glad to have Amazon TV as a part of my continuing journey in finding the best home entertainment.", "verified": true, "helpfulness": "1/1", "author": "R Rated \"Keeping it real\""}, {"rating": 2.0, "review": "It is just a copy cat. Nothing new. It doesn't support all video and audio files. It needs VLC Player. Maybe even a abc mouse option too for my kid. If it had these features then I would buy three right now. It doesn't so its no better then any other streamer. I am kind of sick of the streamers now a days with no file support. Do these companies have no idea how much people use external hd now. I have neo tv, roku 3, and vizio box. Vizio was good till google play one day disappeared off of it and half of my other apps. It pooped itself so I bought the roku 3 which is alright. I can only play 1/3 of my videos and of that amount only half have audio that works. In my opinion it makes me frustrated to see more of these pushed out and over advertised for just the same crap. Some company needs to go beyond and stop being copy cats.", "verified": false, "helpfulness": "4/9", "author": "hammerdin4life"}, {"rating": 5.0, "review": "I really like this thing but I don't know how much \"prime\" is and it does not recognize my voice but it does my husband's.  That's a bit strange.", "verified": true, "helpfulness": "0/0", "author": "Bertina Schreiber"}, {"rating": 1.0, "review": "Have been an Amazon Prime member for years and thought that would entitle me to movies on the new Amazon Fire TV service comparable to Netflix.  It doesn't.  The quality selection of free streaming movies is much better on Netflix than on Amazon, and Netflix service is available for free on most new televisions and DVD players without buying Roku or Amazon Fire TV.  I am really disappointed in Amazon Prime.", "verified": true, "helpfulness": "11/30", "author": "C. Sutton"}, {"rating": 4.0, "review": "Was going to buy another apple tv but decided to give this a try. I don't watch broadcast tv mostly Netflix or xbmc. I got amazon prime for the free 2 day shipping Prime tv but it isn't available as an app on apple so never used it for movies.The Fire works well for prime an Netflix. The voice search works well but it only searches Prime content. It won't connect to my iTunes library for stored video files. the fire is faster to load and start playing a movie than apple tv by a few seconds. By that I mean he fire is instant, no lag or buffer, the apple would take 3 to 4 seconds to start.Remote is great, not line of sight so works anywhere. More cluttered than apple remote but with 6 buttons plus tilt wheel and enter button plus speech search it's easy to navigate.To compare fire to apple tv neither are complete:Apple. - Netflix plus iTunes but no PrimeFire - Netflix plus prime but no iTunesI think future software updates will make it better and it's Android based so expect a hack to be available in the future which will hopefully bring iTunes compatibility and maybe xbmc.", "verified": true, "helpfulness": "1/1", "author": "ian murray"}, {"rating": 2.0, "review": "i just accidentally ordered a television program and was charged $2.99 because Fire TV does not have a one stop search. It seems that when AMAZON offers a program for a fee, it will not show Netflix, or Hulu offerings that would be free for the same Item. It does show Netflix Hulu and other offerings in the search when Amazon doesn't charge for them. Amazon should give this box away free since it's designed to increase their profits. Roku 2 & 3 both offer one stop streaming and allows the user to decide which provider to stream a program so that he can get the best price.This Box also does not offer VUDU.", "verified": true, "helpfulness": "5/8", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I recently got setup in a new office outside of my house, and I like to have movies, TV shows, and sports on in the background when I am working.I didn’t think I needed to get cable TV, since I could run Google Chromecast through my laptop for Amazon Prime and Netflix.But I’ve never really liked Chromecast (it simply wouldn’t work with the Internet in two hotel rooms when I tried), so I was excited when I saw the Amazon Fire TV announcement on April 1.I initially thought it was another corporate joke, and I didn’t pay a lot of attention to it, but then I started seeing write-ups on it.Not only was it quick and easy to setup, but since I bought it through my Amazon Prime account, all of my past purchases were already ready for me when I plugged it in.One concern I had about going without cable was a lack of live sports, but Amazon Fire TV also has an app for ESPN and all of their channels, as well as tons of other apps.The remote is pretty cool, too. It’s got voice search and it’s been perfect with my mumbling so far (take that, Siri!).Also, there are lots of game apps available for free or cheap. They offer an Amazon Fire Game Controller to purchase separately.Jam playing on the Amazon FireMy kids and I are digging the games so much that I’ve ordered a second controller for multi-player games. For example, NBA 2K14 was just $7.99 and it was a quick download and install. They say they’ve got thousands of more games on the way.I look forward to seeing what else is added on to Amazon Fire TV, and I think it was well worth the $99 price tag.", "verified": true, "helpfulness": "5/5", "author": "Shawn Collins \"Shawn\""}, {"rating": 4.0, "review": "Great for movie and streaming apps but not for me. I mostly have digital media and was a bit surprised that it didn't have a local media player. I won't take away from the player by giving it a bad rating but like I said the main thing I needed it to do, it doesn't.", "verified": true, "helpfulness": "2/3", "author": "Mr. Robinson"}, {"rating": 5.0, "review": "Great streaming device and with the added feature of a voice activated remote to search with, it is by far better than anything else on the market right now A+++", "verified": true, "helpfulness": "1/1", "author": "George Gosnell"}, {"rating": 1.0, "review": "I own an AppleTV and two Rokus. This piece of #@%# is the worst and going right back to Amazon:1. Netflix and Hulu apps feel dated and hard to use. Hulu takes a zillion clicks to get to recently added TV episodes!2. Netflix and Hulu apps are buried under apps (like the 10th menu entry on the left).3. ????4. Profit! While the Amazon Instant performance is snappy there is no way to restrict access to Prime content only. I feel like it's a pushy sales man always trying to sell me something. Absolutely hate that.Regarding the title of my review: As a kindle owner, impressed with past Amazon products I feel let down and betrayed. How could they have put out such a horrible box?", "verified": false, "helpfulness": "15/30", "author": "Jo Smith \"Fred\""}]