[{"rating": 5.0, "review": "This is a great product, especially for the price. I bought this at a mere 20 dollars during a cyber Monday deal and it has been the best $20 I have ever spent.My only real beef with it, is that apps that support chromecast are still in an inchoate development phase.Apps like crunchyroll, YouTube, hulu and Netflix support, however their implementation of the product could be more polished.Well, that's something that will eventually be fixed gradually over time and it's not really the manufacturer's fault so I won't take away any stars.", "verified": true, "helpfulness": "0/0", "author": "Franco Selem"}, {"rating": 5.0, "review": "Bought this because it works very well with all my tablets, and it arrived very promptly", "verified": true, "helpfulness": "0/0", "author": "JAY"}, {"rating": 5.0, "review": "Love this! We already had a smart tv, but we couldn't get all the apps we wanted and with sweetie, we can watch anything from YouTube to PBS and abc apps off of any of our smart phones and tablets in seconds. Plus I'm not that tech savy but I was able to set it up by myself in seconds.", "verified": true, "helpfulness": "0/0", "author": "jackie bradshaw"}, {"rating": 4.0, "review": "This has been a great addition to our house. We are able to stream from our apple devices to our TVs. We simply downloaded an app and located the TV.  I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Joshua Blunt"}, {"rating": 5.0, "review": "With the right router, this baby is a gem. We had some problems with an old router and losing connection frequently, but the new router solved that. We cast multiple times a day now.", "verified": true, "helpfulness": "0/0", "author": "Jess Clark \"J. Clark\""}, {"rating": 1.0, "review": "Amazing, Amazon is selling this just to force you to install Chrome (browser) knowing that Chrome is made by Google and is pushing million of unwanted annoying ads. And there is no way to get rid of those ads unless you buy some other software and the snowballing effect is there !I found it very slow compared with a similar device (Apple TV) and this is normal since the ads are taking the bandwidth.", "verified": true, "helpfulness": "0/0", "author": "Valentin Mayer \"maverick\""}, {"rating": 5.0, "review": "i love it.", "verified": true, "helpfulness": "0/0", "author": "truth seeker"}, {"rating": 4.0, "review": "I decided I needed a Chromecast on my kitchen TV sice it doesn't have cable..  It's a little more challenging to install than Roku for me but it works well and no remote to misplace.  We just use the app on our phones or tablets.", "verified": true, "helpfulness": "0/0", "author": "Obie B. Nevels"}, {"rating": 5.0, "review": "It is ok!", "verified": true, "helpfulness": "0/0", "author": "R. J. Mclaughlin"}, {"rating": 5.0, "review": "Works perfectly!! Much cheeper option compared to an Apple TV or something to that effect.", "verified": true, "helpfulness": "0/0", "author": "Megan"}]