[{"rating": 4.0, "review": "If you don't have a smart TV this is a solution at a reasonably priced, I use it for YouTube, Netflix and Google Movies, easy to move from one TV to another.", "verified": true, "helpfulness": "0/0", "author": "Alberto"}, {"rating": 4.0, "review": "I would recommend this to anyone who wants to stream Netflix movies on their TV. We used a laptop to select and download the videos then send them to the TV. Once I got the hang of this it was relatively easy to do and the movies ran from beginning to end flawlessly.  As I said, it took a while for me to get this setup and running correctly.  In fairness to Google, I discovered that I had a defective router a week later. It is quite possible that some of the issues I had with setting up Chromecast may have been due to a defective router.", "verified": true, "helpfulness": "0/0", "author": "Loftin P Montgomery"}, {"rating": 5.0, "review": "Love the conversion of a tv set to a bigger screen for streaming data over from computer which was exactly what was needed when browsing the web.", "verified": true, "helpfulness": "0/0", "author": "Americandoofus"}, {"rating": 5.0, "review": "I got two of these puppies. One for the living room  and one for the bedroom and it changed the way I consume TV. Now there are a flood of new applications that support it and it just going to get even bigger. Still some bugs to fix but what a great idea and execution!!!!", "verified": true, "helpfulness": "0/0", "author": "Arie Schwartzman"}, {"rating": 5.0, "review": "It does just what I needed to do, no need to have a second PC/MAC to play downloaded video. Simple set up, plugged into a reciever through an open HDMI port and streams a great pic with stereo sound! Believe the hype!", "verified": true, "helpfulness": "0/0", "author": "Thomas C. Sams \"topcat1964\""}, {"rating": 5.0, "review": "2yr old twins love curious george, So when we go to dinosaurs house... i mean grandmas house. We have a new allie", "verified": true, "helpfulness": "0/0", "author": "terry rogers"}, {"rating": 5.0, "review": "This is the cheapest and best way to make your TV a smart tv. Plus it in and any tv with hdmi becomes a wifi and app using tv! I own two and both have been great. Allcast app on Android make it even better.", "verified": true, "helpfulness": "0/0", "author": "Eli"}, {"rating": 5.0, "review": "Well... Another great product from google. No complaints.I like how simple this little gem is.It's really user friendly!", "verified": true, "helpfulness": "0/0", "author": "James Johnston"}, {"rating": 5.0, "review": "This thing is awesome! Do download the app for your phone and for chrome on your computer. It's not necessary on the phone but really helps the chromecast detect it. Also when you set it up make sure your computer is connected to your wifi and not hard lined into your modem.", "verified": true, "helpfulness": "0/0", "author": "Joshua C Rapp"}, {"rating": 5.0, "review": "My purchase of the Chromecast was more or less in the dark. I did not know what to expect, but since I own a Roku I could at least imagine. The difference between this and Roku or Apple TV is the way it work and the channels available at the moment. March 2014  I am stating that I use my Android Phone, ChromeBook, laptop and iPad (all from work) to send content to my television. I am own one flat screen in the livingroom and go here to watch TV when my wife is watching Lifetime. I can view Youtube, Hulu and Netflix so I am at peace and the world is good. I hate that no sports channels are available. I can of course bring some content onto my laptop and cast that but it is choppier than if I had a real developed App Channel.Here is what I had to do.1. Put the chromecast into my HDMI port2. Plug in a USB cable from my tv to the chromecast to power the device3. The settings to get on my wireless were painless4. I added Hulu and chromecast to my Chrome Browser5.I started Hulu on my laptop6. I then used Chromecast (located in top right corner of my browser) to cast this tab to my TVDone. This is the beginning and I only hope that I don't have to buy new hardware as the service improves. This is helping me get from under the thumb of Cable and Satellite.", "verified": true, "helpfulness": "1/1", "author": "Crenshaw"}]