[{"rating": 5.0, "review": "So fast and small!", "verified": true, "helpfulness": "0/0", "author": "suesis77"}, {"rating": 5.0, "review": "Came without remote, but Amazon sent one the next day!", "verified": true, "helpfulness": "0/0", "author": "Sharon Bass"}, {"rating": 4.0, "review": "It's not a bad unit for streaming video, as well as playing music and games. But the one thing it's not is a full-on Android TV box, which would let you surf the Internet on your TV and use Facebook, among other things. The remote is quite functional for what it does with the GUI that the Fire TV has. Just be careful to know what you're getting if you plan on getting this device. If you want a full-on Android TV box, you may be better off looking elsewhere for one.UPDATE: Though not a full-on Android TV box, you can use sideloading apps on your Android device to install other types of Android-compatible apps onto your Fire TV device, including web browsers. All you need is a wireless keyboard-touchpad with a USB dongle access the apps you might not be able to use your remote or game controller with.", "verified": true, "helpfulness": "0/1", "author": "Vic George 2K6 \"Vic George 2K6\""}, {"rating": 1.0, "review": "Does not work with Direct TV per e-mail this morning from that cable provider. I was on the phone all afternoon yesterday and never thought to mention that I have Direct TV; I was 2 hours straight trying to upload the software which is part of the set up. The tech asked me to ship it back which I will do.  I will also have to return the replacement that is coming Wednesday,Here is what Direct TV said:Dear Mr. Pearson,Thank you for writing. I see that you have been with DIRECTV for a long time now, and we appreciate your business. My name is Leisly, and I’m one of DIRECTV's customer service specialists. I understand that you want to know if Amazon Fire TV is compatible with DIRECTV. Let me provide the information you need.Amazon Fire TV is currently not compatible with DIRECTV devices. While we are unable to comment on upcoming programming decisions, we are always reviewing our programming options to make sure we bring you the best possible TV experience.I know this is important to you, so I have forwarded your email to DIRECTV Management for review.DIRECTV Management can not follow up individually with every customer, but rest assured every suggestion and comment is reviewed. We often make changes based on customer feedback like yours. You can also check updates about our programming and services online, just log in at directv.com/pr.I appreciate that you have given me the opportunity to assist you, and thank you for choosing DIRECTV as your programming provider, Mr. Pearson. Have a wonderful day!Sincerely,Leisly C. 100321668DIRECTV Customer ServiceIs it too much to ask these people to get together?", "verified": true, "helpfulness": "4/5", "author": "Amazon Customer"}, {"rating": 1.0, "review": "DATA USAGE IS UNBELIEVABLY HIGH!While the functionality of Fire TV is very good, and video streaming of Amazon Prime video content is excellent, data usage is unbelievably high.  A HD movie should stream at a data rate up to 3.5 Mb/sec.  At that rate, a 2 hour movie should consume about 2 GB of my data plan.  The actual data used was a bit over 10 GB.  TEN GIGABYTES!Yes, I'm sure it used 10 GB just for this movie.  I was running a test connecting through Verizon 4G where I have a 40 GB/month data plan.  I'm near the end of the billing cycle and had leftover bandwidth.  So I streamed a Prime Movie to see the data usage.  Verizon showed a change in total data usage of over 10 GB from before the movie to after the movie.  Nothing else going on.Amazon needs to fix the data usage and get it to a reasonable level.  HD should take around 1 GB / hour and SD less.", "verified": true, "helpfulness": "5/7", "author": "Dan E. Mayer"}, {"rating": 5.0, "review": "Great device, loads video quickly. Wish it had NHL", "verified": true, "helpfulness": "0/0", "author": "Gregory Dressel"}, {"rating": 2.0, "review": "Definitely a regretful purchase.  It works fine in most ways but it hogs the household internet bandwidth big time even when turned off.  I basically have to unplug it after every use to avoid the issue. I doubt we'll be using it much in the future.  I just picked up PlayStation TV which I'll use for Netflix etc.  because it doesn't cause any network issues like this does.", "verified": true, "helpfulness": "0/0", "author": "Kezins"}, {"rating": 1.0, "review": "I can't connect with Netflix that is the whole reason I bought this...so frustrated tells me I already have the app but won't open won't luanch the netflix app", "verified": true, "helpfulness": "4/4", "author": "MariaYFamilia"}, {"rating": 5.0, "review": "Got our Fire TV today and I am quite impressed with this product. First the Fire TV is tiny, but packs a punch! We plugged it into the HDMI port on our TV (cable sold separately), turned it on and away we went. It was already set up for my Amazon account. The only setup I had to do was connect it to our router.Once online - it has an informative, short video on how to use the Fire TV. I love the Voice Search on the remote, how cool is that? And yes it works. You have to speak to it 3 times in the beginning so it learns your voice, but no biggie! Another neat feature is how they list the top Prime Movies and Shows right on the home page.If you have an interest in a show or movie just click and add to your watch list. We streamed our first movie tonight and it was a great experience. The clarity of the movie was perfect. I expected it to be a bit choppy with streaming but it wasn't. The picture was crystal clear, the volume and sound were great.Overall, my household is very happy with our new Fire TV!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"time to read\""}, {"rating": 4.0, "review": "This is a question for which I have been unable to locate a simple straightforward yes or no answer,It is not a review. but I think I would like it.  I love the idea if no subscription TV service is required for everything offered.Must you have cable, dish, direct TV or the like to use Fire TV.  I want to buy one as a gift for a person who does not have any of those services and is on a severely limited income and would have to use the voice feature Exclusively.Thank you in advance for your helpM S McCormicka long time Amazon customer and fan", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]