[{"rating": 3.0, "review": "It's ALMOST the best streaming box on the market. It's has The Blaze, YouTube, Hulu, Netflix, the only thing keeping it from being the BEST streaming box on the market... it currently doesn't have the VUDU app. I have over 162 HD movies and tv shows on my VUDU account. Once Amazon allows for a VUDU app it will be the perfect streaming box. Once they get VUDU I will revisit this review and jack it up to a well deserved 5 star review!", "verified": true, "helpfulness": "1/2", "author": "Eric Chacon"}, {"rating": 4.0, "review": "I like the fire tv. The connection to netflix is simple and intuitive.", "verified": true, "helpfulness": "1/1", "author": "Reader Guy"}, {"rating": 2.0, "review": "Started off great, but none of our Android devices can connect via screen mirroring since the update. This was one of the main reasons I went with this over the Apple TV box. Very disappointed now.", "verified": true, "helpfulness": "3/3", "author": "J. M. Russeau \"miss-jamm\""}, {"rating": 5.0, "review": "This is the best smart device I have ever used!", "verified": true, "helpfulness": "0/0", "author": "David B. Moon"}, {"rating": 4.0, "review": "The Fire TV is a pretty incredible little black box.  Very fast and pretty easy to use after you play around with it for a while.  The only problems I have with it is: 1) it wasn't always recognized by my Samsung tv  2) it stopped working completely!  It basically bricked itself after I installed the PLEX app.  Normally these two things would be a deal breaker for me, but because of the performance I experienced prior to these things happening I'm willing to reserve judgment on it until I get another device.  It also helps that Amazon has awesome customer service and they are willing to work with the customer to make things right.", "verified": true, "helpfulness": "4/4", "author": "Eric"}, {"rating": 5.0, "review": "Very easy to install.  Great content.  A great viewing experience!", "verified": true, "helpfulness": "0/0", "author": "Sharon Boswell \"sb\""}, {"rating": 5.0, "review": "Works great arrived as described love this little box", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the device!  Amazon prime is the best investment!", "verified": true, "helpfulness": "0/0", "author": "K. Quinn"}, {"rating": 4.0, "review": "Wow ... forget about any other device, this is the only one and best you can get. Doesn't matter if you are a YouTube junkie, addicted to Netflix, Amazon Prime movies or to any other option, the user friendly Menu guides you straight to your option. I used to have other similar boxes, but Fire TV shows how things need to be done.", "verified": true, "helpfulness": "1/1", "author": "Fritz"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Stella"}]