[{"rating": 2.0, "review": "Amazon didn't pay me to say this either, it is simply much better. It's a cleaner design and easier to use, period.", "verified": true, "helpfulness": "0/2", "author": "Ihersh \"spoll\""}, {"rating": 2.0, "review": "I probably should have done more research, but I'm glad I bought an Amazon Fire Stick on the same order.The Chromecast doesn't *do* anything.While other HDMI stick products are able to stand alone and stream content to your TV, the Chromecast can not. All the Chromecast can do is display the content on your device. If you want to watch anything using this device, you need to tie up your computer/phone/tablet/Chrombook to do the work.This might be nice for Google Apps sites to display content from Google devices, it really isn't a functional solution for streaming content unless you've got a spare device lying around that can do the work.", "verified": true, "helpfulness": "0/1", "author": "Robert O'shaughnessy"}, {"rating": 5.0, "review": "Its a great product!  The competition sounds like its probably about as good as the chromecast, but for when I bought it, the Chromecast was king!", "verified": true, "helpfulness": "1/1", "author": "Joseph DeVictoria"}, {"rating": 5.0, "review": "As advertised. My teen daughter loves this thing. Cell to TV via this device without issue!", "verified": true, "helpfulness": "0/0", "author": "ElvinL"}, {"rating": 3.0, "review": "I got this device because I watch plenty of Youtube videos, but my smart bluray player constantly freezes when watching them.  This was a way for me to be able to queue up videos and not worry about any problems (thinking the hardware, software, and network is all Google).  Unfortunately, I am still having freezes in the videos only solved by restarting the chromecast.  To do this I have to open the app on the phone, press restart, wait two minutes, and then select my video again.  This is not a solution to the problem which prompted me to buy the device, and results in my rating of 3 stars.  I hope Google gets this sorted out, for as I said, they are in control of the entire data pipeline and I would expect it to run smoothly.", "verified": true, "helpfulness": "0/2", "author": "Matthew Eschbach \"music nut\""}, {"rating": 4.0, "review": "Its perfect all round but I took off a star for the random stuttering and buffering sometimes. I think there are still buggy firmware aspects that need to be smoothed out.", "verified": true, "helpfulness": "0/0", "author": "Murye"}, {"rating": 5.0, "review": "I hooked up some people on it. I'd like to see it more lose - not just google integrated services, for example - mirror my phone screen on tv via", "verified": true, "helpfulness": "0/1", "author": "Igor A Elisman"}, {"rating": 2.0, "review": "Not really that happy with google Chromecast. Its perfect for androids systems. You can cast the entire device to a larger screen.  But the casting has problems remaining. It works with IOS devices but only in certain apps does it give the option. It works with all google apps allowing casting of images, videos and sound.  But you can not cast or mirror the entire device.", "verified": true, "helpfulness": "0/0", "author": "Rosalind Merkerson"}, {"rating": 5.0, "review": "Just great!!", "verified": true, "helpfulness": "0/0", "author": "Juan Diego Torres"}, {"rating": 4.0, "review": "Needs 5g support.", "verified": true, "helpfulness": "0/0", "author": "David H."}]