[{"rating": 1.0, "review": "IN GOOGLE'S DEFENSE I BOUGHT THIS DEVICE ASSUMING TO MUCH, I WAS HOPING FOR THE GOOGLE MARKET PLACE BUT THAT DOESN'T EXIST ON THE CHROME CAST. GET USED TO YOU TUBE AND THAT'S ABOUT IT.", "verified": true, "helpfulness": "2/4", "author": "Andres Macia"}, {"rating": 3.0, "review": "I bought this because it was cheap...Setup was easy since I have UPnP already on my Wifi.Took about 10 minutes (including the updates).Once setup I streamed a video to it. The sound and video lost sync instantly.I got disconnected from the Chromecast in minutes.Once I got reconnected, the video would freeze / chop while laptop was flawless.Also the usb cable is a bit short. But if you have a usb port on your tv or cable box not being used, just pull power from that.But if you want to stream stuff, try a Boxee Box.. I like mine. Streams with my devices including airplay. Plus the apps like Spotify are great to have native instead of having to rely on a computer or laptop, etc.", "verified": true, "helpfulness": "0/0", "author": "Jason Stepp \"prototypejason\""}, {"rating": 2.0, "review": "Ordered this up for a bedroom TV.  It found the network without a problem but would not connect at all.  I tried different router settings but it was a no go.  I am a pretty tech savvy guy and can usually work through things but will not be trying this again.  I ordered another ROKU unit to replace this and had it set up in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "TDurham"}, {"rating": 3.0, "review": "I have two smart tvs. So I'm probably not the ideal customer. This would be much better for someone without a smart TV and I will probably give this to my sister.The Chromecast is easy to set up and does provide a convenient method for pushing web content to your television. I was disappointed by the need to use a power cable, but this is not their fault.I'll give kudos to Google for the idea, but skip this if you already have a smart television. Or go for a Roku, it's much easier to use.", "verified": true, "helpfulness": "0/0", "author": "T. Drake"}, {"rating": 5.0, "review": "I have a 5 year old Bravia Sony TV and this device when called upon will power the TV on and switch the input properly.The Netflix app is 1080 and works wonderfully and better picture than my previous broken blue ray player with Netflix.Chromecasting. I love this. I use it to stream xfinity, hulu, amazon and other items. It was choppy until I realized using a wired connection from computer to router instead of wifi clears that up. I can even stream perfectly in the 720 extreme mode no issue. . My router is supposedly high speed too (Cisco E3000) but wires trump wireless any day. I have a Lenovo W530 laptop. Please note it is wireless between Chromecast and your router.I also like it for streaming Spotify to my TV with a nice Zvox speaker.Very happy with my $35 purchase.", "verified": true, "helpfulness": "1/1", "author": "__raj"}, {"rating": 5.0, "review": "Chromecast is awesome, can send browser and a few apps to television. Can't wait for them to expand the use.", "verified": true, "helpfulness": "0/0", "author": "Andrew Gordon"}, {"rating": 1.0, "review": "This product will most likely not do what you think! The only and I mean only files you can stream must either come from You Tube, Net Flix, Hulu Plus, or Google Play. If you want to play anything outside of those cloud services you will be disappointed. No local content from computers, network hard drives, phones, or tablets  on your network will be able to stream. Nothing you record on your phone, no pictures from your phone. Outside of you tube, and google play music content you have uploaded, must be purchased through either a monthly subscription (Hulu Plus, Net Flix,) or must be bought from Google Play.What is most disappointing is this hardware is perfectly capable of doing everything I mentioned above. They refuse to let developers release apps to allow this. Google has turned to the old practices of Apple; purposing limiting you hardware for their own financial gain at the frustration of the customer.I can't believe I am going to say this, and it pains me to do so, but I should have bought something more like an Apple TV.", "verified": true, "helpfulness": "6/9", "author": "Joseph F."}, {"rating": 5.0, "review": "I actually own two Chromecasts at this point and have to say I really love those devices. Been using them extensively with the Youtube and Netflix apps. Also am using tabcasting pretty regularly. For $35 these devices are already a steal. Can't wait to see what people will add once the SDK has been released!", "verified": true, "helpfulness": "0/0", "author": "S. Schreiner"}, {"rating": 5.0, "review": "Easy to set up and works exactly as advertised.  Now streaming movies makes sense and Youtube clips work just great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Content\""}, {"rating": 5.0, "review": "I really used Netflix since purchasing this item.  Super easy to get it up and running.  The only downside is having to use my computer or phone as the remote as I often have to enter a password after the device times out and goes into sleep mode.  But that is a minor annoyance compared to the ease of use of this device", "verified": true, "helpfulness": "0/0", "author": "ponys \"ponys\""}]