[{"rating": 5.0, "review": "Originally owned a Boxee Box. Started breaking down so I needed something to replace it that had the same functionality. This was the best I found for the money. My main concern was streaming local content and the FireTV does that with ease in high definition via the Plex app. It was easy to set up and easy to use. Entire setup and transfer from the boxee was less than 15 minutes. The FireTV should meet my needs for many years to come.", "verified": true, "helpfulness": "0/0", "author": "Bob Tongue"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "cindi"}, {"rating": 5.0, "review": "As advertised and surprisingly fun with my photos, etc.Good value.  Much better than ROKU.I wish it came with a more detailed user guide.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "This is the future of TV.  Along with the Amazon Prime membership, the Fire TV makes our subscription to cable almost obsolete.  I envision the networks and major cable stations all going to streaming services, and having the Fire TV puts us ahead of the curve.", "verified": true, "helpfulness": "0/0", "author": "Thomas P. Carpenter \"sensei grandpa\""}, {"rating": 5.0, "review": "i purchased the amazon prime, a roku, and an apple tv, and this was by far the best. if offers the most apps, runs flawlessly, and the voice control on the remote is such a great feature", "verified": true, "helpfulness": "0/0", "author": "Lauren Duwenhoegger"}, {"rating": 3.0, "review": "Like the idea of the device and most of the features work OK but a lot of the Apps are hit or miss.  For instance, the Sling TV app doesn't work most of the time.  I have to uninstall it and reinstall it for it to even have a chance to work.  Even then it doesn't always and I have to sign in on my phone and log out then uninstall/reinstall the app on the FireTV and then it will sometimes work.  Similar problems with the WatchESPN app.", "verified": true, "helpfulness": "0/0", "author": "Scott Patterson"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "KEITH E VELEBA"}, {"rating": 5.0, "review": "This thing is so cool and so easy to use. I am able to watch all the shows and movies I need for more than half less than what I was paying for cable. It's so convenient and easy to install and I would definitely recommend this to anyone considering cutting the cable cord.", "verified": true, "helpfulness": "0/0", "author": "DeAnne Whitfield"}, {"rating": 5.0, "review": "Super fast streaming! Couldn't be more pleased!", "verified": true, "helpfulness": "0/0", "author": "Teresa A Bernier"}, {"rating": 5.0, "review": "Works perfectly as expected. Very fast and compact", "verified": true, "helpfulness": "0/0", "author": "Ryan and Melissa"}]