[{"rating": 4.0, "review": "Google support was great to handle returns.  It failed a week after receiving it.  Setup was a few minutes on our Samsung TV.  After that, it failed to load and showed a red light on the back.  We tried holding the button on it for 30 seconds, etc. but it only showed the red light.  I unplugged it, let it cool down, plugged it back in and the white light lit up with an \"opps, we had an error and are trying to fix it.\"  After that, it went red with a black screen.  The unit was only plugged in to the Samsung TV, nothing else (power came from one of the Samsung USB ports.The huge plus for this device is that videos from YouTube are very high resolution.  On the 60\" TV, I don't see low res blocks.  My six year old had fun sending her videos to the big screen, so it's easy to use when it works.  The Samsung TV already has the smart apps on it with Amazon streaming video, but this device is ten times more responsive (faster UI.)I'd suppose this device is Google's preemptive strike to the upcoming Apple TV products.", "verified": true, "helpfulness": "0/0", "author": "Z. Scott \"Z\""}, {"rating": 2.0, "review": "Item works only with Google browser, and on-line videos freeze and are sometimes delayed while being watched. Set-up is not as smooth as mentioned in the reviews.", "verified": true, "helpfulness": "0/1", "author": "Azeez Yinusa"}, {"rating": 4.0, "review": "The Chromecast does what it’s supposed to. As far as streaming Netflix goes it's great. However, when you mirror your screen there are some overcast issues and the audio still plays through your computer speakers. I know the overcast is a TV issue, but it would be nice if there was something in the options menu to fix it. Keep in mind the screen mirroring and tab casting are experimental and beta respectively. Tab casting works well, but there is some noticeable lag when scrolling. Google has announced that there are more updates to come especially when Chrome 30 comes out. The Chromecast can only get better and has the potential to be rated five stars when the software updates come out. I would definitely buy one again.", "verified": true, "helpfulness": "0/0", "author": "J. Michael"}, {"rating": 1.0, "review": "It's plugged into the back of my TV, which is 20\" from my WiFi router and I continually get \"Network unavailable\" error messages. IF it works, it does exactly what it is supposed to do, broadcast from Chrome-enabled devices to my TV.If you already own a YouTube enabled device (Roku?, Tivo, etc) -- don't waste your money. This functionality has existed for some time and works a lot better!Chromium != Chrome. I use Chromium on Ubuntu and it complains about Chromium not being supported. I thought Chromium was to Chrome was Fedora was to Red Hat? Perhaps I misunderstood the dynamic/relationship.If you're watching Youtube on any device, you're given the opportunity to 'Skip this Ad' after 5s. On Chromecast, this is not true. You're forced to watch the ad in it's entirety. No one likes ads, no one ever will.At MSRP, it's too expensive, for even as cheap as it is. It's Alpha product at best, beta on a good day, but they've got a long ways to go before it's a consumer device for my (grand)parents. Also, there is no apparent way to exit/close the Android app to disable streaming to the device. As far as I can tell, you have to force quit the app.Wait 8+ months and buy -- hopefully it'll be better by then.", "verified": true, "helpfulness": "0/1", "author": "Barry D. Morrison"}, {"rating": 4.0, "review": "Works very well and is easy to configure and set up. I don't have a Netflix account so the only thing I can use it with is YouTube. I would have liked to have seen more apps support this device at launch but I'm hopeful that more app developers will add support for this device. It works very well if you want to watch YouTube or Netflix on your big screen TV.", "verified": true, "helpfulness": "0/0", "author": "R. Ritter"}, {"rating": 4.0, "review": "Chromecast is a great device for streaming content from Netflix, Hulu and other applications to a TV and it works as expected.  I am enjoying it very much.", "verified": true, "helpfulness": "0/0", "author": "b. lee"}, {"rating": 4.0, "review": "Loving this Chromecast Player so much I am thinking of purchasing another one. The resolution is good on the HD movies I have purchased, and also on Netflix's. When or if it ever has the ability to broadcast my football games (NCAAF, & NFL) it will get that last deserving STAR!", "verified": true, "helpfulness": "0/0", "author": "D1am0ndD@ve"}, {"rating": 5.0, "review": "Beats all the competition for accessing computer entertainment from your TV. Now, we need Google to make more services available.", "verified": true, "helpfulness": "0/0", "author": "Stephen L. Evilsizor"}, {"rating": 4.0, "review": "I play everyday to my daugther to show her favorite  TV program.It's easy to use and convenient. So I like it.", "verified": true, "helpfulness": "0/0", "author": "Myung seon Kim"}, {"rating": 5.0, "review": "I was very excited about this because I am a grand student and I watch a lot of documentaries and lectures on youtube. This gave me the ability to watch them on my 42 inch HD TV not just on my tablet and laptop! Simple to install, it was up and running in a matter of minutes. I am not very tekkie but I was able to set up my laptop and my tablet to run the Chromecast in a matter of a few minutes. We cut the cable cord at our house 2 years ago with the Roku now this just enhances our ability to enjoy \"free\" or cheap TV!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Book Fiend\""}]