[{"rating": 5.0, "review": "If you're thinking about purchasing a Google Chromecast, make your purchase today as this is my 3rd Chromecast that I purchased - One for every TV as it is a must have product. You can't beat $35 and stream most of your favorite content. I have my power cable plugged into the outlet instead to the USB port on the TV as this allows me to turn my TV on once I hit the CAST button on my phone/laptop.I also had multiple people at my house all casting content from youtube to my TV to listen to favorite music videos and such. A must have.", "verified": true, "helpfulness": "0/0", "author": "Ruslan Parsegyan"}, {"rating": 5.0, "review": "It does what it says it does, easy to set up and use, and cheaper than a smart TV,While the selection of what it can stream seems limited, I am looking forward to other websites joining in on the action.", "verified": true, "helpfulness": "0/0", "author": "Aaron Hendricks"}, {"rating": 5.0, "review": "Am a big fan of You tube and love to watch it on my large screen TV. Had to use blue ray player before  with moving cursors that was  not user friendly. This product works great with you tube and using your cell phone to search things of interest. Fits my needs perfectly.I really don't care much about other features like netflix. And for $35.. what a great deal!!!", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 2.0, "review": "I must be a dope.  I bought this mostly to figure out what it is and what I was missing.I already have a roku and netflix.  What was I thinking?  I can watch youtube on my tv now.  So what?", "verified": true, "helpfulness": "0/3", "author": "TechGuy \"tech1664\""}, {"rating": 4.0, "review": "Took me a while to decide if I should own a Chromecast and I should have waited longer. The current bad news is limited compatible app availability and it should be much broader by now. Kind of takes the fun out of the device as not much to play around with. While this cannot be directly compared to a Roku box, the Roku is far more enjoyable, feature rich and easier to use, especially with their current smart phone/tablet apps.The good news is that the Chromecast quality is excellent and streams better than a basic full PC I have hooked up. Its really an amazing device.  There is a bright future ahead for this item. For the low price, I will not be retuning it as it just may catch my interest again when it becomes more established.", "verified": true, "helpfulness": "0/0", "author": "angfern"}, {"rating": 5.0, "review": "This thing is awesome. It is fast. It never lags while streaming videos, and the video quality is totally perfect. It runs 1080p without a problem.", "verified": true, "helpfulness": "0/0", "author": "John Smith"}, {"rating": 4.0, "review": "I like it.  I'm not sure if I would purchase it again compared to a Roku.  The device works without issue, for the most part, and was easy to set up.The biggest issue is the 3rd party apps that you are required to use.  Not all of them function that great at this point.  The netflix one sometimes presents difficulties with navigating around, for example.  Not a big enough inconvenience to really trouble me, but it may just be easier to get a dedicated device next time, like a Roku.", "verified": true, "helpfulness": "0/0", "author": "Beacon"}, {"rating": 5.0, "review": "This is such a game changer!  I absolutely love casting music to this when cleaning up around the house (and the sound is so much better than using my headphone output on my phone to the surround sound), or casting videos whether from YouTube or Netflix.The controls are nice, and it sits tucked away behind the TV.  I can't wait to see what Google does next!", "verified": true, "helpfulness": "0/0", "author": "Demiurgous"}, {"rating": 5.0, "review": "This cheap little baby makes any TV a smart T.V. I'm blowen away, by how easy it is to use & it works really well.", "verified": false, "helpfulness": "0/0", "author": "Shimmy"}, {"rating": 5.0, "review": "Most used device in my home.  This is awesome because its all over wi-fi and uses really the only 2 major programs I watch Netflix and youtube.  I heard they should be getting more apps for this soon.", "verified": true, "helpfulness": "0/0", "author": "Jodi L Walters \"sonixgirl77\""}]