[{"rating": 5.0, "review": "Great product. Easy to setup and easy to use. I was very impressed with the picture quality as well. I defiantly recommend purchasing.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 1.0, "review": "If you think that you will be able to surf the web while simultaneously watching the web pages on your tv think again! It doesn't even work with my nexus7. Pretty useless at this point.", "verified": true, "helpfulness": "0/1", "author": "Dean"}, {"rating": 5.0, "review": "That's amazing and good price when you want to buy it don't be late buy now and enjoy with it", "verified": true, "helpfulness": "0/0", "author": "mohammed alazmi"}, {"rating": 4.0, "review": "Easy small and streams from your smart phone works great can carry it in your pocket and take it with you anywhere", "verified": true, "helpfulness": "0/0", "author": "Lolo"}, {"rating": 5.0, "review": "It is working perfectly and easy to use also it very friendly to deal more over it is working shifting automatically for its HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Qusi Al Salman"}, {"rating": 5.0, "review": "I bought one of these initially for a small bedroom tv, and ended up liking it enough to buy them for the other tv's in the house. There's not as many apps out there as I'd like, but more are supposed to be on the way. Also, when doing initial setup from my Chromebook laptop, it refused to connect to my wifi. I switched over to my tablet Chromecast app, and was up and running in 3 minutes. I can pull up Netflix and Youtube on other devices, but I like the simplicity of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "VanDammage \"Hi. Would you like a roundhouse kick to the throat?\""}, {"rating": 4.0, "review": "After reading numerous reviews- thank u amazon reviewers! It was really helpful! However, I of course still ran into some issues and it wasn't quite as easy to install like I thought. However, I have been using it lately and love it on my big screen tv and still utilizing the ipad. I only wish there were more apps to support it. It is limited in what I am able to use it for. I have been using it on net flicks and at times it freezes so I am unable to fast forward like I love to do! But overall love the concept and for a third of the price of a roku or Apple TV...and so small... It's still worth it.", "verified": true, "helpfulness": "0/0", "author": "Bella \"Bella\""}, {"rating": 4.0, "review": "Google has a great product but compared to my Roku it doesn't do it. a lot of the streaming is interrupted and you have to wait and leave your pc on when watching. I just feel like it is a hassle to go back in forth to the pc to change to the next video , yes you can put chromecast on your phone but some of us do not have the luxury of having a smart phone.", "verified": true, "helpfulness": "0/0", "author": "rammer"}, {"rating": 5.0, "review": "for the price you can't go wrong, some very nice features, even though my google tv and/or xbox already do most of them, but i also can't take those with me whenever i go, i mean not that i haven't tried, but people give me odd looks when they see me carrying a 60\" tv around, i mean it won't be long until our phones are that big, we'll see who will be looking weird then. perhaps its biggest most useful feature is also its weakest one - the chrome tab streaming, this has huge potential but it's very laggy, they need to work more on this, hopefully it will be out of beta in the near future as that is going to be the real kicker and differentiator, they also need to get it working on the android chrome, and while at it make android screen mirroring, then this device will be golden, man, i should work for google, or something.", "verified": true, "helpfulness": "0/0", "author": "com"}, {"rating": 2.0, "review": "This little device works absolutely great for watching things in 10 minute increments. After that, do not bother. If you're using it strictly for sharing short clips on YouTube, then it's perfect. But for anything longer than 10 minutes, expect pauses, drops, resets, and a viewing experience far longer than you actually anticipate.I found no documentation on how to get past the ten minute blues, just suggesting resets for my router. Resets done, chromecast still being persnickety. This has the potential to be a great device. It's just not there yet. I really hope Google straigtens this out, because honestly I would love to see it work better.Apps used: Netflix, HBO Go, YouTube, and casting straight from a tab.", "verified": true, "helpfulness": "1/1", "author": "RH"}]