[{"rating": 4.0, "review": "Faster than AppleTV 2g.It works good, play big data files.", "verified": true, "helpfulness": "0/0", "author": "Kang Sung Joo"}, {"rating": 3.0, "review": "It's a great piece of kit but I don't think it's reached it's potential just yet as there's no hbo go app and would like to see the broken sword games on there as well, hopefully over the next 6 mths it will just get better and better! The prime service needs to stop charging for the older films which should already be free to view within the prime subscription!", "verified": true, "helpfulness": "0/1", "author": "Ry"}, {"rating": 5.0, "review": "Awesome platform, excellent performance, very sturdy/durable body, remote is simple and to the point as well as flawless connection. I love this thing and the speed is amazing.", "verified": true, "helpfulness": "0/0", "author": "michael reeves"}, {"rating": 3.0, "review": "I had a roku 2 before and compaired to that the firetv is lightning fast. netflix and hulu Works well on it and also has great speed.Its easy to use and set up, and the remote has a really nice feel to it. Whats not so great is the lack of apps/channels like vudu, Blockbuster and M-go. The voice search only Works with amazon prime stuff and not plex, netflix, hulu basically everything not amazon. You get the feeling that competitors to Amazons own instant tv service is welcome on the firetv, as long as they dont outshine Amazons own services. Plex on the firetv is constantly crashing and there doesnt seem to be any uodates for it. Simple stuff as a screensaver is not available, unless you use amazon cloud service and upload Pictures to it. Overall i have to say i feel limited on the firetv, a feeling i never had with roku. So in conclussion, Ive already ordered a Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Dane"}, {"rating": 5.0, "review": "Great Item!", "verified": true, "helpfulness": "0/0", "author": "Morris Monroe"}, {"rating": 5.0, "review": "Love it , easy to use and set up ,even the youngest child is using it.", "verified": true, "helpfulness": "0/0", "author": "Gloria Brooks"}, {"rating": 4.0, "review": "Many, many first season AMC, HBO, Show-time, NPR, and other original tv series, movies, documentary listings to choose.Fairly easy DIY set up, IF YOU HAVE THE CORRECT HDMI CABLE, WHICH YOU MUST BUY.Good price.  Having Prime Time membership adds to free fun.  However, if one has been TV -ADDICTED for sometime, then there's  a chance you've seen these shows already.  The thrill is gone, so to speak.  Still if you enjoy being reminded why you saw a performance in the first place, AMAZONFIRETV will be a satisfactory purchase.  ALSO IMPORTANT device is tiny and fits unobtrusively, nearly invisible on a nice dresser - - looking like a small jewel box, not a 'receiver'...", "verified": true, "helpfulness": "0/0", "author": "Lee David \"S.Lee David\""}, {"rating": 3.0, "review": "Nice but still lacks content compared to Roku.", "verified": true, "helpfulness": "0/0", "author": "M. J. Ritter"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "7mto"}, {"rating": 5.0, "review": "Great investment. Minor flaws: Could use an easier way to reset cache/clear ram. Add bluetooth connectivity with keyboards or something similar. Need more apps and games!!! Other than those, superb product,", "verified": true, "helpfulness": "0/0", "author": "Kevin Arce"}]