[{"rating": 5.0, "review": "This little dongle just made my life so much easier! Previously, we could only get Netflix through our wireless DVD player and we only had that on one TV in the house. Also, when streaming through the DVD player, it would take FOREVER to load and would constantly bump us out while we were watching. We have 8 people (5 kids) living in our house and we have ordered 3 Chromecasts for the various TVs. We don't need to search for a remote because everyone either has a Kindle, smartphone, Nabi, or iPad. Last night, I even pulled up a video on YouTube to show someone something effortlessly. I love that we weren't hunched over an iPad to watch it. Installation of Chromecast is super-simple and since I have subscriptions to HuluPlus, Netflix, and Amazon Prime, I am planning to cancel my cable and get a digital antenna. We can watch everything besides the local news with these apps through Chromecast. This will save me approximately $1,400 per year.", "verified": true, "helpfulness": "0/0", "author": "Sharz"}, {"rating": 5.0, "review": "exceeded all expectations , and provided us with freedom from high cable costs. I cant wait to see what else they come up with.", "verified": true, "helpfulness": "0/0", "author": "julia williams"}, {"rating": 1.0, "review": "I expected to work at the bedroom's TV but as it is far from my computer, it doesn't work at all . I could only use it for the TV that is close to the computer.", "verified": true, "helpfulness": "2/6", "author": "Clara Strachman"}, {"rating": 5.0, "review": "Easy to install, and I was watching Hulu plus in minutes! Unlike the photo shows you, though, it does have to be plugged in, but that wasn't a deal breaker for me. Another thing: while it's still in the beta process, for you to stream any videos you have in your computer library, they must be mp4 video or mpeg4 videos. Annoying! Hopefully they will fix it soon, because for everything else, this little guy is a game changer", "verified": true, "helpfulness": "0/0", "author": "Anna C. Silva"}, {"rating": 5.0, "review": "I recently suspended my DirecTV service and now I use my Chromecast to watch TV off of the internet. I also use it to watch most video content off the net. I look forward to the New apps that will be coming out very soon to make this device even more exciting. You can't beat the value for what this device can do for the money..", "verified": true, "helpfulness": "0/0", "author": "D. Leyton"}, {"rating": 3.0, "review": "By the time you set this up and use all the round abouts to cast pictures or videos you end up spending more if you include your time.  Cheaper and more consistent for Apple TV or Roku when you include your time and effort.", "verified": true, "helpfulness": "0/0", "author": "BA400"}, {"rating": 4.0, "review": "Works great with netflix. It would be perfect if it streamed all media as fast as the ones it is set up for like hulu and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Parker Hudson"}, {"rating": 4.0, "review": "Would like it to connect to more applications like VLC or accept local file streaming. But has become handy for doing presentations and viewing youtube.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Able to stream Netflix moves off my cellular phone to my 73\" television. Works great with no lag. Would purchase again.", "verified": true, "helpfulness": "0/0", "author": "jberry"}, {"rating": 5.0, "review": "answered all my expectations. works smoothly (depends on your WiFi so it's your responsibility too but...)still waiting for google to add more apps", "verified": true, "helpfulness": "0/0", "author": "Yair S."}]