[{"rating": 2.0, "review": "Very difficult to connect, even when you have the listed compatible router.", "verified": true, "helpfulness": "0/1", "author": "Walter E."}, {"rating": 5.0, "review": "Works perfect with my HBO go, which is why I bought it. Only 1 random reboot in 9 months of using it.", "verified": true, "helpfulness": "0/0", "author": "Nikki Keeler"}, {"rating": 5.0, "review": "Works Perfectly with my Tablet or my Google Chrome Browser. ..delivery was on time, thanks to Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jim Horvath"}, {"rating": 3.0, "review": "This is not good for two reasons:1. needs USB power? HDMI can provide power.2. needs to be controlled via a wifi network rather than speaking directly with your device. This interaction is often blocked on hotel wifi networks (if you can get it to connect in the first place), so good luck using it on the road. Doesn't work well with wifi networks that require web authentication.", "verified": true, "helpfulness": "0/0", "author": "Cam"}, {"rating": 5.0, "review": "The best $35 you can spend on a media streamer.  I have two for both my private and my house's TV.  Using Plex with this is amazing, but people like to stream their phone screens too.  It's well used.", "verified": true, "helpfulness": "0/0", "author": "Freshgrease"}, {"rating": 5.0, "review": "One of my favorite toys, books in the web can help to do a lot of interesting things.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Rarely works more than blurry images. Delivery was great though", "verified": true, "helpfulness": "0/0", "author": "Alexander Dunlop"}, {"rating": 5.0, "review": "Best thing ever! It works like a charm and was super easy to install! Any issue we have had with it have been operator error!", "verified": true, "helpfulness": "0/0", "author": "Anne Jenkins"}, {"rating": 3.0, "review": "ScreenCast feature is very buggy at this time", "verified": true, "helpfulness": "0/0", "author": "rlopez"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Menashe Ben-David"}]