[{"rating": 5.0, "review": "Hooks directly into the hdmi port on the screen and you can connect the USB power supply to either the wall socket or the USB port on your tv. It turns the chromecast on/off when you turn your tv on/off which is really streamlined and requires less steps to go from zero to streaming he internet onto my big screen tv.HBOGO is my most used app and it streams to my tv's maximum potential in terms of clarity and smoothness. I can control the app from my ipad mini which acts as a remote.  If you have a pc or laptop you can stream any tab from the chrome browser directly to the tv.  Right now iOS is restricted to a dozen or so apps including Netflix and YouTube.It's honestly a great product.. One I'm excited about enough to actually compose this product review. Quick setup, efficient and easy use for a slick upgrade to any entertainment system.", "verified": true, "helpfulness": "0/0", "author": "\"Gob Bluth\""}, {"rating": 5.0, "review": "This \"JOY\" is the greatest device. Easy to set up. I can now CAST  to two different tv sets. {I bought 2} I would recomand Chromcast for every one.", "verified": true, "helpfulness": "0/1", "author": "Allan Brisker"}, {"rating": 4.0, "review": "the product is everything I expected. the only disappointment I have was the time it took to get the product to me. With the lost of the first unit. the second one was delivered to me .", "verified": true, "helpfulness": "0/0", "author": "Richard sweet"}, {"rating": 5.0, "review": "This is a great product that gets better every update. I highly recommend this,  it's great for Netflix, YouTube and anything you can view in your chrome browser.  I stream movies all day. Make sure you have a good wifi router.One other note,  with devices like this it's easy to stop watching network tv. I didn't watch network tv for over a month.  Next step is building he entertainment pc and cutting off the cable tv.", "verified": true, "helpfulness": "0/0", "author": "Concerned Shopper"}, {"rating": 5.0, "review": "Think of it: a device not much bigger than a USB memory stick that plugs into your TV, connects to your wireless network, and allows you to use virtually any other device on your wireless network as its remote control.Stunning.", "verified": true, "helpfulness": "0/0", "author": "David R Burrows Jr"}, {"rating": 1.0, "review": "What junk!  Everything says you can stream your desktop and browser to your TV.  No it does not allow you to do this!  It may have used to allow this to be done, but the current version is nothing more than another big brother controlled streaming player.  I guess if I really want to hook up my PC to my TV, I'll be running some long HDMI lines.  You have been warned!!!", "verified": false, "helpfulness": "0/1", "author": "Skeeter Hater"}, {"rating": 5.0, "review": "Purchased this to watch missed episodes of Braking bad and movies. Easy to install and nice for the winter months when stuck inside!", "verified": true, "helpfulness": "0/0", "author": "GAD"}, {"rating": 4.0, "review": "Got this as a Christmas gift for my boyfriend. He absolutely loves it.That's really all there is to say.The only thing I would say is, it sucks that it only works for sites like Netflix and Youtube. You can't put your screen on the tv if you were watching a movie on your VLC player.", "verified": true, "helpfulness": "0/0", "author": "Walida Hassan"}, {"rating": 5.0, "review": "Another great product.  I hate watching You tube and other Videos on little screens.  This inexpensive product allows me to watch all Videos on my big scree TV.  It also, allows us to watch Netflix and other Movies Apps as well.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "R. Lamkin \"Tony\""}, {"rating": 4.0, "review": "A friend of mine suggested this product to me. i saw it at his pale when I visited him.I like he ability to stream the videos to the big screen TV.It would be nice of I could stream what is on my laptop screen to the TV as well so I could also display other stuff like the spread I am working on.", "verified": true, "helpfulness": "0/1", "author": "Mohammad Z Khan"}]