[{"rating": 5.0, "review": "wow thats a lot of intertainment in a tiny package, love the voice command. i was able to get rid of my computer that i was using as a media center . easy to use and very intuitive menues.... thank amazon", "verified": true, "helpfulness": "0/0", "author": "GARY WYNN"}, {"rating": 5.0, "review": "Sure beats the crap out of cable TV. An excellent alternative to Cable TV.Looking forward to using it more frequently than other forms of entertainment", "verified": true, "helpfulness": "0/0", "author": "Robert T. Luke"}, {"rating": 1.0, "review": "my modem is 6 ft. away from my fire tv and the wi fi reception is very good but it will cut off every couple of minutes,then couldn't even download anything.i'll rather wacth prime videos and Netflix on my computer or hook the cable from my computer to mu tv.waste of money and no is not my internet service my kindle works just fine 30ft away.", "verified": true, "helpfulness": "3/3", "author": "a boyscout"}, {"rating": 4.0, "review": "First off.  It works great.  Easiest device set up I have ever seen.  You plug it in and it shows you a how to video and you're done.  Even your account is already set up.  It's very fast, and I had a lot less lag then when I was using chrome cast.My one grip, is that the voice search ( which works REALLY well ) only searches amazon.  Xbox 360 has this same kind of functionality but it searches not only the microsoft digital movie store, but netflix, hulu, and whatever other services are available.I understand they want this to be a cash register for the store, but this is not a free device and amazon is not where ANYONE that I know primarily watches content.", "verified": true, "helpfulness": "2/2", "author": "Joshua Barrett"}, {"rating": 3.0, "review": "I really like the UI and the speed compared to my Roku, but having no way to browse Prime content is a huge pain.", "verified": true, "helpfulness": "0/1", "author": "Erik N."}, {"rating": 5.0, "review": "Love It...easy to use...having Amazon Prime is a plus...cost is definitely a plus. Speak feature works wonderfully. Again...Love it! YES!", "verified": true, "helpfulness": "0/1", "author": "P. King \"pmk\""}, {"rating": 5.0, "review": "This device my amazon Fire TV has proven to me to be one of the best. I invest in a great product. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel J. Pittman Sr"}, {"rating": 5.0, "review": "We have used this almost exclusively since we bought it. It has a ton of ways to enjoy so many movies an shows. We also love how portable it is. We travel frequently between two homes in two different states and take this with us so we don't have to keep our satellite or cable TV service active when we are not always there to use it.", "verified": true, "helpfulness": "0/0", "author": "C. Thomas"}, {"rating": 5.0, "review": "THIS DEVICE IS SO MUCH EASIER TO USE. I AM REALLY ENJOYING ITS FUNCTIONALITY. I JUST TELL IT WHAT MOVIE I WANT TO WATCH OR WHAT GENRE I'M INTERESTED IN AND IT RESPONDS QUICKLY AND ACCURATELY. I WOULD RECOMMEND IT TO ANYONE WHO DISLIKES TYPING ON THE SMALL KEYPAD THAT ARE USED BY SOME OF THE OTHER DEVICES.  THE CONVENIENCE IS WELL WORTH THE PRICE IN MY BOOK.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love love the amazon fire TV. Finally something I can maneuver! I also am no techie but this is so easy. I set it up myself. I highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Renee C. Lennon"}]