[{"rating": 5.0, "review": "Working well. Our second Chromecast .. Good ..", "verified": true, "helpfulness": "0/0", "author": "sp"}, {"rating": 1.0, "review": "I have had chromecast for a year now and have concluded it is garbage.  I have gone through 2 different chromecast units during that time and both had the same problem.  They both seem to overheat and stop functioning properly. The only fix is to unplug them and wait a minute or two then plug them back in.  This is frequently required, at least 2-3 times a week.  Devices should not overheat so often.  No one would be happy with this happening to their car, computer or tv.  It's very frustrating.Also there are many tv apps that seem to be incompatible with chromecast.  if is not going to be supported by all tv apps then it's useless.", "verified": true, "helpfulness": "1/1", "author": "Mr Who \"Tripwire\""}, {"rating": 5.0, "review": "Awesome sauce!!", "verified": true, "helpfulness": "0/0", "author": "Steven Smith"}, {"rating": 3.0, "review": "pretty cool product.  A little touchy, and doesn't work well with Amazon, but is nice when it works.", "verified": true, "helpfulness": "0/0", "author": "vince lombardi no? \"Frustrated with Sansa\""}, {"rating": 5.0, "review": "I don't have satellite anymore because of this thing", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "we love it", "verified": true, "helpfulness": "0/0", "author": "A. Summerlin"}, {"rating": 5.0, "review": "We have only been using chromecast for a short time but love it. It has replaced our laptop that was hooked up to the TV as we can place all the apps and features we had on the laptop into our chromecast! For the small amount we paid for the device this is highly worth every penny!", "verified": false, "helpfulness": "0/0", "author": "Carly Haden \"Carly Haden\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "randy hernandez"}, {"rating": 5.0, "review": "This is the best way to get content from your tablet, phone, or laptop up onto your TV screen.  I absolutely love it.  I have never had an issue using it at all.  Very easy to set up and easy to connect to.", "verified": true, "helpfulness": "0/0", "author": "Aaron Hushagen"}, {"rating": 5.0, "review": "Awesome product. Sometimes heats up resulting in video stream lag. It can get very hot if left plugged in which I continue to do regularly without major issues.", "verified": true, "helpfulness": "0/0", "author": "Kgg5"}]