[{"rating": 5.0, "review": "i bought the chromecast with the specific intention of using it to stream from my nas media library. i waited until recently to get one because i wanted to make sure the android apps were available to meet my needs. as it turns out, i found two apps to do this perfectly: NAS Cast ($1.67) and LocalCast (free with paid ad removal). now i can stream all my local content without having to fire up the ps3!as an added bonus, i received my chromecast on the first day of the coachella music festival, which was streamed live all weekend on youtube. using my chromebook, i cast the youtube live feed to the chromecast and enjoyed free, live music all weekend!ok, bottom line. everyone interested in a chromecast has a pretty good idea of what it can do. with the potential of this device, the price tag makes it an easy choice over roku, wd live, or appletv. i'm considering adding one of these to every tv in my house! the cost of a couple more is about the same as i used to pay every month for cable tv, and with the ever-increasing compatibility of the chromecast with media sites and services, this thing could very easily become the main media delivery device in my home.", "verified": true, "helpfulness": "1/1", "author": "Tim Wachter"}, {"rating": 5.0, "review": "I love this thing, doesn't fall short in any way. any IOS device can cast videos to this and with apps like Plex I'm able to send videos to any tv. The best part is that I don't have to navigate with a remote and type in my password with one of those awful d-pads. I stay signed on my phone and I can send it to the tv. I can cast music from google play music (music I uploaded to google servers (no monthly fee)) pandora or any other app to the tv within seconds. It's so freaking simple I'M IN LOVE WITH IT! This sends the url of the media to the device and the chromecast pulls it from the internet. So If you want to watch a youtube video you found on your phone you can start it then turn off your phone. The video runs as smoothly and clearly as you internet connection allows. It isn't choppy and blurry like you would see with an apple tv. set up takes no time at all and it's so simple to use. Couldn't imagine how this thing could be improved. All sorts of apps are coming out with chromecast support. This KILLS all other media devices.Keep in mind if you plug the usb in with the designated power adapter (so that the chromecast is constantly recieving power) (and if your tv is compatible with this feature) when you connect to the chromecast (tv off) on whatever device, the chromecast won't only turn on the tv but change to the correct video input.Anyone that gives this a bad rating has their own issues.I recommend this to absolutely anyone!", "verified": true, "helpfulness": "0/0", "author": "Bryce"}, {"rating": 3.0, "review": "It works fine, and despite all the reviews I read it was not the easiest thing to set-up. There were no instructions just follow the on screen prompts however if you think it is going to take 5 minutes think again. More like 30-45, after it updates itself and says your router is not configured correctly. I had to do nothing to my router and it all of a sudden started working even though it said it could not earlier in the set-up process. Either way it works fine, however the issue I run into is; I leave the room while a show is playing. Then when I come back into the room the show is over, when I go to the iPad or iPhone they are no longer connected to the Chromecast but the shows are still playing on the t.v.. The only way I have figured out how to get them to snych again is to turn off my iphone or ipad. If this is required everytime I leave the room I will eventually stop using this as this is tedious. If anyone has a suggestion to this problem please post. An answer would not be \"Don't leave the room\". ;)", "verified": true, "helpfulness": "0/0", "author": "Nick W. Peters \"helpmehelpu\""}, {"rating": 1.0, "review": "S*** device. Roku and Fire HD are much better streaming boxes they have channels and remote and my wife can use it with no tablet or smartphone required.", "verified": true, "helpfulness": "0/0", "author": "zachary j widener"}, {"rating": 4.0, "review": "The main reason I bought it because I want to use my iPad to stream videos from Vimeo, and other web. Too bad that it still not yet support on both stand-alone Vimeo app and via Chrome browser. If you want to do something like me you might have to go for a laptop instead and play those via Chrome.It is quite a misleading for somehow when you saw their promo video and think you can use iPad stream any video via Chrome app.", "verified": true, "helpfulness": "0/0", "author": "yota sampasneethumrong"}, {"rating": 4.0, "review": "works great superb picture and sound but..after playing with it a little bit I notice there was a \"scratchy\" (static) sound. I have notice this while playing youtube videos both on my windows 7 pc or on my youtube app on the Ipod 4th gen or Android phone. The first video always plays fine however when I star to play the second video the \"scratchy\" (static) sound starts. The video quality is great. I tried connecting the chromecast to its own outlet separate from the power strip where the router is plug in to but that did not work. The only way to get rid of the scratchy sound is to switch sources on my hdtv. For example the chrome cast is on hdmi 2 so while the video is playing If I switch to hdmi 1 then back to hdmi 2 the scratchy sound is gone. Any ideas why this happens?", "verified": true, "helpfulness": "0/0", "author": "Alex Magana \"Alex Magana\""}, {"rating": 5.0, "review": "Very good device.very easy to configurate and use.I recomend it.If you like watching vídeos in your big screen", "verified": true, "helpfulness": "0/0", "author": "Alberto Ferrera"}, {"rating": 1.0, "review": "I can not believe how bad this device is, it takes forever to work, if it works.  I have tried this device on multiple TVs and routers.  Do not buy.", "verified": true, "helpfulness": "0/0", "author": "Jesse Davidson"}, {"rating": 4.0, "review": "I found this a bit awkward when switching networks or in situations where multiple are available. Definitely needs more apps.", "verified": true, "helpfulness": "0/0", "author": "Susan Bickford"}, {"rating": 2.0, "review": "great device for the applications it has and for when it does connect and work.  price is great, easy setup, but the connection is not strong.  even when it is right next to my router, sometimes the other devices show that no cast devices are present or detected.  when is works, it's a nice feature for phones and tablets and even youtube, etc.  but most of the time, no cast devices are detected so it sits there unused and i wouldn't try to bring it out in front of company.  would want to use it for travel but if the devices are not on the same wifi network or if you have to use guest access like at a hotel, you are out of luck.  looks like i'll be getting another android tv stick which has all the applications features and capability of phones and tablets for just a little bit more in price.", "verified": true, "helpfulness": "1/1", "author": "Charles06 \"Don't complain if you don't act.\""}]