[{"rating": 5.0, "review": "Love this so easy to just fling vids from my PC, Tablet or phone...", "verified": true, "helpfulness": "0/0", "author": "I.M."}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "rashid"}, {"rating": 4.0, "review": "This is a pretty cool little doo-dadIt is not as plug-and-play as the description might have one believe.I consider myself to be very 'techy' and internet savvy, yet I had some challenges getting the device and my network to talk. Getting it plugged into the tv took some body contortion, a flash light, and a few cuss words - the tv is mounted on the wall in a corner, so gymnastics were involved.Once all appropriate cords, etc. were connected, then I attempted to run it through my cell phone. The process rather was annoying, to say the least - but it can be done. The biggest problem for me was trying to navigate apps on a 5\" screen.I found I had the most success/least frustration when I brought my laptop into play. I especially wanted to be able to use my Amazon Prime membership to watch tv shows and movies - and the phone wasn't able to 'cast'. ChromeCast does NOT have an Amazon app. I wonder why. Oh, because they want you to BUY your movies and tv shows from them (didn't notice any free offerings.)However, the laptop was able to cast Amazon with no problem once I got the casting extension installed on Chrome.I would have given it five stars except I found the set-up process to be a bit cumbersome.I can't imagine how someone not very familiar with computer and internet technology would deal with this, but the average 'nerd' (like me) will do well with a little persistence!", "verified": false, "helpfulness": "0/0", "author": "Susanne \"Wyoming Diva\""}, {"rating": 5.0, "review": "Best ever", "verified": true, "helpfulness": "0/0", "author": "OLUSESAN"}, {"rating": 5.0, "review": "This thing is awesome. I use it all the time, I had to buy one for my mom because she took it out of my tv to use at her house.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 4.0, "review": "Chromecast is great once you get it to run. The installation instructions are confusing, misleading, incomplete. I tried for several days to get it to work. Once I succeeded, it is fine. I reduced the rating because it was so difficult to get it setup. If that was solved I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Robert Campbell"}, {"rating": 1.0, "review": "Did not work at all with my TV. Although my computer connects well to our Wi-Fi network, Chromecast support informed me after giving the error messages I described that Chromecast has weak signal strength compared to a laptop, and unlike a laptop they suggests it needs to be within 20 feet of the router. When I tried it on a second TV 16 feet away it works fine, but do not expect it to connect to your Wi-Fi network if the TV is significantly further than 20 feet away as my second TV is. It certainly does not work on my TV 60 feet away from router. I do not intend to find out what the maximum distance is. This is a wonderful product, but buyers should be aware of this limitation when purchasing it for a specific TV.", "verified": true, "helpfulness": "0/2", "author": "Benson M. Curtis"}, {"rating": 4.0, "review": "Very easy to install and works great!", "verified": true, "helpfulness": "0/0", "author": "Francisco Pataro"}, {"rating": 2.0, "review": "Couldn't get it work with my Verizon router!", "verified": true, "helpfulness": "0/1", "author": "Arthur M. Rosenberg"}, {"rating": 5.0, "review": "Best technology $35 can buy.", "verified": true, "helpfulness": "0/0", "author": "Greg Freeman"}]