[{"rating": 4.0, "review": "I got a Nexus for my mom last Christmas and decided to get her this too so she could play things on the tv. Works really well with playing movies from Google Play, Netflix, and playing videos from YouTube. My mom really likes the screensaver too and keeps it on the screen when no one's watching tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was fed up with cable, satellite because of the commercials that constantly come on. I bought one for the living room and one for the bedroom and use with Netflix or You tube all of the time. I am able to shoot videos of the grandkids and project it on my TV with the Avea app.", "verified": true, "helpfulness": "0/0", "author": "Mike Adams"}, {"rating": 5.0, "review": "I really like the chromecast.  I was skeptical at first, but the fact that you can use it on a chromebook or phone makes it a winner", "verified": true, "helpfulness": "0/0", "author": "Michael W. Laing"}, {"rating": 3.0, "review": "It's just dumb to not allow Apple i-devices to broadcast Safari directly to Chromecast. Who opens a browser from a PC to the TV?", "verified": true, "helpfulness": "0/0", "author": "Regular buyer"}, {"rating": 1.0, "review": "Based on the reviews, I'd say I'm in the minority here, and perhaps my Chromecast is actually defective. But I know that many other users are having trouble streaming Netflix, which is promised to work. I became so fed up with the thing that I decided to return it, but I'm a charitable man, so I decided to give it one last shot, and guess what? Now it works not at all!!! Garbage. It also doesn't support Amazon Prime, which I was aware of when I bought it, but since it doesn't work with Netflix either (when it's working at all) I feel it's to be avoided. I would suggest that people shell out the extra dough for the Amazon Fire apparatus, which will play many things, including Amazon Prime.****As an addendum, let me say that I gave this several more chances--it works some days and not others, and I need to set it up from scratch every time I try to use it. That being said, it appears to work well for a great many people, so give it a trial run and perhaps you'll be delighted. If not, send it back.Best wishes, all.GF", "verified": true, "helpfulness": "0/0", "author": "T. Peterson \"TJP\""}, {"rating": 1.0, "review": "It wasn't clear to me that the apps had to be enabled with Chromecast feature in order to stream to the chromecast. I thought anything on phone could be streamed, but thats not the case (ads lead you to believe that). I have Euronews app on Phone and iPad, but the app doesn't have streaming to chromecast built in, so I cannot stream it to TV with cell phone. Only the limited number of apps (ie Youtube) can be stream directly. The options increase when using a PC since the chromecast option can be installed on your browser on PC versions, but I haven't see chromecast browsers on Android or iOS.", "verified": true, "helpfulness": "0/1", "author": "theKritik"}, {"rating": 1.0, "review": "I bought one and couldn't get it to work.  I returned it and all was fine.  I figured later on I'd probably done something wrong so I bought another one.  Same thing, couldn't get the thing to work at all.  It's just laying on a desk here if anyone wants to buy it.", "verified": true, "helpfulness": "0/1", "author": "jim burdette"}, {"rating": 5.0, "review": "Does what it says easily.  It was easy to setup and easy to use.  I love the simplicity with youtube, netflix and hbo go.", "verified": true, "helpfulness": "0/0", "author": "Eric McMinoway"}, {"rating": 3.0, "review": "This works as advertised on some devices.  However, be aware that not all operating system function with this and will error out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This product definitely does what it says. Very good quality too. Makes viewing in different rooms much easier. Worth purchasing.", "verified": true, "helpfulness": "0/0", "author": "dja"}]