[{"rating": 5.0, "review": "It's affordable and a great alternative to apple TV for individuals (like myself) who haven't necessarily bought into that ecosystem. Biggest plus for me has to be the ability for it to automatically switch the TV over to this input when you beam things to it! Very nifty and setup is also extremely easy (no idea how they id this!)", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 1.0, "review": "No directions that work correctly. still do not have it working. I receive picture but no sound. product support is not good", "verified": true, "helpfulness": "1/1", "author": "Suzanne Williams"}, {"rating": 5.0, "review": "Got this for my Mom after I had bought one for myself and she loves it.  Easy for her to use and low power consumption.", "verified": true, "helpfulness": "0/0", "author": "Frank C."}, {"rating": 3.0, "review": "The reason why i gave the rating to 3 is because of following pros and cons.Pros1) Work great with their supported Apps like Yourtube (ofcourse google money making product!), Hulu, Netflix etc..2) Viedo/Audio  quality is impressive3) Was able to hook up behind my QUMI Q5 projector to watch nice movies from Youtube and Netflix (supported apps) in HD.Cons1) Unable to stream properly from the other websites. There is lag in Video when movie is streamed from other web sites.2) Same problem in the Entire desktop sharing (beta feature) as well. This annoys the crap out of not able to broad cast saved movies from my laptop/Desktop.3) Only Few Projector take the input from this chromecast. Not sure if this has to do with HDMI port types. But this really annoys me from not being able to watch movies in my Theater size screen (10 Ft H X 26 Ft Wide , yes Imagine the size!) in my barn.", "verified": true, "helpfulness": "0/0", "author": "Thiagu"}, {"rating": 5.0, "review": "Anything you can watch in a browser can be broadcast to your TV. It does not seem to matter what device you use to browse. I have worked from smart phone, tablet, and laptop. Low resolution video that is passable on a small screen looks pretty bad on a large screen, but that is to be expected. For the price, nothing comes close to this device.", "verified": true, "helpfulness": "0/0", "author": "Warren Hallila"}, {"rating": 5.0, "review": "Product arrived on time, in good condition. As for the device, it works beautifully. Stream everything from YouTube, to Netflix and HBOGO. One feature I love is that you can start the stream from one device and pick it up on another, so I can start a movie on my phone and pause it or stop it with my tablet or computer, and interchange on the fly. This is possible because once a stream is initiated, it is not tethered to that device. The device you use to stream only points the chromecast to the actual media and the chromecast does the rest. So once a stream is started the device is no longer required to sustain the stream. This is great if your watching a long movie and your phone or tablet dies. The only potential drawback is your internet. I would bet that anyone who could use this has the internet quality to stream video no problem, but if your internet bogs down or is intermittent, you will see a substantial drop in quality, or possible unable to use this product. BUYER BEWARE, this products performance is 100% dependent on the quality of your internet connection! If you have a substandard connection, you will get substandard performance!", "verified": true, "helpfulness": "1/1", "author": "Josh Douglas"}, {"rating": 5.0, "review": "So convenient I bought two of these. Works with my pc, tablet, and phone. Hope they come out with some more apps. Maybe something to play my own videos", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very easy set up.works very good with You-Tube.Haven't used other features yet but am looking forward trying other Apps with Chrome Cast..", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 4.0, "review": "I bought three of them, but one of them I can't make it work.The others two working just fine...", "verified": true, "helpfulness": "0/0", "author": "Mauricio"}, {"rating": 3.0, "review": "I expected more, Google needs to develop more apps. Having an Apple Tv I think this falls short in comparison", "verified": true, "helpfulness": "0/0", "author": "Carlos Matias Figueroa"}]