[{"rating": 1.0, "review": "Will not work w/an Apple-based home network without dropping our firewall. No thanks.", "verified": true, "helpfulness": "0/1", "author": "kayakinmt \"kayakinmt\""}, {"rating": 3.0, "review": "I have a Roku 3 and now have a Chromecast.  I got the Chromecast so I could cast YouTube and mirror chromebook browser pages from my Nexus 7.  It works.  Sometimes it freezes up.  That is a real pain but I can live with it.  The mirroring is nice and it handles the audio well from webpages and YouTube.If you want to watch Netflix, the best platform is the Roku 3.  It is a great interface, it loads the video stream quickly and it doesn't freeze up like the Chromecast tends to do periodically.  Roku also seems to be less tied to the network you are on.  In other words, it's easy to move the Roku to another wireless network if you are at, say, a hotel or Grandmas place.  I think it would be a pain to try that with Chromecast .. I haven't tried it yet but it appears to be tied to your local network in your house.  If you want to cast or mirror stuff from a Nexus 7 android device, then Chromecast is your man.  If you want to watch Netflix ... Roku is clearly and completely superior.  I like to do both and so I got both.", "verified": true, "helpfulness": "0/1", "author": "KBK"}, {"rating": 4.0, "review": "Good item and I've compared it to the Fire Stick from Amazon. Google has 4GB and Fire Stick has 8GB. Both items are fantastic love watching  movies and enjoying the clarity of both. My favorite is the Fire Stick, though.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "excellent product.", "verified": true, "helpfulness": "0/0", "author": "Mick Pucc"}, {"rating": 2.0, "review": "I saw ads for the Chromecast and was very excited. However, getting it home, it gobbles up your wifi like nobody's business. My little router couldn't handle the pressure. Streaming would stop and start and go slowly. I ended up reverting to a long HDMI cable instead. That said, the instructions were very clear and easy to follow, setup was a breeze.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "super for streaming.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Reyes"}, {"rating": 5.0, "review": "Very Good, Very satisfied and will purchase again.", "verified": true, "helpfulness": "0/0", "author": "Kevin Hennelly"}, {"rating": 2.0, "review": "proseasy to set up/ usecan be used with current devicesconsdisconnects while playing music (this happened several times and it is annoyingnot alot of games or appsnetflix hardly works on this device not sure why i bought this", "verified": true, "helpfulness": "0/0", "author": "firefly2550 \"stacy\""}, {"rating": 5.0, "review": "We cancelled cable over a year ago and strictly use the Chromecast to watch our programming via Hulu Plus, Netflix, and a few others. We have one for each TV and have yet to run into any problems. We are anxiously waiting for it to accept more apps!", "verified": true, "helpfulness": "0/0", "author": "Kendra McGee"}, {"rating": 2.0, "review": "It is likely that my laptop lacks the power to stream things to my television, as it gave a poor picture, and the streaming often slowed down.", "verified": true, "helpfulness": "0/0", "author": "Frank B. Smith \"Finally, someone to read me bedtime stories again.\""}]