[{"rating": 5.0, "review": "All I wanted and expected from this little gizmo was a way to access Netflix on my bedroom TV.  That is exactly what I got!  My only negative comment is that I had to wrap the dongle in electrical tape because the little bright white light emanating from it lit up the bedroom once the lights and TV were turned off.  Simple fix.", "verified": true, "helpfulness": "0/0", "author": "M. Fredendall"}, {"rating": 5.0, "review": "Easy to install (simple plug-in to your TV HDMI USB) and fairly easy set up for untech types like myself. You must download the Google browser for it to work.  Love the choices I have now to stream onto our HD TV.", "verified": true, "helpfulness": "1/1", "author": "R. Keegan \"pyrobug\""}, {"rating": 3.0, "review": "Does what it's supposed to, most of the time. I use it for streaming flash videos to my TV. It works pretty well, however it has one glaring flaw. It only supports 2.4ghz 802.11n. I live in a condo and the 2.4ghz saturation is insane. Sometimes, I simply cannot use the Chromecast. The video will stutter and lose audio sync for a few minutes, before disconnecting completely. I understand, the device is pretty inexpensive, but no 5ghz it's a pretty big omission these days.", "verified": true, "helpfulness": "0/1", "author": "Shafnitz"}, {"rating": 4.0, "review": "really convenient product. don't have to leave laptop connected to tv no more. i can have my laptop on my lap and surf the internet on tv wirelessly. only thing it lacks is i can not do samething with iphone. with iphone i can only connect youtube and netflix. sorry can not connect chrome surfing to tv through iphone. .", "verified": true, "helpfulness": "0/0", "author": "Anan Patel"}, {"rating": 1.0, "review": "Worked for a very short period of time then just stopped. I managed to get it working once more after much effort and then it stopped again. By working, I mean connecting via Crome to my TV. I can see it on my TV, but it is constantly disappearing from my laptop. Too much effort to restart everything and trouble shoot every time I want to use it. This device is not ready for mass consumption yet, it a beta test / development product. Wait until they figure out all the bugs before purchasing.", "verified": true, "helpfulness": "2/3", "author": "Bill in CT"}, {"rating": 2.0, "review": "I didn't understand that I could not project my amazon prime movies form my computer to my tv with this device.", "verified": true, "helpfulness": "1/1", "author": "doctor g"}, {"rating": 5.0, "review": "Very easy to install.  Great alternative to subscribing to movie channels. YouTube videos are great to watch on a big screen!", "verified": true, "helpfulness": "0/0", "author": "mamalo0418"}, {"rating": 4.0, "review": "This works as advertised, which makes it very useful. However, there are times when it seems like I'm unable to control the volume w/ my phone, when the phone gets out of sync w/ the tv (so it doesn't show me the correct point at which I am in the video), and sometimes I am unable to turn the tv on w/ the phone.", "verified": true, "helpfulness": "1/1", "author": "Christopher W. Morris"}, {"rating": 4.0, "review": "Love it!  I have a 50\" Samsung DLP that I bought 7 years ago.  Being an older set it lacks wi-fi access.  I was considering upgrading to a smart TV so that I could stream video content such as Netflix, but with Chromecast I now have that ability for just $35, which beats the heck out of the cost of a new smart TV.  I would give the device 5 stars, but find that it crashes when powered by my TV's USB port.  I get flawless operation when I connect it to my house's AC current (which is the recommended setup) but there it becomes another \"energy vampire\" sucking power even when it's not in use.", "verified": true, "helpfulness": "0/0", "author": "M. CROUTHERS \"GAMEMASTER\""}, {"rating": 4.0, "review": "It was easy to set up, and works well with our Netflix account. We can start  a tv show or movie on my iPhone or iPad and easily switch to our flat screen.The only function that I wish it had is the ability to broadcast from my TV apps.", "verified": true, "helpfulness": "0/0", "author": "pastorbc"}]