[{"rating": 1.0, "review": "Not really what I expected. Apple TV much better. Chromecast very limited apps. You can only use youtube and Netflix in my country", "verified": true, "helpfulness": "0/1", "author": "HERMANN SEIDEL"}, {"rating": 1.0, "review": "Google Chromecast HDMI Streaming Media Player.  Google Chromecast HDMI Streaming Media Player  Audio and video not insync with each other.", "verified": false, "helpfulness": "0/0", "author": "Dennis Kirkey"}, {"rating": 3.0, "review": "When are you going to add the computer as a source of material that can be streamed?  Can you add Flixter?Thank you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Couldn't get it to stream itunes and the software was clunky and slow. The Apple tv box is wayyyyy better and it's 80 bucks!", "verified": true, "helpfulness": "0/0", "author": "andrew macdonald"}, {"rating": 4.0, "review": "Bought for son in law and he loves it, so much easier he said to watch movies etc. instead of watching from a computer.Kim from Clarkston", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 1.0, "review": "very few things work with this device. Plus it has several issues, I either get sound and no image of image and no sound.Google needs to work out their issues.", "verified": true, "helpfulness": "0/0", "author": "Paulo"}, {"rating": 5.0, "review": "The device arrived almost immediately /2 days after ordering!/.Installation was only 5 minutes, then the device started it's hard life as a streaming 'pump'. Even the firmware update was a simple and quick operation. Using ChromeCast is really as simple as pressing a button /even switching the TV set to the appropriate input source requires more buttons/.", "verified": true, "helpfulness": "0/0", "author": "Gabor Borjan"}, {"rating": 4.0, "review": "Works fine, easy to set-up and use. Would though ask for more APP's to use. All in all I've had a very good experience with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Michael Helm"}, {"rating": 5.0, "review": "It works as promise and easy installation!You can watch Netflix and control  it from you tablet or phone.great !!", "verified": true, "helpfulness": "0/0", "author": "Frans"}, {"rating": 5.0, "review": "Love it, I highly recommend this product. I can watch YouTube videos, Netflix, etc right from my TV using my cell phone!", "verified": true, "helpfulness": "0/0", "author": "Michelle Mazzucco"}]