[{"rating": 5.0, "review": "Have had it only for about one month, but I am very impressed with it. I have watch a lot of movies since I am a prime member and My wife and I love it.", "verified": true, "helpfulness": "0/0", "author": "retiredpc"}, {"rating": 3.0, "review": "I'm tempted by this little box, but Comcast in this area has bigtime bandwidth issues. Pixellated images and impromptu freeze frames while the feed catches up. And I'm not reading anything here about buffer capacity that might alleviate that. I even get that on HD broadcasts on the regular TV channels and I have to switch to the SD channels to continue watching. I've already tried Netfilx's streaming (my Blu-Ray player and my TiVo both can do streaming) and some movies have come through audio-only, so I gave that up. Whether you can have streaming at all is like that old sales cliché; it's all location location location.", "verified": false, "helpfulness": "0/2", "author": "R. L. MILLER"}, {"rating": 3.0, "review": "If you have amazon prime, why would you buy amazon fire tv? I read everything and I can't understand why this is more beneficial than amazon prime I'm assuming you wouldn't get the same benefits amazon prime offers.", "verified": false, "helpfulness": "2/9", "author": "Ronelle Chaverst \"pleased\""}, {"rating": 5.0, "review": "Great little device.  Very easy set up.....", "verified": true, "helpfulness": "0/0", "author": "C. Bertrand"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "neal brechlin"}, {"rating": 5.0, "review": "Like the Amazon Fire TV, especially the voice search.", "verified": true, "helpfulness": "1/2", "author": "james v holley"}, {"rating": 4.0, "review": "Good device", "verified": true, "helpfulness": "0/3", "author": "OP"}, {"rating": 5.0, "review": "All good.", "verified": true, "helpfulness": "1/2", "author": "Scott"}, {"rating": 5.0, "review": "great reception.", "verified": true, "helpfulness": "0/1", "author": "Gloria Reveron"}, {"rating": 1.0, "review": "should have waited for the price drop", "verified": true, "helpfulness": "1/19", "author": "Bill"}]