[{"rating": 4.0, "review": "EDIT (1/11/2014): I am bumping this up to 4 stars. Getting a stronger WiFi signal where the Chromecast is located drastically improved the performance of the apps on the iPhone/iPad and the whole experience. I can't stress that enough that this device is only a 4 or 5 star device if you have a strong WiFi signal in the room where you are using the device.Still not a 5 star device yet because it still too often has an app that won't allow you to pause/stop the content on the Chromecast for whatever reason (dropping signal, etc.) that forces you to stop, reopen apps and click around on the Chromecast button until the correct controls for the content appear in the app.ORIGINAL REVIEW:After using this for the first few days I have a few early impressions:1) You need to have a VERY strong WiFi signal for this to work smoothly.2) It is a clever device and easy to use and setup.3) The price was great.4) The firmware update took 20 minutes at least. Wow (might have been my internet).5) The streaming quality was very good and didn't buffer once it started playing (when I used it on a TV closer to my router).We only really use Netflix, YouTube and HBO Go (Amazon, too but until that is supported I will just watch that on my PS3 in another room). So for us the \"lack\" of supported apps was not a deal breaker.I was completely frustrated with the initial use of the product. I was trying to Cast Netflix from an iPad 3 and it made the entire app slow, laggy, and terrible. I kept getting errors saying that I need to keep connected to the same WiFi network at the Chromecast.... and I didn't disconnect! After reboots and restarts I kept noticing that the Chromecast was showing one-bar on my WiFi (I have 12 mbps but the WiFi is old and has lame range).Once I realized that I get terrible WiFi in the living room I made the decision to get a better wireless router. Hopefully this fixes the buffering and app slow-down issues I'm having with the Chromecast currently (when i put the Chromecast on the TV in the room with the current WiFi router I saw a HUGE improvement in response and had no buffering.... so it seems pretty obvious).I will update to 4 stars from my current 3 stars if the faster, stronger WiFi signal makes the Chromecast work smoother!", "verified": true, "helpfulness": "0/0", "author": "PandA"}, {"rating": 3.0, "review": "I was able to stream local videos to it using a non-play store app but, Google auto-updates it and added a whitelist to not allow any non Google approved apps to communicate with the Chromecast.Still a good Netflix/YouTube/Google Play stick.  Easier to use than a Roku or a Blu-Ray player for those services.I know there is an app now to stream local content but it requires another purchase.  Decided to use DLNA instead.If Google opened this thing up it would be amazing.", "verified": true, "helpfulness": "0/0", "author": "V2"}, {"rating": 5.0, "review": "Did exactly what it says it will do. We watched several movies at Christmas and it was great!  Some of them did pause for buffering time but it didn't seem to take all that long.  Can't say I would blame that on the product.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Goodwin"}, {"rating": 4.0, "review": "but setting it up was not at all intuitive — even the online help was not very intuitive, so trial and error. Once set up, however it works really, really well.", "verified": true, "helpfulness": "0/0", "author": "Abbe A."}, {"rating": 3.0, "review": "Hooked it up to my tv through my audio receiver and watched a couple of youtube videos. Does so pretty easily but I was expecting to be able to use more of my desktop content through Google Chromecast. Pretty much you can just use whats on your Chrome browser, YouTube, Netflix (if you pay for Netlfix). Maybe one day they'll increase it's functionality beyond what it is today, but the price is still not bad.", "verified": true, "helpfulness": "0/0", "author": "RT"}, {"rating": 4.0, "review": "Easy to install. I just wish this device would offer more apps, like Showtime, ABC player, NBC, CBS and others.", "verified": true, "helpfulness": "0/0", "author": "Patricia Mia"}, {"rating": 3.0, "review": "This thing works but nowhere as good as a Roku. I lose then connection a lot to where the program has to  tr-buffer every so often. My Roku on another TV never does this.", "verified": true, "helpfulness": "0/0", "author": "william bursik"}, {"rating": 3.0, "review": "When I made the decision to purchase my Chromecast, all my research had me believing that I would have access to an infinite supply of apps availbale for streaming content on to my TV. I also was of the belief that the I would be able to control these apps from my iPhone or Android phones. Both of these assumptions were true in part, but just not the part that would have most impressed me.Once installed, the Chromecast only comes with a YouTube and Netflix app native to the system. Figuring out how to add apps even after allowing the Chromecast to update automatically can be quite cumbersome. But still, the selection is far less than the Roku, or WD Live streaming players out there.The one thing that I did find quiet useful is that the Chromecast can take content I am viewing  on my Chrome browser and fling it to my television. This is great for watching content that streams in other languages from other countries etc. But terrible if there is an ad that pops up and you have to get up and click the screen to have the ad removed.All in all I think the Chromecast has a lot of potential in the streaming market if, (and that is a huge IF) Google would add more native apps to the device. Even the basics like Crackle or something would be a large improvement and allow Google to forge their way into the streaming device market.", "verified": true, "helpfulness": "0/0", "author": "AmazonBuyer808"}, {"rating": 4.0, "review": "If you are going to use it for youtube, it works excellent. It's a shame you can't stream pictures, or content from social networks.", "verified": true, "helpfulness": "0/0", "author": "Juan Gregori"}, {"rating": 4.0, "review": "No problem setting it up, once I downloaded the google browser. Started watching movies instantly. Limited at the moment as to what you can stream, and I know there are ways around it, I just haven't found the right program to watch movies already downloaded on the computer. Right now limited to  places like hulu, Netflix, or amazon.", "verified": true, "helpfulness": "0/0", "author": "Gregory Auberry"}]