[{"rating": 3.0, "review": "I thought it would handle Amazon prime.  Very disappointed with the few working apps.  Some day this will be a great device.  NOT YET!", "verified": true, "helpfulness": "1/1", "author": "chris"}, {"rating": 5.0, "review": "Just plug it in to a TV HDMI port, power it up, install Chromecast on your Chrome browser and it is ready to use.  There were no glitches.  I even use it from my iPhone4S.  Our grandson likes to watch Pluto cartoons on YouTube.  Anything that you can display in your browser, you can watch on your big screen TV.  I also use it to stream Amazon MyPrime movies. The operation of Chromecast  is very simple.", "verified": true, "helpfulness": "0/0", "author": "William Gustafson"}, {"rating": 5.0, "review": "For the price it is a great device, streaming video from chrome to the TV is poor at best on average, a lot of buffering. But that being said, I would buy this again without thinking twice.", "verified": true, "helpfulness": "0/0", "author": "Shabazz"}, {"rating": 4.0, "review": "I'll start off by saying I'm a pretty big Google fan.  But, I've had this for a whole day now and am still not able to set it up.  I'm pretty knowledgeable about tech, so its not like i'm a newbie.  I first tried the setup using my desktop, but after it found the Chromecast and I clicked go ahead and set it up, my wireless network dropped out.  Tried it again, same thing.  So, then I tried using my Nexus 10 figuring since it was a Google product it should work just fine... no such luck.  Again my wireless network dropped out when trying to run the setup.  So, now i figure I have a problem with my wireless router, so I'll get out the laptop and plug into my router with a cable and set it up that way.  Wrong!  This can't be setup using a wired LAN.  So, now I have to figure out what settings in my wireless router I have to change to get this thing configured.  So, I'm pretty disappointed at the moment.  I'll update once I get it working.**********UPDATE**********My Thinkpad would get farther along in the setup procedure than my Nexus 10 or desktop.  The setup would get to a point where it would say there is a problem with my wireless setup in the router. I disabled security on it momentarily and the chromecast setup completed. Then I turned security back on. Works as intended now, but this was a pain...", "verified": true, "helpfulness": "0/0", "author": "slednboard"}, {"rating": 1.0, "review": "None of my devices fits to it, I cant use it and sold it again. The Chromecast has to work with all Androidphones", "verified": true, "helpfulness": "0/0", "author": "Rüdiger Engl"}, {"rating": 5.0, "review": "Great, love it, easy to connect to my laptop and iPad and to use, a must have purchase!!!! No regrets :)", "verified": true, "helpfulness": "0/0", "author": "David G."}, {"rating": 3.0, "review": "Works well for Youtube and Netflix but not good for Chrome browser. It slows down the streaming considerably. Product needs improvements.", "verified": true, "helpfulness": "0/0", "author": "MD"}, {"rating": 5.0, "review": "Great and easy to use.  Replaced a dying GoogleTV box with it, so far it's much faster, easier to use and was basically plug & play to set up.  Can not beat the price.", "verified": true, "helpfulness": "0/0", "author": "David McNally"}, {"rating": 5.0, "review": "Adds inet to TV -  limited to utube with iPad, but pc/ laptop works for everything with chrome browserGreat", "verified": true, "helpfulness": "0/0", "author": "Craft"}, {"rating": 5.0, "review": "Works great!  Does everything it says it will.  I Think this product is a sign of things to come.  Needs more apps that are compatible.", "verified": true, "helpfulness": "0/0", "author": "Rick"}]