[{"rating": 2.0, "review": "This is deeply overrated as a technology. Works very poorly and clashes with the other wifi devices in the home. Makes me sad.", "verified": true, "helpfulness": "0/1", "author": "William Westwater"}, {"rating": 5.0, "review": "Love this thing. Finally more apps are able to use it. I use it daily and for 35 dollars it is an impulse buy and I dont regret it one bit.", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "You won't believe how much you'll actually use this! Easy set up, easy to use. Love it! Much easier than watching You Tube on the computer!", "verified": true, "helpfulness": "0/0", "author": "T \"T\""}, {"rating": 4.0, "review": "Very easy way to stream netflix and other videos. Smart TV's are way to slow and cumbersome, this is easy. Quailty not quite as good as I would like for some things, but top notch for Netflix", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Thought I could show videos and photos from my computer but can't.  Also locks up a lot when viewing YouTube videos.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I don't want to give it any star stating I hate it when honestly I cannot be a judge of that for the following reason-  Apparently Google Chromecast HDMI Streaming Media Player can only be used in the United States. I live in the West Indies, Trinidad & Tobago to be exact and purchased this item only to find out it is not working in this region. This information should have been made available in the product information;", "verified": true, "helpfulness": "4/6", "author": "ocogoo"}, {"rating": 2.0, "review": "it's only chrome and youtube streaming for now... would be better if it can steam the desktop view like how the apple airplay does.", "verified": true, "helpfulness": "0/0", "author": "Simon Ding"}, {"rating": 5.0, "review": "Such an amazing product. I can see all of my browser tabs on my TV making it super simple to use my TV as a second monitor.", "verified": true, "helpfulness": "0/0", "author": "Jordan Cohen"}, {"rating": 2.0, "review": "I was expecting the world...this one stopped short of my expectations.  First, it does not allow chromecast from your chrome browser on android or ios, only from PC. Second, it was pretty slow and bufferred a lot, though other streaming etc works well on my current wifi.", "verified": true, "helpfulness": "0/0", "author": "Ramkumar Sathya"}, {"rating": 4.0, "review": "Now that we have speedy internet this is awesome for an hd tv where there is no receiver. Get one before its gone", "verified": true, "helpfulness": "0/0", "author": "Jeff Howe"}]