[{"rating": 4.0, "review": "Great device. Used to use my Xbox 360 for streaming but this little device works soo well no need for xbox.", "verified": true, "helpfulness": "0/0", "author": "M. Perez"}, {"rating": 5.0, "review": "A-OK", "verified": true, "helpfulness": "0/0", "author": "victor v."}, {"rating": 5.0, "review": "The entire family is enjoying being able to cast the apps from our phones and tablets to the tv. Now we can watch Netflix together! At first I thought that the apps were on the product but it doesn't work that way. You cast the apps from your phone the the chrome cast. It's obvious now... It works well and my family loves it!!!!", "verified": true, "helpfulness": "0/0", "author": "Hermelinda Castro"}, {"rating": 1.0, "review": "The connection drops off frequently and there is a lag. May be if the Wi-Fi router sits right next to Chromecast, it works well but for me it is a total disappointment. I even tried pulling the chromecast away from TV, closer to the router to ensure better Wi-Fi reception, using an HDMI extension cable, but reception and quality was only marginally better. Disappointed!", "verified": false, "helpfulness": "7/10", "author": "Sharad Sharma"}, {"rating": 5.0, "review": "Evrey thing i buy works and good deals", "verified": false, "helpfulness": "0/0", "author": "leo"}, {"rating": 2.0, "review": "no remote, not many channels, ended up going with roku", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "Just an amazing device I have 2 in my house now. I can stream all day from my devices all you need to do is download video stream from Google play. As for the buffering it will happen if you have a slow router I bought the nighthawk by netgear and its flawless. I love using my phone as the remote while watching Netflix. For those of you giving 1 star reviews I can guarantee that it's user error.", "verified": true, "helpfulness": "1/1", "author": "x G1T R DONE x"}, {"rating": 5.0, "review": "nice fast shipping and price", "verified": false, "helpfulness": "0/0", "author": "Marilupe Rosas"}, {"rating": 5.0, "review": "Great product if you want to play games, watch movies, or just browse the web on a big screen from any tablet, ipod/pad, and phone especially if you don't have a computer hook up for your TV (HDMI).", "verified": true, "helpfulness": "0/0", "author": "Ryan Wieczorek"}, {"rating": 5.0, "review": "Great purchase and fast delivery", "verified": true, "helpfulness": "0/0", "author": "charles miller"}]