[{"rating": 5.0, "review": "If you enjoy the ease of connecting your phone or computer to your television, then you'll love Chromecast. It is awesome.", "verified": true, "helpfulness": "0/0", "author": "dizzydesmond"}, {"rating": 5.0, "review": "Turn your regular tv with HDMI into something of a smart tv for  $35 or less?  Not only that but control it from your phone over your home wireless? What kind of witchcraft is this?  It's the kind of witchcraft that is called the Google Chromecast HDMI Streaming Media Player and is absolutely worth the $35.The Chromecast is a great add-on to an older flat screen (without smart functions) that we may have paid too much money for and just want to add some extra functionality.  Granted, most game consoles and blue-ray/dvd players add smart tv  functions to a tv, but not everyone wants or needs to buy those things.  For instance,  the one that I bought was a present for some relatives that did not game and most of their movies and recording were done through pay tv.  The now could play Netflix,  youtube, Amazon Prime videos through something about the size of a large flash drive.Well done again, Google.~J", "verified": true, "helpfulness": "0/0", "author": "John G."}, {"rating": 5.0, "review": "worth every penny.  finally something on amazon that does not break after 5 min it worked so good i bought a second one", "verified": true, "helpfulness": "0/0", "author": "Douglas Walker"}, {"rating": 5.0, "review": "For $35 you really can't go wrong with the Google Chromecast. It works with multiple platforms and does exactly what it's supposed to. Setup is a breeze and takes 5 minutes or less. Once your setup, just open an app like Netflix, Pandora or HBO GO for example, chose the media you want to stream to your television from your device, tap the chrome cast icon that appears in the upper right corner and your ready to go. My favorite feature is that when casting from YouTube you can set up a queue and load up multiple videos to play one after the other. Honestly, everyone that has an HD TV should have one of these awesome little devices.", "verified": false, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "Plugin to a wifi enabled laptop to configure.  Then plugin to your TV.  Casting Netflix and Hulu has never been simpler.  I set one up for my parents and they love it.", "verified": true, "helpfulness": "0/0", "author": "Justin Kietzman"}, {"rating": 5.0, "review": "This little gizmo is just a great little device. Streams content from my laptop cell phone or tablet and connects through the internet. Haven't tried the Belkin version, but very happy with this.", "verified": true, "helpfulness": "0/0", "author": "Allen Lutz"}, {"rating": 5.0, "review": "turned my $200 TV into a smart tv. 35 dollars for this device is a steal. i find myself using it more and more", "verified": true, "helpfulness": "0/1", "author": "john mess"}, {"rating": 5.0, "review": "works on-windows operated laptop-android operated phones-macbook can not complain, no more scrunching together with the family to view the same netflix movie on one tiny screen.In order to use chromecast you have to have a subscription to streaming services.", "verified": true, "helpfulness": "0/0", "author": "Helen Stacey Corona"}, {"rating": 1.0, "review": "I have not been able to get it to work with Amazon Prime videos or ESPN3--even with copying and pasting the link into Chrome as some have suggested.  It even cuts out with YouTube.", "verified": true, "helpfulness": "0/0", "author": "MB \"mpb0001\""}, {"rating": 1.0, "review": "I'm very dissapointed with the lack of advanced network options for this device.  I have purchased and worked with much cheaper network devices in the past and all of these devices had options to input static IPs, gateways, DNS, etc.  I am not sure why Google has prevented users from setting up their own network settings for this device.Currently this device only supports DHCP-enabled networks and unfortunately I did not read this failure before purchasing this unit.  I will hold on to the device to determine if it can be rooted or Google releases a patch to fix this issue, but so far I am not impressed.Will continue researching for a fix and welcome any advice if anyone has solved this issue.jlo", "verified": true, "helpfulness": "1/2", "author": "J. Lozano"}]