[{"rating": 5.0, "review": "It is really a great product, recommend it to anyone how want to cast it's phone content to a tv.", "verified": true, "helpfulness": "1/1", "author": "Mariana Taborda"}, {"rating": 1.0, "review": "WOULD NOT RECOMMENDPROS: Good idea.  The technology seems to be in the Alpha stage.  Its a decent proof of concept but there are huge problems (see below)CONS: Doesn't connect and poor implementationI've looked around at forums and can't find a good solution.  My chromecast is 25 feet away from the wifi router (Belken N, two antenna, extra range and power, over $100 when it was purchased).  The chromecast usually can't connect unless you reset it about 5 or 10 times (soft and hard resets both produce similar results).  My roommate bought a second chromecast and it performed in the exact same way.  There's no interference, the TV is not next to an outside wall, and the XBOX and Playstation get great wifi connection just fine and they're only about 2 or 2.5 feet away from where the chromecast sits.  The worst part is its intermittent so nailing down the problem is difficult and because of that I haven't even tried to send it back.FURTHER NOTES:Youtube in particular has terrible options for tagging mobile and casted videos.  Some videos are only available through a PC, some only through mobile, and some that are on mobile can't be sent to the chrome cast (even though its basically the same thing).  There's not really a way to tell in advance and its incredibly frustrating, the screen will just throw an error leaving you confused.  There needs to be standardization across platforms because in this day in age people want all of the internet everywhere they go, not just whatever the video owner decides to accidently click on in the upload options.", "verified": true, "helpfulness": "0/1", "author": "ANDY G \"ANDY\""}, {"rating": 4.0, "review": "...is basically how I use the chromecast. I'm happy with it. Would like to see them add more app capability like viewing what's on your computer as opposed to having to use an HDMI cord to connect it to the TV.", "verified": true, "helpfulness": "0/0", "author": "ImAnEngineer"}, {"rating": 5.0, "review": "For this price, this thing is awesome. We have a TV in the game room and the only thing I ever do with it stream youtube or netflix using this thing. Before you buy you just need to make sure you understand that everything you stream using it is actually through your phone/tablet.", "verified": true, "helpfulness": "1/1", "author": "S. Love"}, {"rating": 5.0, "review": "With a smart TV this is a little redundant, but I have not always had one of those. This is perfect for bringing smart-TV capabilities to smaller and cheaper units. I'm also enjoying some of the interactive game ideas I've seen going around. Where your smart-phone devices interact with the TV and other people's devices also on the same network. Much more fun and development to come, I feel.", "verified": true, "helpfulness": "0/0", "author": "Dave P."}, {"rating": 3.0, "review": "I don't use it much, because it is kind of limited in what is can be used for.I can't use it with Amazon Prime to stream movies. Bummer. It works for Netflix, and Youtube. Still, it takes way too long to figure out and configure. Ought to just buy a web ready tv, but don't want to spend the money yet. SO I get what I pay for...", "verified": true, "helpfulness": "0/1", "author": "Patricia B. Christian"}, {"rating": 4.0, "review": "I didn't check my router compatibility before I purchased.  Setup was easy.  However, I can't stream from my computer until I get a new router.  So it's kind of useless right now unless I want to stream from my phone.It came packaged as you would expect a Google product to come.", "verified": true, "helpfulness": "0/0", "author": "Michael Aldrich"}, {"rating": 5.0, "review": "Best thing EVER.", "verified": true, "helpfulness": "0/0", "author": "Jay Smith"}, {"rating": 4.0, "review": "This may be due to the distance of the TV this Chromecast is plugged into to the wireless router, but when I try to watch Netflix or HBO Go on the Chromecast it is often choppy and skips/stops during the show. It is a good investment for a cheap price, and I assume it would work better with a stronger wireless connection.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect device, a lot of new app.", "verified": true, "helpfulness": "0/0", "author": "Luis Felipe Barnett Vázquez"}]