[{"rating": 5.0, "review": "I know there are tons of apps that allow you to stream on your TV, but I only wanted to watch movies/TV shows on the TV without having cable or excess wires. I'm sad that this product came out now instead of years ago because I would not have purchased many things (e.g. PS3, cable, xbox) which were all used for streaming media instead of gaming. I like that this product streams in a clear, HD picture. Be warned it is reliant upon your internet speed and will buffer from time to time (just like your phone) if you do not have reliable internet.I hope that this allows Amazon streaming in the future!", "verified": true, "helpfulness": "0/0", "author": "Renee L. Wells \"temple owl\""}, {"rating": 5.0, "review": "Bought this just to play around with it. I basically have stopped watching TV. I watch everything from my Mac to the TV now. There are new app that are apple to use chromecast every week. I think I'll keep it for a while!!!", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Great for traveling, or anywhere because of its small size and weight. I can stream netflix, google music (but it has issues with some music that i didnt purchase from the play store) and i can project my chromebook screen directly to it.", "verified": false, "helpfulness": "0/0", "author": "ben"}, {"rating": 5.0, "review": "I can now stream from my phone to my tv.  Exactly what I wanted.  Easy set up and operation.  Goodie.", "verified": true, "helpfulness": "0/0", "author": "Dan316"}, {"rating": 4.0, "review": "easy to set up with android.  down load the app. from play store, (must use chrome browser?), follow the instructions.  want to use with windows or OSX:  (for Windows computers running Windows 7 or higher)  see link:  ([...]  want to output sound to device other than tv or projector speakers, must have audio out from tv or projector connected to stereo or surround system, (5.1 supported).", "verified": false, "helpfulness": "0/0", "author": "MichaelAngelo"}, {"rating": 1.0, "review": "OK, I bought this because I have a Roku 2 that does not have a YouTube channel and Chromecast boasted about casting to TV of YouTube.I used the set up and got connected to my home wifi network.  Netflix works perfectly!  Then I followed directions for casting YouTube and it would not work.I telephoned Google support and once connected to a live person in support located in Michigan I spent nearly 45 minutes discussing the YouTube problem.  I spoke with an ever elevating senior support staff and no one could help me.  We cleared caches, we rebooted the router, we reset the Chromecast device.  Still no YouTube casting.  Google stated that they would resolve this in 24 hours and contact me via email.  That was 3 days ago and still no communication from Google.", "verified": true, "helpfulness": "1/2", "author": "Stephen Doms"}, {"rating": 3.0, "review": "It was a little cumbersome to use. Just got it the other day and find myself using my roku3 more. Was locking up and gets stuck when playing youtube content. I was expecting to stream off my android and its not as straight forward. Plus you need a power for the device  off usb. If your tv doesn't have a usb port you have to run a cable to a usb powered adapter (like you would use for a cell phone) For the price is a cheap way to view some content but not as user friendly as I expected. Maybe down the line if they have mirroring and usefull apps like for prime video and stuff it will be a superior item. For now it will prob. sit on the shelf and collect dust with my other pile of electronic fads", "verified": true, "helpfulness": "0/0", "author": "Ama Zoon"}, {"rating": 5.0, "review": "Works beautifully! Replaces my Logitech Review that should have had updates by now but never did. I am able to watch Hulu Plus on my TV using my Samsung Galaxy III phone as a remote.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 2.0, "review": "The delay in following live images that are changing frequently if frustrating because I have had as much as 10 second delays to catch up.  Part of it could be my wifi but not sure this is all of it.  Added the dongle extender to get the Chromecast farther away from the side of the TV, improved some but still not acceptable.", "verified": true, "helpfulness": "0/0", "author": "JoeF8002"}, {"rating": 1.0, "review": "My wife and I have spent about 3 hours trying to install this and get it to work, first on her laptop, then on my SamsungGalaxyS3.  I couldn't be more disappointed.", "verified": true, "helpfulness": "0/2", "author": "DBPhdOregon"}]