[{"rating": 5.0, "review": "This is the besting streaming media player.There is no buffering and the picture is crystal clear1080. Setup was super easy.", "verified": true, "helpfulness": "2/2", "author": "edith mochnaly"}, {"rating": 1.0, "review": "The fonts used on this device are so small that unless you sit 2 feet from your screen, you'll need the Hubble telescope to read program descriptions etc. And this was on a 42\" HDTV. Besides that, it's not clear if you're navigating on Amazon Prime as there is no specific icon for it, as is the case with Netflix and others. Needless to say I'm returning this thing asap.", "verified": true, "helpfulness": "11/28", "author": "BR101 \"BR\""}, {"rating": 5.0, "review": "This is a really great 99 dollar investment. A great addition to your entertainment system. Can not go wrong really.", "verified": true, "helpfulness": "1/1", "author": "TigerAnn"}, {"rating": 4.0, "review": "Got this because I have a Apple TV but wanted to see what this can do well I was surprised this fire tv is fast netflix loads fast your in the movie in secs the pic the sound is way better wish had the game controller but back odered so waiting for that there is a lot of stuff on there but not much room for the fire tv but when it comes down to it I like both if not on Apple TV then I go to fire tv", "verified": true, "helpfulness": "1/1", "author": "Helio"}, {"rating": 5.0, "review": "Excellent simple interface.  Voice search works!! Makes navigating the offerings so much easier. Looking forward to exploring more. of the offerings.", "verified": true, "helpfulness": "2/2", "author": "Robert C. Boger"}, {"rating": 4.0, "review": "Our Samsung smart TV has all the bells and whistles, but we wanted to have the ability to watch our prime videos in the bedroom where we have a great HD TV, but not smart.  The Amazon Fire not only was easy as 1,2,3 to setup, but is quicker and easier than accessing the smart functionality of our big Samsung. The picture the Firefox delivers is a crisp HD 1080 (depends on your set)! The one con and why I didn't give it 5 stars is no off switch for the Fire box or remote. If you plug into an extension with an off/on switch, the box can be turned off when not in use.", "verified": true, "helpfulness": "2/2", "author": "Plaker"}, {"rating": 5.0, "review": "Its the most user friendly unit on the market. Provides everything in one small box. Remote is easy to use.", "verified": true, "helpfulness": "2/3", "author": "Shane Lindsey"}, {"rating": 5.0, "review": "I have a Roku 2 & 3 and now this new Amazon Fire TV. I must say that the streaming is instant with my Asus RT-AC66U wireless and internet provider. There is no load time in either Amazon or Netflix. I do wish that Amazon adds the History Channel App so I can watch Vikings through the Amazon Fire TV. Another app that I really hope they add is the CBS app that no other streaming provider/box has yet to add. This would make the Amazon Fire TV the top streaming box. Otherwise a great product and a great start for a new streaming box.Also for those complaining about not having HBO go. Amazon plans to have HBO Go by May 21. They are also adding some HBO shows to prime instant videos.", "verified": true, "helpfulness": "1/1", "author": "Moss"}, {"rating": 2.0, "review": "Although I enjoy my Apple TV, I've always been turned off by the fact that it isn't a neutral platform - providing no access to amazon videos, nor to Vudu or other UV movie services.  Well, it turns out that Amazon isn't any better.  I was eager to see the new Amazon Fire TV box, but when I learned that it didn't provide access to Vudu (nor of course any Apple content), I was really turned off.  The battle of streaming content titans continues, to the detriment of customers.", "verified": false, "helpfulness": "8/13", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have Apple TV and Roko and this Amazon fire overall is the best. Better navigation, clearer not cluttered pages. Lots of streaming sources for for your entertainment pleasure. The streaming is flawless at standard and high definition sources. The remote works without any issues and the voice search is fun to use. The only thing is you can not directly connect to apple iTunes files. You can connect to a NAS or other networked devices.", "verified": true, "helpfulness": "1/1", "author": "Dave Cow \"DCow3764\""}]