[{"rating": 5.0, "review": "We are new to streaming. This has made it so simple. Love the voice search and the variety of movies and shows we now have--and no advertisements!!", "verified": true, "helpfulness": "0/0", "author": "Marlena O'Hern Rasco"}, {"rating": 5.0, "review": "What I expected", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"hilleyja\""}, {"rating": 5.0, "review": "A stick should be included in purchase when premium unit is purchase.", "verified": true, "helpfulness": "0/0", "author": "Clayborn R. Walton"}, {"rating": 4.0, "review": "So far I've been impressed with the Amazon Fire TV.  I also own several Roku 3s and I have to say that they match up very well.  I like the interface of the Amazon Fire TV a little better than the Roku 3.  Amazon's interface is crisper and just a little easier to use and find shows.  The main thing that keeps me from rating this as a 5 start product is the wifi reception is not as good as the Roku.  In the same room, same location, the Roku can pick up my wifi signal better than Amazon TV.  We have several brick walls so wifi is always a little challenging but the Roku does better with that.  If you don't have a weaker wifi signal in the room you're going to use this product, I would say go for whichever product you like better in terms of interface. The one feature that slightly puts the Amazon Fire TV in front of the Roku is the voice control.  I just wish it worked for all streaming services, not just a few of them.  Hopefully Amazon will continue to work with various streaming services to enable the voice search to work!", "verified": true, "helpfulness": "0/0", "author": "PicklesMcGhee"}, {"rating": 4.0, "review": "THIS IS OUR FIRST DIGITAL MEDIA DEVICE AND WE ARE PLEASED WITH ALL THE MOVIES, SERIES, AND GAMES AVAILABLE.", "verified": true, "helpfulness": "0/1", "author": "Celeste Myers"}, {"rating": 3.0, "review": "Like the product but can not stand that there is not a power off option", "verified": true, "helpfulness": "0/0", "author": "brandon waas"}, {"rating": 3.0, "review": "I was surprised to see that this media streaming device does not support DLNA so that I could stream my own movies to my TV without having to also run a PC.  The GUI and settings features were not as intuitive or as customizable as i would have liked.  Like other media streaming devices it is very difficult to customize the home screen with just the apps and features I use most.  It is however faster than other streaming devices especially for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Anthony J. and Sharon Borghese"}, {"rating": 5.0, "review": "Very strong streamer. Great HW specs.A great benefit for me is that I can quite easily install XBMC on it without the hassle of having to Jailbreak/root the device. As a prime member it is very convenient to have access to all Prime content in a simple manner.", "verified": true, "helpfulness": "0/0", "author": "Moshe Dahan"}, {"rating": 5.0, "review": "Great price.  Fast ship.", "verified": true, "helpfulness": "0/0", "author": "Richard Farrington"}, {"rating": 1.0, "review": "Remote doesn't work!", "verified": true, "helpfulness": "2/6", "author": "T. Shafer"}]