[{"rating": 5.0, "review": "This is such a fantastic device! I do all my Netflix and any other app I can Chromecast. This thing just works.", "verified": true, "helpfulness": "0/0", "author": "lucas710"}, {"rating": 2.0, "review": "At first I thought this was the greatest invention I had seen in a long time.  The awesomeness soon wore off as I realized that Google has gone to great lengths to limit what this can be used for!  Because of their mental Apple-like control of software and content I can't even stream a movie clip of my kids I made with my camcorder!!!  So close yet still so far from perfect.  Too bad these big companies are control freaks!", "verified": true, "helpfulness": "3/3", "author": "Tdiddy"}, {"rating": 5.0, "review": "Well, not me -- but the cousin I bought it for, and his family, love it.It works well, it is not perfect, but far better then other solutions.", "verified": true, "helpfulness": "0/0", "author": "RealPro \"Love Unix\""}, {"rating": 5.0, "review": "What a great, simple device to use! Great for Play movies, YouTube and Play music. Will be even better once more apps can access its functionality.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Cockle"}, {"rating": 3.0, "review": "Works pretty much as advertised (with occasional software lockups),but adds very little that's not available from my $100 streaming DVDplayer. ChromeCasting of web pages through the Chrome browseris \"cute\" but -- to my surprise -- turned out not to be terribly useful.Considering the price, it's hard to criticize the device. My expectationswere just higher than warranted.  Mostly my fault, not Google's.", "verified": true, "helpfulness": "0/0", "author": "Col. Bat Guano"}, {"rating": 5.0, "review": "Works great with Android for watching movies  and YouTube on the TV. Excellent with Google play Music in the cloud.", "verified": true, "helpfulness": "0/0", "author": "Ryan Nixon"}, {"rating": 4.0, "review": "Great Casting device and very useful, only spoilt by its inability to cast non playstore loaded music and video and the few apps available at present. Otherwise a very useful media streaming device that is easy to set up and used.", "verified": true, "helpfulness": "0/0", "author": "CliffD"}, {"rating": 3.0, "review": "Great idea terrible execution.  Except for netflix its worthless so far.  The opportunity is there for it to be great but they are letting it go by not utilizing the full potential.", "verified": true, "helpfulness": "0/0", "author": "D. Marquez"}, {"rating": 5.0, "review": "Works perfectly as expected. New apps are being added weekly and only increases its value. Purchased one for my home tv and one to use at work.", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 5.0, "review": "It works as expected. I had to mess with the routers permissions (because I locked it down) to allow it to go out and update its software.  I like this product.", "verified": true, "helpfulness": "0/0", "author": "Artimas Fowl"}]