[{"rating": 5.0, "review": "Love it. It's fast, great graghics, easy to use.", "verified": true, "helpfulness": "0/0", "author": "M. Mcmurray \"striker4401\""}, {"rating": 1.0, "review": "Need less \"pay extra for\" sites.  More current network stuff.  I subscribe to Amazon prime also.  Is there something I am missing?  Also Amazon Fire tv has more buffering than Netflix so we tend to watch Netflix.", "verified": true, "helpfulness": "1/3", "author": "kathy loker"}, {"rating": 1.0, "review": "I did not know it  would 1.5 GB to watch a one-hour TV show.  I cannot afford the amount of GBs needed to watch shows.  Four shows and would be over my limit, and email, downloads, etc., would make it worse.I wish I had known that BEFORE making the purchase as would not have done it because I cannot afford to use it.  You should put that cautionary note in your ads.", "verified": true, "helpfulness": "1/3", "author": "BMW rider"}, {"rating": 5.0, "review": "Easy set up, easy to use, couldnt be happier.", "verified": true, "helpfulness": "1/1", "author": "Ozzy Marte"}, {"rating": 5.0, "review": "Quick easy install and very clear picture", "verified": true, "helpfulness": "1/1", "author": "joet"}, {"rating": 5.0, "review": "So I have tried every major streaming device on the market and most of the lesser known (ATV, Roku, Matricom, WD, and even a few built HTPCs).  I will be honest, while I do carry subscriptions to the standard sevices like Prime, Netflix and Hulu I am predominantly interested in the ability to load and carry KODI (formerly XBMC). Here is my experience:Pros:On initial opening the box seems sturdy and sleek. Startup is quick and the box is already linked to your Prime account if you ordered it yourself and carry this service.  An initial welcome video plays and is mandatory, but who cares.  The UI is simple and intuitive but if you are technically challenged the intro video could be helpful. Installing apps like Netflix and Hulu is a breeze and the interface is simple although different from any other platform.  The platform can multi-task (continue to play music while searching other media).  The voice search is very well designed and will search amazon media from any screen or app. Overall the fire TV is extremely responsive and a pleasant experience.Cons:The box does prioritize Amazon content over any other, but IMO why wouldn't they?  Voice recognition is really only useful for the Amazon content, but I have heard they are spreading this functionality in future updates.Now to the important thing. KODI.Of all the pre-built platforms I have used this seems to be the quickest with the fewest crashes etc. The side-loading of the app was simple and quick. Simply follow one of the infinite tutorials online for doing exactly that. Overall, I think I will be replacing my other boxes with this one.BTW, even my wife will use this one.", "verified": true, "helpfulness": "2/2", "author": "auburntiger"}, {"rating": 5.0, "review": "The Fire TV couldn't be more simple to use.", "verified": true, "helpfulness": "1/1", "author": "Dave Lage"}, {"rating": 5.0, "review": "We LOVE the Amazon Fire TV.  While it does not actually give us access to any different content than we had on our computer, the quality of the TV watching experience is greatly increased over hooking up a laptop to the TV with an HDMI cable.  Searching/scrolling is SO much easier.  You are able to pick up in a season right where you left off from your home screen.  The picture quality is amazing-- no more blurry full screen or fading in and out in the span of a program.  And, because we are connected directly with an ethernet cable, NO BUFFERING/LOADING TIME!  This was a great gift!", "verified": true, "helpfulness": "1/1", "author": "A. Haga"}, {"rating": 5.0, "review": "Great device, we love it.", "verified": true, "helpfulness": "1/1", "author": "fabiojeronimo"}, {"rating": 4.0, "review": "Love it!!!! Even has educational apps for my kids to help them with math and reading. Not to mention how clear the image is.only thing is I would like to have a broader option of free movies through Amazon Prime. I had to sign up for Netf;ixx and Hulu in order to get a broader variety of free options. Still love it though, bye bye and good riddance Comcast!!!", "verified": true, "helpfulness": "1/1", "author": "TH"}]