[{"rating": 5.0, "review": "Excellent! Performing as expected!Very easy to install and use.it.I recomend Avia app for local streaming.pic and videos.:).THANKSLove it!..Love it!.", "verified": true, "helpfulness": "0/0", "author": "Francisco Carbo Bayron"}, {"rating": 5.0, "review": "I just plugged it in, to the back of the TV, added the USB cable (plugged in to the USB/diagnostic port on the TV; it's just for power, not data, methinks), and it was done.  Then I installed the Chromecast app. on iDevices, and we were up and streaming Netflix.  (We did already have WiFi in our house.)  We love it.  And, the \"screen saver\" photos it shows when you are not \"casting\" anything, are GORGEOUS (and they rotate).", "verified": true, "helpfulness": "0/0", "author": "Gary A. Gardner"}, {"rating": 5.0, "review": "I can watch movies via NetFlix and I can watch you tube.  I never realized how much streaming content is out there.", "verified": true, "helpfulness": "0/0", "author": "John E Ferguson"}, {"rating": 5.0, "review": "It's so worth the money. The chromecast is an awesome device that's especially cool because it allows you to stream directly to it, without draining the battery on your phone, computer, or tablet", "verified": true, "helpfulness": "0/0", "author": "goodnoise"}, {"rating": 4.0, "review": "Doesn't have a ton of features right now, but you can see the potential.  Also a lot of the apps to use Chromecast could still use some improvement.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "It works great!. What else can I say this stupid review is telling me i need more words, this is annoying.", "verified": true, "helpfulness": "0/0", "author": "mark singh"}, {"rating": 4.0, "review": "can't wait for more chromecastable apps! but i wouldn't \"wait and see\" to get it. just start enjoying the benefits now since $30 is really a low cost and i don't see it dropping much below that.", "verified": true, "helpfulness": "0/0", "author": "Joseph Luk"}, {"rating": 5.0, "review": "The device works great! I would recommend this to everyone... Casing box presentation and function of the device is at top notch...", "verified": true, "helpfulness": "0/0", "author": "Dave Morales"}, {"rating": 2.0, "review": "I bought this expecting that I could send video off my laptop hard drive to my TV. However, that's not possible. You can only \"cast\" whatever streams through the Google browser. So, you can watch Netflix, Hulu, etc. but you can already do that with Roku or with most Blu-Ray players and other devices. I contacted Google to be sure and they confirmed that it was impossible to send video off my hard drive. So, I sent it back.", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Bayan"}, {"rating": 5.0, "review": "I absolutely love this little thing!  It's so much more affordable than Roku and AppleTV and it's smaller.  I stream free movies and TV shows on Primewire all the time so this works perfectly!  No more leaving the laptop near the TV with an HDMI cord.  Now I'm wireless and I get to play on my laptop while I watch.  I love that you can open your files (only mp4 or mpeg for me) in chrome and cast it.  I signed up for Plex to play the other types of files.  I hope in the future they will allow you to cast from your iphone and ipad chrome browser and add more apps.", "verified": true, "helpfulness": "0/0", "author": "Lis_p5"}]