[{"rating": 4.0, "review": "Got this for my parents. It was a bit tricky to setup and not as intuitive as an Apple TV.  But for the price it's well worth it.  They run Netflix off of it and that's it.  It works perfectly for that.  I only wish my moms kindle fire would stream to it.", "verified": true, "helpfulness": "0/0", "author": "J. Wiersema"}, {"rating": 1.0, "review": "This device has not worked since day one. Unfortunately I delayed setting the Chromecast up and was not able to return it to Amazon. After numerous calls to Google it was determined that the device could be faulty and was given instructions to return it for a replacement. However, the instructions came via email and allowed only 24 hours to respond, and you guessed it, I didn't see the email until that time had expired. Also, Google insisted that I open a Google wallet account that they would charge the replacement device to. That charge would be removed if they deemed the returned device to be faulty. Sounds like a good way to end up paying for two devices and only having one. Obviously, would not recommend anyone buy the Chromecast and to avoid doing business with Google or their products.", "verified": true, "helpfulness": "0/1", "author": "Kenneth D."}, {"rating": 5.0, "review": "so easy to use!", "verified": true, "helpfulness": "0/0", "author": "A. Billings"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "W J."}, {"rating": 3.0, "review": "Unbeknownst, this requires the most current OS on either an Apple device or PC to install and even then it is not obvious how to 'project' images and video....it is overrated for what it can do.", "verified": true, "helpfulness": "0/0", "author": "P. Knight"}, {"rating": 5.0, "review": "This was a mother's day gift to get my mom setup with netflix on the living room tv.  It's pretty simple to use, even for her, only downside is she sometimes has to unplug it and plug it back in.", "verified": true, "helpfulness": "0/0", "author": "Branden"}, {"rating": 5.0, "review": "ChromeCast Concept works fine to me", "verified": true, "helpfulness": "0/0", "author": "Beno HarKochav \"Rist\""}, {"rating": 5.0, "review": "great price,  good unit.", "verified": true, "helpfulness": "0/0", "author": "Another Amazon Buyer"}, {"rating": 3.0, "review": "seems to have a hard time keeping wireless signal, even after i upgraded to nighthawk router.......hopefully some updates and casting will come out of beta and be more robust....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works most of the time but as issues with my network.", "verified": true, "helpfulness": "0/0", "author": "Kevin Brant"}]