[{"rating": 5.0, "review": "I love Chromecast! Instead of paying a ridiculous amount of money to a horrible cable company that shall remain unnamed, now i just pay about $15/month for Hulu Plus and Netflix and I have all my TV needs covered! I've been using Chromecast for about a year now and I have no complaints!", "verified": true, "helpfulness": "0/0", "author": "Cristina S."}, {"rating": 5.0, "review": "This device works great.  It plays almost anything you can imagine, with the exception of Amazon Instant Video (but that is Amazon's fault for not creating an app on Android that supports it).  Your phone/tablet is the remote and it makes it super easy to cast stuff.  Couldn't be happier.  I purchased two, one for the road so that I can still watch my stuff at Hotels.", "verified": true, "helpfulness": "0/0", "author": "Shea"}, {"rating": 5.0, "review": "Love this product...a must have for parents of toddlers...I can play all the nursery rhyme videos on YouTube during her allotted screen time.", "verified": true, "helpfulness": "0/0", "author": "K. Barmanray"}, {"rating": 5.0, "review": "Outstanding, amazing price, easily moved and small enough for travel.  I stream my phone, tablet with a tap on the app.  Gave one to my son and he uses it daily.", "verified": true, "helpfulness": "0/0", "author": "Robert Tine"}, {"rating": 2.0, "review": "I don't have internet at home and hoped that I could screen mirror my phone but this does not work at all if you don't have internet. Thankfully I didn't pay full price.", "verified": true, "helpfulness": "0/1", "author": "Dennis Hendricks"}, {"rating": 5.0, "review": "I love being able to cast YouTube Video up onto my tv without connecting my computer.", "verified": true, "helpfulness": "0/0", "author": "Ms. Lala \"AuntieLala614\""}, {"rating": 5.0, "review": "I love how we can use our phones to control it! so much better than using XBOX to watch hulu and netflix!", "verified": true, "helpfulness": "0/0", "author": "carolyn"}, {"rating": 4.0, "review": "I prefer to use the google chromecast over my smarttv features on my vizio, this just works so much better... It's not perfect, sometimes it glitches out and you have to restart it but that happens rarely.", "verified": true, "helpfulness": "0/0", "author": "Cody Welton"}, {"rating": 3.0, "review": "No support to cast a browser from phone, tablet or PC", "verified": true, "helpfulness": "0/0", "author": "Christopher A. Lee \"Treeman\""}, {"rating": 5.0, "review": "Works great connecting my computer and tv.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Glass"}]