[{"rating": 2.0, "review": "Great device for those without smart tv. My Samsung has same features plus more like DLNA support. Yes it's faster. But waiting 5 seconds to load a movie is not make or break it for me. Another dust collector like ChromeCast.", "verified": true, "helpfulness": "0/4", "author": "Reeks"}, {"rating": 4.0, "review": "so far so good", "verified": false, "helpfulness": "0/1", "author": "Robert Foisy"}, {"rating": 5.0, "review": "this is a very nice and easy set up. i have really enjoyed it. the remote takes a little time to get used to but its not bad. i like the voice command feature. i recommend buying hdmi cables to get the clearest picture possible. i have a 32\" LED tv and i find the picture quality to be very very good. The speed is more than adequate for viewing but i guess that all depends on your wifi and your internet speed. in a nutshell i would recommend the fire tv highly.", "verified": true, "helpfulness": "0/0", "author": "hello, its me"}, {"rating": 5.0, "review": "A great tool for accessing Amazon Prime on your TV", "verified": true, "helpfulness": "0/0", "author": "Dr. Dianne R.  Berman"}, {"rating": 5.0, "review": "Our house LOVES Fire TV!I purchased our first Fire TV box back in April and have been using it daily since.  We access all Amazon Prime, Netflix and Hulu Plus through it.  We had a smart TV but it was slow to load content and sometimes it wouldn't load at all.  The Fire box is fast and the picture it delivers looks fantastic.  With Amazon Prime, Netflix, and Hulu plus there is almost unlimited viewing choices.  Add on Crackle and Pluto TV and there is so much you can't possibly view it all.Twice since April I have had an issue were HULU or Netflix wouldn't load but after deleting and re-adding the programs both worked perfectly once again.The remote is awesome since you don't need to point it at the TV for it to work.  In daily use since April I have only had to change the remote batteries once.  The voice search works for Amazon and Hulu content.  It would be nice if it worked for all content but I don't fault Amazon for this. Its best not to hold onto the remote because it react to the slightest touch.If you order music in MP3 form or CD through Amazon that content will be available through the Fire TV which is a real plus.  Also you can upload your photos/videos from the internet or a cell phone and view those through the Fire box.A lot of the one star reviews complained about no HBO GO.  Funny thing is it has been added but the majority of people still wont be able to use it as Comcast wont allow their subscribers to access it.  Plus since you have to subscribe to HBO through your cable provider you would already have access HBO.  Why do you need the fire box to access it if you can already use your cable box? This complaint never made any sense to me.With a good HDTV antenna for local channels plus the Fire TV it is easy to not have cable tv but it does require a good fast internet service.I have enjoyed it so much in September I bought a second Fire TV for our second TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"left handed knitter\""}, {"rating": 3.0, "review": "I already have an apple TV but I got this for so cheap over the holidays I figured why not try it.I like the design of the box itself, it is a little bigger than an Apple TV but it is more attractive with its sharp square corners. The remote is easy to use and I am surprised at how well the voice command function works. Figuring out how to install new apps like Netflix however has proven to be very annoying and far more complicated than it should be. I have only spent an hour with the Fire TV so far but I couldn't figure out how to download new apps and how to delete the suggested ones out of the options. Also I do not like how Amazon Prime is front and center. I want to load the amazon prime instant video app to watch videos I do not want by default my homepages and video options to be from Amazon especially since I much prefer Netflix. I want to be able to run what service I want OR I want to be able to log out of Prime instant video and log into another service like Netflix and be given those options first.So far it is good, not as easy to use as Apple TV however and it is WAY too Amazon specific. I wish it was more of a generic media box like the competition.", "verified": true, "helpfulness": "0/3", "author": "Sevag D \"Sev\""}, {"rating": 4.0, "review": "Luv the voice search", "verified": true, "helpfulness": "0/1", "author": "Stephen Shell"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/1", "author": "Russel R. Stevens"}, {"rating": 1.0, "review": "Garbage. Just a giant ad for Amazon Prime that I had to pay for. I returned it in less than 24hrs and bought the better Roku.", "verified": false, "helpfulness": "0/5", "author": "TxPunisher"}, {"rating": 4.0, "review": "Easy to setup easy to get your movies on the Tv screen.  Be sure to order the HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Fred T."}]