[{"rating": 5.0, "review": "This is a great piece of hardware. Picture definition is superb on my LG 47\" HDTV, response time/buffering is fast with no skipping/hiccups, set-up was a breeze and I get all my Prime content and so much more - all on a free WiFi signal I pickup from some neighbor nearby, which is not a very strong signal to begin with. Sound is through my Polk soundbar and wireless subwoofer - amazing! The only drawback is free Prime content is not shown as a separate category on the home screen like on my Kindle Fire HD (just \"Recently Added to Prime\" - not the full catalog) so it's kind of a pain to search for free Prime content - but no big deal. I'm very happy with this device.", "verified": true, "helpfulness": "1/2", "author": "Zac \"lensgrzs\""}, {"rating": 5.0, "review": "Purchased the Fire TV the first day it was offered.  Have a Prime account but delivery was delayed for a few days.  Sent an email to Amazon voicing my disappointment at the delay and received a free extra month of Prime membership before I need to renew at the increased Prime account fee.  Nice!We've been using a Roku 2XS for Amazon Prime Instant Video and Netflix, and the latest version of Apple TV also for Netflix, just because I'm an Apple fan :-)  Also have used both for watching MLB.  We also use a PS3 and an Apple TV on a bedroom TV for Amazon (PS3 only) and Netflix.Have been using our Fire TV for three weeks.  Have it connected via ethernet cable.  Literally took longer to unpack than to set up and begin watching.  Battery compartment on remote was a bit stubborn to open, but otherwise installation was quick and simple with a software update taking a few minutes.  Both the Apple TV and Roku boxes had similar software updates when I first installed them. Our Prime account info was already loaded.Remember to go through the settings and match them to your TV/audio setup.The Fire TV produces excellent picture quality and outstanding audio on Amazon Prime Instant Video and Netflix.  Prime videos start immediately with no buffering, much faster than on the Roku box, and Netflix selections load more quickly than on either the Apple or Roku boxes.  Always rated the PS3 a notch below the Roku and Apple TV for video streaming. Clunky interface and noisy as well.Remote works well, as does its voice search for Amazon videos.Just read that Amazon will soon have an update which will include a \"Prime browse\" link, a much needed feature, as currently it is much easier to dig deeply for Prime content on our iMac, and add the programming to our watchlist.  Also looking forward to the MLB app to be added during the season.The Roku 2XS is now set up on a less used TV, but really the Fire TV is so good I'm tempted to buy a second one.  Still have the Apple TV set up with the Fire TV on our main TV.  Just too entrenched with previously purchased movies on the Apple TV to cut the cord with it.  Also have a dozen or so Amazon Instant Video purchased movies.  But honestly, 1080P on either the Fire TV or the Apple TV looks the same to me.  So in the future when purchasing a movie, I'll go with whichever offers the lowest price and whether we might want to watch a purchased movie later on one of our iPads or Kindle Fire HD's.  It's always nice to have options.The Fire TV installed quickly and easily, and has worked flawlessly for three weeks.  If you are on the fence about purchasing one, from my experience Amazon has a very friendly replacement and refund policy.  You don't have much to lose by giving it a try.", "verified": true, "helpfulness": "2/2", "author": "sacpinplayer"}, {"rating": 5.0, "review": "Very nice and very easy to install and use.  I like it better than my Apple TV.  Don't hesitate to purchase", "verified": true, "helpfulness": "2/2", "author": "Dusty"}, {"rating": 4.0, "review": "Liked what I could find.  A great selection of GOOD movies.  Not a lot of Great ones for free though.  I looked up the 10 Commandments, and the rental was something like 14.99!  You can see it for free on ABC.  It seems like anything that was an Academy award winning picture, you have to pay for. It seems like the older movies should be free.", "verified": true, "helpfulness": "0/3", "author": "Claudia"}, {"rating": 1.0, "review": "I may update if my 3rd box actually works.  So far, I have received my first box, which got stuck stating it needed a software update but couldn't contact the services.  After trying repeatedly I contacted support and was told I needed to RMA the box.  I received a second box on Monday.  That box was able to get the software updates, but then froze after a number of self initiated reboots.  Whether it be over wired or wireless, it just boots, does a check for updates and then goes to an unresponsive blank screen.  If I'm on wifi, I can use the back-button to go to the wireless settings.  That's all.  No home screen, no settings.  My second box is now packaged up waiting for an RMA shipping label.  i really want to like this box.  I want the chance to actually TRY it, though.", "verified": true, "helpfulness": "8/13", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Two weeks into the streaming adventure and it's gone very well! Great choices between Netflix and A-Prime. Best feature so far is the voice command, WAY easier than typing wrong characters with my thumbs on an abbreviated keyboard! Of course if you ask my son, the gaming gets the nod... WINNER!", "verified": false, "helpfulness": "3/3", "author": "Dave M"}, {"rating": 2.0, "review": "I was comparing this with ROKU, and not getting HBO GO is the deal breaker for me. I am sure that a voice search is great, but not seeing HBO GO is worse than picking out letters to spell what I am looking for.", "verified": false, "helpfulness": "1/10", "author": "Eleanor Gilpatrick \"egilpatr\""}, {"rating": 3.0, "review": "Overall, the product does what any other streaming devices does.  My disappointment is with viewing photos.There is no ability to have a random slideshow of all your pictures.There is no ability to have a random slideshow of certain files.When viewing a slideshow of a file, each picture fades into the foreground until you see the complete picture.  I found this to be annoying and would like to have options on how the pictures are viewed on the TV. They could just show the picture and give a 3 or 5 second viewing time option.The device does not recognize photo's on a USB drive so you will need to upload all of your photos to the Amazon Cloud. I understand that Amazon wants to make money on it's Cloud storage but uploading 16k pictures will take some time.Uploading pictures from my computer to the Amazon Cloud takes a VERY long time. It will take me weeks to upload all of my photos.Hopefully they will offer a software update to address the slideshow options.  As to the USB and Amazon Cloud, I expect those issues will not change.", "verified": true, "helpfulness": "1/5", "author": "Mr. Jimmy"}, {"rating": 5.0, "review": "Amazon did a fantastic job putting this product together.  It's clear that they have been working on this for a long time and I bet they were targeting Christmas 2013 for launch and I'm guessing that they made the SMART decision to actually finish the product first (Thanks! no one likes under baked gadgets).  I love it.  My kids love it.  Well done amazon!Please continue to add games like Sev Zero.  The Kindle HD as a support player/controller for Sev Zero is fun and innovative as well.  I'd love to see more games that allow the tablet to be a part of the game.Pros:- Easy Setup- Fast MCU with GPU acceleration - Premium HW. (3d games play nicely).- Clearly built on top of the Android/Linux OS and App ecosystem.- ASAP feature is no gimmick - very nice and responsive.- UI is very well done.Cons:- 8GB is a best in class Flash storage size, but with the full 3D games available I'm going to eat that up pretty quick.  Please consider a micro SD slot or a 16GB/32GB model in the future. (will USB Flash Expansion work?)Extras:- I confirmed that my MELE F10 Pro Air Mouse/keyboard works with the Kindle Fire TV.- If you are gaming the Fire TV game controller is a must have.", "verified": true, "helpfulness": "2/2", "author": "JaJoGa"}, {"rating": 5.0, "review": "Easy \"all IQ's\" installation and within minutes I was searching and filling up my watch list from the bounty available on amazon  prime. The microphone remote is such a brilliant addition from the first one. It's a bit bigger than a coaster.", "verified": true, "helpfulness": "1/1", "author": "Anais Parker \"lilygrain\""}]