[{"rating": 4.0, "review": "Works really well. Only thing I would change is it doesn't have the loop function for things like Hulu or Netflix. But the energy saved by using it instead of a playstation or xbox is pretty considerable.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Don Seago"}, {"rating": 3.0, "review": "It's ok for what it is. I like streaming whatever I have on Chrome from my laptop to the TV, but I did not expect the mobile limitiations. To stream anything from my Andriod phone or Tablet, I have to have specific, Chromecast-compatible apps installed. Some of them come with fees. I have Chrome on my phone and tablet, but I cannot stream from them. It's ridiculous! I bought one of these for each of my TVs, but i'm not using them anywhere near as much as I thoguht I would. I can't even easily stream pics/vids from my phone up to the TV - it's a big hassle.But hey, if you're a You Tube junkie, this is great for ya!", "verified": true, "helpfulness": "0/0", "author": "Metaljess77"}, {"rating": 4.0, "review": "It's 2014 and it shouldn't be hard to get stuff from other computers and the internet to a TV. Chromecast addressed this problem. I really like mine. The only thing I wish it had more support with, is playing more videos from my computer to the device. It let's you do some by just playing the video via Chrome, but not all codecs are supported. If there was some sort of VLC extension/support, this would be an amazing tool.", "verified": true, "helpfulness": "0/0", "author": "Bryce"}, {"rating": 1.0, "review": "Does not work with Kindle Fire!  I should have been informed that this device does not work with the Kindle Fire.", "verified": true, "helpfulness": "0/5", "author": "Don Rohling"}, {"rating": 5.0, "review": "For me, it's all I wanted. Very simple and easy to install and use. Can be used by any PC, cellphone, and tablet in my house. And very small. Doesn't need any extra space. Google nailed it again.", "verified": true, "helpfulness": "0/0", "author": "shawn sia"}, {"rating": 4.0, "review": "It's exactly what I thought it would be.  Wish it had ESPN or NBCSN, but it's good for Netflix, Hulu+, and HBO GO.", "verified": true, "helpfulness": "0/0", "author": "Scott Hymen"}, {"rating": 4.0, "review": "For now, it's a pretty cool device that's definitely worth 30 bucks. It's allowed me to push live Olympics coverage from my laptop over to my TV, as well as watch Netflix on the bedroom TV.It's not without its flaws - framerates can be pretty uneven, and audio-visual sync is off by a bit more often than it's on. These issues were significant enough that I debated giving Chromecast three stars, but ultimately I settled on four because, despite these significant usability issues, I still enjoy the simplicity of the device and hope that it will become even more usable in the future.", "verified": true, "helpfulness": "0/0", "author": "MT"}, {"rating": 5.0, "review": "It's great to be able to watch movies from my tablet on the tvMy whole family is enjoying this.", "verified": true, "helpfulness": "0/0", "author": "ibuck"}, {"rating": 5.0, "review": "Love it. Such a cheap way to just get hulu/netflix on your TV. Youtube integration as well as pandora, etc... is flawless.", "verified": true, "helpfulness": "0/0", "author": "nate"}, {"rating": 5.0, "review": "Chromecast does what it says. In addition to youtube and several movie streaming services like netflix, you can cast any tab in chrome browser which is really cool. My only issue that it doesn't work with media player programs and you can't simply cast your pc or tablet screen content. But as I said, it does what it says and does it well. At 30 dollars, it's a steal.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Whitebox"}]