[{"rating": 3.0, "review": "It's easy to set up and use. Picture quality is good. I thought we would use this instead of our gaming device for different movie streaming. It only works on Netflix. no Amazon, M-GO...etc... It needs to become more useful to people before it'll be an alternative to other boxes. Even the WII has a browser for internet on TV.", "verified": true, "helpfulness": "0/0", "author": "Willie Curran"}, {"rating": 4.0, "review": "Easy to use. Works well. Only downside is that I can only get it to work with netflix and youtube.", "verified": true, "helpfulness": "0/0", "author": "Betty Clark Gregory"}, {"rating": 4.0, "review": "Can be a bit finicky - really wants a very strong wifi signal. When it works, though, it is fantastic. So much simpler to use my phone or tablet than navigating the \"smart TV\" menus.", "verified": true, "helpfulness": "0/0", "author": "S. Epstein"}, {"rating": 5.0, "review": "this device functions better than our DVD player streaming Netflix, this is all we use now, another great product from the folks taking over the world, Google.  Thanks.", "verified": true, "helpfulness": "0/0", "author": "jwcave \"John W. Childress\""}, {"rating": 4.0, "review": "So it's not really a true substitute to having a home theater pc however for $35 you can't really complain.  Streaming is good and easy to use through any of my android devices which is nice since i don't have to have yet another set of remote/keyboard/mice.  It even does desktop steaming if you use the chrome extension which allows you to watch internet content that are not supported by it's current list of apps through your computer on your tv.  However, Chrome browser stream can be a little laggy at times, but works 97% of the time.  Hopefully the list of apps Google approves for the Chromecast will continue to grow.", "verified": true, "helpfulness": "0/0", "author": "untitled"}, {"rating": 3.0, "review": "Ok, so I like gadgets.  We don't have cable, or for that matter any TV at our house so we depend on Netflix, Amazon, and our own collection to entertain us.  I use ABC, NBC, and CBS apps on my iPod/Phone but wanted to see them on our big screen.The first thing I tried was casting from my iPod (iPhone 4 without service).  I installed the app, set up the Chromecast, then tried playing a YouTube video from my iPod .  Everything worked great!  I was excited.Then I installed Chrome on my iPod/Phone only to find that there was no way to cast from the app.  As it turns out, you can't let the word \"Chrome\" in Chromecast fool you.  At this time, you can not \"Cast\" from \"Chrome\" on your hand held device - even Android OS.  The only \"Chrome\" that \"Casts\" is Chrome on your PC.I then installed the Chromecast extension on my laptop (windows 7), I tried casting Bob's Burgers from Fox's website.  The Chromecast extension on the PC sucks up the processing power.  It uses 100% CPU power on my dual core laptop. and even though I have gigabit wired network (wireless card turned off on my laptop), the result was choppy and unwatchable.  I tried another computer (i5 760) and it was smoother, but still not perfect.On the positive side, the home screen pictures are quite pleasing to the eye and they change every few minutes so it doesn't burn into your screen if you leave it on.", "verified": true, "helpfulness": "1/1", "author": "KaiLih"}, {"rating": 1.0, "review": "Not as good as I thought it was going to be.  I purchased 2 of these and waited almost 2 months for the delivery. Now it's just collecting dust, not as nice as I thought it would be.", "verified": true, "helpfulness": "2/4", "author": "Ann Maynette"}, {"rating": 5.0, "review": "The family loves this. When we have Family gatherings, everyone take turns sharing videos. Very handy for the young grandchild. I can queue up his favorite videos from any room in the house. Using the supplied ac power adapter, it even turns my TV on. Mostly used for YouTube and Netflix.", "verified": true, "helpfulness": "1/1", "author": "JohnnyD"}, {"rating": 5.0, "review": "It is working excellent, I used few times, never had a problem.  I strongly recommend to others, it is very good product.", "verified": true, "helpfulness": "0/1", "author": "mike marian"}, {"rating": 5.0, "review": "Works like a charm!  We love it!  It was very easy to set up.  Picture was great, sound was great.", "verified": true, "helpfulness": "0/1", "author": "Bill Simpkin"}]