[{"rating": 2.0, "review": "The packaging and setup experience was great.  Kudos to Google there.However, I'm not impressed with the rest of the offering.I have 2013 Nexus 7 and the ability to use the dongle is 'locked down' to apps that Google 'wants' (i.e. monetize I'm sure).It works great for Netflix; and if this is your primary use case, \"Go for it\".I dont buy movies from Google Play, so that's no usage to me there.The dongle doesnt allow playback of 'local videos' that you store to your device (FAIL GOOGLE).Casting via Chrome Broswer under Android doesn't work / not available.Casting via Chrome Browser from a PC is spotty.  Some machines it'll work, some it wont.Anyways, so much potential.  So much fail.  Avoid until Google 'unlocks' the Ecosystem.I'm thinking about returning it.", "verified": true, "helpfulness": "2/4", "author": "A Guy named Mike in Texas \"Mike\""}, {"rating": 5.0, "review": "What can I say. Worked out of the box as advertised; hopefully more apps soon to be added. This is worth a lot more than $35.00", "verified": true, "helpfulness": "0/1", "author": "Stewart Brebnor"}, {"rating": 4.0, "review": "This is a great product, feels like a dream come true. Amazing clarity while watching YouTube and Netflix.You can enable chrome cast and play it with your Iphone, computer or ipad, and still keep working simultaneously with the device with which you played.If you watch YouTube and Netflix most of the time like we do then its a must buy.", "verified": false, "helpfulness": "0/1", "author": "Madhan Govardhan"}, {"rating": 1.0, "review": "Tried it for first day--worked and then red line on unit---doesn't work, did all the trouble shooting recommended and nothing", "verified": true, "helpfulness": "4/8", "author": "Anupam Gupta"}, {"rating": 5.0, "review": "Easy to install and use. It works perfectly. This device is a great enhancement to traditional TV viewing choices. Worth the money, easily.", "verified": true, "helpfulness": "0/1", "author": "T. Daugherty"}, {"rating": 2.0, "review": "I purchased this item because I thought it would work like a Roku. It does not. You have to have either your laptop or your cell phone to control it. You can only watch Netflix, Youtube, and Google supported items. I gave it away.", "verified": true, "helpfulness": "1/4", "author": "RH"}, {"rating": 4.0, "review": "The product is very easy to install and is worth the money!!! One of the best HDMI Streaming players I have used.", "verified": true, "helpfulness": "0/2", "author": "Joel"}, {"rating": 3.0, "review": "Disclaimer - I'm a techie guy.I saw the early reports of the \"Chrome\" device and started salivating.  Then I read a bit more, understood the basic model/features/limitations.  Less salivatory, but still neat.The device plugs into a standard TV HDMI port and uses your local wi-fi network to stream video directly from the source.The device does require a separate power supply (standard USB power), which can be pulled from an existing power cube or from the small powersupply included in the box.  There is also a short (5-inch?) HDMI extension cable that can be used to connect to hard-to-reach TV ports (and this connector acts as a small antennae for wifi - according to the docs).You initially plug the device into your TV's HDMI port, provide power, and voila - it starts broadcasting its own little mini-WAP (wireless network).  You use your tablet to temporarily connect to that mini-network, configure the device, let it know how to attach to your regular Wifi (userid/pw) - and whoosh - you are now ChromeCasting.Instead of using a remote-control (there is none), you use your handy Android or iOS (Apple) tablet or phone device.  You can play from any mobile (or desktop via Chrome browser) device on the wifi network.  The HDMI connector is \"smart\" and when you start playing to Chromecast - it will tell your TV that there is new content streaming - so your \"smart\" TV should autoselect the Chromecast source.  (Nifty!)Here's the catch - the mobile application (running on your tablet or phone) must be written to support the Chromecast video streaming.While Apple build their iOS operating system to support their proprietary \"AirPlay\" - Google's Android can support its version of \"ChromeCast\" and other mobile apps can build in specific support for Chromecast.That's kind of limiting right now.  Basically an iOS device can run Chrome, Youtube, or Netflix viewing apps - and send data to the large-screen Chromecast is connected to.  Nifty but limited.Hopefully other apps (Amazon PRIME VIdeo??) will add this functionality - soon.  (Amazon's iOS PRIME video player still does not handle Apple's AirPlay either...  So more growth potential on both fronts.)JDMc", "verified": true, "helpfulness": "1/2", "author": "jon mceachron \"(JDMc)\""}, {"rating": 4.0, "review": "For the price, this little gadget sure packs value. Now I can cast programming to any TV in the house I want(They each have a chromecast connected of course). I'm satisfied. The only downside is that if you want to use a VPN service like HOLA unblocker, then you won't be able to cast.", "verified": true, "helpfulness": "0/1", "author": "Olivier Hernandez"}, {"rating": 3.0, "review": "I bought it to see what all the hype was about.  Personally I like my Apple TV better.  The device serves a niche purpose but is not my goto device.", "verified": true, "helpfulness": "2/3", "author": "Kindle Customer \"Say something about yourself!\""}]