[{"rating": 4.0, "review": "i like the idea of chromecast.  it works well with netflix.  nice for movie night with the kids.  but as far as i know the uses are limited.  you can't use on some random website.  only established, contracted sites like netflix.  admittedly, i could be wrong.  as i am not the most tech savvy person --  there may very well be a way to use with other websites that i haven't figured out yet.", "verified": true, "helpfulness": "0/0", "author": "Lilly's mom"}, {"rating": 3.0, "review": "Google needs to find away to allow the Chromecast past hotel \"login\" splashscreens. I'm surprised google overlooked this.Without that, I can't take it on the road with me, so it's just a novelty item for home or office use.", "verified": true, "helpfulness": "0/0", "author": "R. Dennison"}, {"rating": 5.0, "review": "Chromecast is the best solution I have found for streaming content to my HDTV. Easy to install, flawless streaming at a very affordable cost. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Mauro"}, {"rating": 1.0, "review": "Works fine but apps need to be chromecast capable.  Right now, that's just netflix and the video app on my tablet.  :(", "verified": true, "helpfulness": "0/2", "author": "C. Stube \"Computer Geek\""}, {"rating": 3.0, "review": "I have been struggling with this gadget for two days now. The instructions that came with the device is woefully inadequate and you almost need a degree in Computer Science to install/setup the thing. Also the size of the printing is ridiculously tiny. Why???I have found some instructions on the internet from other users that have struggled thru the installation process.If they don't work I will be returning the celebrated Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "AJay"}, {"rating": 5.0, "review": "It works very easily - I'm anxiously awaiting other programs.  Netflix and UTube are really fun, especially the classical music.I use the extension because it's easier.  I can't believe this only cost $35!", "verified": true, "helpfulness": "0/0", "author": "Katherine Dunham \"Katherine\""}, {"rating": 4.0, "review": "Works completely as advertised. Turns on my TV and switches inputs....I use it mainly for YouTube videos when I want to quickly blast something on my stereo, and tons of Netflix.More companies need to support this dude for me to give it 5 stars. Plex alone would give me a 5 star review.", "verified": true, "helpfulness": "0/0", "author": "Donald Lutz"}, {"rating": 5.0, "review": "Nice to be able to control with my phone or my laptop.Great picture and easy to move from tv to tv", "verified": true, "helpfulness": "0/0", "author": "p brooks"}, {"rating": 5.0, "review": "Perfect, Perfect,  Perfect! I cannot waot until more apps become avaliable.  I use this everyday! I have also used this on my ipod.", "verified": true, "helpfulness": "0/0", "author": "D. Morgan"}, {"rating": 4.0, "review": "Our Chromecaster is named Chester.  Yes, you do get to name it.  So far he works great with Netflix.  The only disappointment so far is the lack of Amazon Instant Prime streaming.  Come on Amazon, get busy and release an app for this thing.", "verified": true, "helpfulness": "0/0", "author": "R. Canant"}]