[{"rating": 5.0, "review": "Took forever to get here.  Sucks compared to Apple TV.  Thought it would be useful....liked it was cheap.....nevermind, spend the extra couple dollars on Roku with a remote instead.", "verified": true, "helpfulness": "0/0", "author": "K. Anderson \"Cracker Mutha\""}, {"rating": 4.0, "review": "YouTube videos and Netflix stream smoothly, sound is awesome. It just needs more supported content providers. For $35 you can't go wrong, though.", "verified": true, "helpfulness": "0/0", "author": "Sean Wren"}, {"rating": 2.0, "review": "doesnt work well tab casting and they turned off the ability to cast your music and video files just before it finally arrived ...still mom like watching the old tv shows on youtube which works just fine.", "verified": true, "helpfulness": "0/0", "author": "maria n johnson"}, {"rating": 5.0, "review": "Quick installation, and works like a charm, Netflix and You Tube show with crystal clarity.  More info on which apps use Chromecast would be great.", "verified": true, "helpfulness": "0/0", "author": "RaymondC"}, {"rating": 5.0, "review": "Awesome device will buy more soon.Easy setup download app install way you go simpleWorks well in Australia streaming utube", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Once I figured out how to set it up( not as simple as you're led to believe) it worked really well.", "verified": true, "helpfulness": "0/0", "author": "lynne w. leroux"}, {"rating": 5.0, "review": "Better than I expected! I know that more things will soon be available in addition to You Tube and Hulu Plus.", "verified": true, "helpfulness": "0/0", "author": "William S. Bunch \"Weatherman\""}, {"rating": 5.0, "review": "When Chromecast was announced, it was clear that we are looking at a game changer and game changer it is. I have given up plans to go for an expensive Internet enabled Smart TV. The main items I would watch on Smart TV are Youtube, Netflix and Hulu Plus. All of them are available for easy streaming on Chromecast. This tiny little device makes any HDMI enabled TV as a Smart TV saving us hundreds of dollars in the process. I also really like the fact that it does not use processing power or battery from my phone / tablet / laptop. In addition, no more fiddling with the over complicated TV remote! For streaming video that is not yet on-boarded to Chromecast, you can use Chrome browser to cast them but it would use batter power in your laptop.One of the best innovations from Google this year. I would bet that Chromecast is the hottest gift item this holiday season.", "verified": false, "helpfulness": "0/0", "author": "A reader"}, {"rating": 5.0, "review": "My hat is off to the engineers that designed this product. Installation was a breeze.  Instructions were well written and easy to follow.  My wireless immediately recognized the Chromecast and the next thing you know my TV was showing Netflix movies.  Wow!  I am so happy I discovered this product and highly recommend it to anyone seeking an easy way to watch Netflix movies on their TV.  Oh, you must use the Google Chrome browser because this product will not work Microsoft's Internet Explorer.  I'm actually now starting to like the Google Chrome browser.", "verified": true, "helpfulness": "1/1", "author": "Podge T"}, {"rating": 4.0, "review": "A great product from google with a new idea that is worth trying i'm getting this device to connect it to my TV and try things out!", "verified": true, "helpfulness": "0/0", "author": "Ali k"}]