[{"rating": 4.0, "review": "Easy to set up.  Voice recognition is excellent.  Combined with my Prime membership, I've watched many great TV series for free.  Also love the availability and ease of access to movies.  One problem is with the remote:  After just 3 days of use it was not responding.  I had to open the battery compartment and spin the batteries to get it to work again.", "verified": true, "helpfulness": "0/0", "author": "bapbam"}, {"rating": 4.0, "review": "I bought the Amazon Fire to replace my Apple TV.  I liked the Apple TV but was not happy the way iTunes would mess with the YouTube videos.  There were videos that I had saved to my favorites that would suddenly disappear from YouTube on my AppleTV but were still available from my Windows based computer.  Also it did not support Amazon Prime.  I am disappointed with the way  Amazon Fire handles YouTube.  There is no way to save a video to my favorites after you have watched it on YouTube.  I had planned to give my Apple TV box to my Brother but now keep it next to the Amazon Fire box and just switch connections so I can use either box depending on what I want to watch.  I hope Amazon will fix this in the future.", "verified": true, "helpfulness": "0/0", "author": "Philip L. Pleasants"}, {"rating": 5.0, "review": "We are glad to have amazon fire on our television upstairs.  We have access to a wide variety of programming including our favorite shows on Netflix that we were unable to get without amazon fire.", "verified": true, "helpfulness": "1/1", "author": "Leslie"}, {"rating": 5.0, "review": "Bought this gadget for plex. Absolutely love how smooth it loads my plex library and scrolls. Best device i have owned so far for plex streaming. Now if only amazon could partner with steam's homestreaming.....", "verified": true, "helpfulness": "1/2", "author": "Brandon Wehde"}, {"rating": 5.0, "review": "I use this more than my cable box, I do have amazon prime and Netflix so this is a great device. Very easy search and helpful video to get you going once you have it hooked up. I recommend this. love it", "verified": true, "helpfulness": "2/2", "author": "teckneek"}, {"rating": 4.0, "review": "I was already a long-standing Prime member so I thought I would take advantage of the free video available. My TV didn't have the necessary features so I bought the box. Simple to install and set up and works great. The movie selection from Prime is not the best going, but you can always rent or use another service. I'm not much of a TV addict but when I want to watch I often can't find anything to watch in my several-hundred channels and Fire always has something. Overall I am happy with the product. Be sure to order an HDMI cable as the box does not come with one.", "verified": true, "helpfulness": "1/1", "author": "BJ \"Bj Lowe\""}, {"rating": 5.0, "review": "I had an apple TV 3rd Gen.  Sold it bought a Amazon Fire TV.  This thing screams speed compared to Apple TV.  I am glad I switch so far.Pros:  Fast, Speed, Voice Search, Amazon Prime Video, Apps, Plex, Remote Feels great and is bluetooth.  I find myself pointing the remote at the unit even tho its not necessary. (Old Apple TV habit).  I would Def Buy this if you need a Video Streamer Box.Cons: None So Far", "verified": true, "helpfulness": "0/0", "author": "Jack Allensworth"}, {"rating": 5.0, "review": "Installs in minutes, incredibly easy to use.  ! ordered one, used it, and immediately bought another for the bedroom and got rid of the bedroom cable box.", "verified": true, "helpfulness": "0/0", "author": "Jamie P. Kozemko \"BumbleBee\""}, {"rating": 4.0, "review": "I like it. It was easy to hook up and pretty simple to use. I have no complaints so far.", "verified": true, "helpfulness": "0/0", "author": "Shoe Addict"}, {"rating": 4.0, "review": "I purchased an Amazon Fire TV for myself and my mother, both to primarily have easy access to the Plex app and also Netflix. She has an Amazon Prime account but I do not, so she will make more use of the Fire TV's other features than I will. My main reasons for not giving 5 stars are that it doesnt come with an HDMI cable. I mean seriously, would it have cost Amazon that much to add one of their own brand cables, which retails for like $3.99? Also, although I am hoping against hope on this one, it is a shame that the voice search only works on the Prime parts of the device, not Netflix or any other apps. Perhaps in a future software update they will make the voice search available to other apps. Other than those two gripes, which I knew about both before I purchased, the Fire TV does exactly what it is supposed to, and is super fast.", "verified": true, "helpfulness": "0/0", "author": "Jay Carter"}]