[{"rating": 5.0, "review": "Must get my hands on one of these badboys. I stayed at my friends house the other weekend and I really, really enjoyed having the fire at my disposal. Will definitely purchase one.", "verified": false, "helpfulness": "1/1", "author": "Kyle"}, {"rating": 5.0, "review": "I love it.  So easy I hooked it up myself in 5 minutes.Learned how to use it in 5 minutes or less.Love it.Walk through video, an 90 year old could do it.Thanks so much for the easy instructions.Thanks for making it.", "verified": true, "helpfulness": "0/0", "author": "Pam Abney"}, {"rating": 5.0, "review": "The world is changing very fast. This device is great 40 free movies and tv show.Amasing, I watch the original star trek one show after another. Also comedies , and hbo shows.Best thing a brought . Better than paid cable . Well done. There is also paid movies for a small fee. It take a while to get used to. With the game controller you can play games.", "verified": true, "helpfulness": "1/1", "author": "Michael Merlin"}, {"rating": 4.0, "review": "On several occasions while watching Crackle, the commercials were very specific to something we had just been talking about or just eating...weird. Other than that, it is a nice tv box.", "verified": true, "helpfulness": "1/1", "author": "Emyle"}, {"rating": 5.0, "review": "The Fire TV is easy to install (providing you don't encounter wireless issues .... see below), intuitive to operate and stands out with excellent voice-recognition functionality. If you are invested in the Amazon eco-system, this is an excellent choice.Now, regarding the wireless issues - when I first tried to connect to my wireless network (as part of the install), it would not connect. This is the solution that worked for me (only because of the type of TV I have - Samsung):When I plugged in the HDMI cable to my Samsung LED TV, it automatically connected as HDMI-CEC (Anynet+). I had to turn OFF the Anynet+ feature of my TV and then I could connect to my wireless network (although this failed initially with 'unable to connect to amazon.com', but a reboot of my router - as many have reported doing - corrected the issue and all was well from that moment).", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This small unit operates as advertised, is easy to use and provides great quality video signal.  The unit easily fits in the cabinet with my cable box, Blu-ray player and sound system.  I purchased this to replace the streaming capability of my Blu-ray player, which stopped working properly (although it still plays disks just fine).  One complication is that my sound system only has two optical inputs, and the Fire TV box would be the third, so I need an optical switch or new sound system.", "verified": true, "helpfulness": "0/0", "author": "JoeJanJr"}, {"rating": 2.0, "review": "Work like any other streaming device with faster interface.  Nothing special aside from voice search but doesnt work all the time.  Tried and did not search through out all services like netflix etc.", "verified": true, "helpfulness": "1/2", "author": "C. ngo \"chuckie chulo\""}, {"rating": 5.0, "review": "Love the voice search. This is a polished device with well thought-out controls and navigation. Apple will have to improve soon to play catch up.", "verified": true, "helpfulness": "0/0", "author": "halcyan \"cw\""}, {"rating": 4.0, "review": "Easy to use, easier to set up, and better than others we tried.The only reason for only 4 stars is lack of Amazon music for background.We sometimes just sit and watch the background pictures (screen savers?)We put radio music on the stereo and let it play in the background.", "verified": true, "helpfulness": "1/1", "author": "Jack Balog \"Jack\""}, {"rating": 4.0, "review": "Works great, Since I am on as a guest to someone else's prime, I can't sign up for the free month.Would like remote to allow for volume control and turning TV on and off.Would like a web browser", "verified": true, "helpfulness": "0/0", "author": "DeChance"}]