[{"rating": 4.0, "review": "I like the fire TV with the exception that the channels or apps are much more limited than the roku not sure if that is just because it's new and more will come later...otherwise the picture is exceptional and the remote is quite cool", "verified": true, "helpfulness": "1/2", "author": "Julie Fraser"}, {"rating": 3.0, "review": "Coming from roku3 the KFT interface is a beautiful, I wish the search \"voice\" option would work across the board on all apps Netflix/Hulu etc etc...it gets laggy on shows when watching on hulu or netflix.. Get them fix and you will have me at hello....otherwise back to roku I go", "verified": true, "helpfulness": "1/1", "author": "Frank Mata"}, {"rating": 2.0, "review": "Service works great, and is easy to use especially the voice search.  \"Free\" movies are mostly ancient, current movies are cheaper at the local family video.", "verified": false, "helpfulness": "1/2", "author": "Brian Mishler"}, {"rating": 2.0, "review": "I am a solid Amazon prime member.  I was hoping for a lot from this box.  I got it Friday, and I'm returning it back Sunday.  I 'ike the Roku 3 better.It is a screamer in terms of responsiveness, a bit, but not too much faster than my Roku 3.My biggest beefs:1) Menu system is quite a bit clumsier than roku 3.2) Voice search works pretty well, but it is limited to amazon and vevo only.  Not good.3) There is no output option for 1080i.  I have an older 1080i only HDTV, and I don't think I should have to be looking at menus in SDTV.4) The Biggie... No search of amazon prime only content.  When you do find say, Orphan Black, which is free on prime, when it is found, the first thing it asks is whether you want to buy the episode for $2.99.  You have to actually go to a *Sub-Menu* to see that it's already free with Prime.  This seems like a brazen cash-grab, and is an insurmountable defect in functionality for me.Amazon says it is correcting these issues \"before the end of the year.\"I'm still a big fan of the Amazon prime service, but this product offering is a miss.", "verified": true, "helpfulness": "3/4", "author": "Kendrick McCabe"}, {"rating": 4.0, "review": "it is nice that all of our apps and tv products are on this device and it is easy to set up and to use straight out of the box. my wife and I do not watch much tv except movies and this is the ideal product for us. we tried a couple of the other products out there but were not satisfied with them.", "verified": true, "helpfulness": "1/2", "author": "doug"}, {"rating": 5.0, "review": "Amazing little box !!!!  For a long time I have been looking for a small device to run XBMC in my room (I already run it on Mac Mini in my living but a Mac Mini to run XBMC is too expensive).  It runs XBMC without problems and it's surprisingly fast.  It also runs Netflix very well.  It's much much better (and faster) when comparing to Apple TV and other devices.  It's has better processor chip and more memory.Very easy to install XBMC and very easy to use the device. Really amazing !!! I recommended for sure and to be honest I'm thinking to buy another one to install in my son's room.", "verified": true, "helpfulness": "1/2", "author": "Paulo"}, {"rating": 5.0, "review": "As advertised and very easy to hook up.  Excellent programs for the kids and my first step towards eliminating cable.", "verified": true, "helpfulness": "0/1", "author": "Mike Barnes"}, {"rating": 5.0, "review": "The Amazon Fire was very easy to install and use.  The entertainment valve of the Fire TV has exceeded my expectations. I spend more time watching programs on Fire TV than my cable. Hope to do away with cable in the near future.", "verified": true, "helpfulness": "2/3", "author": "Harold R. DeHaven"}, {"rating": 5.0, "review": "I wanted to try this newest unit to see how it compares to the other ones I have tried. I am a Directv customer and have watched Netflix thru my Play station 3 and Samsung Blue ray player both and have pauses in streaming playback.With this device I have had almost no pauses in playback. Great unit and I like the verbal search as well as the wonderful screen savers when I listen to Pandora music.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The reason this is getting 3 stars instead of 2 is because it says the definition of 2 stars is you don't like it, I do like it but it has some MAJOR shortcomings. First as others have said there is no separation of Prime material, since Amazon aims this towards Prime membership I don't understand why the problems exist with Prime.When you do search and find a movie or show available for free prime streaming it comes up with a \"Watch Now\" button but be careful for when selecting it, instead of getting view now with Prime membership it defaults to purchasing the movie, you have to scroll over to watch it another way then there at the bottom of the list is the option to select watch for free with prime. This even occurs the same for selections you have in your watchlist.It's strange Roku gets it right and Amazon's own product fails miserably.Second issue is they couldn't spend the extra 50 cents in the design to include an infrared receiver i the unit so you can use it with universal remotes like the harmony remotes. You have to use the provided remote only to control the Fire TV.  I didn't realize this when I purchased it or it probably would have changed my mind.  I don't mind using the remote for voice searching, but not being able to use my harmony remote to control other functions like you can with every other streaming device out there is bad design.If you have the choice between buying the Fire TV or the Roku, sadly to say for Amazon you might want to go with the Roku, it is a lot more user friendly and the sells for the same price.Update on another issue:I just realized when trying to view the Showtime Anytime app I can't get it.My cable company is on the accepted list for the Kindle Fire but not on the list for the Kindle Fire TV...Huh? How can this be possible for one Amazon product and not another, just because there is a word \"TV\" at the end.", "verified": true, "helpfulness": "5/5", "author": "I Want That"}]