[{"rating": 5.0, "review": "I have 3 Apple TV and I like it but when I bought Google chromecast  I love it!!!  It is not only cheaper but it also working better.  You can use with your laptop and all smart phones.  But we have to wait for more apps such as Hulu Plus to be available on Google Chromecast.  I bought 3 more of Google Chormcast for my relative and will plan to by the other 3 more for my best friends.", "verified": true, "helpfulness": "0/0", "author": "Natruedee Holtzclaw"}, {"rating": 1.0, "review": "Warning!!!!!!Do not buy this item!!!Do not buy this item!!!Unless you want a netflix player.  After the last update, Netflix and Youtube is all it does.  No Local streaming of videos or photosfrom your devices.  I already have five other things that are Netflix players. Thanks a lot Google.  Already sent it back.[...]", "verified": false, "helpfulness": "0/4", "author": "Jeff Chang"}, {"rating": 5.0, "review": "Setup;1) Opened box2) Plugged into HDMI port and USB port. TV turned on and changed to HDMI input.3) Instructions on screen direct you to the applications you can use to control the chrome cast using your phone/tablet or computer.4) (I used a tablet) Installed app5) Opened Netflix6) Started a movie7) Changed it from playing on device to chromecast.Neat things:1)  Chromecast will go to the stream source directly not through your device. This means you can turned off your laptop/tablet/phone once chromecast picks up the stream.2) You can swap the device controlling the Chromecast at any time even when something is streaming.Is this a roku killer? No. I have and use my roku just as much as before on my main TV. This device is more about changing a dumb TV into a smart TV and it does it well for a very small price.Here is one of the neat hings about this device. I then took my phone, opened up Netflix and had control of the chromecast with the phone. Your device i", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Short and sweet. Do yourself a favor spend a few extra bucks and go wither the Roku or Apple TV!This thing was hard to set up with terrible directions and troubleshooting tips.RETURNING MINE after day 1!", "verified": false, "helpfulness": "0/5", "author": "AA DC"}, {"rating": 5.0, "review": "- Why I bought this?I bought the Chromecast to stream Youtube and other videos to the TV, replacing my old method of connecting my laptop (and making the laptop useless while it streams).- What I think of it so far?After placing my order for this on the day it launched and receiving it about a month later, I can say it was well worth the wait! Playing videos for my kids on their TVs from my Nexus 7 while still being able to use my tablet is amazing. It takes about 5 minutes to set up and is really easy to use.- What operating systems I have used this on?I have used my Chromecast on Ubuntu 13.04 (64 bit) and on Linux Mint 15 (32-bit). To do this all you need is to install Google Chrome Web Browser and install the Chromecast Extension. It is very easy and simple to use on any device, such as phone or tablet. My Nexus 7 while streaming also does not lag at all or display any signs of a hiccup or sluggish performance.- Why you should buy this?Because it does exactly what it is described to do! The product is not the end all to video streaming, but it is a great alternative and at only $35 the cost makes the purchase a no brainer. If you want to free up device usage (or rather non-usage) due to streaming, such as a laptop, definitely buy one of these.", "verified": true, "helpfulness": "1/1", "author": "Justin"}, {"rating": 3.0, "review": "its a great product with a very affordable price. One negative is it needs improvement in streaming local video files. It is too choppy.", "verified": true, "helpfulness": "0/0", "author": "Hsan Win Htein"}, {"rating": 5.0, "review": "Easy to setup. Easy to use. Just a great product. Can't wait until more apps use it. very cool and easy.", "verified": true, "helpfulness": "0/0", "author": "David Sheehan"}, {"rating": 4.0, "review": "If you want the video streaming feature of a \"Smart TV\" but don't want to lay out the bucks this is a great option. If you have a spare HDMI port and a wireless home network you can stream Youtube or Netflix easily. Setup is easy all you need to know is your wireless password. I used my Android tablet and my Iphone to stream youtube within 2 minutes of opening the box. Picture quality on youtube is directly related to the quality of the video posted, HD streams as HD.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I don't have cable, most of my tv viewing is through Netflix so this is great for me.Casting off the PC works OK, but not great, depending on what your trying to cast. Netflix and YouTube cast very well from the PC.I am hoping that amazon and others will get on the list. Its really handy to be able to use my droid phone and tab to use as a remote.", "verified": true, "helpfulness": "0/0", "author": "Donald G. Depalma \"dd1969\""}, {"rating": 2.0, "review": "The only videos you can stream are You Tube and Netflix. I bought it for Amazon Prime instant stream video/movies. So read thereviews, if you want more than just that, get the Apple media player (3X more$)", "verified": true, "helpfulness": "1/2", "author": "C.S."}]