[{"rating": 1.0, "review": "Sorry for the bad review the device always took to long to load programs that I wanted to see. Yet my other devices worked fine.", "verified": true, "helpfulness": "0/5", "author": "laurence w robinson jr"}, {"rating": 3.0, "review": "Bought this to replace an aging Roku 1, and the majority of the time it works great. The remote works well, and the streaming quality is excellent. However, it seems to occasionally encounter a problem with Netflix that results in nothing streaming until I reboot the Fire TV. Hopefully this can be fixed in a future update, as it's a bit of an annoyance currently. Would give 5 stars if Netflix worked 100% of the time.", "verified": true, "helpfulness": "2/2", "author": "Shanon McKernan"}, {"rating": 3.0, "review": "Originally I had picked up a Roku HDMI stick at BJ's, problem is that is what painfully slow to load Netflix.I wanted the HDMI Stick version because it was compact and easily moved around to different TV's when called for.I ended up returning the Roku stick.I got the Fire TV on a try it for 30 days deal.Content is a little lame on the free Amazon Prime Video compared to Netflix.I ended up keeping it because I already get Amazon Prime shipping and hope that Prime Video picks up a bit.By then, they will probably come out with a new Fire TV box that's better and for less.After I bought this, prices seems to have dropped a bit on a regular basis from 100 to 85.", "verified": true, "helpfulness": "0/0", "author": "Mario M. Monti"}, {"rating": 1.0, "review": "My family just pruchased one amd it works as expected. But even when in standby (which it never comes out of and actually shuts down) it is a COLOSSAL bandwidth hog. 11 other decices and we have never gone over before. But the first month with the fire tv we for whatever \"mysterious\" reason. We went over our data limit. And again the next month. After two more months of this. I got the wise idea of unplugging the bloody thing. And we for whatever reason we used less than half of our 250gb data cap. This is frankly a rediculous issue but my famaly chose to use it again and It seemed to fix itself for two months. But it just went over yet again!! This is absolutely absurd!!", "verified": false, "helpfulness": "3/5", "author": "Noah Casey Koenig"}, {"rating": 5.0, "review": "Fast, great picture and sound...voice control is brilliant.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I believe that for the Amazon fire tv to truly shine it needs more apps. Watch ABC, HBO go and FIOS mobile to start. However despite that, the apps that are currently available work great, the picture and sound quality is awesome, I've had mine for just under 2 weeks and I'm loving it so far!", "verified": true, "helpfulness": "0/0", "author": "A. Kyei"}, {"rating": 4.0, "review": "Works as expected.  Provides me access to Netflix app on a TV that isn't wireless capable.  Prime videos work nice to.  Seems to be better picture quality that when I previously connected through my Kindle Fire HD.  Some issues with buffering but this appears to be due to my crappy Verizon Internet service.  Overall, very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "BD Fish"}, {"rating": 3.0, "review": "Sometimes very 'glichy'.  Audio will come through with a still picture.  '15 seconds ad remaining' will remain on the screen through shows after the ad break has ended.  I have to clear data and caches regularly to get apps to run smoothly.  Its still pretty neat though, it has the History app which I can't get on my PS3, along with every other app I can get on my PS3, and more.  It just doesn't always stream smoothly, which can be very frustrating.", "verified": true, "helpfulness": "0/0", "author": "J. R. Henderson"}, {"rating": 5.0, "review": "We like this more than we anticipated. The picture on the Amazon Fire TV is MUCH clearer than the picture we get using the amazon or netflix programs within the Wii or Playstation 2. I am using it with a projector and the picture clarity is markedly improved.I really like the fact that it searches across various services rather than just within the Prime tv/movies. There are a lot more other services available (an app with free documentaries, selections from the history channel, etc.) which is kind of nice since we do not have any television/cable coming into the house, just amazon and netflix.It seems like a little thing but I absolutely love the voice search. Using the wii or playstation controllers to search for things one letter at a time was a bit of a pain. So far I have not had any issues with it not recognizing what it is that any of us are trying to say.", "verified": true, "helpfulness": "3/4", "author": "L. Welch \"instigator\""}, {"rating": 2.0, "review": "cant get it to work", "verified": true, "helpfulness": "1/6", "author": "esther steen"}]