[{"rating": 5.0, "review": "Doe's just what it's supposed to. Enjoy streaming my music, and video to the home big screen from any device.", "verified": true, "helpfulness": "0/1", "author": "Rik Hart"}, {"rating": 3.0, "review": "Just got one and liked it a lot at first. Does what it advertises. It works great with Netflix off my laptop (I have not tried it from my phone or tablet). I like that I just open netflix in a chrome tab, cast it to the tv, then I can do whatever else I want on my computer and still use chrome for internet browsing in the other tabs. The quality is solid although real big tech/video people would possibly feel the video quality could be better but I was satisfied with it on an HDTV. It did not work or look very good with youtube however so I cannot give it 5 stars. I think this was overall a great idea and a cheap alternative to the other options. I also own an older smartTV and now that it is old, it feels slow and a little annoying even though the newer ones are much better I am not going to get a new TV because of it so I think options like this are better because they are cheap and can be replaced in the future if needed.My major issue is that it will not stay connected to my wi-fi. Each time I use it I need to unplug and restart my router because Chromecast keeps disconnecting from my network. Even when I have just watched a movie on netflix and go to start a new movie it drops the wi-fi connection even between that with Chromcast being on the entire time. This issue is getting old and makes me question whether I should have just went with a Roku.Pros: simple to use, cheap, can stream from chrome browser while still using your computer for other stuffCons: Keeps dropping wi-fi connection between each use and even between changing netflix movies. Youtube had poor quality for me, it still needs a power source so if your TV is hung on a wall your TV better have a USB port or you'll have to run a power cord to a nearby outlet.", "verified": true, "helpfulness": "0/0", "author": "PenName25"}, {"rating": 1.0, "review": "Worked great for a couple of months but then had issues connecting to the TV. When I called customer service which promised a warranty replacement, i got the run around for a few days before they said they could replace it with scanned copies of receipts, signing up with Google Wallet and a hold on my credit card, etc, etc.Just not worth all of that trouble", "verified": true, "helpfulness": "1/2", "author": "Tony Kirke"}, {"rating": 3.0, "review": "This is a fabulous idea in theory, but this version of the execution needs a lot of improvement. It's not as intuitive to set up as you might be led to believe, its response time is a bit slow, and the picture quality isn't as great as it seems like it should be. (I'm using ultra-high speed internet connection, large screen LED television, and computer updated with the latest versions of everything.)Still, at $35 and change, it's an interesting experiment, if nothing else. I am eagerly awaiting Chromecast v.2.", "verified": true, "helpfulness": "2/3", "author": "Ginger S. Baldwin"}, {"rating": 4.0, "review": "very simple to use as soon as i plugged it in to my tv i just went straight to my phone hit  youtube and bang up and running. needs more apps google is pretty good at updates so expect a flood of apps coming up.", "verified": false, "helpfulness": "0/0", "author": "buggingout67"}, {"rating": 5.0, "review": "It is very simple to use, and I can move it to different tv's if i want or whenever I need to!", "verified": true, "helpfulness": "0/0", "author": "Kevin A McLaughlin"}, {"rating": 1.0, "review": "had no instructions with product.  When I first heard about Chromecast it sounded to good to be true.  Still have not been able to figure out how it works.", "verified": true, "helpfulness": "0/1", "author": "gs"}, {"rating": 1.0, "review": "I was really excited about streaming my favorite shows on my HD TV when I ordered it.  The reality is that unless you only stream from Netflix, (currently $7.99 for live streaming only) or from the limited list of available titles on YouTube and Google Play, Chromecast is worthless.  I would strongly suggest looking into Roku for a much, much broader offering of live streaming channels and titles.  Sorry Google, you struck out.", "verified": true, "helpfulness": "1/2", "author": "Feeling blue"}, {"rating": 3.0, "review": "It's cheap and an easy way to watch netflix on your tv but it has it's downsides. A lot of the time the netflix app is not synced correctly with the tv causing you to be unable to pause or stop a movie without turning your whole tv off. I wish there was an actual remote and apps on the device as opposed to streming from your cell phones apps", "verified": true, "helpfulness": "0/0", "author": "Rayman Jilani"}, {"rating": 3.0, "review": "For $35 I was not expecting a media server but the fact that even when you can get it to connect (via a tablet running Win8 not RT) it is choppy and unpredictable. Your wireless router will need to be rather close to avoid choppy video play through and if you want a native streaming app and do not have a home server then you will be mostly out of luck if you are running a full OS. Over all I think that this is a good product but more novelty than solution.ed: after playing around with my network settings and ultimately replacing the dying wireless router the performance has improved emincly. I am now able to stream youtube video without problems as well as cast tabs. Still no good option for casting media files if you are on a native os client without an app but worth the purchase.", "verified": true, "helpfulness": "0/0", "author": "Trent McKenzie"}]