[{"rating": 3.0, "review": "This was ok, but without HBOGO I can get all of the content on my Kindle Fire.  I sent it back after trying it out for a couple of weeks.  Someone who doesn't have a Kindle Fire or care about accessing HBOGO would probably be more satisfied.", "verified": true, "helpfulness": "1/2", "author": "Maria E. Jauregui"}, {"rating": 4.0, "review": "Never having any of the other streaming devices like Netflix, Hulu, etc., we are fairly new to this concept. The device was very easy to hook up and access. We are Prime members. There appears to be a lot of \"free\" movies to choose from, but it took a while to realize which ones are free and which have a fee; It took awhile to grasp what all the jargin means. It would be nice if there was an online catalog of the free movies, so you can just scroll through the list and choose one. Rather than having to know the name of a movie or choose a lette, and find out if its free before you select it. That's about the most cumbersome feature at this time. If they can improve this, it will be a great device. Another note, people need to be aware that it does use up your internet memory, something we did not even think of, especially if you have other devices like ipads, computers, that you use to streamline thru your WiFi.  Otherwise, it does work well and we really like the concept.", "verified": true, "helpfulness": "0/0", "author": "livermore chic"}, {"rating": 2.0, "review": "You are stuck with whatever Amazon offers. It is not like Kindle where you can download apps. No browser, no apps.", "verified": true, "helpfulness": "2/6", "author": "MOHAMMED MOHIUDDIN"}, {"rating": 5.0, "review": "Have enjoted the movies. No longer have to go to the store for a movie", "verified": true, "helpfulness": "0/0", "author": "red star"}, {"rating": 4.0, "review": "Had a download problem with Netflix/House of Cards initially. Seems to be okay now.", "verified": false, "helpfulness": "0/0", "author": "JOHN J LUNT"}, {"rating": 4.0, "review": "An awesome product. Small and easy to use. It may replace my xbox 360 as the steaming device for the main tv in the house.Sometimes it has to stop and load as you are watching a movie. It has not been a constant problem.It would be nice if you can use the voice search while in an app.", "verified": true, "helpfulness": "0/0", "author": "C. Ramirez"}, {"rating": 5.0, "review": "It is a very attractive and function little device. I bought this for my fiance as a gift, and we both love it. We also have a roku, but prefer the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Brittany Schultehenrich"}, {"rating": 2.0, "review": "Works OK.  Like the voice feature.  Pull the power plug when not using it.  It appears to use band width when not in use, slows down all users very noticeable. Easy fix to just to unplug power.  Like the feature of putting picture on Amazon cloud for presentation.", "verified": true, "helpfulness": "2/3", "author": "Michael C"}, {"rating": 5.0, "review": "Works perfectly!  streams our HULU, Netflix and now Amazon Prime shows and the voice command option is a cool feature.", "verified": true, "helpfulness": "0/0", "author": "S. Huber"}, {"rating": 4.0, "review": "Great streaming system but, sometimes it locks up.", "verified": true, "helpfulness": "0/0", "author": "Craig Woods"}]