[{"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Manuel E. Apodaca \"manjan\""}, {"rating": 1.0, "review": "Not what I expected.  Had problems with sound and it needs another I'm put method...what a mess!!!", "verified": true, "helpfulness": "0/0", "author": "lori bowman"}, {"rating": 4.0, "review": "Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Randall Offner"}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Luciano Castellini"}, {"rating": 4.0, "review": "This is a great, cheaper alternative to Apple TV. Works perfect for our master bedroom!", "verified": true, "helpfulness": "0/0", "author": "Megan Miles"}, {"rating": 5.0, "review": "A good gift at a good price.", "verified": true, "helpfulness": "0/0", "author": "Psdenno"}, {"rating": 5.0, "review": "I love my Chromecast Media Player! The only improvement I could have wanted was a remote control with it.  In a nutshell, it \"casts\" whatever you have up on your Google Chrome browser to your TV to see at a decent size. Reception and resolution appear to be very good (this is much determined on your own wifi strength of signal and carrier). What is listed as HD does come across the cast in high resolution. For the price, it's a great add on to long winter evening viewing.You can control what you view from your smartphone, tablet, laptop or computer so long as you have a wifi connection. I understand that Amazon's Fire has a remote (which I favor) but all the search activity from the Fire begins with Amazon products, especially things accessed through their Prime feature. I'm happier with a totally free search option without having to filter through Amazon first. Google Chromecast allows for that.", "verified": true, "helpfulness": "0/0", "author": "Pauline Easter"}, {"rating": 4.0, "review": "Simple to operate and install.  The software supplied was not the latest and the update download was very lengthy.  Frustrating!", "verified": true, "helpfulness": "0/0", "author": "David Garman"}, {"rating": 5.0, "review": "My favorite Christmas purchase.", "verified": true, "helpfulness": "0/0", "author": "Kenya \"kenya4indy\""}, {"rating": 5.0, "review": "Buenisimo", "verified": true, "helpfulness": "0/0", "author": "Blas Ojeda Chamorro"}]