[{"rating": 4.0, "review": "I purchased this as a Christmas gift for my mother.  She was confused about exactly what it was at first.  Later on she still did not understand what she could do with it.  The setup was slightly frustrating to me and I usually have no issues doing this sort of thing.  I wasn't following any guides or instructions though, I was just trying to fumble through it.  You get the Chromecast app on your smart phone first. After that connect to the dongle through wifi and then set up the options as you are prompted on the screen. After that you just use the Youtube or Netflix apps to select the videos you want to watch.  I showed that to my mother and she loved it.  She binged a full season of a TV show within the first week and she had never figured out a way to stream shows that she enjoyed before this.  One issue was that she came to me within a week and said it switched back to only playing on the phone.  I showed her how to switch back and forth between the different stream options at the top of the Netflix window.", "verified": true, "helpfulness": "1/1", "author": "Another Reviewer Again \"BishopCoxcomb\""}, {"rating": 5.0, "review": "I am using it with a Apple laptop and it works surprisingly well! It  took a bit to hook up…the casting and silverlight were a pain to get figured out but I am not super computer literate. Now that it is up and running it works great!", "verified": true, "helpfulness": "0/0", "author": "Kellye N."}, {"rating": 4.0, "review": "I use it often and love it. I generally use app from my HTC phone and get a great picture, no one can see a difference in the picture quality. I tried another device that didn't have consistant picture quality. This is a great item for the price. It is easy to carry an install on any TV with HDMI.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 1.0, "review": "Doesn't do much other than a few menial things. Cant stream movies so what is the point of having it?", "verified": true, "helpfulness": "2/5", "author": "Jo jo and the gang"}, {"rating": 4.0, "review": "I bought this just before Christmas, a few days too early as a few days later all of the special deals came out.I like it because I can use this device in any of my TVs without much trouble. Bought short HDMI cables for each TV, so that I can just plug this device in in my office, living room, bedroom, kitchen, etc. and watch Netflix or HBOGo. Used it for Holiday Music via Pandora as well.Was disappointed that I could not stream my regular web content from my phone, i.e. my German TV shows. Google has a Beta version of the Google Cast, that did not work very well on my computer. I was able to stream  home videos from by tablet.Only a 4 because of limited app offerings and the lack of my being able to stream web-content other then the apps.", "verified": true, "helpfulness": "0/0", "author": "CHRATCAL"}, {"rating": 5.0, "review": "Works perfectly well. Extremely easy installation in the HDMI slot of the TV. I have 2 laptops and my Kindle Fire HDX Wi-Fi 4G LTE tablet connected all through a home network using a NETGEAR router model WNDR 3400 v2 . I enjoy watching Netflix movies and TV series without a glitch! Nicely priced too.", "verified": true, "helpfulness": "0/0", "author": "Alexandre Joannou"}, {"rating": 2.0, "review": "It worked for about four different movies, then stop working, I call for assistance and they gave me some things to do and it still did not work  what can i do now?", "verified": true, "helpfulness": "0/0", "author": "Heath b morgan jr"}, {"rating": 5.0, "review": "One went on the basement TV so I could watch Netflix while I work out or listen to music.  The other went in the back of my receiver for some music in the living room.  It's sooo simple to use and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Wreckinball"}, {"rating": 3.0, "review": "The lack of 5Ghz is disappointing, and the lack of apps compared to Roku 3 shows the weakness in this product. The big pro is the fact it can run off USB which is a huge plus and the size of the unit.If Google would listen I suggest: 5Ghz support, USB support to accept flash drives and additional support of apps and integration into other browsers like Firefox.For now I'm going to keep this b/c the wife only uses it for Netflix which it works great for. But I'm also going to keep the Roku 3 as well.", "verified": true, "helpfulness": "0/0", "author": "AF"}, {"rating": 3.0, "review": "I received this before christmas and thought it was a pretty clever device. Then I received Roku for christmas, and have not used the Chromecast since. You need your computer to load everything you watch. Unless you keep your computer on, you cannot pause, rewind or anything else. It costs about a third of what Roku does so for the price it is OK; but , since I have the Roku,  the Chromecast is just collecting dust.", "verified": true, "helpfulness": "0/0", "author": "RustyB"}]