[{"rating": 5.0, "review": "Very good price for what it does.  You will not be disappointed.  I have not had any problems with product.", "verified": true, "helpfulness": "0/0", "author": "Scott Miller"}, {"rating": 4.0, "review": "It was very easy to install and works as advertised.  But Chromecast is still very limited:  From iPhone only UTube and Netflix and from my laptop PC limited to UTube, Netflix and anything viewed on my Chrome browser.  More apps need to be added to really compete with Apple TV and Rocu.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 3.0, "review": "Don't buy this expecting to beam video from notebook screen. It doesn't have the processing power (and never will) to transcode on the fly. Watch slideshows, yes. Bore people with PowerPoint, sure. But no video.I'll stick with my Roku for watching Netflix and the occasional YouTubing.", "verified": true, "helpfulness": "0/2", "author": "SmallNetBuilder"}, {"rating": 3.0, "review": "So far so good. I got this just to stream Netflix to tv and the price was right. However setting it up was not as easy as advertised. A cinch on tv but on my iMac not so much, finally my sister got it to work, not even sure how.", "verified": true, "helpfulness": "0/0", "author": "amazonite"}, {"rating": 4.0, "review": "IF this device was from some little company I never heard of I would only give it 1 or 2 stars.  But since it is from Google and thus I believe they will support this and other vendors will make code available it should work pretty good in the future.  Right now it is problematic.It only cost $35 & I was one of the lucky ones that bought it when the promotion for 3 free months of Netflix (new and existing customers) was available.  Thus it only really cost me $11Right now it supposedly supports Netflix and YouTube with Google Chrome (in beta).  I have it plugged into my smart Vizio 47\" TV that also has these apps built in.  My TV apps work much better than the Chromecast does.  Chromecast has several pauses and hangs using Netflix.One thing that I was disappoint with on Chromecast it that it only supports 2.4 and not 5.0 GHz.  It kind of works now, but will do so a lot better in the near future.  Worth the money, but you have to be patient.", "verified": true, "helpfulness": "0/0", "author": "Rick K"}, {"rating": 5.0, "review": "Now I can put my other television to good use.  Chromecast is easy to set up, and most importantly, easy to use.  What a great little piece of technology.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"cceasar\""}, {"rating": 1.0, "review": "Surprise!  It shipped a month after ordering it and surprise, no Netflix three-month discount as advertised.  It doesn't really do anything -- well -- that I can't get my Internet TV or Roku to do.  Sure, you can watch a show on your PC browser and have it show up REALLY fuzzy on your TV simultaneously.  (And yeah - I have great WiFi so it's the product not the user with the issue.)  But I could do that WELL with an HDMI cord and my CPU or laptop.  Maybe down the line, they'll improve it but I bought it because it was a great deal with the Netflix discount they conveniently \"ran out of.\"  It's pretty much a waste of money.", "verified": true, "helpfulness": "2/12", "author": "cp \"Cher\""}, {"rating": 4.0, "review": "Chromecast is great, now I have Netflix streaming on a dumb TV, it works very well. If Google delivers on the promised feature set it will be even better. The price is also right.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Sandrigo"}, {"rating": 3.0, "review": "So the 35 dollar Chromecast is suppose to be the device of the future? I should have bought it at a future date. It is pretty much useless unless you want to pay $1.99 for any TV episode you want to watch. You can watch Utube videos on it for free (oh boy!) or you can subscribe to Netfix and pay some more money. It doesn't work with HBO GO, Kindle or really anything else. Three apps and that's it.", "verified": true, "helpfulness": "1/2", "author": "ron burkett"}, {"rating": 5.0, "review": "Great Product! Works as adverised and should only get better as it matures.  Things are so easy to buy on Amazon!", "verified": true, "helpfulness": "0/0", "author": "Orlando Dozier"}]