[{"rating": 4.0, "review": "It was a pain in the rear to set up.  Check the setup requirements, i'm a savvy network administrator and I did not have a single device at home that was capable of setting up the chromecast w/o significant upgrades.  It was further complicated by no broadcasting the SSID of my network.  This required a call to google tech support.  Several days later they sent an e-mail w/ some suggestions, though they seemed stumped.  It mysteriously started working.There is NO user interface whatsoever which is a smidge annoying but it has worked quite reliably since getting past the installation troubles.", "verified": true, "helpfulness": "0/0", "author": "Matt Monsour"}, {"rating": 3.0, "review": "Easy to install.Can not view video at HD and full screen.  Video and sound not synced, (think old Godzilla movie with dubbed voices) video drops out and sections of picture go missing.IF I reduce resolution to 144dpi or 240 max these problems disappear.Internet connection is 20mb and WiFi is high band.  Expected a lot more from Google.You get what you pay for, $30 and you get low end video.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "good buy and work great.  you can watch the entire program without the pc connected you need the pc only to get the chromecast hooked up and once hooked you can let go or turn of the pc", "verified": true, "helpfulness": "0/0", "author": "ravi devanaboina"}, {"rating": 3.0, "review": "Good product, but there aren't a lot apps for enjoy. It will be wondefurl if included more apps like games and other themes.", "verified": true, "helpfulness": "0/0", "author": "Isanclemente"}, {"rating": 3.0, "review": "I bought this because the price was right for the technology I wanted to experiment with it. I see where this Chromecast has future potential but at this point it didn't bring me anything I wasn't already getting in a more convenient way. As a conspiracy nut I'm wondering whether Google just figured a way to get a bug inside our homes.", "verified": true, "helpfulness": "0/0", "author": "2 Tone Tommy \"tommy d\""}, {"rating": 4.0, "review": "Chromecast allows me to stream movies, videos, or just my browser on my already smart TV.  Very nice and stable.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "I have an iPhone so the only apps that work for me is the Netflix app and some other one.  There is no resolution degradation at all (if you have a good wifi connection), and in most places people do.  But I watch a ton of Netflix, so this was definitely worth $30.", "verified": true, "helpfulness": "0/0", "author": "Raihan M. Ali"}, {"rating": 4.0, "review": "Plug and play is nice.  Only watched two movies, both seemed a little under HD.  Other than that; it worked well.", "verified": true, "helpfulness": "0/0", "author": "Allan Dutch"}, {"rating": 3.0, "review": "I suppose the product works fine but it didn't do what I thought it could do. Basically it did what I was already capable of doing with my blue ray player.", "verified": false, "helpfulness": "0/0", "author": "Elizabeth Monticelli"}, {"rating": 3.0, "review": "I bought the Chromecast with the thought that it might be a great little home theater gadget comparable to the Roku but at half the price. I bought into it in the first few days. I've been running it on my office TV since Netflix and YouTube were the only options.It works for what it's designed for, piping internet videos to your TV by using your phone. What it doesn't do well is integrate into a theater or living room set nearly as well.First, the lack of even a basic remote like the Roku has is greatly limiting it's functionality and integration capabilities. You cannot use the Chromecast with a Harmony of URC remote.Second, the software, though improving all the time, isn't as robust as I'd like. It's not uncommon for the phone (acting as remote control) to somehow lose connection to the device and need to be resynchronized. About half the time, this is accompanied by the video stopping. Frustrating and completely lacking in polish.For me, the Roku (which supports far more sources, including Amazon) is the much better choice. For the few extra dollars you get a larger library, a real remote, and a more solid, consistent user experience.", "verified": true, "helpfulness": "1/1", "author": "M. Barland"}]