[{"rating": 1.0, "review": "After buying Amazons Fire TV I discovered that the outputs of the Fire TV were  not compatible to any of the assorted inputs on my Sony model# KF WE 610 LCD Projection TV. I had to  research for myself what I would need to connect it and I still am looking.  Funny, with close to 40 years of Electronic experience under my belt, I find that if a product requires more education and experience than I have, then it is not packaged and supported properly.Make your product easy to buy and with directions and required equipment to install for all models.HTML5-based System for Interoperable 3D Digital Home ApplicationsDOI Bookmark: http://doi.ieeecomputersociety.org/10.1109/ICDH.2012.21Digital home application market shifts just about every month. This means risk for developers struggling to adapt their applications to several platforms and marketplaces while changing how people experience and use their TVs, smartphones and tablets. New ubiquitous and context-aware experiences through interactive 3D applications on these devices engage users to interact with complex 3D scenes in virtual applications. Interactive 3D applications are boosted by emerging standards such as HTML5 and WebGL removing limitations, and transforming the Web into a horizontal application framework to tackle interoperability over the heterogeneous digital home platforms. Developers can apply their knowledge of web-based solutions to design digital home applications, removing learning curve barriers related to platform-specific APIs. However, constraints to render complex 3D environments are still present especially in home media devices.CITATIONMikel Zorrilla, Angel Martin, Jairo R. Sanchez, Inigo Tamayo, Igor G. Olaizola, \"HTML5-based System for Interoperable 3D Digital Home Applications\", ICDH, 2012, 4th International Conference on Digital Home (ICDH), 4th International Conference on Digital Home (ICDH) 2012, pp. 206-214, doi:10.1109/ICDH.2012.21", "verified": true, "helpfulness": "3/18", "author": "Experience over Youthful Opinion"}, {"rating": 5.0, "review": "This device when coupled with Amazon Prime and the 8.9\" kindle Fire HDX have proven to be a great combination.", "verified": true, "helpfulness": "0/1", "author": "Grandpa"}, {"rating": 5.0, "review": "Finally I got it hooked to my internet. I thought I had the right password but I didn't.  But now I do and I'm really enjoying it.  It really boosted my TV. It's like being at the movies at home.", "verified": true, "helpfulness": "1/1", "author": "RaAnn Nerud"}, {"rating": 5.0, "review": "This is the best media hub I have used. Moving between the different apps and games was very smooth and fast. The video and sound quality is excellent. I hope that Amazon updates this so the different applications such as Netflix, Hulu is at integrated as the Prime videos. And Plex app works great as well. Though it does have some bugs and some polishing needed to make a solid app.", "verified": true, "helpfulness": "1/1", "author": "cmefly"}, {"rating": 2.0, "review": "I WAS very excited about this item, but i could not get it to stream video.  My xbox does a decent job and thought this would be a big step up.  Wrong!  Could not connect to wifi signal and the item does not really prompt you about what is wrong it just sits there or the screen goes black.  I returned it thinking defective same thing with replacement.  It looks cool and interface is nice but does not work.", "verified": true, "helpfulness": "1/4", "author": "Izabella1541@gmail"}, {"rating": 5.0, "review": "I have been using a Rocu for 8 years now and it worked good but you had to pay Netflix to use it for anything worth while. I am a Prime member so this has many free movies and TV series. Great picture quality also", "verified": true, "helpfulness": "1/1", "author": "Larry E Smith"}, {"rating": 4.0, "review": "I really like the potential and first experiences that I have had with the Amazon Fire TV. For me, the only drawback so far is the limited storage capacity (8 GB) and a USB port sitting unused that could expand its storage (with my 80 GB USB hard-drive).I bought it for streaming and for inexpensive gaming. For the past couple of years, I've invested in the Amazon digital ecosystem (Music, Apps, Films) and like that the box will make most all of this accessible to me on my television.StreamingI have had an overall positive experience streaming with Hulu, Netflix and Amazon content.It could still use some work on its...  > Menu: The interface still needs some work...some things can be buried.  > Channels: It has the channels I watch most, but compared to the Roku I have, I still switch back and forth in order to access content I have on my USB portable harddrive and for some channels not yet offered. I imagine that the channel list will eventually include MLS and NHL apps, and that the USB port will open up for storage devices.Gaming  > Controller: My Ouya controller connected and plays fine. It actually supports a good amount of other controllers.  > Quality games: Games that are fun, don't require major time commitment (exception: Telltale games: The Walking Dead, Wolf Among Us), yet still build continuity through sequencing short missions into broader stories (Castle of Illusion, Modern Combat 4, Dead Trigger 2, Asphalt 8, Deus Ex: The Fall, Riptide 2)  > Potential: There are actually a lot of android games that I would love to see come to the Fire TV and so I am looking forward to what becomes available and making it easier to see what is available.  >Storage: You can only store a few of the graphics heavy games (the kinds I like) without running into storage problems. This could easily be resolved by opening up USB storage capability. Otherwise its delete a favorite, download a new, then maybe delete and re-download favorite again.I bought the fire primarily for the gaming experience. I am not a hardcore gamer, but am fascinated by the idea of inexpensive and well produced games and gaming systems. I supported Ouya and look to Amazon to do it better. The games I have played and are offered are really exactly what I expected and have really enjoyed playing on the television (Asphalt 8, Castle of Illusions, Dead Trigger 2, Hungry Shark Evolution). I don't have the time for role-playing games or drawn out strategy games anymore, so these are the perfect sit-down and play games that are still a lot of fun, but can be put away rather quickly. The telltale games are also a great offering, though I have those already on PC. The main problem for me is the limited storage space, so that I can only have a few of these ready to play. If I would like to play something else, I have to delete one of my favorites (to re-download later) and then download the new game. The games I enjoy playing take up a lot of space and coupled with my wifi, they can take a bit of time to download. This problem would be resolved if I could use my USB drive to store and launch games.", "verified": true, "helpfulness": "5/5", "author": "Kr \"richards113\""}, {"rating": 5.0, "review": "I love this device. After getting it I even stopped Netflix after being a member for 10 years.", "verified": true, "helpfulness": "1/2", "author": "JimmyBeverlyHIlls"}, {"rating": 5.0, "review": "no comm.", "verified": true, "helpfulness": "1/4", "author": "HECTOR RAUL NUNEZ"}, {"rating": 5.0, "review": "Great device, especially if you're a tinkerer, excellent hardware, and not so locked down that you can't do what you want with it.", "verified": true, "helpfulness": "0/0", "author": "S. Edwards"}]