[{"rating": 5.0, "review": "It does everything I need it to do.  Just download the app to your phone or computer and GO.  A nice product.", "verified": true, "helpfulness": "0/0", "author": "Louis Musmeci"}, {"rating": 5.0, "review": "Everything about this item was good.Thank you.", "verified": true, "helpfulness": "0/0", "author": "Wameedh"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Richard Kevin Townsend"}, {"rating": 3.0, "review": "Harder to set up than anticipated Get some pausing in programs going to tv", "verified": true, "helpfulness": "0/0", "author": "Neil Magness"}, {"rating": 3.0, "review": "I thought that I will be able to stream videos and other content directly from my computer and devices. However everything has to go through the Google chrome browser. I’m on a budget and wanted something cost effective and wireless to stream videos from my computer. However, with my basic internet service all videos even the lowest possible 420p resolution come choppy and freeze up. I knew the information goes through my router but I thought it was more of a wireless service. I didn’t expect that all my saved content has to go online and the picture quality will depend greatly on my internet speed. I’m able to watch YouTube videos on my laptop at HD quality but when I try to stream them to the Chrome device they are unable to play even at the lowest possible resolution. I test it at my friend who has same router and faster internet plan and it worked fine– so the problem was not my router. It is a good device as long as you have more than basic internet service.", "verified": true, "helpfulness": "1/1", "author": "Marin"}, {"rating": 4.0, "review": "Inexpensive and very useful. My only complaint is that it is never explained that the Chromecast is just a virtual monitor; it has no inherent smarts at all, and is just a place to send content from your phone or computer. If you turn your computer off, that picture slideshow ends because it was not running on the Chromecast, but in your browser. I would have liked that this limitation was better explained before my purchase.", "verified": true, "helpfulness": "0/0", "author": "MyrddinE"}, {"rating": 5.0, "review": "The Chromecast is a great little tool to make any TV a smarter TV! The only gripe I have is more with Sling and less with Google, the Slingplayer for Chromecast will only work with newer Slingboxes, so check your model to see if it is supported before buying if you plan on using Slingplayer. I was disappointed to find that my Slingbox Solo is not supported, it works great everywhere else but the Chromecast, so now I will have to update to a newer box if I want to use it. A workaround I found is to use my phone Slingplayer app and mirror the display through the Chromecast, but of course the phone is then running the stream and will kill your battery pretty quickly. Happy Casting!", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Goog product", "verified": true, "helpfulness": "0/0", "author": "yogev"}, {"rating": 5.0, "review": "Awesome, but one for each TV in the house.  Great interface, plenty of streaming options, easy controls.", "verified": true, "helpfulness": "0/0", "author": "SB619"}, {"rating": 2.0, "review": "Not what I expected.  Settings are not clear.  More instructions are needed.  I can get better access via my blu Ray player.", "verified": true, "helpfulness": "0/0", "author": "Dorothy M. Reina"}]