[{"rating": 5.0, "review": "Google hit a homerun with this device; it makes much more sense than Google TV.  I am able to stream movies, music, pictures, pdfs, tabs from Chrome, and more.  Make sure your pair this device with the right app: AllCast, LocalCast, BubbleUpnp, Avia player, Mirror, etc, so that you can use it to its full potential.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 3.0, "review": "Let me start by saying that I have technical skills. I understand how networks work and can connect many different devices to my home network. This device required changing the way my wireless router was configured. What a headache! You must have your wireless router configured to 2.4GHz. I will not work if your router is 5GHz (which most routers are configured to). If you don't understand what you just read - DO NOT BUY THIS GOOGLE CHROMECAST! It took me 1.5 hours to Google 4 different websites to get this information, reset my router to factory settings, change my passwords and settings on all of my devices (3 tablets, 4 cellphones, and two laptops). This device needs more in-box instructions. You should NOT have to troubleshoot this and reconfigure your network. Now that I have it set up, it's easy to use with Netflix. That's the only reason it gets 3 stars.", "verified": true, "helpfulness": "0/0", "author": "Miki"}, {"rating": 2.0, "review": "Could not activate because the kindle tablet would not log on to setup instructions. Also, would not have purchased in first place if chromecast ad would have stated a tablet was needed to function as the remote.", "verified": true, "helpfulness": "0/0", "author": "Gabriel A Pons"}, {"rating": 3.0, "review": "I really like this proDuct, but the advertising was very was very misleading about what you could actually view on the TV. I would but it again.", "verified": true, "helpfulness": "0/0", "author": "J. Bennett"}, {"rating": 4.0, "review": "My only complaint is that I can't use it to stream Amazon Prime.  Otherwise, I love this!  It was simple to install and can be easily moved from tv to tv.", "verified": true, "helpfulness": "0/0", "author": "Kristy L. Mundell"}, {"rating": 5.0, "review": "This is a great deal!  Our family watches YouTube, NetFlix, etc. from our mobile devices. It is not complicated to switch between Chromecast & cable. Great device!", "verified": true, "helpfulness": "0/0", "author": "M. Ament \"mhoward8\""}, {"rating": 5.0, "review": "The chrome was easy to set up, and we love that you can run the apps in the background of your device while it's being used.  In addition, it's simple to move it from one TV to another, so there's no reason to buy more than one for most families.", "verified": false, "helpfulness": "0/0", "author": "Krystle Norman"}, {"rating": 4.0, "review": "This is perfect for anyone who wants to cast their PC or laptop onto a big screen TV.  I would've given it five stars, but it has limited usage with an IPad and doesn't work with Amazon Prime Instant Video at all.  Despite these major disappointments, I would recommend Chromecast especially to those who don't have Smart TVs.  You can't beat it for the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Lady"}, {"rating": 5.0, "review": "Easy to setup, great possibilities.. Google kicking one more time.. Great Package, very intuitive. Netflix, YouTube.. I hope to see more apps digging the Chromecast deal.. Hello Facebook!", "verified": true, "helpfulness": "0/0", "author": "Jesse Capanema"}, {"rating": 5.0, "review": "If you don't have an xbox or another type of streaming device this is the thing for you! There is tons of apps out there as well so that you can use chromecast to your advantage.", "verified": true, "helpfulness": "0/0", "author": "joshua"}]