[{"rating": 5.0, "review": "I love my chromecast. It has a little issue connecting every now and then and sometimes I have to unplug it and plug it back in, but I love using it to cast tabs from my chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Icky doo"}, {"rating": 4.0, "review": "Chromecast is easy to setup, easy to use, and a great device.  Chromecast is surprisingly small; not much bigger than your average USB flash drive.  The list of apps that are compatible with the Chromecast seems to be ever growing and you can now stream from Google Chrome on your laptop with the click of a button.  It's amazing how inexpensive this device is!! The only negative in my opinion thus far is that streaming from Chrome on an Android device requires a work around and is not compatible with Chrome on an Apple device.", "verified": true, "helpfulness": "0/0", "author": "MK \"makdaddy\""}, {"rating": 3.0, "review": "No es tan rápido en su conexión como esperaba, algunos errores al emparejar", "verified": false, "helpfulness": "0/0", "author": "ender"}, {"rating": 4.0, "review": "Needs to be open source so developers can harness the capabilities of the technology and let consumers stream what they truly want, not just a few apps Google can make money off of. Similar to android, needs to be rootable. Amazing product regardless. High quality and so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Patrick Kenslea"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "ANGELA SATIZABAL"}, {"rating": 5.0, "review": "Love this little bit of technology.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Anything you watch in a browser you can watch on your television. Cut the cords and get a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Vernon Dunmore"}, {"rating": 5.0, "review": "I love this! It's great.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great. I use it all the time instead of watching TV. I Stream Netflix, My Anime anything. works great and hasn't given me any major issue. only complaint is that sometimes itll disconnect and the show will either continue til the end which Isn't too bad or it will suddenly stop and go back to the waiting for a connection screen.", "verified": true, "helpfulness": "0/0", "author": "sebastian"}, {"rating": 3.0, "review": "doesnt do all it supposedly did", "verified": true, "helpfulness": "0/0", "author": "Bucky"}]