[{"rating": 5.0, "review": "makes streaming way easier with the combo of the 64gb memory stick", "verified": true, "helpfulness": "0/0", "author": "Gino"}, {"rating": 5.0, "review": "I love it very much specially, compere to the other comparable devices that I have seen.I have both fire TV and fire TV stick, it was easy to install blue tooth keyboard on fire TV but I have notfigure out how to install the keyboard on fire TV stick.But anyway, I love both of them and I have connected to each TV in the house.", "verified": true, "helpfulness": "1/1", "author": "Saeed Taraji"}, {"rating": 5.0, "review": "Have not used yet but my daughter says it's a good idea", "verified": true, "helpfulness": "0/1", "author": "Sexynails"}, {"rating": 5.0, "review": "Works great and small. Tucked behind my tv and works great", "verified": true, "helpfulness": "0/0", "author": "brandon wilder"}, {"rating": 5.0, "review": "I love the device but I've been having a problem with the video not showing up after the FireTV goes to sleep. I can hear that it comes on but there is no audio. I may have to return it for an exchange.The voice search is great and the fact that the phone app works equally well for both the FireTV and the FireTV Stick is great. However, I wish that the voice search/interface worked inside of the Apps. I also wish that the search function looked inside the apps (I.e. Searched Plex for the video you just looked up. This function seems to work for Hulu pretty well). Filtering needs to be improved. For example, I sometimes want to be able to search for items that are included with Prime only and not have to search from a computer or click on the item before finding that out.What is also interesting is that I haven't noticed much of an improvement in my experience from the FireTV Stick in terms of performance/speed. But I do have several options and apps I didn't have before.", "verified": true, "helpfulness": "0/0", "author": "PhrozenBlur"}, {"rating": 4.0, "review": "I have 2 of  this for about 3 months and it works great. tons of stuff to watch if you have prime. lot of free channel app available. had problem with remote in one unit and it took 3-4 call to get replacement.45 mins ,20 mins  & 20 mins. crazy..Customer service was such a disappointment for \"Most customer centric company\" ..", "verified": true, "helpfulness": "0/0", "author": "Robbinedin \"srs\""}, {"rating": 5.0, "review": "Love, love it", "verified": true, "helpfulness": "0/0", "author": "helen Beanland"}, {"rating": 3.0, "review": "Great with very high Bandwidth. High definition is brilliant with the fastest cable internet package.  With DSL, the picture is garbage.  Amazon needs to improve buffering protocol for DSL.", "verified": true, "helpfulness": "1/1", "author": "dr"}, {"rating": 5.0, "review": "I replaced my Apple TV with Amazon Fire TV and have been so much happier.  Far more user friendly and with Prime there are more viewing options as well.  If I was to purchase another streaming TV item, it would definitely be another Amazon TV product!", "verified": true, "helpfulness": "0/0", "author": "WMS"}, {"rating": 3.0, "review": "With TV's becoming smarter all the time and becoming more like PCs, I found that I wasnt using the Fire TV as much. It was cheap and the remote is pretty awesome. I ended up giving it to my dad as he is more of a tech junkie than I am and loves to have all the latest gadgets. I am more of a minimalist when it comes to my setup.", "verified": true, "helpfulness": "0/0", "author": "Juan M. Marquez \"ChronicVader\""}]