[{"rating": 3.0, "review": "It's a great concept, but there needs to be better software or something. Many of the interfaces (Youtube, HBO Go, etc) do not let you jump back 5 seconds or rewind at all or easily pause, etc. And the player jumps from one person's phone to another without warning.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 5.0, "review": "Absolutely the best technology I have come across in years. It has changed how our family watches television forever.", "verified": true, "helpfulness": "0/0", "author": "Gail Blesi"}, {"rating": 5.0, "review": "Works very well does everything as advertised.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "Installation was pretty simple.  It's nice to be able to view YouTube videos on the TV screen, especially if you want to show something to more than one person.", "verified": true, "helpfulness": "0/0", "author": "Stan57 \"Stan57\""}, {"rating": 4.0, "review": "Just what my husband was looking for. Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Diane  S."}, {"rating": 5.0, "review": "The chromecast makes it really easy to stream things from my phone or tablet to the TV in my bedroom. If the bulk of your media watching comes from services with compatible apps, and you don't already have a set top device (or don't want any in that room) this is a perfect solution and works really impressively well.", "verified": true, "helpfulness": "0/0", "author": "Z"}, {"rating": 5.0, "review": "Love this gadget! I am able to control Netflix and YouTube straight from my phone.", "verified": true, "helpfulness": "0/0", "author": "Mommy11042012"}, {"rating": 5.0, "review": "gOOD", "verified": false, "helpfulness": "0/0", "author": "Fatih ÜNAL"}, {"rating": 5.0, "review": "Couldn't live without it, now that I have it.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Johnson"}, {"rating": 3.0, "review": "This doesn't seem to be working so well for us when we try to cast live streaming programs.  They freeze up and stutter. We've used it for webinars and to watch a live stream of a church/memorial service. Had problems all those times.  Works great with YouTube videos or photo shows.  Anyone else having that same problem with live streams?", "verified": true, "helpfulness": "0/0", "author": "Barbara Bolton \"animal lover\""}]