[{"rating": 3.0, "review": "Its ok but a little quirky, need to spend more time with it. But for the price you cant go wrong.", "verified": true, "helpfulness": "0/0", "author": "sean"}, {"rating": 5.0, "review": "Very easy to use and cast webpages onto my TV. Great buy for the price!", "verified": true, "helpfulness": "0/0", "author": "H. Rao"}, {"rating": 5.0, "review": "Cheap and easy to install and connect. More apps and services coming on-line everyday. For this price, better than Roku.", "verified": true, "helpfulness": "0/0", "author": "MICHAEL REMPEL"}, {"rating": 5.0, "review": "Now I was in need of buying a new TV, after checking the prices I found that smart TV's were about double the price of ordinary TV's. So I bought a bigger 1080p TV. And decided to buy the chromecast. Set up was a breeze and don't let the small size fool you it streams Netflix, YouTube and a bunch of other stuff. Without a doubt one of the best purchases I've ever made. Also loving the 3 free months of Google all access.", "verified": true, "helpfulness": "0/0", "author": "Eric Juarez"}, {"rating": 4.0, "review": "I am one of the people who purchased the Logitech Revue device with the keyboard and we like that so much we really haven't used this device like we should.  My wife uses with her I-pad and I-phone and so you can only stream a few things like Netflix etc. currently with this device.  My hope is they will add more streaming options with apple products.  The pros are how small the device is which makes it perfect to plug into your TV via HDMI port.  Pretty self explanatory on how to set up and use the device.  Again if we didn't already own the Logitech Revue we would be using this a lot more I am sure.", "verified": true, "helpfulness": "0/0", "author": "Noble1"}, {"rating": 4.0, "review": "Nice gave trouble at first.need to get better step by step instruction .but overall I'm satisfy with it.", "verified": true, "helpfulness": "0/0", "author": "Matildita Vasquez"}, {"rating": 5.0, "review": "Love it. Google is awesome.", "verified": true, "helpfulness": "0/0", "author": "Austin Sonderman"}, {"rating": 5.0, "review": "Seriously, I can't believe that this thing is this inexpensive, and this small.Easy to setup, works great right away.  Truly a cool piece of technology.  And good on Google for including both a HDMI extender cable and your choice of a USB or power adapter.  Very nice, Google.", "verified": true, "helpfulness": "0/0", "author": "S. Kosloske"}, {"rating": 3.0, "review": "Have had this about 2 weeks and its nothing special. Setup was straightforward  and easy but unless you have Netflix or Hulu the two big ones, then there really isn't much content to take advantage of the casting functionality, casting from my Android phones is fairly easy and for the most part the picture quality was pretty decent without any stops or starts. Casting from my PC is a different story though, it borders on unwatchable  at times. After how long this device has been available there should definitely be more things to cast by now.look the price is great but the lack of things to cast makes it just Ok", "verified": true, "helpfulness": "0/0", "author": "Nirm"}, {"rating": 2.0, "review": "Doesn't have much use for me, not a bad product though.", "verified": true, "helpfulness": "1/1", "author": "Gotham"}]