[{"rating": 4.0, "review": "I like everything about the Amazon Fire TV except it is missing a way to change channels with one remote. I hope that is coming. At the time I didnt realize it was possible, but since bought a tv with google TV built in, and it controls everything from one remote.", "verified": true, "helpfulness": "1/2", "author": "Scott"}, {"rating": 5.0, "review": "Easy to use, most entertaining to watch my movies on the big screen TV, lots of other items and apps to explore - I am very pleased I chose Amazon Fire TV.", "verified": true, "helpfulness": "2/3", "author": "Char"}, {"rating": 5.0, "review": "I bought this under my wife's account.  We have the kindle fire HDX along with four more.  It has the HBOGO app.  Right now I have mirrored my HBOGO and watching it on my TV through the Fire TV.  Your Kindle screen is up on your TV and everything works.  I just put a police scanner up & listen through the TV.  Every day the Fire TV gets better.  New Apps come out every day,  I use Netflix, Amazon Prime, Hulu Plus.  People should read the reviews before they buy the Fire TV. That way they will not be surprised that it doesn't wash your car too.", "verified": false, "helpfulness": "3/3", "author": "Jack Gilliam"}, {"rating": 5.0, "review": "I got the Amazon Fire TV to replace my cable.  At first...I thought I made a mistake.  The more I look into it, browse what is available, and use it...it keeps getting better.I love that they keep updating it and making it better.  I am seeing it blending with Hulu Plus and making shows easier to find and access.My biggest (and only) complaint that I can find is the voice search.  It (so far) only works with Amazon content.  I would like to see it work with Netflix and other apps...this would make it perfect!", "verified": true, "helpfulness": "5/5", "author": "Lara \"<3 Kindle\""}, {"rating": 5.0, "review": "I just received this afternoon and I already love it. So easy to set up. Love Pandora and Amazon Prime and Netflix.", "verified": true, "helpfulness": "3/4", "author": "Punkin"}, {"rating": 5.0, "review": "After using the Original \"GoogleTV\" Blu Ray player from Sony, I was a little skeptical of it at first. But all fears were put to bed immediately! The ease of use, and all the content you can reach makes this one of the best set top boxes I've used ever. there is never any buffering, the voice recognition is outstanding, and the versatility is outstanding! Using it right this second in fact!", "verified": true, "helpfulness": "3/3", "author": "Karl H. Botterbrodt \"KHunterB\""}, {"rating": 5.0, "review": "fire tv is the best deal i have ever had,, the grandchildren love playing the games and we love the quality of the movies and tv shows thats available, being a prime member makes it all very worthwhile. easy to set up, makes my tv into hd. need i say more,,,,", "verified": true, "helpfulness": "1/2", "author": "Larry D. Aman"}, {"rating": 5.0, "review": "This is much better than Google chromecast and it has games. Lots of them free. Next month they will be streaming completed series from HBO. It's my favorite device for watching Netflix because it allows you to stop, backup and go forward without unsyncing the video and sound. Voice searching is remarkably fast, especially compared to hunt and peck typing.", "verified": true, "helpfulness": "2/3", "author": "W. K. Macallister"}, {"rating": 4.0, "review": "CONS:1: Fire TV voice search does not search and display Video content from other providers apps that you installed. Netflix in my case. Although I did see a couple videos say view on Hulu plus.2: No IR feature to control TV power and volume like you would find in Sony Google TV.Pros:1: Voice search is fast.2: Overall system performance is very fast.", "verified": true, "helpfulness": "2/2", "author": "E. Bellardino"}, {"rating": 4.0, "review": "It arrived as promised and the instructions were easy to understand and hook up, however the picture don't seem as good as my Dish TV picture, we have Amazon prime so there are a lot of programs to choose from, I only wish the picture was better.", "verified": true, "helpfulness": "0/1", "author": "old guy"}]