[{"rating": 5.0, "review": "I was tickled pink with this.  Once we figured out how to use my husbands phone to cast, it worked perfectly.  Now we can enjoy Netflix on the couch, not crowded around the computer.  If the phone had more memory, we would be able to cast scads of other things, but that is the phone's problem, not the dongle's. The deal we got on it was a real steal, so that seals the deal for us.", "verified": true, "helpfulness": "0/0", "author": "Katrina Owens"}, {"rating": 5.0, "review": "It's been so greatlove it", "verified": true, "helpfulness": "0/0", "author": "Tonia"}, {"rating": 5.0, "review": "It took me some time to get used to the set-up. After that, everything went smoothly.The number of applications you can cast are limited.", "verified": true, "helpfulness": "0/0", "author": "Nguyen Nguyen"}, {"rating": 4.0, "review": "Works very good. Took care of what I was wanting to accomplish.  A little inconvenient using smart phone but not intolerable.", "verified": true, "helpfulness": "0/0", "author": "Nathan Wilson"}, {"rating": 4.0, "review": "Works pretty well, sometimes broadcast breaks up.", "verified": true, "helpfulness": "0/0", "author": "Mr Goodyear"}, {"rating": 5.0, "review": "Very good experience!", "verified": true, "helpfulness": "0/0", "author": "Sebastian G."}, {"rating": 5.0, "review": "It does what it says it does. Except it's laggy and connecting can be a pain. 4 stars for accomplishing technical feats but not 5 because a lack of refinement in tuning.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Girga"}, {"rating": 5.0, "review": "It works very well, does what it's supposed to do. I couldn't play HBO GO without it. Now I can. I like it very much.", "verified": true, "helpfulness": "0/0", "author": "flower"}, {"rating": 2.0, "review": "Uhm...its not all that and a bag of chips.  Seriously underwhelmed by this device.  It works sometimes but you have to coax it and its SLOOOOOW.  If you don't have a smart phone, forget it.  This thing is an inbetweener and its only real use is when the wi-fi on your TV either goes out or doesn't exist and the netflix app or youtube app on your phone is a better app than whatever your TV or wii has.It impressed my friend, but I'll send Google a post card \"...From Hell's heart I spit at thee.\"  Love from Botany Bay, -Kahn", "verified": true, "helpfulness": "0/0", "author": "Spencer Streeter"}, {"rating": 5.0, "review": "This is my second Chromecast I really loved it. I recommend this product for Google lovers or at least give a try it won't disappoint you. The price seems fair and comes with enough accessories for you to use.", "verified": true, "helpfulness": "0/0", "author": "Brian Zepeda"}]