[{"rating": 5.0, "review": "Works perfect and great price!", "verified": true, "helpfulness": "0/0", "author": "Austin Scheidemantel \"AU5T1N\""}, {"rating": 4.0, "review": "Enjoying using this device.", "verified": true, "helpfulness": "0/0", "author": "Darlene Stone"}, {"rating": 5.0, "review": "My son talked me into buying this and it's great. We use TiVo and couldn't get HBOGo to work. The Chromecast means we can watch HBOGo from our phone. Simple and easy to use it simply gives more options. We also took it on vacation and used it at the home we rented.", "verified": true, "helpfulness": "1/1", "author": "R. Debruhl"}, {"rating": 5.0, "review": "This is a great product and I love the fact that I can take it with me when I travel.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great for casting. I have a hard time with Amazon Prime videos.  Get lots of interruptions and delays.", "verified": true, "helpfulness": "0/0", "author": "Nortoncommando750"}, {"rating": 5.0, "review": "Fantastic. I have zero complaints.", "verified": true, "helpfulness": "0/0", "author": "Whit"}, {"rating": 5.0, "review": "This is AWESOME!  I was a little worried about ordering through Amazon but the product is perfect!  I'm so addicted to Chromecast now!", "verified": true, "helpfulness": "0/0", "author": "WB"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Edna Ball"}, {"rating": 1.0, "review": "doesn't work. I've tried everything, updated my router, you name it, I've done it.  My on-line research has led me to so many reviews that say the same thing. Chromecast will play for 3 minutes then stop, constantly. I wish I had read reviews posted on reddit and other sites before buying.  I hope Google figures out what is wrong. Again, from reviews on on-line sites, this is a common problem. I think more common than you are led to believe. I do not recommend this product.", "verified": true, "helpfulness": "0/0", "author": "msande7"}, {"rating": 5.0, "review": "Must-have device for cord cutters! Works great, though my home network can't handle casting from Chrome on the highest quality setting. Netflix, YouTube, and other web pages with Chromecast functionality built in work great.", "verified": true, "helpfulness": "1/1", "author": "Lauren C"}]