[{"rating": 5.0, "review": "First, if you have a recent(?) Vizio TV, make sure that your \"CEC Function\" in TV settings is turned on.  This function allows Chromecast to control your TV.  And then select discover, and it should find your Chromecast and name a custom input.  (My TV creates a new Chromecast input)My TV, model XVT553SV, does not supply power via HDMI, but it does supply USB power, but only when the TV is already turned on.  If you want to give Chromecast the ability to not only select the right input, but also to turn on the TV for you, use the AC power adapter.-------------Rest of the review:I don't know what kind of dark magic it's using, but the thing was able to talk to my phone before logging onto my wifi network.Only caveat for the dead simple setup is for people with multiple AP's or dual band routers.  Make sure what you configure your chromecast while connected to the WiFi network you want it to use.  It's not going to throw you off too far if you don't do that, but it'll ask for the password for the wrong network if you do.So far, it works brilliantly for youtube.The chrome tab mirroring success is completely dependent on how intense the incoming data is.  I was able to successfully watch an HD Vimeo movie, but Hulu was not good at all.  But, the fact you can even do this at all with a simple extension is impressive.I look forward to Chromecast 2 with 5ghz and 802.11ac.", "verified": true, "helpfulness": "6/8", "author": "Troy in Austin"}, {"rating": 5.0, "review": "As an IT professional I've setup and troubleshot just about every kind of device imaginable.  I've got an Apple TV, but for $35 I figured I might as well explore what Google was bringing to the table.  I cannot recall an easier setup up.  Af first I tested by plugging it into my 3 year old LG TV, the provided USB cable and tether makes it easy to connect neatly to two ports, if your sets HDMI ports don't provided the needed power.  Downloaded the setup app to my Mac and I did the 2 minute (if that long) configuration there.  Ultimately I moved it to a port on my Bose home theatre system for maximum effect.  Add an extension to Chrome on the Mac and voila you're set.  Now YouTube has an option where to display the output, select Chromecast and it's playing now from another tab as I type this review.  Switching to the YouTube app on my iPhone and was just  as easy.  I would imagine this will be true of en Chromecast enabled service.  You can even project any webpage, so for example set Flickr to do a slide show of your photos, then use the browser extension to display on your TV.  For $35 I'm not sure how you can go wrong.", "verified": true, "helpfulness": "3/4", "author": "Jay G"}, {"rating": 1.0, "review": "So, shouldn't it be mentioned that if you have an ipad or iphone this device doesn't work? I am not to impressed to read that ios is \"coming soon.\"", "verified": true, "helpfulness": "17/105", "author": "gailynn valdes"}, {"rating": 5.0, "review": "Most of the 1 & 2 star reviews are based on the fact that people aren't getting three months of Netflix free. Seriously? Three months. Get over it and review the actual product.Product is great. Does exactly what I need it to do, exactly as advertised. If you have AirPlay, you might not find it that useful, but seeing as this is my first device->TV product, I love it.", "verified": false, "helpfulness": "7/10", "author": "D. Klein"}, {"rating": 3.0, "review": "I got this when they first came out because it sounded so cool! Before I was using an HDMI cord to connect my iPad to my TV, but I couldn't control it from anywhere, I had to be right at the TV.Well the Chomecast works great when it's working. Maybe it's my apps & not the Chromecast, because it always works fine when I stream from the Chrome browser on my computer. Either way, something needs to be fixed!", "verified": true, "helpfulness": "2/3", "author": "eileeen88"}, {"rating": 5.0, "review": "I got my Chromecast about an hour ago and I freaking love it.  Works awesome from my laptop and my phone.  The picture quality is great.  Watching my YT channel subscriptions just got so much more enjoyable.*UPDATE* -- I've been using this for a couple of days non-stop and its great.  I wasnt feeling well yesterday so I just moved this into the bedroom TV and watched Netflix all day.  The control from my phone is great.  Being able to watch other stuff besides YT and Netflix is just fine by Casting from your Google Chrome Browser.  A little laggy but it works just fine.", "verified": true, "helpfulness": "2/4", "author": "Jose M. Reyes \"AgentPi\""}, {"rating": 5.0, "review": "Where to start? Used the Prime Trial and got 2 day shipping. Unboxed and plugged it in to TV. If your HDMI is 1.4 or above, it will power up. If not there is a USB power cord and a wall adaptor. Luckily, my TV has a USB port right beside the HDMI and I was able to plug it in. My TV is wall-mounted, and you cannot see the dongle or wiring, it is completely hidden. Setup took 3 minutes with my Nexus 7 and the Chromecast App. Sadly, only got 1 month of Netflix, not the 3 months advertised. It works exactly as advertised, YouTube, Netflix, Google Play Music, Google Play TV all stream very, very well. Once you \"cast\" whatever you choose, it runs in the background and you can still have full functionality of your tablet. I walked to another room, signed into Netflix on my phone and was able to then control it from there. Seamless! The Chrome Browser mirroring feature is an 8/10. It is stretched and skewed lightly, and video was at points perfect and other times choppy or laggy. Browser Mirroring is specifically listed as in BETA, so it will get better. As more and more app developers add the code to their apps, we will see amazing results. You cannot beat $35 for what this does and for the potential it possesses. Buy it if you're smart, cut another cord and thank Google for producing something so simple and so amazing.Update: 7/30/13, out of the blue, I awoke this morning to an email from Amazon with a 3 free months Netflix gift code. Awesome!", "verified": true, "helpfulness": "2/3", "author": "J. Stambaugh \"John Wayne\""}, {"rating": 4.0, "review": "I just got mine today. It works good overall but there are things you should know.It requires you to use the USB power adaptor to wall socket to get power. People mentioned it should power from HDMI but it does not seem to do that. You need to use USB power adaptor which adds little clutter with wiring.I had problem setup because the setup could not connect to my WIFI network using my iMac for some reason. This was frustrating. But I ran setup on my PC and it could detect WIFI network and worked fine.Netflix and Youtube worked fine on Mac and iPhone and Mac.Mirroring from Chrome works fine too from PC or Mac.  However you cannot mirror chrome from Ipad or Iphone - it NOT supported yet. So it is kind of inconvenience to use your Mac or PC as remote for TV when mirroring.I have Amazon Instant Video too and you can mirror video to TV when you watch video over web on Amazon website.CNET gave it so so review mentioning that for $15 more ROKU does more with tons more apps including Amazon Instant Video. So there is some regret but I am hoping that more apps will eventually come out for Chromecast. But for $35 it is still good deal especially if you do not have Apple TV or Roku before. I bought it on first day so I should be getting Netflix free offer but I am still waiting for any email about this - I have not gotten anything about Netflix free offer.", "verified": true, "helpfulness": "4/6", "author": "Jin"}, {"rating": 3.0, "review": "Update 7/31/13: I received my promo code and was able test Netflix. It works well from the browser, my android phone, and Kindle Fire.  There is a slight delay with the controls from my phone, but it works well otherwise.  Hopefully they will add more apps or improve casting from the browser soon, like Amazon Instant Video or Hulu.--------As a cord-cutter I was expecting to use this to stream video instead of connecting my laptop via HDMI.  Aside from the fact that I didn't get the free Netflix I was promised (yet), the device doesn't do what I expected.Video cast from the chrome browser is un-watchable.  It is jerky at best, and audio is out of sync.  Since I don't have that free Netflix subscription yet (it takes about 5 days to be emailed) I tried Hulu and a couple other sites with no luck.  This is a deal-breaker for me. Also, it requires a power cord not depicted in any of the marketing images, but that is minor.Here's what it CAN do:- Using an Android phone it can stream video from Youtube, allowing you to select, play, pause video from the phone. I don't know about iOS devices- it can stream from Netflix Android app (did not test this because I don't have that free subscription)- it can stream from Google Play Android app (I'm not going to buy media from Google)- You can \"cast\" your Chrome browser to the TV, but quality of video is an issue- Youtube.com has a special cast button and streams rather well to the device from the Chrome browser", "verified": true, "helpfulness": "8/26", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought this chromecast here on Amazon, when it arrived everything looked  good but when I couldn't get it to setup I called google tech support after  about 45 mins of jumping thru the tech support hoops ( by the way I an a computer field/tech support engineer with 40 plus years of experience) was told. #1. as it did not have serial number as all google sold items did they didn't know what the problem was#2 no it would not work with my Kindle fire HD#3 Some thing must be wrong with my computer it wasn't their hardware or software.Google support a minus 35chomecast packaging  10this is the reason I left chome browser  looks good just doesn't work", "verified": true, "helpfulness": "11/96", "author": "Davidtechmech"}]