[{"rating": 5.0, "review": "Much better than my Roku! It's just so easy to setup, and even easier to operate. The voice command is the bomb!  Kudos, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Easy to use and lots of features. All you need is lots of time to watch.  There is so much you can do with this machine.", "verified": true, "helpfulness": "0/0", "author": "L. Erwin \"Linda Erwin-Gallagher\""}, {"rating": 5.0, "review": "Made me drop my Roku.  The advantages of the Fire make similar devices look primitive. The voice activation, picture quality and sound are outstanding.", "verified": true, "helpfulness": "0/0", "author": "D. M. Scott"}, {"rating": 5.0, "review": "We have had a roku for some time but it was slow and kept rebooting.  The fire tv s great.  Simple to set up and the voice activated feature works well.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Christine Grbelja"}, {"rating": 5.0, "review": "This item is amazing!  Don't know whether it's our imagination or not, but the picture and sound quality are superior to just the TV alone.  The ease of set-up/use is really simple, and we didn't even have to call the grandkids to set it up for us!  The only thing that would make this really perfect is if there were on on/off switch to return to regular TV, rather than having to unplug the power.  Hubby and I LOVE being able to see photos of our kids/grandkids on the TV from our Cloud.....", "verified": true, "helpfulness": "0/0", "author": "M. Smith"}, {"rating": 5.0, "review": "The best streamer i ever bought, had apple tv,boxee box and android tv stick , nothing like this one .", "verified": false, "helpfulness": "1/1", "author": "Dr.Saadulddin"}, {"rating": 5.0, "review": "Perfect for family use - voice search works great - faster features for forwarding and reversing movies. Simple access to menu and steps are very intuitive", "verified": true, "helpfulness": "0/0", "author": "Herb D. Lair \"herb5247\""}, {"rating": 4.0, "review": "Now that we have it all set up I love it. The fact that I had to go out and buy the cords to connect it to the TV and Modem which cost me another $45 did not make me happy. The directions assume you know about what they are talking about and are hard to follow. We had to connect it to our modem and the TV through the DVD player.", "verified": true, "helpfulness": "0/3", "author": "CLR"}, {"rating": 3.0, "review": "The device itself is great.  The connection is great, the quality is great, the ease of use is great.  The part I do not like is Amazon Prime.  Not only is the price going up, but it seems like there is not much \"free\" content any more.  The free movies are mostly outdated.  The good ones are $3.99-5.99 for a 24 hour rental.  Worse off are the television shows.  Many shows that are not in high demand now have a charge of $1.99/episode.  For example, I watched some Military Channel, Travel Channel, and Food Network shows just a month ago for free.  The shows are now $1.99 each.  It almost forces you to join Netflix which makes me wonder if Prime is worth it.", "verified": true, "helpfulness": "2/4", "author": "R. Sinopoli"}, {"rating": 5.0, "review": "Love this thing....wonderful picture, and I am getting to watch shows I didn't have time for before.  Thanks Amazon for another great product", "verified": true, "helpfulness": "1/1", "author": "Pat Capehart"}]