[{"rating": 5.0, "review": "Considering the limitations for apps to play content on your laptop or your TV, having this in your home makes your phone or tablet a very powerful media hub. I love it.", "verified": true, "helpfulness": "0/0", "author": "J. Minto \".....\""}, {"rating": 5.0, "review": "Chromecast is a great little device.  Using my Android Phone or iPad, I can easily look at Netflix, Hulu, etc while controlling from my device.  Simple to setup, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Joseph S. Merola"}, {"rating": 5.0, "review": "Considering dropping back our satellite TV package and we think we can use this device to watch our favorite shows that we will loose with the drop, since we usually DVR them anyway!", "verified": true, "helpfulness": "0/0", "author": "Thomas Breen"}, {"rating": 1.0, "review": "Not worth more than one dollarThe device only for YouTube, difficult to capture networkI do not recommend itKeep your money", "verified": true, "helpfulness": "0/0", "author": "S. TM"}, {"rating": 5.0, "review": "Works perfectly. I use it mostly for Youtube but now I am considering Netflix as well. Strongly recommended. I probably will buy another !", "verified": true, "helpfulness": "0/0", "author": "Marcelo Henrique de Salles"}, {"rating": 5.0, "review": "Very cool device. We use it a lot with hulu. I wish the tab casting worked better but it's still in beta.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We wanted a simple way to stream netflix and mirror our PC to the tv without having to buy a new player, TV, or keep paying for xbox live and were happy to hear about the Chromecast as a solution.  It is super easy to setup, \"even a caveman could do it!\"  We love the ability to use any of our devices as a remote for chromecast.  Youtube and netflix work brilliantly.  Making a TV playlist for youtube is a breeze.The only reason I knocked one star off was the lack of apps so far.  We need Amazon Prime Instant Video!  How about a photo viewing app, a photoshop app for editing photos etc.Keep up the good work Google and hook us up with some more apps!", "verified": true, "helpfulness": "0/0", "author": "Ryan Van Duzor"}, {"rating": 3.0, "review": "Had difficulties getting it to work (quite a few resets) and then it's very limited relative to what can be accessed. I thought it would do more and was disappointed in its range of capabilities.", "verified": true, "helpfulness": "0/0", "author": "Aurel E. Stuart Jr."}, {"rating": 2.0, "review": "Easy setup and clear video view if I have strong internet connection. One features I want is Chrome extension for Chrome browser for Android tablet. PC can do it, but tablet cant.", "verified": true, "helpfulness": "0/0", "author": "Mayuhei"}, {"rating": 3.0, "review": "Lets get this straight. It is a great concept. However, coming from a roku device and other streaming devices, it is limited to what it offers. You can only stream you tube videos, Netflix and Google play movies. That is it. For 20 dollars more you can get a Roku device that has everything, hulu, Netflix,you tube, crackle and so much more. I think I will try this again when Google definitely updates this device with more streaming capabilities and is not limited.  So if you currently own a streaming device that does more then what i have described, I would definitely wait to make this purchase. I returned it.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline"}]