[{"rating": 5.0, "review": "I have seven TV's in the house with seven Verizon FIOS BIG set top boxes.  I would like to pare down to two and I think I can by the end of the year by using the SMALL but great Amazon Fire tv's.  The Fire TV hardware is fast, solid and the picture is terrific.I watch mostly for background while I do other things so the old \"Columbo's\" and the new \"Justified\" are perfect.  One \"Columbo\" episode equals one exercise session.I see it has the \"Bloomberg business channel\" which is pretty good but I like Fox Business news better, which I watch every weekday.  I hope on down the line it would be added to the content line.Thanks a bunch - Keep up the good work!  - JR", "verified": true, "helpfulness": "2/3", "author": "Joe Reynolds"}, {"rating": 5.0, "review": "Boy am I glad I have it, although binge watching occurs!  I had to start ironing while watching so I did not feel guilty.", "verified": true, "helpfulness": "0/1", "author": "A. C. Mcdaniel \"happy gardner\""}, {"rating": 5.0, "review": "The image quality (movies and games) is excellent. I've tried several movies from Amazon Prime and they look and sound great. Like other reviewers have stated, its as easy as 123 to set up . I had no problems what so ever.  The voice search is the best I have ever seen as far as searching exactly as I asked. Having the Amazon Fire TV,is helping our decision to finally \"cut the cord\" with cable providers.", "verified": true, "helpfulness": "2/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This was a breeze to set up. I was enjoying a new movie in less than half an hour. I think it's just about the best birthday gift ever.", "verified": true, "helpfulness": "1/1", "author": "Diane"}, {"rating": 1.0, "review": "Once again I order something from Amazon and it doesn't work right out of the box. Unable to download any movies from my Amazon Prime account or Netflix; the only thing that works on it is the crappy solitaire game. The help desk is in another country and the rep was barely able to speak English, the \"help\" he gave me was reading from some document that was completely wrong so I had to figure out how to factory reset it myself and then it still doesn't work. I used to love Amazon but after going through 3 Kindles in less than a year and now this doesn't work right out of the box I'm going to cancel my Prime Account. Returning this piece of junk and getting a Samsung Blu Ray player that will do the same but better!", "verified": true, "helpfulness": "4/15", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have owned most of the set top boxes out there, and am pretty impressed with this so far.  The Amazon Prime streaming is great, and the content get's better every month.  I'm amazed at the speed at which the movie or show starts playing after hitting play - there's no buffering for me - less than a second from button press to opening credits.  I run a Plex server at the house and the Plex app is great on the Fire TV (although I was disappointed it wasn't free since I have the paid Plex subscription).  The interface if much nicer than the WDTV's I have, and I can quickly page through content.  I'd love to see them integrate the voice search into the apps.  The only other thing missing is HBO Go, I hope they will make a deal for that soon.  I own several WDTV's, an Apple TV, a Boxee Box, an old model Roku, a Chromecast, and a bunch of Tivo's, and I'm finding myself using the Fire TV most often.", "verified": true, "helpfulness": "5/5", "author": "Kindle Customer"}, {"rating": 5.0, "review": "We bought this when our now grown children's wii broke, and we are so glad we did. It was VERY easy to hook up and even easier to operate. The voice command works great and the Amazon Fire a TV automatically programmed itself as soon as it was hooked up. Great invention. Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Zelda"}, {"rating": 5.0, "review": "The Amazon Fire Tv is fast!!  Great and easy to use menu with voice navigation which makes it easyto find anything on Amazon.Great Applications like Pandora, Youtube and more!", "verified": true, "helpfulness": "0/1", "author": "Julian Bakery"}, {"rating": 4.0, "review": "The hardware in this device is top notch.  It feels very responsive and quick as I browse through the menus to select shows or navigate into my Plex server.The voice search feature is pretty neat, though I wish it worked for all apps within the device like my Plex media.This is a very quick device to setup.  I went out and bought some velcro stickies so that I can attach it to the back of my television.  It looks great having all the cables concealed and since the remote doesn't require line of sight it still works great.The only reason I'm giving this 4 stars instead of 5 is because I really think Amazon should include a section in their main menus that only includes the free content I get with my Prime Subscription.  I hate coming across a show that I'd like to watch, and my only options are to purchase it.For anyone comparing this set top box to other streaming devices, take it from me, I've tried many others... Boxee box, Yuebo, My little black box, Roku, and this one is BY FAR my favorite.", "verified": true, "helpfulness": "3/4", "author": "Daniel L. Fowler"}, {"rating": 4.0, "review": "this thing is really fast and like others have stated really set up for amazon prime...i dont find the voice search that great of a feature but it does pick up what you say spot on! its lacking HBO go and MLB and the usb doesnt play videos so that kinda sucked but overall nothing mind blowing different from apple tv roku and others like it!", "verified": true, "helpfulness": "0/1", "author": "dustin keigley"}]