[{"rating": 5.0, "review": "it works well and installed easily ... what more can i say other than having more streaming integration with other programs and apps", "verified": true, "helpfulness": "0/0", "author": "R. D. Jacquin \"R Jacquin\""}, {"rating": 5.0, "review": "Works great with Plex.TV! It turned a dumb TV into a movie streaming master! It is extremely easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Dylon"}, {"rating": 5.0, "review": "it turns any tv with HDMI into a smart tv.. It works well with my iphone so glad i was told about this thing.", "verified": true, "helpfulness": "0/0", "author": "Scott Wright"}, {"rating": 5.0, "review": "It was exactly what I wanted. Works fabulous and streams quickly. It was super easy to set up! I was afraid it would be slow since I have so many devices on my wireless but that was not the case.", "verified": false, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 5.0, "review": "Awesome not having any wires to connect to tv! Easy to set up  you must use remote to switch inputs", "verified": true, "helpfulness": "0/0", "author": "Sandra M. Mayberry"}, {"rating": 5.0, "review": "Everything was great, did everything it said it would! Had a TV in the bedroom that I could not get netflix on, so I hooked it up and did the setup and voila!", "verified": true, "helpfulness": "0/0", "author": "Jeff Lamb"}, {"rating": 1.0, "review": "Been trying to get this thing to work for 5 weeks.  Called Tech Support 3 times.  Tried it with my laptop and my PC.  Just does not work.  Launched before all the bugs were squashed.C. SmithSan Antonio, Texas", "verified": false, "helpfulness": "2/3", "author": "Cecil"}, {"rating": 4.0, "review": "This is a fantastic little player for not a lot of money. The Netflix integration could be better and the device does crash every week or two, but it's still been worth the money.There aren't a lot of apps supporting it yet, but now that the SDK is open to all, it should be resolved very shortly! Definitely want some local media support on here.And the Youtube queue is a fantastic feature for parties!", "verified": true, "helpfulness": "0/0", "author": "G. Martinez"}, {"rating": 3.0, "review": "It does what it claims...kind of. There are just not enough apps that you can cast, seriously I want to watch my own videos on the screen but you can't because the apps are not a plenty.", "verified": true, "helpfulness": "0/0", "author": "vicente guerrero"}, {"rating": 5.0, "review": "I bought this for a friend for Christmas, and when I got to his house, I quickly pointed out to my wife that there was an identically sized package under his tree that had my name on it. It was a lot of fun for us to open our packages from each other that had the same item in them!This device does the single best job of bringing a level of \"smart\" to my TV that I have ever had the pleasure of using. In fact, this device is the first time I have been able to get my wife to use media that isn't TV native. She never liked using the Xbox, the Wii, the Media Center, or any of the other techniques that I liked to play around with. The Chromecast is basically used more by her than it is by me now.Plug and play easy, with a simple guided set up process has it running in about 5 minutes, Once you are set up, the limits of \"TV\" just start disappearing. There are a number of apps that can utilize Chromecast already, and the number is growing, which means my old \"dumb\" TV is only growing more powerful.", "verified": true, "helpfulness": "0/0", "author": "Worf"}]