[{"rating": 5.0, "review": "Works perfectly and only took a couple of minutes to setup and begin using it.", "verified": true, "helpfulness": "0/0", "author": "Eric Draper, Jr."}, {"rating": 5.0, "review": "Good product and delivery was performed as expected", "verified": true, "helpfulness": "0/0", "author": "Xavier Roca \"Free will\""}, {"rating": 5.0, "review": "We have a chromecast on every tv in our house.  So nice to just pick what you want to watch on your phone and shoot it to any TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Jenna Jewett-Lacey"}, {"rating": 5.0, "review": "very easy to setup and the image quality is great!!", "verified": true, "helpfulness": "0/0", "author": "Rogelio Monreal Cruz"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Allen Pimentel"}, {"rating": 5.0, "review": "Really surprisingly easy to set up.  My parents can now watch netflix on the TV!", "verified": true, "helpfulness": "0/0", "author": "Robin"}, {"rating": 3.0, "review": "video not as well as I expected", "verified": true, "helpfulness": "0/0", "author": "Daryl L."}, {"rating": 2.0, "review": "I bought it for 22$ for a black friday sale. It plays videos from youtube and other entertainment apps. No remote control so you need to use your tablet or phone. My samsung tab pro does not feature the mirroring. Also the video that i have on my device, do not play unless you upload them on the real player cloud which is the standard of the device. You also get 2GB free of space so if you want more you have got to pay. I would suggest to think about what you really need something like this for and then move from there. but remember if you play videos from your device like me is not going to work because you have to convert them in the format that the device will read and then it goes to the clouds.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I didn't realize you have to buy and additional cord to plug into an outlet. Kind of shady that they'd sell that separately. Other than that i love my Chrome, but c'mon.", "verified": true, "helpfulness": "0/0", "author": "Randy Goldstein"}, {"rating": 4.0, "review": "Pros:- Small, lightweight Wireless b/g/n Streaming Media Player- Very good Video HD 1080P quality on my TV- Very good Audio quality including surround sound on my Home Theater- Easy to setup on Home network- Works well with apps (Netflix, YouTube, Localcast, etc.) on Android phones & tablets, & Windows with the Google Cast extension for Chrome browser (I haven't tested it with iPhone IOS or Mac OS X).- Can turn any basic HDTV into a Smart TV by streaming A/V from apps on your device.Cons:If your home network is not configured properly then your Device apps might keep losing connection to the Chromecast every 10 min. or so. See the resolution to this that should work for most home networks in the comments below.Comments:There seems to be a lot of misinformation out there on sites & reviews about this device. Some say it is a DLNA Certified device, while others say it does not use DLNA at all. I posted this question to Chromecast Support Forum and the only answer I got was \"Chromecast is not a DLNA Renderer\", but they were not a Google employee. They also included a blog link (http://blog.squeed.com/tag/chromecast) that had a lot of good information from a 3rd party app developer about how they implemented casting from Local media, SMB network shares, & UPnP. I'm an IT guy and it is important that my reviews be as accurate as possible based on the best available information. If I find more detailed information from the Chromecast development team then I'll be happy to correct any information in my review.This was easy to setup with the Chromecast app installed on my Samsung Galaxy Tab Pro. However, like many other users I experienced the problem where the apps on my phone and tablet would lose the connection to the Chromecast after about 10 min. It would continue to play the video on my TV, but I could no longer control it from the app. On your Internet provider's Wireless router (and any other wireless router you may have), login in to the Router Configuration IP in your browser (mine is http://192.168.1.1 but could be different depending on brand. Verify this by opening a Command Prompt and entering ipconfig. Look for the Default Gateway IP. Make sure you know the Password for the Admin account.) and do the following:1. Verify the AP Isolation mode is Disabled. This can be found under the Wireless Advanced or Professional settings (the location depends on the make & model of your router/s). Normally this is Disabled by default on home routers, but you should check this setting. If Enabled it prevents Wireless clients from talking to each other on the same network.2. Verify the IGMP Proxy is Disabled. Some Chromecast apps use UPnP and this uses Multicast packets to communicate on the network. IGMP Proxy is supposed to filter out Multicast packets from going to every client on the network except for the clients that specifically requested them. My Verizon FIOS Actiontec MI424WR (Rev. I) Wireless-N router has this Enabled by default. There is a bug in their IGMP Proxy and it filters all Multicast packets even for clients that requested them. On the FIOS router this option used to be in Router Config Advanced options, but Verizon pushed a firmware update that hid the IGMP Proxy and UPNP settings because they don't want customers changing them. IMHO - IGMP Proxy is not that important on a small home network. This can be accessed after logging into the Router Config with the Admin account and changing the active_page parameter in the URL to 6059 (e.g. http://192.168.1.1/index.cgi?active_page=6059).3. Now you are ready to follow the instructions for setting up Chromecast. Initially the Chromecast setup app wants the device (phone, tablet, or PC) its on to be on the same 2.4Ghz Wireless network as the Chromecast device. Follow the setup instructions on your TV and it may ask you to update the firmware.  Follow all setup steps carefully.After the setup completed and I verified it was working from my Galaxy Tab Pro, then I was able to change my tablet to use my faster 5Ghz Wireless-AC network and it was still able to connect to the Chromecast on my 2.4Ghz Wireless-N network. This works for me because my Asus RT-AC68U Dual Band AC router is setup in Access Point Mode. All DHCP & NAT is being done on my FIOS router and all Wired/Wireless clients are on the same Subnet 192.168.1.1. You probably won't be able to do this if you have multiple routers with different Subnets (eg. Main router 192.168.1.1, 2nd router 192.168.2.1, etc.) and DHCP enabled on each. If you are not sure, then its just best to leave your Device and Chromecast on the same Wireless network.Overall I am very happy with this device and would definitely recommend it to others looking for a cheaper alternative (under $40) to Apple TV, Roku, Amazon Fire TV, Google Nexus TV, or any other Internet streaming media player. This does everything I want with my Phone & Tablet. Hopefully you find the information above helpful if you ran into the same problem where your device keeps losing its connection to Chromecast.", "verified": false, "helpfulness": "1/1", "author": "Doctor Nick"}]