[{"rating": 4.0, "review": "Would be great if I could stream Amazon Prime since that's the only premium service I pay for.", "verified": true, "helpfulness": "0/0", "author": "eyeshop2much"}, {"rating": 4.0, "review": "This is a great product, the only drawback is that it doesn't allow you to \"mirror\" your screen with the TV. You need to be using youtube or chrome or one of google apps.", "verified": true, "helpfulness": "0/0", "author": "yalaska"}, {"rating": 5.0, "review": "I love my Chromecast! The set up was so simple and I use it every day, I don't know how I went so long without it. It's so easy to stream from my iPhone and MBP, and I can pop it into different TVs and start casting in minutes. A great investment, I'm getting my mom one for her birthday.", "verified": false, "helpfulness": "0/0", "author": "LovelyVillain"}, {"rating": 5.0, "review": "Chromecast is absolutely amazing! I have no complaints but I think it should be able to project exactly what is on the screen of the iPad or and iOS device while on the internet. Otherwise it was great.", "verified": false, "helpfulness": "0/0", "author": "ranjit doodnath"}, {"rating": 4.0, "review": "I was hesitant initially buying this because it only supported Youtube at the time. Over time, they have really added more and more compatibility with various music and video streaming applications online. Whether from the cellphone or laptop, I can stream beautiful content without any skips or glitches. I do hope they continue to add even more compatibility with other applications. The problem is with streaming any webpage that you are on. Then it is usually slow, glitchy, and can become disconnected often (I have very fast internet so that's not a factor). Ideally, it would be great to be able to use the Chromecast when watching any video from your laptop, like a DVD, or other downloaded videos, as opposed to only streaming web content. Either way, I have high hopes for the future of this device.", "verified": true, "helpfulness": "0/0", "author": "WA"}, {"rating": 5.0, "review": "I watch Netflix a lot and 4 the fact that I can now cast it to the TV and watch It on the big screen is a place.  Great purchase. Just make sure u have a dependable wifi connection.", "verified": true, "helpfulness": "0/0", "author": "Marlene"}, {"rating": 5.0, "review": "Not quite what I expected but getting you tube on the big screen alone is worth the price.", "verified": true, "helpfulness": "0/0", "author": "pfweintraub"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Leonard Morales \"Looney M3 Productions\""}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "MIYOUNG SON"}, {"rating": 5.0, "review": "Use it all the time...Hulu, Netflix, etc....", "verified": true, "helpfulness": "0/0", "author": "ursa"}]