[{"rating": 5.0, "review": "great product works very well! I enjoy using it and can control it from my computer or my cell. got rid of some long cables around the house!", "verified": true, "helpfulness": "0/0", "author": "Hannah Noa Barad"}, {"rating": 5.0, "review": "Nice to have a remote.", "verified": true, "helpfulness": "0/0", "author": "Janet Rutkowski"}, {"rating": 1.0, "review": "I have had it less than a year and its already stopped working. It crashes several times a week and constantly needs to be rebooted. And there isn't any kind of a warranty on it so I will not be purchasing another one to replace it. I will go with another device.", "verified": true, "helpfulness": "0/0", "author": "zereldathebrave"}, {"rating": 5.0, "review": "Works as it should, always happy with my google products!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I don't get to use it very much since my kids found it. We had a blast taking turns picking out funny videos to share - it was great family time.", "verified": true, "helpfulness": "0/0", "author": "heathc"}, {"rating": 1.0, "review": "Utter trash. Nothing but frustration. The very definition of nuisance. Every time I try to use it, something goes wrong. I either have to restart my internet, restart my computer, delete and redownload the app, or delete and redownload the extension. HEY GOOGLE! FIX IT! I would LOVE to fill this review with choice language, but I know that'll decrease the odds of it being seen.", "verified": true, "helpfulness": "0/0", "author": "John S."}, {"rating": 3.0, "review": "Extremely glitchy product. Videos are always jerky. Did not detect the 5g network. Don't waste money, just get an Apple TV. Works flawlessly. Setup with chromcast is a pain as well. Can't gift it to non techies.", "verified": true, "helpfulness": "0/0", "author": "amazontribal"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "stenba"}, {"rating": 5.0, "review": "Arrived on time, it is the most useful thing ive seen!", "verified": true, "helpfulness": "0/0", "author": "Ivanna De Lourdes Sánchez Aguilar"}, {"rating": 2.0, "review": "It would be an absolutely wonderful product if it worked as advertised. In reality Google Music Play--one of the main apps for which you would consider buying this in the first place--only connects with the bleeding dongle when it feels like it. Every so many tracks you will be presented with a loading screen until hell freezes over, or you decide to reboot the damned thing, whatever happens first.Very disappointed on Google's threshold for product quality.", "verified": true, "helpfulness": "0/1", "author": "Rodolfo Rodriguez"}]