[{"rating": 5.0, "review": "Unit works very well. Good product for the price.", "verified": true, "helpfulness": "0/0", "author": "WOODY"}, {"rating": 5.0, "review": "Amazing!", "verified": false, "helpfulness": "0/0", "author": "Ana de Bem"}, {"rating": 2.0, "review": "Just not as good as Roku after all. Nothing poor can be said about the quality after all, it's Google. However, I believe that Roku just delivers far better results. Now I know that it's all preference but there are some things to consider so i'll give some pros and cons to help those making the decision to purchase a set-top-box.Pros*Fast start up when powered by tv*Ability to 'cast' from many devices*Widely supportedCons*No remote (you can use your smartphone so this is just about not having a dedicated remote)*Not stand alone^ This was the big one for me, and the reason that I chose Roku. When I want to 'veg-out' on the couch to some Walking Dead I don't want to go and find my phone or run to my PC. With the Roku there are 'apps' dedicated to certain services (Netflix, HBO, ect) but for Chromecast you have to go to the website and cast from your PC (Android or Mac).", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "Love this product! Easy to install and use. A great new way to enjoy watching Netflix and Hulu on your t.v. if you don't have a smart t.v.", "verified": true, "helpfulness": "0/0", "author": "living/edge"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Eduardo Hucho Caldeyro Biestro"}, {"rating": 5.0, "review": "works really good!", "verified": true, "helpfulness": "0/0", "author": "Fernando Marines"}, {"rating": 4.0, "review": "The instructions are easy to follow, but it did take a few reboots for it to finish all the updates on the device.  Now that it's working, I love watching YouTube & Netflix, and I downloaded a couple other free apps.  It only works with a small number of apps today, but I'm sure that will expand in time.", "verified": true, "helpfulness": "0/0", "author": "J. Stephens"}, {"rating": 5.0, "review": "A great little unit. I got it for a relative and he loves it.", "verified": false, "helpfulness": "0/0", "author": "Selwyn S. Elledge"}, {"rating": 5.0, "review": "Love it! Easy connection, easy hook up.", "verified": true, "helpfulness": "0/0", "author": "animalover1"}, {"rating": 5.0, "review": "Almost brainless to install and use. Everyone should have one!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]