[{"rating": 4.0, "review": "Great device for it's cheap price but would be great if Google updated it to mirror devices like Apple's airplay.", "verified": true, "helpfulness": "0/0", "author": "Harry"}, {"rating": 5.0, "review": "+++Fast delivery, great product, and it does what they said it would do. Easy install to a digital audio/video receiver. Excellent audio and video from Netflix and youTube. Easy set up on a Nexus 7 tablet.---Not enough sources available yet.", "verified": true, "helpfulness": "0/0", "author": "ALAN F."}, {"rating": 5.0, "review": "Works well, easy setup, still waiting on more third-party app support, but the product itself is amazing. This is one product everyone should have.", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Ball \"LDR\""}, {"rating": 4.0, "review": "Hmmm. I'm having mixed emotions. It's great! I can stream Pandora to my TV with chromecast, wait i can already do that with my sony Blu Ray. It sucks! It makes You Tube full screen if I use the chrome browser... not a lot of value added there. On the plus side, I can mirror my laptop to my tv using chrome. Set up is easy and intuitive. I have not taken the device on a business trip yet...", "verified": true, "helpfulness": "0/0", "author": "Zipdog"}, {"rating": 5.0, "review": "Works GREAT for the features it has so far. Hulu+ working now. Can't wait for more apps to get on board like Twitch and HBOgo, but great so far.", "verified": true, "helpfulness": "0/0", "author": "Wyered1"}, {"rating": 5.0, "review": "Great for Netflix, Youtube, and Google Play Movies. Casting a tab in Chrome works great from my new Mac, but is choppy on my old, slow Mac. Despite that problem, I prefer the Chromecast over Roku and Apple TV.", "verified": true, "helpfulness": "0/0", "author": "B. Alexander"}, {"rating": 5.0, "review": "This is a great device, it helps when the kids want to watch tv and you are in another section of your house. No more trying to find a channel or program.", "verified": true, "helpfulness": "0/0", "author": "Martín Altamirano"}, {"rating": 1.0, "review": "This thing is an epic failure. I picked it up in the hopes of being able to stream web programing to my TV. I got it up an running but when it came to stream it was a no go since Google does not support MS Sliverlight and of course the web programing I wanted to stream is using MS SIlverlight. And since I already have a PS3 and the Roku there was no reason to keep this device, so I packed it up and returned it to Best Buy. This device is a great idea in theory but the execution of it is sad with its limited app support and no MS Silverlight support.", "verified": false, "helpfulness": "1/4", "author": "Vixen \"groovey\""}, {"rating": 1.0, "review": "disappointed with how impossibly difficult it is to connect Netflix to TV  using Silverlight.....still not done....any other options...no problems with You Tube...computer is a Mac", "verified": true, "helpfulness": "0/1", "author": "Raj Mitta"}, {"rating": 5.0, "review": "If you're thinking about purchasing a Google Chromecast, make your purchase today as this is my 3rd Chromecast that I purchased - One for every TV as it is a must have product. You can't beat $35 and stream most of your favorite content. I have my power cable plugged into the outlet instead to the USB port on the TV as this allows me to turn my TV on once I hit the CAST button on my phone/laptop.I also had multiple people at my house all casting content from youtube to my TV to listen to favorite music videos and such. A must have.", "verified": true, "helpfulness": "0/0", "author": "Ruslan Parsegyan"}]