[{"rating": 5.0, "review": "Great little device.  Very responsive and fast.  I was pleasantly surprised.  I like it much more than my apple tv.  Was also able to install Xbmc very easily making it that much more functional.", "verified": true, "helpfulness": "0/0", "author": "sato108"}, {"rating": 3.0, "review": "Still have to buy all my content - Prime, Hulu Plus, and Netflix", "verified": true, "helpfulness": "0/1", "author": "Mr. William Lutman"}, {"rating": 5.0, "review": "I just purchased a second device after my trial with the first. I've recommended it to many friends and family as a convenient and easy to use device and far cheaper than a gaming device. I'm finally using my Prime benefits to the max!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"seeker7\""}, {"rating": 5.0, "review": "It is so fast to movies loaded! It is terrific. I love it!", "verified": true, "helpfulness": "0/0", "author": "Laura G"}, {"rating": 5.0, "review": "I researched and pondered whether or not Amazon Fire TV was for me. Still not sure, I finally said what the heck and ordered. Have to say, this was the best $99 Amazon purchase I've ever made!Number one, it's easy to use! Best of all everything you could possibly want to watch or listen to is readily available and easy to load.One thing...be sure you have Amazon Prime to take advantage of all the free content!Oh...and it's so easy to install, even I could do it without help. Love my Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Crabhappychick"}, {"rating": 5.0, "review": "Very easy to use and operator friendly", "verified": true, "helpfulness": "0/0", "author": "Bob M."}, {"rating": 5.0, "review": "Made my Apple TV obsolete!", "verified": true, "helpfulness": "0/0", "author": "Gerard Rebalsky"}, {"rating": 5.0, "review": "I love this product so far. I had nothing but trouble with my Roku so my expectations were low. Good hd picture, easy to understand menu options and reasonably priced.", "verified": true, "helpfulness": "0/0", "author": "J. C. Moran \"ipmtech\""}, {"rating": 5.0, "review": "Love it! Very pleased. A few minor kinks to be sorted out but overall very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 5.0, "review": "I use it for Hulu pluse, plex, XBMC and Showtime. really impressive .", "verified": true, "helpfulness": "0/0", "author": "Ahmed Almuhairi"}]