[{"rating": 4.0, "review": "The product is great! Works great and has plenty of features! They just need to get more apps on there. But in time.", "verified": true, "helpfulness": "0/0", "author": "Kevin Truong"}, {"rating": 5.0, "review": "Very pleased with this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing, best thing you can buy!", "verified": true, "helpfulness": "0/0", "author": "Graphic style"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Dragontopia"}, {"rating": 4.0, "review": "I don't like having to be associated with my payment account because somewhere down the line the wrong button is going to be pressed and I'll be charged for it.", "verified": true, "helpfulness": "1/1", "author": "PEGGY V."}, {"rating": 5.0, "review": "I had purchased the apple tv box and did not care for it, but i love this amazon fire, but amazon needs to add more shows.", "verified": true, "helpfulness": "0/0", "author": "cantcu"}, {"rating": 1.0, "review": "Cumbersome and requires multiple other subscriptions to work......might as well have cable, less hassle.", "verified": true, "helpfulness": "4/8", "author": "Reviewer"}, {"rating": 5.0, "review": "I got sucked into getting this..and I LOVE it!  It is very easy to use and it puts me one step closer to getting rid of my cable.  The Hulu app is a little wonky on my system, but I think that is more my online service than Fire.  So hopefully my crappy online provider will eventually get better.....If you are a Prime member this is so much better than Apple TV or the Roku!", "verified": true, "helpfulness": "0/0", "author": "Elaine Otsuka"}, {"rating": 5.0, "review": "Awesome sure would love to surf the web with it or just have some other good web sites like wikipedia", "verified": true, "helpfulness": "0/0", "author": "curt w"}, {"rating": 4.0, "review": "I love being able to access Amazon instant videos as well as other apps on this device.  I haven't had any problems streaming videos and the picture quality is crystal clear.  My only problem with it is that I haven't been able to use my Prime Music app on here, which is why I only gave it 4 stars instead of 5.  It might be something I'm doing wrong.  I would definitely recommend this to others.", "verified": true, "helpfulness": "0/0", "author": "Jen O."}]