[{"rating": 5.0, "review": "Amazing device. Really easy and quick to set up, super user friendly, and it's cheap!!!The best way to watch Netflix movies and YouTube videos on your TV, without cables. I just hope that Google release new apps soon, specially a solution for mirroring locally stored videos and photos (they are working on their own version for AirPlay)Totally recommended.", "verified": true, "helpfulness": "1/1", "author": "PixelArmada"}, {"rating": 3.0, "review": "I am disappointed with the Chromecast.  While the picture on my flatscreen is awesome, controlling it is difficult.The iPhone app is okay to search for a movie/tv show (such as on Netflix), and also works well sending the \"cast\" command to start viewing on the TV, but that's where the convenience ends.  The app is supposed to allow pause, play, rewind, stop and volume control, essentially using the Iphone as a remote control.  It certainly doesn't function as promised.  I have found that once you start viewing the video on TV, the app is unresponsive to any additional commands.You are stuck watching the entire video to the end without any way to pause it or cancel it.  The only way I could stop a video was to unplug the Chromecast from it's USB power source.So, I tried it on my laptop with the required Google Chrome browser and Chromecast extension installed.  It seems to work much better, but the whole point of buying the Chromecast was to avoid having to wrestle with a laptop.Google needs a better IOS app.  The current one is aweful.  Google and Apple need to stop their childish squabbling and do something for their consumers for a change.", "verified": true, "helpfulness": "1/1", "author": "JG"}, {"rating": 5.0, "review": "Great product. Now supports, HBO Go, Hulu Plus and practically any video website from the chrome browser. Super easy to setup and use.", "verified": true, "helpfulness": "1/1", "author": "Gregory S. Clarke"}, {"rating": 5.0, "review": "This has solved the problem of giving up the use of a laptop to view Netflix on the TV. Without a playstation or other device that was the only choice. Not only do we not need to connect the laptop with the TV with a cable- now we can use the laptop while it is playing the movie!  A few things though:- you need to plug it in to a power source if a USB plug isn't on the TV (included and USB cable). It is to be unplugged when not in use to avoid overheating.- be sure to have your password handy for your wireless- usually on back of modemThis has been a huge convenience saver for those of us who don't have video game consoles to run Netflix through and by far the cheapest and most discreet option.", "verified": true, "helpfulness": "0/0", "author": "Rilling123"}, {"rating": 1.0, "review": "only plays netflix and youtubenothing else.needs to be able to do morenot a very effective device overall", "verified": true, "helpfulness": "0/3", "author": "JITEN GOHEL"}, {"rating": 4.0, "review": "It is worth the money. I can now disconnect my Wii that is hardly used because it was the only way for me to access Netflixs. Buy it,", "verified": true, "helpfulness": "0/0", "author": "Don Wactor"}, {"rating": 5.0, "review": "I picked this up for a few reasons, I'm a fan of Google technology and it was cheap. I knew when I ordered it, apps were limited, but for the price it was worth a try. Using my Samsung tablet or phone to cast movies from Google Play is really easy - tap the Chromecast icon and select my Chromecast to connect. It just works. I've purchased a handful of movies from the store and they work flawlessly and look great (I the device hooked up to a 42\" Plasma and surround).Now that Plex is an option (only to PlexPass subscribers at the time of writing) I'm seriously considering getting another one for my second TV. Plex lets me play local movies, photos, etc. and does a fantastic job. I like this much better than my Apple TV because I'm not tied to iTunes, which is a personal preference.I'm about to drop cable so Hulu Plus being on here is huge. I'm not a subscriber yet, but I expect it to work well on this device.With the Chromecast, I can get everything I want without another remote lying around or another box on my furniture. This thing is so small and hidden away, it's non-existent until I need it. I'm in for at least one more!", "verified": true, "helpfulness": "0/0", "author": "boywundr \"boywundr\""}, {"rating": 4.0, "review": "Works very well across all devices. Would have been 5 stars if initial setup wasn't difficult...Set-up took a few hours because nothing would connect except my Nexus 7 tablet.  If I did not happen to own one, I don't think I could have got this chromecast to work on day 1.  Google needs to figure out a better way to make this device detectible on regular android phones and standard desktops.", "verified": true, "helpfulness": "0/0", "author": "C. Johnson"}, {"rating": 5.0, "review": "Its google. It just works.  And its handy for my older HD non-\"smart TV\".  Only thing I wish is I could control the input source to go back to TV.", "verified": true, "helpfulness": "0/0", "author": "ExpertDave"}, {"rating": 5.0, "review": "Took out of the box, hooked up to the TV, installed the app on my iphone, and within minutes was watching You tube videos on the TV!  Easy to setup and easy to use!", "verified": true, "helpfulness": "1/1", "author": "Jason Talbot"}]