[{"rating": 2.0, "review": "I cannot get this thing to work. We have an Apple Airport Extreme wifi setup and Chromecast cannot connect to it. Is this a Google v. Apple battle? I have looked online for help. I have found others have the same problem but have not found a solution. I may change this rating if I can get the two to play nice. Apple TV works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "John \"jpearson@wje.com\""}, {"rating": 4.0, "review": "Set up was okay  but after all it does good.", "verified": true, "helpfulness": "0/0", "author": "JOHN A MORENO"}, {"rating": 5.0, "review": "love this device! it's cheap and really easy to set up. Fun, Fun, Fun !!!!", "verified": true, "helpfulness": "0/1", "author": "Jonathan Holland"}, {"rating": 5.0, "review": "This little piece of technology is wonderful.  Simple as can be to install.  Simple to use.  There when you want it.  Gone when you don't.  I hate watching any video longer than 5 minutes on my laptop, much less an hour long piece.  With this I just hit Chromecast and it's instantly on my TV.  Chromecast let's you watch all that stuff you might not otherwise.  I think you will like this.", "verified": true, "helpfulness": "0/0", "author": "George Machun"}, {"rating": 5.0, "review": "So much potential!", "verified": true, "helpfulness": "0/0", "author": "Antonn Harden jr"}, {"rating": 5.0, "review": "my wife uses it to stream movies to our hdmi tv from her laptop.  she enjoys it .", "verified": true, "helpfulness": "0/0", "author": "David Sonnier"}, {"rating": 4.0, "review": "Slight delay and a couple more steps for setup than I imagined, but so easy :)", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "WORKS !!!", "verified": true, "helpfulness": "0/0", "author": "richard charles"}, {"rating": 5.0, "review": "It has opened up the world of YouTube for me", "verified": true, "helpfulness": "0/0", "author": "joe miller"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Christopher M Wilke"}]