[{"rating": 5.0, "review": "I was a little worried about video quality but this this is AMAZING!  It took a whole minute maybe 2 to set up and we were ready to go.  Netflix streams in HD quality just like if I were watching a rented movie.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Shannon Pace"}, {"rating": 5.0, "review": "I love this for Netflix...cant wait till I can use it for other things!!  They are working on HBO GO and Hulu plus and I am sure many other services.", "verified": true, "helpfulness": "0/0", "author": "T. Pilgrim"}, {"rating": 2.0, "review": "I still have not not fully installed the unit. It got \"stuck\" in set up and took a lot of work to unstuck it. I have yet  to play anything on it. Maybe it's me I not very nerdly.", "verified": true, "helpfulness": "0/2", "author": "sidrockman \"sid\""}, {"rating": 4.0, "review": "Works great, but it only allows streaming. I was hoping to be able to play back DVD's from my laptop.", "verified": true, "helpfulness": "0/1", "author": "RALFB \"RAL\""}, {"rating": 2.0, "review": "Original advertisment stated that you could stream items from the internet, but this is not true.Netflix seems to be the only movie content you can get from the Chromecast.", "verified": true, "helpfulness": "1/2", "author": "DONALD E. WALTERICK"}, {"rating": 4.0, "review": "It is a great buy for its price. The app interface to the device is not quite smooth in its operation. Sometimes the app doesn't recognize the device though the device is connected to wifi. Once connected, the app should have save feature so that you don't have to do it over and over again (trying to connect). I guess it a software feature and could be evolving. Right now it does not allow the your music to be played on TV through the app which is discouraging. Hope this feature also can be enabled in the future via software update.Anil", "verified": true, "helpfulness": "0/0", "author": "Anil Nagalla"}, {"rating": 5.0, "review": "It's everything they say it is. I read about it in a magazine which talked up it's value and ease of use. To me it's \"Magic\"' what more can I say?", "verified": true, "helpfulness": "0/1", "author": "Peter Spence"}, {"rating": 5.0, "review": "New electronics are awesome, I love this new toy, I can't wait till they add more channels to stream from it.Like away to stream your personal videos from your cell phone.", "verified": true, "helpfulness": "0/0", "author": "N.Harrison"}, {"rating": 5.0, "review": "I love watching YouTube on my ig screen tv using chromecast. It was easy to install and easy to use. The price is so worth it!", "verified": true, "helpfulness": "0/0", "author": "Jans45"}, {"rating": 3.0, "review": "I mainly bought this to watch any video from internet not just youtube and netflix. I watch netflix thru my blue ray player which is good enough for me .Anyway setup of the chromecast was quite easy . I was using a android device ( Samsung Galaxy Tab ) . Then I tried to cast from youtube. I had to download the latest version of youtube from google play store . Youtube casting sort of met my expectatons . The picture quality was pretty good .Then I tried to cast from my chrome web browser on the device and the fun started. I found I need a google cast extension to chrome browser . I tried to download that extension and found that the OS of my device is not supported for this google cast extension. And I am running Android !!! So that is a big big surprise as google is not supporting its own OS . Anyway I went to my window laptop and started the process again ( download chromecast from google play, install chrome browser , install google cast)Now I was ready to cast from chrome . I started with some news channels which show live tv . It was slow and jerky and sometime audio doesnot match video . Also the video plays in both my laptop and the tv thus probably contributing to bandwidth issues . Overall it is still not seamless to cast from chrome .Other issues I came up with1. For some reason when my laptop is connected to my office vpn it cannot connect to chromecast2. I often use a  movie site that uses microsoft silverlight, so predictably this does not work chromecastOverall I would say it is still a work in progress and hopefully google will continue to add other apps than youtube and netflix and it will continue to improve casting from chrome browser . and hopefully google will support it OWN OS Android very soon .Overall this is not the worst $35 I have ever spent !!", "verified": true, "helpfulness": "0/0", "author": "Bhaskardipta"}]