[{"rating": 4.0, "review": "Love the convenience of the chrome cast. However, I have only use youtube so far. Don't know if it works on any other video sources. Will find out later.", "verified": true, "helpfulness": "0/0", "author": "Mishu"}, {"rating": 5.0, "review": "What can I say.I LOVE IT!!!!!  I LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "scb12"}, {"rating": 1.0, "review": "Took three days, after installing it into an hdmi port for updates to download. Then when I launched it and viewed a YouTube selection, everything was fine. HOWEVER, I could not access other inputs (tv, dvd player) on my tv screen while using Chromecast. I had to shut down Chromecast, remove the hdmi connection and then unplug my tv so that the tv could reboot and restore it to the point where I could select other inputs. Also, Chromecast never showed up as an available input. Confusing, to say the leas", "verified": true, "helpfulness": "0/0", "author": "Honolulu Guy"}, {"rating": 5.0, "review": "Second one so that kind of speaks for itself. Love the way it streams, but you have to stream through a google chrome browser.", "verified": true, "helpfulness": "0/0", "author": "mike \"mike\""}, {"rating": 5.0, "review": "Love this product. But you should know its better with androids versus iPhones..you can stream from more apps. With the iPhone you can only stream from a couple places, like Netflix and Flixter", "verified": true, "helpfulness": "0/0", "author": "B. Frizzle"}, {"rating": 5.0, "review": "Very happy with it. Use it to stream Youtube as well as movie directly from Note 2 phone to a flat screen.  Not tallking about NFLX Great deal.", "verified": true, "helpfulness": "0/0", "author": "m hinkleman"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "1/1", "author": "karan"}, {"rating": 5.0, "review": "Easy to install, easy to use.  I love it!  SO much easier than running an HDMI cable from your laptop to your TV - plus all the devices in the house can use it.", "verified": true, "helpfulness": "0/0", "author": "Sterzenbach"}, {"rating": 2.0, "review": "Quite often, it cannot connect to devices (Phone as well as chrome browser on laptop). We have to unplug and re-plug it. Also, the video casting from chrome doesn't work smoothly.", "verified": true, "helpfulness": "0/0", "author": "Deepoo Kumar"}, {"rating": 5.0, "review": "Good, too bad not everything can be cast,  and no web browser", "verified": true, "helpfulness": "0/0", "author": "Milton"}]