[{"rating": 4.0, "review": "Easy to use and easy to set up! Love it!", "verified": true, "helpfulness": "0/0", "author": "Brianna Fritsch"}, {"rating": 5.0, "review": "Terrific", "verified": true, "helpfulness": "0/0", "author": "Randall A. Tarter"}, {"rating": 5.0, "review": "The free content with prime is awesome.  The voice input is handy.  Everyone wants to watch the TV where the fire is.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Camper\""}, {"rating": 5.0, "review": "Works wonderful! Super easy to set up and great picture! So happy I spent the money on it! So worth it! Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Sonya M."}, {"rating": 1.0, "review": "Well I honestly can't tell you how it works but the remote control is not working. This id horrible!!!! Why or how can a brand new item not work, this bad that i have to wait on a new remote.", "verified": true, "helpfulness": "2/7", "author": "Sasha Harding"}, {"rating": 5.0, "review": "Just love Amazon fire. It gets heavy use and the voice activated search engin with the remote works perfectly. I give it two thumbs up. Way up. Gave one as a gift. It was well received and appreciated. Excellent product.", "verified": true, "helpfulness": "0/0", "author": "John Clark"}, {"rating": 5.0, "review": "Love this thing.  The voice command feature is the best.  Just say what u want to watch and it pops up right there on the TV.  No Showtime though, really wish I could access Showtime.", "verified": true, "helpfulness": "1/1", "author": "Josh T."}, {"rating": 5.0, "review": "I can't believe how many free movies I get with my amazon prime. Love the choices and its very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Danny Klkunck"}, {"rating": 5.0, "review": "Much faster and nicer than my old ATV2. Second 5 star rating to the XBMC/KODI team, it runs smoother than ever on the FireTV.", "verified": true, "helpfulness": "1/1", "author": "xpricecheckx"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "kenji t"}]