[{"rating": 5.0, "review": "Fast shipping! I'm so glad I bought this!!! Everything is so much easier!! I'll definitely recommend this to my family and friends!", "verified": true, "helpfulness": "0/0", "author": "Alejandra"}, {"rating": 5.0, "review": "I use this thing all the time! If you are just looking to watch Netflix, Youtbe, or Hulu then this thing is for you. Not to mention it is still in beta testing. I am expecting big things out of this little device in the future.", "verified": true, "helpfulness": "0/0", "author": "Bryce"}, {"rating": 3.0, "review": "I was excited to get this product but somehow it had poor synchronize. It has stop or freeze the signal when I watch video. I prefer hdmi cable better. Don't waste your money.", "verified": true, "helpfulness": "1/1", "author": "david tran"}, {"rating": 5.0, "review": "We primarily watch Netflix and Youtube on our 60\" tv. We used to have our tower connected to it to do so, but one day, the cable just gave up. We compared Chromecast and Roku 3, but being cost conscious, we went with Chromecast, and we couldn't be happier. We use our Samsung Galaxy S3 smartphones or Google Nexus tablet as the controller. Set up was a piece of cake. Now my 6 year old can pick and choose what he wants to watch with ease.", "verified": true, "helpfulness": "0/0", "author": "Jason Pusey"}, {"rating": 5.0, "review": "If you want to stream anything from your computer to your TV ... then get this. Can't believe how inexpensive it is.", "verified": true, "helpfulness": "0/0", "author": "Greg Dawson"}, {"rating": 5.0, "review": "After I saw my father becoming a big fan of chromecast for watching youtube songs on the commodity of his bed, I learned that chromecast offers all kind of people of all ages a way for using technology everywhere. For me has been great, I can watch netflix without any problem and see stuff in my phone with AllCast.I have 4 of these in my house and each one works increible.", "verified": true, "helpfulness": "0/0", "author": "Rolando J. Lazcares V"}, {"rating": 1.0, "review": "I can't make it work. I have read the online user manuals which have provided no help. After working on it for a week  I have given up.", "verified": true, "helpfulness": "1/4", "author": "Hollis Kinney"}, {"rating": 3.0, "review": "Setup is easy... but i have had to do it twice... I don't know what happened, but it didn't save my network.Mirroring my device on the tv, or using it to view photos is very slow. Video streaming outside of an app is useless.Netflix, etc. works flawlessly so far.", "verified": true, "helpfulness": "0/0", "author": "Mike \"mike\""}, {"rating": 5.0, "review": "It's simple to use! I've had no problem with this thing at all. I got it for my parents, because they love watching Netflix, but sometimes wish they could watch it upstairs in their room. Their tv doesn't have Netflix built into it, so I get them this. It's cheap and effective! Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Victoria V."}, {"rating": 4.0, "review": "We are an Android/Google household so I may be a little biased, but I definitely think this is worth the price.  The developer kit has been made public so I'm expecting a lot more apps to add Chromecast functionality.  We mainly use it for Plex, HBO Go, Pandora, and  the Chrome browser (use it mainly to cast Amazon Prime Instant Video) right now.  It's very easy to use and it works very smoothly on my Galaxy Note 3, Galaxy S4, and through the Chrome browser on both of my PC's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]