[{"rating": 5.0, "review": "Everything I thought it does", "verified": true, "helpfulness": "0/0", "author": "Malcolm Banks"}, {"rating": 5.0, "review": "I am so happy with chromecast Hdmi now I got to watched You Tube and Netflix all the time.Thank you.", "verified": true, "helpfulness": "0/0", "author": "ma. lourdes stoddard"}, {"rating": 5.0, "review": "Fantastic value. Can watch all movies from tablet projecting onto TV. Couldn't be simpler to use.", "verified": true, "helpfulness": "0/0", "author": "L. Donnelly"}, {"rating": 1.0, "review": "I'm a Google geek through and through. I have lived in the google ecosystem 100% since adopting chrome OS about 18 months ago.  Prior to that I was 80% there I just needed a compelling reason to ditch Microsoft finally.  Please keep that in mind as I say this.  Google's chromecast is an absolute and complete piece of garbage.  The design, OS, interface, concept, execution and over all final product are barely even Beta worthy.  Seriously, it's just BAD!  Save yourself the time and hassle and go with Roku 3. Google should have stuck with Google TV.  They hit a few bumps and abandoned a great idea for a horrible one.  The only compelling feature chromecast even has is casting.  It works so horribly, has terrible quality and causes so many delays and glitches it will drive you crazy.  My HDMI cable takes me less time to plug in and everything is flawless. If I want to operate remotely I just plug a wireless mouse keyboard combo into my chromebook.  I honestly wouldn't use this if someone gave it to as a gift, it's that bad.", "verified": true, "helpfulness": "2/3", "author": "Ian D. Smith \"ENERDROID\""}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Danis John"}, {"rating": 5.0, "review": "Seriously the best thing ever! It's the only source I have for my TV and its all I could possibly want. The latest update with screen mirroring from android seals the deal for sure.", "verified": true, "helpfulness": "0/0", "author": "Derek O."}, {"rating": 5.0, "review": "These HDMI units are great. They accept the YouTube signals and private pictures off your android without a problem. I have now six. one for each TV in Canada and now the same in Thailand.", "verified": true, "helpfulness": "0/0", "author": "Patrick Weitemeyer \"harley-lap\""}, {"rating": 5.0, "review": "want more", "verified": true, "helpfulness": "0/0", "author": "John Dwan"}, {"rating": 4.0, "review": "Product is very good and allows seamless casting from various devices. Very happy with it. First time setup was a bit cumbersome but so worth it for the low price. :)", "verified": true, "helpfulness": "0/0", "author": "A B \"AKB\""}, {"rating": 5.0, "review": "We can watch movies on our TV while they play on our computer. If you are having trouble watching Amazon Prime Instant Videos, uninstall Microsoft Silverlight and it will work great.", "verified": true, "helpfulness": "0/0", "author": "Jason Bonnell"}]