[{"rating": 4.0, "review": "hulu always freezes on this thing. rest works well.", "verified": true, "helpfulness": "0/0", "author": "renee grabski"}, {"rating": 5.0, "review": "Iam so happy with it", "verified": true, "helpfulness": "0/1", "author": "Paulo Sanchez V"}, {"rating": 4.0, "review": "I Like it a lot I added Kodi  To choose more of What I want", "verified": true, "helpfulness": "0/0", "author": "Craig Lamb"}, {"rating": 5.0, "review": "I am still learning things on my Fire TV but I am enjoying it a lot. The remote and sound search is great but I have to re-boot the system a lot and screen keep freezing but I don't know whose problem is that, netflix, Hulu or Fire TV", "verified": false, "helpfulness": "0/0", "author": "Dewayne Donohoe"}, {"rating": 5.0, "review": "We really enjoy all the shows and movies on Fire TV.  Also, all of the music I've purchased on Amazon is there for me to listen to.  Great picture and sound too.", "verified": true, "helpfulness": "0/0", "author": "Benjamin S."}, {"rating": 5.0, "review": "I like it so much that I am thinking about shuting off my Netflix.", "verified": true, "helpfulness": "0/0", "author": "Leo Schmitz"}, {"rating": 5.0, "review": "we love amazon fire tv!", "verified": true, "helpfulness": "0/1", "author": "jessica perez"}, {"rating": 4.0, "review": "I find the interface to be nicely placed, the system fast and integrates with all relevant services very well.", "verified": true, "helpfulness": "0/0", "author": "DN"}, {"rating": 3.0, "review": "Im from Ecuador. I have  a Premium account in Amazon but I cannot watch free movie; so, I just use my Amazon Tv for play games. This is not cool. And when I use Netflix, some movies dont have good quality. I prefer to use my ps4. Hence if you have ps4 dont waste your money in other things you dont need as I did.", "verified": true, "helpfulness": "1/1", "author": "Jonatan Enrique Delgado"}, {"rating": 5.0, "review": "This thing is awesome, wont go without it again", "verified": true, "helpfulness": "0/0", "author": "Darrell Fry"}]