[{"rating": 5.0, "review": "This device is great. The ease of setup was astounding. Anybody could do it. I even have my 50+ parents using it easily. So far, I have been using the chromecast to stream Plex to my TV. Much easier than using any other device. The amount of functionality you can have is amazing. Support for Mac, Windows, and Android is great... all of the devices used in the house!Pros:Easy to setupEasy to useGreat quality!Comes with everything you need: Chromecast device, HDMI extender (for hard-to-reach places and to improve wi-fi reception), USB cable and power adapterANY tab is \"castable\"Local media support via drag and drop into browser (With cast extension in chrome)Cons:No local media support for AndroidDevice lags depending on what the computer is doing. A heavy computer load will make some audio and video choppy.I fully recommend this device.", "verified": true, "helpfulness": "1/1", "author": "AJ A."}, {"rating": 5.0, "review": "Love the Chromecast dongle, it's an inexpensive way to stream Netflix from my laptop, iPhone, or iPad at home. It's also portable, easy to set up, and streams in full HD video and audio. Glad I bought it and highly recommend.", "verified": true, "helpfulness": "0/0", "author": "KSly \"halfgeek\""}, {"rating": 4.0, "review": "I like this product, but haven't been in habit of watching YouTube videos so really would like Hulu support to be added.  That said, the product is very easy to use and I would highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Marshall"}, {"rating": 2.0, "review": "I thought this device could replace Apple TV...with it's low price, I could buy several units for different rooms...Needless to say, I was very disappointed with the video quality. The video is not HD Quality...Im quite sure it's not my internet connection. I hope they can improve this device because it has potentials...for this price point, your getting a good deal, no matter what...", "verified": true, "helpfulness": "3/4", "author": "Icy Hott"}, {"rating": 2.0, "review": "Works well on a very limited range of apps. You get what you pay for, which isn't that much. What's sad is it could have been brilliant if they hadn't locked out almost everything...Save your money and buy an android stick or a Roku", "verified": false, "helpfulness": "2/3", "author": "Evan \"Readaholic\""}, {"rating": 2.0, "review": "still need alot of consideration  when using it outside usa. not easy to configure and install. if yiu have more than one device you have cont manager right.", "verified": true, "helpfulness": "1/2", "author": "baker akbar"}, {"rating": 2.0, "review": "So limited it should be from apple. For months now only netflix and google play. Casting from chrome is very poor quality. No ability to use Network attached storage, works only with a few limited sites on chrome and playback is rotten. So many other android dongles out there, and most have access to full play store and can access NAS and other sources on your network. Luckily it was only 35$ so I don't feel to bad. Had high hopes.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 2.0, "review": "If you have Apple TVs and iPhones/iPads, don't purchase this device.  Its intended purpose is to stream Chrome browser, Netflix, and YouTube content to your TV - something that Apple TVs have done for many years.  Other than its small size and low price, there's nothing particularly impressive or innovative about the Chromecast media player.  I'm no Apple fanboy, but when objectively compared to the latest Apple TV, the Chromecast falls short on features - i.e. no remote, can't be used without a laptop or mobile device, no apps (as of Sep-13), no support for Hulu or HBO go, etc.  Further, as indicated by other reviewers, the Chrome browser streaming is terrible - quality is lacking and lag is excessive,  In a nutshell, this is a low-end Netflix streaming device but you'll need an Android device to feed content.  Save your money and purchase a Roku 3 Streaming Player or Apple TV MD199LL/A.  While a Roku or Apple TV will set you back 3x more than a Chromecast, they'll give you substantially more features.  I don't know what Google was thinking by releasing this device - it's a great idea but is not competitive with offerings from Roku and Apple two years ago.Everything you need to know about the Chromecast streaming media player:- The Chromecast runs very hot.  Not sure if this will impact long term reliability.- The device includes everything you need to connect and power it.  But you'll need a laptop or mobile device to control it.- Setup was very easy and took less than five minutes.  Adding the Chromecast to a local WiFi network is simple.- Streaming quality from a Chrome browser is very poor - perhaps this is why Google still refers to the feature as \"Beta\"- The primary feature of this device, streaming from a mobile device or laptop, is a diminutive and well established feature with the Apply TV.  If you want screen mirroring and have Apple devices, stick with the Apple TV for better performance and wider support.- The Chromecast doesn't support Hulu, Amazon Prime, HBO Go, ESPN Mobile, VUDO, Disney Mobile, content on your LAN/NAS devices, etc.  If you want to watch something other than Netflix or Google Play, consider the Apple TV or Roku player.- The device isn't appropriate for a guest room or kids room - it requires a mobile device to stream content and it can't run standalone.Don't be fooled by the Chromecast's cheap price.  It only delivers a small fraction of features available in modern blu-ray players, connected TVs, Apple TVs, Roku players, and other smart TV devices.  I'm not sure who Google thinks will use this device, but unless you you have an old blu-ray player (or none at all), no connected smart devices for your TV, and only want to watch Google Play or Netflix, this device  probably won't knock your socks off.", "verified": true, "helpfulness": "2/6", "author": "Jeff Chambers"}, {"rating": 5.0, "review": "Just got my chromecast, and almost thought I got a bad dongle because all I could see was a black screen and 4 colored dots. I took the dongle out of the HDMI port, and hit the button 3 times then held the button for 30 seconds. Plugged the dongle back in, and now I have the setup screen.", "verified": true, "helpfulness": "1/1", "author": "N.Noa"}, {"rating": 1.0, "review": "I spend a couple of hours trying to get this to talk to either a Linksys E2000 wireless router or Verizon MiFi 4G router - and no luck with either (despite having iPads, Xbox, Wii, etc working fine with these routers). The setup process was great up until that point - and I like the concept, but as soon as it had a problem with the routers, the error messages were of no help. Apparently it doesn't like 2.4/5GHz routers - or maybe it doesn't like .n routers. Very disappointing.", "verified": true, "helpfulness": "12/16", "author": "Dave Matt"}]