[{"rating": 4.0, "review": "I like it but I have to connect my DSL connection via Ethernet cable.  The DSL router just doesn't have the band width to perform properly.  I would have to shut down and reboot about every 15 minutes as the picture would freeze.  Once connected with the Ethernet cable it works great, just a little limiting as to where I can hook up.", "verified": true, "helpfulness": "0/0", "author": "Thomas L. Hall"}, {"rating": 2.0, "review": "I see the availability of shows(for a price), in fact nearly everything has a price. Outdated aged shows for $14.50, old TV series $12 each...really", "verified": true, "helpfulness": "0/1", "author": "Glenn"}, {"rating": 4.0, "review": "Love!", "verified": true, "helpfulness": "0/1", "author": "leelee4964"}, {"rating": 5.0, "review": "I really enjoy the voice command feature!", "verified": true, "helpfulness": "0/1", "author": "Juan P Palau"}, {"rating": 5.0, "review": "Wonderful !!!!", "verified": true, "helpfulness": "0/1", "author": "The Goose"}, {"rating": 4.0, "review": "Very pleased with performance and also with the Amazon company.......", "verified": true, "helpfulness": "0/1", "author": "Gail Toshok"}, {"rating": 5.0, "review": "Great Purchase!!!Having received my Fire TV today, I've been trying it out for the past couple of hours.Setup was a no brainer. It required an update immediately so it did take about 15 minutes to have it in action but the process was very simple.The image quality (movies and games) is excellent. I've tried several movies from Amazon Prime and they look and sound nearly Blu Ray quality as far as I can tell.Navigation is very straightforward and it's generally easy to find anything you're looking for. Installation of games and apps goes very smoothly and generally pretty quickly.The remote works very well. I haven't played with the voice search feature much yet, but when I have tried it, it worked well. The buttons on the remote are well thought out and I prefer it to the Apple TV remote.", "verified": true, "helpfulness": "0/1", "author": "Kevin Doyle"}, {"rating": 5.0, "review": "Outstanding!!", "verified": true, "helpfulness": "0/1", "author": "RYAN QUINTANILLA"}, {"rating": 4.0, "review": "This was really easy to set up, and I enjoy the variety of movies, documentaries, and TV series.  I would like to see a little better organization of the types of programs available, such as drama, humor, comedy, children's, etc.", "verified": true, "helpfulness": "0/1", "author": "Chuckalufagus"}, {"rating": 4.0, "review": "Lots of apps only thing i dont like is some apps you have to have cable subscription but i do like the sling tv app it has my sports channels now i can cut cable", "verified": true, "helpfulness": "0/1", "author": "mike doty"}]