[{"rating": 5.0, "review": "Works fantastic.  I use it especially for Netflix, Hulu and YouTube.  HOWEVER (not the product's fault), Amazon will not let it work on Amazon streaming videos (Prime Videos) which is a bummer.  There is no legitimate workaround and the workaround available is horrible.", "verified": true, "helpfulness": "0/0", "author": "Jean K"}, {"rating": 5.0, "review": "Works just as it advertises. This is my second unit. I do not have any smart tvs in my house but chrome cast makes it seem that way. Was easy to set upThe only disappointment is not with Chromecast but rather the app who do not have it as an option to cast. With only a smartphone,  a cheap one at that, it's a whole new experience.  The kids love that they can cast from thier phones.... maybe a bit too much for my liking. .. lolAn inexpensive option for a guest room too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "little plastic junk", "verified": true, "helpfulness": "0/1", "author": "Sergi"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "saudides"}, {"rating": 5.0, "review": "Excellent! tks", "verified": true, "helpfulness": "0/0", "author": "LUIS JORGE VIGANOTTI"}, {"rating": 4.0, "review": "Took a little time and patience to cast through my Apple phone,but everything is streaming just fine.", "verified": true, "helpfulness": "0/0", "author": "R. G. Ruiz \"ralphieru\""}, {"rating": 5.0, "review": "This is the second Chromecast which I have bought. It was just as easy to set-up and works just as well! I would recommend researching what you are hoping to accomplish when deciding between the Chromecast and FireStick and Roku. I found that the freedom and development support of the Chromecast were ideal for me. Also, for anyone struggling to cast a web browser tab, I would suggest using Google Canary (beta Chrome) and the Google Cast (Beta) extension. I have had the best luck with that. Now that my WiFi network has been optimized, I am able to stream all browser tab videos perfectly.", "verified": true, "helpfulness": "0/0", "author": "Ben Kramer"}, {"rating": 2.0, "review": "I am a Google-aholic on just about everything, but with the Chromecast, It depresses me, but I seriously SERIOUSLY disagree with any 4 or 5 star review here. I suggest to those reviewers to try a Roku for a while and then re-evaluate their Chromecast review. I seriously did not think it was possible for Google to be absolutely DOMinated by another company's similar product in every positive category that could be rated. There is NOTHING the Chromecast can do that Roku cannot equal or better, usually better by a significant margin. I'm slightly embarassed for Google and now feel like I need to shower to clean myself of this blasphemous review.", "verified": true, "helpfulness": "0/0", "author": "EatCampFoilFly"}, {"rating": 5.0, "review": "Excelente.", "verified": true, "helpfulness": "0/0", "author": "karol caceres"}, {"rating": 5.0, "review": "Chromecast came in original packaging. Brand new with all the necessary stated accessories. Worked perfectly the first time setting it up with my MacBookPro. Loving it so far! :) Very satisfied with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Henry Macias"}]