[{"rating": 4.0, "review": "Everybody needs at least one!", "verified": true, "helpfulness": "0/0", "author": "Brian C."}, {"rating": 5.0, "review": "The best product ever", "verified": true, "helpfulness": "0/0", "author": "Esteban Sevilla"}, {"rating": 1.0, "review": "Worst product ever bought from Amazon. I bought this product yesterday and it won't even connect to my Tv. At one point it tried to connect and you will see the code but besides that there is no live streaming on my Tv. At first it was telling me to connect to a different router or a different access point even though i set up everything correctly. Terrible device. Took me hours to set it up and still doesn't work. Do not waste your money on this product. Not easily accessible and it's not as easily installed and available to use as Google says.", "verified": true, "helpfulness": "0/0", "author": "EPHREM TESSEMA"}, {"rating": 1.0, "review": "Terrible buy", "verified": true, "helpfulness": "0/1", "author": "Heather Stifler"}, {"rating": 5.0, "review": "Awesome!  Chrome everything now.  I stream music, shows, movies.  This is the BEST way to make your TV smart!", "verified": true, "helpfulness": "0/0", "author": "Andrew S. \"amazon addict\""}, {"rating": 1.0, "review": "Horrible product. Does not connect to Netflix and if it does it looses connection in a few minutes", "verified": false, "helpfulness": "0/0", "author": "Tim Rasmussen"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "michael hardick"}, {"rating": 5.0, "review": "Purchased as a gift for family member. It worked so good I bought one for playing movies on demand off you tube etc. Once it is set up it works fine. Fairly easy to set up and help is on line if you have issues.  Highly recommend for home use.", "verified": true, "helpfulness": "1/1", "author": "Frank Eckert"}, {"rating": 5.0, "review": "just like all other reviews, it is good for what it does and can be better.", "verified": true, "helpfulness": "0/0", "author": "Tax Free Shopper"}, {"rating": 5.0, "review": "Sweet little dongle of the gods.  I love you.", "verified": true, "helpfulness": "0/0", "author": "Cody W. Yankey"}]