[{"rating": 2.0, "review": "LIKE ROKU BETTER", "verified": true, "helpfulness": "0/1", "author": "Laura Baez"}, {"rating": 5.0, "review": "Omg love love this little gadget. Bought 4 over the holidays for us and family members. Easy to hook up. Took a little bit to get used to using my phone as the remote but I love that I don't have another remote to fuss with. Even my dad who's in 60's uses this with ease. I highly recommend If you watch Netflix, Hulu etc it's awesome!", "verified": true, "helpfulness": "0/0", "author": "ttower"}, {"rating": 3.0, "review": "Not exactly sure what all the hoopla is about this device. They make it sound like it's the best thing since sliced bread, but it's pretty limited in my view. I wanted to be able to display pictures and video from my PC laptop onto my TV wirelessly. So far, the only thing I can put up on the TV is YouTube, and then only if I view it from Google's Chrome browser and then only after remembering how to use it and waiting for all the connections to hook.I guess there are other things it can do, but it's not that intuitive. My Roku is clearly superior, but also cannot view my PC's content. Still looking for that perfect device.", "verified": true, "helpfulness": "0/0", "author": "Daniel A. Koblosh"}, {"rating": 5.0, "review": "Works very well and easy to program", "verified": true, "helpfulness": "0/0", "author": "nyomi mackey"}, {"rating": 4.0, "review": "I like it very much! I used to have to hard wire connect my TV to my comp to watch Netflix and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Binh truong"}, {"rating": 5.0, "review": "Only thing I dislike is the latency it has when streaming from your laptop to the t.v but that's probably due to wi-fi connection etc. One of the best purchases you could ever buy with your money! Google will never steer you wrong.", "verified": true, "helpfulness": "0/0", "author": "Mitchell"}, {"rating": 5.0, "review": "For the price, this thing is awesome. It was tricky to set up, especially after I moved and changed wireless routers, but I think that process has been improved since.This is a must-buy for anyone buying into the brand-name Android line for phones and tablets. The improvements continue to roll out and sweeten the deal for these users.For Apple users, it's a slightly different story. This is good for the one-offs, and for guests, and for those of you who would rather not purchase the Apple TV. You can stream, but I have had my iPhone lose control of the device, so I could no longer pause Netflix. Otherwise beautiful setup.The Chromecast is also useful as a television appliance for another reason: remote power-on.Many smart TVs when off or on standby, are not connected to the network, rendering network-based mobile-app remotes useless. For those of you whose TVs allow HDMI-CEC (Anynet+ on Samsung), this product allows for remote power-on if the Chromecast is powered by your power outlet rather than the TV's USB port. (Though, some TVs allow for USB Power at all times.)All in all, great purchase for the price, and blows Smart TV apps out of the water.", "verified": true, "helpfulness": "0/0", "author": "j."}, {"rating": 5.0, "review": "Love this product.  Not always a cinch to connect to it but works like a dream once connected.", "verified": true, "helpfulness": "0/0", "author": "D. Malinowski"}, {"rating": 4.0, "review": "Not completely intuitive, but we figured it out.  Not as much free content as you might expect.  Streams seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Matt L"}, {"rating": 4.0, "review": "Fire TV is slightly better because now my iPad Youtube app can connect to it, too, and the remote control gives me several more degrees of control over playback and search. But it's good. Frankly, you need to spend the extra $10 and get a Fire Stick TV for $40.", "verified": true, "helpfulness": "0/0", "author": "Grranimal \"Fuerkraft\""}]