[{"rating": 5.0, "review": "It is fun to use Chrome cast... The best thing is, it is supported unlike \"had excellent potential\" product Google TV.", "verified": true, "helpfulness": "0/0", "author": "GeePee"}, {"rating": 5.0, "review": "Better than apple TV, I literally only use this and don't pay for cable.  It's a more user/device-friendly wifi streaming tool :)", "verified": true, "helpfulness": "0/0", "author": "Kathy A. Tran"}, {"rating": 2.0, "review": "There are so many, much better streaming devices out there. The quality (not great) and steps involved, plus the fact that it needs to be plugged in (another cord to deal with) all added up to serious disappointment with this product.", "verified": true, "helpfulness": "0/0", "author": "Meredith A. Nelson"}, {"rating": 5.0, "review": "I play a bunch of netflix movies/shows on my TV. You can also cast your computer screen on the TV. You will need wifi to connect to the TV.", "verified": true, "helpfulness": "0/0", "author": "Angel P"}, {"rating": 5.0, "review": "I use this with youtube and netflix on both my android tablet and win 8 pc.There is a 'view entire screen\" no mattter what you are doing feature available in win 8.  That proves helpful for viewing pictures.  Not perfect when it comes to viewing pictures but netflix and youtube are very good.doesn't work with amazon instant video though you could possible make it work with the view entire screen.Fun to have \"chromecast wars\" with firends - you can show the best youtube etc.", "verified": true, "helpfulness": "0/0", "author": "S. Andersen \"Valiant-for-truth\""}, {"rating": 5.0, "review": "Great product!  I mostly stream Pandora and Netflix with this buy you can do much more.  You will need the HDMI port plus a USB port (for power) or you can use the USB adapter that plugs into a 110 wall socket, so don't think it's just the dongle that plugs into the HDMI port.  There will actually be a wire hanging out of the dongle also for the power.  Works great though; I'm very happy with it.", "verified": true, "helpfulness": "0/0", "author": "SilleYrag"}, {"rating": 5.0, "review": "Really easy and fast to set up. It works wonderfully!My YouTube and NetFlix accounts  makes much more sense now.", "verified": true, "helpfulness": "0/0", "author": "Gabriella"}, {"rating": 1.0, "review": "After what seemed like an easy initial set-up, I couldn't get it to launch. Lots of going in circles, looking at youtube videos, trying to sort out what I was doing wrong. I assumed it was me since I kept reading about how easy it was to install. I just upgraded my MacBook Pro to latest version and tried again. Still no luck.  Finally saw something recently about it not working on Verizon FIOS--info I never saw when trying to sleuth it out in the first round. So maybe this is the issue? There seems to be (slightly) more information out there about compatibility issues than there was when I bought it back in February, but for me, possibly a waste of money and bigger waste of time until I get off of FIOS. I could have used more customer support and/or this info upfront if it is accurate.  It is possible full disclosure may have improved since I purchased it, but for me too little too late.", "verified": true, "helpfulness": "0/0", "author": "Kado"}, {"rating": 5.0, "review": "I've been struggling with Wii then Blu Ray player to watch Netflix on my TV. It always involved unplugging and plugging in cables, so it got to be such a hassle I'd just watch Netflix on my laptop. Then my son told me about the Chromecast.  I AM IN LOVE. It was so easy to install and it's sooooooo easy to use. Unfortunately I'll probably gain 50 lbs now, since it's so easy to watch movies - I'll be parked in front of my TV watching movie after movie all evening  :)  THANK YOU GOOGLE for simplifying my life! It's little things like this that can make a big difference.", "verified": true, "helpfulness": "0/0", "author": "Paige M"}, {"rating": 5.0, "review": "I have bought multiple of these after the first one and LOVE them. The only thing that I wish it could do is Amazon Instant! Once it get's that it will be unbeatable.", "verified": true, "helpfulness": "0/0", "author": "Tyler Jackson"}]