[{"rating": 4.0, "review": "All this google chromecast is missing is for you to be able to play your local videos on your phones and tablets to your TVs and I would be happy 100% happy besides that it does a great job playing youtube, netflix, hulu plus from my phone and tablets to the tv at 35$ dollars definitely worth the money.", "verified": true, "helpfulness": "1/1", "author": "@djeddieone"}, {"rating": 2.0, "review": "Doesn't really stream anything except utube, thought it would stream video from apple products, but it doesn't.Not for me I'll stick with Apple TV.", "verified": true, "helpfulness": "0/0", "author": "diane"}, {"rating": 1.0, "review": "This does NOT work on Windows XP. You have to have a newer (ie. worse) version of MS. I wasted $35 because Google wasn't forthcoming. DON'T MAKE MY MISTAKE!", "verified": true, "helpfulness": "1/2", "author": "Michal D. Thomas \"no-life CE\""}, {"rating": 5.0, "review": "This device took a bit longer to connect and figure out than stated but after you get it going it is sooo neat!! l", "verified": true, "helpfulness": "1/1", "author": "melissa prusinski"}, {"rating": 4.0, "review": "Set up is so easy. You can connect it  to any TV provided it has an HDMI plug. The only set back right now is that there are only a limited number of apps to choose from. Hopefully, they will work on this fast enough and they will extend their range of choices to even international entertainment apps. Looking forward to this", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"truefeathers\""}, {"rating": 1.0, "review": "This item was a waste of money. Chrome streaming keeps error-ing out. Streaming from YouTube works, but picture quality is not clear (very poor). I wish I could say something good about the device and I gave it a 2 month try, but it does not live up to the hype and expectations fell very short. I would not recommend it to my worst enemy.", "verified": true, "helpfulness": "1/2", "author": "DZL1"}, {"rating": 5.0, "review": "Awesome replacement for regular cable or satellite.  Been using the Wii for Netflix and friends, but this is much better.", "verified": true, "helpfulness": "1/1", "author": "Nick"}, {"rating": 5.0, "review": "Nice item when used with your Chrome Browser to view internet on your Smart TV.  Love it.  You will too.", "verified": true, "helpfulness": "0/0", "author": "Axelbrode"}, {"rating": 5.0, "review": "We use this every single day in our house. It makes life and streaming so much easier, especially when you're watching Netflix or Youtube because your computer isn't blocked due to what's playing (like it would be when connected via HDMI). It also came with a 3 month Netflix code, so that was an added bonus!", "verified": true, "helpfulness": "0/0", "author": "SKolluri"}, {"rating": 5.0, "review": "This device worked very well for me. It currnetly has full Intenet acess though my Windows 8 laptop and the device specific app access through my Android tablet. There is very little noticable lag time.", "verified": true, "helpfulness": "0/0", "author": "mikebrittain"}]