[{"rating": 4.0, "review": "Liking it more and more as apps are made compatible and content arrives. I especially like the desktop mirror function, since you can't get everything from a phone you can on a PC.Every now and then I get poor visuals - vertical discoloration lines etc. on the screen, but they generally go away pretty quickly. Not sure what's causing that, but overall a good product.", "verified": true, "helpfulness": "0/0", "author": "Ardiac"}, {"rating": 4.0, "review": "I love it  and it does exactly what it should, but there is no interface on it. You cannot use it without a computer of phone sadly. That is my only complain and dissapointment.", "verified": true, "helpfulness": "0/0", "author": "Spencer yonce"}, {"rating": 5.0, "review": "I bought this to use in conjunction with PLEX media server, so I can only review on that. Setup is dead simple, and once tied to my plex server streaming movies is so simple I cannot believe I waited so long to try it out. I have the Chromecast plugged into a HDMI port on my receiver and it works perfectly so don't feel you have to plug it into the TV if you have a surround sound setup.I have only tried out things like youtube streaming and those things do seem a little bit of a solution looking for a problem, but once you add something like PLEX media server this becomes a out of the park product!", "verified": false, "helpfulness": "0/0", "author": "1lostlobster"}, {"rating": 5.0, "review": "Very Good", "verified": true, "helpfulness": "0/0", "author": "Ricardo J. Dias"}, {"rating": 5.0, "review": "I love this thing.  It was as easy as it said it would be and works great. I watch Netflix and YouTube on it constantly and love to 'Cast'  the pictures and videos I take on my phone to the 'big screen'.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "Just incredible!", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 4.0, "review": "I can't recommend these things enough. I bought one to try it out. By the end of the week, I wanted 4 more. This is the first version so I bought 2 in total, I'm anxious to see how the app support grows.", "verified": true, "helpfulness": "0/0", "author": "Rebecca B."}, {"rating": 4.0, "review": "Not exactly the experience that Smart TV can give you, but is a cheap way to make old dumb TV a tad bit smarter.The main drawback is that many useful apps, that can unleash the functionality of this dongle are paid ones, so the price of chromecast is actually higher than I thought before", "verified": true, "helpfulness": "0/0", "author": "Agybai"}, {"rating": 4.0, "review": "This seat little things will stream anything to your portable device, be that a smartphone, tablet, or laptop. Stream from all the big names. I got it in a box with everything required: cables, adapters, etc", "verified": false, "helpfulness": "0/0", "author": "Jordan Harper"}, {"rating": 1.0, "review": "Had it for a few months. Used to work. Didn't find much use for it and had it sitting there for a while. Today I feel like playing with it again. Plugged it in and the thing came right up and said \"ready to cast\". But then none of my devices (HP laptop, Galaxy Note 2, OnePlus One, iPhone 6+, 2 iPad's) could find it. Factory reset the thing and start over. Went through the setup process multiple times. The stupid thing couldn't even connect to the network any more. The help on the Chromecast web site is the moronic kind which says things like \"make sure that your WiFi network is working\". I have 10 devices hanging off the WiFi network and those morons wants me to make sure that my WiFi works.", "verified": false, "helpfulness": "2/4", "author": "Amazon Customer"}]