[{"rating": 5.0, "review": "Works out great!", "verified": true, "helpfulness": "0/0", "author": "johnathan"}, {"rating": 3.0, "review": "I expected this to do more. It works great and is very easy to set up. Just make sure your network is speedy to watch things from the browser of your phone or pc to prevent lag.", "verified": true, "helpfulness": "0/0", "author": "Scott S. \"S.S.\""}, {"rating": 1.0, "review": "It took forever to figure out how to use it and then the quality was so bad we could not stand to watch our  favorite shows cast to our Sony HDTV because the reception was so bad.  Both sound and picture were jerky and color was off.  It was worse than a silent movie from the 1900's.  I do not know if ours was defective or if they just do not work well.  I would not recommend this.  Great idea but poor execution.", "verified": true, "helpfulness": "0/0", "author": "Betsy"}, {"rating": 5.0, "review": "work great", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Eyeududu", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "We love our Chromecasts.  Getting one more then we will have one on every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "J. Patton"}, {"rating": 5.0, "review": "Purchased the Google Chromecast Media Player for my Son.  He has one and loves it.  He let me know the other day that he would like another so there you go............", "verified": true, "helpfulness": "0/0", "author": "James W."}, {"rating": 5.0, "review": "What a great device to link my HD television to all my computer content.  I use it share videos and pictures and to watch streaming video on the internet.  Can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "T. Philpott"}, {"rating": 5.0, "review": "Very good idea.", "verified": true, "helpfulness": "0/0", "author": "dieter"}, {"rating": 2.0, "review": "It's ok, I wouldn't buy it again. We often lose connection with the app and Netflix. When this happens, I can't seem to continue playing shows without having to completely reset the Netflix app and Chromecast. This happens often, almost during every show I try to watch using it. It just seems too buggy.", "verified": true, "helpfulness": "0/0", "author": "Kat"}]