[{"rating": 3.0, "review": "Chrome has a lot of faults and restrictions. It does not work as advertised. Its use is very limited to both the device that can use it and the videos that can be played from it.", "verified": true, "helpfulness": "0/0", "author": "bernard lyons \"Bernard Lyons\""}, {"rating": 2.0, "review": "I'm really disappointed at the reliability of this thing. Always drops from the network and my devices rarely find it.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Mitchell"}, {"rating": 1.0, "review": "I bought this product think it would be nice to view/watch programs from my ipad/phone to the TV but google chromecast has not worked even once without any issues since i bought it.Would like to return the product because its usless. I would not recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Nisha"}, {"rating": 5.0, "review": "Perfect for our lakehouse. We don't have cable but use the wifi to stream netflix after the day is done and music to different rooms in the house.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "Works great so far, enjoying my Hbo & Netflix, can't beat this in anyway, pricing is great for what it does!!", "verified": true, "helpfulness": "0/0", "author": "Jorge"}, {"rating": 1.0, "review": "it works fine with my cell and tablet youtube apps, but not my laptop chrome. very slow connection, breaking images, lag in browsing and video play. I still have to use hdmi cable if i want to project chrome browser to my tv. A bit disappointing if you ask me.", "verified": true, "helpfulness": "0/0", "author": "Willy Sego"}, {"rating": 5.0, "review": "Good dongle but has been out done by tronsmart I now use chromecast only as abackup the price is pretty good", "verified": true, "helpfulness": "0/0", "author": "DEON P DAVID"}, {"rating": 4.0, "review": "Great piece of technology.  Needs more apps for it.Should be able to do a simple screen share from laptop, phone, or any other device.  Can only do it within supported apps.", "verified": true, "helpfulness": "0/0", "author": "Garrett Friedman"}, {"rating": 5.0, "review": "Works great exactly what I thought it was going to be. Was simple enough to set up and I can move it around the house as long as it's on range of the WiFi.", "verified": true, "helpfulness": "0/0", "author": "steven"}, {"rating": 4.0, "review": "A great device. Very simple and easy to use once installed. Use it all the time for Netflix from my iPhone. Just wish they had more apps for other services.", "verified": true, "helpfulness": "0/0", "author": "Marion L. Cooper II"}]