[{"rating": 3.0, "review": "This product works wonderfully if you are sitting right on top of your wifi router! Very cool features with ability to use smart phone, tablet, or computer to start, stop and pause any video. This may make me cut cable forever and just use online streaming services from now on!-I have tried this on two separate tv's in my home and it works wonderfully for the tv next to my router.-I have a tv that is about 40-60 ft away from my router and this chrome cast will not work with it. I even moved the router next to the window so that the signal would only need to go through one pane of glass and 1 brick wall (tv is in an addition of the house with a straight line of sight to the room with wifi) even with less walls, the chrome cast can not function. I should mention i am using a very cheap router from wallyworld. The specifications for streaming: a minimum requirement of 6gbps for the chrome cast to work. When i have my laptop in that same room and even further away i get up to 32 gbps. The chrome cast does show it is connected to my router and has 2 \"BARS\" but it can not make connection to  stream video.Because of this i will now need to purchase a stronger wifi router just for the chrome cast! all other devices in the home work fine, even with streaming video and multiple search windows. this was purchased as a gift and i will now need to upgrade my router and spend an additional $70-100. to guarantee it will function properly. If i had known this before hand i would have researched other possibilities or ordered a router at the same time of purchase. Truly an inconvenience and very frustrating, but still a great product.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 4.0, "review": "I love my chrome-cast bought them for a couple of my friends. When they get some more apps that work on it it will need more stars in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Frank Matrozza"}, {"rating": 3.0, "review": "This item for play video and viwe youtube in the scren and esye sastem.In the futuer make order.Thank you,,,", "verified": true, "helpfulness": "0/2", "author": "mosa_sa"}, {"rating": 3.0, "review": "My wife and I enjoy Chromecast, but it will be much better with some upgrades that I am sure Google will be doing.  Biggest complaint is that it does not stream Amazon Prime.  You would think that since Amazon is one of 3 retailers that sells the product they would want Google to make it easy for their customers to use this product. (Again I am sure the fix is on the way, but hurry up).  It would also be nice to cast from the web on your Ipad.  All in all a good product and I will be getting one for my other TV as soon as the bugs are fixed.", "verified": true, "helpfulness": "1/1", "author": "Sean"}, {"rating": 4.0, "review": "Just waiting for GOOGLE to add more channels! Please consider channels that we don't have to pay for such as FX, BBC, SiFi.", "verified": true, "helpfulness": "0/0", "author": "Patricia Kathleen"}, {"rating": 5.0, "review": "Love this thing so far, we actually have fights on who streams to our tv. But definitely a great device and worth it. Cmon $30 is nothing. Knowing its google, i feel app list will grow quick!", "verified": false, "helpfulness": "1/2", "author": "phone dealer"}, {"rating": 3.0, "review": "I had reset the device twice already in this little time, and also another new one, still could not get it to work, router is within a feet from the TV.", "verified": true, "helpfulness": "0/0", "author": "MOHAMMAD HASSAN"}, {"rating": 2.0, "review": "This is a tough product to review well.  Just out of the box, plugged in upstairs in my game room, it struggled MIGHTILY to load even the YouTube App in its entirety.I'm not sure if it's internet connection, network issues, or just a poorly designed product, but when it loads YouTube after I've synced to broadcast from the app on my phone, it takes literally 3-4 minutes to load the app on Chromecast.  The loading screen picture even comes in in pieces like with a 56K modem connection.  Constant freezing of YouTube videos, and low quality most of the time.  This is all on a business class Cable connection and network.I couldn't even CONNECT to Netflix!  The message I got continuously was \"Hmmm....we can't seem to connect to Netflix\" - and then the app would go into a 10 second countdown on the screen before it finally booted me out of Netflix.  This happened 5-6 times.  Ultimately in the end, my frustration got the best of my, and I just went ahead and put the good old television back on because watching choppy videos that constantly stop, or not even being able to LOAD a video onto my television was just too disappointing.My devices flourish on my WiFi connection, at top speeds, but it seems that the Chromecast just can't keep up with the speed that I expected.  It's very slow, very unresponsive, and doesn't even come close to what my old Roku HD from 2012 can do - in terms of fluidity, speed, and usability.  The Chromecast is a great idea, but user experience will definitely vary, as I was extremely unsatisfied and disappointed with my purchase.  i see many reviews of people that are quite happy with Chromecast (which is why I purchased it in the first place), but for me, I couldn't even get the device to establish a solid Sync, let alone utilize the apps - a total and complete failure.  This will be a return for me unfortunately - I hate that the best part of my Chromecast experience was the beautiful screensaver photos it put on my TV screen when it was idle.Purchased from Amazon, used on Panasonic 720P Plasma HDMI port - powered with wall adapter.  Control device is new Nexus 5 running 4.4.2.", "verified": true, "helpfulness": "1/2", "author": "Medium Tex \"Alan\""}, {"rating": 5.0, "review": "Love the product but did take some research on getting it to work, plus had to mess with it many times until Chromecast finally downloaded an update, then it worked perfectly.  Had to research the difference using on android and windows and not to use mirrowing (tab) while using Netflix (not compatible with Silverlight using tab (Chrome app).  Research on how it works before trying to use.", "verified": true, "helpfulness": "1/1", "author": "MissouriTechGrannie"}, {"rating": 5.0, "review": "I use this way more often than the Apple TV. Thinking of buying a few more as Christmas gifts! Love it.", "verified": true, "helpfulness": "0/0", "author": "J. Nguyen"}]