[{"rating": 4.0, "review": "Love my fire tv! One complaint is that Hulu Plus seems to lag a little on it, but maybe it's my internet connection. I haven't had any issues with Netflix or anything else though. Easy to use and voice search is great!", "verified": true, "helpfulness": "1/1", "author": "Amber Johnston"}, {"rating": 5.0, "review": "If you're not a member of amazon Prime already, become one, no excuses free 2day shipping has been awesome, you save money and time by not having to go to the store all the time, wait in line, etc. etc.. And this AMAZING tv service is INCLUDED with your prime membership, no excuse not to do this, like netflix but so much better with way more selection and picture quality is AMAZING (do not get the stick version unless its for a computer or something) but definitely get the fire TV box version, great shows included with prime that you don't have to pay anything extra for, TONS of great kids selection (this was the big thing for us) and great music selection! (so much better than Pandora) You could get rid of cable for this unless you'd miss football and Disney channel (which I can't live without Disney, wish Amazon would add them) but we are SO happy we got FireTV so worth it in everyway- NO EXCUSES to not have this if you are a Prime member, and really there is no excuses to not be a Prime member anyway! I do feel rentals should be a little cheaper though, they are more than cable rental prices and don't need to be, redbox does it for $! so I think the rentals should be lower priced, but since they have a very large selection of GREAT free programming I can't complain too much, I just won't do the rentals...", "verified": true, "helpfulness": "1/1", "author": "NJ \"NJ\""}, {"rating": 4.0, "review": "Nice variety of shows and easy to use", "verified": true, "helpfulness": "0/0", "author": "Colleen McKissick \"Callie\""}, {"rating": 5.0, "review": "The Fire was easy to setup, it’s fast and easy to navigate, it has a huge selection of apps as well as all the content found on Amazon and Amazon Prime. I have a Samsung Smart TV and this thing blows the “Smart” part of the TV away; not that it would take much to do that. I recently bought a new TV and went with a model that did not have the smart features and elected instead to spend the savings on a better quality picture and the Amazon Fire TV. This seems like the perfect combination.  I just purchased a second Fire TV; I will be disabling the “Smart” from my Samsung and replace it with the Fire.", "verified": true, "helpfulness": "1/1", "author": "Robert Wood"}, {"rating": 5.0, "review": "I have been using Apple TV for nearly 2 years and must say I've loved it and don't miss watching cable TV. However the look of the interface was aging and the speed of navigation had started to feel quite sluggish. Finally decided to purchase the Fire TV and I am definitely impressed. Clear and attractive interface and fast as lighting. Of course overall there is a bias towards Amazon products however I don't believe this gets in the way of other applications such as Netflix, Hulu, etc. I also love the remote control as it doesn't need a line of sight (it has bluetooth) and its buttons are intuitive. I have not yet tried any games but might do so once Amazon have the game controller/pad back in stock. Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Mustangito"}, {"rating": 5.0, "review": "This is better than i expected.  Very small product and it has a lot of power.  TY Amazon for making Fire TV", "verified": true, "helpfulness": "1/1", "author": "MC"}, {"rating": 5.0, "review": "I had ROKU for years and this is so much better and faster.  Love it!", "verified": true, "helpfulness": "0/0", "author": "grandma64"}, {"rating": 4.0, "review": "The unit works ok but the remote is a problem at first the batteries lasted 5 days then it then to 3 days and now I have to put in new daily.", "verified": true, "helpfulness": "0/0", "author": "JUNIOR L."}, {"rating": 2.0, "review": "Netflix skips frames and stutters. Not enough free selections on Amazon for the price paid.", "verified": true, "helpfulness": "1/5", "author": "Gary"}, {"rating": 4.0, "review": "My internet is a bit slow sometimes so it interferes with whatever I am watching but other than that I am very pleased!", "verified": true, "helpfulness": "0/0", "author": "Wanda M Henry"}]