[{"rating": 5.0, "review": "great... it needs some update for the apps in order to use with older android cellphone", "verified": true, "helpfulness": "0/0", "author": "mechasduran"}, {"rating": 1.0, "review": "You charged me a service PRIME,  I canceled that service, and it is supposedly only going to charge the used, then you would not charge the following month. I want to make me the reimbursement of this service canceled and the charges to me.", "verified": true, "helpfulness": "0/2", "author": "Jose de Jesus Garcia Hernandez"}, {"rating": 5.0, "review": "bought this as a gift. I hope they grow support, cause it's really cool. worked in short time with the download of the chromecast app.", "verified": true, "helpfulness": "0/0", "author": "davopavo"}, {"rating": 5.0, "review": "I like to call this thing \"the internet game-changer\".  And you can quote me on that.", "verified": true, "helpfulness": "0/0", "author": "J.C."}, {"rating": 5.0, "review": "This is the second Chromecast I've purchase and installed. After installing it in my office, I liked it so much, I installed another one in the family room for my husband. I'm a senior, not exactly a computer wiz so Chromecast was easy to install. We love having more program streaming choices on the Big Screen TV's.  I recommend this product!", "verified": true, "helpfulness": "0/0", "author": "DAC \"Nunya Business\""}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Betco1"}, {"rating": 5.0, "review": "Great, everyone should have one.  Just know that you cannot play Amazon Prime on it unless you load some software which I haven't figured out how to do it yet.  You can go on you tube and they have several videos on how to load the software to watch amazon prime.  If you don't want to deal with all that then ROKU is the best bet for you", "verified": true, "helpfulness": "0/0", "author": "Macdaman"}, {"rating": 5.0, "review": "It works great. Very glad we bought one, but there are some issues with it when you're watching something and the app times out, sometimes I lose the playback controls. It happens on Netflix, Hulu plus, and HBO go.", "verified": true, "helpfulness": "0/0", "author": "nator9882 \"nator9882\""}, {"rating": 5.0, "review": "very nice", "verified": true, "helpfulness": "0/0", "author": "A T"}, {"rating": 5.0, "review": "We have now purchased 3 of these - love them!!  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Andrea"}]