[{"rating": 4.0, "review": "As long as you know what you are buying - and you should always know what you are buying before laying out cash - it is a great little gadget.  My only critiques - wish the extension cable were 6 inches longer and would love more apps (which will come, hopefully).The setup was easy and I got it going in minutes.", "verified": true, "helpfulness": "0/0", "author": "Zed"}, {"rating": 5.0, "review": "This product is a great economical solution for streaming video.  I have used it for Netflix, HBO GO, YouTube, and cast tabs from Chrome.  The only limitations are the age of the device.  Where it is relativley new not all streaming services support it, but I hope to see and expansion in the near furture.  Also, there is no security so anyone on the network can access your chromecast.  This makes it problematic to use on public networks.", "verified": true, "helpfulness": "0/0", "author": "Zachary"}, {"rating": 4.0, "review": "This works well, but the signal pickup is as good as I hoped. When close to my router it works really great. 4 stars because it does what I need it to do and just had to move my router closer. Wish the iPad had a google chromecast extension for the google chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Klevin"}, {"rating": 5.0, "review": "When I bought this I was looking between this & a Roku... Price on this little guy finally sold me. Who can pass up a try for just $35? Any way it supports everything I need (hulu plus, netflix & pandora and a lot more of which I have never used). Really easy set up & does not use up battery life on the device its streaming from. Simply turn on your TV choose the program get it playing press the cast icon & turn off your device because its no longer needed at that point. Love this little thing. set up was simple & only took about 20min (including install, instruction read time & actual set up).", "verified": true, "helpfulness": "0/0", "author": "Margaret Smoot"}, {"rating": 5.0, "review": "We are in with the new technology now, it is wonderful, clear pictures and easy to use, once you figure out how to set it up.  Cheaper than anyplace else and really fast delivery.", "verified": true, "helpfulness": "0/0", "author": "sasha"}, {"rating": 3.0, "review": "I wasn't all that impressed. The electrical cord isn't displayed in their pictures, leading you to believe it doesn't need one. I wanted a streaming media player, but this one needs some improvements. Roku and Apple are more expensive and it's clear as to why. Had to elevate my standard and purchase the more expensive one.", "verified": true, "helpfulness": "0/0", "author": "Jerry Reeve"}, {"rating": 5.0, "review": "Great, and useful. I don't have cable and this allow me to watch my shows with paying the price. But I do wish its had more app, like PBS. :)", "verified": true, "helpfulness": "0/0", "author": "Rachel M Hinton"}, {"rating": 5.0, "review": "I just bought my second Chromecast.  Someday I'll probably install one on every TV in the house.  Watch Netflix, YouTube and much more on your big screen TV with this inexpensive device.  You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "jazmaan"}, {"rating": 5.0, "review": "now that the API is avabile this device will be more than worth the price. currently, using just with netflix makes it worth the purchase. can wait to use other services.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I highly recommend this to anybody.Me and my family enjoy using our Chromecast everyday. My siblings are always using it to watch YouTube videos with each other. It's so easy to use that even my 5-year-old brother understands how to use it.The available apps may seem a little limited, but it's only just beginning. Besides, all the major apps, like YouTube, Netflix, Hulu Plus, and HBO Go, are already available.", "verified": true, "helpfulness": "0/0", "author": "AZNpanda92"}]