[{"rating": 3.0, "review": "Nice! I like it!", "verified": true, "helpfulness": "0/0", "author": "JERRY A LEWIS JR"}, {"rating": 5.0, "review": "Incredible product ! Stream Netflix , Youtube and plus more ! The best alternative for apple tv !!", "verified": true, "helpfulness": "0/0", "author": "Ítalo"}, {"rating": 5.0, "review": "it,s works amazing.", "verified": true, "helpfulness": "0/0", "author": "debra bunner"}, {"rating": 5.0, "review": "I am satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "Yahya"}, {"rating": 5.0, "review": "Great product. Just wish amazon wouldn't block amazon prime on it.", "verified": true, "helpfulness": "0/0", "author": "Weljen"}, {"rating": 5.0, "review": "I had an asus cube prior to the chromecast and it was a nightmare. The cube would constantly drop the internet connection and the video quality was horrible. The chromecast had the easiest set up, 5 minutes, great video quality and no internet connection problems what so ever. I have been using this product for over three months and it's seriously a dream. My only complaint is that I wish it was compatible with many other apps instead of just the very few they have available. Other than that I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Torres"}, {"rating": 5.0, "review": "Chromecasts continue to impress me, so I have put them on all the TVs in my house.  I got most of them on sale for $25, but at $35 they are still well worth it.  One of my favorite features is that when we have people over I use youtube to cast music videos, then I give my guests the password to the wifi so that anyone can add a youtube music video to the queue.  Android or iPhone, it doesn't matter, everyone can add their favorites.  I have had a lot of really positive comments after some parties we have had, everyone really gets a kick out of adding their own songs to the playlist.", "verified": true, "helpfulness": "0/0", "author": "A. Hilton"}, {"rating": 1.0, "review": "This thing hardly works. They rarely upgrade the app. It freezes all the time in the middle of movies or shows. I have to switch back to the device I am using, either IPAD or Mac. When I switch back the app or webpage crashes. It will give me the option to use chromcast in my abc and CBS apps on my iPad. Then a week later an update comes and chromcast stops becoming an option. Apple TV or Roku may be a better option.I even gave chromcast the benefit of the doubt and used it through my wifi network at home and the wifi network that I can produce from my phone. The same problems persist. It's a good idea that doesn't quite work yet.", "verified": false, "helpfulness": "1/2", "author": "Edward Danielian"}, {"rating": 5.0, "review": "Love it never have any problems with it!", "verified": true, "helpfulness": "0/0", "author": "Alex B"}, {"rating": 5.0, "review": "Very easy to use and fun to share your screen onto a TV", "verified": true, "helpfulness": "0/0", "author": "Ryan Xuereb"}]