[{"rating": 1.0, "review": "I'm told we are the exception, that faulty Fire TV boxes only go out at a rate of 0.02%, but I must admit, after my experience with Fire TV I find this very hard to believe.  I am just rounding third base on a saga of faulty Amazon Fire TV hardware.When I bought this device for the first time I was hoping to use WiFi, I was unable to connect to the content.  Oh well, I figured I could use an Ethernet line in the basement so I went ahead and installed it.  Excited to finally try Amazon Fire TV I quickly hooked up the box to the Ethernet jack... Nope still no connectivity.  To their credit customer service was very polite after 20 minutes or so of debugging had a new box sent out immediately.  And I happily report that this second box worked... for a few months.After a few months of use our second box stopped detecting the remote.  We called the service line and they troubleshot, we determined it was a remote problem and they got us setup using an iPhone as the remote and had another sent right away.Using our second remote with our second box resulted in no success.  Another call to the help line.  This time they instructed us to reset the Fire TV box using the iPhone.  Upon startup the box recognized neither remote one, remote two, not the iPhone!  The service department concluded logically that it must be a faulty box, so they sent another:)The third Fire TV arrived today, yay!  We hooked it up, and laughably this box will not boot past the \"Amazon\" logo screen!!!Everyone that we spoke to in the service department was shocked that we could be having this problem, and I believe them... but the story from our viewpoint is different and needs telling.Where we stand now?  Another Fire TV box is on its way, and I'm not concerned it won't work, there's only a 0.02% chance of that:)", "verified": true, "helpfulness": "1/2", "author": "Stephen Goebel"}, {"rating": 2.0, "review": "I was really looking forward to using this box, which could be larger, IMHO (it's quite small).  I got rid of a streaming sony blu-ray player in preparation for this box's impressive tech specs.  I did get the hbo go app working and a test video to play.  I have att uverse.  I updated the factory installed firmware/software several times for the amazon fire tv box and got higher speed att uverse service with my new annual contract using the same wireless gateway (I own it).  So, for close to a month, I've been trying to get videos to play on the amazon fire tv box.  I got amazon prime (for a year) with my new att uverse bundle and still have hbo go.  My fire box connects to the internet and amazon, but when I select a video from the prime choices or from the hbo go app, I get a message saying that the video will not play and an \"unknown error\" message.  How is it that my box is connected to the net and to amazon, but neither the box nor amazon can diagnose the problem and give me more guidance as to how to fix it instead of \"your video won't play...unknown error.\"  I spent a couple hours on the phone with amazon tech support...it was hard from the written documentation that came with the fire box and from the web to find out how to reach them by phone...only after logging in to amazon and checking, I finally stumbled upon a page that asked for my phone number and told me to wait for a call momentarily...they call you, you don't call them.  I've tried so many things...at one point, I reset my wireless gateway and lost my settings...had to reinput them.  Unfortunately, even when you take the drastic step of returning the box to original factory settings and losing your personal info, it will NOT revert to the original software/firmware version it came with...it keeps using the new version, which may be what's causing the videos not to play.  So after close to a month of hassling with this thing and not being able to watch the prime content I'm entitled to or the hbo go content (old hbo shoes and current shows/movies on demand), I will be trying to return the box for a refund (hopefully, that will be seemless...honestly, the time and aggravation I've put in so far is the real reason for the return).  Again, I'm really sorry it didn't work out, and I plan on trying this box again in a year or two.  Maybe I got a defective unit, maybe the new software version did not work with my setup, small chance it's a firewall issue....but I'm too exhausted to spend any more time trouble-shooting this \"unknown error.\"", "verified": true, "helpfulness": "1/2", "author": "MustLoveCats007"}, {"rating": 4.0, "review": "I have a question, and there didn't seem to be a question link (?)...  Anyway, will this work with/through a Comcast box as well?  I mean can you record any normal cable channels?", "verified": false, "helpfulness": "0/0", "author": "JANAKAR \"windwalker\""}, {"rating": 5.0, "review": "This is great! Many choices including classic cartoons, TV, and Movies!", "verified": true, "helpfulness": "0/1", "author": "Jim Lester"}, {"rating": 5.0, "review": "Great really great.", "verified": true, "helpfulness": "0/1", "author": "Mario Major"}, {"rating": 5.0, "review": "We are very pleased with the Fire TV. the consensus is that it is way better than the Apple TV, which we also have.", "verified": true, "helpfulness": "0/1", "author": "C. Waldman"}, {"rating": 4.0, "review": "If you are getting it just for hulu, Netflix etx, then the Roku is better due to its awesome interface.  Also the apps are lacking and mostly uninspired.  I play Minecraft with my son on it, other than that not much.  Sad becuase it seems like a powerful little box.  Clunky interface.", "verified": true, "helpfulness": "0/1", "author": "Moe \"DohMoh\""}, {"rating": 3.0, "review": "Not used.", "verified": true, "helpfulness": "0/2", "author": "Terry C"}, {"rating": 5.0, "review": "Fast shipping, easy set up, works great.", "verified": true, "helpfulness": "0/2", "author": "ashley corona"}, {"rating": 5.0, "review": "I am a new user but so far I am astounded what I can stream!", "verified": true, "helpfulness": "1/2", "author": "Sarah Page Fox"}]