[{"rating": 3.0, "review": "waited so long to do this but sometimes i have trouble getting a good connection with it. even with the extender. internet speed is fast but for some reason sometimes it will not work", "verified": true, "helpfulness": "0/0", "author": "jonathan Escobar"}, {"rating": 5.0, "review": "Good product Good supplier,Good price.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "A.J."}, {"rating": 1.0, "review": "A friend of mine gave this to me. Now I know why. When it works, it's great. But unfortunately the working never lasts very long. It consistently drops the connection and I have to setup the device on my network all over again only to have it drop the connection an hour or so later. I got so frustrated with it that I yanked it out of my tv and chucked it out my door and into the pool. Good riddens.", "verified": false, "helpfulness": "0/0", "author": "James William Lee"}, {"rating": 3.0, "review": "Bought this to play with because, well, it's pretty cheap, but we haven't found much use for it yet.  We do have a PC hooked up to the TV already though, so it's not that practical at home.I was hoping it would be good for travelling, but it requires an open WiFi network that the Chromecast and PC/Phone/Device can see each other on.  That means it won't work on hotel/public wifi.  I am under the impression that it won't work with an adhoc network from a phone or laptop either, but I haven't played around with that, so I can't confirm.It turns out I just have too many computers in my house for this little gadget to be useful!  :(", "verified": true, "helpfulness": "0/0", "author": "Daniel F."}, {"rating": 5.0, "review": "It's the bomb", "verified": true, "helpfulness": "0/0", "author": "Rafael Chaidez"}, {"rating": 5.0, "review": "A MUST HAVE.", "verified": true, "helpfulness": "0/0", "author": "JD Hinkle, IV"}, {"rating": 4.0, "review": "Arrived pretty fast and works well. Would've been 5 stars if it came with the power adapter", "verified": true, "helpfulness": "0/0", "author": "Monte Brogdon Jr."}, {"rating": 5.0, "review": "Works great! Great idea!", "verified": false, "helpfulness": "0/0", "author": "Alfred Wakeman"}, {"rating": 5.0, "review": "I love it, Pictures are so clear and clean with chromecast.", "verified": true, "helpfulness": "0/0", "author": "G SHAH"}]