[{"rating": 2.0, "review": "I was looking for an inexpensive way to stream video so I could shut off the satellite television.  The price is right and the company is credible so I ordered.  Unfortunately, no one mentioned there are several routers which can not communicate with Chromecast.  Of course, I have one of these noncommunicative routers.  So now I am purchasing a new router and waiting once again.  Chromecast may be the greatest thing since white bread, but it will be another week before I can find out.  This problem should be addressed upfront.", "verified": true, "helpfulness": "2/3", "author": "DONNA ANDERSON"}, {"rating": 1.0, "review": "Not Ready for PRIME TIME. The Google TV commercials are misleading.No casting capability with Chrome browser for Android though there is with Chrome for Windows 7. Also, the connection b/w the dongle and the TV drops regularly when casting the Chrome browser for Windows 7. No connection drops when using Netflix, however. At least something worked. Regret buying this piece of junk.", "verified": true, "helpfulness": "11/14", "author": "Sensei Rhee \"Evolve or Die\""}, {"rating": 4.0, "review": "I have some Sony BluRay players that stream Netflix, Amazon, YouTube, etc but they are really bad about finding a good stream and hopping to a server that has a better connection so at times it will literally pause to buffer 3 times in the first minute of a show so I end up backing out and restarting the show to get it to hold a good stream.  This gets pretty frustrating so I thought I'd try something else...Enter the Chromecast!  I was pretty excited about the product, low cost, control from your phone/tablet/laptop.  The one consideration I did not have is the fact that you have no remote other than the device you are controlling it from.  This presents a slight problem when you need to pause a program quickly.  From the PC it is pretty quick because the app stays open and you can just jump over and click to it but with both my Android and iPhone as the controller I have to unlock my phone, if the Netflix app is still up in the foreground it typically refreshes if it hasn't been touched for 5 minutes (both devices equally), then once it comes up it rejiggers itself and then shows that a program is being streamed, you can then tap the program which loads the page and finally lets you pause.Along with that it is extremely difficult to pause a show when you get a phone call on the device you are using to manage the Chromecast.  Or when you're watching a show that has content not suited for children and your kids pop into the room.So basically the streaming works really well but it would be nice to have some sort of dedicated controller that has a physical pause button.", "verified": true, "helpfulness": "1/1", "author": "Dan"}, {"rating": 5.0, "review": "It is a must buy. If you watch youtube or listen to pandora this device is a must. What are you waiting for? Just buy it. It is easy to setup and you can mirror using google chrome on your tv.", "verified": true, "helpfulness": "0/0", "author": "norving gutierrez"}, {"rating": 3.0, "review": "Great price for what it offers, however the device cannot broadcast Chrome tabs from smart phones or tablets as you might understand from the commercials.However its worth every penny of that small price for what it does.", "verified": true, "helpfulness": "2/3", "author": "Daniel Dinu"}, {"rating": 5.0, "review": "Works exactly as described, received it quickly and thinking about picking up another one. Would recommend this to others looking to stream videos from Netflix and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Steph_R \"CookNice\""}, {"rating": 5.0, "review": "Works great.  Install and setup was very easy.  It is getting used a lot and everyone in the family likes it.", "verified": false, "helpfulness": "0/0", "author": "Benjamin Worsham"}, {"rating": 1.0, "review": "This device started out good.  It had done what it said it would do.  i was pleased, until it got hot and burned out along with burning out my new Led tv.  It got hot and burned out the TV screen and when i tried to use it on another tv it doesn't work there either.  It briefly comes on and then goes black.  If you have any interest in keeping your expensive TV's working, stay away from this device.", "verified": true, "helpfulness": "0/3", "author": "John"}, {"rating": 5.0, "review": "Chromecast WORKS. Easy to order, install, program and CAST straight to your TV. I cut the cable and the cable bill and love \"casting\" videos from my computer to my large screen TV. youtubes are great to watch on a large screen TV. LOVE IT>", "verified": true, "helpfulness": "0/0", "author": "kc"}, {"rating": 2.0, "review": "The TV ad for the chrome cast would lead you to believe you can watch anything on your computer on your tv, actually, you can only watch Netflix or YouTube, I have read they are adding more things to watch which is good but for now it's very limited.", "verified": true, "helpfulness": "1/3", "author": "John Davis"}]