[{"rating": 1.0, "review": "If you like being stuck in a cattle chute and forced to the purchase counter, then this is the one for you. No other choice, no other selection. Sucks.", "verified": false, "helpfulness": "0/3", "author": "Raymond Williams"}, {"rating": 5.0, "review": "Love it, BUT, package seriously lacks adequate installation and operation instructions!  Had to use online information constantly to resolve issues.  Some were not resolvable, i.e., when I first researched online before my purchase, it said it would work with Google Chrome on a Vista computer.  AFTER purchase and digging down deeper on requirements and user comments I found it will only work with Windows 7 and above.  Very disappointed with that.  Now I have to use my cell phone and again, with little instruction - not easy at all!", "verified": true, "helpfulness": "0/0", "author": "Nancy Nelson"}, {"rating": 1.0, "review": "2 issues:1- The extension harness they send with it causes issues, there is freezing of the screen every ~8 seconds with their \"wifi signal enhancer\" extension.  Unsure if others are having this issue as well.2- It would have received 5 stars if they didn't remove the .AVI functionality from it.  You \"Used\" to be able to go to your C: C Drive and use Chrome as a file explorer, playing most any format.  They removed the .AVI compatibility with the latest automatic mandatory update.  Until this gets fixed, you are stuck with only support of a few video files.", "verified": true, "helpfulness": "0/0", "author": "Scott G"}, {"rating": 4.0, "review": "I was skeptical when I first heard about the Google Chromecast. But I pay $35 for just one movie date with my wife, so why not roll the dice. It is worth the price if we get two movies we missed in the theater. First advantage is access to Netflix original content. House of Cards was worth the cost of the device alone. Second advantage, I can Chromcast most streaming video from my computer. So if I miss an episode of The Good Wife because the football game ran late on Sunday, I can pull up the CBS website and run it. without crowding around the computer. Third advantage is the ability to control the Chromecast with my iPhone or iPad.Okay, the reason I did not give it 5 stars is because there is content I can not stream. For example, a lot of my alma mater's basketball games are available on ESPN3. It won't stream this content. But, really, my wife would rather I stay in my home office to watch the game and let her watch Revenge off the DVR. This is not a big deal, but it belies the only problem with the Chromecast. Although I love the content presently available, it is very limited: Netflix and YouTube. I would like access to Turner Classic Movies library. Maybe that will come sometime down the line.(UPDATE)I took the Chromecast with me on a weekend out of town with my wife. The hotel had a bland selection of channels and none seemed to come in HD. Plugged in the Chromecast and used my wife's Verizon Mifi and was able to access Netflix in the hotel room. When I returned home I had some difficulty returning the Chromecast to identifying my home wifi network, but after a few missteps it was back. I'm thinking of buying a second Chromecast to pair with my wife's Mifi for road trips. At $35 it is cheaper to have two than one AppleTV.", "verified": true, "helpfulness": "1/1", "author": "Gary W. Mccullough \"Dr. J. Hawk\""}, {"rating": 4.0, "review": "allows us to watch Netflix in bed.a bit tricky to set up but works well once chromcast has been installed. would recommend to anyone that does not have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "heardonthestreet"}, {"rating": 1.0, "review": "Designed not to work with XP! Failed to mention this thanks for wasting my time google! Junk Junk Junk Junk", "verified": true, "helpfulness": "0/1", "author": "Comte \"Comte\""}, {"rating": 4.0, "review": "It is not as easy to connect to mobile phone as expected.  However I did it and it works well as long as we have a good wi fi signal.", "verified": true, "helpfulness": "0/0", "author": "LEWIS APTER"}, {"rating": 5.0, "review": "The Google Chromecast is perfect and has worked great since I connected it. I would recommend it for anyone who wants to watch Netflix or YouTube on their non smart television.", "verified": true, "helpfulness": "0/0", "author": "Edris Phillips"}, {"rating": 3.0, "review": "The streaming only works for Youtube and Internet Browsing. Also when watching Youtube on full screen, it doesn't work: showing just a black screen, seems like a connection issue.", "verified": true, "helpfulness": "0/0", "author": "Einav"}, {"rating": 4.0, "review": "Great gadget, really easy to install, I can play any video from you tube or movies from Netflix but it doesn't let you play videos taken with the phone when streaming from my iPhone.", "verified": true, "helpfulness": "0/0", "author": "Jorge E. Mendez"}]