[{"rating": 4.0, "review": "Very easy setup and operation. The directions are printed on the box and tell you clearly how to install.Needs more applications to bring it closer to Apple TV but for the money, a third of the price of the apple, you could do worse. Just check to see if you will be happy with the viewing choices.", "verified": true, "helpfulness": "0/0", "author": "DiamaondDave"}, {"rating": 3.0, "review": "It is a handy little device. So far we have a had few problems with it connecting. Needed to move it up on the networks priority list. Time will tell if that fix helps. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amanda P"}, {"rating": 5.0, "review": "I love this product!  It is so easy to use, convenient, and the price is the best part! I am so happy with it!", "verified": true, "helpfulness": "0/0", "author": "vane4garcia"}, {"rating": 2.0, "review": "I have Apple TV and was hoping this would give better access to content or allow me to use my galaxy S4 to mirror or show on my tv, but it just really get's youtube, hulu+, netflix and some other very lame content. Even at 3x's the cost, Apple TV is worth it - this is not. I've already unplugged it and it's headed for the electronics junk drawer unless there are upgrades soon.", "verified": true, "helpfulness": "0/0", "author": "Marvin"}, {"rating": 4.0, "review": "If you have a TV you must have Chromecast...I can project any google chrome tab on my TV... all I needed...", "verified": true, "helpfulness": "0/0", "author": "abhishek"}, {"rating": 1.0, "review": "Not worth it. I'd rather just use my VGA splitter and hook up both my computer monitor AND tv to my computer. Not only can you do more stuff this way, but it's like $30 cheaper to do so!.Don't forget there's also a large # of people who have gaming consoles which provide these features too.", "verified": false, "helpfulness": "0/0", "author": "Frase"}, {"rating": 4.0, "review": "The chromecast has an excellent approach to the experience on the big screen. Perhaps the only problem is the lack of applications is still its great weakness.", "verified": true, "helpfulness": "0/0", "author": "Jorge Leopoldo Caballero Arredondo"}, {"rating": 5.0, "review": "Got two of these as presents for savvy teenagers. They couldn't be happier both had the same \"deep\" answer:\"It's exactly what I need it\". Go figure.", "verified": true, "helpfulness": "0/0", "author": "A. Alvarado"}, {"rating": 5.0, "review": "I ordered the Google Chromecast a few months ago.  So far it has worked like a charm.Pros1)  Easy set up - Took just a few minutes to plug into the HDMI port of my TV and standard power.2)  Works with all my devices - Samsung Note3, iPad Mini, Iphone 5s, Laptop.3)  Easy integration with youtube, Netflix, and other apps.ConsNone yetIf your looking for an inexpensive way to stream to a TV that is not internet ready, I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Scott Wohl"}, {"rating": 4.0, "review": "Is it perfect? Not quite, but that's the beauty of Google's product development, in that they consistently look to improve upon their product.  Really, the only thing keeping this from being a five star review is the app support, which will grow in the coming months now that Google has released the SDK to other developers.Setting up Chromecast is very simple, and you're always greeted by a nice visual background on the interface which cycles to change things up (and probably prevent burn-in on old plasmas and LCDs).  Where the device excels is in choosing your content to stream (cast) to the tv.  I can select a track from Google Play Music on my phone, and then pop between Netflix, HBO Go, etc to find something to watch without interrupting playing.  You can also keep browsing for other content while streaming a movie from one of the aforementioned services (something I can't do on my Apple TV).Also, like Airplay on iOS devices for AppleTV, it works for a good music hub if you're entertaining guests or just hanging around the house, only unlike AppleTV, Chromecast is supported on both Android and iOS (I'd imagine WP8 support will come down the road).All in all, Google's off to a good start here.  Now that the SDK is open to other developers outside of their initial pool, I'm looking forward to who all else jumps on board, and what other content Google tries to push, themselves.But when considering the cross platform functionality, you can't beat this thing for the price they ask.  I highly recommend getting it.", "verified": false, "helpfulness": "1/1", "author": "PiKapp288"}]