[{"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Nick L."}, {"rating": 5.0, "review": "Great simple rerouting WiFi casting devise.", "verified": true, "helpfulness": "0/0", "author": "not76"}, {"rating": 4.0, "review": "Fights with netflix sometimes, which gets annoying.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 1.0, "review": "Sent for return. Device isn't what you think it is. I'll stick to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Larwence Poetry"}, {"rating": 5.0, "review": "I absolutely love my Chromecast. I fully intend to purchase another. It basically turns any TV with a HDMI input into a smart TV. Instead of buying a new smart TV and wasting money just so i can watch Netflix and Youtube, this simple little device is a money saver. Set up is really easy. I like to think I am not technologically challenged but even if you are not into tech or just worried that you may not know how to set it up, rest assure, as long as you plug it into your TV, power it up, it guides your staight through the process. It takes less than 5 minutes. Just as long as you have wifi and an android/ios device, you're good to go. I highly recommend. Visiting the chromecast website also helps give you an idea about the various apps available. There are numerous but for me, big ones are Netflix and Youtube and some Nickelodeon. Also makes an excellent gift.", "verified": true, "helpfulness": "0/0", "author": "Biggs88"}, {"rating": 5.0, "review": "This sweet little baby will stream anything to your smartphone, tablet, or laptop and she streams from all the big names. And allows  me to get media from Youtube, Hulu, and HBO.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Everything OK", "verified": true, "helpfulness": "0/0", "author": "Mariano"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Bill Oxner"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Ashish Kumar Ravindran"}, {"rating": 5.0, "review": "We use these to cast many of our favorite shows. Great gadgetry.", "verified": true, "helpfulness": "0/0", "author": "Dennis B. Brown"}]