[{"rating": 4.0, "review": "Only thing holding me back from giving this a 5 star is that the setup required me to change my Access Point settings. Not a huge deal but I can understand if someone less technical had to do it could have been a problem. Definitely happy with this purchase though!", "verified": true, "helpfulness": "0/0", "author": "Paul Hackett"}, {"rating": 5.0, "review": "This device streams from your wifi. Your devices like cell phones, tabelets, computers pretty much just direct the device to the link/video web address (URL) you are streaming to TV from your devices.There are a few apps like netflix, HBO go, Hulu Plus, youtube and such but you have to be a subscriber to those site to use them. (More coming soon)You can use it to strem your computer screen to TV... ***NOTE*** you can ONLY stream Google Chrome Browser content, YOU CAN NOT mirror your desktop and other screen content JUST GOOGLE CHROME BROWSER", "verified": false, "helpfulness": "0/0", "author": "Tracy H."}, {"rating": 5.0, "review": "I have the movies I want, the price was right, and was easy to set up even for me. I recommend it to anyone who likes to watch Netflix and tube on their TV.  AH  Rockland Tx.", "verified": true, "helpfulness": "0/0", "author": "Arthur Hahn"}, {"rating": 4.0, "review": "My husband got me one for Christmas for our bedroom t.v.  I find it works great with Netflix but when streaming from other sites like Hulu, Xfinity etc., it can be a bit shaky.  The words don't always match with the mouths.  But, for only $35, I'm not complaining. Between this and our Roku 3, we are no longer slaves to the outrageous cable company fee's so that is priceless!", "verified": false, "helpfulness": "0/0", "author": "VW68"}, {"rating": 2.0, "review": "This tool is a great invention. But learning how to use it was  (for us) a major stumbling block. In fact, I still have not fully mastered how to make it work with my tablet. Directions are practically non-existent and a video tutorial runs too fast for my brain to grasp what is being presented. There is a big gap in making the connection between the APPs and the device. I suspect those who are expert in use of Android cell phones (which we are not) find no problem in using this technology. It does seem to work quite well once you successfully jump through all the hoops.  However, all the wrong attempts became extremely frustrating and my wife and I very nearly gave up on the whole enterprise.  We strongly recommend a more detailed print version of instructions for use... for those, like us, who are neophytes.", "verified": true, "helpfulness": "0/0", "author": "Dr. C. Bradenton \"dr. c\""}, {"rating": 4.0, "review": "The casting between Chrome tabs and the chromecast is pretty delayed and laggy. The compatibility is fairly limited currently, but i foresee this not being an issue soon.", "verified": true, "helpfulness": "0/0", "author": "Ryan Bozio"}, {"rating": 3.0, "review": "Mine works well with Netflix, but I have been unable to get it to function properly with some of the other sources it claims to support. Also am very disappointed that it doesn't support video from Amazon as I am a Prime member.", "verified": true, "helpfulness": "1/1", "author": "Grady N."}, {"rating": 5.0, "review": "Pretty easy to set up. Works very well for seeing long documentaries that are on YouTube. Got my brother one for Christmas and he really liked it as well.", "verified": true, "helpfulness": "0/0", "author": "Ramon P. Williams \"Ray\""}, {"rating": 5.0, "review": "The quality of this item itself is great. The applications for this product are very limited. If you like to watch videos on your television from your device, you will really enjoy this product.  The applications are very limited and we were hoping for more uses from our devices like running television station apps.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 4.0, "review": "Quick installation and ease of use has made Chromecast a fixture of the living room that receives daily use. It works great to cast HBO & YouTube from an iPad or iPhone to the big screen. My only complaint is the very limited number of apps that are currently available and the inability to cast Chrome tabs from an Apple mobile device. I hope that these features will come down the line.", "verified": true, "helpfulness": "0/0", "author": "Anthony Maggio"}]