[{"rating": 5.0, "review": "I absolutely love the Fire TV! After owning a Roku I can say this is a definite upgrade to the media streaming experience. Voice search works as advertised and makes finding content that much easier. The user interface is easy to understand and ver intuitive. I'd definitely recommend this item!", "verified": true, "helpfulness": "0/0", "author": "JG"}, {"rating": 5.0, "review": "Great to have when nothing is on TV.  Love the ease of connecting and using.", "verified": true, "helpfulness": "0/0", "author": "Jo Carter"}, {"rating": 5.0, "review": "It is everything I expected!  Love the convenience.", "verified": true, "helpfulness": "0/0", "author": "Tammie Taylor"}, {"rating": 5.0, "review": "Excellent item. Easy to set up and works well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Busy mom with book\""}, {"rating": 1.0, "review": "It's not what I expected. False advertisement", "verified": true, "helpfulness": "0/4", "author": "Paul Reynolds Jr."}, {"rating": 3.0, "review": "Expected more free movies with prime", "verified": true, "helpfulness": "0/0", "author": "Dana Polson"}, {"rating": 5.0, "review": "I love all of my amazon products.  I've been slowly returning cable boxes and buying the fire for each one.If only someone would send me that echo that I've waited so long for I could use that to set reminders to buy more ... hint hint ammy", "verified": true, "helpfulness": "0/0", "author": "Godfrey \"WiiHead\""}, {"rating": 5.0, "review": "I am very pleased with the Fire TV. It is very easy to install and hooks up effortlessly with wifi. The technology of the voice command remote is amazing. I am very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "livingstone"}, {"rating": 5.0, "review": "Very good product I own several apple TVs and I would recommend this product if you are a Prime member", "verified": true, "helpfulness": "0/0", "author": "Kkelly"}, {"rating": 5.0, "review": "Wow. Amazon does tech better than anyone. Period.", "verified": true, "helpfulness": "0/0", "author": "Poi Sen Pen"}]