[{"rating": 5.0, "review": "I got the Netflix deal so this was a great bargain. It has exceeded expectations.I will look to get another.", "verified": true, "helpfulness": "0/0", "author": "Dale L. Kaeff"}, {"rating": 5.0, "review": "Really happy with the chrome cast even if I had a somehow difficult setup. The chrome cast wouldn't connect to my wifi with a net gear router (WDC3400 I believe) I had to use an other wifi network to get it to work.", "verified": false, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Worked like a charm right out of the box. Super product and great value. Easy installation for the non-technical like me.", "verified": true, "helpfulness": "0/0", "author": "Jlbrundage"}, {"rating": 5.0, "review": "Using it to stream Netflix. I'm looking forward to using HBO Go and Hulu when that becomes available. So far highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Leomar Grullon"}, {"rating": 5.0, "review": "Amazing device, and it is just at its beginning stages. I cannot wait to see what is in store for this little device. I ordered it the day it came out and be happy with it ever since. I recommend this to anyone who enjoys internet TV and doesn't want to spend a ton of money on cable monthly. I know I don't.", "verified": true, "helpfulness": "0/0", "author": "Antonio Figueroa Jr."}, {"rating": 5.0, "review": "This is a cheap and effective way to turn an old TV into an intelligent TV! Wish it supported 802.11AC", "verified": true, "helpfulness": "0/0", "author": "davef0001"}, {"rating": 5.0, "review": "Google blew away market. Great price. User friendly. Compact. Best product i've bought in long time! Google defiantly made the 2013 tech product of the year!", "verified": false, "helpfulness": "0/0", "author": "Big tex"}, {"rating": 5.0, "review": "simple to set up and use and doesnt require any adjustments to settings. really easy way to not have to pay for cable ever again", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Another awesome product by Google.  Works perfectly.  Android interaction works perfect with all my Nexus products.  Highly recommended.  Netflix works great!", "verified": true, "helpfulness": "0/0", "author": "D. Pham \"D1PHAM\""}, {"rating": 5.0, "review": "Had a PC connected to my TV before but this small dongle does the work now - saves energy and also more convenient for the whole family to control from anywhere", "verified": true, "helpfulness": "0/0", "author": "Unsuk Jung"}]