[{"rating": 1.0, "review": "Poor product.  Have to reset the chromecast each time I use it.  I've called the customer service phone number several times and they're never helpful.", "verified": true, "helpfulness": "1/1", "author": "Max Chmielewski"}, {"rating": 1.0, "review": "Had a hard time syncing with my wifi. It gave instructions in case it happened and still can't get it to sync. No # to contact for problem solving. There are videos on YouTube and still no luck. Very disappointed, had high hopes for this item", "verified": true, "helpfulness": "0/1", "author": "Omar Ramirez"}, {"rating": 5.0, "review": "I have one  on every tv in the house. I highly recommend you do the same", "verified": true, "helpfulness": "0/0", "author": "Anthony Jordan Jr"}, {"rating": 5.0, "review": "Bought this item to view Netflix shows.  I had to get an HDMI switch as my tv didn't have enough ports.  The Chromecast has a somewhat large end so I had to use the extender cable to get it to fit next to the other HDMI cable on the switch.  The extender cable was included with the Chromecast and after the hookup was complete everything worked as expected.", "verified": true, "helpfulness": "0/0", "author": "Carolyn S Padgett"}, {"rating": 3.0, "review": "Difficult to install when you use a different tv. Could get pretty frustrating.", "verified": true, "helpfulness": "0/1", "author": "Diana Arroyo"}, {"rating": 5.0, "review": "Haven't used it much yet but have successfully installed it on my TV and the app on my phone with ease. Can't wait to start streaming Netflix, HBO Go and Pandora straight from my phone or computer to my TV!", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Does what it's supposed to!", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 4.0, "review": "Works well! Just wished I knew that only certain apps use chromecast and I cannot utilize all, like amazonrprime tv/movies.", "verified": true, "helpfulness": "0/0", "author": "taramonster \"taramonster\""}, {"rating": 5.0, "review": "Great product. Genius really. Who needs cable anymore?", "verified": true, "helpfulness": "0/0", "author": "NoaD"}, {"rating": 5.0, "review": "It's great and easy to use", "verified": true, "helpfulness": "0/0", "author": "Scott Schmidt"}]