[{"rating": 1.0, "review": "I am finding that some , in fact a lot of shows that I want to watch, I can see one of them and then if I want to see more I must BUY THEM!!  this really angers me!  I have already bought the device, I have already paid for Amazon Prime and now they want MORE MONEY!!  One of the shows I want to watch is from 1991 and to continue to watch it I must pay $4.99 per episode or $19.99 for each season.  Very disappointed in Amazon.  Very unhappy with buying something I must BUY MORE for it to work to my satisfaction.  Amazon \"what do you have to say about it?\"", "verified": false, "helpfulness": "3/4", "author": "Roberta Craughan"}, {"rating": 1.0, "review": "Returned it.  VERY amazon-centric.  I love amazon, but I want my streaming player to be neutral, and this isn't.  If all you watch is Amazon, it is great.  If you like other channels, it sucks.Sorry amazon, I'm a loyal customer, but your interface doesn't compare to Roku 3, and you need to make it more friendly with other channels.  The voice search is cool, it is lightning fast and I loved the Amazon Cloud channel... but those didn't make up for terrible interface.  Returned it and picked up a new Roku 3, couldn't be happier (except if Amazon added Cloud channel to Roku!)", "verified": true, "helpfulness": "2/3", "author": "Steve F."}, {"rating": 5.0, "review": "Awesome little tuner,  love the voice search... flawless!", "verified": true, "helpfulness": "0/0", "author": "Edward M Felty"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice option to cable but would like to see an app for Kodi.", "verified": true, "helpfulness": "0/0", "author": "Grand Haven"}, {"rating": 5.0, "review": "I got this for my fiancé as a Christmas gift, and we adore it!!! We had to deal with the Netflix bug at first (easy troubleshoot: Update the Fire TV in the settings, after letting it reset itself re-download Netflix). This gadget is perfect for ALL kinds of people. It has thousands of apps to choose from. Twitch for him (people stream their game-playing live online) and Craft Smart! (all kinds of craft and DIY tutorials) for me! Plus I can make playlists on my online Prime account and listen to them through our TV speaker system. We can also enjoy Netflix, YouTube, Hulu and SO many other streaming Apps. If you like anime this has so many channels with FREE anime and movies!", "verified": true, "helpfulness": "1/1", "author": "Holly"}, {"rating": 2.0, "review": "I want to buy this . . . I do.  But, you don't carry BYUTV, with the new show Granite Flats!  So far ROKU is the only one that carries BYUTV.  It's not costly to add it AMAZON.  Can you put it on?", "verified": false, "helpfulness": "0/3", "author": "AGmaC \"cc\""}, {"rating": 5.0, "review": "I sure do enjoy it very much.", "verified": true, "helpfulness": "0/0", "author": "Joe Garcia"}, {"rating": 4.0, "review": "I really like this TV set top box. I have a roku xd I was looking for an upgrade,which was between this and nexus TV. Choose this cause I got a deal. And I really like it,UI is fresh and responsive,video playback is quick,even if you have slow DSL,which I do. It has the usual apps Netflix,Hulu plus,pandora,vevo and your Amazon prime video/music. Plus I found Pluto TV which has different programs like diy,comedy,outdoor shows. An app called Home which is another diy/crafts show. These are great if you've cut the cord on cable or sat TV.My one dislike is it doesn't save your place if your watching a series,example watching fridge season 3 ep 2. You have to go back and find season 3 then find ep 3 to watch the next one. Hopefully Amazon will fix the minor detail.Overall I really like it,oh plus you can play games,forgot that.", "verified": true, "helpfulness": "0/0", "author": "MWJII"}, {"rating": 4.0, "review": "I will start of by saying overall it's a great little device.  The simplicity is amazing.  The voice search actually works.  I do have one major gripe, however.I have a Netflix account and get movies I want there.  I was under the impression that with Amazon Fire TV I would have access to many FREE movies.  99% of the movies I have searched for have been Pay movies, starting at 3.99 for HD on up in price.  These range from new releases, old movies, kids movies, the whole gambit.  I am a Prime member, but after having this for two months now I have yet to watch a FREE movie.So, Amazon, it's a great device.  I feel I was mislead in the amount of movies I would be getting for free.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]