[{"rating": 5.0, "review": "Love it, Great idea. No problems, seems to be made well and at a great price!", "verified": true, "helpfulness": "0/0", "author": "ModernWebStudios"}, {"rating": 5.0, "review": "Very good to watch YouTube video", "verified": true, "helpfulness": "0/0", "author": "xiaoqing ye"}, {"rating": 4.0, "review": "I love this little  gadget .", "verified": true, "helpfulness": "0/0", "author": "Carrie Fairley"}, {"rating": 5.0, "review": "Been waiting a long time for this!  Works great, I love it", "verified": true, "helpfulness": "0/0", "author": "JBNascar Fan"}, {"rating": 5.0, "review": "Way the go Google, just an incredible product. So small and compact. Easy to use to I take it with me on all my trips.", "verified": true, "helpfulness": "0/0", "author": "Sony Vilbrun \"abuckateer\""}, {"rating": 1.0, "review": "Does not work!  Waiting to try it at home this fall.  Not much help from Google.", "verified": true, "helpfulness": "0/1", "author": "Joel Palmer"}, {"rating": 4.0, "review": "Good performance according to expectatives. Good delivery time.", "verified": true, "helpfulness": "0/0", "author": "Pedro L. Garaicoa"}, {"rating": 5.0, "review": "Easier to use then roku. If you aren't techno savy, this is what you want, very easy set up. Just follow directions. Reset is tricky but not impossible.", "verified": true, "helpfulness": "0/0", "author": "tara st.pierre"}, {"rating": 5.0, "review": "Shipped much faster then I thought it would!  This product is great and affordable", "verified": true, "helpfulness": "0/0", "author": "Michelle L. Rivera"}, {"rating": 5.0, "review": "I've tried many different devices for streaming my local media. I thought it was a lost cause because they were all jittery or took far too long to load. Even the Apple TV was a sub par experience. My mind was instantly changed by this device which was surprising due to its price point. I was considering building a small home theater PC for a few hundred dollars, but with this device I was able to pair it with my old note 3 to stream media right to my tv. It's definitely worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Ryan eman"}]