[{"rating": 4.0, "review": "This does pretty much what is expected - I can stream Netflix and some other stuff from my phone onto my TV.  But I also have Apple TV on another set, and that is so much easier that I am dropping one star from this review.  It is a little sluggish to respond, and it seems I have to do a little extra clicking and waiting to get where I want to with it.  Once it's up and running, though, it works like a charm.  CHECK YOUR COMPATIBILITY - I was hoping to hook up my kids' Kindle Fires with this but it won't work.  For the price, as long as you are using compatible equipment, I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Rich the Writer\""}, {"rating": 4.0, "review": "I'm not entirely sure how I missed this, but the Chromecast does not supply the media.  I originally thought it was like a Roku or Apple tv, but then used your phone as the controller, but I was wrong.  It allows you to stream from your phone on to the tv. It does that well, but if you have any game console, you can already stream the biggies.", "verified": true, "helpfulness": "0/0", "author": "Brian Ahrens"}, {"rating": 5.0, "review": "The Chromecast is great.  I use it mostly for streaming HBOGo because the Roku can't with Xfinity.  But works great with Netflix, YouTube, etc.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have no idea how to use this it was a gift for my granddaughter  and she is very happy with it. Again very impressed by how quickly it arrived and that what you promise you do.", "verified": true, "helpfulness": "0/1", "author": "Bonnie"}, {"rating": 5.0, "review": "Easy to install and even easier to use! I love this little piece of tech! I get sick and tired of the same old shows on my television channels. This makes watching tv even more fun!", "verified": true, "helpfulness": "0/0", "author": "David Lundstrom"}, {"rating": 5.0, "review": "After owning this device, my TV now just plays Chromecast nothing else (does not need to :) )Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Krishna Prasad"}, {"rating": 4.0, "review": "I picked up one of these largely out of curiosity, to try with my Android tablet and the bigscreen TV at my brother's place. I didn't expect it to see much use outside of my playing with it; my brother has a smart TV, an AT&T; DVR box, and a blu-ray player, all of which have Pandora and various other streaming options on them.To our surprise, my brother has taken to using the Chromecast even more than I have been, and he's told me that when I move out he'll have to see about getting one himself. The big reason: it's a LOT more convenient for him to whip out his iPhone and 'cast Pandora onto the TV with two taps (one to launch the app, one to send it to the TV) than it is to grab the remote and fiddle with the menus to find and launch the service from there. Thanks to the HDMI-CEC built into the Chromecast, it even turns the TV on by itself!And it's just as easy to cast Netflix, Hulu, YouTube, Google Play Music or Movies, or any of the other services it supports. No more messing around with using the arrows on the remote to choose letters (my brother's TV remote has a qwerty keypad on the back, but still), just use your tablet or smartphone to tap them in. With YouTube, you can even queue up multiple videos--in fact, so can anyone with a iOS or Android tablet or smartphone with YouTube, so you can invite your friends over for a YouTube movie viewing party and each kick in your favorite video of cats doing cute things.That's the real genius of the Chromecast: it takes the things you were doing already and throws them up onto your TV. And you don't have to worry about making a direct connection from your tablet to the TV, because it's really just using your tablet to prompt it, then fetching the stuff directly from the Internet itself. You can also use it to 'cast web browser sessions directly onto the TV, though I haven't played around with that as much. I wasn't able to get it to work with my main desktop computer due to the funky way my wifi network is set up.The Chromecast's big weakness is that it has a lot narrower breadth of services available than Roku or other such boxes. You couldn't even 'cast your own media until recently, thanks to Plex, and at present you have to subscribe to Plex's paid service in order to do that. (Though I expect the ability will migrate to the free version sooner or later.) Likewise, the lack of Amazon Prime support is another big problem; you can 'cast it from a web browser window, of course, but unless you have a pretty fast computer it may appear jerky.But more developers are making their products Chromecast compatible all the time; I expect Google will be adding more and more services as time goes by. In the meanwhile, it's cheap enough (especially here) that you might do well to consider snagging one even if you're happy with your Roku, Blu-ray, or whatever streaming solution you normally use--especially if you're a heavy user of one of the services it DOES support. Don't underestimate the usefulness of instantaneous access to some services, even if they're not all there yet.My brother sure isn't.", "verified": true, "helpfulness": "0/0", "author": "Robotech_Master \"robotech_master_01\""}, {"rating": 5.0, "review": "What a great little device!  It was really easy to install & took maybe only 5 minutes.  It comes with everything you need in the box so you do not have to order any extra accessories.  I mainly wanted to watch Netflix on my TV rather than just my tablet & it works perfectly.  The picture quality is great, and for the low price, it's an excellent buy.", "verified": true, "helpfulness": "0/0", "author": "ARenee"}, {"rating": 2.0, "review": "I should have double checked compatibility issues before ordering. First I tried casting from my iPhone 4. I found that the ChromeCast app requires iOs 6 or higher, which my phone won't upgrade to due to available memory limitations. So then I tried my Kindle Fire HD tablet - only to find that the ChromeCast app does not work with it either. No problem, I'll use my Windows XP PC. Nope- doesn't work with XP either. I tried using my wife's Windows 7 PC. I had limited success there. It will cast to the TV for about 10 seconds and the video hangs up. I get live audio, but just a still picture frozen on the screen. I thought maybe I had too much running and slowing down the processor, so I rebooted and ran nothing but the Chrome browser - same result. As a last ditch effort, I tried my daughter's MAC (which resides at the other end of the house) and finally had success. I guess I do really need the exercise of walking to the other end of the house anytime I want to pause or change video, but man is that frustrating! Again- I should have read others reviews first because everything I have reported others have had issues with too.", "verified": true, "helpfulness": "0/0", "author": "Ron Barnett"}, {"rating": 5.0, "review": "The device needs a power supply, not evident from the image and somewhat overlooked in product descriptions.It is plug and play and it is really easy to connect any device using the wifi network. the Chromecast is always on as long as it is plugged-in to a power source, the connectivity icon is hot and easily accessible from compatible video services like YouTube and HBOgo. Streaming occurs in the background so you can do other things on your handhelds or computer. Really cool product. I highly recommend", "verified": true, "helpfulness": "0/0", "author": "Amy"}]