[{"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "1/1", "author": "H. Boisvert"}, {"rating": 5.0, "review": "Amazing power in such a small package. Easy to setup and use. We use it mostly for Netflix account, but Amazon Prime shows are also good. I can't imagine why this unit had to be \"refurbished\", but it has worked perfectly for us. The remote is small and lightweight. Nice that it operates on radio frequency instead of InfraRed so you do not have to point it at the control box to make it work. This means you could put the set box out of sight as the only reason you might want to see it would be to see if the power light is on. Just be careful not to sit on the remote or bump it with your arm as you are watching your shows because it may fast forward or access menus unexpectedly without needing to be pointed at the unit like a typical remote. Also the black remote is hard to find in the dark or a dimly lit room. Really love this product and will consider another one for our other TV's.", "verified": true, "helpfulness": "0/0", "author": "JimV67"}, {"rating": 1.0, "review": "sucks", "verified": false, "helpfulness": "0/4", "author": "mdellyd"}, {"rating": 2.0, "review": "I was excited at first because it was really cool and it was very easy to set up. However, it did't take me long to notice that every time I watched something a tv show, a movie, or something on youtube it would lag, then it would freeze. At times it would stop play and say \"Please connect to the internet\" I was and am. Everyone, in the house was connected, everything else would stream except for the Amazon FireTV.  I never had a problem like this when I had the Ruku, I'm getting rid of the AFTV and getting the Ruku3.", "verified": true, "helpfulness": "0/3", "author": "Cherry L. Crayton"}, {"rating": 5.0, "review": "Apple Fire TV is clearly the way to watch Streaming Channels!  Just say the name of the program or title of the movie or singer you want to hear, and regardless of the channel you subscribe to.....it just appears!", "verified": true, "helpfulness": "0/2", "author": "Leigh Ford"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "1/1", "author": "George Heath"}, {"rating": 5.0, "review": "Love it ! Easy to install too", "verified": true, "helpfulness": "0/0", "author": "Elaine M. Turner"}, {"rating": 4.0, "review": "If it's between Apple TV and this, go with Apple TV. Much more versatile. Can't stream anything from my Mac products through this. If you're an android user, you will probably love this, though! It is also great for the utilizing the free media included with Prime membership.", "verified": true, "helpfulness": "1/2", "author": "Robin Gibson"}, {"rating": 4.0, "review": "had roku and it couldn't pick up a signal in the living room .plugged in the fire box and we've been watching every day", "verified": true, "helpfulness": "0/0", "author": "Patrick E. Guthrie"}]