[{"rating": 5.0, "review": "Chromecast works great. Easy to setup. I wish my tablet would cast the whole screen, but I mainly use it for youtube and netflix, so it is suffice. It casts a great quality too, but I assume that is due to the internet speed as well.", "verified": true, "helpfulness": "0/0", "author": "Jason Jacob"}, {"rating": 1.0, "review": "does not work properly", "verified": false, "helpfulness": "0/1", "author": "S. Seyferth"}, {"rating": 4.0, "review": "simple to use, gives me access to things that are a hassle through my other devices. It is nice to be able to make choices off my laptop or tablet instead of the quirky onscreen alphabet that other devices require.", "verified": true, "helpfulness": "0/0", "author": "J. Schutt \"JCS\""}, {"rating": 5.0, "review": "Terrific will buy a few more for my friends  love it", "verified": true, "helpfulness": "0/0", "author": "PETER C DAMMAR"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "ivan paz"}, {"rating": 3.0, "review": "Good unit, but I have buffering issues that I can't seem to solve.  I've all but quit using this unit.  I'm sure someone smarter than I on gizmos will likely be able to sort things out, but it's not working for me.", "verified": true, "helpfulness": "0/0", "author": "fljab"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Thiago Bomfim Ribeiro"}, {"rating": 1.0, "review": "I feel like I don't own this but rather am renting it from Google.What happened to open watching what I want with my own devices and open source development?I already own four devices for putting youtube and netflix on my TV, sorry don't need one more.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it, use it to watch youtube videos from my phone.", "verified": true, "helpfulness": "0/0", "author": "Mitchell S."}, {"rating": 5.0, "review": "I was recently given a television after not owning one for more than 10 years. I've never had cable, and to my surprise, prices are through the roof. So, after lots of research, I decided to get the Chrome. The shipping was quick. Once received, the setup was easy. I'm sure this little gadget does many things, but I mainly use it to play music from my phone on the television. I know, maybe my friend should have given me a radio instead lol. Periodically, I cast YouTube videos and Netflix. The picture is always clear and it doesn't skip/freeze. Hope this helps.", "verified": true, "helpfulness": "1/1", "author": "NATURALBEAUTY78"}]