[{"rating": 3.0, "review": "Not a bad. Being able to stream media from an android device to the Chromecast is nice, but it's limited to various google apps. I had gotten this so that I can broadcast my presentations during meeting, but I'm finding the limitation is enough to stop me from using it.", "verified": true, "helpfulness": "0/0", "author": "Nipith"}, {"rating": 2.0, "review": "Disappointed with what it can do.  Unbelievable that you can't stream video from your hard drive to it without jumping through hoops.  Streaming shows through it has tremendous lag and poor video quality.  I'm not even using it really.", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 5.0, "review": "Very satisfied with the Google Chromecast HDMI Streaming Media Player.  Easily installed and setup, great product for the price.", "verified": true, "helpfulness": "1/1", "author": "D. Clifton"}, {"rating": 5.0, "review": "I am quite pleased with this  device. It was easy to install. Once you get the hang of it, I found its easy to stream from my phone or tablet to my t.v. I like watching You Tube and Netflix on the t.v. now. I'm a senior and I like to keep up with new technology, as much as my budget allows.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It works very good when it wants. Youtube playing from iPad or Android Tablet's Youtube app works well sometimes and other times just it keeps buffering, tried at several places and problem persist, although the same video without casting plays fine. And Tab casting from Chrome in the PC works very good at first, but when playing a long movie after an hour the cast goes off, and trying to cast again it shows a huge lag and goes off. So 30 minutes tv show plays great, but 2 hours movie fails to complete.", "verified": true, "helpfulness": "0/1", "author": "tiko.col"}, {"rating": 4.0, "review": "Chromecast is an improvement over all of the wired alternatives at hand. Setup was easy, and I've never had issues - we were immediately able to stream to our TV from any computer or mobile device which has Google chrome installed.Nice box too.", "verified": true, "helpfulness": "0/0", "author": "A. Menocal \"Alex\""}, {"rating": 5.0, "review": "Purchased this to get streaming video for my kitchen tv. It is easy to set up, I actually went on the internet to see a videoof the installation. Would like to have more options, it does what I want it to do.", "verified": true, "helpfulness": "0/0", "author": "Anne"}, {"rating": 5.0, "review": "Works great....best interface to netflix, etc that I've found.  No kludgy 'app' on dvd player, tv, or dvr just pull it up on the phone and 'cast' it.", "verified": true, "helpfulness": "0/0", "author": "Ian"}, {"rating": 2.0, "review": "This device does not stream directly. It casts things from your computer or smart device (phone, tablet, iPod touch). The quality is not great, and being that it just goes from the device instead of from the internet, it is not as nice as it very well should be. The image ends up being darkened significantly, and can be grainy at times because the video, etc. is sent from the internet to your device, then sent wirelessly to the TV. I would not recommend this product unless it will seldom be used. Spend the nominal extra fee to buy a Roku, or more even for the Apple TV or Fire TV.", "verified": true, "helpfulness": "0/2", "author": "Avery McDaniel"}, {"rating": 3.0, "review": "I have not been able to use it.  I think it might be because of our router.  We have been so busy that it has not been on the top of our list to do things.", "verified": true, "helpfulness": "0/2", "author": "Life is good \"Happy to be\""}]