[{"rating": 2.0, "review": "Very poor streaming capabilities...have to sit in front of the wireless model to get a decent signal and even then there are constant lags in streaming", "verified": true, "helpfulness": "0/2", "author": "Samrat Manak"}, {"rating": 5.0, "review": "Loved how this item works with multiple devices! Very easy to use and very user friendly to set up. Great purchase.", "verified": true, "helpfulness": "0/1", "author": "Anita Kienker"}, {"rating": 5.0, "review": "The device is fast, easy to use and had made watching my favorite shows 100 times more convenient. I look forward to more apps being released but it already world's with all my movie and TV show needs.", "verified": true, "helpfulness": "0/0", "author": "H. J. Peifer"}, {"rating": 2.0, "review": "I bought this to stream my laptop video to my tv.  I have 50mb internet and the video even at 480p was glitchy so much that it almost made me sick watching it.  The actual apps, Netflix and Hulu, worked great.  Streaming not at all.  I ended up getting a Roku 3 and absolutely love it.  Well worth the extra price.  Streams beautiful 1080p and has 100s of apps.  As of now the chromecast only has 2 or 3.  Maybe when google gets things going this will be a great product, but as it is now spend the extra for a Roku.", "verified": true, "helpfulness": "1/1", "author": "Cory C."}, {"rating": 3.0, "review": "Chromecast has limited uitility at the present time. Using the tablet or smartphone as remote is cumbersome. Also requires very strong wifi signal.", "verified": true, "helpfulness": "0/0", "author": "Shivarama Bhat"}, {"rating": 1.0, "review": "The sessions is very difficult to set up.  Once set up, the session lasts about 5minutes and thendisconnects.  You have to continue to reset  the device.  Waste of time and money", "verified": true, "helpfulness": "2/3", "author": "Jim"}, {"rating": 1.0, "review": "The Chromecast Has very limited streaming options, you better carefully read the external reviews. And it doesn't really work outside of the US - applies to both the iOS/Android app and the streaming options.", "verified": true, "helpfulness": "1/2", "author": "Gleb Shaviner"}, {"rating": 3.0, "review": "Well, I am curious about what this nifty thing could do so order one. The first time i ordered it, I was told I won't get one for another couple of months. Ha..So it is really hot. Then a month later, I ordered it again and Amazon shipped it to me in a week.First, I could not do the set up from my iPad. I did everything according the instruction, but when I got to the part that I need to set up the home network, the app refused to accept my WPA security key. So gave up on that one. Then I tried again and ran the set up from my MacBook: it worked!I can then start streaming from my iPad..but only from Netflix and YouTube! OK so what good is it? Most newer TV, media players and some BluRay players already have this capabilities. I have 2 devices that I can access Netflix and Youtube attached to my TV, why would I want to stream from my iPad??If you are thinking about getting this and have iOS devices, wait awhile. May be Google will get around to add more steaming apps.  Mine is going up the shelf now and staying there until I can stream to it from my iPad's movie players, Azul, Seagate Media...:-).", "verified": true, "helpfulness": "0/1", "author": "H. Dinh \"shooter\""}, {"rating": 4.0, "review": "This is what I was waiting for from Google. It still does have issues casting Google browser.  Sound it choppy and video slow.  Youtube and other apps work great. Hope Google will release some patches to improve the lacking functionalities.", "verified": true, "helpfulness": "0/0", "author": "Mathew Philip \"suku102\""}, {"rating": 2.0, "review": "The Chromecast has a couple of really brilliant aspects to it, however some things just make it (currently) unusable. The main benefit of the Chromecast is that it streams HD content fantastically from a laptop to a TV. The only caveat there is that your laptop/source must be able to smoothly play the HD content itself. I tried streaming from an Asus EeePC (1005P) however it was heavily jittery and could not stream properly. When casting from my Chromebook Pixel, however, the streaming was flawless (although at some points buffering was needed, which sort of ruins the experience..).There are a few issues which are known, such as its problems maintaining a connection to the WiFi. I have a simple setup at home - just a WiFi N router, literally 15 feet away from the TV, with direct line of sight (i.e., no walls etc). The connection consistently drops out every 10 minutes or so, even when changing the WiFi band from N (2.4 or 5 GHz) to B.The worst of the problems I had was finding a way to stream media to the device. I really would like to play my own videos/movies onto my TV from my laptop (is this not what the Chromecast is for?). Of course, if you have movies on Google Play then this works OK, however when it comes to playing your own videos you're stuck for options. The easiest way to do this is to simply open up Google Chrome browser (with the Chromecast extension installed), and press Ctrl+O to open a new file. Then simply select the video you'd like to play and it plays within the browser, allowing full-screen playback, and you can then cast this Tab onto your TV. The problem here occurs when trying to play any movies that are encoded in a manner Google Chrome doesn't support. Most files should work but it's annoying when the ones you want to play (such as .mkv's or .avi's) don't work, or only partially work with no audio.Since the product is still in it's early stages, I will wait until Google rolls out a fully fledged piece of software (or firmware upgrades) that can stream my videos from my laptop to my TV. Just not sure why Google removed support for this back in August.", "verified": true, "helpfulness": "0/0", "author": "Mark Piekarz"}]