[{"rating": 4.0, "review": "I love just about everything on it.It has plenty of great features like entertainment and games which I have not gotten a chance play yet since I didn't buy the game controller.only thing I didn't  like was the voice recognitionWas way off, I will keep trying to make it work other than that it's a great product.", "verified": true, "helpfulness": "0/0", "author": "Reginald Coleman"}, {"rating": 4.0, "review": "Was easy to set up and we are enjoying all the movies and TV shows we can watch.", "verified": true, "helpfulness": "0/0", "author": "m. kingman"}, {"rating": 5.0, "review": "Love it! We have two at home and happy they communicate with each other. No need to repurchase apps. I do wish the voice command would do more.", "verified": true, "helpfulness": "0/0", "author": "Jackie"}, {"rating": 5.0, "review": "I couldn't be happier now that I've dropped Tine Warner Cable's overpriced cable and switched to Amazon Fire TV. I already had a Prime account as well as Netflix so all I had to do was sign-up for Sling TV with the discount coupon and then only paid $50 for Fire TV. I can still watch BBC news through their app, listen to the music I've purchased, and I am going to look into some of the games as well. The only thing that you really need to know because it don't remember seeing it when I ordered it is you need an optic cable for audio. I already had one so it wasn't a big deal but if I didn't I would have had to go back and order/purchase one.My dad wanted to drop DirecTV and I told him about Amazon Fire. He ended up returning the Chrome TV stick he got because it didn't support as much and got the Amazon Fire Stick since he TV doesn't have an optic port, just HDMI. He loves it too and we're both glad for all the money saved through no longer having cable/satellite providers!", "verified": true, "helpfulness": "1/1", "author": "Lisa"}, {"rating": 4.0, "review": "Not a huge fan of the app and content layout but all the services and remote work well", "verified": true, "helpfulness": "0/0", "author": "jeff holm"}, {"rating": 5.0, "review": "Potent little box with a lot of flexibility.  If they remove the restrictions on the app store it would be perfect.  With a usb keyboard and mouse this could be a chrome-like desktop replacement.", "verified": true, "helpfulness": "1/1", "author": "Cory McDowell"}, {"rating": 5.0, "review": "Love this. Works great as long as your internet is strong enough", "verified": true, "helpfulness": "0/0", "author": "April G."}, {"rating": 5.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Jefe"}, {"rating": 4.0, "review": "I was using the Amazon Fire Stick on my tv but Netflix and Hulu would continuously \"buffer\". Sometimes the picture would stall and I would just get audio. Sometimes everything stalled. I even changed internet providers from Frontier to TWC and it did not work. So as a last ditch effort I switched to Amazon Fire TV. It was a bit more expensive than the stick but it seems to stream much better. Hope it stays that way!", "verified": true, "helpfulness": "1/1", "author": "Lana"}, {"rating": 5.0, "review": "Best box of the year.  It works in Egypt which is the location I work.  I can see my shows now.", "verified": true, "helpfulness": "1/1", "author": "Walter"}]