[{"rating": 5.0, "review": "Easy to install, as advertised.  I teamed it up with Netflix and can watch all the TV show I missed, plus movies.", "verified": true, "helpfulness": "0/1", "author": "Anne C. Rabbitt"}, {"rating": 4.0, "review": "What a great solution for wireless conductivity for the TV. It works great with the only two apps that work with it (Yahoo and Netflix) Thats a whole lot of viewing right there and its worth the price for that alone. The problem for me is when \"casting\" a tab from the Chrome browser. My computer goes into a state of overheating and the videos are grainy. They do admit that this is still in Beta testing phase and will most likely improve.", "verified": true, "helpfulness": "0/1", "author": "Medium"}, {"rating": 5.0, "review": "I found the Chromcast easy to use from my laptop or phone.  The quality is great.  However the streaming choices are limited - MUST have Amazon Prime!!!!!!!!!!!!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Charlotte Marlow Mcewen"}, {"rating": 4.0, "review": "We were extremely excited for Chromecast and had high hopes.  This is probably why we were let down a bit.  Chromecast is a pain to setup.  You have to know a thing or two about your router which was fine for me since I work in IT, but I can imagine it is not for the standard user.  Once setup, I do enjoy being able to cast from any device, and note that this isn't streaming from your devices, but your devices are working like a remote control.  It can stream from your computer, but it's a bit choppy.  The biggest disappointment was that Chromecast currently only supports Netflix and Youtube (barely).  It's best for Netflix.  I was hoping that they would have more support for other services such as Amazon Prime Instant Stream, Hulu, etc., but no.  They say that more App support is coming, but I feel that releasing this product with such little supported Apps is kind of like releasing a beta product.  We did call Google for support and they were very helpful.  Overall, for $35 this is a neat little device.  The picture quality (netflix only) was exceptional.  It will be interesting to see how this device competes with Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Cubtravie"}, {"rating": 1.0, "review": "I bought this because the advertising talks about redirecting your Chrome Browser output to the TV and controlling the TV from your Android device. It didn't say that it can't do both at the same time. I bought it so I could show my Flickr photos on my TV. Turns out that I may be able to do this from my laptop (I haven't checked) but not from my tablet (Chrome on the tablet does not support Chromecast).I'm giving this away. Maybe I'll get another one when they finish development.", "verified": true, "helpfulness": "2/6", "author": "William Rosenfeld"}, {"rating": 3.0, "review": "I would give it 5 stars, but the two strands of hair I found inside the box made me reconsider. Good thing it's a device that doesn't have to be touched frequently.", "verified": true, "helpfulness": "1/5", "author": "Mohammed"}, {"rating": 1.0, "review": "When I tried using it on a 6 year old Vizio, all I see is purple. Looking at online troubleshooting, I am not the first with this issue, and there seems to be no fix. Good idea, Google, but the execution was lackng, at least in my case. Thumbs up to Amazon for their great return policy, though.", "verified": true, "helpfulness": "2/6", "author": "scoutbyron"}, {"rating": 3.0, "review": "Works really  well. But needs more content. I am not a Netflix or Pandora dude so its functionality is limited for me. Great potential.  Looking forward to when more can be done with Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Alan Goodridge"}, {"rating": 5.0, "review": "Using this to stream items from my Netflix account as well as from my home server.  Vs something like the Roku, I really can't complain as it uses the cloud to get the content.  I would do some research on the features of this unit vs something like Roku and AirPlay as this isn't necessarily a plug in and you expect it do what you expect it to do.  It's more along the lines of it does things that other similar products do but it's just another tool in the toolbox that you have to figure out for yourself how to use it.  So, don't just go out and buy this because it's a cheaper alternative.  Cheaper yes, but not without its potential as developers should have a field day with this thing in making usable apps.  Highly recommended.", "verified": true, "helpfulness": "0/1", "author": "DJ MinWah"}, {"rating": 2.0, "review": "It was easy to set up, but once we did set it up we found that Amazon.com Instant videos cannot been viewed with this product.  Perhaps some day they will find a way for Chromecast to view Amazon.com Instant videos.  But since it does not I returned this product and bought ROKU 3.  It was just as easy to set up and one of the channels is AMAZON.COM INSTANT VIDEOS, now.", "verified": true, "helpfulness": "2/4", "author": "C. Peters \"Working 12-5\""}]