[{"rating": 5.0, "review": "Easy and fun to use ... I don't reccomend the game controller... Hard to use and sync up with actual game aps...", "verified": true, "helpfulness": "0/0", "author": "Kelly Jo Stratton-Murphy"}, {"rating": 4.0, "review": "I love it. Get way to watch movies.", "verified": true, "helpfulness": "0/0", "author": "michelle"}, {"rating": 4.0, "review": "I love it!  Works great!! The voice Search button makes things so much easier.  The only thing I don't like is when I do the VS it only searches Amazon Prime and the paid tv/movies.  I thought it was supposed to bring up stuff that is available on Netflix as well.  That being said.  I have enjoyed this so much. I bought the game controller and love that as well.  It's perfect for a small time gamer like myself.  It's like having a mini game machine without having to spend hundreds of dollars on a Ps4,Xbox etc and games.  The games are fun.  Mostly mini games and classic sega games (which I love) that are either free or really cheap.  I got Castle of Illusion starring Mickey for just 79 cents!  I'd definitely recommend getting this system!!", "verified": false, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "It was easy to install and use.  I have had an Amazon Prime for a couple of years for the free shipping of my business without take advantage of the free videos, now I have Great TV to watch at night when the work day is done.  Thank You Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "John Schmidt"}, {"rating": 5.0, "review": "This was a gift for my husband, and he loves it.  There were a lot more available shows and movies than I expected.", "verified": true, "helpfulness": "0/0", "author": "Debbie Kline"}, {"rating": 4.0, "review": "I like it. I expected more apps but it streams well.", "verified": true, "helpfulness": "0/0", "author": "kathy parks"}, {"rating": 5.0, "review": "Very happy. Better picture than dish network", "verified": true, "helpfulness": "0/0", "author": "Kyle Thornton"}, {"rating": 5.0, "review": "Because my TV is routed through an A/V receiver the Fire Stick would not have worked ( would not have had sound). I would not have known that had a kind reviewer not answered my question about it before I bought it. With his advice I bought the Fire TV instead because it has an optical audio output. I also bought an optical audio cable.  I plugged an HDMI cable from the FireTV into my TV, and the Optical Audio cable from the Fire TV box into an available optical audio input on my A/V receiver.Use my A/V remote to switch the TV input to the proper input and push the button for my audio input and I was up and running. Operation is very easy. Voice activation works great. I only have 1.5 mbps internet speed so I do not get HD quality picture and sometimes it will pause while buffering but other than that I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Pop"}, {"rating": 3.0, "review": "I think the technology is great.  It was easy to set up and use.  Most of the programming that comes with my Amazon Prime Membership is really the stuff you'd never watch on TV.  The programs I'd enjoy, cost an additional fee to watch.  I had hoped this would be a valid alternative to cable TV, but it isn't in its current state.", "verified": true, "helpfulness": "1/1", "author": "Jim75219"}, {"rating": 5.0, "review": "I love the Amazon Fire TV. You just plug it into you hdmi port. I am able to watch movies on Netflix and Amazon. I can also play music from my Amazon account. I have now installed the  xbmc app so I very seldom have a desire to watch regular TV. I also purchased Chromecast but I like this product much better.", "verified": true, "helpfulness": "0/0", "author": "bdarby"}]