[{"rating": 5.0, "review": "better than I thought it would be. Able to lower my cable bill because of the fire. love it and would recomend to all.", "verified": true, "helpfulness": "0/0", "author": "Robert A Sabia"}, {"rating": 5.0, "review": "We were looking for a way to add Netflix to our TV and decided to try Amazon Fire TV.  The setup was very easy and quick.  All we needed to purchase was an HDMI cable.  Once we setup the box, we download Netflix and began watching movies!  Also, Amazon Prime movie/TV selection is amazing!!  There is TV series, exercise channels, cartoons, movies . . .  a huge selection!  Now we have tons of shows to watch.  We have begun watching The Sopranos from the beginning of the series!  Amazon Fire has opened up a world of movies and TV shows that are free with the Amazon Prime account.  The voice control remote works great to quickly find a show.  We are so happy with Amazon Fire TV!  We love it and would highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 5.0, "review": "Great alternative to having to rent another set top receiver for a spare room. Once you figure out how to use it you can customize it to play only shows or movies you like. Add Prime membership to this and you have an extensive catalogue of shows, movies or documentaries to chose from. I obviously am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Salsa Kid"}, {"rating": 5.0, "review": "I LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Jessica A. Mcilroy \"pokkadot\""}, {"rating": 4.0, "review": "What disappointed me was the 30 day free trial.  I couldn't view shows for free.  Maybe I misunderstood but my choice of shows had a fee.The equipment was very well designed, simple to install, and very smart features.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "The remote is light years beyond Apple TV's.  The hardware in the device is noticeably better than Apples. I have Prime, so once you weed through all the junk movies or tv series, I can always find something worth the time. I don't use it for pictures on my tv, or linking it to iPad, which would obviously be better on apples device.  Overall very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "D. Hunter"}, {"rating": 5.0, "review": "Easy to hook up and works as adverised", "verified": true, "helpfulness": "0/0", "author": "wizzar"}, {"rating": 5.0, "review": "I've had Amazon's Fire TV now for about 8 months, and I like it a lot! I shopped around and read reviews before I made a final decision. The reason I chose Fire over some of the other popular devices is because since joining Amazon I've had positive experiences consistently. The products, value, convenience, ease, and choices are great overall. Another main reason I chose it is because of the wide selection of movies and shows Amazon offers--many of them free if you're a Prime member. A lot of the American Experience flicks are not only free, they're entertaining and educational. Movies I can't find anywhere else I can find on Amazon. In addition to the movie/show choices is the EASE of using Fire TV. It's simple to connect and start using--even without reading the instructions. I've never had to contact support, but from reading reviews a lot of people said Amazon had very good support services. Did I say how EASY it is to use? Once its hooked up to your TV using HDMI cable (it's like putting a puzzle together--just plug it in where it fits) you just turn on your TV, hit the HDMI button on remote, click the \"home\" icon on Fire TV remote and start browsing shows. I am very satisfied, and would definitely purchase again if I had it to do over!", "verified": true, "helpfulness": "0/0", "author": "Carole59r"}, {"rating": 5.0, "review": "Love it!  Super easy set up and wonderful quality.  Voice control is great too!", "verified": true, "helpfulness": "0/0", "author": "Linda \"cooking enthusiast\""}, {"rating": 2.0, "review": "roku is more fluid... where is amazon music!", "verified": true, "helpfulness": "0/2", "author": "james Preston"}]