[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Rye Buy"}, {"rating": 1.0, "review": "This gizmo comes with the \"simply install\" words on a blanket website  You will end up installing software you don't want.  You will spend hours listening to folks on forums, and finally you will come across someone from China that will tell you it does not work with Kindle Fire HD.", "verified": true, "helpfulness": "0/1", "author": "Guy"}, {"rating": 5.0, "review": "This thing is awesome. I bought it because my crappy DVD player kept buffering with Netflix. I thought it was Verizon FIOS throttling Netflix, but it turns out it was my DVD player. Now I use this with my iPad. Works perfectly!!!", "verified": true, "helpfulness": "0/0", "author": "Caleb Barnum"}, {"rating": 4.0, "review": "Used as expected.", "verified": true, "helpfulness": "0/0", "author": "JOHNNY JONES"}, {"rating": 5.0, "review": "Love the fact I can take it with me anywhere and use it.  No more cable for me!", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "Turned my very first HD TV into a \"smart\" TV.  My only complaint is that it feels like it runs a little hot.  When plugged in to the AC outlet or a USB port (Tested on a newer television).", "verified": true, "helpfulness": "1/1", "author": "RatedM3"}, {"rating": 5.0, "review": "I got this chromecast when it first came out and it came with the 3 months of netflix.  It's a great streaming device.  Cheap and effective.", "verified": true, "helpfulness": "0/0", "author": "Tabemonogatari \"tabemono\""}, {"rating": 1.0, "review": "Not what I expected. Can't get the thing to work. What a waste.", "verified": true, "helpfulness": "0/2", "author": "adam zinn"}, {"rating": 5.0, "review": "I own two Chromcast devices. It is awesome to be able to cast Netflix, Hulu, and various apps like Daily Burn. The one negative would be against Amazon for not having Prime Video compatibility; however since I have a relatively new Android tablet running 4.4.2 I can mirror with Sound which is nice. Chromecast is a very easy install, and simple concept to master. We have an iPad and Andriod Phones and tablet, all which work very well with the chromecast. For the newer users: chromecast is like cable box for online apps. Your phone / device act like a remote, and simply point the chromecast to the right 'channel' being a web address. This is perfect for all age groups, as long as high speed wireless internet is available. Also, save money over a smart TV and simply plug this in. We don't have cable, so this has been an integral part of out TV experience. Even with a 7 Mpbs connection, we can stream HD. I have used a PS3, a sony smart dvd player, smart tvs, phillips smart dvd player, and Amazon Firestick. So far this has been my favorite. Also the screensaver pics when not in use are very nice, but can be pointed to a personal library. Happy Casting!", "verified": true, "helpfulness": "0/0", "author": "Matt F."}, {"rating": 4.0, "review": "Love my Chrome very easy to install watch Netflix all the time", "verified": true, "helpfulness": "0/0", "author": "Suzette C."}]