[{"rating": 4.0, "review": "Really the only way I've found to be able to easily watch amazon prime videos.", "verified": true, "helpfulness": "0/0", "author": "Alexander Murphy"}, {"rating": 5.0, "review": "Much easier to use / understand than similar product bought 3+ years ago.  Started watching Downton Abbey from the beginning.  Love being able to back up and get what I missed, then fast forward through parts I remember.  Great!", "verified": true, "helpfulness": "0/0", "author": "Gail Taylor"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Linda Flynn"}, {"rating": 4.0, "review": "I love it, I'm only giving it 4 starts because Amazon is totally controlling the device and making it hard to install app from different sources, and even if you managed to install non-amazon Apps, you still can't easily access them.", "verified": true, "helpfulness": "0/0", "author": "Ziad Al-Banna"}, {"rating": 4.0, "review": "The voice search sucks big time, it only searches for Amazon stuff so you still have to use the keyboard all the time just like the commercial says you don't have to. It would be a more enjoyable user experience if you had more options for non amazon services. They push their own products so hard it kills the user experience more than it should.", "verified": true, "helpfulness": "0/0", "author": "The Dude"}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Joseph Sanchez"}, {"rating": 5.0, "review": "Convenient and affordable.  Cheaper and better than cable.", "verified": true, "helpfulness": "0/0", "author": "William T."}, {"rating": 5.0, "review": "this was a gift for someone else  fedback very positive", "verified": true, "helpfulness": "0/0", "author": "Harold Fox"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 4.0, "review": "I do like this device a lot! I gave 4 stars rather than 5 because there is definitely room for improvements- The kind where you see that a good product could have been great.  The lack of VUDU deserves a deduction all by itself. I have to use flixster to access my UV library and I definitely do not prefer flixster. I do understand this is an Amazon product but it seems like it was made to be totally biased making the Amazon prime features outshine others such as Netflix and Hulu- I paid for the device - so utilize the greatness of this box and make the key features work with all the apps. Why not be able to use voice within an app? I was going to buy a couple more units but due to the room for improvement- I'm guessing Roku will come out with something to compete and not have the bias. So I'm going to wait awhile and see.", "verified": true, "helpfulness": "0/0", "author": "Deb"}]