[{"rating": 1.0, "review": "Totally useless. Not user friendly. Crap. Dont waste your time. I cant think if why google would bother to make this.", "verified": true, "helpfulness": "3/3", "author": "michael hord"}, {"rating": 5.0, "review": "Incredibly easy to set up and use. 1080p perfect HD quality, plus more and more apps are being developed to be used with Chromecast. I would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 3.0, "review": "Chromcast lacks a lot of features other streaming devices have.  It is very limited on what it actually does.  If you do mostly Netflix or YouTube streaming, you will like it.  In fact, Netflix streaming is of higher quality on chromecast than my wired BluRay player with less stops.  I can stream from my phone with better PQ than via a hardwired box!Just to point out once thing it cannot do is stream anything from Google Chrome browser on your iPad to your TV.  Don't make this mistake thinking that it might.Another non feature is that you cannot bluetooth your audio to a different device than your Chromcast is hooked up to.  Your audio MUST go to your HDMI viewing connection (TV or receiver).  This is probably a more obscure limitation than most people will be concerned with.  But if you are using an older receiver without HDMI ports and you have a bluetooth device connected to this receiver, you will have to hope that your TV is capable of passing your HDMI audio back out to your receiver (mine will not) or you are stuck with listening to your audio through your TV's speakers.If your receiver has HDMI inputs and outputs, you just hook your chromcast directly to an empty port on your receiver.  This hookup works fine and is the preferred method for home theater.In short, this can be a great little device if your favorite streaming service is included.  But the vast majority of services are not.  So check this carefully before you buy.", "verified": false, "helpfulness": "0/0", "author": "DVDmike \"DVD Mike\""}, {"rating": 3.0, "review": "I blindly got this as a present for someone.  It works well with Netflix and YouTube, as selected from an iPhone.  And of course, pages from the Chrome browser display on the screen.  I was expecting broader of enabling of streaming apps on the phone to work this ChromeCast, but that is not yet the case.  This was early adoption, but possibly a little too early.", "verified": true, "helpfulness": "0/0", "author": "R. J. Kwan"}, {"rating": 5.0, "review": "It works perfectly! We streamed multiple shows from the laptop to the TV.  It was very easy to connect.  All you do is plug it in and download the app. TCR", "verified": true, "helpfulness": "1/1", "author": "Tiye Ray"}, {"rating": 5.0, "review": "Great product held with all u need to see and control instead of trying to find other way to see", "verified": false, "helpfulness": "1/1", "author": "IFAT EDLIS"}, {"rating": 2.0, "review": "I love the idea of not having to connect my device to my tv every time I want to view something in chrome on a larger screen. The picture and sound are often not synchronized most of the time we use this. They do offer tips to help this, such as upgrading your internet speed or moving your router closer to the device, but that means rewiring for us. We have gaming systems that work fine with our internet speed and router location, so I don't know why chromecast has problems. Be aware that it may not work perfectly, even if other devices do.", "verified": true, "helpfulness": "1/2", "author": "rootie"}, {"rating": 3.0, "review": "Slow load times.. Once it gets going without crashing, it works fine. I have only mastered Netflix so far. I can't seem to get it to connect to anything else.", "verified": true, "helpfulness": "0/0", "author": "Heidi Emerick"}, {"rating": 5.0, "review": "This was a bonus for our movie watching.  We can download Netflix instead of having to wait for the mailman to deliver the movies.", "verified": true, "helpfulness": "0/0", "author": "Ann Urbina"}, {"rating": 5.0, "review": "If you're like me and have one of the older \"smart\" blu ray players that require an ethernet connection which you never got around to hooking up, order this RIGHT NOW. Set up was super easy - 5 minutes or less - and Pandora, Netflix and Youtube have all streamed flawlessly without interruption. I've streamed primarily from my phone & in case you're wondering, you don't have to keep the app open in order for the stream to continue. You can send texts, open a browser or anything else & your movie will continue without pause. You can also set up multiple phones and computers with the ability to cast. While there are enough apps to make it a great deal now, I look forward to the app support for this expanding even further!", "verified": true, "helpfulness": "0/0", "author": "Judson"}]