[{"rating": 4.0, "review": "just not for me but it worked good", "verified": true, "helpfulness": "0/2", "author": "stacy staple"}, {"rating": 5.0, "review": "I'm a dyed in the wool Apple TV user. I have pretty much nailed down everything Apple - it makes life easy when everything is on one platform. This device has made me question everything, here's why...I use Apple TV for: - Hulu Plus - Netflix - Movies, TV on-demand, streaming - Accessing my video libraryFire TV does all of these except access my video library, as it doesn't offer DLNA support. Neither device offers Spotify, which is what I typically use. The huge upside to Fire TV, the interface is easy and FAST. The delay I get on Apple TV drives me crazy, and it's been that way since the first silver colored Apple TVs with the internal hard drives.For a while I'm going to be dependent on Apple TV to access my mpeg4 video library. If Amazon comes up with a DLNA solution and even Spotify, I would consider a move over.Here's the dilemma - the Fire TV is a hardcore Apple TV competitor, and it competes with what Apple TV is now. Apple is 12 months away from a new release which will likely offer improved content and hardware, and a significant overhaul. I'm guessing they will combine the airport express into their set-top-box configuration. When this happens, Amazon and Roku will be playing catch up again. It's the same in the phone world for the most part, although the margin is narrowing!", "verified": true, "helpfulness": "3/3", "author": "J. Pappan"}, {"rating": 4.0, "review": "This is a sleek and power device for streaming. It is easy to navigate, set up, and delivers a wide variety of content.The downside is voice navigation is only for Amazon content and the fact that some of the best viewing must be purchased or is only available for 1st year episodes.If Amazon was to rethink how accessible it's content is and was to update it's navigation functionality, this would meet with 5 star status expectations.All in all, this is one cool gadget that is worth the cost.", "verified": true, "helpfulness": "1/1", "author": "Justin B."}, {"rating": 4.0, "review": "Well, this is basically what I wanted from the Google TV that was released several years ago; a easily hackable console that ran on the TV. When Google released that, they kept claiming they'd release an SDK, and ultimately never did. Amazon delivers a nice development environment out of the box.One awesome feature is that you can directly connect to adb server on the device over wifi without needing a long USB running from your desktop / laptop to the device. Coupled with the fact the device is always powered (so no fear of finding the thing uncharged after leaving it alone for a few days), it's one of the nicest Android development experiences I've had (I really hate USB cables). The only draw back is that it seems that at the moment, the SDK does not give you direct access to the raw audio stream of the microphone.As for the typical use case (watching videos) this works really well. Note the Instant Video may not work as advertised, but if it doesn't, it's because of your Internet Provider. I had Comcast, and after switching to a local internet Provider (Yay condo internet) the Instant Video worked amazingly well. It actually had the problem that it was too fast; audio would start half a second before the video (mostly only noticeable when resuming a video from the carousel).", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was about as easy as it could be to set up.  Used HDMI cable I already had to connect to my Sony Bravia.  Pretty much instantly, when you put batteries in the remote, it talks to you and you setup your wifi.  You need your password.  I already have Prime so it just automatically had my Watch List and movies I was watching saved.  Brain Dead easy.  And the picture is fabulous with this.  No buffering time.  Use with Netflix, too.  You will love it.", "verified": true, "helpfulness": "3/3", "author": "Sashin"}, {"rating": 5.0, "review": "Makes having Amazon Prime TV so much easier. Its so easy my MOM works it.... LOL!!!", "verified": true, "helpfulness": "1/1", "author": "Rebecca B"}, {"rating": 5.0, "review": "This is the best-made streaming media device on the market!  Forget about Apple!  The care they take in optimizing the \"out-of-box\" experience is mind-blowing.  I own several streaming media devices, but since I bought this one, I sold the rest of mine on eBay!  This is the easiest to use, the menus are laid out in a way that makes sense.  The voice-activated search is incredible!!Amazon, if you are out there listening:  First of all, great job guys!  You are killing it!!  But I do have some suggestions.  First of all, find a way to make the search function work with Apps.  Second of all, why not sell a wireless keyboard, and allow someone to shop on Amazon???", "verified": true, "helpfulness": "0/0", "author": "terrell hull"}, {"rating": 5.0, "review": "I thought my AppleTV and SmartTV were the bees knees, until I decided to save money and stick with my existing TV but augment it with the FireTV. I', glad I did. It's has worked like a charm since I plugged it in and typed in my password. (Very clever that my name was already programmed in.) Love it so far. Wonder how I lived without it. Pluses: box stays cool unlike AppleTV and programming is easier to access than with the so-called SmartTV.", "verified": true, "helpfulness": "2/2", "author": "KateontheCoast"}, {"rating": 5.0, "review": "So far I love it.  Just got it today.  This is the first plug and play electronic device that was really plug and play. Set up?  What set up?  That's how it felt.  The voice search DOES actually work just as the other reviews said.  It is also so small, I was pleased and surprised.  NOW, I will see what it's like to use it for at least a month and then update my review.", "verified": true, "helpfulness": "2/2", "author": "cinanim \"B. Smith\""}, {"rating": 5.0, "review": "I've owned my Fire TV for a few weeks and I won't go back to navigating online apps through my blu-ray player.The Pros:- The unit is fast, much faster than my blu-ray player utilizing the same internet connection. Shows load faster.- The unit it tiny. Most people would never even notice the box sitting beside my TV.- The interface is very intuitive.- The remote is so simple, reminds me of a wii remote but smaller. No excessive buttons.- The voice search works great for amazon.- Both the wired and wireless internet connections work flawlessly.The Cons:- The voice search needs to work across all applications, especially Netflix.- Need to more easily distinguish or be able to select for it to only display amazon prime streaming shows, without all the purchase options.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}]