[{"rating": 3.0, "review": "Netflix and recorded youtube video streams work perfect on Chromecast. Setup itself is very easy and one can keep adding devices that you can cast from as long as they have google chrome on them. But the biggest downer for me was lack of integration with Amazon Instant Videos. There is a hack to uninstall silverlight and force AIV to use Flash but that experimental cast is extremely annoying. It disconnects every now and then and its annoying to see the video run on both your device and TV and many times TV frames are few fraction seconds behind. Same with live stream from youtube videos. I was so prepared to cast a live cricket game and was completely turned off by its unresponsiveness. Overall I regret not buying a Roku player instead.", "verified": true, "helpfulness": "0/0", "author": "AK"}, {"rating": 1.0, "review": "I was under the impression that I could plug this into my TV quickly, easily, and have access to all my Internet stuff.  I have an older DLP HDTV, so it's becoming more trouble than it's worth!  Very frustrating, it took time and research to figure out, it won't play on my TV without another $40 adapter!  I would not suggested it for people who are not good with technology, or don't have someone to help them.  Also not so great for us seniors who are on limited budget!Anita", "verified": true, "helpfulness": "1/2", "author": "A. J."}, {"rating": 1.0, "review": "Let me know if the class action suit gets rolling. I am a fan of Google, but this device way supposed to allow me to cast anything from Chrome to the TV. Not the case. You tube and netflix?  I do not want to post my videos on YouTube and NetFlix lame, and another monthly fee.I am significantly disappointed but more than anything it will make me question a future purchase of Google products if they continue with this : sell it one way and then mandatory update it to strip it of its great functions ... I bet there is another product coming to sell those features back to the public.That is just plain criminal!", "verified": false, "helpfulness": "1/5", "author": "Darrell DeShaw"}, {"rating": 5.0, "review": "Easy to use, great option for getting rid of cable and more streaming options should be available soon.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Jorge Fernandez"}, {"rating": 3.0, "review": "I like that I am able to use the device to stream HBO content (YouTube & NetFlix) that I'm watching on my phone or laptop to a television screen. However, the sells and ratings will increase, once the streaming capabilities increase - add more providers; Showtime, STARZ, Cinemax and allow the user to include the personal videos saved to their phone and computer.", "verified": true, "helpfulness": "0/0", "author": "Chrystal \"The Writer\""}, {"rating": 5.0, "review": "Very easy to use. Now I can watch nbc shows that I missed when they lost.their contract.with dish. I had tried plexus, YouTube and lots of other ways to watch the shows.on my smart tv.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to set up and can be used with PC, or smartphone. Portable so can be taken from one tv to another", "verified": true, "helpfulness": "0/0", "author": "Inder Pahwa \"I.D. Pahwa\""}, {"rating": 5.0, "review": "Works as advertised. It turned my \"dumb\" HDTV into a smartie. Chromecast easily streams Youtube, Netfix, HuluPlus and HBO GO programs to my 3-year-old TV using my iPhone & iPad as controllers.", "verified": true, "helpfulness": "0/0", "author": "David Larimer \"Weather wizard\""}, {"rating": 5.0, "review": "Easy set up, but be patient as it takes a while to tune in to the wireless signal.  Excellent picture and ease of use.  So glad I have it.  I am \"casting\" (aka streaming) Netflix, You Tube and soon, Hulu, with great results.", "verified": true, "helpfulness": "0/0", "author": "Sushi \"Sushi\""}, {"rating": 1.0, "review": "Easy to setup - ALMOST. During synch process I got an error message. It re- synced and the error message reappeared. Apparently my Netgear R6300 needs to be modified to work with Chromecast (along with a slew of other routers). When I went to my router I could not figure out how to modify it at all. Net gear c/s was non-existent so Chromecast now only acts as a wallpaper for my 55 inch TV. I will buy Apple TV as I know it will work. Waste of time & money.Bernie NessToledo, OH", "verified": false, "helpfulness": "2/3", "author": "Bernard J Ness"}]