[{"rating": 5.0, "review": "Great product!!!!", "verified": true, "helpfulness": "0/0", "author": "Larry Parker"}, {"rating": 4.0, "review": "The hardware specs and performance of the Fire TV are great. It has very fast input response, the voice recognition performance is highly accurate and the streaming picture quality is top notch.  But I rated it 4 stars instead of 5 because I feel the UI and limiting the voice search only to Amazon offerings (and Vevo) is somewhat disappointing.  In comparison to the Roku 3, a major competitor and the other streaming box I own, it falls just slightly behind.User Interface (UI): Amazon builds the UI around the Amazon offerings.  It appears similar to the Netflix app appearance with category headers then program icons in a horizontal row.  If you prefer this then this is the box for you.  I don't think this is the most efficient design primarily because the apps are also presented in this fashion.  So Netflix, YouTube, Hulu, etc. apps are in this singular horizontal row.  The sequence of app icons changes (perhaps by last played or most hours used?).  I like Amazon's streaming service and I understand that they want to push their offerings but I use this box for content that I want which is not always from Amazon. For me, I prefer Roku's interface. All they display are the channel apps arranged in the order you prefer.  Very simple and clean with more on-screen real estate for selecting a content provider rather that content from one provider with minimal space for finding other channels.  There are no lists until you are in the actual app/channel where you want to see lists.  Yes, this is somewhat minor and Roku does this because they do not have a vested interest in any content(mostly) so they can focus on a cleaner design.  To be fair, Roku does have a large space on the side to highlight a particular show or movie but I never notice it, much like a banner ad and the main interface is centered.  As conformation in my family, my very non-tech parents find the the Roku interface much less confusing and simple to navigate.Hardware: Roku 3 specs are inferior to Amazon's Fire TV and there is a slight performance difference but so slight that it's not readily apparent and not a selling point to me.  Compare the Fire TV to an earlier Roku model and yes that difference is significant and one where despite the significant lower price of older Rokus, I would opt for the Fire TV without hesitation.  The other major difference here is Fire TV offers voice search, Roku 3 offers a headphone jack on the remote for silent nearly-wireless listening.  For my use, the headphone option is much more desirable.  To add to this, Fire TV voice search does not search all the content provider libraries, just Amazon's and a few others (at least not now).  So if a movie is only available on Netflix, you wont find it through voice search.  If they opened it up to be more Siri-like or perhaps more like what I imagine the new Amazon Echo will be like, then they would have something truly useful which would also overcome their UI design.Both Fire TV and Roku 3 have game apps.  It appears Fire TV would be more robust in this area because of its superior processor and option for a fully dedicated game controller. I believe there are more gaming apps available for the Fire TV as well. Although I play video games, I don't use these streaming boxes for that so I can't comment more.So, my perfect streaming box would be a Fire TV with FULL voice search and a headphone jack.", "verified": true, "helpfulness": "0/0", "author": "Binkers"}, {"rating": 4.0, "review": "It's ok it has good movies wifi", "verified": true, "helpfulness": "0/0", "author": "None"}, {"rating": 5.0, "review": "Purchased this device at Best Buy and totally in love with it. Own a Google Chromecast as well but wanted something so I can take advantage of my Prime membership. Love the voice search, so accurate and fast for finding what I want to watch on Prime. I totally recommend this product, it's really great and awesome.", "verified": false, "helpfulness": "0/0", "author": "jhdezjr"}, {"rating": 5.0, "review": "I use it for xbmc. Fast, easy installation.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Morten L."}, {"rating": 1.0, "review": "I will be returning the Fire TV tomorrow. I've had the Fire TV for 12 days now. The remote has died 5X since then. There must be a short in it. I don't know. The unit itself works fine. I've called customer service 3X & 3X they have promised to submit a replacement order for my remote. But they never do. Today I got an email to call them. They need more info. Really? I have given them my name, address, account #s twice already. So I call. They don't have a record of the previous 2 requests. But not to worry! They will resubmit again!  Enough! 10 batteries & 3 phone calls later it is more trouble than it is worth. Amazon: your Fire TV customer service is AWFUL!", "verified": true, "helpfulness": "1/1", "author": "Kevin J. Downing"}, {"rating": 4.0, "review": "Pretty great. I wish there were a more accessible android typical home screen/ui. I'd like to be able to run a browser.", "verified": true, "helpfulness": "0/0", "author": "Mdeezy"}, {"rating": 5.0, "review": "I LOVE my Fire TV!!! GET IT GET IT GET IT!!! Cable/satellite is EXTREMELY EXORBITANT & thanks to Amazon and other boxes similar NOW OBSOLETE!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kellaneese Parker"}, {"rating": 5.0, "review": "Fire is everything  that is  promise. This is a fantastic  addiction to electronics  bravo amazon  five star rating.  The bad news.  One star rating for prime movies.  The cost of movies outside  of  prime. Is  pitiful  and unfounded  l have  found movies  dated over five years old or older  with rental fees as . High as $12.,95  fortunately I have netflix. Where I can get the  same movie  free.  I have found  this to be true 90 percent", "verified": true, "helpfulness": "0/0", "author": "SJ"}, {"rating": 5.0, "review": "It works great, especially as a prime member, and I'm a non-techie and had no trouble in connecting.  The instructions are very clear.", "verified": true, "helpfulness": "0/0", "author": "BJ"}]