[{"rating": 5.0, "review": "Easy to hook up. Easy to use. Lots of things to watch.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I had a similar device that just gathered dust because it was so slow and clunky, but I decided to give Fire TV a try and I am very glad I did! It is fast and easy to use and has great content that is being added to frequently. I love it! Now I am unchained from having to slog through those damnable commercials. I only go to that part of the channel lineup now when I want to see local news. Ahhhhh.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Anderson"}, {"rating": 5.0, "review": "Great Product.  It works good with the Prime Membership.  I have Netflix and the movies are good with that too.  It was easy to install as well.", "verified": true, "helpfulness": "0/0", "author": "Marshall1"}, {"rating": 5.0, "review": "Forget the ROKU, APPLE TV, and GOOGLE CHROMECAST. The FIRE TV is amazing!!! ROKU burnt out on me after 12 months, APPLE TV is limited and the WIFI is horrible, and CHROMECAST just seems like too much work. The OS is amazing and WIFI never drops like the others. Amazing I can talk to the remote and it never messes up a search. Overall, the FIRE TV exceeded my expectations.", "verified": true, "helpfulness": "0/0", "author": "Delfino"}, {"rating": 5.0, "review": "Having fun learning how to use our Amazon Fire TV.  Easy set up and use instructions.  The variety of movies and old T.V. shows right at our fingertips is great. Much to discover yet with the variety of  channels and offerings.  Being a Amazon Prime member is definitely a plus. Highly recommend Amazon Fire T.V.", "verified": true, "helpfulness": "0/0", "author": "Linda S. \"Linny\""}, {"rating": 5.0, "review": "I owned an Apple TV since it was first released.  I became an Amazon prime member 2 years ago and have since been a loyal customer of Amazon.  I bought the Amazon fire so my parents could stream my daughters shows for her when they had her.  The Fire well exceeded expectations. It is a lot easier to use then my Apple TV and they had it programmed to my Amazon account when I received it.  I am going to purchase another one for my home soon that is how happy I am with this product", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "Since I have been a prime customer for years I decided to purchase fire TV instead of the competition because of the I like the option of having the extra shows and movies.  I am really pleased with my purchase because I am able to access my netflix and pandora on the platform.  There are a lot of shows that can be purchased but I haven't purchased any.  There are also games available that can be played with the remote.  I like Amazon fire TV so much that I have also purchased the fire stick for my other TV.", "verified": true, "helpfulness": "0/0", "author": "M. B \"MN\""}, {"rating": 5.0, "review": "Great device.  Easy to use", "verified": true, "helpfulness": "0/0", "author": "Loretta Kenyon"}, {"rating": 4.0, "review": "It's OK", "verified": true, "helpfulness": "0/1", "author": "Gene Noble"}, {"rating": 5.0, "review": "love the voice command!!", "verified": true, "helpfulness": "0/0", "author": "Chad O Stern"}]