[{"rating": 2.0, "review": "Didn't allow Netflix. Returned item", "verified": true, "helpfulness": "0/7", "author": "b.h.l."}, {"rating": 5.0, "review": "I love my new Amazon Fire TV. It was better than I expected.", "verified": true, "helpfulness": "0/0", "author": "carol"}, {"rating": 4.0, "review": "Bought this unit as a gift along with an Apple TV; it was an either or gift, they selected the Apple TV so I kept the Fire TV. Plugged it in today and it didn't work. So I called Amazon and described the lights I was seeing on the unit and Amazon Tech support said it was a malfunctioning unit and it needed replaced. The unit never fired up and never connected to the TV. So they said a new unit would ship on Dec 29th (today is the 26th) and I would receive on the 31st. Cannot believe the unit completely did not work and that I have to wait a full week before I get a replacement. I'm a big user of Amazon Prime and I'm very disappointed in this quality control issue. And I'm frustrated with the time I spent to setup, re-setup, trouble shoot, call tech support, and then a 5-day wait for a replacement unit. Very unhappy customer...<<UPDATE>> Amazon delivered the replacement unit much sooner than they said, which was very nice. Still had some quirky interface with my TV during setup, and still battle Netflix loading at times, but all in all, a very nice device. We have Apple TV, Roku and now Amazon Fire TV in the house now. Not sure which is best. I like the Apple TV, but it doesn't cover Amazon Prime and that stinks. The Rokus are very dependable and easy. And I'm warming up to the Fire TV. Time will tell...", "verified": true, "helpfulness": "2/10", "author": "Stephen Offner"}, {"rating": 3.0, "review": "The fire is generally a good viewing device and is more powerful than the ROKU 2 it replaced but it does have its problems. I was hoping the issues would be resolved with software updates but the issues still remain. The first issue is the screensaver. When I wake up Fire by pressing any button it sends something through the HDMI that changes input mode on my TV. After playing Pandora for a while and then switch to Netflix first Pandora keeps playing after switching to home and even when I'm in Netflix and won't stop until I've started something. Netflix was having some audio issues as a result so some movies would either have clicking sounds or no sound at all. Pulling the power briefly didn't solve the problem. I finally pulled the power for 10 minutes and that got Fire working better. The Netflix app disappeared twice forcing me to re-install it and two other times I needed to reenter my user/pass. The voice search works great but only for Amazon pay per view stuff and doesn't work for Netflix. It's a shame this wasn't designed and tested better before rushing it to market and then not updating it with the fixes it desperately needs", "verified": true, "helpfulness": "1/5", "author": "Earth bound misfit"}, {"rating": 5.0, "review": "I've had both Apple TV and Fire TV, and give Fire TV a clear edge.My favorite feature is the Plex integration. I preserve all my digital media on Plex for use across screens/devices. The Fire TV has been the best solution yet to stream that media across my screens at home. Taken together with Prime support, the Plex integration really sets the FIre TV apart from the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "A.Massara"}, {"rating": 4.0, "review": "As with others who have reviewed this, I think for a first device, it is good but needs to have a few revisions.1. Voice Search, should be available for all apps on the device.2.  Either open the apps to Google Play Store or, allow side loading/Amazon App store for already owned apps.3.  Allow Flinging from your phone/tablet (non-Fire versions) or computer.4. Allow DVR recording through the Fire TV.  This would be a huge step over my Tablo TV DVR, as I can only watch over my tablets, computers, or fling through Chromecast, which is stuttering/always loading, as it uses twice the band-width to send to tablet then back to the TV.5.  Simplify the home page to allow favorite apps on it, such as on the kindles.6. I had to completely set up and download apps to each device.  Since both came assigned to my Amazon Prime account, why doesn't it download apps to each one automatically?", "verified": true, "helpfulness": "1/1", "author": "Ed Stuteville \"Ed\""}, {"rating": 5.0, "review": "Easy set up, lots of movies to choose from. (Much easier than the Roku to set up and navigate).", "verified": true, "helpfulness": "0/0", "author": "animaliar \"Pastelist\""}, {"rating": 1.0, "review": "Drops wifi connectivity CONSTANTLY!Remote works about 15% of the time for every selection I try to make. Imagine putting in a long wifi PIN number. Out the box, my FireTV was already paired with 2 remotes. Where is this other remote? Clearly, this was a FireTV that was returned by another user, and then sent to me. Very unhappy.", "verified": true, "helpfulness": "2/6", "author": "Erica Lee \"Tigress\""}, {"rating": 1.0, "review": "didn't work at all.", "verified": true, "helpfulness": "1/7", "author": "Michael H. Warchol \"Cap'n Snore\""}, {"rating": 2.0, "review": "Wait for it to go on sale, not worth 99 plus all the aggravation.  Once I got a working unit I love it it.  2 out of 4 received were defective.  The first unit wouldn't load at all.  After 15 minutes of online chat & 30 minutes of phone support they sent me 2 replacements.  One worked & I contacted Amazon to purchase the second for my Mom for Christmas.  Plugged it in & it would not progress beyond the welcome tutorial & the video resolution was poor.  The 4th replacement did work.  Dolby surround sound does not function as well as streaming from my laptop & the video quality is also not as good.  Large areas on the screen of only a slightly varied color does not look correct.  Unless Amazon does some serious work on Quality control, order at least 3 & send the extra defective ones back.  That all being said, I like the unit but it is not nearly as good as I expected.", "verified": true, "helpfulness": "0/5", "author": "Ferenc"}]