[{"rating": 5.0, "review": "Works great, even this non technical person can do some pretty cool things. I love streaming YouTube to my TV.Best $35 I have ever spent!", "verified": true, "helpfulness": "0/0", "author": "Paul Meredith"}, {"rating": 5.0, "review": "I've got two Google Chromecast Streamers. I've had no problems with either unit. I wish there was more than Netflix and YouTube to choose from, but for the price and simplicity, I'm very satisfied. I was a good investment.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The reason I bought this was to stream the internet to our tv.  This item was not bought to stream Netflix to our tv, so I did not try out this feature.  Streaming the internet was the main reason, which you have to have the Google Chrome browser, then the Chromecast app to stream.  It does work, but is very \"blocky\" and slow, but this is still the beta version for streaming \"all\" internet content.  As I stated, I did not try to stream Netflix, our dvd player does that.  My wife likes to watch internet tv, since we no longer have cable, and she now must connect a HDMI cable from her laptop to the tv in order to \"stream\" internet tv to our tv.", "verified": true, "helpfulness": "0/0", "author": "dadd75 \"dadd75\""}, {"rating": 4.0, "review": "This is a great device surfacing and entertainment. It works well with youtube and netflx on android with chrome extension. Would of been nice if I could also cast MS applications excel and word while working.", "verified": true, "helpfulness": "0/0", "author": "Dave Mungal"}, {"rating": 5.0, "review": "It does what it needs and Avia opens this thing up.  My biggest concern was streaming local content, and I will say Avia made it a bit easier for me.  Netflix works good, but havent tested much else.  The fact that it hides behing mide TV and can control with my phone or tablet makes it that much better.  Google, hurry up and get some amazon support and open this thing up.", "verified": true, "helpfulness": "0/0", "author": "R. Goodson"}, {"rating": 3.0, "review": "The simplicity of Google Chromecast is not exactly what it appears to be...at least not for me.It would not work at all without using the Google Chrome Browser, and will not broadcast everything on my laptop.While I am not a techi, it took me several hours to get it to work.  I did not purchase it to stream videos or music...but to use it at another home where we only have acess to several stations with  antennae TV...and use my laptop to watch Morning Joe and several other programs live. I still have not been able to streamMorning Joe from that site.", "verified": true, "helpfulness": "0/0", "author": "AA"}, {"rating": 3.0, "review": "Good for Netflix only. Cast from my IPhone or computer to my TV. Ads show it casting TV shows. But Netflix connection is good", "verified": true, "helpfulness": "0/0", "author": "Jo"}, {"rating": 1.0, "review": "I hooked this up with my MacBook Pro. If you're just going to stream videos from YouTube and have a Netflix account, this is for you - as long as you don't mind lagging videos. Quick solution? Adjust the settings so you can see the videos with LESS lag in 480p (that looks soooo good on HD TVs - sarcasm intended). I don't have a Netflix account - I have an Amazon Prime account (and with it Prime video) so no need for Netflix. (Speaking of Amazon Prime Instant Video, let's get with the HD streaming on Mac, Amazon!) so the only thing I can really use this for is YouTube videos.I have an Apple TV on a separate TV and that streams flawlessly and there are no limitation; if I can see it on my computer, I can see it on the TV - anything and everything (pics, videos, music, Office, anything).Pros:Cool pictures on the screensaver!Relatively inexpensiveCons:Limited uses (YouTube and apparently NetFlix work)Lagging videosIt's waste of money.", "verified": false, "helpfulness": "1/2", "author": "R. Jones"}, {"rating": 3.0, "review": "Appearance is fine. but i think it is not so useful. I may use this again, if google do update more app for chromecast.", "verified": true, "helpfulness": "0/0", "author": "Hyegyung"}, {"rating": 5.0, "review": "more than what i expected at the price, the very next day i bought it, streaming local media via plex was announced.", "verified": true, "helpfulness": "0/0", "author": "srinivas"}]