[{"rating": 5.0, "review": "I was surprised at how small this thing reallly was and more surprised when all I had to do was plug in the power cord & HDMI cord turn on the TV and I was watching prime movies 1 min later.  The voice commands work great, I couldn't be happier.", "verified": true, "helpfulness": "1/1", "author": "Michelle H."}, {"rating": 5.0, "review": "If you had an xbox or DVD player to access Netflix or any other apps, with Amazon fire you will see a difference quickly . This unit is faster and very easy to set up to accommodate your needs. The remote control with voice control is easy access to watch your favorite  Movies or television shows within a flash. At the present time I do not have Amazon Prime but in the future I will purchase when a saving is advertised.", "verified": true, "helpfulness": "0/0", "author": "BOBD"}, {"rating": 5.0, "review": "The setup of the Fire TV was very simple and going through all the menus is also easy to use.", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 2.0, "review": "I have Amazon Prime and Netflix, yet there is no easy way to prevent the kids from only watching those movies/shows.  Got hit for 10 bucks as they flipped through the kids shows.....", "verified": true, "helpfulness": "3/5", "author": "Bill Tolbert"}, {"rating": 5.0, "review": "Fast boot time from standby, easy to hookup, and even the remote feels nice in your hand. Has all the apps I need right now and the forthcoming update to voice search other apps other than Amazon Video is nice. My only complaint, not enough Gary Busey!", "verified": true, "helpfulness": "1/1", "author": "Kevin l."}, {"rating": 5.0, "review": "A wonderful tool to make streaming easier. Finally we get subtitles on Prime. Also 5.1 sound. I love voice  search. We have Chromecast which is good, but it doesn't support Prime. If you're a streamer and you want the best unit, this is it. I have heard there are problems with gaming, but that's not my thing. Good job Amazon.", "verified": true, "helpfulness": "1/1", "author": "Julie M.Gettys"}, {"rating": 3.0, "review": "If you have a lot of Prime moves then this is GREAT. However if you are like me who bought a lot of DVDs or Itunes movies you are not going to enjoy this as much.I cannot up load some of my favorites to the 'Cloud' as they are too large. That means I will have to add them via an attached hard drive IF that works. I admit that I have not tried that yet but I will be doing that soon. I now need to buy an External Hard drive to see if this will work, ugh.Several times now, I've had an issue where I click on Netflix to start the app and the box freezes on a bright white screen. I figured out that I cannot let it go to \"sleep\" with Netflix app running. As long as I back all the way out and then turn off the TV I have no issues.Also, the one great selling point was the voice search feature, right, it works great but only on Amazon content. What if you want to search anything else?? Well you can't and it brings you back to amazon if you try...They really need to rethink this one. My roku was much better.", "verified": true, "helpfulness": "1/1", "author": "Brandi Solomon"}, {"rating": 5.0, "review": "We recently cut the cord on cable and went with this. We love it. It is really fast. We also subscribed to Netflix. I have amazon prime, but found it difficult to find much free content on amazon prime streaming with the fire tv. This is the only con in my opinion. The voice search is nice, but most shows or movies I've searched cost money on amazon and are free on netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We just received ours, plugged it in connected it to the TV with an HDMI cable(not included) and entered our wifi password. Then we were ready to watch as it already came set up with my Prime membership information. We have enjoyed it so far. I am looking forward to some search improvements to be able to search across different media and not to have to search each application separately. I love the voice search capability. Can not wait to see what the future will bring, but a Great beginning!", "verified": true, "helpfulness": "0/0", "author": "Susan P. Rowan"}, {"rating": 3.0, "review": "Reallty Fast, the only problem is that AMAZON do not want to sell the CONTROLLER to my area. Weird because they sold me the console.", "verified": true, "helpfulness": "1/1", "author": "Rafael Perez"}]