[{"rating": 4.0, "review": "When I bought this I did not realize it would only send Chrome to the TV. I guess I should have known that. But I expected I could project everything on my computer. In that respect it is disappointing, but if I had read the fine print before buying I would have understood. For what it does, it's excellent.", "verified": true, "helpfulness": "0/0", "author": "G. Davids"}, {"rating": 1.0, "review": "We got this so we could stream netflix in our bedroom, and it doesn't work with any of our apple products (already have the apple tv for streaming in living room).  It's NOT like you just plug the little usb (as pictured) into the port and voila, as you would think.  It comes with a bunch of other cords.  Very dissapointed, had to send it back.", "verified": true, "helpfulness": "0/2", "author": "Sarah Culkin"}, {"rating": 5.0, "review": "Everyhing you imagine it could be and more.  Run, do not walk, to your computer to buy one, now! Wooo", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is AWESOME! It work...it just works. Plus I'm seeing the little Chromecast logo on more and more things.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 3.0, "review": "In theory. this is great!  For what services it provides, it does pretty well, though the connection is so determined by the computer's functioning, there are drawbacks.My greatest disappointment is that it does not simply project everything on Google Chrome.  I already own a BluRay player that connects to Netflix and YouTube.  I wanted a streaming product so I can watch Amazon Prime, but the Prime player does not work through this product, which seems nonsensical.  I plan to keep it and wait for the software to work, but it is very frustrating.", "verified": true, "helpfulness": "0/0", "author": "J. Hirsch"}, {"rating": 5.0, "review": "Able to broadcast my computer screen onto my TV with any cables. The connection is very good, and the images are very sharp.", "verified": true, "helpfulness": "0/0", "author": "kkfgeo"}, {"rating": 3.0, "review": "For simplicity, this can't be beat. If your a Netflix, Hulu plus or hbogo user, it's a great streaming device. If your looking for a thousand channels, not so much. Being able to stream from the chrome web browser is a huge plus. Make sure you have a strong wifi signal to get the most out of this device.  This is especially true for picture quality.", "verified": true, "helpfulness": "0/0", "author": "Marc E"}, {"rating": 5.0, "review": "Absolutely nothing to complain about.  Does exactly what it's touted to do.  Streams video from Netflix and YouTube perfectly.  No delay, no dropped pixels.  Nice clear high def picture.  Hard to believe they only charge $35 for it.  Would definitely recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Eugene Artemyeff \"astroarchitect\""}, {"rating": 4.0, "review": "This is really cool I just wish it wasn't limited to just Hulu, netflix and allow anything to be broadcasted to it but other than that it is a very cool way to make older hdtv's have internet access.", "verified": true, "helpfulness": "0/0", "author": "Reggie A. Burgess"}, {"rating": 5.0, "review": "I love this!! Puts my laziness to another level I just wish it works with other internet watching connections besides you tube and netflix.", "verified": true, "helpfulness": "0/0", "author": "Omatola Gordon"}]