[{"rating": 3.0, "review": "Not bad. Has potential. I have both Chromecast and Roku. It's easy to stream video from your computer to your tv. The video quality is great but I've had problems syncing audio with the video. In terms of apps, they are relatively limited for Chromecast.", "verified": true, "helpfulness": "0/0", "author": "John Scott \"John\""}, {"rating": 5.0, "review": "Cheap streaming! Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Fred Ogle \"M3g4d37h\""}, {"rating": 5.0, "review": "Great purchase experience, thanks!!!", "verified": true, "helpfulness": "0/0", "author": "MAURICIO RESTREPO MEJIA"}, {"rating": 1.0, "review": "Very disappointed in this product.  And yet, I was so excited about using the Google Chromecast and I'm having nothing but problems.  I can never find it from my computer and after each use, I have to unplug the dongle as a type of reboot, but even then, my computer is only finding it one out of every 3 tries.  After one disappointing week, It's now in a drawer and I don't use it.  When I did use it, I experienced long buffering issues and the audio was often out of sync with the picture.  I wish I could return it for a refund, or a credit for something else.  I rarely complain, so this is obviously a fail in my books.", "verified": true, "helpfulness": "0/1", "author": "D.E. Schmeichel"}, {"rating": 1.0, "review": "NOT INSISTENCE FOR GOOGLE", "verified": true, "helpfulness": "0/4", "author": "EduardCuba"}, {"rating": 5.0, "review": "I almost use this exclusively. Netflix is fantastic on this device, being able to cast browsers, youtube and various other apps to the tv has been great. It was a product I wasn't sure how I'd use and this is now the second one I ordered for the house.", "verified": true, "helpfulness": "0/0", "author": "D. Viti"}, {"rating": 5.0, "review": "Outstanding. Has saved me hundreds of dollars.", "verified": true, "helpfulness": "0/0", "author": "Robert H."}, {"rating": 5.0, "review": "This is a great little device. I have used it from both my PC and my Android devices. It works very well.", "verified": true, "helpfulness": "0/0", "author": "RJGadgets"}, {"rating": 4.0, "review": "Works great as advertised.  We got rid of DirecTV and have Amazon Prime and Chromecast, with Netflix now.  Buyer beware, though, its cheap and ours died exactly one year and 10 days after purchase so no warranty :(", "verified": false, "helpfulness": "0/0", "author": "Johnathan M. Kent"}, {"rating": 4.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Eric B"}]