[{"rating": 4.0, "review": "No complaints, great product", "verified": true, "helpfulness": "0/0", "author": "Mrs Norman"}, {"rating": 2.0, "review": "This simply did not work well.  I'm a technology type of guy, so it wasn't user error.  This was attached to our television about 30 feet away from the router in the same room, and it just didn't work well at all.  The app didn't work great, the connection was unsteady, etc.  We mainly use it for Netflix, and it was a poor experience.I sent this back and bought a Samsung Blu-ray player that doubles as a wifi spot to use Netflix, Pandora, and YouTube, and it works fine (from the same location where the Chromecast was).", "verified": true, "helpfulness": "0/0", "author": "B. Travis"}, {"rating": 4.0, "review": "Came in the other day and was a breeze to set up. My choice came down to this vs the fire tv stick and I picked this one due to excellent reviews and the lower price. It works good just wish it had its own remote instead of using the phone all the time. I guess for me the stick would've been a little better but I'm happy with this for now.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Wilhelm"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "I love my google chromecast! My husband and I have cut our cable off and haven't missed it since. With our chromecast we pull off everything we want to watch on the internet and it quickly and easily streams on to our tv. LOVE LOVE LOVE google chromecast!", "verified": true, "helpfulness": "0/0", "author": "Vivian"}, {"rating": 5.0, "review": "Nice cheap way to watch netflix and hulu plus", "verified": true, "helpfulness": "0/0", "author": "Alexandra"}, {"rating": 2.0, "review": "Very disappointed in this. Extremely difficult to get it to work, no instructions added. Sorry I bought it.", "verified": true, "helpfulness": "0/0", "author": "Mrs. Muir \"country girl\""}, {"rating": 2.0, "review": "Maybe it works just fine. I don't know. found it to have inadequate, incomplete, incomprehensible instructions. Its still sitting on my shelf.", "verified": true, "helpfulness": "0/0", "author": "Pokiok Pete \".....\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Barbara Ballard"}, {"rating": 4.0, "review": "The Last one becouse its just give a YouTube on chrome noy open in regular intern", "verified": true, "helpfulness": "0/1", "author": "Mohammad Saleh Almakki"}]