[{"rating": 5.0, "review": "I am so glad I bought this!  Great interface.  FAST!  Although you have to pay extra, you can access Netflicks, Hulu Plus, etc...  The voice search is great, but only works when searching prime videos.  In addition to videos, you can access your prime music and apps.  I am very pleased with it and definitely recommend purchasing if you have a prime membership.", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 5.0, "review": "Works great. Finally cutting the cable cord.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not all I thought it would be. It has buffering issues even though I have 50mb xfinity.apps freeze and have issues plus you have very limited apps to choose from. Screen mirroring sucks, the USB port isn't even for flash or viewing personal files, the music page only works with amazon purchased music.", "verified": true, "helpfulness": "0/1", "author": "Seth Magee"}, {"rating": 2.0, "review": "I was really excited about getting this for watching Showtime, but they have no link for Comcast/Xfinity which makes it almost worthless to me. Hope they fix this issue, They have a ton of other provider links Why they don't have a national provider, (they have ATT) doesn't make sense.", "verified": true, "helpfulness": "0/3", "author": "Anthony Morabito"}, {"rating": 2.0, "review": "The product has one major flaw in my opinion. AMAZON MOVIES AND TV SHOWS ARE MORE EXPENSIVE USING THE FIRE TV THAN IF YOU USED THE ROKU. The roku has an option of watching programming in standard definition. The Fire TV should give the option to watch in Standard Def like the ROKU does so you get the cheaper rental price. However, if you don't mind paying a dollar more per rental using the Fire TV than this is a great product. It loads and streams very quickly and the screen saver photos are a nice touch. But, I'm not willing to spend 1 dollar more per rental just so I can watch in HD. This item will be returned and the ROKU will be bought in its place. Its a disappointment because I have had nothing but terrific experiences from Amazon in the past. I just don't understand why amazon would allow ROKU to have the cheaper rental option and not their own fire TV.", "verified": true, "helpfulness": "0/3", "author": "GoDawgs"}, {"rating": 5.0, "review": "Easy to install and works as advertised.", "verified": true, "helpfulness": "0/1", "author": "Geary Cunningham"}, {"rating": 5.0, "review": "This is awesome. It's better than Roku.  Voice search rocks.I've had a Roku and a Roku 2. Both were ok, but Amazon Fire TV has stepped it up.  You may think the voice search sounds gimmicky, but it's much easier than punching in letters one by one.Also the streaming is faster and the wireless network connection is more reliable than Roku.", "verified": true, "helpfulness": "1/1", "author": "SuperSkerple"}, {"rating": 5.0, "review": "If you are a Prime member, this little black box will be the best toy in your home theater!  I had it up and running in no time at all, and started watching The Sopranos; I forgot just how talented James really was.  I live in a Canyon in Wyoming, and it's so cool to be able to listen to music from FOG in San Francisco or KBPI in Denver, or classic cartoons, or a movie I wanted to see.  There is so much free content I was surprised, thank you Amazon.  Why wouldn't you want one of these?", "verified": true, "helpfulness": "0/0", "author": "Michael J. Balog"}, {"rating": 4.0, "review": "so far this is a very nice product. I would have given it 5 stars if there were mail/browser apps released for it.", "verified": true, "helpfulness": "0/1", "author": "David Hanna"}, {"rating": 5.0, "review": "It's great I love it!", "verified": true, "helpfulness": "0/1", "author": "Melissa Knight"}]