[{"rating": 3.0, "review": "I do like being able to watch Netflix, HBO go, and YouTube on my television via this device. I understand you can also watch home videos. I have not tried that yet. I'm not much of a television watcher, I'm not interested in the latest flick or weekly drama. But, I do enjoy watching a movie from time to time and this device makes it convenient for me. I will give it a much higher rating once I can watch Amazon prime via this device. Right now, that is not happening.", "verified": true, "helpfulness": "0/0", "author": "Donna Anderson"}, {"rating": 5.0, "review": "A little tricky to setup with smart phones or tablets, but once done it works great.  YouTube works the best, Chrome works, too, but I can see it struggles to catchup.  Likes to see more sources like YouTube be included.", "verified": true, "helpfulness": "0/0", "author": "Songtao Ma"}, {"rating": 5.0, "review": "We have really enjoyed the google chromecast.  The picture is clear, and we are  able to stream netflix and u tube easily.", "verified": true, "helpfulness": "0/0", "author": "Marianne Wardle"}, {"rating": 5.0, "review": "At the price,I figured I could not go wrong, and I think I came out well ahead. I have Netflix and use YouTube a lot so this is fine for me. I was very please at how easy it was to set up, and then how great the quality of the picture on my HD LED TV. I read the reviews before buying and glad I did.", "verified": true, "helpfulness": "0/0", "author": "Major tech"}, {"rating": 4.0, "review": "It's working fine, limited apps to broadcast from mobile devices. Recognizing the device is sometimes tedious. Recommended the device to a friend.", "verified": true, "helpfulness": "0/0", "author": "Cesar Hidalgo"}, {"rating": 4.0, "review": "No problem with the easy install....web pages cast easily to the TV...I'd give it 5 stars if I could watch or cast my Windows Media files to the screen.  Maybe you can, but I've yet to figure it out!", "verified": true, "helpfulness": "0/0", "author": "RobertJB"}, {"rating": 5.0, "review": "Looks lots more complicated to install than it really is. Altho, having son-in-law to handle that was super.Thank you!", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "OK, I am a gadget Geek... with that being said, the Chromecast is one of the best gadgets I've bought in a while. I love listening to the music on my PC and watching my videos as well. Now I can go to Netflix, Vudu, etc, to watch what I want, watch Youtube videos, listen to music on my tablet, PC or even Android phone. It's very simple to install and have running with little to no networking knowledge and very plain, easy and almost idiot proof on screen (PC and TV) directions. I think everyone should have this hooked up to their TV if it isn't a Smart TV. I highly recommend this to any guy with a wife who will not let them upgrade their TV to a Smart model! - lol!!!", "verified": true, "helpfulness": "0/0", "author": "Brian K. Reid \"Waiting for the Son\""}, {"rating": 3.0, "review": "The streaming stick works great and you can see YouTube vids in a larger TV screen. However, the limited number of sources that can be streamed to the stick, limit its potential.", "verified": true, "helpfulness": "0/0", "author": "J. Lopez \"J. L.\""}, {"rating": 3.0, "review": "Hopefully they will be adding more apps to the device in the near future.  If you are casting anything that is built for it, that works just fine.  But, don't cast a tab with video.  It is in Beta test right now, and does not look so good.  I tried different computers and different routers to see if that would work...it certainly does not.  But, that's what beta testing is all about.  I personally expected a bit more with the roll out as far as apps go.  But, it is a work in progress.", "verified": true, "helpfulness": "0/0", "author": "AtoZ \"atozvid\""}]