[{"rating": 4.0, "review": "Perform to my expectation. Nice and cheap games. Recommended.", "verified": true, "helpfulness": "0/0", "author": "SG-2161-2646 Man"}, {"rating": 1.0, "review": "ok, I bought this for my living room and Roku for all our bedrooms.... SO far I have had to return this because after watching anything for just a few minutes it freezes up and says there is no internet connection. When there clearly is internet connection... Then I have to get up and reset it by unplugging it and then it works again for a few minutes.. So they took it back and sent me a new one right away.... NEW one does the same thing right from the start only once I reset it, it at least lasts a few hours before it needs to be reset... I do not recommend this.. also, everything on Amazon prime it mixed up, free movies and shows with ones you have to pay for.. I don't like that... you find a show and get all excited that they have it and then you see they want 1.99 and Up for it..... that sucks... I Love Our Roku I have 3 of them... and I have never had to reset any of them... I have (2) Roku 2 and (1) Roku 1 all work great.", "verified": true, "helpfulness": "1/2", "author": "J. Isola \"CareGiver\""}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Jaime Rodriguez"}, {"rating": 5.0, "review": "love love love love love it!!! my kids use it daily!!", "verified": true, "helpfulness": "0/0", "author": "Vanna Van Hooser"}, {"rating": 5.0, "review": "I love my Fire TV!!!! It's the best purchase so far this year. The set up is super easy! Very user friendly. I enjoy all the streaming options. I couldn't be happier. I haven't run into any issues. I absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "I use it for streaming movies off the internet. It really works great for that purpose. I can only assume that it will work even better when it's handling the amazon apps. The remote is really nice too.", "verified": true, "helpfulness": "0/0", "author": "E. Davis"}, {"rating": 5.0, "review": "great unit exceeds expectations", "verified": true, "helpfulness": "0/0", "author": "James R. Eustace"}, {"rating": 5.0, "review": "Dad loves it. Doesnt have cable so ne streams netflix for the most part and uses pandora. Easy way to make a \"Smart tv\" of sorts. Great product.", "verified": true, "helpfulness": "0/0", "author": "Harley Callahan"}, {"rating": 1.0, "review": "It didn't work sent it back", "verified": true, "helpfulness": "1/3", "author": "george waggoner"}, {"rating": 5.0, "review": "Very fast and user friendly,  now ready to cancel cable.", "verified": true, "helpfulness": "1/1", "author": "William D. Meetze Jr"}]