[{"rating": 5.0, "review": "Great for the price, wonderful to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I was not able to get this device to work.", "verified": true, "helpfulness": "0/0", "author": "Sky-Mike"}, {"rating": 3.0, "review": "It works fine but occasionally there are frequent transmission interruptions whereby, for a couple of seconds, the screen goes black.We noticed that this decreases by switching off the TV connection. However, while it helps to reduce above mentioned interruptions, it does not eliminate them.", "verified": true, "helpfulness": "0/0", "author": "Domingo"}, {"rating": 5.0, "review": "Great picture and sound.. better than buying a smart tv", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "Awesome streaming product. Very easy setup. And now with screen mirroring every application works. Only caveat, don't try this with a DSL line.", "verified": true, "helpfulness": "0/0", "author": "Javert"}, {"rating": 5.0, "review": "Works well.  Like it.", "verified": true, "helpfulness": "0/0", "author": "mitch"}, {"rating": 4.0, "review": "It works", "verified": true, "helpfulness": "0/0", "author": "JJ1016"}, {"rating": 5.0, "review": "I have both the Apple TV and Google Chromecast and I love both for their different features.  With Apple TV and it's in built app, you don't need a computer or a phone to control it, unlike chromecast. However I mirror my computer and use my phone to my tv regularly.  I also found a way to stream my videos from my comp to the apple tv and get 5.1 sound (Air Video HD app, $2).  Apple tv also has new apps that I enjoy - more tv stations etc.With my chromecast, I love their newer apps, some of which are not supported by Apple TV (including comedy central, encore and starz). I also found mirroring the browser tab to the chromecast much smoother than mirroring my laptop screen to the apple tv. Particularly when mirroring online videos and clips, the chromecast does it much easier. Also, I can just cast one tab or video and work on other stuff in other tabs or my computer.  Finally, there's also a way to cast your computer videos/movies to the chromecast (videostream app or Plex, both free), which can be in HD, however, I haven't found a way to get a get 5.1 sound... to be continued.With all Chromecast features and $32 price tag, 5 stars! Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Eghosa A. Olomu \"GoBlue\""}, {"rating": 5.0, "review": "The best $30 I've ever spent. Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "johnnybgoode"}, {"rating": 2.0, "review": "Disappointed that I could not cast amazon prime video from my windows laptop.  Can cast the chrome browser, but the playback window is blank on the tv screen.  Tried switching 'player settings' but could not get it to work.  I'll stick with an HDMI cable for laptop.", "verified": true, "helpfulness": "0/0", "author": "soslow"}]