[{"rating": 1.0, "review": "The Chromecast device is pretty much worthless for use with an iPad as you can't use it to display on your tv unless you use the very few apps they have available.  It may someday be a good product but for now I would suggest buying the Apple TV.  It works great and has a bunch of Apps.", "verified": true, "helpfulness": "0/0", "author": "Michael Bradfield"}, {"rating": 1.0, "review": "I had simple expectations to use this device to cast YouTube videos on to my TV but fell short to deliver that basic expectation. First when I connected and set it up it worked briefly with intermittent connectivity but started showing up as another unsecure Wi-Fi hotspot and phones/ tablets would automatically connect to Chromecast resulting no internet connectivity to them. I am using a dual band Netgear 3400 router and I am guessing part of it is its compatibility with dual band routers. Chromecast support page says it supports this router which is not entirely true. Based on what is said in support page, disabled AP isolation in my router but it does not even connect to Wi-Fi after thar. It connects for a minute and gets disconnected before setup is complete. Several days and after repeated tries, could not get past this point. So many devices seamlessly work with wifi routers and I fail to understand why Chromecast is picky about routers. I am sure it is possible to make it work with more research but not worth the time for the intended usage. Overall, very disappointing product from a great company like Google. I would have certainly returned it if I had started using this early, now just passes 30 days period and it will stay with me unpowered for rest of its life.", "verified": true, "helpfulness": "0/0", "author": "SBT"}, {"rating": 5.0, "review": "This little device allows me to stream movies from my phone and my PC directly to a HDMI movie projector or to a HDMI TV. The video/Audio quality is great. Thank you google for pricing it so competitivly. I've been using it for several months and it is working great. I'm hardly using cable TV anymore.", "verified": true, "helpfulness": "0/0", "author": "Doron \"Desert Storm\""}, {"rating": 5.0, "review": "Had no trouble setting up with netflix, hulu, etc.  Now use with Plex (nice)Google just keeps making it better and better.Bought one for my sister, daughter, and parents now as well :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this because I was tired of running a 25ft HDMI cable to my laptop to watch movies. I also have a Synology DS413j (found here on Amazon http://www.amazon.com/Synology-DiskStation-Diskless-Network-Attached/dp/B008U69LC4/ref=sr_1_1?ie=UTF8&qid;=1395854183&sr;=8-1&keywords;=DS413j) and with the new version 5 OS from Synology you can play videos stored on the NAS through the Chromecast using your iphone or similar as the remote control. I haven't tried the other apps for Chromesast yet but this works great.Plugged the Chromecast into my TV and powered an available USB port on the TV. You switch to the TV input for that HDMI port and you are greeted by the Chromecast setup wizard, you enter your Wifi SSID and password and it joins the network. If you have version 5 of the Synology OS you download the DS Video app to your phone and log in to the NAS, when you select a video to start playing you click the icon in the top of the iphone screen and select Chromecast. The video starts to play on the TV and your iphone will display the thumbnail of the movie, a slider to fast forward/rewind, pause/play and stop buttons, and if you adjust the volume buttons on your phone it changes the output from the TV. I've read that if you have your Synology open to the Internet through your local router and are at a friends house who also has a chromecast you can connect their chromecast to your synology nas using the internet, haven't tried that yet. The really cool thing is if you are playing a movie and turn your phone off, the movie keeps playing. Your phone basically creates the network pipe between the chromecast and the nas. In order to stop the video or play something else you need to start the DS video on your phone again but it's still a neat feature. No worrying about the video being killed if you have to take a call or your phone battery dies, etc.Chromecast is an awesome device and much more affordable than airplay devices. Can't wait to get in and play with it more.", "verified": true, "helpfulness": "0/0", "author": "Craig Shue"}, {"rating": 5.0, "review": "Was worried about the limitation of media streaming but after using it with plex media server its amazing. Perfect quality streaming of ANY locally stored media. No complaints about this thing it is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Tyler Anderson"}, {"rating": 2.0, "review": "Be aware, this device works for Netflix and Youtube on a variety of platforms, but if you would like to \"cast\" to your TV from other websites (or replicate what's on your chrome browser) it only works on certain operating systems at this point.  This fact isn't clear from the product description.  My TV already has Netflix and Youtube built in so this was a complete waste of money for me.  At least the price is very low.", "verified": true, "helpfulness": "0/0", "author": "Lee D. Mermelstein"}, {"rating": 4.0, "review": "This is a nice addition to your a/v setup. It streams YouTube videos flawlessly, provided you have a cable internet connection. You can multi task while casting your video, but only if it's YouTube. If you're casting from Hulu or Netflix, you're stuck because it's casting what's on your computer screen. If you go to another site, that's what you'll be casting. I wish Google would update the firmware so that you can cast Hulu and work on other things. It's the reason I gave it 4 stars instead of 5. It is worth the money, particularly if you're considering cutting back on your Cable TV channels.", "verified": true, "helpfulness": "0/0", "author": "IDIrishbiker"}, {"rating": 3.0, "review": "I have other streamers in my house hold, and they are all equipped with guides to operate them- Not schematic like Google chrome-", "verified": true, "helpfulness": "0/0", "author": "Jocasso45"}, {"rating": 5.0, "review": "I finally managed to get rid of Xbox live and their crazy expensive $60 a year because they had a bit of a lock on the netflix market.$30 - $35 one time, and it can come with me, and show you tube ect much easier.Very worth it.", "verified": true, "helpfulness": "0/0", "author": "gman"}]