[{"rating": 1.0, "review": "It will not store my netflix sign in so I need to sign in every time. I do not like it.", "verified": true, "helpfulness": "3/18", "author": "Mike Rowan"}, {"rating": 4.0, "review": "I just received my Fire TV box today, and it is everything promised and then some, imho.  I've been exploring it (and got started on \"Fargo\") for the last 3 hours and the menus are intuitive, the voice search is quite nice, and I love the way the remote feels in my hand.  A value buy, in my opinion, especially if you are an amazon instant video subscriber.  I haven't even explored all the other sources.", "verified": true, "helpfulness": "1/1", "author": "RG Peabody"}, {"rating": 3.0, "review": "I would give it a 4 star review if it didn't keep having reoccurring issues with wired Ethernet connection.  For some reason I have to keep taking out the Ethernet cable and plugging it back in the device in order for it to recognize the wired connection.  Now, the funny thing is that the wifi connection works fine.  The reason that is funny or ironic is that typically that is where most devices have an issue when it comes to internet connection.  The reason I choose being wired in is because I want fast data transfer..  Now, the Fire works well with everything else.. very smooth and the interface is well laid out...", "verified": true, "helpfulness": "2/2", "author": "Eli Ojeda"}, {"rating": 5.0, "review": "Bought my Amazon Fire to take better advantage of Prime video and my wife's Netflix account. It's great! Easy to set up, the voice search works really well. Love the simplicity and for us it was the perfect way to add streaming media to our main TV.", "verified": true, "helpfulness": "0/0", "author": "M Sean Browne"}, {"rating": 5.0, "review": "This was easy to set up! I can access many movies and purchase new releases without going out of the house to search for a video store. I can also access my Netflix! I love this and wondered how I ever lived without it. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy.  So cool.  Thought it would be hard to install, but box said \"frustration free\".  It was.  Menu is easy to navigate.  Movies and TV programs are effortlessly to add to my favorites list.  Love this product! Amazon, you are awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Bay Area Shopper"}, {"rating": 4.0, "review": "Personally, it's the best way to watch Amazon Instant movies and TV yet, as well as stream thousands of titles for no additional charge. Voice-search feature is pretty cool and works nicely. The interface is quite nifty, and Amazon content streams quite fast. Supported third-party apps include Netflix, YouTube, Hulu Plus, Watch ESPN, and Pandora, as well as hundreds of games. Other positives that Amazon also offers flexible parental controls, and the kid-friendly Free Time platform is coming to the Fire TV soon. And setup is incredibly simple.The Negative: The user interface strongly favors Amazon Instant content over other services, and the voice-search feature doesn't work with Netflix or most other non-Amazon apps. Some major apps are missing i.e. HBO GO, WWE, etc.., The $99 price feels a bit expensive, especially since you really need the $40 Fire Game Controller and a Prime subscription to get the most out of the box.The Fire TV streaming-media box is quite the bedroom (Not Living Personally) debut for Amazon, with standout features like voice search, gaming, and super fast video streaming, but it falls a bit short of being an elite streamer -- at least for now. I suspect improvements in the near future.", "verified": true, "helpfulness": "2/2", "author": "Rogelio Vargas Jr."}, {"rating": 3.0, "review": "This was very easy to install but after that I was disappointed about how many of the movies and TV shows that you had to pay for.  I thought there would be more shows that would be free. Even things like old TV shows like Bonanza.  The setup is very easy.", "verified": true, "helpfulness": "3/5", "author": "piglet"}, {"rating": 5.0, "review": "The device hooks up in minutes and has wi-fi built in.  It has Hulu, Netflix as you would expect, and gives you access to stream Prime content as well.  The interface is fast and responsive as well as easy to navigate.The game selection is pretty basic, but there are some great ones that you can play for free.  I sprung for the game controller as well.  It's fairly basic, but It's better than using the Fire remote.All in all, this is a pretty fantastic device", "verified": true, "helpfulness": "1/2", "author": "Douglas Kirschman"}, {"rating": 5.0, "review": "I love this new product especially talking into it and it finding what you want, and its fast. would recommend to anybody.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]