[{"rating": 1.0, "review": "Amazon sells this, but can't use it with Amazon prime movies or shows. Felt ripped off by this one.", "verified": true, "helpfulness": "0/0", "author": "cornholio"}, {"rating": 5.0, "review": "great little add-on to make any tv a \"smart-tv\".", "verified": true, "helpfulness": "0/0", "author": "A. Little"}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Vanpersio"}, {"rating": 4.0, "review": "I love the chromecast! The only reason it gets 4 and not 5 stars from me is that it doesn't work with Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Jah"}, {"rating": 5.0, "review": "As good as expected!", "verified": true, "helpfulness": "0/0", "author": "Mario Villaverde"}, {"rating": 5.0, "review": "This works exactly as described. We love it!", "verified": true, "helpfulness": "0/0", "author": "Tammy Kimbrell"}, {"rating": 4.0, "review": "The device is not perfect, but for the price you will spend another $75 to really best it.  This innovation is what the other companies have copied and ran with i.e. Roku, WD, Fire Stick, Apple TV.  A remote would be nice.  Roku 3 has that feature.Found out it also works as a HDMI adapter to plug into your USB slot if you have the HDMI cable hooked in, and your Laptop does not have HDMI slot (looking at you Apple).  This may be obvious to some, but I never intended this feature, and it was nice to not have to set up a show for my girlfriend when she wanted to play her content.I am one of those \"Cord Cutters\" and I would say this is essential gear to that approach to Entertainment.  I stream tons of Youtube as music.  Popcorn time has a cast option.  F&%$ Comcast.  You will  need to figure out how important live sports are, because that is where cable has you by the nuts.It's not really stealing if it is a Digital COPY.  Lawyers and Government intervention favoring business aside... Discuss...", "verified": true, "helpfulness": "0/0", "author": "Marc Sweet"}, {"rating": 4.0, "review": "Loving it!", "verified": true, "helpfulness": "0/0", "author": "BJH"}, {"rating": 5.0, "review": "works, but I don't like using HDMI, please make this available in USB - preferably USB C now that that's out and standard.", "verified": true, "helpfulness": "0/0", "author": "some guy"}, {"rating": 1.0, "review": "I dont know if i got broken piece or something...very disappointed..and can't return as its more than 30 days.", "verified": true, "helpfulness": "0/0", "author": "Tejash Patel"}]