[{"rating": 4.0, "review": "I really enjoy our Chromecast. I mainly use it to watch Netflix and it's nice to be able to control the TV from across the room, especially when I'm working on my computer from across the room. I had trouble using it with my Nexus for awhile as the Chromecast needed to be reset everytime I started it. However, this seems to have been fixed with the last update. I also like that I can now stream websites to the TV. I would like it to work with ABC or Hulu though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Since Chrome upgrade to a new version, I cannot cast my webpage from Chrome website to the TV anymore. Therefore, you might want to reconsider if you want to mirror content from the website to a big screen.", "verified": true, "helpfulness": "1/1", "author": "Mohammed Alsaeedi"}, {"rating": 1.0, "review": "after getting chrome cast I hooked it up & tried to get it to work .It just will not work for me!!! I have the fastest internet hook up ATT offers all of my electronics are new not sure what more i can do , it will show the pic. but it is not in time with the sound!!", "verified": true, "helpfulness": "1/1", "author": "krazy freak"}, {"rating": 2.0, "review": "How is it that you can buy this product on Amazon, but it is NOT compatible with Amazon Prime? That's like buying accessories for your car at the dealership that don't actually work with your car. This device was extremely easy to set up, and works reasonably well with Netflix, but that's about it, as far as I can tell. Good luck streaming much of any other kind of content to your monitor through the Google Chrome device. I wish these tech companies would learn to talk with one another. Their products are about as standardized as plumbing parts were in the nineteenth century ( or today, for that matter ).", "verified": true, "helpfulness": "1/4", "author": "Gerad W. Arcuri \"Press on Regardless\""}, {"rating": 5.0, "review": "Wow. What a great wireless solution to watching files on my Samsung tablet on the big screen. I should mention, you do have to dowload a lot of specialty apps if you have your media on a server at home. It will work with my Kindle Fire HD, but needed differed apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Gary\""}, {"rating": 4.0, "review": "Good value!!  Does what it says it will do - performs great!!  Makes a good gift for your tech friends and fam.", "verified": true, "helpfulness": "0/0", "author": "j o'day"}, {"rating": 5.0, "review": "I have been using Chromecast to watch Netflix as well as series on Viki.  There was an issue that Netflix could not sync properly with my tablet.  After thorough searching for a fix on the web, the issue is that the time needs to be correct, based with Netflix's servers (I am guessing).  Just make sure the device you are using to sync with the Chromecast is properly synced with the internet time.  This should do the trick.  Oh and since they have VUDU now, this gives the ability to rent as well as stream your movies anywhere with WiFi.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 1.0, "review": "I received my Chromecast in the mail two weeks ago and still haven't got it to work correctly.  I have spent over three hours on the phone with customer service and no one can tell me what is wrong.  All I have been told for now is they are researching something about my router and will get back to me.  That was over a week ago, I don't think I will ever hear from them.  It works from a laptop but neither my iphone nor ipad are able to see it.  One of the many tech support employees I spoke to assured me that if I wiped my iphone clean and reloaded everything then that would fix the problem.  It didn't.I am using a Belkin N150 router which is on their approved list but it apparently has some issue with the Chromecast.  I would highly suggest going with another product either way but definitely if you use this router.", "verified": true, "helpfulness": "1/1", "author": "rusty"}, {"rating": 5.0, "review": "Love this device!", "verified": true, "helpfulness": "0/0", "author": "Szigidi"}, {"rating": 5.0, "review": "Bought one and loved it so much that I got another for our other TV.  Very easy to use and FINALLY, a piece of technology that is affordable.", "verified": true, "helpfulness": "0/0", "author": "Chris"}]