[{"rating": 2.0, "review": "Unfortunately I have Verizon fios internet in my neighborhood. the wireless router they provide is not compatible with chromecast. Spent a few days searching for firmware or setting and no real luck. If i would of know this in advance, i would of not ordered the device.", "verified": true, "helpfulness": "1/1", "author": "Victor Chaidez"}, {"rating": 5.0, "review": "Even better after the latest updates which supports plex and via. Been using it to stream youtube videos and now I can also stream videos through avia as well. awesome !", "verified": true, "helpfulness": "0/0", "author": "Foo Y."}, {"rating": 4.0, "review": "This product is rapidly becoming a strong competitor for Roku and Apple TV. With new features like netflix being added it is becoming more than a way to stream movies and You Tube from laptop to TV.Set up is easy when found on wireless router by laptop or using the app available on either iTunes or Google Play.Small and compact makes it great to plug into the back of your HD TV and forget about it.  Do not forget it needs power through the micro USB plug.For less than $35 this is a must buy.", "verified": true, "helpfulness": "0/0", "author": "Mike P"}, {"rating": 5.0, "review": "Works great, turns an older flat screen into a 'smart TV'.  Allows you to enjoy Hulu, YouTube, NetFlix for a lot less than the cost of a newer TV!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I ordered one of these as a way to better stream Netflix, to my surprise I've used it for Netflix, Youtube, Vevo, Internet sharing and other features.  All i have to do is click \"Cast\" and within seconds the image/video is on my TV.  At one point it even automatically switched input over to the Chromecast to start the Youtube video.  Well worth $35!", "verified": true, "helpfulness": "0/0", "author": "Steven Kearney"}, {"rating": 3.0, "review": "Plex and avia both don't work (why plex and a via)Google should go with Bubble upnp.other than that OK .", "verified": true, "helpfulness": "0/0", "author": "tjmax"}, {"rating": 5.0, "review": "Great product! Perfect for streaming netflix to TV without having to pay high price for Apple TV. Highly suggested for anyone!", "verified": true, "helpfulness": "0/0", "author": "Ashton"}, {"rating": 2.0, "review": "Every time you turn on the TV and wish to chromecast, there is an unpublished elaborate ritual you have to go through to get the cast to get recognized on a bread and butter \"n\" network.(1) Climb up next to the set (it's on the wall) and disconnect chromecast from the TV and from its power supply.(2) Power the chromecast.(3) Run upstairs and press the \"access\" button on the router- this despite having programmed the cast with the password, on one of the few times the iphone was able to find the chromecast device.(4) Run downstairs, and plug in the cast on the HDMI port on the TV.This is technology that ought to be, \"once programmed, you just turn it on\".. Works if I really want to do this, but utterly not worth it.Assessment: $30.00 piece of c_ap.", "verified": true, "helpfulness": "0/0", "author": "Dr. Bruce"}, {"rating": 5.0, "review": "Took me all of 10 mins from opening to get working and updated on my network. Love the interface, just wish I had faster internet for streaming. You really can't beat the price.Thanks Google", "verified": true, "helpfulness": "0/0", "author": "Kenneth H. Dry"}, {"rating": 5.0, "review": "Netflix, Youtube, Chrome, the three most common places I visit to play anything online and it casts all of them seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Hema Manasa"}]