[{"rating": 5.0, "review": "I love this little Gadget !Use it all the time. Now I get all my channels in the bedroom without having to rent an additional cable box. I use this Google Chromecast and my phone.", "verified": true, "helpfulness": "0/0", "author": "Vin Man"}, {"rating": 5.0, "review": "Bought this to watch Hulu through my phone app and it works great. Super easy to set up, and I am NOT a tech savvy person so this was literally plug it in and go type of thing. I would suggest buying to to anyone because its so convenient!!", "verified": true, "helpfulness": "0/0", "author": "denkellsma"}, {"rating": 5.0, "review": "Great product links up stranded TV's as long as they are in your wifi zone.  With HBO to Go and other apps it provides plenty of content.  We use on an HD Projector on our pool deck.  Much better than hauling a cable box or Apple TV out with wires everywhere.", "verified": true, "helpfulness": "0/0", "author": "G in H-Town \"Restless, Dexterous, Primed\""}, {"rating": 3.0, "review": "not enough functionality yet.  price is cheap so might as well get one.", "verified": true, "helpfulness": "0/0", "author": "Dustin Keener"}, {"rating": 2.0, "review": "Does not work with Linksys dual band router", "verified": true, "helpfulness": "0/0", "author": "Arthur B. Reinwald"}, {"rating": 2.0, "review": "found my network but would not stream.", "verified": true, "helpfulness": "0/0", "author": "dgolden"}, {"rating": 5.0, "review": "One of the coolest devices ever.The simplest , zero-learning-curve, neat application to interact with your television set.Some tips:- Remember to go to the settings and uncheck the \"share usage\" to avoid privacy concerns.- Remember to check the offers very 3-4 weeks (from your device on which app is installed).- Can be powered by your TV. separate AC power not needed. Tried it on 2 different Samsung TVs.- Can be used as Karaoke machine (Search for song name and type karaoke on You tube). Had a great karaoke party at my place last month. Best part is with guest mode enabled everyone can queue their songs from their phones!I also own Fire TV and believe both products have their space on your TV set and can/should co-exist due to different value they provide.", "verified": true, "helpfulness": "0/0", "author": "TheCriticalViews"}, {"rating": 3.0, "review": "This device had such potential but Google didn't seem to do much with it. It works great if you're trying to duplicate what you have on your machine or device (youtube and netflix) but that's about it. For the price it's not bad but now with the FireTV Stick it kind of became obsolete.", "verified": true, "helpfulness": "0/0", "author": "A. Gil"}, {"rating": 1.0, "review": "Been using it for a month now. it plays videos ok from the app but loses connection immediately. if u want to pause or forward. You have to reboot the wifi. Painfully frustrating. Google is selling a half baked product.", "verified": false, "helpfulness": "0/0", "author": "R. Nair \"gamer\""}, {"rating": 2.0, "review": "Keeps dropping my signal - pretty useless.", "verified": true, "helpfulness": "0/0", "author": "Jewels Marcus"}]