[{"rating": 5.0, "review": "Great product for streaming and works well.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "Great little item for a good price...fast ship too", "verified": true, "helpfulness": "0/0", "author": "angelblueyes"}, {"rating": 5.0, "review": "Delivery is on time. Great product. Kids love it", "verified": true, "helpfulness": "0/0", "author": "Akmal Faiz bin Razali"}, {"rating": 5.0, "review": "Easy to setup. It did take a few minutes. Comes with everything you need to setup and watch. Streams everything I wanted it for. I haven't used the other app for streaming video yet.", "verified": true, "helpfulness": "0/0", "author": "Russ Brown"}, {"rating": 5.0, "review": "By far the best Streaming media player in the market...  And the best thing is that it is constantly improving.Buy it fast!", "verified": true, "helpfulness": "1/1", "author": "Tom Dollar"}, {"rating": 5.0, "review": "I LOVE my chrome cast!  Can I just say that I'm not a tech genius and I end up asking my poor husband why to many questions about my phone or my tablet/laptop.  Sometimes I get so feed up I just don't go near anything but my television.  Then I got my husband a chromecast for Christmas and it changed everything!  So easy to use,  even to me and now I can watch Netflix and Hulu whenever I want.  I'm even getting one for my dad who still uses the term \"fire up the computer\".  All you have to do is press a button and then you watch your shows/YouTube videos on your television... AGAIN so easy.", "verified": true, "helpfulness": "1/1", "author": "Jane Green"}, {"rating": 3.0, "review": "I didn't realize it needed external power when I got it. There was a usb that supposedly could plug into my tv, but it seems there isn't enough power there so I had to find another outlet (not an easy task where I have my TV). It's funny, I wanted to go wireless, but still ended up with a wire. It streams ok, but is reliant on the apps surrounding it, I'll jail break it If I ever can.", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "Better than amazon fire  stick", "verified": true, "helpfulness": "1/2", "author": "Pavannify"}, {"rating": 5.0, "review": "Amazing product!", "verified": false, "helpfulness": "0/0", "author": "Darwin J."}, {"rating": 5.0, "review": "Turned my dumb tv into a smart tv. Cool features for a good price", "verified": true, "helpfulness": "0/0", "author": "brian flynn"}]