[{"rating": 4.0, "review": "I bought this because of the relatively low price point and fun easy functionality.  I did a little research and it pretty much just works as described, no problems.  However, I have mostly apple products and soon after I got Chromecast I got the Apple TV (I was hoping they'd upgrade the hardware in 2013 and Chromecast was the right price to sooth me until the last Apple event that year).  I've barely used Chromecast since I got the Apple TV.  When you have Apple products, it's hard to beat the AirPlay integration of the Apple TV, iCloud, and other such functions.Still, not putting Chromecast down, just giving perspective that you'll probably not need it if you have a Macbook/iPhone/etc and an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "David tech guy"}, {"rating": 4.0, "review": "I really like this little guy for streaming video in HD.  It can be moved from TV to TV which is a positive and gives it an advantage over a Roku  However, not many platforms support the streaming yet from applications on the phone but if you can stream from google chrome its great.  Its also great if you want to enlarge your computer internet screen to the television.  No need for the expensive Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 3.0, "review": "I'm not a YouTube user in general but my G.F. and I always look for vacation info on our time off...But you can't cast an android tab via chrome.  You can from windows though?  Sell out?  Android can only cast \"links\" like YouTube.  THEY NEED TO FIX THIS!", "verified": true, "helpfulness": "0/0", "author": "4Runner"}, {"rating": 5.0, "review": "Just can't believe this gizmo simply amazing. Been telling everyone about it and how easy it is to hook up and manage.", "verified": true, "helpfulness": "0/0", "author": "George Allen"}, {"rating": 1.0, "review": "I bought this device because we pay quite a bit for our internet (per megabyte used), and I wanted to be able to utilize my smartphone (unlimited data) to stream movies. Unfortunately, when it says that you can use your smartphone what it means is that you can use your smartphone as a remote. You still have to use your internet.I'm disappointed and will be taking it back.", "verified": false, "helpfulness": "0/5", "author": "Mrs. Terri \"Mrs. Terri\""}, {"rating": 5.0, "review": "Couldn't have been easier to set up, and it's dirt simple to stick in my pocket and take on a business trip or to a buddy's house. With Google recently granting developer access, it's about to get even more awesome! I love being able to throw my Netflix or YouTube right up on the screen, and can even share whatever web page I'm browsing. Great little device for what is essentially pocket change.", "verified": true, "helpfulness": "1/1", "author": "A. Richardson"}, {"rating": 5.0, "review": "This winter has been the roughest and worked well and cleared all the snow in no time flat.  It is electric which is not the best if you loose power.", "verified": true, "helpfulness": "0/0", "author": "Brent Cox"}, {"rating": 4.0, "review": "Wish it would stream my own movies from computer. It even knows if you are cheating through a vpn. Paid less than selling price and guess it worth every penny (sarcasm) .", "verified": true, "helpfulness": "0/0", "author": "Daniele"}, {"rating": 5.0, "review": "BUT AFTER HAVING IT HOME, WHAT DO YOU DO WITH IT. IT WAS OVER MY ABILITY TO FIGURE IT OUT, SO I WROTE THEM AND ASKED IF I CAN RETURN IT, THEY GAVE ME A FULL REFUND.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I had high hopes for this bad boy! Turns out it is nothing like Roku (which I have) or Smart TV (which I have.) It is really not worth it.", "verified": true, "helpfulness": "0/1", "author": "Daniel M. Andrews"}]