[{"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Ireadmore"}, {"rating": 4.0, "review": "Really great for a tv in my craft room. I'm not lame I do cool crafts like woodworking and making models. Not like I'm making doilies or something lame. But I'm able to use my tablet and/or phone to cast Hulu, Netflix, HBO and others and is easy to setup and cast stuff to it. I would not recommend for someone like my father in law, he's not too good with tech. But for anyone else it is super easy.", "verified": true, "helpfulness": "0/0", "author": "sam grein"}, {"rating": 5.0, "review": "works perfectly", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Just wish there were more apps that use this..easy setup great hd picture a must have in your house...", "verified": true, "helpfulness": "0/0", "author": "joe moore"}, {"rating": 3.0, "review": "I'm sure it is fine for some people. I never could get it to work and no one in tech support ever answered my emails for help. So, I'll never know.", "verified": true, "helpfulness": "0/0", "author": "Stan Duncan \"Stan\""}, {"rating": 3.0, "review": "Can't say I like it better than the Apple TV...", "verified": true, "helpfulness": "1/1", "author": "Jetmira Trsani"}, {"rating": 5.0, "review": "Excellent product:Easy to install and it works perfectly. Too few applications, yet.", "verified": true, "helpfulness": "0/0", "author": "Marco"}, {"rating": 4.0, "review": "Wish this would work by showing your actual computer/ phone screen still a neat toy for the price.", "verified": true, "helpfulness": "0/0", "author": "Joshua Knipp"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "raider619"}, {"rating": 5.0, "review": "As Google begins to roll out more features for the Chromecast, this spur of the moment buy keeps getting better and better. Although I do wish I did not have to be on my local network to use everything the Chromecast can do, when I'm in the house its easy and quick (takes me about 10 seconds to get connected to it from start to go!) to broadcast something on the TV for the entire family to watch a funny youtube video or flip through a photo album from our phones. If you are on the fence about this device, consider it! My TV has a USB port right next to the HDMI jack, so charging the Chromecast was easy. I can see why it would be difficult if you had to plug this into a wall outlet. But considering there are no re-occuring costs or other apps to buy to make the Chromecast work, this buy will only get better and better as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Columbus Family Man \"Lee\""}]