[{"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "bookworm"}, {"rating": 4.0, "review": "Its working really nice eventhough some channels I can't get because of living outside the US. How ell it does work really well", "verified": true, "helpfulness": "0/0", "author": "Raul Salas \"the Rock by Plexon\""}, {"rating": 3.0, "review": "I hate the fact that I need to be connected to internet. Why?", "verified": true, "helpfulness": "0/0", "author": "Seyedsalim Malakouti"}, {"rating": 4.0, "review": "Very Good performance, but it is very sensitive to WiFi (it needs to be very stable and strong signal).Excellent variety of apps compatible.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "It's amazing.", "verified": true, "helpfulness": "0/0", "author": "Guatom"}, {"rating": 4.0, "review": "Some shortcomings.  However, for the price it meets expectations", "verified": true, "helpfulness": "0/0", "author": "Jim Tomlinson"}, {"rating": 3.0, "review": "I love the idea of this thing!  I use it all the time because I take online classes with recorded lectures.  I sit in my living room and take notes while it plays my lectures, which is super convenient.  My issue is that despite its great potential, I am unable to successfully stream some video content from the internet because of lag or interference.  That is the whole big selling point for this item! I have tried everything trouble shoot and it even messes up on some of my lectures, which is frustrating.  When it works it's phenomenal, but when it doesn't I just want to throw it out the window.  So much potential if they could just debug or upgrade some of the materials! I also wanted to mention that it does have some really cool customizable background features, which post neat pictures, the time, current events, and weather.", "verified": true, "helpfulness": "0/0", "author": "AlexanderB84"}, {"rating": 5.0, "review": "Love using this for direct tv and streaming stuff from the computer to the tv.", "verified": true, "helpfulness": "0/0", "author": "Jess Burns"}, {"rating": 4.0, "review": "This was a gift. The shipping time was great! No damage to the product.", "verified": true, "helpfulness": "0/0", "author": "jacenta stallworth"}, {"rating": 5.0, "review": "Love that I can watch something through my phone on my tv.", "verified": true, "helpfulness": "0/0", "author": "Aaron & Natashia Callender"}]