[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Christian Ramirez"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "jrayetx"}, {"rating": 5.0, "review": "I now have 2 of these, one in the living room and one in the bedroom.  I didn't want to buy a Roku or an Apple TV because I really only ever watch Netflix and that's only some times.  It is ridiculously so easy to use, I have never once had to reconfigure anything for it to work.  I have an iPhone but have heard that with an Android you can now Cast your entire phone's screen and not just an App like Netflix...pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Heather Jenkins"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/1", "author": "James E. Barger"}, {"rating": 5.0, "review": "Best $30 spent ever. Works great.", "verified": true, "helpfulness": "0/1", "author": "shaifali"}, {"rating": 4.0, "review": "Installation was no problem.  Easy to use.  Wish it would work with more apps.", "verified": false, "helpfulness": "0/0", "author": "Al M"}, {"rating": 5.0, "review": "my son loves it", "verified": true, "helpfulness": "0/1", "author": "dadmomoffive"}, {"rating": 5.0, "review": "Great product from Google. I love being able to stream YouTube videos and media from my Android smartphone directly to my TV, without having to deal with the subpar built in software on my \"smart\" TV.", "verified": true, "helpfulness": "0/1", "author": "J. Wang"}, {"rating": 5.0, "review": "good, works great, A+", "verified": true, "helpfulness": "0/0", "author": "Farzan"}, {"rating": 2.0, "review": "So far, haven't even got it to work properly. I bought it to cast from my ipad and now find out the Chromecast Browser on the ipad does not have the mechanism to cast from. That was the primary reason I bought it. The browser is supposed to launch once it is connected from your ipad or phone or computer to your TV -once everything is linked and connected via wifi, but this hasn't happened. The fact that I can not use my ipad to cast, and it says this no where in the description, may make me decide to return it. I am a very tech savvy person so I may just have a defective one. I have googled many different sites for help but all I have is the photographs on my screen and no way to cast or watch anything. If I am doing something wrong, I will update my review but it still lacks for not being able to work with my ipad as it's description clearly states you can. A real disappointment.", "verified": true, "helpfulness": "0/0", "author": "Susannah"}]