[{"rating": 5.0, "review": "Really like the customer service and appreciate the quick response to my problem. I really like my fire tv!!!", "verified": true, "helpfulness": "0/0", "author": "Deshaun Williams"}, {"rating": 3.0, "review": "This product is not ready to use out of the box and requires an hdmi cable to operate. It is not compatable with Apple products, so don't expect to be able to mirror iPhone content without mediocre third party apps. Constantly trying to shove Amazon content in your face which is understandable. The voice search works great at the expense of the standard searching interface. Quick and snappy processing.  Excellent remote.", "verified": true, "helpfulness": "0/0", "author": "Felix R."}, {"rating": 5.0, "review": "Bought it with Sling TV and it is great. No more cable. I think if you have a Smart TV you wouldn't need it though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works Great!", "verified": true, "helpfulness": "0/0", "author": "Dang"}, {"rating": 1.0, "review": "I have owned this unit for a little over a month. The remote has stopped working and the unit is now useless. (Yes I changed batteries and followed all the instructions) Do not waste your hard earned money like I did and be disappointed. Just another typical Amazon purchase, you just never know what kind of disappointment your gonna get. Why do I keep buying from them?", "verified": true, "helpfulness": "3/4", "author": "Jeff"}, {"rating": 4.0, "review": "A solid product.  It does many things very well but a few features need some work.  For the price it is great but not perfect.", "verified": true, "helpfulness": "1/2", "author": "Eric D. Crane"}, {"rating": 5.0, "review": "I never really paid attention to these units or other similar units, but the time came when I wanted to be able to display Smart TV content on non-Smart TV's in addition to XBMC/Lodi without the need for a large computer at each TV. I bought two of these and was more than impressed with the speed and capabilities. I sideloaded Kodi and I bounce between Netflix, Amazon Prime, and Kodi on my two primary TV's. FireTV was worth every penny. I'm considering getting a FireTV stick just to have it when I'm on the go.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Right now used for Prime video's and Netflix. the Search could have been on Netflix as well along with amazon products.", "verified": true, "helpfulness": "1/1", "author": "Madan Arumalla"}, {"rating": 5.0, "review": "I have not had any problems with this device.  For the price point, buy it.  I've been very satisfied with its service and quality build for such a small device. It is very easy to setup. My 70 year old mother figured it out.There are several other services that one can add here, but most will use it for Netflix and Amazon Prime.  I also use it to catch CBS News when I get home late and don't feel like setting a DVR to collect news segments.", "verified": true, "helpfulness": "1/1", "author": "A Buyer in Texas \"Alan G.\""}, {"rating": 5.0, "review": "Love the mic function. Wish it could be set to only search Prime shows (with Mic) so you don't have to look at every cover.", "verified": true, "helpfulness": "1/2", "author": "Dewey Killingsworth"}]