[{"rating": 5.0, "review": "I was going to buy apple TV but I tried this instead. I'm glad I didn't spend the $100 on apple TV because this works great!", "verified": false, "helpfulness": "0/0", "author": "caitlin1234567"}, {"rating": 5.0, "review": "I just bought one of these (locally), after a lot of thought of whether or not it was a useful item. The thing that changed my mind though, was the recent update offering screen casting. This is an absolutely fantastic feature that makes this $35 device a no-brainer! I have a Sling box with a slingmedia app on my Nexus 7 tablet. Now I can 'Cast' it to any TV I have the Chromecast plugged in to. And yes, I have tried it, it does work, and it works great! I love this thing! There's no telling what else I'll find to do with it. I might even buy a few more of them at this price!", "verified": false, "helpfulness": "0/0", "author": "RSM61 \"Randy\""}, {"rating": 2.0, "review": "blaaaaa", "verified": true, "helpfulness": "0/2", "author": "P. Perryman \"R. Page Perryman\""}, {"rating": 5.0, "review": "Best device EVER to watch internet media on your tv.Why? The concept that the thing you use to select media is EXISTING applications on your Cell phone, pad, or laptop.All other devices require the content creator to make a special app for their device.That equates to apps that dont get updated at all, or are updated infrequently.Interfaces that are awkward and require specialized controllers.With this, use the thing in your pocket or coffee table, and an app likely updated yesterday.Oh, and when its playing the device is basically a great tailored remote easily controlling location in videos.And if you turn your device off, most things will stream without your device directly to Chromecast.I really want Chromecast radio boxes, think Squeezebox with Chromecast built in.I bought one for every TV in the house, and made two internet TV's (chromecast only) to boot.If you don't get it, its like explaining to someone who never owned a DVR why DVR's are great, you will get it once you use it.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Murphy \"WebSurfinMurf\""}, {"rating": 5.0, "review": "My go to guy for streaming.  Great for gifts and at $35 a nothing amount to spend to see whether you like streamed shows.  These days lots of Chromecast compatible App's out there.", "verified": true, "helpfulness": "0/1", "author": "Jeronimo Jizzalloverya"}, {"rating": 5.0, "review": "There are a million reviews for this device and all say basically the same thing: This does all of the things it claims very well and does not do some other things.Buy this and enjoy it for the apps that it supports:  Stream YouTube videos at your next party (tons of fun), stream Pandora, get your HBO-Go on.  It's great, it's cheaper than a \"Smart TV\" and the integration with iOS and Android is nearly seamless.Buy It!", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 1.0, "review": "Can't get 2 work ?", "verified": true, "helpfulness": "0/2", "author": "David Hill"}, {"rating": 5.0, "review": "Million of smiles and I bought it for 35 dollars. A MUST HAVE FOR ENTERTAINMENT AT AN AWESOME PRICE.", "verified": true, "helpfulness": "1/1", "author": "Bubba"}, {"rating": 5.0, "review": "Best value for streaming media.", "verified": true, "helpfulness": "0/0", "author": "Yicheng"}, {"rating": 4.0, "review": "Easy to use right out of the box.  Minimal setup.  Pretty much exactly as advertised.  Does not support Amazon Prime Video but you can cast the browser tab playing your video as a decent workaround (must also change the Amazon Video Player from Microsoft Silverlight to Flash).  Tab casting also works on websites like Project Free TV with a slight loss of quality.", "verified": true, "helpfulness": "0/0", "author": "Winston Yu"}]