[{"rating": 5.0, "review": "I don't have cable or satellite anymore due to the repeat of the same shows over and over, and the high price for not receiving much.  So when Amazon released this for a one time fee, I decided to buy.  I am very impressed, and especially now that I can listen to my cloud player songs.  Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This thing was beyond easy to set up. I love mine and I'll keep this over an Apple TV anyday, and I love apple. He bad thing about it though, is after the \"free 30 day trial\" of Prime, it continued to charge my account over $200. I am not okay with that. Maybe figure out a way to end that 30 day trial.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Amazon Fire TV is pretty good.  It does what it promises.  The only issue I have is that I expected there would be more current shows available with having to pay or have a current cable provider and I am a bit disappointed about the selection.", "verified": true, "helpfulness": "0/0", "author": "Portia Coleman"}, {"rating": 3.0, "review": "Not sure the real reason why  it reloads several times when we are watching Neflix. We have called the customer service and they walked us through to reset it, but the problem continues. They told us the reason is that the unit did not detect the Bandwidth. The picture quality isn't always good either. It has swirling images. That being said, this is the best option for us and is way better than paying Direct TV too much for just a few channels without many good movies to watch!! I hope next generation of Amazon Fire TV can correct the sensitivity of bandwidth detection.", "verified": true, "helpfulness": "0/0", "author": "mfu"}, {"rating": 5.0, "review": "I bought this a month ago mostly out of curiosity--we have a media center computer that can do all of the things the fire TV does.  Now we use the Fire TV almost exclusively--especially now that Music is enabled.  Ordering up shows or music with the voice search is a really compelling improvement.  The access time is fast even compared to our much bigger processor driven computer. And it is quiet.  By focusing on the search element the device itself becomes more transparent which should be the ultimate goal for any media device.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Watt \"jeffW\""}, {"rating": 5.0, "review": "Still checking it out. Hard to find all those 40,000 free movies. Most movies they want to rent.", "verified": true, "helpfulness": "0/0", "author": "Richard H."}, {"rating": 3.0, "review": "The picture quality and selections are great, but the unit doesn't have enough memory as it keeps refreshing the cache which takes several minutes at times.", "verified": true, "helpfulness": "2/2", "author": "shirley Turner"}, {"rating": 5.0, "review": "I love it! Easy to install...easy to use....movies at one click! My neighbor wants one!", "verified": true, "helpfulness": "1/1", "author": "Deborah L. Cormier"}, {"rating": 3.0, "review": "haven't learned how to use it yet", "verified": true, "helpfulness": "0/1", "author": "litz from pgh"}, {"rating": 5.0, "review": "Extremely fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Will Woodward"}]