[{"rating": 5.0, "review": "Recently cut the cable with cable TV. I am impressed wit the content and waiting for more.", "verified": true, "helpfulness": "0/0", "author": "Fred Cochrane"}, {"rating": 5.0, "review": "Great device. It has everything it says it does. Works amazing.", "verified": true, "helpfulness": "0/0", "author": "Rosalydia Meade"}, {"rating": 5.0, "review": "I have been able to see so many productions by Masterpiece and the BBC that I love. (But so much more is available.) Also there are new movies available to rent or buy that saves from having to go to the movie theater if I'd rathr stay home.  I can pack up all the DVDs and equipment for viewing them and gain more storage space too. My only problem was the lack of clarity in the instructions for hooking the device up. It is very simple, but initially it's confusing. The fact that an extra cable was necessary wasn't clear to me when I purchased Fire TV either. I had to wait 2 more days for that to be delivered before I could watch.", "verified": true, "helpfulness": "1/1", "author": "Luci Blizzard"}, {"rating": 5.0, "review": "Nice.", "verified": true, "helpfulness": "0/0", "author": "Mark Kirby"}, {"rating": 3.0, "review": "Not entirely what I expected.  Plus, for purchasing was supposed to receive free membership to Amazon Prime but was charged $102.00 on January 7, 2015", "verified": true, "helpfulness": "0/0", "author": "Laverne Lawrence"}, {"rating": 5.0, "review": "Fun to watch on my big screen.  Just wish I could connect all house TVs to it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "In theory its a great idea! However, when I spent $99 on the Prime I had expected to be able to watch shows with out paying. It makes sense if they would charge for the newly released movies. I could have just done Netflix and Hulu Plus and Amazon TV, Prime is overrated!", "verified": true, "helpfulness": "3/4", "author": "Rachel Renee"}, {"rating": 5.0, "review": "I absolutely love this. Smooth interface that works well with HuluPlus, Netflix and Amazon TV. Excellent quality. No bugs. Remote is comfortable. Amazon TV is a little lacking compared to Netflix and others, so definitely consider supplementing with other programs. I have mine paired with 75mbps internet and it works very well.", "verified": true, "helpfulness": "1/1", "author": "Michael Perry"}, {"rating": 5.0, "review": "The best thing that has happened to TV", "verified": true, "helpfulness": "0/0", "author": "Derek Collier"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Chris"}]