[{"rating": 5.0, "review": "VERY EASY TOO USE", "verified": true, "helpfulness": "0/0", "author": "SADIE HEITMAN"}, {"rating": 5.0, "review": "It works great, i am such a fan i will be buying more for my other televisions", "verified": true, "helpfulness": "0/0", "author": "Joreyni Martinez"}, {"rating": 3.0, "review": "PROS: Lots of apps, easy to setup, good streaming quality.CONS: Voice search remote only works with Prime, nothing else, what is the point of having a voice search then? All other apps require you to spend lots of time, and carpal tunnel meds, trying to manually \"type\" with the remote. Prime costs $99 up-front after trial period with no option for a monthly fee, make Prime $7.99 a month and you got a deal. Also, Prime limits what you can watch for free. Still lots of movies on there that you have to buy or rent. What's the point of having a Prime subscription if you are limited in what you can do and watch? That business model makes zero sense. $99 a month to only watch a small selection of stuff? For example, my girlfriend likes the movies Spaceballs and Hogfather. They are both on Amazon Prime but both require you to purchase, or rent, for several dollars each. In the case of Hogfather the single movie is split into part 1 and 2 for some reason which requires TWO purchases just to watch a single movie not even 3 hours long! Even then it is only in SD and not HD.While the device is pretty neat and works as advertised, the proprietary nature of the device limits the functionality a great deal if you are not a Prime member. I am not sure if we will keep it or take back for an exchange at this point. The device does have its pluses but really it has no clear advantage over anything else except in the area of Prime, and only if you are a member. Otherwise, a Playstation 3 or bluray streaming dvd player can do pretty much anything this Fire TV can do.So yeah, it gets an \"okay\" rating of 3 stars since it works as advertised but that's about it.", "verified": true, "helpfulness": "0/0", "author": "J. Lann"}, {"rating": 5.0, "review": "Love it!  Has enabled us to catch up on series.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "lisenko"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV not really sure it was what I wanted.  So far, though, it has been great.  I think I like it better than purchasing Netflix monthly.  I plan to review it a few more months and if it continues to perform as expected, I will cancel my Netflix subscription.  I like the idea that it offers many of the HBO miniseries that I missed because I didn't want to purchase HBO for just a few programs that interested me.", "verified": true, "helpfulness": "0/0", "author": "csg"}, {"rating": 4.0, "review": "The product over is very good and snappy but would be nice to have new content in the prime membership after a month with prime library it gets boring pretty fast.", "verified": true, "helpfulness": "0/0", "author": "let.mk.a.deal"}, {"rating": 5.0, "review": "Much better than commercial television.", "verified": true, "helpfulness": "0/0", "author": "Ron Alexander"}, {"rating": 5.0, "review": "Really impressive.  Easy to use and set up.  The voice remote is as good as advertised.  The Amazon Prime library paired with Netflix provides you with access to almost every movie and TV show.  Easily one of the more impression electronics purchase I've made in the last few years.While I'm hardly a tech geek, many of the negative reviews are rather curious and just flat out dishonest -- Yes, Netflix works through Amazon Fire TV, in fact the Netflix signal is even better through the media player than when I access Netflix through my TV.  And ultimately any media players content is simply a function of cost.  People's complaints regarding show access, just tells me that they either didn't do their homework or they want something for nothing.", "verified": true, "helpfulness": "0/0", "author": "Vita"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Steed"}]