[{"rating": 5.0, "review": "This thing is so cheap that it would be worth the price if it never did more than it does now, but with the open-ended design and the stated intent of other content providers to get on board, it seems like a no-brainer. The move from a conventional remote control to casting your tablet view to the TV screen may not sound like that big a deal, but using it just feels way better than even a really good remote. I haven't worked up a lot of enthusiasm for casting actual Chrome browser screens onto the TV yet, but to be fair, I haven't used it that much. But for watching Netflix, etc this thing is great.", "verified": true, "helpfulness": "1/2", "author": "David Redell"}, {"rating": 5.0, "review": "The setup was a complete breeze and my wife and I use it daily. We mostly use it for Netflix, but I'm eager to see what apps are developed in the future.When the device is not in use, it displays its name, the time and date and a photo slideshow that advances every five minutes or so. It looks really nice, and if you forget to turn your TV off after casting something, it's one of the less horrible things to have displayed in your living room.There's a slight amount of fumbling involved. When you cast the first Netflix episode after waking the device up, you can't lock your phone until the Netflix app on the Chromecast is up and running. When you cast Youtube from a Chrome browser, there's a bit of confusion if you close the tab and can't remember that the chromecast button is in the toolbar.This device is small, pretty, slightly denser than you'd expect. The packaging is Apple-esque and includes the Chromecast, a USB charging cable, a USB/wall outlet adapter and a half inch HDMI extender.", "verified": true, "helpfulness": "0/0", "author": "B. Etherington"}, {"rating": 5.0, "review": "The product is great. Easy and quick set up. I reccomend for everyone using Goggle services. It is a great value for the price and a cheaper alternative for Google TV boxes.", "verified": true, "helpfulness": "0/0", "author": "René Paschier de Castro Filho"}, {"rating": 5.0, "review": "The way this works, my laptop doesn't need a cable. I don't even need to be paying attention to what's being broadcast. I can sit back and let it do its own thing. My laptop or phone can function autonomously, and that is by far this product's best success. Near realtime interactions are nice as well. I can control volume from any device rather than fumbling around for a remote. It does need more applications, but that's an ephemeral state since new apps are being developed for it and the device itself requires no change.Nicely done Google. Oh and the 3 months of free Netflix is a pretty sweet deal too.The only difficulty I had was accessing it (and protecting it) on a college campus. Since you need to be connected to the same wifi signal, a sort of tricky workaround I devised was to use my laptop to broadcast a weak wifi signal to the chromecast, and connect to it as well with my phone. The protected, private network allowed me to ensure neighbors couldn't mess with the display, and limit which of my friends could screw around with it as well. If you're on a college campus, set your chromecast up like that. There are free programs out there which enable almost any laptop to broadcast a wifi signal, get one and hook it up!Goodbye Apple TV, goodbye Roku, goodbye HDMI cables. Chromecast is now king.", "verified": true, "helpfulness": "1/1", "author": "David S"}, {"rating": 5.0, "review": "For $35, you can't beat this streaming HDMI dongle.  I'm able to plug mine into my A/V receiver and it still turns the unit on and switches to the correct input when activated.  The apps are limited, for the moment there's only: Netflix, Youtube, Google Play & Google Music.  But the potential is sky high.  Future apps have already been announced, such as Pandora and Revision3.  I'm almost positive that more content providers will be on board with this product by the time the holidays roll around.  This is a fantastic gift for anyone.  But get one for yourself!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Does what it says it does.  Just popped it on my TV and away I went. Use it every day.", "verified": true, "helpfulness": "0/0", "author": "Eric C. Heroux"}, {"rating": 5.0, "review": "Great device for $35.  Hopefully we'll see more providers move towards this like Amazon Instant Video, HULU, etc.  I've been using the device almost on a daily basis and have had zero issues.", "verified": true, "helpfulness": "0/0", "author": "GK"}, {"rating": 1.0, "review": "Just some advice... Google pushed an update today to disable the Chromecast's ability to stream media from your local devices.Now, the only reason I wanted the device was to project slideshows of my vacation pictures to my TV, it seems that I'll have to go back to using that wonderful 50' HDMI cable I bought from Amazon Basics.Once again, the DRM crowd is spoiling things assuming the only possible open source uses are piracy.I was also hoping this device would allow 85 year old Aunt Delores, who suffers from macular degeneration to port the signal from her notebook to her TV.  Apparently that also is not a good use per the DRM crowd.\"Do no EVIL\"... Yeah, Right.", "verified": false, "helpfulness": "10/16", "author": "Donald W. Campbell"}, {"rating": 5.0, "review": "It happens all the time. You stumble accrost a good youtube video and you weight the pros and cons of setting it up on your computer vs just watching it on your tiny screen with subpar speakers. Well, things just got a whole lot easier. Now when you bring up a youtube video on your phone the only thing that will stop you from bringing it up on your tv will be if you are too lazy to walk to the room with the tv in it. Also, it's great for parties.", "verified": false, "helpfulness": "0/0", "author": "Alex Waardenburg"}, {"rating": 5.0, "review": "I'm not sure why it has taken so long for this kind of device to make it to market, but I'm glad that it has. Hopefully this will lead to bigger and better internet T.V. choices in the future. A little buggy with Microsoft Silverlight conflicting - but otherwise it works well with Netflix and YouTube. I'm not sure what it will take in order to get great internet streaming from other online sources (i.e. anything that can run in chrome should stream fluidly to the TV - but it's still choppy with my connections.", "verified": true, "helpfulness": "0/0", "author": "Scott Blumstein"}]