[{"rating": 4.0, "review": "The ChromeCast originally had some major connectivity issues, which made the $99 price tag all the more frustrating with devices like Roku and AppleTV hitting the same price point.  However, now that the cost is less than dinner for 2 at a chain restaurant, there's very few reasons to complain anymore.  It has three main features that I use all the time:1)  YouTube party.  Anyone on your network can use ANY youtube connection (computer, phone, tablet, whatever) to add videos to a youtube playlist.  I've had friends over and we all chose a wife variety of stuff, from TED talks to music videos to cartoons.  Make a \"not two in a row\" rule and you eliminate arguments over who gets to choose the next video (if you're super cool like me and my friends and that was an issue in your life).2)  Casting my phone screen.  This feature is still officially in Beta (like gmail was for the first SIX YEARS), but it works solidly as far as I'm concerned.  I push a button on my phone and my photos, apps, and even camera screen show up right on the big screen.  I've even used it to awkwardly cast Skype to the TV so a whole group of people could easily skype with the person at the other end.3)  Casting movies and videos.  There's a built-in netflix app in the chromecast.  Go into netflix on your phone, connect to the chromecast, and the chromecast will display a huge netflix logo on the screen.  Click 'play' on something and the chromecast downloads and plays immediately.  The stream will even continue playing if you reboot your phone, and you can transfer remote control between devices without interrupting the movie (usually, this sometimes kills the app and you have to reconnect and resume)One feature I don't really use that I can see using more in a professional setting is casting from Chrome.  Now that casting Chrome tabs works better, I've used this feature a couple times to cast a computer screen onto the big screen to demonstrate something or just to show off. Not sure useful, but a cool feature.", "verified": true, "helpfulness": "0/0", "author": "D. McAloon"}, {"rating": 4.0, "review": "More reliable then a rocketfish", "verified": true, "helpfulness": "0/0", "author": "Terrence Francois"}, {"rating": 5.0, "review": "I bought both Chrome Stick and Amazon Fire TV Stick. I like the Amazon Fire TV Stick more than the Chrome. It comes with remote. If you prefer, you can also use the remote app on smart phone. More ways to control the TV stick!", "verified": true, "helpfulness": "0/0", "author": "hhshen"}, {"rating": 5.0, "review": "Overall my cousin said that it has been amazing to be able to stream content from his Nexus and LG Android device to his normal TV. I bought for his birthday and he just had a blast. Good Purchase!!!", "verified": true, "helpfulness": "0/0", "author": "J. Adolio Cascante \"George Adolio\""}, {"rating": 5.0, "review": "The setup is easy and the picture is great. I don't understand why anyone would pay $100.00 for Apple TV when this product does everything streaming wise at less than a third of the cost. I had trouble downloading the extension online at first but that was because my Google Chrome was outdated so if you're experiencing the same problem, there's your solution!", "verified": true, "helpfulness": "0/0", "author": "Niliezer"}, {"rating": 5.0, "review": "EXECELENTE PRODUCT", "verified": true, "helpfulness": "0/0", "author": "Márcio Leite Soares de Melo"}, {"rating": 5.0, "review": "Best $ I ever spent!!!", "verified": true, "helpfulness": "0/0", "author": "alex"}, {"rating": 1.0, "review": "Limited all around. Disappointed in Google. Expected more. Purchased Amazon Fire stick and couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Robert L. Palmer \"Rob P\""}, {"rating": 3.0, "review": "Good but not easy to program.", "verified": true, "helpfulness": "0/0", "author": "Patricia R."}]