[{"rating": 4.0, "review": "There is only one reason to buy the FireTV, and it is the remote.  It is about 90% accurate but even if I have to repeat Geore Clonney, George Clueknee, George Clooeny, or George Clooney it is faster to say it them mistyping it.  Also I like searching for Science Fiction, Flying Saucer, Love, Sex (oops).  I also pointed the remote behind the couch away from the FireTV and to the rug and the FireTV still responds.  O and by the way it does NetFlix and Amazon Prime and stuff like that too.", "verified": true, "helpfulness": "2/2", "author": "Jim C. Weatherford \"Jim\""}, {"rating": 4.0, "review": "I bought this to replace using my Wii for Netflix. The picture quality time is great, menus clear, easy to install and use. I would give it 5 stars except for 2 things. One, it cannot be turned off except by unplugging it; two if unplugged or you turn off the WiFi,  you have to uninstall and reinstall the Netflix app. So far that is all I use it for.", "verified": true, "helpfulness": "1/1", "author": "Kathie Behrens"}, {"rating": 3.0, "review": "Feels just like Apple TV, Roku, Xbox--they all seem to offer the same stuff. Good price, easy to use but again nothing special", "verified": true, "helpfulness": "1/2", "author": "Chris C. \"Chris C.\""}, {"rating": 1.0, "review": "I was very excited about the Fire TV to come out. The one thing I think my Apple TV is missing is Amazon Prime videos, and was more than thrilled to have a device that could do everything. Only to find out it does very little.I ordered it on the release day and had it one day later. I opened up the packaging (clearly a ripoff of Apple TV) and set it up, and it displayed a screen that said my software needed to update. It was a day old and needed to update??? I did so and it took almost 20 minutes to update (my cable internet was pushing 52mbps download) and then once it was set up, it was preloaded with all of my Amazon Prime information, not good. I prefer privacy, and anyone who happened to get this box before me could have simply charged anything they wanted to my account. Plus, what if I had given it as a gift? Once I began using it, I was not impressed. It claims to have a quad-core processor (why you would even think a streaming TV box needs a quad-core processor is beyond me) but it is a very sluggish interface. It was easy to sign in to my Netflix and Pandora accounts, and I was already signed in to watch Prime videos, but when I realized I can't do ANYTHING with my Kindle Fire HD or my iPad as far as mirroring or anything like that, I decided I'd had enough of the Amazon Fire TV. Spend the same amount and get an Apple TV if you want a truly versatile streaming TV box, this one simply IS NOT WORTH THE MONEY.", "verified": true, "helpfulness": "6/21", "author": "UnionU"}, {"rating": 5.0, "review": "This is a great little device and worth every penny of the $99 I paid for it.  Amazon is always a step ahead of everyone else.", "verified": true, "helpfulness": "2/2", "author": "Bill Gerhardt"}, {"rating": 2.0, "review": "This could have been a good product. The inclusion of voice search was a big selling point and I considered purchasing it.... However, voice search only works with Amazon's instant video. It doesn't do squat with Netflix or any other provider. This is the same mentality that keeps me from buying their Kindle tablet. They slather on their own code to make the use of other technologies less attractive (with the Amazon only voice search) or they totally block those other technologies (like with the tablets that can't access the Google Play Store.) If Amazon wants to put out a box that only plays in their playground, then they need to make them a heck of a lot cheaper in order to offset the disservice it causes to the customer. I was really intrigued by the fact that I wouldn't have to use a d-pad to search through letters anymore, but once again, Amazon crushes those hopes with their closed source environment.", "verified": false, "helpfulness": "3/6", "author": "J. Shulke"}, {"rating": 1.0, "review": "Nobody was more excited than I was to get my Amazon Fire TV shipment. I grabbed it from the UPS guy, ran upstairs hooked it up and turned it on! The Fire TV logo came on screen and then a message popped up saying the software in my Fire TV needed to be updated!?! This box was shipped out 2 days ago (I'm a Prime member) and arrived 15 minutes ago and it's already out of date?????So I went thru the simple steps of connecting to my wifi (that was successful) and then a new message came on screen saying \"Now updating software. Do not turn off Fire TV. Within 1 minute a message came on saying \"We are unable to update your software. Please unplug the power supply and try again or visit Amazon.com for support.\"I did as instructed with the power down and power back up...4 times. Same result each time.I came to Amazon.com and went to Fire TV Support (one of the drop down options) and it took me to the sales page for the product!!!RETURNING FIRE TV AND WAITING FOR GOOGLE TV!!!I DO NOT SUGGEST YOU BUY FIRE TV FOR A YEAR. LET THEM GO THRU THE GROWING PAINS OF RUSHING A PRODUCT TO MARKET TOO SOON. WITHIN A YEAR OR SO, THEY WILL EITHER FIX ALL OF THE NUMEROUS PROBLEMS WITH FIRE TV OR ABANDON THE PRODUCT.", "verified": true, "helpfulness": "5/18", "author": "Who Dean E."}, {"rating": 3.0, "review": "Many others have already documented the narrow focus of the voice searching to Amazon products.  This not quite as annoying to me as the lack of any support whatsoever for the USB port.  This is inexcusable from a company like Amazon whose attention to detail includes a survey on how I liked the packaging of the product!  However, as the title of this review implies, the hardware is very good.  The device is very responsive for all the services I care to use - Amazon / Prime Instant Video, Netflix, Pandora.  However, I was very disappointed when I tried to use the WatchESPN app.  The list of service providers didn't even include Charter Communications!  I'm not sure who left it out - Amazon or ESPN - but the device is Amazon branded and they are responsible for the final testing of all software and hardware - the buck stops with them.  There are several other small software glitches that I'm not going to detail here.  All together it points to a rushed rollout to me.  I'll reconsider raising my rating to a 4 or 5 if the revision 1.1 software is delivered quickly and resolves these issues. Right now, the Fire TV is the second string device behind my WD TV Live which does everything well but lacks Amazon / Prime Instant Video.", "verified": true, "helpfulness": "0/2", "author": "Garlon Arthur"}, {"rating": 1.0, "review": "I am an owner of Chromecast and ex-owner of a Fire TV.  I agree with Amazon's comparison chart, but it's simply not worth the $100 to me.  Perhaps if they offered more services like Fits.me (Virtual Fitting Room), I'll consider migrating back.Come on now Amazon, you're aiming to dominate this market space, but you're not making use of the fact that is is going to be in the living quarters.  Zappos is able to get me nice fitting shoes.  You have a large collection of clothes, why don't you put those two together and offer a new differentiating service that finds nice fitting clothing using something like a Kinect.  I need the ability to try it on virtually at the very least though :)  Specs alone can't beat a Chromecast with developer apps.", "verified": false, "helpfulness": "4/23", "author": "NLPH"}, {"rating": 5.0, "review": "Today I received my Amazon Fire TV. Setup was easy as 1-2-3! The tutorial videos are very helpful. Voice search recognition is amazing. So if you are thinking or debating to get Amazon Fire TV for yourself or anyone of your family members, don't hesitate on buying one. It's worth the money, since it operates on Android =)", "verified": true, "helpfulness": "0/0", "author": "Rick"}]