[{"rating": 4.0, "review": "Chromecast continues to improve. I use it to play youtube videos, google play music, and a few other apps. It can also easily cast a webpage from a notebook / chromebook...however if you're trying to cast a webpage that has video in it, I find that it stutters quite a bit and the audio is often out of sync. Hopefully they will improve the ability to cast a webpage that serves video.", "verified": true, "helpfulness": "0/0", "author": "Sean C \"tech entrepreneur\""}, {"rating": 5.0, "review": "The Chromecast has filled many of my obsessive media consumption needs and I use it daily.I think it works best with active subscriptions to supported apps like Netflix, Hulu+, HBOgo, etc. Without these it's just YouTube, video/music in your Play library and free versions of music apps (e.g. Pandora). But, even that's worth it for me because my really outdated computer can no longer play HD YouTube videos, so keeping up with my subscriptions on my TV through Chromecast has been awesome.+ Small, portable+ Can be powered by USB, my TV has an extra USB slot so it just loops up in the back+ Easy to use and set up+ Inexpensive+ Beautiful photo slideshow when not in use with an app- Sometimes a bit buggy when switching between shows or apps, but that might be an issue with the apps' programming- Not sure if it turns off, how to turn it off, or if I even need to turn it off- Only works with devices on your WiFi network. My computer is hardwired (is that the term?) to the modem so I am unable to Cast things from it", "verified": true, "helpfulness": "0/0", "author": "simplethings"}, {"rating": 5.0, "review": "I love this product would recommend it for others to use. I purchased it and it was great. thank you.", "verified": true, "helpfulness": "0/0", "author": "Mel Smith"}, {"rating": 4.0, "review": "I used to have two spare computers, one each connected to my two televisions.  Now, I just broadcast everything from my primary computer to whichever television I'm watching.  Brilliant!", "verified": true, "helpfulness": "0/0", "author": "Russell J Noftz"}, {"rating": 5.0, "review": "The Chromecast has taken over my living room as the main content streaming device. It's just easy; turn on the TV and watch the Chromecast quickly boot up, and it's ready to go! You can stream all your favorite contents from the sources you want from your phone, tablet, or PC. YouTube, Netflix, Hulu, HBO-GO; they're all Chromecast compatible. There is even a Cast Store you can download on your Android device that allows you to see all the apps that work with the Chromecast. Never boot up a console or Blu-Ray player just to watch Netflix again! It's so good I bought another one for my bed room.For the price, you can't really go wrong.", "verified": true, "helpfulness": "0/0", "author": "Ben Henthorn"}, {"rating": 5.0, "review": "The tv in my living room is not a smart tv. Thanks to the Chromcast, I'm glad it isn't. It's easier to just control the tv with my phone than any other smart tv. Most smart TVs have ghastly interfaces, but, with the chromecast, you can use quality apps on your phone or even from your desktop. Streaming is high quality, and it gets the job done. Great product at a great price", "verified": true, "helpfulness": "0/0", "author": "Joel K. Wilkins"}, {"rating": 5.0, "review": "Let's keep it simple: It does exactly what you need it to do, which is stream music/video/pictures etc. from your laptop, phone, tablet, etc.Setup takes less than 2 minutes. And it's tucked away behind your tv. What more do you need?If you're looking for a more full feature set (i.e. something with a remote, a qwerty keyboard, something that can play games), this isn't for you. Then again, this is $35 and is the easiest way to turn your TV into a Smart TV.BUY IT", "verified": true, "helpfulness": "0/0", "author": "TechAddict77"}, {"rating": 4.0, "review": "The chromecast works great! Watching movies from Netflix and Hulu is so much better now. I don't need cable to watch great movies on my tv! My only issue is that the Chromecast device is long and couldnt fit properly behind my flatscreen. We ended up cutting a hole in the sheet rock just to accommodate it.  Other than that, it's fine", "verified": true, "helpfulness": "0/0", "author": "Rahdee \"ChellyDynamite\""}, {"rating": 5.0, "review": "Love it Def with all the updates come to it I love it. The price was great it got to my house on time open the box set it up and I was watching my shows...", "verified": true, "helpfulness": "0/0", "author": "Damieon Love"}, {"rating": 4.0, "review": "I have not used it much but so far I am enjoying it. It will be a lot better when additional APP's are developed.", "verified": true, "helpfulness": "0/0", "author": "Brian Shover"}]