[{"rating": 5.0, "review": "Awesome product now just for waiting for HBO go to jump on...the Hulu functionality is great too I had to get one for each of my rooms very cool", "verified": true, "helpfulness": "0/0", "author": "Great"}, {"rating": 3.0, "review": "Takes a little while to figure out how to use it.Google is advertising that this ChromeCast is ready to work straight out of the box and it says you can do so much with it which is not true. The ChromeCast has a lot of limitations.I cannot connect by Ethernet to my Wireless Router and then to the Google ChromeCast. Your computer needs to have a WIFI card as well. That is stupid even though the ChromeCast is setup on my Wireless Router.I also had to disabled my Comodo Firewall to use the Google Chrome addon within the Chrome browser. Windows default Firewall does not need to be disabled.The Google Cast extension for Windows does not function at all on Win8 without a Wireless WIFI card. Keeps telling me to connect to WIFI and I'm already connected by Ethernet.I cannot stream any video from my Win8 computer to ChromeCast.Be-warned, ChromeCast is still in Beta testing but Google is selling it as a final release product which is wrong and should be illegal to do. I want a final product not a beta product because beta is known to have problems. But the ChromeCast is able to receive updates.At first I wasn't able to stream Netflix from Chrome browser to ChromeCast. This is now fixed.ChromeCast as of right now only works with Google Chrome browser and not other web browsers. I expect this to change later.I can stream YouTube fine from Chrome browser to ChromeCast. The streaming quality is very well. It's a little weird on how you stream it to the ChromeCast which is not user friendly.I can also stream video from other websites too and it streams very well.I can stream online video from my Android phone and tablet very well.I am sure that Google will fix some of the issues that I am having later as they release more updates.The ChromeCast itself is small in design and I like that. You plug it into the back of your TV by HDMI and then plug in the power adapter that came with it. I had to use an extension power cable because the power adapter than came with ChromeCast was to short.", "verified": true, "helpfulness": "0/0", "author": "Tony Harrison \"God Bless :)\""}, {"rating": 4.0, "review": "I received the unit and plugged it into my LED TV. At first the unit did not see my wifi, After a quick reboot and reset to factory settings and speaking to a tech rep the unit was up and operating.The my laptop appeared on the TV just as advertised.  Would recommend the unit to others, easy to install and if you have any issues the tech reps can take care of any issues.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey N. Campbell"}, {"rating": 5.0, "review": "Works...after a few tries.  It had more to do with all the right connections.  For what one pays for it, it's fine.", "verified": true, "helpfulness": "0/0", "author": "JL"}, {"rating": 5.0, "review": "I recently purchased the Chromecast module from Amazon. I excitedly opened my box and plugged the module into the hdmi port on my TV. I elected to use my phone to set up the Chromecast device and to my chagrin I was not ever able to connect the module to my wifi. I tried for about an hour (tinkering with my router settings)before venturing online to see if others were having similar problems. Bingo! It does not work with 5 GHz wifi anymore. You have to connect to the device using the 2.4 GHz band. Once I did that everything has been smooth sailing ever since! Originally you could use 5 GHz but so many people were having issues Google updated the modules to auto detect the stability of your 5 GHz band and use only 2.4 GHz - as per Google's help forum.I have Apple TV 3rd generation, PS3, XBox360, and now Chromecast. I will directly compare it to my Apple TV. Without a doubt it is easier to use and I have less issues with my Chromecast than mirroring my laptop with my Apple TV using Mac OS. When mirroring my Chrome browser tabs, it takes less bandwidth than mirroring my entire desktop using Apple TV. I also love that I can stream a selected tab and continue to work in other tabs when using my Chromecast and laptop combo. When I mirror using Apple TV, whatever I am doing on my laptop is mirrored to my TV. One thing I noticed is that when I am mirroring using Apple TV it is hit or miss. Sometimes I can connect and sometimes I can't and have to restart my connection. I have never had a single issue with Chromecast thus far. This issue is most pronounced when using Hulu through a web browser. I can rarely get through an episode while mirroring using my Apple TV without it stuttering to the point of being unwatchable. Sometimes I can use Apple TV and hulu without issue. I check the band channels to make sure they are not cluttered with users so I know it is not that. I want to mention that I have a super high bandwidth router. I have never had an issue mirroring my tabs with Hulu playing using Chromecast.Where Apple TV one-ups Chromecast is the resolution with which you can mirror. Chromecast is limited to 720P while Apple TV can mirror higher resolutions and is limited by your TV's resolution. Apple also has more apps available on their device.I love that I can easily switch between tabs, apps, and devices using Chromecast. Transitions are seamless.I am about to purchase another Chromecast (love it so much).  $35 dollars... can't beat that  :-)", "verified": true, "helpfulness": "1/1", "author": "J. Young"}, {"rating": 1.0, "review": "I wasted my money.  In order to get it to work it required I down loaded apps. that were not accepted by my Kindle.  I have given it to my nephew and he also has had problems getting it to work on his television.", "verified": true, "helpfulness": "1/5", "author": "jane"}, {"rating": 5.0, "review": "Is an amazing product, u can control everything from you phone. You only need a HDMI connection and chromecast  app, and ready to cast your phone.", "verified": true, "helpfulness": "0/0", "author": "Ranferi Palacios Valencia"}, {"rating": 5.0, "review": "Works great! It's a typical google product, no frills, does what it's supposed to and is easy to use. Now google needs to update the apps for it to complete the product a little better.", "verified": true, "helpfulness": "0/0", "author": "MMaki \"Retired 0369\""}, {"rating": 2.0, "review": "Works as advertised. Just follow the online setup. You do need a strong wi fi signal to watch streaming video.  Works great with my Samsung phone or my PC.", "verified": true, "helpfulness": "0/0", "author": "richard scallin"}, {"rating": 3.0, "review": "This product is nice to use but you will get frustration when you will find out that smartphone especially iPhone do not support this device even in the chrome browser. You can stream YouTube from iPhone but not other media from Chrome Browser.But you don't have this problem in laptop though.So wondering are they fixing this issue soon?", "verified": true, "helpfulness": "0/0", "author": "Basu Shrestah \"Badesh\""}]