[{"rating": 4.0, "review": "I have owned one since the day they were first available for sale and since then I have purchased two more to cover every television in my house. Early on there were only a handful of apps available that could take advantage of the casting option but as recently as this week the list has greatly expanded. I have had zero issues with lag or playback and imagine those who are experiencing issues are more blaming the wrong culprit, a slow modem or slow internet connection significantly hinders the chromecast experience as I learned the hard way when we stayed at a beach house a few months ago and brought it along. The only thing keeping me from giving it a five star rating is that when Google finally opened up casting to apps that could stream local content, they opted for ones who charge extra for that service which is a shame. The option should be built into androids galary natively to alleviate that issue or let more apps that specialize in local content have access to adding streaming options for their users.", "verified": true, "helpfulness": "1/1", "author": "R. Wahl"}, {"rating": 1.0, "review": "Ordered in July and had to wait for new production batch for delivery. The wait was OK to get something that could be so useful. It did work and I set it up on my notebook, asus android, and chromebook. It was fantastic for a couple of weeks then I slowly had to begin reinstalling the unit then it would not reinstall at all anymore. I waited until now to post this review and I don't recommend purchasing one of these unless it is made more reliable. If you are interested in one please check the newest customer ratings available before your purchase.", "verified": true, "helpfulness": "2/4", "author": "Gary"}, {"rating": 3.0, "review": "This device is excellent for online streaming, but it lacks local streaming from my nexus 7 . This is a major drawback I hope free apps will be provided to do this . Also, the cables are total mess and  not as nice as a usb thumb ( as it is advertised ).", "verified": false, "helpfulness": "0/0", "author": "Ali H. Alsaleh"}, {"rating": 2.0, "review": "Only works with Youtube and netflix. The advertisement was deceptive as it indicated that it was a wireless antennae and did not indicate that it would only work with limited applications.", "verified": true, "helpfulness": "0/2", "author": "max boggs"}, {"rating": 3.0, "review": "Works great but has very few options to stream video to tv.  I can not stream videos from my Amazon Prime or any of my personal videos or photos.  The technology is more than capable but it is another example of tablet users losing out to manufacturers trying to limit any other tablets from using their technology.  Someday developers we just agree on a standard that all tablets can utilize.  I hate to see technology held back over these issues.", "verified": true, "helpfulness": "0/1", "author": "smarty pants"}, {"rating": 5.0, "review": "Bought this device from AMAZON for $35Works perfectly.Very Similar to APPLE-TV.Simply plug into USB Slot on your TV and then you can show the things on your iPad or PC or Mac on the TV.Great for movies and TV shows you have on your personal device. Open item on your laptop, and broad(Cast) to TV.Simple.Works Great.Cheap (inexpensive)Does everything it say's it does, and more. And you don't have to be a 'rocket-scientist' to work it.", "verified": true, "helpfulness": "1/2", "author": "John M Lapoint"}, {"rating": 4.0, "review": "It is a great gadget or having your video clips or pics on your cell or tablet mirrored on your bug tv. I gave a 4 star becuase still have room to improve. For instance, no way to mirror your tablet or lab tap on the tv but for this price gets the job done. You also need to pay 2.99 on google market for the the app AVIA in order to be able to airview your video clips or pics on your tv.", "verified": true, "helpfulness": "0/0", "author": "Amir"}, {"rating": 3.0, "review": "Although it is a connivence in one way, the device's signal interferes with my modem signal so I have to unplug the GoogleCast to turn on my computer and use my digital telephone.", "verified": true, "helpfulness": "1/1", "author": "Rynnkins \"Rynnkins\""}, {"rating": 2.0, "review": "I really didn't read the description well on this product.  I assumed that it essentially displayed everything from an ipad or iphone onto the tv.  I thought I could watch my videos, look at photos and movies etc if I wanted. BUT, Chromecast ONLY works as an app on the i device that pushes either Netflix or youtube to the TV through wifi or Bluetooth. For me essentially useless.  Maybe some day they will unlock other abilities but for now I can use my PS3 or 4 to do the same thing as this...for free", "verified": true, "helpfulness": "0/1", "author": "TJ"}, {"rating": 5.0, "review": "this thing is crazeamaze.. pretty much its plug and play.. had it running in about 5 mins. what  more can you ask?", "verified": true, "helpfulness": "0/0", "author": "Robert A. Ramirez"}]