[{"rating": 2.0, "review": "THis was a disappointment. The remote was sluggish, lost sync over ten feet, and NOT as functional as our ROKU. Wanted to add TNT network/shows to the line-up and could NOT access. Our 4G Wi-Fi network works great on ROKU, but not so much on FTV. no advantage over the Smart TV/Blu-ray, w/Roku. And the remote did work at six feet, not at 10+.", "verified": false, "helpfulness": "1/2", "author": "J. Mathis"}, {"rating": 3.0, "review": "First let me say I've purchased THREE of these things.  These are far superior to Roku on ALMOST every level.  Easy to install, works well with ONLINE content (the use of caps is important here).  Works well with a NAS.  Where this device goes completely off the rails is the USB port.  It's not broken, it's USELESS!  Completely dead, non-functioning by DESIGN?!  I'm sorry but I've never in my life seen a product shipped with useless ports... on purpose!I intended to hook my third Fire TV to a 3TB hard drive with tons of movies, music, photos, etc.  Sorry, Amazon, but 5GB of 'cloud' isn't going to cut it.  To my utter astonishment, the USB port did nothing... zero, zip, nada!  No app could be downloaded to make it in any way useful.I called customer support to find out what the heck those design geniuses were thinking and I was told the USB port would be functional... 'eventually'.  It's final purpose and when 'eventually' is expected to arrive is unknown.  Great way to cripple an otherwise excellent product.", "verified": true, "helpfulness": "5/6", "author": "E. Mooney"}, {"rating": 5.0, "review": "Bought the Amazon fire TV for my son who is off to college and he loves it!  He has raved so much about it that a couple of his friends are planning to buy and ask for one for Christmas!Two thumbs up👍👍", "verified": true, "helpfulness": "0/0", "author": "sillygirl"}, {"rating": 5.0, "review": "Easy to set up, delightful to use.  Great for grandchildren games and movies when visiting.  Cost is very reasonable.", "verified": true, "helpfulness": "0/0", "author": "phil"}, {"rating": 5.0, "review": "As a former cable TV representative, I want you to know just how much I appreciate Amazon for developing Fire TV. For the average customer, the cost of cable provided video is astronomical. The vast majority of my former cable customers struggled financially to maintain services within their homes that gouged their pocketbooks on a monthly basis. I vowed never to allow myself to be put in that situation, so as soon as my ties were severed with that unnamed company, I immediately and without reservation purchased my Fire TV. As long as you have a good internet signal, the quality of this service is impeccable. There is such a wide selection of programming to choose from you'll probably never get through it all. Technology is changing at lightning speed, so don't become stymied in an industry that only wants to suck the dollars out of your pocket with a \"thanks for nothing\" attitude each month you do. I love my Amazon Fire TV and you will too!", "verified": true, "helpfulness": "1/1", "author": "Andrea"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Annette"}, {"rating": 3.0, "review": "I was expecting more............", "verified": true, "helpfulness": "0/4", "author": "Midwestern Mom"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/1", "author": "Harry"}, {"rating": 5.0, "review": "great product...", "verified": true, "helpfulness": "0/1", "author": "Marcus Devone"}, {"rating": 4.0, "review": "I'm a Prime Member and have Kindles. I think Prime members should get a discount on the Fire TV box purchase.", "verified": false, "helpfulness": "0/3", "author": "Kindle Customer"}]