[{"rating": 3.0, "review": "I went in here to buy one of these, but since I will be stuck with an iPhone for at least a year and a half I guess I won't be able to use it due to all the reviews from iPhone owners. I say \"stuck with the iPhone \" because I can't help but wonder if the problem between the Google Chomecast and iPhone/iPad could be due to Apple's proprietary garbage. A few months ago, being sick of trying to charge my iPhone on the crappy 3 foot lightning charger that comes with it, I ordered a nice six foot charging cord. It worked great and then one day there was a notice on the screen of my iPhone that said that the cord \"might not word because it wasn't \"certified by Apple.\" I then investigated and found out that when you buy a charging cord that does not say \"Certified by Apple,\" they go into your iPhone and \"update\" your system to NOT RECOGNIZE THAT CORD ANYMORE!!! Naturally, most people who don't know this and blame the makers of the cord and not the pure disgusting GREED of Apple Corp. I was then FORCED to buy a charging cord that was \"Certified by Apple\" for more than DOUBLE THE COST of the other cord (of course Apple gets their cut on the sale of every cord). And I want to state that for years I had owned Android phones and LG, Samsung, etc.....NEVER interfered with which charger cord I purchased.For these reasons I am wondering if Apple is sticking their nose into this Google Chromecast and if so, is there any way I still could be able to buy the Chromecast  and bypass any stumbling blocks to its use.  If anyone knows how to get this to work please add comment. If you want to praise Apple save it....the only reason I even have this iPhone is because my daughter talked me into trying it after my husband recently passed away and I joined her phone plan an needed to get a new phone. Between it costing me more to buy cords for both iPhone and iPad for both my living room and bedroom and all the money Steve Jobs cost owners of Kindles in 2009 with what the US Justice Department has now termed \"Collusion and Price Fixing\" scheme Jobs devised with five major publishing companies, I have just about had it with the complete blatant corporate greed that is a big part of Apple Corp business model. FYI In 2009 when Jobs was ready to put out his first iPad, he was jealous of Amazons success with Kindle and wanted to destroy them so he devised the collusion and price fixing scheme on e-books with five major publishers that double the price that Amazon could sell it's e-books to Kindle owners. For me the price for best sellers jumped from $9.99 to $17.99. Naturally everyone was blaming Amazon and they ha nothing to do with it. In fact Amazon tried to fight the price increases and lost to Apple and the Big 5 Publishers. I only found out about this two years ago. Jobs bragged about what he had done in his book ( conveniently published AFTER his death). Justice Dept investigated and now Jobs former partners in crime (the publishers) are caving in one by one making deals to make this go away and the prices are coming down a bit (finally)! If you don't believe look it up!", "verified": false, "helpfulness": "0/0", "author": "Nancy J. Boyle \"Nancy J. Boyle\""}, {"rating": 2.0, "review": "It drops the connection between my iPhone and chromecast all the time when watching Netflix and YouTube. It leaves me with the movie playing and I have no way to stop it. Google the phrase \"chromecast drops connection\". Hundreds of people have complained to google, who hasn't responded in months.If it didn't have this issue I woukd probably give it four stars.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 3.0, "review": "Disappointed i can't use for Amazon stream", "verified": true, "helpfulness": "0/0", "author": "Tom E Myers"}, {"rating": 5.0, "review": "Love it!  Great alternative to cable and super cheap!", "verified": true, "helpfulness": "0/0", "author": "Sissy Spacek"}, {"rating": 5.0, "review": "Great Product .Easy to use .", "verified": true, "helpfulness": "0/0", "author": "Shivanand"}, {"rating": 5.0, "review": "My second Chromecast !!", "verified": true, "helpfulness": "0/0", "author": "D. Lacoste Perozo Luis"}, {"rating": 1.0, "review": "I hate it. This product boasts that I can \"stream online video, music, photos and more\" to my TV using my smartphone. It claims that it \"allows to cast a Chrome browser.\" It claims that it \"works with Android phones and tablets, iPhone, iPad, Mac, Windows, and Chromebooks.\"It fails to note that it does not work with its own Chrome browser on the iPhone, neither the iPad. I'm pretty sure it is also unsupported on an Android Chrome browser. Many 3rd party apps are required, many that are for purchase only, to have the iPhone or iPad cast to my TV. Even then, not all websites works with these apps.I mostly hate this product because none of the websites I want to use it for are capable of being cast to my TV. I hate it because I do not understand why there are is no support for Google's own browser on the iPhone, while it boasts that it \"allows to cast a Chrome browser.\"Yea, it does all that just fine from my laptop. I tested this just so I am sure Google isn't completely out of their minds. But I got it because I wanted it to cast from my Apple device. It does not. I am returning it.", "verified": true, "helpfulness": "0/0", "author": "Paul K."}, {"rating": 4.0, "review": "This shows YouTube on my TV great but, don't need it for anything else.  Might be good to have if you have a P.S.4", "verified": true, "helpfulness": "0/0", "author": "D. Dooley"}, {"rating": 5.0, "review": "This is the second one I've bought.  Great product easy to set up.  I highly recommend buying it", "verified": true, "helpfulness": "0/0", "author": "happy camper"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Anne R. Lavallee \"Goodchef\""}]