[{"rating": 5.0, "review": "Great product at a amazing price.! the streaming options are a bit limited at the moment but with the addition to HBO and pandora its a good sign that streaming companies are  embracing the chromecast.", "verified": true, "helpfulness": "1/1", "author": "Antonio"}, {"rating": 4.0, "review": "It works beautifully. Setup is extremely easy. I didn't give 5 stars because many applications are not available for chrome-casting.", "verified": true, "helpfulness": "1/1", "author": "Manwarul Alam"}, {"rating": 5.0, "review": "I bought a number of these as gifts and have heard back that they are universally loved.  You could not possibly hope for a more compact streaming media intelligent device.  The bottom line is if all you are interested in is streamable media, it would be hard to go wrong with a Chromecast device.", "verified": true, "helpfulness": "1/1", "author": "Chris Underwood"}, {"rating": 3.0, "review": "Glitchy. It works for several minutes, then it'll freeze and catch up all at once. I usually end up giving up and just watching on my laptop", "verified": true, "helpfulness": "1/3", "author": "kmach"}, {"rating": 5.0, "review": "Gifted the item, and they love it. Great buy for the price. Easy to install and very smooth streaming. I heats up after a while, which always bothers me.", "verified": true, "helpfulness": "0/0", "author": "A-->Z_Buyer"}, {"rating": 3.0, "review": "I didn't rate this at 5 stars because its not working well as it i thought it would, streaming goes in and out, and audio most of the times does not go in time with who ever is talking, sometimes it get lost connection in the middle of a movie and the laptop is only about 3 feet away, this item needs improving. does not work with videos on your phone or pictures", "verified": true, "helpfulness": "0/1", "author": "Komal"}, {"rating": 4.0, "review": "Nice gadget, youtube looks amazing on the TV in HD. Netflix image quality is poor/SD at best. Very handy for watching a web clip on the TV with a few clicks. As more apps become available it will no doubt be used more often.UPDATE DEC 30: Netflix still poor quality, but Youtube continues to amaze me. I simply hit the Chromecast icon in Chrome (Windows 8) and the TV turns on and automatically tunes into the Chromecast device. Only downside is that my laptop (Toshiba with i5 4G RAM) starts to max out CPU when running youtube in fullscreen. Recommend full charge or plugging into power for long viewing sessions. Also, any video you can play in Chrome will be streamed, so now I can view any videos on network without hassle.", "verified": true, "helpfulness": "0/0", "author": "AnthonyW"}, {"rating": 5.0, "review": "Easy to use. Works very well.That is how I would sum this device up. I'm a software developer so bleeding-edge tech is not something that intimidates me. Quite the opposite actually. So I was expecting that I would need to go above and beyond to get the Chromecast working. I couldn't have been more wrong.You literally plug the thing in and follow the instructions. I installed the app on my Nexus 7 tablet and let it do its thing. I was even (pleasantly) surprised that it picked up my WiFi password from the tablet and provided it to the Chromecast for me. That was great as I was dreading typing in a 26-character password into *another* device.As for the operation, compatible apps on your tablet or phone will auto-magically find Chromecast and display the Chromecast icon (via your home WiFi network... wireless is a requirement). Touching the icon will send the content to Chromecast turning the device into a remote control. YouTube, Netflix, and Pandora all work like a charm. I've had Pandora running for hours from my Galaxy S4 to the Chromecast with no hiccups whatsoever and Netflix has worked perfect as well. It is honestly so easy my parents could handle it.The only disappointment right now is the lack of first-party apps and support. However, given the popularity of the thing, I've got to believe that will change. While it is true that you can cast from the Chrome browser to the Chromecast, you should know you need a plugin (free) and that it only works on the desktop version of Chrome. Copy-protected content (Silverlight-based content and some others like Hulu) won't stream over the tab casting feature. The mobile version of Chrome does not support casting tabs to the Chromecast (yet).This is now my go-to solution for streaming content to the TV supplanting an Mk802 android stick. Smart TVs and consoles and such are convenient but the Netflix/Hulu/etc don't get updated nearly as often on those devices (if ever). With Chromecast, I'm always running the latest version and as it grows in popularity it will only get better.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fun toy wish it supported Amazon Prime video and had a better way to stream local media. But considering the price I have to still give it 5 stars", "verified": true, "helpfulness": "0/0", "author": "Jody Grafals"}, {"rating": 1.0, "review": "i just rate it as a one star because google is not making it easy for us to use this great (in theory) gadget, this should be amazing but it is not basically if you have a smart tv with youtube in it you dont need this.", "verified": true, "helpfulness": "2/6", "author": "Alejandro Guerra"}]