[{"rating": 5.0, "review": "It was hard to set up but in the end, it was worth the wait! Picture is clear! Great product", "verified": true, "helpfulness": "0/1", "author": "Chan"}, {"rating": 5.0, "review": "Managed to get it at a discount compared with the google store price, this device is incredible and does not drain the streaming devices battery wich is a plus.", "verified": true, "helpfulness": "0/0", "author": "Luis Rodríguez Colón"}, {"rating": 4.0, "review": "It works pretty well as long as you have a strong wifi connection. We kept having some connectivity issues but overall it worked well.", "verified": true, "helpfulness": "0/0", "author": "talktorpatil"}, {"rating": 5.0, "review": "Fantastic, I can watch Netflix on my older TV.  Super easy, just plug in, add the app to your smartphone, and watch.", "verified": true, "helpfulness": "0/0", "author": "Debbie Rodriguez"}, {"rating": 4.0, "review": "It's pretty good but it doesn't do exactly what you think it uses your internet to play the video itself instead of actually playing what is on your screen so basically it just makes it like your mobile device is a remote control", "verified": true, "helpfulness": "0/0", "author": "Nathan Martin"}, {"rating": 3.0, "review": "I like this for most things. However, since it only has WIFI connectivity (and a crappy slow one at that), I get a lot of stuttering playback with Plex streaming. Lowering streaming quality helps some but doesn't prevent the issue completely.My plex server machine is beefy with plenty of speed for transcoding (transcodes 6 times faster than required). So it's definitely the wifi connectivity of this device. Not suited for Plex streaming, which is the main reason I use it. I had to switch back to my Roku 3, which streams plex flawlessly because I hardwire it.", "verified": true, "helpfulness": "0/1", "author": "Robert"}, {"rating": 5.0, "review": "This is an amazing device. I've had very few problems. Set up was amazing, and it's worked like a charm!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "We have 3 of these in the house.  Great if you want to watch netflix on a non \"Smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "Techguy2012"}, {"rating": 2.0, "review": "I bought this mainly for chrome tab casting which worked ok once I reduced the casting quality. However, after around 8 months, the device stopped working. Whenever I cast a tab, it is extremely slow and then disconnects. I will be calling google to see if this is covered under the warranty and will update this review afterwards.", "verified": true, "helpfulness": "0/1", "author": "Lashan Wanigatunga"}, {"rating": 5.0, "review": "I have it on my daughter's non-intelligent TV, She loves being able to watch netflix- I hope it evolves with more apps", "verified": true, "helpfulness": "0/0", "author": "Gclan \"Dali\""}]