[{"rating": 5.0, "review": "Fire TV surpassed my expectations. Very easy to install! Works just as nice. Too bad the new smart TVs are not this easy!", "verified": true, "helpfulness": "0/0", "author": "Kevin C. McIntyre"}, {"rating": 3.0, "review": "Would be good if you don't have a Smart TV. My Vizio already has a built in Amazon app. This is just extra clutter on the mantel.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 3.0, "review": "Only lasted 2 hours and it died. Promptly returned for a full refund. It was ok for the 2 hours it worked. After I purchased it, I received the Sling $50 credit and it can only be used on Fire TV, thus i ordered another Fire TV. Hopefully this new one last a little longer than the other. I have a Roku as well and overall the Roku is better in terms of layout and user friendliness. Fire TV is more geared and focused around Prime and app store. So if you are not a prime subscriber, i would recommend Roku 3.", "verified": true, "helpfulness": "1/1", "author": "A. Ikeda"}, {"rating": 4.0, "review": "Amazon should add more free movies.  You should be able to get onto the internet like the apple TV.", "verified": true, "helpfulness": "0/0", "author": "Dee Sav \"D.S.\""}, {"rating": 5.0, "review": "What  a great purchase  I've told several people already everyone I know will be getting  The. Fire", "verified": true, "helpfulness": "0/0", "author": "miguel perez"}, {"rating": 5.0, "review": "I'm in love with this!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "I love my fire tv, Plex and Hulu app are my essentials.  It's zippy and has no real noticable laggines", "verified": true, "helpfulness": "0/0", "author": "Joshua A. Lake"}, {"rating": 5.0, "review": "I LOVE IT, I ABSOLUTLEY LOVE IT.....but then I have never had cable tv in my entire life, so after watching my favorite show THE WALKING DEAD on a tiny laptop it is wonderful to use the amazon fire box to watch my episodes on big tv, even see free prime movies too, amazing, since timewarner said I would have to get faster internet at 59.95 a month first, well no way, my inexpensive 14.99 internet does just fine, no need to upgrade to faster internet and gigantic cable bill. glad I got it.", "verified": true, "helpfulness": "0/0", "author": "catskinner"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Robert Owens"}, {"rating": 3.0, "review": "DON'T WASTE YOUR MONEY", "verified": true, "helpfulness": "0/2", "author": "Kevin L. Mcrae \"kevin McRae\""}]