[{"rating": 5.0, "review": "Wanted to be able to watch netflix in our bedroom without hooking up a gaming device, a blu-ray player or a getting a new TV. This $35 worked great. Set up was easy Picture and sound look great. Worked with both of our smart phones and Kindle Fire. I even heard they will add more pictures. Netflix and YouTube apps worked great. Even was surprised to see some google music apps could work as well. Unfortunately the music apps (only the google apps were available) only worked if streaming music. If they add Pandora or another free streaming app it would have been perfect.", "verified": true, "helpfulness": "0/2", "author": "Johnny Neal"}, {"rating": 5.0, "review": "Works great. Once the movie or video is started it doesn't require your IPAD anymore. The resolution is always the highest available.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "You just can not beat this device. I have the Apple TV, and this is every bit as useful, but a fraction of the cost. Works great from the Apple and Android products. Surprisingly, though, not so well from the Chromebook. Go figure. Great idea for streaming Netflix and youtube to the TV.", "verified": true, "helpfulness": "0/2", "author": "Shawn and Susan Brown"}, {"rating": 3.0, "review": "Realistically the device is only a command relay to send command from your remote device to the web and then to displays what comes back from the web it on the Tv screen. That is why it works well for items that it gets directly from the web like a Youtube video. I also wanted it to share the webpage that other family members were looking at when using Amazon or bidding sites for shopping. We all wanted to see the descriptions at the same time. It is not a screen \"mirroring\" device. You will eventually see what the laptop user sees, but when they scroll, it takes several seconds for the tv screen to catch up. Still useful, and I changed the Tv resolution from HD to VGA+ to make it faster, and that helped some.In summary it has its uses, but think of it as mostly fancy remote control that will make your Tv, semi smart with web apps that you may not have had before. At the price a wonderful toy for the techno geek.9/20 observation. I saw a great Youtube compilation on the PC and wanted to show it to all on the large screen using my tablet to cast onto the tv. Well you cant always do that, when I finally found the video on the tablet (looks like the tablet version screens the results) I could not play it. A message came up saying something like \"owner choose not to make this video available on a mobile device, would you like to mark it for playng it later on your PC\"", "verified": false, "helpfulness": "2/3", "author": "Chris Zee Shutterbug"}, {"rating": 3.0, "review": "This isn't an android mini PC. This isn't like anything you've used before. Even after having used it, it's difficult for me to describe what it is. ... So, plug it into your TV, go through the awkward setup instructions, preferably through the Apple or Android app available for free, then see the two default services available for \"casting\" programs to your TV: Youtube and Netflix. These \"apps\" both work really well. So enjoy your first day's watching, then tomorrow when you try to watch again expect a puzzling time gap while the system sorts itself out again, then watch some more. You won't get \"app\" access just yet for Hulu or Amazon, but I hear and I hope that those apps are coming soon. BUT - if you download the Chrome browser to your PC or Mac, find the also-free Chromecast add-on in the Google store and install it, then go to Hulu and hit the \"cast\" button (look around for it in the Chrome tab, on the right side), you might find you have enough bandwidth in your wifi setup to broadcast shows backward (don't know how else to describe it) to your TV. Now here's where the quality and capability of your router comes in. To get a good picture, since your asking your router to have traffic going both ways at the same time, 300mbps is minimum for a good experience on Hulu and necessary for Amazon Instant Video; 150mbps won't be enough to even pull up a shoddy picture on Amazon. ... Firmware updates and more app services will imporve the operation and usability of this device greatly, so overall I think it's worth having (particularly at this price). But it's best not to expect great things from the Chromecast right now.", "verified": false, "helpfulness": "2/5", "author": "O. Elmore"}, {"rating": 1.0, "review": "updates remove apps from working not add them. not open source. boo google... thought it would be amazing it updated and its junk. just like the google tv box.", "verified": false, "helpfulness": "2/5", "author": "Jared C. Smith"}, {"rating": 5.0, "review": "easy to set up - about 5 minutes. Because it plugs into the TV you don't even know it is there (not another box to deal with). Easy to use.", "verified": true, "helpfulness": "0/3", "author": "Charles"}, {"rating": 5.0, "review": "Incredibly easy to set up and use.Awesome for killing time on YouTube or Netflix. Can't wait until more apps start coming out.", "verified": true, "helpfulness": "0/2", "author": "ViViDboarder \"ViViDboarder\""}, {"rating": 3.0, "review": "Able to send Netflix and YouTube to the tv with the device plugged into a TV.  Limited now due to such recent roll-out.  However, it will NOT work in most hotels, which is a reason I know a lot of people were interested in it.Good device, hopefully Google releases the SDK for it and there will be more availability to beam to it.", "verified": true, "helpfulness": "0/2", "author": "T. Daniel Livsey \"Daniel\""}, {"rating": 5.0, "review": "I purchased this just to test out and see what everyone was talking about, and it's now my device of choice to stream media within my home.", "verified": true, "helpfulness": "0/3", "author": "J.C."}]