[{"rating": 5.0, "review": "Exelent.", "verified": true, "helpfulness": "0/0", "author": "Edgar"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jill"}, {"rating": 4.0, "review": "I will have to say this is one of the best portable streaming devices on the market. You can watch a lot of the most popular apps used on IOS or Android operation systems, I used this with my iphone and it works fantastic. The chromecast does need to be connected via HDMI and USB, HDMI for audio and video and USB for power. Most newer TV's do come with a usb port which makes life easier instead of using the power dongle you need to run to a plug.The reason for not giving it 5 stars*The chromecast will take a while to detect on my phone so I would have to wait for the app to bring up the casting icon and if that doesn't work I would have to close the app and reopen it.*Hate that it doesn't have an actual remote, I don't like that I have to get my phone every time I want to change the TV show I'm watching or when I want to watch a different movie.Other then that this works really well and I bet it will work better for android devices because you can mirror cast which is awesome.", "verified": true, "helpfulness": "0/0", "author": "Armando S"}, {"rating": 5.0, "review": "The little gadget makes by second TV work perfectly for Netflix and other internet TV offerings. It is really convenient to be able to use a tablet as the controlling device. INstallation was easy, the instructions clear, and the results were excellent.  Go for it.", "verified": true, "helpfulness": "0/0", "author": "JRH \"j5094\""}, {"rating": 4.0, "review": "Overall it's a very good product, only once a while you have to wait for the picture to catch up", "verified": true, "helpfulness": "0/0", "author": "Robert C. Liu"}, {"rating": 5.0, "review": "works great and easy to set up", "verified": true, "helpfulness": "0/0", "author": "David says \"David says\""}, {"rating": 4.0, "review": "meh fine i guess", "verified": true, "helpfulness": "0/0", "author": "Don Snyder"}, {"rating": 2.0, "review": "Its nice if ur wifi is strong, but hard to understand how to work at first, esp personal video from your cell. But its very nice to have during the holidays.", "verified": true, "helpfulness": "0/0", "author": "Cepada R Wiley"}, {"rating": 5.0, "review": "If you know what HDMI and USB ports are and you know how to connect to your wifi, you'll be streaming from your phone/ laptop in minutes. If you don't know what I'm talking about... why are you even considering buying a wireless device that streams just about any online media from your phone to your tv? Do you even know what a youtube is?", "verified": false, "helpfulness": "0/0", "author": "daniel barry"}, {"rating": 3.0, "review": "Was nice when it first came out but loses to fire tv stick now.", "verified": true, "helpfulness": "0/0", "author": "HcP"}]