[{"rating": 4.0, "review": "I have the ROKU 3, which is very good...........so as a Prime member I ordered the Amazon Fire TV after reading the ads on Amazon.First........this amazon Fire Tv box is ahead of the others with \"VOICE COMMAND\" to search for content.Second, and most disappointing is it is just like ROKU in some ways, but not as well laid out as ROKU3.It sets up fast and downloads the latest software, and then type in your password and your ready to go............to Amazon Prime Movies only. You must download any apps for Hula Plus etc to use them.When the menu is tweeked and this box is updated in the coming months it should be the best on the market, right now the \"Voice Command\" is the only thing separating this box from ROKU 3..........and at $99 that's a large separation in price. I also notice that I could not find Redbox/verizon movies on this box that I had on my ROKU.Right now I'm using both my ROKU 3 and the Amazon fire TV box to fill in the gaps once or the other is missing.UPDATE: After 3 days use and reading many of the new reviews, I seem to agree with most of the pros & the Cons.Amazon rushed this box out too fast, it needs a little more work. If you are a first time user of any box.....than this would be like getting your first car.....nothing to compare it to.But if you already owned another box......well then you do have something to compare to....and the voice command seems to be the only PRO difference to this new Amazon Fire Tv box.AMAZON.....make this box better, take a long hard look at other like the Roku 3 and see how much more content that is really USABLE they have and go from there. I'm been a PRIME member from day one and even with the $30 price increase set to take place on DEC of 2015, for PRIME members I would think Amazon would have offered it to prime members a whole lot less than $99.The speed is good, but the interface really sucks for this box, while other boxes have built in third party apps like Netflix, Hula etc, this box requires you to download them in a separate page called \"apps\" which confuses a lot of the reviewers. Plus a lot of other apps are >>>>>>MISSING like Redbox.Lets face it if you really would buy a box to \"cut the cord\" then you would want one that would actually let you do just that.I want to watch my Prime movies free, and my Netflix for which I pay a subscription fee monthly, then Redbox also a monthly subscription fee as well as Hula Plus.........well paying all this ads up to \"THE CORD IS NOT CUT\" I'm still paying over $50 a month to watch old movies and TV.I guess I've missed the point of the Amazon Fire TV box or do you buy 3 different boxes for $300 and then you can switch around and watch .......old movies and old Tv shows.AMAZON come up with a box that will connect you an internet browser as well as the third party apps whisper net was your best idea, and it's not on the new Kindles????Fire TV...........I think for now i'll let it sit and see if there are refinements, or wait 30 days and return it and keep my Roku 3 and my Direct TV", "verified": true, "helpfulness": "3/4", "author": "PWayne \"ONMC\""}, {"rating": 5.0, "review": "I've had no issues setting it up, the voice search works well, and I like the way things are organized on the screen.", "verified": true, "helpfulness": "1/2", "author": "Eric Wilson"}, {"rating": 4.0, "review": "I had a log on issue, and Amazon was a help. Somehow my wi-fi password was off by one letter and I didn't realize it had changed. I had to whip the egg off my face. Once I fixed the operator error, the unit connected and is operating. I'm not that conversant with all the available streaming products, but this does the job for me and I am happy that it does come with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "yanquidawg"}, {"rating": 2.0, "review": "I've been playing with my Fire TV since I purchased it, and the more I use it, the more three things really stick out:1.  It's a major disappointment Amazon chose to launch this without more media apps/channels.  I had chosen to purchase this on day 1 knowing it had a limited selection of apps because I believed other features and benefits of the Fire TV would off-set being an early adopter.  But this leads to point 2...2.  There is no killer feature here for why anyone should buy one of these today.  At best there are corner cases where a Fire TV may work better than a Roku or a Chromecast.  But for us normal folks, this is a widely available recipe which has been cooked up on many other devices.3.  While the Fire TV is neither a DVR nor a live TV streamer, I'd hoped the product would be so useful that I could cut back on spending on television, premium cable channels and STBs from my telco.  It is not.This led me to ask, who exactly did they build this for?  Best answer I can arrive at are the same people who needed the \"mayday\" feature on their Fire tablets.I don't find the price for this device offensive.  I also found performance to be great, but I've used the Roku 3 and own a Chromecast, and never found those to be an issue for my basic media streaming use cases.The game apps are ok but useless, IMO.  They're the same games you can play on your smartphone or tablet, and the user experience for the game I did play through the Fire TV is better on my smartphone.If you've never touched, owned or purchased a Roku/Apple TV/Chromecast/PS3/Xbox, and your first media streamer is a Fire TV, you'll probably be blown away.If you have, unless you really want a Fire TV for a specific reason, I'd avoid it for now.  There is no killer feature or benefit yet.  It may emerge over time, but the competition won't be sitting still either.  Other devices should be coming on the market over the next few months, so you may as well wait and see what the options are in a few months.If one of the many limitations presented in other reviews is a dealbreaker for you, don't waste your $99.---------Update 4/7/14---------So I've been playing with this all weekend, and the more I toy around with it, the more I find limitations for which I find extremely frustrating.1.  The storage on this device is limited to 8 GB.  After downloading a couple games from the amazon app store cloud, I basically ran out of space.  If you are buying the Fire TV to play games, be aware of this.  This re-inforces the \"who was this built for sentiment\" because if you don't plan on playing games, ever, the specs on this are overboard and you're not getting value from the device.  If you are planning on playing games, then it's pain to know you'll have to constantly manage storage, because decent games run ~ 1-1.5 GB each.2.  Navigation is clunky.  By this I mean you have to constantly jump in and out of applications and you have a different experience with each content provider.  For example, from the home screen, if I want to open Netflix, there's a bunch of steps to jump through to get to Netflix.  I have to search for the app.  I have to open the app.  Then I can search from within Netflix.  The extra steps to find video content make the extra processing power of the Fire TV unnecessary, because that extra time getting around in the Fire TV is the same as any slowness on the competitions' search or buffering or video loading.On this point, it's extra painful if you want to switch between 2 apps.  To get from Netflix to say Hulu, you have to go home, then go find the Hulu app, then open the Hulu app, and then search.3.  The limitations of the remote become increasingly annoying.  There is no way to use a universal remote or control your television.  This is a limitation to an extent with other streamers, but at least there are workarounds.  There is no workaround for the Fire.  You will need to use your TV remote to switch inputs on your TV, control power and adjust volume.  It's annoying for the living room where I have my best media setup and this is the only one where I have to have at least 2 remotes with me and do manual switching when I want to use it.These things may change over time as well ad the UI is refined and as they iterate on hardware features, but the more I use this, the more I stand behind my rating.", "verified": true, "helpfulness": "44/52", "author": "Larvis Ladonis \"Notabuck\""}, {"rating": 5.0, "review": "I was a first-day purchaser of Fire TV and installed it immediately upon its delivery the next day. Then I forced myself to wait 24 hours before rushing to a judgment about its quality and utililty. But from my standpoint after several hours of interaction, this device is easily worth the five stars.I have not used Roku or Apple TV and thus cannot compare those two devices. I have used Chromecast, however, and Fire TV is far superior. Chromecast was lacking in the ability to cast quickly from Amazon Prime (though you can do it through a Chrome browser), and the lack of instantaneous control became an annoyance. When you are controlling Chromecast from your tablet or cellphone or whatever, stopping the stream involves first waking up your device, waiting for the Netflix app to catch up with where the stream is, and finally hitting the pause icon. It works, but it burns time.  The Fire TV remote allows instantaneous pause and start.The voice recognition system has worked perfectly for me, returning highlighted screen display of the desired search term instantaneously. Selecting that search term with the remote produces a number of expected hits at the top of the search list, but some oddball entries further down. I'm not sure what the inclusion definitions are that produce the irrelevant hits, but the number of high quality matches produced first make it impossible to mark the product down for some logical weaknesses at the bottom of the list.I am not a candidate consumer for the various sports and  most music offerings; I plunked down the money for Fire TV in order to get movies and TV shows more easily. After several hours of viewing, I have not a single complaint. Netflix in particular works without a hitch or worry for me. Prime is equally fast and easy to control. Now that I have caught up at last with the pilots for Amazon's two candidate dramatic series, Bosch and The After, I am waiting for the delivery of further episodes.", "verified": true, "helpfulness": "2/3", "author": "David Wilson"}, {"rating": 4.0, "review": "It's obvious that many of these 1-star reviews are by people who don't even have the device, which I think is unfair to the product's overall rating. Others seem to be having atypical issues that may be their own fault or will simply complain about anything. One reviewer gave this unit 1 star for reasons such as having to watch a welcome video one time that's a mere 3 minutes long (really?), complaining that boot up took almost an hour (it took less than 5 minutes for me, including downloading updates), and that the voice search takes at least 10 seconds to process and gives poor results. I have tested the voice search for at least 20 items and have never had an issue, with results popping up in 1-2 seconds every time and very accurate. This is obviously much faster than selecting letters on a virtual keyboard.My initial impressions are quite positive, while there are some downfalls. I'm sure you have heard there is no HBO Go app. I was never able to use it on my Roku either because of DirecTV blocking it, so this makes no difference for me. I think it's quite possible HBO Go will be added in the future. To me, the weirdest thing is that there is not an Amazon Cloud Player available on the device to play music from the Amazon cloud. I have to think that this, too, will be added in the near future, but this is especially strange considering it's an Amazon product. Other complaints of mine include no headphone jack in the remote for solo audio, voice search should be able to be used for more than just Amazon content, and I think the price of this Fire TV device would be much more impressive if about $20 cheaper.I wish I could give the Fire TV 4.2 out of 5 because that sounds just about right. Onto to some other things...The Fire TV interface is very similar to that of Roku, only much more fluid with none of the lag that plagued my Roku 2. I cannot speak for the Roku 3 as I never had that device. The Fire TV is noticeably faster during browsing, loading video information while browsing, and buffering Amazon content. It seems that buffering Netflix is about the same as my Roku 2, but buffering Amazon content is very fast, perhaps because of the \"ASAP\" feature of the device. Almost all videos start out in \"HD\" (720p) and soon thereafter say \"HD 1080p\" if you are to hit pause or \"up\" or \"down\" on the remote to see the status of the video quality. Also, I really like the remote, especially because you don't have to have line of sight with the device due to it using Bluetooth for communication. I was always having to point my Roku remote towards the Roku box, which negatively interfered with my desired laziness.In all, I am definitely happy I made this purchase. The improvements over a new Roku may be marginal to some, but it was enough for me to justify the purchase. The fluidity of the interface, ASAP feature, and remote were enough for me. Your mileage may vary. I hope this review is at least somewhat informative. Thanks for reading.*** UPDATE ***In December 2014, HBO Go was added. Amazon Music is also now available. I still love my Fire TV and would give it 4.4/5 stars. I put my old Roku in the bedroom, and it feels quite slow by comparison, both with navigating menus and also starting streaming content. If streaming Amazon Video content, there is no comparison as the Fire TV is much faster at starting it up. The one issue I've noticed is that it does seem to get laggy now and then. It feels like the RAM is getting used up. If I unplug the unit and plug it back in to restart, the problem goes away for quite a while (days to a week or two) but then starts again. It would be nice if there were a soft reset option in the menu somewhere so I wouldn't have to unplug it.", "verified": true, "helpfulness": "7/9", "author": "AKT"}, {"rating": 4.0, "review": "I admit to yelling \"shut up and take my money\" when I first saw this product, I clicked buy now without reading much else about it and now I'm regretting that I didn't do more research to be sure it was my best bang for the buck.... if you've read everything the FireTV does and it sounds like what you need there is no need to read on, order it and you'll be happy. If you aren't sure if it's what you need/want... read on.I was looking at this as a way to give my husband back his PS3 for at least most of the time. We have Prime and my 2 daughters and I watch a ton of programming through the PS3 so knowing that I could watch a movie from Amazon and my husband could play a game on his PS3 at the same time was all I concentrated on. Yes, it does that splendidly.It's tiny, setup was super easy (yes it does need an update but it doesn't take very long... I started it up and went and made myself lunch and it was done when I got back). I do wish there was an option to only view Prime programming (I don't want my kids accidentally paying to watch some cartoons, I did enable parental controls but it's a pain to have to enter my code every time they want to switch shows, I wish it would only trigger the parental controls if you were about to make a purchase). The picture is gorgeous. There is no pausing, no buffering, it just works.So why aren't I happy you might ask? Well after it shipped and I was doing more reading I realized I didn't just want a way to watch shows/movies via Amazon without using the PS3, but I'd also like a way to stream from our NAS without needing the PS3... as we do that a lot too. Oh and sometimes we want to watch an actual dvd or blu-ray... the other reason we're forever hogging his PS3. I then realized that for LESS money I could buy a Sony blu-ray dvd player that connected to Amazon, and would easily connect to my old NAS (that can not run Plex on it's own) so I could stream through it. Wait... so for less money I could not only do everything the FireTV can do, but I can also stream easily from my NAS AND play blu ray dvd's? Yes I'm going to miss out on voice search if I go that route, but I think what I gain makes up for it.If Amazon adds the ability for me to stream from my NAS easily (dedicated channel or app or something... not sure how those things work and I won't pretend to know, all I know is that my PS3 can see my NAS and it just works, heck I use Skifta on my FireHDX and stream from the NAS easily... I'm not sure why it's not possible with the FireTV. I thought I might be able to get around this by using 2nd screen with my FireHDX but see it only works for Amazon purchased content, so no luck there.All in all the FireTV is everything they say it is, and it's great if that's all you want/need.... however there are other options you might want to consider first.", "verified": true, "helpfulness": "4/4", "author": "@homemom"}, {"rating": 3.0, "review": "I purchased the Amazon Fire TV on the day it was announced.  I received it, and opened it, but never plugged it in.\"How can a guy that has never used something post a review?\"Glad you asked.I purchased the Amazon Fire TV the moment I saw that it supported PLEX (if any of you have content stored on a NAS or a remote computer that requires streaming, you'll want this).  That was the selling point!  I wasn't too concerned about the lack of HBOGo or the fact that a lot of the channels are duplicates of what is already available from the AppleTV or the Roku3 (I own both).  I was enamored by the amazing hardware specs on the Fire TV and the future potential of the device.  I couldn't say no!\"So why didn't you keep it?\"I'm getting there.Anyway... I started reading the fine print concerning Showtime Anytime and how it doesn't allow DirecTV subscribers to stream over the FireTV. I also found the Roku3 finally allows HBOGo and Showtime Anytime streaming for DirecTV subscribers.  Not only that, the Roku3 supports PLEX!In the end, I couldn't justify even hooking it up.  The Roku supports everything that the Amazon Fire TV doesn't support, and the AppleTV covers everything else.The Amazon Fire is beautiful in its design and feels like a quality item.  Some have given Amazon flack for going with an external power source over and internal AC to DC converter, but who cares?  What does this have to do with the price of tea in China?  Besides, if the power adapter goes bad on the Amazon Fire TV, you can buy a new adapter!  If the much-coveted internal AC/DC converter in the AppleTV goes bad, you are either buying a new AppleTV or learning how to solder.What's my point?  I'm not sure.  I think I believe that there is room for everyone.  No particular device has gotten it completely correct yet.  If Amazon Fire TV, with it's gaming potential and application support, had the content of the ROKU3, they could have a sure-fire (no pun intended) AppleTV contender.Notice I said \"contender\", not \"killer\".  Nothing will ever kill the AppleTV. There are entirely too many people who are firmly planted in the Apple ecosystem and no options available to them to transplant their content.I believe, in the end, we will all either adopt one ecosystem or the other, or suffer through the inconvenience (it's absolutely horrible - worse than Rwanda) of having two devices:  one that supports our Apple addiction, and one for everything that Apple loathes (Android, Google, Amazon, etc).At this point, the Roku3 clinches it, for me.In the future though, I'll probably be back to purchase a Fire TV.", "verified": true, "helpfulness": "5/18", "author": "Non-Partisan Viewer"}, {"rating": 5.0, "review": "I wasn't planning to write a review, but I was intrigued by seeing so many one-star reviews. After reading how moronic 99.5% of them are, I decided to give an actual review, made by someone who actually owns an Amazon Fire TV device.Right out of the box I loved the minimalist design of the box and the remote. You can feel and see the quality of the product. The setup was easy and I was able to complete it without a hitch even though I'm far from a tech wizard. The fact that it was linked to my Amazon Prime account at start up was also a plus. The first thing I did was play around with the voice search feature and it worked remarkably well. It works only with Amazon Video content, but I hope it's implemented for other services, like Hulu Plus, which has always been a pain when it comes to doing searches. I picked a movie from my watch list and was blown away when it started playing immediately. There were no playback of buffering issues. I paused several times for more than five minutes and discovered there is a nice screen saver feature to protect the TV screen. Play resumed without a hitch.After that, I downloaded the services I have or I'm interested in and they all worked fine. I couldn't find my wishlist in Hulu Plus but it might be I didn't look hard enough, or it's something they have to add later. Pandora sounded great in my surround system and I'm happy to finally be able to see ESPN3 content on a big screen.I look forward to a \"HBO to Go\" app in the future and another one from \"You Tube\". There is \"You Tube\" content available, but it's through a third party app. The only complaint I have is fairly minor. The packaging was easy to open, but the AAA batteries for the remote come packed in industrial strength, almost indestructible plastic. After several attempts I just grabbed a knife to cut it open. Something for the \"easy packaging\" people at Amazon to work on.In short, ignore the mostly idiotic one-star reviews. If you're looking for a streaming device, Amazon Fire TV is the one to have.UPDATEAfter using FireTV for three weeks, it's hard to imagine I ever did without it. Streaming HULU on the Blu-Ray player was pretty much useless. A two hour movie would take two and a half hours to watch with all the buffering. I thought the problem was the HULU service and unsubscribed from it, but with the FireTV HULU works flawlessly. I've been an Amazon Prime member since day one, but I hardly ever used the Prime Video benefit. Since I got this little box Prime Video has become my number one source for nightly TV watching. If one could only get apps like Watch ESPN and HBO Go without having to pay for cable, I would be able to do away with high cost cable TV.Fire TV is the best value for the money ever.", "verified": true, "helpfulness": "7/8", "author": "David Vidaurre \"Count Westwest\""}, {"rating": 5.0, "review": "My wife ordered this as soon as we saw it, and read up on it.  We haven't had time to go through everything yet, but it was delivered, in working condition, very quickly.  I really like that they had plenty available before it was announced, so you could get it right away, and not have to wait for it.  Set-up was extremely easy and fast. From the little bit we have used it, it works great.  Most of the negatives that I have seen are not a problem from our point of view.We will post a more in depth review after more use.", "verified": false, "helpfulness": "2/3", "author": "PugDaddy"}]