[{"rating": 5.0, "review": "works like the book says!", "verified": true, "helpfulness": "0/0", "author": "william l mable III"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Donald Raff"}, {"rating": 5.0, "review": "Love my Chromecast.I don't have cable, don't want it. Commercials drive me insane.But I do have Netflix, HBOgo, and HuluPlus,  Being able to control my TV from my phone is the greatest!  Never have to search for the remote!I just wish that CBS would make a Chromecast friendly app...", "verified": true, "helpfulness": "0/0", "author": "Issa"}, {"rating": 5.0, "review": "This is a great device for anyone who does not have a smart TV. I do have a smart tv and also an Amazon Fire Stick.The Chromecast is definitely better than the basic smart tv apps that come with most major television brands. It is faster streaming and easier to use. The screen sharing from a desktop is probably the best feature of this device, which also sets it apart from the others for me. Also, Google has great offers and giveaways through the Chromecast offers page. It you own a Chromecast, check that page often! I recently got $6 to Google Wallet for the Play Store and Xmen 1 for free.I do tend to use the Fire Stick over the Chromecast for Netflix. The Fire Stick is just faster and I like having all the apps in one place on the Fire Stick as opposed to opening apps on a device and connecting to the Chromecast to stream. That is just my personal preference and would love if Google would build a similar app center on the Chromecast.If you want to be able to screen share from your desktop or device, get free offers, and also access smart tv features while traveling, pick up a Chromecast. It is great for this. Also, currently the Fire Stick doesn't have HBOGo but the Chromecast does. This is a great purchase for a relatively cheap price.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Set up was straight forward and took less than 10 minutes.  Do use a computer though and iPad would be awkward.  The unit works flawlessly.  Video quality is fine. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Robert Reid"}, {"rating": 5.0, "review": "Use this with showbox.apk which you can google and download, then download localcast from google playstore.  Google how to use these together and watch any movie or tv show you could think of.", "verified": true, "helpfulness": "0/0", "author": "Juan A."}, {"rating": 4.0, "review": "does what it's supposed to do. convenient.", "verified": true, "helpfulness": "0/0", "author": "thanh au"}, {"rating": 5.0, "review": "easy to use, no problems streaming net flix", "verified": true, "helpfulness": "0/0", "author": "laurie anne wallace"}, {"rating": 5.0, "review": "Much good", "verified": true, "helpfulness": "0/0", "author": "Alex La Chance"}, {"rating": 5.0, "review": "I love chromecast, easy to connect and use.", "verified": true, "helpfulness": "0/0", "author": "Angelica Wood"}]