[{"rating": 5.0, "review": "I have been a fan of Google since they came up with Android OS and they managed to deliver perfection with Chromecast too! First of all, you cannot beat the price. Originally, it is advertised as $35. However, if you wait for the right moment, you might be able to get it for cheaper. It comes in a relatively small box. Your TV needs to have an available HDMI port for you to be able to use this item. In order to power Chromecast up, you also need some sort of a USB connection. Most newer TVs have a free USB port next to their HDMI connectors. If yours don't, Chromecast comes with a power adapter that you can plug into the wall. The USB cable that comes with it is long enough to cover both scenarios and it also has an attached Velcro strap that you can use to contain the excess cable. I have the Verizon FiOS wireless router. The setup of Chromecast was very easy. I used my Android phone to set up the whole thing. You will need to go to the Play store and download the Chromecast app on your phone if you want to use your phone. The rest is just following the steps. It took me about 2 minutes to complete everything. Once Chromecast was ready, I tested it with Netflix, YouTube, HBO GO, Pandora apps on my phone. At first, nothing was working. I wasn't able to get any of the apps to start casting to my TV since the cast button wasn't there. I just waited a couple of minutes and tried again and it worked without any problems. I guess it takes some time for all the apps to detect your Chromecast. I did try casting tabs from my Chrome browser also and it seems to be working great. I'll mainly be using it for Netflix and Pandora.For those who are complaining about the limited number of apps available to Chromecast, I'm sure Google will be adding more and more apps soon (see the currently supported app list here: [...] For now you can use Chrome browser on your computer to stream videos from other sources to your TV.", "verified": false, "helpfulness": "1/2", "author": "Cem Sahin \"Cem\""}, {"rating": 5.0, "review": "Worls as advertised. Hopefully amazon video app will be released soon. Like others point i dont have any wifi issues.", "verified": false, "helpfulness": "0/0", "author": "vamsee"}, {"rating": 3.0, "review": "Pros:Permits the casting of you tube and Netfix videos from the computer to the TV. One can also cast a Tab from the Chrome browser to the TV or your desktop.Cons:VERY limited instruction come with the unit.The reset button sometimes get stuck and prevents launching of chromecast software,Need a computer or tablet to operateThere is a Lag between operationsMy recommendation is log into you tube watch a few videos on the subject before purchasing it.", "verified": true, "helpfulness": "0/0", "author": "RD \"RD\""}, {"rating": 5.0, "review": "Have the chrome cast now need to get a app to operate it from my android tablet nothing seems to work in the apps.", "verified": true, "helpfulness": "0/0", "author": "Robert M. Miller"}, {"rating": 3.0, "review": "Got this as a gift.  While it does do what it is intended to do, it seems that \"Google\" has a few glitches to work out, which I'm sure they will do. Very convenient to watch your computer on your tv.", "verified": true, "helpfulness": "0/0", "author": "Kelly D."}, {"rating": 5.0, "review": "so easy to use and set up. I can stream my netflix and youtube videos right from my phone to my computer.", "verified": true, "helpfulness": "0/0", "author": "Jhysada LoPiccolo"}, {"rating": 4.0, "review": "Great for youtube.  Not so great for just watching computer stuff on your TV.  I use Chrome already so I was primed for using this tool.  What needs to be known is that it shows what is on the browser, not what you can see otherwise.For example, I can get a football game on a small window on a browser.  I can set it to full screen on my computer but it won't go to full screen on the browser,. It doesn't broadcast full screen to the TV.Youtube and some other apps have written bits that let you broadcast them to fullscreen.  Wider adoption is bound to impact the features available.I give it a 4 because it's the best available.", "verified": true, "helpfulness": "0/0", "author": "buck"}, {"rating": 1.0, "review": "Not sure why, but nothing I do will let me get through the setup.  I've reviewed everything I can find on setup problems, and nothing seems to make any difference.  My main router is wired-only, with a WiFi access point running off of it.  No amount of twiddling with the setup of either the wireless or wired appliances will get this thing connected to my WiFi. I get as far as entering my WiFi password, and it chokes with an error that it can't connect to my Chromecast on the network, then it drops back into setup AP mode.  I'm going to let a friend who has one working on his home network try it out to see if it's my network or a defective unit.  I don't doubt those who've had no problems, but for me so far it's a bust.", "verified": true, "helpfulness": "0/0", "author": "Scofreyjet"}, {"rating": 2.0, "review": "Netflix's iPhone app and website player have bugs that still haven't been fixed since the Chromecast's release in July.It will not play the next episode automatically, and the website's playback control buttons while casting are buggy.Pandora Radio's website does not have casting integrated yet.YouTube's website player while casting has bugs with volume levels, and playback sometimes restarts.Google Chrome's Google Cast extension says it is casting when it's not.Casting tabs is very delayed, and I cannot seem to fit the entire tab on my HDTV using the available extension options.I expect more out of the Google Chromecast considering its popularity and how long it has been available.", "verified": false, "helpfulness": "0/0", "author": "Chaz"}, {"rating": 3.0, "review": "U cannot watch amazon prime on it. It good idea though. U can not watch any thing other than YouTube and Netflix.", "verified": true, "helpfulness": "0/1", "author": "Joe"}]