[{"rating": 5.0, "review": "I just purchased Amazon Fire TV and I love it! Easy installation. Recommend buying the USB cable ( 5.99 extra ). Navigation is easy and the voice command really works with the remote. Was a little disappointed that so many movies are for purchase but with Amazon prime there is no purchase for their movies. Great screen saver scenes from around the globe. After viewing my Amazon Fire TV, my neighbor ordered one for her family. Great product!", "verified": true, "helpfulness": "0/0", "author": "Mrs. J."}, {"rating": 1.0, "review": "All I get us a black screen. I keep calling amazon for help and I go through the same checklist over an over.  Can Someone please help.I have never had a problem w amazon but this is painful.Youtube works. But amazon prime on demand comes out a blank screen like in pause mode indefinitely. When I FF I see the video in the bottom left in small but no sound. Please HELP", "verified": true, "helpfulness": "1/4", "author": "Stephen Gruber"}, {"rating": 5.0, "review": "We are enjoying this product along with the movies and the games.", "verified": true, "helpfulness": "0/0", "author": "Charlotte L. Melching \"Char\""}, {"rating": 3.0, "review": "I also have Roku and I see very little difference. The \"VOICE\" option does not work. I would not buy one. The only reason I have Amazon Fire TV is it was a gift.", "verified": true, "helpfulness": "0/0", "author": "Chris Scott"}, {"rating": 5.0, "review": "I like the controller. It is very easy to use once you have signed up. The voice recognition is great.", "verified": true, "helpfulness": "0/0", "author": "emily"}, {"rating": 5.0, "review": "I love the technology.  Amazon fire TV ks amazing.  So easy to install and use that even a novice such as I can enjoy it immediately.", "verified": true, "helpfulness": "0/0", "author": "David L. Meredith"}, {"rating": 4.0, "review": "Other than the occasional missing images in the feed while browsing, the Fire TV is an amazing little streaming device, and a must for any Prime Member.I'm not new to the streaming world, and have bought and tested almost every streaming device imaginable, back to the very first Roku before anyone ever knew what Roku was. The Amazon Fire TV holds its own with the best of them.For gamers, the Amazon Fire Controller is a must have accessory and adds even more value to the Fire TV. Gaming works great on it, but the storage limitation causes a few issues,  especially for those who want to play some Grand Theft Auto on their new device.Overall, the Fire TV is off to a great start, and will only get better with time as improvements are made.", "verified": true, "helpfulness": "0/0", "author": "Troy Bishop"}, {"rating": 5.0, "review": "Hello beautiful Amazon product ćáÇßä applications and games no problem in loading Is the device does not work, but America Mhzh problem because I of Libya ...... Thanks", "verified": true, "helpfulness": "0/0", "author": "alwhe"}, {"rating": 2.0, "review": "Its know better when Roku and cost $20.00 more,For the voice it only works when it hear the name said five times.Then every pick is a pay one.It is easy to use but same for Roku.Next its cost $20 to pick something to pay for.I ask for Bad Ass movie and on Netfix it was free and on Amazon you pay.", "verified": true, "helpfulness": "1/1", "author": "Vincent Galatolie \"COUSIN VINNY\""}, {"rating": 5.0, "review": "I love it. It does everything I need it to do plus more.", "verified": true, "helpfulness": "0/0", "author": "Rigoberto Lemus"}]