[{"rating": 3.0, "review": "Relatively useful if you have an android tablet only. I have an Android TV that I use, this makes it less useful then it should have been.", "verified": true, "helpfulness": "0/0", "author": "Kah Koi Wong"}, {"rating": 5.0, "review": "IT's simply awesome.Only real negatives is you have to broadcast your ssid and you need to use chrome web browser to cast. (which isn't so bad)NOTE: need a wireless device to configure it, after that a wired pc hooked up to the same network can control it just fine.Also, I would suggest at least a N wireless router.", "verified": true, "helpfulness": "0/0", "author": "Powpow"}, {"rating": 4.0, "review": "A nice way of streaming apps from your phone to your tv but past using your phone there isn't much else you can use it for.  There is almost nothing on the PC that can stream to it unless you use Chrome web browser and it was a little buggy last time I used.  I use it occasionally but it doesn't replace a streaming box for Netflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Timothy"}, {"rating": 1.0, "review": "Could not get this to work for me.  I'm not Steve Job's, but I can follow direction pretty good and this just didn't work for me.  It may be I didn't understand or set it up properly, but I was not impressed.  I have not used it nor will I try to in the future.", "verified": true, "helpfulness": "0/0", "author": "E. F. Kraski"}, {"rating": 5.0, "review": "What a cool little device. I've since purchased a second and use them all the time.", "verified": true, "helpfulness": "0/0", "author": "JNB"}, {"rating": 5.0, "review": "Everything is good from on-time delivery, easy set-up, wifi performance, to overall experience.I used it to watch Youtube and Netflix only in the past 3 weeks. That's pretty much what I need from this stick.There's one small glitch that it may freeze up after running for a couple of hours if I keep loading different video clips like every 5-10 minutes. There's no problem if I was playing a long clip even for 2-3 hours.When glitch happened, I simply power off then power on the Chromecast and it's good to go again.Given the low low price tag, I give it a five-star even with that small drawback.", "verified": true, "helpfulness": "0/0", "author": "mn543 \"mn543\""}, {"rating": 5.0, "review": "Its basically an internet connection for your tv and your computer/device acts as a remote. Very interesting how this thing works but its fantastic!", "verified": true, "helpfulness": "0/0", "author": "Colton"}, {"rating": 4.0, "review": "A little glitchy at times but overall a good investment.", "verified": true, "helpfulness": "0/0", "author": "AM"}, {"rating": 3.0, "review": "The connection keeps dropping. And it's not the internet because it works perfect on someone else's dongle.I must have received a bad dongle.", "verified": true, "helpfulness": "0/0", "author": "fanita \"geek squad\""}, {"rating": 5.0, "review": "Excellent!!!", "verified": true, "helpfulness": "0/0", "author": "Edgar Fdz"}]