[{"rating": 5.0, "review": "I have in my possession two other devices which performs similar as the Amazon fire but Amazon fire to me succeeds  over the other two. They're all very easy to set-up but one very important feature that the Amazon fire has the others don't and I'm very very happy with it is the fabulously easy way to use the search feature. Most people like myself finds it very tedious to punch in letters up down sideways crossways and don't make a mistake, No No Not That!!  But with the Amazon fire remote you only have to use a button and speak into it and it finds whatever you need quickly and efficiently. And to me that's everything not only that I must mention the Amazon fire is quick very fast! This is why I give it five stars!", "verified": true, "helpfulness": "0/0", "author": "Marcy"}, {"rating": 5.0, "review": "Although I haven't used it much yet, I am impressed.  Voice recognition works well.  Choice of Amazon movies and shows is excellent.", "verified": true, "helpfulness": "0/0", "author": "Robert T. Hawkins"}, {"rating": 4.0, "review": "I have been looking for a device which would give me the ability to reduce my cable company to the most basic level of service or to eliminate it completely. As I am using Amazon Fire TV I am becoming more familiar with what is available as a user of the device, what is available as an Amazon Prime member and what would add unexpected costs. It would be useful if there was a guide which clearly covered the things which are free and which cost as well as give a clear understanding of whether an app is really useful or is redundant in some other app function.", "verified": true, "helpfulness": "1/1", "author": "Adrian"}, {"rating": 1.0, "review": "Bad remote, freezes , apps freezes on their own, needs more apps, needs more memory too.I would go with Roucko", "verified": true, "helpfulness": "3/12", "author": "Taif Rady"}, {"rating": 5.0, "review": "I just makes the apple tv look stone agedI still need two more for my houseI think it is such a great device withoutAll the apple issues they are having since steve jobs died. Apple is going down hill sofast they dont even fathom what is happening to themI personally sold everthing i have bought from them and that was alot.they need a ceo thats similar to steve jobs like elon musk who has passion like steve did and not just worry how much money is in the bank.that comes later when you can prove you have the inventivnessAnd care whats going out the factory door rightNow its just baby steps and thats not appleI give them mabey a year if they will get off their but and just do something anything before its to late the larger you are the harder you fallAnd for them it has happened once . i would hate to see it happen but they are going downThat hill this minute just do something appleBefore you loose the confidence in peopleYou already lost mine and that sad.....", "verified": true, "helpfulness": "0/1", "author": "Edward Y."}, {"rating": 4.0, "review": "I bought a Roku last year and I did like it but found I mostly used it to watch Amazon Streaming.  So when Amazon Fire TV came out I purchased it at the first opportunity.  I am not disappointed at all,  I even ordered a game controller in less then a week after purchasing the Fire TV Box.  The Search is great and I have tried to confuse it and so far it has about 98% accuracy. The movies stream quickly and look good.Now for the improvements.  I have not downloaded 14 apps, this includes music, news and game apps and currently I have 1.93GB left but the fire is constantly hounding me to remove apps because memory is getting low.  There should be either a way to add additional storage either through the USB port or add a SD Port and allow for an SD Card for added storage.In addition Movies and shows available through Prime should be easier to scroll through, perhaps by adding a Prime area that shows only whats available on Prime and then allow the user to break that down for example I want to find a SCIFI Movie on Prime I should be able to see what is available.Overall the Amazon Fire is outstanding and I cant wait to see what comes next.", "verified": true, "helpfulness": "1/1", "author": "Patrick G Ketelaar"}, {"rating": 5.0, "review": "I love this! I bought this because I wanted to watch my shows on Amazon on a TV not a computer and also watch netflix. I couldn't be happier. Easy to use and worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jennk89"}, {"rating": 5.0, "review": "I got this for mother's day and love it. Very user friendly and easy to use as my Kindle. I'm glad to have it.", "verified": true, "helpfulness": "0/0", "author": "barbwire802"}, {"rating": 4.0, "review": "What is the default PIN (5 digit existing PIN)?I cannot find any where.We cannot let kids to use without it.-----I thought we can set up the PIN in the device with some default PIN.But it needs to set up on web browser first.Here's the link (after logged on Amazon):https://www.amazon.com/gp/video/settingsThank  you.", "verified": true, "helpfulness": "0/1", "author": "Naoki Hada \"Mobile Presenter\""}, {"rating": 4.0, "review": "I just wish I could get some the apps I love. Not sure why it will not let me downloadany app.", "verified": true, "helpfulness": "0/0", "author": "Melissa Gonzales"}]