[{"rating": 3.0, "review": "I bought my second Chromecast when it went on sale.  It is an imperfect solution compared to what I am looking for; however, is needed for trips with the kids, etc...Good:I really like that for some apps (don't know if it is all or not), like MLS matchday, that once a connection has been established to play a game that the steam comes from the internet and not through the tablet allowing the tablet to be turned off!Bad:The setup is a little cumbersome; however, not sure how to really make it any easier since you need to establish the connection to your wifi network and setup to be seen by other computers/tabletsThe only way I have found to steam content is to spawn it through a tablet, This is simply a smart TV component, not sure why I can setup Netflix, MLS matchday passwords and bypass the table all together, and only stream for specific content on tablet.UGLY:This is fairly limited in capability, apps or computer programs must be setup to work with Chrome cast.  Simply not enough content; however, for workouts the cost is right to be able to play some content during the 45 min of workout.I am still awaiting a real capable mirroring or application streaming on TV process that works for everything or a screen mirror, I haven't tried WIDI yet as I don't have a computer that is capable.  I suspect that will meet my needs and plan to get a Widi capable computer/tablet the next cycle.", "verified": true, "helpfulness": "0/0", "author": "GI"}, {"rating": 5.0, "review": "excellent device.", "verified": true, "helpfulness": "0/0", "author": "dr. egg"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Laynne S. Gensler"}, {"rating": 2.0, "review": "I love Google products, and got the Chromecast when it was on sale on Black Friday 2013. It came, I set it up, it worked great. Used it for a few weeks, worked great. After that, it stopped working. I tried every thing possible that I could ever try. Every instruction manual provided by google on how to reset it, set it up, anything on the subject. The TV is about 20 feet from my router, this thing would not connect to my home WiFi. I googled the issue, changed some settings in my router admin panel as advised by some others having the same issue. But nope, this thing would not work. I started to get annoyed. After about two months of trying to get it to work, I unplugged it. Now, it is sitting somewhere in my house, and I get angry everytime I see it, total waste of money and time.", "verified": true, "helpfulness": "0/0", "author": "Vikramjit Singh"}, {"rating": 5.0, "review": "great product fast service", "verified": true, "helpfulness": "0/0", "author": "Eriq Acosta"}, {"rating": 5.0, "review": "Perfect just what I needed.", "verified": true, "helpfulness": "0/0", "author": "RW"}, {"rating": 5.0, "review": "I no longer watch much TV anymore as I use this to stream shows from Netflix!", "verified": true, "helpfulness": "0/0", "author": "Heather L. Comeau \"artlover\""}, {"rating": 5.0, "review": "Awesome. Ive used it daily for months with no issues. I mainly use it for HBOgo, Netflix, and my Google play movie library and rentals. But it also works great for casting my screen on either of my Nexus devices to show people in the room something. I also use it to play music through my TV (songza, Pandora, etc...). And what a fair price for this great piece of tech.", "verified": true, "helpfulness": "0/0", "author": "J. Wyatt"}, {"rating": 5.0, "review": "Awesome product and you cannot beat the price!", "verified": true, "helpfulness": "0/0", "author": "Jordan Shaw"}, {"rating": 5.0, "review": "great for HDMI streaming.", "verified": true, "helpfulness": "0/0", "author": "Olivia Lang"}]