[{"rating": 2.0, "review": "Works, then doesn't work. Why can't anyone make something that is easy to hookup, easy to setup and use.", "verified": true, "helpfulness": "1/1", "author": "MovingTarget \"referee5038\""}, {"rating": 5.0, "review": "Love, love, love it", "verified": true, "helpfulness": "0/0", "author": "Jellybean15"}, {"rating": 5.0, "review": "That was easy. I opened the box, plugged the device into my televsion, downloaded the app for my phone, and was watching TV from my phone in about the same time it would have taken me to turn on a cable box and pick a channel. I'm leaving this review on my phone with Sportscenter streaming from my phone to my TV in the background. This is an excellent product. So far, this has been the easiest and most successful setup of any AV technology ever.", "verified": false, "helpfulness": "0/0", "author": "HokiePaul"}, {"rating": 5.0, "review": "Makes streaming from anywhere easy to my tv.Makes a great gift!A++", "verified": true, "helpfulness": "0/0", "author": "Jovanni"}, {"rating": 5.0, "review": "i bought this as a gift for my aunt. she loves it. no complaints.", "verified": true, "helpfulness": "0/0", "author": "OhMollie"}, {"rating": 5.0, "review": "Is your tv dumb, do the other tv's make fun of your tv on the play groud? Well not anymore this bad boy brings a dumb challanged tv up to spec for watching netflix anyways which is all I have used this for. *** Disclaimer does not make you tv feel any better about it self or make your tv a smart tv in anyway.", "verified": true, "helpfulness": "0/0", "author": "Matt Piekarski"}, {"rating": 3.0, "review": "Firmware is buggy. a lot of times i wont be able to connect from my laptop (casting from youtube)Was able to work around it by opening up a new tab and forcing it to cast the whole tab, instead of just casting it from youtube - this sucks because it feels slower and the videos do not automatically queue.I think it can be a lot better and google needs to step it up, or it will lose customers to the amazon fire box", "verified": true, "helpfulness": "0/0", "author": "ballerindian"}, {"rating": 5.0, "review": "Great little gadget, works well with netflix and any other stream. With some app and extension installs this is a very powerful and useful little tool!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm in Love with My Google ChromeCast!!!!Best Choice Ever!", "verified": false, "helpfulness": "0/0", "author": "AndThenThereWas.."}, {"rating": 5.0, "review": "Made my life easier.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]