[{"rating": 1.0, "review": "Amazon Fire is a good product however it's menu and searching can be troublesome especially when compared to Roku", "verified": true, "helpfulness": "1/3", "author": "Ed"}, {"rating": 4.0, "review": "Love Amazon Fire TV, especially for Prime video viewing.  Netflix was a disappoint however, as the Fire TV did not save my login on the device.  Maybe it is something I am doing wrong, but other than that, great product.  I enjoy it more than an Apple TV I have on another television.  The Netflix issue was the only reason this was not a 5 Star experience.", "verified": true, "helpfulness": "0/0", "author": "Peter Vessenes"}, {"rating": 5.0, "review": "Netflix and Prime shows work smoothly and no issues.  Great usability with any HDMI capable screen for the price.", "verified": true, "helpfulness": "0/0", "author": "Joe Dauner"}, {"rating": 5.0, "review": "Love", "verified": true, "helpfulness": "0/0", "author": "K. Hayes \"Live life\""}, {"rating": 5.0, "review": "I am impressed by the simplicity of operation and the massive amount of movies and TV shows that are available. I am a Prime member and there is more viewing possibilities than I can ever have time to watch so sit back and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Steve Peterson"}, {"rating": 4.0, "review": "My Amazon Fire TV was very easy to install (ordered 2) and I'm now enjoying it. The only issue I had with my Fire TV was the remote being shipped with dead batteries.  Other than that, everything is great!!", "verified": true, "helpfulness": "0/0", "author": "DeVetta"}, {"rating": 5.0, "review": "I'm very happy with my fire t.v. I would recommend it. It's user friendly and I love the txt to talk feature.", "verified": true, "helpfulness": "0/0", "author": "Felidae"}, {"rating": 4.0, "review": "Fire TV was easy to set up and since I already had Netflix and Hulu I was able to access my favorite shows.  It was nice to view them on my big screen TV.  Also I like the fact that it ties all of my Amazon Prime videos, music and DVD's all in one place.I bought Google Chrome and found some of my devices we not compatible with the software.  .", "verified": true, "helpfulness": "0/0", "author": "Josile Reigle"}, {"rating": 3.0, "review": "Not nearly as many free movies as expected. The advertising was misleading.", "verified": true, "helpfulness": "0/0", "author": "Wendy Modica"}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/0", "author": "Lashown Jones"}]