[{"rating": 4.0, "review": "So far, the Amazon Fire TV has operated as advertised.  I do like this product.", "verified": true, "helpfulness": "0/0", "author": "LT"}, {"rating": 5.0, "review": "Just works!", "verified": true, "helpfulness": "0/0", "author": "Papatom"}, {"rating": 5.0, "review": "I'm so pleased with my Fire TV that I bought two.  One for each TV.  I've saved over $1,100 on my cable bill per year.  I don't have a cable bill and still enjoy the latest TV shows and movies. It's very easy to operate.  I'm an older person trying to jeep up with the lastest.  I really enjoy my Amazon Fire TV.  Stephanie G", "verified": true, "helpfulness": "0/0", "author": "S Gurley"}, {"rating": 5.0, "review": "I've used Roku boxes in the past and I have to admit the Amazon fire's picture quality and firmware is much better.", "verified": true, "helpfulness": "0/0", "author": "Donald Jones \"donmarjon\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "ernest b goins"}, {"rating": 2.0, "review": "not very good if you do not pay the  required $100.00 a year", "verified": true, "helpfulness": "0/1", "author": "GEORGE LAIRD"}, {"rating": 4.0, "review": "I am pleased with fire TV. I have a smart TV but it seems to have problems loading of late. I believe it's a slow Internet connection problem in a rural setting . But using fire TV as a buffer seems to help.The one thing I question is the fact that it doesn't seem to turn off. I understand there is supposed to be 30 minutes Before it goes to sleep but the light stays on from one day to the next. It is nice to be able to use vocal instructions andit is easy to connect with a program I'm in the middle of watching. I have connected to sling TV and Hulu and no longer subscribe to satellite service. :)", "verified": true, "helpfulness": "1/1", "author": "Whisper'sMom"}, {"rating": 5.0, "review": "This is the best thing ever. You can watch whenever and where ever you like.", "verified": true, "helpfulness": "0/0", "author": "Maxiej"}, {"rating": 4.0, "review": "connectivity issues at times on my network....may be location on 3rd floor of my house...", "verified": true, "helpfulness": "0/0", "author": "Michael S. Maier"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "aaron 4874"}]