[{"rating": 1.0, "review": "Nothing but issues, couldn't get it to reliably work, so I'll be returning this complete waste of my time. I have a nice Cisco router within plenty of range of this device and I get connection issue errors left and right. This product isn't ready for primetime.", "verified": true, "helpfulness": "0/2", "author": "Chet"}, {"rating": 1.0, "review": "I ordered this device when I read that you can stream local media files using the Fling app but that's no longer true. The last update from Google is blocking local media playback. Although Google have said that the move is not intentional and they would \"like\" to support local playback. I think they caved under pressure form RIAA and such. I'll return the unit for now and may buy it again if this matter ever get cleared up.", "verified": true, "helpfulness": "3/6", "author": "J. Yuen"}, {"rating": 4.0, "review": "Like most product that just been created, this one offers a lot of potential for the future. I found it really need to be able to cast netflix or a youtube video onto my TV from my phone and even if my phone gets turned off it doesn't stop playing! Also on my laptop it is really nice to able to cast my browser onto the TV and read my emails or read an article. The only problem with the chrome cast is that if you dont have a decent internet connection you can experience lag on the TV or if your computer isn't currently a semi new computer you will experience a lag or google chrome will fail on your computer, so there is room for improvement. I only recommend this if you are looking to turn your tv into a \"smart tv\". however if you already have a media box, there really isn't a need to get this right now. It cannot cast anything well other than Netflix, Youtube, or Google play. It does come with an USB cable to power it if there is no USB on your tv there is a plug for you to use for the wall outlet.", "verified": false, "helpfulness": "0/0", "author": "shadez82"}, {"rating": 4.0, "review": "I've been using the Chromecast for about a month now and have found it to be a great device.Mine came with 3 months of Netflix and the integration is seamless. I find a video I want to watch on the Netflix app, push the play button and start watching it on my tv. From there the Chromecast does all the work and I can shut down my phone. Another other device (tablet, phone, etc) that's connected to the Chromecast can be used to pause/play the video at that point.I've also really enjoyed the YouTube integration.I would give the Chromecast 5-stars but the lack of services is why I'm rating it 4/5. With the addition of other services like HBO Go, Amazon Instant, etc I'll gladly give the Chromecast 5-stars.", "verified": true, "helpfulness": "1/2", "author": "Brett D"}, {"rating": 3.0, "review": "Only plays Netflix, Google Play, and Youtube. Buyer Beware of it's limitations. Setup was ok but you might as well get a roku or something with more apps.", "verified": true, "helpfulness": "0/0", "author": "Matthew S."}, {"rating": 3.0, "review": "If you are living overseas, this device is not the greatest.  That is because it does not work with a VPN.  So if you want to watch Netflix or Amazon prime using your chromecast, you are out of luck.Also, I was disappointed at the extremely limited compatibility with iPad.  Essentially, you can only cast YouTube and Netflix (but again, if you're overseas, not Netflix, because Netflix is not available to overseas users, unless you use a VPN).I was watching mlb.tv during the season, and that is not location restricted, so it was a lot of fun casting a tab from my desktop browser (careful, Chromecast only really works well with Windows 7 or 8 OS, you can try with XP, but it doesn't work that great, or not at all) and watching MLB games on my big screen without having to hook the lap top up to it with an HDMI cable.Overall, this device has a lot of potential.  And it is probably much, much cooler for U.S. users.  I'd definitely like it more if I could stream Netflix and Amazon Prime.I mainly wanted to post this review as a service to users overseas who could get their hands on one of these (i.e. U.S. military, diplomatic, or other expat); probably best to wait until Google makes it more compatible with VPN and iPad apps.", "verified": false, "helpfulness": "1/1", "author": "JohnnyC"}, {"rating": 4.0, "review": "No sound on TV When i play local video within Google chrome browser- Sound works fine on TV when streaming movies from Google chrome.Thanks in advance!", "verified": false, "helpfulness": "0/1", "author": "Snowland"}, {"rating": 3.0, "review": "All the problems I had below I seemed to have found a solution so changed rating from 1 to 3I found my old windows computer downloaded the app for the chromecast and after doing that I was able to set up the chromecast on the windows computer.  Once that was done all the problems I was having with the Chromebook and the Nexus 4 went away I was able to use both with ease an was able to put everything so far that I loaded in google chrome up on the 47 inche tv  WHO WOULD HAVE THOUGHT THAY YOU WOULD HAVE TO SET UP ON WINDOWS FIRST TO GET IT TO WORK ON THE CHROME BOOK. Oh yea and this was through an open vpn and open dns. Hope this helps anyone that has had the same problems belowFirst time that I have been really disappointed with a google product  and here is whyI could not get finish the set up with my chrome book or my nexus 4  so I called for help and here is what I was toldIT DOES NOT WORK ON A CHROME BOOK AT THIS TIME BUT WILL IN THE FUTURE  \"REALLY\"So why not the nexus 4 well here is why the chromecast must be no further than 20 feet from your router and nothing between in other words not on the next floor so my nexus 4 would not connectIt is not compatable with networks running open vpn extSO BASICALLY IF YOU ARE LIVING IN SOMETHING BIGGER THAN A 20 X 40 ROOM YOU MAY HAVE PROBLEMSIF YOU HAVE RECENTLY PURCHASED A GOOGLE CHROME BOOK DONT BUY IT WILL NOT WORKIF YOU ARE RUNNING AN OPEN VPN OR SOMETHING SIMILAR OR OPEN DNS IT WILL NOT WORKI will keep and give to someone If I can find anyone living in a one room setup  cost to much to return  WHAT A SHAME", "verified": true, "helpfulness": "0/1", "author": "JDW NORTHERN ONTARIO"}, {"rating": 5.0, "review": "I set up my chromecast in less than 3 minutes and was streaming Watch ESPN in a couple more. The quality was great, High Def for the entire football game I was watching. It exceeded my expectations.", "verified": true, "helpfulness": "1/1", "author": "Kevin Rump"}, {"rating": 5.0, "review": "IT'S OK BUTT IT ONLY WORKS WITH GOOGLE AND YOU HAVE TO HAVE WI-FI. THIS IS GOOD IF YOU DON'T HAVE A SMART TV OR A DVD PLAYER WITH WI-FI THEN IT'S COOL. MAYBE SINCE IT'S NEW THEY WILL COME OUT WITH A LOT MORE IT CAN DO..LIKE I SAID IT'S OK ...", "verified": true, "helpfulness": "0/1", "author": "Hipolito Jimenez"}]