[{"rating": 5.0, "review": "I love this device but it took a bit of work to get it to work completely. Out of the box, it worked great from my Android phone. All the video apps that I've tried worked great. I've used Netflix, YouTube, Hulu and ESPN. I've also been able to play various videos on the Internet that would come up in Chrome. I was also able to get it to work well from my daughter's iPhone. (Yes, we are a mixed family with Android and Apple. Get over it.)I initially ran into problems when I attempted to run apps from my laptop. Anything from YouTube worked perfectly. However, Netflix and Hulu would not work. After whining extensively on the google support pages, I finally was able to come up with the solution. It turns out that AVG was blocking ChromeCast. What I did was to disable AVG, restart Chrome, and then re-enable AVG. Everything works great now.I really like the ability to cast tabs from my laptop. It's like it gives me another monitor without having to run a long HDMI cable. This is what also makes the ChromeCast a great value. All other devices that stream video to your TV are more expensive but they cannot stream anything from your laptop..I also like that the picture quality is quite good. If a video is available to play in HD, then it is rendered in HD on my TV. YouTube also has some extra functionality where it basically acts like a video radio station. I also like that I can browse in one tab and add videos to my queue in another.Once I was able to get ChromeCast to work right, I loved it. Their support site was pretty good in helping me find an answer to the problems I was having. It took a couple of days but a Google employee did get on and help out. In the mean time, there were some expert users that were helpful as well. I currently have an older Apple TV. I think it's 3rd generations. The interface for the Chromecast is far superior. The Apple TV interface is really klunky by comparison. I've looked at the Roku and did not find it as good as the Chromecast and the Roku did not have nearly the same features for even their $100 device. What also acered me away from away from the Roku is there were a lot of reviews on Amazon that stated they had numerous problems with their support.Therefore I highly recommend the ChromeCast and give it 5 stars.", "verified": false, "helpfulness": "0/0", "author": "Brian Edmondson \"Brian\""}, {"rating": 4.0, "review": "Chromecast needs more apps. It is worth wild, if you want to watch something, and cannot watch anything or watch to stream from a different device. We need more apps, but I added a few, NPR, Watch ESPN, HBO. After you connect the app to the TV, it takes over. Control is still on the phone, tablet, pc, etc. You can shut it off.", "verified": true, "helpfulness": "0/0", "author": "Abatar"}, {"rating": 5.0, "review": "Good product, does everything expected", "verified": true, "helpfulness": "0/0", "author": "Scott Jarman"}, {"rating": 2.0, "review": "Apple TV is better", "verified": true, "helpfulness": "0/2", "author": "WeiRuhan"}, {"rating": 5.0, "review": "Well, now, this is one of the coolest things I've bought in a long time!  Plug it in to your tv, follow the on-screen instructions, and voila! Netflix movies playing now!  Was very simple to install and figure out.  Had my techie son standing by, but he made me do it myself this time and the process was a total success.  Don't know how I got along without it!  Highly recommend it, to even middle-aged marginally tech-minded Mom's!", "verified": true, "helpfulness": "0/0", "author": "Cecile Find"}, {"rating": 5.0, "review": "Streams perfectly with full HD.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great little gadget to have for any tv.", "verified": true, "helpfulness": "0/0", "author": "Yasir W. Raja"}, {"rating": 5.0, "review": "MUY BUENO", "verified": true, "helpfulness": "0/0", "author": "Jonathan Gerardino"}, {"rating": 5.0, "review": "awsome", "verified": true, "helpfulness": "0/0", "author": "tasha"}, {"rating": 3.0, "review": "Came very fast but really did do what I wanted to.  Ended up just buying Apple TV", "verified": true, "helpfulness": "0/0", "author": "Robert Latham"}]