[{"rating": 5.0, "review": "In Canada, this device works primarily to play Netflix and Youtube.  It does it well, controlled by either my iPod or my computer.  As an added bonus, I can \"cast\" webpages I'm looking at to the screen.  It can do more in the US ... but I was simply looking for something inexpensive that plays Netflix with better picture image than my Wii and it does it well for the price.", "verified": true, "helpfulness": "0/0", "author": "Garry Heintz"}, {"rating": 5.0, "review": "Very nice thing, smooth and slick! It works like a charm from the beginning! The initial setup was easy and fast.", "verified": true, "helpfulness": "0/0", "author": "tataran pavel"}, {"rating": 5.0, "review": "This is a great tool at a great price.  Its easy to work too!  I bought it for my husband for Christmas and I have no regrets.", "verified": true, "helpfulness": "0/0", "author": "dlee"}, {"rating": 4.0, "review": "The Google Chromecast Player is an easy to install, easy to use device for watching HD video, whether your own or streamed from commercial sources.  The only deficit is the small number of commercial video suppliers.  It would be great to add the Amazon live streaming and Vimeo.  Then I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Bob Liles"}, {"rating": 5.0, "review": "This thing is cool. It converts \"dumb\" or \"quasi smart\" tvs into a more intuitive user experience.  If you want to stream movies, shows, etc, this is the best add on hardware for the job.  Also, seems like there is a lot of room for updates/upgrades in the future, so I'm sure it will only get cooler.  For $25-$35 dollars, it's a no brainer.One thing to note, this thing needs more power than the HDMI can supply, so you have to plug it into a USB port on your TV (adapter included) or you have to buy another adapter that plugs into the wall (or you can use one of your old cell phone USB adapters).  This worth noting because if you're like me you probably assumed this thing simply plugged into a free HDMI port and you would be good to go...not true.  Most new TVs have a USB, so this shouldn't be a problem, but if yours does not be prepared to plug it into the wall.", "verified": false, "helpfulness": "2/2", "author": "jingley"}, {"rating": 5.0, "review": "The best use of 35 dollars imaginable for couch entertainment. Cant wait for the SDK to be released so 3rd party devs can start making some apps.", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 3.0, "review": "Thought this would make it possible to watch network TV (we don't have cable). Not so much. Very disappointed that I couldn't stream the Golden Globes.", "verified": true, "helpfulness": "0/1", "author": "Pauline"}, {"rating": 2.0, "review": "Very disappointed.  I expected better from Google.The setup failed several times before I was able to get it to work.  But then it got worse.  Everything I cast would be out of sync.  Sound and picture doesn't come close.  Tried online support and performed all of the recommended actions, but still no love.  About the only thing that comes close to syncing is Hulu Plus.  The rest is just not usable.This definitely doesn't feel like a commercially ready product.  Save yourself time and get a Roku.", "verified": true, "helpfulness": "0/0", "author": "LouL"}, {"rating": 4.0, "review": "do the research for you may not even read this if you are buying one you would already know all about it. the one thing cant figure out is that on an older sharp aquas 46inch lcd gives me a terrible feed back noise when i connect it .", "verified": true, "helpfulness": "0/0", "author": "N. Santos \"home made IT\""}, {"rating": 4.0, "review": "I like the fact that I do not have to connect my laptop to my TV anymore and there is no longer a drain on my computers battery when I am streaming movies.I did have a frustrating time installing, Perhaps the instructions could be more helpful, It took me hours rather and minutes to realize what was required.It is regulary being used now and, all in all, I am satisfied with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Keith Jackson"}]