[{"rating": 5.0, "review": "Easy to use. Really enjoy the product.", "verified": true, "helpfulness": "0/0", "author": "Chelsey VanDeHey"}, {"rating": 5.0, "review": "So far working great,  no problems. even received it in 1 day.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Works great! Paired with Sling TV, I have not missed cable TV at all. The only thing it's missing is Vudu.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Go Bama\""}, {"rating": 5.0, "review": "Interface, speed, and ease of operation are way ahead of competitors.", "verified": true, "helpfulness": "0/0", "author": "Wells"}, {"rating": 5.0, "review": "Super awesome product!  The voice recognition if flawless.  Wished that worked on Netflix too, but it only works for Amazon.  It does work super awesome.", "verified": true, "helpfulness": "0/0", "author": "AEGOZCUE"}, {"rating": 4.0, "review": "It is handy but it streams Netflix slow snd has to stop to buffer a lot.", "verified": true, "helpfulness": "0/0", "author": "Lexi Vanderhill"}, {"rating": 4.0, "review": "Love the product, works great. I would like to have access to more apps. (FXNOW, BTN2GO, etc)That is the only reason it got 4 stars instead of 5.", "verified": true, "helpfulness": "0/0", "author": "Thomas R."}, {"rating": 5.0, "review": "I like it and everything. Its a great device to have for my TV so we can watch everything on it. My only complaint would be that sometimes the quality is bad. I don't know if its how big my TV is or the actual video. There is a good selection of content for Amazon Prime members and its easy to navigate. If you are having trouble many questions can be answered here on Amazon.com.", "verified": true, "helpfulness": "0/0", "author": "Christa"}, {"rating": 1.0, "review": "Used to have Roku 3s and got myself an Amazon Fire TV when it came out, primarily because of the improved hardware.  After several months,  I'm happy to be rid of the Fire TV and back on the Roku.  I always hated the Fire TV's interface - there are dozens and dozens of tiles on the home page with no way to customize it, all of them directed at having you buy more content from Amazon - all I want is the 4 Icons I use the most.  Some might argue I could just use the voice search function which FireTV has and Roku does not - but I can click faster than that if the icons are in the place I want them, since I need to be holding the remote anyway.  The final nail in the coffin for me was MLS Live app which came out for Roku but not for Fire TV - when it comes down to it, the channel selection for Roku is superior, the Fire TV's superior hardware is not necessary to effectively stream 1080P, and that is all that matters.", "verified": true, "helpfulness": "2/4", "author": "Public Name"}, {"rating": 1.0, "review": "Would not display with my projector.  Surprisingly the Fire TV Stick does. Plex app doesn't work right. Projector and Plex app work great with Fire TV Stick. Love the Fire TV Stick. Order the Fire TV after having two Fire TV Sticks for the audio brake out ports. Sent it back. Very disappoint and confused why the Stick works flawlessly and this doesn't.", "verified": true, "helpfulness": "0/1", "author": "Will"}]