[{"rating": 5.0, "review": "this works as advertised. But only get it if you have a very high speed internet for normal google chrome browser share. for you tube any connect would do.", "verified": true, "helpfulness": "0/0", "author": "Anne"}, {"rating": 3.0, "review": "Unless you are connecting with a pure Google device the instructions and connecting are confusing and the quality is like trying to watch a basketball game from the nose bleed section after getting maced.", "verified": true, "helpfulness": "0/0", "author": "Bryan K."}, {"rating": 5.0, "review": "Amazing product and easy to use. This is what I use for media.", "verified": true, "helpfulness": "0/0", "author": "Sondra"}, {"rating": 4.0, "review": "One star down for not being able to play Amazon shows on my television, but otherwise it is a great device.", "verified": true, "helpfulness": "0/0", "author": "Jessica Buchberger"}, {"rating": 5.0, "review": "Love it.  Use it Plex and Google apps for all my TV viewing.  As more and more apps are working with this device it is becoming even more useful.  I have one on all the TVs in my house.", "verified": true, "helpfulness": "0/0", "author": "Agfisher"}, {"rating": 5.0, "review": "Google went too low a retail on this thing.  Should be in every home in the world", "verified": true, "helpfulness": "0/0", "author": "NR"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Brian Crafton"}, {"rating": 2.0, "review": "So I tried the chromecast last week & this week and it didn't work well. For three major reasons:1. It said I could not mirror my screen because my \"Tablet was not optimized for screen mirroring\".2. When I tried to plug it into my audio receiver, it would not project the image to the TV. IT HAS TO BE PLUGGED IN DIRECTLY TO THE TV. This is crappy, and kills this product for any kind of audiophile. No one with a home theater sound system wants to watch TV using the stock TV speakers. I know you can use a optical audio cord to output from your TV back to the receiver, but this is an extra cord I don't want to both with.3. I tried it at the hotel and it wouldn't work because the hotel has a sign-in network (not password encyrpted). Chromecast only works on WP password protected networks. It won't work on a public network (hotel, hospital, starbucks, etc).Overall, I wouldn't recommend this product for traveling or people with input config home theater systems. It's good for people that don't have another device for streaming media to their TV (Playstation, XBOX, AppleTV, etc) and also have an output configuration for sound from their TV.", "verified": true, "helpfulness": "0/0", "author": "Owen E Holder"}, {"rating": 5.0, "review": "Works great and works on my schools wifi (Netgear streaming did not). Easy to set up with either cell phone or PC. I didn't see any mentions on here but you can stream your own videos using Videostream app for Chrome. It allows you to stream from your local drive to your tv. Also VLC will have integration sometime in the future. It's about the same size as my Roku Stick but comes with a short HDMI extender, so it can fit just about anywhere.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 2.0, "review": "Can't get this fully connected to my tv. Had three people go through the installation process and we can't get it to work. Disappointed. It plugs in easily, but there is some connectivity problem between it and my tv, which is two years old.", "verified": true, "helpfulness": "0/0", "author": "upstatechef"}]