[{"rating": 3.0, "review": "I would give five stars if you could just view prime content with genres. It is a disappointment to try to search for something, voice search is great if you already know the name of a movie.", "verified": true, "helpfulness": "0/1", "author": "Kim"}, {"rating": 4.0, "review": "I am in love with my Amazon Fire TV. So much so, that it's replaced my Apple TV and I'm ready to buy a second box for upstairs (to replace a 2nd ATV).The streaming quality is fantastic. Ease of use is top notch, setup was a breeze and the fact that we can play both video content and games is a winner in my book.That said... Amazon made this box with one GIGANTIC flaw... not enough onboard storage and no way to add any additional. Just downloading several games from the App store has filled up my storage space. Games like Grand Theft Auto: San Andreas are 2.5+gb alone. What were they thinking? If Amazon updates the box and allows us to use external storage via the non-used USB port this box would be 5 stars. Until then I will spend my time micro-managing my storage space and installed games. So heads up if you're buying this for the games aspect. It might be a drawback.", "verified": true, "helpfulness": "1/1", "author": "Heather A"}, {"rating": 5.0, "review": "I received my Amazon TV two weeks ago and am amazed at how simple it was to hook up and start watching my favorite movies.  Awesome purchase that I don't regret!", "verified": true, "helpfulness": "0/0", "author": "JoanieB"}, {"rating": 5.0, "review": "Great device.  Easy to setup and immediately use for viewing.  You must have a compatible TV for use with this device.", "verified": true, "helpfulness": "0/0", "author": "DPARMAR"}, {"rating": 5.0, "review": "it does as advertised plus came with one free game and if you buy the controller they give you credit to buy an app or game for free.so, i got 2 games with it.the apps are pretty slick and fast.the voice command thingy works as advertised.interface is pretty good.as of today,they have not too many apps but at the same time they have espn,pandora,heart radio,youtube,hulu plus, a weather app that sometimes works and others dont and a few more....anyways,the setup is rather easy and you dont have  to be an expert to do it .all in all,this is a nice gaming and apps device that i personally use in conjunction with my ps3.(ps3 gets hot when its running for awhile and this device doesnt,obviously)", "verified": true, "helpfulness": "0/0", "author": "eduardo dominguez"}, {"rating": 5.0, "review": "Love it!! I would definitely recommend this easy to use and very addicting, you'll spend hours browsing and testing out apps.", "verified": true, "helpfulness": "0/0", "author": "Alexander Huon"}, {"rating": 5.0, "review": "works just great, very easy to hook up and understand the inst  The voice rec. saves a lot of time", "verified": true, "helpfulness": "0/0", "author": "Robert Kirby"}, {"rating": 5.0, "review": "EASY TO USE, INSTALL AND THE VOICE ACTIVATION FUNCTION IS GREAT (IT ACTUALLY WORKS!) & BILLING SYSTEM YOU CAN COUNT ON", "verified": true, "helpfulness": "0/0", "author": "ALAN JANUS"}, {"rating": 4.0, "review": "I love my Fire TV unit. It does everything as advertised, was very easy to set up and works like a charm. BUT... I am one of those who dropped my subscription to cable TV years ago (for the normal reason), but still enjoy sports. Fire TV advertises access to, among other things, Watch ESPN. I was so excited to gain access to the ESPN channels that I neglected to read the fine print. It specifies that one must have access to cable TV first in order to watch Watch ESPN. Bummer... Otherwise, I am very happy with my Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "R. Daniel Agent"}, {"rating": 4.0, "review": "Small and simple to setup and use. If voice worked with all applications I would give it a fifth star.", "verified": true, "helpfulness": "0/0", "author": "killgore"}]