[{"rating": 5.0, "review": "Got two of these for my new home, and they both work great once updated and set up. If your TV has USB ports, the amount of wire clutter this saves you cannot be understated.One of the two had problems connecting to the Internet through my router, so I used my LG G3 Android phone hotspot and the dongle managed to get the required initial software updated. After that, I reconfigured it to connect with my router and it works perfectly.All my devices -- Windows 8.1 laptop, Android phone and iPad -- work seamlessly with the Chromecast. The Chromecast icon appears automatically if the dongle is powered on (either by the TV or external power).If you have more than one Chromecast, I would recommend naming them intuitively so you don't connect to the wrong one by accident (and interrupt someone else's viewing!).Highly recommended for those looking for a fuss-free solution to TV content streaming. I mainly use Netflix, Hulu Plus and YouTube.", "verified": true, "helpfulness": "0/0", "author": "zhao"}, {"rating": 1.0, "review": "It took forever to update and load then Netflix was not compatible you have to be by a router for it to even Work don't buy", "verified": false, "helpfulness": "0/1", "author": "Noah"}, {"rating": 5.0, "review": "I love this", "verified": true, "helpfulness": "0/0", "author": "brenda"}, {"rating": 5.0, "review": "Its a great $35 streaming device. It now mirrors an Android device screen. A bit laggy when mirroring but casting apps (Netflix/Hulu) work great. The mirroring would work great for Drive Slideshows.", "verified": true, "helpfulness": "0/0", "author": "Loran"}, {"rating": 5.0, "review": "Must have.  Works great.  Great price.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Michael A. Norby \"Norby\""}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Cuong T. Nguyen"}, {"rating": 1.0, "review": "It only lasted a month. First, the colors on the screen were all wrong. Now, it doesn't turn on at all.", "verified": true, "helpfulness": "0/1", "author": "Patrick Maynard"}, {"rating": 5.0, "review": "The Chromecast setup quickly, although, it is kind of wide, so I'm glad they include an extender.  Took only a minute or two to setup and Google Chrome works just fine.  It has a nice clear picture and I like the ability to use the computer on the TV to watch videos and view pictures. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Markox \"Markox\""}, {"rating": 5.0, "review": "Works right out of the box. We keep watching movies without having any issues. Probably, we'll give our ROKU box to the neighbours... Great product!", "verified": true, "helpfulness": "0/0", "author": "FredGuy \"FredGuy!\""}, {"rating": 5.0, "review": "This gadget is very popular among cord cutters. I love mine.", "verified": true, "helpfulness": "0/0", "author": "kharkrider"}]