[{"rating": 3.0, "review": "Had a lot of trouble setting it up and understasnding the best way to get Netflix, and HBOgo to work with system. No problem installing the unit. After 3 days I am debating if I should keep it.", "verified": true, "helpfulness": "1/1", "author": "TeeJay"}, {"rating": 2.0, "review": "Plenty of features.. streaming reliability is far behind the competition.. I have to switch over to my xbox for multiple video streaming apps on a regular basis because my fire Tv box freezes the video or keeps the audio going without video.. Tech support blames this on my bandwidth even though this is the only device with problems, and it the closest device to the router. Please improve the reliability of this device.. It has been a waste of money.. Roku is far superior considering it reliably works", "verified": true, "helpfulness": "1/1", "author": "Cory Anders"}, {"rating": 5.0, "review": "Love this system and package. I totally dumped Comcast which was costing a small fortune.", "verified": true, "helpfulness": "0/0", "author": "Dr. Gary Hatcher \"Scorpio501\""}, {"rating": 5.0, "review": "I highly recommend the fire TV, especially if you have a Amazon prime membership. I can spend hours just watching prime TV and movies.", "verified": true, "helpfulness": "0/0", "author": "LAT"}, {"rating": 4.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Opinio Alvarez"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Michael S."}, {"rating": 5.0, "review": "I have been using the box for a week. It is everything as advertised. easy access to the subscriptions I choose and also easy access to my prime video. great option for anyone with a Smart tv that does not come with Amazon prime.Update: 7/15/15*** still enjoying all fire brings but I am disappointed that the fire box does not have an app at least from what I can find to allow me to get to the world wide web. I would like to see a browser app so I can access web content. Save me from buying a smnart TV.Otherwise this is a great product", "verified": true, "helpfulness": "2/2", "author": "Bruce"}, {"rating": 1.0, "review": "I cannot get it to work, no matter what I do, no clear instruction", "verified": true, "helpfulness": "1/4", "author": "Sirin"}, {"rating": 3.0, "review": "Disappointed in the selection and quality of apps. Hope companies start developing and improving them soon. Twitch and YouTube especially.", "verified": true, "helpfulness": "1/1", "author": "Krista McCoic"}, {"rating": 1.0, "review": "A pretty powerful set-top box - except it can't do what it's advertised to do. This device, along with Amazon's Fire project as a whole, fits with Amazon's larger business model. That is, to separate you from your money. That imperative is designed into the UI and ecosystem. The device itself has enough RAM, processing power, and I/O to make for a satisfying experience for most users. The user interface is pretty and the response is snappy. It could do everything a decent Android tablet does along with outputting Dolby 5.1 and 1080p video, but Amazon's app store is quite limited in its offerings for the Fire TV. I mean, they don't even have an app for Amazon Prime cloud photos (among many others, conspicuous in their absence). You can always sideload Android apps, but most of these are optimized for a small touchscreen, not a TV display and it can be kludgy trying to launch them.I will try to return the Fire TV and the game controller. If Amazon is OK with this, I will remove my review and not look back.", "verified": true, "helpfulness": "0/1", "author": "Silouan"}]