[{"rating": 5.0, "review": "It was a gift and he loves it. He says it is a very convenient way to use his hulu plus subscription", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 3.0, "review": "I thought that we would be able to send anything we wanted to the TV from the phone or iPad.  It only works with selected apps.  We wanted to view pictures from Drop Box, which is possible but painfully slow.  This was a waste of money for what we were expecting which was to stream anything WE wanted to HDMI on the TV.", "verified": true, "helpfulness": "0/0", "author": "Richard Harlan Pratt"}, {"rating": 4.0, "review": "Sometimes it disconnects but overall this is much more reliable than the Amazon Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "DMC"}, {"rating": 5.0, "review": "This little sucker is a giant!", "verified": true, "helpfulness": "0/0", "author": "jcr"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Luis Felipe"}, {"rating": 3.0, "review": "No remote.  Must use your tablet, smart phone, etc...  That's OK unless you have four people in your family.  Each person needs to have the Chromecast app on there phone, plus Netflix or other streaming app.  if they want to watch a movie.  One remote with our Wii system works better.  The movie choices are projected on the TV screen with the Wii.  The Netflix movie choices with the Chromecast is on your phone and makes it difficult to read or see.  There are very limited installation and operation instructions with the Chromecast, even if you go to the Chromecast website.  No phone number for technical support.  This is not for non-tech savvy people!!! I also found that sometimes I have to turn off the TV to reset the casting icon on my iPhone and TV.  Iam returning this item and will try the Fire TV Stick, which has a remote.  I recommend looking at the technical comparisons of the Fire TV Stick, Chromecast, and ROKU stick.  It seems that the Fire TV Stick has much more to offer.", "verified": true, "helpfulness": "0/0", "author": "Justin Poarch"}, {"rating": 5.0, "review": "Easy to use and installl. Works great for playing videos on my tv from my laptop without a cord. No issues.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 4.0, "review": "Very Happy with this unit. Plugged in and set up in minutes to my iPad, and started multiple music casts from various services (youtube, vevo, etc.) Videos are clear and in full HD when available. It does take ip a HDMI and USB slot on the TV, but is worth it.", "verified": true, "helpfulness": "0/0", "author": "Peter A. Morrison \"Inventor\""}, {"rating": 5.0, "review": "Love this item! It allows us to cast from our computer to TV using Chrome. My original one broke accidentally so I just ordered a new one. Can't say enough about how great of a product this is.", "verified": true, "helpfulness": "0/0", "author": "Raj M"}, {"rating": 3.0, "review": "Just wish it had a remote.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Eckhardt"}]