[{"rating": 2.0, "review": "I bought chromecast for browsing on TV through the chrome browser (on windows 8 laptop) and to mirror pc screen on tv, two things that I still cannot do through my DLNA devices using my PCs and smart tv through wifi. Chromecast is a disappointment for both. There is a lag while I browse and sometimes it even stops working when the website contains videos on it. Same happens with mirroring. Youtube works very well but I didn't need chromecast for that as my smart tv has the youtube app and it works fine. My internet is broadband but not the fastest and that could be a reason, since it does not completely work through your wifi network as far as I understand. So compared with the smart tv's apps chromecast does not work that well since my smart tv's and blue ray's wifi and apps work fine with my actual internet speed. My wifi router is a high end one and so is the laptop I tested casting (last gen i7 processor, 8 gigs RAM, SSD) so the problem is not in my devices. Chromecast's price earns the two stars I have given it, the only reason I still have it and did not return. I want to wait and see if there will be any improvements or any additional Windows apps for it in the future.", "verified": true, "helpfulness": "0/0", "author": "Enzo"}, {"rating": 4.0, "review": "It works well for internet on your TV, but I don't think I can put other PC activity, say playing a DVD on the PC, on the TV. SO you still need the HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "works well easy to set up, just does not work with IP blockers/shields. Also requires AC or USB power source which is not advertised.", "verified": true, "helpfulness": "0/0", "author": "jrav"}, {"rating": 4.0, "review": "Awesome device for $35. Streaming has never been easier for me. We have multiple TVs that are not connected to the internet - until you plug this guy into the HDMI port. Currently there are only a few services available; Netflix, Youtube, and HBO, but it solves the connectivity problem well. I only use Netflix and Youtube but they work amazingly well. My internet service is 17Mb down and 2.5Mb up, which seems good enough to drive this little guy. I mostly use it with an IPad but I tested it with the IPhone and it works great.The only downside is that the sound gets out of sync with the video occasionally. This problem has come up about 5% of the usage time. I would have given it 5 stars had this problem not been present.", "verified": true, "helpfulness": "0/0", "author": "Jeff \"Technology Guy\""}, {"rating": 5.0, "review": "This is one of the neatest gadgets I've seen in a while.  My son and i had it running within 10 minutes of unboxing it.  We like thefreedom it gives us to share movies, stills, and family videos from our laptops, tablets, or phones.", "verified": true, "helpfulness": "0/0", "author": "Joe Ray Baughman"}, {"rating": 5.0, "review": "Great product for low price. Makes watching Netflix on Non-Smart TVs easy. Sometimes the Netflix app is a little slow, but still better than hooking up a computer to the TV.", "verified": true, "helpfulness": "0/0", "author": "Kurt"}, {"rating": 5.0, "review": "I bought this to just try it out and fell in love with it. it's so simple to just be watching random videos on youtube and with one mouse click you can have it up on your TV. Google has also recently added local content streaming with apps like plex and realplayer so you can stream movies straight from a laptop to your TV.", "verified": true, "helpfulness": "0/0", "author": "Justin Albanese"}, {"rating": 5.0, "review": "Good deal and works as advertised. Hooked up quickly without any problems.  Was watching utube in no time. ! Wws", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Very easy to set up and it adds a lot of function for a small price.  I hope they'll continue to refine the software so it becomes compatible with more applications.", "verified": true, "helpfulness": "0/0", "author": "Hindy30"}, {"rating": 5.0, "review": "This is very fun. Sets up quickly and you can stream anything from your computer onto your TV. Don't waste your money (and time) on cable and dish!", "verified": true, "helpfulness": "0/0", "author": "Connie Delaney \"Zareen\""}]