[{"rating": 4.0, "review": "If you have a home theater and you want to get your sound to come out of it then you will need to buy the cable \"optical cable\" that is offered for$7.99! It is a Toslink!", "verified": true, "helpfulness": "0/3", "author": "Joey Poynter"}, {"rating": 4.0, "review": "This is the only CES device in its class. The hardware & build are 5 stars. It doesn't have all the channels of Roku, but how many channels do you need? Fire TV is in the top 2 of cable cutters. The downside is \"smart\" TVs are getting smarter & offer as much or more than this device. The advantage of having \"smart\" is the seamless transition from internet to live TV whether you have OTA or STB. In the mean time, I would recommend this device.", "verified": true, "helpfulness": "2/2", "author": "The Cpt"}, {"rating": 5.0, "review": "very very good", "verified": true, "helpfulness": "0/2", "author": "Robert Jackson"}, {"rating": 5.0, "review": "It's good", "verified": true, "helpfulness": "0/1", "author": "Zo"}, {"rating": 1.0, "review": "What's the point of having it if I have to pay for everything whats so different about it are you kidding me first pay a hundred bucks for it then buy usp cable to ownly find that anything I want to watch I've got to pay for really I feel like a fish reel me in", "verified": true, "helpfulness": "2/15", "author": "Bonita Breen"}, {"rating": 3.0, "review": "Fast. Voice search is awesome. The fact it still doesn't work in other apps (Netflix) sucks big time. The lack of universal search is also a bummer. I voice search futurama, it suggests buying it even though it's already on Netflix. It should suggest free first, then purchasing from amazon.", "verified": true, "helpfulness": "1/2", "author": "James C. Bell"}, {"rating": 5.0, "review": "Works great really fast", "verified": true, "helpfulness": "0/1", "author": "Ralph V"}, {"rating": 5.0, "review": "Awesome! The quality is like BluRay! Very sharp...nice job Amazon, I'm glad I bought it.", "verified": true, "helpfulness": "0/1", "author": "Joe"}, {"rating": 5.0, "review": "It is everything they say.  I have had Roku and various other streaming products.  This one is better than them all.", "verified": true, "helpfulness": "0/0", "author": "Robert Fries \"Crow Patrol\""}, {"rating": 1.0, "review": "This is not what I thought it would be. I live out side the usa and I am unable to use product. I wish to return this item because it's the worst thing I have purchased from amazon", "verified": true, "helpfulness": "1/14", "author": "Jerone Thompson"}]