[{"rating": 5.0, "review": "Google Chrome cast is easy to use and loaded with cool stuff I believe everybody will want one once they had a chance to see all the features and all you can stream to your tv", "verified": true, "helpfulness": "0/0", "author": "Patrick Greene"}, {"rating": 3.0, "review": "easy to set up --- works with Youtube only in India. They need to add more contents sites.May be next year model!", "verified": true, "helpfulness": "0/0", "author": "Manohar Arora"}, {"rating": 5.0, "review": "Words perfectly for what I needed it for, easy to set it all up and doesn't take up much room.", "verified": true, "helpfulness": "0/0", "author": "Andrew Crowe"}, {"rating": 4.0, "review": "I've only had this device for 3 days now so I'm not going to go overboard in my opinion of the Google Chromecast HDMI streaming device. I really like the device but I ran into a problem that drove me nuts for over an hour or so. The problem was determined to be of my own making, but its one that some technical users might encounter. Because I have at least 9 wireless devices connected to my router I had previously changed my Laptop LAN IP Address to a static address. By that I mean that I changed the information for the ipv4 address to a specific address, similar to 192.168.1.170. Ordinarily the DHCP server in the router would pick an address between 192.168.1.100 - 192.168.1.149. The reason I changed the LAN address was because I was experiencing some power failures and when that happens each wireless adapter was likely to get a new LAN IP address. I have always assigned static addresses to my desktop machines, but this was the first time I designated one for the laptop. Well to make a long story short, the Chromecast doesn't like that at all. Once I returned control of IP selection to the computer the device connected immediately. Moral of the story, let your computer automatically select its LAN address.The other thing is that you should follow the directions exactly. Don't try to set the device up ahead of time. This thing is great, but the setup can be a little fickle at times. Remember, if you ever hit the \"reset\" button you lose everything and have to start over again. I made that mistake once.As to its functional use? It's great. I called up YouTube on my Chrome browser and was immediately able to \"Cast\" the movie directly to the TV set and go on using my computer to do something else. I don't have a smart phone or Ipad so couldn't test it with that, but works great with my laptop. I hope it's still working like this in the future. If my opinion changes, I will be back to tell you about it.", "verified": true, "helpfulness": "0/0", "author": "Clay Welsh \"welshc\""}, {"rating": 5.0, "review": "You can literally stream tabs of an open browser onto your TV. Netflix, Hulu, Plex (look it up) WHATEVER.Magical Marvelous Wizardry!", "verified": true, "helpfulness": "0/0", "author": "Nicole Goard"}, {"rating": 4.0, "review": "My new smart TV is too smart for my old laptop to connect to. With a Chromecast shoved into a spare HDMI port, suddenly I had a third monitor again. I could unload YouTube videos to Chromecast without burdening my archaic laptop. I could've sent Netflix to Chromecast, too, but my TV was smart enough to handle that.It was awesome enough that I purchased a second Chromecast and hooked it up to my parents' TV. Let mom use her iPad to send YouTube videos and Netflix movies onto their new TV, keeping my young nieces happy.The problem is, Chromecast #2 doesn't play well with others. This morning, it was taking YouTube streaming requests like a champ. I entertained the family with lolcats and other YouTube HD treasures from my laptop to my parents' TV. This evening, Chromecast won't stay connected to the wireless network. Nothing's changed (the laptop hasn't even been turned off), but trying to nudge Chromecast into connecting with the wireless network isolates my laptop from the wireless network (while running the Chromecast app) and the dongle is swearing on the TV screen that it can't connect to anything. A little consistency would be nice, even if it was consistent refusal to join the network. This teasing is annoying.Anyway, I'm giving Chromecast 4 stars because it works great at my home. The unpredictable mess at my parents' place would merit a lower rating if I was here more often.", "verified": true, "helpfulness": "0/0", "author": "Michael Miller"}, {"rating": 5.0, "review": "what a deal , easy set up, works great with our kindle fire, netflix is about all we use it for.havent tried it on smart phone yet,needs to accept more appshave already told everyone i know about it.", "verified": true, "helpfulness": "0/0", "author": "jack plunkett"}, {"rating": 5.0, "review": "Wasnt that easy to set up i had to reconfig my wifi router but once it was all said and done the rest was a walk in the park,netflix and youtube stream very well and in HD.got it on sale for $30 well worth it.i had my cell phone hooked up to an HDMI wire and was able to stream everything Chomecast does and more but the image quality wasnt the same,chromecast streams much better and in HD.very happy and will get a few more to add as stocking stuffers.", "verified": true, "helpfulness": "0/0", "author": "Angel  Velez \"Angel\""}, {"rating": 5.0, "review": "Got it a couple nights ago, and connected it right away. My DVD payer plays Netflix and everything else but not the Amazon Prime movies. This baby took care of that in a hurry.", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 3.0, "review": "It's OK.It has a long way to go.Some of the advertising is misleading.Where the ads say \"Everything you love, now on your tv. For $35\" you may want to first consider what \"Everything\" includes.It does NOT include Amazon Prime video for one.It does include the host of Google properties - which one would expect from a streaming media player designed and sold by Google.But EVERYTHING? Not quite.For content to properly stream, the providers must pipe their content through a Google proprietary streaming codec.Anyway - for only $35?  That makes it bearable.I liked it so much and I see forward progress being made - and so I even bought a second one for the other tv.For all these reasons above I gave it three stars \"It's OK\".Give it some time and it may become a five star device.", "verified": true, "helpfulness": "0/0", "author": "James David Childers"}]