[{"rating": 2.0, "review": "Misleading documentation.  As of today it will not stream chrome off your android phone...  Cue the bwaaa, bwaaaaaaa sound... It will only stream select apps.  Additionally I am finding it very unreliable while trying to cast from my laptop or iPad.  Has yet to work flawlessly.", "verified": false, "helpfulness": "1/1", "author": "R. Brown"}, {"rating": 5.0, "review": "at $35, this is the go-to housewarming gift I've been giving my 30-something year old friends. Everyone loves it. Super easy for anyone with a smartphone.*I use a roku3 as well as my daily viewer. But Chromecast is the go-to device for quickly jumping a youtube video from my phone to the TV or to mirror my computer screen. For those tasks, this is well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "E. S."}, {"rating": 3.0, "review": "Earlier I rated this as junk. Early versions only displayed content from a few sites on the internet. That is, you told it to display a youtube video and with a specail youtube app it would. More recently it has do mirroring of the screen. It's marked Beta and indeed it seems to fail to connect to my yamaha receiver HDMI only after many resets and unplug and plug (both power and hdmi). But it eventually works and does a faithful mirroring of the Androice screen. Mine is Samsung S5 so recent 2014 version. Upgrading to 3 stars because it works sometimes. With 10,000 5 star reviews, I know this one is a waste of my time but I had to correct the review and 1 star to 3.", "verified": true, "helpfulness": "0/0", "author": "dennis"}, {"rating": 1.0, "review": "my second one of these just broke. just bent enough that the connections were broken. it took TWO WEEKS. $35 seemed like a good deal. not any more.I use it on a monitor and it's such a flimsy piece of crap that if you yank the (also incredibly annoying) microUSB power cable the thing just snaps apart. I used to use one on a TV, which was actually fine, because I never moved it and it was behind the unit against the wall. but if you ever have to move it, forget it. garbage.I was also sick and tired of the phone conflict issue. when the phone rings, there is no way to quickly switch to the app and put it on pause. I was constantly apologizing to people for the clunking and creaking they had to listen to for the 20 seconds after I picked up that it took to get to my streaming app and turn down the volume or whatever.nice concept. not entirely thought through, though, and truly crappy design and execution. I'm going back to appleTV. although it costs 3x as much, I could have bought one for what I'd be about to spend on the third Chromecast, and I know it would still be working.", "verified": true, "helpfulness": "0/1", "author": "mk"}, {"rating": 3.0, "review": "This requires you to use Google's Chrome web browser. You need to sign in to Chrome and then you will be able to stream whatever content is in that chrome browser. It will not work with any other browser. It takes a few minutes to set up and download the necessary updates. I've had issues with not being able to find my chromecast or not being able to stream occasionally. It seems to prefer to be buggy on specific sites which can be annoying. A nice plus however, is that you can stream ANYTHING that chrome is able to open to your chromecast. This includes videos and movies.", "verified": true, "helpfulness": "0/0", "author": "J. Chow"}, {"rating": 1.0, "review": "I bought Chromecast through Amazon but after purchase found out it doesn't work with Amazon Prime.  So I view it as worthless....and Amazon Prime is worthless unless you like watching movies on your computer.  Skip amazon Prime and go with Netflix.", "verified": true, "helpfulness": "0/1", "author": "lovestoread \"pel-tak\""}, {"rating": 5.0, "review": "Awesome!!!!!It has really worked for me. I don't have a smart tv, but the chromecast has solved that problem. Would definitely recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Jorge David Crespo-Muratti"}, {"rating": 5.0, "review": "Chromecasts in general are great.  They have revolutionized how I watch movies and even TV.  I have purchased one for most of my less than technologically savvy family members and they like theirs as well.", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 5.0, "review": "some people were having trouble with amazon prime but if you look at what operating system you are using to open prime choose adobe you may have to remove silver light  from your control panel before this option is available  to do this. but yes it works if you choose adobe and update", "verified": true, "helpfulness": "0/0", "author": "cel"}, {"rating": 5.0, "review": "Shipped on time and in perfect  cnditions . Like everything I've purchased here the other guys are more than awful!", "verified": true, "helpfulness": "0/0", "author": "Tonny"}]