[{"rating": 5.0, "review": "Product is nice and works well!", "verified": true, "helpfulness": "0/1", "author": "BK Broiler"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "Richard D Worrall"}, {"rating": 5.0, "review": "We are very happy with the Amazon Fire TV. We had the Chromecast Stick and had problems streaming from the computer to the TV. This is an awesome setup. We highly recommend the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Donna D. Brumbaugh"}, {"rating": 4.0, "review": "Definitely better than my Apple TV for easy of use, and availability of apps.I do wish there were more free content channels. There's Bloomberg which I like but not a lot of others that I've found.", "verified": true, "helpfulness": "0/1", "author": "Steve K. Oliver II"}, {"rating": 5.0, "review": "Great product.  We love it", "verified": true, "helpfulness": "0/1", "author": "SME"}, {"rating": 4.0, "review": "Love the access to a ton of great movies.  It is easy to use, and the only reason I did not give it 5 stars is that the voice prompt stopped working.  Not sure if I can exchange it at this point.  Even if I can, it would be a major hassle in my life.", "verified": true, "helpfulness": "0/0", "author": "Dot from MI"}, {"rating": 3.0, "review": "I have been having problems with it randomly loosing wifi connection. Other than that its ok.", "verified": true, "helpfulness": "0/0", "author": "Ryan Nathaniel Boyer"}, {"rating": 3.0, "review": "This system has great potential.  The catalog is limited, and I expected more free programing with Prime membership.  The equipment works well and is inexpensive, but the catalog is poorly organized.  Simple lists of programs would be more helpful to me than the random aggregations of illustrated ad copy now used to select programs.", "verified": true, "helpfulness": "0/1", "author": "Bill Q"}, {"rating": 5.0, "review": "only been a week  used a lot during snowstorm  no satalite signal its awesome love it", "verified": true, "helpfulness": "0/1", "author": "william  oliver"}, {"rating": 1.0, "review": "did not work", "verified": true, "helpfulness": "0/6", "author": "Sal Scalia"}]