[{"rating": 5.0, "review": "Works great for Movies or games.Bought the gamers bundle to get hdmi cable and game controller, which doubkes as a remote in case tiny Fire TV remote is misplaced.Quality processors.Can be wireless, or hardwired with ethernet cable to improve speed/quality while streaming.Has HDMI output.Worth the extra money over Fire Stick.If for family use, turn off one click ordering.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the voice feature.", "verified": true, "helpfulness": "0/0", "author": "D. Pauselius \"dian57\""}, {"rating": 5.0, "review": "Works wonderfully........Wish  that we had purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Jimbo"}, {"rating": 4.0, "review": "I got this because it was 20 dollar cheaper than the Roku 3 which I already have 2 and I have been wanted to try it out. My main use for this device is to interface with my Plex server.The Fire app for Plex is prettier, but simply not as easy to use. Sorting views just takes a lot more navigation and clicks to get movies sorted by years, date added and such filters. Deleting and managing movies is annoying with this app (basically the same app as you see on Android, Desktop PC and now Amazon Fire. It's modeled after the Plex Desktop App, which personally interface wise I don't find to be suitable for home entertainment use. As it said, it looks prettier, but you can't sort movies as easily or quickly. Managing movies is harder because the view will reset to the begining. So, say I sort my movies by rating and I'm halfway through the list and find a movie to delete, it resets to the beginning of the view. This makes managing movies virtually impossible on the Fire vs the Roku which does not do that.While the large poster view may look nice and it's popular iPhone like display, it sucks if you can't quickly jump from one filter to another. Interface should always win. For Plex the Amazon fire also has some quirks where it seems to bottleneck or take extra time to re-connect to the server, things that the Roku never does. The Roku is a far more seamless Plex experience.As for all the other features.. meh, mostly worthless unless you actually use Amazon on Demand. It's a nice piece of hardware, seems to be made well and has a nice remote, but the coolest feature that I see it has is voice search and that doesn't work for Plex. So far I haven't seen a way to limit voice search to Amazon Prime videos only, but that might be in there. However, lets face it, the Prime collection is pretty small and once you watch a large part of the content, like Netflix, you will struggle to keep finding content. Until Amazon expands prime or expand flat rate video I don't see a lot of benefit in Amazon's tied in integration. Without the voice search working for Plex and with the Plex app being less stable and less user friendly I would recommend the Roku 3 over this unit. While the Fire remote is quite good, I prefer the Roku remote. It fits in my hand better, has a better weight and it's a tad bit easier to find when I misplace it.Build wise they are both solid units, but Roku has the maturity factor and way more channels. Fire is a better deal for the hardware you get, but the lack of channels and mature apps is a pretty big issue when comparing it to the Roku. The Fire has potential, but for use with Plex, for now, the Roku 3 wins pretty easily unless perhaps you have a small video collection in which case you don't use sorting features often. With hundreds of video in the collection just scrolling through poster views or navigating the side panel with 5+ clicks is annoying compare to the Roku management where you see less videos at a time, but you have access to many categories at one time. I find the Roku app far better and I guarantee its easier to use for most people. Working in IT for decades, I know a good user interface when I see one and the Plex for Desktop and Android are just horribly thought out interfaces. Don't get me wrong, they will do the job, but they are buggier and harder to use than the Plex Roku app.Also.. I'm a plex pass member and I still had to buy the Amazon Fire Plex app for like 5 bucks. On Roku 3 the app was free. The Fire has had to rebooted once and I had seemed to become slow to respond a few times while running the Plex app. I find the Fire home screen more confusing also. Again, it's flashier, but it's just not straight forward enough to be enticing. I'd say it has potential and hardware wise the thing is a good deal, but it's not really a great deal since it's ultimately overpowered from streaming video, which is why steaming HDMI sticks are half the price or less. Gaming on my ARM based box .. yeah.. no thanks, I'll wait for the Steam box which if they are smart will function as a HTPC as well.Fire's only real advantage is it can fast forward and rewind faster than Roku 3. Fire has a few other features which are barely worth mentioning on Plex, the best minor feature so far seems to be that you can display an overlay of the file resolution and codec information, but that's probably useless to 99% of people. One thing I really wanted was an easy way to sit back and delete videos from by bedroom TV. Fire fails at this with this Plex app since the view resets to begining. I'm sure they will fix it.... eventually, but considering I'm getting basically no benefit from the Fire vs the Roku... I wish I had just spend the extra 20 dollars, which if you subtract the cost of the Plex app is only 15 dollars.For now Roku 3 is the best all in one simple interface to Plex. I bought the Fire based on reviews that the Plex app is superior on the Fire. It is absolutely not superior other than it displays more movie poster at one time, but jumping to sort by year, genre, data released and added takes a lot more 'clicks' or presses of your remote than it does on Roku.I think clearly what Plex needs is to stop designing the UI on the app side and design it on the server side and then just make the apps so they can pull the UI settings from the server. This way I can buy any supported Plex device and get the UI I want, themed how I want.", "verified": false, "helpfulness": "0/1", "author": "iamme"}, {"rating": 5.0, "review": "Every thing I thought it would be and more", "verified": true, "helpfulness": "0/0", "author": "lenora stevens"}, {"rating": 1.0, "review": "This is a piece of crap. Right out of the box it spent 10 minutes updating software then the screen froze. I went online to check the troubleshooting for it, unplugged it for 3 seconds like Amazon said to, and now it won't even turn back on! Save your money and get a roku.", "verified": true, "helpfulness": "3/8", "author": "Screenwritermike"}, {"rating": 5.0, "review": "This little box is terrific!  I expected another Roku (which I have loved and have 2), but this is better!  The install is seamless and came already set for my Prime account.  All I did was plug it in, sign in and it was ready to go - absolutely fantastic.  I am a convert and the streaming is streets ahead of even the best Roku.  Want to change all my units this was so great and the gaming is simple too. Love it, love it, love it!", "verified": true, "helpfulness": "2/2", "author": "Amanda"}, {"rating": 5.0, "review": "Very sleek in appearance and the performane to back it up. No issues with setup, very quick and responsive and just works. Much better than most built in smart tv apps. Will be purchasing another.", "verified": true, "helpfulness": "2/2", "author": "Joe"}, {"rating": 5.0, "review": "It's awesome actually. The music is pretty cool, plays all the words etc. BUT, I have a question. Please someone answer. HOW THE H E DOUBLE HOCKEY STICKS DO I TURN IT OFF. NO POWER BUTTON.", "verified": true, "helpfulness": "2/3", "author": "bob"}, {"rating": 5.0, "review": "a", "verified": true, "helpfulness": "0/4", "author": "costa"}]