[{"rating": 5.0, "review": "This device should be in every home. It is so easy to use as long as you have a wireless internet connection in your home.I watch Netflix in my bedroom. My daughter watches youtube videos in her bedroom. We all watch videos on the bigscreen.", "verified": true, "helpfulness": "0/1", "author": "Todd H. Orr"}, {"rating": 5.0, "review": "Super cool device. Tried it out right away and in minutes we were casting you tube Netflix and hbo onto our tv", "verified": true, "helpfulness": "0/1", "author": "Ashley S."}, {"rating": 5.0, "review": "for $35 you cant beat this thing. works off of my computer or my phone. super easy to setup and will either mirror what im looking at in chrome browser or play direct with certain apps such as netflix or youtube while i continue to browse other things on my device. very convenient, very cool. Love that i can use it with HBO GO. And as usual amazon had it to me in a day or so no problem. I highly recommend this for the price.", "verified": true, "helpfulness": "0/1", "author": "Cmiller"}, {"rating": 4.0, "review": "I have 2 tvs hooked up to Chromecast.  It works very well and the price is right.  My big complaint is Amazon Prime is not available.  Amazon keeps sending me notices that I don't use the streaming.  Can you guess why?  Let's get this on Chromecast", "verified": false, "helpfulness": "0/0", "author": "P. Iannicari \"LeoGirl\""}, {"rating": 3.0, "review": "I cut the cable and I have used internet only media for years so I wanted to check this out.  The bottom line is that the roku continues to be my go to device with the AppleTV as my number two.  This ranks a distant third because I find that the appletv does a better job streaming from my macbook air than the chromecast but if you don't have an AppleTV then this is obviously more affordable for specific uses.  I was amazed at how much processing power was required by the device streaming to the tv.  I think it's a very good version 1 but I am hoping for a more refined version 2.", "verified": true, "helpfulness": "0/0", "author": "Brian's Reviews"}, {"rating": 4.0, "review": "All in it works great.  It gets confused every once in a while and you have to reset it but I am going to buy another.  It's the coolest thing since sliced bread!", "verified": true, "helpfulness": "0/1", "author": "Randy PRuit"}, {"rating": 5.0, "review": "I really like this thing. Set up is a breeze, assuming you have a tablet, smartphone, or iPod. I'm less familiar with how setup works through the Chrome browser.The idea that anyone you allow on your wireless network can control your TV with their device is genius, as is the app-centric controls (you already probably know how to use Netflix, YouTube, and Hulu etc. on your phone - now you just hit the \"cast\" button from within the app.More apps are added every month or so, and with the planned international expansion, it seems like it's only gaining traction.", "verified": false, "helpfulness": "1/2", "author": "Louise C O'Brien"}, {"rating": 1.0, "review": "can't believe this something that Google makes...it's horrible.  only works with Chrome and Youtube..it sucks...this is no apple tv...", "verified": true, "helpfulness": "1/6", "author": "borg lin"}, {"rating": 4.0, "review": "The device is good. Already watched several movies of various websites.Easy to get started once you have the extension on chrome installed.At first it big confusing and you will immediately notice the lag between the laptop/cell phone/ tablet and the pic shown on TV.The source device will be few seconds ahead of the TV. Not a concern since only one of the two devices will be used to watch anyway.for 35$ it worth the investment and have the flexibility.I wish google would add more apps onto the device faster.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Background: I recently purchased a Chromecast after doing a bit of research into new ways to connect my devices (desktop, phone, and tablet) to my TV. Before I moved, I had my computer connected directly to my TV through an HDMI cable, but due to the layout of my new apartment, that was not going to be feasible. I looked at products such as the Roku and the Western Digital equivalent, but I couldn't bring myself to purchase those devices at the price they set, knowing that I could basically do the same thing on my PS3.Setup: When I received the item in the mail, I was eager to get it hooked up so that I could try it out. While the commercials don't show it, I would like to point out that there is a power cable that you must use to hook the dongle up to either a usb port or a wall outlet (via a provided adapter). Some people may be able to just plug in the dongle without the need to hook it up to another power source, but this all depends on your TV. It is safe to just assume that you will have to attach a cord to the dongle. Setup itself is a breeze, although I was having issues setting the device up from my PC, so I just used my phone.Use: The device is really simple to use - all you have to do is press the cast button on supported apps and wait for it to switch over! The list seems kind of small right now, but I'm not sure how many more apps really need to be integrated. I wish that Showtime supported it, but I'm not surprised that they do not since their app is already rather dismal. However, HBO Go and Netflix worked like a charm. I had a minor issue with Netflix freezing while initially loading, so I just had to stop the cast and restart it. One of my favorite features is that I can continue to use my device while it is casting content to my TV - every multitasker's dream! Also worth noting is that you can get an add-on for Chrome that allows you to stream from your browser. While I thought that this might solve the Showtime problem, there was still a slight problem - the video will not be cast if you maximize the screen. For those of us with media files on our computer that we would like to watch, the add-on makes this simple! Simply locate the file that you want to cast and copy it's local address into the URL bar of Chrome (e.g. C:\\Users\\Josh\\Videos\\sample.avi). Hit enter and the video will start playing. Simply cast this tab to your dongle, and you're set. You can even maximize the screen if you choose.Additional thoughts: For some reason, I really enjoy the simple screen saver that Chromecast displays while it's not in use. Maybe it's the clock that is on the screen. Also, there is an extension arm in the box if your dongle is getting a poor signal or if your HDMI port is at an inconvenient angle.All in all, this is definitely a product to invest in, especially if you are thinking about cutting the cable. I strongly recommend it.", "verified": false, "helpfulness": "1/2", "author": "Josh Bittinger \"Josh\""}]