[{"rating": 5.0, "review": "The most fun I have ever had with such a petite product. I've just received it, and I am excited about all of the possibilities.", "verified": true, "helpfulness": "0/0", "author": "The Baltimore Kidd \"Lance\""}, {"rating": 5.0, "review": "Pretty great product. The voice thing works well - but doesn't search your hulu or netflix - only your Amazon lists. Fast and no crashes or issues at all!", "verified": true, "helpfulness": "0/0", "author": "MWM"}, {"rating": 5.0, "review": "W O W !!!  I've been a Roku user for years, and I couldn't be more impressed with Fire TV.  I am so impressed with the quality of every aspect of this device and the service that my loyalty to Amazon is even stronger.  I am certainly looking forward to the new Echo.  Well done indeed!", "verified": true, "helpfulness": "0/0", "author": "Craig A. Davis \"bluegator\""}, {"rating": 2.0, "review": "It is not as good as the RoKu. The channels that you get for free with the Roku you have to pay for with Fire TV. You can access some of them only if you have Prime. For a better budget in programing get a Roku!", "verified": true, "helpfulness": "0/0", "author": "K. Price"}, {"rating": 5.0, "review": "Absolutely Amazing, Exactly what I wanted and exactly as described.  I love this device especially the voice search function.", "verified": true, "helpfulness": "0/0", "author": "Archie"}, {"rating": 1.0, "review": "A lot of good and even more bad. Easy enough toturn on, but there is no off, if you will. I inquired and they said simply turn your TV off. the box will follow. Has been the case for 90-95% of the time-the rest of the time the damn unit actually turns my TV back on. Now Ive set my TV to go off automatically every 2 hours...what a nuisance that has become! Then theres the Netflix App. Since thyve updated it, its been DOWN more than anything! I have to keep unplugging my box to reset it! Then...sometimes the App / box will  remember me; otherwise, its back to the sign in window!", "verified": true, "helpfulness": "1/4", "author": "John"}, {"rating": 5.0, "review": "Good:Small form factor. Great remote. Fast processing.Bad:The constant price drops. Just wait for it to go to $84 before purchasing.Recommended?Yes.", "verified": true, "helpfulness": "1/1", "author": "Albert"}, {"rating": 5.0, "review": "One of the best impulse buys ever.  This is one of the best set top boxes hands down. It might have less app eco, but it has many of the very important ones you would expect.The opening of the box is very premium, at Apple quality level.  The features are pretty great.  It just works.  The over all experience is great.  I stopped using my PS3 for viewing Netflix.  I almost use it every day instead of things I used to use.I'd like to see cross app integration of search.  Not a knock at Amazon, the only lace that comes close to offering a cross system search is CanIStream.it website.Buy it! Easy to use for people that are not technically minded.When cable finally goes IPTV, they should do case studies on all the Set top boxes and their various Apps to sift through to the good UI and UX that many offer already.", "verified": true, "helpfulness": "0/0", "author": "Kode AC"}, {"rating": 5.0, "review": "If you have Amazon Prime, Netfix,and or Hulu you need this item.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey F."}, {"rating": 4.0, "review": "My batteries last a few hours and then the remote shuts off. I tried $10 lithium batteries and they lasted one day.", "verified": true, "helpfulness": "1/3", "author": "Victoria L. Klahn"}]