[{"rating": 5.0, "review": "Best investment I've made this year!!", "verified": true, "helpfulness": "2/3", "author": "Leo"}, {"rating": 5.0, "review": "This thing is awsome and for the price it's basically a sweet HTPC especially after you side load xbmc.  GREAT BUY!!!!", "verified": true, "helpfulness": "1/2", "author": "Trentin C. Daniel \"Apple Bag\""}, {"rating": 5.0, "review": "Love it and  no steaming problems anymore.  Set-up was easy and in a nice little package.", "verified": true, "helpfulness": "2/3", "author": "happy customer"}, {"rating": 5.0, "review": "The Plex interface is very nice.You have to pay $5.00 to get it but it is worth it.It is fast with a beautiful picture.All my media is 1080P and this streams without any problems. So far so good.", "verified": true, "helpfulness": "2/3", "author": "Adam Rodriguez \"ar\""}, {"rating": 5.0, "review": "The entire family loves it! With four Kindles, it is small, lightweight and easy to connect to different HDMI television's depending on which user wishes to view something they might normally watch on their Kindle, on a larger screen!", "verified": true, "helpfulness": "1/2", "author": "John W Long"}, {"rating": 5.0, "review": "this thing is the best 100 I ever spent!", "verified": true, "helpfulness": "2/3", "author": "kevin hutchcraft"}, {"rating": 5.0, "review": "very easy to hook up and use. It makes your tv a smart tv.", "verified": true, "helpfulness": "1/2", "author": "Linda Truhe"}, {"rating": 5.0, "review": "Purchased this on a whim and while waiting for it to arrive I purchased a Roku 3 because of the games etc.  Ended up returning the Roku.  To me - the fire tv is far superior.  Install could not have been any easier.  It just worked right away.  Virtually no setup.  The interface is close to flawless.  People seem to complain about how amazon mixes in paid content with free prime content.  Come on folks, use your brain.  It's not a problem.  Purchased a few games and they totally met my expectations.  Graphics are amazing.  Having the quad core processor it's extremely fast.  That's my favorite thing about the device.  It never lags.  Click a button and it responds.  The bluetooth remote works flawlessly and has a great range.  I use it to control pandora from another room.  I also bought the game controller.  It's comparable to a play station or xbox remote and also works well.  Battery life on both remotes has been great.  Haven't needed to change them after 4 months of heavy use.Features I use the most:- Pandora, great interface. Music quality is very high when playing through surround system.- Netflix.  Very responsive. No problems.- PLEX.  Really pleased with how this works.  Life changing.- Games.  I purchased a driving game and a first person shooter.  Both seem to be comparable to what you would get with a dedicated game system.  Each game was only 4.99.  Great value.There's a ton of channels.  The food channel is very entertaining and commercial free.  Others have an abundance of commercials which deter me from using them.Just buy the darn thing and try it out.  Easiest way to make your dumb tv smart.", "verified": true, "helpfulness": "2/3", "author": "GMONKEY777"}, {"rating": 4.0, "review": "Enjoying this so far, although I agree with others that it would be helpful to know what is Prime and what isn't.  Be kind of neat if they had some of the WebTV features from the 90s - surf the web and turn your tv into a giant tablet (maybe with a touchscreen remote control you hold)Making Amazon happy - I've bought a couple episodes of shows my DVR erased to clear space while I was working 80 hour weeks at my job for a few months.", "verified": true, "helpfulness": "1/3", "author": "CO Finn \"engineer\""}, {"rating": 5.0, "review": "Just like a cell phone, but it's for your TV. I love this unit.I can't wait to see what Amazon gives us in the future firmware updates. This unit has awesome specs, great hardware and is fast... with NO LAG! WD live's, Roku's, etc all have annoying lag that makes you want to pound the remote against your forehead. Speaking of remote's, the one that comes with the Fire TV is small, yet handy. It's covered in a rubbery like skin, simple to navigate and you can simply \"tell\" it what you want to watch.The coolest part of all this... Is that like an Android smart phone, the Fire TV can be modified so that \"tinkerer's\" like myself can Root it, possibly even install custom ROM's eventually.Mine came with 30 days of Amazon Prime service, and all the everyday TV apps (netflix, hulu, etc) you need to fill your couch potato needs.Cheers!", "verified": true, "helpfulness": "2/3", "author": "E. Murray - Gadget Guru"}]