[{"rating": 5.0, "review": "got this with a bundle, it came with my kindle fire HDX 7 inch, got the controller with it,  this is a great was to put your kindle fire apps up on the tv and watch movies or play games or look up items.  the kids love to see their games up on the tv and watch their movies too.", "verified": true, "helpfulness": "0/0", "author": "Marjorie M. Bertram"}, {"rating": 5.0, "review": "Was very easy to set up and use.  Great way to watch TV shows without having to pay Comcast highway robbery!", "verified": true, "helpfulness": "1/1", "author": "Allison Grussenmeyer"}, {"rating": 5.0, "review": "This is one of the best.....actually it is the best streaming media player that I have ever used. It's solid, compact....almost invisible on my TV stand. My wife prefers it to our chromecast, which has been moved to the bedroom as a backup...permanently. We use it to stream amazon prime and netflix. We are talking about getting Hulu Plus now too!", "verified": true, "helpfulness": "1/1", "author": "Lee Crigger"}, {"rating": 2.0, "review": "I purchased the Amazon Fire TV with the expectation that it would be simple enough that even a 90-yr. old could use. it.  After I set up the device and watched the primer together with mom, we began exploring the features.The first problem encountered ... the Fire TV isn't very good with voice recognition when the user has a moderate East European accent.  We tried many iterations, and frankly ... I thought my mother's voice queues were quite good.  But, it was not to be.  Curiously, my nominal Aussie accent was recognized as was my Americanized drawl pronunciation of nouns.Next, the user has to employ the remote to browse and select seasons and episodes ... spoken commands won't work here.  Consequently, the selection process becomes fairly complex -- not hard for the iPod trained user, but particularly complex for the elderly user.And then there is the complication associated with being unsure whether the content is included with Prime or pay-per-view; the Prime insignia is hard to distinguish from the regular HD insignia around 10-ft. from the screen, and there appear to be no extra cues when pay-per-view is offered versus free Prime showings.The product isn't entirely terrible.  But, it is not as easy to use as advertised.  I guess this product is geared for for native English-speakers between ages 10and 75, but less suited for users outside of those limits.", "verified": true, "helpfulness": "3/5", "author": "SanPa"}, {"rating": 5.0, "review": "I've thought about making this purchase for a couple of months now. Directv will be disconnected at the end of the month and I say good ridance. This device was super easy to install and I enjoy the flexibility of being able to watch whatever I want whenever I want via Netflix, Amazon and Hulu. The HD quality is amazing and I love the screensavers. I also bought an antenna to pick up local HD channels so, my monthly television bill will be about $15, compared to $125. Very happy and would highly recommend to those who have better things to do with their money than pay for expensive television programming!", "verified": true, "helpfulness": "1/1", "author": "aaw"}, {"rating": 5.0, "review": "I love the fire TV four many reasons", "verified": true, "helpfulness": "0/0", "author": "alfredofranco"}, {"rating": 1.0, "review": "I bought this to replace a non-WiFi WDTV so I could watch Netflix. I fully expected the FireTV to be able to play back files on a USB drive, but nope! It has absolutely zero support for any file types other than personal video and photos that you upload to your cloud. This makes the unit virtually useless to me, as I have lots of video and music that I would like to access via USB.I contacted Amazon customer service to ask if they planned on updating the device to accept USB storage and was told that the update was right around the corner. That was 4 months ago, and still no update.Also, the FireTV is so skewed towards other Amazon products, it is insulting. The voice search only works for Amazon content. Otherwise, you have to manually type in what you want to find.This box has the specs to be something great, but Amazon really blew it. Honestly, after this experience, I will be avoiding all Amazon products, including Kindle, phone, the new Echo, etc. Every product they sell is aimed at sucking you deeper into the Amazon hole.", "verified": true, "helpfulness": "1/1", "author": "Ben T."}, {"rating": 3.0, "review": "It is a great system, but it has it's share of problems.  We mainly use it for Netflix, Hulu Plus and Amazon Prime.  We were using Roku2 and Playstation3 and the picture from the Amazon Fire TV are amazing! I have not used the voice control, but it is a great addition.  My reason for the 3 stars is the overall performance of the system.  Sometimes after sitting all night and you try to turn it back on in the morning, it won't do anything.  I have tried to push every button to get it to come on and nothing happens.  I have to unplug the system and plug it back in to get it to come on.  When playing Amazon Prime videos or Hulu Plus, sometimes the show will freeze and you will have to push the play button and it will start playing again.  When playing Netflix, in the middle of a show it will say that they are unable to play the current selection.  Then you press ok and then play and it will start playing again.  This may happen one in a couple of hours or every ten minutes.  This could be an app problem, internet problem or maybe just isolated to my machine.", "verified": true, "helpfulness": "2/2", "author": "Kevin Plummer"}, {"rating": 5.0, "review": "Games, voice commands, options , music, movies!!!! This Fire TV is awesome esp if you have a kindle fire hdx to link/mirror your tablet on screen.", "verified": true, "helpfulness": "0/0", "author": "pearce evangelista"}, {"rating": 5.0, "review": "-Edit- 7-17-2014So I've been reading other people's reviews and you can near disregard more than half the 1-2 star reviews as people shouldn't be allowed to use a computer. I'm seeing reviews like (I didn't know I had to buy an HDMI cord so I couldn't try this. 1 star.) (I bought this but my TV already has netflix and amazon, it's useless. 1 star. Why did you even buy it!?) I mean it's countless inept and stupidity that people can't even look at a product, maybe research to see if you're 100 bucks is going to be well spent. Another one complains that voice search doesn't work for Netflix saying that using it causes Amazon to hijack you into Amazon Prime. When the hell did they ever say voice search was for Netflix? ITS A DEVICE GEARED FOR PEOPLE WHO HAVE AMAZON PRIME! Another two star because Netflix has a better movie selection. ....why are you even rating the device then if you're upset about the service? This is for the device not what you think of the service?Before I start I've been toying around with Android systems since the original Droid came out. Everything has always been rooted hacked overclocked etc. Amazon's device runs a modified Android OS (I think 4.x) I'll do some small review for the basics of what the general amount of you want, but most of this is going to be for the advanced users OH JOY!!So the basics which most of you are after.Streaming: Tons of content to be had here. Plex Media Server, Netflix, Amazon Prime etc. The picture and sound quality is exactly what you'd want out of this. 1080p crystal clear. Isn't much to say here. It does exactly what you want it to do.User Interface/Software: This is Amazon's downfall in everything they make. They are TERRIBLE at making user interfaces. Prime on the Roku, streaming on a PC, it's always the most cluttered mess you could possibly think of and it's never easy to separate prime available content from stuff you have to pay for. Main screen is \"ok\" and there's currently no way to hide sections you don't need. Side loaded apps that you install yourself are in the most inconvenient spot and takes quite a few movements to get to the location. A lot of this is a bit easier to navigate through using the voice command. Voice command works extremely well. They're constantly working on it and where it's at right now, I would say it's perfect. It's gotten everything I spoke into it, even swear words for the giggles and they still showed up but edited with *s lol. Isn't a whole lot of games on here yet but people are starting to pick up on the power this thing has which I'll talk about later. As of now, with the newest update, the main screen is just way too busy and unorganized, too many sections and it's all amazon stuff thrown in your face. Which isn't a con, it's their device after all, I don't currently have an Amazon Prime account to take advantage of it because I buy way to much stuff I don't need because \"meh...it'll be here in two days for free\" haha.Content: This is going to do everything you need it to do and more. You can play games on it which are a little scarce right now. Stream Movies, set up a Plex server (XBMC if you know what you're doing, more on that later) so you can stream movies/shows from your own computer server. Check the advanced part of this review to know what else you can do :DHardware: Simply put, IMPRESSIVE. Compared to say, the DRM locked down manhood removed control freak Roku 3, there's no reason you should ever buy that thing over this. Quad Core Snapdragon 1.6GHz, dedicated mobile GPU, optical out, HDMI out, and comes with a USB port. Optical out is a bit useless but I understand it. If you have HDMI it's going to carry the sound anyways so there's no reason you'd really even use the optical. If you're going to run a receiver however that has the optical connection for a stereo and doesn't use HDMI, this is where it'd come in handy. They could have done the RCA connections too but they didn't, people still have older TVs that like these devices. The plug is stupid. It's a giant square block that makes it super awkward to use on a surge protector. Should have been a normal plug with a brick a little further down the cord.- CPU and GPU combo is super impressive. GTA3 ported from Rockstar runs near full speed on max settings. Whole system, everything you do is super quick.- USB port will accept USB Hubs (use a powered one just in case) to expand how many devices you can use. This includes TONS of gamepads that are natively supported including Xbox 360 wired and wireless (need the PC dongle), USB external drives (root access only more on that below), keyboards and mice work, some people are working on USB cams for use as a security device.Quality: Superb. The thing has a nice weight to it and a nice grippy bottom so it's not going to go slipping and popping up when you get all the wires attached to the back. It's a really solid design. Remote is very well built and feels really good in the hands.The best part is this thing can act as a crime deterrent as well. They don't round the corners off, they're sharp..like...someone breaks into your house, throw the thing at them like a ninja star and they'll regret walking in the house.Pros:- Super fast with awesome hardware for what you pay.- It's Amazon, they have awesome support and they're working really hard on this device.- It's Android and it's unlocked which greatly opens up the potential for what you can do with this thing.- Very..very well built minus the corners. Ouch!!Cons:- Amazon's UI isn't the best, they need to scrap it and just redo the whole thing.- It doesn't make me toast.- Limited internal memory which near half of it is hogged by Amazon's modified Android OS so you really only have a little less than 4GB to play wtih.Now for the fun part O__OFor you android hacking hardware enthusiasts, this is a wet dream device.Root access takes all of about 10 minutes to break your device free to do what you want. You know what this means >:DWith root you can:External storageSideload apps like browsers, emulators, other apps you'd find useful, XBMC!!Customize the UI to run your own Launcher instead of using Amazon's cluster of a mess.There's a team from what I understand working on a ROM to allow you to undo Amazon's bloat.Google Play store. It's a bit of work to get it working but it works and it works great.For those who own the Ouya, you can sell your systems! The gamepad works natively and the Ouya store is now working on Amazon so you can play your games on better hardware.Emulators that I've found work the best.Robert Broglia's emulators, just search his name in the play store and grab everything he has for every system. The .emu series is the best and for the snes it's called Snes9x EX+. They work with almost every gamepad you can think of, allow for multiple players playing at the same time and offer the best on screen play. I think there's online play included too but I haven't gotten that far yet.For the PSX I use FPse and it runs full speed from the games I've checked. You'll have to acquire the bios on your own but I'm positive you already know how to do that ;)There's the DosBox emulator too. Just plug in your keyboard and mouse and wallah, go play DosGames.External storage works great and all you need to do is run stick mount and you can run usb stick drives or even external HDDsChrome runs great but you'll need a mouse and keyboard for it. Almost all the popular Logitechs work. Best to use is the K400 or the Dinova Mini or the Mini. The app will show up sideways, just click the blue box to accept (don't check the box), exit the app and when you come back it'll be in landscape mode.Any questions or comments, please do so! I'll help where and when I can :D", "verified": true, "helpfulness": "4/4", "author": "SpykeZ"}]