[{"rating": 5.0, "review": "Superb quality, it is all I expected from the device !!!", "verified": true, "helpfulness": "0/0", "author": "Gustavo"}, {"rating": 3.0, "review": "This appears to me to be a medium to purchase subscriptions, with little value in itself. By the time I bought enough subscriptions to justify owning this, they ought to be crediting me for the box. I personally will be connecting a computer to my television so I can hopefully have all the subscriptions that I want, but also be able to use a fully-fledged computer functionality. I didn't purchase it for the games, so there might be some value there.", "verified": true, "helpfulness": "0/2", "author": "Fotsir"}, {"rating": 1.0, "review": "Free Prime for a month turned into a very large bill! you do not get free amazon fire tv with prime!! false advertisment", "verified": true, "helpfulness": "0/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great so far!  Simple to navigate, very responsive controls and tons of content.", "verified": true, "helpfulness": "0/0", "author": "D. Crawford"}, {"rating": 5.0, "review": "OMG! I cant say enough good stuff about this!!! I went from an Apple TV to this and have been SO incredibly happy with my decision! I love that the remote made me lazier than I've ever been! Thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Melissa Martinez"}, {"rating": 3.0, "review": "We enjoy this but wish I would have bought the Fire Stick instead.....would have been A LOT cheaper.", "verified": true, "helpfulness": "0/0", "author": "Julie K. Nichols"}, {"rating": 1.0, "review": "I was able tp set it up and watch one movie and now cannot get back on line with it. I am returning it.", "verified": true, "helpfulness": "0/2", "author": "Donia"}, {"rating": 5.0, "review": "Awesome little box that compliments all Prime features.", "verified": true, "helpfulness": "0/0", "author": "Markie"}, {"rating": 4.0, "review": "Has anyone figured out why some shows don't have sound? Mainly on Netflix.  But it I use my PS3 the sound works just fine. Other than that it would be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 4.0, "review": "The fire tv works great and fast.  The only disappointing thing I have is that the voice command only works with Amazon, not Netflix or other places.  I would still buy it anyway.", "verified": true, "helpfulness": "0/0", "author": "Jerrold D."}]