[{"rating": 5.0, "review": "easy to hook up to tv and does what it advertises.", "verified": true, "helpfulness": "0/0", "author": "Robi M Peterman"}, {"rating": 2.0, "review": "Works basically OK. I casted some videos via a Chrome tab and they were OK, except that they don't use the whole screen. I stretched them to fit and the quality was OK, or perhaps just acceptable.I then tried casting some text screens via a Chrome tab and that really showed how much is being lost over the air. The smaller characters were unreadable. Without spending too much time to analyze this $35 product, it appears that the compression is doing this. MP4 videos played to an attached player box were MUCH sharper. So - meh! Neat toy, but I'll continue looking for a better player.", "verified": true, "helpfulness": "0/0", "author": "Gary L \"Gary\""}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "C.E"}, {"rating": 5.0, "review": "Loved ! really easy to use!Great price !", "verified": false, "helpfulness": "0/0", "author": "Leila Ohta \"Leila Ohta\""}, {"rating": 3.0, "review": "alright, i'm an idiot who didn't do enough research. you can't stream EVERYTHING off your computer. you need to load it into your browser and etc etc losing quality and etc. whatever. works well if you know what you're doing.", "verified": true, "helpfulness": "0/0", "author": "philip kim"}, {"rating": 4.0, "review": "Works!", "verified": true, "helpfulness": "0/0", "author": "joseph j schwartz"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "Janka Kozicova"}, {"rating": 5.0, "review": "great product with great idea! one problem i notice (not sure if it will affect lifetime of the product or not) is the power on all time.  The unit seems to be hot all time.  They should do a standby or some sort of power disconnect when not use, not sure, just through out an idea from customer perspective.", "verified": true, "helpfulness": "0/0", "author": "Duke"}, {"rating": 5.0, "review": "Love this! It was so incredibly easy to install and very user friendly to operate.", "verified": true, "helpfulness": "0/0", "author": "Vondy"}, {"rating": 1.0, "review": "It worked for about 2 days and then after that I just got errors every time. Tried to set it up again after doing a factory restore on it but it wouldn't even let me set it back up again. $35 paper weight. Complete junk, my router is on the list of routers that will instantly recognize it... but it only did for a couple days. DON'T BUY. I should have gotten a Roku.", "verified": false, "helpfulness": "0/0", "author": "Todd Collins \"Melodic Death Head\""}]