[{"rating": 1.0, "review": "While trying to get it to work I discovered the problem could be a compatibility issue with Win 8 OS or with my old  Linksys WRT54G wireless modem.  It just seemed like too much hassle to upgrade the firmware in the Linksys without any guarantee that the Chromecast would work or that I wouldn't screw up the Linksys.  Sent it back for a for a prompt refund.  Then I bought the Tronsmart and that works pretty well and easy to set up.  It works only pretty well because sometimes it needs to be rebooted.  The picture from the Tronsmart is OK but not as good as just using a long HDMI from computer to the TV.  But for images of my laptop where best picture is not a priority is it a convenience.  Haven't tried the Tronsmart from girlfriends iphone or from my little android tablet yet just from my laptop.", "verified": true, "helpfulness": "0/0", "author": "JessDancing \"Mr.BallroomDancer\""}, {"rating": 5.0, "review": "I love my Chromecast so much that I bought one for all of my brothers for Christmas. They like them so much that they didn't even accuse me of being cheap and not spending as much money on them as they did on me. It's a gift that makes people act like you didn't give them something that only costs $35.", "verified": true, "helpfulness": "0/0", "author": "Chris Kirkham"}, {"rating": 3.0, "review": "Does not support windows phone devices.  Its usefulness will continue to grow  over time.  Low cost device with nice features.", "verified": true, "helpfulness": "0/0", "author": "Moose the Moose"}, {"rating": 3.0, "review": "I bought this device so we could watch movies and tv re-runs while traveling.  I haven't been able to get it to work at hotels like Wyndham and Disney.  Apparently hotels have their wifi in \"guest mode\" and that prevents the Chromecast from communicating.  I'll be taking a cruise next week and I'm hoping for a different result but I'm not holding my breath.  It works great on my home network with the iPad Air but I don't need this kind of solution at home.  I'm also hopint Amazon will allow their videos to be displayed with the ChromeCast.", "verified": false, "helpfulness": "0/0", "author": "Daniel Lewis"}, {"rating": 4.0, "review": "That is, of course, my own fault.  What it can and can not do are clearly listed in the literature and reviews.  I just  didn't choose to listen.  That said, it's a fun toy to get some material, but not all, from my IPad Air to my TV. Amazon, Net Flicks and You Tube are fine but content is limited.  One definitely can not stream photos or most other content. So, understanding the limitations, it's a fine gimmick which allows one to wast an incredible amount of time for just $35.00.", "verified": true, "helpfulness": "0/0", "author": "Mary M. McGoldrick"}, {"rating": 3.0, "review": "The process to connect Chromecast with a tablet or phone is clunky and convoluted.The tablet or phone you are using as a \"remote control\" for Chromecast apps gets \"detached\" many times.Being unable to cast the screen from a phone or tablet Chrome browser is a big drawback.Still for the price it is a great and inexpensive device to stream Netflix, Youtube and similar apps", "verified": true, "helpfulness": "0/0", "author": "UPH \"UH\""}, {"rating": 4.0, "review": "Great little device, but slightly lacking. They need more compatible apps or to enable miscast. Right  now it is only good for a dozen apps. Chrome tab casting is also nearly useless, due to lag & mediocre audio/video.For Netflix, Hulu+, HBO Go & Google Play Movies/TV/Music it is awesome, with good video quality & 5.1 audio channels. No they only need to enable all HDMI 1.4 features so you can ditch the required Micro-USB power cable.", "verified": true, "helpfulness": "0/0", "author": "George Leon"}, {"rating": 3.0, "review": "Google Chromecast HDMI Media Player comes in a box with the only instructions to plug it in your TV set and away you go....or under ideal circumstances this is what should happen. I did just what was instructed but still have not been able to watch anything  using this device. There is absolutely no instructions on how to set up/activate the device to receive and view material of any kind.To be fair, I have not done much research or search for this kind of information as my scarce efforts so far have resulted in great frustration. I plan to search anew for guidance on how to setup & activate Chromecast at which time I will be in a position to give a more informed rating.", "verified": true, "helpfulness": "0/0", "author": "TheChaNar"}, {"rating": 5.0, "review": "we are a media household.  everybody has the app on their phone and so we play music, TV and youtube through it all the time.  Great device", "verified": true, "helpfulness": "0/0", "author": "Ken Shaw"}, {"rating": 3.0, "review": "I was expecting a bit more out of this device.  It does not work with Amazon Prime and I don't want to purchase another delivery device.", "verified": true, "helpfulness": "0/0", "author": "Nancy N"}]