[{"rating": 5.0, "review": "I own an Apple TV3, Roku 3, and RaspPi as media streaming. This is by far the best I've experienced.The user interface is clean and the hardware behind this device is spectacular, everything loads quick and feels snappy. The Roku started to crash or freeze quite a bit, AppleTV was always solid but it had very limited functionality for what I wanted to do.With the FireTV, being able to side load apps is critical for my needs - this is a perfect device for you folks who use XMBC and other apps.I do wish there was an integrated volume control that way it would be a complete control system without swapping between remotes.Overall, you won't be dissapointed with this device especially if you learn to side load apps into it further extending its functionality.Highly recommended!", "verified": true, "helpfulness": "1/1", "author": "AC \"AmericanEagl\""}, {"rating": 5.0, "review": "I LOVE this device! All I have to do is say a name into the remote and it quickly brings up everything I need to know or watch about the entertainer I ask about! Love looking at all my pictures on the Big screen too! I have not tried the games yet but have no doubt it would be a blast! Very easy to set up and I a not a techie...", "verified": true, "helpfulness": "0/0", "author": "Jack Ferguson"}, {"rating": 5.0, "review": "great, easy to use.  speak and find exactly what you want. if i can do it anybody can do it!", "verified": true, "helpfulness": "0/0", "author": "Sherry K. Dezonia"}, {"rating": 1.0, "review": "I stream sports and have \"cut the cable\" so ESPN, etc and anything that requires a cable subscription is out. My Roku has NFL and NHL apps that I can subscribe to watch my sports. Amazon Fire doesn't have that offered, so it is pretty much useless to any sports fan without cable.", "verified": false, "helpfulness": "5/13", "author": "Reuben M Waterman"}, {"rating": 5.0, "review": "Amazon fire tv works great ! The voice option worked every time for me, and saved a lot of time looking for a certain movie or program. The wifi connection is much better that on the streaming device I was using! All in all a great buy for the price!", "verified": true, "helpfulness": "1/1", "author": "Alvin W."}, {"rating": 5.0, "review": "the only thing I will comment on as to set-up:  make sure your internet modem and router are close by.  I could not get \"Fire\" to find my Wi-Fi until I moved the connections closer (in the same room) as the Fire box.  Just saying....make sure your signal strength is strong in the room you plan to hook up Fire TV.  otherwise, setup is a breeze and the menus extremely user friendly.  lots of choices of things to view, and the voice search worked perfectly \"right out of the box\".  I am really enjoying the watching--only downside is I watch way too much!!  :)", "verified": true, "helpfulness": "3/3", "author": "bwrv53"}, {"rating": 3.0, "review": "The sound quality is off when streaming from certain channels.  Such as Hasbro or Netflix.", "verified": true, "helpfulness": "0/2", "author": "Joshua Wallace"}, {"rating": 4.0, "review": "Voice search is great and the synergy between this device and your other Amazon accounts and content is amazing. I don't know how to turn it off is my only functional criticism. Otherwise, getting your Netflix and other streaming content is not as smooth as I would like, but it's better than okay. easy to set up and use. With the Kindle deal, hard to beat.", "verified": true, "helpfulness": "0/0", "author": "Avec Nourriture"}, {"rating": 5.0, "review": "Easy set up and best way to take advantage of Prime streaming video from Amazon.  I would highly recommend to others.", "verified": true, "helpfulness": "1/1", "author": "SuperMAC"}, {"rating": 5.0, "review": "I wish prime had a lot more newer movie choices. I really am enjoying this neat little gadget", "verified": true, "helpfulness": "1/1", "author": "Tim p zetterwall \"tim p zetterwall\""}]