[{"rating": 5.0, "review": "I will always call the devices I mention by full if not mostly full name like my Xbox 360. That way people know which Xbox I am talking about and those without the knowledge of them don't just get confused when I reference a 360.This is my first go at what I call a Media Box.I've heard of Google Chromecast. I've looked and avoided Apple TV(I boycott them). I have seriously considered the Roku 3 and then when I saw the internal specs for the Amazon TV I was instantly leaning that way.I'm a junkie for high specs and smooth interface.I will say this being only day 2 with the device that I love it.I will also say I have no actual experience with the others so I am coming only from using my Xbox 360 and a PC as well as mobile streaming.It was super easy to set up. An instructional video came first. told the basics and then off I went to explore.It was super easy to connect to Wifi and download Netflix, Hulu, Youtube and Flappy Bird Family(Who doesn't need a time killer game while waiting for the Significant Other to get into the room :) )Power Plug is well designed to lay flat against the wall so you can put it behind a dresser or something with only about 1\" to 1\" 1/2 needed from the wall.The box itself is very small and sleek black, I love the design. The remote is small and has a slight dip in it on the back for fingers. It feels nice and simple. Easy to use.The interface is nice. It shows tags to recently viewed, pupular, and other things of the sort with images of the show. Most of these are on Amazon Prime but what do you expect with an Amazon device?It's easy to navigate and easy to download and go into any app.Fast getting in and out of apps as well.The voice search seems to be what everyone is peeved about being it only shows you Amazon Prime results. Again, on an Amazon device I'm not surprised not upset. I don't mind searching through the apps. No different than what I've been used to on my Xbox 360 and PC.Honestly the Amazon TV is so much faster going between apps I'm not debating (depending on future experience and dependancy) replacing my Xbox 360 in the living room with an amazon TV as well. On the Xbox 360 it takes so long to get in and out of apps it can be a hassle looking for something between them.The Amazon TV has a screen saver feature for when you leave your tv on and aparantly it continues if it is off as well. It does not have a power button or any way to force sleep mode but after around 30 minutes with no activity, TV on or off, it will go into sleep mode. This is nice and easy. I can watch a show, turn the TV off, and know in 30 minutes it will go to sleep. It's a fast start up and fast to leave if you are in a hurry.I have not used the ethernet port yet, nor the Optical Audio out so i can't comment on those.I also have not purchases the game controller so I can't input on that either.Coming from someone who uses a Xbox 360 or PC to watch shows, the Amazon TV box is amazing. It is fast and simple. Clean and uncluttered. It has options for games and plenty of apps to download for different channels and what not.I like it alot. It makes watching TV in the bedroom as easy as turning the TV on, press a button to wake Amazon TV up. Watch a show, turn the TV off and Amazon TV will go to sleep probably by the time you do.For someone who wants a simple device for streaming I highly recommend this.Again I aven't used any of the other Media Boxes but this one has me won over after day 1.", "verified": true, "helpfulness": "1/1", "author": "Deltoriasis"}, {"rating": 5.0, "review": "Replaces my apple tv and roku box on my main TV, love it.", "verified": true, "helpfulness": "0/0", "author": "G. Brown"}, {"rating": 5.0, "review": "Love this so much, ended up buying one for every room in the house. Love the voice command. Interface a bit different than AppleTV but you get used to it. Can't go wrong with this item.", "verified": true, "helpfulness": "0/0", "author": "papurchases"}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "TLR"}, {"rating": 5.0, "review": "I have one and ordered another when Amazon dropped the price.  It is so easy to use, even my husband can do it!  Connects to wireless without a hitch.  Had a small problem with audio in Prime but worked it out with suggestions from other reviewers. Best product for streaming out there in my opinion.", "verified": true, "helpfulness": "0/0", "author": "doorcogal"}, {"rating": 5.0, "review": "Well, I am a 60 something Grandma who had to read the reviews before I even knew what this gadget was!! I was researching blu-Ray DVD players when I ran across this. I did some more research and figured this would pair well with my husband's Kindle Fire. So, it arrived promptly (as usual) and I was immediately impressed with the quality \"Applesque\" packaging. I put the batteries in the remote, plugged it in, attached the HDMI cable and up everything popped! I was watching an episode of \"Dallas\" from my library. Can't get any better than that! I played with it all afternoon and love it. Thank you to all the people who took the time to review this product. The reviews are invaluable...especially to some of us seniors that are still trying to catch up with all this new technology!", "verified": true, "helpfulness": "3/3", "author": "Cathryn McNeely"}, {"rating": 1.0, "review": "The comparison chart needs to be fixed. Showtime Anytime and Amazon Instant Video are both accessible with Chromecast. Showtime Anytime can be viewed via phone, tablet and pc with Chromecast. Amazon Instant Video can be viewed via pc with Chromecast. When using Chromecast with your pc, it casts your chrome browser onto your TV, so you can virtually watch anything with Chromecast through your pc. (Please note, when I say pc I mean any computer, macs included. I mean pc freaking stands for \"personal computer\") Sorry, for the 1 star, but it won't let me post without any stars.", "verified": false, "helpfulness": "3/7", "author": "Zedsdeadbaby"}, {"rating": 5.0, "review": "Excellent product!  Simple, extremely fast, great price.  A+++", "verified": true, "helpfulness": "0/0", "author": "Nicholas Ruppert"}, {"rating": 5.0, "review": "I got rid of my dish (TV) and now watch all these great shows I was previously unaware of.  I love that once I watch something, there are recommendations of other shows I might like.  I love the 5 star ratings, so I don't waste my time watching something mediocre.  Best thing I've purchased in a very long time!", "verified": true, "helpfulness": "2/2", "author": "Sharon H."}, {"rating": 4.0, "review": "The streaming on the unit is very fast to start especiYyally if you've had it running a while and watched a few movies. Main complaints are lack of apps. I would think you could get WeatherBug or similar but nope. Google music? No. Also although I do like the Bluetooth remote it would have been nice to have something that could control my TV volume too. Also since it's black it is constantly lost. Voice search is just a revenue generator for Amazon. I constantly see my wife buying movies that are free on Netflix because she voice search for them and it only returns Amazon results.", "verified": true, "helpfulness": "3/6", "author": "Cory C. Laursen"}]