[{"rating": 4.0, "review": "Nice job Google, sadly you can't streaming your own contents in a NAS", "verified": true, "helpfulness": "0/0", "author": "Neker de la Llana"}, {"rating": 3.0, "review": "great price, don't really have any reason to use it though. I can watch youtube on my tablet...", "verified": true, "helpfulness": "0/2", "author": "Mr Newton"}, {"rating": 3.0, "review": "I use this several times a month. It works great, but very limited functionality and programming availability from mobile device, and no remote.", "verified": true, "helpfulness": "0/0", "author": "TD"}, {"rating": 5.0, "review": "Excellent I can only say that the chromecast is perfect for watching movies, series, TV programs, etc without having to use a dvd player or blueray, can see everything online using an android device (in my case), you can also see videos YouTube, create a playlist where anyone who is connected to the WiFi network can add videos to the list; It is ideal for a meeting or party at home, if you have a home theater can acclimate with music videos from YouTube, you can also share the multimedia files from your tablet or smartphone, is the complement to the tv which would connect your smartphone to your tv", "verified": false, "helpfulness": "0/0", "author": "Reinaldo Rivas"}, {"rating": 5.0, "review": "Easy to use and nice having the extras on my NON smart TV.  Reasonably priced.", "verified": true, "helpfulness": "0/0", "author": "Trish G"}, {"rating": 5.0, "review": "Was a gift, they love it, fast shipment", "verified": true, "helpfulness": "0/0", "author": "Roy A. Ridondelli"}, {"rating": 3.0, "review": "Streams quite well from my Android phone but poorly from my new laptop.  Does not stream video as well out of chrome browser as I thought it would.  Also is very slow and quite poor for streaming a chrome tab for showing websites.  No Google Picasa integration yet either for easy photo sharing.  All in all, if you have a mobile phone you want to stream YouTube videos from, this works surprisingly well.  Beyond that, I'm not all that impressed.", "verified": true, "helpfulness": "0/0", "author": "CheeseHeadFan"}, {"rating": 5.0, "review": "It's easy to setup and easy to use. I plan on buying 3 more and cutting cable off completely.", "verified": true, "helpfulness": "0/0", "author": "charleybrwn13"}, {"rating": 5.0, "review": "So much awesome.", "verified": true, "helpfulness": "0/0", "author": "DBroome"}, {"rating": 3.0, "review": "tempermental, only works on certain things and shuts off on its own occasionally.", "verified": true, "helpfulness": "0/0", "author": "No one's business"}]