[{"rating": 5.0, "review": "Excellent!!!", "verified": true, "helpfulness": "0/0", "author": "jay"}, {"rating": 2.0, "review": "This thing is useless... Every day I'm pulling my TV out to unplug it because it stops responding or just plain doesn't work... It's bad enough I Can't stream local videos over the network like you'd expect this thing to be able to do... Except with the third party app \"Videostream,\" which claims to be able to, but then complains about problems with your network that don't exist, and then somehow manages to lock up the Chromecast so that I have to go pull the TV out again and unplug it!", "verified": true, "helpfulness": "1/1", "author": "Ducky"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Abi Carrero"}, {"rating": 5.0, "review": "Chromecast has the best buddy system with Plex. The YouTube casting is great as well with their TV queue, but Netflix does have some issues. Plex and YouTube are good enough for me, I use my PS3 for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ryan Pentecost"}, {"rating": 4.0, "review": "I like it, but still need smart phone to run those Internet website. Just we can see with wide screen on TV.", "verified": true, "helpfulness": "0/0", "author": "Thin Thida Khaing"}, {"rating": 5.0, "review": "I haven't had any problems with Chromecast so far - Amazon Prime doesn't like to play nice with it but that's Amazon's fault, not the Chromecast. It's quite useful and got rid of our rather lengthy HDMI cable I had running from my desktop.", "verified": true, "helpfulness": "0/0", "author": "Caleb Horchler"}, {"rating": 4.0, "review": "Needs to be restarted more often than I'd like.", "verified": true, "helpfulness": "0/0", "author": "CFlo"}, {"rating": 5.0, "review": "My wife loves this thing.  from the tablet to the TV", "verified": true, "helpfulness": "0/0", "author": "Neil J Norcross"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Roberto L."}, {"rating": 5.0, "review": "I'm really glad I bought this because I like that I can watch anything on my TV by simply pressing a button on my phone. This makes a great gift too.", "verified": true, "helpfulness": "0/0", "author": "Miya"}]