[{"rating": 5.0, "review": "I like this product. It was pretty easy to set up And has worked just like I thought it would.", "verified": true, "helpfulness": "0/0", "author": "Jacob Twain \"Jake\""}, {"rating": 5.0, "review": "Had to reset the TV after a week due to some technical problem after that no problems. I was using a Wii to watch YouTube, Netflix, and Hulu, but now I can watch them in HD. Not the best if I want too skip, FF, or repeat over and over, but general watching is really nice. Any guest using my wifi can cast from their phone. So we can talk on a subject and the first to find a video can post for everyone.", "verified": true, "helpfulness": "0/0", "author": "Teller"}, {"rating": 5.0, "review": "and hbo just came out too. not a bad deal. I wish it was just a direct stream of my desktop but maybe someone will have that come out another time..", "verified": true, "helpfulness": "0/0", "author": "Jones"}, {"rating": 5.0, "review": "i love almost everything about this! i can cast chrome, youtube, netflix, hulu, hbo go, etc... the ONLY thing i wish i could change is the amount of apps available for streaming(shotime, my personal pictures and videos, etc..)  with this device, but it is new, and i'm sure more will be added to the list in the future. i have a strong wifi connection in my apartment, so it works very well. once in a while it stops to buffer, but it's rare, and within seconds it's finished, and plays the rest of the show/movie/video in it's remainder. this is probably the best $35 i've spent in a long time(and that's saying a lot, i got an awesome deal on a pair of shoes last week). my husband and i use quite often, very happy with my purchase. this is great for people who don't own gaming systems and can stream from there and are looking for an alternative. and can i seriously just mention that it's only $35 one more time!? awesomesauce.", "verified": true, "helpfulness": "0/0", "author": "Paige Zisser"}, {"rating": 5.0, "review": "I ordered the chromecast on monday at my door on Saturday, plugged in to the tv, ran the setup and was streaming videos from Netflix on my tablet under 10 mins. Ran some karaoke from you tube, I am more than satisfied with the chromecast, what bugged me and this almost always happens to me, the price dropped from 35.00 to 29.99 in a week. But still I am overjoyed with it. I did get free shipping so that was a plus!", "verified": true, "helpfulness": "0/0", "author": "terry"}, {"rating": 5.0, "review": "This thing is great works from my tablet anything on tablet can be seen on the tv totally, conrolled by tablet", "verified": true, "helpfulness": "0/0", "author": "jim hagen"}, {"rating": 1.0, "review": "Everything worked great for several weeks, but recently one of the Chromecasts keeps losing connection to our WiFi (i.e. our Android smartphones and Chrome browsers can no longer find the Chromecast).  Rebooting the Chromecast (by removing the USB power) fixes things for a short while (30 mins or so), and then the Chromecast is not visible on the network again.  Nothing has changed on the network (same WiFi, access points etc), and all our laptops and phones work fine.  Another Chromecast (we have 3) worked fine for a few hours, and then would only put out a black and white picture (even after factory reset and reboots).  So, a great idea when it works, but the quality of these units is clearly sub-par and there are some significant kinks to be worked out.Update: 2014-11-26:  2 out of 3 of these devices continue to be worthless.  Reset to factory defaults, reboot, log back in to WiFi - everything works great for an hour, but then they lose connection, and the Android Chomecast App or Desktop Chrome plugins cant find them again . 1 of the 3 works perfectly.  A pretty pathetic quality score there.  While the AppleTVs are more expensive, and dont have quite the potential (at this time) that the Chromecast does, they do at least *work* when you need them, which counts for a lot. Dropped rating to 1/5", "verified": true, "helpfulness": "0/0", "author": "The Wizard of Oz"}, {"rating": 1.0, "review": "I like the form factor of this dongle. It's small and hides neatly behind the TV. Setup was easy and took less than 5 minutes. During the setup I noticed the first flaw: Chromecast does not support 5Ghz Wifi routers. That's a problem since in my building there are do many Wifi networks that the performance on my 2.4Ghz wifi is extremely poor. Not good for streaming. The second flaw is the resolution: on my full HD TV it looked pixely and I seemed to get 720p only. Colors were off for my taste. I tried Netflix, Hulu plus and YouTube on my iPad and I could without any problem hand a stream over to Chromecast and control streaming from the app. If you have a smart TV already you will notice that handing over streams for Netflix and YouTube you can do already without the Chromecast and unlike with streaming via Chromecast, you do not loose the ability to control streaming with your TV remote control. So then I tried casting Chrome tabs to Chromecast. You need to install a plugin and fiddle with Firewall permissions since the Chromecast needs to be able to establish a connection to Chrome. When I castes a tab with a steam, I noticed a lag and a jitter. And this feature is marked as beta and crashes all the time. There is also an option to mirror the entire screen. Worked OK and us maybe an option when you wanna give a presentation. But don't expect you can watch a stream with this.All in all I am disappointed and decided to return it. The lack of 5ghz wifi is a deal breaker. And if you already have a smart TV, the Chromecast does not give much added value.", "verified": true, "helpfulness": "0/1", "author": "c7epy83y5j"}, {"rating": 1.0, "review": "I purchased this a few weeks ago on impulse after reading a lot of hype on how great this device is.  Had I done the research I typically do before making an electronics purchase, I would have saved about an hour of setup and trying to figure out how to share videos I'd taken on my phone.  Instead, based on the description I read, I was led to believe that Google came out with a media player that gives you the ability to stream photos and music from your phone or computer. \"Genius!\" I thought.  I bought it believing it would be much easier than having to connect my phone to the TV if I want to show off my video footage on a larger screen for house guests!  Nope.  Apparently, Chromecast only allows a certain number of applications to work with the device.  Tonight, after actually doing the extensive research I should have done initially, I found that it is possible to stream local videos IF I upload them to youtube first.  But that, to me, is a PITA.  To add insult to injury, I found that there was a way to stream local media through an app called Allcast, but Google blocked it from streaming to Chromecast.With Chromecast's restrictions paired with the limited application support, I can't see any good reason to use this for anybody who has a WDTV Live, Roku or any other streaming device.  Because fortunately, Allcast (and likely other apps) does stream local media to these devices without having to jump through a bunch of Google's hoops, rendering the Chromecast useless and a waste of money.", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 1.0, "review": "Bought ours from Walmart. Took it home and tried over an hour to get it to work. Followed instructions (not much info provided with the item so I had to surf the Web for actual answers), made sure all cords were plugged in, lights were blinking, and still it never came up on our TV. Returned it to Walmart the next day. Very disappointed.", "verified": false, "helpfulness": "0/1", "author": "Ignacio Blade"}]