[{"rating": 5.0, "review": "I love it! My husband bought it for me for Christmas! It is so easy to work and I am amazed at what all it does!", "verified": true, "helpfulness": "0/0", "author": "BlakeRussell"}, {"rating": 5.0, "review": "Although we have a \"smart\" TV, we've never been able to stream successfully. With this device, it is easy and works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Dream Catcher"}, {"rating": 5.0, "review": "Still learning all it can do. Works great though, Thought it would be harder to use. Silly me.", "verified": true, "helpfulness": "0/0", "author": "karen reiter"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Karen L. Herndon"}, {"rating": 5.0, "review": "A simple way to access ALL kinds of television shows, movies, musicians, and more!  I am so glad to be rid of cable and the costs.  This devise saves money, time and is very convenient.", "verified": false, "helpfulness": "1/1", "author": "Greta Simpson"}, {"rating": 5.0, "review": "Tbh, I hated the idea of the fire TV. Primarily because I thought Amazon instant video was on most streaming boxes, TVs, and consoles.But when I got it for Christmas, that changed instantly!Pros:1.small, so you can bring it places2.built in miracast for android devices3.for its price and features, this thing is cheap compared to the others!4. You can use other Bluetooth controllers or the Xbox 360 controller receiverCons1.i believe windows 8 uses miracast, but the fire TV doesn't support it (yet)2.no built in AirPlay, but for obvious reasons.But you can get an app for that.3.the fire TV controller is expensive! But luckily, like I said you can use other Bluetooth controllers", "verified": true, "helpfulness": "0/0", "author": "Justin hart"}, {"rating": 5.0, "review": "Kids love this box!  Hopefully with the increase in Prime cost these will come down in price.", "verified": true, "helpfulness": "0/0", "author": "CJR \"msteacher\""}, {"rating": 5.0, "review": "Easy to install.  All my movies and shows were right there.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Rachel Borhauer"}, {"rating": 5.0, "review": "I haven't had the opportunity to watch it much but my son absolutely loves it", "verified": true, "helpfulness": "0/0", "author": "deloris c.hightow"}, {"rating": 5.0, "review": "I bought this for my Wife as a Christmas gift to enhance her Kindle Fire HD that I got for her a couple years ago.  She loves all things TV-related and has control of the remote in our house.  So far she loves the Amazon Fire TV but she hasn't had time to fully explore it yet.  She said the voice search has worked flawlessly so far.  We'll update the review if things change as she becomes more familiar with it and the features that are available.", "verified": true, "helpfulness": "0/0", "author": "Char"}]