[{"rating": 5.0, "review": "LOVE it. Very user friendly, and no more loading screens because the fire tv has a great quality connection to WiFi.", "verified": true, "helpfulness": "0/0", "author": "ThriftyNifty"}, {"rating": 5.0, "review": "thanks", "verified": true, "helpfulness": "0/0", "author": "richard mosedale"}, {"rating": 4.0, "review": "Here;s the deal.  The Fire TV is a pretty simple device to set up and operate.  The apps are simple to download, the remote scrolls through the options with no lag.  I have very few complaints after using this device for several weeks (as our primary entertainment source).1.  To put it to sleep, you must go through several screens of options or let it sit idle for 30 minutes; I'd like to see a shortcut, but I understand, its streamlined for ease of use.2.  I have 50-75MB/s internet.  Hulu, as many other users mentioned has a buffering issue.  I have found that the only consistent way of preventing non-stop buffering is to change the resolution from 1080 to 720.  This may be a deal breaker for some users out but it doesn't really bother me, looks great besides.That is as many complaints as I have... oh and =3. Comcast prevents me from putting HBOGo on my Fire TV.  That does anger me a bit.For the price, I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Lou Jersey"}, {"rating": 5.0, "review": "We love our Amazon Fire.  The easiest new tech gadget in the world.  We've watched a few movies but we are mostly excited about re-watching some of the super Masterpiece Theater shows that we never knew we could get on Fire!! Yay!", "verified": true, "helpfulness": "0/0", "author": "Sheila Voyles"}, {"rating": 5.0, "review": "its great", "verified": true, "helpfulness": "0/0", "author": "ronnie lewis"}, {"rating": 5.0, "review": "The system works as advertised. I don't watch a lot of regular TV (because I hate commercials), so this set up is perfect for me and less expensive then Cable TV. Plenty of movies and TV shows without the commercials, and the most important thing for me was free music to listen to. Was paying $104/mo for cable, and now just $34/mo for internet. Bought Prime Amazon membership for $99/yr, and one time purchase of Amazon Fire TV box with voice activated remote for sale price of $84. Has everything I personally need or wanted for a lot less! Due the math.........over $1200/yr for cable versus about $510/yr for Amazon Fire TV. Added bonus is that the picture actually looks better and the sound is better as well.", "verified": true, "helpfulness": "0/0", "author": "Steven J. Cain"}, {"rating": 3.0, "review": "Not very easy to hook up and operate!", "verified": true, "helpfulness": "0/4", "author": "Mike Claffy"}, {"rating": 5.0, "review": "I totally love Amazon Fire TV.  So easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Belinda Beurrier"}, {"rating": 2.0, "review": "Mine cuts in and out a lot, sometimes freezes the screen and forces me to change inputs or turn off the TV and turn it back on, the home button usually works as well. This makes it nearly unusable at times. There are stretches that are good, and stretches that it sounds like you are scratching a record. I like all the apps and whatnot but Amazon has something to fix here because it happens on every app.", "verified": true, "helpfulness": "0/1", "author": "Parker Y."}, {"rating": 5.0, "review": "I hate to review this product though comparison, but here it goes anyway.  Before the Fire TV, my girlfriend and I owned a Roku.  The Roku would drop my wireless signal occasionally and due to malfunctions and a registration debacle, we went without our internet TV for weeks.  The Fire TV, on the other hand, has been a blessing.  My signal comes through consistently, the service is excellent, apps are very cool (games could use some work, though), and the voice search feature is very high tech!  My only gripe would be the default one touch purchase setting (which can easily be changed, by the way).  Beside that, I love the sleek, compact style of the hardware, but would have appreciated a heads up that I would have had to purchase an HDMI cable.  Overall, we are very pleased!", "verified": true, "helpfulness": "0/0", "author": "Alfredo Trujillo"}]