[{"rating": 2.0, "review": "It works fine but the lack of apps makes it not as useful as I had hoped for.  More apps = better rating.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Streaming music or just a tab while surfing works great. Trying to stream HD video from a tab...nope. I have a 50mbps connection and Chomey kicks me out or will stall the video and keep the audio going.", "verified": true, "helpfulness": "0/0", "author": "Nicholas S Wilhelm"}, {"rating": 5.0, "review": "Very impressed with the google's new tool. Enables to control all the apps on my phone. Tv controlled by phone!! awesome!!", "verified": true, "helpfulness": "0/0", "author": "gowtham"}, {"rating": 2.0, "review": "I am back here right now to buy an Apple TV to replace this. For $29, it was worth a try.  Having tried for weeks to work with it, I am just annoyed.  It frequently loses the signal.  And, most important, if you think you are going to use the google chromecast extension to cast your chrome web pages from your mobile device to you TV, sorry, you are not going to, at least not yet.  There are no chromecast extension downloads available for mobile devices.  Since I wanted to use this with both an android phone and an iPad, I am thoroughly disappointed.  The only thing the google web site shows for these kinds of devices is a message on their web site saying \"Sorry your device is not supported just yet.\"  No mention of timeframe either, Not nice, google.", "verified": true, "helpfulness": "1/1", "author": "a serious reader"}, {"rating": 4.0, "review": "We don't have cable so this inexpensive addition has allowed us to enjoy films from both Netflix and Amazon Prime. I recommend Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Helen C. Santiago"}, {"rating": 3.0, "review": "Be aware that this device is truly compatible with a limited number of wireless routers. We have a very basic Netgear WDR3700v2 and it looses connectivity almost every day. The router has to be rebooted before it will work again. This is a huge subtraction from what is supposed to be a very easy to use device. Hopefully they expand this in the future.", "verified": false, "helpfulness": "0/0", "author": "Brandon&Jill;"}, {"rating": 4.0, "review": "We use this device almost everyday with our iPad Air and Netflix.  Seriously considering cutting the cord to Verizon Fios since I can get so much content that I want to watch as opposed to all the mind numbing channel Verizon forces me to purchase.  I'm sure that the sources of content will continue to improve as more providers integrate the Chromecast feature - the current list of content providers is somewhat limited at this point in time.  The setup of the Chromecast is not as easy as advertised.  Even though it works fine, I kept getting a network error message during set up that didn't make any sense.  I finally just ignored it...", "verified": true, "helpfulness": "0/0", "author": "J. Williams \"jwilliams\""}, {"rating": 3.0, "review": "Having a very hard time setting it up.  It isn't as advertised.  In fact, finding it is somewhat BETA.Very disappointed.  Not intuitive to use.", "verified": true, "helpfulness": "0/0", "author": "Nancy Kenney"}, {"rating": 5.0, "review": "Making your TV digital.It is easy to use, easy to install and whenever you want easy to connect.Great deal!", "verified": true, "helpfulness": "0/0", "author": "sezaikayaoglu"}, {"rating": 5.0, "review": "I expected a piece of junk BUT was glad to find different..  The Chromecast is easy to use, inexpensive and a great tool for recreation and business.  Who would have \"thunk it\"", "verified": true, "helpfulness": "0/0", "author": "kenneth turner"}]