[{"rating": 4.0, "review": "Would be nice if they would send a owners manual along with it.", "verified": true, "helpfulness": "0/1", "author": "Jim Weyers"}, {"rating": 5.0, "review": "I have one of each of the major brand streaming tv players. Really like this so far.", "verified": true, "helpfulness": "0/0", "author": "K.B."}, {"rating": 1.0, "review": "I have used this fire tv every day since I purchased it on April 2, 2014 and have enjoyed using out every minute until today. After the OS update to include the photos, prime music and the other features the box will not load content, my recent list and can't give me any movies because it can't reach servers. I have unplugged it and reset it over 12 times today. What good is an update if it ruins the great experience I was having with this product before? I guess I will dust off my Sony blu Ray player and resubscribe to Netflix. I have bought five tv sticks for my daughter's also for their prime accounts and now I feel like an idiot for giving them something that has gone downhill so badly. Amazon next time try beta testing a little longer before you ruin a great product. Huge fail!", "verified": true, "helpfulness": "1/3", "author": "J. Remish"}, {"rating": 5.0, "review": "So far so good - We are just getting used to not having cable, DISH or DirectTV in the house after 18 years. Going total free HDTV, Netflix, Vudu and this. So far our tv bill is only $30 and then of course internet is $55. Way better than $200 a month! We will see if we can keep going with it!", "verified": true, "helpfulness": "0/0", "author": "Beth Huffman"}, {"rating": 1.0, "review": "This could have been great, but for some reason Amazon decided to add a banner ad and preroll ads on some videos.  I suppose I could dump Amazon Prime and just use it for Netflix, but the Netflix app seems to be crippled and it only does SD.", "verified": true, "helpfulness": "2/5", "author": "Edikari"}, {"rating": 5.0, "review": "I love this device,  a lot more user friendly than my apple TV and better quality and no streaming lag!", "verified": true, "helpfulness": "0/0", "author": "Kelvin Andrews \"Kelvin D Andrews\""}, {"rating": 5.0, "review": "Excellent love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Just beginning to use it.  Still exploring all the potential it can provide.", "verified": true, "helpfulness": "0/0", "author": "Joseph Frattaroli"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "MILTON"}, {"rating": 4.0, "review": "Great Product just wish it handled all major streaming companiesVUDU in particular", "verified": true, "helpfulness": "0/0", "author": "James W."}]