[{"rating": 5.0, "review": "This is probably the coolest thing I have purchased in a long time! Took 10 min to set up and I have been using it everyday!", "verified": true, "helpfulness": "0/0", "author": "Fran Schiller"}, {"rating": 2.0, "review": "Cannot get the Netflix app to cast to it. In fact, the only thing that works is casting YouTube videos", "verified": true, "helpfulness": "0/0", "author": "Omer Morashti"}, {"rating": 2.0, "review": "I purchased this thinking it would eliminate having to plug my laptop into the TV via HDMI and would be much easier to use.  The audio is ok but if the picture has any motion at all it cannot handle it.  Video freezes while audio plays onWorks fine if you are viewing slow motion video only...", "verified": true, "helpfulness": "0/0", "author": "J. Dill"}, {"rating": 5.0, "review": "A little backstory:For about a year now i've been using the infamous D-Link Boxee Box that has since been discontinued and no longer supported (as far as I know), which is a media streaming device. The idea was to not have to use a Samsung Blu-ray player, or any blu-ray player for that matter, media software that is usually slow/sluggish and unreliable (poor connections, takes a long while to even bring up the application so on). This was supposed to streamline it a bit more and give me the ability to play Pandora and watch Netflix at my leisure.As time went on, \"The Box\" started having it's problems: No network connections randomly, applications and the device itself freezing, long load-times and constant interruptions. This is very troublesome as I had moved my Box to my garage gym, and as a result would interrupt my workout constantly where I wouldn't even use it at times.Then along came the ChromeCast.The setup (summed up in 1 phrase): A synch. You plug it into your HDMI port on the back of the TV, then plug the usb connector into the port on your tv, or it comes with an AC adapter that you can plugin to your outlet. It turns on automatically, loads and you follow a simple onscreen set of instructions.This is, now, my second ChromeCast (I received one as an x-mas present that I use in my living room). Both took less than 5 minutes to setup, including it updating itself to the latest version as soon as a wifi connection was established. I was then streaming netflix 30 seconds later using my LG Nexus 5 Android Device.The boxee would take at least 5 minutes just to turn on along then another 3-4 minutes before i could start streaming a netflix movie/tv show, and not reliably.You don't have to turn it off, it just turns on once you turn your TV on, so no waiting.I'd recommend this device for anyone looking for a simple and effective way to watch netflix, play google music, watch youtube and other misc things that it currently offers. This is the future of television. Google has done it again, and for a great, great price!", "verified": true, "helpfulness": "0/0", "author": "Teeib"}, {"rating": 5.0, "review": "Love streaming from nearly any device I have. Watching things on the go. I have bought one for my Mother, future father in law, and  myself. You can not go wrong with one of these. More and more apps are supporting it. I can't wait till their is support from Windows gaming so I can stream my games to my tv, or even from my Android devices. Roku/Apple TV Who?", "verified": true, "helpfulness": "0/0", "author": "L. Rost"}, {"rating": 5.0, "review": "I don't have a smart TV and Chromecast allows me to watch Netflix and YouTube on my TV and for $35 you can't beat the price.  I was thinking about purchasing a smart tv but don't really see the point now.", "verified": true, "helpfulness": "0/0", "author": "SizzleD"}, {"rating": 5.0, "review": "I have a lot of experience with roku devices and I actually like the chromecast so much better. It barely needs to buffer, the video quality is excellent and doesnt go in and out like most rokus. I was pleasantly surprised with this device especially for the price I paid. Don't get suckered into buying the HDMI cable with it, you don't need it.", "verified": true, "helpfulness": "0/0", "author": "Laura Garcia"}, {"rating": 5.0, "review": "But on a more serious note, the Chromecast has only gotten better since I got it with more apps than ever!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I bought this mainly to stream whatever is streaming through my chrome browser tabs (not netflix etc, for which i already have roku). I used to physically connect the computer via HDMI to TV to watch streaming, thought chromecast is a great convenience. But, unfortunately, the 'cast' is very very slow to the point of being useless (chrome browser tabs only, apps are ok).All in all, if you are buying this just to get netflix, youtube etc, go for it. For directly casting chrome browser tabs, pretty useless.(Also, not to mention the inconvenience of keeping the browser running on the computer, while casting).", "verified": true, "helpfulness": "0/1", "author": "boreal"}, {"rating": 5.0, "review": "Have not used it much yet but so far I am liking it. I plan to give NetFlix a try with in. I love the fact that I can project my Note 3 to the tv through it.", "verified": true, "helpfulness": "0/0", "author": "Larry Roberts \"Larry L Roberts\""}]