[{"rating": 5.0, "review": "We love our Amazon Fire TV so much that we purchased one for each TV in our house. They are speedy, responsive and include every feature we want. Compared to the competition, this product is far and away more superior.", "verified": true, "helpfulness": "0/1", "author": "TJM"}, {"rating": 4.0, "review": "Great product! We were able to cut out cable which was a great feeling. Since it's based on android you can side load apps that will let you watch pretty much anything you want for free. The only issue is I sometimes have to power cycle it to get the apps (Netflix) to work after I use the side loaded app.", "verified": true, "helpfulness": "0/1", "author": "David"}, {"rating": 4.0, "review": "So far, we have had the Amazon Fire TV for 7 months, and it is pretty awesome, although there are only two issues I have with it. First...I want to download movies TO the unit so I can watch things offline when I don't have internet, like my Kindle Fire, but unfortunately this doesn't seem to be an option OR this fairly tech-savvy gal can't figure it out easily. If I can't figure it out easily, then I can only imagine how hard it is for others!Secondly, it is fairly difficult to find just the free Prime movies, without going down the \"rabbit hole\" of other movies...it does seem to be misleading in some cases where you think it is a \"free to Prime Members\" movie, but you get into it, and there is a fee. :(  A little difficult of an interface to figure out sometimes...", "verified": true, "helpfulness": "0/1", "author": "Map Girl"}, {"rating": 1.0, "review": "Often does not work properly and whenever I contact help, the problems are never resolved. Big waste of money.", "verified": true, "helpfulness": "1/6", "author": "Heisenberg"}, {"rating": 1.0, "review": "YouTube video has jitters", "verified": true, "helpfulness": "1/5", "author": "V N"}, {"rating": 5.0, "review": "I had the best experience with this Fire TV Box.  Love how you speak into the remote and instantly you get what you asked for.  Very impressed and glad I made the purchase.", "verified": true, "helpfulness": "0/1", "author": "Connie G. Ruiz"}, {"rating": 5.0, "review": "Bought as a gift and they love it!", "verified": true, "helpfulness": "0/1", "author": "Crystal Clear"}, {"rating": 4.0, "review": "I like it, Im new to the streaming TV it works real well!", "verified": true, "helpfulness": "0/1", "author": "Bobbyc"}, {"rating": 5.0, "review": "This just arrived about an hour ago. I had this in my cart for a few days along with a few other things in hopes of saving some money on Prime Day, but like everyone else, I was let down with that day in general. New marketing strategies need to be implemented in the future.That said, when my Fire TV arrived, I hooked it right up with no problems. I had been having problems with streaming with my Sony player for some reason. It would freeze up if I had my ipad and Amazon Echo plugged in, so I always had to go through the motions of turning everything but the Sony player off in order to enjoy uninterrupted viewing. Pain in the butt, especially if I want to ask my Echo a question while I'm watching a show. First world problems, I know!Well, as I'm typing this on my computer, with my ipad still on, and Echo playing music in one room, I've got FireTV playing a movie in the family room! And it was so easy to set up.I would also like to take this time to say that I'm really impressed with the packaging of Amazon products (Echo and FireTV). They're classy and attractive. Just ordered a Fire Stick for vacation in a few weeks. I had hoped to get it from PRIME DAY, but again....", "verified": true, "helpfulness": "0/1", "author": "P.J. Pootentooter's \"P.J.\""}, {"rating": 4.0, "review": "Good picture quality.  Streaming speed is adequate.  I've only had 3 instances where the buffering has slowed the program down to the point where it was pointless to continue watching.  Also, I've found that resetting the device once a week helps keep things \"fresh\".  It's a good alternative to cable if you don't mind giving up certain aspects.  The wife likes to watch Bravo but there is no Bravo to be found.  I lose local Fox Sports broadcasts (Fox Sports Ohio and Fox Sports Detroit) and get various Fox Sports networks that may or may not be of interest to me...mostly not.  Still, if I could get past the need for Bravo, my cable would be gone.", "verified": true, "helpfulness": "0/1", "author": "El Kabong"}]