[{"rating": 4.0, "review": "The Google Chromecast is a decent piece of equipment  and does what it says it does.  so not major complaints except one. It states Hulu Plus is supported, what it doesn't tell you is that Hulu Plus \"mobile\" app is only supported.  What this means is that if you do not have a mobile device or tablet you have to use Google Chrome web browser and use there cast browser tab feature which is slightly lagged at best.  to me this is only a slight issue but when i try to do anything else on the computer the steam to the cast gets very choppy and often times stops all together.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Timberlake"}, {"rating": 5.0, "review": "First let me say this. This will not work with sound if you use it with a hdmi to dvi adapter. That said this is a great product and on my newer tv it works fine.", "verified": true, "helpfulness": "0/0", "author": "Michael D'ambrosio"}, {"rating": 5.0, "review": "We don't have cable or satellite tv.  We stream all tv shows off the internet using a laptop.  However, whenever my kids need to use the laptop, I just go on my android phone, turn on Netflix and watch it from my big screen tv using this device.  This device won't stream from just any website.  It has to be an actual program like Hulu or Netflix.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 4.0, "review": "I bought this on a whim, since I just purchased a new TV. I didn't think I really needed it, since I have an extra computer I can use as a home media center as well as multiple game consoles that can stream most of the content I watch, but figured I've spent $30 on worse things. I'm glad I made the impulse buy, and would recommend this to anyone looking to get good content through the internet instead of paying outrageous cable/satellite TV costs.What I like: Effortless set-up. As plug-and-play as I can reasonably expect it to be. Also, pretty seamless integration with the Google Chrome Cast extension, as well as a set of android phone applications.This is my new go-to for streaming Netflix content to my television.What I don't like: Some content streams very poorly when cast from the Chrome web browser. I'm not sure if it's my router or the Chromecast yet, but I think it would be better if Chromecast degraded the quality of the video streamed through Chrome instead of the awkward stuttering it currently does. A minor nitpick, I wish it came with a second, shorter cable for plugging into a television's USB port instead of a wall outlet.", "verified": true, "helpfulness": "0/0", "author": "John Bay"}, {"rating": 4.0, "review": "I had been sending  my computer screen to the TV via cables and found locating the computer close enough to the TV very annoying so when this device came out, I thought it would be a good experiment to try.  It has been life changing; I use it all the time and recommend it to my family and friends. My one reservation is that there is no App for the Kindle Fire and YouTube cooperation.", "verified": true, "helpfulness": "0/0", "author": "Betty Lawhite"}, {"rating": 5.0, "review": "I just bought this device and definitively is a great option for those who don't have a smart TV o game console to access Netflix, Youtube, etc. It is easy to install and the configuration is user friendly; a very clear HD image is streamed to your TV.I recommend this gagdet with no doubt!", "verified": true, "helpfulness": "0/0", "author": "Carlos R."}, {"rating": 1.0, "review": "I expected something different. his design is wonderfull , but this book was only about trees!!!Do what you do best design houses", "verified": true, "helpfulness": "1/6", "author": "gisela c Henriquez"}, {"rating": 1.0, "review": "if you are buying this to cast netflix dont please dont waste the money..IT DOES NOT WORK...do a google on netflix/chromecast issues before you throw away your moneyworks on youtube etc..but not on netflix..and i have the latest build, latest version blah blah blah and i have rebooted everything 50 timesit does not work..end ofi have an apple tv ..they now work well ..at last", "verified": true, "helpfulness": "1/1", "author": "denc"}, {"rating": 1.0, "review": "When it works it's a nice streaming device - basically a cheaper option than other wireless HDMI connectors.The problem is chromecasts are notorious for working 1 day and then a couple days later it won't work without rebooting your router.  Google is supposedly aware and working on the problem....My experience so far has been:1.  Got it and plugged it in to run the setup procedure.  Laptop initially didn't find the device but after trying multiple times it finally did magically find the device.  Proceeded to run setup procedure but it always failed saying it couldn't connect with the chromecast even though it did find it and even though I was about 2 feet from the device.  Only way I could get the setup procedure to complete was to do it through my Nexus phone.2.  Immediately after setup finished using my phone, I could then use my laptop to cast stuff.  Worked great that night.3.  Two days later I tried to cast something with no success.  Device not found.  Same error on both my laptop and my Nexus phone.  Rebooted router, problem magically fixed.4.  Repeat 3 ad nauseam.  Basically the device works when it wants to and very VERY rarely works more than 1 day in a row without some inconvenient manual steps.", "verified": true, "helpfulness": "2/2", "author": "Casey Coenen"}, {"rating": 5.0, "review": "Great for watching YouTube and other online content on your big screen TV. Very easy to install and use, just select content from smartphone and play.", "verified": true, "helpfulness": "0/0", "author": "Johan Gustavsson"}]