[{"rating": 3.0, "review": "It's a good product with inmense potential but very limited.  It would be a killer iff you could use it to mirror your computer (mac or PC) to projectors or TV, also very good if it had a RC.", "verified": true, "helpfulness": "0/0", "author": "R. Izquierdo \"juron\""}, {"rating": 3.0, "review": "It works OK if you have multiple devices to cast to your TV, but if you only have one device, you will get a better experience with an HDMI cord.  There is a 3 second lag time between the device and what appears on the TV.  Good start, but improvements are needed.", "verified": true, "helpfulness": "0/0", "author": "Bernard R. Bossert Jr. \"BJ\""}, {"rating": 5.0, "review": "I love this device, I highly recommend it especially if you have other android devices like phone since it ties in very well with that ecosystem (as it should). At first it didn't have a whole lot of apps but it has been steadily growing and for the price it offers quite a bit!", "verified": true, "helpfulness": "0/0", "author": "C. Sympson \"Soopaman2004\""}, {"rating": 5.0, "review": "I use this to cast video from my laptop to my tv screen. It works pretty well. I like it.Thanks,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Mark\""}, {"rating": 5.0, "review": "Great product, deal and arrived on time.", "verified": true, "helpfulness": "0/0", "author": "Bnidas"}, {"rating": 2.0, "review": "This product is a source of extreme pleasure and extreme frustration (usually in the same day)...it is one of the most Bi-polar products I have ever used. We bought this device because my early generation LCD is not a smart TV and we wanted to stream Netflix and YouTube to that television. The TV only has DirecTV cable going to it and it is mounted above the fireplace with no room to add a web enabled DVD.Physically the product is extremely well made, it is elegant looking and small. It is inexpensive without any subscription cost. And when it works, it delivers what we had hoped when we bought it. The problem is this device chooses to not work on a completely random schedule hopelessly frustrating us and our three year old who wants to watch Leap Frog on Netflix.For some unknown reason the device will either connect to your device or it will not. Sometimes it will work flawlessly for days, and then sometimes it will connect only after 20 minutes of trying. We are not sure what gets it come back but we do the following to try:+Reset ipad, computer, iphone, etc...+Reset Chromecast+Unhook power to Chromecast+Reset wifi Network+Send kid outside to play and hope he forgets about showI have read dozens of blog postings on this product on Google's sites and other independent sites. It is a common occurrence and I try every remedy that is recommended.  What it boils down to is that you may get a device that works with your system flawlessly or you might get my version, the Sybil of streaming devices.", "verified": true, "helpfulness": "2/3", "author": "Chimp Daddy"}, {"rating": 4.0, "review": "Don't get me wrong, for the price this thing IS great but it doesn't work as seamlessly as my apple or fire tvs.  My house isn't large and I have a solid wifi signal strength through out the house but this thing still gets caught up when I'm streaming from Plex.  I always get it working eventually but it's a bit annoying at times.  Especially when I'm trying to show it off to my friends.", "verified": true, "helpfulness": "0/0", "author": "Shenaniganizer \"msmyka\""}, {"rating": 2.0, "review": "Well as much as the price is fanttastic it does take a slot so i do need it still to be worth the effort and I had a couple disappointments: 1. I thought you could play downloaded media files, but it only seems to like streamed media. 2. I am in Canada and thought I could use hulu-unblocker to access US Netflix through my laptop and then broadcast to chrimcast but chrimcast initiates it's own direct like which breaks if going out of region.", "verified": true, "helpfulness": "0/1", "author": "Colin Magor"}, {"rating": 5.0, "review": "Oh joy!  MLB.tv is now supported by Chromecast, so as an expatriated SF Giants fan, I am able to watch my beloved team here in Portland, with the bonus of not having to watch commercials  (goes to \"Commercial Break in Progress\" screen, time to go do stuff).  I only wish Amazon Prime was available on Chromecast too.", "verified": true, "helpfulness": "0/0", "author": "Barbara Bell"}, {"rating": 5.0, "review": "06-13-14. It's just over two months since my first Chromecast.  And now, and I have three. The Google Chromecast is three times a winner. Like many of us, I was paying way too much for my TWC cable. With the Chromecast, I've cut my cable bill (big savings) by casting instead, to my three Samsung 1080p HDMI televisions. Casting programs that we enjoy, instead of what's on cable. There are far fewer commercials when casting free internet media. Unlike cable, you are in control. Switch, pause, stop, replay, jump forward. . . commands that  you can't do with cable. Realizing that apps are limited at the moment, there's enough available to keep you busy and entertained. Surely, more and more apps will come in the very near future. If new to casting, it may be a little difficult. Like anything, there is a learning curve. But with practice, and repetition, curiosity, and research, it becomes easier. Chromecast works with my PC, laptop, and Asus tablets. Personally, IMHO, it's better than a Smart TV.", "verified": true, "helpfulness": "1/1", "author": "sunset-hi-96789"}]