[{"rating": 4.0, "review": "Hope for more content. Picture quality is great.", "verified": true, "helpfulness": "0/0", "author": "Glen Eden"}, {"rating": 5.0, "review": "Excellent That's All I Can Say...", "verified": true, "helpfulness": "0/0", "author": "Michelle Calloway"}, {"rating": 4.0, "review": "Enjoying our new fire tv. Would be 5 stars except  we didn't realize how much subscription based and pay per view there would be. Otherwise Excellent", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 5.0, "review": "Much more than I expected. Will probably cancel my satellite  TV now.", "verified": true, "helpfulness": "0/0", "author": "grumpy"}, {"rating": 5.0, "review": "Amazing item. The voice search is a little quirky, but it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Lou A"}, {"rating": 4.0, "review": "The Amazon Fire was very easy to install, and I think it's pretty simple to understand.  I DO like the voice command feature on the remote. I'm not sure about he logistics of all that, but I wish it were possible for there to be a volume control on the remote.  I hate having to switch back and forth between two remotes.  I think Amazon should also make more movies available free.  You think when you buy Amazon you are getting an advantage, but really there isn't much advantage unless you subscribe to Prime...which is not a bad deal, but the quality of free movies is not great.  They offer a number of free games, but like others have mentioned, you really do need to purchase the Amazon game controller.  Something I plan to do in the future...it's worth it.", "verified": true, "helpfulness": "0/0", "author": "Shari Kousgaard"}, {"rating": 5.0, "review": "The Fire Tv I received as a gift is working really well, the voice command is real easy and saves a lot of time when searching. I like that the remote works in the room without direct line of sight with the box. The first unit I received was not working, but Amazon customer service was very helpful and got me a replacement right away. It never lags and now I am a streaming junkie!", "verified": true, "helpfulness": "0/0", "author": "Mario DelMoral"}, {"rating": 5.0, "review": "Very glad I got the gadget.  Not only the system bu the shopping is great. Lots of good deal on men's jewelry and items", "verified": true, "helpfulness": "0/0", "author": "lorenzo laguio"}, {"rating": 4.0, "review": "I do like the Amazon Fire TV. I haven't regretted my purchase. However I am disappointed that the game controller is unavailable and can't get any information on when it will be available. Or if it has been discontinued.", "verified": true, "helpfulness": "0/0", "author": "David Kelly"}, {"rating": 5.0, "review": "I like it, it has a wealth of apps and options, is easy to set up, and you can side-load Android Apps from any Mac or Windows box relatively easily.  I have loaded Kodi (previously XBMC) on it to use along with the built-in applications.  The unit is small and puts out a nice picture.  I have been using it with a wired connection, but wireless works well also as I tested it when I got the unit.  One item that might be an issue for some, the remote is not an IR remote, so if you have a single remote to control your multimedia system, it won't work with the Fire TV if it is an IR only remote.  My Harmony One remote falls into this category.  I didn;t ding the unit as it wasn't important to me, but it may be to others.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"winterg\""}]