[{"rating": 5.0, "review": "I really enjoy firetv it deserves 5 stars", "verified": true, "helpfulness": "0/1", "author": "Gabriel Romero"}, {"rating": 1.0, "review": "What happened to the free year of amazon prime membership?  I just looked at this last night and decided to buy it when I got home from work today I get home from work and I see it's dropped in price and can't find where it says the amazon prime membership anymore I'm totally confused", "verified": false, "helpfulness": "0/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it and easy to use", "verified": true, "helpfulness": "0/1", "author": "Deborah B."}, {"rating": 5.0, "review": "This is a wonderful gadget.  I did not purchase it from Amazon; I bought it locally in case I needed to return it.  But it works fantastically well.  Our blu-ray player is supposed to stream from Netflix, but it doesn't work well in our relative \"dead zone\" of a den.  The Amazon Fire works perfectly, both from Amazon's website and from Netflix (the only two sites I have tried so far).  This product is more powerful than the Fire stick, which works beautifully where there is a strong internet connection, but less consistently for our set-up.  This is definitely worth the cost, and is easy to set up and use.  I think this is my first Amazon review; I like the Fire TV so much I wanted to post.", "verified": false, "helpfulness": "0/0", "author": "Reader in Bloomington"}, {"rating": 1.0, "review": "The first unit I got died (no power) after 1 day.  The second unit I got had a loose remote battery cover, and had error messages regarding the HDMI cable (the same HDMI cable that I had been using for my Xbox without any issues).  The only reason why I am ordering a third unit is because I have bought so much Amazon Instant Video content, and I would think that the Amazon Fire TV works best for Amazon's own video content.  Amazon Customer Service has been mostly great, but I am my third call with them in a week, and having to constantly talk with even the best customer service people gets tired after a while.Update: So, I return the 2 previous defective units.  I order a 3rd.  Guess what?  Out of stock.  I am told it will be delivered in a week -- maybe.  I contact amazon customer service.  I am told I am \"lucky\" because others will have to wait longer.  I don't fee so lucky, Amazon.  1 star for you.", "verified": true, "helpfulness": "0/1", "author": "Semipro"}, {"rating": 5.0, "review": "This thing is great. downloads fast. Love the voice search", "verified": true, "helpfulness": "0/0", "author": "Troy"}, {"rating": 1.0, "review": "buy if a technologically challenged. you get the same stuff from any device.", "verified": true, "helpfulness": "0/9", "author": "K. Suleman"}, {"rating": 4.0, "review": "We like it but really haven't had a chance to view many programs yet.", "verified": true, "helpfulness": "0/1", "author": "Phyllis"}, {"rating": 5.0, "review": "Small foot print, elegant design, and easy to set up.  I already had a Fire Stick, and this was just an upgrade to the full-size sedan.  There is SOOO much content.  I would recommend this product a thousand times over.  I was a little hesitant at first to invest too much into the Amazon ecosystem.  But quite frankly, it just makes sense.  If you have a Prime membership, you aren't getting your money's worth until you get some type of Fire entertainment system.  I am long time Android user (since the G1), and I am this close to getting a Fire tablet to complete the circle.  Be like Nike, and Just Do It.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"digital_tailor\""}, {"rating": 5.0, "review": "Used the product for", "verified": true, "helpfulness": "0/1", "author": "Brian"}]