[{"rating": 5.0, "review": "Great item since I don't own a smart Blu Ray player or Xbox to access Netflix and other programs. I can stream any website from my Chrome browser straight to my TV.", "verified": true, "helpfulness": "0/0", "author": "MrT"}, {"rating": 5.0, "review": "Product of the year. I was skeptical when my husband bought a few but am now a believer. We use it to watch Netflix and HBO Go on our television using an old android tablet as remote control! Hope more apps will be able to stream to Chromecast soon!", "verified": true, "helpfulness": "0/0", "author": "Beddileinsche"}, {"rating": 5.0, "review": "I'm so glad Google came out with this item, and look forward to having them add new services.  Even though I gave this the highest rating, I do wish I was able to operate it from my computer as well as my smartphone.  It will not work on an OS lower than Windows7, which I don't have installed. I would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Ann Sullivan"}, {"rating": 3.0, "review": "its cheap, but for $30 more you get a roku, will get better as they add more apps, but with only nextflix and youtube, there is not much you can do, cant even screen cast a tab from chrome on ios,", "verified": true, "helpfulness": "0/0", "author": "stephen kirkham"}, {"rating": 2.0, "review": "I loved the idea of using my phone to watch netflix or other apps... I guess I didn't read the description (I don't think they have it anywhere, they assume you know it) but you have to have WIFI at home. It will not work without wifi at home. I live out where we don't have a landline phone, thus, we don't have WiFi.  We use our cellphones for internet and calls.  I was excited with Chromecast, but once I had everything up and running it kept asking me for a WIFI signal.... so I returned it. So if you get one MAKE SURE you have Wireless Internet at home.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "Don't use it on your institutional computer; the firewall will block it.  Otherwise it's a nifty little device.  Recommend as a must have!", "verified": true, "helpfulness": "0/0", "author": "Joe Adams \"winstonthewolf\""}, {"rating": 5.0, "review": "I am usually very \"technology challenged\" - but I had the chromecast out of the box and working in under 15 minutes - so proud of myself, and it works great!  It is wonderful to be able to watch Netflix on the big screen instead on just on the iPad.  Great investment for the cost.", "verified": true, "helpfulness": "0/0", "author": "V. Swanson \"V. Swanson\""}, {"rating": 1.0, "review": "cons: very lagging, totally unsuitable to cast a video contentpro: easy to setup and configuresummary: feels like a toy and not a real product", "verified": true, "helpfulness": "1/1", "author": "dimus"}, {"rating": 4.0, "review": "Works for internet broadcasting. Would also be nice to be able to broadcast personal files to it also. Will only work for Google chrome pages", "verified": true, "helpfulness": "0/0", "author": "Rodney Ochesky"}, {"rating": 4.0, "review": "I like how my laptop and phone can put my netflix on my nonsmart TV. It doesn't make my phone hot or use too much battery it is convienient to pause and so farI am satisfied with its abilities!", "verified": true, "helpfulness": "0/0", "author": "Sharae Davis"}]