[{"rating": 1.0, "review": "Disappointing ¡!!!!!!!!!!!!! Works with very little.  Yes I streamed that stupid interview movie from YouTube.  Thought that was cool next tried streaming amazon prime instant movies,  nothing but problems,  my computer laptop screen showed on TV but the area in middle of computer where amazon movie was playing would not sure up,  so tried my cell phone,  keep getting messages from Amazon about some stupid amazon app that I needed to download to stream movies from,  after lots of warning messages got it downloaded, guess what still did not work,  so 4 hours later got it to stream using a beta feature of an app on my cell labeled  chromecast.  Acted like a beta feature to do basically what miracast does,  which is what I should have bought instead,  finally got cell screen to show on TV,  movie streaming was choppy,  I was not impressed.  Food was cold wife was pissedMaybe one of amazons fire stick work betterNot sure", "verified": true, "helpfulness": "0/0", "author": "Ann A Watkins"}, {"rating": 4.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "carrin moore"}, {"rating": 4.0, "review": "This didn't work on an Olevia 232 we have in the house and that was very disappointing to me. All I've kept hearing is that if your TV has an hdmi port then Chromecast is for you. That's just not true.Setup on my other television was a breeze. I've watched a few shows and videos and it's a great gadget to have.", "verified": true, "helpfulness": "0/0", "author": "yoursmineoursfam"}, {"rating": 5.0, "review": "Easy to install. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "WMCMKM"}, {"rating": 5.0, "review": "EVERYONE SHOULD GET ONE! I use it so often now. Its made my life that much sweeter.", "verified": true, "helpfulness": "0/0", "author": "DM Suja"}, {"rating": 5.0, "review": "Received on time, nice media player", "verified": true, "helpfulness": "0/0", "author": "Pablo"}, {"rating": 1.0, "review": "I can't use this at all. I followed all directions.", "verified": true, "helpfulness": "0/0", "author": "JUDY C ANDERSON"}, {"rating": 5.0, "review": "Awesome product! Love that I can watch my kdrama.", "verified": true, "helpfulness": "0/0", "author": "Ivy Vance"}, {"rating": 5.0, "review": "Excellent device. Easy to install. Easy to use", "verified": true, "helpfulness": "0/0", "author": "David Toney"}, {"rating": 5.0, "review": "What Can I say, this is Essential to anyone with s smartphone especially if your an \"Android\" user. With the ability to broadcast any video from your phone or Youtube, Netflix, Hulu, and much much more, Its just convenient when you want to share Content when people are over or if you want to use it as a big screen for your games (Using the Screen Cast On Android) either way it is awesome and not too bad on the wallet.", "verified": true, "helpfulness": "0/0", "author": "pharoahogc"}]