[{"rating": 5.0, "review": "Compared to the others and edge goes to Amazon! Easy to install. Love the remote. We have eliminated cable and have saved a bundle. Fire TV provides access to Netflix, Hulu which is what we have been using. Prime user so love the access to all the available movies, television series, etc. Loving it!", "verified": true, "helpfulness": "2/2", "author": "App E Tizer"}, {"rating": 5.0, "review": "Excellent features, wonderful wifi range.  Very satisfied.  I also own Roku and Fire TV is better, and I did not expect that.", "verified": true, "helpfulness": "2/2", "author": "echoromeoindia"}, {"rating": 5.0, "review": "Works great so far. Very easy to use with many apps and features.", "verified": true, "helpfulness": "2/2", "author": "Stanley Cook"}, {"rating": 4.0, "review": "Bought this for my son for Christmas. He loves it, especially the games. Great tv/ movies apps for kids.I gave it 4 stars, because Amazon needs to improve the game selection and include multiplayer gaming with two controllers simultaneously (i.e. Split screen for racing games, and full screen simultaneous play for sports games similar to gaming consoles).  Everything else seems to be pretty comparable with other set top boxes. I highly recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Shannon M. Lightfoot"}, {"rating": 5.0, "review": "We bought it for our mother for Christmas and she had no problems using it.", "verified": true, "helpfulness": "1/1", "author": "D B \"Wife, Mother, Bookworm, Dreamer, Business Owner and so much more.\""}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "1/1", "author": "Jason Barkes"}, {"rating": 4.0, "review": "I have Prime and really like it. We wanted to watch a movie from the 80's and DirecTV wanted $4.99 for it. Was free with Fire.  Easy to set up and operate. Haven't figured out all the features yet. My only complaint is that my TV only has one HDMI input so I have to swap the cable.  Not necessarily a Fire issue.", "verified": true, "helpfulness": "2/2", "author": "T C"}, {"rating": 5.0, "review": "good stuff, easy to install, works very so far (6 days !)", "verified": true, "helpfulness": "1/1", "author": "Lyse A. Middleton"}, {"rating": 4.0, "review": "Great product!  Remote is touchy, though. Too sensitive to the touch", "verified": true, "helpfulness": "0/1", "author": "Kim D. Roberson"}, {"rating": 5.0, "review": "Loving it so far! Does so many things my old Roku (version1) didn't. I love how quickly videos load, almost feels instant in some cases. I have a buddy who has an Apple TV, and frankly, he's now jealous of the Fire TV.", "verified": true, "helpfulness": "2/2", "author": "Adam Levi Taylor"}]