[{"rating": 5.0, "review": "great  works very  well", "verified": true, "helpfulness": "0/0", "author": "P. luedtke \"golfer\""}, {"rating": 4.0, "review": "Super for casting the Chrome browser contents to the TV. Like I said in another review of the Fire TV Stick,  I have the Fire TV Stick, Roku 3, Chromecast and smart TVs. Each works well for what they are designed. Just wish it was a universal device for any app or stream and that I could cast anything from my computers to the TV.", "verified": true, "helpfulness": "0/0", "author": "MCOHRS \"MCOHRS\""}, {"rating": 1.0, "review": "My chromecast is showing \"reconnect me: ChromecastXXXX connected to, but can't access the internet\". After resetting the chromecast and my router multiple times I finally called Google for help. They said nothing I had not already tried and eventually just hung up on me. Since they had emailed me something before that I wrote the person back to say to call me on my phone but got no response.  I have another chromecast that has worked with out any issues, but clearly Google cannot solve problems with hardware when something goes wrong.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "We cut the cord with Directv and use this little gadget like crazy.  I recommend the Chromecast to people all the time now.  I even stood in Wal-Mart and convinced a lady to buy one!  Since CBS shows aren't available on Hulu, I use the Chromecast to cast my CBS shows from my desktop computer to the TV.  It work wonderfully!", "verified": true, "helpfulness": "0/0", "author": "PhyllisJ"}, {"rating": 5.0, "review": "its great i'm watching a show on it now :)", "verified": true, "helpfulness": "0/0", "author": "Gabby Boscolo"}, {"rating": 4.0, "review": "Received in time and working well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very convenient, I highly reccomend it", "verified": true, "helpfulness": "0/0", "author": "Kaleb Lynch"}, {"rating": 5.0, "review": "Nice product. Fast shipping", "verified": true, "helpfulness": "0/0", "author": "Dluis Lzm"}, {"rating": 5.0, "review": "Very useful device. No need for an expensive smart TV.", "verified": true, "helpfulness": "0/0", "author": "Calvin Ramnath"}, {"rating": 4.0, "review": "It was fine", "verified": true, "helpfulness": "0/0", "author": "RCAASI"}]