[{"rating": 5.0, "review": "Why not try it out for a $35 price range?! Great quality hardly ever any buffering. Nice and easy to control from phone compared to Xbox controllers and etc. I prefer it to my New Xbox now since it has better quality and nice to search for something without backing out of what  you're doing.So small and easy to transport.A lot of random apps but Netflix, Hulu and YouTube are just what I wanted. Only con is it's not supported with Amazon yet.. once that happens it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "Amb"}, {"rating": 4.0, "review": "It's dead simple to use. This is my 3rd Chromecast. For those using Netflix, Plex, Google Play Movie and YouTube this might be the best, cheapest and simplest streaming device. It does require good WiFi coverage as it's antennas is built in. Just waiting for more apps to support it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Chromecast and use it several nights a week.  Primarily use it for Netflix streaming in my living room but have also used it with friends to show each other Youtube videos.  Being able to queue up Youtube videos from multiple people is great.  Have used to to share webpages from my laptop a few times as well without issue.  Can't wait to see what else comes to this device now that the SDK has been released.Makes a great gift for anyone.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 1.0, "review": "Hard to setup and I work as a computer tech. Very simplein this case means no features. All it can do is stream webpages from a computer/tablet/smart phone to the TV. So basic I need to puke. Get any of the Rokus you will be better off.", "verified": true, "helpfulness": "0/0", "author": "Ken Searles"}, {"rating": 1.0, "review": "Only You-tube works well....No video worked for me if played from browser..... I regretted that I bought it. It need some serious technology enhancement.....", "verified": true, "helpfulness": "0/0", "author": "Amit Kumar"}, {"rating": 4.0, "review": "This is one of the greatest products Google has rolled out. There is no longer any need to connect my laptop to the TV through an HDMI cable. And no need to sacrifice quality either! I am a college student and purchased the Chromecast for my apartment as an affordable alternative to cable. With the Chromecast, I am able to stream my favorite TV shows from Hulu, Netflix, or any other website, onto my TV without even moving from the couch. Its just like watching live TV or DVR/On-Demand without paying the high monthly bill for it!The best part is, all videos are compatible with the Chromecast. Meaning, even if what you want to watch is not on a popular site such as Hulu, Netflix, YouTube, or Amazon Prime, Chromecast will still support it. Moreover, I can even minimize the window the video is playing on or switch to a different tab without affecting the video.In addition, Google could not make the Chromecast installation any more straightforward. Simply plug it into your TV, follow one or two prompts to connect to the Wi-Fi, install the Chromecast extension on your computer browser, and you're all set!The reason I gave it 4 stars instead of 5 is because, sometimes, the connection isn't as smooth as I would like. However, this happens very little and is largely dependent on your wireless internet speed and strength.Can't go wrong for the price!", "verified": true, "helpfulness": "0/0", "author": "Abdullah"}, {"rating": 5.0, "review": "Works well with netflix, but is not able to project from the web. This is disappointing, but we are enjoying being able to use netflix for our grandchildren as they enjoy many of the wonderful shows available.", "verified": true, "helpfulness": "0/0", "author": "Kathleen D. Nerz \"Registered nurse\""}, {"rating": 2.0, "review": "Despite Google's product descriptions that imply the Chrome displays all these things, it does not display your phone's screen - which is the very reason why I bought it. So, i've returned the Chrome and gone back to a hard cable connection between my phone and whatever HDMI TV/monitor is available.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I'd rather spend a little more and get a 2nd Roku, which is what I did after I returned this item. The interface is clunky, and it's just not that exciting to push stuff from my Chrome browser to my tv. Even when playing media IN Chrome and pushing it to the tv, the quality wasn't very good.Lifehacker sums up my experience best:Perhaps the biggest disadvantage of the Chromecast is that it came out in 2013, years after devices like the Apple TV and the Roku were already in living rooms. For those that haven't bought one already, many Blu-Ray players and TVs also have many of these same functions built in. $35 may be a pittance to pay for what the Chromecast can do, but if you already have the ability to do so, the money isn't very well spent.", "verified": true, "helpfulness": "0/0", "author": "Design Grrl \"Design Grrl\""}, {"rating": 1.0, "review": "There was no use for this unless you simply want to watch YouTube on your TV. This is a waste of money!", "verified": true, "helpfulness": "0/0", "author": "Sean Connor"}]