[{"rating": 5.0, "review": "We can now see shows in parts of the house where we don't have DVD or other device.  The three free months of Netflix (even if you are an existing customer) is more than the $35 price of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "m gerdelman"}, {"rating": 1.0, "review": "I've only had it stream one movie successfully out of about 100 tries.  It gets to 25% on the pre movie loading screen then sits there till it errors out.  Error AIP-701.The chromecast updated its firmware so it is running the latest updates.  Youtube isn't much better.  What was supposed to be an entertaining device has amounted to nothing but frustration.  Backordered for months, it finally shows up and doesn't work at all.  Buyer beware.\"We're having trouble playing this title right now.  Please try again later or select a different title.\" AIP-701 is all I've managed to view 99% of the time.", "verified": true, "helpfulness": "121/158", "author": "mls"}, {"rating": 1.0, "review": "mine didn't work right out of the box.  i tried setting it up several times and no go.  called google - the rep there told me that it was 'hit or miss' whether it would work with a mac which struck me as odd since it said on the box that it would.  he said until they come out with an actual mac app that it worked on some and not on others.  that seemed very odd to me but that's what he said.  rather than wait for an app to come out, i returned it immediately.  maybe mine was just defective?  i'll try it again later.", "verified": false, "helpfulness": "6/9", "author": "joshua e."}, {"rating": 5.0, "review": "I installed one of these on our wall mounted LCD TV in the office. People in my office use Macs, Windows and even Linux. We were really surprised how everyone could cast their browser to the TV without having to buy any special hardware. And how simple it was regardless of what OS they were using.  Of course you have to have the Chrome browser installed.And the low price was the best part.", "verified": true, "helpfulness": "0/0", "author": "Garrett B Neuenkirchen"}, {"rating": 5.0, "review": "I ordered this a few days after it was announced.  Due to short supply, I just received it today.  It did take a bit of time to look online to get it working with my router.  Once it was set up, it worked like a charm.  I have read reviews of poor visual quality, dropped syncs, and stuttering video.  I have experienced NONE of those issues.  It plays smoothly, and every android decice in my home connects flawlessly.  It puts the power of real choice back into my TV watching.  When they are easier to fet, I will frab another one for our other set.  Kudos to Goofle!!", "verified": true, "helpfulness": "1/1", "author": "J"}, {"rating": 5.0, "review": "I love it! Simple to set up ... it sets itself up really. You should download chrome browser. I use safari on a mac but that isn't supported. I just use chrome for the chromcast dongle, not for anything else. Anyway, it gives you the option of netflix or youtube, or google play. There are more options promised. What I like about it is that it 'casts' your movie or video, or whatever to the device via the cloud so you're not dependent on the device your casting from ... like your laptop. When it's finished casting which is like 20 seconds for a whole movie you can shut off your laptop and watch the movie. Whenever I set up my laptop to the tv with cables in the past I had to keep my laptop on and open and would get quite hot after a 2 hour movie. With the chrome cast - no wires. I can't use it with my iPhone, ipad yet. They are working on apps for that. It does work with Android though. I read it somewhere. I must say that you have to have wireless, but most have that anyway these days. I'm glad I bought it... and it came with 3 months netflix which is a good incentive ... paid for the dongle actually. I will certainly carry on with Netflix. It can also also stream your screen while you're working on it. Not much point I know but I guess you can share games and stuff doing that. I can go to crackle.com on my laptop and cast a movie from there onto the dongle too. Anything. Another thing I like is that if someone wants to watch a movie, and I don't like it or get bored, I can work on my laptop while it's playing on the tv. Google is really the way to go and it can only get better. I have Roku and wdtv, but I'm going to sell those and keep things simple. You won't regret getting it. OBTW I had to wait a while for mine because they are selling like hot cakes on a cold morning.", "verified": false, "helpfulness": "2/3", "author": "maryanjo"}, {"rating": 5.0, "review": "I love how easy it was to setup. Literally in less than 5 minutes I was streaming from my tablet to our Sony TV. We don't have a very fast internet service either, 10 Mbps download and 2 Mbps upload and the movies stream perfectly, no hiccups or buffering.", "verified": true, "helpfulness": "1/1", "author": "lawrence"}, {"rating": 2.0, "review": "i have high speed internet (38 down and 10 up) over wifi and the video was going in and out of HD and the audio and video didnt match up. i even took it to my parents and had the same issues. everytime i took it out of the tv it was burning hot to the touch.", "verified": false, "helpfulness": "2/3", "author": "R. A. Moore"}, {"rating": 2.0, "review": "I use Roku and Apple TV for streaming video and both work well though each has limitations. The Chromecast is a direct competitor at about 1/3rd the cost but unfortunately you get about 1/3rd of the viewing options also. As I was viewing the Chromecast setup video it stated that \"more apps were on the way\" and that kind of tells you what to expect. It does offer Netflx and YTube  and Google Play but does not offer Amazon instant vision or access to your local cable provider (I have Time Warner and the Roku app is outstanding). Of the 3 options I prefer Roku, Apple TV then the Chromecast in that order. Since either Apple TV or Roku are offered at a very moderate cost, I recommend either one over this initial version of Chromecast. It will unquestionably get better but right now its Not Ready for Prime Time.Some additional updates:Several reviews indicate the video quality is substandard and that is clearly the case for me. I've tried the Chromecast at 2 separate locations and in each case the quality is not as good as either my Apple TV or the Roku. Additionally at one location the Chromecast stops every 5 minutes or so to load more streaming, this is clearly not acceptable. Again neither the Roku or Apple TV have ever had any problem with quality or maintaining a steady stream. I am seriously considering returning the unit to Amazon and I have down graded my rating to 2 stars.", "verified": true, "helpfulness": "1/1", "author": "JK"}, {"rating": 2.0, "review": "There's much room for improvement here, it's a little soon for this product to come on the market.Currently, I own a { TIVO, ROKU, APPLETV, Samsung-SmartTV } -- was interested to see what this little device would bring to the world.1) It's not easy to setup.  - It didn't like my brand new tv, it would not install on there.  Had to use a monitor with an HDMI-IN port to install.  - Couldn't install from my ios device.  - Minor complain -- you must have a wireless device to install.2) It doesn't do much for you if you if you don't live in the android world.  If you live in the Apple world, stick with the AppleTV.Who want's mine?  I haven't found a reason to use it.", "verified": true, "helpfulness": "1/2", "author": "P. Weyzen"}]