[{"rating": 5.0, "review": "I love this little gadget. I have yet to travel with it, but setting it up on my plasma TV was super easy. I connect with my Samsung GS5 and iPad all the time.", "verified": true, "helpfulness": "0/0", "author": "Tammy R Slayton"}, {"rating": 5.0, "review": "I got the Chromecast for $30 and can't complain at that price. When I purchased it there wasn't much I could use it for except Youtube, but not I have MLB and HBO Go that I use regularly with the Chromecast. My kids sling Youtube to this thing every day. The picture quality is excellent and very little in the way of buffering/degradation. The only issue I had was with the MLB App the first week it supported Chromecast, but has been fine since. I recently ditched my Apple TV for a ROKU 3 on my main TV and I am considering getting a Roku stick for my basement. However, I will probably hold on to the Chromecast for travel and to let my kids use it on the TV in their bedroom Great product for the money and available content has been increasing. It wont catch the Roku, but it is also substantially less and has a small form factor for travel.", "verified": true, "helpfulness": "1/1", "author": "Brian K."}, {"rating": 5.0, "review": "Compare to the competing devices, I consider this best because of the mobile aspect that anyone can take control within the network. A group of friends in front of the TV could add to the queue of items to watch in Youtube. Slowly but surely new applications are coming out to integrate new interactive games, streaming, and possibly social media. It still has it bugs but well worth the money if you have the subscriptions.", "verified": true, "helpfulness": "0/0", "author": "Simba"}, {"rating": 4.0, "review": "I really like my Chromecast. It makes watching videos over the web much more pleasurable. It operates as if your TV is a Smart TV, at a considerable discount to the price of a Smart TV. I'm not a huge fan of using the tabbed browsing for video playback with my Chromebook - it tends to be very laggy, but Pandora seems to work just fine.My only real frustration now is that so many video players are not integrated with the casting app, so tabbed browsing is the only option, but that is slowly changing and will only get better over time!", "verified": true, "helpfulness": "0/0", "author": "Justin Husted"}, {"rating": 5.0, "review": "I purchased two of these for my boys at Christmas.  Ultimately, I ended take one of them and putting it in the living room (we no longer have cable/satellite).  This is the best product ever.  The only complaint is that certain websites are not compatable...but I'm sure it's only a matter of time.  The major websites work with it...we use it to watch Youtube, HULU, Redbox and Netflix.", "verified": true, "helpfulness": "0/0", "author": "I. Ward \"Mom of 2 Boys\""}, {"rating": 5.0, "review": "This fairly inexpensive dongle allows you to stream a variety of popular media apps or even your Google Chrome browser allowing for a full HD entertainment experience without adding to your cable bill.  One benefit of this device is the ability to utilize iOS and Android devices as the controller.  Beyond that, the expandable qualities of multiple tv sets with Chromecast's allowing for individualized control in different rooms expands the capacity of the home network.", "verified": true, "helpfulness": "0/0", "author": "Andrew Roers"}, {"rating": 3.0, "review": "I bought this thinking I would use it for work travel in hotel rooms- nope. It will not connect to hotel wifi. I've seen some workarounds posted, but it doesnt seem worth it. If it costed more than $35 I would probably have returned it. Instead I use it at home, and it works fine, but sort of pointless as it's less functional than a Roku or an Apple TV which are better suited for home use. It's built so small and light it would be perfect for travel if they would just fix the wifi connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "kaicholtz \"kaicholtz\""}, {"rating": 4.0, "review": "I love this. I am still figuring out how to use my amazon prime instant videos with it but for Hulu, it has been awesome.", "verified": true, "helpfulness": "0/0", "author": "Lisa Calderon"}, {"rating": 3.0, "review": "has a lot of lag even with high speed fios. need to unplug it every so often so it would reset and work", "verified": true, "helpfulness": "0/0", "author": "alex iskhakov"}, {"rating": 4.0, "review": "Cant complain. Very smooth seamless connectivity. It is not like Roku or a Roku replacement. It does not store apps like Roku does. It beams what is on your device.", "verified": true, "helpfulness": "0/0", "author": "NJ Guy \"PKS\""}]