[{"rating": 5.0, "review": "This was a gift for my son who owns one for the main entertainment center, this was for the 2nd TV.", "verified": true, "helpfulness": "0/0", "author": "Evan J"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Carlos Andres Arias V"}, {"rating": 5.0, "review": "I GOT THIS ITEM FOR A FRIEND OF MINE AND HE IS VERY HAPPY WITH IT.", "verified": true, "helpfulness": "0/0", "author": "ALBERTO GALARZA"}, {"rating": 1.0, "review": "It goes in and out and I paid full price I'm very dissatisfied", "verified": true, "helpfulness": "0/0", "author": "Charles Weaver"}, {"rating": 5.0, "review": "Easily one of the best under $40 purchases I've made. Makes watching anything and everything on my big screen a sinch. Love it", "verified": true, "helpfulness": "0/0", "author": "David R"}, {"rating": 4.0, "review": "Expect to disconnect and reconnect from time to time, just to reboot. Besides that it works great!!!!", "verified": true, "helpfulness": "0/0", "author": "Marie Myrlie Rameau"}, {"rating": 2.0, "review": "Working good but sometimes giving me some problem.", "verified": true, "helpfulness": "0/0", "author": "Syed Haris"}, {"rating": 4.0, "review": "This is a replacement for one that bent very easily. I like the way it functions and can stream more than the competitor. I just wish it could be redesigned to not stick out.", "verified": true, "helpfulness": "0/0", "author": "T. B. \"Terry\""}, {"rating": 5.0, "review": "Fabulous! Just wished it would work with my first edition Kindle Fire, and that with music it would have a screensaver. Also, it wouldn't work at a campground with wifi. Probably just the wifi's fault. Sometimes it has to be rebooted, but all in all, it's been so much better than satelite! I also wish it would work with more apps, especially free ones!", "verified": true, "helpfulness": "0/0", "author": "C. Lee \"Mysteriaholic\""}, {"rating": 5.0, "review": "Chromecast comes complete with two accessories: 1) A power cord that can be plugged into either a wall socket or USB port; 2) A flexible HDMI optional extender (in case space is tight behind your TV). In other words, there's no need to buy either. (The power cord is long, but it can be shortened to suit with the included velcro band.)", "verified": true, "helpfulness": "0/0", "author": "Denny Klink"}]