[{"rating": 3.0, "review": "It's basically for me to watch Netflix on my TVIf i Could stream TV shows from the networks it would be great........", "verified": true, "helpfulness": "0/0", "author": "Sam Boosak \"fiatspider2000\""}, {"rating": 5.0, "review": "I have had a Roku and Apple TV, and this thing, for the price and functionality, is my favorite of them all.  I use the Chromecast in my living room because it is hidden perfectly, with no wires showing...I am a huge fan of this device and am looking forward to seeing how it is integrated with other services.", "verified": true, "helpfulness": "0/0", "author": "M. Brown"}, {"rating": 3.0, "review": "When it works - it is fine, but outside the US you do not have much to do with it (no Hulu or Netflix) except showing youtube videos. When it will do local streaming - that would be great.Yes, and too many resets required since it lost network access and could not refind it.", "verified": true, "helpfulness": "0/0", "author": "Tally Barak"}, {"rating": 4.0, "review": "I LOVE my chromecast. It is lacking one feature with Netflix that I wish were there. When watching shows I have to manually select the next episode on the webpage, instead of just playing the next episode, as it would watching on my computer.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 1.0, "review": "it wasnt AS EASY TO INSTALL AS I was led to believe.  it wouldnt install using a 3 yr old computer.  and now that its installed i cant figure out how to use it with the computer.  The little icon is not at the right hand top corner of the computer screens.  If i hadnt waited so long to try installing it i would return it.", "verified": true, "helpfulness": "0/3", "author": "Jean Eaton"}, {"rating": 5.0, "review": "This little device is a technological marvel. easy to set up and works great from my phone, tablet and PC. I highly recommend it. It was purchased from Amazon at a great price with fast, free shipping.", "verified": true, "helpfulness": "0/0", "author": "Brent Williams"}, {"rating": 5.0, "review": "So far I have only tried youtube and netflix on this guy but it works great. If you have a good internet connection the quality is really good after a moment of the video loading up. I have been sending video to my tv from my smartphone and it works pretty seamlessly!", "verified": true, "helpfulness": "0/0", "author": "mizz"}, {"rating": 5.0, "review": "I ditched cable and went 100% google chromecast.  I love this thing.  Works like a charm all the time, great access to all my desired content.  The best part of this thing is that you use a cell phone, tablet, or any computer connected to the same wireless as the remote control.  You can literally choose a show to watch and then completely turn off the device used to select said show.  No battery drain, no streaming through the cell phone, tablet or computer.  Just easy and awesome streaming.", "verified": true, "helpfulness": "0/0", "author": "B. Heath"}, {"rating": 2.0, "review": "Uses were too limited. Though I would be able to stream everything.Not so. Only YouTube and Amazon. No Thanks.", "verified": true, "helpfulness": "1/3", "author": "rg3186"}, {"rating": 1.0, "review": "Doesn't work with my windows 7 and no one can tell me why.  No support that knows literally anything about the product, every person I talked to pawned me off on someone else.  Very displeased with google on this product.", "verified": true, "helpfulness": "1/2", "author": "Brandon Brown"}]