[{"rating": 5.0, "review": "Enjoying it!", "verified": true, "helpfulness": "0/0", "author": "Betty Weiner"}, {"rating": 5.0, "review": "I bought the Amazon Fire TV because I wasn't able to connect to Netflix or Hulu using a wireless extender (due to concrete walls) and I figured the Amazon Fire TV would make it easier. At first with the wireless extender the Amazon Fire TV did not work well so I decided to get a long ethernet cable and ran it to the bedroom and voilà now I have everything I want to see and more. This is one of the greatest gifts my husband has ever given me! I did get frustrated at the beginning when I would do a voice search for a program that is on Netflix or Hulu and Amazon would say that I have to pay for it. I then realized that if I want a program that is shown on Hulu or Netflix I have to voice search Hulu or Netflix first and then log in and play it without having to pay for it. Voice searches are for Amazon Prime programs ONLY and not for programs that are on Netflix or Hulu. Since I live in Puerto Rico even though I can download apps like Showtime Anywhere and see some of their free programs, I cannot see other programs due to provider issues. I am a Showtime subscriber but my provider is not a subscriber to this service. Little things that we learn to live with. I love this gadget and we even gave two as gifts this past Christmas. A great buy that I would recommend to others. Just yesterday we recommended it to our doctor but had to remind him that it is not shipped to Puerto Rico. When there is a will there is a way!  The Amazon Fire TV works very well in Puerto Rico.", "verified": true, "helpfulness": "0/0", "author": "Carmen"}, {"rating": 4.0, "review": "Fairly pleased with the FireTV. Menu system is clean and responsive. Voice search is OK. It would be better is it supported external storage out of the box. Good value overall.", "verified": true, "helpfulness": "0/0", "author": "Kyle C Griffin"}, {"rating": 5.0, "review": "My favorite purchase so far!I have had the Roku and Apple TV.This one works so well that I decided to pick up the Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Ray360"}, {"rating": 4.0, "review": "Limited games but, some that are fun and entertaining. Good selection of Prime TV shows and movies that are easy to find. Set up was easy and have had no issues almost 2 months later. Overall a nice idea that should keep getting better.", "verified": true, "helpfulness": "0/0", "author": "tguth"}, {"rating": 5.0, "review": "Fantastic!If I didn't have Netflix, this would be the greatest device ever.But it's still worth getting even if you do stream netflix also.", "verified": true, "helpfulness": "0/0", "author": "James C Barclay Jr"}, {"rating": 5.0, "review": "fire tv. easy to use, cut the cord.. why pay for cable when i hardly ever watch tv. to begin with....", "verified": true, "helpfulness": "0/0", "author": "Too2bad"}, {"rating": 5.0, "review": "I'm not one for learning more technology with all the set-up, controls, and how-to etc.  With Amazon fire I was floored by how easy it was to get it up and running in minutes.  I usually have one of my kids do that for me.  The voice control is definitely a plus!  Having a prime account pays for this product quickly as you can watch tons of movies, look at YouTube, your pics and videos to name a few.  I haven't had any problems with it so far.  Amazon even gave me a price adjustment when I realized the price went down by $15.00...no questions asked.  Product arrived on time and packaging was excellent.  I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "exotic dancer"}, {"rating": 5.0, "review": "Came in like new condition. Great device. Recommended highly.", "verified": true, "helpfulness": "0/0", "author": "Gmrfreak84"}, {"rating": 5.0, "review": "We decided to get the Amazon Fire when we saw a promotion for buying 3 months of Sling TV get $50 off the Fire TV.  We got our fire the next day and it was very easy to set up. The next day our Fire TV wouldn't turn on and we called support and Amazon sent us another Fire TV next day.... No hassle what so ever. The Fire TV is great! It has all the apps we need and want. No need to have multiple devices to have all the apps we want.", "verified": true, "helpfulness": "0/0", "author": "Jamel J. Burgos \"Jamel B\""}]