[{"rating": 5.0, "review": "Works great.  Downloads fast.  Kids love it.", "verified": true, "helpfulness": "0/0", "author": "Brian Jones"}, {"rating": 5.0, "review": "works great better then roku enough said", "verified": true, "helpfulness": "0/0", "author": "TMAC"}, {"rating": 4.0, "review": "It's great!", "verified": true, "helpfulness": "0/0", "author": "ARTHUR PONCE"}, {"rating": 5.0, "review": "Awesome player!! Insanely fast compared to apple tv", "verified": true, "helpfulness": "0/0", "author": "Vijaya Kumar Sivalingam"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey P Grontkowski"}, {"rating": 5.0, "review": "Amazingly fast response times and crystal-clear video & audio. Easy access to Amazon Prime and Netflix content. Very impressive. No longer will we need to wait \"forever\" on content downloads via our A**leTV.", "verified": true, "helpfulness": "0/0", "author": "Jimbo88"}, {"rating": 5.0, "review": "More than I expected. I love love love it!! :)", "verified": true, "helpfulness": "0/0", "author": "Debbie Jenkins"}, {"rating": 5.0, "review": "100% satisfied...Easy to use.  Fast shipping!", "verified": true, "helpfulness": "0/0", "author": "charlotte y owens"}, {"rating": 5.0, "review": "I have tried Chromecast, Sony smart blu-ray and Samsung smart tv. The Fire TV is without a doubt better than any of those. It loads instantly, the user interface is intuitive and the quality of the streaming media utilizes my home theater's full potential. I am going to get an HD antenna for local stations and promptly tell my cable company to kiss my overpriced monthly payments goodbye, they can go pound sand!", "verified": true, "helpfulness": "0/0", "author": "joey dion"}, {"rating": 5.0, "review": "Amazon Fire TV is a fantastic product. Setup is very simple. Just a couple connections (HDMI and power), an on screen walk-through to connect to WiFi, and I was watching an Amazon Prime movie within minutes of opening the box.The unit is constructed well, but it can get hot. So be sure to give it some \"breathing room\". The remote is great, as well. It is small, and fits well in the hand. The \"Android\" style buttons are simple to use, especially if you already use an \"Android\" device. I don't use the \"voice remote\" feature very much, but the few times I've used it, it has worked well.I would actually give it 4.5 stars because I'm not completely happy with the menu. It, obviously, is geared toward Amazon's services, which is fine, but the Apps menu (which has all of the non-Amazon apps, like Netflix) is pretty far down the list. There is a \"Recently Viewed\" section in the Home Menu, but I don't see any way to \"pin\" a favorite App. It would be nice if you could add your own custom line of apps in the Home Menu. This is really a minor gripe on a great product.", "verified": true, "helpfulness": "0/0", "author": "Brendan"}]