[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Brian B."}, {"rating": 4.0, "review": "So far we love it...it's just different than what we are accustomed to...but so far it's great!", "verified": true, "helpfulness": "0/0", "author": "Kristin M. Lineberger"}, {"rating": 5.0, "review": "As a prime member its worth having access to the shows and movies on the TV as well as the iPad and phone.", "verified": true, "helpfulness": "0/0", "author": "Eric Kleff"}, {"rating": 5.0, "review": "EXCELENT", "verified": true, "helpfulness": "0/0", "author": "JOSE D CAMACHO RODRIGUEZ"}, {"rating": 3.0, "review": "Works great but I still have a lot to learn about it. One of the greatest things is it understands my voice!", "verified": true, "helpfulness": "0/0", "author": "RO"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Greentug"}, {"rating": 5.0, "review": "We are very happy with it.  Does exactly what it promised.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "I bought Amazon Fire TV in order view Sling, the new online based TV service.  I am planning on dropping DirecTV now since Amazon Fire TV and Sling give me all I need for my 'cable TV' viewing.  I am a 19 year DirecTV subscriber and my bill just keeps going up and up.Amazon Fire TV is great!  It was very easy to hook up to my TV and my WiFi.  I think it took about 10 minutes total to get it up and running.I am an Amazon Prime member so I can view all my Prime content on Amazon Fire TV as well.  I am still exploring and learning because there are so many apps to try.I also enjoy that I can listen to music via iHeart Radio, Amazon Music, etc.It has an HDMI output for HDTVs.  The picture quality is great!It also has an Optical audio output that I will be using with my Surround Sound receiver.For the money, and all the apps available, you can't go wrong with Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Don \"dishfish\""}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/0", "author": "gene"}, {"rating": 5.0, "review": "Got the Fire for Sling TV primarily. Very good remote compared to the Apple TV - apple's remote is too small for my hand. The Amazon prime does not have much of a selection for shows that really interest me because I watch Hulu Plus. The main feature is Sling over the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Steve Raebel"}]