[{"rating": 5.0, "review": "This works with all my devices no hassles, it is easy to setup and even my 3 year old knows hot to use it.", "verified": true, "helpfulness": "0/0", "author": "Joe Rojas"}, {"rating": 5.0, "review": "For $35 this is a steal. Displays your Chrome screen onto a computer with an HDMI port. More reason to believe wasting money on cable tv is dwindling.", "verified": true, "helpfulness": "0/0", "author": "Brendan J. Wiese"}, {"rating": 5.0, "review": "Arrived as stated and was in tip top shape. Good instructions. Followed and install was done w/o problems on tv. configuration is auto after chromecast is selected on browser. Works as indicated.", "verified": true, "helpfulness": "0/0", "author": "NF"}, {"rating": 5.0, "review": "Such a great little toy, I love being able to send TV shows etc. from my laptop to my television. I haven't had many problems with it, I do, however, wish it could pick up WiFi a tad better...", "verified": true, "helpfulness": "0/0", "author": "Jon-Marc Hatton"}, {"rating": 4.0, "review": "works really well..... but hoping for more apps to get the most out of itnot a bad unit to get", "verified": true, "helpfulness": "0/0", "author": "Ruben I Marrero"}, {"rating": 5.0, "review": "Chromecast is a good avenue to have when you feel like viewing your photos,hearing music,watching shows or movies you have not seen or missed but this is only the beginning of things you can explore and do. Don't take my word for it just try it who knows you may enjoy the features it offers.", "verified": true, "helpfulness": "0/0", "author": "Nan"}, {"rating": 5.0, "review": "I was stuck in bed for a period of time and didn't have Netfix available to this TV.  Chromecast arrived and within an hour we had the bedroom TV doing it's job.  Ytube is also available with a variety of information, entertainment andnews opinions.  You can even find some that agree with you.", "verified": true, "helpfulness": "0/0", "author": "Art Nickler"}, {"rating": 4.0, "review": "The setup.Let me start by saying that I've ordered literally ALMOST everything through amazon in terms of technology, household items, accessories, etc and I've never been let down in terms of delivery and customer service.I received my Chromecast two days after ordering it which was expected as I am a Prime Member of Amazon. It came in perfect condition, packed neatly with no problems or rips or dents on the box itself.The connection too the television was smooth and simple and quite quickly as all I had to do was connect the Chromecast to an HDMI output on my Vizio LED and then connect the USB into the chromecast from the USB port on the TV itself. There were no problems and it instantly turned on as soon as I turned the TV on.The first problem however came up during the setup. Chromecast WOULD NOT connect with my phone and in turn connect itself too the WiFi which of course was frustrating but I wasn't the only one. I have a Samsung Galaxy S5 so compatibility wasn't an issue but I just kept having issues until I decided to put my phone on top of the Chromecast to see if it worked, and after 10 minutes of trying? WAH LA!I use an application called Local Cast which allows me to stream directly from my Galaxy (I use Showbox) so I can watch movies and shows and also listen too music.I definitely recommend this buy too anyone as it will work with Apple Products and Android as well!!! Bummer Apple is so ignorant and blind that they won't allow Android products to use their Apple TV when it's also really well built and extremely stable but at a steep price. These 35.00 are well worth more than the 100.00 Apple is selling their Apple TV for.", "verified": true, "helpfulness": "0/0", "author": "Pedro V. \"P.Vieira\""}, {"rating": 5.0, "review": "For a inexpensive product the Chromecast earns its value almost immediately. I own an LG SmartTV that does not have HBO Go as an available app so the Chromecast was able to correct that problem for me. I purchased two of them so that I can stream shows in my bedroom which doesnt isn't smart tv enabled. Thanks Google.", "verified": true, "helpfulness": "0/0", "author": "Craig S Davis"}, {"rating": 5.0, "review": "A great perchase with such bang for the buck. The only downside is that there is not too many apps for it yet but what I hear is there are more coming soon.", "verified": true, "helpfulness": "0/0", "author": "DelDaOutdoorsman"}]