[{"rating": 5.0, "review": "some people were having trouble with amazon prime but if you look at what operating system you are using to open prime choose adobe you may have to remove silver light  from your control panel before this option is available  to do this. but yes it works if you choose adobe and update", "verified": true, "helpfulness": "0/0", "author": "cel"}, {"rating": 5.0, "review": "Shipped on time and in perfect  cnditions . Like everything I've purchased here the other guys are more than awful!", "verified": true, "helpfulness": "0/0", "author": "Tonny"}, {"rating": 5.0, "review": "This has been so fast the best product for those of is not seeing good an investment on a smart TV when you can just make work fine your dumb one with this simple gadget.", "verified": true, "helpfulness": "0/0", "author": "Rolando Peña"}, {"rating": 1.0, "review": "This is a JOKE. Does not work with Chrome or my Chromebook. It is a piece of junk. Won't even properly connect to my iPhone and I'm not computer knowledge deficient... this thing just sucks.", "verified": true, "helpfulness": "0/3", "author": "Danielle C. Geneson \"flourishblog\""}, {"rating": 5.0, "review": "Using it with Plex lets me use the new big wall TV here to watch everything I normally would have watched on the computer. Not having to wear my glasses alone is worth it.", "verified": true, "helpfulness": "0/0", "author": "Brad Bulger"}, {"rating": 5.0, "review": "just love it and most of all the price.so easy to use, excelent quality of image, doesnt spent my phone's battery.", "verified": true, "helpfulness": "0/0", "author": "Raul Ramirez Anaya"}, {"rating": 3.0, "review": "This connected easily to my wifi and my computer running Chrome found it immediately.  It works well, sometimes, but also sometimes seems to get confused about whether it is mirroring the computer (\"casting\") or instead simply being controlled by the computer (like a big remote).  I've used it with YouTube but no other programs support it.", "verified": true, "helpfulness": "0/0", "author": "Reuel \"drj\""}, {"rating": 5.0, "review": "Instant laughs and good time when we plug in our Chromecast and show beloved videos and things on the TV with friends.", "verified": true, "helpfulness": "0/0", "author": "A Ampil"}, {"rating": 3.0, "review": "It Works Ok. But I Am Using An Older Laptop. I'm Sure If I Had A Newer Computer, It Would Work Much Better.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 1.0, "review": "Crap product with total lie in the \"Google Chromecast HDMI Streaming Media Player\" title.In bold letters it should state that this product  has very limited applications to Streaming media.  These are the only ones it works seamlessly with:  (then state them).I couldn't cast U tube, PBS, or 90% of those programs on network.", "verified": false, "helpfulness": "0/2", "author": "flipspiceland"}]