[{"rating": 5.0, "review": "I use this primarily as a Plex streaming device. Plex is a server that allows you to stream movies that you own, to certain devices. So being able to have all my movies on my computer and not having to deal with swapping disc every time is a huge benefit. This plays back anything that i throw at it with ease. There's no lag or anything when i chromecast my media to this bad boy.Also, chromecast is now able to beam your smartphone screen to the chromecast. Lots of apps have charged for this feature but now google is allowing it for free (in beta now for certain devices)Highly recommend this device, even though it has some short comings like amazon prime videos, but for the price you can't complain.", "verified": false, "helpfulness": "0/0", "author": "Romans"}, {"rating": 1.0, "review": "It worked for first 4-5 days. It was really convenient to cast from your phone to the TV and don't have hook it up. When it get hot (usually about 2 hours or so) the device will not be recognized by TV anymore. I thought it might be the TV, so tried it on another TV and the same thing happened.It compatible with a lot of apps such as abc, ESPN, etc. But when you download the apps, some of them you can find the cast button some you couldn't.It is a cheap product but what's the point if it doesn't work properly.", "verified": true, "helpfulness": "0/2", "author": "nga vu"}, {"rating": 3.0, "review": "If you are only streaming one COMPATIBLE device to a TV set located within 2-3 feet, then MAYBE with will be ok...I found that the video freezes/skips and many applications were not compatible.", "verified": true, "helpfulness": "0/1", "author": "Tech-Guru"}, {"rating": 5.0, "review": "Works great, very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Allen E Jones"}, {"rating": 5.0, "review": "Awesome product! With the latest updates to various apps in Android's offering as well as being able to duplicate my Nexus 5's screen this product has proved both entertaining and functional in the home and office setting.", "verified": true, "helpfulness": "0/0", "author": "M.Lessnau"}, {"rating": 5.0, "review": "A neat way to stream You Tube video's wirelessly from your Android devices.  Haven't tried streaming HBO Go but I would imagine that should be possible.", "verified": true, "helpfulness": "0/0", "author": "frank fales"}, {"rating": 1.0, "review": "No I am not able to get all the apps I was seeking.", "verified": true, "helpfulness": "0/2", "author": "Mamadou M. Sane"}, {"rating": 5.0, "review": "I use Chromecast with nexus tablet. Perfect combination. Completely satisfied. I use it forNetflix, you tube, HBO go,With the new chrome on android, I can cat any videos on web now on Chromecast.Another android update let's me mirror the tablet to TVCan't ask for more......", "verified": true, "helpfulness": "0/0", "author": "H. Narendran \"harry\""}, {"rating": 5.0, "review": "Great way to see netflix and youtube on tv", "verified": true, "helpfulness": "0/0", "author": "Miguel E Coba Martinez"}, {"rating": 2.0, "review": "Worked great at first and really loved it. But not so much anymore as it won't remain connected to internet and does a lot of buffering. Have had our internet checked and router and everything else only to hear everything is fine.... Don't use it very much anymore.", "verified": true, "helpfulness": "0/0", "author": "Heidi P."}]