[{"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "aishwarya ala"}, {"rating": 5.0, "review": "Great product. Better than other streaming devices I used earlier.", "verified": false, "helpfulness": "0/0", "author": "Mohanprabhu Ramalingam"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "sucked,  refuse to link up with my iphone 6", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 5.0, "review": "I absolutely love my chromecast. It is very useful when trying to watch movies or TV in general. I wish it supported more apps, but I know that the potential of the chromecast is going to exceed my expectations!", "verified": false, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "use it all the time", "verified": true, "helpfulness": "0/0", "author": "emily"}, {"rating": 3.0, "review": "It works, but if you have a smart tv I am not sure what the point it. It does not work with slingbox audio, it will send the video over but not the audio when using chrome browser.", "verified": true, "helpfulness": "0/0", "author": "aubrey myers"}, {"rating": 5.0, "review": "great working device! Recommended highly!", "verified": true, "helpfulness": "0/0", "author": "John Trussell"}, {"rating": 5.0, "review": "The chromecast is awesome.  I buy my movies thrpough google play more than anything else these days (I don't even remember the last time I bought a DVD or BlueRay).  Super duper easy to just switch over my input and play my movies.Honestly, I usually use this when I am sitting around, working on stuff and want to have youtube going as well, I just add stuff to my play list and it goes.  There is no hassel or fuss (not that it is hard to connect my computer, but I can launch from my phones and tablets too).There are lots of other services that are great - HBOGo, Crackle, Pandora, Hulu, Starz (some of these require subscriptions) and lots more (see the list at http://www.google.com/chrome/devices/chromecast/apps.html#marquee-slide-hbo-go)There are a couple things that I think I should share for anyone looking into this:-It needs to have a wifi network to stream across.  If you are in a hotel and want to use this, you will not be able to.-If you use only static IPs on your network - you will have problems with this.-If you want to watch your movies that you have locally on your computer - you will need to use Plex (last time I checked, there was a fee for this service).", "verified": true, "helpfulness": "0/0", "author": "Katrina"}, {"rating": 5.0, "review": "Love it! Haven't had a problem with it in the past 6 months I have owned it. It powers up when I turn my TV on as the USB (which gives it power) is plugged into my TV. It does get kind of hot with use but not to the point that it melts. Great job Google!", "verified": false, "helpfulness": "1/1", "author": "Kyle Peterson \"Kyle P.\""}]