[{"rating": 5.0, "review": "Chromecast is incredibly awesome!I always thought it was a gimmick until I looked into it further.My biggest concern was watching movies that are on my computer on my large screen TV without moving it all to my laptop and then hooking up a HDMI cord to it and watching it as a secondary screen.Instead, the chromecast is always on the TV, with a USB plugged into the screen.I can load up basic codec movies (mp4, avi) onto Google Chrome, which I can then cast to the Chromecast.This was all great until I remembered that all of the encoding happened through Google Chrome, and because of this, it was rather slow and glitchy.I found Plex (plexapp) which was a program that you can load onto any computer, define it as a \"Media Server\" and then cast through to the Chromecast.The encoding and streaming happens on the program, which reduces the amount of lag and glitchiness.With the Plex app, the Chromecast becomes 100x more versatile.I hope Google looks into opening the code up to more programs (such as Plex) to start streaming to the cast without using Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 4.0, "review": "If you think you can use this to use your tv as a monitor it is too slow.I connected a bluetooth keyboard and it is so slow you cannot control the cursor, that and the screen locks up on the PC trying to get the info out to the google tv device.Netflix is not as clear as the PS3 or Wii, you could blame my NW but then why does the PS 3 on a wireless do just fine and deliver HD to the Tv.Not bad for the price, but still needs work.Does not support 500mghrz so you are still stuck streaming video over your 2.8 with all your other data", "verified": true, "helpfulness": "0/0", "author": "Disneydad"}, {"rating": 2.0, "review": "I love the idea of this product and when it did work it was great. However, when it did work, 60% of the time the netflix or youtube video would have to stop and reload several times over the duration of the video. Sometimes this reloading would result in the video no longer being played. I am very disappointed in this product initially working spottily at best and now I simply can not get the chromecast to respond to any device I have(macbook, ipad, iphone, or android phone).WIsh that I could return this product, but unfortunately I tried to stick with the glitches and now I have an unusable product.Because the product only sometimes worked in the beginning and has stopped working after 1 month, I WOULD NOT RECOMMEND THIS PRODUCT TO ANYONE.", "verified": true, "helpfulness": "0/0", "author": "Melanie"}, {"rating": 5.0, "review": "Love this device, purchased another one after receiving the 1st one to use in strereo receiver. Now can control music casted from phone to stereo while listening out on the deck-awesome", "verified": true, "helpfulness": "0/0", "author": "Janelle Bahr"}, {"rating": 4.0, "review": "Check and make sure your router, modem, or ISP supports this product. Bought for a friend was not able to get it going, even contacting Google support. I took it home and set it up on my network in like 5 minutes. Great product if you don't have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Kevin M Carolan"}, {"rating": 5.0, "review": "Initially the Chrome cast had limited uses.Now that Google has released an SDK for it the possibilities are endless.I haven't had a problem with this gadget ,it just works.One key thing is to remember that it has to be used on the same WFI network as your devices.I have used this on vacation. Motels and Hotels. No problems.I use it with my smart phone, my laptop, chrome book.Now that I have WFI on my home computer ,I can send what is on my monitor to my 50\" screen in the other rooms.I have yet to find a TV that can power it using the usb ,so you will have to find an outlet for the included power supply.", "verified": true, "helpfulness": "0/0", "author": "Glider43"}, {"rating": 5.0, "review": "I bought this for my son and he installed it without any problem and says it works great.  He is very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Judy MacFarland"}, {"rating": 5.0, "review": "We use this just about every day to watch videos online to shows we have on our computer. I love this product, it works great", "verified": true, "helpfulness": "0/0", "author": "JenRioux"}, {"rating": 5.0, "review": "Sets quickly on home NW.  I can play any youtube video from PC on TV. PC controls volume as well.  New beta feature allows exporting Chrome tabs to TV. So you can now see photos, web pages on TV while browsing on PC.", "verified": true, "helpfulness": "0/0", "author": "Pravin Pathak \"Pravin Pathak\""}, {"rating": 5.0, "review": "An avid tv junky, I was a nervous wreck about cutting the cable and relying only on the internet and over the air channels to get my entertainment fix. Chromecast works great -- especially with Netflix, but also casting streaming programs from my Chrome browser. I also love how it works with my iPhone, allowing it to serve as my remote control. I'm looking forward to the day when more apps work with it (specifically, Amazon Prime) but in the meantime I've very happy with this product and enthusiastically recommend it.", "verified": true, "helpfulness": "0/0", "author": "KC-Consumer"}]