[{"rating": 5.0, "review": "We love our new fire tv. Its very fast and has many applications. Oyr next step is to get the ggme controller. Worth the money.", "verified": true, "helpfulness": "0/0", "author": "Alilli"}, {"rating": 3.0, "review": "I got this so I could watch Twitch from my TV only to find out that is doesn't connect to your Twitch account. So you can't easily find channels you follow nor do you get access to Twitch Turbo perks, like no commercials.", "verified": true, "helpfulness": "0/0", "author": "Orin S."}, {"rating": 4.0, "review": "I love the picture quality but certain things such as accessing  network drives and playing lossless FLAC files remain unresolved for me to be completely happy with it. Hopefully future firmware updates will solve the issues.", "verified": true, "helpfulness": "0/0", "author": "Harsha De Silva"}, {"rating": 2.0, "review": "eats batteries and does not go to sleep", "verified": true, "helpfulness": "0/2", "author": "Scott Seattle \"Axios pres\""}, {"rating": 3.0, "review": "FIRE TV is a good service. What keeps it 2 stars from great, is that the free prime movies are really old, I've seen or decided against most, therefore Fire is like Charter Pay TV in that respect, I have to pay per movie for the movies I want to watch and I already had that with cable . The other is that Fire advertises HBO Go availability, but the small print says, IF YOUR PROVIDER SUPPORTS FIRE. Charter does not, so 9.7 inch iPad screen  for HBOGO viewing for me. All in all, I used Fire TV almost exclusively for the first week, Now back to regular cable most of the time. Hoping offerings in prime will improve, and someone works a way for HBO to work for me, other than buying a $379 Kindle Fire HDX. Have a new tablet already, don't need another.", "verified": true, "helpfulness": "1/3", "author": "Teresa Winger"}, {"rating": 1.0, "review": "The parental controls on the device do not work. You can PIN protect purchases which seems to work every time my wife and I use it. However, when my 1.5 year old son gets his hands on the remote he manages to rent a movie. Supposedly there is a way to cancel accidental purchases from the order page but that doesn't work if you started streaming it. There is a ridiculous bug somewhere in its software.", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have only had this for a little over a week. But, so far, it has been really good. I am trying the amazon prime, and the shows and movies start instantly, no waiting for it to load. The voice search has worked pretty good, and fast. I had only one instant where I did a voice search, it initially used the correct name, but I hit the back button when I was adjusting my grip on the remote, I re-ran the same voice search, and it kept offering different names. I think it took the back key to mean that it didn't identify the name correctly, so, it was trying to correct it. One thing I did, is to set a pin through parental controls, to make sure that I don't accidentally purchase a show or movie that I don't want to purchase. It seems like it would be too easy to accidentally hit the wrong button, (a thumb twitch, or something), so, setting up a pin, makes you think about it first. I prefer to buy the blu-ray or dvd if I really like a movie. Who knows how long they will be available to stream?I also have a netflix account, and the fire tv box has the new, updated app for netflix. Netflix starts faster, and even the shows and movies through netflix start faster than my blu-ray players netflix app.I have also tried youtube hd, and it works pretty good.There's still a lot to it, that I haven't tried out yet. But, over-all, I am happy that I purchased the Fire TV. I should also say, that I have a pretty fast internet connection, 150 Mbs, but, I believe the ethernet port on the fire tv is only 100 Mbs. So, far all the shows and movies I've watched have been HD, and I haven't run into any jerkyness or stops waiting to buffer.", "verified": true, "helpfulness": "0/0", "author": "gso"}, {"rating": 5.0, "review": "Very good picture quality for Amazon Video, Prime, Netflix, Hulu etc.", "verified": true, "helpfulness": "0/0", "author": "Todd C. Kingmon"}, {"rating": 4.0, "review": "The Amazon Fire Tv is pretty awesome. There is a large variety of shows to choose from and I can watch all my favorites. Navigation from the menu is simple which makes it super easy to find what you're looking for. I love that my photo's from my kindle are on there and that I can add more from my phone and view them on my large tv. Playing games on it is pretty awesome too. The only reason I didn't give a 5 star is because I wish there was more Free shows on it.", "verified": true, "helpfulness": "0/0", "author": "Noahsark"}, {"rating": 5.0, "review": "The selection of movies is excellent. The response time and voice recognition are both excellent.", "verified": true, "helpfulness": "0/0", "author": "Walker Boh \"Walker Boh\""}]