[{"rating": 5.0, "review": "I bought the Amazon Fire TV to replace my Roku Streaming Stick that I was extremely disappointed with.  So far, I'm cautiously optimistic about the Fire TV.The biggest problem with my Roku is that it didn't really like streaming content from the internet, which, for a device built to stream content from the internet, is a big problem.  In the wee hours of the morning, far away from peak internet usage times, the Roku would buffer frequently or stop playing all together.  My internet connection was fine and other devices could stream content in HD without any problems.  It was the Roku that was defective.  And thanks to their crappy (read: short) warranty, I'm stuck with it and out $50.  So my first and primary expectation for the Fire TV is that it be able to do what it was designed to do: stream content from the internet.  So far, it has done that fabulously.  Why am I cautiously optimistic then?  Because my Roku worked great at first too.  But at least the Fire TV has a better warranty.  Time will tell and I will certainly update this review should my experience change.Pros:-It works.  There used to be a time when we expected the things that we bought to work.  Now days, with planned obsolescence and products being engineered to fail after a particular time or being manufactured in the cheapest way possible in some small Asian country that most people can't find on a map, something working the way that it is supposed to becomes a \"pro\" and not just and expectation.  Yay, capitalism!-It is a lot faster and more responsive than my Roku.  My Roku wasn't particularly slow when it worked, but this is instantly responsive to button presses, enough to notice the change.-It has an extremely flawed and basically useless Twitch TV app.  Why is that a pro?  Because the Roku didn't have one at all and I'm hoping that the developers fix this one.-It's very small and unobtrusive.  It doesn't look out of place sitting under the  edge of my TV.-While I haven't used it yet, there is a gaming controller and a decent selection of games.  Some of those games I've played on my computer and are pretty good, and I was surprised to see them available here.  This is never going to compete with a gaming console or PC, but it does add a little value to this box.Cons:-The user interface could be a lot better.  Once you learn it, it's okay, but still not great.  This is one way that the Roku trumps the Fire TV, having a very clean and simple UI.-The home screen is very focused on alerting you to the fact that you need to buy more stuff.  I guess that's to be expected since this is an Amazon product, but the last thing that I want to see after spending $100 on this box is a home screen showcasing movies that I can buy for another $15 and games for another $5.  God forbid that you should buy this without first having a Prime membership, lest you will see nothing that doesn't cost you more money.  The whole thing feels like an advertisement that I just paid to look at.-You can't (or at least there is no easy way to) install apps that aren't officially approved by Amazon (in the app store).  They took one of the freest (as in freedom) operating systems around today and locked it down like a virgin on prom night, all for the sake of \"delivering the best possible experiences to our users\", blah, blah, blah.  Yeah, we've heard your corporate jargon before and we know BS when we hear it.  You don't care about my experience, you care about my money!Pros nor cons:-The remote is bluetooth, not wi-fi.  I'm a little worried about how that will effect its battery life, but that may also be why it's so quick and responsive.-Lack of HBOgo.  I don't have cable, thus I don't have HBO.  And since you can't use HBOgo without a subscription to HBO, the lack of HBOgo doesn't matter to me.  Since cable television is thankfully making its way towards extinction, I'm sure that HBO's policy towards use of HBOgo by non-subscribers will change eventually.  When that does happen, I would expect them to add the HBOgo app to Fire TV.  What those costs end up being will ultimately determine whether its of use to me.-Doesn't include the games controller.  Since I game on my PC, the lack of a games controller doesn't really matter to me.  Maybe they sell it separately in order to keep costs down since a lot of people probably won't use it anyway.  On the other hand, I'd be much more inclined to make impulse purchases of cheap games if I already had the controller.  Will I buy it?  I don't know.  It's not really that expensive so I don't know why so many people were upset that it wasn't included.  I mean, if you buy a brand new car you still probably end up paying for the floor mats.-Optical audio output.  I'm not using it right now because my surround sound system is a tab bit....broken.  Even if it wasn't broken, I would still be using the optical audio output on my TV instead so that I can enjoy surround sound from all of my sources.  If I ever buy a new TV without an optical audio output I'll be glad that the Fire TV has one, but until then it makes no difference to me.-USB port.  I'm not even sure what this is for.  If I can plug an external hard drive into it and play movies stored on that hard drive then it's awesome.  I highly doubt that that is the case though.  I imagine that, at best, you can view photos from a USB stick or maybe even play some music.  Maybe some day I'll play around with it and update my review should my movie viewing dreams come true, but don't hold your breath.Well that's about it.  It's not perfect but it's the best thing out there compared to the similar products that it competes with.  I'm glad that I bought it, sad that I wasted money on the Roku, and hope that it lasts for a long time.", "verified": true, "helpfulness": "0/0", "author": "K. Childers \"Juggernaut\""}, {"rating": 4.0, "review": "Update:Early adopter, willing to give Amazon a chance to develop some apps, functionality, etc.  After a long wait, I am starting to see some useful streaming services appear on this system.  Still much fewer than the competition, but heading in the right direction.  As previously noted, gaming is great on this system, much better than I expected from a media player.Previously complained that the Netflix app had stopped working.  Eventually I had to reset the entire system to the default factory config to restore Netflix functionality, but it is now working again.  Hopefully this is not a common occurrence as re-entering all my account data due to the corruption of a single app seems excessive.At its current price of <$90, it's definitely worth considering if you are content with access to the most common streaming services.", "verified": true, "helpfulness": "3/3", "author": "MYOB"}, {"rating": 5.0, "review": "I like this unit as I have used it a few times I will reserve the right to review it further after more use.  I do enjoy Amazon Prime Movies and the TV shows from HBO", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great ! Already set up with my Amazon prime stuff. I like it a lot !", "verified": true, "helpfulness": "0/0", "author": "flatpicker"}, {"rating": 5.0, "review": "After several months with my Fire TV I must say I love it. As a Prime Member having access to all the free Prime content on my TV is great and I use it to watch Netflix several times a week", "verified": true, "helpfulness": "0/0", "author": "Steven A Poole"}, {"rating": 5.0, "review": "I had Roku 3 and found it a source of aggravation. Always had to unplug it then plug it back in to eliminate freezing on channels, videos, etc. It froze up so much for Amazon Prime Instant Video, Netflix, and Hulu Plus, I gave up on using it for those channels. I am quite pleased with Amazon Fire TV. Months ago I bought one for my daughter's birthday. I decided to buy one for myself after observing how well hers works. The movies on Amazon, Netflix, and Hulu Plus load up well, run without freezing, and look great. I love listening to my favorite music videos on YouTube and listening to music on Pandora, Tune-in and iHeart radio. The Voice Search feature works great too. Never played games much, but just placed an order for a game controller after checking out the gaming options on Amazon Fire TV. I am very pleased.", "verified": true, "helpfulness": "0/0", "author": "Friendly Bubba"}, {"rating": 5.0, "review": "I am not a technology savvy person.  I wanted something that I could use to turn the tv off and on, without having to go through our Wii, which kept eating batteries.  After a lot of thought, and review reading, I decided I love my Kindles enough to give it a try.  LOVE IT.  It was super easy to hook up, and even easier to use.  The kids are able to speak into the remote and find their selections.  I will say the remote is really small, so we have a rule to always leave it on the table.  It could easily get lost, but otherwise, love this.", "verified": true, "helpfulness": "0/0", "author": "johanna1366"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "konagirt"}, {"rating": 4.0, "review": "This is a great fun product with tons of features, I'm glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Ernesto"}, {"rating": 5.0, "review": "Love this technology.", "verified": true, "helpfulness": "0/1", "author": "Julie A. Palmer \"BellaMia711\""}]