[{"rating": 5.0, "review": "I like the idea of watching missed TV shows on my TV instead of the computer.  It is nice to be in an easy chair in my TV room instead of an office chair in front of my computer.", "verified": true, "helpfulness": "0/0", "author": "GPVanRoe"}, {"rating": 5.0, "review": "No wires just cast movies pc u tube easy to use wireless even a novice can use this. I lke it buy one works with google chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Wayne \"wayne\""}, {"rating": 4.0, "review": "It is great, if you are watching for a device to play Netflix and Youtube is great, it is not as simple as plug and play, so my parents needed assistance installing it.", "verified": true, "helpfulness": "0/0", "author": "Jorgelf"}, {"rating": 5.0, "review": "It is nice to be able to watch movie on the compute on the TV. It is a good picture and sound", "verified": true, "helpfulness": "0/0", "author": "Howard B."}, {"rating": 5.0, "review": "Great purchase. It was set up very quickly and i havent had any problems. Now im saying more words. haha", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 1.0, "review": "this thing could be great but it doesnt stay connected. it is so annoying. every time i try to connect it, there is so much headache in trying to connect. then it disconnects about two min after it connects. its just annoying!!!!!!!!!", "verified": true, "helpfulness": "1/2", "author": "A, M.D. \"AA\""}, {"rating": 4.0, "review": "Good product, but I rather attach my computer directly to my HDMI TV. Some people will find them useful when using devices without HDMI output such as smartphones or certain computers.", "verified": true, "helpfulness": "0/0", "author": "LARRY M."}, {"rating": 4.0, "review": "It was worth it works great I just don't use it a lot , I think it was well worth the money", "verified": true, "helpfulness": "0/0", "author": "dee"}, {"rating": 5.0, "review": "Installed flawlessly and works with my smartphone.Nice interface with Netflix.Wallpaper pics are super clear on my 60\" plasma!", "verified": true, "helpfulness": "0/0", "author": "Techie Man"}, {"rating": 5.0, "review": "Works great with iphone and android. You do have to plug in the usb power cable in order to function.  A+", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]