[{"rating": 3.0, "review": "A beautiful device. The voice recognition is flawless. BUT, my Pluto TV channel that I can get with the Fire TV Stick is not available on this. When I called Amazon they say that not all content is compatible with Fire TV. That is a big downer for me. The content is restricted by a) device b) address (country) c) actual location (IP address). If you live outside US, it is difficult to know what you will get and what you wont. For example, you can not get YouTube if you live in the caribean. This is true for the stick too but with a US address, the stick can get you YouTube.Until Amazon makes available Pluto and other channels I get with the stick, I am putting a hold on this and sending it back to the store!================= update =========================I managed to pair my BT keyboard and then headset. Now my BT keyboard is undone and even though it is recognized, the pairing fails. Also the doc claims that there is a System --> wifi option, but I dont see it. I see \"other networks\" where it asks me to identify the SSID. I still dont know how to use this at hotels where you connect through a web proxy.", "verified": true, "helpfulness": "0/1", "author": "The Inquiring Mind"}, {"rating": 4.0, "review": "Works great for video content and the voice search is very good. Unfortunately there's no way to voice search your music collection on Amazon's cloud storage and searching through it manually is cumbersome as it does not allow you to jump to a specific artist and you must instead scroll your entire collection.", "verified": true, "helpfulness": "0/0", "author": "Charles A. Tomaras"}, {"rating": 5.0, "review": "Truly AMAZON!", "verified": true, "helpfulness": "0/0", "author": "Juan Sanchez"}, {"rating": 4.0, "review": "We've been using a Sony DVD player to get Amazon Prime playlist  and Netflix.  We wanted Sling TV and saw that we could get that service through the Fire TV.  It's the difference between night and day.  The Fire TV dashboard is easy to use and content loads immediately. Getting easy access to Prime Music was a nice surprise.  We plan on getting on another unit for upstairs.", "verified": true, "helpfulness": "1/1", "author": "Raul R."}, {"rating": 5.0, "review": "Just get it already! you won't regret it.I used to have a raspberry pi running just XBMC/Kodi, but I got this because it can do that and other video services like prime video, Netflix, and HBOgo.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 2.0, "review": "I bought this mainly for using Plex in my home, will play but keeps freezing every 15 seconds, if you use Plex don't get this.", "verified": true, "helpfulness": "1/2", "author": "Greg"}, {"rating": 5.0, "review": "Its just excellent!!", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Absolutely fantastic I love my Amazon fire tv. I enjoy watching my shows without any commercial.", "verified": true, "helpfulness": "0/0", "author": "Feroze Baksh"}, {"rating": 4.0, "review": "Really like it.  Amazon prime + Netflix + sling TV = no more time warner", "verified": true, "helpfulness": "1/1", "author": "Josh Ellingsworth"}, {"rating": 4.0, "review": "My large TV doesn't have HDMI so I was disappointed to find out the a converter cable does not work as with the fire it is not compatible for conversion from HDMI to white yellow red.", "verified": true, "helpfulness": "0/3", "author": "Allan L. Smith"}]