[{"rating": 3.0, "review": "streaming from pandora is terrible , to slow to many breaks in signal.netflix works well.  web streaming with chrome add-on is ok but inconsistent", "verified": true, "helpfulness": "0/0", "author": "Stephen ward"}, {"rating": 5.0, "review": "I love being able to stream movies, music & youtube videos straight to my TV, freeing up my laptop while I work! I love this. (FYI...for troubleshooting...press & hold small power button on device for 65 seconds!) Thank you!", "verified": true, "helpfulness": "0/0", "author": "mako"}, {"rating": 4.0, "review": "Google needs to open device up to more developers. Current app list is too limited. Come on google! Don't be afraid. Let the device be awesome.", "verified": true, "helpfulness": "0/0", "author": "photorooster \"photorooster\""}, {"rating": 4.0, "review": "The product works flawlessly. It's just the amount of apps that can function with it sucks. The app capability needs to expand Beyond YouTube,  Netflix, And Hulu.", "verified": true, "helpfulness": "0/0", "author": "MarvinGumba \"MarvinGumba\""}, {"rating": 5.0, "review": "Yes, you can hook up a HDMI cable or possibly a USB, but only if you have all the equipment and your computer supports it, to watch movies and videos on your TV. This however makes the whole process a breeze, while only needing wifi. It's the \"Jitterbug\" of the technology right now.Pros:3 Simple Steps (including plugging it in)Easy as turning on the TV and pushing a button in video you're watching on your screenCan be used by friends and family to push content from their own phones, computers, straight to the screen (Perfect for putting videos and slide shows of all the Holiday celebrations)Cons:Not all sites are supported (Hopefully Amazon Prime TV here soon)No security on the device to protect it from pranksters putting different content on the screen other than having your own wifi (If it's password protected, only people on that wifi can access it.)Does not make your television a second screen to use with your computer. (It's not meant to be that, but I thought it was and want others to have a chance to understand it's just for videos and slide shows.)Overall 5/5, would buy again if needed and definitely would buy for that friend who is constantly watching all those Netflix videos from their laptop or phone. It's cheap, easy to use and I've used it just about everyday I've had it.", "verified": true, "helpfulness": "0/0", "author": "Garrett Thomas Gile"}, {"rating": 4.0, "review": "I like how it works but I feel not enough apps are able to use it yet.  I think in time I will be using it more but I still fall back on my Apple TV from time to time.", "verified": true, "helpfulness": "0/0", "author": "Salty"}, {"rating": 4.0, "review": "Since buying my Chromecast a few days after its release, I have been extremely happy with it. It does exactly what is says on the box. It's really convenient if you like to watch youtube, Netflix, Hulu, or now HBO on your TV and you have a \"dumb\" TV. You can manipulate it to play your own videos by dragging them into your Chrome browser, but if that is something you want to do often DO NOT BUY THIS. Often times it doesn't work very well. Streaming from non-hromecast supported websites is also hit or miss. The best part about this little dongle by far is being able to completely control it from your phone, tablet, or computer. It can take forever to navigate through videos with a remote. With this I just take out my iPhone, find the video I want, and then it starts playing on my TV and my phone is the remote.Bad-ish stuff: My Chromecast will occasionally stop working. Sometimes I just need to restart my router, but others I have to do a hard reset and completely set it up again. Luckily it doesn't take long to do either way. So if you're not willing to do this occasionally, go for something else.", "verified": false, "helpfulness": "0/0", "author": "Dana S."}, {"rating": 4.0, "review": "For what google designed it for it works perfectly.For 35 dollars it is hard to beat the price and the Amount of programs for being brand new", "verified": true, "helpfulness": "1/1", "author": "Dieseldude"}, {"rating": 5.0, "review": "This is the easiest way to play Youtube on your TV.  In addition, if you own an Android phone, you can stream your music from your phone to the Chromecast.  This works with Google Play and Youtube, not sure about other services.  It seems to work by telling the Chromecast to start/stop streaming, not actually broadcasting from your phone.  This is a good thing as it doesn't wear down the phone's battery.You can also broadcast a browser on your computer to the Chromecast if you are using the Chrome browser, and have the extension installed.", "verified": true, "helpfulness": "0/0", "author": "Mr_Engineer"}, {"rating": 1.0, "review": "We have a Roku (wifi streaming) box and a DVD capable of getting wifi.  The latest version of Roku isn't capable of supporting YouTube (unlike version 1) and now we understand why -- Google planned products of its own.  So we bought a Chromecast: it does precisely one thing that Roku doesn't -- display YouTube videos, though it is often painful to do that.The Chrome browser offers links to several services, which don't work.  Click on \"Pandora\" and nothing happens.  To get \"Netflix\" to work, you'll end up logging into Netflix (the Chromecast link equally doesn't work) and linking it via the arcane Chromecast links hidden in some icon -- something that we'd already done on the Roku, so was just a PITA.In addition, we experienced frequent hanging downloads on YouTube.  Often you have to relink a web page to the Chrome browser, most often when they aren't \"sponsored\" pages, making you suspicious about Google's content management.", "verified": true, "helpfulness": "0/1", "author": "Andrew Czernek"}]