[{"rating": 4.0, "review": "I bought this as a gift for my boyfriend, but I think I like it more than he does! I really like that I can use my phone as a remote. Having an android phone will allow you to do more things with this, but iPhone works for Netflix too.", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 5.0, "review": "Your friends will think you are some kind of wizard when you start shooting things on your t.v with your phone.But they will never know... ;)", "verified": true, "helpfulness": "0/0", "author": "Anthony Reyes"}, {"rating": 3.0, "review": "It's just worth 35 bucks.. not 50. Works great with youtube. But nothing else is as good. With older laptop the casting video is a painful experience (but mirroring a website is just fine). In addition it does not work with corporate laptop, as antivirus on the work laptop will block it. Finally it only works on 2.4 Ghz. So if you don't have a dual mode router, you have to configure the router to 2.4 Ghz only, that means lyou won't get benefit of 5.0 GHz if your mobile device supports it. Google needs to improve a bunch of things on this device, but one thing is certain you will have the best Youtube experience with this device. If you watch Youtube a lot, it's worth the money for sure.", "verified": true, "helpfulness": "0/0", "author": "Subhajit Dasgupta"}, {"rating": 4.0, "review": "I wasn't sure what to expect from this little device when I purchased it.  For the price you can't go wrong.  Picture quality is clear and device works as advertised.  I am hoping in the future more apps will work with it.  For now I will stick with the few apps that do work with it.  Setup was quick and easy.", "verified": true, "helpfulness": "0/0", "author": "Rex"}, {"rating": 5.0, "review": "At this price it's fairly hard to beat.  It's an excellent companion to Netflix.  A winner!  Well done Google!  I tip my hat to you.", "verified": true, "helpfulness": "0/0", "author": "Best Cherry Pie"}, {"rating": 1.0, "review": "Struggled to figure out why it wasn't connected to my wifi.  Watched one episode - now gone again!  Apple TV still available on my network but NO CHROMECAST. Garbage. 100 % Garbage.", "verified": false, "helpfulness": "0/1", "author": "45Viking"}, {"rating": 5.0, "review": "I liked how easy it was to use and setup. I would recommend this highly, and I will probably by more.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "easy to install and to setup.It needs more compatible apps though ; going through Chrome browser is not the most convenient.Works well with iPad for which apps number is growing. With Windows 8.1, it is a pain to use it ; going through Chrome browser is needed most of the time.", "verified": true, "helpfulness": "0/0", "author": "Christian B."}, {"rating": 5.0, "review": "Love it for putting Netflix, Youtube and other non broadcast items on my TV.  Get this it's super!  You won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "Pete Connolly"}, {"rating": 3.0, "review": "There weren't that many options for the chromecast when it came out.  And now even tho many apps have caught up and are offering the option to stream, the reliability is still suspect.  Halfway while playing it can just disconnect.  In addition if you use plex or even just get a video with AC3 or DTS you can't get any 5.1, it all goes down to 2.0 channels...  They keep saying in the future but... but here is the catch, the device is awesome, for 35 bucks and being able to throw up a browser tab is indispensable!", "verified": true, "helpfulness": "0/0", "author": "Thomas Aldershof II"}]