[{"rating": 3.0, "review": "Device works as intended. Downloaded a twitch.tv app for watching twitch streams on my tv and I loved it so much. Between youube+netflix+twitch I was all set. The twitch app randomly stopped working. I even went as far as completely factory resetting my chromecast and trying it on a different network/tv setup - the chromecast just doesn't do the twitch app now. What the heck, I thought - however the chromecast failed to deliver a response that answered the question I shouted at it. To this day I have been casting chrome tabs to my tv with twitch streams in them just to watch twitch on tv and I'm absolutely NOT paying for xbox live gold for the sake of utilizing free services on my tv. I am slightly annoyed, however the chromecast is still dope nonetheless. Meh.", "verified": true, "helpfulness": "0/0", "author": "evanjam"}, {"rating": 4.0, "review": "I do honestly like this. It's very user friendly, but admittedly it gets usedmore often as a screensaver. I'll turn to this when I'm planning to use features of my smart tv, since my tv will only use a bar across the bottom of the screen. I would still recommend it for its many advertised uses.", "verified": true, "helpfulness": "0/0", "author": "yiota"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "juan lucano"}, {"rating": 1.0, "review": "soooo disappointing. The image is jerky and I have to relaunch it from my computer all the time. I was so excited when I got it :( the image quality is very poor and sound is delayed. awful.", "verified": true, "helpfulness": "0/1", "author": "regine_r"}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "JEAN RAYMOND"}, {"rating": 5.0, "review": "I love this little gadget, so far it's performed great. I definetly would recommend this little item. It did take me a minute to get it setup, but I suspect that most of my problem was me, I did get setup, and I love it, especially for the price, you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Connie baker"}, {"rating": 5.0, "review": "Very convenient for watching Netflix or casting the browser on a laptop.", "verified": true, "helpfulness": "0/0", "author": "scubabeer \"scubabeer\""}, {"rating": 5.0, "review": "I recently purchased the chromecast (refirbished), I purchased it from ocean reef, I received it quickly. I had a little bit of trouble getting it set up, which I'm sure was mostly my fault, anyway I did get it set up, & I started streaming from netflix right away without any difficulty, I watched several episodes of different programs, and it was flawless. I was looking for other video apps,  like hulu, and some of the others when I came across the Tv portal chromecast app, I have used the Tv portal app on another tablet, as well as my phone, I was so happy to see the Tv portal app for chromecast, Tv portal has a huge selection of movies, and Tv shows, it would take forever to watch everything on this site, as they are continuously adding new shows, they even have movies that came out earlier this year, and the best thing about tv portal is, you can upgrade to Tv portal premium for only $2.99,  that's all, no monthly charge, and you don't have to renew every year, just the initial $2.99, I set it up on my phone, as my kindle doesn't seem to want to accept the Tv portal chromecast app, I have just the Tv portal app installed and it works fine but just won't accept the app with chromecast, no big deal. So far I'm really enjoying the chromecast, it meets my needs, and once set up it's easy to use, now all I have to do is explore more video streaming apps. Hope those of you who. choose yo purchase the chromecast", "verified": false, "helpfulness": "43/53", "author": "Connie baker"}, {"rating": 3.0, "review": "It's alright. The price is great but we've had several issues with casting from laptops using different operating systems. We don't have the latest and greatest laptops so I'm not sure if them being outdated has anything to do with it. The idea is great and works well over the home wifi network. I do wish that the item came with a remote control where you could just pull up an app using the remote and not your phone or tablet. The product is good I'm just not the biggest fan.", "verified": true, "helpfulness": "0/0", "author": "Michael J."}, {"rating": 5.0, "review": "very useful for youtube commanded from my android tablet", "verified": true, "helpfulness": "0/0", "author": "Nomo"}]