[{"rating": 3.0, "review": "Inconsistent connection to source.  Gets very hot when charging.  Setup complexity seems excessive.", "verified": true, "helpfulness": "0/0", "author": "Solaris Lover"}, {"rating": 5.0, "review": "Chromecast = cheap=awesome casting from almost any source these days.I use it mostley for casting youtube and videos from my smartphone .", "verified": true, "helpfulness": "0/0", "author": "giiker"}, {"rating": 3.0, "review": "Very inexpensive for getting internet aps to TV. I was hoping to get my charter television to stream from computer to TV. I'm sick of paying $6.99/box and i need one to access my cable channels. I tried with the apple tv Mirroring and it is not allowed with the charter website? I really don't want to have to buy a droid tablet but that might be my next option if I can't stream.  Is Google going to do an ap where I can get news streamed? Today show?. Luckily it was $35 and I can use for hulu plus and pandora", "verified": false, "helpfulness": "0/0", "author": "Patricia"}, {"rating": 5.0, "review": "What can I say....it's great!", "verified": true, "helpfulness": "0/0", "author": "DEM"}, {"rating": 5.0, "review": "Love it!  Easy to set up and easy to use!", "verified": true, "helpfulness": "0/0", "author": "alma"}, {"rating": 5.0, "review": "As described, fast shipment", "verified": true, "helpfulness": "0/0", "author": "secret"}, {"rating": 1.0, "review": "I CANT SET UP  THIS THING", "verified": true, "helpfulness": "0/1", "author": "mohammad"}, {"rating": 3.0, "review": "The concept of Chromecast is fantastic, filling in a need that I did not even realize in the past. My friend wanted to project the content from her Android Nexus 7 tablet to the big screen, and Chromecast happened to fit the bill. I wasn't the first mover to buy Chromecast, but I am very grateful that by the time I made the purchase, Google happened to release the screen casting feature (Android only... iOS is not supported, and most likely won't ever be supported).The screen cast feature in Chromecast works almost like a miracast, except with very little to no latency. However, throughout my use with Chromecast I see two major design issues, and these two alone prevent me from giving it a full five stars.First, the Chromecast is not dual-band based, and it does not support 5.0 Ghz band. Thus, unless you have the Chromecast very close to the base station, it is very hard to get Chromecast to work at all (YouTube/Netflix/Screen Casting would fail with almost zero success rate). The current workaround is to buy a long HDMI extension cable that allows me to bring Chromecast closer to the WiFi base station, and at the same time outputs to the big screen in the living room.Second, the Chromecast demands direct Internet access, because every time you perform an action with Chromecast, it \"has\" to download web app from Google server directly. This requirement applies to even Screen casting, and that alone limits quite a bit of usefulness. For example, you can not bring Chromecast to a business conference, and expect to project your presentation to the big screen via Chromecast without Chromecast connecting to a working WiFi.", "verified": true, "helpfulness": "0/0", "author": "A. WU"}, {"rating": 5.0, "review": "I love this. turned my dumb LCD TV into a smart TV for $35.00. now I can stream my Netflix movies and see them on a 60\" screen rather then a 22\" computer screen. I tell every one who wants a smart TV but dose not want to replace their current LCD TV to buy it.", "verified": true, "helpfulness": "0/0", "author": "Brian Lee Wood"}, {"rating": 5.0, "review": "I LOVE LOVE this.  I can sit on my couch and watch youtube on my big screen.  Or, I can use my phone to scroll through photos on my phone and show them to a big group while they display on my HD bigscreen.", "verified": true, "helpfulness": "0/0", "author": "David Anthony"}]