[{"rating": 4.0, "review": "Could be smaller. Sticks out the back of the tv and stops the TV from being as flush as it should.", "verified": true, "helpfulness": "0/0", "author": "NorCalBen33"}, {"rating": 5.0, "review": "Got this for my mother to stream from her Chromebook to her TV. So easy to use for streaming Netflix or YouTube from most any device, but I highly recommend it to anyone who uses a Chromebook. My mother enjoys looking at Facebook photos, etc streamed to the big screen TV so she can see them better. Just a great bargain for what you get!", "verified": true, "helpfulness": "0/0", "author": "Linda G."}, {"rating": 5.0, "review": "Great connection. No lagging and perfect sound.", "verified": true, "helpfulness": "0/0", "author": "Sergio M.Tellez"}, {"rating": 3.0, "review": "Doesn't stream well with wireless devices or in HD.", "verified": true, "helpfulness": "1/1", "author": "Bradley M Turner"}, {"rating": 1.0, "review": "It needs a constant internet connection to work so of you don't have access its a $35 paper weight", "verified": false, "helpfulness": "1/1", "author": "thomas"}, {"rating": 5.0, "review": "This is an excellent tool for streaming! It's a nice addition to my Roku box without having to pay for additional cable from Comcast.", "verified": true, "helpfulness": "0/0", "author": "Sandra Mcdermott"}, {"rating": 4.0, "review": "Not perfect but easy", "verified": true, "helpfulness": "0/0", "author": "Anna Rhea"}, {"rating": 2.0, "review": "Google should be ashamed.  Google boasts that this device is compatible with Android phones and tablets, it is not except for a few models.  You cannot even cast video from the Google Chrome browser on an Android device. Google's own browser on an operating system they control cannot be used to control this device.  Go figure.When I control this unit from my PC (Chrome browser) the video is very choppy and unreliable.  I'm sticking with the Amazon Fire TV Stick which has been FLAWLESS since purchased.", "verified": true, "helpfulness": "0/0", "author": "J. Price \"Movie Buff\""}, {"rating": 4.0, "review": "Too bad Amazon and Google have to be competitors. I just want a world where I can stream content from google and from amazon on the same device.... in the form of a $30 dongle... some day....", "verified": true, "helpfulness": "0/0", "author": "TooCool4School"}, {"rating": 5.0, "review": "I love this little thing. Other people have done a better job reviewing it than I can, so I won't try to repeat what they have said. The only problem we have encountered is that streaming regular videos from a Chrome page (not Youtube, etc.) doesn't work very well. There are breaks in the video and audio.", "verified": true, "helpfulness": "0/0", "author": "Anthony W."}]