[{"rating": 5.0, "review": "Awesome! Works perfectly! except for chrome on iOS doesn't have option to cast (at least not yet) I plan on getting more for my other rooms in my house.", "verified": true, "helpfulness": "0/0", "author": "Nicolo"}, {"rating": 1.0, "review": "The description of the product on amazon site says compatible with smartphones and iPhone and iPad, but it is not, it have very limited support, you can cannot screen cast your screen. Please update the product description with proper information. Waste of time and money.", "verified": true, "helpfulness": "1/1", "author": "Varouj"}, {"rating": 1.0, "review": "Sounds easy to set up.  I have a standard Apple WiFi network in my house.  It does not connect to the network.  Google's troubleshooting ideas are unintelligible and completely unhelpful.  I am sending it back.  Very frustrating experience.  Google needs to learn from Apple on how customers like things to work without requiring advanced knowledge of computers and networks.  .", "verified": true, "helpfulness": "1/4", "author": "Product review"}, {"rating": 2.0, "review": "When it works, it's great.  But I would look for an alternative device.  Here's my issue, I've had the Chromecast for a little over a year - it'd freeze up periodically after watching Netflix, but that was an easy fix because I'd just unplug it and plug it back in and it'd work.  Recently though, either Netflix or Chromecast did an update and now it's no longer compatible with my phone.  There's no fix, both websites say buy a new phone.  That to me is unfair.  I bought the device in good faith expecting it to work.  It did, for a year, but now it doesn't and they say it's on me to buy a new phone.  So, do yourself a favor, get a Roku.", "verified": false, "helpfulness": "0/0", "author": "Kurt Baringer"}, {"rating": 5.0, "review": "Was going back and forth on deciding what to get - Apple TV or chromecast. So glad i got chromecast. Cant beat the amazing deal I got, and does everything i want. can play songs, videos from my laptop, tablet or iphone. super happy!!!! The screen sharing feature is great, cause you can now play anything on you laptop, or browse thru pic and mirror the entire screen onto the tv!", "verified": true, "helpfulness": "0/0", "author": "SR"}, {"rating": 2.0, "review": "This is basically an expensive wireless cable. The first thing I noticed is that when you use it with your phone it doesn't go full screen, which is disappointing. It only uses a small portion of the screen and Netflix doesn't want to show on the screen at all, I tried everything. I think you're better off with a long micro or mini USB to HDMI converter!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I bought this device primarily to stream Netflix and You Tube to my tv.  It replaced a Sony media player withat poor WIFI reception a poor interface with Netflix.  I was hoping to use it to cast music on my android devices to my TV suround system.  I downloaded several apps that indicated that they could do this.  They all failed apparently because Chromecast will not read wma formatted files which were created with windows media player.  They still played fine on all my android devices, but the audio won't cast.  Apparently Google did not make chromecast with the ability to accept wma files which I find a surprising oversite.  Therefore I've downgraded the usefulness of chromecast since it won't read this common format.", "verified": false, "helpfulness": "0/0", "author": "ck18238 \"Carl\""}, {"rating": 4.0, "review": "With a wireless extender in my home network, chromecast was plagued by incessant buffering, disconnections and crashes, especially with HBO GO. I didn't think it was a wireless network problem because wireless video streaming with other devices (Roku streamers, phones, computers) worked fine. However, as soon as I unplugged the network extender, video worked perfectly on the chromecast: no buffering pauses, even with HBO GO.", "verified": false, "helpfulness": "0/0", "author": "Mark H. Whitnall"}, {"rating": 1.0, "review": "This thing is so frustrating. I can't watch an hour of shows without having it freeze and require a hard reset at least once. At first I thought it was just that the HBO app sucked, but it does the same thing with Netflix. You get what you pay for.On the upside, it does have very pleasant images it puts on the screen while nothing is playing. It helps sooth my frustration over how much it freezes", "verified": true, "helpfulness": "1/1", "author": "Ethan"}, {"rating": 2.0, "review": "Works well for netflix, but I can't watch any of my amazon videos or listen to Spotify. Wish I could return it! Kind of a bummer and disappointment. Should have gone for Roku.", "verified": true, "helpfulness": "0/0", "author": "Rclark"}]