[{"rating": 5.0, "review": "GREAT PRODUCT LOVE HAS FAST IT DOWNLOADS EVERYTHING.", "verified": true, "helpfulness": "0/1", "author": "W. WOODARD"}, {"rating": 5.0, "review": "Simple easy setup.  Voice command is a great feature.  Good way to avoid monthly cable charges.  Not as much free viewing options as I anticipated, but a Netflix subscription solved that.", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "Amazon you done it again great item!!", "verified": true, "helpfulness": "0/1", "author": "Charles & Karen"}, {"rating": 5.0, "review": "works as advertised", "verified": true, "helpfulness": "0/1", "author": "Duncan"}, {"rating": 3.0, "review": "Not enough free content..  Even the very old content has a fee to view and a lot of it can be found on TV.", "verified": true, "helpfulness": "2/2", "author": "GCS \"thebear\""}, {"rating": 1.0, "review": "Even with high speed AT&T; Uverse will not connect to net for movies, giving message download not fast enough. If Uverse isn't then what is? Great for looking at photos, but that's about all it's good for. Returning", "verified": true, "helpfulness": "6/7", "author": "meoff"}, {"rating": 4.0, "review": "I like the ease of set up and selecting videos.  But buyer BEWARE, some videos that you think are free with prime are not.  My wife and I watched an entire season of Treme without a charge, but when the next episode up was a new season and we watched it, I was charged.  No indication on the Amazon Fire TV that there was a charge.  I checked on line later and saw that the new season did have charges, but I am not happy that I have to go on line with a different device to check before watching a show.", "verified": true, "helpfulness": "1/3", "author": "John E. Stevenson \"orange\""}, {"rating": 5.0, "review": "The item came promptly and was easy to open.  Connected it to the TV and turned it on.  After entering the Wifi password, the menu came up immediately and was able to access my videos.  No problem installing apps and configuring them.  I even tried the voice search and it went to exactly what I asked for.  A very nice streaming device.", "verified": true, "helpfulness": "0/0", "author": "docpsifi"}, {"rating": 1.0, "review": "Dear Amazon, I bought your device not because I want to play Android games on my TV (because who does?!), but because I pay you a buttload (actual unit of measurement, look it up) of money for my Prime membership and because I also pay Netflix and HuluPlus and a variety of other services a monthly fee. I chose your appliance because it offered everything I subscribe to and your marketing emails told me I would get the most out of my Prime membership with a Fire TV. What a dupe I am. Why is it that I can never connect to the \"other\" services you obviously knew I used (as I write this I am watching HuluPlus on my laptop because I can't connect on my Fire (and, yes, tech support it is connected to the internet... I can stream all my Instant Video content, except HuluPlus))? Why is it your crap device overheats and reboots on a regular basis? I am toggling back to my AppleTV now, I will keep you around until my Prime membership expires, and I probably won't even renew that.", "verified": true, "helpfulness": "5/8", "author": "Glen"}, {"rating": 2.0, "review": "I returned it after the first day. I have Amazon Prime and a Roku 3 and wanted a steaming device to watch prime on my other TV.I have a slower internet connection but the Roku streams just fine however the Fire TV kept buffering to the point it was unwatchable when streaming prime, also the blue tooth does not support a wireless headset. The Roku has a much more intuitive interface, loads of apps the Fire does not yet have, and a headset jack in the remote. The fire TV does have a voice search feature that works well with Prime but as I see that may be its only redeeming value.", "verified": true, "helpfulness": "1/2", "author": "Shane Boor"}]