[{"rating": 4.0, "review": "Works well. Voice search seems to only work for Amazon content. If that worked for all apps it would be 5 stars. Without voice recognition or a keyboard entering text to search is slow and painful.  It's an improvement on the built in apps for my \"smart\" Visio TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am totally happy with this purchase. Unfortunately, I missed the special Amazon offer a few weeks back and paid the full $99 for it, but I have no regrets--it is well worth the price. It was very simple to learn and I was able to set it up with ease. I mapped it to my network and added PlexPass and Amazon Cloud as well. It didn't take much time to get it all working ...I would say I was fully operating within 15 - 20 minutes and this was mainly because I had to pull out my entertainment center to run and connect the cords.  It was great looking at all my pictures that I dumped in the cloud on a full size TV screen!  It is uniquely compact (both the box and remote).  I love the voice activation on the remote and the remote's signal is excellent.  Everything works absolutely great!  You can call out your favorite movie stars or the name of your favorite movie or TV show and BOOM--there it is instantly.  I absolutely love my new toy.  I watched shows and movies all day.  The picture comes in crystal clear too!With all of this said, I can't think of a single con to say about it, thus I gave it a full 5 star rating!  Amazon hit this one out of the Park!!!  I am already thinking about adding a second box in my home.", "verified": true, "helpfulness": "0/0", "author": "Raymond \"Ray\""}, {"rating": 4.0, "review": "While built with solid technology things that still need work are : 1- all games/apps from a kindle tablet should be easy to sideload by simply syncing the already sideloaded apps... and 2-ANY DUAL ANALOG GAME NEEDS FULL CUSTOMIZATION where you can remap controls as you need.Obviously this is a primarily SOUTHPAW / lefty problem as we use the left stick to look and the right stick to walk making a,b,x and y on the wrong side of the controller as if the actual dpad was swappable functionality wise with the face buttons everything would be great.I already game with my true SOUTHPAW on 360,one,ps3 and 4 no game offered what I needed so I made UP my own custom control scheme as between not being able TO play anything or everything it was easy I chose everything.Amazon NEEDS to support FULL PROFILE CUSTOMIZATION so I can use my own custom control scheme on everything DUAL/twin stick .", "verified": true, "helpfulness": "0/0", "author": "phoenix \"only left handed people are in their right minds!!\""}, {"rating": 5.0, "review": "It has met all of my expectations.  However, now there is an Amazon Fire Stick for half the price?  I'm disappointed that I spent twice as much money on something that one week later is obsolete.  I hadn't even heard of the Amazon Fire Stick until they started selling it.  I would have purchased the less expensive stick instead of the full Amazon Fire TV.  Hopefully Amazon Fire TV does more than just the Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "mGoulais"}, {"rating": 4.0, "review": "Nice device.  Streams really well.", "verified": true, "helpfulness": "0/0", "author": "Cary"}, {"rating": 1.0, "review": "Plugged in in and it nearly blew out the speakers on my set with a burst of static. Couldn't get it to work at all. I have a chromecast and that has worked perfectly since the moment I plugged it in. I keep giving amazon electronics a chance. They keep letting me down.", "verified": true, "helpfulness": "1/7", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Only giving it 3 stars because of the poor app support it has at the moment, and also because amazon offers the apps, on the kindle and others but not on this.??? Doesn't make sense.It was also said Amazon was going to work on this issue since the release date, and I waited this long. However I see no improvements yet. I guess I will just keep waiting.Everything else with this machine Works, Fast, Easy to use, Quality machine other then its main purpose...When this is fixed I will give it 5 stars.And yes I would recommend this device, if you can find out if the apps you want will be available on it.", "verified": true, "helpfulness": "0/0", "author": "Fausto Antonio"}, {"rating": 4.0, "review": "Very easy set up. However while surfing the options, I accidentally bought a TV episode. I thought that with my free month of Prime that I wouldn't pay for shows. I think I might just stick to watching things on YouTube. My goal was to drop cable, but that hasn't happened yet.", "verified": true, "helpfulness": "0/0", "author": "Bonita Peter \"pr lady\""}, {"rating": 4.0, "review": "LOVE IT, EASY to use and understand :)", "verified": true, "helpfulness": "0/0", "author": "Amy Harrison \"Daphpin\""}, {"rating": 5.0, "review": "Love my amazon fire tv!!!!", "verified": true, "helpfulness": "0/0", "author": "Danny Hernandez"}]