[{"rating": 5.0, "review": "Good chromecast for my kids room", "verified": true, "helpfulness": "0/0", "author": "Misael"}, {"rating": 2.0, "review": "I know we cannot compare this with Apple TV, but after using Apple TV this just seems like a downgrade and unsatisfactory. Got this for our second TV, serves the purpose", "verified": true, "helpfulness": "0/0", "author": "Husain"}, {"rating": 5.0, "review": "Very very good", "verified": true, "helpfulness": "0/0", "author": "yahia areshi"}, {"rating": 5.0, "review": "Excellent playback quality and super easy to use. The most complicated part was trying to figure out my WIFI password, which has nothing to do this device, just user amnesia.  After that, it sets itself up in just a few minutes. It doesn't even make me change the input method, it does it all by itself when I go to cast! Very user friendly! I use this primarily for Netflix (streaming only) and I occasionally use Google Play for renting new release movies. It works very well with the apps it says it does, and it works easily from either my phone or laptop.  I like how it captures the content itself rather than playback through the device, so I can start playing and still use other apps on my phone. The playback quality is comparable to my Android and is definitely superior to my laptop.  Goodbye HDMI cables!!!  Goodbye hesitating, choppy video and that swirling circle in the middle of a scene!  In response to some of the negative comments, it works as advertised.  1. It doesn't work for things it doesn't do, and it doesn't have a remote. If you want a Roku, buy one.  This is not a $30 replacement for a $75 Roku. It also doesn't double as a microwave or charge a dead car battery. 2. It needs WIFI.  It doesn't work on a phone data plan. For me this is a positive and it probably is for anyone who pays their own phone bill.  Streaming video on a mobile data plan is insanity, and Chromecast is sane.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Rebecca G."}, {"rating": 5.0, "review": "I love this product!", "verified": true, "helpfulness": "0/0", "author": "weelad"}, {"rating": 5.0, "review": "Love it didn't have to spend more money on a cable box for my daughter I just put this in her tv and she watched all the on demand from the laptop dhe,wanted", "verified": true, "helpfulness": "0/0", "author": "kizzy smith -payne"}, {"rating": 1.0, "review": "When using the Netflix app...do your shows play continuously?", "verified": false, "helpfulness": "0/1", "author": "Eryn Gossner"}, {"rating": 4.0, "review": "I really enjoy watching movies from YouTube and Netflix using my phone. The movies and sound are incredibly clear.  I'm excited about using it with other programs.", "verified": true, "helpfulness": "0/0", "author": "Karen Zortman"}, {"rating": 5.0, "review": "I requested the Chromecast with a card saying happy birthday but it came without the card :-(", "verified": true, "helpfulness": "0/1", "author": "estefirv"}, {"rating": 5.0, "review": "Good service, fast deliveryVery good product & easy to use", "verified": true, "helpfulness": "0/0", "author": "dt"}]