[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 5.0, "review": "Cheap and effective! This is great for sharing videos, pictures, a computer screen onto your tv. It's easy and works well. Also with new apps there's access to netflix and many more service as well as chromecast games! The games are fun and improving slowly to have fun multiplayers games, by downloading the app on a smart phone.", "verified": true, "helpfulness": "0/0", "author": "hellocow"}, {"rating": 4.0, "review": "Chromecast is pretty sweet. Plug it into your TV, use an app to cast to your TV and you're watching pretty much anything you want. The setup was quite easy and overall, the experience has been smooth. I have had issues casting my Netflix to Chromecast, which is one of my most used apps. However customer service provided me with a work around and things have improved. Well done Google!", "verified": true, "helpfulness": "0/0", "author": "Chad M. \"The History Buff\""}, {"rating": 5.0, "review": "Hard to believe I ever lived without chromecast. It's just a function of our house now. If you're really tech blind just get your kid to set it up.", "verified": true, "helpfulness": "0/0", "author": "The Whitchking"}, {"rating": 4.0, "review": "works as indicated and simple to set up and use", "verified": true, "helpfulness": "0/0", "author": "JVH"}, {"rating": 5.0, "review": "I love Google, I love Chromecast. I can cast my Chrome browser, and other videos right to my huge TV from my phone, it is great.", "verified": true, "helpfulness": "0/0", "author": "Jill Knazur"}, {"rating": 3.0, "review": "While the concept is great, and I’m going to keep it for possible future use, I found that Chromecast is pretty pointless in my house. We are an apple family, and you just can’t do much with Chromecast with an apple device. I should have researched it a bit more before buying. I didn’t realize that you can’t “mirror” with an iPhone, iPod, or iPad (all of which I have). You can cast from the normal apps (Netflix,  YouTube….ext. but I can already get these on my tv and don’t need the Chromecast to do it for me) however you can’t just mirror a webpage or app. This is what I wanted Chromecast for. I have several exercise apps that I wanted to be able to watch on my TV rather than the small screen on my phone. So I have had Chromecast for two weeks and have yet to use it. But like I said, I will keep it just in case. It wasn’t expensive and maybe I’ll find a use for it later.", "verified": true, "helpfulness": "0/1", "author": "Patricia V. Evans \"pvevans\""}, {"rating": 4.0, "review": "Does the job at a good price.", "verified": false, "helpfulness": "0/0", "author": "Joel A."}, {"rating": 5.0, "review": "Great little caster! Works great on both Android and IOS, My favorite part is you can show your pictures on your TV as a screen saver. Great deal for the money.", "verified": true, "helpfulness": "0/0", "author": "zatchu"}, {"rating": 3.0, "review": "Much better products out there today, should have gone with a fire stick.", "verified": true, "helpfulness": "0/0", "author": "Daniel S."}]