[{"rating": 5.0, "review": "I really like that I can now stream youtube and HBOGO from my devices to my tv and the quality is awesome!", "verified": true, "helpfulness": "0/0", "author": "crazkid4eva"}, {"rating": 5.0, "review": "The Chromecast is still a rather new device, and Google is still updating the API for developers to use. We'll see a lot more support as time goes on. We use ours primarily for Netflix. We also have an IP camera that we use as a baby cam on our computer. We can stream the camera straight to the Chromecast as well.Hulu Plus is now supported along with Pandora and a bunch of other apps. We've got two and recently gave one as a gift. It's great if you only use it as a netflix streamer, but as more apps support it there will be more and more uses for it. All I need is Amazon Instant Video support and I'll be good to go!", "verified": true, "helpfulness": "0/0", "author": "M. Sirchuk"}, {"rating": 5.0, "review": "this is a great product.  it was delivered as promised  i will recommrnd to friends.  I'm sure others would be happy to know about this product.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline E. Washington"}, {"rating": 3.0, "review": "I was mislead by the advertising on this product on TV.  You are only able to stream YouTube or Netflix and we don't watch YouTube and we no longer have Netflix.  We have Amazon Instant Video now instead so this product didn't help us out at all.  Great idea but just didn't work for what we wanted it for.", "verified": true, "helpfulness": "1/1", "author": "S. Bilderbeck \"B & B's Mom\""}, {"rating": 2.0, "review": "Product has lot of limitation e.g. you cant change the network without factory resetting. I took it with me on trip and it doesn't work on hotel networks. Also when casting tab, laptop is useless because it takes over all of CPU cycles. Only streaming option that works is 480, very poor quality.Chromecase needs wifi. you cant even set it up if there is no wifi for chromecast. if PC is able to connect to wifi and chromecast cannot it should still allow casting tab but it doesnt.Only useful option is if you are playing from youtube or netflix. Google needs to learn from Apple how to produce Quality product.", "verified": true, "helpfulness": "0/0", "author": "Manoj K Agrawal"}, {"rating": 3.0, "review": "Not completely satisfied probably because we did not do enough research beforehand. The Chromecast unit will not bring up Amazon Prime movies or other \"competitive\" and popular products. It is very limited as of now and I'm sure there will be additional charges to receive any future competitor's line. Bottom line \"VERY LIMITED PRODUCT\"!", "verified": true, "helpfulness": "1/1", "author": "Ricko"}, {"rating": 5.0, "review": "Don't waste your time buying a smart tv, this does the same thing onlymuch much easier and faster!!!Works great from our ipod and iphone!Takes a little bit of tech know-how to set up but worth the time.Cons..... do not buy if all you have to play from is Ipad 1, this does not supportios 5!", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Gave up trying to set up the Chromecast with my Galaxy Note II. Tried multiple times. Installed first time using my Google Nexus Tablet. When I switched to T-Mobile it connected with no problem.", "verified": true, "helpfulness": "0/0", "author": "R. D. Byrne"}, {"rating": 5.0, "review": "Good idea for chrome to have this - considering the multitude of like offerings from other companies.  Maybe the chrome notebook/laptop can have this built in?", "verified": true, "helpfulness": "0/0", "author": "lyle stewart"}, {"rating": 5.0, "review": "I love this thing because it is so tiny. I guess only complaint is that I can't stream anything locally for free and idk if you ever will. You can stream stuff from a chrome browser and I am cool with that.", "verified": true, "helpfulness": "0/0", "author": "Ridonkylous"}]