[{"rating": 5.0, "review": "Absolutely love this little device. I use one of these with any of our TVs that are not 'smart' TVs (with integrated apps and wireless and what not).  And because it is so easily portable (just need the HDMI and USB connection, or a long enough cable to reach an outlet in lieu of the USB connectionI can also move it around with me to any room if guests are in town or whatever. I can also take this with me while traveling!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Totally worth the money; we used it every day.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I like my Media Player!", "verified": true, "helpfulness": "0/0", "author": "Cori M"}, {"rating": 5.0, "review": "Would like a few more options though", "verified": true, "helpfulness": "0/0", "author": "Ed Reich"}, {"rating": 4.0, "review": "Works with my iphone 5s to stream various apps to my Sony TV. Can't get it work with Dishanywhere though...", "verified": true, "helpfulness": "0/1", "author": "occasional buyer"}, {"rating": 1.0, "review": "Easy to set up but very little to use except Netflix and youtube.  Another disappointing product from Google.  They seem to be coming up with new technology that's not cutting edge but rather sales gimmicks.", "verified": true, "helpfulness": "2/3", "author": "Paul Kottler"}, {"rating": 4.0, "review": "It was easy to set up, and my tablet connected to my television quite quickly. It was a good purchase.", "verified": true, "helpfulness": "0/0", "author": "Etai"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Danny Blair"}, {"rating": 5.0, "review": "Talk about convenience!I LOVE this device.When our PS3 died, my kids were more upset about losing access to Netflix on the TV.Installed the Chromecast, Showed my 5 year-old how to use it once and She hasn't had any trouble since.And they keep releasing more and more apps for it.I can't wait to see what comes out next.", "verified": true, "helpfulness": "0/0", "author": "Brett Fieber"}, {"rating": 5.0, "review": "works but messes up a lot", "verified": true, "helpfulness": "0/0", "author": "jamal farhan"}]