[{"rating": 4.0, "review": "Compact and quiet. Very good video quality. Excellent gaming experience for such a tiny box. Integration of remote with TV is incomplete - e.g. remote turns on TV but does not turn it off ! Also, no volume control or mute button on remote.", "verified": true, "helpfulness": "0/0", "author": "jitreno \"jitreno\""}, {"rating": 5.0, "review": "Works great so far. I had to update it when I first used it in order to get Netflix to work, which is my primary method of streaming using it. I have only been using it for a couple of days but it has been great so far. The remote is comfortable and very responsive and works from a decent range.", "verified": true, "helpfulness": "0/0", "author": "Logan Osterhoudt"}, {"rating": 5.0, "review": "Awesome, enjoy a lot.", "verified": true, "helpfulness": "0/0", "author": "Juana C Powell"}, {"rating": 5.0, "review": "On a scale of 1 to a 100.... i will give  a 150 thats  how good it is", "verified": true, "helpfulness": "0/0", "author": "everton l wilkins"}, {"rating": 5.0, "review": "Exceeded all expectations. Very simple set up.  Very small and portable unit.  Also a game console! I ordered the optional wireless game controller and was pleased to discover that the controller purchase also includes two free games. I previously accessed Amazon Prime though a smart tv in the front room. I bought the Amazon Fire for the TV in the bedroom.  Using the Amazon Fire is so much better, there is no comparison.", "verified": true, "helpfulness": "0/0", "author": "David P Brewer"}, {"rating": 5.0, "review": "Love the Fire TV. I initially got the Fire TV Stick, we liked it so much that we decided to move to the Fire TV primarily for the Freetime feature. If you have children the curated content is educational. If you have elderly folks in your home who are not too comfortable needing a smart phone each time you need to play something, the included Fire TV remote is excellent. I have Chromecast, Apple TV and Fire TV and we have moved to using the Fire TV as our primary device. The included remote is excellent. The HDMI CEC control works well. The voice search is surprisingly usable. It has never made a mistake yet with our input. The speed and responsiveness is the best of all the devices we have.I am not a gamer but sometime we play car racing games and the responsiveness of the games is also excellent.One great all in one device.", "verified": true, "helpfulness": "0/0", "author": "Mr C"}, {"rating": 5.0, "review": "My husband has finally forgiven me for turning off the dish!  Fire TV has all we need to entertain the whole family!", "verified": true, "helpfulness": "0/0", "author": "Stephanie George"}, {"rating": 4.0, "review": "I found it easy to set up and really easy to use.  No problems after 1 week.", "verified": true, "helpfulness": "0/0", "author": "Patricia Reynolds"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa M Mackey"}, {"rating": 5.0, "review": "We love our Amazon Fire. We actually discontinued our Cable service completely. We combine Hulu, Amazon Prime, Netflix and Sling. Our bills is literally 1/3 the cost it was before and we could not be happier!", "verified": false, "helpfulness": "0/0", "author": "Tisha Weisbrook"}]