[{"rating": 1.0, "review": "I didn't like the product as it's not very strong and broke easily. Now, It's not working for me anymore.", "verified": true, "helpfulness": "1/2", "author": "Tanuj"}, {"rating": 3.0, "review": "our Miracast dongle works much better with my wife's moto x but not with my old htc evo / the Viki app, which works well on our otherwise turdly logitech revue, crashed every time until i got rid of it", "verified": true, "helpfulness": "0/0", "author": "Tom Byers"}, {"rating": 2.0, "review": "I am very disappointed with the Chromecast. Video quality is terrible and I am yet to see it stream in HD.", "verified": true, "helpfulness": "1/1", "author": "Christopher Keene"}, {"rating": 5.0, "review": "Had a bit of a problem with the first one.  Called Google and waited, and waited for a return authorization.  Finally, called Amazon, and they sent me an RMA, a shipping label, and then sent me a new one.  Darn, that Amazon is just GREAT!Anyway, the second one worked flawlessly and we have been enjoying it to the extent that we bought my sister in law one and they too love it.  I would buy another in a second.Finally heard back from Google and told them that Amazon had resolved the problem.I recommend it!", "verified": true, "helpfulness": "0/0", "author": "David Dewey"}, {"rating": 4.0, "review": "Tiny and functional. There was some choppy video playback but it turned out that was a problem with the file, no fault of the Chromecast. 1080 output would be nice but I can live with 720 for this price.", "verified": true, "helpfulness": "0/0", "author": "Liam Richardson"}, {"rating": 1.0, "review": "Got this from Best Buy, installed and had it up and running fairly quickly. It worked great for a month, then got an automatic upgrade to a newer version. Now it cannot connect to Netflix. Hulu and Youtube work, just not Netflix which is 95% of what I watched with it. Tried it with two different TVs and controlled it with two different phones and two computers. All the same. Netflix does stream to my computer, just not to the Chromecast. Spent over an hour with a Chromecast service tech and we rebooted and reconfigured every electronic device in the house. He finally gave up and said they were working on the problem at their end. It worked fine until the upgrade, and all my equipment checks out. I don't understand why they don't have a provision to rollback the upgrade to the previous version.I have since bought a Roku streaming stick and it works fine with Netflix. Roku is a much slower interface to get to the show you want to watch but it streams just fine and has a lot more shows to choose from. Right now I would recommend spending the extra $15 for the Roku. I will keep the Chromecast and check it every month or so, if they get it figured out I'll report back here.", "verified": false, "helpfulness": "1/1", "author": "spork"}, {"rating": 2.0, "review": "I've had the Chromecast for less than 24 hours, and I already know I don't want it. I have a 50\" 1080p Plasma, and this thing just isn't cutting it.Bugs I've Encountered:- YouTube casts at a VERY low quality (looks like 480p). Casting the entire tab helps but it's still only a s***tylooking 720p.- HBO Go won't cast at all- Plex won't cast at all- Casting a tab only outputs audio in Mono. Yeah, mono. I was listening to a song on the Spotify web app, and the guitar (mixed only on the left speaker) was inaudible.Not bugs, but things I don't like:- Casting a tab only goes up to 720p (my laptop's screen is 1080p)- No built-in menu system, relies on other devices and apps for UIIf it were just one of these things, I'd consider keeping it. But I'm convinced now that an Android HDMI Stick or a Mini PC is the way to go, even if it's twice the price. Chromecast is a decent idea, but I'll wait for updated hardware before giving it another shot. And hell, for now just plugging my laptop in through HDMI is a MUCH better solution.", "verified": false, "helpfulness": "1/2", "author": "Brady Hilgenberf"}, {"rating": 5.0, "review": "Netflix + Chromecast = Cable TV independenceNow if Google Fiber comes to my city I can kick Cable all together.", "verified": true, "helpfulness": "0/1", "author": "Ajay Iyengar"}, {"rating": 4.0, "review": "The Chromecast is a great alternative to the Apple TV, Roku boxes and sticks, and even Amazon's own box. It's absolutely great for YouTube parties, as anyone with a compatible device can add their videos to the TV queue while videos are playing! I only have two problems with it. 1. No Amazon Prime Instant Video support! You can stream Prime through your browser onto the Chromecast using the Chrome browser extension, but it's not as fast as any of the dedicated apps. 2. No remote! You can adjust volume, pause/play and everything else through whatever app you are using, but if you are watching something and using your iPhone to control it, you better hope you don't get a phone call!", "verified": true, "helpfulness": "0/0", "author": "Chris S."}, {"rating": 4.0, "review": "I can stream stuff, pretty much anything, from my computer to TV! I had an apple TV. The ATV was really easy to use and it had a slick interface, but you could only get Netflix and a few other paid streaming services. Chromecast can stream almost any media from your phone or computer. No interface though, so if you aren't tech savvy it's tough  to use.", "verified": true, "helpfulness": "0/0", "author": "T. Ostrye"}]