[{"rating": 5.0, "review": "Love this device and only Google can make it for a great price.  Support was fairly limited but more and more developers are jumping in thanks to Google opening it up.", "verified": true, "helpfulness": "0/0", "author": "ChaCha"}, {"rating": 2.0, "review": "Wish it could do more. I was left disappointed but what can you expect for $35.No support for Amazon Prime.  Replaced with a 2nd Roku 3.Just collecting dust now.", "verified": true, "helpfulness": "1/1", "author": "John L."}, {"rating": 1.0, "review": "I got this specifically to stream Prime videos to my TV as none of my other streaming devices(TV/WDLive/Blueray) support Prime. What a huge disappointment. I guess I will have to be content with watching cat videos on YouTube.", "verified": true, "helpfulness": "2/2", "author": "Mike"}, {"rating": 5.0, "review": "PROS:I opened the package at 8 pm and by 8:25, I was watching the first YouTube video on it. Super simple, and very impressive.Installing the free Google Cast app lets you use additional tools in the Chromecast-enabled application (like YouTube and Netflix).CONS (very minor):I was surprised a bit by how long it took to send the first 45-minute video to the device (much longer than simply watching it on my Chromebook), but the difference is that everyone in the room (5 of us) could watch it in equal comfort. That may have been \"priming the pump\", however, because subsequent videos took seconds to \"spool up\" on the Chromecast.While the video was playing via Chromecast, I could not access any network apps on my Chromebook.", "verified": true, "helpfulness": "0/0", "author": "DrPat \"DrPat\""}, {"rating": 3.0, "review": "I bought this so I could stream video off my NAS however the Chromecast will only stream things off the web and not from your local network.", "verified": true, "helpfulness": "1/1", "author": "Satyagrah4"}, {"rating": 5.0, "review": "I did not think  would like this but the wife really wanted it.  Unless you stream from Youtube or Netfilx it is nothing special but the youtube streaming offers HD picture quality.  For the price it is not bad.", "verified": true, "helpfulness": "0/0", "author": "kyle ketchum"}, {"rating": 2.0, "review": "Couldn't connect to the bone-stock version of what is probably the most-popular Android phone right now (this is needed for setup, unless a laptop is used).  Using a laptop (and Chromebook), I was able to connect to the unit, but I never could connect to my network, rendering the thing useless.Canned replies from customer service were useless and inaccurate.FWIW - My technical expertise: probably >95th percentile.Sending it back.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So I don't have a smart TV and gave this a try and I have to say it's absolutely awesome. It comes ridiculously plug-and-play (just need to install Chromecast app on device) and sets up in a couple minutes without any effort.Once installed, all of the compatible apps (Pandora, Netlix, Hulu, Youtube, etc, etc) have a \"cast\" option appear which basically pulls up whatever you're looking onto your TV. From then on it displays on your TV and you have control over it through your phone (play, pause, rewind, skip, volume, etc). Very fluid, though there's a very slight delay.When using apps like Youtube, you can pull up multiple videos and you have the option to Queue them with what's currently playing, and chromecast will continue to play them in that order.Audio and video quality is top notch, though you may get mixed results depending on what you're streaming (obviously poor quality video will not come out well).One thing to clarify is that this works off your wireless connection, NOT bluetooth or anything else. That means you need to have a wireless router for this. There is no direct connection between chromecast and your phone. You send a signal to the interwebs, chromecast picks it up through your wireless router, and then basically pulls it up by itself independently. If your phone dies, turns off, etc chromecast will continue to run. Theoretically you could control chromecast from anywhere (not necessarily near the chromecast device), though I haven't tested this.The downside of this however is that it's not a direct link in that you can't just display your phone's screen and for example, can't pull up a website. The upside is that you can start a youtube video (or something else) and then go browse the internet or play a game on your phone without disrupting chromecast.Better than having a smart TV since this can be seamlessly controller with your phone. New compatible apps are constantly popping up for this.As a side note, the Avia app (free download on the play store, but has a $3 add-on) can let you display photos/videos on your phone through chromecast, which is very convenient.", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 4.0, "review": "Works nicely with the one app I have tried it with (YouTube) on iPad with no trouble. I am looking forward to more chromcast aware iPad apps like Vimeo, and a working chromcast extension for the iPad chrome browser. YouTube does look great on the big screen... Much better than I had thought it would.", "verified": true, "helpfulness": "0/0", "author": "steved"}, {"rating": 5.0, "review": "I love this little tool.  I can plug it into any television in my house and watch anything that will come through on cable.  I'm pleased with the selection of apps that come with it, and I hope to see Google continue to add more.  I have an HBO subscription, so theChromecast enables me to watch movies on the TVs that aren't hooked up to cable boxes.  I would highly recommend this little tool to anyone.  I was also able to get the Google cast extension so I can view my MacBook Pro (with Chrome browser) on any TVs, as well.  While Chromecast doesn't come with Amazon prime (I hope to see this in the future), the extension lets me watch movies through prime via my Mac.  Excellent $30 investment.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Pyrch"}]