[{"rating": 4.0, "review": "It works but I cannot figure out how to stream without the computer being on I am hope there is a way because it is annoying to keep the computer running.", "verified": true, "helpfulness": "0/0", "author": "Dianne P. Carangelo"}, {"rating": 2.0, "review": "It has to be on WiFi to download the app. This is difficult for one who is not that good on the computer.", "verified": true, "helpfulness": "0/0", "author": "Thomas Feeheley"}, {"rating": 5.0, "review": "Works great, easy set up.Youtube and Netflix play great (faster than my smart TV's native app)The Avia media player ($5 on the play store) lets you stream a wide variety of media to the chrome cast.  HD media buffers a lot when streaming over Avia, but I'm on an 802.11g network.", "verified": true, "helpfulness": "0/0", "author": "Greg B"}, {"rating": 5.0, "review": "this device works seemlessly....it is basically your computer that controls your video or you browser tab, ez hook-up too! yay!", "verified": true, "helpfulness": "0/0", "author": "John Cicale"}, {"rating": 4.0, "review": "Would've gave it 5 stars but it doesn't work with the watch espn. That is not very clutch. Works great with hbo go, YouTube, and Netflix though", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "I had an old LCD TV in my bedroom and now we can stream Netflix, HBO, and YouTube to it. Very little to no buffering. Worth every penny", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 3.0, "review": "I like it because it's cheap and easy to connect and set up.But Especially here in Italy the number of app available is very limited (no netflix which is one of the main ones)Hopefully they will add more soon to take more advantages of this simple but cool device.Great the idea to stream a Tab from Chrome broweser to your TV, they should add the same feature for the mobile devices such as smartphones and tablets.", "verified": true, "helpfulness": "1/1", "author": "Alessandro"}, {"rating": 3.0, "review": "Works but just OK as a device. Doesn't do a whole lot. Isn't that expensive though. Probably wouldn't purchase it again.", "verified": true, "helpfulness": "0/0", "author": "Rodney Cobb"}, {"rating": 4.0, "review": "I really enjoy this product, hoping in the near future Google chromecast can work with more apps such as Directv everywhere", "verified": true, "helpfulness": "0/0", "author": "Andres Gutierrez"}, {"rating": 4.0, "review": "So far it works as advertised! It will be better when they add more viewing options. I really enjoy using Chromecast! I can now watch tv in another room without keeping anyone else up at night.", "verified": true, "helpfulness": "0/0", "author": "Nancy Lewis"}]