[{"rating": 5.0, "review": "This item is great! We enjoy being able to send youtube videos or netflix to the big screen for all to enjoy. I do wish there were more apps compatible with it.", "verified": true, "helpfulness": "0/0", "author": "D. Svenson"}, {"rating": 5.0, "review": "It's simple, easy to set up, and just use!  It would be nice to see more apps added that support the format.", "verified": true, "helpfulness": "0/0", "author": "Ron Manns"}, {"rating": 3.0, "review": "So the adds made it seem more than it currently is.  I see potential for this as more apps are added to the mix, but when I got it out of the box and connected it, the only things that I could successfully stream to my TV were You Tube and Netflix.  I was hoping to stream my Hulu or Flixster or even display my photos.  I was of the impression that I should be able to do more than I actually could.In fairness, it could just be a user deficit; but I got frustrated and lost patience with playing with it more.  I thought that I would take another run at it later but sadly I haven't tried it again.", "verified": true, "helpfulness": "0/0", "author": "Mark L Nowlen"}, {"rating": 5.0, "review": "I've been wanting a product like this for YEARS!!! I'm VERY happy with this as well as the rapid delivery", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It is pretty good. Allows you to watch movies from Netflix and Hulu, and videos from YouTube. Waiting to see what else they add. Better than having to hook your laptop to TV.", "verified": true, "helpfulness": "0/0", "author": "BP"}, {"rating": 4.0, "review": "Chromecast works as described and flawlessly. Just needs more applications and features with future updates. For basic netflix and youtube usage, it does the job.", "verified": true, "helpfulness": "0/0", "author": "Toan"}, {"rating": 5.0, "review": "I'm not that \"electronic savvy\" but it was a breeze to hook up and I can stream from my laptop, smartphone, and my Kindle Fire HD..  So happy with the product and the price was so reasonable.  Use it every day!  Love it!!", "verified": false, "helpfulness": "0/0", "author": "reddevil480"}, {"rating": 1.0, "review": "Hooked up a vista laptop to a 46 in. Sharp and streaming video on the screen was jerk- jerk- jerk. Totally useless. What a waste of my time and money. Grrrrrrrrrrrrrrrrr.!.", "verified": true, "helpfulness": "0/4", "author": "KIMO"}, {"rating": 4.0, "review": "I love what it does but tieing in to your wifi and you are able to broadcast anything from your phone, tablet, or desktop laptop onto your hi def tv. What it did not like was the fact you have to power it by plugging it in.  I though it would get it's power through the hdmi. The power cable has mini usb which was pretty flimsy and since it was in my side hdmi port on my tv, that mini usb snapped and i had to replace and that is what powers the device.", "verified": true, "helpfulness": "0/1", "author": "Q"}, {"rating": 5.0, "review": "Like i said this is an amazing device.dummy proof set upeasy to use and I think it took less than 5 minutes to set upNow I can stream youtube and netflix..No hassle of wiresOn top of this look at the Price very nice ..", "verified": true, "helpfulness": "0/1", "author": "Wsm"}]