[{"rating": 1.0, "review": "very misleading in your ads  it is showing that all that is necessary is to plug in into your TV and it will work off your laptop or PCI ha to buy a tablet to make .it work", "verified": false, "helpfulness": "3/10", "author": "Patrick M. Ramsey \"RAM927\""}, {"rating": 2.0, "review": "For $30 it's o.k.  I primarily wanted it to be able to stream a video content from a webpage using a notebook to my HDTV.  That works, although the sound is less than desired.  So it meets the primary objective - barely.  It's works fine when 'casting' from both Windows 7 and MacAir.  However, highly disappointed when trying to stream a webpage (using Chrome app) from iOS (iPhone 5 or iPad).  Basically, you can't do it.  The cast extension is not available for the iOS devices .... booooo.  For $30 bucks, I'll keep it.  Not super excited about it though.", "verified": true, "helpfulness": "0/3", "author": "X in LA \"X in LA\""}, {"rating": 2.0, "review": "Thought I could do more, very disappointing. Not good for streaming anything other than youtube or netflix. Does not work on tablet version of google chrome.", "verified": true, "helpfulness": "0/1", "author": "Ian Marcus"}, {"rating": 3.0, "review": "Great for netflix and YouTube streaming. But I honestly brought the item wishing I could view personal videos, pictures and other non YouTube sites", "verified": true, "helpfulness": "0/1", "author": "Rochelle"}, {"rating": 5.0, "review": "As others have pointed out, the ChromeCast works seamlessly with my iPhone 4S, my iPad 2, my HP desktop, and my HP laptop.  By adding Hulu+, and along with my Networks account, I cancelled my $150 cable for $20 after an additional on time investment of $35 dollars!!  And I got ChromeCast via free shipping.  Definitely worth the $35 it costs....and much more!!  I love it!!!!", "verified": true, "helpfulness": "1/1", "author": "J. ONeill \"Jim O'Neill\""}, {"rating": 3.0, "review": "Upsides- easy to setup- it's Google- will be expanded in futuredownsides:- Very few options for content- No freedom for developers- has an annoying, bright blinking light when it's powered and have to take it out at night to sleep", "verified": true, "helpfulness": "0/1", "author": "James T \"James T\""}, {"rating": 5.0, "review": "I have been an user of Roku for almost 4 years and one thing Roku lacked is a YouTube App. I got the chromecast just to watch youtube on TV. And it works really well. I have watched many movies on youtube using chromecast and it never failed.Unlike Roku, this does not take up any soace and its hidden behind your TV. However there aren't many apps using chromecast at this time. I would like to do web browsing and watch photos through chromecast. Hope it comes soon.Regarding the streaming quality - I have a DSL connection at home with speed hovering around 2.5 Mbps and chromecast has worked pretty well so far.I would recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Jogeo"}, {"rating": 5.0, "review": "It's excellent, easy viewing from a number of devices. Hoping for a few more features in the future, but for now it's a cheap and effective way to put content on the big screen.", "verified": true, "helpfulness": "1/1", "author": "Dustin"}, {"rating": 4.0, "review": "Works great for Netflix and Youtube.  Would be 5 stars if I could watch ABC shows online with it also.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Can't wait for more content to be added to this device.  For only $35 it takes your dumb tv and makes it a smart tv.", "verified": true, "helpfulness": "1/1", "author": "Umit Ozbas"}]