[{"rating": 5.0, "review": "The media player was recommended by a representative of Netflix when I called them about replacing the xbox I was using to stream Netflix to my tv.  It was priced competitively, was as described and arrived quickly. Apart from having to purchase a pad-device to use as a remote the chromecast is a much more cost effective way to stream.  I have had no problems and am very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Gwen Johnston"}, {"rating": 3.0, "review": "the ad fools you.you need to attach more wires to this to work and I had to send it back .At the round end you have to attach wires to go to electric.I thought it was wireless as every picture I looked at had none which is why I was buying it. have too many wires now.So I cannot really tell you how it works", "verified": true, "helpfulness": "0/4", "author": "Sandra Cieklinski"}, {"rating": 4.0, "review": "Very good, i saw a film from Play Store Movies. Fine vision.fair price for this device. probably better than the competitors", "verified": true, "helpfulness": "0/0", "author": "Lorenzo S."}, {"rating": 4.0, "review": "I decided to buy in on this idea while it's still cheap. Opened the box, plugged it in, and after 5 minutes of setup and a software update it was up and running. So far I've tested a lot of Netflix and it's running perfectly. Can't wait to see what Google does with this thing next...", "verified": true, "helpfulness": "3/3", "author": "D. Valencia"}, {"rating": 3.0, "review": "A lag when casting chrome browser. Feels like the product is kind of a beta version. I guess for $35 it delivers as priced", "verified": true, "helpfulness": "0/0", "author": "Kamalesh"}, {"rating": 5.0, "review": "Perfect for Netflix and Youtube. Sometimes while casting a tab there's a delay between what's see on the laptop and what's on the tv, but the audio and video on tabs were in sync on the tv so that's good. Only negative thing is that it needs more apps and better support for desktop sharing. But at this price, it's a killer device and thus gets 5stars from me!", "verified": true, "helpfulness": "1/1", "author": "AmazonShopper128"}, {"rating": 5.0, "review": "I really like it. I know it doesn't support a bunch of apps yet but the movies we've watch using chromecast have been fantastic and look extremely high def. Great addon for my tablet and tv especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not working with older models more than 3 years old, I have to buy another new TV in order to use it.", "verified": true, "helpfulness": "0/1", "author": "jango2154"}, {"rating": 5.0, "review": "Just amazing. We were a little upset by the quality at first, but after upgrading our wireless router (to an Apple Airport Extreme) we're loving it, and the quality is now perfect. We have two Roku's and now this, and we'll probably be getting a few more Chromecast's. If you stream everything (we don't have cable tv) this will round out your streaming capabilities. Sure, it isn't compatible with very many apps, YET, casting from chrome makes up for all of that.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 4.0, "review": "Was on back order for about a month but worth the wait. Would get 5 stars if there were more services available to cast to your television but for $35, you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Howard"}]