[{"rating": 4.0, "review": "Easy to use.  The only draw back is it can only work with a handful of applications.  If you want to watch some international channels, you may have to use Chrome and the function linkage is not good.", "verified": true, "helpfulness": "0/0", "author": "warren"}, {"rating": 4.0, "review": "This is great. Makes watching moves off Netflix a better experience. I am happy with the price and product. Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Sheri Crowley"}, {"rating": 4.0, "review": "This was very easy to setup. From plugging into the TV to start casting Netflix, youtube took only 10 mins. It works flawlessly from both ipad and iphone.The only reason for 4 stars is because once you start the playlist from youtube, after the commercial break between videos, the information bar stays on the TV until you pause and restart the video. A bit choppy and delayed playback when casting from chrome browser unless you close all programs on the computer. Can't wait for it to support casting from additional apps.", "verified": true, "helpfulness": "0/0", "author": "Sheetal"}, {"rating": 4.0, "review": "I would recommend this product to anyone. If you don't have a game station or a smart TV this is perfect and it works well. Every once in a while it bugs out a bit and i have to send the signal again from my phone to play a movie from netflix but overall and for cheap price this is a buy!", "verified": true, "helpfulness": "0/0", "author": "Tommy Lee Woolsey Jr."}, {"rating": 5.0, "review": "I love this and really need to buy a few more. Very versatile and easy to set up. I mainly use it for Netflix or Youtube but there are other uses as well.", "verified": true, "helpfulness": "0/0", "author": "b4u2"}, {"rating": 5.0, "review": "Got this for Christmas, and I LOVE it! It was so easy to set up, and use! Google totally brings it... again!", "verified": false, "helpfulness": "0/0", "author": "Thomas Blake"}, {"rating": 2.0, "review": "The Chromecast works well on a 1080p tv but if you have a 720p or 1080i tv or video projector, it will not work.", "verified": true, "helpfulness": "1/1", "author": "Bernard B. Fox"}, {"rating": 5.0, "review": "Product work to our needs, great with the kids, we use it to watch movies and is aawesome. Thanks for the speedy service.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The google chromecast works great!  It's small and easy to set up!  We have really been enjoying it!  It is a great price for a great product.", "verified": true, "helpfulness": "0/0", "author": "sj"}, {"rating": 3.0, "review": "I ordered my chromecast when the devices became available, so I've enjoyed it for the past couple of months. Pros: Awesome Price Cons: Glitchy, glitchy, glitchy, like c'mon google you can do better. My device will disconnect from my wifi for no reason at all, and I have a pretty good signal. There will be times where it just won't connect to my internet AT ALL--during the middle of streaming, and switching it to another wifi is such a hassle! I like to take my chromecast with me when I visit family and it's always such a pain and time consuming to set it up on another device. They were lying when they said it's easy to use straight out the box---it's not. But other than those annoying set backs, the device does it job--when it decides to work.", "verified": false, "helpfulness": "0/0", "author": "malika"}]