[{"rating": 4.0, "review": "Pretty cool device. I like that I can now stream things to a TV that doesn't have internet capabilities with this. I also don't need a computer or anything like that. It works pretty well and I like that it works with different devices.", "verified": true, "helpfulness": "0/0", "author": "Cesar Reyes"}, {"rating": 5.0, "review": "Seamless setup. Works as promised. Would like to see more applications available and integrating \"cast\" functionality, but even with Netflix, Play Movies, and Chrome it is worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Andrew Crichton"}, {"rating": 5.0, "review": "Thsi is clearly one of the best purchases I have ever made. I urge anyone who loves on demand movines and TV shows to consider one. I love ours.", "verified": true, "helpfulness": "0/0", "author": "Alan Bartlett \"Grade Six Here\""}, {"rating": 4.0, "review": "I'm overall quite happy with my Chromecast.  Happy enough in fact to have bought another.  The video and audio quality are great and the convenience is really tough to beat.  We use it mostly from our phones (both Android and iPhone) to watch Netflix shows on the big screen, but not purely because we like using our cell phones for this.  In fact, we've found that trying to use it from our laptops is pretty unreliable (works about 50% of the time).  Still, at $35, I can tolerate a little bugginess that I'm sure will get worked out with future software releases.", "verified": true, "helpfulness": "0/0", "author": "Eric E. Rinderer"}, {"rating": 4.0, "review": "This thing works pretty well. Sometimes apps will lose their connection to it and I'll have to try to reconnect, but the apps I have used with it work great. I would give it five stars if only more apps worked with it. My vote is for HBO GO and Amazon Instant Video, then preferably Vimeo. If Google can add support for those three I'd be happy to give it five stars.", "verified": true, "helpfulness": "0/0", "author": "Kyle N. \"Clothes Make the Man. Naked People Have Little or No Influence in Society\""}, {"rating": 4.0, "review": "Great little device; can't wait for more supported apps. The Cast extension for Chrome also needs some polish. *tips hat*", "verified": true, "helpfulness": "0/0", "author": "bags"}, {"rating": 5.0, "review": "Works, out of the box!  In the past I purchased the more pricer Roku to stream Netflix to other devices.  The Roku works wonderfully.  But for my needs, the inexpensive Chromecast does just as good, if not better job.  I will be ordering more for Christmas gifts for friends and family.", "verified": true, "helpfulness": "0/0", "author": "Gregg Staroscik"}, {"rating": 5.0, "review": "Google as always has delivered!!!!!!!!!!!!!!!!!!!! Awesome, just the only thing is I want to do the whole screen CAST thing where not only the URL shows up but everything. Still overall this is great!", "verified": true, "helpfulness": "0/0", "author": "Fitness Guy \"I'm a personal trainer & a Registered Nurse. I own  my own personal training studio, where I train a lot of clients w/ medical conditions :)\""}, {"rating": 5.0, "review": "Seriously, I couldn't imagine watching youtube on a TV without this anymore. Whenever we're at a friends house and want to share a youtube video - it takes forever to use their TV's smart remote to cue things up - and we always talk about how cool the Chromecast is and how it works with your computer, laptop, ipad, iphone and even android phone.Warning: make sure you don't try to connect to it with multiple phone at a time! With two, it's ok, but with 3 it starts to act wonky.Product Innovation: I wish they made it HDMI powered rather than requiring an outlet. Then I could throw it in my pocket and take it with to friends houses or just have one on a keychain. But I'm not lugging a power adapter.", "verified": true, "helpfulness": "0/0", "author": "T. Johansen"}, {"rating": 5.0, "review": "I don't have cable, and a very small laptop (Samsung Chromebook), so this is the perfect substituteThis is great! It works perfectly and it is the easiest thing to setup. The app list isn't that great (yet) but the ones that they do have works great. I run a Samsung Chromebook, which doesn't Cast very well, but apparently Google is working on that. This is really awesome, it's everything I need.", "verified": true, "helpfulness": "0/0", "author": "Zao Huang"}]