[{"rating": 5.0, "review": "This thing is used on a daily basis! With Netflix it is the perfect solution! My tablet serves as a remote.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 2.0, "review": "Would not recommend the chromecast. It's spotty in connecting with my iPad and Netflix. Sometimes will go out for no reason. For the most part it works but usually every time there is something that doesn't work. Hope Google can fix this.", "verified": false, "helpfulness": "0/0", "author": "Adam Patrick"}, {"rating": 5.0, "review": "Plug it in, let the network discover it, and you're online. Don't forget EZcast for Apple devices!", "verified": true, "helpfulness": "0/0", "author": "Dave C"}, {"rating": 5.0, "review": "We can't live without this now!  Love it!  I bought one for each of my kids to take to college.  Great product", "verified": false, "helpfulness": "0/0", "author": "Elizabeth T. Ailinger \"Mrs A reads\""}, {"rating": 5.0, "review": "Awesome and easy to use", "verified": true, "helpfulness": "0/0", "author": "Allen Peterson"}, {"rating": 5.0, "review": "Excellent and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "ian1109 \"ian1109\""}, {"rating": 5.0, "review": "Awesome buy works great had it for about a year now love it I recommend this product!!!!!!!!!!!!", "verified": false, "helpfulness": "0/0", "author": "dean brown"}, {"rating": 5.0, "review": "works great its been a while and we use it on all over TVs. Takes the need of smart tv out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is literally the best device I HAVE EVER BOUGHT. I didn't want to buy it because I have my Desktop PC hooked up to my TV and my surround sound. But I was looking for an easy way to play netflix from sitting on the couch. There isn't a way to control the netflix on a desktop from your phone like you can on a chrome cast. (You can with Plex, however.)So everyone  told me to just bite the bullet and get a chromecast and from $35 bucks its hardly an investment. So, I gave in. And let me tell you, this is the best device ever. I forgot I always wanted a way to control my music (Google Music) when not sitting at the computer and you can do that with chromecast, you can watch  Netflix, Plex, Youtube, Pandora, Twitch it is literally the best device ever!! It is also so small you can bring it with you, put in you backup or purse or where ever. You could bring it to a party so you can play Netflix or music in the background. I am going to be moving into a dorm later this month and I am DEFINITELY bringing my chromecast so we can watch Plex, Netflix and listen to music in the main room its going to be awesome. Its going to blow some minds, guaranteed.Now I wanted to explain two things:Setup:You just plug in the Chromecast into the hdmi and then plug the powercord (either into the wall with a power adapter or just plug the usb into the tv). I plugged in the powerchord into the wall so when I start casting it actually turns on my tv for me! (because the chromecast is always on, similar to a roku)To set up the device you need to download the chromecast app from the playstore. Then it finds it and then connects to it and then you set up the wifi for it. Really simple and intuitive.Youtube:Casting youtube is amazing. You can add videos to the queue and anyone else that connects to the chromecast (android or ios) can see the queue and even add more videos to the queue. Its so cool and awesome.If you need a way to stream music or videos or pictures to the tv. I HIGHLY recommend the chromecast, it is amazing and definitely a steal for $35.", "verified": true, "helpfulness": "0/0", "author": "J Angelsberg"}, {"rating": 1.0, "review": "We are returning our chromecast.  We've had it for a month .  We were able to watch 1 and 1/2 movies on it and maybe a TV show.  We spent at least as much time -no, much more time- trying to reset it -turning everything off, including the router one time -hold down the reset bottom for 20 seconds, unplug then re-plug the chromecast into the TV's HDMI port (that's the real reason there's an extender, so that it's physically possibly to reset and unplug the device many, many times.)  Then the chromecast would work with Netflix until we paused it for too long or walked away and did something else for a few hours or tried it again the next day.  Then the \"cast\" button would either disappear or give an error message.  Then we would have to repeat the whole process the next time to get it working for Netflix, which is the whole reason that we got it.  It works intermittently with youtube without being reset every time, although some youtube videos look a little funky on a big screen.I worked with google's volunteer based help chat page.  The told us to turn off the router as well when we reset everything, which my husband figured out on his own.  Otherwise, they weren't much help.  I think the issue might be between my Android tablet and the chromecast, but they don't do \"devices.\"  (Yes, we checked our updates on the tablet.  We also discovered it's in Beta mode for Android.)  The chat page did tell me how to find the customer service number -yes find- for google.  I admit I didn't call because 1) I was very certain they were going to tell me to reset everything again which would only temporarily fix the problem and 2) I was 100% sure I was going to yell at a poor customer service person no matter how hard I tried to stay calm.Not only is it not worth with the money, but I think google actually owes us money for false advertising and our time and frustration.  I'm absolutely shocked at the number of good reviews on Amazon.  Maybe people like idea of the technology and the pretty \"screensaver\" the chromecast puts up when it's almost working.  (I worry that we're going to have a Pavlovian response to images of beautiful sunsets and grassy cliffs by shores now.  \"A sunset picture of the ocean! Google chormecast, google chromecast,\" -ripping hair out\" -\"Agghhhh!!!\"", "verified": true, "helpfulness": "1/2", "author": "CH"}]