[{"rating": 5.0, "review": "I use it everyday! Looking forward to when more apps will be compatible. I really would like to see Hulu and AETV work with it.", "verified": true, "helpfulness": "0/0", "author": "Shaun Marconi"}, {"rating": 1.0, "review": "Only 2 App's working (Netflix and YouTube )However I got 3 month Free on Netflix with that freebie the cost of the Chromecast is only $15.00Google should have done a Better Job, before releasing the Chromecast", "verified": true, "helpfulness": "2/4", "author": "GP"}, {"rating": 5.0, "review": "As far as Netflix streaming goes, this is a great product. Picture quality is great. But when streaming the chrome tab browser there is a noticeable delay, but this is expected since the information is not received from the cloud. Hopefully they come out with more video service support such as hulu, and other companies, but for now it does what it is suppose to.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 3.0, "review": "not usable for ios todayi though that i will works with google chrome for iosnow its not usable", "verified": true, "helpfulness": "0/0", "author": "Alexandru Stotchi"}, {"rating": 5.0, "review": "Can't wait to see what this can do in six months time. well worth the money !! especially with netflix included", "verified": true, "helpfulness": "0/0", "author": "Chris Beard"}, {"rating": 1.0, "review": "Unable to get it to work. Efforts to seek online support related to the issues I found were even more frustrating. So here I sit with a piece of hardware doing me no good.", "verified": true, "helpfulness": "2/4", "author": "Larry Chadwick"}, {"rating": 5.0, "review": "One of the best electronics purchases I've ever made. It makes streaming content so much easier. Portable and easy to use.", "verified": false, "helpfulness": "0/0", "author": "Adam Gundacker"}, {"rating": 5.0, "review": "Google in thee I trust.  Another product they knocked out of the park. There are very few apps right now that can really take advantage of it but the ones that can run flawlessly. There is so much potential here is ridiculous. And for $35, it's a no brainer", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 4.0, "review": "If you watch Netflix or Youtube this is a good deal, until it can play videos from a tablet or phone its not going to fly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Dave Mac\""}, {"rating": 4.0, "review": "Another Google innovation! Let's see what their competitors can do after seeing this amazing new product from the fine people at Google.com", "verified": true, "helpfulness": "0/0", "author": "jdadams"}]