[{"rating": 3.0, "review": "Takes a while for the apps to deliver the image to the tv set... and there are limited apps at present...", "verified": true, "helpfulness": "0/0", "author": "John B"}, {"rating": 3.0, "review": "Nice packaging.  Not compatible with every TV.  For the price works fine for SOME TVs.  However I wish that I would have spend some more for a more robust unit like the appleTV or the new Amazon Fire that work for ANY TV.The unit is wothless with my  LG TV, HDMI compatibities issues.  With my Epson (older than the TV) works fine, I just dont feel like wasting my projector's lamp's life streaming stuff from youtube plus the idea was to use it in our everyday entertainment room not a dedicated home theater.Did the latest firmware update but the problems persists. Read all over the internet and many are having the same problem and no one has found a solution.The only problem I now have is that it doesn't weight enough to use it as a paper anchor to keep paper from flying off my desk when there is a gust of wind.", "verified": true, "helpfulness": "0/0", "author": "Marinus VB"}, {"rating": 5.0, "review": "This is a fantastic and cheap device, and with a load of apps coming out which allow you to do local video file streaming... even better", "verified": true, "helpfulness": "0/0", "author": "Felipe Amigo"}, {"rating": 5.0, "review": "We really like streaming via a smartphone.We use it all the time and could not be happier with the value.", "verified": true, "helpfulness": "0/0", "author": "Bpcal"}, {"rating": 5.0, "review": "Chromecast made streaming so easy and convinced me to use that and streaming services to then get rid of cable subscription.", "verified": true, "helpfulness": "0/0", "author": "Puzz"}, {"rating": 5.0, "review": "This is a great device. We haven't had any issues with it. Anything you can play full screen on your computer, you can watch on your TV!", "verified": true, "helpfulness": "0/0", "author": "That Clever Chick"}, {"rating": 1.0, "review": "We were looking for a means to stream content that we have on our internal network and I was not able to get that to work.", "verified": true, "helpfulness": "0/3", "author": "Tim Laplante"}, {"rating": 2.0, "review": "Works great until it gets warm then you have to reboot it...also it freezes up after a hour or so of use. Great idea but Google needs to make it where it streams all your devices media.", "verified": true, "helpfulness": "1/1", "author": "thomas bunn"}, {"rating": 5.0, "review": "I use Chrome for most of my browsing needs - I can cast anything in my browser to the TV with this - I hear there are enhancements to cast personal video's and such to the tv using this, but I haven't tried it", "verified": true, "helpfulness": "0/0", "author": "Christina E"}, {"rating": 5.0, "review": "Works perfectlyHave to search around to find the best apps to work with this product.Still needing some development but very promising and compactShame there is no software or support for blackberry playbook.", "verified": true, "helpfulness": "0/0", "author": "Helder Mendes"}]