[{"rating": 5.0, "review": "pretty sweet little device that basically makes any tv a Smart TV and it's only getting better with all the new apps available", "verified": true, "helpfulness": "0/1", "author": "Mark1990"}, {"rating": 4.0, "review": "This is very neat tool for Android users and Apple users. It works seamlessly and very easy to setup. Only con is you have to plug it in to the power outlet and the ugly wire hanging from the top of it.", "verified": true, "helpfulness": "0/0", "author": "Michael L."}, {"rating": 5.0, "review": "Bought one at launch.  Don't know why people bash the thing.  It doesn't do a lot, but what it can do it does well.  It sat idle for 8 months before I put it back into service streaming tv.  My sat provider doesn't pickup Dodger games due to TWC being stingy.  Found a reliable streaming site.  Pull up the game, click a button, and Voilla...game is playing on my 60\" plasma.  $30 more than made up watching all the baseball games I can't get on TV.  Bottom line....Play with it and you'll find all sorts of uses for it.  And if you don't....$30 isn't a lot of money to throw away.", "verified": false, "helpfulness": "0/0", "author": "K. Burnett"}, {"rating": 5.0, "review": "very nice", "verified": true, "helpfulness": "0/0", "author": "RICK"}, {"rating": 1.0, "review": "Awwwwww, I have to give this a 1 star, my first, I've only done a few reviews so far, but this never worked well for me. I'd say 90% of the time for some reason, it just never recognized my router, and so never connected. I probably should have returned it but well, I rarely ever return anything even when i should. It seems like a big bother and this wasn't really much money; still thirty bucks is nothing to waste. I considered that maybe my router is just too far away on the other side of the house, and maybe I'd move my router and try again, but then, I use three or four other devices back here in the 'sunroom' and they never have any connection issues, and when the Chromecast doesn't connect, it was never like it connected poorly and just showed a slow or weak signal, it just sat there buffering and never even 'seeing' a router nearby to connect to. It did work a few times, but mostly not and I'd rather it didn't work at all than work inconsistently and get the chance to frustrate me over and over again. I still don't think I would have given it a very good review if it had worked though because even then, it was the first version and when it did connect, didn't have much in the way of apps (I should have reviewed this a long time ago I when this first came out and I bought this) that I would use other than Netflix. I'm sure that's a problem long solved--I suppose. So one star 'cause I guess I got a dud.", "verified": false, "helpfulness": "0/0", "author": "richard barksdale"}, {"rating": 1.0, "review": "Tried everything but could not get this to work, something with my wireless router, strange, I have two DVD players that I can stream from with no problem using my router but not this one.  I tried to find a support number in the instructions, no luck.  Tried to go on line and get support, no luck other than a suggestion I call support for my router but they could not help me.", "verified": true, "helpfulness": "0/0", "author": "Dale Haddon"}, {"rating": 1.0, "review": "Save your money.  It's great when it works, but it is a constant struggle to keep the chromecast connected to my iphone.  Constantly have to unplug it; reboot my router, etc. to get it to work.", "verified": true, "helpfulness": "0/0", "author": "David Cure"}, {"rating": 5.0, "review": "More apps coming out all the time. Love it.", "verified": true, "helpfulness": "0/2", "author": "R. Garneau"}, {"rating": 5.0, "review": "It's awesome, we have had no issues and we run it everyday all day at my business.", "verified": true, "helpfulness": "0/1", "author": "Eric Messenger \"Eric\""}, {"rating": 1.0, "review": "This is a piece of junk. I bought it, even after reading the mixed reviews. I spent 3 days trying to get it to work with my tablet and laptop and only got it to work once and only for a few hours. I kept getting an error and called tech support and all they could say is they were aware of the problem and were working to fix it on the next model. The man advised me to return the chrome cast and exchange it, but I just took it back for a refund.", "verified": false, "helpfulness": "0/1", "author": "James Pressley"}]