[{"rating": 1.0, "review": "Why not just get a HDMI cable? What a useless product. But I guess everyone just loves Google everything. Whatever happened to the negative view on company's creating a monopoly?", "verified": false, "helpfulness": "0/5", "author": "Edmund Cee R. Garman"}, {"rating": 4.0, "review": "Works as advertised, I'm looking forward to more sites becoming compatible with device like youtube is set up for HD chromecast.  A simple set up.", "verified": true, "helpfulness": "0/0", "author": "J. Ebner"}, {"rating": 5.0, "review": "For $35 you can't go wrong with this.  I have a 50\" Plasma TV that is about 6 years old and is not a smart TV, until now.  I really hope that Google allows for more open development on this so we can get some more apps.", "verified": true, "helpfulness": "0/0", "author": "Semiproslacker"}, {"rating": 5.0, "review": "Google is managed my GODS... if you need something that may believe is not created yet, check Google Play Store first. Don't waist your time with fancy and expensive product. Need a tablet the answer is Nexus, need a smartphone, the answer is Nexus, Need a Laptop, the answer is a Chromebook... Yesss!", "verified": true, "helpfulness": "1/1", "author": "Raul E. Penas \"Raul\""}, {"rating": 5.0, "review": "fantastic! no need for expensive cable or sporadic dish. This works very well and is truly as easy as they say to install. It took me only a few minutes and they have since added HBOGo to the line up. Very happy with this purchase", "verified": true, "helpfulness": "0/0", "author": "NBelks"}, {"rating": 5.0, "review": "It was an awesome piece of gadget I love from Google for just USD35. I recommend it. Just try it.", "verified": true, "helpfulness": "0/0", "author": "Mufeez Lebbe"}, {"rating": 5.0, "review": "Is there anything that Google makes sucks? No. Work flawless every time. I want more services on this amazing evice.", "verified": true, "helpfulness": "0/0", "author": "Anh P. Nguyen"}, {"rating": 4.0, "review": "Makes navigating Netflix and YouTube a breeze, whether you are using a IPhone, Droid, tablet and of course Notebook(Win & iOS platform). Looking forward to more apps getting on board with this device. Easy to configure", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"TheBenI\""}, {"rating": 5.0, "review": "I recently purchased a Google Chromecast device for my techie boyfriend and I wanted to share his findings and thoughts.The challenge of getting audio and video from a computer to a monitor has always required specialized cabling with length limitations, and the challenges are even greater with tablets and smart devices.  However, if a reliable 802.11g wireless connection is available, the Chromecast device becomes a component of your network, the wireless signal becomes your cabling, and certain devices on the network become Chromecast aware, capable of handing off the job of displaying a/v content from the computer monitor to the HDMI-capable TV.Currently, Netflix and YouTube are the only services that are Chromecast-ready, but I’m betting more will jump on the bandwagon.  However, running the Chrome browser and selecting to Chromecast a specific tab works incredibly well.  I’m watching and listening to Tom Petty videos as I type, and there’s zero choppiness or buffering.  Excellent quality requires excellent wireless, which I have here.For only $35, this device is awesome, and should be a part of anybody’s wireless network.  It could be used for any situation that requires displaying audio and video to one or more flat panel TV monitors.  Imagine the possibilities, the ease of implementing this technology, and the affordability!!  Add a couple inexpensive IP surveillance cameras and you would have a surveillance system that can be watched wirelessly on TV or computer.I would give this device more than five stars if I could!  Totally recommended.", "verified": true, "helpfulness": "0/0", "author": "Sparkle Plenty \"Flamingo Queen\""}, {"rating": 5.0, "review": "Thanks you so much, really a great product that just need more apps.  (for now only netflix, music and chrome from pc)", "verified": true, "helpfulness": "0/0", "author": "Ilmnetwork \"iLMNETWORK\""}]