[{"rating": 5.0, "review": "For the price you can't really go wrong unless you don't have a TV to plug it into, or WiFi to stream stuff with.This was easy to set up and works really well.  No lag or buffering, even in rooms where other wifi devices stutter and stall on Netflix.  Netflix HD is just lovely.  I bought one for every TV in the house, and one unused LED monitor also.Am completely happy with the purchase, would recommend.  I'm also excited about the other services that are coming.  Koushik Dutta has already written an app to stream all of your local media from any device in FullHD, and another for Dropbox - but is waiting for the release of the official software development kit to publish it.  It is going to get far more amazing.", "verified": false, "helpfulness": "1/2", "author": "Amy J Kirk"}, {"rating": 5.0, "review": "Couldn't be simpler to get up and going with the Chromecast. Takes less than 2 minutes to setup.Works flawlessly.Only word of caution is that you need a strong wifi connection and a pretty decent spec computer to do the tab casting reliably.Awesome value for money.", "verified": true, "helpfulness": "2/3", "author": "M. Harman \"mattyh\""}, {"rating": 1.0, "review": "I got mine already. It sucks. It is constantly buffering no matter what, even at 480p. I have 10 other devices in the house that NEVER buffer. This thing plays 5 seconds, buffers for 10, plays 5 seconds, buffers for 10... It took 30 minutes to watch a 5 minute youtube video. Don't bother. Plus, this gives google direct revenue, and we all know they work for the NSA now, so......I'd go back in time and not buy this, and I got mine right away in the mail. The truth is, an hdmi cable from your PC is a way, way better option.Another frustration? Google Play music won't play side-loaded music on the chromecast. So if you want to hear the bootleg of your band from last Friday's show: No. In the year 2013, they released a media sharing device that is incapable of streaming mp3s WITHOUT VIDEO. Please explain this. I'll not be buying google hardware again.Oh, one more thing, somebody jailbroke this thing and got root and started playing with it so, you know, someday somebody might be able to USE the piece of shit for something, and they released an update to kill the root exploit right away.Basically: Google is evil now. The Chromecast is a Google product all the way, and not only that it sucks and doesn't provide the advertised functionality, and even specifically UNINCLUDES many basic features you would expect in a device like this that would've cost maybe $5 of development time to implement?One other thing: No SD card slot. I'm sick of Google not including SD card slots. I don't want your ghey cloud, I want to copy 50 movies from wherever I want, and then, you know, WATCH THEM. CAN YOU IMAGINE THE NERVE OF ME?!?!F Google. F them in the A.", "verified": false, "helpfulness": "9/50", "author": "Willy Gazina \"You'll get here someday.\""}, {"rating": 3.0, "review": "streaming issues for all NON Netflix/youtube and googleplay streaming services.  spoke to tech support and stated that they are working on compatibility issues with HBOGo and other services", "verified": true, "helpfulness": "1/2", "author": "Jeffrey Hwang"}, {"rating": 5.0, "review": "It's really hard not to like a little gadget that will stream YouTube, Netflix and Google Play movies/TV for $35 with more services coming soon. I've been using it for 2 weeks solid and really no complaints. Mirroring a browser tab isn't real good for video, but for doing presentations or having a custom screen saver it works fine, this feature is in beta so I'm sure it will get better, a lot of the performance is dependent on the machine doing the casting when you're mirroring, but only when you're mirroring as the built-in apps stream directly over Wi-Fi. I'll be picking up a few more for the other rooms.", "verified": false, "helpfulness": "2/3", "author": "J. Turmel"}, {"rating": 5.0, "review": "I was lucky enough to score one of these early on, with the free 3 month netflix trial. $35 for the chromecast,  minus 3 x $7.99 netflix is a cost of just $11.  - Brilliant.I should mention this was a short lived offer, and no longer available.Anyway, it arrived last night, and this is a first look review.Box - nice small square box and sleeve, contains the Chromecast, an HDMI extension (about 3 to 4\" - In case your TV has an awkward HDMI port), USB to Micro USB cable plus a power adapter, and some instruction.It's an HDMI dongle that plugs straight into the TV. Nice and simple (unfortunately it also requires power - wouldn;t it be fantastic it was also powered by HDMI too!). My TV happens to have a powered USB port, so I'm able to power it without unsightly wiring. Very neat little device.I used a PC with chrome browser to set it up, and connect it to my network. - just go to the website that's displayed on your TV on the chromecast channel. Chrome will download the widget / app that you need.Very easy to set up - you will need the WIFI password to your network.I did try to do this first directly from my Iphone, I was unable to get it to work via this method. - But via PC it was a breeze.Once installed I was able to hit the \"Google Cast\" button that is now in my browser, and it displays directly to the TV.So anything you can view in a browser, I think you can have on the TV - ie HBO GO  etc.Right now there are few apps available, netflix being the largest. - but others have hinted at being compatible soon - redbox, hulu, pandora to name a few.Being a bit more of an open platform than Apple, I think we will see some interesting things quickly.I then pulled my nexus 7 out, and that was also an easy install. - download the chromecast app, and then netflix, movies etc were able to be played from the internet.Seems the main difference form apple tv, is that the nexus is not sending/mirroring the info, but your content is being pulled directly to the chromecast from the cloud. ie I had a movie that came with the Nexus 7 - Transformers, I have previously deleted it. - It started to play directly on the chromecast, and left the nexus as a remote.So far, I like it, I will likely buy a few more for the other TV's in the house.- I mean, I can buy 3 for the cost of 1 apple TV. Great", "verified": false, "helpfulness": "3/4", "author": "Andrew Bishop"}, {"rating": 3.0, "review": "Yes, that's what it does: to replace HDMI cable to connect your mobile device to TV but limited to a few apps. Well, if you never knew about Apple Airplay, you'll love this and give it 5 stars, but people who have been using Apple TV would never buy this. Grandma doesn't have a smart mobile device to use ChromeCast, so don't give it to her, but Roku or Apple TV instead.", "verified": false, "helpfulness": "1/8", "author": "JT \"jtruongh\""}, {"rating": 2.0, "review": "The description says Chromecast works with \"Chrome for Windows\" -- which is not correct because it only supports Windows versions 7 and 8. It does not support XP or Vista but there's no indication of that in any advertising -- you only find out when you try to set it up. The web is starting to light up with people discovering this after they own the product.If you have an XP or Vista computer or laptop that you intend to use to control this device, it won't work.", "verified": true, "helpfulness": "4/15", "author": "steve"}, {"rating": 5.0, "review": "We received our Chromecast a few weeks ago and have really enjoyed testing it out.  It was fairly easy to set up but be aware that phones and browsers on computers need to download a Chromecast extension, which is not mentioned anywhere in the installation guides.  Set up is otherwise fairly easy if you know that tidbit.Thus far, YouTube has been the easiest to stream.  It decreases your reliance on a cell phone and the image quality is great.  We tried streaming from Chrome browser and with a laptop using wifi, we experienced a substantial amount of lagging to the point we though it was unwatchable.  From a computer using an ethernet cable, that lag time was a non-issue.  With so many TV shows doing online shows, I think this is going to be great.We recently received our free 3-month NetFlix code.  We anticipate that's going to be MEGA.  We've tried streaming Amazon Prime videos but that has been unsuccessful as it appears Amazon has blocked Chromecast.For $35, it has a lot of practical value and even if it doesn't, it's not that expensive of a toy.", "verified": true, "helpfulness": "3/4", "author": "Lesley Cheung"}, {"rating": 4.0, "review": "It plugs into your HDTV HDMI but require you to use an attached wire to connect to your USB port for power. If you don't have an available USB port then you'll have to connect to a power cord. The way it's advertise is just this dangle but reality is messy.", "verified": true, "helpfulness": "1/7", "author": "samk"}]