[{"rating": 3.0, "review": "great if you want to play stuff from your laptop or phone, but the sound quality is terrible, it sounds like a device from the 50s or somethin. easy installation. fix the sound quality and it gets a 5 star, till then ...", "verified": true, "helpfulness": "0/0", "author": "K. Fikri"}, {"rating": 4.0, "review": "Great device, easy to install and easy to use. There are only two minor issues: too few apps supporting it (basically youtube and netflix so far) and sometimes it's keeps playing videos after you try to stop them on your phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not as nice as a Roku or Apple TV.  Relies on an eternal device to stream to the Chromecast.  I prefer the Apple TV or Roku because only a wifi connection is needed.  Netflix,Hulu, MLB etc all run within the device.  They also have their own remotes in addition to smart phone apps.  Chromecast you need an Android device or your computer to control it.  No physical remote and no Iphone or Windows Phone app.", "verified": true, "helpfulness": "0/0", "author": "David Shute"}, {"rating": 4.0, "review": "A device with great potential held back with the lack of supported applications and services.  There are currently only six supported applications so there's not much variety you can use or do if you use multiple and different services.", "verified": false, "helpfulness": "0/0", "author": "Serge A"}, {"rating": 5.0, "review": "I love the Chromecast! I watch Netflix all the time through it. My only complaint is I wish they had more applications supported but I hear its coming soon. The picture quality is amazing and its really easy to setup and figure out. Everything works as promised so far! For the price..its awesome!", "verified": true, "helpfulness": "0/0", "author": "QuinnUSA"}, {"rating": 4.0, "review": "It was affordable , and works great. I Just was hoping HBO was on it as was rumored when i bought it.", "verified": true, "helpfulness": "0/0", "author": "MMRBZE"}, {"rating": 4.0, "review": "Already a great product! I can't wait to are it progress into a five star product (I am confident it will be there soon!)", "verified": true, "helpfulness": "0/0", "author": "Dustin Clifford"}, {"rating": 5.0, "review": "I love it. Works greatEasy to use to manage. Makes watchimg netflix a breeze. I would recommend to friends", "verified": true, "helpfulness": "0/0", "author": "robin"}, {"rating": 2.0, "review": "Had a hard time connecting... still can't figure out what it good for..Where's the \"low down\" on what thei thing is supposed to be valuable for ?", "verified": true, "helpfulness": "0/1", "author": "William Pell"}, {"rating": 1.0, "review": "Worthless.  All my TV's can already get YouTube and I don't watch Netflix.  Until they make this \"play anything from the web\" as advertised it sits in a box.", "verified": true, "helpfulness": "0/3", "author": "Mike Bradfield"}]