[{"rating": 5.0, "review": "I love it. Just get one! Everyone should have one if they have mobile devices and streaming media subscriptions. My most used apps are Hulu, HBOGO and Netflix. I wish Amazon Prime was on there.", "verified": true, "helpfulness": "0/0", "author": "Joshua J. Jowers"}, {"rating": 5.0, "review": "Easy to use, picture quality is excellent. Practically set itself up right out of the box. A must have for every android lover!", "verified": true, "helpfulness": "0/0", "author": "Andy Stoeckel"}, {"rating": 3.0, "review": "I thought I was going to get more content with this device than I already had available through the built in access on the TV. (I get Netflix and YouTube.) Getting the device itself setup was easy enough. And, I already use Chrome for my browser, so I didn't have to install that to be able to install the app to \"Cast\" the tab to my TV. However, I have not yet been able to install it to my Kindle, which would make control far easier, since I could have it in the same room as my TV. I'm not sure if I'll try very hard to get that to work, since my test with YouTube was terrible.I chose a lecture video that was about 48 minutes long, so I'd get a good feel for what is possible. However, when I went fullscreen, the quality was poor. I could have lived with that if I'd gotten more than just a still image with the audio streaming along behind that. I'm still in troubleshooting mode to see if I can get the video to play, but you know, it's a busy time (two days before Christmas) and I don't want to have to devote a lot of time to this. From what I've read so far, part of the problem may be that I keep a LOT of tabs open in several windows in my browser. (I use them instead of bookmarks, which I never seem to remember to go back to.) If I can't cast from one of those many tabs, but am forced to close most of them, that would not satisfy me.Another issue, which of course, I can't blame the Chromecast for, is that I was apparently mistaken about how much more options I'd have available with this device. It turns out that Xfinity from Comcast, only provides access to the same TV shows I already have paid service for. Kind of makes sense and that would enable me to watch them at a time that is convenient for me, hopefully without commercials, but so far, I haven't found anything worth watching that way. I had been considering a subscription to Hulu Plus, but then I found this review about the 3 main subscription options (Netflix, Amazon and Hulu Plus) http://www.digitaltrends.com/home-theater/netflix-hulu-plus-amazon-instant-video/ and it turns out that for what I'm looking for, Netflix, which I already have directly through the TV, is probably my best bet!That leaves me disappointed that this device may not do what I was looking for it it do. I'll continue to test and see if I can get it to work better, and will update the review if I do. But, if not, I likely wouldn't recommend it. (I would have given it only 2 stars, but preserved one extra because Google doesn't control the service options that are available. It was my fault for not researching and understanding this better before I made a purchase based on assumptions.)Returned item. It would have required too much of my computer power to cast the video from a browser tab. I keep a lot of apps and browser windows and tabs open, and given that it wasn't giving me anything different than I already had built into the TV, I decided not to bother changing my habit to accommodate the device.", "verified": true, "helpfulness": "0/1", "author": "Nan"}, {"rating": 3.0, "review": "almost almost in my expectations but i cannot play games or navegate chrome form the tab, just youtube movies and (i hope) netflix", "verified": true, "helpfulness": "0/0", "author": "pollos hermanos"}, {"rating": 5.0, "review": "This little device is great and revolutionary!  Easy to set up,quality looks amazing when streaming movies and you tube, I love this !!!! Buy now.", "verified": true, "helpfulness": "0/0", "author": "rajesh maharaj"}, {"rating": 3.0, "review": "For right now the unit has only several uses for me without paying for more service and when useing the unit it ties up the WiFi . On all the ads it never shows the unit also has to have a USB connection cable attached to it .", "verified": true, "helpfulness": "0/0", "author": "D. Bonigut \"SuzukiDave\""}, {"rating": 4.0, "review": "I rate it a 4 I like it, don't necessarily love it. Make sure you read that it's only designed for streaming Media Content, Videos in simple terms. You can't use it like a HDMI Cable where you can surf the web and do whatever else and display it on your TV. You have the option but it slows down your internet tremendously and half the time the pages don't load up right away. It's primary focus is display high quality video images to your TV, anything else will simply slow you down and ruin your experience, enjoy!", "verified": false, "helpfulness": "0/0", "author": "Darius"}, {"rating": 5.0, "review": "Have not really tested this product but it will stream HD videos in HD. It enables you to stearm video from your computer to TV.", "verified": true, "helpfulness": "0/1", "author": "ROY M. WHITE JR."}, {"rating": 5.0, "review": "I bought one as a gift for my mom. I tried it out first to see if it was any good, and I ended up keeping it and buying another. The amount of app support isn't huge, but it has the most useful for now. For the price you can't neat it.Pros: Great price, easy to useCons: none", "verified": false, "helpfulness": "0/0", "author": "john plaxco"}, {"rating": 4.0, "review": "This thing seemed like it would have worked fine.  I only wanted something to stream Netflix.  However, living on a college campus, I found that we implement something called \"device isolation\" which prevents the Chromecast from speaking with my phone, tablet, laptop, and pc on the network.  Since there is no actual remote control for this, I was unable to use it.  I went with the Roku LT instead.", "verified": true, "helpfulness": "1/1", "author": "zombilex"}]