[{"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "blondie"}, {"rating": 5.0, "review": "Love this! Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Becky Maksimyuk"}, {"rating": 5.0, "review": "I have two of these units and since purchase over 3 months they have worked well.The kids can connect from their tablets to play games or watch movies and the adults can watch netflix moviesGreat item to help the transition to 'full smart' tvsI will be buying an additional one this month", "verified": false, "helpfulness": "7/7", "author": "Louis Hernandez \"Sci Fi Guru\""}, {"rating": 5.0, "review": "Does everything its supposed to do and easy, painless set up.", "verified": true, "helpfulness": "0/0", "author": "Cesar"}, {"rating": 5.0, "review": "Excellent and very useful product for wireless operation between laptop and TV screen", "verified": true, "helpfulness": "0/0", "author": "Eduardo Uribe"}, {"rating": 5.0, "review": "I love this device, though it took me a while to figure out how to use it for what we wanted.  I should specify that we use it for only two purposes: to stream YouTube videos to TV and to stream videos I have downloaded myself.  (And if you have a Wii, you should be able to stream YouTube anyway.)I think the two Chromecast devices listed here on Amazon are identical, so you should be able to buy the least expensive one.  I bought mine through Groupon.  When I first got this device, I got the impression that you could use an URL made up of the path to your video to stream the video file directly to the TV, but that didn't work for me - it only streamed an image of the browser tab.  So here is what worked for me - remember, this is just to stream videos I have downloaded.  Before I used a program to burn them to DVDs, but I wanted to watch them and delete them instead.What ended up working for me was using Google Chrome as my browser (just for this purpose - I still use Firefox for regular browsing).  And then signing up for RealPlayer Cloud to upload to and store the videos.  Then when I play the video in the browser tab, I click on the Chromecast icon and send it to my TV via my wireless network.  To keep it free, I use the free version of RealPlayer Cloud, which means I can only store 2 GB at a time.  I store a few things at a time and delete them as I watch them.  If you need to store more, you can upgrade to the paid version.  But for all you know, you may already pay for a cloud-type storage service that is compatible to Chromecast. Check the storage website and see.  (Oh, and of course you can upload videos to your own You Tube account to watch this way, but the streaming seemed slightly less reliable to me, and there can be copyright issues. I had an issue with one video even though I uploaded it as private so nobody else could access it on YouTube. (It wasn't the show that caused the problem, but rather a song on the show.)  But YouTube should work for your own personal videos.You will of course have to set up the Chromecast device on your TV to be compatible with your wireless network.  There are instructions on the Chromecast website as I recall and it walked me through it. It worked on my DLink Wireless N300 router, and when we switched to a Century Link Wireless modem, it also works on that.We love it, because we already have way too many homemade DVDs of programs to watch, and sometimes they act up when they get too old.", "verified": false, "helpfulness": "0/0", "author": "Peter E. McGinn \"Author of  \"Dobro Dreamer\"\""}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "HADI ALMUTAIRI"}, {"rating": 4.0, "review": "Doesn't work with some apps on my samsung tablet.  Works great with my LG phone.  wish I could cast with more apps.", "verified": true, "helpfulness": "0/0", "author": "Fernando Alcaraz"}, {"rating": 5.0, "review": "Really nothing to say, it's a chromecast, they are awesome", "verified": true, "helpfulness": "0/0", "author": "Jeffrey B Sorrentino"}, {"rating": 1.0, "review": "Holy crap it's only good for four things wasting your time, money pissing you off and getting hot. Trust me you would rather light $35 cash with a lighter then buy this device or download this app..........btw if I could give it -5 stars I would! really do yourself a favor and give ANYTHING else your money trust me you'll feel better about it in the long run", "verified": false, "helpfulness": "0/2", "author": "Anthony M."}]