[{"rating": 4.0, "review": "I'm still learning what all this gadget can do but it seems pretty cool. I expected to be able to watch anything I would watch on my laptop thru the gadget but you are restricted to only a few apps that are compatible. I hope they expand on that to make it more versatile and enjoyable to use. I love the photo slideshow. The pics are beautiful. I sit and just watch them sometimes lol", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 4.0, "review": "I have an apple TV and was in need of another way to stream content to another TV.First off, the device s cheap which is a major plus.The installation/set up was easy, i highly recommend download the chrome cast app and that will guide you through the process.Personally i already own an Apple TV, and being int he ecosystem, i would have to rate this as a try for those in the apple ecosystem.", "verified": true, "helpfulness": "0/0", "author": "Desmix"}, {"rating": 5.0, "review": "Great when something exceeds expectations.  Seamless startup + intuitive operations.  Things just start happening and all at 1/3 the cost of our Apple TV units - don't hesitate to add these to your multi-media mix.", "verified": true, "helpfulness": "0/0", "author": "James Hopewell \"Jimi\""}, {"rating": 1.0, "review": "I went through all of the trouble to install this but it's going back.  Basically, it's a player for Netflix and hulu and apps if you want.  I thought I could surf wirelessly (is that a word) but I find myself stuck on videos  and can't figure out why I wanted this so bad.  I don't like it.  Not at all", "verified": true, "helpfulness": "1/3", "author": "Arya Giffin"}, {"rating": 4.0, "review": "You can search YouTube transfer to your TV  I really love it I recommend for people so far I don't have no problem with it", "verified": true, "helpfulness": "0/0", "author": "yordanos weldu"}, {"rating": 5.0, "review": "I cannot wait for more available options, I mainly use my phone for the remote and not a computer, like most people do. I wish games like Angry Birds and the web and apps like facebook and tumblr, and movies and photos that i have saved on my Nexus 4 could be sent to the tv, but I am sure google is working on that. Makes a great companion to my nexus 4.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "Hard to run from my PC lap top.  works well with my Android phone.  I have only used fro Youtube and Netflicks", "verified": true, "helpfulness": "0/0", "author": "John Chandy"}, {"rating": 1.0, "review": "i was talked out of buying an Apple TV because this looked to do more for a third of the price. Google tells you it is sooo easy to set up. That's just a lie. I've been working on it for three hours now, and no luck. Google says it works on a mac, but the install failed on my mac. I got the install to work on my phone, but then the device lost the network. I rebooted my router, and the device found the network for a few seconds then lost it again. Neither my mac, nor my phone, nor my ipad can find the device. The online help from Google is pathetic, and it is clear from many sites that this is a well known problem that I guess Google thinks it isn't false advertising to pretend doesn't exist. The Google help provided is written in such technical jargon that you have to teach yourself what all the terms mean just to make sense out of it.  I also learned that the device only works on a limited technical spectrum of routers, including not working on newer 5mhz's. I've wasted a lot of time on this, and it doesn't work. Completely disappointed. Now I get to waste more time returning it. Do yourself a favor and buy something else.", "verified": true, "helpfulness": "1/2", "author": "Chris A. Doerfler \"BadgerLawyer\""}, {"rating": 5.0, "review": "This is one of the best purchases to make your normal tv to a smart one :-) You can save 100bucks with Smart vs Non Smart tv", "verified": true, "helpfulness": "0/0", "author": "saroop"}, {"rating": 3.0, "review": "This is my second attempt with the Google Chromecast.  The last time I had to return it because it was not compatible with my Kindle 7HD or anything else I owned.I now have a CHROMEBOOD ... so I bought it again.IT WORKS ... (I am so incompetent with this stuff, and I got it to work pretty easily).MY BIG REALIZATION ... there is no REMOTE CONTROL when using the Chromecast.I've had the Kindle Fire Stick for a while, and despite it's remote's shortcomings, at least it has one.BTW I jumped on a sale Chromebood ... and am really surprised how much I like it.  It doesn't do everything, but neither do I.It does all I need.  Shop (mostly amazon) and use google for everything.It weighs not much, and the battery life really is about 7 hours (at least).My laptop was on its last leg, and a Chromebood is certainly a budget friendly alternative, that I actually like MORE than my laptop.OF COURSE both Chromecast and Kindle and Kindle FIrestick .... are not 100% with its own proprietary makers.Not all Amazon apps/services work on Kindle Fire, and there is another glitch for some things with Fire TVSAME with GOOGLE.  Chromecast does not have full integration with ALL the Google Apps and Services.GO figure.  It would make too much sense for each to have totally proprietary systems that don't even fully work with all their own other variations on their systems.", "verified": true, "helpfulness": "0/3", "author": "Jon"}]