[{"rating": 4.0, "review": "Love this! Wish there were more ways to stream right now, but they will come eventually.The Chrome-mirroring is slightly laggish. Even with the settings turned up all the way and an expensive router, this does not work very well. The screen is very choppy and does not update that quickly. Note that I admit I am using my wireless laptop to the wireless Chromecast, but if I am able to stream a 18Gb movie from my wireless desktop to my wireless laptop onto my projector, I think I should be able to cast a screen from my laptop to my Chromecast. Until this is optimized this is almost useless to watch videos off of. Website, sure.", "verified": true, "helpfulness": "0/0", "author": "Matthew T. Smith"}, {"rating": 4.0, "review": "Limitation:Only supports 2.4 GHz Wi-Fi.  This could be a serious limitation if you live in an area with Wi-Fi congestion as it will limit your ability to watch Hi-Def streaming videos.  Unfortunately I live in a apartment building, and I am unable to enjoy my Chromecast experience due to the congested 2.4 GHz band here.  I had to lower the streaming quality to accommodate for this, and it doesn't look that good.  My 5 GHz capable (or wired) devices, however, have no issues streaming the same content in Hi-Def.Setup:Super easy, just plug it in, power it up, and use your computer/tablet/phone to configure using simple to follow instructions.The good:It greatly simplifies watching streaming content experience.  You can use your phone/tablet or a chrome tab to stream the content on to your TV.It is a work in progress:For now, only apps that support Chromecast out of the box are Netflix, Google Play Store (Video and Music), and You Tube.  While other streaming content providers (HBO GO, Showtime etc.) are working on adding support, it might take some time for all your favourite streaming content providers to be on board and release their apps.  Just as an example, HBO GO app still doesn't work on latest version of android even though it was release some time back.Tip: Use the power adapter if your TV supports HDMI 1.4Reason: If your TV supports HDMI 1.4, and you have Chromecast plugged in to a separate power source, the TV with turn on auto-magically and switch to correct channel when you start streaming via Chromecast.", "verified": true, "helpfulness": "3/3", "author": "Superman"}, {"rating": 4.0, "review": "Though the Chromecast works well streaming video. It was a disappointment to find out that it does not stream video from the Chrome Browser on the iphone. Something Google should have been more upfront about", "verified": true, "helpfulness": "0/2", "author": "M. Firestone \"Mfire138\""}, {"rating": 5.0, "review": "Works great from my S4best of all I don't have to get out of my lazy boy to watch a movie.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This receiver was simple to setup and use. Since this is a Google product, the Chrome  browser should be installed on the pc before starting to make the process even easier. The transmission appeared to be smooth since the unit picks up the signal from the wifi router - currently an n spec.", "verified": true, "helpfulness": "2/3", "author": "R. Mackey"}, {"rating": 5.0, "review": "Allows us to watch Netflix etc on our BR TV using a smartphone as a remote. It works better than the smart tv in our family room and is much faster connecting!", "verified": true, "helpfulness": "3/3", "author": "RMA"}, {"rating": 5.0, "review": "Still in beta, so there is very limited use right now. Very well made, although the usb cable tends to be annoying if it sticks out at the side of your tv.", "verified": true, "helpfulness": "1/2", "author": "SeaShepherd"}, {"rating": 5.0, "review": "For $35, this device does a lot. VERY easy setup on any TV with an HDMI port, small enough to fit in said ports, and even comes with an extension in case it doesn't. Google is making it easy for app companies to add in the Cast functionality, so even though there are not many apps that cast to the Chromecast, remember: it's a new device with many possibilities. And for $35? Great purchase.", "verified": true, "helpfulness": "1/2", "author": "Kevin Lopes"}, {"rating": 5.0, "review": "I dont know about Apple TV, but what I know about this is, Its Flawless.It again reminds us how great Google Engineers are. I am an Engineer and appreciate the smartness of this device. And on top of it, its open source. Damn Google, I wish I was as smart as you :)I usually use Youtube and Netflix, and both work very well.35 is 5 cheapass burritos.Its dynamite.G", "verified": true, "helpfulness": "3/4", "author": "Gaurav"}, {"rating": 5.0, "review": "I don't understand all the negative reviews, if you read what the product offers then you should be more than happy with what its capable of.I set this up on my Galaxy S3, my Ipad, my gf's Kindle Fire and my laptop in 20 minutes max. I can see if your wireless is low end how this might be a pain. I have 15 mbps download and 3 mbps upload via WowTV and I swear the chromecast loads video faster than my laptop. I hooked this up to my Samsung bluray player on HDMI 2 and it worked great. When watching TV on HDMI 1 i could search for something to watch on my phone, tablet or laptop and hit the cast button and it switches inputs directly to chromecast and plays.All in all i am very happy with the purchase. BTW if Amazon is out of stock there are other options, I paid an extra 10 bucks at Tromo Electronics and got in in 6 days via Amazon.I hope they keep expanding this piece of technology. Very satisfied.", "verified": true, "helpfulness": "3/3", "author": "Eric R. Ulbrich \"bige1004\""}]