[{"rating": 5.0, "review": "OK forget those who engage in pouring this device down.  Does exactly what it is suppressed to do. There are some amazing apps out there that takes this device from oh yes to....... Yes set up is easy as pie. Runs off many devices.  So to be fair here I took it in vacation and did not work in the hotel we were in but that was only because their internet was snail slow.  Just buy this you will not be bummed", "verified": true, "helpfulness": "0/0", "author": "Paul J. Louviere \"Gumshoe\""}, {"rating": 3.0, "review": "It makes my wireless ping go through the roof. That is totally unacceptable when my brother and I play games on the same internet connection. It's great though if you have a laptop and want to watch a movie in a browser window, or need an easy way to show a youtube video.", "verified": true, "helpfulness": "0/0", "author": "Tony D."}, {"rating": 5.0, "review": "I purchased this for travel and general use.  There is not a day that goes by where we don't throw something up from our computers in the office to the TV using Chromecast.  Great little device for the money!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "I love using Chromecast! It's the cheapest and easiest way to connect a 'dumb' tv to all the streaming services (with the notable exception of Amazon Instant Video).When I first started using Chromecast, it was limited to a handful of apps. Now, though, it's an open API and developers can and do bake casting into their media apps. Netflix, HBO Prime, Plex and YouTube cover most of my media needs, and now they're all available on any TV thanks to Chromecast.", "verified": false, "helpfulness": "0/0", "author": "SMN"}, {"rating": 1.0, "review": "Not compatible with windows or kindle products. A clearer descriptive warning of incompatibility would've been appreciated. The product is therefore completely useless to me.", "verified": true, "helpfulness": "0/0", "author": "daniel gottshall"}, {"rating": 4.0, "review": "Chromecast has many uses. My wife loves using it to watch Netflix because she can control it from her computer or phone (our old Panasonic \"smart\" tv has a clunky user interface). I like it because I can watch Youtube on tv instead of on my ancient netbook. It can also stream any tab in the Chrome browser.However, it has many downsides and shortcomings. First, it only works with Google-approves apps, such as Youtube and Netflix. If you're using some other* videostreaming website, it won't stream directly to the Chromecast. However, you can stream the entire tab, but it's a strain on the computer and router. Streaming a video in a Chrome tab also results in a certain amount of stutter and lag in the video. Third, Chromecast can only be controlled with an Android phone/tablet or the Chrome web browser. I don't normally use Chrome, and installed it just to use the Chromecast. Fourth, no physical remote is currently available. A traditional remote control can be handled purely by feel, but controlling Chromecast with a web browser or smart phone requires looking down at the \"remote\". And now I have yet one more app running on my computer to manage. Finally, every time my wife leaves the room, she takes the 'tv remote' (smartphone) with her.*Google has stated that Chromecast apps must meet the same standards as Google Play, which means a degree of censorship, including a ban on any adult material.", "verified": true, "helpfulness": "0/0", "author": "jlinca"}, {"rating": 5.0, "review": "Very well made, bought as a gift for my nephew who is 16 and he enjoys it. Be aware though that you MUST use this in conjunction with a lap top or tablet etc. If you want something that is a stand alone, plug and play streaming device a ROKU is a much better option for you, although slightly more spendy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A must have. One of the best purchases I've ever made. I'd pay $60 or more since it provides so much functionality.", "verified": true, "helpfulness": "0/0", "author": "Mac"}, {"rating": 5.0, "review": "Supports my netflix, plex and youtube - my main goto vid apps.  for $35.Since they opened up the API, there's even more goodness.  for $35.", "verified": false, "helpfulness": "0/0", "author": "V. Truong"}, {"rating": 5.0, "review": "My family and I really enjoy using this product. We look forward to the addition of other apps through Chromecast.", "verified": true, "helpfulness": "0/0", "author": "E Ortiz"}]