[{"rating": 1.0, "review": "This isn't like a roku that hooks up to the wifi in your home, it streams directly from another device, and poorly.", "verified": true, "helpfulness": "0/0", "author": "Janie S Lyons"}, {"rating": 1.0, "review": "Chromecast is difficult to set up and difficult to keep working.  The technical help line wasn't much help.  I don't recommend this product.  If you want to stream NetFlix from your iPad, I recommend an HDMI cable from the Apple Store.", "verified": true, "helpfulness": "0/0", "author": "David Beck"}, {"rating": 1.0, "review": "Garbage.  Worst deal ever.  Co nects for a few seconds and loses the signal.  Googles recommendations do not work and to date have found no venue of real help", "verified": true, "helpfulness": "0/0", "author": "W. Lewis \"pfotologist\""}, {"rating": 2.0, "review": "It is ok... tryin to get it to work... have not tried it yet to figure it out. thanks though", "verified": true, "helpfulness": "0/2", "author": "Diana Moles"}, {"rating": 5.0, "review": "Quick and Easy to install no v special skills needed.  Works as advertised, had it up and running in minutes.", "verified": true, "helpfulness": "0/0", "author": "James Simpson"}, {"rating": 5.0, "review": "Excellent way to smarten up a tv that doesn't have apps.  Wish that other apps supported chromecast (prime video) but more seem to be converting all the time.  Will end up purchasing more of these as gifts.", "verified": true, "helpfulness": "0/0", "author": "Jason Zurawski"}, {"rating": 3.0, "review": "I thought this would be very easy. I had problems so I gave up and just got a Roku. Gave it to the daughter she says it does what it should from ipad. I was using a Pc.", "verified": true, "helpfulness": "0/1", "author": "ray m"}, {"rating": 5.0, "review": "This device is cheap and simple to use. I like watching Netflix and Youtube. I recently purchased another one for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "B. Fleming"}, {"rating": 5.0, "review": "Loving this item!  Netflix, etc works beautiful on my TV.  I would recommend this product to anyone who wants to watch alternate programs.", "verified": true, "helpfulness": "0/0", "author": "rosalyn stein"}, {"rating": 5.0, "review": "...but limited. It's a great little device for throwing a YouTube, Netflix, or Pandora onto the big screen and through your entertainment system, but it would be nice if they broadened the horizons a bit. Also, there is somewhat of a minor decrease in audio quality when casting from a mobile device as opposed to a computer. Maybe it's me...", "verified": true, "helpfulness": "0/0", "author": "S"}]