[{"rating": 4.0, "review": "EDIT: turns ot it was I just needed to try a new HDMI cable.  Now works great! Still only 4 stars because I would like more apps the are compatible with Xfinity, but hoping that will grow with time. I am more than willing to wait.I'm a prime member and got this to pretty much watch prime content and some other channels. I was disappointed when I learned Comcast didn't support the Showtime to go app, but figured it was fine, I really just wanted to watch prime content anyway. I was excited when I received my first Fire, but quickly realized it would not stream prime content. Now I could stream their trailers and Pandora and ESPN live apps worked great, but when it came to watching a movie or show I just got a black screen. I could fast forward and rewind, and most times it would even show the picture in a small box so I would know which part of the movie I was in, but when I'd go to play it, I got nothing but blackness. Contacted support, did the numerous restarts, unplug, reset data, go back to factory conditions, etc, but nothing, and was told its my ISP. My iPad and laptop had no issues streaming live whatsoever, so figured it was just a defective box.  So I ordered a replacement (customer service was fantastic and I got the box on the second day) and was excited to have this one work. But I just got it today, and again, I just get the black screen and can see the picture in the small fast forward and rewind box. Such a huge disappointment and going to have to send this one back too. Time to find another option as this one clearly missed all expectatations.", "verified": true, "helpfulness": "0/2", "author": "DBM"}, {"rating": 1.0, "review": "I was totally excited to get this, but it won't connect to my ethernet--the cable works fine when connected to my smart tv.  I tried the limited troubleshooting options available, i.e. check connections;  power box, modem, etc., off and on with no luck.  Where's the help desk when you need it?  Seems that the Ethernet port is inop.  With family visiting this weekend, we had high expectations of testing fire tv.  Completly disappointed.  I've wasted enough time on it--it's going back for a refund.", "verified": true, "helpfulness": "1/6", "author": "J"}, {"rating": 4.0, "review": "I love the fact it was pre programmed with my account info, it took all of two minutes to set up.  This system is currently being used in the master suite, and I also run a roku 3 in the living room.  The Fire TV has much less buffering.  The only downfall is that when searching something in Roku it gives the options of viewin (if on Amazon, Hulu, Netflix, Etc) wheareas Fire TV only gives Amazon results.", "verified": true, "helpfulness": "0/0", "author": "Adam Young"}, {"rating": 5.0, "review": "Product is very useful. Setup was easy and voice command is accurate. Everyone who I've showed it to so far can't wait to order one for their home!", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Amazing and one of easiest, most seamless installations I've ever experienced.Plugged it in and the device immediately located the wi-fi without me touching anything.Put in my password for the wi-fi, and it upgraded the software, again without me doing anything!5 minutes from the box to watching all of my videos and tv shows stored on my Amazon video library.From Amazon Prime, to my Kindle and now Amazon TV, I am definitely a believerThanks Jeff and all the best to the people that make this stuff work!!and no I don't work for AMZN nor was I paid to shill the product", "verified": true, "helpfulness": "1/1", "author": "Shawn James"}, {"rating": 5.0, "review": "Best thing since sliced bread !! Say Adios Cable and Satellite.... Can you say \"my TV is on Fire\" !!! Oh yeah can you say no commercials?", "verified": true, "helpfulness": "0/0", "author": "Nulter \"Nulter\""}, {"rating": 5.0, "review": "Got it on sale and it gets Amazon Prime, as well as Netflix. My LG products do not have Amazon Prime which is the only reason we got it. The voice search and speech recogniton and the other features were just big bonuses for us.", "verified": true, "helpfulness": "0/0", "author": "D. B. Gore \"IT guy\""}, {"rating": 4.0, "review": "Voice command works with my voice. I problems with other type devices recognizing my voice.", "verified": true, "helpfulness": "0/0", "author": "Prfikt"}, {"rating": 5.0, "review": "I'm so happy I bought this item.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have an apple TV and now the Amazon Fire TV and there is no comparison we absolutely love our Amazon Fire TV.  It is so easy to use and the voice search is great.  We never use the apple TV anymore and of course as a Prime member the free movies are great.  The only thing I wish is that it wasn't so expensive to rent movies as we still use Red Box for rentals because it's significantly cheaper then the average of $5.00 + for the Amazon movies that aren't part of Prime.  Movies and content down load very quickly and my husband and kids are forever surfing the web and watch UTUBE as well.", "verified": true, "helpfulness": "1/1", "author": "T"}]