[{"rating": 5.0, "review": "I bought the Chromecast because my Roku died. Things sure don't last long anymore :( Chromecast broadcasts Netflix to my TV, which is exactly why I purchased it. It plugs into the HDMI port on the TV and I've also plugged mine into house current as opposed to the option of plugging it into a USB port for power. It was easy to set up- after an update- and simple to operate. I'm told it doesn't do much more than that for now, but THAT is exactly why I bought it :) I tried to run it through my XP computer, but it wasn't supported, so I run it through my Windows 8 computer with no problems. I recommend it!", "verified": true, "helpfulness": "0/0", "author": "L. Smith \"Loriell\""}, {"rating": 3.0, "review": "Use this at home and at work, there are some issues with its intermittent connectivity. Dont see this as a AirPlay substitute purely because full desktop sharing is still in BETA and is somewhat slow.", "verified": true, "helpfulness": "0/0", "author": "Ernest"}, {"rating": 5.0, "review": "Excellent buy. I bought it and have not stopped using it. We watch movies and tv series from netflix. Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Filippos Karanikolas"}, {"rating": 5.0, "review": "Awesome value for the money. I highly recommend trying this out for some TV in your home. We love it and great price.", "verified": true, "helpfulness": "1/1", "author": "Carrie T Brady"}, {"rating": 3.0, "review": "It does work, but I do not use.  A smart TV is the better way to go and I did not have one when I bought this.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Super produit,  Installation rapide et facile par contre non disponible au canada ! , je le recommande a mes amis", "verified": true, "helpfulness": "0/0", "author": "Stephae"}, {"rating": 2.0, "review": "In my office I do not have television service so I put the Chromecast onto the tv and operate it from my computer. The only difficulty is I cannot work on the computer while viewing something from Chrome while maximizing the view on the screen. It does work well usually although it worked very well from my computer and from my phone but my ipad cannot see it.", "verified": true, "helpfulness": "0/0", "author": "Cliff Davis"}, {"rating": 3.0, "review": "The apps on it are cool (amazon,netflix) but would be better if you could play media already on your net work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I used it to watch Netflix from my iphone. On several occasions, I lost the ability to control (pause, rewind, etc.) the show from my phone and had to unplug the Chromecast to reset it.", "verified": true, "helpfulness": "0/0", "author": "Jason Hull"}, {"rating": 5.0, "review": "I love this Chromecast. It took about 2 minutes to set up with our home wi-fi and I was able to immediately start streaming Netflix! It saves us having to hook up the laptop every time we want to watch a show or movie on Netflix. Might not seem like a big difference to some, but this discreet piece of technology is perfect for our home!", "verified": true, "helpfulness": "0/0", "author": "Gabrielle May"}]