[{"rating": 5.0, "review": "Excelent product. Nice relation between price and quality", "verified": true, "helpfulness": "0/0", "author": "Matias"}, {"rating": 1.0, "review": "Constantly lags regardless of the device used to stream content.  Waste of $35.", "verified": false, "helpfulness": "0/1", "author": "AMM \"andrew__m\""}, {"rating": 1.0, "review": "Does not work with my router", "verified": true, "helpfulness": "0/4", "author": "Jackie Bradley"}, {"rating": 5.0, "review": "Works well with Netflix, HBO GO, Google music,and Pandora.  I just bought another one for the TV in the den.", "verified": true, "helpfulness": "0/0", "author": "M.P."}, {"rating": 5.0, "review": "I really prefer Chromecast to any other streaming device. It is tiny and thus hides behind the TV. It is controlled through a smartphone, which is a lot easier and far less tedious than using a remote control. The only downsides is that Google is still building its network of streaming services supported by Chromecast (it has the big ones but not many of the smaller ones) and it must connect through an HDMI port (I had to buy a different device for a TV that didn't have HDMI).", "verified": true, "helpfulness": "0/0", "author": "Jeff J \"Jeff\""}, {"rating": 5.0, "review": "this is a great device for streaming video from phone or tablet to big screen tv.  easy to install and i have had no problems setting up and using. pretty much turns your tv into a smart tv with all the apps available now.", "verified": true, "helpfulness": "0/0", "author": "Jude Altazan"}, {"rating": 4.0, "review": "di not need it", "verified": true, "helpfulness": "0/1", "author": "William T Heath"}, {"rating": 1.0, "review": "Seems to work OK, however does not pick up WiFi signal! Both phones, tablets, and laptop will pick up that WiFi signal, so not very helpful......😬", "verified": true, "helpfulness": "0/1", "author": "Hm S."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/2", "author": "Aek"}, {"rating": 3.0, "review": "Great on what few Chromecast-optimized sites there are (Netflix, YouTube, etc.), but close to useless everywhere else.  Tabcasting of non-optimized sites amounts to a glorified slideshow; even with a fairly tricked-out Ivy Bridge i5 pushing to the 5GHz band on a dual-N router and leaving the 2.4GHz channel to the Chromecast alone, the results stutter and drop frames to such a degree that the end product is basically unwatchable for any length of time.  If that system on a 30Mbps connection is insufficient to produce a watchable stream, what can?  Does tabcasting even work with a Haswell i7 on FiOS?  From what I've seen I sort of doubt it.  It does work extremely well on the optimized sites--the Netflix image and sound is at least as good as that produced on my PS3, without the fan noise and at a fraction of the power consumption--so it's fine for use on a secondary screen, or if you don't use Prime Instant Video or other random non-optimized sites.  I use both of these, however, and have to say I probably would've been better served just getting a WiDi unit.  Just something to consider if you're in a like situation, as to hardware and viewing preferences.", "verified": true, "helpfulness": "0/0", "author": "N. Bax \"lucky duck\""}]