[{"rating": 5.0, "review": "Awesome product!!!! Ok, I'm not the most advanced techno whiz in the universe but even I can install, register and use the Amazon Fire for TV without calling my husband or best friend for \"tech support!!\" Especially love the voice activation feature, took a few attempts with enunciation but the device quickly absorbed my voice and responds well. Definitely recommend :)!", "verified": true, "helpfulness": "0/0", "author": "Kathy M \"Kathy M.\""}, {"rating": 2.0, "review": "Did not work with my Sharp Aquos's HDMI port. The Roku 3 did work though, so, I don't know whats the deal with that, but it was no go even when they sent a second Fire TV to try out.", "verified": true, "helpfulness": "0/1", "author": "Hendrick Mcdonald"}, {"rating": 5.0, "review": "We love the Amazon Fire TV! The apps work really well and are seamless for Netflix and Hulu as well. We'd love it if we could get the Showtime anytime and HGTV apps on it. I was pleasantly surprised in how good the voice search works as well.", "verified": true, "helpfulness": "0/0", "author": "Allison Horner"}, {"rating": 5.0, "review": "Item arrived as promised.  Love love love this device.  Purchased one to test out but will be buying more so that we can get rid of cable  and overcharging by cable company.  We have had zero issues using the Amazon Fire TV box and remote and easily have found every show our household watches.", "verified": true, "helpfulness": "0/0", "author": "Kelly Ilebode"}, {"rating": 4.0, "review": "I don't have cable.  I'm a NETFLIX user.  I got Amazon Fire to see if they have different movie than Netflix.  They do!  They also seem to have more TV-series on Amazon Fire.  I do find that SOMETIMES Amazon Fire will charge for a movie but if I go to Netflix I can watch it for free.", "verified": true, "helpfulness": "0/0", "author": "Virgo Shopper"}, {"rating": 5.0, "review": "I just love my Fire TV and plan to purchase another soon.  The apps are great, no issues with the voice recognition, streaming my music is wonderful.", "verified": true, "helpfulness": "0/0", "author": "T. Cooke"}, {"rating": 5.0, "review": "No regrets. I will definitely recommend To a friend", "verified": true, "helpfulness": "0/0", "author": "Ruth"}, {"rating": 3.0, "review": "I've had the FireTV for about 6 months and I love the interface, the 3rd party app look and feel and the instant access to Amazon Prime Instant Video.That said I really hate this thing.  I've encountered bug after bug after bug.  Apps keep logging me out (I.E. Netflix), the voice search only searches Amazon's stuff, some apps don't close properly and I have to press the back button over and over and over again, EVERYTHING is 'cloud' based so if you lose connection it's a brick, completely random freezes and restarts (like in the middle of a movie and no update random).Also after using it for so long I'm starting to feel like the home screen is just redundantly crammed with stuff.  Once I start to see the same 2 or 3 series and movies over and over while navigating the home menu I start to question the necessity of a lot of the categories/sub-menu's.  I get it Amazon, you has video.  GMAFB!", "verified": true, "helpfulness": "0/0", "author": "Solomon Arrington IV"}, {"rating": 5.0, "review": "Mechanically/digitally great.  On screen directions for Amazon Prime confusing.  Had to backtrack and regroup to accept.  Operates seamlessly……….obviously you are one step away from becoming cable substitute - everybody hates their cable provider.  WooHoo", "verified": true, "helpfulness": "0/0", "author": "Scott A. Krueger"}, {"rating": 5.0, "review": "I am very glad and happy I got Amazon Fire TV.  Absolutely great! Gave away my Roku2, and moved my Apple TV to kids room from Living room.  I can play more movies and music Amazon app and other apps available.  Using AirBuddy to airplay my stuff from iPhone and iPad, and as Amazon Prime member for many years, this is just one more great thing to have both Prime and Fire TV.", "verified": true, "helpfulness": "0/0", "author": "MichUml"}]