[{"rating": 1.0, "review": "I bought this device to wirelessly send content from my laptop to the TV.  It works fairly well with Windows 7 or on my Android tablet, but will NOT work with both.  That is to say, the Chromecast can be configured to work with the Win7 laptop and then the Android tablet will not work.  Or, you can configure the Android tablet to work but then the Win7 laptop will not work.  Also, if you read the description on Amazon VERY CAREFULLY you will discover there is no claim made that the Android chrome browser will work with the Chromecast.  Thus, 1 star from me.", "verified": true, "helpfulness": "0/2", "author": "R. Armaugh"}, {"rating": 4.0, "review": "You want this.You really want this, and at $35, you have nothing to complain about.Works with Netflix, Pandora and Chrome.  Also works from my Moto X phone.Anything you do ,like magic, on to the TV.  My stone-age self is amazed.", "verified": true, "helpfulness": "1/1", "author": "T. Tyler"}, {"rating": 2.0, "review": "It only works well with streaming video from YouTube or NetFlix. Don't expect much about its capability of streaming video from other formats.Google Chromecast  will not become popular if it does not overcome its limitation and the capability of streaming other video formats such as Adobe flash, flv. etc.", "verified": true, "helpfulness": "0/1", "author": "Kenny Nguyen"}, {"rating": 5.0, "review": "Second one I have bought, easy to set up and allows me to stream darn near anything to the big screen. I have Roku devices but they are very limited in function.", "verified": true, "helpfulness": "1/1", "author": "Yup"}, {"rating": 5.0, "review": "this item works as intended, well made, functions properly. good level of comfort fairly cheaply priced wont need to replace any time soon", "verified": true, "helpfulness": "0/0", "author": "s. f."}, {"rating": 3.0, "review": "Verdict is still out. Works ok with hubby's laptop but so far I have not been able to connect it to my  LG Showtime Optimus phone. Some info online says it will do android, other info says no. I am disappointed about the enclosed directions, not a lot of info or any troubleshooting advise. The booklet is about 1\" wide by 2\" tall and maybe 6 pages. Will review again in a few months.", "verified": true, "helpfulness": "0/0", "author": "Sharkstew \"NewfieMom\""}, {"rating": 3.0, "review": "Chromecase is Googles answer to AppleTV. For the PC user this might be a good alternative. I wasn't impressed enough to continue using it.", "verified": true, "helpfulness": "0/0", "author": "KBroadhead"}, {"rating": 3.0, "review": "Missing featuresWired network connection. This is a streaming device, needs stable network connection.Support for 5GHz wifi.Support for hidden networks.Turn off control light. It is annoying to see it behind the tv, especially when it's blinking.It does well what it supports. YouTube and Google Play work without any problem in the UK.Chrome plugin now has experimental screencast (20 November 2013). It is working but needs a little more work, i.e. to fit the screen because now top and bottom are not visible. This is not casting a tab, it is mirroring the entire computer screen and only works on computers yet.It is not switching on Panasonic Viera TX-L42B6B TV. It's not switching inputs either.I don't know if this is a software issue in Chromecast or an issue with the TV. The TV does switch to other HDMI sources automatically.YouTube play settings like Annotations, speed and quality are not applied to Chromecast when selected in Chrome browser on a laptop.It seems it always tries to play the highest quality what makes some videos not play because connection speed is too slow for HD quality and never stops buffering.I had many issues connecting Chromecast to my wifi network. After spending long time with trying out different settings I found the issue was that router was set to use a specific channel and for some reason Chromecast couldn't see that channel (I think it was 12). It worked with another channel though.Update 23 November 2013It seems there was a software update (definitely to the Android app) and now all available wireless networks are listed in app including hidden ones and hidden can be set to Chromecast and it works with it. Hooray.", "verified": true, "helpfulness": "1/1", "author": "jbtibor"}, {"rating": 3.0, "review": "was a little tricky to work at first, but as soon as i got the hang of it i dont see how i lived with out it. thanks", "verified": false, "helpfulness": "0/0", "author": "Joan A Gray"}, {"rating": 5.0, "review": "This is an easy review. You cannot buy a more useful piece of tech for $35. This device fits my needs perfectly. Between casting YouTube and Google TV/Movies it does it all....well...just about. The only thing missing is Amazon Instant integration. Fingers crossed for the future but not holding my breath.", "verified": true, "helpfulness": "0/0", "author": "Brian"}]