[{"rating": 5.0, "review": "How cool is this?  I look up a youtube video on my tablet and \"throw\" it to the TV.  Love it!", "verified": true, "helpfulness": "0/0", "author": "FoodieB"}, {"rating": 5.0, "review": "This is an amazing product and works excellently on my home computer. Sadly couldn't get it to work on a school network. Looking forward to the updates just announced at Google I/O 2014.", "verified": true, "helpfulness": "0/0", "author": "M. Glavanis \"Michael\""}, {"rating": 5.0, "review": "Love it, good for the price and works as well or better than the other high end expensive gadgets.No need to buy a smart tv because its converted mine to one.", "verified": false, "helpfulness": "0/0", "author": "Gee74"}, {"rating": 4.0, "review": "It works great. The only thing missing is Amazon videos.it is simple to install and work exactly have promised.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Died after 3 months. Apparently, it's widespread. Prior to that, I liked it. Amazon does not seem to offer any warranty other than their standard 30 days. Disappointing. Sticking with Roku from now on.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This tiny and amazing device surpassed my expectations. It is capable of much more than advertized. I will be ordering at least one for each room. You might do the same.", "verified": true, "helpfulness": "0/0", "author": "Iboschi"}, {"rating": 1.0, "review": "This sounded like a great idea but it lags so much content is not watchable! I have read online that this is a common problem with streaming anything other than the few sources that are promoted for the product (Netflix, etc). I have very high speed internet and stream videos at the lowest quality and it still doesn't work. Once you set it up, you find out this is only the beta version of their software and that says a lot. I've had this product for about 4 months now and still no software updates. Not to mention you can only stream from Chrome, not other browsers, nor from iTunes, and Chrome on Apple barely ever blocks pop-up ads - very annoying!It is a waste of money until they fix their streaming problems.", "verified": true, "helpfulness": "0/0", "author": "Wiren"}, {"rating": 5.0, "review": "Love this device. Great yo be able to stream content or share my laptop screen to my 60 inch samsung TV. No more using video cables or audio cable to get picture and sound. Liked it so much I bought another for my kids room. Easy to use and set up", "verified": true, "helpfulness": "0/0", "author": "Ray Subias \"Dracalon\""}, {"rating": 1.0, "review": "I may have gotten a defective product because it didn't connect most of the time and when it did connect it never seemed to be performing as I wanted it to. I returned it for a Roku and am now happy.", "verified": true, "helpfulness": "1/1", "author": "KevinE \"~°~\""}, {"rating": 3.0, "review": "at least for net flix, there are so many other competitors out there with smart tv's etc, that this is a convenient item to keep for travel, etc.  It needs an HDMI and a Micro USB for power.", "verified": true, "helpfulness": "0/0", "author": "mraxiomatic \"mraxiomatic\""}]