[{"rating": 4.0, "review": "Bought this for my boyfriend, he loves it!", "verified": true, "helpfulness": "0/0", "author": "Chirriluv"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Brent Snarr"}, {"rating": 4.0, "review": "Does everything as promised... Wish it could stream from internet to the chromecast but it wasn't advertised to do so... And even with some recent ways to get around it it's not that stable and can skip over wifi... Otherwise makes my TVs smart without having to upgrade! :)", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Google I don't care if you take over the world because this affordable, awesome little product has changed my life.  You need an HDMI port on your TV and a USB to charge it and that is it.  So simple to use - we live in the country near the coast and don't get TV signal and satellite is ridiculously expensive, but we have affordable Wifi and we can stream anything from out computers or phones right to our TV without issue.  YouTube / Netflix / etc.  The only thing that would make it even better is if it worked a little better with Amazon (it streams prime, but not as seamlessly as other websites.", "verified": true, "helpfulness": "0/0", "author": "bernie"}, {"rating": 1.0, "review": "Bought in hopes to have great wireless HDMI streaming with netflix and other popular sites; however, even with the Ultimate Verizon wifi speed, this chromecast buffers and lags ever 5 seconds. Useless heap of 35 dollars.", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 5.0, "review": "very simple to use.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 4.0, "review": "i love how easy this is to set up and use.  I have the S4 and it plays my netflix, youtube and pbs for kids directly onto my tv when we turn it on from the phone.  For someone who doesn't watch much tv, this is a great little streaming device.  Even my son who is 3 1/2 knows how to turn it on.", "verified": true, "helpfulness": "0/0", "author": "Lena Fung \"happy camper\""}, {"rating": 5.0, "review": "Love it! and it was easy to install.", "verified": true, "helpfulness": "0/0", "author": "bonnie1965"}, {"rating": 5.0, "review": "Great buy, and new apps are becoming available all the time. We cut the (cable) cord in our household, and this is a great way to make all your televisions able to stream media!", "verified": true, "helpfulness": "0/0", "author": "S. Griggs"}, {"rating": 5.0, "review": "I got two of these.", "verified": true, "helpfulness": "0/0", "author": "Anthony Camilo"}]