[{"rating": 5.0, "review": "Very satisfied! I love this so much! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Eilrahc Alleba \"Charlie\""}, {"rating": 5.0, "review": "Easy to hook up  and lots of programs. Excellent purchase", "verified": true, "helpfulness": "0/0", "author": "Gary D. Mortimer"}, {"rating": 5.0, "review": "Fast, smooth, great picture, exactly what I needed.", "verified": true, "helpfulness": "0/0", "author": "A.Richardson"}, {"rating": 5.0, "review": "THE premier alternative to overpriced and contract-binding cable company confines!", "verified": true, "helpfulness": "0/0", "author": "Allisonlenee"}, {"rating": 1.0, "review": "Brand new out of the box and the port for the DC plug is loose. If the box is moved at all, the power goes off, then on again. It is not the DC cable as I tried a different brand new DC plug and the problem persisted.I ordered a replacement from Amazon using chat. That process was seamless and painless. The new one arrived within a few days for free. I can print the return label for this dud and send it back without paying for shipping.However, I still give this one star based on receiving a dud.If the replacement works good, I will give it a better star rating.", "verified": true, "helpfulness": "1/4", "author": "Jay Usher \"Jay Usher\""}, {"rating": 5.0, "review": "Great in every aspect.  Superb picture  and sound.  Great selection of movies, TV, games, and apps, especially if you are a Prime member.  Well worth the cost.  If I get decent reception for local channels via a HDTV antenna, I will use those with Amazon Fire/Prime for my viewing needs and \"cut the cable\" of my satellite service - This will save me $1,200/year!.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "So far so good! It's super easy to set up! Works fast and the picture is amazing", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "I love the Amazon Fire TV!!! I replaced my ATV2 with this unit and havent looked back. I have purchased one for my parents and also my mother in law. The controller is great and very easy to use.  I recommend to everyone who is looking for a HTPC!", "verified": true, "helpfulness": "0/0", "author": "Andrew Mckenna"}, {"rating": 5.0, "review": "only problem must enter pin number each time you watch a show if pin is setup", "verified": true, "helpfulness": "0/0", "author": "James R. Kelley Jr"}, {"rating": 5.0, "review": "Nice product. Setup was a snap. Picture and sound quality are good and is easy to use and navigate", "verified": true, "helpfulness": "0/0", "author": "Michael E Hendrix"}]