[{"rating": 5.0, "review": "\"One of the best inventions since sliced bread\"I hate that I waited so long to order one of these! We use it all of the time, easy set up and use. For some reason my kids Samsung Galaxy Tab 4 \"is not optimized to be used with this device\" however my Samsung Galaxy Note 3 and S3 work great with it as well as my Dell desktop HP and laptop.", "verified": true, "helpfulness": "0/0", "author": "Tiffany Farmer \"Jorjiagurl\""}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "cj"}, {"rating": 4.0, "review": "Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Carolee Condon"}, {"rating": 5.0, "review": "excelent product", "verified": true, "helpfulness": "0/0", "author": "RFARFAN"}, {"rating": 5.0, "review": "I got this for 12 year old for christmas and it was an instant hit. She moves it from her room to the living room.  It is so good, I am getting an additional one for the living room.  Great product that is very easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great product, great seller! everytihing was according to the offer", "verified": true, "helpfulness": "0/0", "author": "Ivan G. Ramon C."}, {"rating": 2.0, "review": "Doesnt stay connected.", "verified": true, "helpfulness": "0/0", "author": "dp1ahc"}, {"rating": 5.0, "review": "Love my ChromeCast.  It has helped us cut the cord to cable.  Supports many different apps.  Well worth the price.  Delivers high quality video and audio.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "I can't speak too much for the other aspects but this works great with plex. It's nice not needing to have another remote and just being able to control with your phone.", "verified": true, "helpfulness": "0/0", "author": "cstewart"}, {"rating": 1.0, "review": "Does not seem to work as advertised.  Unable to get it and the computer on the same wireless network.", "verified": true, "helpfulness": "0/1", "author": "Lawrence I. Schneider"}]