[{"rating": 4.0, "review": "Great price . some glitches but overall I'm satisfied.", "verified": true, "helpfulness": "0/0", "author": "amy rheams"}, {"rating": 5.0, "review": "Not on satellite or cable tv...Amazon fire TV is a bonus find!  Easy to install and connect to our internet carrier, coupled with Amazon Prime we always have movies to watch for free and purchased, are as reasonable as Pay per view.  Voice search works like a dream. And we got the unit on sale!  Cannot compare to the competition...but we are very happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Msr"}, {"rating": 3.0, "review": "Performance of the system is definitely better than using our PS3 or Sony Blu-ray player fo accessing Amazon Instant Video, but I would like the capability to store some content locally so we don't always have to drive up our broadband usage for content we have purchases.  I would also like more granular controls on the remote - especialy better ability for slow motion.  Another positive is the voice search - that is really useful.", "verified": true, "helpfulness": "0/1", "author": "DM in Atlanta"}, {"rating": 5.0, "review": "Worth every penny.  The amount of", "verified": true, "helpfulness": "0/0", "author": "gonzo"}, {"rating": 5.0, "review": "Work better than I expected", "verified": true, "helpfulness": "0/0", "author": "Joseph E. Bakaitis Jr."}, {"rating": 5.0, "review": "Super fast and voice search works great! Would recommend buying this for anyone.", "verified": true, "helpfulness": "0/0", "author": "dw"}, {"rating": 5.0, "review": "Almost instant playback on most videos; excellent picture; I bought two and will get a third one soon to have one connected to all my TV's, I don't like the fact that it doesn't have an off or sleep button", "verified": true, "helpfulness": "0/0", "author": "J. G. Mejia"}, {"rating": 5.0, "review": "Works great streams really well.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 5.0, "review": "Love it.  Am tired of being a slave to comcast tv.", "verified": true, "helpfulness": "0/0", "author": "JoAnn McCann"}, {"rating": 5.0, "review": "It is totally awesome! Am dropping direct tv", "verified": true, "helpfulness": "0/0", "author": "warren w evans"}]