[{"rating": 3.0, "review": "I purchased this with the HOPE that I could skip hooking a PC directly to the TV and essentially convert a regular HDTV into a smart HDTV.  A few weeks of research and experimentation later I can report that, yes, I have turned a regular HDTV into a smart HDTV using the Chromecast player but...  you will need some additional components.  Mainly you need Plex server running on a PC and you need to be able to wirelessly connect to the PC that the Plex server is running on.  You  need to setup the Plex server and all the things that go with it and you need to have the android version of plex running on an android, apple or windows phone or tablet.  If you are willing to do all of that, it works well with a strong WIFI signal.  If your WIFI signal is weak at the Chromecast location you will need a WIFI repeater to boost the signal.", "verified": false, "helpfulness": "0/1", "author": "davidger80"}, {"rating": 1.0, "review": "I bought this on Google Play the day it was released. At face value this seems like the deal of the century and such a great idea.After months of ownership, I still have not been able to use this successfully for 1 actual thing I've wanted to do with it.First, it runs only on the 2Ghz WiFi band. So if, like most people, you want to stream something something in HD that uses a lot of bandwidth it'll stutter and be completely unwatchable. I've tried to use my laptop and my nexus 10 to stream to this, and because both the Chromecast and the device streaming need huge amounts of bandwidth on the 2Ghz network it becomes saturated and cant handle the load.But wait, you might say, i'll just put my other device on the 5Ghz band. Well bad luck as the software is so poor that unless both the streaming device and the Chromes cast are on t e same network band, they cant find each other to stream, even though they are on the same network, just different bands.I even tried to stream music from my Nexus 4 to the Chromecast, and even this didn't work as Googles music app wont let you stream \"Sideloaded\" music from your device to the Chromecast. Only stuff you bought from google play.In summary, the only thing this is useful for, is streaming music only that you downloaded from Google play, or maybe viewing a static image. Certainly not any kind of HD video.", "verified": false, "helpfulness": "0/1", "author": "Kyle S."}, {"rating": 1.0, "review": "The Google Chromecast HDMI does not work.I can link it to my computer, but shortly after casting it crashes and the link breaks.The cast links such as YOUTUBE, HULU and Netflixs do not respone to commands after casting, most likely due to broken link.", "verified": true, "helpfulness": "0/1", "author": "Roosevelt Lyons"}, {"rating": 1.0, "review": "Only buy this product if you like background pictures, so like ever other Google product its pretty worthless, setup is easy but if you want to \"Cast\" something you'll have better luck finding a doctor on Oboma care. This thing is luck to find my \"Chromecast\" after 20 minutes of streaming on my phone. I'm sure they will give up in another month.", "verified": true, "helpfulness": "0/7", "author": "Bradley E Sass"}, {"rating": 3.0, "review": "Bought it because it was cheap. It's okay, not great. There's lack of support, even Amazon's instant videos don't support it. The only other thing its good for is screen mirroring, but then there's lot of lag with it. Even with a high-end router there 3-8 second lag.", "verified": true, "helpfulness": "0/0", "author": "Top1105"}, {"rating": 4.0, "review": "Google is well on their way with this product but downside is not all Netflix shows/movies are steaming and really all your other option (Hulu, HBO Go, ect...) will add up over time as some are al lacarte purchases and don't offer the range that Netflix does.  So downside it Chrome ast depends on technology advances of their partners which are not where I would like to see the .  Iheartradio not working with it so that was a bummer for me.", "verified": true, "helpfulness": "0/0", "author": "Aubrey's Ma \"Aubrey's Ma\""}, {"rating": 5.0, "review": "I'll leave the more technical reviews to the experts. I just wanted to add that we have enjoyed this device a good deal. At a party at my house all of my guests were able to stream youtube videos, music, and other media of their choice through this device. It made for an interesting dynamic \"OK, now mine!\" so it is neat (or could be potentially bad I guess) that multiple devices can stream to it.After said gathering we decided to give these away as Christmas gifts and they were really happily received. The only main downside is that you can not stream from any device you want, or from just any website.It is very easy to use, and (obviously) also very easy to take with you and set up anywhere.", "verified": true, "helpfulness": "0/0", "author": "Bree"}, {"rating": 2.0, "review": "It was OK. But I think you should be able to cast anything on tablets and phones. Not just within apps that support it.  And it takes too much out of computers to and doesn't work very good when you cast from it. It freezes a lot and you hear sound but videos don't move. Good idea bit needs alot of work.", "verified": true, "helpfulness": "0/0", "author": "Kaila Hilde"}, {"rating": 5.0, "review": "I loveeee google chromecast! It is so convenient and my boyfriend absolutely loves it! I've recommended it highly and many of my friends have picked it up as well.  Don't have any negative things to say!", "verified": true, "helpfulness": "0/1", "author": "Erin Murphy"}, {"rating": 5.0, "review": "EASY set up. Fast shipping and clear picture and connection from my mac book! I love using this to watch movies on with my friends! great price too!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}]