[{"rating": 5.0, "review": "I purchased this the moment it was available to the public and have been playing around with it for a while and to be fully honest this device is almost my streaming replacement. I can not wait for the inclusion of VUDU or HBOGo. I wish it was able to brows Twitch.tv streams as well but that is such a small market I do not see Amazon developing a app for that service, but sounds like a way for a app developer to take up the slack.Instant on sounded like a gimmick to me but I am honestly impressed with it, I tried to see how obscure I could be with my choices to see if I can get a loading screen and it was very rare that it did. It only works with Amazon videos but I can honestly live with that, the other apps look great.The build in search function is a nice touch but again it really only works with Amazon products, I would be more impressed if it included every video library I am subscribed to but maybe in the future?If this device had HBOGo I would end up swearing by it, if it was not for Game of Thrones it would honestly not even matter to me, the day the season ends I don't think I would be that worried about HBOGo. VUDU is where I have my own Ultraviolet library but this is easily worked around by the inclusion of Flixster, Flixter however does not have my personal purchases I made through VUDU but it does have my Ultraviolet movies which makes it useful.Games are a surprising feature, the included tower defense game is a great way to bs a boring time but I don't believe it have any true depth into it. I am not sure if I can view this as a serious gaming system but the idea of using this on family game night or friend game night with some of the party games makes it interesting, I am just not in that market right now.", "verified": true, "helpfulness": "2/2", "author": "M. R. Galde"}, {"rating": 5.0, "review": "Yes, I have read all the technical negative reviews but as for me, my Fire is a great addition to my multimedia setup. I could NEVER get a Chromecast to work, but my Fire was up and running in minutes! Voice search works as expected and the unit is fast. A great buy as far as I'm concerned.", "verified": true, "helpfulness": "1/1", "author": "Soundcabinet"}, {"rating": 5.0, "review": "I bought this for the oldest flat-screen in the house—the only one that didn't come with wi-fi. I couldn't believe how easy it was to plug-in and run (though there was an immediate update that took awhile to download). The voice command actually understands us, unlike Siri. We have very rural internet that doesn't always stream the best, but so far everything we've run through this box has played without interruption. With Netflix and Amazon at our fingertips, I don't see a need for expensive satellite. Great investment.", "verified": true, "helpfulness": "1/1", "author": "JenN \"Young Adult Paranormal/New Adult Contemporary Romance Author\""}, {"rating": 4.0, "review": "There are a few things that irritate me. One is that it is too easy to rent or purchase an item in error. That purchase is then not refundable. I would like to see a second screen that asks if you are sure you want to do this. The other is that the prime movies are too hard to find. Some 30,000 and where are they? I cannot afford to keep buying, especially stuff I didn't want. That is why I purchase prime.Don't get me wrong, I am a big fan of Kindle and Amazon. If these things are corrected I will be the first to write a glowing report!", "verified": true, "helpfulness": "0/0", "author": "Claire"}, {"rating": 5.0, "review": "I've been using a Sony SMP-100 ( a Sony network media player) for a couple of years and the Amazon Fire TV just blows it away. The color is great the speed of load and start is phenomenal. The search functions are great even when using the Netflix and Hulu-plus apps. And the talk to search feature is awesome. Not a big game fan so I can't comment about it.", "verified": true, "helpfulness": "1/1", "author": "Michael P Fults"}, {"rating": 5.0, "review": "The set up was quick and easy.  No problem with the WiFi.  I have only downloaded free movies from Amazon and have had no problems.  I have tried the voice search and it worked great!", "verified": true, "helpfulness": "1/1", "author": "Charlier300"}, {"rating": 3.0, "review": "How can they not have the music cloud player incorporated into this when they have it available on the Roku to play music through..Doesn't make much sense...", "verified": true, "helpfulness": "2/3", "author": "Rico Suave \"carp\""}, {"rating": 3.0, "review": "First off, this device works just as advertised, with all the great new and awesome features including the large buffer memory which allows for clearer pictures while watching a movie. It works wonderfully with the Amazon Prime content, Netflix, and to play our music through the home surround sound speakers.The reason why I gave it a 3-Star rating is this: We have DirecTV at home and, in the Amazon Fire TV, Showtime Anytime is only supported from a handful of providers. This is something that we've enjoyed using our existing Roku unit. Also, HBO Go is a no-show in the channel lineup for the Amazon device.I will change my rating to a 5-Star once Amazon.com adds those two channels. Other than this, we are quite happy with the unit and it will replace our existing and aging Roku device.", "verified": true, "helpfulness": "4/5", "author": "Miguel Carvajal"}, {"rating": 4.0, "review": "Easy to set up and to use My prime on TV is niceNetflix  alsoand the voice search is nice", "verified": true, "helpfulness": "1/2", "author": "Linda A"}, {"rating": 5.0, "review": "I can't say enough good things about the Amazon Fire.  I hooked it up in less than 15 minutes and started using it right away.  It is so easy to navigate. I also might mention that our router is at least 35 feet from this device and there are several walls in between but it gets a great signal.  Seems like Amazon thought of everything.  The box is quite small so doesn't take up a lot of room. I love the voice search feature and it really works. I would highly recommend this device.", "verified": true, "helpfulness": "1/2", "author": "Leonard"}]