[{"rating": 5.0, "review": "Thank you for chromecast I am saving so much money . I am very very happy with it!", "verified": false, "helpfulness": "0/0", "author": "Brown Suga"}, {"rating": 4.0, "review": "When it works, it's great! I have had a few times where I had to unplug it several times and rerun the set-up app to get it to connect to my internet connection. Nothing was wrong with my home network, because all of my other devices worked. I reset that anyway, just in case. Eventually, it reconnected. Other than that, it connects with my apps and shows nicely.​", "verified": true, "helpfulness": "0/0", "author": "Angelica Thomas"}, {"rating": 4.0, "review": "Works Great!!! I Love this product!!!", "verified": false, "helpfulness": "0/0", "author": "Michael S Davidson"}, {"rating": 5.0, "review": "I use Chromecast for one thing - looking up videos on YouTube on my iPad that I want to watch, then casting them to the TV. It works great. Yes I have a built-in YouTube app on my Sony tv, but my desire to search for things using an on-screen alphabet controlled by the directional control on my tv remote, to then have most of the videos not even load properly is about the same as my desire to repeatedly head butt my Sony gorilla glass until one of us gives way. Incidentally this is what I would be doing if I couldn't Chromecast my YouTube videos. From what I've read, the gorilla glass would probably win.The best part is once the video is streaming it doesn't use my iPad battery power. When Chromecast isn't doing anything it also shows you amazing pictures which are both calming and enticing. It's $35, I'm not sure where the decision even is.", "verified": true, "helpfulness": "0/0", "author": "Paul P \"The US Brit\""}, {"rating": 5.0, "review": "I love watching netflix, hbo go, and you tube on this. Easy to use and very responsive.", "verified": false, "helpfulness": "0/0", "author": "QueenB \"queen B\""}, {"rating": 3.0, "review": "Works well but a bit of a pain to use.", "verified": true, "helpfulness": "0/1", "author": "Gustavo R. Corral"}, {"rating": 5.0, "review": "Very cool piece of tech. Doesn't stream shows like from Hulu or Netflix very well, but that might be my crappy laptop. Can't wait to see where they go from here with this little piece of muscle.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great product, quick return of item. Very satisfied with it and will order again.", "verified": true, "helpfulness": "0/0", "author": "Debra Riley"}, {"rating": 2.0, "review": "Did not work with my Kindle Fire HDX. If you have one I don't think is the product for you. Read reviews for possible other compatible products.", "verified": true, "helpfulness": "0/0", "author": "TN8S"}, {"rating": 5.0, "review": "It's AWESOME!!!!", "verified": true, "helpfulness": "0/0", "author": "Sspirie"}]