[{"rating": 5.0, "review": "Works easily right out of the box.  Set it up on my kitchen TV and now I can catch up on my Hulu shows and watch YouTube and Netflix using my iPhone as the controller.", "verified": true, "helpfulness": "0/0", "author": "Ann Vassmer"}, {"rating": 5.0, "review": "Have as a present and my daughter loves it. Easy to use.  Works with Mac.  Looking to get one for myself", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have really enjoyed Google's Chromecast. I can only say that there should be more in the way of local file streaming to the device. I would definitely consider buying again and I may buy another one to have permanently on another TV.", "verified": true, "helpfulness": "0/0", "author": "Evan Laing"}, {"rating": 5.0, "review": "The Chromecast is elegantly simple to use, and does exactly what it was designed for. Perfect for streaming media or screen-sharing to the TV or any HDMI monitor that you have.Even better is the potential it has in expanded function with future updates and more compatible apps to come. One thing I do hope it would have is broader WiFi security support.", "verified": true, "helpfulness": "0/0", "author": "fr33d0m"}, {"rating": 5.0, "review": "This is awesome and so easy to use!  Syncs with iPad or computer without difficulty and easy to move from one tv to another", "verified": true, "helpfulness": "0/0", "author": "michelle"}, {"rating": 5.0, "review": "I bought this for my boyfriend for Christmas and he was absolutely thrilled! He uses it all the time to watch movies and short videos. The quality looks amazing. Great gift idea for techies.", "verified": true, "helpfulness": "0/0", "author": "Brown Eyed Girl"}, {"rating": 2.0, "review": "I had a Roku for a while, enjoyed it, but had trouble finding an adapter when mine when out. Netflix employee recommended Chromecast, so I was excited to get one for Christmas!Unfortunately I've been seriously disappointed.Connection seems to be extremely spotty. We'll Cast two episodes of Game of Thrones, and then click to the next...\"No devices found.\" Um....Other times my iPod will start out claiming it doesn't find a device, and after clicking into Chromecast and trying sitting directly next to the device...sometimes I can get it to recognize and work, other times not. It's a pain in the butt and a waste of time to try getting it to work. Another app claims to use it but needs the device 'whitelisted\". I haven't explore that any further since Chromecast itself is enough of a pain.so it works...sometimes...but if I need to back up a video 10-30 seconds because the phone rang or I had to pause because the laptop battery was dying....it doesn't seem to allow that. It just starts right back up from where I paused it, won't let me rewind.My partner has an Apple TV and I want one of those instead. Has a MUCH huger range of options beyond just Netflix and Youtube, has a remote so you can access them directly instead of draining the battery on your laptop or dealing with a poor connection to an iPod.Oh, and let's also state that yes I tried contacting tech support about my problems, but they just included a form email with links to FAQ stuff which was already unhelpful. I would like to talk to someone about the intermittent nature of my problem.I'm quite cheap and don't spend money on technology..but this thing is annoying me enough I plant get rid of it and buy an Apple TV. Don't waste your money on an unreliable product that has limited options when it DOES decide to work.", "verified": false, "helpfulness": "0/0", "author": "Just Me"}, {"rating": 3.0, "review": "It doesn't work like I expected. I have problem of hesitating and slow streaming the data. I wouldn't recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Tuan Bui"}, {"rating": 1.0, "review": "I bought this hoping it would be an easy way to mirror my computer to my TV and Stereo. Not so easy! First, I had a lot of trouble trying to make it work with Netgear's latest Nighthawk router. Then, I found that it won't stream iOS devices unless you're using an app that has a streaming selection on the upper right. Since I use both iPad and iPhone, this isn't a good solution. And as mentioned, I never got it working with my Dell Latitude E6330. Google help did send instructions, but they were too long to consider, and with it not streaming iOS Devices, plus hard to connect, it just isn't worth the effort. I'm getting Apple TV.So, like Google's initial Google TV, this could be the ideal device, but it clearly isn't. Such promise! Such frustration!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer 921 \"daviddm1\""}, {"rating": 3.0, "review": "After buying this, I saw an older version Roku for $49.... I wish I would have purchased it.  The thing that Chrome does extremely well is Youtube.  it also allows a nice interface with Google Chrome.  But beyond that - - not much.  For instance, I cannot show my IPad pictures on the TV, using Chrome.  That sort of thing is frustrating.So - it's ok - - but just ok.  I'm sorry I bought it.", "verified": true, "helpfulness": "1/1", "author": "Bob S"}]