[{"rating": 2.0, "review": "I do not have the Wi-Fi (my router is not compatible.  So needed to upgrade my phone - which I thought would take care of it but it will not allow me to undo my previous attempt at installing. I am no techie obviously but I thought I could use the WiFi from my Internet provider or from the mobile and I am stymied.  Watched it on YouTube and it looked easy?I also have not had the time or patience to keep at it.", "verified": true, "helpfulness": "0/0", "author": "joyce"}, {"rating": 5.0, "review": "This needs to be in every home that uses wifi and has a TV with a USB connect port. Pleasantly inexpensive and now that I know what it does I would've paid more, Stocking Stuffers for EVERYONE next year ;)I Recommend it to anyone. You don't have to be tech savvy to plug it in, load the app in your device, connect and GO!!", "verified": true, "helpfulness": "0/0", "author": "Kari Brooks \"Say something about yourself!\""}, {"rating": 5.0, "review": "one of the best invention in the modern era. google u really did it this time the chromecast will put a scare in smart tv sales best product of the year so far chromecast by google", "verified": true, "helpfulness": "0/0", "author": "Lewis harrison"}, {"rating": 5.0, "review": "Easy to set up. Works great. Get one for every TV in your house. I highly recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Patrick Malone"}, {"rating": 4.0, "review": "Chromecast is so easy to use! I love that I can use phone apps and send to my tv. It's very similar to having all Samsung products.I do not like, however, the limited amount of compatible apps. I guess you have to use it from your computer.", "verified": true, "helpfulness": "0/0", "author": "dee aih"}, {"rating": 2.0, "review": "A show stopper was the fact that it is not compatible with my VPN.  Living in Germany, we use a VPN to obtain Netflix, and U.S. internet access.  The Chromecast is incompatible with my router, and therefore is useless to me.  I'm sure it's a good product if you are in the right situation, but not for me.  The literature on its features was sparse at best when you make the decision to purchase it.  Only after receiving the item, and in trying to install/use it did the incompatibility come to light.", "verified": true, "helpfulness": "0/1", "author": "kfish"}, {"rating": 5.0, "review": "I am very pleased with this product. I can now watch programs from my phone on my big-screen TV. And it cost about the price of a cable.", "verified": true, "helpfulness": "0/0", "author": "Alan Hirsch"}, {"rating": 4.0, "review": "Casting from youtube is really amazing and fast with no buffering, but we need more apps for casting as well ascomputer screens, that's why I gave it 4 stars.", "verified": true, "helpfulness": "0/0", "author": "saleh almoshaiqeh"}, {"rating": 5.0, "review": "I love it because its help me to see videos on TvNo need to see it on my phone", "verified": true, "helpfulness": "0/0", "author": "Yousef"}, {"rating": 5.0, "review": "The best purchase I have ever made! My laptop crashed and I was resorting to watching Netflix on my iPhone..sad story, I know! I decided to purchase the chromecast since it was only $30 and that was way cheaper than replacing a laptop I never used for anything but Netflix or YouTube. I feel like it was a life changer and have basically been using it everyday for hours at a time since I received it around Xmas. Very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "ChelsieRose"}]