[{"rating": 4.0, "review": "Perfect for Youtube jukebox.  I wish they had these at bars so I could watch something besides ESPN.It would be all around perfect if we had a better way to stream video files from local computers.", "verified": true, "helpfulness": "0/0", "author": "Donald"}, {"rating": 3.0, "review": "Cool gadget, but the video quality is not that great.  Even on HD videos.  Also, the use is limited, only works with You Tube and Netflix. I have also noticed that the wireless connectivity is not great.", "verified": true, "helpfulness": "0/0", "author": "JEM"}, {"rating": 2.0, "review": "I managed to get it working on a Windows 8 laptop w/o problemBut when I tried with a Samsung Tab2, Amazon Kindle Fire HD and an Android LG smartphone, the Google playstore seemed to check location (Montreal, Canada) and did not allow the installation.  It is weird that Google and Amazon go to this extreme.", "verified": true, "helpfulness": "0/0", "author": "Nam Nguyen"}, {"rating": 4.0, "review": "Had problems to connect to my hidden WiFi network, but the setup is straighforward. Limited to chrome tab, youtube and netflix.", "verified": true, "helpfulness": "0/0", "author": "slima"}, {"rating": 5.0, "review": "The Google Chromecast is dead easy to setup and use.  It fit perfectly behind my flatscreen TV and I already had the latest apps. I am a happy camper....", "verified": true, "helpfulness": "0/0", "author": "Karl Garcia"}, {"rating": 5.0, "review": "Good now and will get better when more apps interface with it.For desktop it was not compatable with vista.", "verified": true, "helpfulness": "0/0", "author": "Lee Hinman"}, {"rating": 5.0, "review": "Sure, it's not perfect, but it's a work-in-progress. Works awesome with the things it's currently integrated with (Google Play, Youtube, Netflix, Hulu Plus). Excited to see the things to come as they continue to improve it. For $35? Done.", "verified": true, "helpfulness": "0/0", "author": "Caleb"}, {"rating": 5.0, "review": "This is a neat gadget. Now I can watch Netflix and Youtube on the big screen with minimum hassles. Buy yours!", "verified": true, "helpfulness": "0/0", "author": "The Boogieman \"The Boogieman\""}, {"rating": 5.0, "review": "use for one half month.very reliable and easy to use.Hope more websites support it with their own apps.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 5.0, "review": "It was easy to install and it works perfectly linked to my laptop.  I recommended it to my neighbor and she installed it easily and linked it to her smart phone. However, it only streams stuff from Netflix. Hope they add Amazon soon.", "verified": true, "helpfulness": "0/0", "author": "Jane Zamoyski"}]