[{"rating": 5.0, "review": "I have been looking for a way to watch my Amazon Prime Videos on my TV along with getting a Netflix membership.  I was able to combine both with this genius box!  It is tiny and light, the remote is efficient yet sturdy with the voice recognition that beats my iPhone!  I love this product and recommend it to anyone looking to delete your movie channels, cancel going to Redbox and paying late fees!  Get this box and watch TV Shows, movies, and play games.  It is perfect and simple to use!", "verified": true, "helpfulness": "2/5", "author": "Jenna Austin \"Looking for an escape... can you recommend anything?  Loving law thrillers, biographies (read by the author) and I am a true crime buff.  This all ties in with my love for the human psyche.. so please recommend any good  books, as I will do the same.\""}, {"rating": 3.0, "review": "I'm a longtime Prime member and really wanted to love this box. The setup was SO easy, super simple to navigate through, I even sideloaded a few apps. Although it will do Flixster for your Ultraviolet movies, it will not do Vudu, and with 290+ movies to my name, that's gotta be my dealbreaker.I'll admit that the voice search was very accurate and a fun little toy.", "verified": true, "helpfulness": "8/14", "author": "Tony Mattes"}, {"rating": 5.0, "review": "I have never owned a Roku or anything similar.  I received my Amazon Fire TV box today, and I am blown away!  I'm an Amazon Prime member, so I've lost count of the amount of money I've saved through the years in shipping costs and watching online programming.  I wasn't sure what to expect with Amazon Fire TV and was honestly tempted to wait a little while to purchase until it had been on the market a little longer.  The start-up was completely painless and took less than five minutes.  There seems to be an almost endless \"library\" of programming from which to choose, just with Prime alone.  The voice feature is flawless so far...amazing because I didn't even have to get it used to my voice...it just recognized every single word I spoke into it, right from the get-go.  Lastly, the screen saver I chose is the built-in library of photographs.  They are breathtakingly stunning, even if some of them are no doubt digitally enhanced...they're simply beautiful.  In summary, I couldn't be more pleased with this purchase.  It's one of the best $100 purchases I've made in a long time.  Well done, Amazon!", "verified": true, "helpfulness": "4/6", "author": "Just Me"}, {"rating": 4.0, "review": "Got it in and set it up in about 10 minutes. Super easy to attach my Netflix and Pandora accounts to. The voice feature is amazingly accurate and easy to use, my six year old figured it out in seconds. Great picture quality and the speed is awesome.The only thing keeping it from 5 stars is Amazon's video service which is the default for the search feature. We have Amazon Prime but have to tell it we do every time we choose a Prime video or it tries to charge us. There's no control to have it only show the content included with our Prime membership so there are a lot of things my child can see but not watch. Thank goodness for the parental control or I could see a lot of accidental charges to my account.", "verified": true, "helpfulness": "6/7", "author": "Jayson Bucy"}, {"rating": 3.0, "review": "Nothing here that you can't already do with your kindle. Less quality in both picture and sound than through a direct hdmi cable. This technology has a long way to go. If you want to compare, try Pandora on this and then use a direct cable connect. A whole world of difference. Plus, if you're watching a video by yourself, why do you need this? The kindle screen and headphones can't be beat.", "verified": true, "helpfulness": "3/12", "author": "blackjack8097"}, {"rating": 5.0, "review": "As an owner of Apple TV, a Roku 3, the Xbox 360, Xbox One, Ps3, etc, etch, I think of myself as somewhat versed in streaming boxes. With a 3 year old at home, having access to on-demand content, mostly cartoons, is a necessity. SO naturally last week when I saw amazon had a new box and I needed one for our living room, I took the plunge.I am happy to say that this is quite a zippy little box. Now as has been said in countless other places, the current software is really keyed to work with Amazon content first and foremost. The voice search and the pre-caching seem to mostly benefit Amazon content, with Hulu also having a bit of functionality. My hope is that unified voice search across all the major apps will be on its way, the way Roku and TiVo approach it.None the less, Amazon content starts almost instantly and thus far the performance of the box has been stellar. As you can imagine it is easy to use and relatively intuitive.I must mention, that much like Apple TV and Roku before it, Fire TV is going to take a little time to match up perfectly in terms of content. Apps like HBO2GO and access to your amazon cloud player have yet to be released, but I feel confident that both are on the way and certainly amazon has stated the same. Getting to market on time meant some apps weren't quite ready. I could be mistaken, but apps like Netflix appear to have just been ported from the Android app. I hope that Fire TV specific versions of these apps will reach the marketplace eventually.I cannot speak to games as I have plenty of consoles and no desire to explore yet another marketplace, particularly one that seems to want to offer mobile games on the big screen no ports for me thanks. If Amazon chooses down the road to start releasing tons of original content, then I can always revisit.If you don't have a streaming box, I think you will like this one. This assumes you have an Amazon Prime account, so those who don't want to pay for the Prime, well keep on looking. The specs on this thing are a beast and I am excited for the unlocked potential we have yet to view. For me this was a great purchase.", "verified": true, "helpfulness": "5/6", "author": "Mark E. Hengst \"Hengst\""}, {"rating": 4.0, "review": "I Love it to death. Best on the market. I only have one question. Haven't figured out how to shut off lol ! There is no power button. Anyone?", "verified": true, "helpfulness": "1/3", "author": "freezerguy"}, {"rating": 5.0, "review": "This was the first streaming device I have owned and it is awesome. I read some reviews that the Roku 3 is more user friendly, but I love the ease of use and speed with this one. I do wish the voice would search across all platforms, and not just Amazon Prime. I plan on buying three more for tvs in my bedrooms. The games feature is great for my 6 year old daughter she loves it. I have had this 4 days and have used it every day with no problems. Amazon devices rock is all I can say.", "verified": true, "helpfulness": "2/3", "author": "Douglas"}, {"rating": 5.0, "review": "Quality entry into the set top box race. Good pricing and the gaming lineup will grow over time. Voice search should help differentiate.", "verified": true, "helpfulness": "1/2", "author": "Dan P."}, {"rating": 5.0, "review": "I own an Apple TV, a Roku, and a PS3.In the video and audio streaming category, the Fire TV blows them all out of the water.It is unbelievably responsive, loads video faster (by a lot) than any other device.My Apple TV and Roku are now on eBay, and will be buying another Fire TV in the near future.The people that complain about there being no content are plain nuts, there is plenty of content.Yes the Roku has 10K+ channels, but they are mostly filler crap that I would never watch any way.Do your research, learn what it can and cannot do, what apps it has and does not, and then buy it if you still want it.The people that complain about no MLB or HBO-Go should have researched before they purchased.", "verified": true, "helpfulness": "5/7", "author": "DM"}]