[{"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Xingchi Pan"}, {"rating": 5.0, "review": "I love this little guy!  I dropped all cable recently and function solely on Netflix and Amazon Prime.  This works great with Netflix (haven't tried it with Prime yet).  It is on my bedroom TV which has a pretty weak WiFi signal, but I rarely have any lag or issues with it.  I just plugged it in, read the instructions, set it up with my Android phone, and I haven't had a single problem out of it at all!", "verified": true, "helpfulness": "0/0", "author": "Mrs Fant"}, {"rating": 4.0, "review": "cool but for some reason the mirror image is delayed in the words of the mouth Are off so not cool and has a buffering  image same times the hdmi  wires works better", "verified": true, "helpfulness": "0/0", "author": "sam perez"}, {"rating": 1.0, "review": "I bought this and never use it. I hate how Google picks which apps are compatible and that you have to stream them from your phone/tablet/computer/what have you. There are plenty of better products out there that do more (ie. apple TV)", "verified": true, "helpfulness": "0/0", "author": "Alisa C."}, {"rating": 1.0, "review": "Won't connect to the internet", "verified": true, "helpfulness": "0/0", "author": "Tricia Kushen"}, {"rating": 5.0, "review": "I gave this a five because of the picture quality and speed of streaming.It needs more applicable apps", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 4.0, "review": "A really nice way to watch movies online without ugly-looking connecting cables/cords. Works well; you will enjoy it more at fast internet speeds.", "verified": true, "helpfulness": "0/0", "author": "tola497"}, {"rating": 5.0, "review": "Downloaded the chromecast app before i plugged in the chromecast which made it all straightforward and simple. Watching netflix in hd on TV within 5 minutes. Brilliant and simple.", "verified": true, "helpfulness": "0/0", "author": "Keith \"Keefinit\""}, {"rating": 5.0, "review": "I want another one.", "verified": true, "helpfulness": "0/0", "author": "Donald Wellington"}, {"rating": 5.0, "review": "I recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Estevão Thé Eskinazi"}]