[{"rating": 5.0, "review": "The gift that my fiance didn't know he needed. Now we can watch Netflix and YouTube on the big TV. Very easy to use. #SaveTheLivingRoom", "verified": true, "helpfulness": "0/0", "author": "Nicole Ozark"}, {"rating": 5.0, "review": "Sharp Price and a clever product.", "verified": true, "helpfulness": "0/0", "author": "Roger Clark"}, {"rating": 5.0, "review": "Cheaper and efficient way to have a smart screen at home.", "verified": true, "helpfulness": "0/0", "author": "Manrique Morera"}, {"rating": 5.0, "review": "I'm no J. Peterman,but here goes.  The box contains the Chromecast, a 4 inch HDMI extender cable that can be used to attach the Chromecast to a TV if there is not enough clearance to plug the Chromecast directly into a TV's HDMI port, a power cable that has the Chromecast connector on one end and a USB connector on the other end, and an AC adapter that enables the USB power cable to be plugged into an AC outlet if there is no USB port available on the TV to provide power to the Chromecast.I bought the Chromecast to wirelessly send internet video from a Galaxy Tab 2 to a \"non-smart\" TV.  Since the lovely Mrs. really likes to replay basketball videos on Watch ESPN this seemed to be the ticket. Along with the non-smart TV I also have the slowest DSL speed my ISP offers, so I was concerned about video quality.  I'm happy to say that despite my cheapness the video quality is excellent - very clear with no buffering or jogging.  It works great for internet videos and videos cast from the libraries on my tablet and smartphone.  It also the ability to cast the entire desktop of a PC or the entire screen of a device if needs be.Installation and set up was very easy and took less than 15 minutes including the initial software update.  So far I'm very pleased with the performance and capabilities after about 15 hours of use.", "verified": true, "helpfulness": "0/0", "author": "Mito"}, {"rating": 5.0, "review": "I didn't see any lag while playing you tube or screen share for chrome browser.So I recommend to buy this", "verified": true, "helpfulness": "0/0", "author": "Naresh C."}, {"rating": 2.0, "review": "was not as easy as led to believe.  couldnt' get it to work exactly right, so don't use it at all.", "verified": true, "helpfulness": "0/0", "author": "Anthony C. Villegas \"bibliophile\""}, {"rating": 5.0, "review": "high quality, fast delivery", "verified": true, "helpfulness": "0/0", "author": "yusuf keçeci"}, {"rating": 5.0, "review": "Chrome cast has made my life simple I can easily connect my tablet or phone to TV wireless. You can either plug in via USB or through an outlet on the wall. Cables are provided", "verified": true, "helpfulness": "0/0", "author": "Cody"}, {"rating": 5.0, "review": "Did everything I wanted. YouTube on the big screen is fantastic..", "verified": true, "helpfulness": "0/0", "author": "Katye"}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "Karl W."}]