[{"rating": 3.0, "review": "I wish they develop the Chromecast to let us watch anything in the phone or PC.Google Chromecast HDMI Streaming Media Player", "verified": true, "helpfulness": "1/2", "author": "Hesham Ahmed"}, {"rating": 5.0, "review": "Very very nice product. Looks like Google has captured what consumers wanted and has delivered. Unlike Apple's costly and featureless devices, chromecast works fine with various apps and any WiFi hotspot.", "verified": true, "helpfulness": "2/3", "author": "Avinash Bokksum Raghavendra"}, {"rating": 5.0, "review": "Nice little gadget. Particularly impressed with image and software quality. After I discover how to play videos from my laptop, I tried to cast my desktop without any issues... Great Product", "verified": true, "helpfulness": "1/2", "author": "Jay C"}, {"rating": 4.0, "review": "Nice little gimmick to display your browser on your screen. It can do full screen of your desktop with the correct software hack. Hopefully they will release a developer kit soon that allows apps to be installed and run.", "verified": true, "helpfulness": "0/0", "author": "sceneIT?"}, {"rating": 5.0, "review": "It works really well.  The video quality is really good.  The device is also very easy to set up.  It works with an Android phone, a PC, and an iPad.  This is definitely worth $35.", "verified": true, "helpfulness": "1/2", "author": "Anthony C."}, {"rating": 5.0, "review": "It is an excellent means for communication between the devices and the tv in order to watch from different apps. It is fast, reliable, easy and effective technology. I recommend it highly.", "verified": true, "helpfulness": "2/3", "author": "Lomax"}, {"rating": 5.0, "review": "The installation was flawless and all my devices (e.g. iPhone 4, Nexus 7, and PC laptops) work with it as been said in the description.", "verified": true, "helpfulness": "1/2", "author": "Jerry Yau \"csForever\""}, {"rating": 5.0, "review": "I ordered this product through Amazon and received Ira weeks before the store could have one for me to buy.Very happy, except you can't pah your downloaded movies off your phone, tablet or laptop and watch them on the TV. Only purchased ones from Hulu, Google and Netflix. Bummed thati want aware of this before I bought it.", "verified": true, "helpfulness": "0/0", "author": "jbuschine"}, {"rating": 3.0, "review": "Really does not have a tone of functionality yet. It is a glorified NETFLIX adapter which works great for that, but really nothing else. I was disappointed at how I really couldn't stream anything from Chrome via Chromecast", "verified": true, "helpfulness": "2/3", "author": "D. Ching"}, {"rating": 5.0, "review": "Works great for Netfilx. Not as good as Roku but the price is right if you only watch Netflix! Easy install!", "verified": true, "helpfulness": "1/2", "author": "Brent Crocker"}]