[{"rating": 5.0, "review": "Netflix, You Tube and streaming home movies.Very nice and quick setup with a great picture.  I was going to go with Apple TV but many said that Chromecast was the future.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Super easy to use, does the job. I like it better than my Apple TV, and it goes for a lot less money.", "verified": true, "helpfulness": "0/0", "author": "Fernando Herrera"}, {"rating": 5.0, "review": "If you have'nt bought one of these you don't know what you have been missing. So glad I got one for Christmas", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "It works great. Havent had any issues at all with it. I cant wait for more apps to be released.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Chromecast is ok.  I have it hooked up to a TV at work so everyone could stream to it.  Apps have to be compatible with this and there are very few (for me: Netflix, Pandora, and YouTube).  My chrome browser on my desktop computer can't connect to it even though it's on the same network.  You have to run the chromecast app.  Sometimes it won't sync until you close all the media apps.  It's difficult (or next to impossible) to tell what the problem is when it's not syncing.  When it does sync, it's a little slow.  I don't like that it can play my pandora and take over where I wouldn't have control on my device.  No support for Spotify.I know what you're thinking.  All negatives and yet a 3 star.  For $35, being able to stream from your mobile devices to a TV is huge.  I love streaming youtube, pandora, or netflix on the TV.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "an awesome little gadget, perfect as a gift or self use, very easy and clear installation very responsive, easy to cast any tab you want, the full desktop cast still in beta but work reasonably well", "verified": true, "helpfulness": "0/0", "author": "haim"}, {"rating": 5.0, "review": "Easy set up, took less than 5 minutes.  Works well with Google Chrome.  Wish they had an add on for IE11.", "verified": true, "helpfulness": "0/0", "author": "C0yote"}, {"rating": 5.0, "review": "Sure beats broadcast TV. Watch whatever whenever with big screen pizzazz. Surround sound too boot. And Google maps are real sharp.", "verified": true, "helpfulness": "0/0", "author": "Living not Working"}, {"rating": 5.0, "review": "Since I am using Roku, I need to purchase a HDMI splitter to use both the chromecast and roku and not have to unhook one or the other.", "verified": true, "helpfulness": "0/0", "author": "Dennis VanCleve"}, {"rating": 4.0, "review": "The idea of this is great and I do love it, except setting it up is a pain. I have a Mac, and to set it up I had to download google chrome, than this additional thing to make the screen stream. Now they are asking me to download a plug in. I have avoided it thus far, but I know that if I had it it would be working more smoothly. I have tried to download the plug in 5 times, and every time it gets to the end and then there is some sort of problem. I don't know how to fix it. It is frustrating, so I'm going to keep trying to dodge it.", "verified": true, "helpfulness": "0/0", "author": "Elky"}]