[{"rating": 5.0, "review": "Worked great with minimum effort. I wish it had more apps than the couple it comes with it. Hope developer and google develop more apps", "verified": true, "helpfulness": "0/0", "author": "prasada r alokam"}, {"rating": 4.0, "review": "Easiest setup I have ever seen. Was useing it right away.You can't beat it especially for the price. Works with all my computers.", "verified": true, "helpfulness": "0/0", "author": "Jim Broome"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. Works perfect! Recommended for everyone, it works like magic. Product is as described.", "verified": true, "helpfulness": "0/0", "author": "Gbolosh"}, {"rating": 2.0, "review": "Does not work when you travel and use it in hotel, no bluetooth capability.Work at home but not on public sites or at work, should have been emphasize as to not be misleading", "verified": true, "helpfulness": "0/0", "author": "Lucas Castanos"}, {"rating": 1.0, "review": "Very poor.  I can't get it to cast on my tv. I was hoping to cast you tube & other videos on my tv. So far I'm unsuccessful. Customer support is very poor.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "its only limited to streaming video, i was expecting it to be an extention of my device displayed on my television. :(", "verified": true, "helpfulness": "0/0", "author": "hernal s dudley"}, {"rating": 4.0, "review": "Only reason im not giving it five stars is because they need to add Vu Du movies web site to their sync lists . Other than that perfect.", "verified": true, "helpfulness": "0/0", "author": "J. Nummerdor"}, {"rating": 1.0, "review": "I guess i should have done a lot more research, but the Chromecast did not do what i had expected.  I thought it would project anything from my laptop, but it only works for Hulu and Netflicks.", "verified": true, "helpfulness": "0/1", "author": "Keith Rosenstiel"}, {"rating": 5.0, "review": "This a great buy. It makes it so easy to stream netflix on any TV. I hope for more apps to be able to stream in the future.", "verified": true, "helpfulness": "0/0", "author": "Susie K"}, {"rating": 2.0, "review": "The cool thing would to be able to stream a video or pictures taken on your phone to the TV. This would be cool if people already have multiple ways of streaming; netflix, youtube, hulu etc..This is for you if you don't have a smart tv or roku or google tv or any other streaming device.Ive tried the couple apps that say they stream local content and it does work to well.potential for this device is huge.", "verified": true, "helpfulness": "0/0", "author": "W. Chase"}]