[{"rating": 4.0, "review": "After a few months, experienced issues streaming internet to TV.  No problems with Netflix. Need to work on compatibility with Amazon and Windows Media Player.", "verified": true, "helpfulness": "0/0", "author": "Matthew Hiller \"Hiller16\""}, {"rating": 1.0, "review": "Couldn't get it to work, though I hooked up an HDMI cable that now works with a Disc Player, so I even bought a booster, but it still did not work", "verified": true, "helpfulness": "0/1", "author": "Raquel"}, {"rating": 5.0, "review": "If you don't get one of these, you're crazy.  It is awesome!  I just got one and all of my devices can send video instantly to the tv. I'm buying another one for a second TV.  It does exactly what it says it does -- for lack of better description it sends a wireless video signal to your tv instantly.  It works really well.Reading other random reviews: yes there's a slight lag at times (depending on the use of my home wifi) but it's never more than a couple seconds.  It's not exactly for streaming live video like netflix...I believe you would get a choppy lag if you tried to stream that but it works for looking at websites on the tv (using chromecast browser extension) and watching youtube videos.  From the phone it's only compatible with certain apps.To me, this is all fine -- I mean this item is what it is...it's in its infancy and will only get better.  The thing can update itself so as more apps and sites integrate with it, chromecast will update itself.  It's easy easy easy to setup, I mean I think anyone could do it.Look, it's not a wireless video cable -- you're not going to magically get a tv 'monitor'...it's meant for sharing video/websites from popular sources.  I can't really tell you enough to just get it and enjoy it but don't expect it to create a wireless monitor connection.This thing is impressive.", "verified": true, "helpfulness": "0/0", "author": "pacesetter \"\"Avid golfer\"\""}, {"rating": 5.0, "review": "Glad we live in an age where we have all these fine products.  Theis is my favorite product to stream movies and most everthing!  Will recomend!", "verified": false, "helpfulness": "0/0", "author": "Miss A Class Girl"}, {"rating": 3.0, "review": "This is good for the price, but it saps my bandwidth so I am unable to do anything on the internet while something is being casted, particularly when I use the chrome browser. I thought I would use it more, but it just kind of takes up another HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Richie Rich"}, {"rating": 5.0, "review": "Can stream HBO, Hulu, Netflix, and a few other apps to my tv from my Galaxy Note 3. its definitely worth it.", "verified": true, "helpfulness": "0/0", "author": "Kisha"}, {"rating": 4.0, "review": "It only works with very few apps... So I've not used it as much as I would like. Wish it worked with Amazon Prime and not just Netflix which I don't subscribe to", "verified": true, "helpfulness": "0/0", "author": "TB"}, {"rating": 4.0, "review": "It works grate have a lot of fun with my phone good to watch you tube on the tv with just a pushed of one butten", "verified": true, "helpfulness": "0/0", "author": "Daniel Palmer"}, {"rating": 5.0, "review": "Awesome device. Its nice to not have my laptop hooked up to an hdmi cable.NegativeIt does make my computer run hot.", "verified": true, "helpfulness": "0/0", "author": "Jassie Fresh \"J.H.\""}, {"rating": 4.0, "review": "Easy to setup, no audio/video sync issues on my 802.11g Wi-Fi network (up to 54Mbps, nothing fancy). Nice feature is Chromecast automatically turns on my Samsung TV when I start casting. I don't even need to turn on TV :)YouTube app on Nexus 7 tablet is buggy, and ability to pause video on tablet sometimes stops working.", "verified": true, "helpfulness": "0/0", "author": "JT"}]