[{"rating": 5.0, "review": "Works awesome!", "verified": true, "helpfulness": "0/0", "author": "nativdad Cisneros"}, {"rating": 5.0, "review": "Works exactly as described.. Can't be happier..", "verified": true, "helpfulness": "0/0", "author": "Rusty Siazon"}, {"rating": 3.0, "review": "it does what it is ment to do but next time i get a fire stick so i dont have to use my phone", "verified": true, "helpfulness": "0/0", "author": "bigjodylee"}, {"rating": 5.0, "review": "Great toy.", "verified": true, "helpfulness": "0/0", "author": "Boie"}, {"rating": 5.0, "review": "I love this little device. I have 2 in my apartment and got my mom and sister both one for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Jeffery"}, {"rating": 4.0, "review": "The best streaming device for the money that I've ever purchased. We use Google Chrome browser to cast the content but we did purchase an HD movie (The Good Lie) from Amazon content that wouldn't stream from the Chrome browser. I believe it is for the copy protection that is required for some digital content. Netflix and YouTube are the most widely used by us.", "verified": true, "helpfulness": "0/0", "author": "Dan Strickler"}, {"rating": 5.0, "review": "Setup was easy but took two tries to get it to work. Many apps available, but not in US. Would love to see amazon instant video supported.", "verified": true, "helpfulness": "0/0", "author": "Mark Manson"}, {"rating": 5.0, "review": "Excellent product. Turns your TV into a smart TV for $35.", "verified": true, "helpfulness": "0/0", "author": "Adobe Sweet"}, {"rating": 4.0, "review": "It's less than spectacular.  The fact that you have to control the programs with a phone or computer does not make it simpler it adds another layer which can have glitsches, a few of which have occurred.", "verified": true, "helpfulness": "0/0", "author": "David L. Bush"}, {"rating": 5.0, "review": "Don't have a smart tv? No problem with this, pretty awesome product", "verified": true, "helpfulness": "0/0", "author": "Windfall"}]