[{"rating": 3.0, "review": "Easy set-up even for a tech dummy like me. Easy to do the you-tube app and the Amazon Prime IV's . Also had no problem showing the videos on my ipad on the tv screen. The downside. to me anyway. is that Netflix, hulu, MLB and most other apps are prescription accounts. If you're into those and the price suits you. It's a great deal @ $35.", "verified": true, "helpfulness": "0/0", "author": "Wayne Hoffman \"Biggie\""}, {"rating": 4.0, "review": "Very solid product. Sometimes a bit slow. I would be thrilled if the Showtime Anytime app was compatible. Still good thou!", "verified": true, "helpfulness": "0/0", "author": "Robert Miola"}, {"rating": 4.0, "review": "Screen Abit legging when use google chrome to project website view on tv . But what you expect from 35usd?", "verified": true, "helpfulness": "0/0", "author": "weithye Lee"}, {"rating": 5.0, "review": "If you have a \"dumb\" TV then this turns it into a \"smart\" TV. You can stream nigh anything to it from a media server, YouTube or other sources. Also very useful if you're away from home, as long as you've got access to wireless you just connect the Chromecast to it as well as your phone\\tablet\\laptop, and off you go!", "verified": true, "helpfulness": "0/0", "author": "Steve Wells"}, {"rating": 5.0, "review": "I used to use a HDMI cable to connect the TV to my computer. I don't have to do that any more!Just plug the Chromecast streaming media player and watch movies and music from the internet.Love it, and already purchased another one for my friend.", "verified": true, "helpfulness": "1/1", "author": "Lady D"}, {"rating": 2.0, "review": "This is very confusing to use. When it worked I was only able to see things from you tube. This was a gift for my boss to use in the office since she has no cable but, it dd not work properly. She never got to use it so  I took it home to look at and noticed it was not a good product. I contacted Amazon and they did not want to refund my money because the time to return it was up. I believe it was 3o days. Now i'm stuck with this product. Apple TV is way better and easier to use, but too pricey.", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 5.0, "review": "Of all the electronics I've used, this is the easiest and has the brightest future. Would recommend to anyone with any type of smartphone", "verified": false, "helpfulness": "0/0", "author": "Bryan Kirby"}, {"rating": 4.0, "review": "Great device, cheap and does what it's supposed to.. Device is small, plug into back of TV and forget it. Able to watch videos from common video sources online (e.g. Youtube)... Quality is great.. Only thing is as far as I know it doesnt support streaming local content..", "verified": true, "helpfulness": "0/0", "author": "BU"}, {"rating": 5.0, "review": "The best way to make your dumb old LCD in a full featured MegaMind TV.Easy to use, easy to set up via mobile or tablet app, and your ready to cast on HD.Brilliant product, I wish there was an non-rooted app to mirror the device screen.", "verified": true, "helpfulness": "0/0", "author": "PABLO BARRIUSO VILLAMAR"}, {"rating": 5.0, "review": "Before I had my Smart TV, we used this all the time. We don't use it as much, but it is convenient to have in the bedroom. Though there are limited apps that work, many are being developed. I purchased it when they first came out and had the Netflix demo with it, so it was an awesome price for all of that.It is convenient that it works with her iPad and my Android tablet. I use Songza the most on it and she uses Hulu and Netflix on it.", "verified": true, "helpfulness": "0/0", "author": "carlson03"}]