[{"rating": 5.0, "review": "I have a very nice dumb TV in the bedroom that I wanted to get Netflix on. This answered the problem perfectly for just $35.00 and it opens up a wealth of shows from YouTube. Simple to use with a phone, tablet or laptop and it gives us a crystal clear picture over the FIOS network. This is a brilliant device that puts the world of video at your fingertips even on a seven year old TV. If the TV has a HDMI port this will make any TV work perfectly on your wireless network. Do be careful as the Chromecasting service is so good that you will spend a lot more time watching first class shows you never looked at before. It may also make your current TV service look shabby in comparison. This is the best gadget I have ever bought for $35.00, what a steal.", "verified": true, "helpfulness": "0/0", "author": "Dan Crumpler"}, {"rating": 5.0, "review": "Works great as advertised. Plug it in and start watching Netflix, YouTube and listen to Google play music today. Buy two.", "verified": true, "helpfulness": "0/0", "author": "B.L. \"B.D.L.\""}, {"rating": 5.0, "review": "I have a Wii and a PS3 in the living room, so I don't really need a Chromecast for my TV. I use this little thing exclusively on my micro projector in the bedroom. I wanted to watch Netflix and stuff on the bed at night. It works perfectly! No hiccups, no nothing.I can't wait to see Chromecast out of beta and truly shine with bunch of supported apps, including the Amazon prime video app!", "verified": true, "helpfulness": "0/0", "author": "etc"}, {"rating": 4.0, "review": "Great on devices that we could get it to sync with, but wouldn't work on an older MAC, and said it wouldn't work on an older (2007) IBM PC, but did end up working. Awesome once you get it on your machine", "verified": true, "helpfulness": "0/0", "author": "---"}, {"rating": 5.0, "review": "Look, this product is in its baby stages.. I can stream ANYTHING I want from my laptop or desktop. Mobile devices will soon follow. Haters are going to hate people we all know that so do not worry about their opinions. My wife has an iPhone 5 I have a Samsung Galaxy III the kids have kindle fire HD's and I have an iPad Gen 2 and these ALL work with the Chromecast. There are a limited number of \"apps\" that come pre-loaded but there is going to be more, way more, being backed by Google. And for 35.00 how could you possibly go wrong? That's a third of what most people pay for cable a month. You obviously have to have a wireless network at home to use this device but all in all I rate this a 4.8 out of 5.", "verified": false, "helpfulness": "1/1", "author": "Ben Dover"}, {"rating": 5.0, "review": "Another great, and easy to use, product from Google. Hopefully, they will add more apps that it will work with. But, for the $35.00, it was well worth it.", "verified": true, "helpfulness": "0/0", "author": "emes921 \"emes921\""}, {"rating": 5.0, "review": "I am one of those who bought the Chromecast at the beginning and they got 3-free months of Netflix. So far I have not face any problems with it. Also, they will improve it with the time.", "verified": true, "helpfulness": "0/0", "author": "Sayed Nasser"}, {"rating": 5.0, "review": "If you bought the special edition Madden with NFL sunday ticket promo, this is an awesome way to stream the games to your TV.", "verified": true, "helpfulness": "0/0", "author": "Benjamin S. Whitener"}, {"rating": 5.0, "review": "Works extremely wee and priced right. I have used it to watch Netflix on a high def tv. Get one.", "verified": true, "helpfulness": "0/0", "author": "MW Mark Wolford"}, {"rating": 5.0, "review": "Great little device.  Works as advertised and has excellent integration with youtube on the iphone and Chrome on the PC.  Can only hope for more supported apps on iOS.", "verified": true, "helpfulness": "0/0", "author": "Chris Brynczka"}]