[{"rating": 5.0, "review": "Works great but difficult to get it working if you live outside the US or Germany. I live in Brazil and the way to get it working was to (i) set a primary shipping address in you Amazon account that is US based and (ii) use a VPN service. Once that was set the product worked great.- It is much faster than Apple TV (it starts playing out almost immediately, with close to zero loading/caching time)- Voice search function is superb. Gets it right all the time. Really helps finding what you are looking for.- Very nice feature that shows the names / bios of actors/actresses that are playing on the screen at any single time. Just press the main remote button", "verified": true, "helpfulness": "0/0", "author": "Steve Jobs, Not!"}, {"rating": 5.0, "review": "I'm not very techy, however this device allows me to feel so with the ease to be able to operate it and understand it. I bought it originally to take with us camping and give the kids a better variety of programming at night while they're falling asleep, however I now see with the purchase of a couple more products that I am thinking heavily of cancelling my FIOS wallet draining, overpriced cable. And just using this and what I can stream off internet along with a tv antenna to get local programming I think will help me get rid of that bill...", "verified": true, "helpfulness": "0/0", "author": "Jimi B."}, {"rating": 5.0, "review": "Really good.", "verified": true, "helpfulness": "0/0", "author": "Lanena"}, {"rating": 5.0, "review": "Apple TV was on top of the game until the FireTV came onto the scene. This media box offers wireless or wired connection and the ability to connected a USB device adding to it's functionality. I still have not seen all it can do; however this media box it one of the best I have seen in a long time.", "verified": true, "helpfulness": "1/1", "author": "RAB7425"}, {"rating": 5.0, "review": "Amazing. Longer cord preferred.", "verified": false, "helpfulness": "0/0", "author": "Not too late"}, {"rating": 4.0, "review": "Overall, happy with the device.  Cut the cord and got rid of satellite and went with Sling TV (an awesome service) instead.  This device was one of Sling TVs recommended devices, and it had an ethernet port so it could be hardwired instead of wireless.  The only reason for 4 stars is they don't support, or offer, VUDU - which is what we use for our movies.  That was a major hit for me.  We are using a work around for right now through Flixster (tied to Ultraviolet account), but would rather have the VUDU app.", "verified": true, "helpfulness": "0/0", "author": "Lance Kephart"}, {"rating": 4.0, "review": "Easy to use & amazing selections. Am pleased with product and instructions.", "verified": true, "helpfulness": "0/0", "author": "sherryn brooks"}, {"rating": 1.0, "review": "We have the worst picture ever on Amazon, always!  Our Apple TV has a great picture upstairs and no down time.  Amazon is Horrible!  We are soooooo surprised and sad about owning a Samsung Smart TV.  Such a surprise and we're techies so it is a proven issue with the product.  We've wrestled since first of year 2015.  Amazon and Samsung suck!!  Sorry to share.", "verified": false, "helpfulness": "0/2", "author": "Deb Elder"}, {"rating": 5.0, "review": "Best Thing Since TV Was Invented!  I canceled my cable and now use Amazon FireTV,  Netflix and over air local channels.  Over 20 channels are available in my area free over the airways. Canceling cable was the best decision I ever made ! I am saving over $1300 a year.  I can't recommend Amazon Fire TV enough!  Give it a try. You won't be disappointed!", "verified": true, "helpfulness": "1/1", "author": "All Called"}, {"rating": 3.0, "review": "Not as user Friendly as I thought it would be.", "verified": true, "helpfulness": "0/1", "author": "Daniel L Decker"}]