[{"rating": 5.0, "review": "We love it. Everything we expected. do wish some of the charges were a little less. Can't always watch what we want because of the expense, but overall we are satisfied.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "easy hook up, easy to use, lots of choices", "verified": true, "helpfulness": "0/0", "author": "Debra Ware"}, {"rating": 5.0, "review": "I was totally happy with the Amazon Fire. It was very easy to set up and so much better than cable is.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Penn"}, {"rating": 5.0, "review": "Nice well built machine runs smooth remote is solid performs well", "verified": true, "helpfulness": "0/0", "author": "Rob Mackenzie"}, {"rating": 5.0, "review": "Very satisfied so far.  Seems to work as good as new.", "verified": true, "helpfulness": "0/0", "author": "Darol Mason"}, {"rating": 5.0, "review": "WORKS GREAT", "verified": true, "helpfulness": "0/0", "author": "Michael W. \"happy buyer\""}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Patrick Lloyd"}, {"rating": 4.0, "review": "So far its cool. I hope more with network stuff is added at no extra cost. Also having HBO GO is added soon.", "verified": true, "helpfulness": "0/0", "author": "Brian J Finnell"}, {"rating": 5.0, "review": "This little machine has replaced my blue ray player. I have access to Netflix and amazon prime and that is all anyone needs to watch all the great movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Leslie"}, {"rating": 4.0, "review": "I have an older Roku, and had been debating whether to buy the newer one or the Fire TV for my other TV. When the Fire TV price dropped for Cyber Monday, I decided that price would be the decider, and bought it. So far, I am basically happy with it. I pretty much agree with the majority on several pros and cons.The limitations of the voice search are definitely the big con, in my opinion. They need to change this so that the search brings up ALL sources where a show/movie is available, not just a select few.At least with my older Roku, there is no comparing the speed. The Fire TV is MUCH faster when it comes to starting something, rewinding, and just moving around in general. This was a big pro to me, as the lack of speed with the Roku sort of drove me nuts, especially if I needed to rewind a bit when watching something.Just the general look and feel of the layout, moving around, etc. is one that I definitely prefer over the Roku, though I have as of yet to find a way to customize really well. For example, an area with a select few choices of my favorites, so I don't have to see ALL my apps (which is tons), etc. That would be helpful, since I mostly just use Prime, Netflix, Hulu, and maybe PBS, but have a ton of apps in my listings, which I use for my phone, Kindle, etc.I've not yet tried playing any games at all on it (mostly use my Kindle Fire with them), but don't have a game controller, so I'm not sure it would be very comfortable to play many games, particularly if you have time limits, need to act quickly, etc.I've added the app to my Kindle Fire for the remote control and don't really see any advantage to it over the actual app...though if you lose remote, you'll want it!I agree with most reviews...if you are not a Prime member, you'll probably prefer a Roku (or if you are a big Apple user, probably Apple TV). As a Prime member, I am happy the the Fire TV...just want the search to be comprehensive. Others have commented on options not available that they want, such as HBOGo. I don't have HBO, don't watch sports, etc., so as far as apps and options, it has what I need and wanted.", "verified": true, "helpfulness": "0/0", "author": "Oscar"}]