[{"rating": 5.0, "review": "Google Chomecast is fantastic. I take it along on business trips and watch streaming video content from Amazon's video library, and Netflix's video library.", "verified": true, "helpfulness": "0/0", "author": "Zachary"}, {"rating": 4.0, "review": "I have the Google Chromecast in my kids’ playroom.  I like the fact that I can choose and play a Netflix movie from anywhere in the house, that it doesn’t tie my phone to the TV and that I can use almost any mobile device (Tablet, laptop, chromebook, ipod, smartphone, etc…) to choose a movie.  The only downfall is that if I forget to play a movie, the Chromecast home screen creates screen burning.  It already happened on my LED tv.", "verified": true, "helpfulness": "0/1", "author": "ichuyi"}, {"rating": 2.0, "review": "Can't use your phone as a WiFi connection. Woulda been nice to know that up front. Ughhh spent two hours to trying to hook up", "verified": true, "helpfulness": "0/0", "author": "mike mendez"}, {"rating": 3.0, "review": "Only 720P.Using WIN 7, No joy trying to get connectivity via direct Ethernet connection and wifi on same local network.chromecast still in beta to play media through Google Chrome.That said, not too painful for $35,  Premature release of product, hopefully will improve with time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Still unable to get it working, the instructions are not that good nor easy to follow. How many more words do you want?", "verified": true, "helpfulness": "0/1", "author": "mike mester"}, {"rating": 5.0, "review": "This little gadget does a great job of streaming supported apps. At this point in time, however, not enough apps are supported. Also, I am surprised that you cannot cast a web page from the Google Nexus 7, only from laptops. Works very well at what it does so far, and travels well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Cant get it to work.  I think it has something to do with my internet not being a residential modem.  It also seem only to work with YouTube which I like but I already have this on my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works perfectly. I wish there is more supported apps (e.g. NetFlix does not work in my country). This way, I could only use it for YouTube.", "verified": true, "helpfulness": "0/0", "author": "zokkie"}, {"rating": 5.0, "review": "Love it more and more everyday. The cost, which is cheap, versus the hours I've used this already has more than paid for itself", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 3.0, "review": "this product is not that great. it does do what it says but very limited at this time, the Roku is a better buy. I can see buying this after more apps are made for it. but for now I would not recommend it for the non tech person", "verified": true, "helpfulness": "0/3", "author": "vato"}]