[{"rating": 2.0, "review": "I am still trying to resolve the issue. Video works fine but I have no audio. I have it liked to my iphone and my pc and the issue is the same on both. Looks pretty good and has potential but without sound it's worthless. I have to do a factory reboot and if that doesn't work it has to be replaced.", "verified": true, "helpfulness": "0/1", "author": "Wallywoo"}, {"rating": 5.0, "review": "Another great product from google. Supports Netflix, Youtube, VEVO, HULU+ and a few others. Works with any smart phone. F", "verified": true, "helpfulness": "0/0", "author": "Nathan Grossman"}, {"rating": 5.0, "review": "perfect for my kids streaming needs with ther tablets andriods and easy to installed, looking forward for the mirroring option.", "verified": true, "helpfulness": "0/0", "author": "S. Matos \"Blackinux\""}, {"rating": 4.0, "review": "Allows you to stream netflix.  a bit cumbersome figuring out how to control it at first.  no off button.  you must switch back to iphone after you are done or else you dont get any sound from your phone.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 1.0, "review": "We have a relatively new TV with multiple HDMI ports and it won't work. Tried to use the troubleshooting for help and it was very limited and vague. Tried on another TV and it wouldn't work there either.", "verified": true, "helpfulness": "1/2", "author": "Kristina Horsch"}, {"rating": 3.0, "review": "The video is choppy at times when displaying my Chrome browser and no it's not my wifi. I test and deal with Google products as part of my day to day job. They are still in the infant stages of implementing WiFi. I gave this an okay because it's 35.00 versus the Apple TV at 99.00. If you have Apple products at home and are torn between this and an Apple TV, I would pick the Apple TV for now.", "verified": true, "helpfulness": "0/0", "author": "The Deej"}, {"rating": 5.0, "review": "The Google Chromecast HDMI streamer works perfectly with my iPad, iPhone, and TV, giving me easy access to new home entertainment choices like HBO Go. The one problem I had was I had to reinstall HBO Go on my iPad before it would work. The Google Chromecast installation was flawless.", "verified": true, "helpfulness": "0/0", "author": "N. Levi"}, {"rating": 2.0, "review": "The chromecast device only works with selected apps.  A chromecast extension is required to use it with the Chrome browser -- when I tried to download the extension it said I'm using an unsupported OS.  Im using an android OS on an ASUS tablet as well as on a samsung galaxy 3 phone...  the extention won't work on either divice.  I updated my chrome browser...  still no luck.Considering the android os, chrome and chromecast device are all from google I expected them to work better together.Yes, it works fine from Google +....  programming content there is expensive.  Shows I can stream for free from PBS are $1.99 an episode on G+.  The Lone Ranger was $1.28 at redbox and $4.99 on G+.  This was an unexpected and unwelcome surprise - not the experience I've come to expect from Google.", "verified": true, "helpfulness": "0/0", "author": "Bob Shaw"}, {"rating": 5.0, "review": "I bought this for as a holiday gift so that we would have to hook up a computer via VGA cable anymore.  Streams seamlessly and is so easy to set-up!", "verified": true, "helpfulness": "0/0", "author": "indianchemist"}, {"rating": 5.0, "review": "Excellent device for streaming Netflix, Hulu, Pandora. Looking forward to additional app support down the road. Easy setup, and very portable.", "verified": true, "helpfulness": "0/0", "author": "Duncan Eshelman"}]