[{"rating": 4.0, "review": "Have had this for about a week. Great little box. About the same size as the Apple TV. But, Apple TV's output is 720p and FireTV's is 1080p. The difference when streaming from Netflix is remarkably noticeable.Love the Voice Search feature. Also like the remote better than the Apple TV's remote.We already had two Apple TV\"s and a Wii that we use for streaming, but the FireTV is the best of them.Just wish they would add HBOGo, and allow you to play your Amazon Cloud music using the FireTV. Maybe Amazon will add these features later.Overall the FireTV navigation is noticeably faster than Apple TV and light years faster than the Wii, and navigating the FireTV menus is more intuitive.Glad we bought it.", "verified": true, "helpfulness": "1/4", "author": "Rick \"Rick\""}, {"rating": 4.0, "review": "Shipping fast.  Packaging excellent.Easy to install.After using it for a couple of weeks, we like it a lot.  We were using Chrome Cast and that was terrible.Fire has more option, yet simple to use.Love the voice search.  Simple navigation.So far, So good.", "verified": true, "helpfulness": "0/1", "author": "Laura Sonora \"L. Sonora\""}, {"rating": 1.0, "review": "Lately ive been hearing the fuss and i just don't get it. Whats the deal with this Amazon fire? It didn't have gay porn channels, nor did it have Justin Bieber marathons. If amazon wants to keep my business then they better start being fair and air movies like Brokeback mountain and Justin Bieber Goes to Jail.", "verified": false, "helpfulness": "10/70", "author": "Jonas Brothers #1 Fan"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.. I rave about it to all of my friends and family members.I plan to continue using my equipment andmy membership with Amazon.", "verified": true, "helpfulness": "1/1", "author": "Sharon Munday"}, {"rating": 1.0, "review": "I have had a ROKU for years and I just wanted to see what all the hype was about, I will keep this Amazon fire as a back up maybe but I would never part with my ROKU. The AZ FIRE is not easy to use or negotiate and it has very limited apps. I can go to my ROKU and move around very quickly thru all the apps and the AZ is confusing. It may have more apps than I could find and it has something called the \"coins\" system wherein you can purchase apps with your coins. You are given  coins to start with and move on from there,I am sadly disappointed in this product and that is not easy to say since I love Amazon for everything else. I would not recommend this for purchase.", "verified": true, "helpfulness": "319/367", "author": "Dylan Thomas \"OBTUSE\""}, {"rating": 4.0, "review": "Love it! Opened the box plugged it in turned it on put my wireless password in and it was on. Liked it so much got two more for my other sets.  Dropped cable got an antena saves $100.00 a month.", "verified": true, "helpfulness": "2/2", "author": "kevin s"}, {"rating": 3.0, "review": "The should have HBO to go they have Showtime Anytime, second I order a controller thinking it was available but no not until April 30, so I can' play the game they gave me. No instruction book I can' t  find how to turn it off.", "verified": true, "helpfulness": "1/5", "author": "Me"}, {"rating": 5.0, "review": "From the moment I opened the box I knew I had purchased a quality product. The Fire TV was very nicely packaged. All the glossy black surfaces were protected with plastic strips. Both the smallish power brick and the unit itself have gloss black sides.HardwareThe power cord could be a little longer. It is slightly under 5 ft. in length. That worked out O.K. for where I placed the unit but 6 ft. or longer would give more placement flexibility.Only Amazon and Apple seem to understand the importance of audio flexibility. Both provide a digital optical out for multichannel Dolby Digital sound on their streaming devices. Without this feature I would not have purchased the Fire TV. HDMI is fine if you have an audio receiver, sound bar, etc. with HDMI inputs. The audio hardware I use is several years old and only has digital optical inputs. Otherwise I would be listening to the sound from the TV speakers. Which is acceptable for the news, but terrible for movies and TV shows where the audio is an important part of the viewing experience.*** Important undocumented feature ***The Fire TV implements the CEC (consumer electronics control) specification of the HDMI standard. If the TV it is connected to also includes this support then YOU CAN CONTROL THE FIRE TV WITH YOUR TV REMOTE! If your Harmony remote is set up to include your TV remote then you can control the Fire TV with your Harmony remote! Of course, voice search is only available with the Amazon remote.After setup I saw that the Fire TV was showing up on my Toshiba 32in. LCD TV in the list of inputs as a REGZA-LINK device. That's the Toshiba trade name for HDMI-CEC. Below are some other TV manufacturers trade names.Trade names for CEC are Anynet+ (Samsung), Aquos Link (Sharp), BRAVIA Link and BRAVIA Sync (Sony), HDMI-CEC (Hitachi), E-link (AOC), Kuro Link (Pioneer), CE-Link and Regza Link (Toshiba), RIHD (Remote Interactive over HDMI) (Onkyo), RuncoLink (Runco International), SimpLink (LG), T-Link (ITT), HDAVI Control, EZ-Sync, VIERA Link (Panasonic), EasyLink (Philips), and NetCommand for HDMI (Mitsubishi).Performance and everything elseI dumped cable at the end of 2012 and went to OTA reception and a Windows Media Center PC to perform DVR duties. Unlike Netflix there is no Media Center plugin for Amazon Prime instant video. For viewing this content I had to exit Media Center and pick up my Adesso wireless keyboard with its integrated touch pad. Bring up a browser window, go to my watch list, pick the content, and initiate viewing. This was certainly doable but hardly ideal. Plus the MS Silverlight player only supports stereo audio output even though my Media Center PC can and does output multichannel Dolby Digital audio through the sound card. Rewinding and advancing the video is also painfully slow on the Silverlight player. With the Fire TV installed all I have to do is switch inputs on the TV. Both it and the Media Center PC can be available simultaneously.In my opinion, the Amazon Fire TV is probably the best device to buy if one of your primary uses is to stream Prime instant video content. It filled my needs exactly. The user interface is very clean and logical. The performance is outstanding. And probably most important the video and audio streaming quality is stunningly good. The best I've ever seen on any streaming device.The Amazon Fire TV may not do everything everybody thinks it should. But it does exactly what I needed probably better than any other streaming device on the market.", "verified": true, "helpfulness": "3/4", "author": "Amazon fan"}, {"rating": 1.0, "review": "This device is only for those who only watch amazon content since everything else is poorly supported. It doesn't offer as much as its competitors, it doesn't have any way of controlling it via infrared like the Roku or Apple TV which means you have to use the included remote. For those of us that use a universal remote or other control system it makes this device useless. Sending it back for that reason alone.Amazon better develop a USB infrared receiver or they will lose plenty of customers who don't want yet another remote to use. Roku is smart, they include a Bluetooth controller but also have an infrared receiver on the front for maximum flexibility. Apple TV is infrared only which is fine for most.Win Roku on this issue. Fail amazon.", "verified": true, "helpfulness": "29/41", "author": "SB1"}, {"rating": 5.0, "review": "This is by far the best streaming device i have.  I've been through all the models of roku, and the FireTv kicks their butts big time.  Essentially, this is mainly an amazon box, but you have plenty of options for other apps, such as Netflix and Hulu.  Havent played any games on it as i didnt buy a controller yet.", "verified": true, "helpfulness": "1/2", "author": "Mikel"}]