[{"rating": 2.0, "review": "Tried it for a while, but not very impressed.  Not many apps.  sometimes takes a while to connect.  Roku is much better.Roku not has YouTube, so Chromecast is not being used at all.", "verified": true, "helpfulness": "0/0", "author": "Lion"}, {"rating": 5.0, "review": "I love it. But not as good as apple TV", "verified": true, "helpfulness": "0/0", "author": "evetsp1"}, {"rating": 5.0, "review": "Bought as a gift . recepient loves it", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "me"}, {"rating": 3.0, "review": "The only really good app that they have added is Watch ESPN. Google needs to get moving on getting programmers to add the feature to their apps. I would give this 5 stars if the network and cable companies would add it to their \"watch\" apps.", "verified": false, "helpfulness": "0/0", "author": "Leftofnotcrazy"}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "William M."}, {"rating": 2.0, "review": "Great idea. Mediocre execution. I find myself almost not using it at all.There are lots of little quirks (what content will go through, what won't, etc). Device should have option to go off when not streaming. Etc.It's inexpensive and as such it's ok to have it here waiting for the few times I'll use it. But I find it much less useful that I thought I would. Tablet connected by HDMI, or Amazon Firebox, etc, do me more good on a day to day basis.", "verified": true, "helpfulness": "1/1", "author": "FD"}, {"rating": 1.0, "review": "hard to make work if not very computer savoy", "verified": true, "helpfulness": "1/4", "author": "james little"}, {"rating": 4.0, "review": "Still trying to get it to work on my upstairs tv but it works on the downstairs.", "verified": true, "helpfulness": "0/0", "author": "CindyLou"}, {"rating": 3.0, "review": "delayed streaming than expected", "verified": true, "helpfulness": "0/0", "author": "kanagaraj"}]