[{"rating": 5.0, "review": "a+", "verified": true, "helpfulness": "0/0", "author": "Jeff O'Neill"}, {"rating": 5.0, "review": "Works great. Some cool apps work with Chromecast. I wish they would get some others on board to expand our options of things to watch.", "verified": true, "helpfulness": "0/0", "author": "Ray McKiver"}, {"rating": 5.0, "review": "This is one amazing device... light, simple, efficient and solves a need many can relate to, even if they are not fully aware of it before understanding the capability is available. I have three :)", "verified": true, "helpfulness": "0/0", "author": "migever"}, {"rating": 5.0, "review": "Love it simple and easy to use", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 5.0, "review": "great product!", "verified": true, "helpfulness": "0/0", "author": "uneekfox"}, {"rating": 4.0, "review": "The Positive: Works almost flawlessly with the iPhone apps it is designed to pair with... Hulu, Netflix, etc. are worlds easier to stream to my TV directly from my phone than using SmartTV functionality or a set-top \"Smart TV Box.\"  I just open the Netflix app, indicate that I want it to show on my Chromecast (not my Phone or IPad) and hit play.  The Chromecast does the rest.  Note that Chromecast interacts directly with Netflix or other streaming services, so you do not need to keep the app open on your mobile device.  Once your media is streaming to the chromecast, you can close the app or continue navigating.  Also, streaming Chrome browser windows is very useful.The Negative: No Amazon Prime video makes it less useful than I'd like, however, you can circumvent this by streaming a chrome browser window from a PC or Mac, then playing amazon videos in the browser window. It's less convenient than with the native apps that it is designed for, but it wil still get the job done.The Verdict: For under 40$, I simplified my viewing experience, which I appreciate.  The downside is that I seem to be watching more and more netflix now as it has become just a matter of opening the app and streaming to my TV in seconds... Now I have to get back to Mad Men...", "verified": true, "helpfulness": "2/2", "author": "Peter"}, {"rating": 5.0, "review": "Works perfect and great price!", "verified": true, "helpfulness": "0/0", "author": "Austin Scheidemantel \"AU5T1N\""}, {"rating": 4.0, "review": "Enjoying using this device.", "verified": true, "helpfulness": "0/0", "author": "Darlene Stone"}, {"rating": 5.0, "review": "My son talked me into buying this and it's great. We use TiVo and couldn't get HBOGo to work. The Chromecast means we can watch HBOGo from our phone. Simple and easy to use it simply gives more options. We also took it on vacation and used it at the home we rented.", "verified": true, "helpfulness": "1/1", "author": "R. Debruhl"}, {"rating": 5.0, "review": "This is a great product and I love the fact that I can take it with me when I travel.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]