[{"rating": 5.0, "review": "As a family we can watch all the movies we want at our own time. The kids love it and my wife and I have found the few good TV series like : Breaking Bad and White Collar.", "verified": true, "helpfulness": "0/0", "author": "Jerry Illes"}, {"rating": 1.0, "review": "It doesnt have alots of features to be use by smart phones it would be better if i can use it with my gallery not only youtube, netflix...etc", "verified": true, "helpfulness": "0/1", "author": "Ahmed Al Najem"}, {"rating": 3.0, "review": "Not that many supported apps, some issues in casting.. Other than that.. It was a good cheap way to stream some HD movies to my TV.. I would recommend getting a Roku or something... More features and works better", "verified": true, "helpfulness": "0/0", "author": "WTFCinema \"Used to work in Film in LA/DC... now mainly stick to Computer/Tech...  \\_(o.o)_/\""}, {"rating": 3.0, "review": "Can only cast limited App to TV.I thought I can use it to access NAS video/image file directly.a little bit limit function.", "verified": true, "helpfulness": "0/0", "author": "Ong Keng Khai"}, {"rating": 5.0, "review": "This little sucker took so getting used to how it sets up and works, but once you figure it out, it works great.  Now I wish there were more things on my iPad that I could Chromecast to my big TV.  I set it up, got it working, tried it again a couple of weeks later.  I ended up resetting it to factory and starting over.  Now I have figured it out and I do not have to mess with it at all now.  Just cast a You-tube and use it and swich back to my cable HDMI when done.  No sweat.", "verified": true, "helpfulness": "0/0", "author": "tshef"}, {"rating": 5.0, "review": "works greatbought it for my mom so she can use netflix from her tablet.why did it take me so long to discover this device.had to buy one for myself after using hers lol", "verified": true, "helpfulness": "0/0", "author": "axlesup"}, {"rating": 4.0, "review": "My 7month old loves it. She gets to watch Baby Einstein from YouTube on big screen.My wife likes it. Mostly for the above reason, but was disappointed that apps like Amazon Instant Video, PBS, Foxnow, and others are not supported.I am not impressed. I both like and dislike it for the above mentioned reasons. I additionally don't understand why it won't cast Chrome browser (from iOS), any video playing in a browser, or pictures from iPhone/iPad.I would like it better if I didn't already have ps3, xbox360, and Samsung TV, that all stream amazons instant video, netflix, hulu, YouTube, and pandora (and many other apps).Chromecast needing a tablet or smartphone makes me dislike it and love it at the same time...  In some cases it's easier to find a YouTube clip on a tablet than on a tv remote or videogame remote, but most days after work I only wanna use one thumb to control my netflix. Some may say the tablet/smartphone casting is what sets the chromecast apart (from the above mentioned and dizzying array of ever growing streaming hardware devices), but the many many many years older ps3 can cast my iPad when watching YouTube. I know, I know, you still can't buy a ps3 for $35(chromecast), but for $99(ps3) you sure can have it all (bluray player, streaming device, casting device, and video game console).Ok that's my 2bitcoins. Teehee.", "verified": true, "helpfulness": "0/0", "author": "Marvin"}, {"rating": 5.0, "review": "What more needs to be said? I hooked this up within days of getting it and have not looked back. Going on 4 months now and more apps are coming out that makes it easier to \"cast\" what you are doing on your laptop, phone, tablet etc and it is great! I have 2 other versions of \"Google TV\" and this compliments if not surpasses it. Couple this with the ability to add apps to it makes it a must have and affordable addition to any home media enthusiast. Great to travel with wherever there is wifi for trips.", "verified": true, "helpfulness": "0/0", "author": "Bubba"}, {"rating": 5.0, "review": "Easy to set up and use. Def worth $35. Turned 70\" LCD TV into smart TV. Works with HULU, HBO GO, and YouTube", "verified": true, "helpfulness": "0/0", "author": "Kenneth Light III"}, {"rating": 5.0, "review": "I bought it for my brother but after putting in on my TV I will have to order him one next month.  It also was a really cheap price and I love using my Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Cutie"}]