[{"rating": 5.0, "review": "Great for flat screen TVs that are almost smart.", "verified": true, "helpfulness": "0/0", "author": "A. M."}, {"rating": 1.0, "review": "Apps are weak.  No real use for this", "verified": true, "helpfulness": "0/1", "author": "Droidowner8"}, {"rating": 4.0, "review": "Not bad when used with Chromecast browser.", "verified": true, "helpfulness": "0/0", "author": "Akyamo"}, {"rating": 3.0, "review": "I bought this gadget not doing my fair share of research. I was lead to believe its biggest selling point was the fact that I would be able to cast web content from my phone/tablet. This does not seem to be the case at all. I've read there are beta apps/programs that work on a user by user basis. If I would have figured out that its best use what using your phone/tablet to select a movie/video from standard apps (Netflix, Hulu, Hbogo, etc) then I probably would have stuck with a roku. That being said, the price point is very attractive. And so far I've had not issues with its performance on the compatible apps. Normally I'd bring this thing back for a refund, but for the cost (and more importantly, its potential future upgrades) I will hold on to it. If nothing else it is an excellent (and fairly priced) alternative for what is out there. I cant help but get the feeling that google has more in store for the future of this device. If not then I'm out a few $$ that I could easily waste on other things that serve no purpose at all. At the very least I can do the standard streaming services with a very small footprint. My biggest point is, dont expect to open a browser on your phone or tablet and simply stream/send it to your tv. When and if that day comes this little powerhouse will have a huge market. Overall I'd still recommend getting it if you do not run a plex server or something similar. It is somewhat nice and fun to pick your movies/shows on your phone and send them to your tv. Youtube/Music/Movies seem to work without a hitch.", "verified": false, "helpfulness": "2/2", "author": "Joe Garza"}, {"rating": 4.0, "review": "I really like how easy this was to set up. Its very convenient though I do wish you could watch Prime as easily as everything else. I knocked off one star because it is sometimes buggy when trying to connect but not buggy enough to make me dislike it.  Also the connection issues could just be my internet.", "verified": true, "helpfulness": "0/0", "author": "jo22c"}, {"rating": 5.0, "review": "Love it! Works great", "verified": true, "helpfulness": "0/0", "author": "MelissaRaven85"}, {"rating": 4.0, "review": "Amazing product! I got for 35$...with in day it fell down to 32.5$ which is sad", "verified": true, "helpfulness": "0/0", "author": "Abhishek Narayana"}, {"rating": 5.0, "review": "I've owned a Chromecast since it came out, literally one of the best purchases of my life. I can stream anything I want to it, literally anything. The best part is the Plex support, I don't even need to get on my desktop to get this baby working(yes, Netflix too, but Netflix is obviously limited). I would recommend this to anyone and everyone, best deal for anything video streaming wise.Oh also very customizable now, you can change the backgrounds to whatever you want.", "verified": true, "helpfulness": "0/0", "author": "Erik Assmus"}, {"rating": 3.0, "review": "Does not stream high def videos very efficiently. It is slow when streaming off chrome. Mkv files are not supported natively. You must download a third party extension/app for chrome.", "verified": true, "helpfulness": "0/0", "author": "Jo"}, {"rating": 5.0, "review": "works as advertised", "verified": true, "helpfulness": "0/0", "author": "Nielubie \"nielubie\""}]