[{"rating": 4.0, "review": "Great device, and very fast (videos load instantly)!  The voice search feature works excellently.  My only gripes are mainly in the advertising, the USB 3.0 thumbdrive in the product image is misleading (it's only a USB 2.0 port).  I know the tech specs list features accurately, but the image is slightly misleading.  The other being that I cannot use it as a media playback device (at least out of the box).  Having a USB port that I cannot interact with on any level is frustrating (it's just for expansion storage).", "verified": true, "helpfulness": "1/1", "author": "Luke"}, {"rating": 4.0, "review": "Works great!  Only wish Amazon Prime offered a better selection of free movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Kristi Y."}, {"rating": 5.0, "review": "Sweet", "verified": true, "helpfulness": "0/0", "author": "Hatchet jack"}, {"rating": 5.0, "review": "I have had Roku3 for a few months and like it ok except while whatching a movie the picture frequently goes from very sharp to not so sharp, then back. Very annoying. I got the Fire TV yesterday and haven't had the problem.  The only negative I can say is about the remote...it is too small and thin for my hand...it is also very slick. The Roku was much more comfortable. The Fire feels flimsy and when pressing buttons the back moves slightly.  This is not a deal breaker however. I highly recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "rd"}, {"rating": 5.0, "review": "Super product much BETTER than the Apple Air TV", "verified": true, "helpfulness": "0/0", "author": "Mike Norton"}, {"rating": 5.0, "review": "FireTv is so awesome, I now watch it instead of cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "always something on", "verified": true, "helpfulness": "0/0", "author": "lmf58"}, {"rating": 5.0, "review": "If you have Amazon Prime it's the best thing ever!  I gave away my apple tv once I got this!", "verified": true, "helpfulness": "0/0", "author": "trd808"}, {"rating": 5.0, "review": "Everything was as expected", "verified": true, "helpfulness": "0/1", "author": "David Fort"}, {"rating": 5.0, "review": "Awesome device! The voice search is great!Wish it had all of the same apps as Kindle Fire.", "verified": true, "helpfulness": "0/0", "author": "Matt Dahmen"}]