[{"rating": 4.0, "review": "I am having it for 6 months now. It was good for the most part. Two things I have noted is that the device gets heated too quickly when I touch it and also I noted that it does not work well with Chrome browser in PC..If the internet speed is slow then it gets struck and I need to reset the router..I am OK with it because it is still in beta(Chrome Browser in PC).", "verified": true, "helpfulness": "0/0", "author": "Praveeen Raj R"}, {"rating": 4.0, "review": "This works well to cast Netscape, Youtubes or your laptop scren onto your TV without a physical connection. It will only improve. It's cheap and easy to install.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I stream Netflix and Youtubes videos on this. I hope in the future more applications are supported. I can also stream chromebrowser which allows me to diplay pictures and videos from my computer. Nice and cheap and easy to install/setup.", "verified": true, "helpfulness": "0/0", "author": "chad wiegman"}, {"rating": 4.0, "review": "This device is inexpensive and works like it is supposed to.  I'm just patiently waiting for more apps to support casting, but I won't hold my breath.  This is not going to replace your Roku, but is good for that non-smart TV you have in the guest room or bedroom.", "verified": true, "helpfulness": "0/0", "author": "JMc"}, {"rating": 5.0, "review": "Chromecast is easy to set up, and the quality of the picture streaming from my Nexus 5 is absolutely unbelievable - better than streaming from my PC with an HDMI cable.  Once more apps start to support it - Watch ESPN, NHL / NFL / NBA apps, etc - it will be bar none the best $35 you can spend for entertainment.", "verified": true, "helpfulness": "0/0", "author": "G. Johnson"}, {"rating": 3.0, "review": "This is a great idea on paper, but Google seems to put thing out too early.  I really like the idea behind this, but with such limited choices on what can be used I really haven't used it much.Power - I have older TVs so I have to run the power cable to this, not the worst, but have to make sure I have an outlet available.Ease of Use - Easy to figure out how to use it, just not always the best. would like it easier to use on the road in hotels.Video Options - At first it was basically Netflix and Youtube, and what modern device doesn't have netflix in it.  I really don't watch much youtube but the Netflix does look nice.  I don't have Hulu Plus either so that is pointless, no android devices besides 1 phone.  who listens to Pandora on their TV? I have a Sonos system for that.I wish they would open it up to more options since there are way more apps to watch movies/TV and besides running Chrome on a computer to send, I want to play other options.  Maybe in the future I will like this more, but right now I really don't use it.  Worth the price I guess.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 2.0, "review": "I have ROKU which has annoying interruptions sometimes lasting  for several hours. That's why I bought chromecast but, It is not any better in this regard. Also iphone remote is additional source of annoyance. So, I got rid of it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "If you like being stuck in a cattle chute and forced to the purchase counter, then this is the one for you. No other choice, no other selection. Sucks.", "verified": false, "helpfulness": "0/3", "author": "Raymond Williams"}, {"rating": 5.0, "review": "Love it, BUT, package seriously lacks adequate installation and operation instructions!  Had to use online information constantly to resolve issues.  Some were not resolvable, i.e., when I first researched online before my purchase, it said it would work with Google Chrome on a Vista computer.  AFTER purchase and digging down deeper on requirements and user comments I found it will only work with Windows 7 and above.  Very disappointed with that.  Now I have to use my cell phone and again, with little instruction - not easy at all!", "verified": true, "helpfulness": "0/0", "author": "Nancy Nelson"}, {"rating": 1.0, "review": "2 issues:1- The extension harness they send with it causes issues, there is freezing of the screen every ~8 seconds with their \"wifi signal enhancer\" extension.  Unsure if others are having this issue as well.2- It would have received 5 stars if they didn't remove the .AVI functionality from it.  You \"Used\" to be able to go to your C: C Drive and use Chrome as a file explorer, playing most any format.  They removed the .AVI compatibility with the latest automatic mandatory update.  Until this gets fixed, you are stuck with only support of a few video files.", "verified": true, "helpfulness": "0/0", "author": "Scott G"}]