[{"rating": 1.0, "review": "The promise is great and some reviews rave about how easy it is to use.  I'll admit, setup was easy and it started streaming in very little time, however there are some major setbacks.  First of all I'm using this on a Core2Duo Sony Windows 7 Pro 64-bit laptop with 8GB of RAM which has no problem streaming HD video over the HDMI cabled connection which I do all the time.  The Chromecast seemed like the perfect way to avoid having a cable suspended across the living room --- wrong.  The video quality is high-definition-ish, but jumpy and jittery as well as being constantly out of sync with the audio with every video I tried.  I tried several different videos and sites (YouTube, NBC, LFDH, Netflix, etc.) to be sure it wasn't just one site that was having an issue, but it was all due to the Chromecast.  Whether it is the dongle, itself or the software, I don't know, but that's another issue.  You MUST use Google Chrome to stream to the Chromecast (hence the name, I suppose) and it can only stream from within that browser; it can't be used to stream PowerPoint presentations or anything outside the Chrome browser window which is disappointing.", "verified": false, "helpfulness": "0/2", "author": "Joseph R. Vining"}, {"rating": 5.0, "review": "Do I love this product???  In the past month I have purchased and given away over forty (40) Chomecasts as gifts to my staff and close colleagues (mostly 18-35 year olds). This gift has been a huge hit.Perhaps this is why Time Magazine named it the \"Gadget of the Year\".Currently there are only a few apps available, but Google is releasing the developers kit and many more apps will be available in the coming year.  It is only going to gain in value.Yes, the Roku 3 is a nice streaming unit.  However I was able to update three (3) of my older TV's with Cromecasts for the price of one Roku 3.", "verified": true, "helpfulness": "0/0", "author": "ZAPMAN \"ZAP Foto\""}, {"rating": 5.0, "review": "Don't know but I'll find out X-Mas day! Looks like it will be just what she wanted for her movie watching!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This item doesn't really do anything more than my satellite box receiver does. It's also tricky to switch music and video in mid-stream. Freezes and stop and go videos happen often and you need to restart the whole process time and time again.  IT'S NOT FLUID!", "verified": true, "helpfulness": "0/0", "author": "Kevin Gilbert"}, {"rating": 5.0, "review": "This is the greatest thing since slice bread. In fact I had to order another one to stay out of trouble  with the family", "verified": true, "helpfulness": "0/0", "author": "Kevin Kern"}, {"rating": 4.0, "review": "I would describe myself as an audiophile/videophile, although by no means a \"golden-ear\" type. For example, I never listen to MP3s (lossy) -- instead all my CDs are ripped to lossless FLAC. I use a (somewhat hacked) Logitech Touch to stream music to my stereo system. As for video I don't watch streaming video (from Netflix, Amazon, etc) because the quality does not match blu-ray. However I decided to checkout Chromecast since it does 1080p. I use it primarily to watch YouTube videos, which vary in quality. I think the potential for this inexpensive device is there ... it just needs software support to stream more sources. Hopefully that will come in the future.", "verified": true, "helpfulness": "1/1", "author": "mrnuxi"}, {"rating": 5.0, "review": "It came to the.house on time..it works great love how it sinks so well  to my android phone, and my computer..", "verified": true, "helpfulness": "0/0", "author": "JG"}, {"rating": 5.0, "review": "Easy to install, easy to use and so affordable.  Have used it a lot more than I thought I would, and has gotten me one step closer to cutting the cable cord permanently.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Setup was a breeze, quality is nearly as good as HD broadcasts. (used with Youtube & Netflix).The fact that you can stream from a tab on a Chrome browser (PC & Mac) makes that this a very versatile tool.", "verified": true, "helpfulness": "0/0", "author": "eNuts \"eNuts\""}, {"rating": 1.0, "review": "First, even after going through a painful process of connection, it works, and then when you want to run it again, it either doesn't show up on your iphone, or ipad, or computer, and even when it's running, it freezes a lot.  After a while, you simply give up, and forget that a Chromecast is attached to the back of your TV.", "verified": true, "helpfulness": "0/1", "author": "Karsang"}]