[{"rating": 5.0, "review": "I love this little gadget. While it definitely is best used with an Android phone or tablet for a seamless experience, I still find myself being very pleased with the product when I am stuck with using a laptop to operate it. Highly recommend it", "verified": true, "helpfulness": "0/0", "author": "abraham aboubakare"}, {"rating": 5.0, "review": "We use it mainly for watching NetFlix movies and control it with an App running on an iPad. We have had it a few months and have not had any problems with it.", "verified": true, "helpfulness": "0/0", "author": "Jim Davis"}, {"rating": 4.0, "review": "Was told that I needed a dual band router. Wish I didn't have to spend another $70 but hopefully it will be worth it in the end.", "verified": true, "helpfulness": "0/0", "author": "Tere"}, {"rating": 5.0, "review": "This little device is very awesome and makes streaming amazingly easy...love being able to watch Netflix on my TV; if you don't have one, get one.", "verified": true, "helpfulness": "0/0", "author": "Carol L. Nelson"}, {"rating": 5.0, "review": "I bought this for my husband for Christmas and he has told me countless times how much he loves it.  He uses it in conjunction with HBO GO on his cell phone to watch all of his favorite series'.", "verified": true, "helpfulness": "0/0", "author": "CherylT"}, {"rating": 5.0, "review": "I work for an electronics company, a big one that makes similar products to this. Yet I took a chance and ordered a Chromecast for \"research\". I now use it every day. You will never find me on the couch without my tablet or phone so this is ideal for me.Very simple to use, install and recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "djjohns"}, {"rating": 4.0, "review": "It glitched and the customer support person said it does that when powered through USB.  Otherwise perfroms as advertised and i got it setup, but there is no way my wife could have got it working.", "verified": true, "helpfulness": "0/0", "author": "T. Schmidt"}, {"rating": 5.0, "review": "I have bought three of these so far from Amazon. They go on sale for 29.99 quite frequently so I seem to snatch them up when that happens. It's great being able to stream Netflix/Plex/youTube to them all over the house.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This product did not fit into my TV - the HDMI port was on the back, and the flat screen TV could not be mounted on the wall.  The Chomecast broke.  It also was not compatible with our wi-fi router.", "verified": true, "helpfulness": "2/4", "author": "loveallanimals"}, {"rating": 5.0, "review": "I got mine for about $35 - which is waayy cheaper than the apple device.  Super easy to install (basically plug-n and link your device to it).Now I've been watching Netflix on my tv instead of my laptop or phone, in addition to other subscriptions - easily from my phone.  Youtube cat videos on my tv instead of my wee phone - nothing better!", "verified": true, "helpfulness": "0/0", "author": "Sally"}]