[{"rating": 5.0, "review": "I now have two of these. Both work like a dream. Initially I had to upgrade the firmware on my router, and they still lose contact with the router once every couple of months. But the ability to cast Netflix and YouTube to my TV more than makes up for an occasionally reboot of my router. I am amazed that such an inexpensive gadget works so well.", "verified": true, "helpfulness": "0/0", "author": "Greg McCollum"}, {"rating": 4.0, "review": "For the price this is an amazing product. Setup is quick and straightforward. As long as you have a decent wifi connection the Chromecast will work incredibly well. The only downside of this product is that it doesn't offer security in the event you share or use a public Internet connection. As long as the individuals sharing the wifi are respectful and don't stream random content to your device, the Google Chromecast is terrific.", "verified": true, "helpfulness": "0/0", "author": "CondorSpread"}, {"rating": 5.0, "review": "Google, you're the s**** - big thanks for creating this cheap and brilliant device.", "verified": true, "helpfulness": "0/0", "author": "Emilio A."}, {"rating": 4.0, "review": "It does have a steep learning curve, but once a got used to it, it became very useful in translating my Hulu selections on tablet to the \"big\" screen", "verified": true, "helpfulness": "0/0", "author": "JohnWarren"}, {"rating": 5.0, "review": "Im really happy with it", "verified": false, "helpfulness": "0/0", "author": "EliasJoelRH"}, {"rating": 4.0, "review": "Even without an android the application functionality is worth it. If you have a smart TV it might not be as awesome a value but the ability to stream any media from any source over the phone or tablet makes it a must have. If you consume video from outside the normal netflix/amazon/youtube big three, you want to buy this.", "verified": true, "helpfulness": "0/0", "author": "Joshua D. Knarr"}, {"rating": 5.0, "review": "love it, have 3 in my home! best device ever!", "verified": true, "helpfulness": "0/0", "author": "Jabez Rubio"}, {"rating": 2.0, "review": "Keeps over heating", "verified": true, "helpfulness": "0/0", "author": "Faith"}, {"rating": 5.0, "review": "Love having Chromcast. However, I can't play Amazon movies with it. (Amazon's fault). It's frustrating when businesses put the customer in the middle.", "verified": true, "helpfulness": "0/0", "author": "Liz Dahlen"}, {"rating": 5.0, "review": "quick delivery and just what I wanted thanks.", "verified": true, "helpfulness": "0/0", "author": "Michelle Karr"}]