[{"rating": 5.0, "review": "best thing i have purchased since joining amazon prime!", "verified": true, "helpfulness": "1/1", "author": "AdamsBQ06"}, {"rating": 4.0, "review": "Hope that in future will be able to use Fire TV - Prime in Brazil as well!", "verified": true, "helpfulness": "0/3", "author": "Carlos Farina"}, {"rating": 5.0, "review": "Great device if you want to cut the cord from cable.  Very east set-up and install, easy to use, takes very little room behind the TV.  With my prime membership and the netflix app and watch ESPN app I wonder why I ever paid for cable.", "verified": true, "helpfulness": "1/1", "author": "Brian W."}, {"rating": 5.0, "review": "Love everything about the Amazon Fire, so worth it!", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 5.0, "review": "Better than Roku.", "verified": true, "helpfulness": "2/2", "author": "Randy Wright"}, {"rating": 4.0, "review": "Purchased a FireTV the other day from local big box store and a bit up in the air with it. I currently own two Roku units and an Apple TV and wanted to update one of the older Rokus as the performance is rather lacking.1. The performance of the FireTV is quite a bit better than the other boxes out there as I can open the streaming apps much quicker than on the other boxes, ESPN and Disney will load very quickly and a bit cleaner. Performance is noticeably better with the FireTV.2. The user interface has too much going on and a bit overwhelming. The Apple TV has it beat in the interface as that is much cleaner and easier to scroll through. Roku is also easier to scroll through the apps as compared to the FireTV. I have yet to find an easy way to modify the user interface on FireTV to clean it up and make it easier to scroll through.3. You can side load apps onto the fireTV which gives you access to apk installs from outside the Amazon marketplace. However the user interface will not easily present the side loaded apps, however multiple apps I have sideloaded have worked very well, even when they are not offered through the Amazon marketplace.4. There are many more apps you can utilize with the FireTV from games and streaming apps, Roku has a few games, but nothing near the options of FireTV. The streaming apps have mostly the same choices between the Fire and Roku. The Apple TV is lacking of games completely and you are locked in with that is provided through Apple, unless you are willing to hack the box. The games that I have run are some simple free games in the marketplace and my children do enjoy them which is a nice bonus. I have not gotten over to any of the larger games, so I do not know the performance or visual appeal of them.I have a Plex server in my home and can run through the FireTV pretty cleanly with an app that has more functionality compared to the Roku Plex app. The Apple TV however does not do this easily without modifying the box which is a downfall in that unit. Plex runs very well with this box and loads up without problems.The nice portions are the FireTV has more power, more apps available than the others, however the interface is where my problems are with the box. The prime videos are mixed in with the for fee videos which I would prefer not to be mixed in the main screens as well as there is no method to hide the fee video options. The other item I have noticed is that once in a while the FireTV will drop the Ethernet connections during streaming which I have never noticed problems on my other units with dropping a connection, also utilizing the same network ports on my switches that my other units were in, I also do see the FireTV dropping and re-establishing a link in my switches, so appears to be something with that. I will switch over to wireless and see if there are also issues there. Nothing major, just odd behavior at times.Basically the box is nothing great over the other choices in my opinion, it does the same stuff and comes down to personal preference. If you want to play games, FireTV is better choice, just streaming and integrate with an existing iTunes account you would want Apple TV. If you want streaming with large app choices with a simple GUI, then Roku is a good option as well. I still end up migrating over to the Apple TV in the house as I prefer the interface over the others.", "verified": true, "helpfulness": "1/1", "author": "David Smith"}, {"rating": 5.0, "review": "This is the real deal! After having issues with my Sony UI, this has been a real treat.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As good as I expected and more.  The remote is elegant, simple and functional.  Voice search is incredible and the menus are easy to follow and intuitive.  The interface with \"music\" could be more functional if it more closely mirrored the capabilities of the Prime Music player app, however, the ability to access play lists does compensate somewhat for the limited \"music\" interface.  Addition of access to Prime Music is a much needed enhancement, as well.In spite of a few limitations, I could not be happier!", "verified": true, "helpfulness": "0/0", "author": "Franklin C. King"}, {"rating": 3.0, "review": "Unlike other products, Amazon Fire TV does not have a section to post questions about the product.  Therefore, before buying this product, my question is this:  Does this product allow one to surf the web on the TV, or does it only go to a specific selection of websites?  Thanks.", "verified": false, "helpfulness": "1/8", "author": "potential customer"}, {"rating": 3.0, "review": "**Edited 12/10/14- So as of today, I am not going to be using my FireTV, as it doesn't work with Hulu.  I am returning it.  I liked the idea of this device, just that I use Hulu all the time, and I want to be able to watch it.**I have owned this since Saturday, today is Monday.  I thought I'd give my thoughts on it after 2 days of use and then come back later if needed.So I read reviews on this for a long time.  Every time my Roku froze or something, I'd read the reviews.  And since the FireTV has come out, it has already been improved, however there are some things, that I just don't like...Like so many others, the Amazon Prime streaming, everything is ALL together, and while you think it wouldn't be a big deal (as I thought too), it is kinda bothersome, because you think that you want to watch something, and find out it is $1.99 to $3.99 to rent for movie or TV series.  I like the way it is set up on the Roku much better than with this one.  I like to hope though, that it will change, once people complain about it ... more LOL.The remote, but that is just a matter of ME getting used to it LOL.  I go to hit play and hit the home button, Kinda wish that Home button was somewhere else on the remote.The speed is much better than my Roku, it connects better, and faster.  I don't regret buying this product as of yet.", "verified": true, "helpfulness": "3/3", "author": "~Shawn~"}]