[{"rating": 5.0, "review": "Works exactly as advertised.  Love the interface with all of my Google programs.  Have used with Netflix, Youtube, Pandora, Google music from phone, laptop and tablet.  Have had success with Chrome from the laptop and have been able to stream some video through Chrome.  Does what it is advertised to do and works well.", "verified": true, "helpfulness": "1/1", "author": "grayfamily"}, {"rating": 2.0, "review": "While I think this a good idea, it kinda falls flat on it face. There is almost no support for local media, and by almost, I mean it can, but it's not a pleasant experience. In order to stream local media you must use the tab casting feature of the chrome browser. The chrome browser must support the codec you are trying to cast of course, which may limit some users. The videos I tried streaming were H264 with AAC audio. The streaming seemed to work but in order for the video to be full screen on your tv, you must make the video full screen on your computer screen. Oh and I have to mention that the video is limited to the aspect ratio of your computer screen. So if your computer screen is 4:3 and your tv is 16:9, then your widescreen video will be doubly letter boxed. The streaming was also taking up 75-100% processor usage of one of my CPU cores so it appears chrome also has to transcode the video on the fly.IMHO, this product is only really meant for streaming YouTube and Netflix. Since I do not subscribe to Netflix I'm limited to YouTube and there's only so many cat videos before you've really seen them all. So to sum it up, if you want to stream Netflix movies, you probably can't go wrong with this product. If you want to stream anything else, your better off with a Roku.Pros:  Nice and cheap  Good ideaCons:  No real support for local media (chrome tab casting is horrible)  Only real streaming options are YouTube and Netflix.Note to Amazon: Please get it together and provide support for Prime Video... pretty please...", "verified": true, "helpfulness": "1/1", "author": "Gonkers"}, {"rating": 5.0, "review": "Works like a charm.  Easy set up in like 5 minutes.  Bridges the gap for streaming to a non-smart but way nice 58\" HD plasma.  Very cool.", "verified": true, "helpfulness": "0/0", "author": "blackdog"}, {"rating": 3.0, "review": "It works well for things like youtube but if you are watching a live streaming event, the delay is bad.", "verified": true, "helpfulness": "1/1", "author": "Dave"}, {"rating": 1.0, "review": "I am very dispointed.1) today you can basically only watch netflix and youtube2) it works very inconsistently. I use it with an ipad air. Every three time i use it i have issues. Impossible to stop the video playing. I have to literrally to pull the plug of the chromecast from my tv, and reboot my ipad. Very frustrating.", "verified": false, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My TV's HDMI ports come out the back not side and the back of the TV is pretty close to the wall, so I had to use the HDMI extender cable that comes with it so the Chromecast wouldn't hit my wall or the TV wall mount.  Super easy to set up and use. Picture quality is surprisingly good.  Best way to transform a dumb TV into a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "cdk"}, {"rating": 4.0, "review": "It  does almost everything that it's supposed to do.Too bad it's not fully integrated with either Android or IOS devices (cannot stream web pages from these devices).", "verified": true, "helpfulness": "0/0", "author": "Partenopeo"}, {"rating": 4.0, "review": "So easy to watch Netflix on my tv. I wish there were more compatible apps though.. Limited for the ipad :(", "verified": true, "helpfulness": "0/0", "author": "Ella"}, {"rating": 5.0, "review": "This thing is amazing. My only regret is not purchasing it when it was five bucks.As more and more applications/companies join the Chromecast revolution, it only gets better!!!", "verified": true, "helpfulness": "0/0", "author": "Dana Tassler"}, {"rating": 5.0, "review": "Love it work with kindle and ipod touch. It take awhile to download on tv but well worth it.  To use make sure you get the app.for this or goto google to set up. Good for netflix, hulu and youtube.", "verified": false, "helpfulness": "0/0", "author": "Be great if it stop skipping"}]