[{"rating": 5.0, "review": "worked great right out the box", "verified": true, "helpfulness": "0/1", "author": "Gary Bohannon"}, {"rating": 4.0, "review": "Works great for prime, but is really unpolished for just about everything else. I prefer my old, old, Apple TV as far as user experience goes. This box has a long way to go before becoming a seamless part of my evenings. It's a box to purchase things from, not a box to just relax and surf what's available.", "verified": true, "helpfulness": "0/1", "author": "J. Ward"}, {"rating": 4.0, "review": "I like the features of the fire TV, but I wish that more of the recent films were included in the prime. Without that... Watching films is not different from my optimum rentals on my TV. I do enjoy being too watch some series for free, but again some of them cost additional money. I like that my photos can be viewed on the TV, but u can't seem to organize the order of the slide show from the amazon cloud, which is annoying especially when viewing older family pictures. The music app works well. I was trying to watch the interview on you tube, but couldn't since it requested me to confirm my age and I couldn't figure it out. That should have confirmed I was one enough for sure! How the feedback helps.", "verified": false, "helpfulness": "1/1", "author": "Barbara Feldman"}, {"rating": 3.0, "review": "It is very disappointing that the apps like HBO GO and Showtime Anytime are not available because Comcast/Xfiinity is not providing the services to Amazon Fire. Comcast is the largest cable provider in the US.  WHY DOES AMAZON NOT HAVE THEM SET UP OR AT LEAST A WARNING THAT MUCH OF THE GOODNESS OF FIRE TV IS DEPENDENT ON WHICH CABLE COMPANY YOU HAVE?", "verified": true, "helpfulness": "0/2", "author": "bluezebra16"}, {"rating": 5.0, "review": "Great addition to my tv, easy to navigate thru the menu.", "verified": true, "helpfulness": "0/1", "author": "Marcia Kyriakou"}, {"rating": 1.0, "review": "First the remote would not work,battery was dead,after pluging it in,it kept tuning itself off,had to reboot it to make it work.  Geralde.", "verified": true, "helpfulness": "1/3", "author": "geralde"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/1", "author": "Tim Wells"}, {"rating": 5.0, "review": "This is an awesome purchase and my second one for the house.  This product is great for entertaining bc you can do so many things with it.  My wife and I will play party games that we have downloaded through the app store with our neighbors, we can stream music and let the screensaver turn on as a slide show, or we can watch movies with friends.Cons:  the only real call out I have is that I would like more connectivity between this device and my pc.  The only way I have really found to create a good link is in the YouTube app, otherwise, I can't really use my PC with this device to mirror, control, or view through my computer.", "verified": true, "helpfulness": "0/0", "author": "RPACE"}, {"rating": 5.0, "review": "I am still learning and definitely not a techie, but so far so good.  The voice control remote is amazing and I was so shocked to see how small the unit was.  Looking forward to learning more about what it offers.", "verified": true, "helpfulness": "0/0", "author": "Shelvie J. Cole"}, {"rating": 5.0, "review": "Great price.  Works great.  Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "C T Williams"}]