[{"rating": 5.0, "review": "I have Sharp LC-60LE640U tv, it has smart features built in.  You will ask: why do you need it if you've already had the smart tv?Well, first of all, convenience.  Each time I turn on my tv, Chromecast becomes available within a few seconds (WIFI connection), no mater you switch to that channel or not, it's always there.  When I need to cast something from my pc or tablet, I just click that icon in the corner, it will automatically switch to Chromecast channel on tv.  Life is much more enjoyable now...Secondly, each time I tried to stream my photo and video from my pc to tv, I had to use its built-in DLNA feature to PULL the sources (because it's a DLNA DMP, not DMR), it's very hard to use remote control to search on tv.  Now with Chromecast, I can PUSH anything from my pc to tv, that saves me a lot of time and energy!  This is another $30 (it's now back to $35)  well spent, it's worth every penny.Last but not least, after I got this, I've found the viki site, which has tons of free tv series from China, Korea, Japan, and many other countries, literally you can watch tv shows from the whole world!  Viki has built-in Chromecast support now, just like Youtube.I'd highly recommend it if you are someone like me.", "verified": false, "helpfulness": "2/2", "author": "ULong \"bill\""}, {"rating": 1.0, "review": "Not what I was looking for.  I was told this is for streaming media but actually all it does is let you play apps on your Tv.  Then I read on googles website that It used to let you stream media but the most recent update blocks that now.  It silly that I need to be by my computer or have a tablet or phone in my hand to use it.  If your looking for something to watch youtube or netflix on your tv this is fine but there are already a couple things you probally already own that can do this.", "verified": true, "helpfulness": "0/0", "author": "me"}, {"rating": 5.0, "review": "Just received the chromecast - happy with the product - small simple and functional. Its a step up. Wish there were more apps to make it more usable.", "verified": true, "helpfulness": "0/0", "author": "Mohit Khanduja"}, {"rating": 5.0, "review": "it's super easy to set up, just plug in and following the instruction on the screen. watch youtube on big screen and use smartphone as remote control without having to turn on wii or xbox feels great. But watching netflix is not as good and smooth as using wii to watch", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I hope Google add more apps soon. For mention someones: HBO to Go, Crackle, Amazon Prime, and enhance Chrome functionality.", "verified": true, "helpfulness": "0/0", "author": "Angel Calzadillas"}, {"rating": 5.0, "review": "pretty easy to use, and we can operate with our smart phone.and so simple to use................ sdfasdfasd asdfa asdf asd", "verified": true, "helpfulness": "0/0", "author": "Shashank Gangimalla"}, {"rating": 4.0, "review": "It was very easy to setup and use.I had it working in less then 10 minutes using my phone [Android].Took one star away for small list of compatible apps right now.", "verified": true, "helpfulness": "0/0", "author": "Kathleen"}, {"rating": 4.0, "review": "Simple to setup although there was no instructions on doing so.  Great quality output to TV making family viewing together a joy.", "verified": true, "helpfulness": "0/0", "author": "David Musgrave"}, {"rating": 5.0, "review": "Excellent! Performing as expected!Very easy to install and use.it.I recomend Avia app for local streaming.pic and videos.:).THANKSLove it!..Love it!.", "verified": true, "helpfulness": "0/0", "author": "Francisco Carbo Bayron"}, {"rating": 5.0, "review": "I just plugged it in, to the back of the TV, added the USB cable (plugged in to the USB/diagnostic port on the TV; it's just for power, not data, methinks), and it was done.  Then I installed the Chromecast app. on iDevices, and we were up and streaming Netflix.  (We did already have WiFi in our house.)  We love it.  And, the \"screen saver\" photos it shows when you are not \"casting\" anything, are GORGEOUS (and they rotate).", "verified": true, "helpfulness": "0/0", "author": "Gary A. Gardner"}]