[{"rating": 3.0, "review": "Could never make it work! Total incompatibility and a pita to try. Hope better for others!", "verified": true, "helpfulness": "0/0", "author": "J. Brooks \"Photo Mama\""}, {"rating": 5.0, "review": "Bought this just so I could stream YouTube videos to my television. Works perfectly. My cat is pretty happy with it, too, because now she can watch all her bird videos on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Barbara A. B. Bailey"}, {"rating": 5.0, "review": "This does everything i expected and more. I have a custom built desktop and i have a HDMI cord coming from my computer into my T.V. to watch Netflix/Hulu/Youtube. However, it was a pain getting out of my bed to walk to my computer and switch tv shows or videos. The Chromecast takes care of that problem as i can control it from my phone while in my bed. (Laziness achieved lol). I'm also able to stream my google Music playlist from my phone as well(which is a huge plus since i pay for a subscription). For me there is a slight problem with this. I've noticed that the google music screen will buffer indefinitely and not stream my playlist from time to time. You can get around this by casting your entire phone to your desktop and play your music that way so just be aware of that. I'm even able to watch snapchat videos on my tv. It's not super special or anything but it's nice to be able to do that. The time it takes to buffer your video is primarily on your internet speed.  For me, it's a reasonable amount of time(7-10 seconds for HD). It's a product by Google, it'd be tough to trump them. I'd recommend over the other choices. I'm a college student so 30$ is more than affordable to turn my TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "Rathinasabapathy Devarajan"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "Jilene C."}, {"rating": 5.0, "review": "This is absolutely amazing.....for me anyway...  Cable has nothing good anymore, and it's the same thing over and over... There are so many great movies and videos on YouTube that I've wished over the years that we could all watch it on t.v. Instead of a little phone or iPod....  And now it can be done! And so very simple, quick and easy.. The streaming from YouTube is excellent. That's all I use so far. I'm sure other sources will work just as smooth....oh! I forgot Crackel... I've used it... Works great, just not a lot of stuff to watch.....  Also, I love being able to use iPod or phone as the remote... You can pause, go to the next video, control the volume.......  Very satisfied..... Arrived in about a week. I love Amazon!", "verified": true, "helpfulness": "0/0", "author": "matt phillips"}, {"rating": 5.0, "review": "Love it.  It arrived quickly and works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Most useful product for casting lot of videos and apps.", "verified": true, "helpfulness": "0/0", "author": "Ramkumar Ganesan"}, {"rating": 5.0, "review": "Everyone needs one for streaming to a TV at some point.", "verified": true, "helpfulness": "0/0", "author": "Peter Rouviere"}, {"rating": 5.0, "review": "Very nice!", "verified": true, "helpfulness": "0/0", "author": "Andrew Ip \"Watchbuyer\""}]