[{"rating": 3.0, "review": "I brought this one for my Mom and it stopped working for her after a while.  The original one that I purchased still works fine.", "verified": false, "helpfulness": "0/1", "author": "Ebonie Jones"}, {"rating": 3.0, "review": "Wish there was a way to charge it instead of having plugged in to wall,,works great from iPad and android cell phone..", "verified": true, "helpfulness": "0/1", "author": "Salogsdon502"}, {"rating": 5.0, "review": "Love It!", "verified": true, "helpfulness": "0/0", "author": "ryan casey \"If at first you don't succeed, skydiving is not for you.\""}, {"rating": 3.0, "review": "Since this has to connect to another devices and my WiFi, I kept losing the signal. Besides Netflix which I can get from other devices, this was for Google music going to main TV, but kept buffering all the time.", "verified": true, "helpfulness": "0/0", "author": "Trying2help"}, {"rating": 2.0, "review": "Not very useful.  I wouldn't buy again.", "verified": true, "helpfulness": "0/0", "author": "One Way Mac \"Mac\""}, {"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "Larry Bretz"}, {"rating": 3.0, "review": "i know the idea behind this must have made sense at the time but in all truthfulness, it doesn't do much other than act as tv dlna medium for you android phone. you literally can't do nothing with it if you dont have a phone to send media from. returned it and got the fireTv instead, a better expediture", "verified": true, "helpfulness": "0/0", "author": "shilezi"}, {"rating": 1.0, "review": "This device will not work with Comcast XFINITY modem SMCD3GNV, which is only about 18 moths old because the modem is not set up for universal plug and play. No one from Comcast would help me, SMC was unreachable and I waited for ever for GOOGLE on the phone before finally abandoning the call.Many online posts confirm that these two devices are incompatible.", "verified": true, "helpfulness": "0/0", "author": "PHD 600"}, {"rating": 5.0, "review": "Fabulous product..", "verified": true, "helpfulness": "0/0", "author": "B. T. Wajerski \"Eagle Eyes\""}, {"rating": 3.0, "review": "Roku may be better...but this is cool.....just not happy you have to use your phone or tablet as 'remote control'", "verified": true, "helpfulness": "0/0", "author": "J. Prescott"}]