[{"rating": 5.0, "review": "If you need to watch on a bigger screen and don't want to go through the hassle of going to cable/satellite tv, get this unit and all the stuff you used to DVR will be at your fingertips.  Simple and easy to use, and even if you have a problem, customer service will walk you through the installation.  It's a godsend for those who are tired of watching on your smartphone or computer.", "verified": true, "helpfulness": "0/0", "author": "Arnold Kim"}, {"rating": 5.0, "review": "We bought this for my daughter, who mostly watches Netflix and Amazon Prime.  She loved how simple this was to insert on the back of her tv.  She no longer has to watch Netflix on her laptop, which is bulky and gets hot. This is MUCH cheaper than Apple TV.  So worth the price.", "verified": true, "helpfulness": "0/1", "author": "Hatjuggler \"Hatjuggler\""}, {"rating": 4.0, "review": "This item was bought for a gift. It was a good price and easy shopping. Will shop this way more often.", "verified": true, "helpfulness": "0/0", "author": "John Cromeans"}, {"rating": 3.0, "review": "You must download an app and link the dongle to your wifi, then link your tablet/laptop to the dongle.  Not difficult.IMPORTANT: If you get TV sound via a Home Theater system, you MUST buy an adapter like this: ViewHD Premium HDMI to HDMI + Audio (sPDIF + RAC L/R) Audio Extractor.  Then plug the adapter into your TV, plug Chromecast dongle into adapter, and run a cable from adapter to your Home theater audio output.", "verified": true, "helpfulness": "0/0", "author": "Fly Fisher"}, {"rating": 5.0, "review": "This is easy to use and works very well.  There isn't really anything that can compete with the chromecast in terms of quality at anywhere near its price.  The lack of apps isn't really a big deal for video because you can just stream from chrome tabs, playing audio playlists is a bit of a hassle unless you have them in google play music.  It seems to stream better/more smoothly when casting from newer computers, but does the job passably from my cheap 5 year old emachines laptop.", "verified": true, "helpfulness": "0/0", "author": "J. Moriarty \"JM\""}, {"rating": 4.0, "review": "The google always innovating their equipment. The Chromecast, for those who do not have a digital TV, is an excellent resource to watch videos from youtube and other programs on a TV.Unfortunately not yet supports many options.", "verified": true, "helpfulness": "0/0", "author": "Antonio Tarcizio Gusman Ferreira Junior"}, {"rating": 2.0, "review": "Disappointed.  It is limited with Apple products.  It works well with anything that plays through Chrome.  So far have not been able to view my photos or slideshows on the TV.", "verified": true, "helpfulness": "0/0", "author": "PJN-Rochester, NY"}, {"rating": 3.0, "review": "I realized its no different than what my dvd player does, probably will give it to someone , otherwise its good.", "verified": true, "helpfulness": "0/0", "author": "JCT Arizona"}, {"rating": 4.0, "review": "Good product, very user friendly.Good value for 35$Too bad that tab casting when streaming shows is laggin and out of sync.Few apps at the moment that support chromecast..", "verified": true, "helpfulness": "0/0", "author": "Nimrod"}, {"rating": 1.0, "review": "I bought this for my android tablet and hoped it will support \"airplay\" or \"mirroring\"-like function for the tablet.I was disappointed to find out. It did not support mirroring like function. I bought a Micracast stick instead.", "verified": true, "helpfulness": "1/1", "author": "Techy A."}]