[{"rating": 4.0, "review": "Chromecast does what i thought it was going to do. The directions are a little vague so once you go on line and read more, it works.", "verified": true, "helpfulness": "0/0", "author": "Benne"}, {"rating": 4.0, "review": "I dont give 5 starts because chromecast has a problem with netflix but in general es great . . .", "verified": true, "helpfulness": "0/0", "author": "Roberto Duran"}, {"rating": 2.0, "review": "This is not as easy to set up as it sounds.Even if you are wonderful working with electronic things this is extremely difficult to get going right and between Netflix and Google it take a long time.  Finally had to return the first one and then the second one.", "verified": true, "helpfulness": "0/0", "author": "Nellie"}, {"rating": 5.0, "review": "This is a really neat little device.  The only issue I have is I sit about 20 feet away from big screen TV.  This works pretty good from smart phone.  I haven't had it on enough to get laptop to make it work yet.  The range is 20 feet so it's a little finicky to start each time.  But to watch Netflix you don't have to have a play station or x box.  Pretty cool for a 60 yr old to make it work too.", "verified": true, "helpfulness": "1/1", "author": "Coal Tired"}, {"rating": 5.0, "review": "Love being able to stream YouTube on the big screen when showing my husband the funny and exciting things there are to see...", "verified": true, "helpfulness": "0/0", "author": "Lynette"}, {"rating": 5.0, "review": "This is amazing! I was using an HDMI cable to connect my laptop to my TV and when I read about Chromecast, I decided to try it.  It works perfectly and my phone acts as a remote.", "verified": true, "helpfulness": "0/0", "author": "P. Kiessling"}, {"rating": 5.0, "review": "It is Compact and effective this connects all you stuff to any hdmi  configured TV, which is most TV's today!", "verified": true, "helpfulness": "0/0", "author": "BobW"}, {"rating": 5.0, "review": "This thing is awesome! Works every time and is a no fuss, no hassle, set up and use item. Buy one!", "verified": true, "helpfulness": "0/0", "author": "Aaron Jackson"}, {"rating": 3.0, "review": "To me, it is more compatible to languages other than English than many media players which adhere to one language only.", "verified": true, "helpfulness": "0/0", "author": "BADR A. ABUALHAMAIL"}, {"rating": 5.0, "review": "Chromecast is great to stream Netflix or YouTube over our TV. Easy setup and flawless operation makes this device a must have!", "verified": true, "helpfulness": "0/0", "author": "jacksonmjcpo"}]