[{"rating": 5.0, "review": "Great for streaming most media to my living room from anywhere in the house!", "verified": true, "helpfulness": "0/0", "author": "scott"}, {"rating": 5.0, "review": "I am very satisfied pleased with the Product", "verified": true, "helpfulness": "0/0", "author": "jerome anderson"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "Kristians Mohamed"}, {"rating": 5.0, "review": "Awesome device.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "Chromecast has made this media center nerd a very happy person.  It could have more apps, better screen sharing, and just a little more umph overall, but this has taken the place of EVERYTHING for watching TV and Movies at home.  Make sure you know that you will need an account for most apps (Plex, Netflix, Hulu, HBO, Xfinity TV are the most useful to me.) But seriously, cut the cord with your cable company and get a Chromecast... If you're very bad with technology, get a Roku Stick, but if you can operate a smart phone well, then this is what you're looking for.", "verified": true, "helpfulness": "0/0", "author": "Antone H. Hammers"}, {"rating": 2.0, "review": "Nothing is free. After an easy but quite a few minutes install, all I saw were options for 1 month free trial to all sorts of broadcasts IF you immediately provide a credit card so they could bill you $7-8 month for each service. That is why I got rid of pay tv in the first place. Even NBC was charging. No thanks, will keep using my antenna.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Great product Easy to use", "verified": true, "helpfulness": "0/0", "author": "daniel tran"}, {"rating": 3.0, "review": "Has very restricted use. If you have a smart tv, this might not be used ever.", "verified": true, "helpfulness": "0/0", "author": "Informed Opinions"}, {"rating": 5.0, "review": "Great little product at just $30. Considering you can stream anything on chrome to your TV, it is absolutely worth the money. Setting up the TV and laptop/phone with chromecast is super easy. I use a 25Mbps connection. Considering the fact that your laptop sends the content to the chromecast, which sends it  to the router and is then routed to the TV, I haven't had any issues with bandwidth clogging while me and my roommate are using the Internet for other purposes.Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "dhazra"}, {"rating": 5.0, "review": "Works Great and very easy to set for a Novice like myself. Love it! On time delivery also!. Would definitly do business with these guys again!", "verified": true, "helpfulness": "0/0", "author": "Archana Patel"}]