[{"rating": 2.0, "review": "It was good in concept, but I ultimately ended up never being able to get it to work consistently. This needs more support for apps and services. It always dropped off my WiFi for no reason, as well.", "verified": true, "helpfulness": "0/0", "author": "Robert G Vella"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Reid Krausen"}, {"rating": 5.0, "review": "I love this. I used to watch Hulu and Google Play TV on my computer, but wanted to be able to use my TV for the bigger screen. It only takes a couple minutes to set up, and the picture quality is perfect, it's just like watching regular tv.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 1.0, "review": "Definitely not was what I was looking for. Not user friendly and frustrating to set up!", "verified": true, "helpfulness": "0/1", "author": "Maddi Rudloff"}, {"rating": 5.0, "review": "Best $35 you will ever spend.", "verified": true, "helpfulness": "0/0", "author": "portugusto"}, {"rating": 4.0, "review": "Only works with very popular paid apps like youtube, hulu, netflix. I thought I would be able to stream from movies that were already on my computer but I was wrong.  Other than that issue I really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Yuliya"}, {"rating": 5.0, "review": "Love my Chromecast! I have a few issues with it, but they are software issues, not quality. It works great, I just wish they would update some of the ways it works. For example, when watching Netflix, the next show does not auto play. It's kind of a pain to grab your phone every episode to change it, if you have a lock on your phone disable it before you start watching a TV show. Save your self some time.", "verified": true, "helpfulness": "0/0", "author": "shopshopshop"}, {"rating": 5.0, "review": "Good product and speedy delivery.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Pat Norris"}, {"rating": 4.0, "review": "Easy to install works well - not great picture quality but usually the streaming is from low quality vids.", "verified": true, "helpfulness": "0/0", "author": "Paul F Dessureau"}, {"rating": 5.0, "review": "Aside from not being able to play and provide a WiFi connection with the same phone, it is an excellent device.  Keeps getting better and better everyday as new apps provide compatibility.", "verified": true, "helpfulness": "0/0", "author": "Timbo"}]