[{"rating": 5.0, "review": "Works great, easy setup. Easy navigation and control with a smart device such as phone or tablet. NO lag or stutter.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like this device. I use it almost daily to watch Netflix and U Tube on my television instead of my tablet or cellphone. It is easy to install and a snap to connect from tablet to television.", "verified": true, "helpfulness": "0/0", "author": "Edmund F. Spencer"}, {"rating": 1.0, "review": "so slow, full screen mode is far from good.streaming from device is super slow.", "verified": true, "helpfulness": "0/0", "author": "Eran Cohen"}, {"rating": 4.0, "review": "Far exceeded my exectations!.", "verified": true, "helpfulness": "0/0", "author": "Jorge A. Escala Diaz"}, {"rating": 4.0, "review": "Works well, easy to install.  Just remember it only projects wireless images that come through Google.  Computer content not on Google is not accessable.", "verified": true, "helpfulness": "0/0", "author": "M. Newton"}, {"rating": 5.0, "review": "I got this for my parents shortly after convincing them to try a Google Music account; it's a third of the price of Apple TV and for their purposes, it's doing 100% of the things they were doing with their Apple TV.", "verified": false, "helpfulness": "0/0", "author": "J Hunt"}, {"rating": 5.0, "review": "Great product, low cost.", "verified": true, "helpfulness": "0/0", "author": "LUIS ALEJANDRO DIAZ"}, {"rating": 5.0, "review": "Where have you been all my life.  Easy to setup and use with a Chrome browser.  But I purchased for using with my Android phone and it works better than I hoped. I can use my phone and this device to be my portable DVR video player anywhere I want to go (that has WiFi).", "verified": true, "helpfulness": "0/0", "author": "PilotSteven"}, {"rating": 2.0, "review": "Unfortunately could not get it to work properly.", "verified": true, "helpfulness": "0/0", "author": "Fadooz"}, {"rating": 5.0, "review": "It's everything I expected. I have 2 of them. To be able to take this little piece of hardware and attach it to a tv and end up with a smart tv versus buying a smart tv.....what a great idea and it saved me a lot of money, that's why I purchased 2.", "verified": true, "helpfulness": "0/0", "author": "LK"}]