[{"rating": 5.0, "review": "Connects our TV to the internet and we can watch Netflix, YouTube and more directly on our home TV. All in all works great.", "verified": true, "helpfulness": "0/0", "author": "C. Hirsch"}, {"rating": 4.0, "review": "Should be a good device to have.  Bought when it first came out, and have tried a couple of times to set up to use.  Complicated, and still don'te have it right.  Sort of waiting for Google to get their act together with licensing agreements for programming.", "verified": true, "helpfulness": "0/0", "author": "tada"}, {"rating": 2.0, "review": "They promote you can watch your ipod on your tv using chromecast. I looked forward to my purchase. Nothing has worked out for me. First the tv doesn't recognize the chromecast. I troubleshoot and find out google recommends I update my tv. My tv is only 3 years old. I would have to use a flashdrive and download from my tv manufacturer's website the update. My husband and I didn't want to risk messing up our tv and need to call a repairman because the update would be un-reversible. I then tried to use it with a media projector at work with a chromebook (similar to a laptop) and the set up chromecast screen is chopped off. I actually tried it at my job thinking they could use the device. But the technician couldn't get it to work either. Then a can of pop spilled on the chromecast box and I gave up trying to use the device. I would only buy this device if you can easily return it if it doesn't work out.", "verified": true, "helpfulness": "1/2", "author": "Sylvia Bergeson \"bergesonsy\""}, {"rating": 5.0, "review": "We ordered this hooked it up with no problem we sync our tablets and it works fine we have to play with it to see what we really have", "verified": true, "helpfulness": "0/0", "author": "gege"}, {"rating": 4.0, "review": "Is light, easy to use and set up, the only one problem is that need more compatible apps and the feature of receive files from your laptop", "verified": true, "helpfulness": "0/0", "author": "Jose Vivies"}, {"rating": 5.0, "review": "I love having my Chromecast. I used to use an hdmi chord, however I got a tablet without an hdmi port, so I got a Chromecast and it's even better! I can keep my tablet in my lap instead of leaving it near the TV. I can cast one webpage onto the TV and still have the ability to go on another webpage or work on homework. The Chromecast is great and I would definitely recommend using this instead of an Hdmi chord.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "While there are a few drawbacks, it is very easy to look past them when one considers the price of this device.Pros:-Easy to setup, move around, and even take to other locations-No external power necessary if your TV has a USB port-Numerous awesome apps already support this device (Netflix, Plex, Pandora, etc..), and more and more apps are adopting support for it.-Apps stream content directly to the chromecast, the \"remote\" that started the stream is not needed to continue the stream. Example: One can start a Netflix stream on your phone, and turn the phone off, and Netflix will continue to play. This is a big benefit (over the Apple TV) because it does not stream through one's phone and chew through the phone's battery life.I don't know if these should be considered cons, or a wish list of features, but here is what I would change:-Add a dedicated audio output to this device. It would be nice to be able to stream Pandora to this device and not need to have my TV on to do so. This isn't an issue for those who have an AV receiver with HDMI, but I do not.-Support multiple wireless networks. I took this device to a relatives house, set it up there, and when I returned home I had to reconfigure it on my network. It would make traveling with this device easier if one could bring it back home and have it automatically reconnect to the home network after being on another wifi network.-Wired networking. I am all for technology progressing and improving, and have nothing against wifi, but wired networking would be nice to have. It would make the device bigger, but could easily be done in a size similar to the Apple TV.In summary, I am very happy with this device, especially considering the value one gets for the small investment. I would happily pay more for a device that fulfilled my wish list (as I wouldn't expect it to be the same price), but this device does a great job at what it is designed for and meant to do.", "verified": true, "helpfulness": "0/0", "author": "Cameron Mayor"}, {"rating": 5.0, "review": "Was easy to setup.  Now able to watch movies, youtube videos, etc. from my pc on the tv without having to hook up my pc directly to the tv.  I would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "bkr"}, {"rating": 5.0, "review": "we use Chromecast every day!! i work in remote locations that cable tv just sucks, now i can take all my netflix shows with me, also streaming movies from my computer. We have a projector and it has a usb and a hdmi input now we can stream movies out side for movie night.", "verified": true, "helpfulness": "0/0", "author": "CD"}, {"rating": 4.0, "review": "It works just like I thought it would, I love it!  Now I can watch video's and things from youtube and other internet sites right on the TV.", "verified": true, "helpfulness": "0/0", "author": "L10D12B67"}]