[{"rating": 5.0, "review": "happy with amaxon fire tv", "verified": true, "helpfulness": "0/1", "author": "julia Quintero"}, {"rating": 2.0, "review": "Not enough good free movies. Sitcoms all come with a price at least the ones worth watching do.", "verified": true, "helpfulness": "0/7", "author": "D.J.W."}, {"rating": 2.0, "review": "I was hoping for it to be a true replacement for my media center.  It is lacking in some of the desired functionality, in particular SMB share access.", "verified": true, "helpfulness": "1/5", "author": "Aaron Wright"}, {"rating": 3.0, "review": "I m presently thinking of buying this.....  is Netflix included with this or you have to pay the monthly payment for this as well ?  thanks for any help in advance  I only put five star it wouldn t let me post unless I rated it some how. I rate higher when I get one later", "verified": false, "helpfulness": "1/9", "author": "pattsie gordon"}, {"rating": 3.0, "review": "I bought it to replace my Roku !.  It is faster but  ido not like the menu format as much as the Roku.", "verified": true, "helpfulness": "1/3", "author": "bbuttermark"}, {"rating": 5.0, "review": "There was nothing to watch on tv this summer even though we 250 channel cable.  Decided to try this and so far I live it.", "verified": true, "helpfulness": "0/1", "author": "dds"}, {"rating": 4.0, "review": "Love it. In fact I am buying a 2nd Fire TV. What I love most about the Fire TV is that KODI can be added. Also they have added Gamefly streaming, which has great potential.", "verified": true, "helpfulness": "1/2", "author": "dozia"}, {"rating": 3.0, "review": "I want to buy this as a gift and do not want to have it set to my account. Is there a way to re-set it or have it not tied to my account? Not a review but you don't have an area to ask questions", "verified": false, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A must buy! Extremely pleased!", "verified": true, "helpfulness": "0/2", "author": "Victor Baez"}, {"rating": 1.0, "review": "This is the most stupidest device in modern time. how can you have the most basic of codec support you dont support avi or mkv which are standard and all andorid phones and tablet support them out the box. this only works as a stream box not for playing your own files. to not support avi wmv mkv flv / avc dts is just asinine.", "verified": true, "helpfulness": "2/17", "author": "Nuju A. Castle \"nujusa‚³‚ñ\""}]