[{"rating": 5.0, "review": "I purchased this with an expectation that, with Amazon Prime, I will have countless hours of viewing pleasure. I have been disappointed. The apps are great. The unit is quick to start up. There is no lag. Remote is easy to use. Thanks guys!!", "verified": true, "helpfulness": "0/0", "author": "P. Streiff \"pcspauly\""}, {"rating": 4.0, "review": "Would like a few enhancements like the search within apps to be voice search instead of type search but all in all for the price it sure beats having to pay a cable bill.  No monthly fees so it is a one and done deal.  Should have gotten this a long time ago!", "verified": false, "helpfulness": "0/0", "author": "Linda Jenkins"}, {"rating": 5.0, "review": "very good device", "verified": true, "helpfulness": "0/0", "author": "leslie opoku"}, {"rating": 1.0, "review": "Nothing exceptional.", "verified": true, "helpfulness": "0/4", "author": "NORBERT MARTZ"}, {"rating": 4.0, "review": "Great product. Needs support for more media and hard drives would be great. But overall a great product", "verified": true, "helpfulness": "0/0", "author": "Dwayne S"}, {"rating": 3.0, "review": "Meh,  not blown away but its ok so far.  No HBO Go without extra hassel of sideloading took a star", "verified": true, "helpfulness": "0/0", "author": "Bender Bending R. C."}, {"rating": 5.0, "review": "Love my FireTV. Streams faster than any other device I own. I coulsnt live without it and my Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Amanda Rule"}, {"rating": 3.0, "review": "No 24p playback is a real shame and might even be a deal-breaker for what is essentially a video playback device.Other than that, excellent and very fluid interface, good clicky remote, mediocre developer support (come on, you just bought Twitch, build a proper app for your own streaming device).This is not a device you're going to replace every year (well it shouldn't be) so I hope Amazon keeps at it and improves its software over time.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Loos"}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "tony t"}, {"rating": 1.0, "review": "way over priced,not worth it,the roku is far,far superior!", "verified": true, "helpfulness": "0/2", "author": "elizabeth furlong"}]