[{"rating": 5.0, "review": "It is what it is, a data true lay device it works well", "verified": true, "helpfulness": "0/0", "author": "Acedestroyer"}, {"rating": 4.0, "review": "It's a great gadget except it does not perform all that well. It drops at times and stops regularly. Still I would recommend it and ope that it improves over the time", "verified": true, "helpfulness": "0/0", "author": "James Yekrang \"Jamshid\""}, {"rating": 3.0, "review": "Love the streaming, sad that mirroring isn't available for all Android phones!", "verified": true, "helpfulness": "0/0", "author": "Reader"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Adams"}, {"rating": 1.0, "review": "It's only good for netflix and hulu. A few apps will play a few torrents but not many. For the cost you could buy a DVD player that has netflixs . Google should have designed it to play media torrents from the beginning . I have purchased 2 of these and I wish I didn't .", "verified": true, "helpfulness": "0/1", "author": "Dana"}, {"rating": 5.0, "review": "I tried this out because of the price and to get into the HDMI thing.  I have only watched YouTube and it works great.  Set-up was easy and there are tutorials to help you use all the features.  I'm using it with my IPad and there was not a problem.  Recommended for the reasons I'm using it.  They say that you can't use it with Amazon Prime but I haven't tried that yet.", "verified": true, "helpfulness": "1/1", "author": "Marvin R. Sparks Jr."}, {"rating": 5.0, "review": "Great product - Fast Shipping - Good Price - Easy to set up - We enjoy it very much.", "verified": true, "helpfulness": "0/0", "author": "TMarquez"}, {"rating": 2.0, "review": "Well. This product didn't get to the level of expected quality. It only expands the possibility to display a computer screen on a large tv, but other products can do the job for less money.In summary, it didn't meet my expectations.", "verified": true, "helpfulness": "0/0", "author": "J. Chavez \"tibuix\""}, {"rating": 3.0, "review": "Only missing thing screen mirroring. That's why I return in", "verified": true, "helpfulness": "0/0", "author": "Kenan B."}, {"rating": 4.0, "review": "The chromecast works good if your TV is not a smart TV. Though mines is a smart TV, I use this product to broadcast my Chrome.", "verified": true, "helpfulness": "0/0", "author": "flying_rod"}]