[{"rating": 2.0, "review": "Wait for the next model.  What they don't tell you is that in order to get a smooth viewing, without delays and stoppage, you must play a movie that has the right format for streaming directly from your router to chromecast.  It says that it works better with a dual band router.  However, they fail to tell you that your computer must be dual band ready or that will not work.  I could not find a dual band computer anywhere online so I am wondering that is that anyway?  I think I will stick with my HDMI cables for a little longer.", "verified": true, "helpfulness": "1/1", "author": "L. Lamb"}, {"rating": 5.0, "review": "I got this yesterday and i have been beyond pleased thus far. I've used my chromebook thus far and the set up was flawless. The only issue i'm having is that I need to get an HDMI selector, since I have only one HDMI port in my TV and I have 2 HDMI cables (including the google chromecast) that I need to run. Netflix and youtube streamed without a glitch, however when I attempted to open up my amazon prime instant video, it was skipping on the TV as I streamed it. However I do not believe this is a chromecast problem, but I only have a N150 dual band router and I was trying to use chromecast (which uses wifi) and my chromebook at the same time, which my router doesn't do well. I am getting a new N600 router, so once that's installed i'm sure i won't have any issues with instant video. you really can't beat the price of $35 for online streaming, at least a novice tech geek like me hasn't found.", "verified": true, "helpfulness": "0/0", "author": "foodie88"}, {"rating": 5.0, "review": "works great easy to set up I watch net flix from my cell phone. It has many uses and works great. don't know what I would do with out it.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Definitely worth the $35 impulse buy price especially if you don't mind waiting the couple/few extra days in delivery when you select super saver shipping for free.This was able to resolve the issue I was having watching Netflix in High Def on my HDTV in the living room via the Sony Bluray player I have that can also play Netflix streaming.  But as of some months ago, late at night and on weekends too, I would notice it would not stream in high def and the image looked like garbage on my TV.  If I started to watch a movie early enough I could get it to load in high def but if I did it at just the right time and it got later, then the little bandwidth meter would start to go down and then the movie would constantly buffer.  If I stopped the movie and reloaded it, it would start up again in really low def mode.  Needless to say this was unacceptable.  To make a long story short, research proved that it was not an issue with my cable Internet or the signal strength of my WiFi.  This is \"by design\" of the Sony Neflix based players, they go through some kind of Sony servers that apparently as of late get congested during prime time (at night) and on weekends.This device connects directly to Netflix like a Wii or your computer or smart phone and works great, even supports 5.1 audio on select titles which the builtin app on my Sony Bluray player could not do in Netflix.I also tested out watching an older (circa 2002) movie from Google Movies on it and it looked considerably good considering its age and probably not having been filmed for high def.Also Youtube, while some videos will obviously look like they were filmed by someone's phone camera (probably were), I did find some videos that were obviously filmed with high quality HD equipment and I've never seen Youtube look so good at 1080p!The controls are much easier to use than my Bluray players especially for searching for a specific movie.  Now I no longer need to get on the computer first to find something to watch and add it to my queue just to make selecting it on the player on the TV easier.  Just navigate to it quickly sitting on the couch with my phone, select the Chromecast to watch and hit play!I have yet to try other things like Pandora/Google Music mostly because my current stereo does no support HDMI and it would break my heart to hear my music through the pathetic speakers of my TV.  But if it's anything like the Pandora app on my Bluray player shouldn't be half bad.Only thing I wish it had was an Amazon Instant Video app, maybe that's in the works.Overall very happy with it and enjoy using it at least 3 or more nights out of the week time permitting.", "verified": true, "helpfulness": "0/0", "author": "R. Hall"}, {"rating": 3.0, "review": "Chromecast works very nicely, but was disappointed because it won't stream my musicand photos like an Apple TVIt must work through Google Chrome or something like NetflixOnce they include the ability to stream directly from my phone or computer, it willbe fantastic as the price is great and the ease of using on different TV's is so easy", "verified": true, "helpfulness": "0/0", "author": "Dennis Krug"}, {"rating": 5.0, "review": "Super easy to use!  Fast streaming! The setup experience is a breeze to deal with! TV reinvented! Very good purchase", "verified": true, "helpfulness": "0/0", "author": "Jianhui"}, {"rating": 4.0, "review": "Works great, can't wait till they add more services and expand the list of OS which can work with it.", "verified": true, "helpfulness": "0/0", "author": "A. Abramov"}, {"rating": 4.0, "review": "Sweet. Needs more app support. Hung onve but just unplugged it for a while and then it worked since. Love the you tube 'add to tv queue' feature.", "verified": true, "helpfulness": "0/0", "author": "HappyConsumer \"justanid\""}, {"rating": 5.0, "review": "Chromecast is a great device.But if you have a slow DSL connection Chromecast won't sparkle like its designed to.The setup was easy, it took me less than 10 minutes.Luckily I have a 50 mbps Blast WiFi from Comcast which makes Chromecast fly like an F-16 on the internet.Excellent product but you can't run Chromecast on low octane DSL , invest in a high octane connection people!", "verified": false, "helpfulness": "0/1", "author": "Gd94134"}, {"rating": 2.0, "review": "It has very limited applications and is not easy as it says in the publicity. Does not work and connect thru Wi Fi", "verified": true, "helpfulness": "0/1", "author": "REW"}]