[{"rating": 5.0, "review": "Awesome. I was able to get rid of my satellite TV and Watch what I want, when I want. Good speed, high quality picture, and unbelievable selection. I can watch anything from The Lone Ranger that my parents watched as kids to some of the latest motion pictures. With other apps available like Netflix & Hulu, the selection is almost endless. Wish they would get some of the old monster movies I watched as a kid and it would be PERFECT!! Best purchase I've made in a long time!", "verified": true, "helpfulness": "0/0", "author": "Daniel Willett"}, {"rating": 5.0, "review": "I originally had the ouya as my source of TV streaming but it was pretty slow. After many recommendations I finally grabbed one & I've never looked back. Smooth interface & voice command is perfection. Definitely worth the $100", "verified": true, "helpfulness": "0/0", "author": "Big Greg"}, {"rating": 5.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "I have to say I am quite impressed with Amazon Fire TV. It allows for more options for viewing your favorite shows and movies. At first, I was in love with my Apple TV. But after getting my hands on this, this is all I need. The voice command search feature is on point, too. Love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Just Me"}, {"rating": 4.0, "review": "I didn't think I would use it as much as I have.  The video and sound is very good.  I'm just starting to scratch the surface of the apps.  There is quite a bit of redundancy between this and my xbox, but this is more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Stephen Dale"}, {"rating": 5.0, "review": "Solid, easy to use interface combined with better performance than the Amazon Fire TV Stick. The remote is simple and small. I've had no issues using Netflix, Hulu, Pandora, or Amazon Prime Instant Video. I've used SingTV a bit and had some buffering problems but it is probably an issue with that specific app or service.", "verified": true, "helpfulness": "0/0", "author": "Derreck"}, {"rating": 5.0, "review": "First, it is easy to install and set up. It turns on very quickly and has a very fast response when you select something to view, no waiting for things to load. I mostly view Netflix, Amazon Prime, and Youtube, but I have found many more offerings including games. While using the supplied remote control is very easy and fast, I can't say the same for the iPhone and iPad apps. They could use a bit of improvement as it is a bit awkward using and always go back to using the regular remote. All in all, it is well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Bernard Kafes"}, {"rating": 5.0, "review": "I didn't know what to expect but did know for sure that I was done paying out the azzz for Comcast and something had to give.  Everything seems great!  Picture is great.  Remote is great. Easy quick setup.  So far, so good!  Got Prime and we are now hooked on Downton Abbey.", "verified": true, "helpfulness": "0/0", "author": "Roger Waller \"Pacwest\""}, {"rating": 3.0, "review": "even though we increase our internet speed we still have problems getting Fire TV to connect....without multiple attempts.", "verified": true, "helpfulness": "0/0", "author": "Mary Ann Clark"}, {"rating": 1.0, "review": "I purchased this instead of the competitors specifically for the Parental controls & kid time limits. They are completely useless. You can't block purchases behind a pin without also blocking free downloads. You can't block specific apps & mpaa ratings without going into \"kid\" mode, which also block all free prime content. If there's no content available for the \"kid\" account, what's the point? However, Amazon will happily sell you the same content you already got for free with prime so that you can view it on the \"kid\" account. Also, it requires a password to go into the \"kid\" account but none to be in the parent account. Kids don't have personal passwords, they all share the same parent pin, so you can't give it to them to login to their account, otherwise they'll be able to purchase content. So, when child A says \"can I watch TV?\" you have to go type in your password. When they run out of time & child B wants their turn, you have to type it in again. Or they could just not ask you & then they'd be in the parent account with no limits.If I didn't have kids, this would be the perfect device.As a side complaint, Amazon intentionally hides the prime free content and pushes the pay-per-view content. In fact, even prime free content has additional buttons to \"purchase/rent\", why the heck would I pay for something I already have for free?!? It's obvious Amazon wants to profit from unintentional purchases. However, as long as you have a pin set up to avoid accidental purchases, it's not a big deal.Also, I don't know how often anyone would try to watch an mp4 off a USB flash drive, but I tried it multiple times and it never worked.", "verified": true, "helpfulness": "0/2", "author": "Denise Bass"}]