[{"rating": 5.0, "review": "I love this thing", "verified": true, "helpfulness": "0/0", "author": "segundo pulla"}, {"rating": 5.0, "review": "works well and is very easy to use just make sure you are not logged on to your amazon account when you try to set up the account it will not allow two log  on points super cool to use", "verified": true, "helpfulness": "0/0", "author": "ben klink"}, {"rating": 2.0, "review": "It lasted about 4 months.  It's still under warranty, but I think I'll just replace it with something else.  I thought it would be very easy, with the voice activation, but that part only worked about 4 weeks.  It seems to have lots of different issues.  It especially hates it when I try to use Netflix.  If I do manage to get connected (after putting in my password several times) it only plays for a few minutes before kicking me off.  It doesn't care much for Pandora, either, but it's better than Netflix.", "verified": true, "helpfulness": "0/0", "author": "nikki mc mains"}, {"rating": 5.0, "review": "This thing is awesome! I love it! It's extremely fast too and hasn't crashed once. Video's load really fast (heck of a lot faster than Netflix).", "verified": true, "helpfulness": "1/1", "author": "CHarris"}, {"rating": 4.0, "review": "Bought this on sale for $69. We bought a brand new Sony Blu-ray player last month which we were using to watch amazon, but recently got a larger TV and noticed the quality of the amazon prime shows were not as good as blurays and HD cable on our new TV. We bought this hoping after reading other reviews that the picture would be better. Lucky for us, watching TV shows on this really does work better than using the an external bluray player.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Dr. Guber\""}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Dwight Williams"}, {"rating": 4.0, "review": "I like that Prime members get free TV shows and selected movies.It was pretty easy to hook up the system.  Wife likes that we don't have to see any commercials.", "verified": true, "helpfulness": "0/0", "author": "Alfred Apaka \"Bird Man\""}, {"rating": 3.0, "review": "A lot of the apps are an extra price. I would like it better if I did not have pay so much on all the extra apps", "verified": true, "helpfulness": "0/1", "author": "Ivalentine"}, {"rating": 4.0, "review": "Easy to use. Fast wifi. Able to use with my Plex media server. Only thing I dislike is that it does not have a function to turn off the power immediately and no qwerty keyboard.", "verified": true, "helpfulness": "0/0", "author": "Vega"}, {"rating": 4.0, "review": "Better than cable", "verified": false, "helpfulness": "0/0", "author": "Alisha"}]