[{"rating": 2.0, "review": "This sounds like such a cool gadget - to be able to stream video from my laptop or iPhone to the TV. But I was unable to get it to work with the Comcast router, which has a default setting to isolate access points so they cannot talk to each other. Googling around I discovered that most routers have a setting where you can Disable AP (Access Point) Isolation, but with the Comcast router this setting cannot be changed unless I pay Comcast $150 for a service tech to do it for me.", "verified": true, "helpfulness": "1/1", "author": "F. H. Federlein"}, {"rating": 2.0, "review": "My understanding of this product...plug into TV. Set up on iPad. Display what is on iPad on your tv. So far, it worked for Netflix... If my limited technology ability self would have known how and what this did or did not do. I would not have purchased.", "verified": true, "helpfulness": "1/1", "author": "Bill marchand"}, {"rating": 1.0, "review": "why its only running on google chrome and youtube ??it should be connected right to the system so we can mirror what we working on our laptopsapple tv works well with me for that and i was thinking that google chromecast would do the same with small hardware :(", "verified": true, "helpfulness": "1/3", "author": "Thamer"}, {"rating": 5.0, "review": "A must for all. This product does what I. Have always been looking for, simple way to view computer onto the TV. Simple set up and use makes this a must buy, very cost efficient device.", "verified": true, "helpfulness": "0/0", "author": "Steve Hilliard"}, {"rating": 5.0, "review": "Awesome! If ou want to turn your tv into a smart tv get this. Also if you ever want to share web content (from chrome) in a room with friends this is perfect. Use it in a house with 4 housemates and it has been an amazing buy so far.", "verified": true, "helpfulness": "0/0", "author": "Amadou Crookes"}, {"rating": 2.0, "review": "I bought this device thinking it is going to be able to stream Netflix BY ITSELF. This was going to be a gamechanger and put Roku out of business. But no, all this device does is to allow you to use ANOTHER DEVICE to beam the Netflix audio/video to the Chromecast device that is connected to your TV via the HDMI port. Yes, it is semi-useful as a way to stream Netflix using your laptop or your phone (iPhone, Android) but that means you need something else to be able to stream Netflix (a laptop, iPhone, or Android device). So this Chromecast does NOT replace your Roku box because your Roku box can stream Netflix all by itself without requiring any other device.Furthermore, I was hoping Chromecast would allow me to stream my music from my Samsung Galaxy S4 to the TV. Seems lie it should be able to stream anything from my phone to the TV, right? NOPE, it doesn't do that either. It only works with Google Music AND you must store all your music in the Google cloud for you to stream it.  Apparently Chromecast cannot just stream the media files stored on your phone to your TV. BUMMER!I am sorely disappointed in this device. I was going to buy one for every single TV in the house, thinking I can make them all Netflix-capable. NOT!If you have any Netflix device already such as Roku box, an Internet-enabled TV, a Blue-ray player with Internet capability, or any other Netflix device, then you would not need to use this. I can't see myself using my Samsung S4 to stream Netflix from my phone to the TV. That would mean that my phone has to be doing the streaming itself the entire length of the movie, sucking up valuable battery from the phone. I guess if you have no Netflix device at home and you do not have a laptop with the Intel Wireless Display capability, then this Chromecast would be useful for you. But watch out for that battery drain if you use your phone to stream Netflix to the TV.Even if you use your laptop, you cannot stream music from your laptop to the Chromecast. The only thing you can stream to Chromecast is something that can be displayed in Google Chrome. HA! So much for my wanting to stream my audio/video files on the laptop to the Chromecast.By comparison, if you have the Intel Wireless Display capability on your laptop (it's easy to get it even if your laptop currently doesn't have it--just buy a new replacement half-height Wifi card for your laptop like the Intel Network 6235AN.HMWWB Centrino WiFi Card Advanced-N 6235 Dual Band Bluetooth Retail), you can buy something like the Netgear PUSH2TV HD PTV2000 1080P Adapter for Wireless Display and it would allow you to stream ANYTHING from your laptop wirelessly to your TV. If I have to use my laptop to stream Netflix, then I'd rather spend another $10 box to get the Netgear device so I can stream ALL my media to my TV. This Chromecast cannot compete with the Netgear in that department.Google, if you are reading this, take notes. Put some software and a user-interface on the Chromecast so that it CAN go online by itself and stream Netflix, Hulu, etc., BY ITSELF. It doesn't take much to have a basic user-interface.  The device is already on Wifi so there's no reason it can't go surf the Web on its own. And please allow us to be able to stream whatever audio/video streams from our device to the Chromecast. Do that and you will have a real useful product.Until Chromecast can fetch its own Netflix, this device has very limited usefulness for me.", "verified": true, "helpfulness": "2/4", "author": "M. NGUYEN \"tipscentral\""}, {"rating": 2.0, "review": "3 weeks now...email support has suggested fixes...none have helped...found others online...still not able to cast...router = Netgear AC1450: configured to broadcast SSID, AP mode enabled, Chromecast does show up as an attached deviceTV screen = \"ready to cast\"Chromecast app on HP Pavilion dm1 indicates \"connected\"have power cycled computer, chromecast, tv...many times...oh well, $35 for a useless plastic dongleUpdate: changed from 1 star to 2...because I discovered I can cast from a different computer on the same network that is in a different room. So far, the only difference between the two computers that I have identified is the one that can cast has only one version of the Chrome browser installed whereas the laptop from which I cannot cast has two -- the same version of Chrome as the other computer PLUS Chrome Canary which Google tech suggested I try.So, not completely useless but not what I need/want.", "verified": false, "helpfulness": "0/0", "author": "James Lee \"KanakaMaui\""}, {"rating": 5.0, "review": "Pros: Netflix, youtube, plays from my smartphone, simple setup, smaller than my bluray player (that is currently used for netflix only)Cons: no Spotify and only google play support.", "verified": true, "helpfulness": "0/0", "author": "Christopher D Anderson"}, {"rating": 5.0, "review": "Amazing little gadget. As of now you can only stream netflix and other online streaming sights. Can't wait till they let you stream local media from my movie library on my PC to the TV in the other room.", "verified": true, "helpfulness": "0/0", "author": "Jaime"}, {"rating": 5.0, "review": "Best device ever! I basically have one attached to every single TV in the house now. It's great for watching YouTube, and I can play/pause from either from phone or computer. It's also great for showing presentations as I can cast my tabs right from Chrome from my macbook pro. I have a retina macbook pro and it works great.", "verified": true, "helpfulness": "0/0", "author": "Justin Lin"}]