[{"rating": 5.0, "review": "Didn't expect to like the Fire TV this much. I also have Google Chromecast and Fire TV is so much better. Easier to connect and use, and the remote beats the pants off the cell-phone-app-as-remote. Speech recognition is very impressive.", "verified": true, "helpfulness": "0/0", "author": "Inside Man"}, {"rating": 2.0, "review": "First I think the free content may be over stated or at least as others have said there is no way to search free content only.  A lot of old TV series are not free and in my opinion over priced.There is also a quality issue.  Apparently it uses a really poor quality video processor.  I'm using it with Plex Media server and the quality is degraded relative to the original DVD or Bluray.  This isn't a problem with the .mkv files, it's a problem with the video processor in the Fire TV.  My LG TV does not support Plex but it does recognize the PC as a media source and can play the files directly outside of Plex.  Played in this way the video quality is the same as the original DVD or Bluray.  Also if played directly on the PC and sent to the LG TV via HDMI the video quality is fine.  It's only through the Amazon Fire TV that the quality is degraded.  I would compare it to first or second generation DVD, for those that remember how bad the video quality was on DVD when it first came out.  Remember all the digital artifacts all over the screen... that's what this device looks like playing .mkv files.  Probably not as bad as first generation DVD players probably more like second generation, no where near the quality of modern up scaling DVD players.It does have some nice features.  While you cannot search specifically for free content the search capability it has is pretty neat.  Voice commands!  Just press the mic button and say the name of the show you are looking for.  It converts your words to text so you can confirm it understood correctly and then hit enter to search.  It very seldom ask you to repeat so it's pretty good at recognizing what you are saying.While the majority of the useful content is not free, there is some decent programming that is free.  I'm not sure it's really worth it however, I think I'm still within the return window so I should probably send it back but for what it cost it's really not worth the effort.  It will continue to come in handy on occasion for the little free content it offers. I just wish the video quality was better.mk", "verified": true, "helpfulness": "2/3", "author": "Monte F. Kay \"mthemaniac\""}, {"rating": 1.0, "review": "Would not purchase this item again. I bought it because it was wireless and hd. The hd quality will not be supported on wireless connectivity.  I contrasted amazon tech spey a numismatic of times regarding the issues.  First they tried to blame my Internet provider. Contacted my provider and the stayed my spec ate fully capable of supporting hd streaming,some more back and forth ensue, finally amazon suggested that I purchase a wire connection to hook up to my modem just what I want an 80 ft wire going through my bedroom hallway and down to my living room. Not very attractive and a safety trip fall issue and inconvenience of have to roll this out whenever you want use of the service. I would get my money back if I could. Carefully research your options.", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Got a refurb one from Amazon, it is working great so far. I side-loaded Kodi+Llama and finally can use streaming services including amazon prime and play my local content from a single device (it replaced 2 devices - my dedicated xbmcbuntu box and roku 2).Update: downgraded to 2 stars. Between device locking up every day (work day, no one is using it) and amazon declaring idiotic war on kodi, I may need to go back to 2 devices.", "verified": true, "helpfulness": "0/0", "author": "Vadim"}, {"rating": 4.0, "review": "As advertised Great Product. Happy...", "verified": true, "helpfulness": "0/0", "author": "no1amigo \"no1amigo\""}, {"rating": 5.0, "review": "Just add Kodi or xbmc and it is amazing", "verified": true, "helpfulness": "0/0", "author": "Christopher Blackburn"}, {"rating": 5.0, "review": "The voice search option is a very slick addition, and so far playback has been great! No tearing, and only once has it buffered during a rapid moving action scene. I wish the sleep option was easier to get to, or had an actual hardware button on the remote for it, as well as I wish it had local file support through the usb port, but those are my only complaints. For as little power as this draws, and the ever increasing supply of on demand and streaming services, I'm not too worried about it.", "verified": true, "helpfulness": "0/0", "author": "Daniel S \"Dan the man\""}, {"rating": 5.0, "review": "Great device, easy to use", "verified": true, "helpfulness": "0/0", "author": "George A."}, {"rating": 5.0, "review": "I received certified and refurbished Amazon Fire TV in a timely manner and well wrapped. It's worked satisfactorily so far in my use of it and I expect it to continue.", "verified": true, "helpfulness": "0/0", "author": "Jon Brewbaker"}, {"rating": 5.0, "review": "Absolutely love it", "verified": true, "helpfulness": "0/0", "author": "Wingnut"}]