[{"rating": 1.0, "review": "never got it to work. Finally figured out that you need a special router (mine is a 2 year old N rated Linksys) Certainly not \"plugnplay\"", "verified": true, "helpfulness": "0/0", "author": "Richard B., Mattis \"richardbrentm\""}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Michael Dickenson"}, {"rating": 5.0, "review": "Works as expected. I may have to get another one as the kids keep stealing mine lol. Fast shipping. Thanks.", "verified": true, "helpfulness": "0/0", "author": "flgardengirl"}, {"rating": 5.0, "review": "excelent product", "verified": true, "helpfulness": "0/0", "author": "carlos toro"}, {"rating": 1.0, "review": "Good idea in theory, but you will have to get a new router. Returning mine.", "verified": true, "helpfulness": "0/0", "author": "Kirsten Steinberg"}, {"rating": 1.0, "review": "Too difficult. I should have bought a Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "JOSHUA SANTIAGO"}, {"rating": 5.0, "review": "How practical this is you can see anything in your tablet on a big screen. Good invent!!! A+", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Changed my life. We have two of these in my house. We have a blue ray player with apps, a roku, a PS3, and a TV with apps.... we only use the chromecasts. The functionality is easier to use and the quality is fantastic. For some apps, like PLEX, it works amazingly (much better than apple TV, the resolution on the apple TV is horrible with PLEX, believe me I tried it side by side on the same TV)The watch ESPN app is awesome on Chromecast. I also love the games available on Google Play. (Draw it up is a personal favorite, it is a multi-player pictionary game, which can be played by using one device (for drawing the pictures that then appear on the screen, or many devices, so everyone can use their own)", "verified": true, "helpfulness": "0/0", "author": "Ryan R."}, {"rating": 5.0, "review": "I have quite enjoyed my Chromecast since purchasing it.  While it has its limitations on what you can stream, it does stream what is compatible extremely well.  I love to take this with me when traveling to stream Netflix over the TV in my hotel rooms. I found the set up extremely easy and I have had no trouble streaming using my computer, iPad and iPhone.  I would recommend a fast internet connection when using this product.  I've had no trouble using my FIOS, but have had some buffering issues when using WIFI has some hotels where the strength and speed was spotty.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"da_blade20\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "C. C Chin \"carey chin ccie not sure as I git older:)\""}]