[{"rating": 5.0, "review": "My second chromecast. Perfectly casts HD videos from netflix, youtube etc. Netflix bingers everywhere,rejoice!", "verified": true, "helpfulness": "0/0", "author": "ShopStop"}, {"rating": 3.0, "review": "It does not work with my server.", "verified": true, "helpfulness": "0/0", "author": "Ursula fuller"}, {"rating": 1.0, "review": "I'm very annoyed. Not until I tried to set it up did I learn that it is to be within 10-15 feet of the router. None of my TVs is that close to my router.  Why do they hide that very important piece of info until AFTER purchase?", "verified": true, "helpfulness": "1/1", "author": "Jennifer Cole"}, {"rating": 5.0, "review": "Good price. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "NJ-Fan \"NJ-Fan\""}, {"rating": 5.0, "review": "i can watch everything and surf the internet. easy interface with any smart phone", "verified": true, "helpfulness": "0/0", "author": "jo king"}, {"rating": 5.0, "review": "Awesome product can't beat price", "verified": true, "helpfulness": "0/0", "author": "102bubbles"}, {"rating": 5.0, "review": "It worked quickly and in less than 10 mins we were casting Youtube and other fun apps/casts on the big tv.. I do recommend it.", "verified": true, "helpfulness": "0/0", "author": "Nicky719"}, {"rating": 5.0, "review": "Chromecast is awesome for Netflix junkies!", "verified": true, "helpfulness": "1/1", "author": "James Jackson"}, {"rating": 4.0, "review": "Very easy to setup and use. Though, I wished Google would get on the ball and fix some of the bugs. Casting from PC to this just isn't worth it. The video quality is horrible. Also, I don't like that the only way to cast to the Chormecast is via WiFi. I can't cast from a PC that's on CAT5. If casting from an Android devise, it works perfectly. I took one star because of the bug, and WiFi limitation isn't that big of a deal to me. Maybe all of this will be fixed through a patch or something.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Gift for my boyfriend and after learning how to work it, a definite plus to the television experience.", "verified": true, "helpfulness": "0/0", "author": "Danielle A"}]