[{"rating": 3.0, "review": "I would like it a whole lot better if you all would partner with VUDU.", "verified": true, "helpfulness": "1/2", "author": "William P. Guzewicz \"William P. Guzewicz Sgt. USMC Ret.\""}, {"rating": 4.0, "review": "great device...", "verified": true, "helpfulness": "0/0", "author": "Bridget Reiss"}, {"rating": 5.0, "review": "Fantastic all the way!", "verified": true, "helpfulness": "0/0", "author": "shaun davis"}, {"rating": 2.0, "review": "no appreciable difference between it and the fire stick...", "verified": true, "helpfulness": "0/1", "author": "TRUTH"}, {"rating": 5.0, "review": "My experience with the Fire TV has been great. I have had several other streaming devices and this is by far the best and most unified system I have used to date.", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 4.0, "review": "I'm loving the Amazon Fire TV.  I do have some issues with it but I think it has to do something involving my surround sound system or my internet.  Every now and then it will get a little glitchy and I would have to restart it and that usually gets it working properly again.  If I didn't have to do that then I would give it 5 stars.  I did exchange mine already thinking it was the unit causing that glitch, but it wasn't.  My Bose system remote control can not recognize the Fire TV either so I can't sync it up to that remote.  Other than that I love it.", "verified": true, "helpfulness": "0/0", "author": "Alan Villanueva"}, {"rating": 5.0, "review": "I love it its easy to use and the selection of apps is great just wish I could check my email then id be set. Worth it all the way!!", "verified": true, "helpfulness": "0/0", "author": "DanGalin"}, {"rating": 5.0, "review": "I really like my Amazon Firestick. It preformed as stated. All I did was plug in my pass code and off we went no prolems!", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Smith \"JSmith\""}, {"rating": 5.0, "review": "LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Jane R."}, {"rating": 4.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Jose Oliveras"}]