[{"rating": 5.0, "review": "Chromecast is the best thing that has happened to my life. Now, i don't have to get up to change whats on my tv, i just click from my phone or laptop. Also, i can still use my devices while it streams. Could life be better?", "verified": true, "helpfulness": "0/0", "author": "Sabrina"}, {"rating": 5.0, "review": "Adds so much too your tv, Highly recommend to anyone without a smart TV.", "verified": true, "helpfulness": "0/0", "author": "K-Dawg Awesome Pants"}, {"rating": 5.0, "review": "LOVE IT!!!  I can stream Netflix, Pandora, YouTube, HBO-GO, StarzGo, music from my iPhone! its great. Awesome product!", "verified": true, "helpfulness": "0/0", "author": "K-VA"}, {"rating": 4.0, "review": "Works good. Wish it could do more", "verified": true, "helpfulness": "0/0", "author": "Anthony Zottoli"}, {"rating": 1.0, "review": "It does not work pretty well. the casting with my tv keeps getting drop, to the point I end up back using my HDMI cables that are more reliable.  What a piece of crap, not customer support, no way to get help from chromecast", "verified": true, "helpfulness": "0/0", "author": "Mauricio Castillo"}, {"rating": 2.0, "review": "Chromecast requires an Internet connection even if you only want to mirror your computer or phone screen.  It will connect fine if you have an Internet connection, but drops you if the Internet is cut off.  Wifi is not enough.", "verified": false, "helpfulness": "2/2", "author": "Philip Riersgard"}, {"rating": 5.0, "review": "Video and audio is much improved on TV compared to the Laptop Monitor", "verified": true, "helpfulness": "1/1", "author": "Manfred F. Stiller \"Manfred\""}, {"rating": 5.0, "review": "great for streaming, not great for playing media you already have on file", "verified": true, "helpfulness": "1/1", "author": "matt pope"}, {"rating": 5.0, "review": "It is awesome.  Easy to use , i would recommend it.", "verified": true, "helpfulness": "0/0", "author": "linda bauer"}, {"rating": 5.0, "review": "The best of the best!!! my best investment!", "verified": true, "helpfulness": "0/1", "author": "Emmanuel Casilla \"ESpS\""}]