[{"rating": 2.0, "review": "I really didn't read the description well on this product.  I assumed that it essentially displayed everything from an ipad or iphone onto the tv.  I thought I could watch my videos, look at photos and movies etc if I wanted. BUT, Chromecast ONLY works as an app on the i device that pushes either Netflix or youtube to the TV through wifi or Bluetooth. For me essentially useless.  Maybe some day they will unlock other abilities but for now I can use my PS3 or 4 to do the same thing as this...for free", "verified": true, "helpfulness": "0/1", "author": "TJ"}, {"rating": 5.0, "review": "this thing is crazeamaze.. pretty much its plug and play.. had it running in about 5 mins. what  more can you ask?", "verified": true, "helpfulness": "0/0", "author": "Robert A. Ramirez"}, {"rating": 1.0, "review": "Tried on 3 new Samsung tv's. Didn't work. Throwing out. Won't pay return postage . sorry I succomed to hype", "verified": true, "helpfulness": "3/12", "author": "elsie"}, {"rating": 5.0, "review": "I plugged it in, and followed the directions, and intended to use it with my Samsung Galaxy Tab. So now I have to download an app, and configure it to work with the Chromecast. This in and of itself is not the issue. The issue is that I was under the impression that anything I can view on my tablet can be cast onto the TV. Well that's not exactly true, and it isn't then I don't need this. I sent it back from whenst it came.", "verified": true, "helpfulness": "0/2", "author": "Elliot's Review"}, {"rating": 5.0, "review": "I bought a Chromecast at release, as was disappointed for months as we waited for support that extended past Netflix. At the time of this writing, it now supports all our favorite streaming services: Pandora, HBO Go, Hulu, Netflix. The only one we're waiting for still is Amazon Prime (if it ever will come). For $30-35, this device is incredible. We have one that we use on an old flatscreen monitor as a bedroom TV. We have another one in the living room for our main TV. Since we both have android phones and a tablet, we use those to control it with absolute ease.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "For all of the devices in 2013, I think that this one has been my favorite. I was one of the early adopters, i.e. I bought it on announcement day. I was extremely impressed from day one. Even initially, setup was easy (now, with the Chromecast app updated, it's cake) and the supported app library is increasing rapidly. This was how my fiancee and I watched Netflix, how I watched YouTube videos, and how we play music for company over to our apartment. I am often asked about it, and I refer many people to it.And let's not forget that price. $35? I couldn't resist at that price, and I would not count it as a loss if I had disliked the Chromecast.All in all, I highly recommend it. The app does the set up for you, so it's very simple. And all you do is press the Cast icon (a rectangle with an angled WiFi signal in the bottom left corner) in a supported app (which are quite a few now), and you're watching the video on your TV.As for those complaining about not streaming from your Android gallery: this is a Google product, and closed right now, so they can do what they want. Do not rate the PRODUCT poorly, despite you saying that you liked it until Google blocked Gallery streaming. They will be releasing the SDK soon, so experienced dev's can go away at it. It's stupid to rate a product as 1-star that you said was good until the parent company did something that you didn't like. It's Google's product, Google's ecosystem, and Google's choice when to release the SDK.", "verified": false, "helpfulness": "0/2", "author": "J. Palmer"}, {"rating": 1.0, "review": "To all apple users. This is not for you! You also want a feature like screen sharing, video streaming, photo streaming, music streaming and more? There are this devices on amazon go and check them out -> http://amzn.to/JvppOpThe best one of them i can recommend is this one -> http://amzn.to/1b8cAzp", "verified": false, "helpfulness": "1/5", "author": "Mr. K"}, {"rating": 5.0, "review": "Item does what it said it would do. It did take a few times for it to update the software but works great. Hope either more apps are added to use this functionality or make it so the desktop of a computer can cast to it.", "verified": true, "helpfulness": "0/0", "author": "Matt Rearick"}, {"rating": 5.0, "review": "The chromecast was very easy to setup and I have not had any trouble using it to streaming movies. The picture quality is fantastic. Currently it has plugins for a lot of the major video apps but can't wait to see more. Well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Andrew Schickram"}, {"rating": 1.0, "review": "The device installed but the cast apps will not load on my new windows tablet. Will not work as advertised. What a waste of time.", "verified": true, "helpfulness": "2/5", "author": "Steve M."}]