[{"rating": 5.0, "review": "Adds inet to TV -  limited to utube with iPad, but pc/ laptop works for everything with chrome browserGreat", "verified": true, "helpfulness": "0/0", "author": "Craft"}, {"rating": 5.0, "review": "Works great!  Does everything it says it will.  I Think this product is a sign of things to come.  Needs more apps that are compatible.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 1.0, "review": "Any smart DVD player is better. I thought it would mirror. Why did Google make such a lame device. They are such technology driven company... this thing is stone age.", "verified": true, "helpfulness": "0/0", "author": "Kerry Belanger"}, {"rating": 5.0, "review": "This little item is an inexpensive and perfect answer for those (without an XBox of Play Station) who wish to stream video from Netflix and/or YouTube from your portable device to your TV. Great quality audio and video. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Erik"}, {"rating": 2.0, "review": "They still have some issues to work out.  Several Netflix programs stopped after about 30 minutes and would not restart.", "verified": true, "helpfulness": "0/0", "author": "DWK"}, {"rating": 4.0, "review": "It works well, although I wish that there were more content streams available. I expect that time will cure that problem.", "verified": true, "helpfulness": "1/1", "author": "Bark Twain \"stonesculptor\""}, {"rating": 5.0, "review": "Chromecast is a great streaming media device & integrates with choice Google applications seamlessly. At $35, the value for the services received is unmatched.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 2.0, "review": "I had wanted to be able to \"cast\" webpages from my tablet, but that is no longer an option.  I have a Roku which does everything else the chromecast does.  I don't need another device duplicating what I already have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works perfectly.  I bought this so that I can stream youtube since my Roku doesn't have that capability.  Just plug it in and start using it.  I also have a PS3 that you can use to watch youtube, but using the PS3 remote to type in a youtube search is tedious.  Using the chromecast with a tablet is very easy!", "verified": true, "helpfulness": "0/0", "author": "Joseph Whitney"}, {"rating": 4.0, "review": "The Chromecast works the way it is intended to. However, after a using the Chromecast for over two month it still does not have a lot of apps that one can use. I have only seen Netflix, YouTube, and Pandora. If you download the Apple app for Chromecast the only two channels that can be used are Netflix and YouTube. With all this said, the Chromecast is a great product for the money. The cliche quote definitely applies here, \"You get what you pay for\". I have faith that Google will provide more content in the future. If anything changes, I will add to my review.The dongle itself must be connected to a power supply either on your t.v. set or to the wall. This extends the size of the dongle. In addition, if the dongle does not fit into your T.V.'s HDMI port you will have to connect the extender, provided in the box.", "verified": true, "helpfulness": "0/0", "author": "J. Molina"}]