[{"rating": 1.0, "review": "i have no idea how to use this thing. and i can get no reply from the compny", "verified": true, "helpfulness": "0/0", "author": "Margaret Gilchrist"}, {"rating": 4.0, "review": "Would be 5 stars if capable of assigning it a static ip", "verified": true, "helpfulness": "0/0", "author": "DirttMcgert \"Darryl\""}, {"rating": 5.0, "review": "Works great and was delivered right on time", "verified": true, "helpfulness": "0/0", "author": "William Carroll"}, {"rating": 5.0, "review": "Fantastic device works very good", "verified": true, "helpfulness": "0/0", "author": "DelBo"}, {"rating": 5.0, "review": "Exactly what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Gary Walley"}, {"rating": 1.0, "review": "First off I want to point out that I've been using streaming devices for a long time and own a Roku as well as an Apple tv. I got this for a spare room where we rarely watched t.v. and I wanted to see how it compares with the other systems. Well it's bad.The only good things:it's cheapit lets you stay in the google ecosphere if that's important to you, and it does do a half way decent job casting shows once you get use to it.the cons.NO NATIVE WAY to cast shows from amazon prime. i hear about various tweaks to get it working but it requires finicking on the computer and mirroring it on the chromecast. this is way more complicated than just selecting it with my roku remote. In terms of netflix, trying to cast a show and changing the options like subtitles and such takes getting use to and fast forwarding and rewinding are not that easy without a remote.I mainly use my streaming for netflix and amazon prime, rarely i would try one of the other channels but I need it to work well with these two features and the rest is gravy.chromecast does so - so with netflix and nothing with amazon prime.in other words it's a dud. chromecast connects to a ton of channels like roku. but most of the channels are still in their infancy and nobody spends any real time on them. I think google should chuck this and create a product with a remote, like roku, that consumers actually want to use. being the low price leader only works if your product is close to the competition. this one unfortunately gives you very little bang for your buck.go buy a roku stick", "verified": false, "helpfulness": "0/0", "author": "ConcupusAl"}, {"rating": 4.0, "review": "very good and simple", "verified": true, "helpfulness": "0/0", "author": "shadi barhoom"}, {"rating": 5.0, "review": "we use this all the time, price was great", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Cordero slash"}, {"rating": 5.0, "review": "what else can you say except for that chromecasts are awesome for anyone wanting to display content on a TV", "verified": true, "helpfulness": "0/0", "author": "Daryl \"Prime Addict\""}]