[{"rating": 5.0, "review": "Love my fire tv", "verified": true, "helpfulness": "0/0", "author": "joe jr"}, {"rating": 3.0, "review": "I have 2 apple tv's, 2 chromecast sticks, and now 2 fire tv's.  I like to try this technology out.I'll first say that the fireTv is zippy fast, works great streaming my itunes with the firetv app I bought.  I have netflix and amazon prime, and use them both with firetv.  And I love the radio frequency remote.However, and it's a big however, the interface is a jumbled mess.  Even their implementation of common apps, like hbo go, Netflix, youtube, are not at all intuitive.  appleTv is a far superior product in the look and feel department.So in short, I'm fine with using the firetv, but for xmas I got my dad an apple tv.  The firetv is not a good solution for someone just starting out and will no doubt turn someone off trying to get into streaming.Firetv is certainly made for the more technological savvy consumer.  And for that person it'll spank appletv.", "verified": true, "helpfulness": "0/0", "author": "DERON RUBY"}, {"rating": 5.0, "review": "Got this for my girls room works great", "verified": true, "helpfulness": "0/0", "author": "Paul scheer"}, {"rating": 5.0, "review": "This is my second Amazon Fire TV, and I have an Apple TV and a Roku 3.  I'm finding more and more reasons, like the voice commands with the Fire TV, to use the Amazon products more.", "verified": true, "helpfulness": "0/0", "author": "CWTrooper \"Cliff\""}, {"rating": 1.0, "review": "My friend told me about the fire TV and I said I might as well try it. I ordered it and it came quickly. I hooked it up and watched one movie and it went dead. Returned it, still waiting on refund. I think I'll try the fire stick next.", "verified": true, "helpfulness": "4/5", "author": "Michael H."}, {"rating": 1.0, "review": "We've only had this for two months, but it has not performed well at all.  Examples: If you don't use it for a week or two, you have to reenter passwords for Amazon Prime and for Netflix; also the last time, it would not access anything at all, even though all other devices in the house that communicated with our router and modem worked just fine -- tried them in order to see if the problem was our WiFi or the Amazon Fire device -- it was the Fire device!  Unfortunately, we are just beyond the 60-day return window so we are stuck with this useless lemon.", "verified": true, "helpfulness": "4/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have now received both the fire stick and fire box. I actually bought the fire stick first, then I thought to myself this thing is awesome and pretty fast so I wonder what the box is like. So I purchased the Amazon fire TV box. It is what I hoped for runs faster smoother more fluids like transitions. And I really wanted to be able to hardwired Ethernet now I have absolutely no issues with dropped connection. The dropped connection with the wifi on both the box and the stick are probably things that can be resolved through router settings channel or frequency 2.5 megahertz vs 5 megahertz. I have read up on some of it so I have an idea of what to do to fix the problem. Something I did do that was an immediate help I put more distance between wireless router and the fire stick. I'm not sure about the wifi on the box I have not used. But all in all I am happy with the whole fire TV platform. I wonder what they will produce next", "verified": true, "helpfulness": "0/0", "author": "ShirleyC117"}, {"rating": 1.0, "review": "Too much like Roku, no great advantages here.", "verified": true, "helpfulness": "2/4", "author": "Lise Schulze"}, {"rating": 5.0, "review": "This was a week late due to the weather but it was well worth the wait.", "verified": true, "helpfulness": "0/0", "author": "Brian Erwin"}, {"rating": 5.0, "review": "Excellent device, so easy. Price can't be beat for what you get!", "verified": true, "helpfulness": "0/0", "author": "Dreamcatcher"}]