[{"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Marwa A Jad"}, {"rating": 5.0, "review": "I never knew how much content there was until I really dug into all the apps. With the Amazon Prime, I can get HBO and Showtime shows. I can see steaming video as the future of television. We might have to get rid of cable, that's how much we love it.", "verified": true, "helpfulness": "0/0", "author": "Mark Gunderson"}, {"rating": 4.0, "review": "fast and voice control usable for only amazon content.  Also, only one controller works with voice control, my wife's ( a second controller) works with all functions except voice unless I un link the first one.", "verified": true, "helpfulness": "0/0", "author": "Ralph & JoAnn"}, {"rating": 5.0, "review": "A good alternative to network TV.", "verified": true, "helpfulness": "0/0", "author": "Charles V."}, {"rating": 4.0, "review": "Smooth flow, beautiful interface.  Has an Ethernet port which is great for streaming.  Remote is spectacular.  Starts up very nicely.Had one hung/need to reset experience so far.My only compliant: search engine doesn't look over all subscribed content.  It should include Netflix also, perhaps others subscribed to.", "verified": true, "helpfulness": "0/0", "author": "Joseph T. Lipowski"}, {"rating": 5.0, "review": "It's great..", "verified": true, "helpfulness": "0/0", "author": "Elaine Roth \"elroth\""}, {"rating": 5.0, "review": "I think its really pretty.i purchased two mother/daughter heart pendants as well  i took one heart and one key, and put them both onto the chains. Now i wear the daughter heart and daughter key, and my daughter wears the mother key and heart. Signifying that i have the key to her heart and she has the key to my heart !!", "verified": true, "helpfulness": "0/4", "author": "Bea Marr"}, {"rating": 3.0, "review": "While I was excited about getting Amazon Fire I found that it was difficult to find movies and tv shows that met the advertised number of selections.  I couldn't get Netflix to work all it said I already has an account.  I want to be able to get Netflix selections along with Amazon Fire TV.  Also the films I wanted to see you want to charge for and charge too much.", "verified": true, "helpfulness": "0/0", "author": "Thomas Perkins"}, {"rating": 4.0, "review": "Love it! but it does freeze up on occasion and that can be annoying, but would definitely recommend!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"krk\""}, {"rating": 5.0, "review": "I had high expectation for this product and it delivered.  We have owned an Apple TV, Chromecast and Roku 3 and I have had no luck direct playing from my Plex server.  Most of my files are H.264 with AC3 and the Roku 3 will not play the audio and have to use a computer or table with Chromecast can be hit or miss.  I have since started using the Fire TV and it works get with every file.  I also like the speed of the menus and ease of use.  I keep my fingers crossed that they will interconnect the Amazon Echo and Fire TV functions to use voice commands.", "verified": true, "helpfulness": "0/0", "author": "beazle"}]