[{"rating": 1.0, "review": "Don't order! Crappy piece of stink! Im on my second one and it doesn't work. Customer Service has no clue", "verified": true, "helpfulness": "6/24", "author": "M. Keller"}, {"rating": 4.0, "review": "I have had Apple TV for many years. I was thinking of purchasing another Apple TV for a different room in my house, and saw this new release. I decided to give it a try. I only use it for streaming video, we don't use gaming or have use for parental controls so I can't comment . In terms of streaming video, it does just as good of a job as Apple TV, but I didn't think it was better. The voice command is nice, but it really isn't a problem to enter it manually on Apple TV. So between Apple TV and Amazon TV, I'd call it a draw. For me it comes down to, am I going to purchase my media through Amazon or iTunes? I love Amazon as a merchandiser, but sorry, I'm going to stick with iTunes.  I have an indecent amount of money already invested in iTunes and I don't see me starting over.", "verified": true, "helpfulness": "1/2", "author": "J. Aramburu"}, {"rating": 1.0, "review": "Why each time go to the update screen, and then the screen turn to write color and nothing to happen, for a long time, I mean did not update....what happen? should I return it?", "verified": true, "helpfulness": "25/33", "author": "H. Huang"}, {"rating": 2.0, "review": "Sounds like this is a great system, Why no HBO app?  Will consider buying when HBO app is added .", "verified": true, "helpfulness": "3/20", "author": "Kenneth"}, {"rating": 3.0, "review": "My Roku was working fine, and my primary reason for purchasing the box was for the voice search feature.  They made it seem like it would work with other services but that is not the case.  It only searches the Amazon content.  Even if you are logged into Netflix and on the Netflix search screen, it still takes you to Amazon.  This is extremely annoying since the episodes for the show in question are free on Netflix account, but not on prime.  I'm going to try it for a week, but I'm really on the fence with keeping it or not.  I'm a huge Amazon fan, and feel a bit cheated.", "verified": true, "helpfulness": "8/12", "author": "Robert Scholl"}, {"rating": 2.0, "review": "Roku. -- Has everyting this has to meet your needs. MostFire TV. -- The advantages are null for most users.Roku. -- You can stream  from any PC !!! try that with Fire TVRoku. -- Has Spotify.Roku -- Listen to program from earphones on remote.Sorry, Fire TV. Maybe by next year you will catch up to Roku.Apple TV. Wouldn't be interested even for free. Cant be married to Apple since its the \"Apple way, or no way\"", "verified": false, "helpfulness": "7/24", "author": "Angel Lopez \"Animal\""}, {"rating": 5.0, "review": "I'm impressed. So easy to use and the picture quality is great. No lag on movies, no buffering. I can't believe how good this is. All I had to do was connect to my TV via HDMI cable, and select it as a source. It was automatically listed on my sources as Amazon Fire TV. After a software upgrade, it found my wireless network. I entered the network key, and I was on my Amazon account. It knew who I was. Pressed the microphone button, said \"True Grit,\" and it pulled up both movies. Selected one, pressed the start button, and was watching John Wayne. This is a great little piece of hardware. It's all I'll be using for steaming movies and TV shows from now on.", "verified": true, "helpfulness": "2/4", "author": "Jeffrey H. Harwell \"jharwellnorman\""}, {"rating": 1.0, "review": "I have to compare it to the standard in set top boxes, which is currently Roku 3. It is smooth and fast. I find the interface strange and jumbled. Initial setup was fairly easy. In fact maybe too easy, I would like some more customization.Apps are almost the same, as of now it does not have all the garbage Roku has, but in time I am sure it will have 3 million religious programs..Now the game stopper, the WTF, the how could this be moment. No Amazon MP3 player. Are you fricking kidding me?It is YOUR app. It is mind boggling you sent it out without it.1 week in update: Many lockups. Hulu and Netflix stop continually. At times the system seems in lala land. Still no Amazon cloud player for my Amazon purchased music.Pro's: Side loading is kind of neat. Although very hit or miss.I am still withholding a thumbs up or down. It has potential. Yet it is about half of what the gold standard of Roku offers in terms of stability, UX and off the shelf apps.I dropped it to 2 stars because at least it powers on. However doing the stuff it us supposed to do like streaming and general enjoyment is a HUGE FAIL.Have officially went back to Roku 3. Now to dump this on an unsuspecting \"friend\".Auf 10th 2014 update:So being stubborn I kept using this thing. It now has Music. The UI is horrid though. Search is ok but then it throws you back to that horrid UI. Ugh. Please emulate the Roku interface. Yours is really like a fumbling attempt to do something different for the sake of being different.The dropouts and sync issues have subsided a bit. Hulu is still hit or miss with these issues. I believe that even with more memory Amazon is not utilizing a logical buffering method.So I will no longer call it bad, but I can't really up the rating much either. It is a product on the low rung of being adequate. I am being bombarded with ads for the Fire Phone. However, for the first time I am leary of getting another Fire line product. You have scared me away from you main product line Amazon Shame on you.", "verified": true, "helpfulness": "3/4", "author": "David Farris"}, {"rating": 1.0, "review": "I bought the FireTV because it seemed like it would be a great product. However, I quickly learned that they only expect it to be plugged into the newest of TV monitors. fireTV only has an HDMI output. I purchased the Kanex Pro HDRGBRL HDMI to Component with Audio Converter to change the fireTV signal over to Y Pb Pr. I have a 10ish year old Mitsubishi Medallion 1080i TV with two different kinds of Y Pb Pr inputs. A DTV/RGB and a 2 regular HDTV inputs. My Sony blu ray player and my DVR both play in high definition on the TV and they both have HDMI in addition to the Y Pb Pr outputs. The Kanex Pro HDRGBRL HDMI to Component with Audio Converter was able to convert both of those HDMI signals to the Y Pb Pr and the TV could display them. The fireTV on the other hand will not convert and the TV can't display the signal with any of the inputs available. I tried the fireTV with HDMI on a newer TV and it does work. I also tried using the converter with the newer 1080p TV's Y Pb Pr inputs and it worked that way as well.CONCLUSION: The best I can figure from all of this is that fireTV doesn't have a switchable output like the other devices do. It ONLY produces a 1080p feed. I looked for something in the settings (while hooked up to the tiny 1080p tv that worked) that would allow me to force the resolution down to 1080i but nothing exists. You basically only get one setting (auto) you can also do (auto with scaling) but that's it. I hope the programmers at Amazon will read this and get back to me when they've added support for my display.", "verified": true, "helpfulness": "7/26", "author": "NPR_Dan"}, {"rating": 5.0, "review": "I just received my little black box just a couple days ago . My nephew hooked it up as he is more tech savy than I . However as I watched him plug the cord into the box and then the tv… I felt like I could have easily set it up myself. He showed me the ease of looking for the shows and yet I showed him how to get to my Amazon Prime account… I spent Sunday watching movies on a big screen HDTV instead of my wonderful 7 inch kindle … I love them both and will watch a lot more tv now that I have this little device.  Since I am new to this and not very electronic savy I don't really have anything negative things to say .. it was easy set up , the remote isn't that hard to use .. although I would have liked to see an easier solution to watching more than one of the shows in the series ..that was the most difficult part of it all . I don't have cable or dish so this is a wonderful solution to still let me enjoy a big screen movie or tv show.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}]