[{"rating": 5.0, "review": "Great price and fast delivery. Great product. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Abelardo Morales"}, {"rating": 2.0, "review": "Going back....- The signal was choppy -- the sound kept coming fine.- My computer and TV are 5 ft from the wi-fi router (no blockers)two starts because of great packaging and easy setup", "verified": true, "helpfulness": "0/0", "author": "GoodCustomer"}, {"rating": 4.0, "review": "Lots of buffering connecting from iPad 2 to television. Enjoying using it with the Hulu and HBO Go apps, and look forward to having more iPad apps that work with Chromecast. Works great casting my laptop in my classroom, as well. Easy to set up, but not quite and useful as Apple TV if you've got Mac devices.", "verified": true, "helpfulness": "0/0", "author": "Annie Brock"}, {"rating": 5.0, "review": "If you don't have a Chromecast but have a newer flat panel TV with HDMI ports then you should get one.  Chromecast is great.  We've finally cut the cable and are going fully Chromecast and SmartTV.  Tired of the expensive every increasing cable bills.  Chromecast will give you lots of nice free features but you still have to pay for services like Netflix or Hulu.I like to get on YouTube and find a 3 hour fireplace or aquarium video and just play it for background noise.  Works with iPhone, Droid and iPad.  Easy to use.  Requires internet connection, preferably high speed.", "verified": true, "helpfulness": "0/0", "author": "Gilbert Baca \"Gil\""}, {"rating": 5.0, "review": "Works seamlessly with my Mac, My PC, and my Android phone. It's a \"Must Have\" for anyone who wantes to watch movies from their devices on the TV. Get rid of all those wires!!  :-)Had some shipping issues. My Free 2-day Prime shipping turned into a 6 day shipping fiasco which ended in a replacement being sent, which still arrived even before the original one.", "verified": true, "helpfulness": "0/1", "author": "James M."}, {"rating": 5.0, "review": "I wasnt sure about this purchase, but I wanted to try it, I like it so much I will be buying 2 more so every television in the house has one, if you get the local cast app and droid tv app you can watch pretty much anything you want.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was skeptical about the whole HDMI/USB Media Player stick before I made this purchase.  I was content with the ROKU stand alone boxes.What made me make the change?  I wanted to be able to stream HBO GO and my cable provider does not allow you to stream it on ROKU.  I figured this was a good option because of the price…What I love about it -- There are a huge amount of apps HBO Go, Starz Play, SHO, Encore, etc…You don't see it because it's plugged into the back of my TVYou don't have to plug it into the wall for power (unless you want to).  It has a USB plug which plugs right into your TV for powerThe quality of the video is greatWhat I don't love -- No remote is included, so you have to use your smart phone to operate itChromecast is still in beta so it lags a bit, meaning you can stream content from your Chrome browser onto your screen (although, this feature is impressive, it still has lag issues)Overall, for the money you can't beat this player.  Don't overlook it!", "verified": true, "helpfulness": "0/0", "author": "Brettopia"}, {"rating": 5.0, "review": "Love it just what i needed to watch tv on my big screen....", "verified": true, "helpfulness": "0/0", "author": "E.T."}, {"rating": 5.0, "review": "Cheap,easy to setup and gets a ton of content to my tv.  I bought 1 for every tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Max Friel"}, {"rating": 5.0, "review": "i love it. i can use it to watch Netflix. excellent product for the price.", "verified": true, "helpfulness": "0/0", "author": "ewuzi01"}]