[{"rating": 1.0, "review": "did not work at all and i am getting charge monthly for no reason and i need to return the item.", "verified": true, "helpfulness": "2/12", "author": "raymond"}, {"rating": 1.0, "review": "can not get innternnet to use", "verified": true, "helpfulness": "1/11", "author": "joseph cort"}, {"rating": 5.0, "review": "I use this item a lot. Works well on my Sony TV. No problems with wifi speed and picture quality is excellent. Preordered the fire TV stick to be used on another TV!!", "verified": true, "helpfulness": "0/0", "author": "MOliver"}, {"rating": 5.0, "review": "I really love my Amazon Fire TV! I watch what I want to watch when I want to watch it. Compatible with all the latest model TV's! Free movies and TV shows at your fingertips. Very simple to install!Amazon Fire TV Makes a Great Christmas gift - one-time $99 - Check it out! Please feel free to SHARE this gift idea with friends: http://www.amazon.com/Fire-TV-streaming-media-player/dp/B00CX5P8FC/ref=as_sl_pc_ac_c_1_1_t_asi?tag=mabuhayphilip-20&linkCode;=w24&linkId;=XHUVADXTV7NXXPHQ&creative;=496517&camp;=212361", "verified": true, "helpfulness": "0/0", "author": "Mabuhay International"}, {"rating": 5.0, "review": "i love this on my dinosaur tv.. the voice search is great..", "verified": true, "helpfulness": "0/0", "author": "taya"}, {"rating": 5.0, "review": "Its even BETTER than I had hoped.  I LOVE my Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Jean H. Laprime"}, {"rating": 5.0, "review": "works just like I wanted.  I also have a apple tv.  this one I feel is a tad bit better. although aple tv already has hulu and netflix installed.", "verified": true, "helpfulness": "0/0", "author": "pskontz"}, {"rating": 5.0, "review": "This is an awesome box that Amazon got right the first time.  I have tried all of the rest but this is the best overall.  They all have their pros and cons, if you are a Prime member this is a no brainer.  Between this box and my Apple TV I'm pretty much covered for content and features. First of all this is very easy to setup even if you are not a techie.  Their is quite a bit of content that you can get off of Prime Instant Video.  Also you can now listen to Amazon prime music as well.  Which are both free if you are a prime member.  The third party content providers keep growing too.  Everything you need to get started is included except the HDMI cable.  My daughter, Wife and I play games with each other pretty fun family activity.  You can pickup a bunch of games for free or a couple of bucks at most. I bought the optional gaming controller at the time of purchase.  So, I haven't tried the remote that came with the box on games.", "verified": true, "helpfulness": "1/1", "author": "Sellgooddeals \"sellgooddeals\""}, {"rating": 4.0, "review": "Works well, just hope they release an updated Twitch app for it where you can sign in and search. Hopefully it will get more apps like Roku as well. Netflix and Youtube work great. Processor is fast, switching between apps takes no time at all. Overall I like it.", "verified": true, "helpfulness": "0/0", "author": "James Bosh"}, {"rating": 1.0, "review": "should have bought an Apple tv.  i bought the fire for a second tv with the main reason to watch NETFLIX.  well netflix doesn't work.  not at all, heck i can't even get it to download on to the unite.  should be an app pre loaded but isn't.  i will be sending it back and giving Apple my business.", "verified": true, "helpfulness": "2/4", "author": "Edward S."}]