[{"rating": 2.0, "review": "It was good for the first three months. After that I started gettting streaming problems and after it works only when it likes to...", "verified": true, "helpfulness": "0/0", "author": "Anu"}, {"rating": 4.0, "review": "First the positive:*Small enough that it fits behind most TVs.*The USB power cable is long enough to reach the opposite side of a 60\" TV.*\"Boots up fast \" when you turn your TV on.*Can cast almost anything from your phone or PC. You can change the back ground to you Google photos and show the time and weather.The one con:*Even though it connects to my commercial WiFi router at 72.2mbps 802.11n when streaming videos in true HDX it will sometimes buffer and down grade the video to HD or SD. Even though I have 60Mbps internet connection.With that being said this is the third one for my house, one for every TV.", "verified": true, "helpfulness": "0/0", "author": "JB Wiese"}, {"rating": 4.0, "review": "Absolutely cool for what it does.  Could be more intuitive and user friendly.  Connects easily and streams over wi fi in my 900sqft apartment.  The connection has broken somehow, maybe because it is SUPER DIFFICULT to plug into my TV when mounted on the wall.  One prong is off and now doesn't work.  :/", "verified": true, "helpfulness": "0/0", "author": "Bryan T Lash"}, {"rating": 5.0, "review": "Its good. Buy it. You will like it. Maybe", "verified": true, "helpfulness": "0/0", "author": "diego verdejo-meza"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "AHMAD I ALSHATTI"}, {"rating": 5.0, "review": "Works as advertised.  Easiest way to stream video to TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Sure beats hooking up the laptop with a cable.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "THX", "verified": true, "helpfulness": "0/0", "author": "Oscar Dario Cristancho de la Rosa"}, {"rating": 5.0, "review": "Very well-made product that is easy to use. Simply plug in, set-up and cast!", "verified": true, "helpfulness": "0/0", "author": "Annie"}, {"rating": 5.0, "review": "I have had it a few weeks now, and no problems so far. I use it on my phone. I can even search the internet and get on facebook while im watching Netflix.", "verified": true, "helpfulness": "0/0", "author": "Honest Opinion"}]