[{"rating": 2.0, "review": "I am able to watch only through youtube and Netflix. I tried share desktop through this device. But it is very slow.", "verified": true, "helpfulness": "0/1", "author": "jerry verghese cheruvathoor"}, {"rating": 5.0, "review": "Works as advertised, I hope they keep adding more functinality but with a Chrome browser on your PC and extensions you're almost limitless.", "verified": true, "helpfulness": "1/1", "author": "Troy P Perera"}, {"rating": 2.0, "review": "Very limited to what can be streamed, also when it's working it's very choppy and laggy when playing videos, I hate that you have to use compatible apps or programs instead of the typical hdmi plug where what's on the computer shows up on screen, this is not the case, has to use supported programs or won't work and right now only a few programs will work", "verified": true, "helpfulness": "0/1", "author": "Jeff Stallknecht"}, {"rating": 3.0, "review": "Cannot use with my present technology. Will use when I upgrade.They did not make necessary information available it time of purchase, OR I am too old to understand all this new technology!", "verified": true, "helpfulness": "0/1", "author": "John Henderson"}, {"rating": 3.0, "review": "So far, I'm pretty unimpressed.  The connection keeps dropping or lags.  Other items like my Smart DVD work well in the same area. I use the power cord, but not really thrilled, yet.  It does stream my desktop and other videos as advertised, just not performing smoothly.", "verified": true, "helpfulness": "0/1", "author": "Diceman"}, {"rating": 5.0, "review": "Very useful for casting YouTube and Netflix to the TV.  Would be great if more platforms were available.  Works best from my iPhone.  Clear HD picture.  You can't beat the price.", "verified": true, "helpfulness": "1/1", "author": "DrBlondie"}, {"rating": 1.0, "review": "You cannot cast anything from a Chrome Browser if your using any phone/tablet OS, this feature (the only one I cared about) only works on a pc running full version of Chrome with extensions..", "verified": true, "helpfulness": "0/1", "author": "Hammered"}, {"rating": 4.0, "review": "Its a cute little device. Sometimes the audio and video looses sync but for the most part it works well. Wish there was an Amazon prime video app for android phones but you cant have everything. For $35 its a fun device to mess around with but its not a replacement for real IPTV. I would go with a Roku.", "verified": true, "helpfulness": "0/0", "author": "Fizzybubbly"}, {"rating": 5.0, "review": "Incredible little device. There hasn't been something this amazing released in the consumer electronics space in years. You're looking at the cheapest major upgrade you can make to your home entertainment center available.You can stream any tab from Chrome on your desktop (including with HD video). You can have hours of fun with multiple friends on Youtube...everybody just queues up a video to watch one after another. Netflix streaming is awesome, although you lose the \"playing next episode\" feature on Chromecast.If you have a computer and an entertainment center, you need this little device.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "dissapointing.  I expected a LOT more apps to support this by now.  Poor effort Google  \"its only $35!\"  only gets you so far.", "verified": true, "helpfulness": "0/0", "author": "ELG"}]