[{"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/1", "author": "Jim \"Jackie\""}, {"rating": 5.0, "review": "We love these things so much and how they work with the Fire phones (I'm sure the tablet does the same but tablets are fairly useless for us). Freaking LOVE the phones and TV. Just love them.", "verified": true, "helpfulness": "0/1", "author": "Matthew A Rogers"}, {"rating": 5.0, "review": "So far so good!  I originally purchased it to listen to Prime music as we already have a Roku.  My wife and I find that we are enjoying the Fire TV over our Roku units for streaming media (Amazon, NetFlix, Roku, etc.).  The only thing missing is Vudu.  Once Vudu is on the Fire TV I'm not sure we will use our Roku anymore.", "verified": true, "helpfulness": "1/1", "author": "John Albee"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "J. Walton \"MidNiteNurse\""}, {"rating": 5.0, "review": "So far this works awesome.", "verified": true, "helpfulness": "0/1", "author": "Timothy S Massaro"}, {"rating": 5.0, "review": "love this so glad I discovered it; another great benefit of amazon!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is everything it said it was! Came on time an everything! I have been able to catch up on all the episodes I've missed due to my job! Thanks amazon I really appreciate my fire TV. Us folks down here in the Deep East Texas woods really perciate catching up on some good ol TV watchin!!", "verified": false, "helpfulness": "0/1", "author": "Penguin"}, {"rating": 1.0, "review": "I just bought the firetv today at best buy.  Easy to hook up.  I get nothing for free. I must have been sadly mistaken to think a system could replace any tv service.  It is cheaper to maintain a $100.00+ cable bill than to use this system.  Everything and I mean everything has a price either to rent or buy.  I will be returning the firetv tomorrow.  Total waste of money. Mark S", "verified": true, "helpfulness": "2/6", "author": "mark snow"}, {"rating": 4.0, "review": "So far it is o.k. Some shows you can't watch for it does not have a link. Some you start watching and before the movie or show you are watching you have to find another link to finish watching. It has it's good and bad points.", "verified": true, "helpfulness": "2/3", "author": "Shirley Garner"}, {"rating": 5.0, "review": "I love this!  My pc does not stream well to my TV but this is lightning fast and easy to use.  Paired with Prime membership and this is all I need!", "verified": true, "helpfulness": "1/2", "author": "Melissa Emery"}]