[{"rating": 5.0, "review": "what can i saw... this caster works like it is supposed to. Wonderful technology and lots of fun to use.", "verified": true, "helpfulness": "0/0", "author": "Thomas B. Smith"}, {"rating": 5.0, "review": "Works great, easy set  up and installation was up and running in under a half hour enjoying streaming videos and shows", "verified": true, "helpfulness": "0/0", "author": "john sullivan"}, {"rating": 3.0, "review": "Generally I am happy with Amazon P:rime, but not happy with the fact I cannot stream to my TV with the Googlechromcast HDMI streaming Media Payer.", "verified": true, "helpfulness": "0/1", "author": "Abe Fried"}, {"rating": 5.0, "review": "I'm not sure why people are confused about this device.It lets you watch youtube and netflix as well as other services.Read the description carefully.It works great.  We use it to play youtube videos on a home gym tv for working out along with the youtube videos!", "verified": true, "helpfulness": "0/0", "author": "Mark Diehl"}, {"rating": 4.0, "review": "Love Chromecast.. only issue is that i cant share out my webpages.. or documents like i can with Miracast. you would think that if Google would build miracast into the OS.. then it should be supported by Chromecast. but nope.. they are becoming like Apple where they want to control everything.. NOT GOOD.. i had to go and buy a Miracast dongle cause i didnt know Chromecast doesnt support it. other issue is that there is no way to setup the advance features of the networking piece like Android so you cannot define your own DNS servers.. which is a big issue for me.otherwise.. video streaming is very smooth..", "verified": true, "helpfulness": "0/0", "author": "Danny Ferri \"Ramses\""}, {"rating": 5.0, "review": "Love this product. Bought two. Especially enjoy having it on my bedroom TV for streaming scary movies on Netflix at night. Makes ducking under the covers when something goes bump in the night, much more convenient.Wish there were more apps and such with compatibility, but I am very hopeful Google will grow the usability of the product.If you have a TV that is not able to connect to the internet; buy this product.", "verified": true, "helpfulness": "0/0", "author": "Clayton A."}, {"rating": 5.0, "review": "very happy use it all the time recommend it to people who wants to see the movies using there ipad and stuff", "verified": true, "helpfulness": "0/0", "author": "veronica amezcua"}, {"rating": 5.0, "review": "I love this product, it makes not having a smart TV tolerable. This product works exactly as as described. Thanks!", "verified": true, "helpfulness": "0/0", "author": "amazongod"}, {"rating": 5.0, "review": "I love Chromecast, it makes it easy to watch or even read things on your television and its much cheaper than the alternatives.", "verified": true, "helpfulness": "0/0", "author": "SG"}, {"rating": 5.0, "review": "What a magnificent piece of technology, easy setup, works with my samsung gs3, my nexus 7 and my desktop pc, can finally use hbo go on my tv! netflix, hulu, youtube! this device is just great! love it, if you're thinking about getting it! don't think too much just get it!", "verified": true, "helpfulness": "0/0", "author": "Peedro"}]