[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Juan mason"}, {"rating": 5.0, "review": "Love this product.  Will get rid of my cable ASAP!", "verified": true, "helpfulness": "0/0", "author": "Raymond A. Tucker"}, {"rating": 4.0, "review": "Hmm.... i m not 110v local people. So i cant use supply (but supply cloud use usb port - on the tv -)Mirroring is not stableBut it is adopted for very Variable.", "verified": true, "helpfulness": "0/0", "author": "inhyeok yu"}, {"rating": 4.0, "review": "Work's as expected.", "verified": true, "helpfulness": "0/0", "author": "christopher j. uebrick"}, {"rating": 5.0, "review": "This is the third Chromecast I've purchased, I have one on every TV in my home.", "verified": true, "helpfulness": "0/0", "author": "Roger Cormier"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Rmr313"}, {"rating": 5.0, "review": "I have had this product for quite a while now, no issues. I also have fire stick, but I prefer to use chromecast", "verified": true, "helpfulness": "0/0", "author": "Bakhrom Ahmedov \"Bakhrom Ahmedov\""}, {"rating": 2.0, "review": "Crap.  Google went all propitiatory and crippled what could have been the best device yet.", "verified": true, "helpfulness": "0/0", "author": "Wayne H. \"Overworked ... underpaid\""}, {"rating": 5.0, "review": "I'm giving it 5 stars because it is exactly what it said it was. I was looking for more than just streaming. But it works great if you just want a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Forrest"}, {"rating": 2.0, "review": "I read reviews for Chromecast/Roku/Amazon Firestick for hours before deciding that the Chromecast would meet my needs.  It worked just fine at first, with the caveat that, if I connected through my computer, any work done on my computer would make the picture delayed and choppy.  Less than a week later, and the Chromecast device is no longer detected by my phone (which is the only way I can really use this while using my computer at the same time, as explained above).  I checked the device, I unplugged/plugged in again, I've tried connecting a dozen times, and nothing.  Chromecast appears to be connected on the TV monitor, but through my phone, nothing.  The Chromecast works when I do it through my computer, but why would I want to watch a jilted TV show?  The \"using your phone as a remote\" thing is an impediment, not a benefit.  I'll give this thing a few more tries before I give up completely, but at this rate, it seems like I'll be returning this semi-functional device for something with its own remote that doesn't depend on another piece of technology.", "verified": true, "helpfulness": "0/0", "author": "Shay"}]