[{"rating": 5.0, "review": "Pretty Neat Gadget !  Next stop, drop my cable !", "verified": true, "helpfulness": "0/0", "author": "dmkasper"}, {"rating": 5.0, "review": "Wonderful Fire TV. We can watch our favorite movies anytime. Hurray.", "verified": true, "helpfulness": "0/0", "author": "Laurie S. Lechlitner"}, {"rating": 5.0, "review": "More than I expected!! Excellent", "verified": true, "helpfulness": "0/0", "author": "dsinque1"}, {"rating": 5.0, "review": "When compared to my AppleTV this FireTV beats Apple hands-down for user-friendliness!  The RF remote is just great and was able to tuck this device into my entertainment cabinet with just a light to see to know when it is on.  The AppleTV requires line of sight to work with the remote - how outdated is that?  It beats the AppleTV remote furtherl with the ability to call up a movie by voice and multiple options to navigate.  Speaking clearly makes it easy. Picture quality is the same on both.  Being an Amazon Prime member since it was offered, also affords me a great selection of Prime Movies included in my membership.  Both AppleTV and Amazon Prime give me the Netflix viewing capability as well.  As an Apple product lover, this FireTV is my preferred choice of movie watching.Still waiting for my Amazon Echo however, rumor has it that it continues to be shipped to the \"full price\" payer first....  My review will be in May, I guess.", "verified": true, "helpfulness": "0/0", "author": "NewEnglander"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Lord Umungus"}, {"rating": 5.0, "review": "Fantastic I really enjoy it.plenty of good shows there are ones for every one to enjoy.", "verified": true, "helpfulness": "0/0", "author": "NANNIE77"}, {"rating": 5.0, "review": "Amazon Fire TV has simplifies my TV viewing.", "verified": true, "helpfulness": "0/0", "author": "James Easley"}, {"rating": 5.0, "review": "Great product.  Fast Ship.  Easy set up.  Beware Xfinity/Comcast customers... as HBO Go and Showtime are not made available on Fire TV by this cable subscription provider.  Netflix and other streaming video is great, and saves me from running my PS4 unnecessarily for those services.  Pandora is great to listen to through the home theater sound system and carries over all of your channels, etc through your Pandora log in.", "verified": true, "helpfulness": "0/0", "author": "LA from Ft Laud, FL"}, {"rating": 5.0, "review": "Been using chromecast for a little over a year now, and this item is far better than chromecast. HIGHLY recommend this for anyone trying to stream.Still haven't scratched the surface on what all Amazon Fire has to offer.Very happy with this purchase", "verified": true, "helpfulness": "0/0", "author": "Jason Barber"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "trincess"}]