[{"rating": 5.0, "review": "Has some limitations, but overall very useful.  For example, widescreen videos are distorted to fit a standard TV (maybe not a problem on an HD set).  Had to purchase an HDMI to RCA converter since my older TV does not have HDMI, but it works fine.  The colors may be a bit distorted.  On the movies I have viewed so far, the color on the PC is blue-tinted but on the TV the colors are somewhat green-tinted.  (The TV actually looks more natural; don't know which is the \"true\" color.)  Documentation is non-existent, but there are some good references on Amazon.  (Interesting:  setup using Chrome failed, could not find my network, but setup using IE worked first time - go figure.)  Very worthwhile especially considering the price.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 3.0, "review": "i feel like it was a waste of money. you can only do a few things with it. i was under the impression that it would take my tablet or laptop and put it on the tv screen. but i could be wrong/working it all wrong. i will find the time to mess with it more in the future. i just wish vizo would have just created the chrome app or firefox app on their wifi tvs", "verified": true, "helpfulness": "0/0", "author": "Throwerboy1911"}, {"rating": 5.0, "review": "Bought it primarily for the HBOGo app. Cool little toy. Daughter just started college and set it with her so she could make use of it. She uses it daily.", "verified": true, "helpfulness": "0/0", "author": "Charles Reynolds"}, {"rating": 2.0, "review": "I bought this in order to watch some tv shows that I lost when my DVR went kaput.  The setup was easy however no matter what I do, the signal cuts out and I lose the picture.  So far I have not been able to watch anything successfully despite trying different setups and having a strong WiFi connection.  Google should have waited to roll it out until they worked out all the bugs and got the casting feature working reliably.", "verified": true, "helpfulness": "0/0", "author": "sb98deg"}, {"rating": 2.0, "review": "Trying to get it to work with Amazon Prime is terminally frustrating.  It's not worth the bother.  At $30 it's cheap but you may just be getting what you pay for,", "verified": true, "helpfulness": "0/0", "author": "tailspin"}, {"rating": 5.0, "review": "Although I have connected my iPad directly to the television via HDMi cable and watched Netflix, we had not experimented streaming video. I do like having direct control from my iPad or iPhone without having to plug in a cable, sort of a mirroring effect. I was not clear on exactly what we would have access to when I bought the Chromecast device. I guess I thought there would be more viewing options. We are considering eliminating our cable and this seemed like an inexpensive way to dip our toes in the water. There are few free offerings that I have found, and so I was disappointed by that. In the big picture, one might still save money by not paying for a cable plan and using the Chromecast to view specific subscription services. I would like to hear from someone about how the Chromecast and Apple TV viewing experiences differ or are alike. For watching Netflix ( to which we already had a subscription), watching Videos on YouTube and listening to Pandora, it is worth the price of the device, IF you have a mobile device to use with it.", "verified": true, "helpfulness": "0/0", "author": "V. Travis"}, {"rating": 5.0, "review": "This thing is awesome I love it . Everyone should one will not be unsatisfied. Even my kids  l oves it", "verified": true, "helpfulness": "0/0", "author": "Dean Maragh"}, {"rating": 5.0, "review": "I was just hoping to stream some hulu, but the google chrome cast went above and beyond expectations. It works perfectly and seamlessly with my laptop and tv, streaming anything that shows up on my browser window.  The only thing I was disappointed with was the fact that it terribly with google chrome book, the one laptop you'd expect it to work best with. This isn't the fault of chrome cast, it works with every other computer I've used it with, it's the fault of the google chrome book, which really has no power whatsoever.", "verified": true, "helpfulness": "0/0", "author": "M. Moussa \"azimuth graphics\""}, {"rating": 3.0, "review": "let me start by saying that what its does it does great..  sending netflix, your google music..and other compatible apps to display on your tv works great but the operative word is \"compatible apps\"..  this is a dumb device, by itself it cant do much. you need a phone or tablet to stream some content to it.  NOW for the negative..  i cant believe google has not fixed this  but you cant do the MOST BASIC thing with it.. what is the most basic thing you ask..  display pictures from your device. !!!!  how much more BASIC can you get..  come on google..  i almost gave it 2 stars but since it does what it does well.. ill give it 3..  im looking into a allshare/miracast device which will display \"EVERYTHING\" from my samsung devices...  IF/when google decides to expand the functionality to include basic things like streaming pictures to it.. i will return and re-rate/update my review.. but until then.. think about what you want to do and then decide if you want a chromecast or a miracast dongle.", "verified": false, "helpfulness": "0/0", "author": "Petem"}, {"rating": 5.0, "review": "Works right out of the box with little set up. If it is online and able to be streamed you can use this to watch on HDMI TV. Nice.", "verified": true, "helpfulness": "0/0", "author": "PlanMan"}]