[{"rating": 3.0, "review": "Still trying to decide if this was a good buy or not.  My Sony Smart TV already provides access to most of what the Fire TV provides, at least the things I am interested in anyway.  The Fire TV does give me access to some other channels that I cannot get through my TV, but most of those are subscription only, and all those subscription costs start adding back up to what my cable provider was charging.  The Droid TV looks interesting (haven't had a chance to really dig into it yet), but it is a bit cumbersome to use because it must play on an Android device and then slung to the Fire TV.  The voice control is really nice (and it really does work!), but it only works with Amazon content, which is mostly pay on demand, and most of that I can get through my Netflix or Hulu subscription for no additional charge, and those are available through my smart TV.  So now I am trying to decide if the additional expense of the Fire TV is worth the small benefit it provides beyond what I already had through the smart TV.  My jury is still out.", "verified": true, "helpfulness": "0/0", "author": "Mark Tovey"}, {"rating": 2.0, "review": "I was excited to get Amazon Fire but it isn't as great as I had been hoping, some of it is due to what is available on prime for free. Recently it didn't turn off which I didn't notice for days and it was streaming something that entire time; I had to unplug it to turn off. Initially the voice search was great; sadly it no longer works. Perhaps I got a bad one.", "verified": true, "helpfulness": "0/1", "author": "Jyll"}, {"rating": 2.0, "review": "The device itself is a great idea. Love using it as it contains many apps I use everyday to prevent me from having to purchase cable on a monthly basis. However, one of my issues with this box is the remote problem I have. I have had an issue with the first remote and finally took the time to call Amazon. Being the great company they are they quickly sent me a new remote without having to return the broken one. After about a month of use again the second remote has failed and I can no longer use the Amazon Fire TV due to the issue of the remote not controlling anything on it. I do not feel like a third remote will fix the issue, as the two have already been tried so clearly it is the unit itself that is broken. I will wait for a future version and hopefully have the opportunity to purchase that device.", "verified": true, "helpfulness": "0/1", "author": "Nick Alp"}, {"rating": 1.0, "review": "I herd great things about the fire tv, I suppose mine just so happened to be a defective box.  It was easy to hook-up to the TV,  but it seemed like the remote had a mind of its own.  It was impossible for me to make a selection.  The cursor kept randomly roaming all over the selections and if I tried to select an A on the screen, I ended up with an S.  I could not access Netflix or even the videos that I had already purchased from my Kindle fire.  I sent the box back and bought a Roku 2.  I'm very happy with the Roku.", "verified": true, "helpfulness": "2/3", "author": "Dee-Dee"}, {"rating": 1.0, "review": "We spent 2 hours on the phone with Amazon Fire Technical Support on New Year's Eve trying to get the Amazon Fire box to work with our Marantz TV.  They tried everything and we tried everything to fix the system to work.  It never worked.  The next day we had to call a local technical company that installs TVs, etc. for home systems.  The technician came out and found out that the resolution of the Amazon Fire box is not compatible with the resolution of our Marantz TV even though the Marantz TV has HDMI ports.  He took the box with him to check if the resolution could be changed on the box to match that on the TV.  He has not gotten back to us for a week since he called to say that he had changed the resolution on the box and that he would bring it back to try to make the TV video streaming to work.  This had been a very discouraging and expensive experience and we still don't have video streaming, which is why I bought the Amazon Fire in the first place.  Let this be a lesson to those people who have TVs that are not new and do not have a matching resolution pattern.I'm sure the newer TVs work fine with this box.", "verified": true, "helpfulness": "1/3", "author": "Susan G. Williamson"}, {"rating": 1.0, "review": "It's no better than Netflix and other device streaming systems.", "verified": true, "helpfulness": "1/4", "author": "edgar d. borja"}, {"rating": 5.0, "review": "I purchased it for my daughter and she loves it!", "verified": true, "helpfulness": "0/1", "author": "mE"}, {"rating": 5.0, "review": "I LOVE my Amazon TV. The voice search is awesome!!!", "verified": true, "helpfulness": "1/2", "author": "mrspinck"}, {"rating": 5.0, "review": "Powerful", "verified": true, "helpfulness": "1/3", "author": "Shawn Perkins"}, {"rating": 4.0, "review": "Nice item", "verified": true, "helpfulness": "0/1", "author": "John Vaughan"}]