[{"rating": 4.0, "review": "how does it work? you have to click the cast button. but where is the cast button? i couldnt find thecast button.  so i had to disconnect the chromecast and do a little research.  i finally found thecast button extension in google's store. the chromecast works fine now although i have occasionalreception problems which i attribute to a lack of power on the part of my computer. so the beginningwas not sterling and not a five star performance, but so far i am satisfied for the price i paidfor it.", "verified": true, "helpfulness": "0/0", "author": "anthony chatham"}, {"rating": 5.0, "review": "I was really hesitant because I didn't know much about \"casting\" from your phone or laptop, I have the Roku and love that type of streaming device.  This device blew away my expectations, and I love it.  I downloaded the Google Chromecast app to my android phone and am able to send movies from Netflix, HBOGO, YouTube, HuluPlus, and more.  The best part is that it doesn't tie up my phone or my laptop, I can continue receiving calls or doing something else on the laptop (fyi: I have an HP Chromebook 14 which you can get the Chromecast extension for Chrome - works like a dream).  The device was extremely easy to install, which took about 5 minutes before I was watching a movie.  This is especially great for people who want to use HBOGO on their TV and don't want to pay for the pricier devices that may not be supported by your provider (i.e. Comcast on Roku, etc).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is an amazing device for the cost.  Chromecast has totally changed the way I watch media. Works incredibly well with any of the streaming services its optimized for.  The two complaints I have are that it doesn't work with Amazon Prime (please fix this!) and that it doesn't work well with streaming files from your network (has trouble with some file types).  Still an amazing product that I can't believe is so cheap.", "verified": true, "helpfulness": "0/0", "author": "B. Dodds \"part-time rabbit\""}, {"rating": 5.0, "review": "Purchased this as a cheap solution to stream Netflix in my bedroom. Works with my ipad and iphone and super simple to hook up. I enjoy using it to watch youtube as well which I'd never done on a tv before this.", "verified": true, "helpfulness": "0/0", "author": "Michael Battaglia"}, {"rating": 2.0, "review": "Set up from my Nook HD+ was fine; I had to use Chrome browser instead of the Chromecast app.Netflix and YouTube worked right out of the box.Ironically Google Play Music and Movies DO NOT WORK!  This is an example of irony because one would think that Google would make streaming device that worked flawlessly with its own revenue generating services.", "verified": false, "helpfulness": "2/2", "author": "Michael H. Williams \"mcubed\""}, {"rating": 5.0, "review": "Yes I have recommended it to friends. Simple to use with great results.your requirements for amt of words is ridiculous", "verified": false, "helpfulness": "0/0", "author": "Mary Beth Andres"}, {"rating": 4.0, "review": "Works well but seems to have limited applicability.  Suppose I'll eventually figure out if it's good for all I thought it might work for", "verified": true, "helpfulness": "0/1", "author": "NSTL"}, {"rating": 4.0, "review": "Comes with everything you need in the box. basically plug and play easy to follow instructions. Worth the price. easy free mobile software works great.", "verified": true, "helpfulness": "0/0", "author": "Kevin Carter"}, {"rating": 5.0, "review": "We live in the woods with specific considerations to visit and enjoy the outside world.  Broadband is out of the question.  Satellite dishes require snow removal maintenance in winter and are not simple.  Cell phone use is spotty and not reliable in this mountain valley.  Our landline is the most reliable connection to the rest of you and how we connect to the internet.  Along comes Google with Chromecast and now we can stream content to our TV/DVD/Blueray player and really enjoy visual media.  Netflix is fine and we have no intention to leave them.  DVD's are fine yet require going to town to the post office.  Chromecast has breached the time delay of postal mail and provides us with a wealth of content on our bigger screen", "verified": true, "helpfulness": "0/0", "author": "John Carlson"}, {"rating": 5.0, "review": "I was looking at DVD player that streamed Netflix and remember Chromecast. So much easier than having to find a place for another device for the TV. It even works better and the video is clearer than the Living room TV that has a DVR. And using the tablet or smartphone as the remote means not searching for the right remote and needing to replace batteries. Totally love this little device. Thanks Google.", "verified": true, "helpfulness": "1/1", "author": "Marie Hermans"}]