[{"rating": 1.0, "review": "The only reason you want this is for tab-casting, which does not work. You might get a stream for 3 minutes and then it clunks out.Get a Roku or Apple TV and wait until they get this right.", "verified": false, "helpfulness": "0/2", "author": "RobotPanda"}, {"rating": 5.0, "review": "The best purchase I've made recently ! We'll worth the money and was easy to set up ! Definitely recommend to buy it without even thinking about it ,enjoy!", "verified": true, "helpfulness": "0/1", "author": "Viktoriya Keller"}, {"rating": 5.0, "review": "Awsome is the only word i can say...", "verified": true, "helpfulness": "0/1", "author": "Mclovin18"}, {"rating": 5.0, "review": "We have 4 of them and love them! They work great! small simple no extra clutter on our tv stand!", "verified": true, "helpfulness": "0/0", "author": "Sarah Van Stralen"}, {"rating": 5.0, "review": "I love my Chromecast, and we have one for both tv's in the house. The streaming from my phone is a fantastic feature that other services like Netflix, Twitch Tv, and Youtube have already caught on to. It has a very easy interface with the Chrome browser. I'm hoping that in the future more services will be streamable to the Chromecast. Would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "HCM"}, {"rating": 5.0, "review": "Everything ok!", "verified": true, "helpfulness": "0/0", "author": "Lucas"}, {"rating": 5.0, "review": "I more than happy with screen cast functionality. Thank you.", "verified": true, "helpfulness": "0/0", "author": "Alfredo G."}, {"rating": 3.0, "review": "Aaaaaaaaahhhh sucks I bought apple tv works 10x", "verified": true, "helpfulness": "0/2", "author": "Fox"}, {"rating": 4.0, "review": "Very nice for streaming Netflix, HBO Go, Youtube and other apps on any TV. Most smart TVs have limited apps and don't support HBO Go, so this is a cheap way to upgrade that ability. I would give it 5 stars, but the software is still really buggy. I don't know if it's Chromecast or the individual apps (I'm talking to you Netflix) but it continues streaming but your app won't show connection to the TV anymore, so you can't control the player. It's really annoying.", "verified": false, "helpfulness": "0/0", "author": "Sela"}, {"rating": 5.0, "review": "Basically turns your HDTV into a smart TV. You'll be able to watch Netflix, stream stuff from your phone and laptop on to the big screen. Works fine without any glitches.", "verified": true, "helpfulness": "0/0", "author": "TechDush"}]