[{"rating": 5.0, "review": "never expected it to be like this but very good product just wondering how long will it last hope longer", "verified": true, "helpfulness": "0/0", "author": "nenita pacres"}, {"rating": 5.0, "review": "Works great. Lets me watch Netflix and Hulu on my tv. Cheaper than a Roku or Apple tv. Love it.", "verified": true, "helpfulness": "0/0", "author": "don_iowa_76"}, {"rating": 5.0, "review": "one of the greatest inventions that Google has released, and if you don't own this  product you do not know what you're missing, shipped and delivered on time OUT STANDING!", "verified": true, "helpfulness": "0/0", "author": "shawn"}, {"rating": 5.0, "review": "I did not know what to expect from this device. You know, you see the commercials and hope the product will do as advertised. Well this one does exactly what its supposed to do. It was easy to set up but I had to be pacient with it. I did have an issue with the set up and had to research the problem, but I quickly found the solution. For using this to view things that don;t have aps, like watching movies on Amazon Instant video, I have to disable Silverlight and its easy enough to do, but Then I have to turn Silverlight back on to watch things with aps like Netflix. But its no big deal and its great to be able to see on the tv whatever is on my computer screen. I love my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jeff Stevens"}, {"rating": 1.0, "review": "LAGS A LOT!!! I have 105mbps cable internet. This thing lags real hard. Not worth the money. DO NOT BUY!!!", "verified": true, "helpfulness": "1/1", "author": "Danyal Sumra"}, {"rating": 5.0, "review": "i've used other apps, they all work well, but netflix hulu plus and google music are perfect through this, buy it, best $35 you'll spend.", "verified": true, "helpfulness": "0/0", "author": "no spin dan"}, {"rating": 2.0, "review": "Only works with u tube on my galaxy tab:-( i guess u get what u pay for..kinda bummed out though", "verified": true, "helpfulness": "1/2", "author": "Joshua Roy"}, {"rating": 5.0, "review": "I bought this a couple months ago because it was not very expensive and everyone is talking about it. I own a Plex server, 3 Roku's, MCE, MCE extender and a Tivo and I love them all for their own reasons so why not add another device. I have only used a couple times and set up was very easy. My son came home from collage and wanted to show me some YouTube video on his laptop so we threw it up on the Chromecast and we all watched in on the TV instead of gathering around his laptop. Other than that I have not found a use for it yet but I am sure I will.", "verified": true, "helpfulness": "0/0", "author": "Kevin P Overholt"}, {"rating": 5.0, "review": "Hands down one of the coolest things I have every used. its so easy to use, its basically plug and play. I have not had any problems. This is the second one in my house and I am able to switch between the two without any problems.", "verified": true, "helpfulness": "0/0", "author": "Patrick Urosek"}, {"rating": 5.0, "review": "I really enjoy the chromecast! It really useful if you want a chep way to stream Netflix and Youtube on your screen.", "verified": true, "helpfulness": "0/0", "author": "José David"}]