[{"rating": 5.0, "review": "Set up was easy and quick. Typed in my router password and it connected. Followed the info given and then explored its options. I'm a Prime member now using 30 day free trial which adds more choices. I added Netflix and have been enjoying what it offers. I don't have cable so all I watched were movies from Redbox or streamed from my Amazon account using my IPAD 2 prior to the getting the Fire TV. I just got internet at a discounted rate due to qualifieing for it. So the Fire TV has been an excellent option for one such as me and what I can afford up front and on a monthly basis. Prime is a once a year payment and Netflix is $9 a month after a free 30 day trial. I've found some great entertainment with just these 2 services. Plenty to watch for me and my teenage daughters. My first router was a $40 Belkin. I streamed on my IPAD 2 prior to the Fire TV. I had constant buffering and dropping issues. I bought a $20 TP-Link router on Amazon and all my buffering connectivity issues ended. My point is having a solid router that connects really makes streaming worthwhile. My picture quality is beautiful and the audio clear and in sinc. This system is fast and smooth. Havent played any games yet. Just streaming movies and TV series I've never seen before due to not having cable. I'm having a blast without paying a cable bill that I couldn't anyways and I'm watching more of what I prefer by far. I can live without Internet and cable. I have for long periods of time. Now I get all the entertainment I want with just an Internet connection and the Fire TV. My Redbox visits have gone down to every once in a while for new release only.", "verified": true, "helpfulness": "1/1", "author": "Joe"}, {"rating": 5.0, "review": "very easy to install works great", "verified": true, "helpfulness": "0/0", "author": "sam upshaw"}, {"rating": 5.0, "review": "Awesome! Fast and Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 2.0, "review": "Totally misleading....You have to pay for everything. It does have many options to pick from.", "verified": true, "helpfulness": "0/1", "author": "Danielle"}, {"rating": 5.0, "review": "This thing is incredible! It's super super fast (I'm assuming because of the quad core processor) and I love that I have access to pretty much every movie and tv show in existence.Pros:Super smallBox looks super sweetCan technically access any movie or show you wantCan play video games on this thing!Remote is comfortable and well builtReaction to remote is instantTons of random music and tv channels for free1080p!Cons:-Power cable plug is an obnoxiously huge-From what I understand, I can't use my fire tv stick remote with the fire tv. It won't recognize it at all.-Annoyingly long video at setup", "verified": true, "helpfulness": "1/1", "author": "Ryan Confer"}, {"rating": 5.0, "review": "I am not tech savvy but hooked it up and followed the prompts with no problems!  We ditched cable and haven't looked back!LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Corinne Cariota"}, {"rating": 5.0, "review": "i love it, not a perfect streaming device, but wayyyyyy better than roku by a mile! after so many hours the sounds stops and then I have to reset app and device to get sound back, still want to know what USB port is for on back though.", "verified": true, "helpfulness": "0/0", "author": "jason peacock"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Richard M Pruitt"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "David Speer"}, {"rating": 5.0, "review": "Great! easy to set up & use", "verified": true, "helpfulness": "0/0", "author": "David Barba"}]