[{"rating": 4.0, "review": "Limited apps. but has a lot of potential, easy set up and the price is low even when not on sale.", "verified": true, "helpfulness": "0/0", "author": "Jonathan P. Vu"}, {"rating": 5.0, "review": "I use my chromecast every night.  I'll be browsing Facebook before bed and be watching Netflix.  I've used it as a mirroring device in the conference room at work and the partners couldn't figure out how I was walking around with my MacBook Pro and still staying connected.  Made me look like a wizard. :)", "verified": true, "helpfulness": "0/0", "author": "Dartsmyth"}, {"rating": 4.0, "review": "chrome cast is the cheapest device of it type on the market i could find. however being reasonably new it has less apps available than other device such as Roku. One main reason i purchased chrome cast was to view live TV, Aereo has a good live TV but does not yet stream using chrome cast. chrome cast unlike Roku allow streaming from your laptop which works but is slow due to the video stream process through your laptop then to chrome cast. how slow depends on your computer speed often resulting in video buffering.", "verified": true, "helpfulness": "1/1", "author": "Daryl"}, {"rating": 2.0, "review": "It seems to me that this does the same as a (ethernet) cable  would; maybe I am missing its potential", "verified": true, "helpfulness": "0/1", "author": "peter randazzo"}, {"rating": 5.0, "review": "At launch, the chromecast wasn't that great since it only had a few services (Youtube, Netflix, and that's about it) Now that the apps are rolling out, the chromecast is the best gadget to have to turn any tv into a smart tv. The setup is very straightforward and after that you can use your phone, computer, or tablet to cast media to the chromecast! The list of apps are incredible from Hulu, HboGo, Pandora, and others. But the real power in the chromecast is the screen mirroring it can do and the plex media server. Plex costs money but it is the best way to get any downloaded media you have on a device to play on your tv. As for Google Cast through Google Chrome Web Browse, I have yet to run into any issues using the Google Chrome browser on my laptop to cast a tab to my tv. Yes there is lag involved so don't try to do anything too intensive such as playing a game but other than that, Using the Google Chrome Web Browser to cast anything on your tv is incredible! Beats the pants off those other devices and at an incredible price! If you're on the fence about the google chromecast, safely get down (you don't want to hurt yourself, it's a far fall from the fence ask Humpty Dumpty) and buy one ASAP! You won't be dissapointed.", "verified": true, "helpfulness": "0/0", "author": "P. Gernale Jr."}, {"rating": 2.0, "review": "Please note!  A recent firmware update has rendered Chromecast incapable of casting NETFLIX from some android devices.  Please do your research before buying.  Error 16003.", "verified": true, "helpfulness": "1/1", "author": "dogsncoffee"}, {"rating": 3.0, "review": "The set I purchased this for is an older 1080i HDTV.  It can do 480p, but not 720p or 1080p.Even though there is a way to change Chromecast calls the \"Tab picture quality\"  to 480p, I could not get a picture at all on this older set.I'm pretty much stuck with my Roku player in 480p mode.I was going to return the Chromecast, however, it works nicely on my smaller 1080p capable TV in the kitchen.  Not that I want to do a lot of streaming in the kitchen, but for $35 I figured \"what the hey\".So far I have cast stuff from my iPhone using Netflix, HBO Go and YouTube apps with no problems.If you have an older set with no 1080p capability, forget the Chromecast and the Apple TV as well.  You will have to go for a Roku and hook it up to a 1080p capable set just to be able to do the setup and change the output resolution to 480p.Modern devices have no respect for legacy HDTV equipment.", "verified": true, "helpfulness": "1/1", "author": "PotomacG"}, {"rating": 2.0, "review": "Although the product worked - the streaming video and audio were out of sync and was very obvious trying to watch a movie - returned the product", "verified": true, "helpfulness": "0/0", "author": "Michael L Kelly"}, {"rating": 5.0, "review": "Made it so easy to stream Netflix at such a low price. I now want one for every tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Klupp"}, {"rating": 5.0, "review": "Great gadget. Works exactly as it should. only wish there were an app for Amazon prime. got streaming content on every tv in house", "verified": true, "helpfulness": "0/0", "author": "Byron Windsor"}]