[{"rating": 5.0, "review": "Awesome performance for the price.  It does have its drawbacks but for the price it is worth it.", "verified": true, "helpfulness": "0/0", "author": "toy_truck"}, {"rating": 5.0, "review": "I love this - so easy to use, especially since I had a mac so I can't use the regular cables, so this is what i went with. Kinda sucks when my college apartment wifi goes out, but its not the products fault. I wish there were more apps, but I'm sure they'll be more soon", "verified": true, "helpfulness": "0/0", "author": "Carleigh"}, {"rating": 5.0, "review": "Love this, finally a way to watch all of my Google play movies on a big screen! The instructions say that you can't use a service port for the USB power but I tried mine on my Dynex and it works just fine", "verified": true, "helpfulness": "0/0", "author": "C. Hansen"}, {"rating": 5.0, "review": "I just got this a couple of days ago.  So far, so good.  I can easily send videos from Youtube or any Chrome page either from tablet, cell or laptop...Small, easy to configure, easy to use, great definition... anyway, works as expected and a great value for the price.", "verified": true, "helpfulness": "0/0", "author": "Fabian V. \"Fabian\""}, {"rating": 5.0, "review": "Fantastic product if you use the chromecast compatible apps often (plex and youtube come to mind for me). However, be mindful if you have a roku (3?) as recent software updates have actually allowed my roku to function basically as a chromecast thus forcing me to move my chromecast to my other tv.", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "Using this with my HTC One M8 mostly.  Streaming netflix, Amazon, Showbox, Youtube, Pandora, Music, even pictures with ease (and Allcast app).", "verified": true, "helpfulness": "0/0", "author": "FirehawkNS"}, {"rating": 4.0, "review": "Works great with Galaxy S4, YouTube, HBO Go, does not work with Amazon PrimeWorth the $ payed, give it a go", "verified": true, "helpfulness": "0/0", "author": "Chiefdnd"}, {"rating": 1.0, "review": "I've wanted a Chromecast for a long time because I'm trying to break up with my very expensive cable tv package. BUT I needed to be able to watch sports. Enter various sports-streaming websites and the Chromecast, and everyone is happy.It's a little jerky sometimes (the picture, I mean), but it really is a good idea and a good product. I ended up having to get an HDMI pigtail in order to use the chromecast and my Roku, but it's worked like a champ.Edit: A few months after I got the Chromecast, I got a new wireless router. All of the rest of my devices (an android tablet, 2 laptops, a Roku, and my iPhone) have all synced and work just fine with the new router. But not the tempermental Chromecast. No matter what I've tried - and let me tell you, I've now been messing with this stupid thing for THREE HOURS - it won't connect to my network. The new router is on the list of devices which are compatible. It's the right MgHz, not dual band, all of the settings are as Chromecast tech support says they should be.-- And just as a side note, the fact that I had to check all of these settings makes this product completely useless for anyone who is not tech savvy. I'm not an expert by any means, and had to do plenty of googling to try to figure out how to access the settings for the router to double check that they are how Chromsecast says they need to be. For someone like my mom? That would never have happened. --So I checked everything and finally decided a factory re-set was in order. Just start from scratch, Kristen. Just start over. You screwed it up somewhere along the way, and now it's lost in it's own infinte loop, so just start over. But no. No indeed. Although I have followed the recommended procedure for doing a factory reset, recommended procedures from two other sites aside from the Chromecast forum, mind you, it still comes up as KKB's ChromeCast and won't connect.So, I'm finished with it and frankly, I'm more than a lot peeved about this. I can't return it, I've waded through many many pages of troubleshooting forums and no one seems to have an answer that actually makes it work. I'm now left with a $35 dongle, and I'm just glad the stupid thing was only $35.", "verified": true, "helpfulness": "2/2", "author": "KKB"}, {"rating": 5.0, "review": "It is really a great product, recommend it to anyone how want to cast it's phone content to a tv.", "verified": true, "helpfulness": "1/1", "author": "Mariana Taborda"}, {"rating": 1.0, "review": "WOULD NOT RECOMMENDPROS: Good idea.  The technology seems to be in the Alpha stage.  Its a decent proof of concept but there are huge problems (see below)CONS: Doesn't connect and poor implementationI've looked around at forums and can't find a good solution.  My chromecast is 25 feet away from the wifi router (Belken N, two antenna, extra range and power, over $100 when it was purchased).  The chromecast usually can't connect unless you reset it about 5 or 10 times (soft and hard resets both produce similar results).  My roommate bought a second chromecast and it performed in the exact same way.  There's no interference, the TV is not next to an outside wall, and the XBOX and Playstation get great wifi connection just fine and they're only about 2 or 2.5 feet away from where the chromecast sits.  The worst part is its intermittent so nailing down the problem is difficult and because of that I haven't even tried to send it back.FURTHER NOTES:Youtube in particular has terrible options for tagging mobile and casted videos.  Some videos are only available through a PC, some only through mobile, and some that are on mobile can't be sent to the chrome cast (even though its basically the same thing).  There's not really a way to tell in advance and its incredibly frustrating, the screen will just throw an error leaving you confused.  There needs to be standardization across platforms because in this day in age people want all of the internet everywhere they go, not just whatever the video owner decides to accidently click on in the upload options.", "verified": true, "helpfulness": "0/1", "author": "ANDY G \"ANDY\""}]