[{"rating": 5.0, "review": "Great product - Fast Shipping - Good Price - Easy to set up - We enjoy it very much.", "verified": true, "helpfulness": "0/0", "author": "TMarquez"}, {"rating": 2.0, "review": "Well. This product didn't get to the level of expected quality. It only expands the possibility to display a computer screen on a large tv, but other products can do the job for less money.In summary, it didn't meet my expectations.", "verified": true, "helpfulness": "0/0", "author": "J. Chavez \"tibuix\""}, {"rating": 3.0, "review": "Only missing thing screen mirroring. That's why I return in", "verified": true, "helpfulness": "0/0", "author": "Kenan B."}, {"rating": 4.0, "review": "The chromecast works good if your TV is not a smart TV. Though mines is a smart TV, I use this product to broadcast my Chrome.", "verified": true, "helpfulness": "0/0", "author": "flying_rod"}, {"rating": 5.0, "review": "Great product! For watching netflix, movies and my favorites series.", "verified": true, "helpfulness": "0/0", "author": "Juan Guajardo"}, {"rating": 5.0, "review": "love it! fast streaming. once learned how to stream it was easy.", "verified": true, "helpfulness": "0/0", "author": "Jodi Biasiucci"}, {"rating": 5.0, "review": "These things are awesome! This is seriously one of those \"how did I live without this?\" devices. I do wish it did more general purpose streaming (like desktop mirroring) but there are work-around apps that I haven't tried. The point is, I haven't tried them because realistically I mostly use netflix and youtube which work perfectly. No more messing with plugging in your laptop, or using the awkward netflix interface from a ps3 or Wii. My phone becomes a remote control and is so stinking convenient. For this price, there is no reason not to!", "verified": true, "helpfulness": "0/0", "author": "Nathan Pemberton"}, {"rating": 5.0, "review": "Works very well, and does everything it needs to do such as streaming my media and anything on my phone or tablets.Easy setup and much more cost effective then to buy a smart tv.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"Scottie28\""}, {"rating": 4.0, "review": "Sometimes lags, and makes you reset up everything when connecting to different network. Other than that great shipping", "verified": true, "helpfulness": "0/0", "author": "landon woodrum"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Natália Duarte"}]