[{"rating": 5.0, "review": "Only downside is no remote.  While I prefer to have one less to mess with, guests without Chrome-savvy would no be able to use it without a crash course.  Guest without a smartphone... well it's your fault for having friends without smartphones.Note Amazon Prime and some other content requires tabcast, which I can't do from my iPhone 5 (due to no support for Flash?)  Note also tabcast is unique to Chrome and let's you watch nearly anything on your TV, including obscure live sports sites like NFL2GO.", "verified": true, "helpfulness": "0/0", "author": "Robert O'Connell \"Mr. Consumer\""}, {"rating": 4.0, "review": "easy setup, not complicated to stream. wish it had more options to stream", "verified": true, "helpfulness": "0/0", "author": "Paul mercer"}, {"rating": 4.0, "review": "Good product, I'm a fan of how easy it is to use.  That said, there is trouble casting at times though it's tough if not impossible to know if the source of the trouble is the WI-FI or the Chromecast.  Overall, I like the product and would buy it again.  If it were at a higher price point I maybe a little more hesitant to purchase it again, but for the investment this product is hard to beat.", "verified": true, "helpfulness": "0/0", "author": "JDS"}, {"rating": 4.0, "review": "excellent little piece of technology", "verified": true, "helpfulness": "0/0", "author": "Ivan Rodriguez Z."}, {"rating": 5.0, "review": "I love chromecast.  All we need is more chromecast compatible apps, but I continue to have fun using it.  It is especially great for karaoke parties, as I stream the karaoke videos directly from youtube and we all sing along.  It's worth every dollar and more.", "verified": true, "helpfulness": "0/0", "author": "Dee Jay Pee"}, {"rating": 3.0, "review": "Not what I expected. I have great wireless at home and it just doesn't cut it when you want to screen mirror. For streaming music, netflix, or youtube though, it works fine. After buying this to attempt a cheap screen mirroring wireless set up for my macbook pro, I went out and just got a long HDMI to Mini display cable to plug in direct. So what I'm wired? At least it works. Otherwise, I like having for screen saver alone. The photos Google streams are great and make for nice background. Kinda like a $30 painting that changes.  Meh.", "verified": true, "helpfulness": "0/0", "author": "James Good"}, {"rating": 3.0, "review": "I have a device that does not work on the screen", "verified": true, "helpfulness": "0/1", "author": "MUHAMMED"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Armen"}, {"rating": 5.0, "review": "Awesome product. What more can you say.", "verified": true, "helpfulness": "0/0", "author": "Chris Lynch"}, {"rating": 5.0, "review": "Fantastic tool and easy to use", "verified": true, "helpfulness": "0/0", "author": "Keyla Kercher"}]