[{"rating": 1.0, "review": "We expected a great device based on the reviews. The Chromecast consistently does not connect to our wifi, nor will it show up as an available network. The few times we've actually been able to connect it, it disconnects often. In addition, the streaming from my computer's Chrome browser was choppy even though it came through perfectly on my computer. Unfortunately, we waited too long to decide to return it, so we can't. At least it was only $35.If you want to be able to watch Netflix and/or Hulu Plus on your TV, buy a Roku. We LOVE our Roku and have had minimal issues, all of which are easily fixable.", "verified": true, "helpfulness": "1/1", "author": "Katie"}, {"rating": 1.0, "review": "I have had to set it up half a dozen times already because it keeps kicking off my network.  Its a pain in the butt to have to keep calling the support center and spend 30-60 minutes every time this happens.  With the plethora of streaming devices on the market, I would NOT recommend this for anyone.", "verified": true, "helpfulness": "0/0", "author": "Kathryn A. Griffin \"Kathy G.\""}, {"rating": 5.0, "review": "If you don't have a Roku, Apple TV, Google TV, or any other set top box, this is your answer. Get it!", "verified": true, "helpfulness": "2/3", "author": "R. Baxter Johnson"}, {"rating": 5.0, "review": "An amazing little device! The possibilities are endless - I'm ordering another five so we can have one in each room.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"najemhasan\""}, {"rating": 2.0, "review": "This unit is requires an internet connection to work and will only give you certain applications that do not interest me at all. I can't play and stream my video files or movie collection through it and for this reason I returned it.", "verified": true, "helpfulness": "1/2", "author": "Jose M. Garcia"}, {"rating": 5.0, "review": "This device is outstanding! Simple to connect and use, it has been providing me with hours of entertainment on my television that I could not have otherwise enjoyed - Netflix, Pandora, even YouTube are now huge, high-definition, and in stereo! I can't wait for more options, like HBO Go.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer \"Batman\""}, {"rating": 5.0, "review": "Awesome product.  If you do not hae a smart tv this is the way to go.  No body likes watching movies besides on a plano on a tablet.  This makes the tablet become as large as your tv which is awesome.  Just make sure you have a HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Christopher Hutton"}, {"rating": 4.0, "review": "Product arrived promptly in good condition. Very quick and simple install. Worked after a couple of trial runs. Worth the price.", "verified": true, "helpfulness": "0/1", "author": "ddeguzma"}, {"rating": 5.0, "review": "Does exactly as advertised and you cannot beat the price.  I primarily use it for netflix and HBOGO and I've had zero issues with it.", "verified": true, "helpfulness": "0/0", "author": "MTL"}, {"rating": 5.0, "review": "We stream Netflix, YouTube, Pandora, Songza, and much more to the TV, now. We almost never switch to the other inputs; there's no need! We don't even have cable anymore.Chromecast boots quickly, and very rarely lags.Just get it- especially if you don't have/want cable or satellite. Even if you do, I can't really express how great it is to be able to wirelessly stream almost anything from Google Chrome on the computers, or from most of the apps on our android devices.I really love technology.", "verified": true, "helpfulness": "0/0", "author": "greenjy"}]