[{"rating": 5.0, "review": "I moved away from standard TV companies about a year ago and my family has used a Wii for the past year to stream Netflix and Hulu+ to our TV.  After looking for a backup plan for the inevitable day that the Wii dies I read up on Chromecast.  After receiving it in the mail we started using the item.  First thing I loved over the Wii streaming, the HD quality of the shows.  You can stream from your cell phone or tablet, sometimes we even use our home PC.  You can stream (slower speed) google chromed websites from your PC.  My wife hadn't planed to ever use it, but says she has used it at least once a day ever since we got it.Pros: HD quality, easy to useCons: If you have an older phone that cannot update to newer firmware (mine is an older phone that cannot update past gingerbread) you may be able to run the Hulu+ app on your phone, but it is a version of that app that cannot stream to chromecast.  Guess it might be time for a new phone.Con:  If you have kids that want to control what you are watching, we find it easier to have it on the Wii, I don't need chocolate and jelly all over my phone (my 5 year old taught himself how to stream from the PC though)", "verified": true, "helpfulness": "0/0", "author": "Son of Archness"}, {"rating": 5.0, "review": "When I first got my Chromecast it was not very stable with the wifi connection, however after moving the CHromecast to an MHL HDMI port on my tv it works great and never drops a connection.", "verified": true, "helpfulness": "0/0", "author": "P. Demers"}, {"rating": 5.0, "review": "So convenient and tiny I recommended this product to the fullest. Great product google hopefully in the future you guys will add more apps.", "verified": true, "helpfulness": "0/0", "author": "TH821"}, {"rating": 5.0, "review": "I bought this for my husband for our anniversary. We absolutely love it! We are now canceling our cable box in our bedroom.", "verified": true, "helpfulness": "0/0", "author": "ThisIsNotAnExit"}, {"rating": 5.0, "review": "This is my second Chromecast, and I will be buying a third.  I wish the seller would have done a factory reset though...just laziness I guess.  But the Chromecast works perfectly.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This simple little device is a marvel that transfers your laptop screen image and sound to your TV.  A few years back, such a low cost, easy to use product would have seemed like magic to many consumers.  Today it is a reality thanks to Google.  Takes seconds to install but software setup can take some time and you must have the Chrome browser installed on your computer to use the device.  Range of device is good too - works fine with computer 25 feet distance from TV.", "verified": true, "helpfulness": "0/0", "author": "Aruba"}, {"rating": 4.0, "review": "I got this as a gift from my husband and it has been a gift for me as well. It is great for Netflix and YouTube videos. It's nice for travel, so you can watch things on your hotel TV instead of the laptop. It doesn't work with just any video however, so it's not as versatile as expected.", "verified": true, "helpfulness": "0/0", "author": "Ellen Educator \"educator\""}, {"rating": 5.0, "review": "Pluged it in and functions great had it for about 2 months still works great really easy to install... really recommend to people who dont have a smart tv :)", "verified": true, "helpfulness": "0/0", "author": "Brian Christman"}, {"rating": 2.0, "review": "I have FULL signal for it to stream thru and I have to continually stop casting and recast bc of a bad connection", "verified": true, "helpfulness": "1/1", "author": "andrea arnowitz"}, {"rating": 2.0, "review": "This device has so much potential if it could work consistently.  Unfortunately, it has been nothing except a consistent headache.  I continually have to attempt to re-connect the device to my wireless network, which wastes lots of time, but only infrequently actually allows me to use the device as intended.  It give a myriad of error messages which indicate its glitchiness.  When it works, it's a very useful item to have (the Youtube content alone would be worth the cost of the device).  However, the fact that it can never be counted on makes it more bother than it's worth.  The technical support personnel state that the maximum distance the device can be placed from the router is 25 feet.  Unfortunately, that does not work for me, and undoubtedly for many others.  I will wait for an updated version which actually has a usable range, or switch to a Roku,which I understand has far better range.", "verified": true, "helpfulness": "1/1", "author": "Eric Kennerk \"hail2mary\""}]