[{"rating": 4.0, "review": "Google is working on more apps to add which is great. A down side is that mirroring needs some work; drops often.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Bottom line: Before purchasing, check the minimum system requirements on the Chromecast website.Casting from Chrome Browser Tab: I'm running Windows 7 Professional on an Intel Core 2 Duo processor @ 2 GHz with 3 GB RAM and Chromecast is VERY choppy and freezes up. My computer also sounds like an airplane getting ready for takeoff. For Windows Vista, Windows 7, and Windows 8, Google says you need an Intel Core i3 or Core i5 processor (respectively) to stream standard or high quality levels. You should also have a relatively fast internet connection. I thought I could get away with a Core 2 Duo but it does NOT work.Casting from iOS Device: Casting from my iPhone 5 was easy enough. No separate setup is needed for my iPhone since I took care of that when I set up my computer. Upon downloading the Chromecast app and opening it, I'm prompted to open either the Netflix or YouTube apps. I assume there are other apps to use, but these were the only two available to me. Streaming is less choppy than through the Chrome broswer, but video quality is poor.If you have a computer with a solid CPU and a fast internet connection, Chromecast should work for you. Otherwise, you may want to look elsewhere.", "verified": true, "helpfulness": "0/0", "author": "Ben B. \"History Buff\""}, {"rating": 3.0, "review": "Wish that is could stream more. there are limits on what it can steam. I cannot stream my own content.", "verified": true, "helpfulness": "0/0", "author": "Maxx"}, {"rating": 5.0, "review": "Wonderful!It is the perfect way to make a regular TV on an smart tv.I highly recommend it.Thanks Google!!!!", "verified": true, "helpfulness": "0/0", "author": "Grisell Granell"}, {"rating": 2.0, "review": "I was under the impression anything on my screen would be cast to the TV. Also on some systems there is a sound lag, or it doesn't cast the sound at all. I didn't know this product was so limited in what it could cast to the screen. It only works on 8 or so programs were sound and video sync together. Sad google just sad.", "verified": true, "helpfulness": "0/0", "author": "Duke"}, {"rating": 1.0, "review": "False advertising.  The device works with a very limited selection of devices.  It's worked with my friend's Ipad but I can't \"cast\" movies from my computer for more that 20 seconds. I can't connect with my Kindle Fire.  It doesn't work with Amazon.  Why is there not a list of supported devices in the advertising?  Why is there no customer support for a product that is not really plug & play.  What a waste of money.  I'm hoping it's not too late to return it.", "verified": true, "helpfulness": "3/4", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought one of these for my wife for Christmas.  She likes to watch movies but doesn't like to store and handle all the DVDs.  I thought we could use it for the thousands of Netflix movies.  I spent a week getting it to run. I phoned tech support (offshore) several times and exchanged many emails.I was also hoping to use it to display internet screens from my Samsung android tablet but found android tablets aren't supported. You can start a movie from the tablet but you have to use the tablet to stop or pause the movie.  It was only $30, but the poor design features and very poor support are killers.  I expected more from Google than that.  My wife hates it.", "verified": true, "helpfulness": "2/4", "author": "Richard R. Dupree"}, {"rating": 2.0, "review": "This sounds like a great idea, and it probably is...  IF it worked.I was told after contacting Google that Chromecast didn't work with my router.  I use Verizon and it's hard to believe that with the size of their (Verizon's) system this router is not supported by Chromecast (Google).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I mainly bought this because I do not have a brighthouse box in my sons room he is 20 m onths.  I wanted him to be able to watch sprout so I utube it though this device and I dont have to have a second cable box.  I", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jenn\""}, {"rating": 5.0, "review": "The Chromecast is great! I quickly and easily take it off the TV and use it anywhere that there is Wi-Fi.", "verified": true, "helpfulness": "0/0", "author": "James R. Gwartney \"Phone guy\""}]