[{"rating": 4.0, "review": "My biggest gripe with the Fire is that I had false hopes for the product. I hoped that, with a flawless voice search, I could search across all apps for the one movie I want to watch. Instead, performing a search only pulls up videos from Amazon. If these videos aren't Prime ready, you pay for them. There is no notice that you could watch it for free on Netflix.If you put out a device that supports competitors, don't do a disservice to everyone who wants an all in one focused device. This is an Amazon focused product through and through. Netflix, Hulu, etc, are all side notes on a wonderful device.All I want is for the device to search through all of my streaming products and offer me a variety of ways to watch what I want to watch. It's all there already, just create that much needed bridge.", "verified": true, "helpfulness": "2/2", "author": "Dave Bentley"}, {"rating": 5.0, "review": "turns an older tv into a smart tv instantly love it!!  love the continue play feature when watching a series on netflex or amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Jason A. Pool"}, {"rating": 5.0, "review": "I own a Roku 3 which has been great too.  Each device has a different application for my use and I would repeat my choices again.  I believe Amazon is the best place to shop and I will continue to pour my hard-earned money into this company because they have such excellent customer service and great prices on everything I shop for.", "verified": true, "helpfulness": "2/2", "author": "Sweet Pea \"SJ\""}, {"rating": 5.0, "review": "Love this product, a friend told me about this and I am very happy with it, if I can just get Amazon Prime to work on it, will make me real happy.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "While the Amazon Fire works faster than the Roku, it is way too easy to accidentally buy movies. While trying to watch two movies, I accidentally bought them. Before a purchase can be made, there should be a double confirmation process so people don't make this same mistake (I can't be the only one this has happened to). I will be returning them as I didn't really want to own them, just watch them. Also, the picture quality is much better than the Roku, and the voice search feature is great but doesn't always understand my voice but if I speak slowly enough, it works.", "verified": true, "helpfulness": "1/1", "author": "David K. DeSilva"}, {"rating": 3.0, "review": "searches aren't that great- certain apps are included in the search, not netflix, but I have seen huluplus included in some searches- can search genres, actors, titles- can't search by ratings- certain searches, like \"romantic comedies on Amazon Prime\" or \"Horror Movies on Amazon Prime\" or \"Top rated games\" doesn't work correctlyBasically, searching isn't all inclusive, and definitely not contextual, however I find the voice recognition works great for me in terms of recognizing my words, however it doesn't understand my 5 or 4 year old.Interface is clumsy and laggy, even when parsing through the settings at the bottom of the interface, which shouldn't be the case if this thing has a snapdragon 800 in it.It doesn't turn off per say, just goes into a standby mode, pros for some, cons for others, personally I don't care since mobile platforms expend very little energy anyways.Doesn't come with an HDMI cable, and I already knew that from the description, but I don't understand why not just include it so the customer has everything he/she needs in the box. It comes with batteries from Amazon, why not have an HDMI cable from Amazon included as well?It's an emerging platform and I'm sure developers will develop more apps for it, but right now the App store is very tiny.I bought it because it has more functionality than a google chromecast and a roku 3 and I'm hoping it will continue as the app store matures.Controller is very light weight and has a nice rubbery texture, personally I don't like the layout, but it's probably because i have huge hands.The Netflix App on the platform seems very basic, like the one the PS3 had when it first launched, but I'm hoping in time that it will improveReally looking forward to the kindle free time features they're adding, hopefully that will be sooner than later.TL:DR versionIt's a great platform, still some bugs, but feels more like a beta product thoughFeedback for amazon:for the remote- make the remote square, and put the buttons on the sides of the circle wheel, or move one of the rows to be above the circle but underneath the voice command button.- interface needs vast improvements, as in ability to sort by genres, type of media, and whether it's prime or not- how about a phone app to act as a controller, that would be awesome- pairing with a moga pocket or making a smaller amazon controller- contextual searches would be awesome, as well as the ability to specifically search one app for content- I'm hoping there is a standardized API for app developers to access the voice commands, that would be useful- what about adding a silk browser to the boxEDIT on 5/22/14Storage is significantly insufficient.Example, I have these apps:- Asphalt 8 ~1.5 GB- Fist of Awesome - under 10 mb- MineCraft - under 10 mb- Netflix ~ 200 MB- Pandora - under 10 mb- Reaper - under 10 mb- Sev Zero ~200 MB- Sho Anytime - under 10 mb- Smithsonian Channel - under 10 mb- Youtube ~200 MBI install GTA San Andreas and it tells me to download more content (2.46 GB). I do, and the game will run, but then I try to run Netflix and it tells me that there is insufficient space to run the app and that I need to delete some content.Desperately need a way to add external storage, that 8gb ain't going to cut it.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer \"with nothing special to say\""}, {"rating": 5.0, "review": "So far, the Fire TV is everything I expected - and more!  I finally am realizing the true benefit of my Prime account...", "verified": true, "helpfulness": "0/0", "author": "mntnman33"}, {"rating": 3.0, "review": "I have many set top boxes. It's part of my job to have a handle on these things. The setup experience was painless and awesome, especially since they already had it tied to my account. After watching the intro video, I decided to have my wife try out searching by voice. We picked a name that wasn't as easy as \"Hugh Jackman\" (what they use in the intro video), but something that wasn't unpronounceable either. We picked \"Keanue Reeves.\" It kept suggesting \"Kiana Reeves.\" Thinking it was her voice, I tried and got the same results. Not a huge deal.But then I wanted to watch House of Cards, and was shocked to discover that the voice search ONLY searches Amazon's library of content. The Roku 3 will search ALL services to show you which ones are free, and what the prices are of the paid ones. That alone is worth it, plus the Roku 3 has more apps available to it as its been out longer.This is a great box, by all stretches and it will only get better (more apps) since it's based on Android. But with the one big feature limited to only Amazon's library is a huge flaw in my book. Save $5 and get the Roku 3. Plus you don't even have to point the Roku remote - it works on RF.", "verified": true, "helpfulness": "4/7", "author": "Mainframe"}, {"rating": 3.0, "review": "I thought I had found my streaming box for all of my needs.  I've become accustomed to viewing my google play purchases by making them a favorite on YouTube and then they are listed on my streaming devices.  I was able to play these Purchases on the Roku 3, but Amazon has found a way to block them.I am a big fan of the user interface, but content is king, and the Roku wins on this alone (although it lacks in the UI, but would still rate a 4 for me overall).Amazon missed its big chance with me on this box, but I still prefer to purchase videos through google play for the reasons listed above.Prime UserAmazon Cloud UserAmazon MP3 User", "verified": false, "helpfulness": "3/3", "author": "Kelso"}, {"rating": 5.0, "review": "I love this so much.I had my Kindle Fire attached to my semi-smart TV. This semi-smart TV is one of the first that connected to the Internet via cable. So it requires a hard line (RJ45) to connect. I used my Kindle Fire to stream High Def videos, music, and such through my Kindle with the micro-HDMI cable. I alot of getting up and swipping and poking around on the Kindle to get movies and shows up. But, I didn't mind....if only they had a box...? They do!Got the FireTV, swapped out the cables, connected my FireTV and BAM! I'm watching the same things but so much easier with the remote control and voice search.Speaking of the voice search, it works perfectly for me. How did they do that? I do have a non-regional dialect, not sure if that matters. I wonder how it works with other dialects? Anyway, it works perfect for me, better than \"Sri\" for that matter.I would love to stream news channels. I'd love to have my kindle books on the cloud so I can read on my giant TV...is that too much? HBO Go, I'd love.Yes. I love this product. I'm shamelessly in love with Amazon. Sometimes I feel funny inside because I love it so much. But, if it feels this good, it can't be bad? Right?", "verified": true, "helpfulness": "1/1", "author": "Christine E. Lee \"christineeve\""}]