[{"rating": 4.0, "review": "So I bought this device in order to stream stuff on putlocker, nbaliveonline, solarmovie, and free project tv. I had a lot of problems to start with especially with Chrome running on windows. First off, When the Google Cast extension is added for my windows x64 system, by itself it's not a big deal, but when it goes to websites like Solarmovie, it goes INSANE on my CPU - it runs it at 100% and I thought it was because of the loading (it's not), even when the loading of the video is done, the CPU is still running 100%. I thought this could be a spyware issue, so I ran my anti-spyware software, deleted all my cookies, temp files, etc - made no difference. Also the CPU was not affected after I turn on/off my adblock plus, so it's not that extension. What I found out was this was an extension issue of Google Cast - when I turn it off, my CPU goes back to normal. Note also, I am running an older computer (running Intel Celeron 925 @ 2.30 Ghz). So this is a huge issue, because my stream on my tv is TERRIBLE, consistently skipping!So I switched to my android tablet, which has a Dual core, 1000 MHz processor. I searched through the forums to download an app called \"Web Video Caster\" and downloaded it. Then I streamed solarmovie, and BAM! works like a charm!", "verified": false, "helpfulness": "0/0", "author": "Peazfool"}, {"rating": 4.0, "review": "ok to use.  Can't use for web surf", "verified": true, "helpfulness": "0/0", "author": "LP"}, {"rating": 5.0, "review": "Perfect for those who really only use their TV for netflix and hate the stock app in the TV.", "verified": true, "helpfulness": "0/0", "author": "Dan3698"}, {"rating": 5.0, "review": "Good good entertainment", "verified": true, "helpfulness": "0/0", "author": "Delmy giron"}, {"rating": 5.0, "review": "it is Great!!! excelente producto!!!", "verified": true, "helpfulness": "0/0", "author": "Kosuko"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "sanmanbob"}, {"rating": 1.0, "review": "Don't waste your money on this product, it's features are going downhill. Google does not even support their own product... Google's latest Photos app does NOT include Chromecast support, while the previous version did. How can you take Chromecast seriously when Google removes support for their Chromecast product from their own Photos app? I'm now very sorry that I purchased this product. Google should be ashamed for removing support for their own product, and there is NO good excuse for it (as if Google would ever even offer an explanation).", "verified": true, "helpfulness": "0/0", "author": "Don Joslyn"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Robert S. Widner"}, {"rating": 5.0, "review": "Works great.  Bought it as a way of watching Netflix in my bedroom without having to buy another gaming console.  The streaming pictures when not in use is a nice touch.", "verified": true, "helpfulness": "0/0", "author": "Korey Kleinsorge"}, {"rating": 4.0, "review": "I bought this product for be used in Chile. The problem is a apps restriction, but in general, the chromecast works perfect. I hope more apps and less restriction!", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Villalobos \"Rodrigo V\""}]