[{"rating": 1.0, "review": "Does not responed when talking into it.", "verified": true, "helpfulness": "0/3", "author": "Donald Robertson"}, {"rating": 4.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Xlnc04"}, {"rating": 5.0, "review": "its great", "verified": true, "helpfulness": "0/0", "author": "Michael R Bertraw"}, {"rating": 4.0, "review": "Great if you are looking for Amazon only / Prime content. However, there are subtle but important capability differences between this and a laptop / HDCP compliant computer's ability to locate and view video content. For starters the landing screen may look pretty but is not very functional, voice search is a nice touch - but not applicable to non-Amazon content and even for content free for Prime members - the fireTV at time shows that the content has to be purchased. However, if you start streaming from your laptop and then pause and pick it up on your recently watched list - FireTV seems to get a clue. Overall, a nice handy device with a significant scope for improvement.", "verified": true, "helpfulness": "0/0", "author": "Rudra N. Das \"Geek-sei\""}, {"rating": 5.0, "review": "Love amazon fire! Love the voice recognition. I have Apple TV also and like amazon fire better!", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 4.0, "review": "1st type of box like this so nothing to compare to.  But I have had it for about a month and like it very much.", "verified": true, "helpfulness": "0/0", "author": "Eric Christophe Hart"}, {"rating": 5.0, "review": "Love this for XBMC so far the best device to run XBMC on run smooth, fast and flawless thanks", "verified": true, "helpfulness": "0/0", "author": "Sam \"Sam\""}, {"rating": 5.0, "review": "Love it better than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Belinda Rodriguez"}, {"rating": 4.0, "review": "After a few months with the device I am pleased. It's extremely fast and content is pretty much instant. If there are any \"con's\" I would have to say that it is a lack of available app's for the device. You can side load xbmc no problem and may android apps will work on the device but content from the approved app store is minimal.", "verified": true, "helpfulness": "0/0", "author": "Jack Carpenter"}, {"rating": 1.0, "review": "I bought this to replace my cable TV platform, however, you are still required to have a cable subscription to use many of the Apps that are used on Amazon Fire TV.  For example, Disney Channel, ESPN, History Channel and many more all require an active cable subscription in order to use them.  It kind of defeats the purpose of getting an Amazon Fire TV.", "verified": true, "helpfulness": "3/5", "author": "Chris McNamara"}]