[{"rating": 4.0, "review": "I love it , & it's VERY easy to use!", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 1.0, "review": "VERY MISLEADING. You can not use IPad to stream Internet to your T V......only Mac laptop or desk top. You need a Google cast extension for Google browser and there is not one available for IPAD....don't know why...but it sure sucks.", "verified": true, "helpfulness": "0/5", "author": "G L"}, {"rating": 4.0, "review": "Great accessory from Google!It allows you to mirror your Android devices, send videos to your TV, send videos to your TV queue, send netflix movies to your TV, listen to music and others.The setup is pretty straight forward for a normal and common home network, don't try it to do it on a hotel network, it does not support logins.One thing I didn't like is that I have to activate the Google+ photo auto backup to stream the photos to the chrome cast, I ended doing a screen mirror.The Mac OS X support sucks.There is no way of doing proper video streaming to the chromecast from videos stored on the device.Conclusion, a must to have!", "verified": true, "helpfulness": "1/1", "author": "Andres Monge \"JAM\""}, {"rating": 5.0, "review": "Working great", "verified": true, "helpfulness": "0/1", "author": "Ricardo G."}, {"rating": 5.0, "review": "Works well with my HTC One -", "verified": true, "helpfulness": "0/1", "author": "Todd S."}, {"rating": 5.0, "review": "Works great. You have to configure a few things to get the right settings for your TV. I maxed everything and it ran very smoothly. 1080 HD quality. Forgot what the settings i put but the beta version really gives out the better quality.", "verified": true, "helpfulness": "0/0", "author": "AmzinReviews"}, {"rating": 5.0, "review": "this was a gift to our daughter.", "verified": true, "helpfulness": "0/0", "author": "marij"}, {"rating": 3.0, "review": "Well, Chromecast is a cool concept; however, it does tie up one product to use the Chromecast.  IE you have to use your phone, tablet, or other device to use the Chromecast.  This isn't normally a problem, unless you consider that using your phone/tablet ties that item up until you're done using the Chromecast; however, with Amazon or Roku, you can use that product to view whatever it is you're wanting to view, and not tie up your phone/tablet.  Something to consider.  Had I known this, I could have gone for the Amazon product.. or Roku.", "verified": true, "helpfulness": "0/0", "author": "Bill Hickman \"Big dawg Herk\""}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "mohammed"}, {"rating": 3.0, "review": "I've owned this since it came out a few years ago. It worked great for a while. I bought a Netgear R8000 router because i thought my wifi signal was weak. (free chromecast with purchase)Well the the problem is to much interference @ 2.4 ghz frequency in my neighborhood. I have over 20 2.4 ghz routers around my house so all i get is this thing searching for data all the time. For the price I cant complain but it doesnt work even for streaming music on my home theater. Im going to purchase the Nexus Player because it supports 802.11ac.", "verified": true, "helpfulness": "0/0", "author": "philip1000rr"}]