[{"rating": 5.0, "review": "For me as an Amazon prime member it doesn't get better then this. I love the voice response from it. I ask and its there. Setting up was easy I have it connected to the Ethernet cable. It is easy to use and navigate with, and when it's paused for a break it has a great screen saver.", "verified": true, "helpfulness": "1/1", "author": "Geno70 \"Gene\""}, {"rating": 4.0, "review": "This was easy to set up and is great for finding movies you want to watch.  Also gives a platform for Netflix -- so we have a lot more options to find and watch the shows we want.", "verified": true, "helpfulness": "0/1", "author": "Margie"}, {"rating": 5.0, "review": "I have been a member of Prime TV for a little over a year and what better way to watch it than this Item . plus I get a whole lot other apps. as well I will recommend this to my friends and already have to family members!", "verified": true, "helpfulness": "0/0", "author": "Barry"}, {"rating": 4.0, "review": "I am really surprised as to how well and how easy it is to use Amazon Fire TV. Also all the choices of different programing makes this an excellent choice to have in all homes.", "verified": true, "helpfulness": "1/2", "author": "Roberto Guerrero"}, {"rating": 3.0, "review": "Been a Roku user for years and I guess I miss my old menu.The Amazon has many good features (as advertised) so the 3 stars is not because of what it does well, its what it can't do that the Roku can.1. Choice of \"Other\" channels is VERY VERY LIMITED and THAT really leaves me regretting the purchase! Oh you can get Netflix (got it) but with Roku there are Hundreds of other channels to tune in - The Amazon Fire has 6 categories: Entertainment has 42 choices (Seems good) many are stupid things like fish tanks, fire places, and rainy day screen - Sad really,  finance has 6 choices, Games/Music 6 each, News/Magazines total 6 and Sports has 6 choices - and most stuff is not free, not even a Weather station. Their arrogance to think we are satisfied watching only their channel is obvious.2. To get anything other than Amazon you actually \"Download\" the station/game/app into the Amazon Box *hence the 500 gig commercial for Amazon's Fire TV. humm that means it can get full - Roku does not \"get full\"3. The Menus are oddly grouped and separated: My watchlist has TV and Movies all in the same list THAT IS REALLY ANNOYING! In Roku TV is separate from Movies making it that much faster and easier to browse. There is a TV section that has a Subsection called: My TV but the TV shows I put in my \"Watch List\" don't show-up there. IT's just odd - it's NOT conducive to user friendliness.4. You can't see \"All Prime\" (you can in Roku) You can't break the Prime movies into genera, if you go to \"Movies > then \"Genres\" section you can see only movie titles of that type however only 1 or 2 and some No Prime movies will be listed ONLY movies to BUY - greedy, very very greedy! And, each genre only has 140/150 choices - doesn't that seem a bit weak considering they have tens of Thousands of titles?5. WHAT is Good a. The microphone works perfect - you just need to know what you want already - DOES not follow commands like \"Browse Action movies in Prime\" or \"My  TV watchlist\" or \"Go to Netflix\"  Now that would be something to write home about. Finding a movie title is no big deal my \"Dictionary\" app on my phone can find any word and define it in a couple seconds too.b. because it is an Amazon product it has a \"Photo\" choice in the main menu: any Pic uploaded to amazon cloud via ipad or a-like device, *Kindle Fire is automatically connected, can be viewed on your TVc. IT STREAMS THE MOVIES in Excellent fashion - no complaints there, very nice quality HD is awesome I have a Sony Bravia 47\" 720/1080i TV)d. The Box is very Small (cool) - but it gets HOT (scary) - where's the ventilation (weird) - makes me worrye.  ScreenSaver images show up if movie is paused or just sitting stagnant in menus too long - The photos are amazingly beautiful... and new ones keep showing up - I've actually just sat and watched them scroll by zooming and panning as they go - WHERE's the setting to make it do that on command? and stay there?????? IT fades to black after 5 minutesf. Games - Yup it has games - really just another revenue stream for Amazon, Most games have fees and will force you to buy their game controler - there are a few that your remote can control and are free So its not a complete disappointment. I will never buy a game controller so I can't comment on the quality of any thing except the free game I downloaded - Its fun and addictive Yup its a game. 2 StarsQuality Workmanship (1) Streaming Movies (2 & 3)  humm I can't find a 3rd reason to give Form & Function (No),  Price (No - new Roku is same),  Works as Advertized (No)", "verified": true, "helpfulness": "1/2", "author": "D. GILBERT \"Serious Shopper\""}, {"rating": 5.0, "review": "This is the BEST of the BEST when it comes to streaming media devices. The only thing it lacks is a port for your USB to play other media. The voice search function ONLY works within the Amazon media and NOT the Netflix or the Hulu or other applications so be careful. What sucks is the number of movies and TV shows that you have to pay for in Amazon which are included in your subscriptions in other media like Hulu or Netflix. The device itself works well for pictures and the screensaver function is pretty cool too. AGAIN you will have to pay for those in the Amazon cloud or with Amazon Prime and Amazon is very pricy compared to the other applications. The unit is sleek and I can stream easily on the wireless functionality without any lag in speed.", "verified": true, "helpfulness": "0/0", "author": "SoCalMark"}, {"rating": 5.0, "review": "I debated for a while if I should get this product.  I am no sorry that aI waited for it.  It is everything I wanted and more.", "verified": true, "helpfulness": "0/0", "author": "KarlO"}, {"rating": 4.0, "review": "Recently, I received an offer to try out the new Amazon Fire TV for free for 30 days. Being a loyal Amazon customer and a lover of all things tech, I decided to give it a try. Now, I have several Roku boxes in my house, a media server, a Raspberry Pi running XBMC, and Logitech remotes to control everything. Being very comfortable with the Roku systems, I expected the Fire TV to be very similar.Well, it is and it isn't. First off, let me say that the device itself is a nice piece of hardware. It feels very solid and well put together. On the back are connections for power (duh!), HDMI, Optical audio, Ethernet, and a USB port. The included remote is small and is very similar to the Roku remote. Setup was a breeze and I was able to start using the device in less than 5 minutes. Amazon had the device pre-configured to my account so I didn't even need to do that portion of the set-up process. The included remote is pretty cool and the voice search feature worked flawlessly for me.Load times are very fast compared to my Roku 3 (which is pretty fast also). This is because the Fire TV uses a quad-core processor and the Roku has a dual-core. Once a video is playing there is virtually no difference in the players as playback is very smooth with both. There do seem to be plenty of apps for the Fire TV and they are always adding more. While there may not be as many apps on the Fire TV as there are on the Roku, Amazon is constantly adding more and even recently added HBO GO to their line-up. If you are a fan of PLEX I will say that it looks amazing and is much closer to the PLEX home theater software than the Roku app. I was almost willing to keep the device for this reason alone.Now for the bad. The interface isn't nearly as polished as the Roku's. There were a couple of times where I thought I was in one area only to realize that I needed to back out and start over. The layout is a bit confusing but after playing around for a bit you get the hang of it. The main drawback (for me) was the lack of any type of IR support. This means that you are forced to use the Fire TV remote. As someone who uses Logitech remotes throughout the house, this was a deal killer. I even tried plugging in a USB IR receiver but it didn't work.Overall I think that the Fire TV is a great little device and maybe with either a software upgrade or when the next generation comes out it will be THE streaming box to have. For now, at least for me, it's not quite there and needs to catchup to the Roku.", "verified": true, "helpfulness": "2/2", "author": "F. New \"Nurse Practitioner\""}, {"rating": 5.0, "review": "The Amazon Fire TV is great, we love it! It loads extremely fast (both apps and video) and has a good app selection.The remote control is amazingly intuitive! You don't realize how bad most remotes are (yeah ok, I guess we all do know that most remotes suck) until you use one that is done so well! I love that in most apps, clicking the big round button pauses and starts the video and in some apps (e.g. NetFlix), you can easily navigate frame by frame by clicking the outer circle.The remote combined with the user interface is just right. Even entering data with the onscreen keyboard is reasonably painless with this remote, while I loathe doing so on other devices (I'm looking at you XBox!).There is room for improvement:- The killer app for Fire TV won't be voice search working with other apps, but integrated search that returns results from all apps, not just Amazon.- A browser app would go a long way to provide access to anything apps can't do.- OMG Amazon, let me skip the pointless intro video!!! Instead, any button I clicked on the remote did nothing or started it over. At least if it had useful tips, but it was all the info I already knew from the product page before I bought it. Just let me skip it already!", "verified": true, "helpfulness": "1/1", "author": "Dennis"}, {"rating": 5.0, "review": "This is great, I'm glad Amazon offered a 30 day free trial. I probably would not have ordered this otherwise, but I am glad I did. I just love it.", "verified": true, "helpfulness": "0/0", "author": "Sylvia"}]