[{"rating": 2.0, "review": "Doesn't work with iPad 1 and won't connect to a guest network that you must \"accept\" conditions to join, so for me it does not work.", "verified": true, "helpfulness": "1/1", "author": "Buddra"}, {"rating": 5.0, "review": "This is one of those things hat you have to have if you have an android device and an HDTV. Can stream content from multiple apps right to the big screen by simply installing an app on your device and plugging Chromecast into your TV. I love it!", "verified": true, "helpfulness": "0/0", "author": "James Faulkner"}, {"rating": 5.0, "review": "It works just as promised! Watch Youtube and Google apps on the TV, works great with an android phone! $35 is really a great price.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Fain"}, {"rating": 5.0, "review": "I use this exclusively for streaming Netflix from my phone. For that purpose it works great! I recommend if you watch a lot of Netflix on your phone or tablet...you can upgrade to watching on your TV with this nifty device!", "verified": true, "helpfulness": "0/0", "author": "Vincent W."}, {"rating": 5.0, "review": "Easy to install and use. Within 10 mins I was playing. Great price with such utility. Recommended to several people already.", "verified": true, "helpfulness": "0/0", "author": "gcb453"}, {"rating": 4.0, "review": "This device replaces the tablet I had to allow wireless streaming of videos to my 720 HDMI TV, and does it better and easier for most  features!While there are is a limited number of streaming services currently supported, with Amazon currently not one of the services supported. However, there is a solution that may work for some people: tab/screen sharing from a PC.Netflix and Youtube work very well. One of the big advantages with the Chromecast device is that it completely fills the screen, instead of letterboxing the way all my other HDMI devices play.Unexpected things that I really like about this gadget:1) sound control remotely (does not control TV volume control, but can set a range of quieter volumes withing the TV volume.2) can not only take control from another device, but it is very good about sharing between devices: I was able to play/pause/control/switch from phone, tablet and laptop at the same time.3) Very easy setup4) In 'idle' mode, screen saver is a slow changing collection of stunning pictures, which show off the device and shows the great quality of the TV as well.Set-up was quick and easy with my phone. The device starts up as a wifi server. After connecting, you enter just a few details, then the values needed to connect to your local wifi. It quickly downloaded the update, and a quick reboot later, it was running!I had to update a few apps, and install a driver on my laptop for Chrome Browser. This added the new icon to my apps and Chrome Browser.On the Chrome Browser on a PC, you can have the system display a copy of any one tab. Here is the great thing: you can hide the tab behind other tabs or other programs, and Chromecast will continue to show whatever is happening on the hidden tab!It did warn me that my network speed may impact the quality of what was being displayed.I would give the device 5 stars if it had more streaming/sharing services and wasn't quite so locked down from 3rd party solutions.The only other thing is that you must have a smart device to control the player. There is no ability to use it with a simple remote control that some players offer. However, the price for the features more than makes up for the few things it does not do well - or does not do yet.One more quick note: the device does not get power from HDMI, you must plug in the USB cable at the end for power. It comes with cable and wall transformer. If you plug it in to your TV, you may find that it turns on and off with the TV, and the Chormecast short start-up time is just long enough to plug it into the wall power.", "verified": false, "helpfulness": "0/0", "author": "Mr. WitzAbout"}, {"rating": 2.0, "review": "What I want is a device that will replace my long HDMI cord between a laptop and a large TV.  I want to share spread sheets, Word documents, presentations.  There is more to life than Netflix, where are the Amazon movies, Hulu Etcetera.Nice first attempt but needs critical care prior to death.", "verified": true, "helpfulness": "1/2", "author": "James L. Busselle"}, {"rating": 5.0, "review": "Not used it as it is a Christmas gift to me from one of my kids (I'm not supposed to know).  LOL.Brother in-law has one.  Watched it working while I was in the U.S.A. with him.  Very cool.  Hope it works as well in Canada as it does in the states.Decent price at about $35.00.", "verified": true, "helpfulness": "0/0", "author": "Rod"}, {"rating": 5.0, "review": "Easy to use. Easy to move between sets.  It gives us a lot of flexibility in our viewing choices, so we're not locked intoany one location for viewing.", "verified": true, "helpfulness": "0/0", "author": "e"}, {"rating": 3.0, "review": "I first thought I could play all my music and video's using this devise, that's not the cast.  Some new apps have become available like Netflix but the movies are not current.  Hopefully is will change.", "verified": true, "helpfulness": "0/0", "author": "Steve & Karen"}]