[{"rating": 4.0, "review": "Amazon Fire TV is a pretty sweet gadget. I love the fact that I can access all of my Prime media on the big screen now and my Netflix, etc. The only nit I have to pick is that the remote is a bit touchy. When you are entering text for account passwords or scrolling through selections it will frequently jump multiple spaces no matter how carefully you press the navigation ring. Voice search is pretty darn accurate and makes finding movies and songs a breeze.", "verified": true, "helpfulness": "0/0", "author": "CanonInBama"}, {"rating": 5.0, "review": "its a good box for what you can do with it.well worth the price and fast as well as quad core good deal.", "verified": true, "helpfulness": "0/0", "author": "Tony Haboush"}, {"rating": 4.0, "review": "Great buy would've given 5 starts but remote batteries die to quickly", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "People can talk all they want about what set top box is best. But seriously it is all a matter of preference. I think the amazon fire tv has the best interface, it looks good and it fits within a huge ecosystem. Biggest downer though is the search only works within the amazon prime tv not hulu or netflix. Not that big of an issue though since everything is super snappy and quick.", "verified": true, "helpfulness": "0/0", "author": "Herschel Ott"}, {"rating": 5.0, "review": "Love this!!", "verified": true, "helpfulness": "0/0", "author": "Tcsjh"}, {"rating": 4.0, "review": "Would be a five star if there where more Prime movies", "verified": true, "helpfulness": "0/0", "author": "klgooch"}, {"rating": 4.0, "review": "Responsiveness is good, and I like the voice recognition search.Drawbacks:It would be nice to be able to create profiles that are linked to different Amazon accounts. I have my daughter on her own account with her own credit card.Also, it would be nice to be able to access my google play account on the Fire TV, but that might be asking for too much.", "verified": true, "helpfulness": "0/0", "author": "Eric P Anderson"}, {"rating": 5.0, "review": "Love it! Wish the Amazon Music could be done on TV without having to load from a computer.", "verified": true, "helpfulness": "0/0", "author": "Kyla Groll"}, {"rating": 4.0, "review": "It runs great, however, the set up was problematic.", "verified": true, "helpfulness": "0/0", "author": "Yelena Chubrikova"}, {"rating": 5.0, "review": "This was a gift but the feed back from the recipient was very high.", "verified": true, "helpfulness": "0/0", "author": "eidelweiss"}]