[{"rating": 3.0, "review": "I bought this stick to stream videos from my phone. After researching online I finally figured out how to. It's OK, it works great I just don't like the fact that I have to use my phone/ tablet to work it. Would be great if it came with a remote", "verified": true, "helpfulness": "0/1", "author": "A.Pace  love  this game"}, {"rating": 5.0, "review": "this thing is awesome!! Nuff said", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "ofer07"}, {"rating": 1.0, "review": "The constant ads destroyed it. It was fun while it lasted. After every video there is an ad. some ads are 5 minutes long! Third party firmware doesn't get rid of the ads. You have to install third party firmware like DD-WRT on your router to block the ads and that MIGHT work.. So this goes in the drawer until somebody makes firmware to block the ads", "verified": false, "helpfulness": "0/0", "author": "Tall Paul"}, {"rating": 1.0, "review": "Simply would not work. I troubleshooted for three days before giving up. It would simply not connect to my wifi despite my computer and my TV being less than 10 feet apart. Had to return it. Shame, because I wanted it to work. I ordered a long HDMI cable instead to run from my PC to the TV.", "verified": true, "helpfulness": "0/0", "author": "A. Grishina \"Psuedoknot\""}, {"rating": 5.0, "review": "LOVE THIS SO MUCH! GREAT PRODUCT AND WOULD RECOMENT TO ANYONE!", "verified": true, "helpfulness": "0/0", "author": "Amazon Mom"}, {"rating": 5.0, "review": "Great device. We use one in living room, and another in nursery (handy for mom watching Friends/Parks&Rec;/The Office while rocking baby to sleep, or feeding her). I use it for sharing photos on our TV with guests, easily playing youtube vids, ABC tv shows from the ABC app, music from Google Play Music or Songza, family/group games from multiple devices, and numerous other uses.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "seems more portable than it really is, as it needs a power source and you end up with more cords than originally expected, but it works as described. Nice cheap alternative to apple tv which is what everyone really wants...", "verified": true, "helpfulness": "0/0", "author": "PaleoBabe"}, {"rating": 5.0, "review": "I am pleased", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 5.0, "review": "Best product I ve bought in a long time, it was all I wanted, small size, has an excellent signal, cast with every device, dosn t crash. Just excellent!The shipping was also on time, had no problems at all!", "verified": true, "helpfulness": "0/0", "author": "Claudio Ramos"}]