[{"rating": 3.0, "review": "Meh,its ok. Sometimes the casting is a little \"glitchy\"", "verified": true, "helpfulness": "1/1", "author": "Rudy Mestaz"}, {"rating": 5.0, "review": "Great Product! Great Seller!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Curry"}, {"rating": 5.0, "review": "You need Internet at home for this to work.  It needs to be able to communicate with the router. I thought it would be able to receive the signal directly from my galaxy tablet or my galaxy s4.  But I was wrong. It basically turns your phone or tablet or laptop into A remote, then the chromecast sends the signal directly to the router which is then connects to the Internet so you can view your content", "verified": false, "helpfulness": "1/1", "author": "hector coronel"}, {"rating": 3.0, "review": "Its ok, Does not work all that well with my macbook pro, but its great with android devices", "verified": true, "helpfulness": "0/1", "author": "Yobry"}, {"rating": 5.0, "review": "Its a very good player which can be easily set up. The video casted on the TV is as good as the original provided the WI FI strength is good. For a small device which does not cost much it is worth owning one.", "verified": true, "helpfulness": "0/0", "author": "TAN LIAN HENG"}, {"rating": 5.0, "review": "Hassle free streaming", "verified": false, "helpfulness": "0/0", "author": "Dellin Jo"}, {"rating": 5.0, "review": "Great, I use this all the time.", "verified": true, "helpfulness": "0/0", "author": "tom"}, {"rating": 5.0, "review": "Love this thing. I use this to stream movies and tv shows from a number of sites right to my tv.", "verified": true, "helpfulness": "0/0", "author": "Larry E \"Larry\""}, {"rating": 5.0, "review": "Very  usefull", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 3.0, "review": "Sometimes this item has buffering with my devices (computers and smaller ones). Well I haven't compare with other streaming media player so I can't say this is better or worse. However I hope Google will update the cast program.", "verified": true, "helpfulness": "0/0", "author": "Kay"}]