[{"rating": 5.0, "review": "I was using a PC to stream to my entertainment system before Amazon Fire. WIth Amazon Fire I am able to find more streaming networks. The system has good picture quality and is very easy to use. It set up in less than 5 minutes.", "verified": true, "helpfulness": "1/1", "author": "Jim Boardman"}, {"rating": 5.0, "review": "I love how easy it is to navigate and find things to watch. Although HBO Go is not available yet I was able to get it on my Kindle Fire and then mirror it to the TV. Really effortless. My mother is able to work this with no problem too. It makes my non-smart TV smarter!", "verified": true, "helpfulness": "1/1", "author": "Lisa A. Boike"}, {"rating": 5.0, "review": "This is a great device. Very easy to hook up to my TV. Now I am watching my Amazon Prime on a TV set. Lots of apps and I love the Pandora app. This is the best $100 I've spent in a long time!! Love it.", "verified": true, "helpfulness": "1/1", "author": "Ellen"}, {"rating": 5.0, "review": "I purchased the Amazon Fire TV in preparation of ridding myself of cable TV.  It is all I expected and more. I replaced my Apple TV device with it and have not looked back. It was simple to set up and acted just as advertised. The voice search feature is a joy to use and a million times better than using an onscreen keyboard. As an Amazon Prime subscriber I am enjoying many new programs, movies and other app choices.  Loving it !!", "verified": true, "helpfulness": "0/0", "author": "Lutzboater"}, {"rating": 5.0, "review": "Amazon Fire TV is awesome!  We recently got rid of Direct TV and have Netflix and Amazon Prime and don't even miss satelite!  Amazon Fire TV is easy to operate, search for shows/movies normally or by voice which is cool!  We were skeptical since it's new but this was SO worth it!  We had been using our DVDV player to watch Netflix and Prime but it was so and would freeze up, very annoying!  We were going to buy a new DVD player when we learned about Gire TV and we are so glad we did!!!Way to go Amazon!!!", "verified": true, "helpfulness": "1/1", "author": "mesmom"}, {"rating": 5.0, "review": "Got the world of video at my command. Cool product with great performance. Great way to compliment Amazon Prime subscription.", "verified": true, "helpfulness": "0/0", "author": "David B. Pokrandt"}, {"rating": 5.0, "review": "My new Fire TV is awesome!  It's very easy to set up.  The voice command feature works great, and response time is very fast!", "verified": true, "helpfulness": "0/0", "author": "Harlan R Bennett"}, {"rating": 5.0, "review": "This was so easy to get started with and the \"talk to \" remote is great. We even took it in the camper and used it with a hot spot off the phone to watch movies on a rainy day. We love it.", "verified": true, "helpfulness": "0/0", "author": "B. Foxx"}, {"rating": 4.0, "review": "The device itself is very nice.  Easy to install, easy to use.  I love that it works on bluetooth.  That allows me to hide the device completely and not worry about having a line-of-sight for an infrared remote.  The kids love having access to the same games they have on their Kindle Fire and Droid devices, only on a big screen.  We got the game controller and that works well.  Our only complaint at this point is the apparently low number of free movies that are available on Amazon Prime.  I realize this is not really a complaint about the device itself, but the fact is we bought the device in part because of the access it would give us to the Prime movies.  Of course, it may be that there are lots of free movies...but only the ones that are available for rent or purchase are showing up on the home screen of the Fire box.  I'll have to do some more research when I get some free time...", "verified": true, "helpfulness": "1/1", "author": "Tygur90 \"tygur90\""}, {"rating": 5.0, "review": "The best feature is the voice command. No more typing in your request and it really works. Hopefully they will continue to improve the number of movies and games.", "verified": true, "helpfulness": "0/0", "author": "Myron Pederson \"vista\""}]