[{"rating": 1.0, "review": "Horrible set up support.  Ended up returning it.  Clearly states on chromecast website that my router is compatible with the device but when I call system support at Google they tell me there is a known problem and I need contact the maker of my router.", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works Great! Very simplistic, but also very useful! There is a limited number of supported apps for now, but that list will only grow.Would love to see Plex as a Chromecast-supported app.", "verified": true, "helpfulness": "0/0", "author": "cwild1"}, {"rating": 3.0, "review": "This is an interesting concept but fairly limited. The app has to be chromecast enabled for this to work. I wanted to use for streaming from a Kindle Fire HD, which can be done in a very limited way.This really is meant for people who like to stay in a Google environment. There was an interesting hack that allowed anything from a PC to stream, by Google disabled that. Too bad because that would have been useful.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "I love this item, it brings my Netflix Movies, YouTube, Laptop Chrome Browser, and Google Play Music right on to my TV. It's an easy set up with no hassle, the instructions are right on the box when you open it. Overall it's a great product. The kids will love it and it's a great Christmas gift!", "verified": true, "helpfulness": "0/1", "author": "very happy"}, {"rating": 5.0, "review": "no hassle, works as advertised, it is plug and play, works with my laptop or my tablet.Streaming players can be a pain even when they work, because the remotes are too basic, forcing you to spell the title of your selection with the cursor keys one letter at a time from a alphabet block on the screen. Chromecast uses your laptop keyboard or the virtual keyboard of your tablet.", "verified": true, "helpfulness": "0/0", "author": "Orrin M McGill"}, {"rating": 5.0, "review": "Love this i was able to get rid of my cable service. I use this and Hulu plus on my phone and went from paying 130.00 for cable to 7 bucks a month for hulu. best little thing ever", "verified": true, "helpfulness": "0/0", "author": "donb"}, {"rating": 1.0, "review": "I guess I needed to read the fine print a little more before purchasing this.  I mostly watch amazon movies and it really doesn't work very well for it.  There was a delay in the audio and could not even watch pbs on it from the computer.  I would stick with app driven dvd players or smart tv's instead of this device.", "verified": true, "helpfulness": "2/3", "author": "L. Lawson"}, {"rating": 4.0, "review": "This device is awesome. It basically allows my TV to become an app device, controllable by my other app devices (iPhone, iPad, laptop, etc.). I wish there were more apps that worked with it, though. I mainly use it with Netflix, Pandora, and YouTube. I can \"cast\" google chrome web pages to the tv, but most embedded video on web pages (except for YouTube), like CNN video will not work with chromecast yet. Hopefully more app brands decide to support chromecast in the near future. If it could somehow by upgraded to stream my desktop to the TV in real time, like any HDMI cable connection, I'd probably give it 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Sean Blondin"}, {"rating": 5.0, "review": "This is a great item.  I can now watch my streaming TV shows on the big screen TV.  Has been working for several months with no issues.", "verified": true, "helpfulness": "0/0", "author": "Ladder34"}, {"rating": 1.0, "review": "This sounds really promising. Unless you are like me and the 20,283,000 folks that use Comcast for broadband service, in which case you bought a $35 cord.", "verified": true, "helpfulness": "2/7", "author": "Kevin McLogan"}]