[{"rating": 4.0, "review": "Works fine!", "verified": true, "helpfulness": "0/0", "author": "Jason santana"}, {"rating": 5.0, "review": "I love the Chromecast streaming stick!!!  I am able to stream from all my devices!!", "verified": true, "helpfulness": "0/0", "author": "Nan Pillai"}, {"rating": 2.0, "review": "I guess you need to set this up right next to your router because it doesn't cast well from upstairs to downstairs.  What a disappointment.", "verified": true, "helpfulness": "0/0", "author": "K. Carrelli \"R2Ks\""}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "1/1", "author": "John W. Norris \"Sgt John W. Norris\""}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Mónica florez"}, {"rating": 3.0, "review": "If you're in the market for a streaming stick, pass on this. I highly recommend the Fire TV Stick over this any day. This device basically works by streaming all content from a mobile device or a computer to the stick. In other words, if you want to watch netflix, you have to have the netflix app open on your phone or computer, and from there \"cast\" it to the stick. This seems totally pointless to me. With the Fire TV Stick you simply download the Netflix app on the stick and can use it whenever you please. The chromecast also doesn't have a dedicated remote. You have to use your phone. And let me clarify, streaming is ALL this device does. When you aren't streaming a video or music the the chromecast, there's nothing else to do. That's it. For around the same amount of money, definitely go for the Fire TV Stick. Aside from having more apps (including Amazon Instant), there is a youtube app which completely diminishes the need for a Chromecast. There's also the ability to sideload other apps such as Kodi (formerly XBMC) to turn your simple stick into a full blown Home Theater Media Center.", "verified": true, "helpfulness": "0/0", "author": "Nicolette"}, {"rating": 4.0, "review": "Great Product very helpful. WOuld have gotten 5 Stars but the tablet interface is not as good as the phone interface. Particularly when using cast screen.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "The device provided me with the ability to transfer what is on  my tablt screen into the bigTV seamlessly. Easy to install . Highly reliable . Added a different huge dimention to entertaing and parties. The price is diffinetly right.", "verified": true, "helpfulness": "0/0", "author": "MIMIB \"MIMIB\""}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Robert Blanton"}, {"rating": 4.0, "review": "Easy install and good price, how can u lose?", "verified": true, "helpfulness": "0/0", "author": "Michael Casey"}]