[{"rating": 5.0, "review": "It works!  I can watch TV/Movies on my TV instead of on my iphone, woo!Just a side note, there's a little light on it so if you have it in the bedroom you might want to put tape over the light or something if you like perfect darkness while you slumber.", "verified": true, "helpfulness": "0/0", "author": "Daedalus1080"}, {"rating": 2.0, "review": "Got this for my aunt and uncle and they said it didn't work as expected.", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "Exactly what I wanted!", "verified": true, "helpfulness": "0/0", "author": "Matthew H."}, {"rating": 4.0, "review": "Awesome device, it upgrades yout tv to smart tv status an even easier to use. I primarly use it for youtube, nba league pass an netflix in Mexico and it works great! Also the casting from chrome in my laptop works fine.Problems so far:1. Sometimes when playing a movie on your laptop's hardrive on chrome and then casting it, the sound gets lost, don't know why.2. Only one time I had a problem with the Netflix casting, had to reboot the device, after that I used the power outlet connection to the chromecast instead of the usb connection to power it up and have not have the problem ever since.Overall, an awesome device. Very recommended.", "verified": true, "helpfulness": "0/0", "author": "Aldebarán Zalapa"}, {"rating": 5.0, "review": "We recently decided to dump cable and go with our digital antenna to get the networks (free) and use Netflix and Hulu Plus to get movies and other T.V. series, roughly $20 a month instead of the $90 we were paying for Dish.  So, we turned off Dish, but the problem was that the reception for Netflix and Hulu was terrible using our Samsung DVD player to connect.  It was constantly stopping and loading.  We live in a rural area so our internet is not the best and we don't have a lot of options.  We were going to give up and go back to Dish Satellite, when I decided to try the Chromecast that my son (who works for Google) had given us for Christmas.  The difference was incredible!  No more stalls, period.  We now open a program on our laptop in Hulu or Netflix and click the icon at the top of the screen and set the input on the TV and it plays perfectly.  Then, we can minimize the screen on the laptop and open a new browser and surf the internet while the program is playing.  I didn't think we needed this gift when we got it since we already had access to Netflix through the DVD player, but it turns out it's helping us save $840 a year!  Also another benefit is it's compact size.  It is plugged in behind the TV into one of the HDMI ports.  It is not visible from the front.  Nice job Google (and thanks for hiring my son, LOL).", "verified": false, "helpfulness": "0/0", "author": "Kathy G."}, {"rating": 5.0, "review": "Awesome for streaming our movies.", "verified": true, "helpfulness": "0/0", "author": "Becky Johnson \"Ms. Becky\""}, {"rating": 5.0, "review": "This wonderful little device is a bargain at $35, most apps are compatible and with a clever mind you can stream literally anything to your TV.", "verified": true, "helpfulness": "0/0", "author": "Gavin"}, {"rating": 5.0, "review": "I absolutely love this thing.", "verified": true, "helpfulness": "0/0", "author": "Michelle Dove"}, {"rating": 1.0, "review": "As worthless an electronic device as I ever wasted my money on, can't get past a no wi-fi connection message when it is obvious wi-fi is connected, asked Google support for help, never received so much as a message acknowledged I contacted them, much less any help.Actually not the money, am returning for full refund as much as the false expectations from their advertising and the time wasted trying to get it to work. btw what little useful info I could glean from the Google site indicates this thing has to be within 10-15 feet of the router, making it almost useless in most environments in the first place even if one did get it to work.", "verified": false, "helpfulness": "0/0", "author": "Poppy"}, {"rating": 5.0, "review": "I bought this over a year ago, so i think it's time to write a review. My family and i have been able to enjoy so much using chromecast from sharing photos and videos from our phones, to watching movies from our fav apps. Warning: I usually have it in my bedroom when not using it in the main living area, just remember which television Chromecast is connected to otherwise you'll be surprising someone unexpectedly. I'm ready to purchase a separate device for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Readaholic"}]