[{"rating": 5.0, "review": "I've been using Chromcast since late January and I am totally impressed. This device works impressively with smartphones and tablets outfitted with the Chromcast app and compatible content apps like Netflix and HuluPlus. Together with the still beta-version of the Chromecast plugin for Google Chrome, cord cutters will find a rich range content to enjoy on on their full size screen. Add a quality over the air anntenae to your set up and perhaps a DVR to your set up for time-shifting local content and you can kiss your cable/satellite provider good bye- provided you aren't beholden to them for high speed internet. And that is the caveat- you need a decent internet connect to enjoy this well. The apps do well buffering but that only takes you so far; I have ATT U-verse provided courtesy of my landlord- so beyond my control. This works better than the ATT equipment in streaming content (and that is a very low bar but one I don't have the wearwithall to remedy right now). Chromecast does make it bearable, ironically because the ATT U-verse signal is good enough to let streaming to my devices work. It is not instant on by any stretch but it is no different broadcasting to Chromecast than it is watching on the small screen in terms of getting to the show.My time out of box to set up was easy and quick too. Tech level of experience needed is minimal and I venture to guess the computer aware but not savvy set would have no problem. I personally use iPhone 5S and iPad with retina display; I also use my 3 yr old i7 processor driven lap top to view out of Chrome. I've had no problem multitasking from any of these devices as my content streams. Sometimes my device gets disconnected from the Chromcast stream so controling the viewing and my televsion from my device lags or gets suspended, especially during binge view marathons; my multitaskig may certainly impact this but not always. This is a relatively minor annoyance that I imagine will be addressed as all the apps involved get updated. Any new content provider interested in getting their stream out there independent of the cable/satellite services would be wise explore mechanisms that allow their content to utilize this device.", "verified": false, "helpfulness": "0/0", "author": "S. Johnson"}, {"rating": 5.0, "review": "I love the ability to browse Netflix, songza or my media library from my phone or tablet and play them on my TV.  I use it everyday", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 5.0, "review": "Love it, I bought this for my kids but I use this almost daily. It is a great item and I highly recommend - great buy, good price!", "verified": true, "helpfulness": "0/0", "author": "Luz"}, {"rating": 5.0, "review": "I own 2 sharp smart TV\"s which did not have HuluPlus. I decided to purchase Google Chrome to make that connection.  I ordered 2 of them from Amazon and read the instructions which were very simple to understand. After I connected the Google Chrome to each televsion,  I then used my tablet which had HuluPlus and synchronized the tablet to Google Chrome and the televsion. Google Chrome worked perfectly. You have to leave your tablet on when using the Google Chrome.  The volume to the TV is controlled by your TV remote and not your tablet. The picture and sound was absolutely amazing.  I would highly recommend the purchase of Google Chrome for users who do not have Netflix or HuluPlus on there tv's.", "verified": false, "helpfulness": "0/0", "author": "Barry G"}, {"rating": 5.0, "review": "This is a great product only problem its not compatiable for the Kindle tablets other than that its a awesome", "verified": true, "helpfulness": "0/0", "author": "sandra spinney"}, {"rating": 5.0, "review": "Ive purchase a total of 4 Google Chromecast's, first one for myself before Christmas (2013) and liked it so much, it became a gift for 3 more family members. I personally love it and use it all the time. Ive used it mostly for Netflix, HBOGO and more than anything else...casting YouTube videos from my iPad to my television! This had led to so many extra family & friend interactions and laugh fests! Bring up a funny YouTube, grab the iPad and cast it to the tv...simply awesome. Using the iPad as essentially the remote control is cool and for me makes it easier to use then the smart tv features for some of the same apps mentioned above. The price was good and compared to the competition, like apple tv is a steal. The only small criticism, is the limited number of apps so far, but that is increasing each month. I also wish it would cast the internet browser (chrome) from mobile devices, like my iPad. The feedback from the family members, receiving it as an xmas gift has been just as awesome and their ages range from 22-56. Highly recommended to all!", "verified": true, "helpfulness": "0/0", "author": "J Doug \"J Doug\""}, {"rating": 4.0, "review": "I have been able to \"cast\" from my macbook and phone (once for each).  I still do not understand the intricacies but so far it has lived up to the hype so I will keep playing with it.", "verified": true, "helpfulness": "0/0", "author": "Apuch \"John\""}, {"rating": 4.0, "review": "It is very easy to install and to use. You can install in several tablets/laptops so you can share your screen from any deviceCons: need more apps/webs that can be used and that can be used with Ubuntu", "verified": true, "helpfulness": "0/0", "author": "Antonio Duro"}, {"rating": 5.0, "review": "Wish they would've came up with this years ago. Absolutely love it, works very well. Other companies need to look at this as the number one in adaption plug-ins.", "verified": false, "helpfulness": "10/17", "author": "Jeremy H. Jones"}, {"rating": 5.0, "review": "Sets up super fast and easy.  Awesome picture.  Only 2 small nits that might make me drop it do 4.5 stars.  1) it requires a power cable, which they never so on the adds, so that can be ugly hanging off your tv.  2) Since there is no remote, when we are watching a netflix movie from the iPad, it takes a long time to pause or rewind if you miss something. You have to power on the iPad, open Netflix app (wait......) then hit the pause or rewind.  Too bad they don't have a one button remote: Pause, unpause.I only use for Netflix, so don't know if it has issues with other apps.", "verified": true, "helpfulness": "0/0", "author": "P3t3r P"}]