[{"rating": 5.0, "review": "I love tv now we have it in one room right now i want it everywhere", "verified": true, "helpfulness": "0/0", "author": "Pam Winegardner"}, {"rating": 5.0, "review": "E", "verified": true, "helpfulness": "0/0", "author": "samuel hicks"}, {"rating": 5.0, "review": "This product exceeded my expectations. I use it more than my appletv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "No international access to prime movies", "verified": true, "helpfulness": "0/2", "author": "Guillermo Medrano Tijerino"}, {"rating": 5.0, "review": "Best streaming player out there", "verified": true, "helpfulness": "0/0", "author": "adrian perez"}, {"rating": 5.0, "review": "We love this little gadget!  Prior to getting the Amazon Fire TV we'd been using the internet service on our Sony Blue Ray player.  It was always balky, slow, and offered very little in the way of content that we cared about.  We went to Best Buy on a whim and picked up the Fire TV since we already had an Amazon Prime account.  Set up was a breeze and we were on the web within minutes watching movies and trying out the features.  The downloads and performance are fast and our movies are not interrupted any more with buffering and delays.  We're definitely impressed.One thing we really like is the speech recognition from the remote, although my wife ran into a funny experience when searching for movie titles.  My kids told her to search for \"space action\" and the Fire TV came up with \"beef action\".  We got a great laugh out of that - and from now on we're more careful when using the speech recognition feature.", "verified": true, "helpfulness": "0/0", "author": "J. Pfarr"}, {"rating": 5.0, "review": "It sure has meant everything I wanted with the firetv and beyond. I got this to take over from directv. I was paying 145.00 a month now I am only paying 35.00 with sling, hulu, pluto, netfex, and amazon prem. I just purchase 3 more firetv for the rest of my home.", "verified": true, "helpfulness": "1/1", "author": "wmyers"}, {"rating": 4.0, "review": "Works great except cannot get voice recognition to work.", "verified": true, "helpfulness": "0/0", "author": "Dingodog"}, {"rating": 5.0, "review": "Easy install and works great", "verified": true, "helpfulness": "0/0", "author": "DF"}, {"rating": 2.0, "review": "Nice remote controller and easy voice command.But need to type by screen keyboard in Youtube app.Prime video works great and Netflix works good.Plex sucks.Nice screen saver.Nice hardware with $99 price.With buggy Plex, no reason to buy it.", "verified": true, "helpfulness": "0/2", "author": "Won Cheol Yim"}]