[{"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 4.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "David Butler"}, {"rating": 5.0, "review": "Love this thing! So much easier than getting the Xbox started every time I want to watch YouTube or the like.", "verified": true, "helpfulness": "0/0", "author": "Adam D."}, {"rating": 5.0, "review": "Works exactly as it was supposed to. Sometimes it needs come clever apps to watch EVERYTHING but there is an application for almost anything either on or off the app store I love this works with every device I own although there are occasional sound lag issues. Overall fantastic performance and beautiful backdrop casting photos when not in use.", "verified": true, "helpfulness": "0/0", "author": "michael Delorenzo"}, {"rating": 4.0, "review": "Desperately needs  more developers to take advantage of, I assume it's Google's source code that limits it.I am a geek, so I do test out a LOT of Apps inclusive BETA \"pre release to public\"This Device works flawless BUT a lot of apps are slow in producing the rendering \"pictures etc\"  ZERO problems IF you have the right software to cast Web content onto the TV.I am still waiting on actual being able to see whatever is on my phones screen.I do LOVE everything it stands for and could produce.", "verified": true, "helpfulness": "0/0", "author": "Gr8fool \"I hope this helps someone\""}, {"rating": 4.0, "review": "No instructions on to use. But it wasn't very hard and a Google search gets help. Plug it in. Use TV remote to select\"input \" and a 4 digit appears on TV. select next on phone and it will ask you to name the connection like living room which I chose( any name works) and then on you phone, laptop whatever is a little 'cast' symbol looks like a WiFi signal turned sideways. Hit that after bringing up a YouTube video and a pop- up on phone will show (living room). Tap that and hit play on YT. Done get popcorn.when nothing is playing and TV  is set on input the Google Dong shows beautiful wallpaper. For $35 skins its well worth it and a lot of fun. A lot more apps need to be castable as the list of apps suck. Almost None work well . But YT has a gazillion things to watch, ,Hulu has some. And if you want to live with those choices, you tell your cable company to bark at the moon.", "verified": false, "helpfulness": "0/0", "author": "Steve Surgeont"}, {"rating": 5.0, "review": "Great streaming", "verified": true, "helpfulness": "0/0", "author": "Ryan Arnold"}, {"rating": 4.0, "review": "It is evolving to become a great addition to out entertainment system. Some friends have really maxed out their usage of this little device. However, as we already have two Roku's and an Apple TV we haven't found the need to expand much. However, for streaming webpages not available as an APP on the other devices (such as FX) this little guy is perfect. The lag is much better then Apple's AirPlay (at least for our network).", "verified": false, "helpfulness": "0/0", "author": "Donald E Mass"}, {"rating": 5.0, "review": "Good transmission between my laptop and TV. I can watch my favorite Youtube and Netflex movie.", "verified": true, "helpfulness": "0/0", "author": "RC"}, {"rating": 5.0, "review": "This thing can turn any TV (with HDMI) into a smart TV. I have a Samsung Smart TV but I still wanted to have the convenience of being about to move it to non-smart TVs. Smart TVs by the way, are TVs with built in apps like, Netflix, HBOGO, and so on. Even though Chromecast duplicates a lot of what my TV can already do I like the way Chromecast does it better. Being able to control the content via phones, tables, and computers anywhere in the house is very convenient. The only disadvantage is that anyone on your wireless network can control the Chromecast, meaning that you may be Rick Rolled at any time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]