[{"rating": 5.0, "review": "This little gadget great!!!!!! besides the advertised features there is another one that you can throw anything they you are currently viewing on your browser onto your TV. It has also a built-in HDMI switch so you don't even need to change the input to use it. Simply click the cast button on your chrome browser, and enjoy.", "verified": true, "helpfulness": "0/0", "author": "thomas tittle"}, {"rating": 4.0, "review": "Set up was a tiny bit confusing and I had to do a few things manually, but was great once it was set up.", "verified": true, "helpfulness": "0/0", "author": "Gosuka \"gosuka\""}, {"rating": 5.0, "review": "Once setting it up, sit down and enjoy high quality programs. The option of having your smart phone as a remote is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Alberto Chavez"}, {"rating": 5.0, "review": "This is a big difference in my tv watching.  I would like to see more items that accept casting and that includes Amazon Movies and tv shows.", "verified": true, "helpfulness": "0/0", "author": "Traci Langan"}, {"rating": 1.0, "review": "I don't even use the thing anymore.  It freezes constantly; you can't even get through a 30 minute show, without having to take it out and plug it back in and start everything over.  Don't waste your money.", "verified": true, "helpfulness": "0/1", "author": "smk"}, {"rating": 4.0, "review": "I enjoy Chromecast very much. I like watching music videos or how to videos on the tv screen. You can also watch personal videos.", "verified": true, "helpfulness": "0/0", "author": "Brooke Lentz"}, {"rating": 2.0, "review": "Unless I haven't figured out the magic, HDMI cable has a better picture and HDMI works with everything on my computer unlike the incompatible Chromecast. Choppy display and limited. Disappointed.", "verified": true, "helpfulness": "0/0", "author": "rob pennington"}, {"rating": 5.0, "review": "This device arrived quickly and in good condition. It was exactly as described and functioned properly. It does require some setup work.", "verified": true, "helpfulness": "0/0", "author": "johwalty"}, {"rating": 5.0, "review": "Extremely easy to install and works great from iPhone, iPad and MAC book. The picture quality is very good. I have used it most with HuluPlus.", "verified": true, "helpfulness": "0/0", "author": "D W Nibbelink"}, {"rating": 4.0, "review": "I would of given it 5 stars except you must have your route or wifi connection decently close to the chromecast or it will not keep a good connection.", "verified": true, "helpfulness": "1/1", "author": "ERIC R KESSLER"}]