[{"rating": 5.0, "review": "Works great, perfect for netflix and other streaming sites if you don't want to buy a roku or other expensive media middlemen.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "John R. Filori"}, {"rating": 5.0, "review": "Go very well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Very dissapointed. This device requires internet connection to work. Cant use it in hotels or anywhere else outside my home.", "verified": true, "helpfulness": "0/2", "author": "Baltu Yorkos"}, {"rating": 1.0, "review": "The cast icon would frequently disappear from my the app in my phone and videos from sometimes freeze up and require a reboot.", "verified": false, "helpfulness": "0/0", "author": "Bryan Rounds"}, {"rating": 4.0, "review": "Works just as I hoped it would. My only complaint is that it can be a little choppy when streaming from a laptop and someone else is using their phone to do something that is pulling from the Internet also. Otherwise we use it often since we don't have cable and stream quite a bit of what we watch", "verified": true, "helpfulness": "0/0", "author": "Austin Jensen"}, {"rating": 1.0, "review": "Didn't work. Tried it and tried it and tried it. Followed the instructions multiple times. TV is compatible but this device bombed.", "verified": true, "helpfulness": "0/0", "author": "Michael H. Haussler \"Author of \"Results May Vary\"\""}, {"rating": 5.0, "review": "Unbeatable for the money.", "verified": true, "helpfulness": "0/0", "author": "J. Hooper"}, {"rating": 5.0, "review": "This is a must have, fantastic product!", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Love it, love everything about it. Probably going to be buying a second one to replace the DVD player that has streaming. There was one small hiccup when I first installed it, the sound had a small lag but I just unplugged it and put it back in and it was fixed. Highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Laura Rouzer"}]