[{"rating": 2.0, "review": "I thought the chrome cast was great. It was relatively simple to install when you have your son on the phone telling you what to do and it is simple to use once installed...", "verified": true, "helpfulness": "0/0", "author": "ELLEN STROZ"}, {"rating": 5.0, "review": "I love the ability to  walk right in my living room and start netflix, you tube and amazon.  I don't have to worry about looking for my remote for my smart TV.", "verified": true, "helpfulness": "0/0", "author": "JTaylor"}, {"rating": 3.0, "review": "Straightforward to set up and work with my iPhone - but with caveats :1. Cannot use it with my network extender2. Cannot use with my iMac with VPN installed. This MAY be due to a custom Mac OS install by my workplace IT organizationOne final comment - Google tech support were excellent !", "verified": true, "helpfulness": "0/0", "author": "Diane Bailey"}, {"rating": 3.0, "review": "We recently \"pulled the plug\" and switched to mostly streaming.  We got 3 different media players: Roku 3, WD, and Google Chromecast.  We were a bit disappointed in the Google ... we admit we aren't techies and actually may be part of the problem. We like the compact size, smallest of the 3 by far, but you can only access it on your TV through your iphone or ipad or computer, which we find clunky. So far, we have only succeeded in connecting to Netflix, even though we know there are other options out there. We just can't find them.", "verified": true, "helpfulness": "2/3", "author": "Diane Guiseclowes \"Book Frog\""}, {"rating": 1.0, "review": "Item doesn't work well and is inconsistent.  Too much trouble setting it up w/ router and no support!  You get what you pay for and $35 doesn't get you much", "verified": true, "helpfulness": "0/0", "author": "Mark Conmy"}, {"rating": 2.0, "review": "Couldn't get it to send Google browser to the chromecast unit, and I thought I would be able to use amazon, and or Hulu but nope just utube Not worth it to me", "verified": true, "helpfulness": "0/0", "author": "asilversurfer \"asilversurfer\""}, {"rating": 4.0, "review": "I know for certain if I had better internet connection I would be able to leverage this product to a far better extent. My wife loves it since we dont need to drag a HDMI capble out in order to stream netflix from our computer, so that alone makes it well worth it.", "verified": true, "helpfulness": "0/0", "author": "CPT M. \"lmorell\""}, {"rating": 5.0, "review": "I am really impressed with this little device. It plugs into the HDMI port on your TV, and then you're able to stream from an ever-growing list of apps and programs. Netflix streaming works like a dream from my computer, Android phone, and Android tablet.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "I've got two.  It's a great way to watch and control NetFlix, YouTube and many more internet things on the TV.", "verified": true, "helpfulness": "0/0", "author": "Jay T"}, {"rating": 5.0, "review": "Turn your TV into a smart TV for $30. Keeps adding more apps and usability beyond the already Netflix, Hulu and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Kevin josephson"}]