[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 4.0, "review": "Good product for a good price, but the main menu is a little awkward to use.", "verified": true, "helpfulness": "0/0", "author": "Silas Heisler"}, {"rating": 1.0, "review": "I plugged in the device and set it up which was easy.  I don't understand how to use it unless I purchase Netflix and other services.  What do I get with Amazon Fire TV outside of the additional purchases.  I am really confused.  I also don't understand how mich each item costrs that I might want to view.", "verified": true, "helpfulness": "1/4", "author": "phyllis k gingold"}, {"rating": 5.0, "review": "Has proven its strength among all devices TV box...", "verified": false, "helpfulness": "0/0", "author": "Rommel \"Rommel Haddad\""}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Larry L Haley"}, {"rating": 5.0, "review": "what I ordered", "verified": true, "helpfulness": "0/1", "author": "Robert M. Lauderdale \"Old Jewish Man\""}, {"rating": 5.0, "review": "I Love this it really work i am going to order a other one for my other TV", "verified": true, "helpfulness": "0/0", "author": "John Skinner"}, {"rating": 5.0, "review": "I am pleased with this device although I haven't yet had time to read all of the instructions to determine all the ways to use it.  It does allow the watching of a movie or tv series from Prime to be cast onto your TV from your tablet running series 2.0 and above.  My Fire is version 4.  I'm not sure this is an advantage, however, since I can watch the same thing without my tablet being involved.  I also have Roku 2 which isn't as versatile, but is about 2 years old and has more available apps.  I think the Fire TV will eventually be better, and I just wanted to have all Amazon devices to take advantage of their compatibility designs.  However, I did not read the sales pitch/advertisement carefully enough as I thought I would be able to cast internet content from my tablet to the TV screen.  The HD will not allow that; the  HDX is required.  As noted in the product title this was a refurbished unit - I highly recommend looking for such items on electronic gear - I have saved a lot of money and haven't yet been disappointed.", "verified": true, "helpfulness": "0/0", "author": "chuckssite"}, {"rating": 5.0, "review": "Still figuring out what all it can do but so far I've watched quite a few good movies on it and some tv series. I see it has music and games too, I'll have to explore it more but I really like it, especially with the amazon prime and Netflix so I can pick up more recent movies and voice search is so easy to use , I get tired of letter by letter search.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "It was so easy to install.  It updated and off it went. I was able to access all episodes even movies without delay. The voice control option not too great then again it may have been me coming down with cold. Great investment!", "verified": true, "helpfulness": "0/0", "author": "Adriana Tutillo \"Mosaic Queen\""}]