[{"rating": 2.0, "review": "I saw this product on the Today show & thought it would be perfect for me.  I have Amazon prime that I would like to watch on the big screen instead of the laptop.  I was under the impression that it would play anything from your computer on the TV.  Nope.  It will only play certain file types from Google chrome internet, Netflix, & youtube.  Not at all what I was led to believe from the review on TV!  And yes I see now on the description that it says that but I was going by what the review on TV said.  Not sure if I should send it back or keep it hoping they will add more options later (ahem, Amazon Prime video!!!).I will add that it would be good it you have a Netflix account, so if that's what you will be using it for I am sure you would like it more than I did.", "verified": true, "helpfulness": "3/5", "author": "Jenn Hanson"}, {"rating": 3.0, "review": "I believe this product still needs a lot of improvements.  sometimes the computer and the tv are out of sync and the is a 5 to 6 minute delay between the two", "verified": true, "helpfulness": "2/2", "author": "David Nunez"}, {"rating": 3.0, "review": "Honestly, it fails to match the reliability of Apple TV but hopefully, Google will figure it out and make it more reliable to use in the future.Apple TV turn my TV into another screen for my Apple Devices. It works seamlessly. Chromecast is more capable of streaming from Chrome Browser. But the beta version, as advocated by Google, loses the communication/signal from time to time.", "verified": true, "helpfulness": "4/5", "author": "Rookie User"}, {"rating": 3.0, "review": "Since I also have a Roku player, Chromecast will be inferior to Apple TV and Roku until it gets more content options. I can see taking it on the road when on vacation if one wants to access their Netflix say on a hotel room TV.", "verified": true, "helpfulness": "1/1", "author": "Manfried \"Ruffmouse\""}, {"rating": 5.0, "review": "This is amazing - required very little set up and downloading the app and getting Chromecast installed on the tv was very simple - definitely worth the price and also very simple to work.", "verified": true, "helpfulness": "0/1", "author": "Sandi \"Sandra Hartigan\""}, {"rating": 4.0, "review": "Does what they said it would do.  Still hoping for more providers to sign on.  For the price you can't go wrong.", "verified": true, "helpfulness": "0/1", "author": "R. Chimenti"}, {"rating": 4.0, "review": "I'm a huge google fan of everything they do...so when they introduce this device, I figured i'd try it out....It's almost like a replacement for the google TV box's i've got...It works great.", "verified": true, "helpfulness": "0/1", "author": "daviggi"}, {"rating": 3.0, "review": "Took some time (for me) to set this little bugger up but it does function as advertised. It is somewhat annoying to have to use my iPhone or computer as the control device for bedtime TV. Would really like to be able to use my Kindle Fire for that task.The streaming is acceptable. The only content included that I value so far is NetFlix (and of course, that is a paid subscription). I understand that more content is on the way :-)  So for the $35.00 that I paid for for the unit......it is OK", "verified": true, "helpfulness": "1/1", "author": "John Benadum John B"}, {"rating": 2.0, "review": "very slow communication with PC.pros: Work well with netflix/youtube.cons: Very slow with chrome Amazon etc. setup process complicated. need a reset from time to time.", "verified": false, "helpfulness": "1/1", "author": "Guy"}, {"rating": 4.0, "review": "I just got two of these at 35.00 great price...makes any tv with HDMI ports a smart network tv...i just have not had allot of time to really use it allot..but I think you are going to want one..", "verified": true, "helpfulness": "0/1", "author": "James B. Williams"}]