[{"rating": 5.0, "review": "Excelente gaget", "verified": true, "helpfulness": "0/0", "author": "Otoniel Vega Navarro"}, {"rating": 4.0, "review": "Very good device.", "verified": true, "helpfulness": "0/0", "author": "Sajal Kumar"}, {"rating": 3.0, "review": "I wasn't impressed.", "verified": true, "helpfulness": "0/1", "author": "Jason Nicholas Smith"}, {"rating": 5.0, "review": "It's work", "verified": true, "helpfulness": "0/1", "author": "Bayan"}, {"rating": 5.0, "review": "Great product for a good price and fast delivery!!", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 5.0, "review": "Perfect.  Use it with Localcast app for video streaming.", "verified": true, "helpfulness": "0/0", "author": "Stephen A."}, {"rating": 5.0, "review": "Easy to set up and use. Delivered fast.", "verified": true, "helpfulness": "0/0", "author": "Ralph"}, {"rating": 4.0, "review": "I love this device, but give it 4 stars because it requires an Internet connection. Why, I have no idea.  Here is the problem: Major hotels (Starwood/Marriott) require you to enter a password for their network, which allows them to store the MAC  address and provide Internet access to the internet for the device (e.g, your laptop).  Unfortunately, you cannot enter a password through this device. So while it will connect to the tv, and while your laptop will connect to this device, the ChromeCast device will not connect to the Internet...so you can't stream shows from your LAPTOP to your Chromecast.Lastly, it only supports some streaming setups (e.g., netflix) but not others (e.g., opening movies stored on your device). There are work-arounds, but they should just open this up.If I find a work-around I will revise this post and list the work-around.Other then that, if you have an INternet connection (typically smaller hotels, like bed and breakfast where they use a normal wifi setup), then this thing is fantastic.", "verified": true, "helpfulness": "1/1", "author": "Furball"}, {"rating": 5.0, "review": "All my purchases was always on time and to my expectation. So far I have never had any problem nether with the delivery or with the contact of what I purchased", "verified": true, "helpfulness": "0/0", "author": "Ily Berdich \"odessit\""}, {"rating": 5.0, "review": "Good value", "verified": true, "helpfulness": "0/0", "author": "Robert Johnson"}]