[{"rating": 5.0, "review": "Does Hulu+ and amazon prime come free with it", "verified": false, "helpfulness": "0/1", "author": "Christian"}, {"rating": 4.0, "review": "I received this and the game controller for my birthday in September 2014.  I have to admit I was not impressed out of the box. However the software updates since launch have alleviated one of my biggest gripes, and sideloading apps added more sought after features.First things first, the late 2014 updates added amazon prime sorting, this made a huge difference in usability since I am a subscriber and can now find prime content much easier. Hard to believe it wasn't this way out of the box.  The only sacrifice for being on the latest firmware is loss of root access.If you are the kind of person who likes to root devices for added functionality, just turn on adb in Dev options and you can sideload apps from your computer... I even have an app that let's me push apps straight to the FireTV over Wi-Fi from my phone. I loaded Kodi (formerly xbmc) which allows me to steam nearly any content I have stored on my NAS via DLNA or SMB.  Win!The only true negatives to not having root are 1) sideloaded apps don't show up in the home menu, you have to load them through options or do some other tweaks via software (llama). 2) you cannot use the USB for additional storage.Unfortunately this device comes with only 8GB of storage, and is billed as a gaming machine. If you stream everything that will be enough space, if you start downloading apps and games, you will run out of space fast.  No SD and USB storage disabled docks one star from my review.That being said I use this device every day and simply love it. Best bang for the buck in this space in my opinion.If you just want a simple way to stream amazon prime this device is a no brainer, but consider the fire TV stick for less money.  If you're paying for the big box, you can use the extra power to do much more.", "verified": true, "helpfulness": "1/1", "author": "David R. Hilgendorf"}, {"rating": 1.0, "review": "I just received the Fire TV and my first impressions are of utter disappointed that there is no web browsing capacity. Chrome, Firefox, Opera, any available as an App would work.  We sometimes watch our Pasteur streaming on the internet.  I thought this was going to be great way to use many of the prime features we enjoy (Music, Movies, etc) and meet our needs at times when we watch church or google something in the living room.  I don't know if I can use it yet to get to Fox or NBC for next years super bowl but that would clench return right there.  It's such a simple fix I'm utterly shocked Amazon has not implemented something.  I am going to try it out for another 2 days but I really think I'll be returning it before the weekend.", "verified": true, "helpfulness": "4/12", "author": "David Vasquez"}, {"rating": 5.0, "review": "Really enjoyed this. The voice search feature on the remote was very helpful and fast. Plus you can use this on any smart phone you have if you install the fire tv application. Even if your not an Amazon prime member it was still very useful. You can play games on it which was a nice perk. Using the Plex media server app was great. That alone for me sold this product. I have an Apple TV 2gen & I really like it. The huge difference for me & the reason I personally will buy the Amazon Fire TV or Fire stick is because you have countless more options. Not to mention you don''t need to tweak it to use Plex. You can still use air play with Amazon fire tv from any iOS device with third party apps as well. Hands down I would recommend this over the Apple TV. If you have a total Apple ecosystem in your house you could still find ways to make this work without much effort with any app from Amazon. Roku, Apple TV or Fire TV? I will choose the Fire TV each time since you have alot more options to choose from than any other current offerings.", "verified": true, "helpfulness": "0/0", "author": "Anthony G Ponce"}, {"rating": 5.0, "review": "Amazon Fire TV does an great job of playing Prime video's. I does well at streaming anything so far. What was really great for me was it found my music on my computer I guess. I'm not sure where it found it but it did. It must then get it from the cloud to play it. Hooked up to the stereo and sounds great. Very clean and full sounding music. I like it a lot. The remote works good and the voice rec. works good. Having fun with it now, but plan on cutting the cable soon. Great product.", "verified": true, "helpfulness": "1/1", "author": "litehoss \"Hoss\""}, {"rating": 5.0, "review": "I have 3 Roku 3s and 2 Roku sticks...and One Amazon Fire TV...wish I had all Amazon Fire TV or sticks...The Fire TV is so far, very very nice, the interface is awesome, the speed is superb and NO hiccups so far. Cant say the same for Roku..mostly works well but I have had to unplug and restart several times, does not always connect to TV. Works well, but the roku box gets very very warm....and now after using Fire TV, I am very impressed. They need to add a PlayOn app...other than that...perfection....and I see it getting even better as time goes on.If your trying to decide which one to get....use the Sling Television $50 off and 3 months of Sling Television to get the fire...or fire stick...I would get Fire TV not the stick...its fast and just works well.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "i have just started using this device...i am replacing a google tv in a sony BR player..one of the main thing i used the old device for was watching videos off of my usb..i was very upset to find out that even know this device has a usb connection, it sadly cant read it?? so weird?! i really truly hope that the upgrade the software to solve this problem!!! nervous i wasted my money?!?", "verified": true, "helpfulness": "0/2", "author": "Marc Pagano"}, {"rating": 5.0, "review": "LOVE it, it is always right there ready to go. I have \"smart\" TV's and they have to \"upgrade\" every time I use them for internet related viewing, this is ready and raring to go right now!", "verified": true, "helpfulness": "0/0", "author": "Idiot from Az"}, {"rating": 5.0, "review": "Loved the ease of hooking it up... And the software platform is very user friendly", "verified": true, "helpfulness": "0/0", "author": "MICHEL L GILLILAND"}, {"rating": 5.0, "review": "works great for streaming", "verified": true, "helpfulness": "0/0", "author": "Judy Gauna"}]