[{"rating": 2.0, "review": "If your a Amazon Prime subscriber you may like the Fire TV, however I am not a Prime subscriber.  Most of the content on the screen is from Amazon Prime.  You cannot customize it to remove the unwanted content on the screen navigation.  It is quite irritating with these limitations.  Other content is almost treated like a second class citizen and the navigation is anything but pleasant.  The voice recognition also only works in the Prime and native content, once your in other apps forget trying to use the voice recognition.  There are better streaming options where you don't have to put up with these limitations and irritations.I have been using a Chromecast, but grew tired of the casting issues that seem to be present too many times with Netflix.  You Tube also at times has some issues so I decided to go to a directly attached box to the TV and stop \"casting\" the content to see if that would speed things up and make a better experience.  I thought based on the reviews that the Fire TV might be worth giving a try.  I dislike the interface and the limited customization so much I was prepared to send it back.  Then I found out about side loading other content and the possible ways to make this useful with Kodi and other content.  So I decided to keep it and play with it, but I can say as of right now it doesn't get used the way it was intended at all.  Moving to a direct attached box to the TV has improved the overall experience over the Chromecast experience I have been dealing with.  So that was a good move, but the Fire TV wasn't the best choice.I decided to just take the plunge and get a Chromebox and a wireless keyboard and use that for my Plex, Netflix, and You Tube viewing.  That is working pretty well and actually gives me the performance I was looking for from the Fire TV, plus I can surf the web and do other things with it.  So if your willing to tinker some a Chromebox might be a better choice or go with a Roku if you want a set it and forget it experience.  If my Chromebox experiment doesn't pan out I will probably end up getting a Roku.  Right now I am liking the Chromebox pretty well for what I need it for.  And Kodi is an option on the Chromebox also which I just need some time to play with it and see how that works for me.In summary, if your a Amazon Prime subscriber Fire TV might be just what you are looking for.  If your not a Prime subscriber I would look elsewhere for your streaming needs.  I gave it a 2 star rating based on the fact that in developer mode I can sideload content and apps I want. If not for that I would have given it 1 star.  If I were a Prime subscriber I would give it 3.5 stars.", "verified": true, "helpfulness": "2/4", "author": "W. P. Buchanan"}, {"rating": 5.0, "review": "Good  hardware specially to watch HD movies. Happy with my purchase", "verified": true, "helpfulness": "0/1", "author": "pisco"}, {"rating": 5.0, "review": "I get all the channels I watch the most plus some, but had to get SLING TV APP for $20 per month (Live TV).  With Prime TV for $99 per year and SLING TV for $20 per month, the total per month is apprx $29.00 !!  This little box will pay for itself in 3 months!!  I was paying $70 per month for Dish, and now I am saving $40 per month and getting more !!!  The only drawback is that it serves only 1 TV, so if you have a second or third TV, you will need to get a box for each one. All in All though, I figured within a year, I will save $492 so that will cover the one time expense of getting a second Amazon Fire TV box for $99 and I am still saving money.  Of course don't forget you have to have internet, and it works best with a smart TV.", "verified": true, "helpfulness": "2/2", "author": "Sheryl"}, {"rating": 5.0, "review": "The Amazon fire TV is simply the best streaming device on the market today! We just purchased our second AFTV because we love the simplicity of this device and its speed!", "verified": true, "helpfulness": "1/1", "author": "Michael Walker"}, {"rating": 5.0, "review": "Much better than my wd TV for streaming Netflix and playing YouTube etc but they need to update it to be able to use ntfs formatted hard drives", "verified": true, "helpfulness": "1/1", "author": "Stephen"}, {"rating": 4.0, "review": "I'm very happy with this product, however I was outraged at the amount of packaging used for two small items.  What a gigantic waste of resources!  Come on, Amazon, lead the way in more earth-friendly retailing practices.", "verified": true, "helpfulness": "1/2", "author": "Mona Barz"}, {"rating": 4.0, "review": "Works good. Pushes Prime content too much. Home screen should be more customizable.", "verified": true, "helpfulness": "1/2", "author": "Jason"}, {"rating": 5.0, "review": "I bought this after reviewing every other system out there. I am very happy with this and might get more of them for the other sets in the house.I have Amazon Prime and I like speaking the name of the movie into the remote and having it pop up without searching.This has made my life much easier.", "verified": true, "helpfulness": "1/1", "author": "Harry Salvin"}, {"rating": 5.0, "review": "We decide to \"cut the cord\" with regular television earlier this year and switch to the Fire TV. We were long-time subscribers to Dish network, and were constantly dismayed at the ever-rising costs. We wanted an alternative that would still allow us to watch most of what we wanted while saving money every year.The Fire TV has been a great compromise. There are a large number of apps, the price was right, and we were already Prime subscribers, so we are saving ourselves several hundred dollars a year by switching from Dish. The only complaints we have had deal with specific apps and not the Fire TV (such as the Hulu Plus app- a complete piece of junk!), and we have even recommended the Fire TV to friends that have also been thinking about making the switch from cable or satellite TV.", "verified": true, "helpfulness": "3/3", "author": "Getoutdoors \"Getoutdoors\""}, {"rating": 1.0, "review": "I will begin by saying I am a huge fan of Amazon and have bought everything from very expensive TV's to wasabi peas from them.  I own two Kindles with which I have been relatively pleased. I also have owned numerous video streaming devices: 2 Rokus, 3 Sony bluray players, an Apple TV, and a Fire TV stick.  After problems with a Roku failing after a couple of months, and disappointment with the limited content of Apple TV, I decided to give the Fire TV a try.  I must regretfully say it was a major disappointment.  It worked ok for about 2-3 weeks, then I started experiencing problems with the remote.  It simply wouldn't work intermittently.  So I would futz around rebooting, removing batteries etc., and it would finally work.  Then even going through these machinations would not get the remote to work.  Then I replaced the batteries and the remote worked for a couple of days.  Then nothing.  I was able to control the Fire TV with my Ipad but not the remote.  After talking to three people at Amazon, they decided I needed a new remote and gave me a credit to cover the cost.  It arrived promptly and, you guessed it, it didn't work either.  I have spent enough time messing around with a simple device where there are so many other options available.  I went out and bought another Apple TV which works perfectly.  The Fire TV and the two remotes are being returned.  I gather from the reviews that my experience is not typical but I just can't waste any more time trying to get a dud up and running.", "verified": true, "helpfulness": "2/5", "author": "Anne E. Carlson"}]