[{"rating": 5.0, "review": "How can you not love this thing?? Especially if your a prime member this rocks. We cut out cable a year ago and yse only the fire tvz and a firestick in bedrooms. Can not complain. Crazy fast on both devices you get all your tv shows and movies. (Who cares if you need to buy a few new seasons of shows and movies, still cheaper than comcasts $180 a month)  Id say get the fire tv for the main room so you have the voice control. And the stick works just as great for bedrooms (just doesnt have voice control) big deal.", "verified": true, "helpfulness": "0/0", "author": "mitsuevors"}, {"rating": 5.0, "review": "Thrilled with the purchease! Easy to buy, fast delivery and the best in its class! Love it!I would recomand it to my family and all of my friends", "verified": true, "helpfulness": "0/0", "author": "Iulian Gutoiu"}, {"rating": 4.0, "review": "I had to replace the first one because it was always HOT on the bottom.It works pretty good, my biggest complaint is that the auto-shutoff takes hours, and that it is honestly easier to read the program descriptions on Amazon Prime while using the Roku 3!The Amazon Fire also does a horrible job at letting me know which eppisodes that I've already watched, which can be very frustrating.I expected more, but it is worth having on one of my TVs. I still wouldn't give up my Roku for this though!", "verified": true, "helpfulness": "0/1", "author": "J. Fenton"}, {"rating": 1.0, "review": "I purchased the Fire TV for the Prime Movies, however we are very disappointed in the quality of what is available. I would have  not purchased if I had know how poor the selections are.", "verified": true, "helpfulness": "1/2", "author": "jackatg450"}, {"rating": 5.0, "review": "Great for anyone who has Prime.", "verified": true, "helpfulness": "0/1", "author": "George Hatalosky \"trek guy\""}, {"rating": 3.0, "review": "I was hoping that I could access the Internet etc, but it's all Amazon all the time or the apps you want to purchase.  Plus so many of the shows were free prime shows when we first installed Fire TV  and it seemed overnight none of the.shows, movies, etc were included with prime, and everything is 19.99.  Feels like bait and switch.  Plus YouTube seems to be sensored.  I'd go with another more open TV Internet access route next time.", "verified": true, "helpfulness": "1/2", "author": "Carolyn"}, {"rating": 5.0, "review": "So far its awesome", "verified": true, "helpfulness": "0/1", "author": "william devine"}, {"rating": 4.0, "review": "WARNING, WARNING WILL ROBINSON.  Even if the movies specifies CC, in most cases closed captioning will not work.  If you select Netflix, you will have no problem but with an Amazon purchased movie, it probably will not work.", "verified": true, "helpfulness": "1/2", "author": "James R. Owens"}, {"rating": 5.0, "review": "better than our apple tv, seriously", "verified": true, "helpfulness": "0/1", "author": "Royal Mahogani"}, {"rating": 1.0, "review": "This item is CRAP! I only gave it 1 star because the program will not submit without a star. Customer service on this product IS No BETTER. I have purchased 50mbp to make it run, and it stillWon't! Also, the volume keeps cutting out! BUYER BEWARE!", "verified": true, "helpfulness": "1/2", "author": "Dawn Proffit"}]