[{"rating": 5.0, "review": "I just \"cut the cord\" and so far I'm happy!", "verified": true, "helpfulness": "0/0", "author": "Haunthouse"}, {"rating": 4.0, "review": "I love the apps you can add, but I don't love that my toddler managed to buy an app using the remote in less than ten seconds. Luckily it was easy to add a password.", "verified": true, "helpfulness": "0/0", "author": "Brigitte Hemmerling"}, {"rating": 5.0, "review": "This is the first streaming device we have purchased.  I was looking for something reliable and easy to use.  We have been very pleased with the easy to use functionality and the abundance of options for our viewing pleasure.  We spend a bundle of money every month on our satellite service and really do not feel like we watch enough to get our moneys worth out of the service.  I believe we have found a great option and could possibly be cutting the satellite cord soon.  Very happy with this product.", "verified": true, "helpfulness": "1/1", "author": "deedubya"}, {"rating": 2.0, "review": "When it's working I love it. However, I constantly lose Internet connection and it's very annoying. This doesn't happen with other devices in my home.", "verified": true, "helpfulness": "1/1", "author": "Valerie Garcia"}, {"rating": 5.0, "review": "Great entertainment stuff. Definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Vladimir Gherman"}, {"rating": 5.0, "review": "I bought this for an older friend of mine who used to be a little technology challenged, but with the ease of use on this device it was easy to hook up and get her started, and she loves it.", "verified": true, "helpfulness": "0/1", "author": "Parker T"}, {"rating": 4.0, "review": "Works well-does what it is advertised to do.  Price was right.  Can't go wrong.  Easy install.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Love it.  So easy to use. Thinking of getting rid  of cable!", "verified": true, "helpfulness": "0/0", "author": "BR"}, {"rating": 5.0, "review": "I purchased this for hopes that the hdmi input would provide a sharper image and was not disappointed. For the price, I was surprised that it not only works as well as an Apple TV or Roku, but better. Not only was the setup rediculously easy, my nine year old actually set it up, but the entire thing is so easy to navigate. It's probably the most user friendly thing of its nature.To break down individual things:1. The box itself is small and sleek, as well as the remote. In a house with four children the size of the remote may be a problem for us, but...2. Instead of purchasing the $40 amazon fire TV game controller I purchased a generic $12 Bluetooth controller. It works with all games, as well as if used as a remote, this is what i let my children use so I don't have to worry about losing the tiny one.3. It is much quicker than the Apple TV or Roku for downloading apps or games, as well as general streaming4. While I like the voice search feature, the one downfall is that it only searches the amazon store front. So it will not find anything in netflix for you.5. Speaking of netflix, the format is different than streaming from an iPhone, or wii. It's so much easier to navigate. The one downside to this is that until you are used to the remote its more difficult to get to the search page.I think this is a great alternative (and much cheaper) than buying a smart tv. Because it will also download photos and games, and because I have amazon prime as well as many digital movies I've purchased from amazon, it was definitely preferable to the Apple TV, which I have as well, and really is more useful for someone who has an extensive iTunes library.", "verified": true, "helpfulness": "1/1", "author": "MrsClifton"}, {"rating": 5.0, "review": "Fantastic device", "verified": true, "helpfulness": "0/0", "author": "Emerson Thrower"}]