[{"rating": 5.0, "review": "I love Amazon Fire and its selection of movies, however, I would also like to see my Bravo TV shows which I miss on cable(Housewives of Beverly Hills, etc., as well as more cooking shows).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have stopped using our Chrome Cast completely now that we have Amazon Fire TV.  We've been doing the no cable thing for about a year now and Chrome Cast was our first step.  Amazon Fire TV does everything and so much more.  We love being able to stream Amazon Prime content and the ability to play all of our Kindle Fire apps on the TV using the Amazon Fire Game Controller. It is easy enough for my 5 year old to navigate using the standard remote or just the game controller.  We are very happy with this device!", "verified": true, "helpfulness": "0/0", "author": "Hope"}, {"rating": 5.0, "review": "More selections than my smart (Internet) DVD player. Now I can let my previous HI-Q DVD player do it's job and let Amazon Fire TV give me the Prime Internet world.", "verified": true, "helpfulness": "0/0", "author": "GeoP"}, {"rating": 5.0, "review": "We are really enjoying Fire TV. We love the voice command and how easy the menu is to use! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Ms. Aaron Brown"}, {"rating": 5.0, "review": "those are you who familiar with XBMC I have to say amazon fire tv is 10x faster than apple tv 2. I installed the xbmc on amazon tv and as soon as I start the xbmc I said WOW its so fast. I am obsessed with xbmc and I have apple tv 2 raspberry pie with xbmc by far amazon tv is the fastest. so if you are looking to use xbmc look no further get the amazon fire tv. installing xmc on amazon fire tv is a bit of pain but if you are tech savvy you can do it. there are instructions on web how to do it. draw back is it has only 8gb hard drive good enough for everything but gaming. you only get 5gb available if you download few big games then you are almost out of space. usb at the back does not support usb flash drive yet. it will only support wireless keyboard and mouse. if you are paying for amazon prime for tv show and movies do not pay anymore and get xbmc on amazon fire tv and get much more then amazon prime. overall its the best streaming device out there and most powerful.", "verified": true, "helpfulness": "3/4", "author": "SAJJAD KOWSER"}, {"rating": 5.0, "review": "This amazingly small TV interface box now allows us easier access to Netflix and Amazon TV.  It was pre-set up for us and connected easily wirelessly to our router.  Its a great way to watch TV.", "verified": true, "helpfulness": "0/1", "author": "Joseph"}, {"rating": 3.0, "review": "I bought it because I didn't see the fine print about MLB.TV only \"coming soon\" and not already available. My kids and I enjoy the interface, but it'd be nice to--just once--find some free content on there. Every show is $2-3.If you're a movie watcher, it's great. If you think it's going to replace all the shows you watch on cable...that's still a long ways out IMO.", "verified": true, "helpfulness": "0/0", "author": "Lee Schwartz"}, {"rating": 5.0, "review": "I wish it let me limit screen time. I saw a review that said it could before I purchased it, only to find out they don't have that option currently. I read they may add that feature- it was the entire reason I bought this one so I hope they do.", "verified": true, "helpfulness": "0/0", "author": "Susie Khoury"}, {"rating": 4.0, "review": "Amazon fire tv has a variety of shows and movies to watch which is great. The only downfall is that you have to pay for each of the newer episodes in order to watch them. The screen saver pictures are gorgeous.", "verified": true, "helpfulness": "0/0", "author": "Julie Dempsey"}, {"rating": 1.0, "review": "I followed the instructions to the T and went back three different times..Finally i got to where i couldchoose a movie to watch,so i thougt. The movie started and played for a couple minutes till a roundcircle came up an the movie wet back to start.I tried three or four different movies and all did the samething so i disconnected the thing and put it back in the box.", "verified": true, "helpfulness": "2/10", "author": "willy lumplump"}]