[{"rating": 5.0, "review": "Great device, works perfectly with my tablet, my phone, my laptop and my friend's ipad.", "verified": true, "helpfulness": "0/0", "author": "Luis Eduardo Figueroa"}, {"rating": 4.0, "review": "I like the Chromecast, hopefully they will add Vudu. After done a bit of search I find out that the chromecast might have its own internet connection, the reason is because when I try to play music or videos stored on my tablet's micro SD card I got an error. I thought it was supposed to mirror my tablet or phone on my tv, but it seems to fetch the URL's sense it can only play content from the internet. I don't like that I can't turn it off, I search for an answer with no luck. Overall its a decent device, it still needs more apps but that's what updates are for and maybe they will add the function to turn it off.", "verified": false, "helpfulness": "0/0", "author": "Axon"}, {"rating": 1.0, "review": "does not work well", "verified": true, "helpfulness": "0/2", "author": "keithGmail"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "be careful using with open wifi", "verified": true, "helpfulness": "0/2", "author": "Keith Breeden \"Keith Breeden\""}, {"rating": 1.0, "review": "Finally bought one from RS for $15, based on good reviews. After using it a few times, I wanted to throw it away.I have two fire sticks, two Apple TVs, one fire TV, Chrome cast is the worst of all.1. Without a proper device, Chromecast can not do anything. Not like other devices, they all have builtin apps such as Netflix, Hulu, YouTube etc.2. No remote. No way for my parents can handle this.3. OK, it is called cast, but it can not cast anything smoothly. I tried to cast with MacBook Air , with a Dell Venue Pro, and with a i7 based windows PC.  The display on the computer monitors is smooth, but on the tv it connects too, the display is slow, jiggering and lost connect eventually.4. The number of apps can do cast is very limited, you can do most of them on firetv stick locally, no extra device needed.5. The android device mirroring is laughable, only a few elite devices can do the mirroring, less than 30. None of my samsung/nexus/acer tablets in the list, and none of my htc/lg/moto phone can do it.Clearly it is a overrated junk, it does not worth even $15.", "verified": false, "helpfulness": "0/3", "author": "Spencer"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "Israel"}, {"rating": 4.0, "review": "works perfect hooked all my devices to it, some apps require you to purchase but alot are free", "verified": true, "helpfulness": "0/0", "author": "Gerald Lyman"}, {"rating": 5.0, "review": "Love my chrome cast works as good or better than I x.pected lots of apps and extensions available", "verified": true, "helpfulness": "0/0", "author": "steven r fredrickson"}, {"rating": 5.0, "review": "Works well.", "verified": true, "helpfulness": "0/1", "author": "christine"}]