[{"rating": 1.0, "review": "I bought this for my android tablet and hoped it will support \"airplay\" or \"mirroring\"-like function for the tablet.I was disappointed to find out. It did not support mirroring like function. I bought a Micracast stick instead.", "verified": true, "helpfulness": "1/1", "author": "Techy A."}, {"rating": 1.0, "review": "I Could not get a signal. I set it up properly at different locations and it Never worked. Waste of my money. I want my money back!", "verified": true, "helpfulness": "0/0", "author": "Michael Casinelli"}, {"rating": 5.0, "review": "This is perfect to transform your tv into a Smart tv, and is very easy to set up even for me!", "verified": true, "helpfulness": "0/0", "author": "Gramma kitty cats"}, {"rating": 5.0, "review": "I have now purchased 2 Chromecasts.  I have one in my living room and one at my girlfriend's house.  Setup of the Chromecast with Netflix and HBO Go on our Android cell phones couldn't have been easier.  Now, either one of us can log in and take control of either TV... which allows us to see our own queues, and also pick up where we left off on either TV.  I don't think you can do that with the other more expensive hardware options (Roku, Apple TV, etc.)A downside for some of you:  Chromecast cannot natively support Amazon streaming, and I don't think it is likely ever to.  If you're a techie I have read that you can get it to stream through Chrome internet browser on your device with a little tweaking, but I have not personally tried that.", "verified": true, "helpfulness": "0/0", "author": "Bill T. \"- Bill Treichel\""}, {"rating": 5.0, "review": "Keep it simple, Google.The best TV interface to internet content is no interface...leverage off the already well developed apps built for android and the iPhone...brilliant", "verified": true, "helpfulness": "0/0", "author": "Bob Balinsky"}, {"rating": 4.0, "review": "This device is absolutely phenomenal for the price it is at. My friends and family are speechless when they watch me control everything from my phone. The device is fast, responsive, and doesn't lag. There is really not an noticeable latency between the time you select something on the phone and the time it reacts on the screen. Even if you do notice it, it is so small it doesn't bother you. 4 stars because A. you can't cast Chrome internet videos from your phone to your chromecast (Well, actually, it is in Beta mode, so it will get released.... eventually).  B.I wish there was an option to cast what you are browsing on your phone to the chromecast. I would love to wake up in the morning and read the news on my TV versus my computer or phone. C. Although they have a good selection of apps, they need more. Chromecast offers NOTHING compared to what you can get on Roku which has dozens upon dozens of channels. Chromecast is still an infant, but hopefully time will let it grow up in to something great", "verified": false, "helpfulness": "0/0", "author": "Mitchell"}, {"rating": 5.0, "review": "How did we ever watch TV before?My kids use it. My wife loves it.Will get one for my parents.Thx!", "verified": true, "helpfulness": "0/0", "author": "Mrjrm63 \"Mrjrm63\""}, {"rating": 3.0, "review": "It worked fine at first, but then lately it kept loosing connection in middle of streaming.  I have to power cycle to re-establishing the connection.", "verified": true, "helpfulness": "0/0", "author": "Son T. Nguyen \"Sonny Nguyen\""}, {"rating": 1.0, "review": "I bought this and just opened the box this week. All that came with it was the dongle. There was no USB cord and no charger as shown in the photos. I am very disappointed and without the proper parts, cannot get this to work.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "I spent a long time trying to decide between this and a Roku, and finally went with Chromecast. I'm so glad that I did! It's nice and small and streams everything I've tried so far (Netflix, youtube, Pandora, Plex, Google music) The only thing I did have a little trouble with was streaming video on Amazon, but if you just change your video settings on your browser to flash instead of the default Silverlight, then it works just fine (thought there is a very slight lag between what's playing on, say the computer, and the TV, but you wouldn't even notice it unless you were seeing it on both). It can be powered either through USB or from a wall outlet, which is nice for TVs that don't have a USB connection.  I stream mostly from my phone and so far haven't had any problems. Great buy for the money!! :)", "verified": true, "helpfulness": "1/1", "author": "Apartment42"}]