[{"rating": 1.0, "review": "Got it to work once and never again could I get it past my routers firewall.  Plus navigating the web without a keyboard, touchscreen or mouse is not ideal.", "verified": true, "helpfulness": "0/0", "author": "Sgreg"}, {"rating": 2.0, "review": "When it works I love it.  The first week was great, then I was gone for a few weeks and the next couple of weeks since then every day I have to unplug and plug in chromecast for it to show up on my tv.  I also have had troubles casting since then and need to close down all the apps, reopen them and try to recast and that usually works.  If it had no oddball bugs every single day it would be great, but... This was really just to test it out anyway, it pretty much failed, so... Getting 2 Apple tv's to replace it and sending my chromecast to my guest room or workout room instead.", "verified": false, "helpfulness": "0/0", "author": "Lrdmn"}, {"rating": 5.0, "review": "Love it.  We love watching Youtube, viewing pictures, and everything else on the big tv.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 1.0, "review": "i would never recommend this product to anyone! It rarely works, when it does play the icon will disappear on my device making it impossible to control what I'm playing.Not worth the money or the time you'll spend fighting it.", "verified": false, "helpfulness": "0/1", "author": "Lizzz"}, {"rating": 4.0, "review": "Sweet", "verified": true, "helpfulness": "0/1", "author": "dan"}, {"rating": 5.0, "review": "100% great", "verified": true, "helpfulness": "0/1", "author": "Deon Grant"}, {"rating": 1.0, "review": "return,Defective.Amazon charged restock fee despite a defective item. BAD not recommended. Chrome get too hot and cannot function.", "verified": true, "helpfulness": "0/1", "author": "Kenny"}, {"rating": 5.0, "review": "under valued product. they should charge 4 times the price...we love what it can do", "verified": true, "helpfulness": "0/1", "author": "Yoman"}, {"rating": 3.0, "review": "Device was ok. The short HDMI extension came with the device have some problem. After connecting thru that, Chromecast is not getting read and fluctuating.Chromecast has little problem of limited app support. But can be used from laptop browser. You need a high speed internet (more than 20mbps) to use that.", "verified": true, "helpfulness": "0/1", "author": "Lucky"}, {"rating": 5.0, "review": "Christmas gifts for all. I bought Chromecast last year, then I received one in a gift bag. One on each TV. I use them every day.", "verified": true, "helpfulness": "0/1", "author": "Cheryl Lawson \"cheryl\""}]