[{"rating": 1.0, "review": "Could not get the unit on my wireless network.  Spent 2 hours on tech support, they sent me a new unit same problem.  Bough a new phone at the same time and was able to get on my witless network in 1 minute.  Sent the replacement back for refund.  But since I lost the box on the original, I could not return.  Buyer beware.", "verified": true, "helpfulness": "2/7", "author": "Gilbert Oswald"}, {"rating": 5.0, "review": "Super smooth! Easy to use and it has a great look. Makes amazon super convenient!", "verified": true, "helpfulness": "0/1", "author": "Tiffany Dillon"}, {"rating": 3.0, "review": "This is is just written as a word to the already wise.  AMAZON FIRE TV requres a direct HDMI connection from the unit to the TV. Previously I had been enjoying a hookup with my Kindle Fire HD to my older HD TV. I was using a HDMI2AV converter from my Kindle Fire( which required a Mini HDMI  connection). The converter to the  red/white/yellow  input required by my TV worked great, Great picture.. Movies looked great. Sounded Good.  I ordered the Amazon Fire TV unit thinking I would use a similar converter connection to my TV. Just received it and the setup did not work. Called  Amazon Help about it  and they told me that although adaptors work great  for that type of connection with the Kindle Fire HD, it Does Not work for the FIRE TV.  I do not have issues with the Fire TV, just wanted to send out a warning to save someone from having to return like I will.", "verified": true, "helpfulness": "1/2", "author": "AlexZ"}, {"rating": 5.0, "review": "Love the interface.  We use it so often that we are planning to purchase a second device for a different TV.  Worth the money!", "verified": true, "helpfulness": "0/1", "author": "Bethimus"}, {"rating": 5.0, "review": "This is amazing technology and the remote works great and better than all expectations.  Amazon television is the way to go - we are Prime members for life.", "verified": true, "helpfulness": "0/0", "author": "Mr. Edward C. Muckerman \"The Andrews Agency\""}, {"rating": 5.0, "review": "I am really enjoying this product and the shows I'm able to watch. I love the search option. I've also enjoyed listening to music through several stations - local and non-local.", "verified": true, "helpfulness": "0/0", "author": "Valerie L. Sperka"}, {"rating": 2.0, "review": "i bought amazon fireTV a month ago, i was impressed by the specs. I had been using my samsung TV or DVD player to watch netFlix and they were OK, with the specs of fireTV i thought this would blow them out of the water. That is not the case. I would not recommend this device unless it is your only option. My fire TV device freezes during playback, not all the time but a couple times per week. When it freezes i unplug the network cable from fireTV and plug it back into my samsung smart TV and continue watching my show. It does have a cool interface, the speech command works sometimes.My recommendation is to steer clear of this device and wait for android TV, should be just around the corner. I am going to sell this device or give it away when android TV comes out.", "verified": true, "helpfulness": "1/3", "author": "thorzhammer"}, {"rating": 1.0, "review": "Arrived on time spent 2 hours on the phone with tech support because it never worked. Finally gave up and returned the FIRE and bought a streamer without issues", "verified": true, "helpfulness": "2/7", "author": "lm"}, {"rating": 5.0, "review": "We use this every night. Super easy to connect and great selection of shows and movies to choose from. If you subscribe to Amazon Prime you aren't getting the most out of your membership unless you have Amazon Fire TV at home...great product!", "verified": true, "helpfulness": "1/1", "author": "Kelly Bird"}, {"rating": 4.0, "review": "Setup is VERY easy. A/V quality is EXCELLENT.Speech recognition works very well for looking up content.Audio/Video casting from Fire HDX needs to work better (Less hit & miss connection, faster connection, and elimination of problems with either device on disconnect.)Needs a Web browser, Facebook...  (It needs to have all the standard class/type of APPS that a major MFGR Smart-TV offers)Needs to support ALL keyboard characters for passwords. Not asking for extended ASCII, but it does need to support all the normal special characters (Except colons, slashes, pipe....)  !@#$%^&*()_+[ } { }< >NEEDS!!!! >>> MUST HAVE <<< the NEW Amazon Music Player ASAP!!!!!!!!!!!(Miri-casting from the Fire HDX works, but this is a cludgy work around for something that needs to be added  right now.)Being able to used my android devices for apps that are keyboard intensive is nice, but I look forward to a full sized, or well crafted miniature, wireless keyboard for keyboard intensive apps, which I hope to see a LOT more of in the future.---------------------------------------------------------------------------------------------------------------Update: The music player now is available.Unfortunately, it only plays content that one has uploaded. It does not yet support Prime Cloud content.", "verified": true, "helpfulness": "1/1", "author": "Helping Hand \"Dan G.\""}]