[{"rating": 1.0, "review": "Whether it is your person digital video collection, vacation video's, wedding video, or your child's Birthday video, The Fire TV will not let you view them on your TV.  So much for a single point to view all your content.  This is a huge flaw with the amazon fire TV.  The Xbox 360 and the Roku 3 both do this (within limited formats).  I fully expected Amazon's next version of Chromecast to do a lot in this area.  I believe is Amazon is not going to add any functionality that will not put coin in their pocket every time you use it.  I would recommend holding off buying a Fire TV until they support local video.", "verified": false, "helpfulness": "3/22", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Amazon Fire TV gives one an easy and enjoyable way to watch movies, TV programs, etc. available on Amazon Prime on the wide screen TV.", "verified": true, "helpfulness": "1/1", "author": "Mrs. Hall"}, {"rating": 5.0, "review": "I find this to be a great bargain for entertainment.  I already was a prime member but never took advantage of the free videos because I usually like to watch television while I'm on my laptop.  To take advantage of the videos, I'd have to hook my laptop up to the TV and that was too much of a pain.  This little box is great.  I lined up everything I want to watch in my watchlist and when I have free time, click.....something to watch without having to scroll thru the channels on the TV.  Thinking about cutting way back on the cable TV too......don't need all those channels now that I have so much content at my fingertips with Fire TV.", "verified": true, "helpfulness": "3/4", "author": "Kim Kilmer"}, {"rating": 2.0, "review": "As a Smart TV owner and heavy user of Netflix and HBOGo, I didn't find any benefit from Amazon Fire TV since the search doesnt consider these apps into account. I am also wondering if I can directly stream  my laptop content to my TV by using Amazon Prime, since it'd make my life easier especially when I need to watch movies on my TV.", "verified": true, "helpfulness": "1/8", "author": "Saurabh"}, {"rating": 4.0, "review": "I really like the Amazon fire tv :)...........I like all the apps and shows provided ...pleased customer here for sure", "verified": false, "helpfulness": "1/1", "author": "Julie Anne Noriega"}, {"rating": 5.0, "review": "I have not tried all the features, but I have hooked it up, used the voice feature, and watched a movie or two using Amazon Prime service. Worked flawlessly. Tried a couple of other apps, e.g. You Yube and that too did not show any problems. Remote Control is really sleek and works flawlessly.", "verified": true, "helpfulness": "2/2", "author": "Majed Anani"}, {"rating": 1.0, "review": "This was my second unit.  My first unit works perfectly so I ordered another one.  I was concerned about the RF remotes conflicting with one another, but that wasn't a problem.  Seems each remote only works with the unit it registers too, so that's great if you have more than one unit.  My problem is Amazon Fire TV doesn't work with all Flatscreen TVs.  I have a cheaper model of TV in a guest Bedroom that will not work with this unit.  It has two HDMI connections but I think the Amazon Fire TV Unit will work with newer, full HD TVs, because my two 720p flatscreens in my guest rooms will not display any video feed from the unit.  I gave it a One Star Rating because it should work with all Flatscreen Panel TVs.  Google Chrome worked with these TVs so I'm not sure why the Amazon Fire TV unit failed.  I used it on my Samsung, Hatachi and Vizeo TVs with no problem, but the off-brand TVs was no-joy.  I had to return it because this is the room I need to use it in and it's not worth replacing the TV as I can buy a Smart TV for the same money as anoother TV AND the cost of the Amazon Fire TV unit.  Google Chrome was too much trouble because it has no remote and my Guests would have to program their Smartphones to get it to work.  Not a good idea.  Google Chrome should offer an optional remote.  I'll just keep using my Wii Console for now to get Netflix, etc.", "verified": true, "helpfulness": "3/21", "author": "Sherrie D."}, {"rating": 2.0, "review": "Product not ready for continuous operation. Failed voice. Then entire unit failed. Too expensive, if only single sources for videos.", "verified": true, "helpfulness": "1/6", "author": "C. W. Burke"}, {"rating": 5.0, "review": "For all the people complaining about the fact that HBO GO is not on the Fire, here is a partial post from Forbes.com...\"In addition to the HBO content becoming available to Amazon Prime subscribers, HBO has also agreed to make HBO GO available on Fire TV (a device that plugs into your TV and allows you to stream online content), and is aiming to launch that feature by the end of the year.\"", "verified": true, "helpfulness": "5/5", "author": "A Texas reviewer"}, {"rating": 5.0, "review": "I was reading an article about the future of cable TV and I would have to say this is the future.", "verified": true, "helpfulness": "0/0", "author": "Tad"}]