[{"rating": 2.0, "review": "If you're on a budget, get this. You can put a lot of content on your phone onto your TV.If you have some money to spend, there are better options. Like the Apple TV.Each has their pros and cons, but for me, the cons of the Chromecast are a deal breaker.The main con for me, which I thought would be a cool thing, is you have to use your phone or tablet. I like using it as a remote, but I don't like needing to.If you start a movie and your wife, husband, friend etc wants to pause it... hand over your phone, have them unlock it, open the app you're using it, wait for it to load, then hit pause.Or, buy a device that accepts IR or RF and use your dedicated remote.In addition to this annoyance, I couldn't for the life of me get 5.1 surround to work, and the wifi performance is not great. Sometimes it would stutter or pause momentarily.It's potentially great for travel. It's very easy to setup. It has great picture quality when it's not stuttering.", "verified": false, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "works great! I love it", "verified": true, "helpfulness": "0/0", "author": "madame"}, {"rating": 5.0, "review": "Love the stick.  I don't stream a lot with it because I use it with a Google TV that can already do most of it.  It did add some capabilities like hulu Plus and Amazon Instant that my old Sony Google tv did not support", "verified": true, "helpfulness": "0/0", "author": "Andrew Ray"}, {"rating": 4.0, "review": "works good at home. cant give it 5 stars because this does not work in hotel rooms!", "verified": true, "helpfulness": "0/1", "author": "john failla"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Gerardo Jeronimo"}, {"rating": 5.0, "review": "Super simple to use and cheap to boot. Great product.", "verified": true, "helpfulness": "0/0", "author": "Blake Boren"}, {"rating": 5.0, "review": "I like it. I didn't like the roku taking an extra outlet, and since I only ever use YouTube, Netflix, and HBO Go, this worked perfect since I can plug it into my TV's USB port for power, and use my iPad to control what I watch instead of yet another remote. However, I opted to get an Apple TV to be able to cast movies and such directly from my macbook.", "verified": true, "helpfulness": "0/0", "author": "Steve G"}, {"rating": 4.0, "review": "Great product actually. Would be cool if it streamed from 4g.", "verified": true, "helpfulness": "0/1", "author": "raymond ramos"}, {"rating": 5.0, "review": "Love it!  I was tired of hooking up wires to watch Netflix on our TV.  This not only fits the bill, but grandkids saw it work and immediately put it on their Christmas wish lists.  Only wish that Amazon would allow their instant watch movies to be viewed through it.  I tried adding the Chromecast extension to work around Amazon instant watches, but the program installation was immediately found to have malware.Easy to install, easy to use!", "verified": true, "helpfulness": "0/0", "author": "S. Bess"}, {"rating": 1.0, "review": "The worst gift i received this year", "verified": true, "helpfulness": "0/4", "author": "Lionel M. Lunsford"}]