[{"rating": 5.0, "review": "Changed the way we have our entire home setup.  These allow for wire free media entertainment to all out TV's in the house from music, to videos, to games and movies.  Easy to use and new applications and support coming out all the time.  Plus, when not in use, the pictures, weather and time are a nice addition.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 1.0, "review": "I'm not impressed.  The main reason I bought this was for the \"screen mirroring\" function.  This function is a beta feature and only works with a few phones and tablets, NOT any Bluetooth device.  Also, as reported by many, I have frequent problems with it freezing and loosing connectivity.  I think it may be related to heat buildup, because I have noticed that with a 2 hour movie, it is somewhat better until it gets to be about an hour or 1.5 hours into it, and then it freezes much more frequently.", "verified": true, "helpfulness": "1/1", "author": "Patrick T Heppert"}, {"rating": 5.0, "review": "dont use much with the new smart t.v.s that are out.", "verified": true, "helpfulness": "0/0", "author": "Jay E.King"}, {"rating": 5.0, "review": "Makes my family watch", "verified": true, "helpfulness": "0/0", "author": "Shariff"}, {"rating": 5.0, "review": "Pretty cool--I'm moving away from cable and this was a great deal!", "verified": true, "helpfulness": "0/0", "author": "My3sons"}, {"rating": 1.0, "review": "I bought one and it was completely useless. I get the same result by plugging my computer up to my TV. :( Don't waste your money!", "verified": false, "helpfulness": "0/1", "author": "Bonnie Holder"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Vera Nechitilo"}, {"rating": 5.0, "review": "Great to take on a trip to plug into a hotel tv.", "verified": true, "helpfulness": "0/0", "author": "James Price"}, {"rating": 5.0, "review": "Love this product. I have purchased 3. 2 for myself and one for family. So easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "brownie06921"}, {"rating": 5.0, "review": "Great experience. Works flawlessly. We use it mostly for netflix. Problem is an older Android phone will not be compatible with netflix app. We have iPad, iPhone, Android tablets and s4 phones that work perfectly.", "verified": true, "helpfulness": "0/0", "author": "loopnh"}]