[{"rating": 5.0, "review": "I bought this as a gift for my husband. He says it is one of the best gifts I've ever given him. The whole family loves it.", "verified": true, "helpfulness": "0/0", "author": "shoediva"}, {"rating": 5.0, "review": "Very user friendly!", "verified": true, "helpfulness": "0/0", "author": "Pamela Nichols"}, {"rating": 5.0, "review": "Amazon delivers!This device does exactly what Amazon says it does.Pro:-It connects to Plex, my media server and streams All content in a vast verity of formats without issue Or lag. Con. ( for Plex) you need to buy Plex app for the Fire unless you are a Plex Pro member.-Smaller size than I thought! This thing is tiny!! It generates little heat and all connections are easy to access.-Supports legit 1080p video and 7.1 audio! Many other Media Players claim to do this, but the Fire actually does!-Con: Amazon intermixed Prime content with non-Prime content. Make sure you setup a PIN!! Otherwise, kids will easily purchase movies, shows, and/or apps!!AMAZON: I hope you read this... You need to add a \"Find my remote\" feature to the Fire (via an external physical button?) and some sort of loud buzzer to the controller!! Little fingers will make the standard remote disappear Fast! Help a single dad out and add this feature, please!!", "verified": true, "helpfulness": "1/1", "author": "_Tix_"}, {"rating": 5.0, "review": "I love the Amazon Fire!!!! It truly is simple to hook up & then you instantly stream! As long as your TV has an HDMI port, you just hook that up, plug the Fire in for power, put in your Wi-Fi password & start watching!! Worth every penny! Love love love!!!!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Online shopaholic!!\""}, {"rating": 5.0, "review": "Great product.  Easy to use and masterfully designed", "verified": true, "helpfulness": "0/0", "author": "Terry Hedstrom"}, {"rating": 4.0, "review": "Batteries are used up fast Suggest removal after each use of the remote.", "verified": true, "helpfulness": "0/1", "author": "Papa T"}, {"rating": 4.0, "review": "The only thing I don't like about the fire tv is that I can't physically turn it off.", "verified": true, "helpfulness": "0/0", "author": "Juan Jaquez"}, {"rating": 3.0, "review": "I bought the Fire TV because I recently joined Amazon Prime and have been on Netflix for years. We hate that Netflix doesn't add many new movies, so we thought we would try something different. Prime does have different movies than Netflix, but not a lot of great movies - unless you want to rent them. The prices seem to range from 3.99 to 5.99, which seems high since i alredy paid for membership.", "verified": true, "helpfulness": "1/1", "author": "Jim"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Tex"}, {"rating": 5.0, "review": "It was the easiest setup imaginable. I couldn't be more thrilled. No issues what's the weather and I would recommend it to anyone with high speed internet.", "verified": true, "helpfulness": "0/0", "author": "Chris"}]