[{"rating": 5.0, "review": "Quick shipment, item was in good order and ready to use when received.  Plan on getting good use out of it.", "verified": true, "helpfulness": "0/0", "author": "Brian E. Martin"}, {"rating": 5.0, "review": "If you don't have one of these yet, you're doing it wrong. Get one....or two, or three. I have one for every TV in our home, including the TV I purchased to go with one of them.... Yes, I got the 3rd Chromecast before the TV. That's how amazing these are. Bring them home in boxes. Bring them home in cases. Hook one up to your dishwasher, your fridge, your shoes! You can never have too many Chromecasts!", "verified": true, "helpfulness": "0/0", "author": "Daniel Panichelli"}, {"rating": 4.0, "review": "The unit was easy to install and works well with my iphone.  Unfortunately does not work with mylaptop which is an older version with Vista operating system.  Would also llike it to work with moremedia.  At this point it has uTube and Netflix.  Needs to enable use of Amazon prime videos withoutowning a Kindle.", "verified": true, "helpfulness": "0/0", "author": "Linda DeCesare"}, {"rating": 5.0, "review": "if you want to get rid of cable and want to watch movies or tv series, this is the adapter to get. easy setup and you can control it with any of your media devices. works great with netflex and hulu..", "verified": true, "helpfulness": "0/0", "author": "ken"}, {"rating": 5.0, "review": "I use it all the time and Chromecast keeps expanding their apps that are compatible and I have been able to view my personal photos and videos.  It really comes down to how strong your wifi signal is.  If it's buffering a lot, then maybe your signal isn't strong enough.  The clarity is awesome!", "verified": true, "helpfulness": "0/0", "author": "Nikaroni"}, {"rating": 5.0, "review": "Google has done it again.  Now you can stream content from your Android, IOS or computer to your TV.  Netflix, YouTube, Chrome browser and many others are supported.  I expect that all content providers will be on board soon.", "verified": true, "helpfulness": "0/0", "author": "Terry A Benner"}, {"rating": 5.0, "review": "I got this with a little scepticism about how reliable it is, but it works well, I can see movies and videos from Netflix, Hulu, Youtube in my TV, watch my favorite TV chapter from my Iphone or ipad. It works", "verified": true, "helpfulness": "0/0", "author": "Boris Milan \"borism\""}, {"rating": 5.0, "review": "Bought this as gift for my son, who has very everything and he was very pleased with his new gadget.", "verified": true, "helpfulness": "0/0", "author": "Teresa Sanchez"}, {"rating": 5.0, "review": "Great little addition to any TV.  easy to setup, easy to use.  I know the apps that support it are pretty limited, I mainly use it to supplement my roku because it doesn't give me the youtube fix that I need.  This little guy can play all the cat videos I can find!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Shooting Newbie\""}, {"rating": 5.0, "review": "The amazing part of chromecast is that it automatically removes the commercials on the Youtube and Netflix. The streaming is smooth and fast. Rarely does it delay.", "verified": true, "helpfulness": "0/0", "author": "Happybuyer2013"}]