[{"rating": 5.0, "review": "I live in Tijuana, so I needed a player that would work internationally.I first bought a Roku 3. It included several channels, but no Netflix. I returned it and bought the Chromecast instead.My daughters love it. They have Samsung tablets, and control the TV with them (you don't get a remote control, so you must have a computer, tablet or smart phone to communicate with the device).If your TV has a USB port, you can connect the device to an HDMI port and then power it from the USB port. Great solution. If you turn on the TV, it turns on. Turn the TV off, and you turn off the chromecast. No need to stop the movie before turning off the TV. You can also connect it to a wall, but then you would have to stop whatever you are watching besides turning off the TV.You can add an extension to Chrome (the browser) on a PC, and share your browser with the TV.A great product.", "verified": false, "helpfulness": "0/0", "author": "Armando L. Franco Carrillo"}, {"rating": 3.0, "review": "I like the Chromecast idea.  You need your laptop or a smartphone for it. I want to see more apps, but sometimes you end up on sites and you will see the icon for Chromecast which means you can stream it to your Chromecast/T.V.  That being said it has also asked me if I wasn't to stream to my Roku.  If you have a smartphone and only want about a half a dozen apps for video this is for you.", "verified": true, "helpfulness": "0/0", "author": "Three quarters full \"Thanks for Reading - Deekster\""}, {"rating": 5.0, "review": "I use this on my non-smart LG TV and it makes it a smart TV. My provider is Directv and it does not intefere with it at all. I also use this with Amazon Prime and stream my videos. I just had to change the preferences to make it work. You must change the preference for downloading which defaults to Silverlight. You do not want silverlight. Make the other choice and you can use your Amazon Prime membership with this to stream videos. I bought this one day before the Amazon Fire Stick was introduced. Oh well! That is OK, I bought that too, at the membership price for my other TV, so I will compare the two of them. Very happy so far with Chromecast", "verified": true, "helpfulness": "0/0", "author": "Peeky"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "sultan Alothman"}, {"rating": 5.0, "review": "We love our Chromecast! If I get a TV for the bedroom I'll add one there too. We have basic cable (plus HBO), and usually have a laptop plugged into the TV as well, but usually utilize the Chromecast more than anything thanks to HBO GO and our Netflix account. The only thing I added on was a 3-port HDMI switcher that allows us to switch from Chromecast, laptop, and PS3 with a little remote. Love the product, and super cheap!", "verified": false, "helpfulness": "0/0", "author": "Jennifer D Keele"}, {"rating": 4.0, "review": "Great product if you are using services that have casting imbedded in their apps.  Netflix,Hulu, YouTube, Google Play work great.  However, if you are casting from your device to the Chromecast, there is a noticeable lag.  Android products and iTouch/iPad work great.", "verified": false, "helpfulness": "0/0", "author": "Rudy"}, {"rating": 5.0, "review": "I have an Apple TV already but for the price, I was curious to try out the Chromecast. It works really well and I use my PC to share the Google chrome browser. I also use my iPad and Android devices to cast to the TV. Works as expected. The only hiccup was trying to share Amazon Prime video which only works from the Chrome browser on my PC. You have to adjust your Prime video settings to Adobe Flash and turn down the HD setting so it doesn't lag (unless your internet is ridiculously fast). Great value and performs as expected.", "verified": true, "helpfulness": "1/1", "author": "thephotopeddler"}, {"rating": 4.0, "review": "It has changed the way we watch movies, making it more engaging, and its easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works really well to stream Netflix from my tablet, average price.", "verified": true, "helpfulness": "0/1", "author": "Plewster"}, {"rating": 5.0, "review": "Love. It. Able to see all my videos.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]