[{"rating": 4.0, "review": "I was a bit skeptical that I would like this but I bought this at my local Best-box retailer with the intent to give the system a try. Mainly I wanted a streaming box for Amazon Prime content.Thoughts and observations:- much has been hyped about the Voice Search function. As many have said, it only searches Amazon content at this time. So it won't give you results for your favorite TV show on Netflix or Hulu for example. If you want something like that, I hear Roku does it better.- getting this primarily for Amazon Prime content, I was a little surprised how Prime content is somewhat downplayed in the system. Rather, you'll find paid options much more easily than free Prime content. For example, you see a movie you want to watch and the menu offers paid rental and purchase movie but you have to click on \"more ways to watch\" before finding the free Prime option.- Bluetooth remote- I have a one remote setup (Harmony Smart Control) and hate that there is no IR receiver on this. There are workarounds for this such as FLIRC and Ortek Media Center Remote. These work because...- The USB port DOES have some functionality. This is a GOOD thing. You can hook up a USB keyboard and navigate the menus and I have read that if you put a wireless keyboard dongle (NOT bluetooth) that works too. That's why the above noted IR receivers can work. Also, you don't NEED the bluetooth game controller from Amazon. My spare Xbox 360 controller plugs in and works with games just fine.- I'm a long time Apple TV user. I do find the Fire TV more enjoyable to use. I feel like the Fire TV UI is more amenable to DISCOVERING new content... Also, this allows what I've always wanted AppleTV to do which is download and install third-party apps and extend its function.- Music options at this time are weak. I don't have a lot of music in the Amazon ecosystem and on top of that Amazon music apps are not avaiable at this time. Anemic selection of music apps right now (TuneIn, iheart radio, pandora). BUT...- There are apps to enable Airplay on this. I have used these apps to play Spotify and Songza and that works pretty well. (Airplay-ing video from iPad to FireTV is spotty at best, however)- Plex! As is, this box DOES NOT do a good job at letting you use your own local files. (I think WD TV does better according to its reviews) If you have a computer set up with Plex Media Server, however, you can download a Plex app client to run. Works well on my system.- Inconsistent Dolby Digital Plus audio - does not function in Plex, works in some Netflix (when content labelled with \"5.1\"), works with Amazon Prime---------------Revised (7/2/14)- turns out often Amazon Prime IS the default option when playing up some Amazon video. Its just not really displayed as such and can be confusing whether you are paying for something or not.- turns out Harmony Smart Control (or I believe any newer Harmony remote with a Smart Hub- although I can't test that) can control the Fire TV.------------Revised (7/15/14)- a new software update for the Fire TV was delivered to my box. Amazon has added a \"Prime Video\" category to the main screen which makes free (with Prime) content from Amazon more accessible. Big plus! I think this shows Amazon is listening to customer comments!- Amazon Music Cloud Player has been added. The music player is very nice. Shows lyrics on screen with songs. Still no Prime Music though. Still waiting for the Spotify app.- I have directly compared this to Roku 3. Roku 3 has a lot going for it but I actually like flipping through Amazon Prime content on FireTV much better than Roku. Gaming still better on FireTV.- Freetime now available. Don't use it and no plan to use it anytime soon.", "verified": true, "helpfulness": "0/0", "author": "Eric P"}, {"rating": 1.0, "review": "Was on the phone with two separate Amazon customer tech people who could not help me get this up and running. Got it connected but it wouldn't work. They seemed helpless. Very frustrating experience. Sent it back. The return people were very nice and accommodating.", "verified": true, "helpfulness": "2/7", "author": "J. Shaffer \"Jim Shaffer\""}, {"rating": 5.0, "review": "Great product so far.  Does exactly what I wanted it to do.  I run xbmc on this and it works perfectly.  Much smaller than my old setup and also much faster.  The remote works great and the voice recognition is pretty cool.  Although I wish the voice searches would include netflix titles somehow.", "verified": true, "helpfulness": "0/0", "author": "Cole W."}, {"rating": 4.0, "review": "I really like this I am a prime member so I did see more free choices.  I think the prime free choices should be listed by themselves.  The only negative I have is finding something you want to watch and it is a rental.", "verified": true, "helpfulness": "0/0", "author": "Telly"}, {"rating": 4.0, "review": "Great easy setup.  Works better than my old roku.  Just needs a way to filter prim only and it would be five stars.", "verified": true, "helpfulness": "0/0", "author": "Dot"}, {"rating": 3.0, "review": "This is a great product. Setup was simple, somewhat fast, and navigation is excellent. Search works great, but that's where my biggest complaint is, and where I see the biggest oversight by Amazon.Search (voice or text) ONLY searches Amazon content.  Netflix, Hulu, and even my own video server are not included in the searches.  So if looking for a specific movie or show that may be free on one of the other services, it only shows me the Amazon content, not the free content or content on other sources. If this not an oversight, then Amazon is doing it for purely business purposes, and soon enough I'm sure there will be a competitor without this limitation.  If Amazon does not have this fixed by then, I'll probably switch.Until then, it's clean, easy, and convenience as a media content viewer.", "verified": true, "helpfulness": "0/1", "author": "Cronjob"}, {"rating": 5.0, "review": "My husband loves this, it didn't take him long to work the instructions out.  Would recommend it if you don't have other units to download on.", "verified": true, "helpfulness": "1/1", "author": "margaret patterson"}, {"rating": 5.0, "review": "All good", "verified": true, "helpfulness": "0/0", "author": "Art \"Art\""}, {"rating": 2.0, "review": "Amazon Fire TV advertises voice-search capability. What you're not told is that it works only with Amazon Prime. It does not work with YouTube or any other app, which seriously diminishes the efficacy of that feature.The user interface is deficient, making it very hard to search for movies in Amazon Prime, not to mention it gives you incomplete results, and you have to select a video from the search results to be able to tell if it is free or paid. C'mon Amazon, a TV provides ample screen real estate for you to be able to include a small '$' somewhere on the description to denote it's not a free video, right? There are other UI peeves I have than I care to spend time on in this review, but I did voice all of them out to the Amazon customer representative over the phone so Amazon would know.I gave this two stars because its installation help at the beginning was simply so well streamlined and well thought out, but my disappointments started mounting after that. It's definitely of better quality than my old Roku 2, so that mattered as well. But as far as being able to watch Amazon Prime videos, the interface made me give up trying to search for anything I want to view anymore, so I'm most likely not going to continue my subscription after the trial period.", "verified": true, "helpfulness": "1/2", "author": "AmazonBuyer"}, {"rating": 1.0, "review": "Very disappointing.", "verified": true, "helpfulness": "2/20", "author": "Hayden Baney"}]