[{"rating": 2.0, "review": "I don't know if it's Amazon's fault or Comcast's...probably Comcasts...that HBO Go doesn't work on Fire TV but whoever is to blame, I'm returning this item.", "verified": true, "helpfulness": "0/1", "author": "Michael Van Gilst"}, {"rating": 5.0, "review": "AWESOME!!!", "verified": true, "helpfulness": "0/0", "author": "Jojokakes"}, {"rating": 4.0, "review": "I like it very much. I cancelled by HBO, Showtime, and other premium movie channels. Amazon Fire TV is way much better and easy to set up and use. I recommend using it with NETGEAR Wifi Range Extender.", "verified": true, "helpfulness": "0/0", "author": "R.contreras"}, {"rating": 4.0, "review": "Does its job, as long as its streaming amazon video. Netflix is useless, side loaded apps are a bitch to install and open... So media streaming isn't convenient. Get an android TV device or plug in a cheap computer instead. Don't limit yourself. Like I said, its good.. For amazon stuff. It is now exclusively for my kids to watch cartoons on.", "verified": true, "helpfulness": "0/0", "author": "Daniel W. Puckett"}, {"rating": 5.0, "review": "We ordered one and it had some issues.  Within 2 days, Amazon sent replacement.  We LOVED it!  We ordered another one for our daughter's room within a few days after that.  Then, a couple days later, we ordered a Kindle Fire HD and a Fire Phone.......we are hooked!", "verified": true, "helpfulness": "0/0", "author": "Tonya"}, {"rating": 5.0, "review": "Full disclosure, I bought this as a gift to my very technologically impaired parents. I have not used it much but I have been around them using it and they love it. I will tell you the reason I give it five stars is simple. I handed them the box and they did the rest. It is incredibly easy to use and they have not needed to ask me for help even once. Just to give you a clue how they don't like technology, the one feature they don't really use is the voice search. Don't get me wrong it does work perfectly I even practiced with them for a while, but my dad just can't bring himself to talk to a machine. Even without the voice search (which was the whole reason I got this instead of the stick) they love it which in turn stops them from asking me for help with their tv all the time. Thank you amazon.", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 1.0, "review": "I view movies and TV on a 50\" Plasma.  Browsing for an evening movie is impossible because the graphic descriptions are indecipherable due to the fonts used.  I keep removing the recommended Prime TV and movies from the list and they reappear the next day leading me to believe that the total inventory of TV shows and movies is ~ 300 - 400.  Most of the recommended appear to be children's stuff.  Browsing by genre produces the same results, pretty icons indecipherable description.  I do TV shows and movies via NETFLIX on DISH network.  The few movies or music I have watched or listened to are displayed clearly and sound fine.I have found the Watchup app useful.", "verified": true, "helpfulness": "1/1", "author": "James R."}, {"rating": 5.0, "review": "Awesome !", "verified": true, "helpfulness": "0/0", "author": "eyeguy"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best of the media boxes out there. Although not as much content as ROKU I am sure content will grow with updates. Fast and small footprint.", "verified": true, "helpfulness": "0/0", "author": "Galo Rodriguez"}]