[{"rating": 5.0, "review": "Ive had it for two months now and i absolutely  love. It. I really cant think of any complaints. It's so simple my 3 year old son knows how to work the remote to get to what he wants to see or pause it when he needs to use the potty. This is definitely a great buy. I also work at an electronics store that sells these all the way down to the chromecasts, so i know the differences between all the devices that can make a tv smart. And this has to be the best one with amazing quality. I definitely recommend it all the time.", "verified": true, "helpfulness": "0/0", "author": "Mandee"}, {"rating": 5.0, "review": "Absolutely love in.", "verified": true, "helpfulness": "0/1", "author": "Tonya"}, {"rating": 3.0, "review": "It wasn't as easy to set up as described. I kept getting an error message that the HDMI cable wasn't connected even after repeated checks and re-connecting. After purchase, I received an email with the subject line indicating it contained more detailed directions, When I opened the email, it wanted to sell me an instruction book. Also, when I tried to use the unit with the TV, it told me that I had to be an \"Amazon Prime\" member in order to access most of the programs offered. I have recently \"joined\" Amazon Prime on a trial basis and will try again.", "verified": true, "helpfulness": "0/2", "author": "Professor P \"Professor P\""}, {"rating": 5.0, "review": "Great little device.  I'm impressed by how easy it was to set up.  I've been watching video content from Netflix and Amazon and I'm really pleased with the quality. I have it hooked up to a projector with a 120\" screen and when it's streaming HD it looks almost as good as a BluRay.  The only con is that you'll need to purchase an HDMI cable in addition to the FireTV as it does not come with one.", "verified": true, "helpfulness": "1/1", "author": "James N Ducas"}, {"rating": 5.0, "review": "Jest the best,  a drive that you just have to have it work'sThank You Bill Adams", "verified": true, "helpfulness": "0/0", "author": "Bill Adams"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "ken c"}, {"rating": 5.0, "review": "Love it! Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "jen2010"}, {"rating": 5.0, "review": "Delivers as promised.......very easy to navigate and search.  Voice recognition does not like my deep voice at all, but works great for my wife......needless to say, we watch mostly her selections because of it.", "verified": true, "helpfulness": "0/0", "author": "BrewPapaJ"}, {"rating": 4.0, "review": "Very easy to set up, great WiFi range. Lots of free viewing.", "verified": false, "helpfulness": "0/0", "author": "jeff"}, {"rating": 5.0, "review": "Thank you all for having the Best Holiday TV shows and Happy Holidays🎄🎁⛄️.", "verified": true, "helpfulness": "10/10", "author": "John Adkins"}]