[{"rating": 4.0, "review": "It works extremely well for Netflix and Youtube, but the recently released additions are not available through the I-phone app and I am not sure how to access those apps.  The online sites are also not very helpful in explaining how one can access these options.", "verified": true, "helpfulness": "0/0", "author": "Francis"}, {"rating": 5.0, "review": "One of the best investments I have made this year. Toying with it for a few days I have already figured out how to get rid of cable and satellite bills and just stream our family entertainment. Chromecast was a good decision.", "verified": true, "helpfulness": "0/0", "author": "Jermon Brown"}, {"rating": 1.0, "review": "Not working as expected... Can not compare to Apple TV. Very difficult to setup.. Screen sharing to devices is not there", "verified": true, "helpfulness": "2/3", "author": "B.J."}, {"rating": 4.0, "review": "Good Device, Could be a Great DeviceI can't understand why there is no cast feature built into the Netflix App for Windows 8.1 on a Net-book, Ultra-book, PC, or Phone?  Why should customers need to download the Chrome Browser & Extension in order to cast?  The Netflix App takes less time to log in, and one would think since it's a hand-off,  Hi-Jack, Transfer of the WI-FI on my network to the Chrome-cast Device this should be an easy App, Software Fix.  Either from Chrome's Side, The App Developers (Windows) & Netflix.  Together this would seem an easy update & would sell to a lot more users.One other thing is why we can't stream from local content on PC's, Tablets, Phones Etc. is also a crime.Good Device, the aforementioned improvements would make it a GREAT Device, and probably sell many many more for your company.Works Good, Word of Warning Check your TV areas for WI-FI signal before purchase this will have the most critical effect on your experience.", "verified": true, "helpfulness": "0/0", "author": "Eric Carrier"}, {"rating": 4.0, "review": "The price is right and it works really well, but I wish there were a few more apps integrated with it, or an easier way to broadcast from other services, such as Amazon or Slingbox.  Otherwise, it is cool for what it does work for and is real easy to set up.", "verified": true, "helpfulness": "0/0", "author": "G. Washington"}, {"rating": 5.0, "review": "Simple amazing... just waiting for one add that will allow you to stream your personal media files on  my PC.As is, it works like a charm from my android phone, laptop, any device that has the chromecast App...Must have gadget!", "verified": true, "helpfulness": "0/0", "author": "Shashi \"Shashi\""}, {"rating": 5.0, "review": "This is going to take over the world.  I predict that most, if not all, TVs and other devices will have this built in, not so far in the future.  Wirelessly casting media is changing the way people work.  For the price, it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Robert S. Gosnell"}, {"rating": 3.0, "review": "I'm sure it works fine but I found it a little hard to understand how to use it. I'm not the most technically savvy person though so I'm going to have to find someone to show me what I'm doing wrong!", "verified": true, "helpfulness": "0/0", "author": "jean clayton"}, {"rating": 5.0, "review": "I've purchased 3 of these.  It is a simple little product that fills a niche.  I see it as a toy, but it really has some interesting applications once you get to it.  One friend uses it as a music player for his home system that he can control from his phone.  Great for a party.", "verified": true, "helpfulness": "0/0", "author": "B. Sondreal \"Stoney\""}, {"rating": 5.0, "review": "Great way to watch YouTube/Netflix/HBOGo!. Waiting for more apps! I have some movies in VuDu which I cannot watch using Chromecast.  Tab Casting is very useful.  It allows casting chrome tabs to the TV!", "verified": true, "helpfulness": "0/0", "author": "Bala Sadras"}]