[{"rating": 5.0, "review": "This is a great product.  We actually purchased a second one after this.  It is easy to install, use and helped us to save money.  After purchasing this product, we cut the chord on cable and subscribed to Hulu Plus.  Two thumbs up and there are more apps coming in the near future!!", "verified": true, "helpfulness": "0/0", "author": "ksu_mpa"}, {"rating": 5.0, "review": "I gave it as gifts this Christmas and everyone loved it and was able to use it, unlike the google TV my son received and is yet unable to set up on our TV's.  And it was super affordable!", "verified": true, "helpfulness": "0/0", "author": "sharon seidler"}, {"rating": 4.0, "review": "This is a very cool gadget at a good price! I love that I can hook it up SO easily and use my iphone, ipad, computer etc to control it. I can start watching a movie in one room and then move to another room/tv where I also have a Chromecast set up and finish watching it! I got 5 of these and have them in two of my homes and multiple TVs (I think I could actually just move one from TV to TV but I'm lazy :)  My only complaint, and the reason I didn't give it 5 stars, is that it doesn't work with Amazon Prime movies. And my sister says a Roku has many more possibilities. But it's less expensive and easier than the Roku so I think I'll keep them.", "verified": true, "helpfulness": "0/0", "author": "Amy L. Goyer"}, {"rating": 4.0, "review": "I have both a Chromecast and a slightly older Roku 2 (I think... not completely sure about the exact model -- I bought in October, 2012). And right now, I think the Roku is slightly better as it offers more content not available on Chromecast. But I have a feeling that Chromecast will catch up very soon.For someone who just wants to stream Netflix and Pandora to their TV, this is highly recommended. I told my parents to buy one for just that purpose and they really like it. They really like just starting a movie or radio station from their tablet instead of searching for a remote. The picture is great, set up is extremely easy, and everyone is happy.While I would put the Roku slightly ahead of this device for now (I don't have AppleTV so I can't comment on its quality relative to these devices) the fact that Chromecast recently made its SDK public for new content makes me excited to see where this thing is going. And with the deep pockets of Google, if they really want to throw some weight behind this thing, I think it could be incredibly awesome. I'm anxious to see what the Android community comes up with for this in the near future and excited to see where Google might eventually take this.For $35, this thing is very much worth it. And given a little bit of time and some talented developers, thing could become extremely awesome in the very near future.", "verified": false, "helpfulness": "0/0", "author": "M. A. B."}, {"rating": 5.0, "review": "The first time i had to use the laptop to set it up. Android phone couldnt set it up. But after all set up and updating, the android phone controls it impeccably.I like how casting netflix only streams the movie in the tv, android phone stays iddle. (instead of showing on the tv and the phone), When needed for controls just wake your phone. Saves cell phone's battery.", "verified": true, "helpfulness": "0/0", "author": "K. Tsai"}, {"rating": 5.0, "review": "Worked perfectly. I wish I had purchased it sooner to take on vacation with us. It shipped so darn fast we bought another for a friends birthday that was 4 days away ant it too arrived two days later (without prime)", "verified": true, "helpfulness": "0/0", "author": "Jenn in Oregon"}, {"rating": 4.0, "review": "A little hard to install with my computer but I think this is because of my system. I installed it very easily with my phone, then it worked with my computer.", "verified": true, "helpfulness": "0/0", "author": "Franck"}, {"rating": 3.0, "review": "I think Chromecast will take off at some point, but it unfortunately does not have much capability at this time.", "verified": true, "helpfulness": "0/0", "author": "Raymond Arnold"}, {"rating": 5.0, "review": "It's incredibly easy to set it up and start using it. Works great for playing Youtube and Netflix from my IPhone 4S and IPad mini. Look forward to more features in the future.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "I replaced an XBOX that cost me $65 a year just to use the XBOX with my tv, with this little tiny gadget just to use Netflix! SOOOOO easy! I now control my tv with my iphone or ipad! It is amazing and every household should have one! What a deal!", "verified": true, "helpfulness": "0/0", "author": "sharpkat"}]