[{"rating": 5.0, "review": "My bf had this for a while and I couldn't resist getting it for my home. Easy to project Netflix on my tv", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 5.0, "review": "Google has made it easier for me to watch TV shows, listen to music, play games, etc! I use my chromecast at parties when i want to get on pandora and play some music or even show some pictures on the big screen. At a reasonable price, you can have one connected to every TV in your home and make it easier for you to watch your shows. This is a device that i would keep in my pocket just in case boredom strikes.. Very useful gadget when missing your laptop. Just find a TV, make sure you have Wifi connection, and a device that has the Google chromecast App and you are ready to go!ENJOY!!!", "verified": true, "helpfulness": "0/0", "author": "Ernest C."}, {"rating": 5.0, "review": "I luv it I can see all my movies ,music,etc.etc. yes I would recommend this is great, luvvvvvvvvv it so", "verified": true, "helpfulness": "0/0", "author": "crystal"}, {"rating": 5.0, "review": "Great little piece of technology! It was so easy to connect my iPad to and now I watch Netflix and other apps on my large screen tv.", "verified": false, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 2.0, "review": "It took a while to install it.. There is very little support from Goggle and some of it is not accurate. You have to search it out online.. The reason I purchased Chromecast was to view my photos,  ( files I have on my ..P.C. - Windows 7 )  ..  on my TV... Well,  you can't do that unless you buy some  ' App '... when it comes available... If you are only interested in watching 'You Tube'  on your TV ..then maybe this product is for you...", "verified": true, "helpfulness": "2/2", "author": "JC"}, {"rating": 1.0, "review": "I bought this for a relatively new large flat screen with multiple HDMI outlets.  I followed the sparse instructions and the TV didn't recognize that it was plugged into an HDMI port.  I put it away for a few months and t hen spent an hour or so trying various configurations, but same result There are NO helpful FAQs or manuals, so I emailed  Google support a week ago -- serial number, problem in detail.  Maybe you got a response; I didn't.  I'll try to return it but it's probably too late.  I understand that gadgets sometimes don't work, but the lack of Google support for a product bearing  their name is shocking.", "verified": true, "helpfulness": "1/1", "author": "Alexander Kogan \"alexjr@pipeline.com\""}, {"rating": 3.0, "review": "I have been using Roku for the past few years. This product does not stand up at all. I bought it because it was a Google product and i had high expectations.", "verified": true, "helpfulness": "0/0", "author": "Dhruv"}, {"rating": 5.0, "review": "I love the chromecast.  It's the easiest thing in the world to project netflix, hbo, youtube, etc on a big TV and rarely have any streaming / quality issues", "verified": true, "helpfulness": "0/0", "author": "peter dwyer"}, {"rating": 5.0, "review": "He work grate My Baby girl and wife love it. My only concern is that only work to see movies or tv series from some applications.", "verified": true, "helpfulness": "0/0", "author": "Platinium \"Dvelez\""}, {"rating": 5.0, "review": "Excellent for streaming Netflix and YouTube to your TV. No extra remote needed; you can easily cast from my iPhone as well. But, if you're looking for more streaming options, e.g. Amazon and Hulu, the $100 Apple TV or Roku will serve you better.", "verified": true, "helpfulness": "0/0", "author": "SusanMoM"}]