[{"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "misty cruz"}, {"rating": 4.0, "review": "I would have gave 5 stars but it doesn't have the ability to use a bluetooth headset", "verified": true, "helpfulness": "0/0", "author": "Antonio T Brown"}, {"rating": 3.0, "review": "does not stream from iPad", "verified": true, "helpfulness": "0/0", "author": "Victor Bell"}, {"rating": 5.0, "review": "Amazon fire is nice.  I am learning to use it.  The only problem I see in it is,  I takes a long time to change from one program to another.  It is a slow change process.", "verified": true, "helpfulness": "0/0", "author": "Lloyd Henderson"}, {"rating": 1.0, "review": "Amazon Fire TV is worthless if you are wanting to browse the internet and have access to an app store.  If you are looking for a box to supply you with NetFlix, Pandora, Hulu spend your money on Google's Chromecast.  Chromecast provides what amazon fire tv provides at less cost with the additions of surfing the net.", "verified": true, "helpfulness": "2/5", "author": "James Martin"}, {"rating": 5.0, "review": "It is exactly what I would expect from Amazon - Outstanding...  My primary purpose was to enable me to connect my 8.9 HDX Kindle to my TV.  From that standpoint it does just what I wanted.  Everything else, however, appears to be simply a 'money maker' for the affected vendors.  After I have an opportunity to work with it some, I may feel different about the 'money maker' opinion.  For now, that's where I stand.", "verified": true, "helpfulness": "0/0", "author": "Rudy A. Jarrell Jr. \"Rudy A Jarrell Jr\""}, {"rating": 5.0, "review": "Easy, intuitive setup, great performance.  Unit is shipped to you pre-authorized to your Amazon Prime account. I now own two of these.", "verified": true, "helpfulness": "0/0", "author": "Cycling Enthusiast \"Cyclist@Clovis\""}, {"rating": 4.0, "review": "Easy to install and works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Craig R Garant"}, {"rating": 5.0, "review": "Love,Love, Love Amazon FireTV and Fire Sticks.  Dropped Cable TV and installed Fire Sticks on 2 TV's and a Fire TV system on one.  So great!!! We were trying to save money and got so tired of cable costs, installed a HD-TV antenna - outside - with fingers crossed, and have been more than happy with our decision.  I don't know about anyone else out there that are tired of the high cost of TV viewing, but believe me, we went this route and have been very pleased with the decision to save money; the beautiful picture (most channels look like Blu-Ray, and we have a Blu Ray player so I know how it should look), the terrific selection through Amazon Prime (I'm just a customer, for real) and the ability to watch different shows/movies on each TV.  Such a great service for such a small amount of money...if you're really interested in saving money, try it.  You will be so glad you did.", "verified": true, "helpfulness": "0/0", "author": "Glenna J. Judd \"GJJ\""}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Timothy Hughes"}]