[{"rating": 3.0, "review": "CONFUSING TO HOOK UP BUT ONCE GOT IT WORKING I LOVE IT. WOULD RECOMMEND IF COMPUTER LITTERATEACTUALY PURCHASED TWO MORE AS GIFTS", "verified": true, "helpfulness": "0/1", "author": "Richard"}, {"rating": 4.0, "review": "I'm very happy with this device; however, I could not get it to work on a Samsung Galaxy S4, which I thought was Google compatible. Fortunately I was able to get it to work on an iPad quickly and easily - Apple apparently is no-nonsense about apps working seamlessly.  Once the iPad was set up, the Galaxy somehow displayed that system automatically and Chromecast since has worked on both devices.  Without the Apple device I would have been very disappointed, having followed all instructions for the  Samsung device to a T repeatedly to no avail, and it was time consuming.", "verified": false, "helpfulness": "0/0", "author": "Jeff N"}, {"rating": 5.0, "review": "I would recommend this product since it is simple to use and a great multimedia streaming device. It does being updated consistently with new features making it more and more useful. Very inexpensive and tons of uses. I would recommend this product. 5 stars.", "verified": true, "helpfulness": "0/0", "author": "V.Defeat"}, {"rating": 5.0, "review": "Chromecast allows you to connect smartphones, tablets, or your computer to your TV to allow for streaming your device's display to the TV.  If you want to watch Netflix, you can!  If you want to show someone how to do something on a website or give a presentation, you can!The only drawback so far is that the Chromecast module gets a bit hot, so when you're done doing what you need to, you'll want to unplug it from it's power source.  The manual says it's best to leave it unplugged when it's not being used.", "verified": true, "helpfulness": "0/0", "author": "Rick Mac Gillis"}, {"rating": 2.0, "review": "It's cheap, that's about the only thing I liked. it requires certain ports open to work properly which means you won't always be able to use it in hotels or at a workplace. Slow when casting my chrome session, and underwhelming when streaming via plex. it's cheap, but still not worth the money in my opinion.", "verified": true, "helpfulness": "1/1", "author": "Ryan Flagler"}, {"rating": 1.0, "review": "can't believe i wasted my time on this, there's no remote, all the apps lag, you can only stream the video apps and browser, this is what i get for trying to get a cheaper alternative to the apple tv", "verified": true, "helpfulness": "0/6", "author": "Dane Michael"}, {"rating": 3.0, "review": "I have used this with two different television sets. The living room tv has many remotes. One for cable,one for audio, one for blue ray, one for the tv. The Chromecast installed easy enough but for some reason the remotes worked differently. It was difficult to set the volume, couldn't figure out how to pause it, everything took awhile to figure it out. I do believe the problem was the way I have all the remote configured.Then I hooked Chromecast to my bedroom television which has the cable remote and the television remote only, all I had to do was change the source and I was good to go. I use both Netfix and Hulu Plus. Once you choose your movie you will see the Chromecast icon if you click on that it goes to your tv. This Chromecast is completely portable. It can fit in you back pocket. Great to bring to a friends. For 35.00 it seems like a no brainer. I would recommend this to anyone that has their remotes configured properly.", "verified": true, "helpfulness": "0/0", "author": "Diane Capodilupo"}, {"rating": 5.0, "review": "Great control for casting Netflix. HD comes through great. A developing technology with many possibilities. I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "mrphanson"}, {"rating": 4.0, "review": "The Chrome Cast media player is simple to use, set up is easy and is reasonably priced. Would recommend this product to anyone who needs a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Robert M Laplume"}, {"rating": 4.0, "review": "I don't think there's anything more that needs to be said about the awesomeness of Chromecast. For under $50 you can take those expensive devices you already own and make them your entertainment center. Genius.It still has it's glitches from time to time. I think it mostly has to do with other apps' implementation of the interface. But it's never something that causes me undue trouble.The real question is why other companies continue to produce obnoxious devices like the AppleTV or Amazon's new FireTV? Forget about that clutter and pick up a Chromecast. On the other hand, maybe you think you need more stuff in your house: Fine, it's cheap enough that you can buy a Chromecast too.", "verified": true, "helpfulness": "0/0", "author": "D. A. Holman"}]