[{"rating": 5.0, "review": "Very happy", "verified": true, "helpfulness": "0/0", "author": "Kharati Pawa"}, {"rating": 4.0, "review": "It does what it says it does. I wish it came with an angle adapter but it does not.", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}, {"rating": 5.0, "review": "This device is absolutely incredible! I'm so happy to have it!", "verified": true, "helpfulness": "0/0", "author": "Kevin Spence"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Vanesa B"}, {"rating": 5.0, "review": "Good Product", "verified": true, "helpfulness": "0/0", "author": "Mustafa El Qazaz"}, {"rating": 3.0, "review": "does not work with Iphone.", "verified": true, "helpfulness": "0/0", "author": "LUIZ AMARANTE"}, {"rating": 5.0, "review": "It's perfect for my needs, watch Netflix and Youtube on my TV", "verified": true, "helpfulness": "0/0", "author": "Yuste Maria Ximena"}, {"rating": 3.0, "review": "We have three different streaming media players.  This is the one that sits in the guess room that does not get used too much.First you must use your smart phone of tablet as a remote.  Then your phone or tablet must have hulu or Netflix or another video source that you must open and play the show or movie from.  You can turn off your phone or tablet or take it out of the room but then your remote control is gone because how would you pause the video or change it to another show if the movie sucks?It does work ok when streaming.  The video starts out low resolution until it's downloaded enough to make it HD.I guess that's the reason its in the guess room.", "verified": true, "helpfulness": "1/1", "author": "Marquezj16"}, {"rating": 2.0, "review": "Not sure what this is exactly supposed to do but I have not been very impressed. Main purpose for the purchase was for business presentation purposes: To mirror PowerPoint from my tablet to a large HD TV screen. But there's lag time...even when I'm less than 3 ft away. Regarding personal use I've tried watching movies from Hulu or PopcornFlix and have had the same issue: Lag time and buffering. I may be doing something wrong and still have 100% faith in Google products so I may be updating this review after I learn more about how to use Chromecast, but as of right now I'm not very impressed. Incidentally, I had to purchase and use a 10' HDMI cable as a backup for doing presentations from my tablet and that works flawlessly, but it's not as impressive as being able to wirelessly do the same thing.", "verified": true, "helpfulness": "0/0", "author": "Slick"}, {"rating": 4.0, "review": "Works Great", "verified": true, "helpfulness": "0/0", "author": "Topher"}]