[{"rating": 5.0, "review": "Amazing. I Stream pretty much everything from my laptop.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Its Chrome, whats not to love?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "if you change from silverlight to adobe flash in settingsit works great for streaming through chrome browser", "verified": true, "helpfulness": "0/0", "author": "Russell Kendall Johnson"}, {"rating": 5.0, "review": "I thought this thing was silly when i first say it.  I had my computer hooked directly to the tv and stearo so why would I need this?  Well because now I do not have to turn my computer on at all, which is so nice.  Saves power and silent.  No fighting with looking over at the mouse to make it full screen or anything.  Also can pause, skip, etc from anywhere in the house or outside.  I have it hooked to 2 phones and 2 tablets plus a laptop.I thought it had its own remote but it does not.  Only controlled from phone or tablet!  But it will keep running when that phone leaves the wifi.  So if i have to run out to the store it losing the connection on the phone but it will keep playing in the house.  When i hook but up to it it does lose the song and start again though.*The coolest part for me is that I found I can plug it into the HDMI on my home stereo instead.  That way I can play pandora with just the stereo on.  This was a huge feature for me.  Then run the hdmi from stereo to the tv for when i want video.Note I did get static in the audio when using the USB on my stereo.  I switched to using the wall plug and now the sound is perfect.", "verified": true, "helpfulness": "1/1", "author": "Doug B"}, {"rating": 5.0, "review": "This \"contraption\" is awesome!", "verified": false, "helpfulness": "0/0", "author": "Gloria Kendrick \"avid reader\""}, {"rating": 3.0, "review": "I have comcast cable and the router needs to be within 15 feet of the tv for chromecast to work. My router is just 30 feet away and it doesn't work.  I'd rather just use a thunderbolt to connect the tv to my mac.", "verified": true, "helpfulness": "0/0", "author": "Raj Prajapati"}, {"rating": 2.0, "review": "There's far better options out there.  Do you really want to use your phone as a remote?  Ask yourself that first before buying this solely because it is stupidly cheap.", "verified": true, "helpfulness": "0/0", "author": "dlevasseur"}, {"rating": 3.0, "review": "Website claims xfinity tv go casts but it does not. Other apps have the same issue. Live feed also lags. Other than that great product!", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent for the money... Improve in channels supported and you will be the best in the market.... Price is the best part", "verified": true, "helpfulness": "0/0", "author": "lalocamarena"}]