[{"rating": 2.0, "review": "I expected to have more free streaming sites.  Most of the sites on Fire TV are Pay For View and I can acquire those sites from most DVD players available.  There are virtually no instructions how to search for additional sites.", "verified": true, "helpfulness": "2/6", "author": "Jerry D."}, {"rating": 2.0, "review": "Does not have external usb support so you will run out of memory extremely quickly if you donwload apps making it useless at that point cause you wont even be able to stream without some storage space", "verified": true, "helpfulness": "1/4", "author": "Christian Pagan"}, {"rating": 4.0, "review": "It is an above average Android box with good specs. The most important thing is that you can side load XBMC!", "verified": false, "helpfulness": "1/1", "author": "Loccs \"gunderss\""}, {"rating": 5.0, "review": "I just received Amazon Fire TV for Christmas and I love it.  It was extremely easy to setup and it is easy to use.  We've been watching quite a few movies and TV shows over the past week and I couldn't be happier.  I prefer to manage content online, as I think it's easier.  When watching a TV series, I love how it automatically pulls up the next episode.  The voice search works well, but I did find that when I used it in Netflix it took me back to Amazon.  Regardless, I highly recommend it.", "verified": true, "helpfulness": "1/2", "author": "Dianna Poissant \"Dianna P\""}, {"rating": 1.0, "review": "As a long time Prime member, I've always loved the majority of the products Amazon has to offer.I truly wanted to like the Amazon Fire TV but no matter how many times I tried using it, it just irritates me so much! The Fire TV just couldn't hold it's internet connection whatsoever, I thought, oh hey maybe it's just my internet service being terrible but when I used my PS3 & PS4 to stream, it worked perfectly fine. The Fire TV kept freezing on me every 30 seconds, it would keep buffering every time I streamed on Netflix and Flixster which got really annoying. I'd like to actually watch a movie without having any problems but it just won't run smoothly. And the interface is not so user friendly.For now I'll just be returning the product and hoping in the near future that they'll improve on it a bit more and just maybe, I'll give it a shot then.", "verified": true, "helpfulness": "7/8", "author": "Amanda L."}, {"rating": 2.0, "review": "At this time the Hulu Plus app is broken for the Fire TV. Video freezes but audio continues. You have to back out of Hulu, restart & resume show to continue watching. This can happen 4-5 times during a 30min show. Hulu is a main app we use. So this absolutely ruins the Amazon Fire TV experience for my family. You can find many many reviews of lots of users having this issue with Hulu on the Fire TV. Its not a new issue. Hulu says they are aware of the issue and have people looking at it. But the issue has been unresolved for months according to reviews. I don't have an issue with the Hulu app on any other devices including 2 smart TV's, 4 different phones, Roku 2 & 3, Samsung Blu Ray player, Xbox 360, iPad, Android tablets. Amazon Fire TV is the only device I have ever used with a broken Hulu app and as of now I am regretting choosing the Fire TV. I hope I can come back and update this as an issue that has been resolved very soon. I don't want to return this Fire TV..but Hulu just might be the reason I do.", "verified": true, "helpfulness": "3/5", "author": "Rick Hansen"}, {"rating": 3.0, "review": "There aren't a lot of free movies unless you are a prime member and even then most movies are very old. It's good for 3d games when the grandkids visit.", "verified": true, "helpfulness": "1/3", "author": "Terry J Hicks"}, {"rating": 3.0, "review": "It haven't met my expectations. I am disappointed right now. But will keep playing with it.", "verified": true, "helpfulness": "2/4", "author": "Billy L Lockhart"}, {"rating": 5.0, "review": "Great product a lot of free contact with Prime plus all great  apps. Love the voice search. Works great through wifi better that expected. It was purchase worth buying especially the bundle price they had with year of prime.", "verified": true, "helpfulness": "1/2", "author": "Vitaly Guy"}, {"rating": 1.0, "review": "Couldn't make it work with my Bose surround sound systems.", "verified": true, "helpfulness": "2/12", "author": "Hollyb"}]