[{"rating": 5.0, "review": "start up was a mess.  need better visuals as to how get started", "verified": true, "helpfulness": "0/0", "author": "Lawrence Carter Sr. \"L. Carter Sr\""}, {"rating": 5.0, "review": "must have product, like it.", "verified": true, "helpfulness": "0/0", "author": "moien"}, {"rating": 5.0, "review": "If you don't already have one of these you should buy it now. We used to use my ps3 for Netflix and YouTube but since we picked this up I never need to turn my ps3 on anymore. It's super easy to use from our phones and I have coonected Google to a) of my pictures as well so I can pull up almost anything on my TV now. This is a fantastic buy", "verified": true, "helpfulness": "1/1", "author": "Sean H"}, {"rating": 5.0, "review": "The most affordable TV to smart TV converter.", "verified": true, "helpfulness": "0/0", "author": "Adel Ali"}, {"rating": 5.0, "review": "Chromecast rocks!  great for the spare bedroom and visitors.", "verified": true, "helpfulness": "0/0", "author": "Neyda"}, {"rating": 5.0, "review": "I really like this, now I can watch netflix and youtube on my T V", "verified": true, "helpfulness": "0/0", "author": "Rev. J. Greg Looper"}, {"rating": 5.0, "review": "This thing is awesome. I didn't realize how much I would use it until I actually started using it. Every time I have friends come over and want to show them videos from my phone, or they want to show me videos, we can just cast it to my TV.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Hansen"}, {"rating": 5.0, "review": "Excellent product.You can view ur i phone and other aplications like youtube on tv or projector screen remotely using ur iphone/android phone like samsung galaxy.Cysral clear picture and sound.", "verified": true, "helpfulness": "0/0", "author": "Yogesh N. Badiani \"yb\""}, {"rating": 4.0, "review": "It's a really good gadget with great potential. After a few months still not able to cast screen without issues. I figured by now this feature should not be in beta mode anymore.", "verified": true, "helpfulness": "0/0", "author": "Juan C Alonso"}, {"rating": 2.0, "review": "Hard to navigate, only casts to tv off laptop or android. Iphone is basically useless", "verified": true, "helpfulness": "0/0", "author": "Aimee Mundel \"AALUCKYGAL11\""}]