[{"rating": 5.0, "review": "I cut cable and since I have Netflix and most of the foreign TV my parents watch is available on YouTube this is all I need. The quality of the video is amazing it is better then over the air or cable at times. The best part is if I stream from my phone my phone acts like a controller only so that way I don't burn my battery and can use other apps. I recommend this product to anyone at any age it's as easy to set up as plug in and out in a wifi password and your good to go. I love it so much I have ordered 4 in total one for every TV in my house.", "verified": true, "helpfulness": "1/1", "author": "raza"}, {"rating": 5.0, "review": "I had a Roku but Comcast doesn't allow me to stream HBO so I got the Chromecast and now I can watch my HBO on TV in the bedroom, which isn't hooked up to cable. We're in the process of \"cutting the cord\" to cable and satellite and this helps us to stream Hulu, Netflix, HBO and much more. This well worth the money. I'm thinking of buying another one so that I can stream to a small flat screen TV on the wall where our treadmill is.", "verified": true, "helpfulness": "0/0", "author": "Lilly G \"Lilly\""}, {"rating": 1.0, "review": "I have a Roku stick which works well.  I cannot understand why the chromecast stick will not work even with the chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Dale Starr"}, {"rating": 5.0, "review": "Everyday use Especially  for Karaoke", "verified": true, "helpfulness": "0/0", "author": "chris Kanemori"}, {"rating": 4.0, "review": "works as it should", "verified": true, "helpfulness": "0/0", "author": "B. J. Lilly"}, {"rating": 5.0, "review": "Best toy ever.  So simple.  I can \"cast\" from my CPU, ipad, android device, etc.  Awesome new toy and so many compatible programs.  Just canceled cable...tired of DirecTV robbing me every month.  Super simple to set up, and it comes with USB cable (no need to buy)", "verified": true, "helpfulness": "1/1", "author": "Brian R"}, {"rating": 3.0, "review": "I don't use this at all. It does the job, but I can't stream at all unless my router is around 8 ft away from it. I would not recommend this to anyone that really wants to do any media playing.", "verified": true, "helpfulness": "0/0", "author": "Robert Dong"}, {"rating": 5.0, "review": "Dont let the size fool you! Get the ALLCAST premium app and now u can stream anything to your tv!", "verified": true, "helpfulness": "0/0", "author": "Armando Delgado jr"}, {"rating": 4.0, "review": "Could be smaller. Sticks out the back of the tv and stops the TV from being as flush as it should.", "verified": true, "helpfulness": "0/0", "author": "NorCalBen33"}, {"rating": 5.0, "review": "Got this for my mother to stream from her Chromebook to her TV. So easy to use for streaming Netflix or YouTube from most any device, but I highly recommend it to anyone who uses a Chromebook. My mother enjoys looking at Facebook photos, etc streamed to the big screen TV so she can see them better. Just a great bargain for what you get!", "verified": true, "helpfulness": "0/0", "author": "Linda G."}]