[{"rating": 1.0, "review": "WASTE OF MONEY!!!", "verified": true, "helpfulness": "0/2", "author": "Tom Lo Verde"}, {"rating": 1.0, "review": "It works only 3 weeksThen need to be programming one time , and again and again", "verified": true, "helpfulness": "0/0", "author": "Francisco I. Hernandez"}, {"rating": 5.0, "review": "A definite way to go. I have gotten several people to get one of these after I have had mine and told him about it. I've gotten to train and teach people about how they work and it's been fun!", "verified": true, "helpfulness": "0/0", "author": "Lynda W"}, {"rating": 5.0, "review": "i like", "verified": true, "helpfulness": "0/0", "author": "Arvydas Zubavicius"}, {"rating": 3.0, "review": "worked great for the first months and then slowly went downhill. Troubles connecting/keeping a connection is the only thing consistent about this product the last 4 months or so.", "verified": true, "helpfulness": "0/0", "author": "Melissa K"}, {"rating": 1.0, "review": "Do not buy! You are better off buying a different streaming device or even an hdmi cable to directly connect your computer to your television. This device rarely works. You are frequently met with audio but a black screen, or no audio at all! This device is not worth the money until major changes are made to fix the multitude of problems that currently occur.", "verified": false, "helpfulness": "0/0", "author": "Thomas Fontana"}, {"rating": 1.0, "review": "This is the second Google Chromecast HDMI Streaming Media i have purchased from Amazon that has failed to work with months after receiving it.", "verified": true, "helpfulness": "0/1", "author": "Connie Dockery"}, {"rating": 4.0, "review": "It goes down frequently and needs rebooting, but when it works it's great.", "verified": true, "helpfulness": "0/0", "author": "Flowerman"}, {"rating": 2.0, "review": "The product's description does not explicitly state that Chromecast requires devices to be on the same WIFI Router for it to work. So, Chromecast cannot be used to make large screen presentations at locations where one cannot gain access to a business's Secure WIFI network. When I tested the Chromecast dongle I received yesterday, I found out that it also does not support the Miracast standard, therefore I was not able to mirror my PowerPoint presentation (from my Windows-PC  to the large TV screen) using Chromecast. Also sadly, the Chromecast dongle dropped the connection intermittently, and sometimes the picture and sound \"froze\" on the TV screen -- even while using the Chromecast Extension in the Chrome Browser (to project Youtube videos from my PC to the large TV screen).", "verified": true, "helpfulness": "0/0", "author": "Compassionate17 \"sam14603\""}, {"rating": 4.0, "review": "I love this thing.  Get it and cancel cable.  I barely watch TV anymore.  There are some improvements that can be made. Its kind of hard to keep track of whats playing versus whats on the phone screen but you get used to it fast.", "verified": true, "helpfulness": "0/0", "author": "Doug Dawson"}]