[{"rating": 4.0, "review": "Chromecast is a great device! Can stream YouTube and Pandora directly (as well as other things) and can mirror Chrome tabs and your computer screen (in beta). Works well with mobile devices. Very good value.Mirroring can lag, but still works. Wish 1080p was possible. Also, it would be nice if there was a way to close Chromecast apps once finished (ie Pandora). Also Pandora can only be casted from a mobile phone.", "verified": true, "helpfulness": "0/0", "author": "Tejas Shah"}, {"rating": 2.0, "review": "Even for the $35 or so this costs, the value is not worth the money you spend on it. I ended up returning it and spending just over 2x this amount for a Roku and am far happier. While it does stream YouTube and Netflix, that's about all it does, and even then, it isn't extremely slow.As a first product like this for google, however, I think it is a step in the right direction; it is very small and portable. However, a Roku isn't very big either, so its hard to say whether this product will be worthwhile in the long-term.", "verified": true, "helpfulness": "0/0", "author": "R. Weber \"citizen savant\""}, {"rating": 5.0, "review": "The only way to watch streaming video is on a large tv screen. The easiest, cheapest way is this device. I bought two.When we travel, we bring the Chromecast along. No premium channels or or Netflix at the destination? Absolutely no problem. I control it from my Nexus 7 tablet.", "verified": true, "helpfulness": "0/0", "author": "Bill Talmadge \"Retired Elec Eng\""}, {"rating": 5.0, "review": "only took me let than 5 minutes to set up. It works well from since. Will definitely recommend others to buy.", "verified": true, "helpfulness": "0/0", "author": "Nguyen Phan"}, {"rating": 5.0, "review": "Very  easy to set up if you follow the instructions.  Tried doing the guy thing without reading the instruction even did the Mayday on the kindle HDX and was told it doesn't work with the kindles..  Finally followed the instructions and boom it works, and for you MAYDAY people ... yes it does work with the kindle!  I use it for YouTube, net flicks and Pandora so far with no problems.  Once I start a move off my Kindle HDX my kindle is free to use any other app and surf the net using Silk or playing the Simpson's Tapped Out.  In other words it doesn't tie up your kindle.  RECOMMEND this device!  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "M. Whitehead \"Selym7\""}, {"rating": 2.0, "review": "Its a nice device, installation is easy, however it will not play my own content, home video's etc. I think they really missed the boat. It will play netflix, you tube....... I already have those installed on my tv.... its just another gimmic...", "verified": true, "helpfulness": "0/0", "author": "Richard LaVassaur"}, {"rating": 3.0, "review": "It is cool and low priced streaming but you will need a fast router to use it with out freezes. I use it from my phone and laptop and if one of them goes to sleep the show is over. I think that the apps should be installed on the chromecast device and then when you select a you tube video it can stream it from there and not your pc to have less hops through the router.", "verified": true, "helpfulness": "0/0", "author": "Jer"}, {"rating": 3.0, "review": "It certainly is stable and does as advertised. But not being able to stream local files (like personal movies I purchased in the past) is a deal breaker. Sure the ones you rent and buy on google play work great, but I don't want to have to re purchase movies and media I have.... On top of that, many streaming modalities offer streaming local files, so I feel google did this deliberately for money. Until they offer support for that, I can't take chrome cast as a serious streaming option.", "verified": true, "helpfulness": "0/0", "author": "Ameet"}, {"rating": 5.0, "review": "Have to say that the Chromecast was probably the best investment I made in a long time,Super easy to use, the only thing I have issue with is the limited number of apps that can be casted. now they have added a few more but still not the selection i was at first expecting. Great Google product tho, Cheers!", "verified": true, "helpfulness": "0/0", "author": "Tanner Burford"}, {"rating": 5.0, "review": "Works great for what it is.To all of those that say it would stream local content...YES IT WILL!!!!  (Please become technically savvy before making comments trashing a product you don't understand.)*Use Chromebrowser and in the address bar  type 'c://'  and hit enter.  then navigate to your local content.", "verified": true, "helpfulness": "3/4", "author": "SaintPeteScott"}]