[{"rating": 5.0, "review": "Received this as a gift. Let me tell you, it is the gift that keeps on giving! When I first got my Chromecast about a year ago, it had fairly limited capabilities. Since then, updates from Google along with 3rd party apps have really expanded what this can do. From screen mirroring my phone and computer desktop, to casting streaming flash and mp4 videos from nearly any and every source, this little dongle can do it all! And at this price, I might just stock up and buy a couple more for use at work, home, and on the go!", "verified": false, "helpfulness": "1/1", "author": "Patrick R."}, {"rating": 5.0, "review": "Absolutely perfect.  It does everything you could think to use it for.  I use my phone as my controller for my TV and the chromecast and stream videos, pandora, netflix, music, youtube, and my tabs on my explorer flawlessly without any lag.I have a Fire stick as well and while I like having the menu and remote in certain situations, I have never regretted the chromecast not having a menu once.  It is also far easier to stream things to the chromecast than the firestick.People who do not know how to stream from devices might prefer the menu of a firestick.", "verified": true, "helpfulness": "0/0", "author": "Collin P."}, {"rating": 5.0, "review": "Easy to use, invisible.  It's high quality and inexpensive.  Plays HD no problem.  Love this thing.", "verified": true, "helpfulness": "0/0", "author": "Joe L"}, {"rating": 4.0, "review": "I love this. Its nice and speedy fast. The response time from your device to the screen is pretty fast. The only thing I don't like about it is it doesn't support iPhones yet. It supports any other android phone and tablet and also iPad but not an apple phone.", "verified": true, "helpfulness": "0/0", "author": "DJ Matt"}, {"rating": 5.0, "review": "Very cool to be able to cast to my TV from my IPAD.", "verified": true, "helpfulness": "0/0", "author": "William Norman"}, {"rating": 5.0, "review": "Love this! Whoever invented it is a genius. Now I can watch my shows on my big tv and do work on my computer at the same time!", "verified": true, "helpfulness": "0/0", "author": "Mystique"}, {"rating": 4.0, "review": "I like the unit. I was a little disappointed that I would have to jump through hoops to use my amazon prime with it.", "verified": true, "helpfulness": "0/0", "author": "mike p"}, {"rating": 5.0, "review": "When YouTube dropped support of my Smart TV I needed a new source. Chromecast solved my issue plus gave me more options.", "verified": true, "helpfulness": "0/0", "author": "T. Pryor \"Pop\""}, {"rating": 3.0, "review": "Wish you could stream saved movies from devices to TV, not just google approved apps.", "verified": true, "helpfulness": "0/0", "author": "anthony s."}, {"rating": 5.0, "review": "My sister is using it ...she tells me it works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"The language gene\""}]