[{"rating": 4.0, "review": "The Fire TV is a fairly competent streaming box for most users. It will run netflix, hulu, prime, etc without any issue. It also has some access to games, and a decent little controller for those.I run Kodi, epsxe, and a few other emulators on it. You can pair a PS4 controller directly to the box and be up and running very quickly. You can also expand the storage with a USB hard drive.My BIG gripe with this box, which is otherwise perfect for my needs, is that you have to side load many applications (emulators, xbmc, etc.) and you have very little control over what is on your homescreen. In order to get to sideloaded applications you have to go through a menu that's burried about four layers deep. Everything runs through a REALLY terrible interface that's made to pitch every amazon product they can try to sell you. Amazon, let me change my home screen around and make shortcuts to my sideloaded apps and I will revise my review.", "verified": true, "helpfulness": "2/2", "author": "me"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Shane"}, {"rating": 5.0, "review": "We are so happy with our Amazon Fire TV as it is easy to use as we are older and sometimes have a hard time using new technology.  My son has the Apple for his TV to use Net Flex,etc and he was amazed at the Fire TV device.  So great he thought and wished that he had it.  Definitely a great buy.  We love the voice activation part of the Fire TV to call up different movies.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 4.0, "review": "This is a great device. Very fast. My only complaint is that Amazon Music acts a little flaky. It will intermittently stop streaming music- usually when it's switching from one track to the next. A push on the play button will start the music streaming again. TV Shows and Movies do not do this. They stream exceptionally well. Over all, a great device.", "verified": true, "helpfulness": "0/0", "author": "Bradford Simpson"}, {"rating": 2.0, "review": "lose the signal often", "verified": true, "helpfulness": "0/2", "author": "marco caselli"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "JO"}, {"rating": 2.0, "review": "it is simple to use but it is totally not what I expected.  I can't even watch anything I want to watch.  I have all of this weird stuff to watch instead and I am not happy with this purchase at all.", "verified": true, "helpfulness": "1/2", "author": "John Caron"}, {"rating": 2.0, "review": "HBO app is so slow and frustrating that I switched back to my Apple TV. I've had this player for over 8 months and I tried it out again this week - the app is just as slow. Where's the quality control for your FireTV apps, Amazon?", "verified": true, "helpfulness": "0/1", "author": "Brent"}, {"rating": 5.0, "review": "Best quality and performance for the price is awesome. I am 😊 happy worth my money thank you.", "verified": true, "helpfulness": "0/0", "author": "Norberto Quiles"}, {"rating": 5.0, "review": "Excellent choice,  if your a prime member, this is a must have to stream movie and shows! !", "verified": true, "helpfulness": "0/0", "author": "ken wing"}]