[{"rating": 5.0, "review": "BIG LOVE IT", "verified": true, "helpfulness": "0/1", "author": "chucky"}, {"rating": 5.0, "review": "Works great, as advertised.  Very pleased.", "verified": true, "helpfulness": "0/1", "author": "Karl E. Hoff \"blue sky\""}, {"rating": 5.0, "review": "FUN. Well made. Functional.", "verified": true, "helpfulness": "0/1", "author": "Susan Kelly"}, {"rating": 5.0, "review": "I love it,  Its awsome, and was so easy to install", "verified": true, "helpfulness": "0/1", "author": "Glen Malmquist"}, {"rating": 4.0, "review": "Great product for the money. Would pick this over apple any day.", "verified": true, "helpfulness": "0/1", "author": "Pen Name"}, {"rating": 5.0, "review": "very good product", "verified": true, "helpfulness": "0/1", "author": "Samuel Samitore"}, {"rating": 5.0, "review": "Once I got the update to the software, it works flawlessly.  The choices are very good and I have found that the games are pretty entertaining -- especially for my grandson.", "verified": true, "helpfulness": "0/1", "author": "James W. Thompson \"James W. Thompson, Ph.D.\""}, {"rating": 5.0, "review": "Much better than my old Roku.  Nice gaming with a real controller.  I was able to root my older unit and install XBMC and other apps...", "verified": false, "helpfulness": "0/0", "author": "Bryant Shinuald"}, {"rating": 4.0, "review": "I've quit using mine after 7 months because it made me log in to Netflix every time I wanted to watch TV.  I have five other devices in my home that let me watch Netflix with no log in at all, so why bother with Fire TV.  Also, the Music feature never seemed to work right.  I would \"buy\" a playlist on Prime Music but it never showed up on my Fire so I could play it.Update:  As of 3/11/15 the Netflix logon issue has been fixed so no logon is required after first use.", "verified": true, "helpfulness": "11/12", "author": "CircleZ \"CircleZ\""}, {"rating": 5.0, "review": "I got this Amazon Fire TV as  a birthday present with my annual membership with Prime.  I love this device.  I can watch shows and TV that I normally can't on regular broadcasting.  I also love the ability to add applications like Netflix and Hulu.  I am not sure of the difference between this and the USB, but I definitely recommend this one over the USB because the remote is easy to use.", "verified": true, "helpfulness": "0/0", "author": "rocklovr1"}]