[{"rating": 3.0, "review": "Would be 5-star with HBO GO....super misleading as the box actually shows multiple HBO shows...Amazon and Netflix work very well. The remote feels high quality, but is so small I'm sure I will lose it multiple times between cushions.", "verified": true, "helpfulness": "1/3", "author": "TheSchwartz15"}, {"rating": 5.0, "review": "A very neat package, easy to set up and use. The voice command works and is easy to  use. Variety of programs is good and option to join Hulu Plus  or Netflix etc. Box is small and unobtrusive. The remote is also small and easy to use.The programming would be improved, if programs listed had an explanation as to why an episode(s) was unavailable.Very Happy with purchase.", "verified": true, "helpfulness": "1/1", "author": "V. Harwood"}, {"rating": 5.0, "review": "Our movies on Roku always took minutes to load and then we were plagued with the movie stopping to reload several times during the show. No more! Fire TV starts playing immediately and hasn't had to \"reload\" yet. We are very, very impressed.The voice search actually works perfectly! No more hunt and peck.Get it.", "verified": true, "helpfulness": "5/5", "author": "Teatime2 \"teatime2\""}, {"rating": 5.0, "review": "When I received the Fire TV I had concerns. Usually these things have install and reception issues. I followed the simple instructions,  was asked to enter my wifi password and it then went into install mode. It upgraded and went to the home screen.  I have not had a single problem. It works great!", "verified": true, "helpfulness": "2/2", "author": "swsculli"}, {"rating": 3.0, "review": "Disappointed that voice search does not pick up NetFlix content, nor can I find a YouTube app on it.  Otherwise, very easy to install and run.", "verified": true, "helpfulness": "2/6", "author": "Paul Indig"}, {"rating": 3.0, "review": "Was hoping to be able to use WatchESPN to get non-broadcast sports stuff on big TV.  And to my surprise, all major providers are set up in the WatchESPN app except Charter Communications.  I can do WatchESPN with a Charter logon on my Samsung SmartPhone, Samsung Tablet, Kindle Fire and desktop computer but Charter Communications is NOT listed as one of the providers you can log on through to get WatchESPN on Fire TV.  Same is true for ShowtimeAnytime.  Can get it on other platforms but when I go to the provider list on Fire TV, Charter Communications is not listed.  I've contacted Amazon 3 times to report this issue and after 30 minutes or so of trying to get someone who knows ANYTHING about FIre TV I've been told, yep...Charter isn't a listed provider!  No crap...I already knew this.  No one can tell me that my complaint has been logged and is being addressed....only that the next software upgrade may add Charter.11/28/14 Update:Just checked https://espn.go.com/watchespn/activate and Charter is now listed as a provider. I was able to take the code that came up from the WatchESPN app on my FireTV, choose Charter from the site above, enter the code on the web site (it said device activated) and I can now view ESPN channels on my TV through FireTV. Of course the regular broadcast ESPN channels can be viewed through Charter on TV but I can now view ESPN3 that is only internet available on my TV through WatchESPN app through FireTV.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 1.0, "review": "UPDATE 11/14: Reduced to single star. Video skips/stutters/freezes (problem isolated to FireTV, so not a network issue) on occasion, in all apps. Now and then apps cease to function, and all their data must be cleared and accounts re-configured. 1.5 years later and still no Amazon music integration, which I had on my old Roku box, even though the buttons are there tantalizing you (they do nothing). Basically, no visible improvements since launch; feels abandoned. Frequent bugs and annoyances with user experience. At this rate, I'd say wait another 2-4 years before buying one of these, assuming Amazon is still in this hardware market at that point.ORIGINAL: Amazon had a laundry list of things they wanted to fix about streaming set top boxes like the Roku, Apple, etc.: lock-in, poor user experience, poor searching, and speed were the biggest complaints that the FireTV was supposed to solve.Unfortunately, the FireTV only solves one of them: performance. Navigating the user interface is snappy. All other issues are present in spades. Lock-in is worse on the Amazon box than it is on Roku (cross-app searching right from the home menu on Roku). Roku provides iOS and Android apps for remote control; on the FireTV, you have to buy specifically a Kindle HDX.Amazon will only search its own content. Not only that, the search information offers no way to search only Prime content, and the banner that distinguishes prime from non-prime is quite small. It doesn't help that by default, your FireTV will come configured to purchase video automatically/pin-less.Since the voice search works only with Amazon content, each app provides its own search. The text entry varies from app to app; even on the Amazon side of the software stack, there are numerous different ways to enter text.All of this combines to make quite a poor user experience. At least on, for example, the Roku, there is basically one system-wide text entry system for all inputs.On the hardware side, the one good thing about the FireTV, it's snappy. Fast. Not a let-down here. One problem I have, though, is that HDMI device control will not work while the FireTV is plugged into my entertainment system; highly disappointing. Really frustrating when I want to watch on OTA program and Audio Return Channel has ceased to function just because the FireTV is plugged in.I contemplated sending the device back. But, I think I'll keep it. All of these problems (besides possibly the HDMI issue) are software - and that's fairly easily remedied, given time. I purchased this to upgrade my Roku XS instead of getting a Roku 3. In part this is because in December, Roku introduced a major software update that caused my Roku XS to crash just about every other night while streaming video. Many other people were affected (it seemed, from crawling the forums), but no update ever came to fix it. Roku was focused on the Roku 3. I didn't feel like rewarding Roku for this by buying their next piece of hardware.I hope that in the future, Roku will look at the FireTV and work on the responsiveness and speed of their UI. That was a long-standing issue I have had with all of their devices. Input lag is very irritating on all the Roku devices that I have used (which is all of them but the Roku 3.) Roku has more channels, cross-channel searching, and an even more open platform than what Amazon is selling here. Amazon has until the next Roku hardware iteration to solve their software issues - that will determine whether I stay with the Kindle platform or move back to Roku - or whatever seems like the best option.Ultimately, I think it will be trivial for Roku to fix the problems in their platform, while the FireTV has a long, tough climb ahead.", "verified": true, "helpfulness": "3/6", "author": "Eat More Fiber"}, {"rating": 5.0, "review": "Works great, but has no OFF button and the instructions don't say it goes to sleep after a 1/2 hour.", "verified": true, "helpfulness": "0/0", "author": "Wayne B. Lindberg"}, {"rating": 2.0, "review": "First i am a top 50 reviewer in the vine program but you will not find out my real identity because i asked someone here to let me post this on their computer..two major things that stop me from wanting this product i no HBO GO  and ypu can not mirrior from tablets, cell phones and pc laptops to , APPLE TV ,CHROMECAST not sure about roku..notice how none of the big reviews mention this about mirroring ...remember anyone that writes a full page review on a product ,well you know the rest ,if your smart...thank for your time", "verified": false, "helpfulness": "4/19", "author": "buddaman1260 \"buddaman1260\""}, {"rating": 2.0, "review": "I ordered this Amazon Fire TV box and remote to enhance my Home Theater and our entertainment choices.  I started out poorly, in that the wireless took many times to enter the security code.  It just would not take.  Frustration was really sitting in, when it finally connected.  No screw-ups on my part.  It was just a long and grueling process.  The software update, also took a long time to download and the install was just barely better, as it did load a little quicker than expected after such a long download.  Then the disappointment really peaked when the setup asked for who you used as a wireless server and gave a very limited list of servers and OTHER.  I chose other as my DSL provider was not listed, and it is a bell south ATT server.  My wireless connection was made, but \"with problems\" as stated on the connection notice on screen.  Nothing would work, until I finally got it to connect later after turning off another device that uses wireless connection.  Now each time I try to select something to watch, I just loads and loads and if it does select the offering, Netflix, it drops out and has to load again.  I plan to connect with the product service and if they do not resolve these issues, I'm done and they can have it back.", "verified": true, "helpfulness": "3/4", "author": "CDP and his Amazon Habit of purchases!  ! \"Double00Buck\""}]