[{"rating": 4.0, "review": "Good product, but a little buggy at times.  If trying to cast a streaming tab from chrome, it sometimes stops working after about 30 minutes. You can cast 1/2 hour tv shows with no problem, but movies not so much. Videostream for movies you own works perfectly with this device.", "verified": true, "helpfulness": "0/0", "author": "k"}, {"rating": 2.0, "review": "Let me start out by saying that I've got a 300mbps (5GHZ) 156mbps (2.4GHZ) dual band router. This device, which is made for media streaming, only uses the 2.4 GHZ. I've got plenty of internet bandwidth to share but this thing is still much slower compared to all other devices on my network. Not only is it slow but it also seems to be outputting at a low resolution everything is slightly blurred, doesn't matter what device I use, the images/videos that play on the chrpmecast are less than crisp.Now I might be able to get over this but it is also very glitchy. If I want to view a simple picture from my device on the chromecast it will load one picture but when I switch to another picture I get nothing but black screen till I pull the plug.This, for me was a waste of $30. Thats the thing though, it was only 30 dollars. When this thing does work it is really cool. If you don't already have a smart TV, your converting a regular tv to a smart TV for only 30 bucks.I will also say that Google isn't a slacker, I have no doubt the issues with the Chromecast will be worked out", "verified": true, "helpfulness": "0/0", "author": "Loche Kniffin"}, {"rating": 3.0, "review": "I was very dissapointed when I got this. I live in my college dorm, so it took nearly 2 weeks to set this up because I had to communicate with the IT department to set it up to the wireless network. After it was finally set up, it only connected to my device SOMETIMES, but not when I needed it. And the kicker was that netflix never worked with this at all. That was the whole reason I bought this! I ended up reselling it to someone else because I could not use it at all", "verified": true, "helpfulness": "0/0", "author": "glammorazzi"}, {"rating": 2.0, "review": "I like the wireless capability but am disappointed in how choppy the sound is sometimes - too choppy to understand what is being said. They should also develop an app for Hulu (not just for Hulu Plus) to help with the choppy noise issue. It also loses it's connection after about 10 minutes, so if you're watching a movie, good luck ever being able to pause it. You will have to stop casting and refresh your mobile device and then recast.", "verified": false, "helpfulness": "0/0", "author": "W. Smith"}, {"rating": 5.0, "review": "We recently ditched cable. And had computer hooked to the tv for streaming. It was a pain to keep the babies fingers off the computer lol however with this I can cast programs from say popcorn time to my tv while computer is up on the table away from little hands. Wish Amazon prime was available with chrome cast but everything else works with it. And since it can plug into your tvs USB port there is only ONE cord my tv cord :) minimalists dream :)", "verified": true, "helpfulness": "0/0", "author": "Tonya"}, {"rating": 5.0, "review": "this is one of the best tech products to be released in the last couple of years, if you own an android phone, have a good internet connection, and have a good wifi signal in your home you should DEFINITELY get one of these.", "verified": false, "helpfulness": "0/0", "author": "mtbiker033"}, {"rating": 5.0, "review": "Folks, you need a bit of determination to get this thing working correctly. For $30, I have to give it 5 stars. One thing I noticed, if you use the \"extender\" it is so heavy it can actually pull your connector slightly out of your HDMI port on your TV causing interruptions and flickering. If you can stabelize the extender and make it so it's not weighing down the connection to the TV, it works better. I also placed a magnetic ring around the power cable near the chromecast piece to remove static and improve video and it worked. (This does not come with the purchase). A good quality power-strip is also needed for good quality video. Anyway, I can cast from my Samsung notepad or my droid Max. Mostly I cast Utube videos but I was casting ESPN college basketball games successfully. The reason chromecast is better than my DVD-wifi player is because when I use chromecast, I have a keyboard to use from my notepad or phone. If I send video to my TV from my DVD player, I have to use the clumsy Remote Control which has no keyboard. If you like utube, it's definitely worth $30. I can't speak about movies or TV shows, don't watch them on chromecast. Maybe someday I will.", "verified": false, "helpfulness": "0/0", "author": "Thomas E. Knoble \"Tom K. from South Jersey\""}, {"rating": 5.0, "review": "everything work great, however the packing arrived a bit longer than expected", "verified": true, "helpfulness": "0/0", "author": "great game"}, {"rating": 3.0, "review": "It is good. But the day I brought this My TV stooped working, but Chrome cast worked good on my friends TV.", "verified": true, "helpfulness": "0/1", "author": "saroj"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Phillip Call"}]