[{"rating": 5.0, "review": "Before Amazon Fire TV, I connected to Amazon via an \"App\" on my Panasonic Blu-Ray player.  It became somewhat cumbersome to use because not all the features were on the app, such as My Watchlist.  After a few connectivity issues with the Panasonic + Amazon I decided to get the Fire TV.  I'm an Apple fan but also an Amazon Prime member.  Amazon has given out some nice perks for Prime members and I thought it would be a good time to get this because neither my Panasonic player nor my Samsung TV would show Prime Music, Amazon apps, Pictures, etc.I have to say my favorite feature is the ASAP start.  When you pick a show or movie, it starts right away, no testing connection speed, then loading video wait times.  I like the layout of the home screen, it's pretty intuitive.  I've already downloaded some free apps such as the aquarium which just shows fish swimming around on the TV with some soft music.  I'm looking forward to getting my pictures uploaded to the Amazon cloud so I can view them on my TV quickly and easily.  Everything about the Amazon TV seems fast as in you pick what you want, you get it right then.  I tried the voice search and it does work nicely, definitely beats trying to perform a search by selecting letter by letter.  Also if you are watching a TV series, the next episode will automatically start once the current episode is complete - great for show bingeing!I have to say the hardware was surprisingly small.  The Amazon TV is about the size of a small of a slice of bread.  I paired it up with an Amazon Basics HDMI cable to keep things on the cheap side.I considered the Apple TV but honestly I feel like the Amazon TV currently has more to offer, especially for Prime members.  Very happy so far!", "verified": true, "helpfulness": "1/1", "author": "right_coaster"}, {"rating": 5.0, "review": "I love the fire tv box its fast its verything it said it was love it", "verified": true, "helpfulness": "0/0", "author": "mark plunkett"}, {"rating": 5.0, "review": "Best product ever...!!!!", "verified": true, "helpfulness": "0/0", "author": "cld"}, {"rating": 5.0, "review": "I've used my Original Roku for almost 8 years and it was slow and needed to be rebooted once a day. On a whim I bought the Fire TV and so far, it's amazing!! Setup was a breeze, it's fast, easy to navigate around, apps are straightforward, and content delivered seamlessly! It's only been a day, but HULU, Netflix and Prime videos are HD quality, no buffering and all have a great interface! The voice commands are a great touch but too bad you can't voice search within apps.My only complaint is that it isn't WiFi enabled. It's not a huge deal but would be a nice option just incase I didn't have a readily available network cable connection.HBOGO is on the list to be released soon so then it'll have everything that we need!", "verified": true, "helpfulness": "0/0", "author": "JMan1376"}, {"rating": 3.0, "review": "just got it, will update in a few months", "verified": true, "helpfulness": "0/0", "author": "Hector H."}, {"rating": 2.0, "review": "A decent alternative if you're looking for a direct Roku competitor, that runs on Amazon's closed services.Pros - SnappyCons - Mine has a faulty power connector, and if the cable hangs too hard in the connector then it disconnects the HDMI connector from the board inside and my TV loses an input signal.Software/Remote was buggy.  Every few button clicks on my remote would cause whatever app I'm in to reboot. Whether it was Plex or even the Home Screen, it would crash out and restart.The Appstore is limited to Amazon's Appstore, unless you sideload. But my sideloaded apps that relied on Google Play services wouldn't work.-------I am returning mine.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "Massive amount of free shows and movies.If you can think of it you can probably watch it. All the apps you could ever want.The best part of all is there are no commercials or interruptions. Best money I have spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "Kevin Brown"}, {"rating": 2.0, "review": "Only had it for a few days but so far I prefer the Roku. For one, the remote has been downright infuriating. It's become nonresponsive and is terribly flaky while inputting text. I mistyped my login on several occasions. The voice technology would be a great use for that.Also the voice search only works for Amazon and is not available from other apps.  I'll revisit my review after a few weeks if I keep it but right now I'm strongly considering returning it.", "verified": true, "helpfulness": "0/0", "author": "MLH"}, {"rating": 3.0, "review": "Does not have sports channels...Just ESPNMostly movie  & TV selectionsHowever good picture quality....", "verified": true, "helpfulness": "0/0", "author": "Francis Vuolo \"Amazon Man\""}, {"rating": 4.0, "review": "Adequate. Sometimes a little hard to find prime movies and episodes.", "verified": true, "helpfulness": "0/0", "author": "rhuddle2000"}]