[{"rating": 4.0, "review": "Amazon Fire TV is a pretty cool little device.  My first of this type of tv box. I like mine but wish there were some buffering options and that I knew how much space was left on the thing.  If there were some more configuration options, I would be really happy.", "verified": true, "helpfulness": "0/1", "author": "Brandon Sander"}, {"rating": 5.0, "review": "I had a DVD to view Amazon videos prior to purchasing my Amazon Fire.  I really like it because it was an easy setup since I purchased from Amazon.  I have viewed a couple of movies and several TV shows so things look very good.", "verified": true, "helpfulness": "0/1", "author": "David Mahoney"}, {"rating": 4.0, "review": "Works as expected. Happy with purchase.", "verified": true, "helpfulness": "0/1", "author": "Tituanium"}, {"rating": 2.0, "review": "can't watch anything !!! it tells us our bandwidth is too slow. unless you have the router right next to the device you will get this message. sending it back.", "verified": true, "helpfulness": "0/2", "author": "Dale Pescitelli"}, {"rating": 5.0, "review": "Bought this for my parents for Christmas so they could cut their cable bill. They love it, especially the voice remote. It took awhile to teach them how to use it but they are now very happy to be spending only a small fraction of the amount they used to pay for TV. It also is linked to my Amazon account so they have to consult with me before making purchases (there is a pin code required), which helps them to avoid accidental spending. My dad now spends hours on YouTube watching True Facts videos and my mum marathons her favorite shows on Netflix, Prime, and Hulu. They initially griped about the lack of sports but I showed my dad how to subscribe to the NHL app and Sling TV and he's happy. And hey, more excuses to go to Buffalo Wild Wings! The only thing I didn't like was that there wasn't a way for me to download apps for some of our local channels.The days of fighting over who gets to have the remote to mute commercials are finally over. And my mum no longer ignores me during her favorite shows since she can just pause them. Well worth the money. Even convinced them to finally upgrade from their previous bulky TV that was so old that it didn't even have an HDMI port. Since they wouldn't let me buy it for them, I had to calculate out how long it would take them to save up enough to buy a brand new TV from their savings from cable (2 months) and they were convinced. No more breaking their backs moving the old TV.Amazon Fire TV has really improved my life even though I didn't buy it for me. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Caate"}, {"rating": 5.0, "review": "So glad I got this thing. Takes up one USB port and let's me watch movies and shows on so many different apps. The remote may feel a little small for some, but it fits my hand perfectly. Gary Busey didn't influence my decision at all.", "verified": true, "helpfulness": "0/1", "author": "Justin M. Wadsworth"}, {"rating": 5.0, "review": "It was  easy to install and even easier to use.", "verified": true, "helpfulness": "0/0", "author": "Dennis Heidelberg"}, {"rating": 4.0, "review": "Easy set up. Easy to use. Great picture quality. But it should include the HDMI cable since it's necessary to connect to TV.", "verified": true, "helpfulness": "0/0", "author": "Brittany Lang"}, {"rating": 5.0, "review": "Its Good", "verified": true, "helpfulness": "0/0", "author": "david hutto"}, {"rating": 5.0, "review": "Outstanding product. Better known content has to be bought even with Prime. Love the access to my Amazon music purchases though.", "verified": true, "helpfulness": "0/0", "author": "Ashik"}]