[{"rating": 5.0, "review": "Love the selection of movies and apps with Amazon Fire TV. Almost ready to clip the cable!", "verified": true, "helpfulness": "0/0", "author": "Linda Miller"}, {"rating": 4.0, "review": "Arrived in a very timely manner.  Easy to set up and install. Voice recognition works well.  Maybe I haven't learned to properly use it yet, but I find it wants to navigate back to Prime TV.  Example, I want to watch 'Shark Tank' on You Tube.  I navigate to Youtube and say 'Shark Tank\", it always goes back to Prime with episodes of 'Shark Tank\" for pay.  I have played very little to see if I can figure a way around this.", "verified": true, "helpfulness": "0/0", "author": "Greg W."}, {"rating": 5.0, "review": "It is much better than Apple TV which I had before.  I wish there were more free prime movies/tv shows.  And the voice recognition isn't that great especially if you don't have general American speech. It gets confused by any regional or foreign accent.. Born and raised in USA and still have problem.. Must be my NY accent!", "verified": true, "helpfulness": "0/0", "author": "Kathleen A McDermott"}, {"rating": 5.0, "review": "A great gadget for watching Amazon Prime and playing those kindle app games. And lots and lots more, but at this time. all I do on it is play a few games and watch Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Debra Todd"}, {"rating": 4.0, "review": "As an Amazon Prime and Netflix subscriber this is a good little device with lots of potential.The voice search is a great feature.However, Amazon, I hope you read these reviews and give us what we want added to this device.It needs:Support to attach an external USB Hard Drive for playing local content. Ie. .mkv, .mp4, .avi etcSupport to share my attached content over my home network.Support to install apps to the attached USB device.I would like to load some games to the device but the available storage is very limited.", "verified": true, "helpfulness": "1/1", "author": "Gary Hancock"}, {"rating": 5.0, "review": "This is the 3rd viewer I've owned (well, including a Wii).  This has been by far the best.  I have some of these functions built into my \"smart\" TV but it is sluggish and hard to navigate.  It is so nice to have NetFlix and Amazon in the same device!  The Fire TV is blazing fast to navigate! The voice recognition is amazing.  Only drawback to voice is the search only works on Amazon's media, it doesn't include apps in the search. The YouTube app is really nice, especially after you integrate your google account.  This allows you to navigate on an iPad or phone and basically move it over to your TV to watch.  We cut the cord to cable a couple of years ago so this little box gets a lot of action - we worth the low price.", "verified": true, "helpfulness": "0/0", "author": "Jax Music Supply"}, {"rating": 5.0, "review": "Huge fan of Amazon appliances - haven't dug into all the features yet, but what I have touched it's great.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 1.0, "review": "Tried calling, and they couldn't help. Took the issue away for 'research'. Haven't heard back yet.Tried the chat, and they wanted my credit card info to process a replacement, even though they were chatting with me on the Amazon account. Pass. Roku 3 is still sitting in the entertainment center next to the now Amazon bricked Fire TV. Pull out network cable and HDMI from one, stick it in the other. Done and Done.", "verified": true, "helpfulness": "3/6", "author": "CI \"CI\""}, {"rating": 3.0, "review": "...it won't work for Netflix. At least not for me. I downloaded the app, but it gives me an error every time I try to open it, and never lets me get so far as entering my Netflix ID and Password. There seems to be no real Help service for the product, so I'm hoping some kind soul can give me a hand before my frustration results in a return... Thanks. GF", "verified": true, "helpfulness": "2/2", "author": "T. Peterson \"TJP\""}, {"rating": 3.0, "review": "probably was easier to navigate than my Wii is but it didn't seem to have as many viewing choices but was ok", "verified": true, "helpfulness": "0/0", "author": "Richard Morris"}]