[{"rating": 3.0, "review": "I hope it works in hotels when traveling", "verified": true, "helpfulness": "0/0", "author": "William A.Woodard"}, {"rating": 5.0, "review": "This is an amazing item. Worst thing I could have given my husband for Christmas but I knew he would love it. He does, even more than I thought he would. He loves watching the movies trailers so he can choose e which movies he wants to watch.", "verified": true, "helpfulness": "0/0", "author": "Karen Morris"}, {"rating": 2.0, "review": "I was very disappointed in this streaming device with access to a few games which appeared to be fun to play for the family. I am a great fan of my kindle products, and have been a prime member for many years so I thought I would try the fire tv.  I have a Roku 3 on a different tv and I am not sure if I was comparing it's ease of use or if it is just that poorly designed.Examples:  I wanted to find my amazon prime watch list, my Roku showed I had 38 items marked as favorites on the firetv showed I had 16. When I was looking for various movies to watch on the Roku for Prime it indicate 300 available but on the fire it showed 60.  I contacted FireTV customer service and the representative I talked to could not tell me why there was this difference in what I was seeing on firetv and the Roku.  I had other concerns on the fire and how it works (I am not very electronic oriented)  I like things to plug and go with little learning curve, but she could only answer 2 of the 4 questions to my satisfaction because I don't know or I'm not sure to me is not an answer.Sorry to say, I returned this item and ordered another roku 3", "verified": true, "helpfulness": "0/1", "author": "Ms Flutterbug"}, {"rating": 1.0, "review": "Not sure how to rate. I have not been able to get sound from the box in my theater room. Not good.", "verified": true, "helpfulness": "1/4", "author": "db"}, {"rating": 5.0, "review": "Simply Amazing.  The user interface is exceptional and the speed is nothing short of BLAZING!!", "verified": true, "helpfulness": "0/0", "author": "Donald"}, {"rating": 5.0, "review": "So far it is loved. The only thing better would be to get FOX new live and shows like Jeopardy currently aired.", "verified": true, "helpfulness": "0/0", "author": "Lazy Creeks \"Lazy Creeks\""}, {"rating": 5.0, "review": "n/c", "verified": true, "helpfulness": "0/0", "author": "rufus j simpkins"}, {"rating": 5.0, "review": "Totally awesome !!!", "verified": true, "helpfulness": "0/0", "author": "Judith Smart"}, {"rating": 5.0, "review": "Awesome. Totally worth it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Supermanfan24\""}, {"rating": 5.0, "review": "It was super easy to set up and use. I love being able to get my Prime videos on the big screen and my son loves the original kids' programming. Great value.", "verified": true, "helpfulness": "0/0", "author": "DuffyKendale"}]