[{"rating": 4.0, "review": "The first time that I used the Amazon Fire TV, it reloaded in the middle of the film and stopped working.  I was so frustrated with that I said I was going to return it.  But the next day I decided to give it another try, and it worked perfectly, and it has continued to operate flawlessly for an entire day.  I now also have read the on line instructions and have learned of many of its outstanding features.  I have gone from hating it to loving it. I would have given it five stars, by I wanted to curb my enthusiasm until I have had a few more days without a problem.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Amazon prime too expensive anymore. Fire TV not as good as roku or apple TV..really like the power supply being built into apple TV..not as user friendly as the other products..don't like the idea that prime will not work on portables withoutFlash...an okay first attempt even though it didn't include the HDMI cable. I love Amazon's great customer service..Best I've seen...", "verified": true, "helpfulness": "4/17", "author": "Charles"}, {"rating": 3.0, "review": "I can Browser the net, with Chrome google, Explorer or Firefox, Like Google TV? or not? wait for you response!", "verified": false, "helpfulness": "1/21", "author": "Ri"}, {"rating": 4.0, "review": "Just got it and am excited to try it out.  It was so easy to set up!  Looking forward to watching it now.", "verified": true, "helpfulness": "0/7", "author": "Two Of Us"}, {"rating": 4.0, "review": "This is my review of the Fire TV Box.  The main reason why I purchased the Fire TV is because the Amazon App on my Vizio TV has had many problems over the last year.  But, the TV, and all the other Apps are just fine.  So, rather than pay $200 for a Vizio repair man, I decided to purchase the Fire TV box instead.  Clearly, if you don't have a good standalone video streamer, this is a very good buy!1. WiFi Reception.  It really is quite good.  HD Movies come in very strong which is a huge improvement over the Vizio TV Amazon App. The WiFi reception is probably one of the biggest improvements for me. It simply streams without any WiFi issues and plays without buffering. Obviously a lot of that has to do with my connection speed, but I've had problems with buffering with even extremely high internet speeds in the past. The quality of the WiFi allows me to see the movies in HD, when I couldn't before. 10 of 5 stars.2. Size.  The tiny little box is very nice.  The size is very small and yet it works very well. The unit seems to always be on and I'm ok with that.  5 of 5 stars.3. Menus.  The menus are very smooth and responsive with no jitter or lag. I am really impressed with this! Simply move the through the movies with the left or right button on the remote and you can flick through what you like or have watched.  However, there is no way to search for just the free Amazon Prime Streaming movies from the rentals or search for a category like Sci Fi or drama.  Currently the search is for movie titles only. 3 of 5 stars4. Closed Captions. Fire TV has Closed Captions as a selectable option.  This is a big bonus because the Vizio TV app for Amazon does not feature closed captioning.5. Set Up.  Set up was very easy, almost too easy.  10 of 5 stars6. Shipping.  I got this unit it only one day!  Holy Cow, I didn't pay for that, but I am impressed! 5 of 5 stars.7. Kindle Fire HD.  It does not seem to work with my Kindle Fire HD, only the HDX. I spent a lot of money on my Kindle Fire HD, and I am a little disappointed that there is no way to have this feature on my HD. It would seem that Amazon could create an app to make the HD work like the HDX. 0 of 5 stars8. Voice Remote.  Works great the first time. But as already mentioned, the search (even in voice mode) is for titles of movies only. 5 of 5 stars.9. Amazon Account. My Amazon account was already programmed in! 5 of 5 stars10. Forward/pause/rewind. Once a movie is playing, you can forward, pause & rewind and even see a picture of the movie as you scan through it. While you are forwarding or reversing through the movie, where you were is still playing.  That's pretty cool as well! 5 of 5 stars.11. Netflix.  The Netflix app works fine, although the Amazon has more features that are easier to get to. 5 of 5 starsSo, I am very happy with the purchase.  From my own experience with the original Kindle Fire and the Kindle Fire HD 64 gig 8.9, there has never been an Amazon branded device that has worked so flawlessly right out of the box the very first time.  You did really good Jeff! And, because the first Kindle Fire units were not perfect from the beginning, you know I really hesitated on this Fire TV unit.  I am so glad that I went ahead and didn't wait.", "verified": true, "helpfulness": "5/8", "author": "Mark"}, {"rating": 5.0, "review": "my issue got solved. I had to connect it directly to the internet cable for the initial download. then wham. it works amazingly! I love the convenience of having a computer on my TV. Thank you Amazon!", "verified": true, "helpfulness": "12/26", "author": "steVando"}, {"rating": 5.0, "review": "[UPDATE on July 16, 2015]Adding 5th star. My biggest issue with this device has been resolved. The USB port was enabled for use with external storage a couple months ago. I purchased a little USB flash drive, and it works great for additional app/game installations. I'm super glad I kept this thing, as it became the most heavily used entertainment device I own.This is the flash drive I'm using: SanDisk Ultra Fit CZ43 32GB USB 3.0 Low-Profile Flash Drivehttp://www.amazon.com/gp/product/B00LLER2CSNow Amazon, just make a couple more improvements, and this thing would be perfect:1) Make Netflix searchable through voice2) Tie this in with Echo so Alexa can play music though Fire TV, which is connected to my better speakers.[Original review from April 7, 2014]As a video streamer for Netflix, Amazon Instant Video/Prime, and Hulu Plus, this device is great.For playing great looking and smooth running casual games, Amazon Fire TV is also great (with the separate game controller).This box is FAST, fluid, and smooth. I received it the day after launch day. I also own a Roku 3, Roku 2, Roku XS, Chromecast, and an HTPC with cablecard tuner running WMC.However, Amazon Fire TV is crippled by the lack of available storage space for games.Look, I know this thing likely was never meant for lots of gaming. The \"problem\" is, it's actually really good at running some great looking casual games. Some of the games available, I wouldn't even call \"casual\". Many of the available games are pretty awesome, and the prices are free or cheap. Available games like Asphalt 8: Airborne, Sev Zero, Riptide GP2, Walking Dead are some of my favorites!I didn't plan on using this thing for any serious gaming, but I somehow ended up falling into that. However, even though it says there is 8GB of storage, you really only get about 5.5GB available, as the rest is used by the OS. For some of the better games, you can only fit a few on there. I only have 4 or 5 games installed and now lack the space to hold another game I was interested in purchasing. Yes, I could delete something, but what would happen to my game progress for that game? Is it saved in the cloud somewhere or gone forever? I cannot find an answer.There is one USB port, but as of this writing, it cannot be use to expand the storage. I hope Amazon rectifies this soon, but who knows if they will. The USB port does work with a wireless Logitech keyboard I plugged into it though! That's at least good for entering the password during Netflix setup.I do thank this little box for one thing though. It brought back my interest in console gaming that I thought I lost a long time ago. Seriously, I was last gaming when Super Nintendo and Sega Genesis was still a thing, and PS1 barely existed. (I tried PC gaming, but, well, couldn't get into it...)I FINALLY just ordered my first Xbox 360 E (with 250GB HDD) which should be arriving tomorrow. Yeah, I know I'm super late to the game, and Xbox One is out now, but hey, it's still new to me! I also get to look forward to a huge library of existing games that are a lot cheaper now.I will very likely be returning the Fire TV and game controller back to Amazon. I feel a little sad about it. It renewed a love of console gaming that was long lost in me, but alas, it couldn't sustain it, and I know it wasn't meant to. It's already time to move on to something better.I still give Fire TV 4 stars. It lost a star due to the incredible lack of available storage, but everything else was good. I would have gladly paid a little more for a more reasonable 32GB of storage (or 64GB!) I really hope that Amazon at least makes the one USB port usable for expanding game storage in the very near future.In conclusion, if you already have a Roku 3 or maybe even Chromecast (no Amazon Video), you likely won't care a whole lot about Amazon Fire TV.If you don't already have a good video streamer, then get this.", "verified": true, "helpfulness": "5/7", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I placed my order as soon as the FireTV was announced.Here are my Initial impressions:The physical look and feel of the device and remote are very premium with a nice textured / soft feel.  It's a sleek black with a lightly glowing power led that easily fades into your entertainment shelf.  The remote is bluetooth so you don't need line of sight to the device to control it.The box is quite a bit bigger (depth and width) than Apple TV although maybe a tiny bit shorter.  The FireTV includes a wall-wort style external power brick (unlike AppleTV which only has a thin two outlet power cord).  Also, the power adapter is a little bulky and would obscure both the outlets next to it on my surge protector power strip. To avoid wasting three outlets, I am using a short 1 foot extension cable that I bought on Amazon (1-Foot Extension Power Cable, 5-Pack).Another silly note on power... I can't find an \"off\" button or a menu item to turn it off other than unplugging the device. And plugging back in turns it back on. It has a 16W power brick so there might be some continual background power drain if this thing is plugged in. Also, for some reason, the AC adapter made sparks at the plug both times I tried plugging it in. I was a little scared that I might have burnt it out but it seems to work fine.*** UPDATED NOTE: I tested power with my WEMO Insight.  When it's running it's typically around 4 watts.  When the screen saver kicks on ironically it goes to 5 watts before it powers down to a low power mode of 2-3 watts.  Anyhow, it will only cost around $3 a year in electricity to run even if it's fully powered on.  Likely closer to $2. ***First impression is that the UI is not as polished or pretty as the Apple TV but it seems usable. Voice Search is fairly fast but not nearly as \"instant\" as the commercials and videos online make it seem but it works at least as good as \"Siri\".  It will work much better once Amazon starts including more meta-content from Netflix et al like they do with Hulu.HBO GO is not on it yet but I'm hoping for an app soon.I installed Flixster to access my Ultraviolet Collection (I have about 30 movies in the \"cloud\"). Unfortunately, Flixster will not play any of my movies in HD and highly compressed 480 SD resolution is a mess on my 65\" TV.  Currently my Ultraviolet Collection look unusable bad when played back on the Fire TV due to the SD restriction.  This should be a simple software fix for the Flixster app or a permissions fix on the Ultraviolet library.The Fire TV remote seems to lose \"pairing\" a lot. I sometimes have to use the game controller to go to settings and then to Add Remote and it will find it again.  Hopefully this will get fixed with a software update?*** UPDATED NOTE: I only lost pairing with the remote in my office which has literally 100+ Bluetooth devices within a 30 yard radius of me - I work in game development.  I haven't lost pairing at home with the remote - I've only had to re-pair at the office. ***There is a USB Port. I've got a keyboard hooked up to it right now. However, not all the apps support input with the keyboard and some are clunky. I was hoping to avoid using the remote / controller for passwords and usernames during setup. It worked for a number of things. However, not all apps support the tab key to switch between fields or the enter key (it acts like the select button rather than a completions). The Amazon Video PIN entry also doesn't recognize numbers on the keyboard so you have to use the arrow keys and the enter/return key for select.  Anyhow, better and more consistent keyboard support would be nice.Note on the Sold Separately Fire TV Game Controller: it's big and uncomfortable and the D-PAD is very poorly positioned. The Fire TV Game Controller is worse than the Pre-S XBox Controller. It feels like the NVidia Shield a bit but that at least has an entire computer (roughly as powerful as the Fire TV) inside the controller. Unless you have enormous hands, you won't like this controller which is too bad.  The Amazon Fire TV has a good chance to have a lot of \"casual\" gaming content on it and this controller is horrible for kids, women, or even men who don't have Neanderthal palms. I wish I would have purchased a third party controller for less $$$ than the $40 I spend on the nearly unusable Amazon Game Controller.*** UPDATED NOTE: The NYKO Controller is much better.  It's half the price, has rechargeable batteries, is lighter and smaller and feels nicer.  That said, it is missing some of the media buttons -- it only has menu, back, and home for special buttons. Nyko Playpad Pro for Android/Bluetooth ***Summary: It's a cool device.  I have high hopes for the software and apps to improve.  In the meantime, I will still be using my AppleTV quite a bit.", "verified": true, "helpfulness": "41/51", "author": "A. Pochanayon \"Hacky\""}, {"rating": 3.0, "review": "Update 4/11/14 - I've dropped my rating another star because I think the biggest flaw in the FireTv is that it only has 8gb storage - after only a week, my daughter received a message that storage space was low and to free up space. She uninstalled Sev Zero and will probably have to uninstall more games.  If you install Asphalt 8 and amazons own Sev Zero games then you have pretty much used up most of your storage.  And there is no SD slot like the Roku 3 has to let you add space.  Flash storage is so cheap these days, so I really cant even understand why they decided to cripple it this way, if they were wanting people to play games on it.  It should have a minimum 16gb storage and preferably 32gb.  What a disappointment.  I definitely regret investing the $40 on the controller, considering that this is, for the most part crippled for gaming.Original Review:There are already plenty of reviews out there, but I'lll go ahead and throw my two cents worth in.  I bought this for my daughter, who loves her Roku 3 but also likes to play casual games.  I've been looking for a decent replacement since her first gen Wii broke several months back.  The Wii U was never really an option, it was over priced, and to be honest we were getting tired of the whole Wii platform and their lowest in class hardware specs.  The Fire TV fills the void nicely, she can watch her netflix, plex, and hopefully soon Disney channels while also having a nice casual gaming platform.Out of the box, the firetv feels nice - like an apple product nice - everything feels good in the hand and I really like the layout and controls of it.  I also like that it is nice and zippy when browsing or switching from app to app.  My daughter already has a kindle, so this makes for a nice addition - many of the games she already had for the kindle can be played on this.  My favorite cool trick so far with this, is the family game night game titles.  If you play fibber, you scan a qr code at the beginning and then each person types in their fib on their phone and it shows up in the game.  This is a really cool trick that really impresses.  Multiplayer mode on The Game of Life was also a lot of fun, and a great way to play board games on your tv.  I had some concerns ,that maybe this was an overhyped item that wouldn't live up to expectations, but so far I have few regrets.The biggest regret I had, and I suppose I shouldn't be surprised, is how tied in this is to Amazon Prime - sure there are netflix and other movie apps, but menus and categories are all geared to Prime videos and if you are not a Prime subscriber you will have to fork out to buy or rent everything.  This is disappointing, as I registered this to my daughters account but I have the Prime account and I am not about to pay for a prime subscription for each person in my house that may want to watch Amazon Prime videos. And I also don't want to register it on my account, because she has already purchased all her games and music on her own Amazon account thru the years on her Kindle Fire.Amazon - if you are listening, you are blowing it big time but not having a way to let my kids have their own account but still be a part of my prime account!  With google videos, I can add another google account and that content will then show up along with the other accounts content.  Amazon needs to have something similar. They could still limit the number of viewers at one time the way netflix does.  My kids have always had their own amazon accounts because in the early days if I had added them to mine I would have to see all their books, music and games on my kindle.", "verified": true, "helpfulness": "2/4", "author": "Ms. T"}, {"rating": 4.0, "review": "but lacks content.  when i can i watch tv for free! not enough free stuff with my prime account since i can use that on my ps3, bluray player anyway.  oh well it's another smarttv in the bedroom at least.", "verified": true, "helpfulness": "0/1", "author": "Andrew S"}]