[{"rating": 5.0, "review": "Google has found a way to start making equipment smarter. I will not go into details on what this product does, as I recommend that you do the research. I will say it does everything it says it will do and more and this is just the beginning. This is the best $35 spent in awhile, props to Google for a home-run!", "verified": true, "helpfulness": "4/5", "author": "Alexandra Anderson"}, {"rating": 1.0, "review": "OK, admittedly, I knew that pickings would be slim for Chromecast apps.  One of the things I did like, the thing that would sling the Chromecast past my Roku, would be that it could stream Chrome browser tabs.  It don't.  In spite of it's name, it will not cast Chrome tabs from the Android platform at this time.I already have a HTPC so the biggest draw for me for Chromecast would be to get rid of the HTPC box and run this service off my Android tablet.Well, the version of Chrome browser on the Android tablet doesn't run Flash.  So, no, I was not going to be able to run ALL of the programming that I do on the HTPC.  Well, we're told, more programming is coming.  And Google is trying to force media content providers to abandon Flash and rely on HTML5 - hey by making Chrome for Android Flash non-compatible maybe it will force the entire world to change how it does streaming media (not).  I know Flash is clunky and inefficient, but it remains the standard for media streaming.  They still include Flash support for PC based browsers.  Hmmmm...  Maybe their browser market leader position would crumble to Netscape proportions if they dropped Flash from that version.Well, back on topic, I finally got the Chromecast yesterday, and if all you want to do is watch Netflix, then I guess it's OK.  Certainly no better than what I got on Roku or HTPC.  The inability to stream a browser tab is inexcusable, and I think with all the build up over the ability to stream Chrome is deceptive marketing.Someday, it may be good if anyone like Hulu+ or Amazon releases a specific app for it.  Heck, even if it offered the ability to stream Chrome off of  an Android device it would almost be pretty good.  But until there are apps for the programming you want, or the full ability to stream a browser, pass it by.  Given the sales success, all I can say is the marketing folks have done a marvelous job of polishing this little turd.In spite of it's name, it will not cast Chrome tabs from the Android platform anyway.  Anybody want one that has less than 30 minutes of Netflix use?  One new in box?  I may be throwing these things on CL or EB soon...", "verified": false, "helpfulness": "10/34", "author": "OMyMyOHellYes"}, {"rating": 5.0, "review": "If you are like me and you have always wanted a way to mirror whatever you are watching on you tube to your TV, then this is your lucky day. This device is small, cheap and does the job very well.", "verified": true, "helpfulness": "3/4", "author": "Sweiss"}, {"rating": 5.0, "review": "Ordered this from the play store the right after I watched the Google announcement. This thing is borderline magical. This is what tech is all about. I have tried all the existing apps from the phone and they are seamless. Just put the Chromecast app on your phone and any app that supports it like Netflix and Google play Music get an added icon for casting. Click the Cast icon and its playing on your TV. If your TV is newer, it works even better because the TV input will automatically switch to the HDMI port of the Chromecast.For Computers Just download the chromecast App and your good to go. For apps that are not native, you can use the Chrome browser and push your screen to the Chrome cast. Here is the slick part that isn't even talked up by Google. I keep all my media on a server, my home videos, pictures, music and my movie collection are all accessible from the netwrok. Well Google has made it possible for that collection to be shown/played on every TV in the house. You can just drag and drop files into the Chrome browser and it decodes and plays them on the fly. Hit the Cast icon in the corner of the browser and it streams content to the TV. I have tried it my wired PCs and Laptops with MP4s, MKVs, MP3s, JPEGs, PNG, and others. In all cases it is flawless. I am getting one for every TV. It's a must have for any techie. BTW - When I typed this, I was streaming \"A Bugs Life\" to the kids TV in their room from the PC in my office; it's a beautiful thing.", "verified": false, "helpfulness": "4/6", "author": "TheGeeDawg"}, {"rating": 4.0, "review": "Have only set it up and used it once so far... like the possibilities but don't like the thought of Google tracking everything you cast thru it...", "verified": true, "helpfulness": "1/3", "author": "Mark H."}, {"rating": 5.0, "review": "I' was a very early orderer from the Google Play store. So far I have nothing but love for the Chromecast. A buddy of mine has had issues with sound as he is out of HDMI ports on his tv and it won't work from his receiver. Something to think about... if you can't plug it into your TV and run the audio back to your receiver then you're stuck with your tv audio alone. Which naturally sucks.", "verified": false, "helpfulness": "0/0", "author": "J. Jason Stevens"}, {"rating": 5.0, "review": "Obviously the cheap price brought a lot of people to buy this device.  I was lucky enough to just sneak in with the free netflix, so mine was really cheap.  I think the sky is the limit for this device.  I can't wait to try it on my parents/sisters tv as well; I'm guessing it can remember multiple wireless profiles.", "verified": true, "helpfulness": "2/3", "author": "Nicholas Lee"}, {"rating": 5.0, "review": "For the price this is great. It does what it says and also this is the first generation of this product - thus it should get better with time. I would recommend this to others. It was easy to setup and use. Tested with an Amazon Kindle HD and worked! Will be trying this with iPhone and Android phone in the near future.", "verified": true, "helpfulness": "2/3", "author": "D"}, {"rating": 5.0, "review": "This product is the revolution in streaming devices. I have Roku and other streaming devices but with chromecast, it took streaming to next level. I can control from phone or computer or tablet and netflix is crystal clear. I wouldn't say it is perfect, coming to chrome browser tab sharing but for the price, it is really awesome. I definitely recommend this product. I hope more number of android apps support this cast in future.", "verified": false, "helpfulness": "1/1", "author": "HarleyV-Rod \"Vinay\""}, {"rating": 5.0, "review": "We use this to stream youtube clips to the main TV for the kids; it is perfect for this and this functionality alone makes it a solid buy for me. The Netflix integration is awesome as well.  If this ever gets app support from Amazon for instant streaming support I will be ecstatic.  A simple, effective tool, I recommend to any parent with young kids that like to watch youtube videos (we watch a lot of classic disney shorts this way).", "verified": true, "helpfulness": "3/4", "author": "Kevin"}]