[{"rating": 5.0, "review": "Easy install and easy utilization.", "verified": true, "helpfulness": "0/0", "author": "Jenny Dumont"}, {"rating": 5.0, "review": "i have the stick version but im adding a voice remote. I prefer it to my Roku units.", "verified": false, "helpfulness": "0/0", "author": "M. Evans \"New England Technology Teacher of The Year\""}, {"rating": 5.0, "review": "Absolutely love it. Amazon FireTV - combined with Amazon Prime membership for $99 - is a great combination, enabling access to tons of included free Movies, Music etc.. Device itself is well made, very responsible and comes with an easy to use interface. Voice recognition is superb. My kids loves it too, especilly now when I purchased game controller and she can play her MineCraft. Bought 1 FireTV for myself, bought two more for my friends as gifts - you just can't beat $79 sale price for a device of this quality", "verified": true, "helpfulness": "0/0", "author": "Greg K"}, {"rating": 3.0, "review": "I hate giving this only 3 stars because it could easily be 4 or 5 if not for two things.And although only 3 stars I still think the Amazon fire TV is worth the money and is significantly better than the Amazon Fire stick, enough to justify the price. If you are going with an amazon streaming device it should be the fire TV not the stick.Having access to prime and Netflix, among other apps on the living room big screen TV is a game changer. But for me it's not enough to cancel cable. That could change if HBO Go becomes independent of cable an offers streaming only options. And getting Netflix to install was difficult. It should have come pre-loaded, considering Amazon use it as a selling point on the cover of the box and in product descriptions.I was hoping this would be the device to make cable/satellite obsolete for but at this stage it just isn't. Could be in the near future, maybe not an Amazon device but they certainly are off to a good start.The biggest factor in not pulling the plug is still inconsistent connection to the internet even though I have a fast connection and live in an area that is far from rural.The occasional slowdown is almost never caused by the fire TV device, but the technology it uses relies so much on bandwidth, even with the pre-buffering it still cant match the reliability of cable.And finally there is no option to just channel surf. I know that is something this generation is less and less likely to want but for me it will always be a part of watching television. I love the control of streaming and on demand content.But I hate staring at a screen of \"endless choices\" and getting stuck.Again this is no fault of the fire TV, more just a drawback of set top streaming devices and smart TV's.", "verified": true, "helpfulness": "4/4", "author": "Jeffero28"}, {"rating": 5.0, "review": "Hard to install", "verified": true, "helpfulness": "1/1", "author": "Elizabeth J DeNicola"}, {"rating": 5.0, "review": "I am quite happy that we switched from Roku to Amazon Fire TV.  It does take some getting used to:  the menu is not as intuitive as Roku's, IMO, but the voice search is a nice feature.  For some reason, when I first got the product it seemed to pause for long periods.  My husband was just about to tell me to send it back, when the issue resolved and we've really had no further issues with it.  The remote feels a little cheap (don't they all!?) but I am otherwise quite satisfied.", "verified": true, "helpfulness": "1/1", "author": "Merlinharp \"merlinharp\""}, {"rating": 5.0, "review": "Love it! What a great device for streaming. Could not be easier especially useful as we enjoy Amazon Prime access to so many TV shows and movies.", "verified": true, "helpfulness": "0/0", "author": "B. Huber \"BJ from NJ\""}, {"rating": 5.0, "review": "This device is awesome! It also is a great gateway for Netflix!! As a Amazon Prime member the \"free\" library is great! Well worth the $99 price for being a Amazon Prime member.", "verified": true, "helpfulness": "1/1", "author": "Bill Geittmann"}, {"rating": 4.0, "review": "I bought this unit for my parents specifically to make their life easier when accessing streaming services and Prime content. I've played with it on a number of occasions and have to say I'm pretty impressed. Performance is stellar with no lag or buggy responses. The voice search is incredibly good, but needs to be integrated with other apps to truly reach its potential. I will say the omission of Prime Music is a major letdown, and something that will keep me from whole heartedly recommending this device. Nevertheless, this is a great box for a fair price and definitely worth a consideration when comparing other streaming boxes.", "verified": true, "helpfulness": "1/1", "author": "Moozicmon"}, {"rating": 4.0, "review": "Had some trouble getting Netflix to work, but otherwise it's pretty good.", "verified": true, "helpfulness": "1/1", "author": "Bridget"}]