[{"rating": 5.0, "review": "The Google Chromecast is perfect for anyone who loves Netflix, Hulu Plus, YouTube etc. It allows you to watch hundreds of tv shows or movies from applications from your phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "ATOTHEJ4"}, {"rating": 2.0, "review": "unable to display my computer screen on the TV, only works with youtube and like other systems via a network. Not a secure connection. Leaves too many doors open into my network.", "verified": true, "helpfulness": "1/3", "author": "Albert Timpauer"}, {"rating": 3.0, "review": "Works nice, it takes some time to configure with the wifi and it is a bit annoying to have to use another device to stream videos, but it's a fair deal for the price.", "verified": true, "helpfulness": "0/0", "author": "Alitapia"}, {"rating": 4.0, "review": "It's exactly what I was expecting from it. Takes some time to configured it, but it's operation is easy. Works very fine with the current applications, in special Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jairo P.  Paula \"Jairo P. Paula\""}, {"rating": 1.0, "review": "I'm glad I only spent $30 on this useless device becaues it doesn't do anything special. My TV and laptop do exactly what this thing does.Useless!", "verified": true, "helpfulness": "0/0", "author": "M. Elahi"}, {"rating": 2.0, "review": "The video quality is choppy.  I tried it from several laptops and never got the quality I would expect.  Also, you have to leave the screen on your laptop active in order for the video to stay on your TV.", "verified": true, "helpfulness": "1/1", "author": "Eric JT Harlow"}, {"rating": 5.0, "review": "I use this item just about every day.  Stream moves and tv shows to my HD TV, works so well I may cancel my cable.", "verified": true, "helpfulness": "0/0", "author": "Joseph Favorito"}, {"rating": 5.0, "review": "I had a change to test one and after that I wanted one for me.  It is awesome and works great with plex media server.", "verified": true, "helpfulness": "0/0", "author": "Marcelo Linardi"}, {"rating": 3.0, "review": "First, it's nowhere near as plug and play as the Roku and nowhere as feature rich. If you do not have wireless on your PC (I used a cable connect), you need to buy at least a wireless dongle (dongle to dongle, yeah, baby). However, I read an article recently (might have been on CNet) which said that down the line, it might get much better. I bought it just to have a back-up to Roku or if I positively had to show something on YouTube on my TV set (Roku won't let you do that).", "verified": true, "helpfulness": "0/0", "author": "Angel Jimenez \"Crashophobic\""}, {"rating": 5.0, "review": "I LOVE my Chromecast. We have two in my house. It's so easy to set up and so easy to use. LOVE LOVE LOVE.", "verified": true, "helpfulness": "0/0", "author": "Audrey C Michael"}]