[{"rating": 2.0, "review": "I don't know what happened. Some how i could not able to cast the videos from my chrome browser of my PC. somehow, the google chrome got crashed after installed this chromecast. i am not able to use any of these stuff", "verified": true, "helpfulness": "0/0", "author": "Nagendra Kumar Kolisetty"}, {"rating": 5.0, "review": "Love it! Amazing how it converts a regular TV in a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Chromcast does not work very well with Chrome browser. Isnt that a bummer? When you cast your browser, there is a significant delay, which is very annoying. I have gone and tried to change the settings and adjust the speeds but this only helped a little. I prefer to connect the old way (with cables between the computer and the TV) when casting the Chrome browser. I would give it a 1 star, but it works great with Netflix and YouTube so far.", "verified": true, "helpfulness": "0/0", "author": "Kipchirchir Bitok"}, {"rating": 5.0, "review": "Works extremely well.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Jackson"}, {"rating": 5.0, "review": "bueno", "verified": true, "helpfulness": "0/0", "author": "Rafael H."}, {"rating": 5.0, "review": "gave new life to my tv", "verified": true, "helpfulness": "1/1", "author": "Alexander La Torre"}, {"rating": 4.0, "review": "Omg for $35 this was a good buy. I know people complain about the lack of apps but for now I am very happy with being able to cast Netflix to my tv. A must buy for if you have kids and want to monitor what they watch.", "verified": true, "helpfulness": "0/0", "author": "kamik"}, {"rating": 5.0, "review": "Great product!Had been using blue ray for watching YouTube, Netflix etc and really frustrated with slow search and long buffering time compared to iPad.  Was planning on dedicating a computer to watching but this solved problem quickly and for $30.Only installation challenge wa 4 year old FIOS router had to be configured to use WEP2 so chrome cast could connect.  Figuring out router settings was hardest part.", "verified": true, "helpfulness": "0/0", "author": "julian d warhurst"}, {"rating": 3.0, "review": "Great little device but loses one star for not supporting lossless music (flac, etc) and another star for requiring an internet connection to operate, even when streaming local content :(", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 1.0, "review": "Doesn't stream local content stored on my laptop.", "verified": true, "helpfulness": "0/0", "author": "Raman Chawla"}]