[{"rating": 5.0, "review": "Love this thing !!! Easy set up !!! I like it so much I bought another one for my second tv  3 days later !!!!", "verified": true, "helpfulness": "0/0", "author": "Ohio Buyer"}, {"rating": 4.0, "review": "Works.", "verified": true, "helpfulness": "0/0", "author": "roman785"}, {"rating": 2.0, "review": "Product did not function properly.  When it did cast, it was always \"loading\" constantly interrupting whatever it is that you are trying to do.  Do Not buy this product until they somehow make it better!", "verified": true, "helpfulness": "0/0", "author": "Michael Cox"}, {"rating": 5.0, "review": "It's good!", "verified": true, "helpfulness": "0/0", "author": "SEUNG HEE SEO"}, {"rating": 2.0, "review": "I tried to cast a movie from my lenova G700 laptop.Video and audio on TV screen was breaking continuously, even after I brought my laptop so close to TV.Video and audio on laptop screen went fine. There has been a  a problem with casting.I am disappointed.", "verified": true, "helpfulness": "0/0", "author": "SHANTY SANTHOSH"}, {"rating": 5.0, "review": "Excellent productThanks a lot.", "verified": true, "helpfulness": "0/0", "author": "eric"}, {"rating": 5.0, "review": "Best cost-benefit ration when looking for a streaming stick! I would prefer having a specific hardware remote control, but the truth is that as it works with your smartphone is like having the remote control always with you. Sometimes launching the YouTube app takes longer than expected, but over all it works as expected. Recommended choice for those looking for a streaming stick/box when on a budget.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Any one know how is this compared to roku?https://www.youtube.com/watch?v=KfzMgO3wU_U  Hands on Review VideoSimple cheap way to save $$$$$ and watch HDTVWorks with cable internet, and dsl  over strong WiFi if used with dsl thoughsimple to use", "verified": false, "helpfulness": "0/0", "author": "brsrafal"}, {"rating": 5.0, "review": "Setup is super easy, I did it from Mac laptop, then tried streaming from both the laptop and from Android tablet. There was no sound coming in on the first try, but it turned out to be my TV had that specific HDMI port to not use audio from HDMI too, but from separate audio inputs. After I fixed  that I had no problems.I tried both supported apps like YouTube and some random video players where Chrome casts directly from the screen - the video on the TV is lagging w.r.t. to the laptop, but video / audio are in sync, so who cares.I am using it with the included power supply, did not try to power it via USB cord, which, as I understand, is sold separately.", "verified": true, "helpfulness": "0/0", "author": "JavaJumbo"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}]