[{"rating": 1.0, "review": "This product will not produce a smooth video from any Network site. I wanted it to view programs from ABC.com, CBS.com or NBC.com. As soon as the \"Cast\" process starts the video on my computer as well as my TV screen gets very choppy, almost stop motion animation quality. So bad as to make the program unwatchable. The sound is normal but the picture freezes and moves several times a second in such an annoying manner. Google help is very easy to reach, unfortunately there is very little training for those on the phone. I called 3 times and talked with 2 different Techs. They had me reset the Chrome unit, reboot my router, move my desk top computer out of my office and next to my TV, then tell me OOPS! I meant move your router.PROS: It did Cast YouTube videos flawlessly, it has beautiful screen saver pictures, it is relatively cheap to purchase and fairly easy to set up.CONS: Technical help is very poor, can not view network programs from their websites. This was the main reason I purchased this and I really really wanted it to work.After spending hours of trying all types of \"fixes\" I had to conclude this was junk. The Google tech wanted me to know that this is still a BETA product and there are problems that they are still fixing. The Google techs confirmed my router (Linksys EA3500) was on their \"acceptable\" list of routers. Could not confirm that the issue was in my computer or router so had to conclude it was in the Chromecast device. My ROKU works flawlessly on my home network and TV so I don't suspect them. My computer is a Dell running Windows 7 with an AMD Athlon II X2 240e Processor at 2.8 GHz with 4 GB or Ram. I thought maybe my computer was not fast enough for this product, but the Google Tech could not confirm that was the issue. Amazon made the return very easy, thankfully.", "verified": true, "helpfulness": "1/4", "author": "Mister Fixit"}, {"rating": 4.0, "review": "This little device is a great add on to any smart tv. You can easily stream anything from your laptop right to the screen.  Apps like Netflix and Hulu are available.  I would recommend getting this before you go out and buy a Roku box, or other hardware.", "verified": true, "helpfulness": "0/0", "author": "Maico Jimenez \"M. Jimenez\""}, {"rating": 5.0, "review": "Love this thing! Even someone who is terrible with electronics can figure this out! The price is totally worth it too!", "verified": true, "helpfulness": "0/0", "author": "Tina Yu"}, {"rating": 2.0, "review": "This device doesn't work well at all.  Tried to watch programs from Comcast and it stops, starts, looses signal, etc.  It is worthless with the wireless system in my summer home (haven't tried it with super fast broadband, but don't need it for that home)", "verified": true, "helpfulness": "0/0", "author": "G. Harder"}, {"rating": 5.0, "review": "Super Easy!!  Thought it would be a pain to install...just plug it in and it works great.  Need to use the chromecase icon to access Netflix ect...but once I figure that out, I was golden.", "verified": true, "helpfulness": "0/0", "author": "michelle godde"}, {"rating": 5.0, "review": "Extremely useful for the \"cast tab\" feature. Various streaming sites are not always available on your content provider of choice (eg Hulu, Netflix, etc)  For example AMC has shows it streams directly from its website. Most players don't have an HBO.go app either. Using your laptop and the cast tab makes viewing these on your TV of choice an option. Granted it's not perfect.. sometimes there will be a lag or the audio will be slightly off, but it's acceptable to me. It works better than I expected based on some other harsh reviews (note, I'm streaming from a high-end mac book pro, so that could make a difference as well.)", "verified": true, "helpfulness": "0/0", "author": "Rick R"}, {"rating": 5.0, "review": "I was going to use the excuse of my current, plenty acceptable HDTV not being Wi-Fi capable to rationalize a new TV purchase, but this eminently affordable gadget has converted my television into Wi-Fi capable.  That's the only downside, otherwise an awesome invention!", "verified": true, "helpfulness": "0/0", "author": "D. Edmonds"}, {"rating": 5.0, "review": "Excellent price and neat little gadget. I love being able to stream HD movies on my tv from my ipad.", "verified": true, "helpfulness": "0/0", "author": "Mila"}, {"rating": 5.0, "review": "I have a TV and Blu-ray player, both of which don't have Wi-Fi, and since I was looking at getting Netflix, I figured I would try out this product. I must say, I only used it for about 10 minutes and I am pretty impressed. I'm happy I bought it. For $35 (or $30 if you capitalized on Black Friday weekend), I think it's well worth it. It's portable enough that it's easy to take on the road and while staying in hotels, you can now enjoy streaming HBO GO or Netflix, e.g. on the hotel's TV. My daughter's obsessed with watching her Disney shows on my ipad or iphone (via Netflix), but now she can watch it on the big screen.it took <5 minutes to setup, update, etc. It works pretty seamlessly and is really intuitive. For a list of apps currently supported, go to: [...] I am sure that over time, the app list will only continue to grow so I think it's worth the purchase!The quality was pretty good for streaming. You really couldn't tell (I tested HBO Go, Pandora, and YouTube). If your TV has a USB, then you can plug the device into both HDMI and USB (for charging). Otherwise, it does come with an AC Adapter that you can plus into if you wanted to keep it charged that way.", "verified": false, "helpfulness": "0/0", "author": "Love gadgets"}, {"rating": 2.0, "review": "it has delay!!!there is a considerable delay between the device you are casting from and the TV.Also, when you try to send the desktop to your TV it won't work properly.", "verified": true, "helpfulness": "0/0", "author": "Ehsan"}]