[{"rating": 5.0, "review": "Well... Another great product from google. No complaints.I like how simple this little gem is.It's really user friendly!", "verified": true, "helpfulness": "0/0", "author": "James Johnston"}, {"rating": 5.0, "review": "This thing is awesome! Do download the app for your phone and for chrome on your computer. It's not necessary on the phone but really helps the chromecast detect it. Also when you set it up make sure your computer is connected to your wifi and not hard lined into your modem.", "verified": true, "helpfulness": "0/0", "author": "Joshua C Rapp"}, {"rating": 5.0, "review": "My purchase of the Chromecast was more or less in the dark. I did not know what to expect, but since I own a Roku I could at least imagine. The difference between this and Roku or Apple TV is the way it work and the channels available at the moment. March 2014  I am stating that I use my Android Phone, ChromeBook, laptop and iPad (all from work) to send content to my television. I am own one flat screen in the livingroom and go here to watch TV when my wife is watching Lifetime. I can view Youtube, Hulu and Netflix so I am at peace and the world is good. I hate that no sports channels are available. I can of course bring some content onto my laptop and cast that but it is choppier than if I had a real developed App Channel.Here is what I had to do.1. Put the chromecast into my HDMI port2. Plug in a USB cable from my tv to the chromecast to power the device3. The settings to get on my wireless were painless4. I added Hulu and chromecast to my Chrome Browser5.I started Hulu on my laptop6. I then used Chromecast (located in top right corner of my browser) to cast this tab to my TVDone. This is the beginning and I only hope that I don't have to buy new hardware as the service improves. This is helping me get from under the thumb of Cable and Satellite.", "verified": true, "helpfulness": "1/1", "author": "Crenshaw"}, {"rating": 1.0, "review": "This thing barely works the few times I've had it displayed on my TV (then doesn't update and just stops), and more often than not it doesn't work at all.  Not worth my time considering my Sony TV has most of streaming I want built-in and I have several iPads connected to it. I have a dual band AC network with the Chromecast connected on 2.4Ghz band (as I already discovered like others that it doesn't like 5Ghz), have over 20Mbps down bandwidth available, but nope.  You get what your pay for; even if I did have a slight expectation of being surprised and delighted.  Didn't happen.", "verified": true, "helpfulness": "1/1", "author": "R. S."}, {"rating": 5.0, "review": "just a great product makes any TV a smart TV and you can bring it wherever you go quick to set up on a new wifi network if you need", "verified": true, "helpfulness": "0/0", "author": "Kevin McKeon"}, {"rating": 3.0, "review": "The reason i gave 3 stars is because my chrome sometimes disconnects from my browser when i'm casting using my macbook air. I dont know if it's because of my network connection. In addition to that, there'll be times when I am unable to find my chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Angel"}, {"rating": 1.0, "review": "I followed the directions on this and it didn't work.  I tried it on a different tv and it didn't work.  I was under the impression, given the information I had, that I didn't require internet access BEFORE chromecast to get the internet, that this was part of what chromecast was supposed to do.  I don't know if that was the problem or not, but no one was able to answer the question.  I sent this piece of crap back because it didn't work.", "verified": true, "helpfulness": "1/1", "author": "Ariadne Erle \"biblioholic\""}, {"rating": 5.0, "review": "We love the Chromecast. Easy set up and easy to use with Chromebook or Dell laptop.  Recommend highly for anyone!!", "verified": true, "helpfulness": "0/0", "author": "Julie Becker"}, {"rating": 1.0, "review": "Worked a couple of times easily and then stopped working.  The customer service  at Google was really lousy.  I spoke with someone who said she was escalating my problem and someone would be in touch with me within 24 hrs.  4 days later i received an email from \"customer service\" with a standard reply which was in no way helpful.  I called AGAIN and this time I reached someone who told me the Chromecast gizmo needed to be replaced.  You just wouldn't believe the 6 or 7 things they wanted me to do to get a replacement.  I said that's ridiculous, I'll just go back to Amazon.  Amazon WON'T REPLACE because it's beyond Jan 31st (it was purchased for Xmas.  Very unhappy customer.", "verified": true, "helpfulness": "3/3", "author": "LAJ"}, {"rating": 2.0, "review": "Well in my country i cant see most things on my phone with the chomecast  its no what i though it was", "verified": true, "helpfulness": "0/0", "author": "Roberta Phillip Greaves"}]