[{"rating": 4.0, "review": "I am still learning how to use:Pro -Easy to set upStreams alot of apps and plenty more on the wayCons -Voice Search - not able to use well since I have speech impairment.  This feature is great for those that it can understand well.I hope that add a verbal feature to spell out by letter verbally when it does not recognize the word you are trying to say.  This would still be quicker than text search.Amazon Instant Video search - this has a lot of room for improvementFor instance, if you do a text search and get several categories for the same word or similar word beginning, you select one to search further.  However, if you want to go back one step to the list it gave you, you can't you have to start the text search all over again.  Like other have indicated it is easier to use your computer to search.Text search - should simplify choosing of the letters right now you have to go back and forth over the 26 letters to get from n to a etc.  My tv cable search has a simpler box method for alphabet like first row a - e, 2nd row f- etc.  Easier to do text input quicker.", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "The BEST streaming box i have ever owned. it blows the competition away with its snappy interface and its killer voice search.", "verified": true, "helpfulness": "1/1", "author": "Mikki Carr"}, {"rating": 5.0, "review": "I found it easy to set up,and to use.i would like to see more prime movies and more up to date movie.", "verified": true, "helpfulness": "1/1", "author": "virgil p.kendrick"}, {"rating": 5.0, "review": "Currently, Amazon Prime is the only movie service I use and I had been accessing it through a smart, Samsung Blu Ray player.  It worked ok, but was a little slow and seemed to fight me when I tried to access the Amazon site, so I thought I would give the Amazon Fire a shot.  I love it.  It's lighting fast and, as expected, I can navigate all over the Amazon site with ease, and the voice command is a great feature.  I have not tried to access any other sites, so I have no comment there, and I'm currently not really interested in any other movie sites.", "verified": true, "helpfulness": "0/0", "author": "Larry L Kordosky"}, {"rating": 4.0, "review": "First, let me state that I think the product is top notch and if my main complaint is corrected (which I am confident it will be) it would move my rating from a 3-star to a 5-star.First, my complaint.  I just decided to ditch the Roku LT for Amazon Prime TV.  The Amazon Channel on Roku made it very easy to limit your browsing to Prime-only content.  I could go to Prime movies and then look at the available movies by genre (e.g. Documentaries that are all free with Amazon Prime).  Amazon has a couple categories like \"Top Prime Movies\" and \"Top Prime Kids Shows\", but as far as I can tell, it does not give the user an easy way to look at many different genres through a prime-only filter. The fact that the interface on the Amazon device doesn't have this feature but it is a standard feature on Amazon channels for competitors' devices is mind-blowing.  We watch a lot of Amazon content and the lack of this feature is enough for me to dock it by 2-stars until it is corrected.  The other feature I liked on the Roku was a a search function that could find content across multiple channels (for instance, a show might have one season available on HuluPlus and 3 seasons available on Amazon Prime, but the search would find them all) ***I have found that the Fire TV search function does pull from other channels such as Hulu, so i have raised the review from 3 stars to 4 stars***.  I believe that Amazon's search function and voice commands only search Amazon content.  I am a long-time Amazon fan and prime member, and I am confident that they will correct this eventually (at least the inability to search for prime-only content), but I am shocked at this oversight.That being said, the device is great.  It is sleek and operates lightning fast.  The instant play features with Amazon content are impressive (apparently, it starts buffering shows it thinks you might select while you are browsing, so when you hit play, it starts immediately).  The voice command feature is very easy to use and gives good recommendations if you keep the command fairly general.  The controls are easy to use.  No complaints on the hardwareI think I will be happy with it once they work out the kinks, but this is one of the few Amazon \"experiences\" I've had where I'm not 100% satisfied yet.  I'm not recommending people avoid the product, but if you use your streaming device for mostly Amazon Prime content, this is unexpectedly not the ideal product for that.", "verified": true, "helpfulness": "0/0", "author": "Brett M."}, {"rating": 5.0, "review": "I was hesitant about buy a 'tv in a box' kind of technology, but after purchasing this, I will NEVER go back to watching TV the way I did in the past. I am a Prime member and love the fact upon setup it immediately recognizes your account and instantly has on demand the things you've watched on Prime and is always suggesting new shows. Plus, I love the integrated feature of 'What's New on Prime' that is updated almost daily it seems. I haven't watched regular TV since purchasing this item and it was a gift for myself for Mother's Day 2014. For the ladies out there who are not technology savvy, this was a SNAP to install. Just plug the black box into the wall, attach the HDMI cable (which has to be purchased separately and I recommend a short cord 3' if you are going to put it directly in front of your flat screen) plug the HDMI cable into the port labeled HDMI on the back of your TV, and VOILA! instant streaming TV.Amazon couldn't have made it easier or more pleasurable to watch TV. And the Gary Busey commercial has me in stitches! He's a riot! 'Hello, pants.' :D", "verified": true, "helpfulness": "1/1", "author": "KY girl living in L.A."}, {"rating": 2.0, "review": "Let me start off by saying that the box itself works well, allowing me to instantly stream HD quality movies to my TV without any annoying freezing or choppiness.  My major beef with this product is the continued absence of the Amazon Cloud music player and HBO/MAX go.  One major selling points for me was the ability to stream my expansive Amazon music library through the box.  Now, nearly two months after its launch, Amazon still hasn't made it possible to do so.  Unacceptable.  Will significantly alter review if/when Amazon finally includes what was promised of this product.", "verified": true, "helpfulness": "1/5", "author": "Bob Loblaw"}, {"rating": 1.0, "review": "The Bad1.1. Didn't get to use the Fire for the first hour after opening because it needed to update.1.2. First attempt at an update failed; I had to reset it to try again (\"Unable to update your Amazon Fire TV / Try disconnecting the power ... then plugging it back in.\"2. When visiting a collection (like My Watchlist) and the images haven't downloaded yet, the collection looks empty because there aren't placeholders for the images in progress3. The first button under Amazon Prime videos is a buy button (with a price), which is a confusing call to action when what you need to do is just press select on the video thumbnail to start watching it.4. The UI around downloading apps is similarly confusing5. I encountered several problems downloading apps, including one app where some bug prevented the download button from activating and another where choosing the download button wouldn't work (wouldn't start the download)6. The UI often gets laggy (slow or unresponsive); presumably because the device is busy doing other stuff7. Lots of games are buggy or unplayable for other reasons7.1 The Zen Pinball game is too laggy (time between button-press and flipper flipping) to be playable7.2 The second screen app of the You Don't Know Jack game would completely not work for about 25% of questions, making the game unplayable for multiplayer.8. I quickly ran out of space on the device, and there doesn't appear to be an easy way to see what's taking up the most room. The message appeared (and interrupted) while in the middle of streaming in Netflix.... and this is just what I can remember off the top of my head right now.Other areas to improve:* I'd really love for the microphone to be useful for more than just searching, such as voice-to-text input for login fields.Competitors:* With the Roku 3 you get a headphone jack in the remote control and HBO GO* With the Chromecast you get a device you can better control with your phone (e.g., YouTube or Netflix)", "verified": true, "helpfulness": "7/15", "author": "Robert"}, {"rating": 4.0, "review": "To the point... (coming from Roku 2) All (except #4) can be done on the Roku with ease. (I will say - I can't wait for this to be rooted with a better OS/rom!)***Summary: Bluetooth headphones capabilities would have made this 5 stars!***1. Not being able to customize the apps that show up in the home screen! You can't reorder or designate \"favorites\" or anything like that.2. The \"click\" sound!!! Seriously, is there a way to turn this off?! Every time I press a button on the remote - \"click!\" - jeez.3. No way to use other bluetooth devices! Like headphones! Seriously? You sport the latest bluetooth but don't allow people to use it for the most common purposes?!4. No way to \"sort\" apps, movies, tv shows in the GUI OR the app store! Amazon just provides a preset list of items, but you can't sort them yourself.5. If you enable a pin, which I recommend if you have youngsters, you'll ALWAYS be typing it in on things that really shouldn't be behind a pin. Like if you want to play a sideloaded app.6. The Roku controller has a headphone jack. The FireTV could easily beat this with a simple, connectable bluetooth ability. (see #3).Why it's better than the Roku... (yes, another review that references the freakin' Roku)1. Sideloading already existing apks! The ONLY reason I bought it, truly. It's hackable and malleable. Droid does. The Roku guys have no interest in letting you do that (unless you agree to their developer terms) and they are surprisingly strict (at times) of what they approve for the store. It'll be interesting to see what Amazon allows/disallows in the store.2. NOT an overabundance of (mostly) useless apps. The Roku has religious and local news apps out the wha-zoo! There is probably one of each of those categories that any individual will EVER need at most. They then use this to claim they have the most apps/channels. Baha, right.3. The ability to connect other non-amazon controllers (goes back to #1 of this list, and #3 of the first list). Although you can't bind it through the bluetooth, you CAN use an adapter (like for the xbox 360 to PC one) for this and it works out of the box. (Side note: it uses your ONLY usb port to do so. So good luck using an external with it in the future!)4. Faster. Period.5. The freakin' user-interface! It's not customizable like the Roku list (which is really all the Roku UI is), but Roku has never really been in the business of making a pretty GUI. They just wanted to make a set-top box. Amazon proved that a complex/fast UI is very desirable (still some kinks in user-friendliness though).6. Bluetooth controller. No more bending your arm at weird, awkward angles just to do something. Allows for the placement of the FireTV in a hidden place (away from kids).Other thoughts... umm... HBO Go?! Where is that???", "verified": true, "helpfulness": "1/2", "author": "C. Angel"}, {"rating": 5.0, "review": "I purchased it yesterday from BB (only because I wanted it now & FL requires sales tax for Amazon purchases (no brainer). Hook-up, set-up was easy & quick! No issues. Device auto updated software immediately to the latest version, and fast. Wow! Finally, a far better UI for streaming and searching Amazon media content. I have a Roku and honestly, it's a great little device too, but UI so outdated and not as sexy as the Kindle Fire. Yes, Kindle Fire limited with streaming apps, shows. However, If your invested in Amazon Prime and want a really gorgeous menu design and a voice remote, this is the device you want! I really like the voice search. I didn't have any issues and it worked every single time. I have many favorite actors/actress and now I just say their name and it brings up any movies, TV shows amazon has available, prime, rent, purchase. You have 30 days to test it out. Go ahead you have nothing to lose!", "verified": true, "helpfulness": "2/2", "author": "iCastle"}]