[{"rating": 4.0, "review": "Super small way to stream stuff from the web to TV. Works perfect with stuff on YouTube or Netflix etc. streaming from a browser page isn't as good but still usually works out ok.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Before Chromecast I've purchased 2 different Chinese TV sticks and one Air Mouse to watch Netflix in the TV. Bad spent money! Chromecast is waay, better and also cheaper! I use it with Android phone/tablet.", "verified": true, "helpfulness": "0/0", "author": "Jorge Omar Oliveira"}, {"rating": 3.0, "review": "Not nearly as cool as it is made out to be.  Constant network connectivity problems.  Probibly better served getting a DVD player that connects to Wi-Fi", "verified": true, "helpfulness": "0/0", "author": "P"}, {"rating": 3.0, "review": "Still trying to get it to work.", "verified": true, "helpfulness": "0/0", "author": "jsminton"}, {"rating": 2.0, "review": "I thought this device would be a TV tner for my computer, but as it was, I needed a spcial kind of television, so I ended up returning the device.", "verified": true, "helpfulness": "0/1", "author": "Al"}, {"rating": 5.0, "review": "Use daily with Plex. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "ColinP"}, {"rating": 5.0, "review": "It actually works better than the apple tv and not even at the same price buy it now", "verified": true, "helpfulness": "0/0", "author": "santiago"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Wayne Johnson"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "kyle"}, {"rating": 5.0, "review": "The product arrived on time an as I expected. I would like to share that I was really impressed with how fast it works and how simple it is to make it work even in the first time. For those of you that lives out side of the U.S. borders don't be afraid to have it without the U.S. apps, you can do anything you want with chrome on your pc OR stream Tv shows and movies through popcorn-time. Have fun!", "verified": true, "helpfulness": "0/0", "author": "Maor Ventorero"}]