[{"rating": 5.0, "review": "All you need to hook up the device is an HDMI cable and an outlet.  Very simple to set up and use.  We wish we would have purchased this sooner!", "verified": true, "helpfulness": "0/0", "author": "Norfolk"}, {"rating": 5.0, "review": "Enjoying it.  Easy set up and operation.", "verified": true, "helpfulness": "0/0", "author": "In Hartford"}, {"rating": 5.0, "review": "Love, love, love. Much better than any other device we had for internet TV. We subscribe to Amazon Prime so don't know if this would be as useful without it. The voice search is amazing and correct every time (even with our heavy southern accents). Programs and apps load quickly and, based on our wifi connection, it is seamless viewing. Everything was extremely easy to setup and had a nice info video when you first turn it on.  Would recommend to anyone!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Carrie Norris\""}, {"rating": 3.0, "review": "set up is not easy, and keeping it going, does not happen. You may have to continually reboot, and reset. Get the stick.", "verified": true, "helpfulness": "0/1", "author": "Cassandra eguiluz"}, {"rating": 5.0, "review": "This is great.  Just plug pretty much.  It's basically for watching movies, and they are limited as far as the free ones go.  You should be a prime member if you purchase this device.  I've had it  for a couple of months and I am very satisfied with it.  YThe speak and search function is awesome.  I'm sure it does a lot more things than I will use.  I haven't seen  sports on it yet...but it might be there.  I am very happy with this item!", "verified": true, "helpfulness": "0/0", "author": "Serious Sirius listener"}, {"rating": 5.0, "review": "We just \"cut the Dishnetwork cable\" and installed Fire TV and we couldn't be happier! Especially the voice search, just like Gary Busey demonstrates, simply speak into the handheld remote and BOOM it's all there! We're still able to get some of the FX Series for a small fee of $3.99 per episode. When you start doing the math on all the programs watched on Fire TV and add all the movies provided by we are still way below Dishnetwork's monthly billing charge (basic plan is all we had, no movie channels) PLUS all the available apps. We also installed HD antennas to capture local TV affiliates that Fire TV doesn't provide. It's a win win for us!!! I highly recommend it!!!!", "verified": true, "helpfulness": "0/0", "author": "Kent Clower"}, {"rating": 5.0, "review": "Love the Amazon Fire.  I have been an Amazon Prime member for several years and this gives me access to my movies and songs.  I didn't even know that we could watch things like Dave Chappelle Show and the Sorprano's as part of Amazon Prime.  It also allows me to play family games like LIFE and Lego Star Wars.  We especially like Fibbage for adult family friends.  I have the console and the USB Amazon Fire stick.  I take the Amazon Fire stick on the road.Voice search on the remote has been great.  Sometimes we sit around and remember old movies and search them up.  Playing youtube from my phone to the TV has also been a hit.", "verified": true, "helpfulness": "0/0", "author": "Brett Dieterich"}, {"rating": 5.0, "review": "Great picture and lots of applications", "verified": true, "helpfulness": "0/0", "author": "Roger A Brown"}, {"rating": 5.0, "review": "This is an outstanding streaming device. I use it mostly for Amazon instant video, Netflix , and I use the plex app to access content on my home server. Obviously your internet service will play a big part, with a good broadband connection this device produces an excellent picture and sound from whatever services you subscribe too. In my opinion it is the best of the streaming boxes on the market. If you are looking for a streaming device give this one a shot I don't think you will be disappointed.", "verified": true, "helpfulness": "0/1", "author": "15T3FN1"}, {"rating": 5.0, "review": "Just what we needed to get Amazon prime on our tv  easy to use!", "verified": true, "helpfulness": "1/1", "author": "froglady-11"}]