[{"rating": 3.0, "review": "this works fine for Netflix but will not work for Amazon prime.  WHY ???  it is very easy to use once you set up your phone or laptop to connect to your device to the Chromecast.  i have used it to play Pandora and Netflix on to my TV and it is great. amazon needs to allow me to connect my prime account to the Chromecast  device  (that they sell ) and this would be a 5 star product.  Google and amazon need to get this major problem straightened out.", "verified": true, "helpfulness": "2/3", "author": "danielle davidsen"}, {"rating": 1.0, "review": "I watched the official google ads about chromecast before buying, which assured me I can watch videos from my hard drive on my computer. A friend confirmed this use of the device and recommended it as the wireless seamless way to connect my laptop to my new Vizio Smart TV. Turns out that this is NO longer possible. It was but google firmwired an update so it doesn't work with video players any more! I downloaded the Chrome browser extension for Chromecast after more research but streaming a video from my computer via the browser tends to be slow - the video is choppy and impossible to watch. The browser streaming icon turned orange and suggested I move the tv closer to the wifi but they are 6 feet apart in the same room as is my laptop, i don't see that really being a problem. The second reason I bought chromecast is because of the promise I can play any web content - well - that's not true either. It depends on the player a website is using... For example gaiamtv.com is not supported, which was the only thing I wanted to watch that I could not get directly from my TV.So far, chromecast is really good at streaming youtube videos (also a google product) - but I already have that on my tv - making it useless for me.The one star I give it is for the unexpected beautiful photos that double as screensavers for my tv when in that input and not streaming anything. That was a nice surprise. But I remain disappointed as I cannot use it for the two reasons I bought it for. I thought that in today's tech age companies will keep adding, not take away features of their devices... I have little taste for corporate policies devices on the golf course!I have not decided if I will return it yet. I will keep digging online to find some use for it... if not it will have to go...", "verified": true, "helpfulness": "1/2", "author": "PS"}, {"rating": 2.0, "review": "I wanted to stream ESPN games from the website to the TV and this won't do that. I am disappointed.", "verified": true, "helpfulness": "1/1", "author": "Tom Welsh"}, {"rating": 5.0, "review": "We love the Chromecast and use it all the time.  Great for streaming YouTube, as well as casting Google Play music to the tv.  Our gaming system that also was our media device is getting old and worn down, so we use the Chromecast for Netflix as well.  It's super simple to use and it's great not having to need a separate remote, just use your phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a great product. The mobile app is still very limited. But the PC App is superb. You can stream pretty munch everything with chrome.In time, i hope there are more applications.", "verified": true, "helpfulness": "0/0", "author": "Arturo Turcios"}, {"rating": 5.0, "review": "Love this.  I can now have tv in the bedroom without cable.  Easy installation and operation.  Even this non-techy old lady set it up by herself.", "verified": true, "helpfulness": "1/1", "author": "Sandra"}, {"rating": 2.0, "review": "I bought this device for one specific reason - to be able to display content on my nexus 7 chrome browser to my TV. And while the marketing content on the box claims \"send video or anything on the web to your TV from your smartphone, tablet, or laptop\", the claim is simply not true. (The box even shows the chrome logo above the claim, for goodness sakes!)I am unable to stream anything from my chrome browser on my tablet to my TV. There is quite a bit of talk on other forums about whether or not Google is being deceiving about this. Apparently, on the chromecast *website* it states the device only casts chrome content from Mac or Windows versions of chrome. But nowhere is that clarified on the actual product box.And even that's not true. (To our benefit)I am able to stream chrome web content from my chromebook.Given I have a roku, the chromecast doesn't really add much value. And while the ability to basically use my tablet or smartphone as a remote control for Netflix is cool, that's not what I was hoping for.I hope Google will better match the stated claims on their product's box at some point. Being able to stream from your photo gallery also seems like a no-brainer...but is not available either.", "verified": false, "helpfulness": "37/46", "author": "Amazon Customer \"whitney_communications_inc\""}, {"rating": 3.0, "review": "Its just not full of watching options yet, But it does bring some options to a none smart TV so that a plus.", "verified": true, "helpfulness": "1/1", "author": "james onder"}, {"rating": 5.0, "review": "Simple & easy to use. Plug it in to your HDMI port on your tv and connect it to your computer & you are set to cast your favorite shows from your computer to your tv. packaged for maximum safety & very fast shipping. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "bugsy_65"}, {"rating": 1.0, "review": "I give a good rating if its a good productt  & WILL WORKt. this is cheap junk that don't work.it has had to worked for some because of high feed back it would not for me. rating .THANKS AMZONON FOR GIVING ME A FULL REFUND YOU GUYS PPULL ALOT OF SELLERS OF THE DEEP DARKS....", "verified": true, "helpfulness": "0/2", "author": "SCHUNTER"}]