[{"rating": 5.0, "review": "best thing since cable tv - better than Comcast and direct tv - only problem the newest movies take to long to be seen", "verified": true, "helpfulness": "0/0", "author": "reg."}, {"rating": 4.0, "review": "Well, what to say. It's a nifty little device but...My husband and I will typically connect our computer to the tv and stream everything direct. We were hoping the Fire TV would enable us to avoid connecting our laptops every single time we wanted to watch something on Netflix, downloaded movie etc. It's great for Netflix, and other streaming apps (Hulu, Crakle etc) as well as music streaming applications but I feel like it's lacking.We were hoping to be able to stream downloaded movies using a screen sharing application. We read a few articles saying the compatibility works great but beware. At this point you can not stream videos say from a cell phone using AllCast. So if we are downloading movies and shows (which is what we typically do) we still need to connect the computer directly to the TV. If you have a laptop I'm really uncertain why anyone would purchase this or other Media Streaming devices.On another note, the inability to search for movies and shows that are exclusively free through Prime is absurd. You have to sift through everything to find what will be \"free.\"The fact that you cannot customize your home screen is a big miss in our eyes. Having the ability to glue your favorite apps to your home screen, or shows etc would be a big benefit.All and all we have been very underwhelmed.UPDATE:Well, we finally found an app which allows us fairly easy to get full length movies from our phone easily to the device.I will say that any \"screen sharing app\" that we have found does not work. The lagging and quality is horrible. We first tried AllShare app is a joke, do not waste your time.We ended up putting the Real Cloud Player on both our android phones and now we just upload our videos to the player and then stream it from the Fire TV. With the free space we can have about three movies on there at any given time. Which is great, we'll watch one, delete it and then upload another. We highly suggest this process over anything else. DO NOT USE PLEX. I was informed this by multiple sources.As for the Fire TV. We will still not give it five stars due to the inability to search for the free content with the Amazon Prime Videos. It's absurd that they have not built this into the device yet.", "verified": true, "helpfulness": "1/2", "author": "Peggy"}, {"rating": 5.0, "review": "Replaced about a 2 or 3 year old logitech review.  Works just fine.", "verified": true, "helpfulness": "0/0", "author": "Susan Davis"}, {"rating": 3.0, "review": "Hardware works fine, I can listen to my cloud music and look at the beautiful screen saver, but the Amazon Prime simply does not work, can't watch any movies. Talked to fireTV support, they promised to call back after 3 hours, but never did. They said they would file a report, I never received it. So if that's the level of support I will have to return it as the primer reason to buy it was the video selection.", "verified": true, "helpfulness": "2/3", "author": "Joseph E. Morrissette"}, {"rating": 2.0, "review": "Very limited selection of channels. Doesn't even come close to Roku. Had I known this I would not have purchased.", "verified": true, "helpfulness": "2/3", "author": "ClownDog"}, {"rating": 5.0, "review": "What can I say other than WOW! I have deteriorating eye site and also have a hard time watching a movie on my Kindle tablet but this is just what I needed. I'm a movie-holic and love this little box. How can such a tiny box give such pleasure. I would recommend it to anyone and everyone and have.", "verified": true, "helpfulness": "0/0", "author": "JeannieRose \"Kindle lover\""}, {"rating": 5.0, "review": "Works great.  Love the Prime options.", "verified": true, "helpfulness": "0/0", "author": "MaryAnne Verfaillie"}, {"rating": 4.0, "review": "Got this for my mother's tv. We like it alot but we would like more apps to be released. We also would like the usb input to work with our flash drives. This can be great if these things are done.", "verified": true, "helpfulness": "0/0", "author": "pkscomix"}, {"rating": 5.0, "review": "Well constructed, product came preloaded with my Amazon Prime info. Makes using XBMC and Netflix a breeze.", "verified": true, "helpfulness": "1/1", "author": "Justin"}, {"rating": 4.0, "review": "Still learning what I can do, and not do, with the system/service.  Nice product - and gave me the added benefit necessary to subscribe to Prime.", "verified": true, "helpfulness": "1/1", "author": "Red August"}]