[{"rating": 5.0, "review": "I bought 6 of these!  One for myself, and 5 for Christmas gifts.  Everyone, I mean everyone I gave these to are so excited to get them.  I was a hit this year because of these little devices.  Easy to install and works with most televisions (make sure your television has a working hdmi port) and an excellent product.", "verified": true, "helpfulness": "0/0", "author": "Evamarie A. Ferrebee"}, {"rating": 5.0, "review": "I wish i got this sooner. works great! Will get another for the basement tv. so easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Minkypoo"}, {"rating": 5.0, "review": "It was the hit of the Christmas presents for both of my sons. One is finishing upcollege and the other one will be going.They loved it, it was easy to set up to their computers. For the one son who doesn'tget cable he couldn't be more appreciative.", "verified": true, "helpfulness": "0/0", "author": "KM53"}, {"rating": 5.0, "review": "We really like this, works great. Can't wait for more apps for windows 8. Hulu plus works with our tablet but not Windows 8.", "verified": true, "helpfulness": "0/0", "author": "Gary Hill"}, {"rating": 4.0, "review": "I like it but was hoping for more. Best product for steaming youtube that I've found. Needs more apps. Quickly.", "verified": false, "helpfulness": "0/0", "author": "Art Guy"}, {"rating": 5.0, "review": "$35... Works without a hitch and audio sounds fantastic compared to my other streaming devices (WDTV Live and DLNA enabled receiver). Can't ask for anything more. Well, maybe more app support but it seems as though more are gradually added as time goes on. Best $35 spent this year!", "verified": true, "helpfulness": "0/0", "author": "Ling L."}, {"rating": 3.0, "review": "I really like this because I can control netflix / pandora from basically anywhere in the house. The one feature I wish it had that didn't require any additional costs (purchasing apps or paying additional monthly fees) is to stream content from my PC like a movie file to my TV.", "verified": true, "helpfulness": "0/0", "author": "Paul & Jessica"}, {"rating": 5.0, "review": "I got this for all the TVs in my house and use it daily. I have a Roku and a Smart TV, but I find myself using this more as the interface of apps like Netflix and Hulu are quicker to navigate when using my phone.New apps are being added at a respectable pace and I am excited for future possibilities.There are full Android devices that you can use that offer more functionality like web browsing and running Android apps, but if that extra functionality is something that you won't use then you'll find yourself spending more time trying to do what the Chromecast can do in seconds.The price is just icing on the cake, it can't really be beat for what it offers.", "verified": true, "helpfulness": "1/1", "author": "Brandon"}, {"rating": 2.0, "review": "i need more info on this item as to what works and what does not work and why because i cant get it to work", "verified": true, "helpfulness": "1/2", "author": "robert w mann"}, {"rating": 5.0, "review": "This is a great product by Google. Really easy to set up and use. Great for parties. Google extension for your desktop works well. Happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Ritesh Lal"}]