[{"rating": 3.0, "review": "Kind of a pain having to use my phone to control it.  would prefer a normal remote.  Also would like more content...", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've been wanting one of these little guys for a long time. I've had it for about 2 months. No problems to report as of yet. Puts out a great picture in 1080p. I couldn't justify paying for an Apple TV or Roku when I have this option to watch and cast from my iPhone or iPad. Shop wisely, the Chomecast is a great deal!", "verified": true, "helpfulness": "1/1", "author": "Antonio Carabajal"}, {"rating": 5.0, "review": "Easy to use and works great", "verified": true, "helpfulness": "0/0", "author": "Maltipoofan"}, {"rating": 5.0, "review": "I have pretty crummy wireless internet sometimes, so I was nervous about this having to run off the wireless only.  But I am so impressed with how well the Chromcast works!  I don't even have to turn on my tv and change the input when I want to use it.  I just activate it through my computer, and it does it all for me.  My fiance and I wonder how we have been using our tv without this!  Now I can use my PS3 truly for games and not as an overpriced Netflix browser :PI would highly recommend this to anyone wanting to watch Netflix, Hulu, Amazon Plus, YouTube, or any in-browser streaming video on their tv!  All you need is an HDMI port on your tv and a wall outlet. Buying one for my parents and best friend, and I cannot wait until they get them!", "verified": true, "helpfulness": "0/0", "author": "Spodic"}, {"rating": 4.0, "review": "Pretty much does what it promises. Need to get the update to broadcast any content from any player out of your phone or tablet without any hassle.", "verified": true, "helpfulness": "0/0", "author": "Marcos Gonzalez Hidalgo"}, {"rating": 2.0, "review": "It works great for my Samsung TV which has probably the same HDMI version like the Chrome Cast but it blew out the HDMI input on my LG TV, which might have not the same HDMI version like the ChromeCast. Make sure that your TV has the same HDMI version like ChromeCast HDMI, otherwise your TV HDMI input will be damaged.", "verified": true, "helpfulness": "0/0", "author": "Toan Q Tran"}, {"rating": 5.0, "review": "Some minor bugs, but not with the actual hardware but associated software. Netflix sometimes needs a reboot on the phone to bring up the proper interface. But Videostream is flawless, subtitles and everything included. Netflix web does not fully support hardware yet as it does not allow continues play.", "verified": true, "helpfulness": "0/0", "author": "The Enthusiast"}, {"rating": 5.0, "review": "Do you have an Android Phone and a High Definition TV? Yes. Then you NEED THIS! Play store movies Plus music and so much more cast straight to your phone without draining your phones battery.", "verified": true, "helpfulness": "0/0", "author": "ctoonscooby"}, {"rating": 5.0, "review": "Love it !!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/1", "author": "SMACK \"SMACK\""}]