[{"rating": 5.0, "review": "Kids loves it I do to", "verified": true, "helpfulness": "0/0", "author": "MoeC"}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/0", "author": "Mary Grandmother"}, {"rating": 1.0, "review": "I can't get to a printer fast enough for my return label! It won't sync up w Netflix & almost EVERYTHING must be purchased. If you want to relax & zone out in front of the TV, buy cable!", "verified": true, "helpfulness": "1/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty awesome box.", "verified": true, "helpfulness": "0/0", "author": "Michael Wells"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Tech4"}, {"rating": 5.0, "review": "Excellent produc As long as you have strong WiFi, newer choices than Netflix easier to search, recommend using both ,some programs Fire charges for you can get on Netflix", "verified": true, "helpfulness": "0/0", "author": "william peplinski"}, {"rating": 5.0, "review": "we love it and it so easy to use", "verified": true, "helpfulness": "0/0", "author": "rosie habeeb"}, {"rating": 5.0, "review": "We love our Fire TV! Suits all of our streaming needs. We were able to find all the apps we had previously used with our old roku and everything works lovely. It's super user friendly that even my 4 year old can navigate onto her amazon freetime account. Since it was already set up from my kindle, it was easy for her to play and watch with time limits already set! We haven't actually used it for any gaming, but that's not what we bought it for. I'll update this if that changes! A lot of people said that the box \"lacks personality\" but I feel the complete opposite. I think it looks so clean and sleek! It sits ontop of our bluray player and isn't an eye sore. As for the voice search, i was amazed at how well it works, it even managed to decipher 4 year old mumbling, not everytime, but once is still impressive enough! It really is amazing! If you're already a prime member it just makes sense to get the Fire TV if you're looking for a streaming media player!", "verified": true, "helpfulness": "0/0", "author": "just a mom"}, {"rating": 5.0, "review": "Great. Now I'm able to make the most if my Prime account", "verified": true, "helpfulness": "0/0", "author": "SCorrie"}, {"rating": 4.0, "review": "Still getting used to this item, happy with the quality", "verified": true, "helpfulness": "0/0", "author": "B. J. Lindow \"silver moon\""}]