[{"rating": 2.0, "review": "This is a very limited device, which works well with Netflix, Youtube and other less significant providers (Google Play, HBOGo [works on very limited range of android devices], Pandora) and does NOT work with Crackle or Amazon Prime.It boasts the ability to \"tab cast\" which is an option for displaying presentations, but is not useful for video due to audio sync issues and limited resolution (below VHS quality).  In most cases, tab casting is unable to reproduce audio on streaming video.Chromecast relies on third party solutions (AllCast, for example) for displaying locally stored photo/video/audio.At this time, it is a good buy for heavyduty Netflix viewers.", "verified": false, "helpfulness": "0/1", "author": "tony gil"}, {"rating": 5.0, "review": "Items works great and is a easy setup, so good that I went and bought another one for my bedroom!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Although it doesn't work great for streaming flash video on random websites, sites that have a built-in chromecast feature work flawlessly.  Youtube, Netflix, Pandora, and HBO GO are great.  I bought one for my father and father-in-law and they both love them.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Chromecast was in fact easy to setup and configure, but it offered very limited streaming sources. it does NOT stream Amazon Prime, which is a big disapointment.  It only streams a handful of Apps such as NetFlix, HuLu, YouTube, Pandora, and Google products. It really would be nice that since Amazon sells this, that it also streamed Amazon video.......", "verified": true, "helpfulness": "0/1", "author": "Bob2525"}, {"rating": 2.0, "review": "Had some FIOS issues at first. Really wanted to see my pictures but can't put them up. It is cool to put shows up from computer.", "verified": true, "helpfulness": "0/1", "author": "Wendell Arciaga"}, {"rating": 5.0, "review": "As more apps are released the power of this little device continues to grow. Use it every day and am about to order more for each TV as well as my extended family's TVs.", "verified": true, "helpfulness": "0/0", "author": "Justin Siefert \"It's all good...\""}, {"rating": 4.0, "review": "Several months ago we dropped our TV cable service and retained only Internet service. Chromecast gives us the freedom to send what ever we choose to the TV screen from any \"Chrome Browser\" or \"Chomebook\" in our house.  Netflix and other video streaming services are slowly integrating \"Google Cast\" right into there app's which makes the whole process very easy to use.Casting a tab from the Chrome browser with video embedded has proven to be a hit or miss option. Some times it seems the video just can't sync up or stream smoothly when cast from a tab.  Casting from apps like Netflix is always smooth and nearly flawless.The unit I bought was labeled as BETA.  So over time Google has issued firmware upgrades that have continually improved it's functionality.  I think this device or it's technology may become an industry standard for wireless streaming video some day..", "verified": true, "helpfulness": "0/0", "author": "Boatbulider"}, {"rating": 5.0, "review": "I have really enjoyed our Google Chromecast.  I highly recommend it. It is user friendly and allows you to watch movies, TV shows on your big screen from your tablet.", "verified": true, "helpfulness": "0/0", "author": "Monica"}, {"rating": 5.0, "review": "amazing, this is what finally pushed me to getting netflix. using my phone or kindle to control it is also pretty sweet.however, using the pc, it autoloads the next episode.  wish the apps could do that", "verified": true, "helpfulness": "0/0", "author": "Professor Porkchop"}, {"rating": 5.0, "review": "Easy to use, reliable and very affordable , makes watching Netflix so much easier.Everything controlled with my smart phone .", "verified": true, "helpfulness": "0/0", "author": "NY Shopper"}]