[{"rating": 5.0, "review": "AMAZING picture quality!Hey Amazon - LET US USE THIS WITH PRIME INSTANT VIDEO!!!", "verified": true, "helpfulness": "0/1", "author": "Brian Reach"}, {"rating": 5.0, "review": "ingenious", "verified": true, "helpfulness": "0/1", "author": "William G Young"}, {"rating": 4.0, "review": "Chromecast works surprisingly good. It takes about 10 seconds to load up, about the same time it takes my flat screen TV to turn on. The google cast mirroring beta feature for google chrome browser on MS Windows is by far the most used feature to stream everything from Amazon instant, Netflix, youtube, and even local news, yahoo music videos, just about anything the chrome browser will render on my desktop and laptop pc. You have to download an app from google to use the google cast mirroring feature. The dongle also works perfectly with my samsung galaxy s4, LG g pad, and Nexus 7 2012. The chrome cast does not have any apps on it, it's just a receiver so I have to have apps on my devices that have chromecast steaming support. Google play store does not have a streaming app from amazon instant video for mobile devices.My only problem with the chromecast is:-it wont mirror my desktop on windows 8.1 so it is difficult to stream presentations, local photo and video from my laptop and desktop computers. This is a huge con for me.-with a third party app, it is possible to stream some local video and photos, however it can only receive a limited variety of video formats and forget streaming 1080p local video without having to wait at least 10 minutes to watch a 1 minute video clip.-the google cast for the google chrome web browser hangs up occasionally(it is in beta). If this happens, my whole computer seems to start freezing up but it is not. The problem is actually the chromecast dongle which then I have to pull the plug on it, reboot it, and hope that it doesn't happen again. Streaming video in low quality helps, closing every tab except the one being mirrored helps, and disabling everything flash and javascript except the video being played helps. Again this only happens on the google cast for chrome browser, everything else works well.It is still worth the purchase if you are a big youtube/netflix junky and/or you want to use your mobile device for presentations. I am more than happy with my purchase, but I'm still on the hunt for a better mirroring device.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"Dusty\""}, {"rating": 5.0, "review": "as promised", "verified": true, "helpfulness": "0/1", "author": "Mitch McDonald"}, {"rating": 5.0, "review": "Now I'm able to connect my phone to my TV via miracast! My phone had the native data, but my table doesn't... In that case, I have to connect the Internet to my tablet via wifi, and then I can not connect tablet with TV, because wifi or miracast are busy!Happen the same with Chromecast or this device operating under other parameters!", "verified": false, "helpfulness": "0/1", "author": "Gustavo Ulloa"}, {"rating": 5.0, "review": "GOOD.", "verified": true, "helpfulness": "0/1", "author": "ROBERT REED"}, {"rating": 5.0, "review": "BOught for my kids and liked it so much I bought for myself!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have been using this for over a year and is still going strong. Excellent product by google.", "verified": true, "helpfulness": "0/1", "author": "sanjay"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "zihai lin"}, {"rating": 5.0, "review": "we have two they work great.", "verified": true, "helpfulness": "0/0", "author": "Theresa Thorn"}]