[{"rating": 4.0, "review": "its amazing it works perfectly the only bad thing I have found is that it works mediocre when I want to project my laptop desktop in my TV.for example if I have a downloaded series in my computer, then when projected it looks a bit slow and Audio is not synched. But for use with the web (YouTube , Netflix etc) it is a 10! Good buy for the price without any doubt", "verified": true, "helpfulness": "0/0", "author": "Pedro Esteban Sanchez Jimenez"}, {"rating": 2.0, "review": "Well we bought this. Only has Netflix, and YouTube. Freezes Netflix on the iPad. IPhone works OK. Cannot load on the Kindle f  're. Cannot load on my Nokia Windows phone either My Nintendo  had allot more apps loaded on it. Maybe the Apple TV will be better.", "verified": true, "helpfulness": "1/1", "author": "Howard Buckalew"}, {"rating": 3.0, "review": "I usually can follow directions well, but for whatever reason, this was difficult to install.  Maybe it was my expectations that were unrealistic.  If it wasn't for help from my cable provider to install it, I probably would have sent it back.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 2.0, "review": "Got this to watch movies from websites like hulu and netflix AND for personal videos and photo viewing specifically grandkids etc.Used phone to setup and got wifi working.BUT you need to be a member of whatever service online to use them. Duh. I should have known nothing is free. BUT I thought I could do personal photos and u cannot.So...If there is a way to do that can someone advise me? I looked online and cannot figure it out.", "verified": true, "helpfulness": "1/1", "author": "Kristin P. Morrill \"km\""}, {"rating": 1.0, "review": "12/25/13: Wasted an hour trying to set this up  - connectivity issues - do I have to disable WEP on my Wi FI  - if so that would not be good and this would be be a BAD product for most people...", "verified": true, "helpfulness": "0/0", "author": "D. Atwood"}, {"rating": 1.0, "review": "THis is not as it seems... It turns out it will only play youtube videos, NOT what ever is streamed. waste of time and money.", "verified": false, "helpfulness": "1/2", "author": "Bud \"dvaudio\""}, {"rating": 1.0, "review": "There's really no use for this product. If you're an iPhone user, all you can do is stream YouTube And Netflix from your phone. From your laptop you can also stream from the chrome browser. I thought when I bought this that it would mirror whatever device was on the same wifi as the chromecast. It does not. No need for this product", "verified": false, "helpfulness": "1/2", "author": "Francesco Decicco"}, {"rating": 4.0, "review": "And that's always good. Other than a bit of lag when scrolling, I have no complaints. Very nice to be able to control it from my laptop. Operation would probably be smoother if my computer was more powerful(It's 5 years old.)", "verified": true, "helpfulness": "0/0", "author": "J Harp"}, {"rating": 5.0, "review": "If you can view a video or audio in the Chrome Browser, it can be wirelessly cast to your HDTV!  Amazing yet simple device.  Be aware though that what is not clearly shown is it does require its own power source, either a USB connection (which some older HDTV's do not have) or an AC outlet.  They give you all of the wires, just make sure you have a place on your TV or behind the TV to plug this in or you'll have a wire running across the room to connect to the nearest free outlet.", "verified": true, "helpfulness": "0/1", "author": "John T"}, {"rating": 1.0, "review": "Does NOT support Amazon Instant Video. Only has 13 apps available, compared to 750+ on Roku. Returning Chromecast for the far superior Roku.", "verified": false, "helpfulness": "2/4", "author": "Charlie Wilson"}]