[{"rating": 5.0, "review": "I'm very glad to to have ordered it on the second day it was released. Amazon.com shipped it quick with netflix free code.Now wife watches netflix and my little boy watches YouTube through it every day. They are more than happy. I just ordered the second one from Bestbuy to prevent conflict from them.The build quality is good and picture quality is excellent. Smooth and fluid hd content without lag.Highly recommended if anyone would like to upgrade your existing tvs into smart tvs with minimum cost.Only con from Google is the latest firmware blocks the possibility to stream other media than those approved sources.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Although it only supports just a few apps at this time, the Chrromecast does the one thing that my Roku can't and that's playing YouTube.  Now I can watch World Superbike, and much more on my big screen.Setup was very simple.  The apps work rightaway, no issues at all.  The best part is that I got the 3 months Netflix credit making the Chromecast around $12 after tax.  For all the people that complain about lack of apps, for me just having YouTube on my big screen TV is worth the $12.", "verified": true, "helpfulness": "0/0", "author": "Vimal Reynolds"}, {"rating": 4.0, "review": "Works as advertised but the usage is limited until the API is fully up and running. Connecting multiple devices was glitchy.", "verified": true, "helpfulness": "0/0", "author": "Kevin Hagerty"}, {"rating": 2.0, "review": "It will not work with my router.  It was not clear when I ordered it what the requirements were for the router.", "verified": true, "helpfulness": "0/0", "author": "Larry L. Simpson"}, {"rating": 2.0, "review": "Unless there are going to be some kick ass functions added soon, This dongle will end up in the back of my junk draw with the rest of the crap I brought thinking it would change the world.", "verified": true, "helpfulness": "1/2", "author": "Chas \"Chas\""}, {"rating": 5.0, "review": "Read all the how-to stories and tips and you'll get a solid overview of what this is capable of. One thing you may miss: it needs to be in really close proximity to your wireless router; it doesn't seem to pull signals as reliably as other devices such as PCs and laptops and tablets and even smartphones... but that's easy to deduce, considering it sits behind a massive slab of electronics (a TV). It's a fun and cool device, when you're Chromecasting what's in your Chrome browser or viewing a YouTube video. If I didn't already have a Roku box, I'd love this all the more because my wife and daughter are addicted to all the offerings on Netflix. I would not overpay for this by throwing a giant pile of hard-earned cash at one on Ebay; order it directly. I got mine after ordering on Amazon the day they were offered for sale and this one arrived weeks before the expected ship date. Without question, this is worth the $35, and if more is offered in the future, it'll be more than worth it. By the way... setup was as easy as most people claim.", "verified": true, "helpfulness": "0/0", "author": "Dave Clark"}, {"rating": 5.0, "review": "Set up was a breeze, haven't tried moving it around to different TVs yet, but pretty straightforward.  Really easy to use with my nexus 7 as well.  Definitely worth the price!", "verified": true, "helpfulness": "0/0", "author": "Rog"}, {"rating": 3.0, "review": "I bought this on the 1st day and hence got 3 months of Netflix free (actually 4 months, since I signed up for a free month of Netflix). If you have a Smart TV (I don't), this is a useless piece of Junk. Hence this device caters to a (small?) subset of people who have a HDMI TV but not a Smart HDMI TV.When you cast from your Computer in 720P mode, the video is choppy and  crashes. I have a very good Wireless Router, so that is not the issue.Currently, all it does for me is it streams YouTube and Netflix from my Android Phone or Laptop.On the good side, this device looks cool. It came it with a HDMI extension, which I use.To me, with the free Netflix and the ability to watch old National Geography and Discovery Channel programs on my TV is worth the $38.06 I paid for it.Not very impressed with Netflix, but that's another story.", "verified": true, "helpfulness": "0/0", "author": "Krish Mohan \"Krish Mohan\""}, {"rating": 5.0, "review": "About 2 weeks in, and the Chromecast has been great. YouTube and Netflix look better then on the Roku, and the \"app as the remote\" is a great idea. Casting from Chrome worked will, with a little stutter on video. My only issue has been from my WiFi setup -- if my laptop is on the 5ghz channel, and Chromecast is on 2.4ghz, the laptop can't find the Chromecast (thought it eventually does, have yet to figure out how).", "verified": true, "helpfulness": "0/0", "author": "David Monsees"}, {"rating": 5.0, "review": "It works flawlessly through my phone and tablet. I don't turn on my ps3 anymore to watch netflix. I hope soon more apps will supoort it.", "verified": true, "helpfulness": "0/0", "author": "Aranea"}]