[{"rating": 3.0, "review": "Imported music library, couldn't find it on Fire menu...informed that My Toshiba 50\" is not compatible. (?) Wish I'd known. I thought those stunning Fire photos would look great with music. Thought it would work like my Apple tv.", "verified": true, "helpfulness": "0/0", "author": "George Bittancourt"}, {"rating": 3.0, "review": "I had some minor issues which took HOURS to rectify on your online help.  It would be so much easier to have a two second conversation with a HUMAN RATHER TAN AN AUTOMATED SYSTEM.  I am convinced once I can navigate the system I will love it, the the learning process is PAINFUL.  Are the days of speaking to people over?  Are we forced to listen to automated responses to issues we may have? Thank heaven I am a senior with less time left to miss the human touch!", "verified": true, "helpfulness": "0/0", "author": "Susan J."}, {"rating": 5.0, "review": "I love this so much that I almost bought one for every room. So much better than apple TV and chrome both of which are nice, but not like this! Voice recognition was awesome and worked well. I love the other apps and screensaver which is absolutely stunning. This works right out of the box. Only complaint is that I wish more movies were prime.", "verified": true, "helpfulness": "0/0", "author": "R"}, {"rating": 5.0, "review": "Great piece of technology that even I was able to connect it with little to no cursing.  Hope Amazon acquires other features like HBO-GO to make it more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "Frances M Rossetti"}, {"rating": 5.0, "review": "This is Awesome, I cannot give higher praise to Amazon for this new technology. This works better than I expected. The voice searching is easy and excellent. This Amazing device loaded my video almost instantly,and then showed the film with no problems. I tried Fire TV with a Dish Network Internet feed,as I live in a very remote location in the Salton Sea in California. Fire TV Rocks. I consider this as the best purchase I have ever made!", "verified": true, "helpfulness": "0/0", "author": "W.C.Altare"}, {"rating": 2.0, "review": "Let me first say that I am an Amazon fan - I've been a Prime member for a number of years and I order almost everything through Amazon - from gadgets to paper towels.I was really excited when the Fire TV was announced and ordered one immediately. True to form, it arrived promptly at my doorstep. Setup was a breeze - it connected in no time at all, though I did find it a bit odd that a newly-introduced device already required an update upon installation.Having now spent a few months with it, the sad fact is that it simply doesn't work very well. When trying to open an app - be it Netflix or a game - it frequently tells me that the app could not be located. HUH?!?!  And when it does manage to open them it's *painfully* slow.Just today, my experience with it has been -(1) Tried to play my recently purchased Grand Theft Auto Vice City - it tells me that the app cannot be found(2) Undaunted, I try to play my also recently purchased GTA San Andreas - it tells me that a 2.5 gb download is required, it begins to do this, it gets to 6% and then tells me that I have no internet connection. Having little faith in Comcast, I exit out and try again. It does this same thing five more times. Sorry to have pointed the finger at you, Comcast. My bad.(3) Tried to open The Wire, The Pacific and John Adams - for each, it tells me for five minutes that it is loading, with no success(4) Tried to open Netflix - it tells me that the app cannot be found.Today is pretty much the norm. The little thing just doesn't work the vast majority of the time.That said, the search feature is pretty cool. And the bluetooth remote is genius - every device should have a bluetooth remote. If I had to come up with something else to justify two stars? I guess I'd add that the screensaver photos are very nice. So essentially I have a $99 box that puts up random pleasant photos on my tv.If you're looking for a streaming device, there's really only one way to go, and that's ANY Roku box. The damn little things just work and do exactly what they promise. In addition to this worthless Fire TV, I have AppleTV, Roku and Chromecast. Roku is far and away the winner. No question about it. And for the price, it's absolutely untouchable.Sorry, Amazon - you really screwed this one up. And that comes from one of your biggest fans - my order history is the length of a Russian novel. I have no clue how you think you can do a phone when you can't even get a streaming device right.Buy a Roku and pocket the extra cash.", "verified": true, "helpfulness": "3/6", "author": "Nom de Plume"}, {"rating": 5.0, "review": "Absolutely amazing! This is the best unit you can buy. There are so many free movies if you're a prime member that it is well worth it to get the prime membership just for this.", "verified": true, "helpfulness": "0/0", "author": "A. Kazi"}, {"rating": 4.0, "review": "I love my Amazon Fire. I was able to connect it to my tv & have it working in under 5 minutes. I have added games. This is from someone who has trouble using her phone for anything but phone calls. I have a Roku but it is not in the same league as my Fire. The one thing I cannot figure out is how to get to my Amazon Cloud music. If I could do this easily, the Fire would have 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Jordan"}, {"rating": 5.0, "review": "I have owned the box for about a month now and am overall well  pleased.  It is much quicker and more responsive than the roku that I have on my other tv.  We have been a cable cutter family for about three years now and don't miss cable much at all.  I love baseball and can not watch my local team, but I make do.  Anyway about fire tv, it is superbly integrated into the amazon prime world and I have found programs that I didn't know existed on prime.  I only wish the voice search worked with Netflix also so that I didn't have to toggle back and forth to see if it was included in my subscription.  Finally although amazon tv lacks he apps of roku I don't feel like I'm missing much because most of the roku apps are hokey anyway.", "verified": true, "helpfulness": "0/0", "author": "TODD"}, {"rating": 3.0, "review": "Setup was easy. I had it connected and running fast. As most other users, I did not like the fact that you cannot search Prime membership only movies. I read someone had used the search button to say for example: \"Prime romantic comedies\". Well, I tried similar searches with different versions of the position of the words and all it did was yield results that have the word \"prime\" in the movie or sometimes the description of the movie. So it did not work for me.Why did I give it 3 stars? After using it for a little while I decided to setup up parental controls and a pin number so that my kids do not accidentally buy anything. Some time after setting up the pin number I went into the network settings, and it caused it to disconnect from the internet. Well, it asked me for my pin number while I was in that part of the menu. I provided it and it asked for it again. It was stuck on the screen asking for pin number and saying that there is no internet connection. This is a major glitch for amazon fire. It appears that if you lose connection and you have parental controls setup it will ask you for a pin number continuously just so you can try to get back to the internet. However, the pin number is not stored on the device and it actually needs internet to have it verified so you are stuck in an endless cycle. You cannot do anything when this happens. There is no manual hard reset on the fire and soft reset is nothing but unplugging it for 30 seconds. It did not help with anything. A way to reset the fire to factory setting without needing the menu is needed. You cannot go into the menu and reset it either unless you are able to connect the fire tv with internet with the optical cable (wired connection). Then the pin can be verified and you can remove the stupid parental controls so you can reset to factory settings. I had to do that and not happy about it. I was lucky my cable internet modem was close by and I could connect the fire tv wired to internet. I can imagine some people might not be so lucky and have their tv way far away from the modem if this were to happen to them. Overall, I can see the value in it, but this glitch with the verification of the pin and impossibility to do anything if a pin is created and you don't have internet will leave you disappointed.", "verified": true, "helpfulness": "0/1", "author": "stigabre \"LoveToCreate\""}]