[{"rating": 5.0, "review": "For my purposes, the amazon fire tv is perfect. Quick and easy set up, easy search features and prime content available. I will mainly use it for amazon and netflix. I love the voice search. I wish that the amazon on my smart tv worked this fast!", "verified": true, "helpfulness": "0/0", "author": "Lindsay Brumley"}, {"rating": 5.0, "review": "I had been using my TVs built in access to programming and it took a very, very long time. The Fire TV is almost instantaneous. I'm happy that I made the purchase and eager to see what else the Fire TV can provide in the way of entertainment.", "verified": true, "helpfulness": "0/0", "author": "WmConn"}, {"rating": 5.0, "review": "Great product, easy to use.  I was surprised that one did not have to activate the voice section by reading out sentences.  It worked on my fit command.", "verified": true, "helpfulness": "0/0", "author": "Robert Westmore"}, {"rating": 5.0, "review": "The hardware is state of the art.The software is a good standards based (android) but closed platform.The supported services are what they are, the product of a protectionist mentality. If you were hoping that this solution would allow you to dump your current TV provider, it won't. It could. The technology is there. But it won't. As far as I can see, right now, out of the box, the device limits you to the apps that Amazon will allow. There is Watch ESPN and Watch ABC, both are locked so that you must provide a code from your TV provider (cable, etc.) to allow you to use them effectively. I have not seen Watch NBC or Watch CBS yet, but I would expect similar constraints. Netflix works great (much better than on my smart blue-ray player).So the test came when my DVR'd Grimm episode was corrupted (thanks DirecTV). The only way to watch it on Amazon Fire TV was to pay $2.99 which was an insult. They wanted me to subscribe to Hulu+. So, I streamed it off the NBC website for free (and without commercials).Basically, you are better off with a PC attached to your TV than this product. Harder to use but full function. Someday, I hope that the networks and ESPN-like entities will allow independent subscriptions through their apps like Netflix and Hulu. Then DirecTV will be gone.", "verified": true, "helpfulness": "3/3", "author": "Boca Bob \"Bob\""}, {"rating": 5.0, "review": "Fire TV opens the door to a plethora of possibilities and it's very portable...use it on any tv in the house in just minutes.", "verified": true, "helpfulness": "0/0", "author": "Donald F. Williamson \"Don W.\""}, {"rating": 5.0, "review": "I was using Google Chromecast before (link at bottom of page, you should check both out) and I absolutely hated it. With all the effort it took to setup it didn't even work on my home network, was horribly slow, and you couldn't even upload you own videos and stream through phone which is what I got it for in the first place.Amazon Fire: Greatest TV in the whole world!!! Very quick and easy to set everything up, and Netflix is really fast. Now the real reason I bought this product: GARY BUSEY!! Just because he is awesome. The voice search feature is amazing and very accurate, awesome that I can just say Gary's name and watch every movie he has ever done.Don't forget to check out the Google Chromecast to compare really quick, I love the fire and hate the Chromecast but you should check it out. Cheapest here:  http://www.amazon.com/gp/product/B00DR0PDNE/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B00DR0PDNE&linkCode;=as2&tag;=bestprework06-20", "verified": false, "helpfulness": "2/3", "author": "Kyle"}, {"rating": 4.0, "review": "the only problem I've had with it is that Netflix doesn't always work and have to reconfigure it, but otherwise..its really beautiful picture and works wonderfully...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "As general rule good.  Set up was easy. I really like that if you pause a movie it has a screen save that comes on.  The one thing I wish it had was HBO Go out of the box (hope an update loads it on there soon).  The voice search really does work.  Very interesting lash up with my Fire HDX (wish it could be made to be a remote screen for the Fire).  For me, worth the $100.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 3.0, "review": "The hardware specs look great!!  But I have to question this \"made for music\" thing.....  How can it be \"made for music\" without a Spotify app??Won't consider this device until it does....", "verified": false, "helpfulness": "2/10", "author": "Steve C"}, {"rating": 3.0, "review": "I bought this in spite of the fact that Amazon wasn't allowing reviews on it at the time of my purchase.  I have to say that I have been a little disappointed in it's performance.Pros:It is very, very fast on download times compared to the Sony Streaming Player we have on another TV. So that was true and is the reason I kept it.The remote is easy to use but because it really doesn't have any functions other than play, go back, go up, go down.The actual size of the unit is so small that you can really put it anywhere.It has beautiful screen saver pictures that rotateCons:You can't limit your searches to Prime only. This is a big one for us because we don't rent or buy any movies ever. We only watch what is available on Prime.  But if you enter by voice or by text that you want Prime Movies for your search parameters, you will get any movie that has the word Prime in it's description.  And you will even get movies where you can't figure out why they are in the search results.  So you will waste a lot of time sifting through search results looking for movies that are Prime movies.  This is a big flaw in the unit.  I have to say that I wouldn't have bought it if I had known this one fact about it. But, there were no reviews to read at the time.", "verified": true, "helpfulness": "2/3", "author": "IloveAmazon"}]