[{"rating": 4.0, "review": "This is great if you want to view content that usually isn't included on other sticks/media devices such as Netflix or Amazon Prime.  If you are just needing a streaming stick for Netflix, Amazon, Hulu, etc., go with the Roku stick or media streaming box or maybe the new Amazon stick but I have never used it so I can't comment on it.  I have both the Chromecast and the Roku 3400M streaming stick.  The Roku does a better job with the app streaming and it's more user friendly.  Where the Chromecast comes in handy is viewing content from pretty much any device on the Wifi network.  Example, I played a DC fighting game using my phone streaming to the tv.  Other good uses would be displaying photos/videos on other peoples phone for everyone to view.  I am really glad I purchased the product but I think it should be marketed in a slightly different but similar category as the streaming sticks offered by Amazon and Roku to highlight the strengths of the Chromecast that other sticks simply do not have.Update: 1/15/2015I just uploaded a video of me streaming Borderlands The Pre-Sequel from my laptop to the Chromecast in my bedroom.  You have to keep it in windowed mode or it won't work and it does suffer from lag.  It's good if you want to stream it for viewing but will not work for playing the game on the tv due to lag.", "verified": true, "helpfulness": "0/0", "author": "StickyHoneyBuns"}, {"rating": 5.0, "review": "I love my Chromecast. I've purchased several now. At this price, no reason not to have one on each TV. My mother had surgery earlier this year and was going to have a lot of bedrest so I also picked up one for her so she could stream Hulu and Netflix while recovering. My biggest issue with it was that I couldn't stream downloads from my desktop, but they've now remedied that issue and I can now cast any file I've downloaded. Great investment! At this price, it really is a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "Pharadei"}, {"rating": 5.0, "review": "I NOW have a smart tv for close to nothing. great service as well.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "No issues at all. Perfect.", "verified": true, "helpfulness": "0/0", "author": "Baranidharan"}, {"rating": 5.0, "review": "I bought this item on black Friday for 22.99 each.. It it took some work and patience through amazon to ship them out. But it was worth it for the low price. I managed to use my Nokia Lumina windows phone through some apps to cast on this android based device to cast Youtube, Hulu, and Netflix if I pay 1.99 for the app.I tested it and it works great. I will end up buying it because its faster to cast through there than on my low budget tablet. I am glad I bought 2 of these. Oh and you can cast through Xbox to multiple tvs as well. I think it is cool to send my daughter a video from another room. There are alot of features I am still learning about and excited for future updates. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Jacquelyn"}, {"rating": 4.0, "review": "Great gift ideas", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "must have", "verified": true, "helpfulness": "0/0", "author": "push thru"}, {"rating": 5.0, "review": "Got three for myself and one for my folks and aunts for Christmas.  Easy to setup and with all the features that Google keeps adding on it pays for itself.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love love love this product. So simple and yet so powerful. About time somebody thought of this. The quality that you get through HDMI is magnificent.", "verified": true, "helpfulness": "0/0", "author": "Gerald Pageot"}, {"rating": 5.0, "review": "Really quick review.Price is cheap,in black friday was $20.Really easy so setup (sometimes instead of doing th setup wih my phone I have to do it with my lapto,not a big deal).A year already pass and is working perfect.You can stream local contect with apps like Allcast.You can stream from your PC.It dosent have a lot of channels like the roku but it has the one that most of the people use like Netflix,Hulu,Youtube,Pandora,ESPN and others.One of the best thing that I love about the chromecast is that if you have an android phone go to chromecast,go to any website that you watch videos and whatever you used to watch on the phone you can stream to your TV.I use that feature a lot now I don't have to go my PC to see videos.The only bad thing that I can said is that it gets HOT (this not have a fan so I'm guessing that's why)", "verified": true, "helpfulness": "0/0", "author": "Dennis"}]