[{"rating": 5.0, "review": "I held off getting the apple TV and also held off buying the Roku boxes.  After reading so many reviews on the AFT I decided to get it from a different retailer because I had coupons.  So far i love how fast and responsive it is.  I hope that the updates keep coming enhancing the content.  I been hearing a lot about all the stuff you can side load or rooting this device, I have not tried any of this but may do it soon...  I will most likely get a box for my moms house..  I do wish that the voice search would return more than just shows available on amazon, I pay for the big three, Prime, Netflix, and Hulu...", "verified": true, "helpfulness": "0/2", "author": "Ranger"}, {"rating": 4.0, "review": "I do hope  developers are going to add Favorite tab in main/left column and to improve multitasking in next firmware iteration.", "verified": true, "helpfulness": "0/2", "author": "Igor Vujacic"}, {"rating": 1.0, "review": "I opened the box and was pretty fired up (pun intended).  This was smaller than my dedicated HTPC and as we cut the cord at home, potentially would solve the lady of the houses issues with some of the tech in place.The good: quick, snappy, better UI (IMO) than my roku, BT remote, lots of apps and content (I am a prime member as well)The bad: no 5.1 output / HD audio, particularly through Plex (note I did not test prime video/netflix)Here is a link to a forum with a healthy discussion on the issue: https://forums.plex.tv/index.php/topic/111666-firetv-surround-sound/At this point surround sound has been around since the early 90's and how this can be overlooked is beyond me.Support suggested using an optical connection but you obviosly lose HD quality this way.Amazon is welcome to contact me about this issue.", "verified": true, "helpfulness": "5/8", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Great product. Decided to try this after two of my Roku 3 streaming devices started having intermittent lock up and loosing internet connection  within 12 to 18 months. It has very good picture quality very much in par with my Apple TV but the sound quality needs some improvement. The menus are more biased to Amazon service but that is expected. The streaming radio service is good. Other than this I have only used the Netflix so far.", "verified": true, "helpfulness": "0/1", "author": "Zak at Tulip"}, {"rating": 5.0, "review": "Great electronics gear.  The device allows one to view online movies and access internet streaming.  The Amazon Prime services are outstanding. I would recommend to anyone.", "verified": true, "helpfulness": "0/1", "author": "Ronald T. Stevens"}, {"rating": 5.0, "review": "The Gary Busey commercial enticed me into purchasing the Fire TV.....finally someone else who talks to their pants!  I found the Fire TV very simple to install and start up.  Voice searching works great and I am able to access music and video from Amazon Prime and other applications.  The device is very fast and intuitive to use.  I am enjoying the ESPN application which streams all the ESPN sports channels, highlights and provides a great view of what sports events are coming in the future.  I have enjoyed music, music videos, movies, movie trailers.  The device may not be perfect but I have enjoyed what it provides and am satisfied with no technical issues to speak of to date.", "verified": true, "helpfulness": "0/1", "author": "Grammak"}, {"rating": 5.0, "review": "I'm very pleased with this.  The picture and sound quality are crystal clear.  There are tons of games as well.The device is very easy to use, the voice recognition works flawlessly.  I will be ordering more for the other televisions in the house.", "verified": true, "helpfulness": "0/1", "author": "John Galt"}, {"rating": 5.0, "review": "Excellent so far :) have only used it one day but so far, I love it!", "verified": true, "helpfulness": "0/1", "author": "AHZ"}, {"rating": 4.0, "review": "The only thing that would make this better would be if Amazon Prime members got to watch TV series for free instead of having to pay to watch the whole series after the 1st episode.  Otherwise, I am really enjoying my Amazon Fire TV a lot. It's easy to navigate, and I like the voice command.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy format, easy to install.  Haven't had long enough to get full benefits from its use.", "verified": true, "helpfulness": "0/1", "author": "PWG"}]