[{"rating": 5.0, "review": "Awesome!!! more apps than i'll ever be interested in, but performance of this little jewel is unbeatable! With the added photos, prime music & other great new features, it's really incredible! The voice search is such a time saver too!!! just wish I could have that feature with youtube; maybe i'm missing something there....", "verified": true, "helpfulness": "0/0", "author": "The Pope"}, {"rating": 4.0, "review": "Neat and fast interface. The voice commands work great. Wouldn't bother to buy it without Prime membership. Would be great if the non-Prime content could be filtered off.", "verified": true, "helpfulness": "1/1", "author": "Alejandro Gaxiola"}, {"rating": 5.0, "review": "Customer service was very helpful and when the new remote did not work, they replaced the box..  Thanks for you help!!!!  We enjoy our Amazon Fire very much now!!", "verified": true, "helpfulness": "0/0", "author": "Kathleen G. Lewis \"flowergirl\""}, {"rating": 5.0, "review": "Works great for watching Game of Thrones!", "verified": true, "helpfulness": "0/0", "author": "Bill White \"William J White Jr\""}, {"rating": 5.0, "review": "Not a lot of app support but lots of great things for free.  I use it constantly.", "verified": true, "helpfulness": "0/0", "author": "Matthew Tormay"}, {"rating": 4.0, "review": "I might have had difficulty connecting to network had not my younger son been available to help. Thus far we like the service.", "verified": true, "helpfulness": "0/0", "author": "William Caldwell"}, {"rating": 5.0, "review": "Exceeds expectations.", "verified": true, "helpfulness": "0/0", "author": "Ralph L Griffith"}, {"rating": 5.0, "review": "Awesome device.  Great picture quality, super fast loading and a diverse set of content (music, movies, tv, games).  Coupled with Prime, this is a no brainier for anyone looking for great content alternatives to cable.  Definitely recommend.  I am an apple fan and have Apple TV but find this device even better.", "verified": true, "helpfulness": "0/0", "author": "G. Histed"}, {"rating": 5.0, "review": "Money well spend =) !!!", "verified": true, "helpfulness": "0/0", "author": "Andre Luis Rondon Caixeta"}, {"rating": 5.0, "review": "There is more you can do with an Amazon Fire TV than Amazon has time to get their \"minions\" to write about.  I just keep their emails announcing anything new in a file for reference.  Keep an eye on Youtube videos for lots of howtos by those who are earning their Fire TV Ninja creds.  I'd love to \"sideload\" Kodi when I get the time.  I bought two of these so my wife can't complain that she got \"left out \" so she can watch whatever she wants when she wants.  They squooze a lot of bits down the pipe.", "verified": true, "helpfulness": "0/1", "author": "mr_fixit"}]