[{"rating": 5.0, "review": "So many apps I dont know where to start when I turn it on. LoL", "verified": true, "helpfulness": "0/1", "author": "Bkmilt"}, {"rating": 2.0, "review": "Stopped working in 3 days, had to return it", "verified": false, "helpfulness": "1/5", "author": "steve lemar"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Dreama L Briley"}, {"rating": 1.0, "review": "The Fire TV unit will not come on.  I have the power supply plugged in to both electrical connection and also plugged into the Fire TV unit.  Per the brochure that came in the pkg, there is a notation to there needs to be a light that is on, the front side of the Fire TV,  There is not one on mine.", "verified": true, "helpfulness": "1/3", "author": "BobyJo \"BobyJo\""}, {"rating": 5.0, "review": "I am very happy with this.  I use the PLEX app to watch my movies off my server and all my YouTube videos", "verified": true, "helpfulness": "0/0", "author": "John R. Kulow"}, {"rating": 5.0, "review": "I bought this for the living room entertainment system.  I bought it because it has an audio optical cable out, which lets the audio go thru the surround sound system.  really enjoyable viewing.", "verified": true, "helpfulness": "0/0", "author": "J D"}, {"rating": 5.0, "review": "I love my new Amazon Fire TV. I even went back and bought 3 more for the additional TV's in my home. I now have no reason to purchase cable as all shows I want to see are available here. I would highly recommend. Not only can I watch my favorite TV shows, but I can stream music and play games. How did I ever survive without this!?", "verified": true, "helpfulness": "0/0", "author": "Amanda Baxter"}, {"rating": 5.0, "review": "It is exactly what I wanted from the music to the movies. I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best out there so far!", "verified": true, "helpfulness": "0/1", "author": "Damon"}, {"rating": 4.0, "review": "Still figuring it out", "verified": true, "helpfulness": "0/1", "author": "Jim Shirley \"CS Golfer\""}]