[{"rating": 3.0, "review": "We received the Chromecast yesterday and had it set-up within minutes. Very easy and simple. Once set-up, however, it displayed a notice that our router was not compatible with the device. We have an old Actiontec router (M1000/W1000) from Qwest that we've used for almost 10 years. I sleuthed around the internet for a workaround to no avail. If you have a newer router I'm sure you will be fine, but if your router is older you might double-check (just google \"Chromecast router compatibility\" and you will find the Chromecast support page). Thus, we are returning and looking into an Apple TV or Roku.", "verified": true, "helpfulness": "0/1", "author": "Groo"}, {"rating": 5.0, "review": "I have to travel quite a bit for my job.  I love that I don't have to watch CNN stories over and over again in my hotel room.  Now I can just plug this into the tv and watch all my favorite Netflix flicks hassle free.  It's a pity it doesn't have Amazon video yet, but it's well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Zorro Oscuro \"To avenge the helpless, punish cruel politicians, and aid the oppressed.\""}, {"rating": 1.0, "review": "The other one set up properly and I watched one Netflix movie on it, but the next time I tried to use it, it was dysfunctional. No image on the screen, and when I tried to use Netflix, the Netflix app would say, \"\"Play on device failed, failed to play on selected device. Please try again later\". I've since tried repeatedly to trouble shoot with no luck and no support from Chrome.", "verified": true, "helpfulness": "0/0", "author": "Don Fosson"}, {"rating": 1.0, "review": "Initially I bought this, because I thought I was going to be able to show my family my trip's pictures directly from my phone.  After I set everything up and downloaded all the Chromecast applications for it, I saw I could only get YouTube on my TV and that was it.  I could not display the pictures or anything else.  Worthless device unless there are more 3rd party applications released for it.", "verified": true, "helpfulness": "1/1", "author": "Johnny"}, {"rating": 3.0, "review": "Great for the price.Easy to use.Not as good as the raspberry pi.Needs update to stream photos and videos from your own phones...", "verified": true, "helpfulness": "0/0", "author": "Angus Ewart"}, {"rating": 1.0, "review": "It is not worth this time to write a review.I have done so to warn others.stay  awayDON'T WASTE YOUR MONEY", "verified": true, "helpfulness": "1/5", "author": "Gerard Foxton"}, {"rating": 3.0, "review": "I evidently did not do enough due diligence before I purchased this item. I wanted to use it when traveling to stream video from my computer or tablet to a TV in a hotel room. That can't be done because you must have access to the Wifi account to set this up and that is not possible at a hotel or similar establishment. My bad. I'm sure (based on other reviews) that it works fine at home, but not on the road.", "verified": true, "helpfulness": "2/3", "author": "J. Stauffer"}, {"rating": 5.0, "review": "As they continue to update and expand the applications that work with Chromecast, I am more and more glad I jumped on the band wagon when I did. GREAT price! Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Vanessa A. Guastella"}, {"rating": 1.0, "review": "Didn't work with iPhone 4, iPhone 5C, Kindle HD Fire, or the new Kindle Fire HDX.  This gift to my husband was a gift of disappointment and frustration.  I do audio visual for a Medical School so setting up equipment is simple for me but the wi-fi on our iPhones and Kindles just would not recognize the Google Chromecast.  Since our Sony Blu-Ray Player streams You Tube, Netflix, ESPN, Hulu, and many other programs we really didn't need this anyway.  It was just because the thing was cheap and supposed to be more user friendly than the Sony Blu-Ray Player for streaming.  At least the return policy through Amazon is good.  My coworker informed me that Google Chromecast works great with Droid Smartphones, but he said his Roku was better (although triple the cost).", "verified": true, "helpfulness": "1/2", "author": "GG \"Mrs. G\""}, {"rating": 4.0, "review": "Chromecast is awesome if you don't have a smart tv, or just prefer to watch youtube/netflix/etc queued up from your iphone or ipad.  One think I didn't like is it was not compatible with my NHL Game Center app so I was unable to watch games on my TV like I was hoping.  Will be a 5 star rating if I am able to find a way to do this.", "verified": false, "helpfulness": "0/0", "author": "JChiapp"}]