[{"rating": 5.0, "review": "Really great product! After reading not so great reviews about the fire stick I went with this and fortunately it had been marked down to $69 so bonus there! I had bought it at $99 two days before it marked down and since I am a prime member I got the reduced rate anyway just by asking. I love this Fire TV and i cant believe how small it is - about the size of a cd case and it is so fast with a simple remote control and voice activated at that- still learning that part! I also like the fact there are so many apps to choose from. This has replaced my blu-ray since I only watched streaming on it and I have to say I made the right choice, I will probably buy another one for my other tv.", "verified": true, "helpfulness": "0/0", "author": "shanny823"}, {"rating": 5.0, "review": "Awesome.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Paul Josias"}, {"rating": 5.0, "review": "Everything I expected!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Better than Apple TV by far.  I have them both, but Amazon Fire TV is what I use the most now.  I love the ability to speak almost anything and get a result.  If I am ready to listen to music, done.  I use Pandora on my iPhone, and if I push the microphone button on the remote and say \"Pandora\", the app comes up.  I sync'd my phone when I set Amazon Fire TV, so I can play everything in my music list, and I already have Surround Sound.  I thoroughly enjoy this system.", "verified": true, "helpfulness": "0/0", "author": "abnada"}, {"rating": 5.0, "review": "Bought it to replace an old, noisy HTPC in our bedroom. We mostly use it to stream content from our Plex server. Netflix works about as well as it does on other devices, and Amazon Prime with voice search feels very polished and refined. All in all, it surpassed my expectations considering the low price we paid for it.", "verified": true, "helpfulness": "0/0", "author": "Anna and John"}, {"rating": 5.0, "review": "It's a great piece of equipment", "verified": true, "helpfulness": "0/0", "author": "Curtis J. Smith"}, {"rating": 5.0, "review": "Amazon should continue down this road. The fire tv is pretty great. I try to sell one to every one I meet. Just very happy with it. Voice command only works for AP though.", "verified": true, "helpfulness": "0/0", "author": "Muchos"}, {"rating": 1.0, "review": "worker out of the box, watched one prime movie and now error code playready_hdcpfail", "verified": true, "helpfulness": "1/4", "author": "dominique cascio"}, {"rating": 3.0, "review": "The system works fine.  I have had no technical issues, etc. Very easy to get started. I am however very disappointed in the amount of movies available through prime.  I thought there would be so many movies we could watch through prime, but there is not.  In fact almost all of the Christmas movies you have to rent or buy, and buying them is expensive.  They are old movies that you could buy in the store for $5, but they want $15 through amazon.  Just thought most of the old movies would be free.", "verified": true, "helpfulness": "0/0", "author": "MV"}, {"rating": 5.0, "review": "Excellent, with prime, tons of content!!!", "verified": true, "helpfulness": "0/0", "author": "Steven Salzer"}]