[{"rating": 3.0, "review": "The price was great and I love that I can now watch Amazon Prime without having to hook my laptop up to my TV. However, the Netflix app is buggy on this and my wireless connection cuts out sometimes (this never happened on my Apple TV). I love that this has games (and so do my kids!) I'm optimistic, though. I'm hoping that some of the glitches clear up soon.", "verified": true, "helpfulness": "0/0", "author": "Mary Evans \"Mary Evans\""}, {"rating": 4.0, "review": "This is a very compact black box. It does more than one would expect from a box this size ( when compared to the massive satellite DVR ). It would be even better if the content was organised in more ways than are currently available.", "verified": true, "helpfulness": "0/0", "author": "pamister"}, {"rating": 3.0, "review": "Thought that you would get free movies instead you do not.  I would have just stuck with my netflix.", "verified": true, "helpfulness": "0/2", "author": "Irene Thomas"}, {"rating": 5.0, "review": "Easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Christina Huffstetler"}, {"rating": 2.0, "review": "I was disappointed because we got this Fire TV because we wanted to move our Roku upstairs but upon receiving it we realized that Charter Cable is not an option to sign on to Disney Jr or Showtime so it sorta defeats the purpose of why we purchased it. We are considering possibly returning it and just getting a Roku streaming stick.", "verified": true, "helpfulness": "2/3", "author": "Charis"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Tianshu Li"}, {"rating": 1.0, "review": "WARNING: You can not operate this device with a universal remote control without also buying another component that will convert the Bluetooth that the remote uses to IR. Why any manufacture would use blue tooth only is beyond me. If you want Bluetooth so your customers don't have to have to aim the device I get that, but include IR too!!!No AV devices use Bluetooth!!Roku was smart, they use RF and IR.", "verified": false, "helpfulness": "1/7", "author": "Bill Wine"}, {"rating": 2.0, "review": "I did not realize that I had to keep the cable tv service/channels that I just cancelled in order to watch ESPN live. \"The ESPN app is free,\" is what customer service told me. Neither my husband nor I am very happy right about now.", "verified": true, "helpfulness": "2/7", "author": "Michelle"}, {"rating": 5.0, "review": "Excellent product no issues, comes ready to go! I do wish the device supported dictation for other apps other than just searching Amazon content.  Now has the  ability to view Prime content separate. No real complaints, better than ATV.", "verified": true, "helpfulness": "1/1", "author": "Kevin B"}, {"rating": 5.0, "review": "Love this Fire TV!  Easy hookup and love the voice command!  Lots of free movies (although some of the older movies are still pay, such as Forrest Gump) but it allowed me to watch the first 5 seasons of Sons of Anarchy for free.  Did have to pay for the 6th season to catch up but that was ok.  And monthly fee!  Would highly recommend.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]