[{"rating": 5.0, "review": "At first, I thought I would never use this as I have a PS3 that serves as my media center for all my streaming services: Netflix, Hulu, etc. However once I started using it, it's hard to go back to the PS3. I initially bought one of these right after they released and it has only gotten better. My wife and I now use it to cast Netflix, Hulu, WatchESPN, HBOGo, Google Play Movies and Music, YouTube, Twitch, PocketCasts (for Podcasts), Chrome browser windows, Ultraviolet movies via Flixter/Vudu, etc. It's so easy to use. Perhaps the coolest use is that when visiting friends and family that own Chromecasts, I can simply use my phone that I always carry with me to stream anything from my cloud services that support Chromecast without having to carry physical media around! Additionally, more and more apps keep adding support. The biggest name video provider not supporting Chromecast is currently Amazon, and it's unlikely they will release Chromecast support for their apps since they came out with the Fire TV and Fire TV stick (although in a surprise move they recently released an Amazon Video app for Android Phones, so it COULD happen one day). So if you're invested in Prime Movies, this probably isn't the choice for you. For just about anything else, however, it's golden.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "Easy to setup and run from my phone, but have had a heard time getting it to hook up in hotel rooms. Have to clone the mac address onto a laptop and I wanted to use this on trips when I did not bring a laptop. The new update on the software is great.", "verified": false, "helpfulness": "0/0", "author": "Feisty14"}, {"rating": 4.0, "review": "Love using it. Love concept.  But you got to be careful as the hdmi plug and electric plug both bend and break very easily.  I had to buy another one. I now unplug it and put it away when not in use so it doesn't accidentally bend or break. If they made it sturdier i would give it 5 stars", "verified": true, "helpfulness": "0/0", "author": "redsox fan"}, {"rating": 5.0, "review": "I have one of these attached to every TV in my house.  And use them all the time.  Great device.", "verified": false, "helpfulness": "0/0", "author": "Chad  Bursiek"}, {"rating": 1.0, "review": "I had high hopes for this thing, but if you use Macs and iOS devices, don't buy this!  I spent hours trying to get it to work.  Finally learned on a support forum that it does not support iOS - so no iPads or iPhones!  Got it somewhat working on my mac laptop with great effort after downloading and updating apps and so forth - then the next day it didn't recognize my computer.Plug and play this is NOT.  And if you are an apple user, don't even try this thing.  I am going back to my Roku.", "verified": true, "helpfulness": "0/0", "author": "M. Roberts \"scamperwillow\""}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "W91032"}, {"rating": 5.0, "review": "excellent. Netflix works other countries", "verified": true, "helpfulness": "0/0", "author": "John Mira"}, {"rating": 1.0, "review": "Is not as easy as out of the book plug and play. Spent several hours and still not able to watch a movie from Netflix.", "verified": true, "helpfulness": "1/2", "author": "Charles S. Striplin"}, {"rating": 5.0, "review": "Sheer wizardry.  Where has this been all my life?", "verified": true, "helpfulness": "0/0", "author": "R. McCulloch \"Ronwise\""}, {"rating": 5.0, "review": "Great device.  It has now become an essential part of my tv viewing experience.  It extends my ability to watch what I want when I want it.", "verified": true, "helpfulness": "0/0", "author": "Meleteanne"}]