[{"rating": 4.0, "review": "I hope this adds more apps so I can officially never use my xbox again! I would like espn360 support and phone mirroring! Seriously the only bad thing about it is the less than 20 apps that support it still. Can't wait for more development.", "verified": true, "helpfulness": "0/0", "author": "MekMek"}, {"rating": 4.0, "review": "This is a great product, however, streaming is only available through browser based applications. So if you have an expansive movie library, consisting of digital copies, then you cannot stream these unless you've got a media player that runs in IE, Chrome or Netscape. I've also streamed through Netflix as well, which works fantastic.", "verified": true, "helpfulness": "0/0", "author": "Anthony Benavidez"}, {"rating": 4.0, "review": "Great item and glad I purchased it. Best bang for your buck and only one time no charge. No recurring. Would highly recommend this to a friend and already have.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "small and easy to use, now I can stream without needing a smart TV. Great product and good price! :)", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Monzon"}, {"rating": 4.0, "review": "Chromecast has decent list of supported applications, and it's easy to use, but it sure would be nice if Amazon Prime was one of the supported applications.", "verified": true, "helpfulness": "0/0", "author": "Gavin"}, {"rating": 4.0, "review": "love it. i can see why some may desire a better interface but i knew what i was buying. its simple and it works flawlessly. i have an android phone which works great. my boyfriend has an iphone and he complains of slightly less functionality than i have in terms of apps that work with it. however we both appreciate its handiness and even bought a second one. we watch a lot of youtube, netflix and hulu. i have not used the chrome browser on my computer yet so i cant comment on that.", "verified": true, "helpfulness": "0/0", "author": "Laura \"Laura\""}, {"rating": 5.0, "review": "Once my grandson - who has an identical Nexus 7 tablet - got it all set up for me, using it has been a pleasure.  Such a convenience. Was able to get caught up on last season Netflix's House of Cards. Trying other, too. Love it.", "verified": true, "helpfulness": "0/0", "author": "Judith Farrell-Booth"}, {"rating": 5.0, "review": "Easy to set up, is just a really cool device for moving netflix onto my TV as well as Youtube and pandora. I really want the webpage mirroring aspect to come out soon.", "verified": true, "helpfulness": "0/0", "author": "Sean O'Sullivan"}, {"rating": 5.0, "review": "yeah I'd recommend this to anybodyspait really is easy to work with and it does exactly as it says", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Chromecast has been a great addition to my media center, especially for Netflix. I haven't really used it for anything else yet, but I really like the flexibility.", "verified": true, "helpfulness": "0/0", "author": "David Simel"}]