[{"rating": 5.0, "review": "Absolutely incredible Google has done something great it's so simple to use and works every single time I need it it's practically plug and play just connect to wifi and that's it good job Google ... Buy this item", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excelent product!", "verified": true, "helpfulness": "0/0", "author": "Fabrizio"}, {"rating": 5.0, "review": "man do i love this thing. it is great and super convenient. i like the feature that it can should your desktop as well i highly recommend it. i was wondering if i should get this or the fire stick and this is alot more freebase.", "verified": true, "helpfulness": "1/1", "author": "JC"}, {"rating": 5.0, "review": "Excelent product!!!!Fast delivery!", "verified": true, "helpfulness": "0/0", "author": "Jonatan Varela"}, {"rating": 5.0, "review": "What a way to spice up the digital media experience in my living room!!!Easy to set up & great services. I see a bright future for the Chromecast as more APPs and services to utilize the product are built. Now I'm setting up a Plex account &  I'll try it to see the experience. Too bad there is no Netflix/HBO Go/Hulu Plus in the region I'm in(Time to improvise).Thank you Google for this awesome product.", "verified": true, "helpfulness": "0/0", "author": "Mangi"}, {"rating": 4.0, "review": "It is awesome. It works in India but for youtube and mobile.", "verified": true, "helpfulness": "0/0", "author": "harivansh"}, {"rating": 4.0, "review": "Fits the requirements. Some trouble with certain apps, but it's a grat value for the price.", "verified": true, "helpfulness": "0/0", "author": "Luis A."}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "ujwala"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "josiah"}, {"rating": 5.0, "review": "Love it. However you have to be careful, the more you plug it in and unplug it swapping between tv the HDMI connector starts to get loose and will eventually stop working. Highly recommend more than one if you plan on swapping it between TVs.", "verified": true, "helpfulness": "0/0", "author": "Daniel Oberg"}]