[{"rating": 2.0, "review": "Installed it, and it looks like it could be a very nice product, EXCEPT, nowhere does it tell you the system requirements to run this thing properly BEFORE purchase!There is some MISLEADING advertising going on wit this device!  My video is very choppy and it turns out that though everything else in my chain is full speed, and full connection, the GOOGLE installation and setup site used during setup AFTER YOU PAY FOR THIS product tells you you need a \"2nd generation i5 core processor, 2Ghz+ for 720p steaming, and minimum i3 core for 480 SD streaming!  You also must have Windows 7 or newer.So I paid double to get one of these thinking it would save me from buying another PC with HDMI to hook to my TV directly, when it turns out, you need a $500 PC to run the thing smoothly!  I could have paid another $100 and just hooked up an eMachine Atom, or the small dual core PC directly anyhow for less money!  Bottom line - if you already have an i5 2Ghz+ this thing likely do well.  Anything less, you might as well hook up a cheap PC with HDMI capability and a wireless keyboard/mouse combo.  That will be cheaper than buying this thing, plus a new $500 PC.The way they are getting around the hardware system requirement not being published, and saying you can use some little dual core Android, etc. is because they can claim some folks may not need to stream 480 or 720 video, and it will display webpages with less, but it will NOT stream worth 2 cents on less than the required processors.  I tried it using a new E-300, Atom based PC with 6GB memory.  It uses 1.6GB of memory which is not the problem, but it runs the processor at 100%, even on the 480 setting and still freeze frame video with unsynchronized sound and much delay.I either have to return this now and use my Atom as direct HDMI out and my wireless keyboard/mouse, or keep it and use it someday later down the road with a new i5 core PC or better.I'm very surprised at the high overall ratings it shows, but I guess I must be in the majority with my little dual-core Atom E-300, and my older Core 2 Duo PC with XP (XP won't work) to not have the ability to run it properly.  Just not worth it to me to have to buy a new $500 PC to stream this thing.  Amazon could have saved me lots of trouble by at least re-posting what the Goggle setup site requires as the minimum PC hardware requirements and not just the operating system requirements.", "verified": true, "helpfulness": "2/9", "author": "Electronics Yoda \"HP DC7800, E8400 3.0Ghz, 4G RAM, VelociRaptor HDD, Win 7 / Ubuntu\""}, {"rating": 2.0, "review": "I was anxiously awaiting this thing. It was supposed to be easy to set up, and it should have been. But for some reason, it would NOT connect to my wireless network. I spend 24 minutes on the phone with Google and they were no help at all. So I tried a few more times resetting the Chromecast, resetting my router, laptop, etc. and then it just decided to work. It connected like it was supposed to. I didn't change any settings... nada. Just worked. Netflix worked okay, but the resolution was lacking. I went to my favorite tv streaming site, project-free tv and the cast/stream quality was totally unwatchable. This was the main reason I bought it. I thought there'd be no more long HDMI cable connected from my laptop to my TV. But I was wrong. I *really* wanted this to work. I've tried everything, and while the audio is good the video is so jumpy, you just can't watch it. Sadly, sadly disappointed.*edit added 7/28/13* And furthermore, the Chromecast App for my Droid Bionic can't find the Chromecast on the network when my laptop has no issue finding it.", "verified": true, "helpfulness": "10/18", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is so easy to setup and just works. I cant believe it is only 35 dollars, everything streams perfectly for me and the video quality is great. It's a great product at a stunning price why wouldn't someone buy this.", "verified": true, "helpfulness": "3/4", "author": "Ian"}, {"rating": 5.0, "review": "I played around with the Chromecast for a day and it works very well. Setup was quick and straightforward. YouTube and Netflix played nearly flawlessly. I was able to cast videos to the Chromecast using my iPhone, Macbook Air, and an Android tablet. I could switch among the different devices and the Chromecast will play the selected video on whichever device I was using without delay. I could not find how to queue videos on my Macbook Air, but I found the TV queue on the YouTube app of my iPhone and Android tablet.I will mention some of the issues I noticed when using the Chromecast. On rare occasions, when I changed the YouTube video being played, the video would not play on the Chromecast but the audio would still play. Refreshing the video on the device I was using would fix that problem. I didn't play around on Netflix long enough to see this problem occur. Private videos on my YouTube account will not play at all on the Chromecast. I'm assuming it's because the Chromecast does not have permission to access my private videos. Unlisted and public videos will play fine. Casting a Chrome tab on my Macbook Air would result in a laggy and blurry display of the tab on the Chromecast. The text was unreadable and scrolling on a website was delayed by a second. I also found no way to set permissions on which devices can cast a video to the Chromecast. I can see that being a problem on a public WiFi or a shared WiFi with the Chromecast.Buy the Chromecast for YouTube and Netflix. Don't buy it if you want to mirror your Chrome browser tabs.Update: I got my Netflix 3 month code on July 30, 2013 and after I used it, a discount of $23.97 was applied to my Netflix account. Awesome!", "verified": true, "helpfulness": "1/1", "author": "Andy Ng"}, {"rating": 5.0, "review": "Just received mine today, been playing around with it for a few hours. Setup was easy only took a few minutes. I have been easily able to use youtube, netflix, and google music from my android phone. Very little input lag when hitting pause or play.Casting a chrome tab from desktop has been a good experience so far, definitely more delay, but perfect for streaming movies.Overall I think it is a great device, can't wait to have a group over to try  making youtube playlists with multiple people and devices.", "verified": false, "helpfulness": "0/0", "author": "Wade"}, {"rating": 5.0, "review": "This device is no brainer for people like me for whom watching TV means watching movies on Netflix or Youtube Videos. It takes only few seconds once cast button is used to get video on TV screen. I have a smartTV but I'm very happy that I no longer need to use the weird TV interface keypad (selecting one letter at a time) to type a movie or search for a video. You can do it using your laptop, any smartphone or tablet device.Watching videos using Chrome browser is not perfect and at times video and audit get out of sync. I hope it gets better.Setup was a breeze and only it took me less than 5 minutes.Device was packaged very well if that matters for anyone.", "verified": true, "helpfulness": "1/1", "author": "Sach"}, {"rating": 5.0, "review": "After all the earlier botched attempts (Google TV, Nexus Q) in capturing the last frontier of the most ubiquitous, beloved!? and notorious household item.. Google has finally arrived... with the right device- by providing the right price (impulse region)- by providing cracker features- and by making it a future proof (by not tying to the hardware like Roku/ Apple TV)Google has a winner here.. whatever the whiners say about app compatibility and usb power required not indicated etc etc.. for 35$ this IS the BEST streaming device on the market.  I can't explain how simple and liberating it is to just select any video on youtube and then watching it on TV.. its an amazing experience...Even with the limited app selection (youtube, netflix, google play) available currently, the options are still limitless..  youtube itself has tons of videos, not to mention quality of netflix...  that said, Google released an SDK for this.. and probably the android/iOS market is going to be flooded with compatible apps pretty soon..Also, if you don't have Google chrome browser (esp. beta version).. go ahead do yourself a favor and install it immediately.. install the 'Google cast' extension and you can share anything on your computer... not just tab, your entire computer screen.. there's an experimental feature called 'Cast entire screen (experimental)' option, (there's a small dropdown triangle on the right side)..all in all a best purchase..  future proof...", "verified": true, "helpfulness": "0/0", "author": "srikanth003"}, {"rating": 5.0, "review": "This device is perfect for what it is. There are lots of reviews here to describe in detail what it can do and cannot, but for me it does way more than I expected for $35", "verified": true, "helpfulness": "0/0", "author": "Abbadeer"}, {"rating": 5.0, "review": "Easy to use. Works great with multiple operating systems and devices. I'm currently watching Modern Family from the ABC Web page on my HDTV. Google seems to have really come up with a homerun. Wish it were both 2.4 and 5GHz but the 5GHz would have reduced range anyway. Google's design also has a couple of other benefits:1. Less powerful devices and AMD chips can be used.2. The control device (computer, etc.) can be located much farther from the HDTV than other solutions such as Widi.When you use one of the currently designated apps. like Neflix, almost no laptop resources are used and the quality is excellent.  When playing quality video in a browser tab, a 3rd. generation i5 seems to be the minimum to produce very good results in a browser tab.  An i3 almost does it, but based on my experience there will be some issues with anything less.  Apps. like Netflix are a different story as far as cpu.  I have a Samsung 500T with an Atom processor and it is able to run Netflix on my HDTV using Chromecast with no problems.  We also have a 2012 Mac Mini running Windows Vista under the Parallels emulator.  Netflix runs fine in this configuration.", "verified": true, "helpfulness": "4/5", "author": "John"}, {"rating": 5.0, "review": "This product works great with all my android devices. It also works well from my macbook air using the chrome browser.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}]