[{"rating": 2.0, "review": "I had purchased this item on July 26 right after it came out, however, it stops to work and stream exactly after 3 months. I was trying to return and exchange and unfortunately I was told that it is out of return or exchange window. I was not expecting this kind of quality on Google product!!", "verified": true, "helpfulness": "0/0", "author": "Jiabin Li"}, {"rating": 3.0, "review": "Youtube and netflix streaming is awesome. but they must provid support for other application also. sometimes  it doesn't detect by laptop. still there are lots of issue with the device. you need to have patience while using it. but its value for money if its working fine. looks like google guys need to do lot more testing before launching the product in the market.", "verified": true, "helpfulness": "0/0", "author": "akhilesh kaushik"}, {"rating": 4.0, "review": "Super easy to use. Need Google to continue with providing the promised apps. When that happens I'll give it five stars.", "verified": true, "helpfulness": "0/0", "author": "BZ \"silverzd\""}, {"rating": 4.0, "review": "The Google Chromecast by itself works just fine.  It's the providers that make it difficult to use.  I only use it to stream to a new TV that doesn't have a VGA input.  So I either need a new computer with HDMI output or get cable...whatever.  Netflix works perfectly, their app lets you choose to watch on your computer or stream.  Hulu's new \"I work with Chromecast\" probably works on everything except a PC.  Their customer support can't seem to understand why I only have a PC.  Streaming TV show is a good as watching on your laptop as long as you have good enough wireless to support it.", "verified": true, "helpfulness": "0/0", "author": "Hokey Smokes"}, {"rating": 5.0, "review": "I received this as a birthday gift and it's wonderful.  I had no idea something like this existed.  We are now able to watch Netflix and Youtube videos on our regular TV without having to use our Xbox.  It's much more convenient and at a wonderful price.", "verified": true, "helpfulness": "1/1", "author": "Amber Davis"}, {"rating": 5.0, "review": "in today's world where everyone has a cell phone or should I say smart phone, we need a way to transfer what we're watching as far as YouTube and movies to watch television. This device is very inexpensive and does it seemlessly!!  setting it up takes less than a minute. You just download the Chrome cast app and follow a few steps. It's basically plug n play. I bought one for my house and my girlfriends house and its worth every penny!", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 5.0, "review": "Now that Hulu+ is available with chromecast, this allowed me to finally cut the cord to my $120 satellite bill.  Don't miss it AT ALL.", "verified": true, "helpfulness": "0/0", "author": "Vance Macdonald"}, {"rating": 2.0, "review": "Does not connect, have tried it with two routers,tablet and laptop, waste of money. I use my Roku,with no problem", "verified": true, "helpfulness": "0/0", "author": "charles hall"}, {"rating": 5.0, "review": "Product works great as advertised.Note: Your wireless router however has to be set to DHCP to use the device.", "verified": true, "helpfulness": "0/0", "author": "Greg Szabo"}, {"rating": 1.0, "review": "Didn't work when I streamed from chrome browser.  Permanently interrupted full screen viewing on my computer.  Unable to contact google for help.", "verified": true, "helpfulness": "0/2", "author": "Nathan"}]