[{"rating": 1.0, "review": "Seldom works, drops connection frequently.  Somewhat stable on youtube on the IPAD, only worked for a second or two from a Chrome tab on a Chromebook.", "verified": true, "helpfulness": "2/3", "author": "World Traveller"}, {"rating": 1.0, "review": "I give it one star because there is no lower setting.Didn't work right out of the box; google offered to replace but not to test first. I spent three hours messing with a $35 product; I'm not going to sink anymore time into this POS.", "verified": false, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I excitedly received my Chromecast and got 3/4 through the setup, but am getting an error that Chromecast cannot connect to my network, and i have to either modify the AP Isolation or enable the UPnP.  The UPnP was easy enough to locate, and it is enabled - but i have no clue as to how to modify the AP Isolation in my router settings.  I've sent a note to the support department for my router (Netgear) - but i have NEVER had any problems getting other hardware to connect to my home WiFi network:  TiVo, Roku, Wii, PlayStation, multiple computers - all have connected seamlessly and i expected a smoother setup from Google.  Very disappointed so far.  I'll update this if i can ever get it installed.  2 Stars for now (I haven't abandoned hope yet).***Update: i had to manually enter the MAC address of the Chromecast into my router to get it connected.  Google's Support never mentions this, and if you're \"googling\" for Chromecast support, your results are biased towards GoogleSupport.  I had to page through several results to find a forum that mentioned hardcoding the MAC address.  No opinion on the product yet, but Google's support for the product has so far been inferior and inadequate.I actually got some media from my MacBook to \"cast\" to the television - YouTube video, Netflix... i had a webpage casting - but then the ChromeCast got \"lost\" and does not appear in my \"casting\" icon in my Chrome browser.  Still looks like i am having connectivity issues.", "verified": true, "helpfulness": "0/0", "author": "OHCustomer \"timbernhard\""}, {"rating": 5.0, "review": "Bought the nicest Samsung blueray player I could find to substitute my chromecast and immediately went back to my chromecast because it is easily twice as fast as my blueray player. Great way to make your regular TV into a smart TV!", "verified": true, "helpfulness": "0/0", "author": "509fisherman"}, {"rating": 3.0, "review": "Works after a fashion, but seems restrictive as to the content we can view through it", "verified": true, "helpfulness": "0/0", "author": "Michael P. Holahan"}, {"rating": 3.0, "review": "Only time will tell how good this will be. So far I prefer my roku or Apple TV.  It is simple to setup and use, but I wish it had a mirroring function for he ipad/iPhone. I can't wait to see how this item changes in the future.  It'll be great for travel.", "verified": true, "helpfulness": "0/0", "author": "Bradley F. Baker"}, {"rating": 3.0, "review": "i understand its still a work in progress but currently it doesn't support casting photos or video saves on your device nir can you cast your chrome browser to the hd screen. But I'm patient and confident google will update this soon.I do like the fact it can plug in inconspicuously behind the screen or av receiver.", "verified": true, "helpfulness": "0/0", "author": "Don Patterson"}, {"rating": 5.0, "review": "I bought this google chromecast for my sony tv & works excellent, very good picture quality, no interructions at all. also very good price.", "verified": true, "helpfulness": "0/0", "author": "Rudolf"}, {"rating": 5.0, "review": "Had the apple cable that connects the ipad to the tv for about 4 years, but since im planning to buy the latest ipad, i decided to give this a try. It is amazing! The quality of the image is way better then the apple cable, and it puts youtube videos in great quality on to your tv! If you love netflix, hulu, youtube, and so on, def get it! I cancelled my cable 2 years ago and have only rhose services now, this gadget is great for this!", "verified": true, "helpfulness": "0/0", "author": "jamile"}, {"rating": 5.0, "review": "I use it ever single day. I used to hook my computer up to my TV but it was annoying having to drag windows and never remember where I last closed the program (Windows 7 thing). I love the amount of people getting involved, too (HBO GO, Hulu, Netflix, Pandora, etc.). It's so easy to use, a little buggy at times but getting updates all the time, and it frees up my computer for games and browsing only. Love it.", "verified": true, "helpfulness": "0/0", "author": "leather feathers"}]