[{"rating": 1.0, "review": "If you know 1k way to do stuff and want to be forced to do it only in 1 way and the way they want you do it then this is the answer to your dream! That will limited your need and will tell you the true or redefine freedom.If you hate all Jailbreak stuff and If you like to do only the stuff they told you to do... If your are waiting for something that say Yes at what it want and say No at what \"might\" you want then do not wait any longer.", "verified": true, "helpfulness": "0/6", "author": "Nout"}, {"rating": 5.0, "review": "Its cool. Needs more apps i am sure google is on top of it. This is will be a great addition to my tv and internet experiance.", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "I bought Chromecast for my husband as a Christmas present.  It works great and allows us to watch videos from online on our TV.", "verified": true, "helpfulness": "1/1", "author": "Jennifer McGrath"}, {"rating": 5.0, "review": "cant go wrong for price easy setup and very clear screen ..no lag ,,makes old hdmi tv smart for low price", "verified": true, "helpfulness": "1/2", "author": "kel"}, {"rating": 5.0, "review": "This amazing device has just begun to be developed. There will be mountains of apps to come. I find it plays Netfix, You Tube, etc better than any of my other electronics(Smart TV, WD Media player, etc) plays them. Smoother, brighter better colors. I talked a buddy into buying one a month ago not knowing I would also buy one. At this price you cannot miss. It is in it's enfancy and will continue to grow for quite some time to come. It's not an Apple. It's a Google.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"pnutter\""}, {"rating": 5.0, "review": "This has greatly expanded our family entertainment options.  Easy to use and very flexible.  Even the 8-year old is enjoying using Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is actually the 4th one I've purchased.  I fell in love with the first one and had to get one for my bedroom, one for my daughter, as a Christmas gift, and one for my mother's home.  It connects effortlessly.  Connects with my laptop, phone and tablet.  No problems at all!  I can now view all my home videos.  I just wish there were more apps available to cast to, but that will come in time.  Deffinatley 5 stars!", "verified": true, "helpfulness": "0/0", "author": "Doreen J Hicks"}, {"rating": 3.0, "review": "I bought this so we could watch things on the TV that we would normally stream on the laptop and connect to the TV. It works, but the streaming is delayed so the picture is not as clear and looks shakey. I would rather continue plugging in the laptop to the TV because the clarity is better and there is no delay to make the picture blurry or shakey.", "verified": true, "helpfulness": "1/1", "author": "Kara"}, {"rating": 5.0, "review": "You probably have an Xbox or Roku or Playstation or some kind of device streaming video, but they definitely aren't $35 and certainly don't have the portability of a Chromecast.More apps are getting supported, but really, who needs more than Netflix, YouTube, Hulu Plus and HBO Go for streaming video? If you said, \"me!\"...go outside.If you have a Tablet, Smartphone, Laptop or Desktop already pre-loaded with the above mentioned services, you are crazy not to get a Chromecast for your spare TV. Great Device, great price, can't wait to see what Google develops for Chromecast in the future!", "verified": true, "helpfulness": "0/0", "author": "Jimmy Worrell"}, {"rating": 4.0, "review": "Chromecast is great.  The only set back I have noticed is that it does not seem to stream Amazon prime which may become a major issue in the future.", "verified": true, "helpfulness": "0/0", "author": "Anil K Mehta"}]