[{"rating": 4.0, "review": "Convenient device for my non-smart LCD TV but I wish there was support for Windows Phone or Windows RT products.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Hernandez"}, {"rating": 5.0, "review": "I really love this thing!  Totally awesome and I use it regularly.  I do hope the plugin keeps updating on a regular basis.  Basically its a wireless HDMI connection.  Share the screen, watch youtube, movies, all sorts of stuff.", "verified": true, "helpfulness": "0/0", "author": "Robert Rosario"}, {"rating": 3.0, "review": "Does not work by it self like Apple TV that has built in apps, the need of the phone for every app is a down point that I didn't expect.Good thing to share entire screen on your PC but is still on experimental, works a little bit slow still, hope they get this better soon.", "verified": true, "helpfulness": "0/0", "author": "George Lima Camara"}, {"rating": 4.0, "review": "I work where these are used on large screens above our desks to remind the front-line support engineers how the departments by product are performing their support duty. Being a back-line engineer who deals with engineering as a go-between, I have some lee-way in my hours, and even get to work at home.I was working over the holidays December 2013 and used my Android tablet to play some videos while nobody was around and I had nothing to do. That was the first time I'd seen \"Luna\" from Pixar. I fell in love with the idea of being able to \"Cast\" and ordered one.Since then I've ordered another one and have one on each TV.I really like having them, and I especially like being able to cast a version of America Unearthed on the TV from my Linux laptop using Chromium or from my tablet.I recommend them to others. Sorry Amazon, I can't justify the extra expense of your new product... yet...", "verified": true, "helpfulness": "0/0", "author": "Karl L. Pearson"}, {"rating": 1.0, "review": "I am very dissapointed to write that this chromecast is not working. It installed then displayed a yellow exclamation mark on the screen I contacted google support and they led me through a series of fixes all to no avail it has to be replaced", "verified": true, "helpfulness": "1/1", "author": "Jimbo"}, {"rating": 5.0, "review": "I'm pretty happy with the google cromecast. I have had no issues with connecting or streaming. I can use my tv to surf the net. I can watch netflix or other apps that are on my cell, tablet, computer and watch them on my tv, plus I can still surf or play games on whichever device I used to send netflix (hulu, crackle, whichever you like) to my tv. If you don't have an hdmi input, there are converters to RCA for about $20. (If you do that, get the little box not the wire ones)The only thing that bothers me is that it still feels separate. Meaning that, at times I go to my \"smart\" DVD player to stream netflix, and I think that is because of the remote. (I'm guessing that is a guy thing...)", "verified": false, "helpfulness": "0/0", "author": "eDeal"}, {"rating": 2.0, "review": "I don't get the point of this device. If you already have an Internet Ready TV (like the Samsung we have), what additional streaming sources are enabled by this dongle? I ordered it assuming that I could stream videos on my TV from my PC browser. In theory you can, using Chrome and Google Cast - but the performance was terrible. I suspect if I souped up my PC, things may improve but then I am not willing to spend $2000 to make a $50 device work better.I suspect in the long run this is a great device but the current apps ecosystem is very basic, and almost all the sites I use for streaming did not have a dedicated app that uses Chromecast - hence, the need to use split browser.I will give this another try when there are more apps. The unit I got was promptly returned.", "verified": true, "helpfulness": "1/2", "author": "ProSumer"}, {"rating": 5.0, "review": "Inexpensive, uses my favorite browser, easy to use. I expect this device will not meet everyone's needs but it is fine for me.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product would definitely buy again, product for my money, I am going to buy again as soon as I am done with me TV room", "verified": true, "helpfulness": "0/0", "author": "Dwight"}, {"rating": 5.0, "review": "I brought the chromecast after being told of it by a friend of mines and I have not regretted buying this device. It works well at home and my wife even enjoys working it. I would recommend this to all of my friends who enjoy streaming media.", "verified": true, "helpfulness": "0/0", "author": "Michael Mc Intosh"}]