[{"rating": 5.0, "review": "It is defiantly a must have product. I have 6 :) Just needs mirroring for android but i think it is coming soon.", "verified": true, "helpfulness": "0/0", "author": "A. B"}, {"rating": 5.0, "review": "Ever, with the exception of a perfect young female body (>17 years old, of course)--- even better if you are my age (85)---GR", "verified": true, "helpfulness": "0/0", "author": "George Rosenthal Jr"}, {"rating": 1.0, "review": "Excited to get this for Christmas.  Seems easy to set up UNTIL I found that my local Cable company doesn't talk nicely with it and I can't use it.  $35 dollars down the dran.", "verified": true, "helpfulness": "0/1", "author": "teresa rodgers"}, {"rating": 4.0, "review": "Bought for my sister and she has loved it. Best money I could have spent for her. Super easy to use.", "verified": true, "helpfulness": "0/1", "author": "Jesse Green"}, {"rating": 1.0, "review": "I initially bought this thinking I could get rid of cable. It worked brilliantly for a few weeks.I used the prime downloads, and watched a lot. Then I started to download, an an update came along. I can no longer use my amazon account to cast to my TV. Yes, I can still use my netflix account, but I wanted my Amazon account as well. What workd before is now broken, and I have a crying kid since the movie I bought for her thinking it was going to show on the TV didn't work as it was promised. I love Amazon prime, but I am disgusted at Amazon offering something and then taking it away without notice. Save your money and go with a Roku box. At least that still works as originally sold to me.", "verified": true, "helpfulness": "0/1", "author": "Stacy Hudson"}, {"rating": 5.0, "review": "Our TV came with NETFLIX installed, but it always took a long time to load - I mean several minutes, if at all - and many times it would kick us out right in the middle of a program. VERY FRUSTRATING! It got to the point where we seldom watched NETFLIX on that TV and only used it on our iPad/iPhones.This unit is very compact when compared to Apple TV and easily hides behind the TV nicely. It plugs into an HDMI port and the power cable (included, but not shown) simply plugs into a USB port. If you wish to continue using cable or satellite, make sure your TV has extra ports!A minor downside is having to use your smartphone for the remote after the installation of the Chromecast app. Normal sleep setting will have your phone blink out, which requires it to be booted again before you can pause, rewind, adjust volume or go to another show.That said, this is way, WAY better than fighting with any cranky TV's operating system.As for Apple TV, I just purchased one of those and will be installing it shortly. Another review will be forthcoming.Update: Gave the Apple TV to my son, who loves it. We're waiting for some of the reported shortcomings to be worked out of Amazon's Fire TV before purchasing one of those units.", "verified": true, "helpfulness": "0/0", "author": "2011 F450"}, {"rating": 5.0, "review": "We already have a Roku for the living room and wanted something that allowed us to watch Netflix and listen to Pandora in our bedroom. This works great and it's really nice that you can operate it with your phone instead of adding another remote to the collection. Plus, it's significantly cheaper than a Roku -- overall, very glad we bought it.", "verified": true, "helpfulness": "1/1", "author": "Georgia S."}, {"rating": 5.0, "review": "This little dongle has solved my issues with my upnp server and the crappy smart tv software of my Sony Bravia.Thanks to all developers making fantastic software to take advantage of the google hardware.", "verified": true, "helpfulness": "0/0", "author": "Federico Tarucco"}, {"rating": 5.0, "review": "My favorite part about using the Chromecast is being able to instantly throw whatever is on my browser screen up to the main TV. This has been great to show friends and family photos off Facebook, Google+, Shutterfly, or anything else!", "verified": true, "helpfulness": "0/0", "author": "Lindsey"}, {"rating": 5.0, "review": "We use Netflix ALL THE TIME. We had to purchase a second one of these so we didn't have to keep taking it from room to room. Well worth the price if you're a Netflix user tired of watching on a small screen, or are sick of cords.", "verified": true, "helpfulness": "0/0", "author": "AhhmayzingClaire"}]