[{"rating": 4.0, "review": "A bit of a pain to set up with a Belkin router, but once you figure it out its a pretty cool little device to have.", "verified": true, "helpfulness": "0/0", "author": "D. Brown"}, {"rating": 5.0, "review": "Freaking awesome! No really, talk about very useful. Bought one from BestBuy then decided I needed 4 more. One for each TV.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Great product!  It has its quirks sometimes but generally works flawlessly.  If I was going to buy something like this for my parents I would probably buy a Roku or Amazon Fire TV Stick because they come with a remote.  For me though, one less remote in the house is a good thing.", "verified": true, "helpfulness": "1/1", "author": "Les Martin"}, {"rating": 1.0, "review": "the thing is a nightmare.", "verified": false, "helpfulness": "6/12", "author": "deochan karan"}, {"rating": 5.0, "review": "My old TV is given life again!", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "Chromecast wasn't the best purchase when it first came out. My friend at work kept trying to sell his to me at a cheaper rate. Over the years, they really stepped up the development, and I finally had to get my own. One of the best purchases I made in 2014!!", "verified": true, "helpfulness": "0/0", "author": "Pete in GA"}, {"rating": 4.0, "review": "Works great with our Nexus 7, would be nice if we could cast from Windows Phone.", "verified": true, "helpfulness": "0/0", "author": "S. Thompson"}, {"rating": 4.0, "review": "The Google Chromecast is my favorite home addition for 2014!  Simple setup. I access Hulu Plus and Netflix from my phone or tablet. Make sure you are running on WiFi and not cellular data.", "verified": true, "helpfulness": "0/0", "author": "Anita Hope Bata"}, {"rating": 5.0, "review": "Bought one of these for my mother and one for my cousin, they love them.", "verified": true, "helpfulness": "0/0", "author": "Elwood"}, {"rating": 5.0, "review": "Love being able to stream from mobile device onto big screen of TV!  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "W. Newton"}]