[{"rating": 4.0, "review": "If you are looking for a cheap and easy way to get netflix or hulu or any of the other supported apps from your phone, ipad, computer, etc. onto your TV then I would highly recommend this.  The only issue I have had is poor connection when trying to cast a Google Chrome browser tab.  The device wasn't able to play Pandora consistently.  Still a great device for the money.", "verified": true, "helpfulness": "0/0", "author": "Denver Lyons"}, {"rating": 3.0, "review": "There is good news and bad news here.  The bad news is that I returned the first unit because it simply didn't work.  After completing the initial setup (and calling Google for additional support), I couldn't make the final connection that would show what was on my computer on my tv screen. I returned my first Chromecast to Amazon for a full refund.In the meantime, I had already replaced the unit at another retail due to a 20% sale instore.  This time it did work, but I was able to see the upsides and downsides.  The first thing I did was to play a movie on Netflix -- was pretty impressed with the performance (I watched the movie almost straight through, not much fast forwarding and rewinding), then I listened to some music on Pandora.  In comparison to the Roku that I had before, the interface was not as nice, and also when I started to do my usual multi-tasking on the computer, it would affect the playback of the music, dragging out the words so that I had to stop using the computer for anything else.  Lastly, I tried to stream Spotify, it would work for a few songs, and then it would just stop.  I think essentially that Spotify is not compatible with the Chromecast, but i gave it a shot.Overall, not perfect, but not a big investment either.  Three stars!", "verified": true, "helpfulness": "0/0", "author": "Kara Park"}, {"rating": 5.0, "review": "We like this, it allows any device to broadcast via our WiFi directly to the TV where it is plugged in.However they ate still adding programs and video protocols to work with it, so check on Google to ensure your planned program works with Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "EK406"}, {"rating": 4.0, "review": "If you like the price, it's a good buy and very functional.  It was harder to set up than appleTV I have on another TV.  I also miss the remote that allows me to access Netflix without using an iPad, or other device.  Other than that, it works perfectly, is smaller, and cheaper.", "verified": true, "helpfulness": "0/0", "author": "M. Freeman \"Quick2Click\""}, {"rating": 2.0, "review": "Google Chrome TV does not work very well when I watch movies.  It keeps interrupting! It only works well with youtube", "verified": true, "helpfulness": "0/0", "author": "Carlo V."}, {"rating": 5.0, "review": "This is a great little device. I have been watching Netflix on my t.v. since I installed this. I am seriously going to cancel my cable and just keep Netflix and Hulu Plus as my entertainment sources. Also there is You Tube with endless music videos etc...I would highly recommend this to anyone who is tired of paying 100 bucks a month for 1 to 200 channels and watching about 10 of them.", "verified": true, "helpfulness": "0/0", "author": "Paul Fritz"}, {"rating": 5.0, "review": "It was more than I expected. I can cast from my ipad to my tv from everywhere I want. Amazing purchase!!!", "verified": true, "helpfulness": "0/0", "author": "Josue"}, {"rating": 5.0, "review": "Wow, one little device makes streaming videos, movies and music easy! I recommend this little thing to almost anyone who is not familiar with taking advantage of streaming on your TV...especially if you don't have a smartTV or a Blue Tooth DVD player", "verified": true, "helpfulness": "0/0", "author": "Celeste Brown"}, {"rating": 3.0, "review": "First the device as pictured is misleading. There is a small additional attachment from the chrome cast to the USB. Second you must have your iPad handy in order to stream the content. The other devices roku or apple tv have all content streamed thru their device not a handheld  (iPad/galaxy) then to the TV.", "verified": true, "helpfulness": "0/0", "author": "John V. Manna"}, {"rating": 5.0, "review": "perfect for streaming music and videos off my PC. works great for people who attend school and need to study on their computers and watch videos for school to enhance it to your TV screen.", "verified": true, "helpfulness": "0/0", "author": "eric schultz"}]