[{"rating": 4.0, "review": "works well with amazon prime, easy to search movies and videos.play youtube videos as well with very good video quality,but the voice command doesn't recognize lot of words.over all very good product for the price.", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 1.0, "review": "Received the fire tv reasonably fast however the sound doesn't work.  I've tried multiple hdmi chords( even an \"amazon\" hdmi chord) and televisions that are currently working fine with other hdmi devices.", "verified": true, "helpfulness": "2/4", "author": "Matt"}, {"rating": 5.0, "review": "A Christmas gift for ourselves...easy to set up and use. So far we are enjoying it, though we have barely scratched the surface of the content available! Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Danielle A."}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "DEREK DARBY"}, {"rating": 5.0, "review": "This little device rocks! I had to update the software when I first installed it and it now plays Netflix flawlessly. I am very pleased with purchase...", "verified": true, "helpfulness": "0/0", "author": "William Caruthers"}, {"rating": 2.0, "review": "just got it set it up and simple not worth the money.  Very little worth watching.  Just get Netflix save your money and call it good.", "verified": false, "helpfulness": "0/3", "author": "Joseph A. Roberts \"rabatvilla\""}, {"rating": 4.0, "review": "Easy install.  Streaming to my HDTV through the Fire TV is great.  I have not explored all that I can do, yet I have found/downloaded  Pandora, Netflix, Flixter, and others.  These few apps have really enhanced my family room entertainment.  I also found one FREE really fun racing game app that I have played just about everyday.  I have Prime at this time, so I can see many Movies, TV, etc for free.  I have seen that without Prime, you lose many free access to TV, Movie, etc.  Now it is deciding on balancing between, Netflix, Prime, Hulu Plus, etc (all about $7-9 per month each).  Over-all, I am very happy with the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Starvin"}, {"rating": 5.0, "review": "This will help you cut the cord or your cable bill.This will become your DVR", "verified": true, "helpfulness": "0/0", "author": "Evo \"Bushidobrown\""}, {"rating": 4.0, "review": "Great buy.  Took some time to figure out how to setup Netflix.  Once I did everything worked out just fine.", "verified": true, "helpfulness": "0/0", "author": "JHTrevino"}, {"rating": 5.0, "review": "Wonderful addition to our viewing movies on tv at no extra cost.  Easy to use and to install.", "verified": true, "helpfulness": "0/0", "author": "Dale Yount"}]