[{"rating": 5.0, "review": "Excellent product in quality, as described! Easy to install and use it", "verified": true, "helpfulness": "0/0", "author": "Ezequiel Villar"}, {"rating": 3.0, "review": "The Chromecast is an exceptional concept, but it seems to fall flat in usefulness and reliability. The product only streams a few apps such as Netflix, Youtube, and Chrome, and these are great for a time, but I feel like there are other, cheaper ways to go to get the same services streamed to your television. I have had some issues with it working properly and connecting, sometimes taking 20 minutes and a system reset to take care of. When I plan to use it I find myself hoping that it will work and expecting it not to show up automatically.Aside from reliability and usefulness, I think that it is a great idea, but needs to be patched up and added to.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 4.0, "review": "Needs better apple support. Worked flawless on Android though. If you get this and have android you have to get TV portal.", "verified": true, "helpfulness": "0/0", "author": "Chrissylynn80"}, {"rating": 4.0, "review": "you have to know that you only can cast online or cloud data, you cant play movies or photos from your phone storage. ( Use android TV if you want to )", "verified": true, "helpfulness": "0/0", "author": "Yahya soliman"}, {"rating": 2.0, "review": "Mehsome features like casting are nice but otherwise vastly inferior to Roku. Channel selection is pathetic. Video Quality is pathetic. Gets better after the reboot but not for long. Does not support wired and  no 5GHz only 2.4GHz which is very crowded. No way to adjust video quality.Cheap but you get what you pay for", "verified": true, "helpfulness": "0/0", "author": "cyclopathic"}, {"rating": 3.0, "review": "My internet to slow for this looks choppy.  I gonna keep and upgrade.  By then should have smart tv so not really sure the utility of this.Told works in hotels during travel.  I guess that would work.", "verified": true, "helpfulness": "0/0", "author": "kniveguy"}, {"rating": 1.0, "review": "this is probably the worst thing I've ever bought in my life. Without fail every single time I try to stream something it will play for 30 seconds then proceed to \"load\" from 0% again just to freeze up as soon as it gets to 99%. I have great wifi that works with everything in my home, but for some reason this is the slowest piece of technology I own. I don't recommend this at all.", "verified": false, "helpfulness": "0/0", "author": "joyce griffin"}, {"rating": 4.0, "review": "just what i needed to watch higher quality videos.", "verified": false, "helpfulness": "0/0", "author": "James Jeffries"}, {"rating": 5.0, "review": "Greatest item for slinging iPhone stuff to tv! Love it and a great price", "verified": true, "helpfulness": "0/0", "author": "Roben Bradshaw"}, {"rating": 1.0, "review": "Tried to hook this up at my parents house, soon as I plugged it in and downloaded the app it could not be recognized on my Wi-Fi. So I did the trouble shoot, nothing tried the factory reset the light didn't even change color. took the unit to my house thinking there router was condemned but it wasn't having the same problem at my house on my command center. might just be the unit I got because I have heard great things about them just not the one I got. Thanks long time customer.", "verified": true, "helpfulness": "0/0", "author": "Brian cole"}]