[{"rating": 5.0, "review": "This is my second chromecast, it was in prime so bought in from amazon :)More apps supported and hoping for even more. Just the kind of device i wanted to stream my stuff on TV without any remote or keyboard. Love this device", "verified": true, "helpfulness": "0/0", "author": "saurav sen"}, {"rating": 5.0, "review": "It does what it says it will. I can finally use Netflix on the main TV! And the ability to use my ipod/computer as a remote is so convenient.Be sure you have an extra USB plug to power it if your HDMI port is older, and sometimes it does get glitchy stopping and starting videos on Youtube. Other than that, just plug it in, power it up, log it on to your wireless network, and pick your movie!", "verified": true, "helpfulness": "0/0", "author": "goingverbal"}, {"rating": 5.0, "review": "If you don't have a smart TV, well this will make it into one controlled through your Android, computer or Apple devices. Not only can you use it on almost all major platforms.How I use the chromecast:Using it to stream Netflix Hulu YouTube Music and Google Chrome browser off my Android phone, Nexus Tablet, my laptop. I'm surprised how much I use it even though my console can do that all ready but the chromecast being controlled from my devices is a breeze to use. Can't wait til we get so much more features (like games streaming or mirroring of some sort... Google listening)I feel like buying a few more for more tvs around the house but I can easily move and hook it up to another TV like nothing. So when I can get more it will be for my friends and family birthdays or Christmas presents", "verified": true, "helpfulness": "0/1", "author": "ThaCooLoser \"CooLoserTech\""}, {"rating": 5.0, "review": "Chromecast was simple to set-up. Streams movies and tv shows from netflix perfectly. Also bought and set one up for my friends. Terrific price", "verified": true, "helpfulness": "0/0", "author": "lhop"}, {"rating": 5.0, "review": "Simple to follow concise instructions, easy to use and program. so happy with the first Google chromecast I purchased a second to use on another TV", "verified": true, "helpfulness": "0/0", "author": "David A."}, {"rating": 2.0, "review": "This one is cheap, I thought it would be good to have. I've been bothered the most by the fact that it needs to be plugged into a USB port in order for it to work (or to a power outlet, meaning either an extra cord or less a USB port). The the thing is not that small to sit nicely plugged directly into the HDMI port.I was able to pair it, but I didn't see that much value in it. It feels like an experiment and it doesn't feel like an honestly advertised product.Granted I have different ways to enjoy my media already, so maybe I'm also spoiled. I own Apple products and I have an Apple TV, also the TV is a smart TV with USB ports and media sharing and I also use a PS3 for different media.", "verified": true, "helpfulness": "0/4", "author": "the savvy shopper"}, {"rating": 1.0, "review": "Buy the Roku LT instead. At least that has channels on it. Google is not allowing anyone other than the big names to develop integration with the Chromecast, even though most of the small apps and services want to. The big companies don't want to, and thus you have the problem of no content other than Netflix and Youtube on the Chromecast.", "verified": false, "helpfulness": "1/4", "author": "Rajeev Arora"}, {"rating": 5.0, "review": "I have used the Western Digital, Tivo and Roku for streaming web video in the past.  I bought the Chromecast because...Well why NOT at $35???  I was very surprised to find it is 100% easier and higher performance than any other product I tried.  I plugged it into the back of my TV and a few minutes later was watching Netflix!  I used my iPad Mini to control the selection and with a couple of taps was able to sit back and enjoy the movie.  My wife loves it too!  Great Product.", "verified": true, "helpfulness": "0/0", "author": "Bugs Bower"}, {"rating": 1.0, "review": "I bought this for one reason: To be able to watch German television programs from the Internet (ARD Mediathek) without having to unplug my laptop, bring it over into the next room, hook it up to my TV and adjust the monitor settings all before pressing play. I do not need it for Netflix, etc. - for that, I have a BluRay Player. One impression I was under was that when using a Chromecast, it wasn't transferring content from my phone or computer, but instead directly from the Internet using my device as a \"controller\". This is NOT TRUE for a Chrome tab. This is only true for your Android apps such as YouTube, Netflix, and a handful of others. It does broadcast Chrome tabs directly from your computer and since your computer is both receiving and sending information, the quality is beyond poor since your computer's processor and its wireless capabilities are overextended. Plus, unless your computer's monitor is the same size as your TV, the resolution will be awful. There are really only a few apps out there that it currently works with. If you have a BluRay player, Apple TV, Playstation, Wii, XBox, Roku Box, etc., there is NO REASON to get a Chromecast. It can't do anything those devices can do (and those devices seem to be able to do it better - if I watch a non-widescreen show via Netflix on my BluRay player, it fills up the screen, Chromecast doesn't). Really, unless you're having a YouTube party, it's only good for Netflix. Until many, many more apps incorporate Chromecast into their programming (and will they? who knows...) this device is just pointless.", "verified": true, "helpfulness": "3/6", "author": "Chris"}, {"rating": 3.0, "review": "I did not understand that this device is limited to streaming Netflix and YouTube.  Very limited functionality but works OK.", "verified": true, "helpfulness": "0/0", "author": "Slow Hand Dave \"slow hand\""}]