[{"rating": 4.0, "review": "I bought this primarily to test it out and play around with it. My SmartTV already has YouTube, Netflix, Hulu, etc. so I don't necessarily need this stick for it, but at $30 I could not resist to give it a try.", "verified": true, "helpfulness": "0/0", "author": "TechGeek \"TXcrude\""}, {"rating": 5.0, "review": "I live in Dominican Republic, which is why I limited by region, but I have youtube, netflix, tv viki redbull and everything works great, buy Avia application to play local content ... what I see is that people buy the product and do not know what does. works as advertised and I do not see any problem ... I'm happy with my purchase. hopefully more apps and google some native application for playing local content.", "verified": true, "helpfulness": "0/0", "author": "eltuti"}, {"rating": 4.0, "review": "We use this with our projector at home. The only downside is that there is no enough 3rd party apps to stream any content you like. We use google chrome to stream other videos but you can not stream high quality (> 480p) effectively. My wireless modem is high speed therefore the bottle neck in the network is not the wireless modem for sure.Other than that it works great and it is one of the device that I use most at home.", "verified": true, "helpfulness": "0/0", "author": "Kivanc Kose"}, {"rating": 5.0, "review": "Still waiting on a few apps to be developed, but otherwise this essentially obviates the HTPC. Easy to use, great video quality (provided fast connection) and cheap! Buy them for the whole family!", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "I ordered one for myself and one for a Christmas gift.  I installed mine quickly and it WORKED just like they say it should (doesn't always happen with these things for me).  It's super easy to launch from my ipad or iphone and I am extremely happy with it.  The vendor was good, the shipping was fast, and the product is terrific.", "verified": true, "helpfulness": "0/0", "author": "Janice \"Janice\""}, {"rating": 5.0, "review": "It works as advertised. Only complaint - why does it have to work with the Chrome browser? Guess it's just the nature of capitalism competition without compatible cooperation.", "verified": true, "helpfulness": "0/0", "author": "J. Sun"}, {"rating": 4.0, "review": "I love this and definitely recommend it.Here's the positives:1. Small and takes no space at all2. Easy setup3. Cheap, the least expensive streamer I've seen4. From Google so you know it's not from a fly by night wannabe5. No separate remote needed, just your phone or tablet.I have only one negative.  It  is limited currently with what it will work with, like YouTube  However it does work with your browser if you wanted to cast that to your Tv.However near perfection gives it a thumbs up from me.", "verified": true, "helpfulness": "0/0", "author": "Rich \"Gadget Lover\""}, {"rating": 5.0, "review": "Device works just as advertised and we use it in our bedroom for streaming shows before we go to bed. Can't wait for more applications to become available. Highly recommend buying this device.", "verified": true, "helpfulness": "0/0", "author": "Hendrik Steyn"}, {"rating": 5.0, "review": "I LOVE everything about this leap in technology! Now I'm able to stream Netflix. Thanks for creating this amazing conduit between my PC & TV!", "verified": true, "helpfulness": "0/0", "author": "Douglas Finnell"}, {"rating": 2.0, "review": "You can't stream personal movies on to the screen. When that's enabled I'll give it 5 stars. till then no.", "verified": true, "helpfulness": "0/1", "author": "Jake"}]