[{"rating": 4.0, "review": "Good device for low price.  Needs more app support to be great.  Tab casting (although in beta) is a great concept that can be improved upon.", "verified": true, "helpfulness": "0/0", "author": "SHANE BIGLER"}, {"rating": 4.0, "review": "Basically, it does what Google let's it do.  That's okay.  I ordered it mostly for YouTube and Netflix.  It works GREAT for those two apps.Pandora is a nice plus.  I love walking into my home, and within a minute, connecting to my WiFi and casting Pandora through my sound system.", "verified": true, "helpfulness": "1/1", "author": "Chase and Jill Martin"}, {"rating": 5.0, "review": "Easily one of the best media consumption devices for me - Netflix, Pandora, Google Play Music, YouTube and Hulu Plus!Awesome device!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The product information did not make it clear that this can only be used with compatible (i.e. Google) apps and not to mirror your desktop.  I wanted to be able to look at my photos, stream from Facebook and anything else from my desktop.  So I returned it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It worked for two days with my Samsung Galaxy s3 phone then the video wouldn't play.  The sound worked fine but the video wouldn't show up. I called and did everything they told me to installing and pushing the reset button.  So they sent me another one.  That one didn't work either.  I couldn't even see the ready to cast screen on my tv!  It is cheap for a reason people.  I bought a roku and I am hoping it works better.  All I wanted was to watch Netflix on my big screen tv.", "verified": true, "helpfulness": "0/0", "author": "Michelle A. Lyons"}, {"rating": 5.0, "review": "This is the best $35 I have ever spent. This device is like magic, and I am an IT. In just a few minutes it almost sets itself up. I plugged it into my HDMI port on my TV and not only powered up the TV but started installing itself! Once the software had loaded on my laptop I was ready to stream media. Next I set it up to stream from my smart phone.  One issue I did discover is that after the Chromecast app is loaded on the phone I needed to update my media apps, like Netflix, Youtube, Pandora. I have an Internet TV but it has always had issues streaming from Netflix, but with the Google Chromecast it works all the time.  The \"magic\" in this device is one you start streaming you can use your phone, tablet, computer for other task. I am streaming music right now while composing this review.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer \"Koheleth\""}, {"rating": 1.0, "review": "doesn't work! I wasted a few hours of my life trying to get this to work. No information available. I just wish there as a -5 stars. This is going back.", "verified": true, "helpfulness": "4/11", "author": "never2old"}, {"rating": 5.0, "review": "Assuming you UNDERSTAND WHAT THIS IS AND WHAT IT DOES , this is the best thing since sliced bread . 99% of the complaints here are people who didn't do their homework and now are upset this doesn't do what they want .It's best if you have apps( I've only tested with my Nexus 4 ) that are compatible with Chromecast . Basically your device( phone , tablet , computer ect ) acts as a remote to tell the Chromecast what to play . I don't actually see the point in buying this unless you're using it with Chromecast compatible  apps . It's a cheaper alternative to the Roku or another streaming box . This is what the Chromecast is good at right now . If you try to use it for something else your results will vary .Google is coming out with the official Chromecast SDK in a few weeks , and then since I tinker with Java I might experiment with development , but for the price I'm already content .", "verified": false, "helpfulness": "1/1", "author": "Keith Wilson"}, {"rating": 3.0, "review": "Chromecast is OK, Hopefully it will improve. There are already Many ways to stream Netflix, Hulu and other \"common\" sources. What I wanted was the steam from tab in Chrome with the plug-in. So far this has been a poor performer and not compatible with many sources. Most disappointing is not being able to use it with my Amazon Prime Instant Video account. This is not the final or best answer for those of us who do the majority of our viewing off of computers or devices. If you are using Amazon Instant Video or other TV/Movie sources - stick with a computer and HDMI connection. The \"supported\" venues work well off of laptop, tablet and phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is an excellent device. I can view Netflix on a television anywhere now. And it's very reasonably priced. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Holly"}]