[{"rating": 5.0, "review": "I'm so glad I bought this device. It's so simple to use!! I use it almost daily.", "verified": true, "helpfulness": "0/0", "author": "Nancy Foy"}, {"rating": 5.0, "review": "I was very excited when I received it. However, I was also very disappointed and upset when I had try to instal it at home and Chromecast did not find my WiFi. I had try to check all manuals, browse web, check hardware, restart all devices, but nothing was working. However, when I had try it once again (about one week later), everything was going well as it should be. Fortunately, now I can really enjoy it and it really the best way how to connect your smartphone with TV.", "verified": true, "helpfulness": "0/0", "author": "Martin Weis"}, {"rating": 3.0, "review": "Doesn't work with Fios. Gave it to my nephew and he loves it.", "verified": true, "helpfulness": "0/0", "author": "Charlie from Westchester \"C McDonald\""}, {"rating": 3.0, "review": "Then \"No Chromecasts Found\" message whenever I try to connect.  Their internet support tells me I don't have my wifi on.  But I do have my wifi on.  I have wifi working for everything else.  Tried to run the Chromecast app, but it won't let me unless wifi is on (it IS on).  Followed their other advice.  Chromecast dongle is correctly connected to TV.  TV is correctly connected to router. Router is correctly connected to computer and internet.  All other wifi works -- just not Chromecast.  Their internet help is no help at all. They should provide support in plain English and stop telling us to contact the router manufacturer.  The wifi router works fine with everything else, just not Chromecast. One star.Update:  Finally gave up.  Set up everything -- including the router -- from scratch.  And now Chromecast is working again.  Google needs to provide better troubleshooting help.  For instance, the TV screen told me that there was no wifi available (there actually was), and directed me to run the Chromecast app so I can get wifi going again.  When I ran the Chromecast app, I got a splash screen error message saying there's no wifi.  You can't get past the splash screen and into the app unless wifi is recognized.  Thanks for all your help!2015 Update: Upgrading this to 3 stars because when it works, it's really good.  Would be 5 stars except for the lack of helpful guidance when you're unable to connect.", "verified": true, "helpfulness": "1/2", "author": "Blind Faith 99 \"Blind Faith 99\""}, {"rating": 5.0, "review": "shipped right away, and works great", "verified": true, "helpfulness": "0/0", "author": "Gregg Boyd"}, {"rating": 5.0, "review": "works great and easy to use with my Plex media server app.", "verified": true, "helpfulness": "1/1", "author": "Animal"}, {"rating": 5.0, "review": "when first time i used it, i was like, so i can only mirror screen youtube!!! and threw it in the drawer.recently a friend told me there is an update that it can mirror normal videos, and it did so.", "verified": true, "helpfulness": "0/0", "author": "Yanal S."}, {"rating": 1.0, "review": "froze a bunch of times on mefailed to connect to the network dozens of timesworthless to travel with, most wifi's in hotels require you to click through a connect screen... chromecast is incompatible with all of these networks", "verified": true, "helpfulness": "0/1", "author": "DJ Breslin"}, {"rating": 3.0, "review": "When streaming HBO Go it freezes same with Netflix", "verified": true, "helpfulness": "1/1", "author": "Htom"}, {"rating": 5.0, "review": "Good to have", "verified": true, "helpfulness": "0/0", "author": "Richard Whit-mer \"Richard W\""}]