[{"rating": 5.0, "review": "Love this product. The voice search is awesome", "verified": true, "helpfulness": "0/1", "author": "Kay Green \"Kay at MyPreciousKid\""}, {"rating": 5.0, "review": "really works nice", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Edwin"}, {"rating": 4.0, "review": "It's certainly MUCH faster compared to my much older Apple TV. The best thing is that Amazon has left this \"open\" for third party software installation. I do use PLEX which is day and night better than the ATV version. However, beyond a few non Amazon apps, I quite don't use it very much to rent or buy movies or see other applications beyond that. Voice search is excellent but limited to search amazon library.", "verified": true, "helpfulness": "1/1", "author": "Miguel T"}, {"rating": 5.0, "review": "Much better and more offerings than Netflix and Apple TV combine. The whole family has enjoyed it. The only thing I wish there were more free TV shows available.", "verified": true, "helpfulness": "0/0", "author": "Unknownhhgffvghhgccgh"}, {"rating": 5.0, "review": "LOVE the voice activated search feature! Need to make sure you have a really strong internet signal for this device. I had to purchase a router and now it works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Michele Lynne Marvell \"Michele Lynne Marvell\""}, {"rating": 5.0, "review": "Easy to use, and great content.  Picture quality is great, and the voice search is awesome.  Really great for consuming Amazon Prime content.  Only draw back is that it does not give access to Prime music.  Haven't tried the game features yet, there's so much to watch!", "verified": true, "helpfulness": "1/1", "author": "Allen Chan"}, {"rating": 4.0, "review": "Pros: The accessibility of having certain apps like Netflix and Pandora available without using your computer, makes this device worth the purchase.Cons: No power button. Will run for about an hour unless you unplug the device. This should be apart of the next update, a power down feature.", "verified": true, "helpfulness": "0/0", "author": "Zac Childress"}, {"rating": 5.0, "review": "A streaming devise is a streaming device. We have Roku II, streaming/smart LED TV, Playstation and this is all we use. One of the best features about Amazon Prime is that you get lots of free digital entertainment. Accessing that entertainment can be clunky and hard to navigate. With Fire TV you will find the controls simple and simply perfect. The interface is the gold standard. The apps for fire are easy to access and work just as well.I have not used the voice search that much but mainly because Fire does so well with it's suggestions and navigating the content is easy.Easily the best streaming device I have owned and a must have for any Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "J. Genet"}, {"rating": 4.0, "review": "Great device and interface, needs time for apps and software to catch up.", "verified": true, "helpfulness": "0/0", "author": "Chad"}]