[{"rating": 3.0, "review": "I've had this for a few months now. I bought it as an alternate to my Apple TV for three main reasons:1) I hoped it would stream video better than my Apple TV.2) I wanted to play Pandora with it (since Pandora app is not available on Apple TV).3) I wanted to use Amazon Prime Music on it.It seems on par with Apple TV for streaming video. With Fire TV I have the same intermittent wi-fi problems that I have with my Apple TV, although I was hoping Fire TV would be an improvement over Apple TV in this area. I have a very fast internet connection, so it's possible that I may looking at a network issue with my wi-fi.Fire TV does play Pandora, which is nice. But I've been disappointed by the Prime Music integration with Fire TV. I love using the Prime Music app on my PC, Mac, iPhone, and iPad. It is sublime experience to use the app on those devices. But the Prime Music app on Fire TV is pathetic. Your ability to browse Prime Music playlists, stations, albums and so forth on the Fire TV is really hobbled compared to the excellent functionality that you get when you use the app on other devices. It's ridiculous that on Fire TV which is an Amazon branded device you have a worse user experience than when you use the same service on a non-Amazon branded device.The voice recognition feature was also something I was looking forward to. It works well, but unfortunately the number of Fire TV apps that you can actually use voice recognition on is extremely limited. That kind of defeats the point of having voice recognition which is supposed to be convenience. It's not much more convenient than Apple TV when you still have to manually enter text one letter at a time in most of the apps.Overall, I still prefer my Apple TV to Fire TV when it comes to renting movies. The main reason for this is that the Apple TV has a superior user interface which makes navigation much more convenient and intuitive (I'm also more accustomed to using it). Fire TV has not offered anything significant enough to make me stop using my Apple TV. However, having access to Prime Video is really nice, and this is probably the strongest point of the Fire TV.If Amazon improves the voice recognition of Fire TV to make it available throughout the interface, and also improved the Prime Music app to make it as good as their app on other devices, that would go a long way toward improving the Fire TV experience overall.", "verified": true, "helpfulness": "0/1", "author": "J. Martin"}, {"rating": 1.0, "review": "It may be my setup but so far I haven't been able to get it to work. It won't pick up the wireless signal.", "verified": true, "helpfulness": "0/4", "author": "Brad Stallard"}, {"rating": 4.0, "review": "Amazon Fire TV was recommended to me a friend who works at Staples.  I was skeptical.  I had toyed with the idea of the other similar products on the market; but, decided I didn't need it as I had Netflix streaming.  But, I went ahead and bought Amazon Fire TV.  I joined Amazon Prime to enhance the experience.  I now have used it for about a month.  It has truly exceeded all of my expectations.  I really enjoy it and we use it quite often.  I recommend it without hesitation or reservations.", "verified": true, "helpfulness": "0/0", "author": "Herbina"}, {"rating": 1.0, "review": "Did not stream properly. Kept freezing  up and saying no internet connection. I hooked up my old Roku device to the TV and it worked fine. So I know it isn't the TV. I had the same problem with the stick version od Amazon Fire. I have another Amazon Fire TV device on one of my other TV's, from last year, and it works fine, so I don't know what the problem is with the new devices. Also, I find it annoying that shows I can watch on Netflix for free are charged money on Amazon prime, and these are not new shows. They also tend to have lots of shows that give you the first season free and after they get you hooked, and want to charge you for subsequent seasons. They are also not new shows or recent seasons. So I've decided to stick with my Roku devices for most of my TVs.", "verified": true, "helpfulness": "1/4", "author": "R. Payne \"michigan nana\""}, {"rating": 5.0, "review": "Great!  Any movie at your fingertip.", "verified": true, "helpfulness": "0/0", "author": "Mary Lou Porter"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Sky Lucineo"}, {"rating": 2.0, "review": "it would get a 5 star if there menu for amazon prime would be better, have to scroll through all movies is a waste of time. Not knowing which movies are included and which one's I have to pay for also is a pain.", "verified": true, "helpfulness": "0/2", "author": "Randall Lloy"}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 4.0, "review": "It is hard to put a firm rating on this box. For what it is intended for, it is almost perfect. The remote is great, the system is fast, and watching movies on Amazon Prime or Netflix is typically a great experience, better than items like Chromecast and Roku in my opinion.Cons for stock box: Remote is bluetooth only, so you can't use an IR only unified remote, this is fixed with a Flirc. Plex has issues on the Fire which are well documented, Plex is actively working on a solution but for now it isn't very usable. I have to reboot the Fire TV on a daily basis because Prime and Netflix can't playback media.Cons for those who enjoy tinkering: My biggest gripe is that I cannot plug external media into the box, for playback of local files using Plex or XBMC. The ability to do this would be a great asset for those of us with RVs who travel with no internet access.I think Amazon has a great device, that with a little tweaking and opening up to the user, could be a real winner.", "verified": true, "helpfulness": "0/0", "author": "Tim Harper \"TornadoTJ\""}, {"rating": 5.0, "review": "Very easy to use the only problem i have is everything or mostly everything you have to pay for . Need more free movies .", "verified": true, "helpfulness": "0/0", "author": "Movie buff"}]