[{"rating": 5.0, "review": "I've bought 3 of these things!!! One for each of our TVs. I mainly use them to use the Plex app and connect to my Synology NAS with Plex server on it. I also use it with the Emby app and connect to a friend's emby server. Another useful feature and a MUST HAVE for iOS owners, AIRPLAY (with mirroring also). The app I really love for the airplay functionality is \"AirPlay/DLNA Receiver (PRO)\"!!! This unit is powerful and versatile. I can even use the plex (on my local network) and airplay without internet, you just need to make sure you don't have a PIN enables in the fireTV, otherwise you can't access a damn thing because the fireTV tried to verify your pin with amazon's servers on the internet (good but bad IMHO). Sorry for the poor grammar/structure of this review, but I have several reviews to leave and I'm multi-tasking. Have a good day.", "verified": true, "helpfulness": "1/2", "author": "B3I2G1"}, {"rating": 3.0, "review": "I've had my fire just over a year. We have it downstairs on our main tv and it's wonderful. Really makes it easy to watch things from our watchlist or on other apps. We have two issues:1. It's limited in its suggestions and features. On the app or website - you watch a movie or add it to your watchlist and it will give you similar suggestions, not so much on Fire.2. Our remote went out - at 13 months - and Amazon wants to charge us 30$ to replace it as it's 1 month past warranty. We went through all the steps to get it back - it literally just died. Usually we have great experiences with Amazon but as I read the comments outside of amazon.com - this happens often enough to be a topic of conversation. It's unfortunate. We'll stick to using our iphone app and make it work bc no way are we paying to get a remote replaced so soon. It absolutely should work more than a year.", "verified": true, "helpfulness": "1/4", "author": "Kathy Horner"}, {"rating": 3.0, "review": "Husband wanted the Amazon Fire stick.  Nothing wrong with the TV", "verified": true, "helpfulness": "0/7", "author": "a"}, {"rating": 5.0, "review": "Love amazon t.v and with prime is even better", "verified": true, "helpfulness": "0/1", "author": "lilia mendoza"}, {"rating": 5.0, "review": "I installed this and took the Roku 3 previously installed to our cottage.  So far we are loving it.  The only criticism I would make is that theyshould clean up the home page.  Its pretty cluttered.", "verified": true, "helpfulness": "0/2", "author": "T. Burnham"}, {"rating": 5.0, "review": "This will be so much fun....  It was my Christmas present to myself cause I was a good person this last year...", "verified": true, "helpfulness": "0/1", "author": "Linda"}, {"rating": 1.0, "review": "The remote stopped working very shortly after purchase rendering the Fire TV unusable.  Battery replacement did not help.", "verified": true, "helpfulness": "1/7", "author": "Kelly Molnar"}, {"rating": 5.0, "review": "Really fine small system for dialing in your digital viewing. Works like a charm.", "verified": true, "helpfulness": "1/2", "author": "P. Rose \"IsZatSo\""}, {"rating": 5.0, "review": "Absolutely love the Fire TV, much more energy sufficient than using a gaming system to run Netflix or any other service. Also enjoy playing the games with the Amazon controller, even sideloaded Playstation and Nintendo 64 emulators and can play those games just fine.", "verified": true, "helpfulness": "1/2", "author": "SC36DC"}, {"rating": 1.0, "review": "I bought this item to watch Slingtv.  I have never been so frustrated in my life.  I could not get the app. To work. Called Sling, they told me to call Amazon that it was a programming issue on Amazons end. Called Amazon and they told me programming issue on their end and would call me back tomorrow.  Called and again and was told it was slingtv’s fault. Finally got to a supervisor after Mell tried to pass himself off as a supervisor and Josh was not much help either spoke with four individuals at Amazon and got a different answer from each.  Thinking about cancelling prime membership and not dealing with this company after this experience.  Waste of two hours of my time. Cancelled slingtv and sending back the Amazon Fire Tv, so much for the free 14 day period.  I hope others have better luck.", "verified": true, "helpfulness": "7/11", "author": "ARC"}]