[{"rating": 3.0, "review": "Works fine with our son's help.  There should be an easier way to push from laptop or tablet to the screen.  However, need better directions to use.  It lies unused until the son comes home for vacation.", "verified": true, "helpfulness": "0/0", "author": "Andy Rowen"}, {"rating": 5.0, "review": "Love it best thing I bought all year", "verified": false, "helpfulness": "0/0", "author": "brian estell"}, {"rating": 5.0, "review": "Loving it", "verified": true, "helpfulness": "0/0", "author": "Rubie Casupang"}, {"rating": 5.0, "review": "It works great. Used it with my laptop and iPhone 5.", "verified": true, "helpfulness": "0/0", "author": "Edgardo Montes"}, {"rating": 5.0, "review": "I love my Google Chromecast. I had the first one from Google store when they first release it and I ordered the second one from Amazon. It work flawlessly. I love that I can screen cast from my chrome browser, my tablet and my phone. I also love the different wall photos that shows up. Great product Google!!!!", "verified": true, "helpfulness": "0/0", "author": "montalban"}, {"rating": 5.0, "review": "Great product fast shipping !", "verified": true, "helpfulness": "0/0", "author": "luis"}, {"rating": 5.0, "review": "Changes everything. One wonders how he or she survived without it.", "verified": false, "helpfulness": "0/0", "author": "P. Nathanael Gough"}, {"rating": 5.0, "review": "Love the chromecast although we don't use it as much as we thought we would....only for Web only hulu shows.", "verified": true, "helpfulness": "0/0", "author": "Aimee"}, {"rating": 5.0, "review": "Outstanding little piece of hardware. Worth the money just for HBO go. Video quality is much better than the old laptop I was using. Also frequently use it for You Tube and Pandora. With a cheap HDMI to VGA connector, it hooks up to our projector no problems.", "verified": true, "helpfulness": "0/0", "author": "Cadnr"}, {"rating": 5.0, "review": "Quick delivery. Set up couldn't have been any easier.", "verified": true, "helpfulness": "0/0", "author": "WBrauck"}]