[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great, smooth interface.  I like the screensaver as well.  Also how intuitive the next episode section works as well.  It allows you to jump to the next episode right after the end of the one you are watching without having to go out to the main screen.  Once the system recognized my account all my music playlists transferred right on.  Very pleased I must say and this is coming from a Roku owner for the last 8 years.", "verified": true, "helpfulness": "0/0", "author": "General Maximus \"Gizmo\""}, {"rating": 5.0, "review": "Works as expected. Kids liked the fact the gaming controller was just like the XBox one.", "verified": true, "helpfulness": "0/1", "author": "Rebecca Trelfa \"severXance\""}, {"rating": 5.0, "review": "I wrote a lengthy positive review and got disconnected. Here's the short form:  We love our Fire TV, had our cable service disconnected and wish we'd done this earlier.  Easy to hook up, works flawlessly, looks good (you hardly see the components, they're sleek and small).", "verified": true, "helpfulness": "0/1", "author": "E.M.B."}, {"rating": 1.0, "review": "I bought this item for my brother as a gift who is in Kenya. Unfortunately he cannot access any movies or TV shows. What's the purpose of the product if you can't use it internationally. I would like one of the amazon representatives to contact me to resolve this issue. Thank you.", "verified": true, "helpfulness": "1/9", "author": "Jwk"}, {"rating": 4.0, "review": "works very well", "verified": true, "helpfulness": "0/1", "author": "David M. Divers"}, {"rating": 5.0, "review": "Have only begun to explore the Fire TV. Like what I have checked out so far.", "verified": true, "helpfulness": "0/1", "author": "Pats"}, {"rating": 3.0, "review": "We purchased Fire TV to use with our Slingbox.  The controls provided by Fire TV for Slingbox are extremely slow and inadequate.  When you have the HD channel you want to watch, it's great!  But getting to the channel is very slow and problematic.  Don't even attempt to use the TV guide, the latency from just moving the cursor up/down is so slow, it's unbearable.  Best to use an alternative device to find the channel you want to watch and then enter the channel number in Fire-TV.  The controls provided for use with Amazon Prime are great, no problems and very quick.  The voice command provided with the remote are wonderful.  I can only hope they improve upon the SlingBox player controls. :)", "verified": true, "helpfulness": "0/1", "author": "Frederick J. Montgomery"}, {"rating": 3.0, "review": "The  hardware is great!  Good quality.  The software is not very user friendly and a bit frustrating.  If they got the UI interface to flow better it would make this thing dominating.  It combines all your accounts but when you do a search it only searches on Amazon and not other shows so if its not free on amazon it charges you so you have to go to a separate app to play it.  If you play a series, it stops and you have to go back to search and find it and play the next series instead if it knowing to either load the next series.", "verified": true, "helpfulness": "0/1", "author": "HT"}, {"rating": 3.0, "review": "I actually like the many features of the Fire TV, but there is ONE MAJOR fault that they fail to alert you to...and AMAZON KNOWS this fault exists!!!!If you are on a satellite system for your internet service...you are most likely on just enough of a band-width to qualify for the term \"high-speed internet\". However, you will NEVER HAVE ENOUGH of that high speed action to make the Fire TV Box or Stick work properly. They both \"stream\" their programming and if you are on satellite, it is not generally powerful enough to \"buffer\" and \"stream\" your movies and TV programs. What you wind up having is constant starting and stopping with long pauses in between!!! WHAT A BOTHERSOME CHORE, A WASTE OF TIME AND MONEY, and A TOTAL FRUSTRATION ALL AROUND!!!!!!!!Check with you satellite internet service before purchasing the Amazon Fire TV Stick or Box system, and they should be able to inform you whether they will work adequately with your internet service!!! Don't buy the Fire TV system first, as I did!!! What a disappointment and waste of time and money!!!!!", "verified": true, "helpfulness": "2/4", "author": "ERIC T. \"ETMAGIC\""}]