[{"rating": 5.0, "review": "I just got of the phone with Comcast. My 161 dollar cable bill is no more. I have Amazon Prime and Hulu Plus and Netflix at a cost of less than $25 per month. I could not be happier with the fire. It was so easy to install and it is fast. Just make sure your internet access is adequate. This is the cable killer. For those who dont know HULU Plus (6.99 Month) has all the local programs like castle, the voice, blacklist etc... Netflix for TV and movies and amazon prime for movies and tv. I just order a HDTV Digital Antenna for local news and then I am set.", "verified": true, "helpfulness": "5/5", "author": "Robert Logue \"rlogue\""}, {"rating": 5.0, "review": "Been using it for more than a month now and I can't be happier with it...it's small but powerful and has better interface that using the Wii or Xbox 360 for streaming...the price is right and it really delivers...just amazing!", "verified": true, "helpfulness": "2/2", "author": "Alvaro Tejada Galindo"}, {"rating": 5.0, "review": "I also have a connected Sony TV, Roku, and Apple TV. I like the Fire TV best for its menu and guide but it still needs some additional apps like HBO Go.", "verified": true, "helpfulness": "2/2", "author": "mindrockmedia"}, {"rating": 1.0, "review": "Turned on and there are hundreds of blue lines across screen flickering.  The fact they loaded my Amazon profile they sure didn't have any quality check for DOA. Glad I bought Roku3 at same time.  I know which I'll be keeping.", "verified": true, "helpfulness": "1/14", "author": "cBunge"}, {"rating": 3.0, "review": "Works great and is very fast but you cannot mirror your iPhone or iPad to the device like you can with AppleTV. They really need to fix this!", "verified": true, "helpfulness": "2/6", "author": "Thomas Leonard"}, {"rating": 5.0, "review": "This was easy to hook up and does exactly what they said it would. Works good with my Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "kathy o"}, {"rating": 5.0, "review": "I love that the Fire is so easy to install and is intuitive. We already had streaming netflix but had to watch it through our Wii player. That was a real pain and the Wii remote wasn't really very effective when trying to search for and select shows to watch. Next we tried hooking up an HDMI cord to our laptop but that was awkward as well. The 6 foot cord stretched to the laptop and people had to pay attention not to trip over it when we were watching a film. The Amazon fire has solved all of our home entertainment dilemma's", "verified": true, "helpfulness": "0/0", "author": "Groovy Grandma"}, {"rating": 1.0, "review": "just a knock off of the apple tv and the roku, apple is a more popular/common/more user friendly brand. its a no", "verified": false, "helpfulness": "3/35", "author": "az"}, {"rating": 5.0, "review": "The Amazon Fire TV is perfect for my husband.  He wanted something that he could hook up to our TV so that he could watch movies whenever he wanted.  His only complaint has been that there is no power button on it.  He has to wait for it to shut off on its own.", "verified": true, "helpfulness": "1/1", "author": "Wonda Frahm"}, {"rating": 5.0, "review": "Our eight year old grandson picked up the controller for the Fire and had one or two free games loaded in about 3 minutes. After an hour he told us he was at level 5 on the game and he  loved his present. By now he has no doubly learned there are movies available too.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}]