[{"rating": 5.0, "review": "I have two of these now.  So much better than dropping $100 on something.  My phone, tablet, or PC can be used as the control.  Streams Netflix, Pandora, Watch ESPN  and others (hoping for Amazon to jump on soon).  Also, you can download games to play.  Spent more than a few nights with friends or family over playing The Big Web Quiz or Cards Against Humanity on the big screen TV because of this baby.", "verified": true, "helpfulness": "0/0", "author": "revdaniel.ross622"}, {"rating": 4.0, "review": "I love it, but I hear about better products for similar prices all the time...", "verified": true, "helpfulness": "0/0", "author": "Dallin!!"}, {"rating": 5.0, "review": "What was I doing with my life before chromecast?? Probably not enjoying videos online at easy. I love you chromecast.", "verified": true, "helpfulness": "0/0", "author": "niki"}, {"rating": 5.0, "review": "Loving it so far. Looking for more ways to get regular programming on it.", "verified": true, "helpfulness": "0/0", "author": "D. Brown"}, {"rating": 5.0, "review": "Love this product and having the ability to to watch whatever I want, whenever I want!", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "Amazing product, does exactly what it says, great addition to the living room. Does most of what Apple TV can do for one third of the price.", "verified": true, "helpfulness": "0/0", "author": "Seth Graham"}, {"rating": 3.0, "review": "The range of this device is only good if you have a direct line-of-sight from your computer to your TV. Even then, it's 30 feet at best. Good be a lot better!", "verified": true, "helpfulness": "0/0", "author": "Abbie Buchin"}, {"rating": 5.0, "review": "Very cool", "verified": true, "helpfulness": "0/0", "author": "Brandon \"Brandon\""}, {"rating": 5.0, "review": "Works nicely.  I own two.  I just wish it supported more apps.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "I love the google product. It functions well and is extremely useful for streaming on my TV's. My 2 TV's don't allow me to add apps, so I can only use their pre-loaded apps.My biggest complaint (and the reason this almost lost a star) is no one explains that all apps/websites need to be designed to work with ChromeCast (their are workarounds on a laptop). The only issue I've found is Amazon refuses to design the Amazon Instant App to work with ChromeCast (obviously in favor their product). So my biggest complaint with the Google product is Amazon.", "verified": true, "helpfulness": "0/0", "author": "Mike F."}]