[{"rating": 5.0, "review": "I got this one as a gift for my father in law, this thing is just awesome, I have one on each tv that I have at home.Keep up the good work Google!", "verified": true, "helpfulness": "0/0", "author": "Elias Sierra"}, {"rating": 1.0, "review": "Its not what Google advertises,  it locks up, screen freezes and the it will not reboot a lot of the time.( This is on every Wi-Fi Router I've used it on, not just mine)..Worked great for 2 movies then PTHHHHHHHHH!They know nothing about the product, and send you a sheet generated response try and belittle you even more.. DON'T BUY THIS!!!", "verified": true, "helpfulness": "0/2", "author": "Tim Schmidt"}, {"rating": 3.0, "review": "The unit is very in expensive however,  I have an Apple iPad and cannot download the android apps, Google has not developed any apps for the unit so it very limited compared to my Roku &Apple; TV", "verified": true, "helpfulness": "0/1", "author": "GEOLEO"}, {"rating": 4.0, "review": "Works fine,  only sometimes the sound disappears when watching Netflix (could be a Netflix issue-logging out and in again solves the problem)", "verified": true, "helpfulness": "0/0", "author": "jochem albada jelgersma"}, {"rating": 5.0, "review": "I had gone to Chromecast.com and watched the video before purchase.  The installation went just as promised and the performance was perfect from the start.  We just plugged it into our hdml1 port (moved the TV imput to hdml2) and we were ready.  Now we just switch TV imput from hdml2 to hdml1, open Netflix (or amazon prime,etc) and chose from movies to TV shows to stream.  Perfect!", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "It is a very good product, It works good you can show all you do in google chrome browser even cuevana movies", "verified": true, "helpfulness": "0/1", "author": "Fido"}, {"rating": 4.0, "review": "Have had the Chromecast for about a month now. It functions well in both of my tv's, one being 720p and the other 1080p. Videos are crisp and play as expected from Netflix and Youtube. Music works well with Pandora and the Google Music app.The downfall of the player is it doesn't directly support playing movies from your pc, phone, etc. Not a huge issue, but a downfall none the less. You can use other software like BubbleUPnp, Plex, or Twonky Beam to partially work around this, but so far I find them to be kinda cludgy.All in all I bought this to stream Netflix in the bedroom cheaply. I have noticed that my phone seems to get disconnected from the player if the screen has been turned off for a while. My phones wifi is set to stay on and not go to sleep when the screen is off, so I'm not sure what the issue is. The downfall of this is that if you are watching a movie or listening to music you will have to either wait for them to sync back up, or reload the app and reconnect. Also the issue affects the music player, when it gets drops the connection, the chromecast does not continue to play the playlist on Google Music.", "verified": true, "helpfulness": "0/0", "author": "Chein"}, {"rating": 4.0, "review": "Google Chromecast does what it is advertised to do. Stream videos that I find on Google Chrome. I am not used to using Google Chrome so that is taking a bit of practice. Also even though I have my laptop next to my router, the reception disconnects every once in a while. I have to stay close to the computer to keep the transmission going.", "verified": true, "helpfulness": "0/0", "author": "Felicia Wolf"}, {"rating": 3.0, "review": "Didn't get the \"See everything you can get on the web\" as promised, but my hubby appreciates the TWO channels we do get . Would I have purchase this again ?  NO. Not until they get their acts together and deliver \"everything you see on the web\" as advertised. But, my hubby loves it. Go figure ??  We do get youtube and one other thing I can't even remember cause I stopped watching.", "verified": true, "helpfulness": "0/1", "author": "J. Szwed"}, {"rating": 4.0, "review": "After much experimentation I got chromecast to work well with my android tablet. The limitation with android is that many websites don't support it yet. But where it does work it works well. I had my first success casting with the netflix app, and then the youtube app, I found the chromecast app let's you reboot, and connect your chromecast device to your wifi. I also found the ezcast app to cast web pages. But as I said before only certain web pages will let you run videos with android on their site. With windows I was able to access, and run videos on many popular websites, but the videos were choppy, and out of sync, which made them pretty unpleasant to watch. As long as what your casting on the web is only stills you're ok with windows. This may be due to my processor only being near equivalent to a 2nd generation intel. Or it may be due to a slower wifi connection. I'm going to beef up the memory on my laptop, and I'm going to get a faster router. There's also the possibility that I just needed to play more with my router settings. I'm not a technical expert, but I'm guessing that the reason android works so well, is that it just sets up the casting connection, and then let's your wifi do the work. Windows on the other hand stays connected, and interferes with the wifi.", "verified": true, "helpfulness": "0/0", "author": "cwf111"}]