[{"rating": 5.0, "review": "What can I say. Works as described.", "verified": true, "helpfulness": "0/0", "author": "mbabich"}, {"rating": 2.0, "review": "Seems to be running very hot so I unplug it when I am not using it.  It is a pain to use a I must have a android device to use as a remote control like a phone or tablet. Good quality device and picture.  Roku is a better way to go as it has a remote that is easier to use. Now the Chromecast is back in it's box not being used.", "verified": true, "helpfulness": "1/1", "author": "R. Vest"}, {"rating": 4.0, "review": "There is no much to say about it. I'd love to have more apps working on it but with Google Music Play, Netflix and Youtube I'm quite satisfied. If you live in the US I think that got to be even better with Hulu, NFL, HBO, etc.I'd Recommend to always use the HDMI adapter since it gets very hot and this helps dispels heat. I'd like to have an audio out feature instead of having to buy a different 35 bucks adapter to get audio through my Bose system, but for 35 dlls it's ok.", "verified": true, "helpfulness": "0/0", "author": "danielwing"}, {"rating": 4.0, "review": "We recently made the move to drop our cable service & it's high prices to start streaming instead. The Chromecast is awesome, and super easy to use. We'd like to see more adoption into supporting other video apps (Amazon Prime),  but have nothing but good things to say about it!", "verified": true, "helpfulness": "0/0", "author": "MCSzymanski"}, {"rating": 4.0, "review": "It works well, but doesn't stream many things unless used via the Chrome Browser, and it is a bit fussy about content. It is nice and clear to use however and proved to be easier than a HDMI or other cords , plus it is wireless. You will need to download and install some drivers and stuff at first to use it.", "verified": true, "helpfulness": "0/0", "author": "KKhirfan \"100% honestly reviewed with no prior bais or judgement.\""}, {"rating": 5.0, "review": "Works great, love it. Google more apps please!!!!!1", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Its a great little device, but still after more than one year of release, there isent a big number of supporting apps. Also I found roku to have better video playback quality than chromecast", "verified": true, "helpfulness": "0/0", "author": "pratap"}, {"rating": 5.0, "review": "Best tv thing I've ever gotten, super easy to work and install.", "verified": true, "helpfulness": "0/0", "author": "Maya benes"}, {"rating": 4.0, "review": "Great for streaming videos from cellphone directly to the big screen television", "verified": true, "helpfulness": "0/0", "author": "D Scott"}, {"rating": 3.0, "review": "Works fine with our son's help.  There should be an easier way to push from laptop or tablet to the screen.  However, need better directions to use.  It lies unused until the son comes home for vacation.", "verified": true, "helpfulness": "0/0", "author": "Andy Rowen"}]