[{"rating": 5.0, "review": "This little box does what it promises, and does so elegantly. Love the voice search...it actually works, every time. Which is more than I can say for the voice recognition system in my car, which routinely calls people I don't want to talk to. It would be great to be able to browse PRIME content, instead of simply \"recently added\" PRIME content. And while I'm complaining, I wonder how much less they could have charged for this thing if they hadn't spent the equivalent of the national defense budget on packaging. I mean, seriously...should it take 15 minutes to free a product from its cardboard and cellophane prison...especially when it only takes seconds to hook up and use? I'm sure, somewhere, a designer is winning awards for it. It'd look great in an awards annual. But it's really irritating, when all you want to do is use it (and throw the packaging away). And to complain further, I feel like I was driven to purchase this like cattle is driven through a chute. First, I subscribed to PRIME. Then, they give me all the content. But I can't watch the content in HD on anything but my computer screen. Then they sold me the piece-of-crap Chromecast device, which failed after a few months. And suddenly my choices were narrowed to Fire, Apple, and Roku. Of course, neither Apple or Roku will play my Prime content (which I'd already paid for with my subscription), so...ah, well. And still...still...I give it five stars. It's that good. Go figure.", "verified": true, "helpfulness": "2/2", "author": "Another Customer"}, {"rating": 5.0, "review": "Of foremost to me is the ability of a device to accurately understand what you actually say to the device. Of all the Voice Activated Devices that I have had, It appears that only Google was able to accurately understand ME!  So I was totally Blown Away when the FireTV was able to accurately understand me and get everything Right! I had a Vizio Streaming Device, and a Roku already. The Vizio Remote IS very chic, looks Great. But to use it for directional control required me to Look at the Device. A Good Remote you don't have to look at it, you use it. No comparison, the FireTV Remote I think I looked at it for the first two or three actions, and then IT was just like using my finger to do things, Easy!  Great Device.  Even the finger controls are well placed, but I think they should have a different Tactile Feel to easily feel the difference. I have purchased the Vizio only about two weeks before I saw Gary Busie, and decided the Vizio should go back from whence it came, and the FIRETV IS THE BOSS!  I also love the physical size of the Receiver, it sits neatly under my screen, totally unobtrusive to your decor or equipment.  Beautiful, love it. To be brutally honest, putting the system was so easy that the only problem I encountered was trying to put the back cover on after inserting the batteries. I took a long time to figure out Where Tab A goes into Slot B, All Black!  All and All, the easiest setup for anything that I can remember and I'm kinda a Techno Freak sorta. Your Engineers and the others components of that team HIT a GRAND SLAM to me. Please ask Vendor support, NETFLIX, et al, to program their properties to accept Voice Commands. And the BEST Part, YOUR TECH SUPPORT IS FABULOUS! And Fast! The Fellow was extremely well versed in his product, he was able to easily explain things to me, not knowing I'm a Electronic Engineer.  He was more than helpful for my initial question, but went further to explain even more features of FIRETV! Never have I ever called TS and leave a message and GET a Call in 5 minutes!! Are you serious! Best I've ever seen. That is the reason overall I go to Amazon for it seems anything. I bought my grass seed from Amazon cause the same was cheaper than Lowe's or Home Depot. I love Amazon and it's products and support!!!", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 5.0, "review": "bought it on Amazons promotion of 5 payments for $19.99...hooked up to bedroom TV, its summer so not really watching TV now...but come winter!", "verified": true, "helpfulness": "0/0", "author": "ktmk36"}, {"rating": 2.0, "review": "What a big let down this was.  I've been an Amazon Prime customer for years and truly enjoyed all there services and features.  I got sucked in by Gary and his pants!  I honestly thought this would be great, after all it is Amazon.  $99 for this!  I wouldn't pay $9 for something like this.Amazon Fire TV is a huge disappointment.  ROKU has this beat by leaps and bounds!  Fire does not have near the features that ROKU provides.  Example: The Netflix app took 10 minutes to down load and my internet connection is not to blame, I have 20Mbps capability!  Blockbuster? M-Go? Hulu? HBO Go?  Don't bother, you won't find them!  And if they are there, I don't need to spend the day on the phone with \"Ken\" trying to explain to me in broken English how I need to be standing on the couch, with my left hand holding the ceiling fan with my big toe stuck in the light socket, while I scream into this little black box!If you have ROKU - stay with it you won't be disappointed and you won't be $99 poorer!  If Amazon Fire is your first experience with this type of media, there is something much better.  Unless you truly need the \"voice search\" feature.I'm sorry Amazon - you missed the boat on this one.  I didn't even complain when you raised your Prime Rate.  I've never had anything bad to say about Amazon until now.", "verified": true, "helpfulness": "4/7", "author": "Jeffrey A. Monroe"}, {"rating": 5.0, "review": "Awesome! I love it!", "verified": true, "helpfulness": "1/1", "author": "Victor Sandoval"}, {"rating": 5.0, "review": "This little gadget has solved a lot of my frustrations with trying to watch my favorites.", "verified": true, "helpfulness": "1/1", "author": "Rayann W. \"Rayann\""}, {"rating": 5.0, "review": "Fabulous!!!!!! Clear picture...wonderful audio...only concerned with the unit gets a little too warm for mu taste. I want to turn it off..or should I say I want an off and on button. Everyone should purchase one. However I continue to explore the possibilities of it. may follow up review later.", "verified": true, "helpfulness": "2/2", "author": "Esterlene W."}, {"rating": 5.0, "review": "This is a great product. It comes just about ready to use. I cannot imagine a simpler way to have internet content delivered to your TV. I have not tried any games on it yet, but will soon. The clarity of the programming is excellent and I've had NO issues at all with any lag or buffering as I have had when using Prime video through a computer. It is very simple to use and to find the programming I'm looking to find. If you are looking to turn your tv into a smart tv, look no further. I could not be happier with this product.", "verified": true, "helpfulness": "1/1", "author": "GB Steve"}, {"rating": 3.0, "review": "I like the amazon fire TV but the way the screen is setup needs to be more user friendly.  Other than that I like it.  I love the voice command feature which sometime I forget it is there.  Amazon keep up the good work and I will be looking for some change to the amazon fire TV screen setup.", "verified": true, "helpfulness": "0/0", "author": "Cheryl J."}, {"rating": 1.0, "review": "does not show prime  customer service is horrible", "verified": true, "helpfulness": "2/12", "author": "ryan"}]