[{"rating": 4.0, "review": "I'm still getting familiar on how to use this technology but this has been a great device!Its only uses so far has been allowing me to watch Netflix and You Tube videos on mylittle 24\" LCD TV in the bedroom  by casting from my Nexus 7 tablet but I'm learning. Iwill buy two more to do the same on other TV's around the house.", "verified": true, "helpfulness": "0/0", "author": "Winifred Barina"}, {"rating": 5.0, "review": "I highly recommend this product for TVs not having the standard Netflix, U-Tube, etc. built-in apps. The Chromecast component was easy and quick to activate and was great to not have to plug in my computer to the TV.  No issues with this device at all", "verified": true, "helpfulness": "0/0", "author": "Ronald Kaufman"}, {"rating": 2.0, "review": "HelloThe device sync only with YouTube and also not on high quality, the rest even cant sync.  . I wouldn't recommend to buy it although its a cheaper device .", "verified": true, "helpfulness": "0/0", "author": "Raz Bear"}, {"rating": 5.0, "review": "Very easy to setup and use. Can be controlled from an iPad, Android phone, or chrome book. My favorite is chrome book because I can stream Amazon from my prime account. All you need is a wireless router with a decent Internet Provider like a cable company.", "verified": true, "helpfulness": "0/0", "author": "garyedavidson"}, {"rating": 5.0, "review": "Goodbye Comcast!!! I bought this last month and will be buying another in the next few days.  Dont need cable anymore!!", "verified": true, "helpfulness": "0/0", "author": "Lyndaw44"}, {"rating": 5.0, "review": "I'm quite literally addicted to YouTube and it's amazing that I can watch it on my TV in 1080p. That's pretty much the only reason I got it and it is flawless with a good wifi connection.", "verified": true, "helpfulness": "1/1", "author": "Tamaralynn Shute"}, {"rating": 5.0, "review": "In my experience for a month, this has been excellent.  At $30 to $35, this thing is too good and too cheap to not have.  Its simple and does only one thing:  it enables Chrome apps to transmit a tab or video to a HDMI-equipped TV.  I've run YouTube, Netflix, and broadcasting Chrome tabs to the TV without problems.  ChromeCast works from Chrome browsers on Mac, Windows, and iOS tablets and phones.  (It works from Android of course, but I didn't have an Android device to test it personally.)  Video quality is similar to a good smartphone, but seems to have a lower resolution and color depth than an AppleTV.  Frame rate for video is smooth, but video is slightly solarized (/looks like/ 65535 (16-bit) color where the Apple TV looks like 16 million (24-bit) color).It's great.  It's $30 to $35.  Buy it.", "verified": true, "helpfulness": "0/0", "author": "Edward W. Smith \"esmith512\""}, {"rating": 3.0, "review": "When connecting to youtube with my iphone5, the results are great.  Trying to connect with Windows 8 wasn't so simple for me as well as for many others who responded to the FAQs for NetFlix or Hulu.  Still working on the latter.  Worth the price, though.", "verified": true, "helpfulness": "0/0", "author": "metmart"}, {"rating": 2.0, "review": "Maybe it will be better when you can use it to cast personal stuff like photos. For now, we don't have much use for it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This started up and worked fairly easily the first two times and then NOTHING!!!!  I tried re-installing it twice and it was choppy and dropped off.  Don't buy it or any Google OS products until they get their act together.  I also have a chromebook and there aren't ANY tech people to help over the phone or via e-mail/web if you have a problem.", "verified": true, "helpfulness": "0/0", "author": "heather higgins"}]