[{"rating": 5.0, "review": "I bought the chromecase device a couple of months ago after returning another Miracast device. The device is amazing. Here is what i like about it1. Price: It is the lowest price in the market2. Setup: The setup is extremely easy and it is straightforward3. functionality: When you try to stream a video from Youtube or Netflix, it does not just stream your browser screen, instead there is an app on the device that will connect directly to the service and stream the video. What this enables me to do is to leverage my computer to search (better than any smart tv app) and then turn my computer off once i start the streaming4. Idle state: The chrmoecast will act as a screen saver with very nice nature picture. Sometime i feel like leaving my TV on all the time :)", "verified": true, "helpfulness": "2/3", "author": "Tamer Farag"}, {"rating": 1.0, "review": "spent about 4 hours trying to set it up. no dice. no human to talk with to try to get it to work. Possibly would work with a new tv, new router, although both say supported. basically garbage for me.", "verified": true, "helpfulness": "0/1", "author": "Danny Avram Bennett \"soggydan\""}, {"rating": 5.0, "review": "There are no words.  Google knocked it out of the park with this one.  Glitchy sometimes but I get over that quickly because of the awesome-ness", "verified": true, "helpfulness": "0/0", "author": "David Michael Boda"}, {"rating": 4.0, "review": "Instructions fairly easy to follow.  Set up was not very complicated.  Will enjoy watching my TV shows and movies at my own time line.", "verified": true, "helpfulness": "0/0", "author": "Sandra W. Stallings"}, {"rating": 5.0, "review": "Easy set up and it's just a great product!!! Highly recommend this product and what makes it more appealing is that it's a great price.", "verified": true, "helpfulness": "0/1", "author": "Pari"}, {"rating": 4.0, "review": "Once/If Amazon Prime makes a app for the Chromecast, this will be the ultimate add on to your TV. Until then, you may be better off using a different streaming device if you want your Amazon Prime Instant Video. The only way to get prime to stream to your Chromecast is with your laptop or PC. Netflix, Youtube, and others stream just fine though. Would recommend to anyone who doesn't use Amazon Prime Video", "verified": true, "helpfulness": "0/0", "author": "Grizzle"}, {"rating": 1.0, "review": "I ordered that item not knowing you had to pay monthly fee of 35.00 a month to use it I should have returned it I have no intention of using it. Harry", "verified": true, "helpfulness": "0/5", "author": "harry e moore"}, {"rating": 1.0, "review": "I am going to return it is not working,  I am not happy with this product. I do not recommend  any one to but it.", "verified": true, "helpfulness": "0/1", "author": "Radouane"}, {"rating": 5.0, "review": "I use the chromecast downstairs and like it so much I bought one more for bedroom upstairs.  That should show that I  really like this product.", "verified": true, "helpfulness": "0/0", "author": "lawrence garver"}, {"rating": 5.0, "review": "Such a great experience out of such a small and affordable package. The streaming is flawless, and the amount of apps compatible with it grow weekly. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Rodney Guy"}]