[{"rating": 5.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "Gene Emerick"}, {"rating": 1.0, "review": "Pice of sh*t, worked perfect ADN suddenly netflix stopped casting", "verified": true, "helpfulness": "0/0", "author": "juan diego hoyos"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Rafael"}, {"rating": 5.0, "review": "THIS THING IS AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "Jamie hamaker"}, {"rating": 5.0, "review": "awesome product", "verified": true, "helpfulness": "0/0", "author": "Ivan noboa"}, {"rating": 5.0, "review": "I love this, it works very well, great with both I Phone, a computer, Android phones and tablets, easy to set up and runs over and over again.", "verified": true, "helpfulness": "0/0", "author": "R Peterson"}, {"rating": 5.0, "review": "I bought this for my retired parents so they can watch movies they find on YouTube on a bigger TV screen. Needless to say, they are very satisfied. I also have one of these, which I purchased when they initially hit the market. It has some bugs and needs to be occasionally restarted, but it is still a very convenient device and I cannot imagine my life without it.", "verified": true, "helpfulness": "0/0", "author": "Perfectionista"}, {"rating": 5.0, "review": "I love chromecast. I bought this one for a friend so that I can play pandora at his place off my phone. He finally appreciates it. It's a greeeeat invention. I just wish I could play my amazon stuff and cast it as well.", "verified": true, "helpfulness": "0/0", "author": "atcgene"}, {"rating": 2.0, "review": "Without subscriptions, on my iPad I can personally use this for Crackle, YouTube, and an unknown iOS app called Photo Cast.  I use those apps VERY rarely.  Apparently Google has decided not to provide a Chrome tab extension for iOS.  So, can't do the browser tab thing.  I'd LOVE to use it with VLC to play my video library.  Or have an internal player on the dongle that could connect to a uPnP or other server, where I could do the same.  Since the function isn't integrated into iOS like AirPrint, you have to look for apps that can do it.  There just aren't enough of those to suit my needs, so I suspect my dongle will remain mostly unused.For $35 it was worth a try, hope they get more major iOS apps like VLC to sign up.Also, for some strange reason Amazon entered this as a debit card transaction instead of a credit card so I got charged half a buck more.  Hope that isn't a new trend!", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "As described , quickly received", "verified": true, "helpfulness": "0/1", "author": "Deborah Price"}]