[{"rating": 3.0, "review": "I absolutely love Amazon as a company however I feel the Amazon Fire TV fell short.One of the major features they marketed was the voice search feature. Which works very well for Amazon Prime On-Demand / Amazon Prime Free movies. It does not work inside other applications like Youtube, Plex, Netflix, etc.Technology wise, the Amazon Fire TV packs a punch and is quick. It looks great, is smooth, and has a fairly organized user interface. The only part I have to complain about is its lack of DTS audio and AC3 support.The remote is excellent, feels good in your hand, isn't large but also isn't so small you'd lose it.Overall, the Amazon Fire TV is a good streaming box, competes well with the Roku devices but could really dominate if Amazon continues to improve the features through software updates and fixing the Voice search to work inside each application.", "verified": true, "helpfulness": "3/5", "author": "Dos box"}, {"rating": 5.0, "review": "Voice that works!!  Impressed.  The speed is excellent and as a Prime member well worth the purchase price.  If you do not have a smart tv this product bridges the gap ~ I have a smart tv but when I compared speed of the fire vs the tv interface fire was far superior ~ the software still needs some tweeking to make the experience seemless i.e. entering your netflix acct and pw cannot currently be done using the handset but can be done using the game controller purchased separately ~ all in all I feel my $99 was well spent.", "verified": true, "helpfulness": "2/2", "author": "Daniel J Gallagher"}, {"rating": 2.0, "review": "I have tried several times today to download the software update. I keep getting a message saying download unsuccessful. However, I did contact Amazon Fire tech support about this issue. If the problem isn't resolved by the end of this week, I will repack item and return it. Just beware of this issue.", "verified": true, "helpfulness": "2/3", "author": "Stephen W Fryman \"Steve\""}, {"rating": 5.0, "review": "This device is the best device for amazon prime members.The voice search is great.The games are fun.You can play many games with the standard remote.The device never locks up like my Roku3 does sometimes.The picture quality is excellent.You can use music apps while playing games at the same time. I like to turn off game music and run Pandora. In other words, you can run multiple apps at the same time, so this is one advantage of the android operating system.", "verified": true, "helpfulness": "3/3", "author": "ProductOwner"}, {"rating": 5.0, "review": "I'm so glad Amazon came out with this.  I've been a Prime member for years, but I rarely watch instant videos because I find it a little awkward to watch on my Kindle.  The Fire TV was so easy to set up and I really like the voice search feature.", "verified": true, "helpfulness": "2/2", "author": "Sandra R. Blanks"}, {"rating": 5.0, "review": "I got this and found that it works great the only thing that I don't like is when you give it the name of a movie it takes you to the ones you have to pay for and not the free ones but except for that it is great it was easy to install and works perfect", "verified": true, "helpfulness": "2/2", "author": "evildaddy069"}, {"rating": 1.0, "review": "Pros:  FastCons:Software is buggy.  I could not get it to connect to my wifi WPA/WPA2 encrypted network because they do not support \" (quotation marks) in their passwords.  I was not about to reconfigure my entire network because they fail to do wireless encryption properly.They do not support a \"free only\" search for movies and media.  I wanted to be able to find just content that I wouldn't have to rent/buy with my prime membership.They want to force cloud on you.  Frankly, the main reason I was investigating the product was so I could post pictures of my family and have it work on my TV without having to sync up to some central Itunes store (which is how Apple TV works).  The only way to do that is to post your pictures to their cloud service.  I frankly don't trust Amazon with photos of my family, as big business has proven time and time again how they will end up using your data (Facebook anyone?).  They have a USB support - developer only for the hardware, cannot plug a USB key into it to sync photos to your local device.  You cannot directly access the hardware storage of the device to put data (photos and video).  I cannot believe in this day I still cannot find a single home media device that allows me to do home photo albums without having to share my home photos with their business model.GIVE ME ACCESS TO MY PHOTOS AT HOME.", "verified": true, "helpfulness": "2/23", "author": "Zach"}, {"rating": 5.0, "review": "It replaced my older model Roku. I know Roku has more channels available, but I get everything I want with the Fire TV, plus some really nice games. Roku never did games very well. Not that I'm a gamer - it's just nice when the grandchildren come over.  The interface is better and it's a LOT faster than the old Roku.Yeah, I could have bought the newest model Roku, but even it can't match the specs of this little box.Not many apps yet, of course. Look for more and more to be ported over to the Fire TV. I'd like to see a web browser and a gmail app. It's possible. I'd even invest in a bluetooth keyboard. Any developers out there listening?", "verified": true, "helpfulness": "5/5", "author": "G. M. Waid"}, {"rating": 5.0, "review": "This is a superb device much better than the other's out there.  Very easy to install and setup.I would highly recommend this to anyone.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"Avid Reader\""}, {"rating": 5.0, "review": "Fire T.V. is great but it needs a section will all the original programing so u can find those shows.", "verified": true, "helpfulness": "1/2", "author": "mark"}]