[{"rating": 4.0, "review": "Product works great with ChromeBook.", "verified": true, "helpfulness": "0/0", "author": "william m. rogers"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Yani Viera"}, {"rating": 4.0, "review": "The only downside is that you must get apps that is designed to work with chrome cast. So the normal basic apps can't work with the chrome cast. Other than that it's great synced my laptop,iPad and iPhone to the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 4.0, "review": "We like it.  We like the fact that we can use it with our devices.  There's only one thing ,on ce in awhile  it stops streaming.  Thank you the package arrives on the time expected.☺☺", "verified": true, "helpfulness": "0/0", "author": "V. N."}, {"rating": 5.0, "review": "perfecto", "verified": true, "helpfulness": "0/0", "author": "SERGIO BOLAÑOS OVIEDO"}, {"rating": 5.0, "review": "Excellent Product but when using Full screen sharing the audio has a delay.", "verified": true, "helpfulness": "0/0", "author": "Alain  Martínez"}, {"rating": 5.0, "review": "Chrome cast is ahead of its time. There is no too much to cast yet but eventually it will be as usable as a smartphone is today. I can cast HGTV channel (app in iPad)  provide that I sign in with my Verizon Fios Account, as well as others apps related to TV . Can't cast all the contents of my iPad yet but as I said before, give it another year. For the price (reduced from the original $35.00) can't complain.", "verified": true, "helpfulness": "0/0", "author": "Traveler \"The Traveler\""}, {"rating": 2.0, "review": "I've only actually been able to get this little \"do-dad\" to work once.  I bought it to take it with me on my many business trips so I could stream on something larger than my iPad.  It's overly complicated (to me at least) to get this thing connected to the same wifi network AND the Google Chrome network to stream.  I have completely given up and actually can't even remember where I tossed it.", "verified": true, "helpfulness": "0/1", "author": "BAO \"BAO\""}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "shaun scott chandler"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Luis Diego H."}]