[{"rating": 5.0, "review": "I've had Chromecast since launch and it's become an indispensable part of our living room (and our travel regimen).  There are several different ways to watch YouTube, Netflix, Hulu+ and HBO Go on my TV, but Chromecast is my favorite: it's simply easy to fire up the app on your smart phone or tablet, or on your PC, Mac or Chromebook, and send it to the TV - in great quality - with the press of one button.  I've also started using Chromecast more and more to stream music from Pandora, Songza and more to our living room TV - connected to the best speakers in our house.I expect Chromecast to continue to add more of the apps that are important to me and improve the features continually.  For $35, Chromecast is a must have for the living room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Now with Hulu, HBOGo, Pandora and a bunch of other apps, I love it even more.  I use it at home with my ipad, my Nexus7, my ipodtouch, my mac and my chromebook", "verified": true, "helpfulness": "0/0", "author": "Antoine"}, {"rating": 1.0, "review": "If you only use Google, good.  If you use other services, this is NOT what you want.  Returned and replaced with Push2TV", "verified": false, "helpfulness": "2/2", "author": "Michael R. Books"}, {"rating": 4.0, "review": "I noticed that Google's Chromecast crashes sometimes. It worked well for the 1st 1 month or so but later on it starts to hangup after perhaps an hour or two of streaming...", "verified": true, "helpfulness": "0/0", "author": "Solve ASAP"}, {"rating": 4.0, "review": "Not only do I love it, I have it out as my go to gift last Christmas...& everyone lived it too.  Bye bye cable", "verified": true, "helpfulness": "0/0", "author": "Zoby Soto"}, {"rating": 3.0, "review": "It is very good to watch YouTube and Netflix on TV. If you do not have a Smart TV at home, it is very good. If you do, it's not so great. I am disappointed because when I bought it I thought it would convey all the information from your smartphone screen to the TV. For example, being able to play Angry Birds with the image on TV or view my pictures and videos on TV without cable. No, it does not. It serves for streaming YouTube and Netflix on TVs that are not Smart TVs. That's it.", "verified": true, "helpfulness": "0/0", "author": "Fabio  Okipney"}, {"rating": 5.0, "review": "It's not going to completely replace cable/satellite if you can't let go of certain channels or watching shows right as they come out. However, iif you're like myself and already don't watch cable or satellite, it's a perfect cheap means to stream your netflix onto the big screen (I don't own a xbox or ps).Pros:- assuming you have a decent internet connection, netflix, youtube, and chrome browser casting stream with well.- you can watch just about anything from anywhere with the chrome browser casting. I use it to watch hulu- easy to usecons:- you need a good internet connection- some delay starting up a cast, but unless you're living somewhere with better internet speeds than the states, it's to be expected.- Maybe I just haven't really looked into it, but anyone on your wifi can control what is playing. This could mean roomates messing with your shows.- you can't use the chrome web browser cast with android smartphones/tables (same for apple if I recall correctly) only windows os smartphones/tablets.", "verified": true, "helpfulness": "0/0", "author": "Luna"}, {"rating": 1.0, "review": "Won't work with HBOGo.  Takes forever to start and I get tired of waiting and just go over to my Mac and watch it there.  Also doesn't stream sound from the Mac to the Chromecast.  Would like to stream video from my iPhone but doesn't do that.", "verified": true, "helpfulness": "2/2", "author": "JPT"}, {"rating": 5.0, "review": "This little gadget works even better than hoped.  We wanted a way to stream to the TV without a cable, and we got that--works great!  As a bonus, while I'm watching a show, my daughter can still work/play on the laptop.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Tom Snyder"}, {"rating": 2.0, "review": "This thing is crap.  It might be an ok product if you are sure you have a rock solid WIFI signal, but if not don't even think about it, get a ROKU (which is what I did after getting this thing).  When this thing has a disrupted signal it is as if it overloads the thing and it just can't handle it or figure out how to re connect and I usually end up having to set the entire thing up again from the very beginning.  Avoid this thing.", "verified": true, "helpfulness": "0/0", "author": "TA"}]