[{"rating": 5.0, "review": "i like your amazon fire tv ok but i dont understand why i have to pay a 100.00 for prime and still pay for movies can you explain thank you", "verified": true, "helpfulness": "0/0", "author": "gregory m."}, {"rating": 3.0, "review": "I love my Amazon site. I basically do all my shopping on Amazon. I was thrilled when I received my Amazon Fire TV. I've been using it so much that I have considered buying more and canceling my cable service. Well, today just goes to show that you should never get too excited. I haven't been able to watch anything on the set yet. I'm very frustrated and I'm hoping this is a one time issue.", "verified": true, "helpfulness": "0/1", "author": "Debra K. New"}, {"rating": 3.0, "review": "Wish this thing came with instructions on how to use it!  We bought it so we could watch movies at home at no charge.....good idea maybe but seems most movies are not free at all !  Netflix is much easier to navigate around on their site and I confess to watching it more than fuss with Amazon Fire,", "verified": true, "helpfulness": "0/0", "author": "Annie Buck"}, {"rating": 4.0, "review": "I'm a Prime member and have a an old none wireless Sony Bluray player in the bedroom.  I didn't want to hard wire it to the router in another room so we just didn't watch any streaming in the bedroom.  I waited a little to see what the reviews were like before deciding to purchase a FireTv.Arrived within 2 days and honestly, it was easier to install than it was to unwrap everything!  I had an extra HDMI cable at home, that's all the additional accessories needed to set up, everything else is included.  As soon as I entered the wireless acct PW, boom it started working.  It was a pleasure how easy it was.  5 STARS on that!The FireTv is super easy to use and its exactly what we needed.  We aren't big in to games but watch a LOT of movies through streaming.  I find it easy to search, but as others have stated, I like to ADD movies to my watch list from the computer (couple times a week). That way, all the movies I want to watch are right there and I don't have to waste any time searching for anything.CON for me:  I DON'T like that you can't Turn-Off certain features on the FireTV - not even thru Manage your FIRETV that I can tell...maybe someone can hopefully prove me wrong??  Example:  for Prime users the unit is already linked to my Prime Account and ALL my pictures came up. I don't necessarily want ALL the pictures to show up.WTG AMAZON on this 1st Gen FireTv!P.S. - All my Digital / Ultra Violet movies that I own work using the FLIXTER App. - no issues at all...AWESOME!", "verified": true, "helpfulness": "3/3", "author": "AB"}, {"rating": 3.0, "review": "This is a great player if you don't want to play your own videos. It has an optical output that most competitors don't have and the processer is above average. They could fix the local streaming issue with an app of a software update but I don't expect that to happen since this is geared to sell you content and not to let you play your own videos. I'll stick with the WDTV streaming media player until someone comes up with something better.", "verified": false, "helpfulness": "2/3", "author": "David Robinson"}, {"rating": 2.0, "review": "Really fast going between menu's but very slow and buggy in every other aspect.  I like where they are going with this but still alot of bugs to work out.", "verified": true, "helpfulness": "2/5", "author": "Cassi Bender"}, {"rating": 3.0, "review": "My FireTV replaced my 30 ft HDMI cable from my PC as my living room media center. I like the FireTV but the honeymoon period is fading fast. I am hoping for more content and developer support soon. I only really use PLEX with runs great. I have oficially switched from XBMC to PLEX in my house and it seems to work just fine.", "verified": true, "helpfulness": "1/3", "author": "Mitch M"}, {"rating": 5.0, "review": "We have only had Fire for two weeks and were having trouble figuring out how to use it (not in depth instructions came with it).After receiving an e-mail telling me we have a \"Prime Membership\" we began using finding out how it works. Still don't know muchon apps or Netflix, etc., as I said no detailed guide came with it. The \" Voice \" option is really great.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Was unable to use it because it was not compatible with my wireless hotspot. Very disappointed that it did not work for me.", "verified": true, "helpfulness": "0/2", "author": "Carolyn Walbright"}, {"rating": 5.0, "review": "Amazon fire tv is a great product! I might give up cable tv and only watch my amazon fire tv!", "verified": true, "helpfulness": "0/0", "author": "Romain Despres"}]