[{"rating": 3.0, "review": "I AM RECENT CORD CUTTER AND TRYING TO DEVELOP MY MEDIA CENTER . I HAVE GOTTEN ROKU 3 (SPECTACULAR) ZAAP TV ( GREAT ) AND DIGITAL TUNER BOXES WITH BUILT N DVR CAPACITIES.WELL HAVING LEARNED  AND USED ALL THESE , I WOULD LOVE TO BUY AMAZON FIRE TV BUT I WANT IT TO HAVE A BUILT IN DIGITAL TUNER , DVR CAPACITIES", "verified": false, "helpfulness": "1/15", "author": "FLOWERPOWERMD"}, {"rating": 5.0, "review": "It's small, easy to set up and very fast. Had a problem with \"Voice Search\" on the remote but issue was fixed with one onscreen contact to tech support. New device was at my house the next day. So super fast customer service.", "verified": true, "helpfulness": "0/0", "author": "Arthur M. Breshears"}, {"rating": 3.0, "review": "Every day when I turn it on, it says my internet connection is lost.  It is not.  The only way to get it to work is by unplugging and replugging it in the power.  I wonder if mine is defective? Otherwise it's fast! Set up is easy.  I wish the speak mode didn't just direct you only to Amazon...but you could use it for netflix, youtube, etc.", "verified": true, "helpfulness": "1/1", "author": "G. Foss \"captain cone flower\""}, {"rating": 5.0, "review": "This thing is awesome! Easy to set up. Easy to get connected. East to start watching immediately. Fire TV rocks.", "verified": true, "helpfulness": "0/0", "author": "Sean  McCormick"}, {"rating": 2.0, "review": "THIS WELL PACKAGED ELECTRONIC ITEM WAS VERY DISAPPOINTING. I WAS EXPECTING A WELL ADVANCED PIECE OF EQUIPMENT LIKE THAT OF THE KINDLE AND KINDLE FIRE.1- APPLE TV AND ROKU WORKS WITH MY BELKIN SPLITTER. FIRE TV DOES NOT.2- FIRE TV HAS TO BE PLUGGED DIRECTLY INTO THE TV TO WORK . APPLE TV/ROKU DO NOT.3- FIRE TV HAD TROUBLE ACCESSING THE WIRELESS NETWORK.4-EACH TIME I HIT THE BACK BUTTON IT WOULD GO BACK TO NETWORK SETUP. EVEN THOUGH IT WAS ALREADY UP.5- FIRE TV HAD TROUBLE DOING ITS UPGRADE. KEPT SAYING \"CANNOT CONNECT\"THE FIRE TV WAS DISAPPOINTING. I WAS LOOKING FORWARD TO NEW EXPERIENCES. IT JUST DID NOT HAPPEN!!!!!!!!!", "verified": true, "helpfulness": "4/12", "author": "P. Wint \"martinluther\""}, {"rating": 5.0, "review": "Just can't get enough of this device. Site fast and reliable connection. Having more than 40,000 at your finger toss is just incredible.", "verified": true, "helpfulness": "0/0", "author": "Patrick A. Baptiste \"Poloasis\""}, {"rating": 5.0, "review": "Love the user friedly aspects of it, would recommend it highly to those who have been frusttrated with other smart equipment access menus", "verified": true, "helpfulness": "0/0", "author": "M. Garner"}, {"rating": 5.0, "review": "I've had an Apple TV for some time now, and just got the Amazon Fire TV.  WOW!  What an improvement.  The voice prompt ability is unbelievable.  Go out and get one now.", "verified": true, "helpfulness": "0/0", "author": "George Newman"}, {"rating": 2.0, "review": "The Amazon Fire TV Appears to be Middle to Low Grade! It has 2GB DDR2 instead of 2GB DDR3, the CPU needs like the 801, I don't even know which OS it uses and I probably can't go to the Google play store for apps, needs a normal Android Launcher, I'd like to see the Qualcomm Adreno 330 or Power VR 6XXX Series GPU or even a Mali 7XXX Series GPU, a 1080p kernel, Bluetooth 4.0 is great, but needs at least 16GB Nand 8GB isn't big enough and NO Partitions, These days it needs to be able to put out 4K Video, Dual-band, dual-antenna Wi-Fi (MIMO) for faster streaming and  fewer dropped is another good feature, Maybe USB 3.0 for faster streaming and Data Transfers, Some people are Tech Savvy and know what they're talking about! I have a STB called Tronsmart Vega S89 with a Amlogic CPU that works like a Cortex A15, but it's a Cortex A9, Mali 450 Octacore GPU, 2GB DDR3, 16GB Nand and all the goodies I mentioned, It comes with Android 4.4.2 KitKat, but needs a lot of work on its OS and secondary launcher and it has a Status Bar to navigate with, but needs Volume up and down and a spot to turn it completely off! All and all they're not even close in one way or another! They all need to pay attention to the OS \"Operating System\" to many issues and UI \"User Interface\" Half the time the apps don't work and the device always has issues that make you sorry you bought it! If I had this Amazon Fire TV in my hands I could give it a better review!", "verified": false, "helpfulness": "3/23", "author": "Budman"}, {"rating": 5.0, "review": "I am so happy with my new Amazon Fire Tv. It came the next day after I ordered it and I was able to get it working easily.  I did have to go out and buy an hdmi cable. I got 30 days of Amazon Prime for free. I think this is a good purchase.", "verified": true, "helpfulness": "0/0", "author": "Barbara King"}]