[{"rating": 5.0, "review": "Great product😀", "verified": true, "helpfulness": "0/0", "author": "ricardo Zambrano"}, {"rating": 5.0, "review": "Good job amazon. Top notch, and the ability to sideload apps, specifically Kodi Media Player. Would be phenomenal if you guys weren't so against the Moding community and allowed us to root it, and let the sideloaded apps show up on the home screen. (In the meantime the app 'app shortcuts' on an android phone helps launching sideloaded apps on the fire TV). All in all I'd give it a 4.7/5 and would be a 5/5 if there was USB-OTG mounting and Amazon didn't shy away from modding so much.", "verified": true, "helpfulness": "0/0", "author": "Cody Diehl"}, {"rating": 4.0, "review": "I like the feel of the remote and the option to search by voice.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline M. Richmond \"jr\""}, {"rating": 5.0, "review": "Absolutely love it! So easy to use! We use prime now instead of having cable. It has so many options for other apps too. So, we don't miss cable at all $", "verified": true, "helpfulness": "0/0", "author": "Joanna Hartman"}, {"rating": 5.0, "review": "Excellent, easy to use", "verified": true, "helpfulness": "0/0", "author": "sininfarina"}, {"rating": 5.0, "review": "I am new to these gadgets.  So I did research and read and read... and then Amazon sent me an email saying they noticed I had not used any of the movies in my prime account.  That got me thinking more.  At $99, it isn't that much of a risk.  Plus, we are heading into the summer, which is a dead period for TV.  So I ordered this.  They said easy setup. Yeah, right I thought.  Well, guess what?  I don't think it took five minutes to set this up.  Then... HOLY FRIJOLES!  I can't believe all the stuff here to watch!  First program I watched was one of my favorites, Band of Brothers.  I haven't yet tried the voice command thing or played any games.  If you are on the border, not sure you want to do this, let me tell you, $99 is a steal.  I can't wait to see all the other features on this device.  I like how it remembers your previous choices.  So it will be fast for me to get back to Band of Brothers to watch the rest of the episodes.  I also noticed they have the PACIFIC on there too.  I've only seen one of the series, so this is a must watch for me.", "verified": true, "helpfulness": "0/0", "author": "James Gordon Patterson \"The Professor\""}, {"rating": 5.0, "review": "Amazon Fire TV is awesome! Super fast and my kids love the games.", "verified": true, "helpfulness": "0/0", "author": "Rudy Peinhaupt"}, {"rating": 5.0, "review": "We decided to cut the cord...bye bye Direct TV!  We didn't want to give up network news though, so the first thing we did was install an antenna, which works great and helped achieve the goal of watching Nora O'Donnell and Charlie Rose every morning.  Yet we wanted to take advantage of all that Amazon Prime (APrime) offers so we had been using a laptop and HDMI cord connected to our TV.  We also subscribe to Netflix, etc.  So Fire TV seemed to be the perfect solution.  It is!!  Of course, I read all the Chromecast/Roku reviews but chose Fire TV because it seemed to be the most user-friendly.  And this has proved to be true...so much easier than using the laptop to connect to the TV.  For example, from the laptop we have to manually switch from episode to episode when watching Big Bang Theory...with Fire TV, it automatically sends you to the next episode. Fire TV works just as well with Netflix, Pandora, etc. The voice search feature is also awesome!! Fire TV was easy to set up.  We LOVE Fire TV and highly recommend it.  Next thing we want is the Amazon controller because we're gonna play games :-)  We are saving $60 a month this year by cutting the cord, including the cost of Fire TV and the antenna.  Next year we will save over $100 a month and we are not missing anything.", "verified": true, "helpfulness": "1/1", "author": "Jomo"}, {"rating": 5.0, "review": "Impressed with box it came in and the ease of startup and use. Had to make one customer service call and was very impressed with the people on the call and the issue resolution, Of course the problem was my fault.The voice search feature works great and the system hooks up seamlessly with my Prime account.", "verified": true, "helpfulness": "1/1", "author": "John Prather"}, {"rating": 5.0, "review": "works great and for the price i got,i just had to buy it.", "verified": true, "helpfulness": "0/0", "author": "mr v"}]