[{"rating": 5.0, "review": "My son is very happy with the Media player. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Mary Wille"}, {"rating": 5.0, "review": "We canceled our unused cable subscription and bought the Google Chromecast for one TV and the Amazon Fire Stick for the other. We love them both.  We are Prime members so the Fire Stick offers access to those shows.  But we can cast the shows to any TV with the Chromecast.  We have Netflix and Hulu.  Installation was very easy.  The wifi picks up on any TV in the house.  This is a great piece of equipment to have for vacation homes also for such an affordable price.  Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "AG'sMom"}, {"rating": 4.0, "review": "Second one purchased (one for living room and one for bedroom).  Cheap enough price, works well.  Some reviews have stated it can eat up wifi bandwidth, but no problems so far.", "verified": true, "helpfulness": "0/0", "author": "Hailey"}, {"rating": 4.0, "review": "The product description did not say that a \"power cord\" was included with the item. When I ordered the Chromecast I also ordered a \"small\" power cord. When the package arrive, it had the power cord with it. Still learning how to work it. It works great for pandora but if you have Amazon Prime you can not \"cast\" the movie and such. So overall this is a good product, just other companies need to get on board with support for it...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It it is near the router /modem the streamimng is first rate! Strongly recommend", "verified": true, "helpfulness": "0/0", "author": "Dr. Lynette I. Oliver MD"}, {"rating": 2.0, "review": "not a huge fan of Chromecast vs other options.  with Chromecast you have to stream from another device (laptop, phone) to Chromecast.  Other devices (Ruko) allow you to connect directly to service you want to stream.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Set up was a bit confusing at first. Does not fully cast with my Droid MAXX. Only certain apps will cast. Unlike my husband's Samsung Galaxy S5 casts all screens .. well except the NFL network. Mainly use in the Garage where we do not have cable. The Galaxy S5 will cast when tour cable provider's app is open and we are watching TV via phone.. cast to TV. Its pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Dave & Susan"}, {"rating": 5.0, "review": "Still buggy with maaaany apps but love it anyway.", "verified": true, "helpfulness": "0/0", "author": "Enrique"}, {"rating": 5.0, "review": "A small low priced devise that delivers a lot of viewing pleasures!!", "verified": true, "helpfulness": "0/0", "author": "Ronald Thompson"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Manuel E. Apodaca \"manjan\""}]