[{"rating": 1.0, "review": "Hi,for those who are looking for this device, I would like to raise few questions to you before you buy it:1- Why do you need it?2- Do you think the storage capacity of 5.5 GB is enough?3- Did you search for alternative & compare it with this device?4- Is it really worth it to buy it?I have bought this item thinking it is something different than other similar devices but was wrong.the most I hate about it, that you cannot extend the storage capacity.the other thing that I hate about it is you cannot find lots of applications as such as what is available in Android App Market.the most funny part of this device, it doesn't have internet browser...the silly thing here, it has a USB port, but it was made for no use!!!Amazon claim to provide 300+ games and lots of apps on this device, but Amazon did not declare the storage capacity before claiming that.the maximum amount of games and applications you can install does not exceed 15 depends on the size of each application.I highly suggest to give a look into (G-Box Midnight MX2) before buying this device.overall, I do not recommend this device for those who looks for all in one entertainment device.I highly recommend it for those who looks for simple apps.", "verified": true, "helpfulness": "4/14", "author": "HB"}, {"rating": 5.0, "review": "This is by far the best streaming box I have ever used. The titles load instantly and streaming is flawless. The voice command ability means no more lengthy typing letter by letter. I would give this 10 stars if I could.", "verified": true, "helpfulness": "1/1", "author": "J G  ''Highflyer''"}, {"rating": 5.0, "review": "Great product, very compact", "verified": true, "helpfulness": "1/1", "author": "Neil E Deertz"}, {"rating": 1.0, "review": "there is a serious problem with the OS. some apps like Amazon prime and Netflix are working nice and smooth on this device but some other apps like the news apps which are my favorite apps are keep crashing or not working at all. I am big fan of amazon and I choose this set-top-box over all the other brands mostly because of that but now I am very disappointed!", "verified": true, "helpfulness": "3/6", "author": "amir"}, {"rating": 5.0, "review": "This is an amazing devise. We use it daily!", "verified": true, "helpfulness": "0/0", "author": "SuzanG"}, {"rating": 2.0, "review": "it appears that most movies were pay per view. Did not like the way is was formatted with programing.", "verified": true, "helpfulness": "0/3", "author": "Bruce Maxwell"}, {"rating": 1.0, "review": "Every single day,  multiple times it doesn't load the ESPN app.. Fox Sports Go is almost as bad and NOT HD. Sling TV doesn't read any Internet connection. The tech support told me to clear the cache on every installed app when this happens. Do I get a discount since you want me playing \"software developer\" on my end??!!  And that's after three calls and five hours on phone with Sling, plus three calls with Amazon. I'm absolutely disappointed with this product. I'm on my 2nd one and exact same poor performance. I feel ripped off.", "verified": true, "helpfulness": "1/3", "author": "B.F."}, {"rating": 5.0, "review": "Out of the box compatibility with all the major content providers and powerful yet easy to use features. Under the hood tinkering and modification is easy for those that want to do it.", "verified": true, "helpfulness": "0/0", "author": "Sam Speight"}, {"rating": 5.0, "review": "This is hands down the greatest streaming device no questions asked! I'm a tech savvy guy who likes to have the best of the best and this is it! Prime TV is super fast for a wifi connected player it's even faster then my smart tv that is connected directly to my router. Do not hesitate in buying this it is well worth the cost!", "verified": true, "helpfulness": "0/0", "author": "Jakerz \"Jp03\""}, {"rating": 5.0, "review": "Awesome toy", "verified": true, "helpfulness": "0/0", "author": "Big Daddy"}]