[{"rating": 3.0, "review": "it is okay, but i thought was a little diferent", "verified": true, "helpfulness": "0/1", "author": "Walter"}, {"rating": 5.0, "review": "We have already bought two of these.  They work great for viewing on something other than our smart phone.", "verified": true, "helpfulness": "0/1", "author": "Michael Lambert"}, {"rating": 3.0, "review": "only has some apps wish it had more", "verified": true, "helpfulness": "0/1", "author": "Berkeley gal"}, {"rating": 5.0, "review": "My grandson love it he could watch his favorite shows.", "verified": true, "helpfulness": "0/0", "author": "jacqueline arquiza"}, {"rating": 5.0, "review": "Ordinarily I'd buy something like this from Amazon but as soon as I read the review by Shauna Morgan that confirmed local files could be streamed I sped over to my nearby Wal-Mart and bought one. She used Plex but I just use a Chrome extension. Plex gathers viewing data per their TOS.First I have to say this: Google, the folks that redefined the smart phone industry with Android, a Linux operating system, doesn't support open and free Linux operating systems with their ChromeCast setup program but they do support the proprietary Mac OS which is also a *nix OS and, of course, there is an Android (which is, again, Linux) phone app. Come on Google. What the heck are you doing?I have a Win7 box so I used that to run setup. I still had problems because of my WiFi router: TP-LINK TL-WDR4300 Wireless N750 Dual Band Router, Gigabit, 2.4GHz 300Mbps+5Ghz 450Mbps, 2 USB port, Wireless On/Off Switch. You need to go to the 'Wireless x.xGHz' section and enable the \"Enable WDS Bridging\" option. Fill in the fields for the ChromeCast network name. The mac address should be shown on the TV screen. I think the other fields can be left at default values. After I did that the Win7 box saw the device and I was able to complete setup. If you don't have to jump through hoops like I did because of my particular home network it should be a snap for you.Once you get past setup you are golden! Install the two free extensions \"Google Cast\" and \"Videostream for Google Chromecast\" in your Chrome browser. The Google Cast extension allows you to play whatever is playing on a tab. The Videostream extension allows you to play video files that are on your computer. Both extensions are easy to use.Whenever a video source is available in the tab the Google Cast extension will change to its active color allowing you to click it and stream to the TV. When you are streaming youtube videos it creates a temporary queue so new vids that you play are added to the queue to be streamed to the TV until you click the 'stop streaming' button. You can rearrange items in the queue as you prefer.To play a local file I just click the videostream shortcut icon on my Linux Mint 17 taskbar and a new tab opens allowing me to select the local file for streaming. You can fast forward or rewind short amounts with shift-arrow. There is a seek bar for big jumps with your mouse.There are Android apps for your phone for both of those extensions. My phone, an LG, is Android 4.1.2 (Jelly Bean), rooted and I use Xperion ROM by GameTheory. Google Cast does not see the ChromeCast device from my phone. Probably because I'm rooted because the VideoStream app, on the other hand, works perfectly on the phone.Streaming is flawless! I imagine that if you have trouble with your WiFi signal because of interference from walls or whatever you might have similar trouble with streaming. I reckon you can either give up or get a signal booster if that is the case for you. Maybe this one? I don't own it but it has a lot of good reviews: TP-LINK TL-WA850RE N300 Universal Wireless Range Extender, Wall Plug, Plug&Play;, Ethernet Port, Smart Signal Indicator Light. I'd get a booster without regard to the ChromeCast if I were having signal problems so its worth the investment either way I think. And having ChromeCast is a good excuse to fix your signal problem if you have one.~$30 to stream to your nice big TV? So worth it!", "verified": false, "helpfulness": "3/3", "author": "D. Wortham"}, {"rating": 2.0, "review": "So I bought Chromecast and Roku at the same time. I had the chromecast on tv in my bedroom which is the one we use least. Well lately I've been using it more and I've found that unlike the roku player I have to cast after each episode. I've  gone through the settings and I see a setting for continuous play but I still have to cast at the end of each show and when watching a series of 23 minute sitcoms it's kinda nerve racking to unlock my phone search and select the show to watch it. On roku I can watch full seasons without  a time out unless I choose to.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.  Wish Amazon Prime video was Chromecast enabled. But that's not Google's fault.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great just wished it worked with kindle", "verified": true, "helpfulness": "0/1", "author": "Larry"}, {"rating": 4.0, "review": "yup, this is good!", "verified": true, "helpfulness": "0/1", "author": "bruce zakett"}, {"rating": 5.0, "review": "Using evreday.", "verified": true, "helpfulness": "1/2", "author": "Alexander Samuels"}]