[{"rating": 5.0, "review": "Excellent product for an excellent price. Works great with minimal setup. Bought two, one to keep and one to share.", "verified": true, "helpfulness": "0/0", "author": "Roland"}, {"rating": 5.0, "review": "I gave one to my Dad for Christmas because he really likes streaming media things devices and services (Roku, playOn, Netflix/Hulu+, etc) but I found that I played with it more than him--setup wasn't too difficult and the Chromecast channel is beautiful.Now that my Dad has finally made the switch to Android, I expect he'll use this a lot. And with the Chrome tab cast extension for the desktop browser, you can really send anything to the TV screen.", "verified": true, "helpfulness": "0/0", "author": "Tymon Scott"}, {"rating": 3.0, "review": "Its good but thought it would enable me to broadcast anything from phone or computer but it does not do that", "verified": true, "helpfulness": "0/0", "author": "Guy Paredes"}, {"rating": 1.0, "review": "I got this at a Christmas gift exchange. I gave the Chromecast a try for several weeks.  My verdict is that it is essentially useless. I wanted to use it because I thought I could cast my web browser from my laptop and tablet and view videos no matter the venue. This is simply too limited to accomplish that effectively.1) The wireless connectivity drops out after not having been used for a little while.  Sometimes during use. Using the cast functionality via Netflix and YouTube, when it works it's not bad.  But it got very frustrating trying to figure out why the unit wouldn't connect to my wireless network when my laptop and tablet were connected fine. I had to think creatively and trick the unit into working with my wireless network.  It's simply too unstable and unreliable for the casual user.2) It's $15 cheaper than a unit I recently started using -- the Roku.  It is a WORLD of difference.  No \"middle-man\" hardware to cast from (i.e. no more tablet/laptop/phone to use.)  The Roku blows this thing out of the water for streaming from internet channels directly from your wireless network and rarely if ever drops out.  If that is what you want to do, DO NOT GET THE CHROMECAST.  In fact I can't really think of a reason other than simply projecting your screen to a TV in getting a Chromecast. And if that is what you want to do, knock yourself out but prepare for frustration and disappointment.3) You have to have USB power.  Fortunately my somewhat older Sharp LCD TV had one for software updates for an integrated Blu Ray player. When connected to the TV's USB port, it did not receive power. If my TV didn't have a Blu-Ray player attached to it with it's own USB port, I'd be SOL.  Maybe there's another solution like an adapter, but that means a cable running down from behind the TV to an outlet. May as well just get a Roku.4) When casting a web browser and trying to view video through non-supported sites like Amazon Instant Video, it is simply too slow to be on any use. May as well ditch the Chrome Cast and run an HDMI or DVI cable if you are using a laptop.  For a phone or tablet forget it. Nothing to see here folks.5) Having to use \"middleman\" hardware as your casting device to the Chromecast is too inconvenient and frustrating when connectivity drops out.Overall this thing was a novelty item that caused more frustration than it was worth.  I needed something solid so I picked up a Roku and damn was that the answer!  I love the Roku.  The thing streams perfect, is very small, and if you can connect via an ethernet cable, more power to you.  But Roku's still work great wirelessly. Roku supports Netflix, Hulu, Amazon, YouTube and tons of other channels I didn't even know existed.  The thing comes with a remote that reminds me of a Wii remote (the Roku 3 remote has motion sensor ability -- wow!) Where the Chromecast was an epic FAIL, my Roku is a serious WIN!  The only thing this can do that the Roku doesn't is cast your laptop screen to the TV -- and trying to watch video sans diract \"cast\" support is super slow and useless.  And who cares when your device probably has IT'S OWN SCREEN to begin with right???I think my Chromecast will be going on eBay soon.  I might get $20 for it when I sell it to the next sucker.  Hopefully.  [UPDATE 2/8/2014]  I put my Chromecast up on eBay and someone paid $35 for it PLUS shipping!  WHOOP!  Made my Roku purchase that much more justified.  Why are people paying more than $35 for a Chromecast?  Like, voluntarily?  Even non-Amazon Prime subscribers can get it tax-free and free shipping using super saver shipping right? Not that I'm complaining.  I just ordered 2 more Roku units. Roku HD Streaming Player - Manufacturer Refurbished Roku 1 Streaming Player (Black) (Roku 2710R) Roku 3 Streaming Media Player", "verified": false, "helpfulness": "1/2", "author": "Roger Montoya"}, {"rating": 5.0, "review": "super easy to install to go online and follow the directions... I love using it for Hulu which is also free if you don't get a plus Hulu version.", "verified": true, "helpfulness": "0/0", "author": "Kristi G Grant"}, {"rating": 5.0, "review": "The little marvel allows me to run a movie via Netflix or access the internet by using the TV screen as an online monitor.  What a wonderful gift Google has given us at this great price point.", "verified": true, "helpfulness": "0/0", "author": "Regan99"}, {"rating": 5.0, "review": "I love this product and this is one of the best from Google. It streams excellent with my iPhone\\Nexus\\iPad. I suggest this product to everyone", "verified": true, "helpfulness": "0/0", "author": "vpanchumarthi"}, {"rating": 5.0, "review": "The chromecast we bought is the best thing ever.  It runs all our apps off our phones or tablets.  No need for the gaming machines.  We love it!", "verified": true, "helpfulness": "0/0", "author": "Ava Maldonado"}, {"rating": 5.0, "review": "i ALMOST made the stupid mistake of buying a smart TV. the chromecast makes it unnecessary to do so. i love plopping down in front of my TV and catching up with my daily YouTube videos or watching a netflix movie powered by my phone and the chromecast :)", "verified": true, "helpfulness": "0/0", "author": "Samuel O."}, {"rating": 4.0, "review": "This product was extremely easy to install and set up. Casting Netflix movies to my TV works perfect, however the casting plugin for the Chrome browser is still in beta and needs a lot of work. I've found that the audio lags the video when casting from the browser. More and more applications are starting to support this product, so I expect to see improvements in the future.", "verified": true, "helpfulness": "0/0", "author": "USMC13SOC"}]