[{"rating": 5.0, "review": "Yeah, another thing I bought for my parents. They love it.Simple to use and install.It is just as great as you would expect. Love the ability to stream from your phone without losing battery life or interfering with the ability to make/receive calls, play apps, or surf the web.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 1.0, "review": "Got error messages and tried all my router settings to correct them.  Back it went after about 4 hours dabbling to get it going.", "verified": false, "helpfulness": "3/5", "author": "Bob"}, {"rating": 5.0, "review": "This device is magic on a level of its own. It's one of those things where it just works. Magically. No fiddling  with wires or goofing around with settings it's just like Wi-Fi BOOM working perfectly. It's worth the money just to witness the magic show!In all seriousness, it's great now that it has plex support! Before we only used it for Google music and occasionally we'd find something on hbo go, which we apparently get with our cable subscription... But plex is great! Overall for 35 dollars this thing is a steal for how much magic seems like must have been involved with its creation...", "verified": true, "helpfulness": "0/0", "author": "Malkyore"}, {"rating": 5.0, "review": "I really didn't expect to like this product. We have a lot of Apple products and I thought seriously about buying Apple TV. I also thought the power cable was too short and would give me trouble. I almost sent it back without trying it at all.But after hooking it up to my TV and connecting to it with my Mac, it worked great. It quickly applied the latest updates and I was able to share my Chrome tab on the TV screen. Even flash based games worked!  Even now as I write this review, I am listening to Pandora using my iPad.  Wonderful!!!", "verified": true, "helpfulness": "0/0", "author": "ritastew \"NC Family\""}, {"rating": 2.0, "review": "I liked the device when I first got it. Now it won't recognize my WiFi. The only way I can get it to work is to take it to the default settings and reinstall it. Then it only works for one session. I am using an iPad.", "verified": true, "helpfulness": "0/2", "author": "Linda E. Campbell"}, {"rating": 5.0, "review": "Just awesome! Google really knocked one out of the park on this one. Streams almost anything from phones or PC. Easy and lag free. Easy to set up and the kids are loving watching their videos on the big screen! Great job Google. More apps on the way means it can only get better!", "verified": true, "helpfulness": "0/0", "author": "Brandon Heyboer \"Rogue\""}, {"rating": 4.0, "review": "This is a great product. I found it easy to set up and to use. Having the option to use the iPad and the iPhone as remotes is a handy feature.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Hurst"}, {"rating": 1.0, "review": "It does NOT cast the contents of your chrome browser.  It will only cast YouTube and Netflix.  Save your money until it allows you to cast any content to your television.  It won't even cast web pages.  It will display the web page for a moment but as you scroll up and down and browse other pages, the image on the television remains locked on whatever was on your PC when you synced the cast.  I own one of these.  Since I wasted my money, please save yours.", "verified": false, "helpfulness": "3/7", "author": "C. Bove"}, {"rating": 3.0, "review": "Home Wi-Fi saw the device but could not activate it using Windows 8.1.  Looked on the internet and saw many, many recommendations to change my router settings.  Tried them all to no avail.  Purely by accident I had to boot up my Windows 7 laptop for retrieve some forgotten files.  The device immediately was recognized and began to update itself.  Same device same home network.  Only difference was operating system.  Windows 7 versus Windows 8.1.  After the device updated itself I then booted my Windows 8,1 system and voila there is was.  Google really should find a better way to do updates than via it's own device unless they make it OS neutral.", "verified": true, "helpfulness": "0/1", "author": "Carl A. Echols \"boomer46\""}, {"rating": 5.0, "review": "it does everything claimed, it does it well.  It even turns on my TV when I start a cast!  :)  Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Gary E. Wilson"}]