[{"rating": 3.0, "review": "It's a neat little device, but it's got some glaring omissions. I wish it had Amazon Prime video capability. Youtube and Netflix are indeed nice, but when pretty much every other streaming box does Amazon, this little guy should too. I also appreciate it's form factor, but having to plug it into USB on my TV is a bit of a pain. Anyway, there's not much that can be done about that. It's just a little cumbersome without a remote. Sure, I've always got a phone or tablet lying around, but that involves changing apps between services, making sure my phone is on WiFi instead of cellular, etc. I just like a remote better.Overall, It's a neat little toy, but if I had to do it again I'd get a Roku or something a little more robust.", "verified": true, "helpfulness": "0/0", "author": "joebus"}, {"rating": 5.0, "review": "nice to work with my android phone and tablets", "verified": true, "helpfulness": "0/0", "author": "S. WONG \"Looking for honest sellers\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Ruben Dario Preda"}, {"rating": 5.0, "review": "This little device will cast the display on my chromebook onto the big screen in the livingroom.  I bought this to use with my Asus chromebook.  It was simple to set up and works very well.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Goff"}, {"rating": 4.0, "review": "Great product, I have bought two and have been streaming the Netflix continually.", "verified": true, "helpfulness": "0/0", "author": "Toby L Jones"}, {"rating": 5.0, "review": "Best purchase ive made on long time", "verified": true, "helpfulness": "0/0", "author": "Nicole Neally"}, {"rating": 5.0, "review": "This is the best invention out there!  Makes your TV do amazing things!  I play stuff from my computer and phone all of the time.  And VLC video should be support chromecast soon!", "verified": true, "helpfulness": "0/0", "author": "B. Spader"}, {"rating": 1.0, "review": "Not as good as Apple TV. Spend the extra money and buy Apple. It's so much easier", "verified": true, "helpfulness": "0/5", "author": "jack jack"}, {"rating": 4.0, "review": "Great for the money, but it's limited in what applications it can work with, though Google is adding more.", "verified": true, "helpfulness": "0/0", "author": "Zachary Magid"}, {"rating": 5.0, "review": "Delivered as promised. Works great.", "verified": true, "helpfulness": "0/0", "author": "Bill hammer"}]