[{"rating": 2.0, "review": "This device drops connection to my home network wayyy to often.  I have to spend 30 minutes getting it recognized again.  This happens about twice a week.  It requires me to reboot my desktop, reboot my router, reboot the chromecast, and then more times than not, I have to factory reset my router and re-congifure the router and setup the chromecast in order to watch what I want to watch.It is beyond frustrating and I am sick of it.  I have sent numerous emails to google support for this, but they have no responded to any of them.  Amazon Fire TV stick is looking mighty good right about now!", "verified": true, "helpfulness": "0/0", "author": "Kwik10z"}, {"rating": 5.0, "review": "Great east to use with all my tablets ...", "verified": false, "helpfulness": "0/0", "author": "mojo"}, {"rating": 5.0, "review": "Thank you very much. Amazon best electronic store in the world", "verified": true, "helpfulness": "0/0", "author": "AWAD"}, {"rating": 5.0, "review": "as advertised, easy set up, easy to use", "verified": true, "helpfulness": "0/0", "author": "Mike Lu"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "antonio de marcos"}, {"rating": 5.0, "review": "excellent device .... very addictive !!", "verified": true, "helpfulness": "0/0", "author": "George puthanpurackal"}, {"rating": 4.0, "review": "Works great and was just the solution to my lack of digital cable. Only downside is it hada hard time staying connected to the wifi and buffers frequently. I'm sure that's user error though.", "verified": true, "helpfulness": "0/0", "author": "Chantelle Hyland"}, {"rating": 3.0, "review": "Chromecast lacks the ability to stand alone.  The user has to pair it with another device and synch it with apps on that device.  That lack of functionality makes it much less desirable than a Roku or other, similar devices.  It's also HDMI dependent, so it won't work on older TVs.  Of course, the HDMI interface does render, in some cases, a much better pictures on compatible TVs.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "Does what its supposed to. Doesn't play avi files.", "verified": true, "helpfulness": "0/0", "author": "James Myers \"The_DZA\""}, {"rating": 3.0, "review": "still learning how to use it.", "verified": true, "helpfulness": "0/0", "author": "Frank H. Ong"}]