[{"rating": 5.0, "review": "Our family is really enjoying the ability to stream shows from any of our computers or phones to this device.  Very easy to set up, very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Rick B"}, {"rating": 5.0, "review": "Is the best streaming device I ever bought. It has a excellent wireless reception, very portable, It seems a USB drive,  100% recommended.I hope Google unlocks new contents soon.", "verified": true, "helpfulness": "0/0", "author": "Victor Jose Cala"}, {"rating": 5.0, "review": "This is the greatest invention since the last greatest invention.  It does what it says.  Syncs up to your computer and then every program you want to watch on your computer, a little box gives you the option of playing it on your TV.  I particularly like that I can watch You Tube movies.  There is such a variety and this is the only reliable way I have found to watch.  Many TVs offer You Tube as a WIfi option but they usually break up, stop etc.  I never had this problem with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I try to use it to transfer programs from my computer to the smart tv, however the quality is poor, to slow.", "verified": true, "helpfulness": "2/3", "author": "Elizabeth Montalvo"}, {"rating": 5.0, "review": "I love using the Chromecast. It was super easy to install and works great. I use it almost every day.", "verified": true, "helpfulness": "0/0", "author": "Christine Mulder"}, {"rating": 4.0, "review": "The only thing I miss in Chromecast is to be able to see the notebook screen on the TV. The rest of the feature is perfect!", "verified": true, "helpfulness": "0/0", "author": "TATIANA YOSHIDA"}, {"rating": 5.0, "review": "I was a bit learning about this. How can such a small device do so much. I think this is a great gift idea for those that don't have cable but stream Netfix and Hulu. It's not the least bit complicated is install or turn on. I love it.", "verified": true, "helpfulness": "0/0", "author": "Sheila Rosson"}, {"rating": 5.0, "review": "I needed something to watch HBO GO on the TV without On Demand. This device works like a dream. Before buying, make sure that the Chromecast will be in a location where it is close to an outlet or USB port. If not, you may need to buy a longer USB cable.", "verified": true, "helpfulness": "1/1", "author": "Maxamas2003"}, {"rating": 4.0, "review": "I bought this after a friend came to visit and brought one.  I had never heard of it before.  Their kids were able to watch a whole season of a TV series they were interested in on my HD TV from Hulu for free.  They used their IPhones for internet connection.", "verified": true, "helpfulness": "0/0", "author": "Marybeth Raines"}, {"rating": 3.0, "review": "I really wanted to love this product but the truth is that it's just not that user friendly.  We have the exact same tv in two different rooms and the Chromecast worked on one tv and not the other.  I still don't know why.  Also, some of my youtube videos will play via Chromecast and then others won't.  Again, not sure why.  I like the idea of the Chromecast but I think maybe a few updates from now it will be a better overall product.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Moore \"Pat M\""}]