[{"rating": 4.0, "review": "I originally bought the Chromecast with the idea that I could stream Hulu Plus to my TV while I used my PC for gaming.First, I was annoyed because I had to break out a wireless laptop to do the setup on the Chromecast. While I have a wireless network for it, I assumed that my PC even though it is not wireless is connected to the wireless router via wired ethernet. However, after getting the Chromecast setup with the laptop I was able to stream to it from the wired PC just fine. I guess that's the only way it can set itself up (it creates an ad-hoc network using your wireless adapter).So I started streaming stuff from my PC to the TV and it didn't look the greatest but it was watchable. However, when I loaded up a game on my PC and the PC started to chug a bit, the Chromecast would get the audio and video out of sync. The only way to fix the delay is to stop casting the tab and then recast it and then alt-tab back into the game. But over time it would get out of sync some more.I was a bit frustrated with it but I lived with it like that for a while. Then on a whim I installed the Hulu Plus application to my Android phone and used the Chromecast from there. Night and day difference. The Chromecast works SO much better from my phone. Not only is the picture perfect, but there are no sound/sync issues. I think the difference is the Hulu Plus app on the Android phone is merely instructing the Chromecast what to do, not trying to scrape the video frame by frame and move it over wireless. It also doesn't seem to drain the phone battery, so I don't think the phone is working very hard to enable this functionality.Anyway, with the Android App it makes this device so much cooler. I actually ordered a second Chromecast for my other TV. But from the PC I was very disappointed, maybe it'll get better in the future. I would give it 5 stars, but casting any tab from the PC to the TV doesn't look the greatest, even if its a static image. But it does what I want to do and that's let me easily access Hulu on my TV for $35. Great little device.", "verified": true, "helpfulness": "0/0", "author": "A L BLAIR"}, {"rating": 3.0, "review": "I love the idea of it and the potential for where it can go, but unfortunately I have not been able to get it to work on all the networks I've tried.  That's not exactly the Chromecast's fault, but it just means that on some networks, it may not work so well.  When I did get it to work, it was great and easy to use.  But getting it to work is the trick, and one that won't work depending on network settings.", "verified": true, "helpfulness": "0/0", "author": "David H"}, {"rating": 1.0, "review": "Dissapointed thought i would be able to play my videos and pictures on my tablet or phone.  This works nothing like an apple TV.", "verified": true, "helpfulness": "0/0", "author": "Barry W."}, {"rating": 2.0, "review": "Disappointed, expected more from Google.  This device requires installation of Chrome as your browser on each device you wish to cast from.  My tablets don’t have the capacity to download required software.  The device does have a nice screen saver for my TV with impressive photography.  I'm working on resolving problems I have with my tablets, hopefully I can delete enough tablet applications to download Chrome.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "First of all, it won't run on a WPA 2 enterprise network, so I had to run off my own person WiFi.The is a noticeable lag when running chrome onto a separate monitor or TVWorst of all there is a lag in the audio if you try to use speakers connected to your computer.If you only use it to run Netflix and use the TV's speakers it works fine, otherwise just use an HDMI or VGA cable if you want to use the TV as a second monitor", "verified": true, "helpfulness": "0/0", "author": "alexander lajoie"}, {"rating": 4.0, "review": "Works as advertised. Don't waste money on more expensive smart TV devices. The Chromecast has everything you need. Just plug into the HDMI port in your TV and you can stream netflix, hulu, youtube, and anything that will play in the chrome browser on your PC.It really is the best option for turning your TV into a smart TV.The only thing that could make it better is more support for tablet apps, and a screen casting mode that shows anything on the screen of your device. However; nothing really has this capability so it's not really a complaint.The only thing that beats this would be a dedicated laptop that is connected to your TV, but of course that is a bit more expensive.", "verified": true, "helpfulness": "0/0", "author": "Justinmh1634"}, {"rating": 2.0, "review": "The Chromecast player is unable to maintain a continuous connection despite the recommended tweaks to my router.  I even relocated my wireless router to provide a stronger signal.  As a result, each time I want to use it to connect to Netflix or YouTube (the only options), I have to go through the setup procedure.  Modest cost, $35.00.  The aggravation is not worth it.  For a few bucks more you can buy a DVD that does the same thing, only more reliably.", "verified": true, "helpfulness": "0/0", "author": "C. Connors"}, {"rating": 3.0, "review": "Can't stream local content (can't watch your own movies from your laptop/tablet/phone). Overall video quality and streaming is hit or miss depending upon internet connection speed/wifi connection. It's a good idea and great price but you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "$35 for a device that plugs into the back of your HDTV and allows you to stream apps like Youtube, Pandora, etc. from your phone is a no brainer!", "verified": true, "helpfulness": "0/0", "author": "SouthernHeaven"}, {"rating": 4.0, "review": "the google chromecast it's a good thing for the price,I see a good potential, but for now it's quite limited,", "verified": true, "helpfulness": "0/0", "author": "patrice"}]