[{"rating": 5.0, "review": "Great love it", "verified": true, "helpfulness": "0/0", "author": "carolyn summerlin"}, {"rating": 4.0, "review": "Have had it for 5 days.  Great so for.  Some apps such as Disney Junior (and others) do not work unless you have cable.....kinda defeats the purpose if you ask me.  But overall, glad I got rid of cable and got this!", "verified": true, "helpfulness": "1/2", "author": "lisa"}, {"rating": 4.0, "review": "Nice interface and quick and picture quality is good, but could you somehow allow Vudu on here?", "verified": true, "helpfulness": "1/1", "author": "j. gaines \"jeremygaines\""}, {"rating": 5.0, "review": "Love Amazon Fire TV.  I now have only basic cable, cut my expenses by more than $100 per month.  Plus my grandchildren have games to play when they visit.", "verified": true, "helpfulness": "1/1", "author": "James L. Bridges"}, {"rating": 5.0, "review": "For once, the commercials were not wrong.  I didn't think that this would be able to stream and navigate as fast as it does on the demonstrations....SURELY those were stretching the truth....right?  WRONG!  Blazing fast.  Instant.  Words upon words to describe how fast this thing is.  I love it.  One touch of the remote, it turns my TV on and loads up the menu before my LEDs warm up.  Its unbelievable how awesome this is.  If I had kids or a large family...I would have one of these on every TV in my home.  It's THAT great, I mean it.I have told all my friends and co-workers about it and many replaced their Rokus.  It is just that freaking good.  It's very tiny.  I was expecting something a little bigger, but this is a tiny little box and a itty bitty remote that functions so well.  10/10 Amazon, well done.", "verified": true, "helpfulness": "1/1", "author": "Eric Nebel \"The Nebel\""}, {"rating": 4.0, "review": "I have had my Amazon Fire TV (AFT) for a little over a month and a half now, but I did not want to write a review until I had it for some time out in the field. For me, the field is extended stay hotels (Homewood Suites this quarter). While my AFT worked swimmingly at home, it is redundant to much of what I already own between the WiiU and various smart BluRay players. What I wanted was an easy way to stream on the road. It was connecting on the road that proved to be the most difficult task but one where I think that the AFT distinguished itself after a few minor modifications.The problem is that the AFT is little more than a poor nightlight when it does not have an Internet connection. Most hotels, however, require some sort of web-based authentication. Solution: sideload Firefox onto the AFT so that you can launch a browser after you connect to the hotel wi-fi. Google \"fire tv sideload firefox\" and you will find a variety of options. Because many hotel authentication webpages are not particularly amenable to use of the <Tab> to navigate them, I had to plug an old Microsoft keyboard into the USB port and a mouse into the keyboard's USB port. The USB port on the AFT is powered, so I was able to daisy chain a wireless mouse and still get the cool blue glow off of my keyboard. I could likely get away with just a mouse, but I find typing in a long HiltonHonors number cumbersome using just the wireless remote.Other results from my field test: - The wireless radio in the AFT seems to pull signals better that the card in my Latitude. The AFT connects consistently while I have to use an external adapter on the Dell. - No issues screen sharing from my Kindle FireHD. - My current hotel tv has easy access to a spare HDMI port and supplies me with a real remote so that I can change the image source. If you are a road warrior, check this out first before you make the investment as many hotels lockout external inputs or provide you with a remote without a \"Source\" button.I will update as I spend more time with it.", "verified": true, "helpfulness": "0/0", "author": "jumanji68"}, {"rating": 5.0, "review": "Amazing compact fully feature box. I'm a first and second generation Roku owner and Amazon Fire TV's performance blows it out of the proverbial water. Picture quality is superior to Roku without the constant buffering that is a annoyance.  Game controller is a must reasonably nice game selection I marveled at the overall quality.", "verified": true, "helpfulness": "0/0", "author": "FloridaSun"}, {"rating": 4.0, "review": "The FireTV is a pretty sweet little device. With the bluetooth remote, I'm able to completely hide the device and it's still able to operate. It's compact design also allows me to travel with. I can hook it up to a TV at a hotel and still catch my favorite shows while I am able to continue working on my laptop. The other added bonus is the extremely low power consumption. Saves me some $$ on my electric bill.Pros: Portability, concealment, power. It's an all in one package at a very affordable cost. (Watch around holiday season. They seem to be comfortable with dropping the price to $84 frequently)Cons: The Netflix app is outdated. The latest version looks much cleaner. The Spotify app is nice, but I would rather it be the actual app opposed to pairing it with another device. Local network streaming would be nice (since I don't use Plex).Other: I was able to resolve the local network streaming issue by side loading XBMC which works flawlessly. Since the FireTV has a dedicated GPU, it's able to run Hardware Acceleration, and it runs it very well. The Netflix app still works great, it would just be nice if it was running the later version of the app that's available in the Google PlayStore. This is a little box with big potential. I'm enjoying my experience so far, and I'm looking to get my family in to it as well.", "verified": true, "helpfulness": "0/1", "author": "Kevin"}, {"rating": 2.0, "review": "I can get all this on Netflix. dont bother getting this in my opinion.", "verified": true, "helpfulness": "1/8", "author": "Eros21"}, {"rating": 5.0, "review": "Love this little box! So much so, that I purchased one for each of my children. Easy to use and kid friendly.", "verified": true, "helpfulness": "0/0", "author": "tammy forit"}]