[{"rating": 5.0, "review": "I can't believe I waited so long to get movies streamed right to my TV.  No more DVDs to mess with.  I thought it would be hard to set up without knowing how \"wireless\" works.  Once I entered the code off my modem, I was ready to go.  Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Jeanine"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/1", "author": "Maria J. Cisneros"}, {"rating": 4.0, "review": "Happy with the Amazon Fire TV. I hope that more applications will be added such as HBO GO and Starz and produce more original programming such as Transparent.", "verified": true, "helpfulness": "0/0", "author": "James L. Nagy"}, {"rating": 5.0, "review": "Can not go wrong.", "verified": true, "helpfulness": "0/1", "author": "AM SCOTTI"}, {"rating": 4.0, "review": "Great device", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love the streaming Netflix for sure. There have been some glitches in the stream of House of Cards, not sure where it's coming from but staying with the program and not fast forwarding through the intro seems to help. Otherwise it is a perfect accompaniment to Prime.Installed directly to the TV is simple with an HDMI cable (not included). Get the cheapest cable you can find. Gold tip is no better than a $5-10 one. Installed through the sound system receiver is a trick the help desk guy didn't spot. My son was like, from the fire tv box to the receiver with the HDMI, simple and the surround sounds are great.", "verified": true, "helpfulness": "0/0", "author": "Mitch Crabbe"}, {"rating": 1.0, "review": "Received one as a gift from my daughter, I also own an apple, and a old Ruko. Worked well for about three months, then it started losing its signal about a third of the way through the movies. If you shut it off and wait about three minutes it then begins to work again. Own a couple of Kindles so I am aware of their products. blew it on this one guys.", "verified": false, "helpfulness": "2/4", "author": "Tom Fisher"}, {"rating": 5.0, "review": "An excellent product, does exactly what it said it would!", "verified": true, "helpfulness": "0/0", "author": "The Captain 230 \"The Capt\""}, {"rating": 5.0, "review": "Easy to install.  Works just as advertised.", "verified": true, "helpfulness": "0/0", "author": "marshmallow"}, {"rating": 5.0, "review": "Love IT!!!", "verified": true, "helpfulness": "0/0", "author": "DRB NJ"}]