[{"rating": 2.0, "review": "Limited functionality. Only works for 2 apps (YouTube and Netflix) which are standard on nearly every new Bluray player.Was hoping for much more including broadcasting personal videos to TV, HBO Go, Flixter and basically whatever my iPhone can play.  My bad...bad buy.", "verified": true, "helpfulness": "1/1", "author": "Plasterdust"}, {"rating": 5.0, "review": "I mostly purchased the chromecast out of curiosity since between my smart TV and WD HD box I can pretty much already do what the chromecast offers, and for $35 I had little reservations in doing so.  So after using it a bit I've found that this is the absolute best way to watch youtube videos on your HD TV.  Being able to search for videos on your phone and then \"cast\" them to the TV is far, far, far easier than trying to use a remote control to type in what your searching for and then scrolling through your options.  When I ordered this I couldn't imagine even using it for youtube videos but now that I have it I'm regularly finding myself browsing through videos and watching them in amazing quality on my TV.I am able to get to Netflix in three different ways now but I keep going to the chromecast for it.  This is mostly for the simple reason that it's just kind of more fun controlling it from my phone and I like the \"second screen\" experience that you get.  I've also found that I get the quickest navigation because again, searching is much easier, and because navigating their mobile site is super quick whereas the interfaces on my TV app and WD HD box can lag a little bit.That's about the long and short of it right now since the ability to cast from a tab on your chrome browser is still in beta.  It works fine enough if you just want to get a static webpage up on your TV screen, but there definitely is a bit of a lag, and if you try to play any video it isn't great quality and lags/skips.  Having said that though, that is an aspect that they're still working on and it could improve with updates.  I'm already extremely please with my chromecast but once they improve tab casting and adding more services (HBO Go!), this will reach the levels of greatness it is capable of.", "verified": true, "helpfulness": "0/0", "author": "Stefan Schreffler \"AbuZakan\""}, {"rating": 5.0, "review": "Works very well with Netflix, I don't use it much with Youtube, but I have watched some videos and had no problem.I recommend it, specially to use with Netflix.", "verified": true, "helpfulness": "0/0", "author": "cps"}, {"rating": 5.0, "review": "cause I lost my tv remote. But the chromecast lets your phone be the remote which is wicked cool. So now I no longer need to get off my ass to change the channel or whatever. Just tap tap tap on the phone screen and voila: TV coma for hours.", "verified": true, "helpfulness": "0/0", "author": "Joseph G Thibault"}, {"rating": 5.0, "review": "So happy I read about this gadget, as we can now stream Netflix, YouTube, etc. through my Nexus 7 to our TV. We've already watched a movie and several old TV shows.", "verified": true, "helpfulness": "0/0", "author": "Mary Jo Doebling"}, {"rating": 4.0, "review": "This is my first experience with anything streaming/casting.  That being said, this little thing works pretty well.  However, when plugged into my 4(ish) year old Samsung 40\" LCD TV's USB port or wall to provide the dongle's power, it really messes with my regular cable signal.  Could be the TV's processor has a hard time with it?  So, I have to unplug from the USB in the back of the TV whenever I watch cable programming.  In the grand scheme of the world's problems, no big deal, but one observation I thought might help someone out there.  Otherwise, for $35, not to shabby!  I'm sure it'll get better as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Fritz Cole"}, {"rating": 5.0, "review": "Installed with no problem and runs great. I think it is the best and may be able to show family pics with out down loading to web.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "While this little $35 device cannot do much now watch out Apple TV, Google is going to load this device up in the coming months and show that you do not need to pay $99 for HDTV quality access to the internet shows.", "verified": true, "helpfulness": "0/0", "author": "Janie Evans"}, {"rating": 4.0, "review": "Good Tool but in Austria you're not allowed (at the moment) to download the app for android. So therefore minus one star.", "verified": true, "helpfulness": "0/0", "author": "todo"}, {"rating": 1.0, "review": "I used it once and it didn't work again. Google customer service is pathetic and my replacement device came after four weeks of exchanging emails. Google monopoly is that everyone should use google wallet to replace a device which I am against using it. WORST COMPANY with WORST SERVICE", "verified": false, "helpfulness": "1/3", "author": "Challenger2013"}]