[{"rating": 3.0, "review": "This is a cool device and for the price I would suggest getting it just to try it for yourself.  But if you're trying to decide between this and another device as your one streaming player, I wouldn't recommend it unless you like controlling it from your phone, especially if you live in a multi-person household.There is no user interface.  It doesn't work without a phone, tablet, or computer.  You have to find your content in a phone/tablet app, or web page, then send the video to your player.  If you want to pause, you have to return to that player on your phone and pause from there. It's not at all handy when you want to start a movie for your kid and allow anyone in the house to pause or control it without your phone staying there like a slave to the TV.Spend just a little more and get a Roku (or Apple TV, or Amazon Fire TV, but I recommend Roku) which is a stand alone streamer with a user interface and remote.  You sit, pick your content from the box using the remote and user interface like anything else you would use on your TV.  Want to pause or instant replay, it's very convenient.The Chromecast is cool, works well, and I even find it to be the best tool to use when I have something I found on my phone and want to transfer to the TV.  Otherwise when just sitting down to watch TV, the Chromecast is inconvenient unless you're a single person that wants full control.  Also, good luck trying to explain how to use this to your parents.  At least with the full UI streamers like Roku I can teach my parents how to use it so they can put a movie on when babysitting.  The Chromecast can do everything, but it's harder or even impossible in some cases to teach them.Google had a great idea for a cheap streaming device, but they really skimped on usability not having a remote and UI.We also have one in the office on a conference room TV.  It's ideal in that setting because of the use case.  So just think of your use case before you commit to this, or just try it for yourself for $35 (or less.)", "verified": false, "helpfulness": "0/0", "author": "Ron Perlman"}, {"rating": 5.0, "review": "I got this as a gift and was eager to see what all the fuss was about. While it did not work on my Mom's older 46\" RCA flat-screen, it worked perfectly on my own Samsung 46\" LED (UN46D8000) using their Anynet+ TV app on that HDMI port.Once I found it (took some fiddling) the included Chromecast dongle adapter (for TV-mounted HDMI ports that are very close to the TV) helped me install the rather thick Chromecast device to the TV. I also had to plug the (included) USB power cable into a power supply and then configure the device to log into my wireless network. So yes the aesthetics of that USB power cable hanging off my TV is a bit off, but I can vouch for the clarity and the ease of seeing my video/audio streams themselves.I downloaded the iPhone App, Android App and the Chrome browser App and the rest was almost like magic. Finding the device on my network was very easy. The device itself comes with a beautiful HD screensaver, with a clock.I've been able to successfully cast Pandora, HBO Go, Netflix, YouTube, and any tab from my Chrome browser to my TV, which is marked \"beta\". Last night, we watched a 120 minute movie from HBO Go that had only one very minor, short buffering episode when it was Chromecast from my Android smartphone. Very cool to have a remote control in your hand from these supported Apps (volume, pause, seek (rather crude because your finger is so much larger than the play-head button), Netflix offers a -10 second rewind while watching.The only App that I wish they had was Amazon Prime! (Tip: You can bring it up in Chrome and then cast that tab to the Chromecast device but there is no sound. You'd need a separate audio cable to get the sound over to the TV/soundbar)And not having to hook up an HDMI cable and a sound-jack cable (for the TV soundbar) to my Macbook Pro is like a double plus: essentially a wireless video stream to my TV!So it worked real well for me and I hope it does for you as well!", "verified": false, "helpfulness": "1/1", "author": "Califrisco"}, {"rating": 2.0, "review": "Fair warning, you have to connect to a home router with internet in order to use.  Will not work without it.", "verified": true, "helpfulness": "0/2", "author": "hd103, CA"}, {"rating": 5.0, "review": "Love this. It works with all my devices and it switches the input when I play something. So no need to look for a remote. Lately it got even better with more apps being added to supported list. Can't wait to see what else get's added. Highly recommended to anyone that has a TV and a mobile device. It's cheap, it's great, just get it.", "verified": true, "helpfulness": "0/0", "author": "Goran"}, {"rating": 5.0, "review": "Awesome device, can easily watch  movies  or videos from my phone, laptop on my 42 in. TV in HD quality.", "verified": true, "helpfulness": "0/0", "author": "Bikila T."}, {"rating": 5.0, "review": "We had to find an alternative to play Netflix onto my tv because our xbox kept disconnecting. The chromecast is fantastic. It's small and was so quick to set up. It took literally seconds. No issues yet. Best investment ever.", "verified": true, "helpfulness": "0/0", "author": "Vy Pham"}, {"rating": 5.0, "review": "It was everything I had hoped it would be. Some day maybe Google will upgrade the firmware to work on Windows media player.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 4.0, "review": "The Chromecast in its current state is currently lacking in functionality, and it is not a \"one device does all\" solution.  But for what it does, it does a very nice job on your TV at home, and is handy to keep in your gadget bag while you're on the road.It is not ideal for everyone or every application.  Here are a couple of observations in my usage of it.What it is good for--Chromecast can stream any content from a tab in your Chrome browser to the Chromecast, once you've installed the free Google Cast extension.  This means that you can likely stream just about anything in a Chrome tab to your screen, which is especially nice if the site has a \"full screen\" option for their video player--you can get a full screen video on your TV by doing so!  But keep in mind that while you \"project\" video in this manner to your TV, your computer is doing all the processing and must be kept running while the video is playing.  However, if the video player or application is Chromecast-aware, what happens is that your computer, smartphone, tablet, etc. is more like a control device, and the Chromecast does the actual processing and streaming, where you can then turn off your device.  As of a few weeks ago, YouTube, Netflix and Pandora (via their mobile app) were Chromecast-enabled and in my testing, worked well.  A handful of new services are available or about to be made available as well.Not so good?  There are not many applications for it yet, but that is the price us early adopters pay for it.  Also, the device will need to be powered with the included wall wart and micro USB cable if your HDMI connection is not powered, or if your TV does not have a spare USB port to power it with.  The Chromecast also does stick out from whichever input you use, but they wisely include a short HDMI extension so you can angle it off in another direction; this could have been a bit more flexible and a hair longer, methinks.Overall though, this is a great early version of an up and coming streaming product.  It works well in its intended usage, so it is a good addition to your arsenal of video and audio sources.  Keep your eye on Chromecast!", "verified": true, "helpfulness": "0/0", "author": "-=Rudy=-"}, {"rating": 5.0, "review": "I have them all. Apple TV is really great but pricey.  Roku is half the price, but it's just not a slick as the Apple. Now Google has this Chromecast at half the price of the Roku and it's even slicker and easier to use than the Apple TV.  I don't know how they do it, but Google makes a fantastic product and the price ridiculously low.", "verified": true, "helpfulness": "0/0", "author": "Mark Goodall"}, {"rating": 3.0, "review": "Bottom line up front: most people will be better off buying a Roku 3 Streaming Media Player.The big selling point for the Chromecast was the fact that you could stream YouTube content to your television. Roku never had this functionality, instead they would have the user install less-than-reliable \"private\"/third-party channels to get it.  Well, in mid-December 2013, Roku released a new, official YouTube channel that replicates the YouTube-streaming feature of the Chromecast on the Roku 3. YouTube channels for other Roku devices will be released in 2014, although they will not work on Roku models introduced before 2011. Chromecast's \"killer app\" seems to have been killed itself.That being said, the Chromecast is a perfectly adequate device if you manage your expectations a bit. It works with a very limited number of services, although more are being added. You have to control it from another device, like an iPad or Android tablet (and even then, it works with a subset of the various versions out there).The Chromecast is easy to set up and use, and is unobtrusive. It is also considerably cheaper than the Roku 3, and although I don't want to generalize, if you have a device capable of controlling the Chromecast, the price difference probably isn't going to be a deal breaker for you.For me, the Roku 3 is the real winner.", "verified": true, "helpfulness": "1/1", "author": "Frank G. \"Once More, With Feeling!\""}]