[{"rating": 5.0, "review": "I love the fire tv. Very easy to use and setup.  I only wish that movies on prime we're clearer. It seems like every time you want a fairly current movie you have to rent it. I still love it though!!!", "verified": true, "helpfulness": "0/1", "author": "Norman Rogers"}, {"rating": 4.0, "review": "I liked the Amazon Fire TV for what it did and was supposed to do and it does it outstandingly. But after 3 days of using this product, it's remote stopped connecting with the box. Earlier, I had placed my phone next to the box for about an hour and after that, the remote stopped working even after I took the phone away from it. I called for replacement right after that and it still hasn't arrived while they said it would arrive in two days. Maybe it was because of Christmas and weekends but I had to reschedule the replacement again because they said the first one didn't register.... Anyways, the moral of the story is that DON'T KEEP ANY OTHER ELECTRONICS (except for the fire tv remote) NEXT TO THE BOX OR ON TOP, YOU WILL DAMAGE YOUR TV, at least in my case and it may could be for you too. Otherwise this is a great product and would recommend this for watching and streaming you favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Pravesh"}, {"rating": 5.0, "review": "It's  great! So convenient and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Scooby"}, {"rating": 5.0, "review": "Got this for my aging mom after she said she wanted to start paying increased cable bills to get movie channels.  The voice commands is what really makes this wonderful.  It's smart enough to find exactly what you're after through ordinary voice commands and, the best thing, is that it turns itself on just by speaking to it and, so long as the other inputs don't have signal going into TV, my mom doesn't have to fool with input selections on her remote.  I'd be toast if she had to.  Best option for luddite type users by far.  Now, my mom is seeing any movie she wants off my wireless network for no additional monthly cost.  She's really enjoying.  To give you an idea how easy this is to use, she returned her iPad because it was \"so complicated\".", "verified": true, "helpfulness": "0/0", "author": "Mr Pink"}, {"rating": 5.0, "review": "The actual unit is very very good and we have had a lot of enjoyment out of it. The one downside is that direction in how to insert the battery into the handheld is totally useless. I had to search on the web and found many people adking the same. In the end I found the answer use a bladed instrument to persuade the catch to open. Its a shame it was such a silly criticism.", "verified": true, "helpfulness": "0/1", "author": "Cameron R Welch"}, {"rating": 1.0, "review": "It didn't power on when activated. It wasn't the power supply, but the module itself failed. Better Q.C. at the final check out would be more helpful. Maybe better tracking of the item during re-certification of repair. Now I am stuck trying to get this thing back to Amazon!", "verified": true, "helpfulness": "2/4", "author": "John Markley"}, {"rating": 5.0, "review": "Santa got it here in time!  Amazon Prime is the best!", "verified": true, "helpfulness": "0/0", "author": "Julia M. Lajoie"}, {"rating": 4.0, "review": "My husband likes this, I don't know myself I haven't been able to get close to it yet.  He'll never leave the house again there's so much to watch.  He say's it's easy to hook up and work too.  I purchased the game controller in addition but am concerned that there are not a lot of games that you can use on here...hoping that they will expand the more popular it becomes.", "verified": true, "helpfulness": "0/0", "author": "KJT"}, {"rating": 1.0, "review": "did not do anything still need pay tv service", "verified": true, "helpfulness": "3/5", "author": "daniel holley"}, {"rating": 5.0, "review": "YES! I got rid of cable and this had made the transition so much easier. It is so much faster than Apple TV not as cluttered as the Roku, and just an all around great machine.", "verified": true, "helpfulness": "0/0", "author": "Cswdodge"}]