[{"rating": 5.0, "review": "I just simply love Chrome cast . It works great, it has many more apps than before. And the fact that it is controlled by my phone is even more amazing . I'm very happy with this product.It was given as a Christmas gift from my boyfriend last year .", "verified": false, "helpfulness": "0/0", "author": "Greyshka"}, {"rating": 4.0, "review": "Ok the product perfect", "verified": true, "helpfulness": "0/0", "author": "Mariano"}, {"rating": 5.0, "review": "How can you not love this product!!!  :)", "verified": true, "helpfulness": "0/0", "author": "Marilyn Bailey"}, {"rating": 5.0, "review": "EZ to install it was delivered as promised", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 3.0, "review": "okay", "verified": true, "helpfulness": "0/0", "author": "Brent Govia"}, {"rating": 2.0, "review": "Hard time setting up and understanding the limitations on the router.  Its not easy if you dont have the router that you need.", "verified": true, "helpfulness": "0/1", "author": "Galapagos"}, {"rating": 5.0, "review": "I use my computer on second floor and broadcast the movies in the living room, first floor. It makes entertainment easier and faster, and it is not bulky. I am happy with it.", "verified": false, "helpfulness": "0/0", "author": "Faramarz Geoola"}, {"rating": 4.0, "review": "I purchased one of these for my Son's dorm room (college students seem to watch most entertainment from their laptops). Coupled with a 32 inch LED TV it was a great addition to a college dorm. I liked it so much that I outfitted my 2 home TV's with Google Chromecast. Now I can watch Netflix or Hulu from my IPhone on the big screen.It plugged in easily, had a supplemental power adapter (in case your TV was the older non-powered standard of USB) and was relatively easy to setup. When streaming there is some delay before the big screen \"kicks in\" - it's not quite as snappy as the commercials, but I found it tolerable. The quality of picture and sound matches what you will see on the laptop.A couple of caveats. It only works with a wireless network. Your device (laptop, desktop, IPhone, iPad, tablet) has to be on the same network with no routing. In other words, they have to share the same \"set\" or \"class\" of IP address. If the Chromecast is 192.168.1.10 and your IPhone is 192.168.3.10 it probably won't work (it's that 3rd number that kills it).  but if the 2 devices are 192.168.1.10 and 192.168.1.12 it probably will work.That's going to match home networks easy peasy. The only disappointing aspect is if you have a mixed network, were your desktop is wired with a cable to your router, but everything else is wireless, you cannot stream from the desktop. It all must be wireless.All in all a great product and a new world of home entertainment.", "verified": true, "helpfulness": "2/2", "author": "Mark A. Kruger"}, {"rating": 5.0, "review": "Great gagdet!", "verified": true, "helpfulness": "0/0", "author": "ricardo"}, {"rating": 5.0, "review": "Everything works perfect.", "verified": true, "helpfulness": "0/0", "author": "Jeremías"}]