[{"rating": 3.0, "review": "Bought mainly to stream from my Synology NAS (ds214 play).Cons: DSVideo won't work with https (chromecast needs a trusted certificate - good luck trying to find one). http works fine though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "mistyandebony"}, {"rating": 5.0, "review": "Really love the simplicity here, my only complaint (and this is inherent to any of these types of devices) is that it's annoying to change the TV source back and forth between lets say a cable box and the Chromecast. It's still a 5-star product for the price though, I can't blame them for the TV interface. I could get a \"connected\" TV for a lot more if I needed a better experience.Wish it was easier to stream Amazon Instant Prime, but doing it through a chrome tab works just fine.", "verified": true, "helpfulness": "0/0", "author": "Tara T"}, {"rating": 5.0, "review": "Can't do without it now, it's a must have device and very portable", "verified": true, "helpfulness": "0/0", "author": "oluwaseun ayankoya"}, {"rating": 1.0, "review": "Piece of sh*t!!I've had this for over 8 months and when it actually works it is fine but therein lies the rub.I typically have to spend 30 minutes every time I fire this thing up just to get it to cast a video from my PC to my TV.This is unacceptable...By way of reference, I have almost as much electronics in my house as they do at NASA so I know technology inside and out and am an expert in the field.I have tried everything under the sun to get the Chromecast to work flawlessly and yet it still has a mind all of its own.If you do buy this be prepared for many hours of wasted time and plenty of frustration.NOT recommended!!", "verified": false, "helpfulness": "0/1", "author": "snowbound"}, {"rating": 5.0, "review": "I really just wanted a device that allowed me to watch Hulu or Google Play Movies and TV shows without needing to hook up my computer to the TV. It seemed that all the other options out there had odd limitations. Apple TV seemed to have expensive rentals and was kind of difficult to navigate. Roku had fifty options, all more expensive than a Chromecast.  I finally talked to a friend who had one and showed me how he used it with his MLB At Bat subscription.  Sold.  I decided to order one myself and it has been awesome.It takes about 10 minutes to set up (mine had to download a software update out of the box) and does what it says. I have cast video from my phone, tablet, and my computer. I have seen no stutters or buffers (my home internet speed is about 12mb/s) and the video has been crystal clear. We did notice some issues with casting from Amazon prime. You cannot full screen it, so that is a huge disappointment, but we found the TV shows we wanted available from other sources that DO allow them to be casted.  We hope Amazon will change their minds on this exclusion.Finally, I did try and cast my screen outside the Chrome browser (which is a beta), and it did \"ok\". There was noticeable lag with the screen, but it was nice being able to show a document on my screen without needing everyone to gather around the small laptop screen.  I have yet to try a powerpoint, but I hope it works well.My advice is, go get one if you have the need / want for such a device.", "verified": true, "helpfulness": "0/0", "author": "Don Dudley \"DD\""}, {"rating": 4.0, "review": "good for the price", "verified": true, "helpfulness": "0/0", "author": "Durango \"durango81\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "slima"}, {"rating": 5.0, "review": "This is great, for the price and function it's awesome, we use it for Playon and it works great!!", "verified": true, "helpfulness": "0/0", "author": "Paul D Badyna"}, {"rating": 5.0, "review": "So much fun and a nice alternative to my Roku.  I have this one up in my bedroom for that TV.  A little clunky to set up the first time but it has worked great and allowed me to access HBO Go before Roku settled their little thing with Directv (glad I can now watch HBO Go on Roku AND Chromecast.", "verified": true, "helpfulness": "0/0", "author": "TAS ATL"}]