[{"rating": 5.0, "review": "Love it! It works wonderfully and I have had zero problems with it. .", "verified": true, "helpfulness": "0/0", "author": "Cat Gallon"}, {"rating": 4.0, "review": "Was on the fence about getting the Roku 3 or this. This item is good but for the added memory I expected a lot more. It took some exploring the help section in order to find out how to get Netflix to work. Should not have been that difficult. Even though I got the Fire at a discounted price, in hindsight I should have saved my money and kept on using my older Roku that still worked perfectly. The discounted price did not equal what I received in the new Fire.", "verified": true, "helpfulness": "1/1", "author": "Shirley A. Challingsworth \"shirleeac\""}, {"rating": 5.0, "review": "The Fire TV is my new favorite streaming device.  The faster processor and additional memory take it to the head of the class as far as technology is concerned.  As an added bonus, the voice recognition is quite good.  However, be aware that the voice recognition only works with Amazon media.  Hopefully Amazon can figure out a way to extend the voice recognition to third party programing such as Netflix. Another bonus is the toslink connection so that you can run high definition audio to your stereo/surround sound system.  This product is a winner!", "verified": true, "helpfulness": "0/0", "author": "Mel Bowers \"deal maker\""}, {"rating": 3.0, "review": "The wireless connectivity is spotty at best - the AppleTV works 100% of the time!", "verified": true, "helpfulness": "0/0", "author": "Robert A Sieger"}, {"rating": 5.0, "review": "Must have product for a cord cutter. Totally awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Booey Bindoy \"Bindoy\""}, {"rating": 4.0, "review": "Amazon Fire TV expanded my viewing university with an efficient mechanism that takes up minimal space. For those of us who are not techno-savvy, though, it took 4 hours to figure out who to set it up and get it working. My only complaints are that advertising should indicate that an HDMI cable needs to be purchased before you can even install AND there should at lease be a small manual (at no extra cost) to provide explanations with visual aids for setting up the device.", "verified": true, "helpfulness": "0/0", "author": "drcmb"}, {"rating": 4.0, "review": "Met expectations... but no wow factor.", "verified": true, "helpfulness": "0/0", "author": "Jason S"}, {"rating": 5.0, "review": "It is awesome. I use it everyday. It has lots of apps where I can watch my favorite shows and I can also play. It is the best!!!", "verified": true, "helpfulness": "0/0", "author": "Denisse"}, {"rating": 3.0, "review": "Not how to rate as everything I looked for you had to buy.  Was a gift so no money out if pocket. My son did like the games it has.", "verified": true, "helpfulness": "0/0", "author": "Donna"}, {"rating": 4.0, "review": "For a small and portable media device, this is a powerful little device. Being able to also play games is a plus. I definitely like the way the unit connects with my kindle and how the gaming remote works with the Kindle as well. It's also synced so I can upload photos to the fire tv without making any connections. Considering I use it nearly everyday I'd say I'm pretty pleased with it. The design and layout make finding what you want some and easy, and the voice searches speed that up even more. The L only thing keeping this from being a 5 star product is their needs to be more games otherwise I'm extremely happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Dee"}]