[{"rating": 3.0, "review": "My mother inlaw bought this for us to try. I wish she got the roku but she did not ask me. We have had an Apple TV for years as our only tv we gave up cable. I buy all my movies with amazon so the fact that this can not play amazon videos is a big problem.The quality is good it keeps up and loads fast so it does a good job. I just wish amazon prime videos worked on it. Maybe soon they will. I also like to have a menu on the screen with this you have to use your tablet or smart phone to use it. That's kind of annoying. But all and all it gets the job done but I think a roku would be better.", "verified": false, "helpfulness": "0/0", "author": "Tahoejeepmom \"Sarah\""}, {"rating": 4.0, "review": "Works pretty well.  Just remember that when going through the setup, and it asks you to choose a name, stick with the one that is automatically given, or else you wont be able to connect.  Learned that the hard way.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Stajkowski"}, {"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "Nan Lop \"Nan\""}, {"rating": 3.0, "review": "I feel my chromecast would work 3000x better if I didn't have a horrible Time Warner router that I had to use in my house. It is pretty laggy with the TWC mandated equipment. Other than that, works well.", "verified": false, "helpfulness": "0/0", "author": "Jesse H"}, {"rating": 1.0, "review": "Now a long time after it came out, it still doesn't support native Amazon streaming.  Useless.", "verified": false, "helpfulness": "0/0", "author": "Snaildarter"}, {"rating": 5.0, "review": "I won one of these in a contest and was hooked. I have since bought one for every TV in the house.  It's much easier to browse Netflix in your phone and cast it than to use a remote to find what you are looking for.", "verified": true, "helpfulness": "0/0", "author": "C. Washington Jr."}, {"rating": 2.0, "review": "I got Google Chromecast so that I could watch HBO GO on my TV. Unfortunately, Chromecast freezes ALL the time. It's excruciating to try to watch something on it. Also, whatever I'm streaming from my computer will sometimes become un-synced with what's on the TV, so I lose control of what's on the TV (can't pause, stop, etc).  Overall, this system seems buggy. I also have Roku, and almost never have problems with that.", "verified": true, "helpfulness": "0/0", "author": "Nina"}, {"rating": 5.0, "review": "I really enjoyed this device.  Only wish there were more applications that could use it.", "verified": false, "helpfulness": "0/0", "author": "S F. \"lead63\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Bob Davies"}, {"rating": 5.0, "review": "Excellent for what I need it for- Casting Netflix and ESPN from my iPad and now casting tabs with Google Chrome. Easy to set up on my WiFi network and definitely the most affordable option out there. I've been happy everyday of the last two months of ownership.", "verified": false, "helpfulness": "0/0", "author": "Kevin"}]