[{"rating": 4.0, "review": "As described, product met all expectations.  Quick shipping.", "verified": true, "helpfulness": "0/0", "author": "James Carrozza"}, {"rating": 1.0, "review": "Be wary if expect the offers that are advertised to actually be available!Additionally, very low quality product as casting from phone or pc to tv produced very choppy pictures.Amazon has been great about addressing my concerns and I am returning this product.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rinickulous"}, {"rating": 2.0, "review": "When it worked, It worked great and made my tv into a sort of smart tv. I watched movies and shows from my chrome browser and really enjoyed it. After a week and a half the wifi refused to connect to my network. I plugged the chrome-cast back into the computer and tried trouble shooting it with no success.", "verified": true, "helpfulness": "0/0", "author": "Hash"}, {"rating": 5.0, "review": "Extremely easy to install and use. There's like 3 steps: plug in, download app on device, find something to watch. Cool pictures when nothing is playing. There's an extremely short cable in the packaging that you can use to plug in between the TV and chromcast that allows you to move the device around to get the best reception for your WIFI.", "verified": true, "helpfulness": "0/0", "author": "Vince"}, {"rating": 5.0, "review": "My family loves this product. It is so easy to set up and start using. We bought one for each to in the house.", "verified": false, "helpfulness": "0/0", "author": "M. Zigler"}, {"rating": 5.0, "review": "Use it a ton. Great product", "verified": true, "helpfulness": "0/0", "author": "Bodhisattva"}, {"rating": 4.0, "review": "Great device. Used to use my Xbox 360 for streaming but this little device works soo well no need for xbox.", "verified": true, "helpfulness": "0/0", "author": "M. Perez"}, {"rating": 5.0, "review": "A-OK", "verified": true, "helpfulness": "0/0", "author": "victor v."}, {"rating": 5.0, "review": "The entire family is enjoying being able to cast the apps from our phones and tablets to the tv. Now we can watch Netflix together! At first I thought that the apps were on the product but it doesn't work that way. You cast the apps from your phone the the chrome cast. It's obvious now... It works well and my family loves it!!!!", "verified": true, "helpfulness": "0/0", "author": "Hermelinda Castro"}]