[{"rating": 5.0, "review": "My husband and I debated getting amazon fire TV for a few months and we are glad we did. We have a smart tv but when we would try to stream a movie from Netflix we had a lot of problems. Now we can stream in ease. No problems. We also joined amazon prime and are 100% satisfied with the movies provided and the streaming.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Clift"}, {"rating": 5.0, "review": "Good like it ok !", "verified": true, "helpfulness": "0/1", "author": "Ernest Flowers"}, {"rating": 5.0, "review": "I love this thing. I've had it a couple of weeks, and I am still exploring. We did have one problem with it. Yesterday it stopped streaming videos. Just came up and either said player error or another message telling us to clear all data in the settings. I know I had lost my internet connection, but it wasn't as easy as just resetting my modem. We fiddled and fiddled and did what it said, after reconnecting the internet we had to clear the data. This fixed it , and it is now working perfectly again. My only complaint is that troubleshooting information was hard to find. Even the error messages were not easy to understand. In spite of that, if it had needed to be replaced, I would have been counting the days. I love this thing. It's sooooooooooooo wonderful to be able to watch movies and TV series without commercials. The picture is crystal clear and it's really easy to use. The voice search works extremely well. There are tons of free shows to watch, and free good music as well that you can play on your other devices free of charge. I will gladly renew my Prime subscription, even if I do have to pay for a movie once in a while. Also note, jaded Directv users- Amazon charges much less to watch a new movie. If I could get Fox News on it, I'd cancel Directv.  I am extremely happy with this purchase, even with the little problem.", "verified": true, "helpfulness": "1/1", "author": "ibsharkbait \"IBsharkbait\""}, {"rating": 4.0, "review": "I am amazed at the quality of this device. I love the convenience and the clarity. HOWEVER, this device doesn't want to stay connected to the internet. We previously used a very old Wii to watch Netflix and Hulu. Never had issues with episodes stalling in the middle or with the device refusing to connect after watching for a few hours.The Fire TV loses connectivity and has to be restarted at least once a week. I don't know if others have this issue. What is most annoying is that you can't just restart it from the remove. You have to physically get down and unplug the box. Ugh!I like the device. I think it's a good device but can this issue please resolved with an update?", "verified": true, "helpfulness": "1/1", "author": "Jlrow"}, {"rating": 3.0, "review": "I've had it for a day and so far here are my first impressions.The Netflix app runs fine. I've watched a couple of episodes of Deadliest Catch and The Pianist and the quality is great. No hiccups what so ever. I also like being able to use a keyboard when searching for apps and movies. I plan on buying a wireless keyboard when I have the chance. The setup was a snap, Everything about the unit is simple, and I don't have a problem with the size of the device and remote.Sadly some of the apps aren't that great. I've downloaded apps for Vimeo, YouTube and Twitch and I wasn't too impressed with them. Videos take a while to load on Vimeo and YouTube and they tend to be choppy. My problem with Twitch is I can't watch streams from people I follow, or it's what I've noticed. Hopefully they'll update it so we can. It also would've been nice if there was a power button on the remote so we can turn off the device when we're not using it.Overall I'm happy with it. Granted I didn't have to buy it, but this way I don't have to turn on a gaming console just to watch a movie. I may buy the controller but it isn't a top priority. Four and a half stars.Small update: I had a little hiccup with Netflix while watching The Pianist, but it only lasted for a second. I also should mention I have my Amazon TV connected through wireless, so there's a small chance that played a small role in the little hiccup.Second update: I've since bought an Anker wireless keyboard, which is handy, especially for those who don't want to use the voice command and/or use the remote to search for titles. Sadly, I had to drop the rating to three stars. When I first got it I rarely had any hiccups, but now it seems like I have one every five to ten minutes whenever I'm watching something on Amazon. I haven't had too many problems with Netflix however. Again, it might because I have it connected to wireless, but I should've had this problem when I first got it and not several months later.", "verified": true, "helpfulness": "5/5", "author": "Steven J. Moore"}, {"rating": 1.0, "review": "The final cost of the programs available were to costly. Besides, my Samsung DVD player had access to most of the programs  available as the Amazon Fire TV.", "verified": true, "helpfulness": "3/8", "author": "Richard E. Fischer \"Television transmitter\""}, {"rating": 5.0, "review": "This is great.  Very easy to set-up.  Being able to watch Amazon Prime shows on my TV is great.  It's so small that I easily move it from the living room to the bedroom.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Ruby\""}, {"rating": 5.0, "review": "This is another fabulous item from Amazon.  Easy to use and install, esp. when you are not a whole lot techy savvy!!!!!!!We are using it constantly, esp. in the summer months when evenings are too hot to be outside and the TV lineup is less than desirable.  We belong to Amazon Prime which is worth every penney, in my opinion!", "verified": true, "helpfulness": "1/1", "author": "MaryO"}, {"rating": 5.0, "review": "still learning all of the ways to use it but we are finding more movies then all of the cable channels offered and using the unit is very easy at finding a movie by just saying the name into the microphone.  Wish I had done this as early as it was sold.", "verified": true, "helpfulness": "0/0", "author": "Anita Camozzi"}, {"rating": 5.0, "review": "Love it so much we bought a second.  It works seamlessly.  A breeze to set up, the picture is great and the remote is wonderfully simple.  My favorite new device. It's also so small I can put it in my handbag when we go on vacation to use at our rental house.  Totally useful, great price.", "verified": true, "helpfulness": "1/1", "author": "Runsilent"}]