[{"rating": 5.0, "review": "Very easy to use. Voice search is first rate. Better than everything i have ever use because i speak with accent.", "verified": true, "helpfulness": "0/0", "author": "Dan Hoang"}, {"rating": 5.0, "review": "Works great once you update the software. Very nice mobile apps to replace the remote.", "verified": true, "helpfulness": "0/0", "author": "D. Earls"}, {"rating": 3.0, "review": "Good product, but can't get miracast to work and it is mostly centered around Amazon Prime. It has Netflix and a few other things, but the majority of the homepage is Prime video.", "verified": true, "helpfulness": "0/0", "author": "Zach Regan"}, {"rating": 1.0, "review": "Nothing near what we anticipated.  Send me areturn authorization", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The Amazon Prime films are oldies that offer little updated selection.", "verified": true, "helpfulness": "0/0", "author": "Diane Gallagher \"film student\""}, {"rating": 5.0, "review": "As advertised. Works just fine. Voice command actually works!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Quick service. Works as it should.", "verified": true, "helpfulness": "0/0", "author": "Doug Eagler"}, {"rating": 5.0, "review": "It's so fantastic...I can hardly believe it!!!! Words can not come close to describing how wonderful it is..Thank You Amazon..!!!!", "verified": true, "helpfulness": "0/0", "author": "James Duggan"}, {"rating": 4.0, "review": "The Fire TV is great! It was very easy to set up, and is fast. The only reason I did not give 5 stars is because I was expecting more for the free movie/show choices. Most of the shows my kids would like to watch are not free. We rely on Netflix.", "verified": true, "helpfulness": "0/0", "author": "mags4582"}, {"rating": 1.0, "review": "As a Prime member, Fire does nothing extra for me.  I do NOT want to pay more for things like HBO, Netflix, etc.  Getting Amazon Fire TV and HBO GO will NOT get you Game of Thrones!!  I think the advertising is misleading.", "verified": true, "helpfulness": "0/4", "author": "Mike Ober"}]