[{"rating": 5.0, "review": "I love this thing and use it every day.  It's great for streaming netflix from your phone or tablet.  Not sure exactly how it works but it seems to take over streaming and the phone/tablet just acts as a remote control.  This means your batteries don't die as fast as watching it on your portable device.Setup is really easy,  I recommend if you have a USB on your tv to just power it that way.", "verified": true, "helpfulness": "0/0", "author": "Taloncard"}, {"rating": 3.0, "review": "Still missing some apps to cast. It does have YouTube, Hulu and Netflix. It works great and would highly recommend it for college students who want something minimal. I believe Google is still working on adding more apps to cast. It can only get better from here. Get Roku instead if you want more online channels.", "verified": true, "helpfulness": "0/0", "author": "Amelie"}, {"rating": 5.0, "review": "Purchased this as a gift for my son for Christmas. We're both very happy with product and functionality of the Chromecast. Works great with his TV/Soundbar and iPhone. Great value.", "verified": true, "helpfulness": "0/0", "author": "Dannyboy"}, {"rating": 3.0, "review": "just another $$$$ soaker.  I seldom use this on my 'smart tv' because it is such a pain to hook up to, and actually get to the websites I want to use.", "verified": true, "helpfulness": "0/0", "author": "Rosanne"}, {"rating": 5.0, "review": "Google Chromecast makes it easy to watch and listen to mobile and internet videos and music on your tv. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Jason Pawelsky"}, {"rating": 4.0, "review": "An excellent p product very affordable, easy to use. Wish it was more compatible with more apps and mobile Web usage", "verified": true, "helpfulness": "0/0", "author": "cdkb1977"}, {"rating": 5.0, "review": "Everyone should have one of these. Fantastic for trips, home use.  Gifted these out and everyone has been happy. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Deli"}, {"rating": 4.0, "review": "This device is awesome!!!  I can watch and manage netflix pic and music through my phone. I  didn't give it 5 stars because they don't have enough apps. but over all this is a great device!", "verified": true, "helpfulness": "0/0", "author": "Margarita Guzman"}, {"rating": 5.0, "review": "Wow! What a great idea. We bought 4 so we could watch streamed programs on any TV in our house. Such a great idea at a reasonable price! I would highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "C Jensen"}, {"rating": 3.0, "review": "This is a great idea, but the programing that you can get on the apps is terrible,  People in the US are not really interested in watching Korean TV soap operas.  Having to depend on Comcast to get this thing to work is not very original.  NetFlix etc. are on televisions, smart phones, and blue ray disc players  Good price at $35.00, but very little to watch", "verified": true, "helpfulness": "0/0", "author": "B. Butler"}]