[{"rating": 5.0, "review": "Very good product! easyly up, at first i had a problem setting up my tv, but i realized that was wireless configuration.", "verified": true, "helpfulness": "0/0", "author": "Nestor"}, {"rating": 5.0, "review": "I wish I would have bought the chrome-cast sooner. The only complaint I have is the inability to stream movies.", "verified": true, "helpfulness": "0/0", "author": "Stefan"}, {"rating": 5.0, "review": "The Google Chromecast exceeded my expectations. Easy set up and very unobtrusive. Paired with a fast WiFi connection, the optimized apps work flawlessly; casting from Chrome is added convenience.", "verified": true, "helpfulness": "0/0", "author": "Janeil"}, {"rating": 5.0, "review": "I live for my Chromecast. It's so easy to use that i finally took the plunge and became a cord cutter. Set up is pretty easy and I've got the apps on my laptop, phone, and tablet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little thing is great. I love using my phone a remote. It has all the apps I need to watch TV and listen to music. I just wish Netflix would play the next episode without telling it to. Great price, great product.", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 1.0, "review": "Besides having limited apps that are iPhone compatible it loses connectivity and is slower than christmas. Splurge the extra $20 and get a Roku.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Becraft"}, {"rating": 4.0, "review": "This is the second Chromecast that I have bought, I just wish that there were more apps for movie streaming, although with this one for some reason it won't cast from my Ipad very well in Netflix.", "verified": true, "helpfulness": "0/0", "author": "mrsdahling"}, {"rating": 3.0, "review": "Although in the adds for this product they give you the illusion that you can stream anything from your tablet to your TV. the truth is, it is limited. I mainly use it to stream youtube videos, for that it works Great.One more thing, it needs a power supply, funny again in the adds I didn't see a cable hanging out of it, but their is one other wise it wont work.The power cable is supplied and two option either connect to your TV USB port or through power out let.I tried it with two SONY TVs the older one did not work when power supplied through the TV USB so i had to plug it in to wall out let. The newer TV worked fine.Set up very easy.Youtube videos looks great when I watch it on a 45\" TV rather than my tablet :)Still not happy with the stupid power cable and that its limited on stuff you can stream.", "verified": true, "helpfulness": "0/0", "author": "A. Asiri"}, {"rating": 1.0, "review": "Very bad product. We lost de signal after a few seconds from satr to reproduce netflix, google play, bbc, and others. And the assistance its not clear and. I really feel that l lost my money. Solution: Buy apple tv.", "verified": true, "helpfulness": "0/2", "author": "Alejandro Santa Martinez"}, {"rating": 5.0, "review": "Excellent product, easy to install and use. Lots of compatible apps, great price and of course a ...happy satisfied buyer!", "verified": true, "helpfulness": "0/0", "author": "RASR"}]