[{"rating": 5.0, "review": "It's taking the place of our local fiber optic Internet and satallite hookup.", "verified": true, "helpfulness": "1/1", "author": "Shawn Hudspeth"}, {"rating": 5.0, "review": "I love it. I can see Netflix and Amazon Prime movies on the big screen now. I'm so excited! Fire TV was easy to set up too. All I had to buy extra was an HDMI cable available at any computer/office supply store. SO easy!", "verified": true, "helpfulness": "1/1", "author": "parrington43"}, {"rating": 5.0, "review": "My favorite thing about this box is how fast it responds and starts Amazon videos.  It's almost instant.  The other perk is that it keeps other apps in memory.  For example, if you're watching a Netflix video, switch to an amazon prime video, then back to netflix, you don't have to start all over searching for the Netflix video that you were originally watching.Overall, waay better than the dvd player that I was using previously.", "verified": true, "helpfulness": "1/1", "author": "Bigsteve87"}, {"rating": 4.0, "review": "Absolutely easy setup!  Functions perfectly.  The voice search on amazon prime is superb.  I wish I would have known the amazon stick was coming out and I would have waited for it.This device, however, is awesome.", "verified": true, "helpfulness": "1/1", "author": "S. Smith"}, {"rating": 3.0, "review": "Nothing special and my first one had major audio issues but my replacement so far is ok it  just buffers more than it should.I don't know why it cannot download better maybe cause it live streams the feed instead of downloading the content on the fire tv unit??", "verified": true, "helpfulness": "0/0", "author": "Shane O"}, {"rating": 3.0, "review": "I just received my Amazon Fire TV.  I also have At&t; U-verse.  Do i have to unplug the HDMI cord every time i want to switch from the U-Verse to the Amazon Fire TV?  I will write a review once i watch it for a while.  I was a very easy hookup.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Sharon\""}, {"rating": 4.0, "review": "Ordered this despite some so-so reviews.  It is lightning fast and I love the fact that I can mirror my Kindle to my TV screen.  It is small and compact and extremely accessible with absolutely no start up time at all.  My only issue is the interface and Amazon's video library.  If they were able to connect the Amazon Prime Music Library to the Fire TV, tweak the interface a little and add newer movies to the Prime library then it would be an amazing must-buy deal.", "verified": true, "helpfulness": "1/1", "author": "Daniel Macias"}, {"rating": 5.0, "review": "fantastic really enjoying it", "verified": true, "helpfulness": "0/1", "author": "Dianne McCrosky"}, {"rating": 3.0, "review": "Easy to install and set up, I like the remote and onscreen menus. My only complaint is where is all of the supposed free content to Prime members?  There should be an app for the free programming!  Get on it Amazon!", "verified": true, "helpfulness": "0/0", "author": "Christine McDonald"}, {"rating": 3.0, "review": "Absolutely awful purchase.  Video playback is horrendous as it freezes every 30 seconds or so.  Wifi connection was not the issue as signal strength is fine in all parts of the house.Update: 26 DEC 2014Was able to get it to function with just an occasional hiccup for about a day.  However, when I was scrolling through the list of downloadable apps I got a blue screen of death for about 2 seconds and then I was returned to the home screen.  From there I was unable to navigate using the remote.  Troubleshooting that issue was not high on my list of things to do given the amount of time I had already invested in trying to get this thing to work the way everyone else seems to rave about.Was it just a faulty box? I suppose so, given that I haven't encountered many reviews with this (these) issue(s).  Am I impressed? No way, and I will not change my one star rating.  Despite all the negatives, I will say the set up was extremely easy, but that hardly matters if the device doesn't function properly.UPDATE:I thought it would only be fair to update this review, as I have received a replacement box and have not had a single negative issue to deal with.  My wife is happy; I am happy.  We especially enjoyed being able to upload pictures of our travels to our Amazon cloud and have them playing in the background during our family Christmas Celebration.  There have been no negative playback issues, no blue screens of death, and no instances of video stopping.  I would rate this box a five and the previous box a one, which is why I have modified the overall review to three stars.", "verified": true, "helpfulness": "3/6", "author": "Ingenious Mr Toad"}]