[{"rating": 2.0, "review": "I purchased this product as a fun device to my 2nd tv because it was really cheap (~$25). I received this product today and was really excited about it. The product wins in the packaging and installing department! it was really easy and fun to set it up (less than 3 mins) however performance wise this device has some issues. First of all this device is really slow and Lags all the time (internet speed ~ 40mps) no matter what app you are using (Netflix, HBO). You need to give it so much time to buffer videos from your applications and that ruined my whole experience with it. I had higher expectation from google and going to return this product ASAP. If I were you I would save my money and buy a either a roku 3 or an apple tv (own both of them and very pleased with their performance).", "verified": true, "helpfulness": "2/2", "author": "V. Saeidi \"sean\""}, {"rating": 5.0, "review": "This is how I like to get things to my TV! We've had a roku for a couple of years and prefer this because of the user experience and interaction", "verified": true, "helpfulness": "0/0", "author": "A. Loudenback"}, {"rating": 5.0, "review": "So, why do we need cable? This little gadget allows me to watch all the shows that I want with just a subscription to the streaming media sites with the same clarity and without problems at my own pace.", "verified": true, "helpfulness": "0/0", "author": "J. Bauza"}, {"rating": 4.0, "review": "I bought this little thing to be able to take online course and watch course videos on my HDTV, works like a charm as I don't really care about streaming videos from other applications other than Chrome. Out of curiosity I also tried watching Netflix and YouTube from my Android phone and again it delivers what I expected (in this case your phone behaves like a remote control which is pretty neat).I will give it five stars if it didn't crash on me, mostly from streaming from Chrome. But hey it's a piece of hardware that is driven by a piece a software, what do you expect?", "verified": true, "helpfulness": "0/0", "author": "Chih C. Von"}, {"rating": 5.0, "review": "Chromecast will do way more than you think! Several books are available to get the most out of this product. Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "David Thomas Reida"}, {"rating": 3.0, "review": "Bought it to go with my Prime videos.  They don't work together.  But it works fine streaming the internet and other movies we have on our media center.  I guess I'll have to buy the Amazon set top thing they just released.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I'll first admit that, though I'm usually pretty tech savvy, I didn't initially realize that Chromecast does literally nothing on its own - it needs a device to stream to it (your phone, PC, tablet, etc).  I got over this pretty quickly because once \"casting\" to the Chromecast, battery life on one's device isn't impacted as terribly as I initially expected. Still, I made sure to place charging cables near my comfiest movie-watching-chairs.That aside, we quickly found performance to be a real problem. After a chunk of time watching Netflix, the stream would start to stutter continuously or until the audio and video were completely de-synced.  This happened about 50% of the time while the Chromecast and connected device were less than fifteen feet from the router.  Stopping and re-initializing the stream did nothing to solve the problem, but merely delay it another few minutes.Then, after the most recent Chromecast update (writing this as of 5/7/2014), our ability to stream Plex (the sole purpose we didn't return it after the Netflix issues popped up) was completely obliterated by freezing issues that would happen every six-to-eight seconds and last about ten seconds each - a buffering that would never quite buffer, if you will.A good number of web-dwelling trolls would point to network signal strength or the ability of one's PC to transcode properly (Chromecast will only watch one format - it's everything else's job to transcode properly to that format, leaving lots of places for various updates to break things down), however neither were true culprits.  More likely, as some diligent users discovered, the problem was caused by Chromecast firmware updates rolled out universally for the European hardware release - they appear to have made it decidedly more difficult to work with AES network encryption.  Well, the router provided by my ISP has three options: AES, AES + TKIP, and none.  Therefore, if I want my network encrypted, AES has to be enabled one way or another.I give the Chromecast two stars for being somewhat useful and doing the job of more expensive devices in a cheaper way (provided you have a smartphone, tablet, or PC, ya' caveman), but it did neither of the things I needed it to do (advertised features, no less) in an acceptable way.  With the addition of apparently rolling out an update that worsened performance for many (only Apple is afforded the luxury of being allowed to ruin their customers' devices), I decided it had to go back.To put it simply, it doesn't do what it says it does.  Not for me. :-\\", "verified": true, "helpfulness": "1/1", "author": "cathy720"}, {"rating": 3.0, "review": "Does the job its intended to do but if you dont have a decent internet connection or bandwidth it needs to be rebooted every 20-30 mins. Gets annoying. Both of our units do this so its not a defective product.", "verified": true, "helpfulness": "0/0", "author": "Henry Lemasters"}, {"rating": 5.0, "review": "Exactly what I've been looking for. This product came within the expected shipping time and it was in great condition. I don't have cable, so it allows me to watch Netflix or even YouTube videos on my tv from my laptop, which is awesome. I would definitely recommend getting one of these.", "verified": true, "helpfulness": "0/0", "author": "Claire Sewell"}, {"rating": 4.0, "review": "Absolutely no complaints on how it works. Really there are many other devices that do the same thing, so I ended up giving this away. But it works great.", "verified": true, "helpfulness": "0/0", "author": "Ed Figueroa"}]