[{"rating": 4.0, "review": "I originally bought a Kindle Fire to watch streaming video.  I don't like sitting at the computer and my smartphone was a little small.I duly upgraded to a Kindle Fire HD, then a Kindle Fire HDX.  The latest version offers mirroring, which means you can watch video from your Kindle on your TV.  This works fine, except that the picture quality is mediocre, and the sound is nothing to write home about.  I have a 6.1 surround sound system and a large collection of Blu-Rays, so I'm a bit spoiled when it comes to fidelity.With the Fire TV, it's a big step forward.  The picture quality is astonishing; almost as good as Blu-Ray.  There's an option for connecting the unit to my surround sound system (just need to buy the cable).The unit is very easy to set up and use, and the voice search is nice; but as most people know by now, it works mostly with Amazon Prime.  On my setup it does access Hulu Plus (sometimes), but with Netflix, you have to use the manual search method.Also, the music on your Kindle is not available.So, while it's a great improvement, there's still a way to go before it's really a killer product.  However, I didn't really love the Kindle Fire until I got the HDX; so I'm confident that later versions of Fire TV will make major improvements.However, if you don't have Amazon Prime and/or own a Kindle, this unit may not be the best choice for you.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer \"soul_survivor\""}, {"rating": 4.0, "review": "Saw Fire TV on Amazon a few days ago and had to buy it. Enough of those irksome searches! Fire TV is brand new yet there was already an update to be installed during the initial set up. Knowing Amazon, we have no doubt that Fire TV will keep getting better and better a la Kindle with lots of updates and improvements coming down the pike.We are not techies, just ordinary TV viewers with some subscriber services. So the finer details are not much of a concern for us. Our comments are for viewers like us.Set-up: Easy-peasy. Very user friendly. We also purchased a spare remote. Instructions for programming a spare/replacement remote are a snap.What we love: The unit is so small and light weight. Easy to use. Great display. When you need to plug in a password, no phone dial layout to deal with. We also appreciated the clear description of the Fire TV, We knew we needed to buy an HDMI cable. No surprises.Voice-activated search: Needs some work. Despite how clearly we enunciate, some of the choices that appear are way off. Sort of funny the first few times. Then not so funny. Also, I had much better success than my husband even though we could not discern a difference in how we spoke..Minor issues: We had problems getting HuluPlus and Netflix to recognize us as subscribers. Never fear...Amazon tech support--the TV Department--to which we were directed was superb. Very knowledgable and helpful reps.Bottom line: A great start, Amazon. We are very happy with the Fire TV and look forward to it getting better and better.", "verified": true, "helpfulness": "1/1", "author": "Trixie DuBois"}, {"rating": 5.0, "review": "The thing I like most about it that all others lack is its responsiveness. I hated Roku's interface because of this. And I guess i should also make a comparison with the Apple TV while I am at it as everyone does. I feel the Amazon Fire is much more flexible to become more even than what it is now. It has more potential than i see in the other TV set top boxes. Amazon Fire already show cases this with the ability to play games if you are into that. SO although I wont be playing many games on the FireTV except for maybe Candy Crush, I like that is flexible enough to be able to be more.", "verified": true, "helpfulness": "3/3", "author": "s. bern"}, {"rating": 3.0, "review": "Everthing has been said about this but here is my 2 cents:This is a perfect box except...1. No browser preloaded? are you kidding me? I'm sure an app is \"coming out really soon\"!2. No keyboard controls please!3. Unnecessarily difficult to sideload apps.4. 3.5 audio out of remote please (or at least the box).5. Finally there is a decent display of Amazon content with a really nifty voice search controller but I couldn't find a way to isolate paid from free media content. I'm sure this was calculated to augment Amazon's bottom line but is just another reason for early adopters to tell others to wait for Google to do right!", "verified": true, "helpfulness": "4/6", "author": "Thomas J. Plautz"}, {"rating": 5.0, "review": "I just got this, plugged it in, and it worked exactly as expected in my home theater system.I got it because I wanted to watch content that was unpublished on DVD or Blu-Ray.  It syncs to your Amazon account seamlessly.  When you acquire content, it tells you if it is high-definition (HD) or Standard Definition (SD). When you watch it, the content auto-scales so you don't need to change the aspect ratio of your HDTV.  The start / stop / pause / resume controls on the remote work as expected.  The 'voice' control feature took me about 15 seconds to understand and use.  Amazon did this right - it is utterly simple and easy, what any technology should be.  I did not buy the accessory game controller, so I have no information about the use of the product for gaming.  Account navigation with the remote is a breeze.The video and sound quality is the same as if you watched it on DirecTV, etc.  It looks and sounds great! I didn't see any way to select Descriptive Video, so I am not sure if that is available with this product.  One of my titles was made in Sweden, and it came up automatically with English subtitles.  I purchased a title that is unavailable on DVD or Blu-Ray, but it is in Amazon's catalog as an 'Instant Video' title.  It was available instantly after I clicked the purchase button.It does require a high-bandwidth internet connection.  It supports both wired Ethernet (RJ-45 connector), or wireless WiFi.  I used the wired connection and it found the internet automatically.  The one downside to this product is that it is in essence a cloud-based video streaming service. You own the content and play it on your devices on your demand, but it is stored and managed in the cloud (via Amazon Web Services).  The good news is that Amazon does all the set up for you when you purchase your Amazon Prime membership.For an Amazon Prime member who collects and watches movies, TV shows, etc., this is a no-brainer.  I have not yet decided on purchasing the Amazon Fire HDX tablet, but this service would seamlessly work on that device.  I may still choose the iPAD Mini with Retina Display, but I have moved a notch closer to Amazon because of how well engineered 'Fire TV' is.", "verified": true, "helpfulness": "17/19", "author": "Nick Leuci \"Nick at Nite\""}, {"rating": 1.0, "review": "Apple TV also supports voice search and Remote with no line of sight required when you pair with your iPhone.", "verified": false, "helpfulness": "5/73", "author": "Joel Glovacki"}, {"rating": 3.0, "review": "So the headline feature, the one that is supposed to separate this box from all the others, is the audio search feature.  However, it gives me back mainly Amazon Instant Video results and occasionally some Hulu Plus search results but no Netflix results.  I have Netflix and I don't have Hulu Plus.  Also, the Amazon Instant Video results are not marked as such -- looks like you are supposed to just assume that's what it is by default.  The product description should make it clear that this won't search Netflix; the existing product description is seriously misleading, in my opinion.Otherwise it seems like a perfectly adequate media streaming box, but kind of overpriced.  Roku 3 has a similar cost and has a headphone jack in the remote control as its headline feature.  That headline feature seems to work with all its content providers.", "verified": true, "helpfulness": "1/4", "author": "James W. Murdock IV"}, {"rating": 2.0, "review": "Great look, easy to use interface, and fast.  But why on earth would Amazon release a streaming device that doesn't allow you to search for movies or TV shows only within the Amazon Prime database?  This is a critical flaw in the device, and the key reason why I'll be returning it after only having it for one day.  Sorry, Amazon...maybe next time.", "verified": true, "helpfulness": "7/14", "author": "iso1531"}, {"rating": 5.0, "review": "I have been an APPLE Fan Boy for years - 33 to be exact - since my first APPLE Computer, the IIe. I have and still own every piece of technology ever produced by APPLE, including the APPLE TV. I also bought the ROKU 3 in order to have content not available on APPLE TV. While it is true that the AMAZON FIRE TV does not have anywhere near the content available on the ROKU 3, nonetheless it does have the major players, except for HBO GO. I believe it is simply a matter of time before that deficiency is corrected in a future update, which will likely contain a host of other enhancements, unlike APPLE TV which only has periodic puny updates. And APPLE TV does NOT play in 1080p, even though both my internet speed (50 Mbps) and my VIZIO 55\" HD 3D TV are more than capable of handling 1080p. Yes, AMAZON FIRE TV delivers 1080p flawlessly without any glitches of any type. The picture AND sound are simply spectacular!! There are other positive reviews about this product that speak more eloquently to the capabilities of this great new piece of technology from AMAZON. Do yourself a favor and get it. You will not regret it. Oh - I am NOT employed by AMAZON nor is anyone I know even remotely connected to AMAZON. I sure wish that I owned their stock, though!!", "verified": true, "helpfulness": "6/7", "author": "William W. Wood \"doctorwww\""}, {"rating": 5.0, "review": "I took it out of the box, connected it to me tv, plugged in the power and watched the tutorial. From there, I was watching movies, adding apps and it all worked fine!! I don't usually do reviews but this deserves a super review. Everything in the add is true, if not understated. It isn't often a product is better than advertised but this is. I even love the screen saver that comes on before it goes into sleep mode. You don't even have to shut it off!!", "verified": true, "helpfulness": "6/6", "author": "DANIEL SORENSEN"}]