[{"rating": 3.0, "review": "I have a FireTV Stick and Dellcast along with this.  The Chromecast is the wierdest one to use, hardest to set up and just in general do stuff.", "verified": true, "helpfulness": "0/0", "author": "Posterchild63"}, {"rating": 5.0, "review": "Gets the job done and makes life easier. Purchased 2 of these for each TV in my home. Highly recommend making the leap!", "verified": true, "helpfulness": "0/0", "author": "Tranquil"}, {"rating": 5.0, "review": "AS expected, works great!", "verified": true, "helpfulness": "0/0", "author": "colorado mom"}, {"rating": 5.0, "review": "Great product, works very well... Can connect with mobile, tv, tablet and is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jefferson Braz Fernandes da SIlva"}, {"rating": 5.0, "review": "Awesome, easy to connect easy to use and $5 less than on Walmart", "verified": true, "helpfulness": "0/0", "author": "José Miguel Bolaños Rivera"}, {"rating": 4.0, "review": "This very cool Bluetooth device enables one to display (real-time casting) what appears on your Chrome browser to your TV. The Chromecast fits into an HDMI slot on your TV and it gets power via two sources: 1) USB port on your TV or 2) power cord to an electrical outlet. We use the USB powering method and it works perfectly - also reduces \"cord mangle\" in the back of your TV. The down-side includes: 1) it only works with Chrome browser (well, it is Google - so, I guess that is to be expected) and 2) the Chromecast is susceptible to losing its casting signal to the TV. It can take several minutes and attempts to re-establish the connection. On the up-side, when it works (which is most of time) it is very cool. We login to Xfinity and Chromecast archived TV shows and movies for the family to view.", "verified": true, "helpfulness": "0/0", "author": "Jon Hulen"}, {"rating": 5.0, "review": "Love this. We have direct tv and wanted net flix too so this worked like a champ! Added the app to my ipad and phone so we can stream the net flix shows", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 4.0, "review": "Works really well. However, does not mean your TV will become a smartTV once it still relies in an external device to navigate and control it (running chrome).", "verified": true, "helpfulness": "0/0", "author": "Fabio Madureira"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jillian Rich"}, {"rating": 5.0, "review": "Perfect product to cut down on the cable bill. Over the past few months it has probably saved us a few hundred dollars.", "verified": true, "helpfulness": "0/0", "author": "Angelique M. Bouffiou"}]