[{"rating": 2.0, "review": "It works well enough for Netflix and Vudu, but not at all for Amazon Instant Video, which is one of the services I have and use the most, being a prime member.  Chromecast doesn't support Amazon Instant Video and the only way to make it work at all, is to cast your desktop screen onto your TV, which can be done, but it's more-or-less in BETA form and when I start the Amazon Instant Video player, it is supper choppy.  I have very fast, high speed, cable internet service, but it seems like the Chromecast just can't process the stream fast enough.  Super choppy, super sucky!  I'm going to try the Fire stick from Amazon next, which claims to have a multi-core processor and double the memory on it.  We'll see!  It's $4 more than the Chromecast, so the prices are comparable.  I just wish I could return the Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Rico"}, {"rating": 4.0, "review": "YEA ITS GOOD", "verified": true, "helpfulness": "0/0", "author": "ash"}, {"rating": 1.0, "review": "It doesn't work with my laptop. The audio doesn't match with the image.", "verified": true, "helpfulness": "0/0", "author": "Ana Russo"}, {"rating": 5.0, "review": "Got rid of cable tv.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey M. Eig \"Jeff\""}, {"rating": 5.0, "review": "I love it its everything I expected. I need 2 more of them.", "verified": true, "helpfulness": "0/0", "author": "Angela Johnson"}, {"rating": 1.0, "review": "Garbage!!!!Amazon nowhere in it's product description do they say that this piece of garbage ONLY WORKS if you can connect to WIFI. Basically it does what your phone already does without help...not to mention your internal tv workings and your dvd player and any NUMBER of things you already have. Save your money, it is a redundancy scam at best. This one is already in the box and headed back.", "verified": true, "helpfulness": "0/2", "author": "Redsonlyone"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Mo Ali"}, {"rating": 5.0, "review": "ONE OF MY BEST INVESTMENTS,..", "verified": true, "helpfulness": "0/0", "author": "A DELGADILLO"}, {"rating": 5.0, "review": "Best purchase I ever made. Well worth it", "verified": true, "helpfulness": "0/0", "author": "ThrAsh"}, {"rating": 5.0, "review": "It came faster then expected. Hooked it up And connected it with my samsung galaxy tab 4 and it works 👍 recommend it", "verified": true, "helpfulness": "0/0", "author": "shady"}]