[{"rating": 5.0, "review": "The voice search works, even with my non-American accent and that's one thing I love about it. Having the Fire TV connected to the internet with a LAN cable is perfect when streaming HD movies. The apps, music, movies, original TV shows and games available are fantastic, although I would wish the game controller wasn't that pricey. Make a normal TV a great \"smart\" experience.", "verified": true, "helpfulness": "0/0", "author": "aliyyah27"}, {"rating": 4.0, "review": "The problem we have with it is once you turn it on, we loose a picture for a long time and still have sound. If we leave it on and not use it, it eventually turns our tv off too.", "verified": true, "helpfulness": "0/0", "author": "Kelly Singleton"}, {"rating": 5.0, "review": "Best piece of equipment I have ever bought", "verified": true, "helpfulness": "0/0", "author": "Thomas J. Corbett"}, {"rating": 5.0, "review": "Way better than the Apple TV. I own both and the fire TV has far more versatility for searching and play time. Even the new Apple TV features barely touch those available through the Fire TV. Access to not only Netflix and cable programs, but also Prime TV! I'll never buy movies or shows through Apple again.", "verified": true, "helpfulness": "0/0", "author": "AB \"AB\""}, {"rating": 5.0, "review": "As far as streaming devices go, this is the BEST one for up front Amazon based content. I love the functionality of the device itself with relation to Amazon content. Other Apps that are available need some help though; nit picky things overall but things that do irritate.The Pandora App that I use very often through the Fire TV is clean and overall fantastic, except when I want to close it and have to go into a settings menu and close the App out. Like I said, nit picky thing overall, but several Apps require a separate close process. Not easy when compared to other streaming devices (see Roku2).The other odd thing is the resolution blur when selecting the Fire TV. About 1 out of 7 times I select the input for the Fire TV the screen looks as if I threw a magnet at a CRT monitor. I have to change the input and change back, sometimes 3 tries, and then it is fine for the duration of whatever I am doing with the Fire TV. This has been the case with 3 different TVs and 4 different HDMI cables.Overall I really like the Fire TV, and anyone else that loves Amazon content should try this out before a Roku.", "verified": true, "helpfulness": "0/0", "author": "A Carpenter"}, {"rating": 5.0, "review": "I have an Amazon Prime account and with this I can watch hundreds of TV shows/movies for free with my Amazon Prime account. Also I was able to backup my family pictures to the cloud and view all of them with this box. Of course Netflix, Hulu, and YouTube play incredibly well. The remote is nice and feels great in your hand, simple but everything just makes sense. I love the voice feature and I imagine will keep getting better.Moving through the menus seems very fluid and I like the beautiful screen savors that kick in automatically. Have compared both wired and wireless using HD content sent from computer, and didn't notice any downside or buffer while on WiFi.I highly recommend this to everyone I know, well worth the price and this could be a true cable cutter solution.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 2.0, "review": "Almost all the shows I want to see are extra.  It is very disappointing.  For me it was a complete waste of money.  I have watched tv once since I got this.", "verified": true, "helpfulness": "0/1", "author": "Debi"}, {"rating": 3.0, "review": "I wish I liked this more than I do. We previously used a Roku and loved it but when our unit became a few years old we decided to purchase the Amazon Fire TV instead.  I love Amazon's services and product, I'm a Prime member, so it seemed like a no-brainer.  Sadly, my family has been disappointed with the Amazon Fire TV experience.  The user interface is no way near as simple and easy to use, or as attractive, as Roku.  The voice command is great, except it only works when you want to search Amazon content (understandble, since Amazon doesn't have control over the formatting of other content providers like Netflix, etc.).  As an Amazon Prime member, I clearly like Amazon services and content and primarily use such... but, I don't like having to jump through hoops to access content from other providers.  As a mom, I hate the outdated parental controls which are difficult to use effectively.  I want to make the content I want my children to see easily available to them... I don't want to rely on FreeTime (which, would allow access to some shows that I just don't want my child seeing reagardless of how appropriate Amazon thinks they are).  I want the freedom to be able to create a carousel of content that I choose for my children. I expected more from Amazon with this and am quite disappointed.  So disappointed, in fact, that we're going to back to Roku in our living room and will relegate the Amazon Fire TV to our bedroom.", "verified": true, "helpfulness": "0/0", "author": "Girly Girl"}, {"rating": 5.0, "review": "Has a lot to offer for channel line ups but at times is slow to download movies", "verified": true, "helpfulness": "0/0", "author": "Lance Erickson"}]