[{"rating": 5.0, "review": "Just bought the Fire TV.  I'm very disappointed that I bought this right before it went on sale to $84.  Wish I would've know that, but otherwise it is an absolutely superb product.  Interface is extremely easy, intuitive and attractive.  Voice commands that actually work. You can have a number of your favorite apps (still navigating through this portion).  Is there a search form in order to find apps?  I'm not seeing it.  Logging on to the Wifi was extremely easy.  I also loved the fact that since I am already a Prime member and I bought this on my account, the Fire TV came PRELOADED with my Amazon account synced to the box.  At first I was taken aback by how it knew that I was a Prime member before I read into it more.  I was impressed with that small, but very nice detail.  Lastly, the actual box looks very nice too.", "verified": true, "helpfulness": "1/1", "author": "seancan"}, {"rating": 1.0, "review": "just buy a ps3, (or ps4, xbox one, xbox 360)  If you have an internet capable lg tv...  you can get all of these, I swear it on my soul.  This is redundant, but it would have been revolutionary in 2004.", "verified": false, "helpfulness": "4/15", "author": "John Hoffman \"turdflop\""}, {"rating": 5.0, "review": "I just bought my second Amazon Fire TV, & I'm selling my ATV 2. Enough said!!", "verified": true, "helpfulness": "0/0", "author": "jacy2jared"}, {"rating": 4.0, "review": "Liked Amazon Fire TV and really wanted to love it. Ended up returning product because of the limitations of the product. At the time of returning product it was not able to stream music from the music player---and I am BIG into music. Also, I wanted it to connect to my windows media player and it not able to do that like Xbox. I really really want to utilize one machine for everything and it would be awesome for Amazon to provide that----but I guess I cannot have everything.", "verified": true, "helpfulness": "1/2", "author": "DansWife \"Dan\""}, {"rating": 5.0, "review": "Love this! Hurry up with Prime Music.", "verified": true, "helpfulness": "0/0", "author": "grannis"}, {"rating": 5.0, "review": "Amazon Fire TV was extremely easy to install and is a downright treat.  It's very small, not much larger than a CD case, and the smooth, mat-black remote is easy to use.  Beware though; if you do not have the proper HDMI cable, you will have to buy it separately.  I needed a router password to get Netflix and that was a nightmare but not the fault of the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "SalemJ"}, {"rating": 5.0, "review": "Do yourself a favor and get the Fire TV!! Hands down better then apple", "verified": true, "helpfulness": "0/0", "author": "g-wood cronie"}, {"rating": 1.0, "review": "I don't know what to make of this. Amazon sends me an email for a special offer to try the Fire TV for free for 30 days, and I click on the email and it says, \"sorry you are not eligible for this offer.\" What's the point of that? And of course no number is given to contact Amazon as to why I was issued a bait and switch email. Very disappointed in Amazon customer service.", "verified": false, "helpfulness": "2/20", "author": "Stephen A. Beals \"printoolz\""}, {"rating": 4.0, "review": "I use this exclusively for XBMC, and it handles everything perfectly. I really wish I could add XBMC to the homescreen.", "verified": true, "helpfulness": "0/0", "author": "C."}, {"rating": 5.0, "review": "Love it! It was so easy to set up. I am so computer-illiterate! It was honestly, really, really easy. I love the interface and the voice recognition (it really works! it's amazing!). I would highly recommend this box.", "verified": true, "helpfulness": "1/1", "author": "busy_mom"}]