[{"rating": 3.0, "review": "The Chromecast setup is super easy and fast. No complaints overall about the product other than the streaming from my iPad is not always great. Using apps like HBO GO are the reason I bought the Chromecast but when watching a movie through the iPad on my TV using Chromecast I find it pauses ALOT. I found keeping the iPad next to the the TV helps but doesn't totally fix the issue.", "verified": true, "helpfulness": "0/0", "author": "Robert Mansfield"}, {"rating": 3.0, "review": "Was working well, watching a movie on Netflix when it just quit. Network wouldn't recognize it any more. Reset my modem and had to reinstall Chromecast to get it working again. When it works, it works great! Hopefully a one time thing. The other disappointment was casting Chrome from my laptop. It is in beta right now, and needs quite a bit of improvement as it lags behind the laptop.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Exelente", "verified": true, "helpfulness": "0/0", "author": "heumann"}, {"rating": 4.0, "review": "Don't have an opinion on this as I've given it as a gift. Sounded like a good idea. I'm waiting to hear how it works.", "verified": true, "helpfulness": "0/2", "author": "Robert Kohler"}, {"rating": 5.0, "review": "Just an excellent and affordable product.  Works with both my old and new television.  User friendly setup, even for those with very little computer experience were able to use it effectively.  Im excited to say goodbye to the cable companies.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "I bought this for my daughter for Christmas.  It was super easy to set up and works great!  In fact, I'm buying a second one for the basement TV.  Technically, you could just use one and take it virtually anywhere, but my younger daughter and older daughter are fighting over who gets to use it next.  It's an extremely reasonable price for such an awesome product. Love it!", "verified": true, "helpfulness": "1/1", "author": "adpurdue96"}, {"rating": 3.0, "review": "just not all that much that it can do.you'll play google music and youtube videos through it, but after that it's fairly pointless.if you want to play downloaded videos through it then you'll need to play them through a tab on your PC's chrome browser (not your phone). That's fine in theory, but your PC is doing the rendering and then screen sharing with chromecast, which is resource intensive and will make the video frame rate lower, so not all that enjoyable.", "verified": true, "helpfulness": "0/0", "author": "tom fiema"}, {"rating": 5.0, "review": "I've been searching for just such a devise for a long time!!  Finally all of my \"Tablet\" shows on my big screen TV!!!", "verified": true, "helpfulness": "1/1", "author": "jeff kelly"}, {"rating": 5.0, "review": "Works as promised. I bought another one too! Opened to box and had it working in less than 20 minutes.", "verified": true, "helpfulness": "0/0", "author": "teacher tim"}, {"rating": 3.0, "review": "I have the best wireless signal you can get - not dsl, but through wave, and so its not that - and still, the device disconnects from time to time. More than I'd like, actually. One week it wouldn't stream netflix films at all, saying it didnt work with Silverlight, and the next week it was fine. It's very finicky, and has kinks that need to be worked out. Curious that there doesnt seem to be any software updates...Not bad for the price, and worth checking out.", "verified": true, "helpfulness": "0/0", "author": "Kristina Bernard"}]