[{"rating": 4.0, "review": "It's good.Need to support more apps.", "verified": true, "helpfulness": "0/0", "author": "Debashis"}, {"rating": 4.0, "review": "hope it update s and gets better with time but i love it", "verified": true, "helpfulness": "0/0", "author": "Christian Perez"}, {"rating": 4.0, "review": "Great value, just need a slightly better range of apps for use.", "verified": true, "helpfulness": "0/0", "author": "Jon Day"}, {"rating": 1.0, "review": "Get a ROKU!", "verified": true, "helpfulness": "0/0", "author": "David Skaggs"}, {"rating": 5.0, "review": "Wordt steeds leuker", "verified": true, "helpfulness": "0/0", "author": "Huub Offermans"}, {"rating": 5.0, "review": "Has everything I've ever needed in a streaming stick. Of you have an android device,  only is it very useful, it it happens to be just fun!", "verified": true, "helpfulness": "0/0", "author": "Jacob H."}, {"rating": 3.0, "review": "My mother inlaw bought this for us to try. I wish she got the roku but she did not ask me. We have had an Apple TV for years as our only tv we gave up cable. I buy all my movies with amazon so the fact that this can not play amazon videos is a big problem.The quality is good it keeps up and loads fast so it does a good job. I just wish amazon prime videos worked on it. Maybe soon they will. I also like to have a menu on the screen with this you have to use your tablet or smart phone to use it. That's kind of annoying. But all and all it gets the job done but I think a roku would be better.", "verified": false, "helpfulness": "0/0", "author": "Tahoejeepmom \"Sarah\""}, {"rating": 4.0, "review": "Works pretty well.  Just remember that when going through the setup, and it asks you to choose a name, stick with the one that is automatically given, or else you wont be able to connect.  Learned that the hard way.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Stajkowski"}, {"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "Nan Lop \"Nan\""}, {"rating": 3.0, "review": "I feel my chromecast would work 3000x better if I didn't have a horrible Time Warner router that I had to use in my house. It is pretty laggy with the TWC mandated equipment. Other than that, works well.", "verified": false, "helpfulness": "0/0", "author": "Jesse H"}]