[{"rating": 2.0, "review": "I am a huge fan of Amazon and the Prime service. This box works perfectly for this service. But most people want this box for services beyond Amazon. Netflix runs terribly on this machine. It often doesn't work at all, you have to dump the cache frequently to even get it to work. I tried using this box for 3 months, I have now switched back to Roku. I also have an Apple TV, so I have tried them all. Roku is still the most reliable for streaming. It also offers the most applications. This is where the Amazon Fire is truly limited. I am hoping the next version of their software improves. Right now, if you use Netflix, look elsewhere. I wish I could return it but I am passed the 30 day return policy.", "verified": true, "helpfulness": "1/1", "author": "Scott Zagurski"}, {"rating": 3.0, "review": "I'll start with the good.  The library is huge and if you have prime a very large chunk of the content is free.  I've found very obscure shows from ten years ago or longer; the kind you remember bits and pieces of but have to enlist the help of Google for a good hour to find.Now for the not so great.  After the first couple weeks, we have had to start unplugging it regularly to restart it so that it will once again connect to the internet, despite having an Ethernet cable, not just wireless.  After determining that our internet is up, we try fooling around in the system settings, which never works (no idea why we still try).  We then unplug it, wait a couple minutes, start it up, and then usually have to repeat at least once.The only reason I still feel that this was a good buy is the fact that the purchase has convinced my roommate that we can live without the $90 a month for cable for the 3 or 4 shows we actually cared to watch.", "verified": false, "helpfulness": "0/0", "author": "Alina Nycole"}, {"rating": 1.0, "review": "Have had it for about 1.5 months.  Of course Amazonwarranty expired before I found out The amazon fire tv was causing my problem. I thought my problem for my internet service slowing down was my internet service.  Found out the Fire tv uses an excessive amount of data when left on because of the screen saver.  My Isp slowed down my service because I was over my data limit for the month ( Which problem I have never had before).  Also I have to re-boot the fire tv quite often before it will load a movie or tv show.Since it is over the 30 day amazone guarantee I am stuck with it even though it is the amazone fire tv's fault.", "verified": true, "helpfulness": "2/4", "author": "robert d tyalor"}, {"rating": 5.0, "review": "We purchased the Fire TV to use as an interface for a non-smart TV to our Netflix account. The transition was easy to implement and the box is simple to navigate. I give it 5 stars.I would like to recommended for Amazon to add a filter for the Prime content on the Fire TV for Free TV and movies just like they have on the website.", "verified": true, "helpfulness": "0/0", "author": "J Meyer"}, {"rating": 5.0, "review": "No need for a DVD player or Smart TV with this device. Loaded with the apps I really need and the Prime content that I watch daily. When I upgrade my TV this Holiday season when the prices go down I will be able to get a larger screen and not worry about Smart TV integration because I already have it with the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "J&B; Reviews"}, {"rating": 4.0, "review": "So far so good, it is easy to set up and use.", "verified": true, "helpfulness": "1/1", "author": "DW"}, {"rating": 4.0, "review": "Does this item have a headphone jack in the remote ?", "verified": false, "helpfulness": "0/3", "author": "scott barranco"}, {"rating": 4.0, "review": "So far, so good, and would probably give it a 5-star if we used it more. The problems that we have experienced have mostly been operator errors. My wife and I are impressed...the simplified controller is great...great investment for old folks...bring on some more old movies, especially 50-80's.", "verified": true, "helpfulness": "0/0", "author": "Charlie Dale"}, {"rating": 3.0, "review": "As my title suggests, my review of this is mixed.What I can say positive about this product is that it is as advertised. It functions well, it is very user-friendly, and there is a lot of customer support for this product.What I did not like about this product:1) even though it has free TV shows and movies for prime members, they are very dated. This is fine if you have lived under a rock or in a cave for the past two years! The current shows cost money even though they're free on the TV websites!2) The movies and TV shows that are prime eligible are only shown in HD. There is no option to watch a lower quality format. This eats up massive amounts of data through your Internet! (Hint to Amazon) Perhaps an option to select quality would be a good choice for people like me who do not have huge data limits through their Internet service?3) A web browser sure would be nice! To check my email or possibly even shop on Amazon.com's main website would be great. Why should I surround myself with two or three additional devices when this could be done through fire TV, A potential all-inclusive device?Again, this is a fine product, but In my opinion needs improvements. Currently, it was not the right product for me, and I have given it away. I hope this helps.", "verified": true, "helpfulness": "1/2", "author": "KennyDnAK"}, {"rating": 5.0, "review": "Have Apple TV. Saw this and investigated. WOW! way more options that Apple TV and with Amazon prime, it's jsut great. Cant say enough good things. Also the voice search is so user friendly. no more chasing letters to click on and type out a search.", "verified": true, "helpfulness": "0/0", "author": "Morgan"}]