[{"rating": 4.0, "review": "still too soon to tell. just got it.", "verified": true, "helpfulness": "0/0", "author": "JOHN DOLAN"}, {"rating": 3.0, "review": "My Amazon Fire TV was a gift and as I have a Netflix account I have streamed Netflix shows.  There have been several interruptions.Am still trying to decide whether it would be worthwhile to open Fire account instead.", "verified": true, "helpfulness": "0/0", "author": "JMJohnson"}, {"rating": 5.0, "review": "Loads of entertainment. Easy to set up, with the exception for the opening of the remote. One must check google for instructions", "verified": true, "helpfulness": "0/0", "author": "CHARLES HOLT JR."}, {"rating": 2.0, "review": "I have had the device for less than a month, and the voice search feature doesn't work anymore. I also find the way choices are listed on the menu to be hard to review (perhaps having them in alphabetical order would be more useful). The different categories have so much overlap that the number of choices is not really all that vast.", "verified": true, "helpfulness": "0/1", "author": "Emily F. Frank"}, {"rating": 3.0, "review": "Wish it had better/more channels and content.", "verified": true, "helpfulness": "0/0", "author": "Jason S"}, {"rating": 5.0, "review": "Best thing EVER! Good bye EXPENSIVE Cable bill! You will NOT be missed", "verified": true, "helpfulness": "0/0", "author": "G Force"}, {"rating": 5.0, "review": "great easy to setup lots of things to watch", "verified": true, "helpfulness": "0/0", "author": "MR Michael Learned"}, {"rating": 5.0, "review": "Love this. Easier to use than other similar products.", "verified": true, "helpfulness": "0/0", "author": "E. B. Allen"}, {"rating": 5.0, "review": "I am really enjoying my fire tv!", "verified": true, "helpfulness": "0/0", "author": "charolene lapage"}, {"rating": 2.0, "review": "I haven't even connected Fire TV. We got it at Staples yesterday and I attempted to set it up today. I read the directions and the first instruction said, \"connect one end of the HDMI cable (not included)...\" Now we are back out searching for the cable. I can't believe you sold a device that can't be set up right out of the box. This is really disappointing. I hope the rest of the set up is easy.  :-(", "verified": true, "helpfulness": "0/3", "author": "Kenneth Brownson"}]