[{"rating": 4.0, "review": "Everything works as advertised, just slower.  I would recumbent getting \"Unlock the Power of Your Chromecast\" by Aaron Halbert.  Get it on a Kindle and it was under $5.  It comes with free monthly upgrades that keep you current on what new things you can do with your chrome cast device.", "verified": false, "helpfulness": "0/0", "author": "John Nusbaum"}, {"rating": 4.0, "review": "I like how easy it is to use if and when it works.One problem: I bought it to send streaming MLB games to my TV.  Unfortunately for me, it doesn't work for that.", "verified": true, "helpfulness": "0/1", "author": "Whoeckh"}, {"rating": 5.0, "review": "There are currently not many products that even do nearly the same thing this does. It's very inexpensive. The support for it is great. I do notice occasional stutter and audio quality degradation, but hey, it's wireless video. I'm very pleased. It includes everything needed, and even the packaging is high quality. The setup was very simple.My review is probably shorter than the Chromecast deserves, but I don't have any significant complaints, it has totally changed the way I use my receiver. It is now set to use the Chromecast source 90% of the time. I can pick out a movie from my phone, and I can resume the song I was just listening to in the car once I open my front door. Support for local media could be better, but it's still quite new.", "verified": true, "helpfulness": "0/0", "author": "Andrew Zorn"}, {"rating": 5.0, "review": "I was having trouble streaming Netflix over my home theater receiver so I decided to try the Chromecast before cancelling Netflix.  I'm glad I did.  I am now able to stream from Netflix in full HD.  Great little product.", "verified": true, "helpfulness": "0/0", "author": "smfishkin"}, {"rating": 5.0, "review": "Love my chromecast!! Great product and easy to use! It is really nice to not have to use an HDMI cord.", "verified": true, "helpfulness": "0/0", "author": "Beatrice Wilson"}, {"rating": 5.0, "review": "This was a great investment. I have an older Plasma TV and instead of buying a new Smart-TV, I saved money on purchasing the Google Chromecast and I can stream from my phone or tablet. Works great!", "verified": true, "helpfulness": "0/0", "author": "Christina Rivera \"LaNina\""}, {"rating": 5.0, "review": "I recently purchased my fourth Chromecast - this one dedicated entirely to streaming music  - and thought I would update my review to reflect some of the lesser known capabilities of the device which are either new or I just don't see mentioned much in the reviews.First of all, few reviewers seem to be aware of the tidal wave of new chromecast-ready apps that have become available in the Play Store since Google opened the SDK earlier this year. Go to the apps store and search for \"chromecast\". There are over 250 currently. There are some really interesting new ones including Allcast, Spoticast, Videostream, Photowall for Chromecast and others.The list of streaming movie and video providers has also grown. Besides Netflix, Hulu, YouTube and Google Play Movies you can now get Vudu, Redbox Instant, HBO Go, MLB TV, Washington Post TV, Redbull TV, Crackle and others. There is no dedicated Amazon Prime app, and probably never will be, but you can still watch Prime content from a browser window. In my case Amazon's protectionist policies have just driven me to use Google Movies, Netflix, Vudu and other sources more than Amazon Prime. I also have a Roku if I really feel the need need to watch a free Amazon title in HD 1080p, but I seldom do.There are a couple of useful hardware capabilities I rarely see mentioned in these reviews. One is that Chromecast will turn on a CEC-compliant television and switch it to the appropriate HDMI input when you stream content to it. It saves you from first having to set up the television using a different remote. The second is using voice search to find content within the various apps. Netflix, Google Movies, Youtube, Vudu and others currently support this. It seems to work flawlessly and Google's voice recognition technology is among the best. I've not checked to see if this capability is available on iOS devices as well.I've seen some complain that Chromecast lacks a remote. I see it differently. Any smartphone, tablet or PC can be a remote, and they are FAR more capable in what they can do than a dedicated remote. For example - you can search for and review content while something else is playing, you can continue viewing or listening to content on your mobile device when you leave the house, you can control Chromecasts in every room of the house with one device and multiple people can queue up content to play on a single HDTV or audio system. Fewer remotes also means less electronic clutter to deal with. Most people have a smartphone or tablet on hand these days and don't really care for a drawer full of remotes as well.And speaking of clutter, not having an old-school set top box, power brick and HDMI cabling also helps. Especially useful for wall mounted televisions. This thing hides away inconspicuously on the back of the HDTV or receiver. It can also be easily carried when traveling.In my opinion the place where Chromecast really shines above all other competitors is in music streaming. And not just because it offers more streaming apps (currently Google Play Music, Pandora, Spotify, Rdio, Songza, Beats Music, Vevo) than the others. One of the reasons is that it is so well integrated with Google Play Music, which I find I like better than iTunes in almost every way. GPM effortlessly imported my entire iTunes library and local music into the Google Cloud (up to 20,000 songs free) where it can cast my playlists or its own created from my library to any Chromecast in the house at a high quality bit rate. You can also subscribe to Google's 20-million plus song library for a monthly fee.But what makes it an even greater wireless music device is the the cost and form factor. With a $29.99 - $35 Chromecast and a <$10 adapter (to output the audio channel) any powered speaker system can be converted into Sonos-like high quality wireless speaker system. Great for extension speakers on the back patio or in rooms other than where the HDTVs are located. It will also plug directly into any audio receiver with HDMI input(s). I expect this will put a serious dent in Sonos' sales unless they find a way to incorporate it.Those are my thoughts for now - until I discover some new capabilities which seem to be growing continually. I'm hoping that Google will release a Chromecast-2 one of these days that supports the 802.11ac WiFi protocol among other enhancements, and hoping they don't try to emulate the over-priced set top boxes on the market.", "verified": true, "helpfulness": "1/2", "author": "Mark F."}, {"rating": 5.0, "review": "I have had many friends tell me that I need an Apple TV, or equivalent, so that I could play my movies and music without any effort.  I took one look at Chromecast, and all it claimed to offer, and figured I could take a $35 hit, even if it didn't deliver as expected.  Lucky for me, Chromecast was everything it promised.  Set-up is easy and fast.  The dongle is unobtrusive, and compatible with both my TV and wireless network.I use it primarily for Netflix, and have not had any issues with buffering or loading content.  The only drawback is that instead of Netflix instantly playing the next episode in a series (if you have decided to binge watch your favorite TV show) after your episode is done, the casting stops, and Netflix goes back to the previous screen where you made your episode selection.", "verified": true, "helpfulness": "0/0", "author": "Emily M."}, {"rating": 5.0, "review": "It's awesome, you don't have to worry about turning on this device or that device so that you can watch Netflix, you can also cast YouTube videos and what not.  If you pair it with Allcast (android app) you can cast most any video, picture, or music from your phone to the Chromecast.  Pretty useful device for it's price.  Super portable so you can bring it to someone's house and sync it up with their wifi in a minute or two and poof you're set to use the device.", "verified": true, "helpfulness": "0/0", "author": "Joe O."}, {"rating": 5.0, "review": "This is a highly portable, reliable, and convenient media player. Everywhere you go there is a usb ready device to plug chrome cast into. I own a Galaxy Note II and it is a great pair to use for slideshows and more. If you are considering a device enhancer that will allow you to beam images and video like apple tv, this is your best value.", "verified": true, "helpfulness": "0/0", "author": "Hitims"}]