[{"rating": 5.0, "review": "First let say the setup could not have been easier and with in 5 minutes I was watching a Basil Rathbone  and Nigal Bruce in \" The Secret Weapon\". The Voice Command seems to work better than others I have used. At this point we are very happy with it so far!!", "verified": true, "helpfulness": "0/0", "author": "William Faulkner"}, {"rating": 5.0, "review": "Works perfectly! This is my 3rd fire tv and it's faster and far better than any of the roku products I've owned in the past! I can say that I have had roku, Apple TV, boxee box and sony tv. This box is far superior than all the others! A++++! Great job Amazon! You knocked my socks off!", "verified": true, "helpfulness": "1/1", "author": "kelly d hamilton"}, {"rating": 1.0, "review": "Shame on you Amazon for your blatantly misleading product description.  One is led to believe that there are over 200,000 FREE tv show episodes, movies, videos etc. included with a Prime Membership.  This is just NOT TRUE.  Almost everything I tried to access was a pay per view.  It's unfortunate that a company with your reputation feels the need to stoop to such misleading tactics just to make a sale.", "verified": true, "helpfulness": "4/9", "author": "Linda Dey"}, {"rating": 5.0, "review": "Great device so many possibility", "verified": true, "helpfulness": "0/0", "author": "Tuan Nguyen"}, {"rating": 5.0, "review": "I m so glad I secided to replace my Roku with the Amazon Fire TV ...it is so easy to u se...fast set up...fast streaming..and games that young people's devein some for older people..lots of free games. It is a delight to use the voice recognition on the remote because it always understands what I ask and quickly pull up the answer...Thank you Amazon", "verified": true, "helpfulness": "1/1", "author": "Nancy \"nance12020\""}, {"rating": 5.0, "review": "Excellent I canceled my Direct TV!kept only the internet, I now use Amazon Fire TV! and I still get to watch my Favorite shows when i want to watch them. I love it!", "verified": true, "helpfulness": "0/0", "author": "Gina R. \"Gina R.\""}, {"rating": 5.0, "review": "Love it. clear picture good choices for Amazon prime members. Just wish we could get Acorn TV for the British crime shows we like", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I cut out cable 4 years ago to save money (paying over $100 for a basic setup just didn't feel worth it anymore), and switched to whatever I could over through the air for free (a lot of good channels surprisingly in additional to the basic local channels), and subscriptions to Hulu, Netflixs, and Amazon Prime. The transition wasn't so hard.It wasn't until this past Christmas that I decided to purchase a streaming device, and bought Amazon's Fire TV from my local Best BuyI'm wondering why I had not purchased this before.I was taken back by how small this device is. It reminded me of the size of the old 3.5 inch Floppy drives that were phased out of mainstream computers (along with modems) a few years back. It might be even smaller than that. It was so easy to set up. And, best of all, it is FAST.There is a wealth of content available. So much that my only complaint is that I wish it was organized better, at least with the content apps that are available on it. If you know what you are looking for, you can search for it on the fire tv. Otherwise, you might find the apps better browsing on amazon's web site.I have a Fire Tablet as well, and one of my favorite feature is watching a show on both the TV and tablet. On the tablet, it will give some background of what I am watching, by scene.", "verified": true, "helpfulness": "2/2", "author": "Chadwick Glynn"}, {"rating": 5.0, "review": "Got this for Christmas and as someone said in a prior review Amazon hit it out of the park. I highly recommend easy to use and if you are a prime member you will have all the videos, series and movies you could every want. Love this !", "verified": true, "helpfulness": "1/1", "author": "Janet Porter"}, {"rating": 5.0, "review": "Loooooveeeeee it! Watching netflix on my laptop will never be the same. And it's so small and sleek!", "verified": true, "helpfulness": "0/0", "author": "Caitlin"}]