[{"rating": 1.0, "review": "UPDATE Feb 24-2015 I am DROPPING the review from 5 stars to 1! I am tired of waiting. I have patiently waited for over 10 months for Amazon to 'fix' the crippled USB port. This unit ONLY has 5.49GB of 'space' and 'yells' at you constantly is 750 megs are not clear for video buffering so really it has 4.74 GB of space available. This is absurd. 3 decent games (which Amazon touted from day one this was a game device) gobble that up. Sure you can have LOTS of small simple/silly/fun games and have hundreds of them (Grandpa and the Zombies is a superb example of a fun to play 'small' game on the fireTV) but SevZero (FireTV controller comes with that), the walking dead, Leo's story? on plan on a few being locally playable and installed as only a few are an option. On every 'typical' Android device you can ADD storage capacity (for example on cell phones) by moving 'Apps' to the memory card (external storage). If they simply 'fix' this limitation I would raise my review to 5 stars again and highly recommend this device, but I NO LONGER recommend it and have UNPLUGGED MINE and plugged in my Roku3. Not playing games, the Roku devices are far better on search results...-------------------Original 5 star Early April 2014 review:OK, so from what you read you can tell I have way too much tech stuff...(and I did not mention a few other streamers and Windows Media Center devices I have had and or tried to set up).I have been closely following 'streamers' and \"Windows Media center\" for about 10 years.Suffice to say this is, hands down, the best overall streamer available.UNLESS you have purchased a ton of content on iTunes, UNLESS you have some 'channel' that is an option on Roku (love them, have 5) and not on the \"FireTV\" this is hands down the winner.If you are like me, and have a receiver that DOES NOT decode surround sound from HDMI and needs a Optical input this is the ONLY choice for HD and surround sound (optical output). Roku got rid of Optical output (sadly) when they went to the Roku2 and the Roku1 devices that had Optical out were only streaming a Stereo source.I gave up wasting time trying to record TV/Movies with Windows Media center. I had spent literally hours and hour and hundreds of dollars and it ended up being able to FINALLY stream HBO after a cable card setup (SiliconDust Prime) but it was dodgy unreliable and \"DRM\" content (all Showtime and HBO etc. content) could ONLY be played on the recorded device. So if you had lots of recordings with DRM and the PC suffered a hardware failure (or gosh forbid you upgrade) all your recording would be locked and useless.I can say, unequivocally, this is a hit out of the park for Amazon.Voice search is indeed superb. I wish it worked in Netflix (Netflix search is still button based).I ordered a controller and while I am not a gamer, graphics were great and speed seemed quite good.It's no Xbox - PS4 replacement for a serious gamer but I love how I can load and play (in my case) 50 games on the Amazon appstore I have already purchased. Basically this is kind of like a HD Wii (it's ability is about that, while definition is much higher).Like I said above \"Eco\" system is important, and if you are an Amazon \"Prime\" member, this is a virtual no-brainer. If you have a Rokus 2/3 and have HDMI Surround sound on your receiver (over HDMI) and don't care about voice search or games, and or speed, then stick with your Roku. I did not really care about the games but my tween daughter LOVES that she can now play \"Life\" on the TV (she loves that game on our Kindle). Also enjoyed Connect 4 on the big screen...", "verified": true, "helpfulness": "7/9", "author": "E. Howland \"EHowland\""}, {"rating": 1.0, "review": "I bought this on the assumption that it would be typical Amazon quality. I began the startup process, the unit simply quit (i.e. the white light died) and that was that. i never actually managed to see anything. I suppose I'll return it but i don't think I'm inclined to try again. there is zero way to troubleshoot and Amazon says only to return it.Back to selecting something else for my streaming needs.", "verified": true, "helpfulness": "8/20", "author": "J B Carioca"}, {"rating": 1.0, "review": "You have to upload your personal music , pictures and videos to Amazon’s cloud.No ability to stream from home network.Usb is not enabled thus no ability to play personal media from hard drive.I would wait buying Fire TV until these issues are corrected,  or until another company comesout with comparable hardware, a more robust user environment and the freedom to choosemedia sources .", "verified": true, "helpfulness": "11/32", "author": "JJJJ \"JJJJ\""}, {"rating": 5.0, "review": "I have Prime for many years already, but I never watch any of its shows and movies; now that I have it on my TV it is much easier. Also, I have Netflix and Hulu, it is a lot to watch.Now, I'm having trouble downloading Games, it takes a lot of time. I'm not sure if this is normal, or it is just me. My internet connection is good.", "verified": true, "helpfulness": "1/2", "author": "J.Eli"}, {"rating": 5.0, "review": "A perfect solution for a sticky problem: I had mounted a new HD tv over the fireplace mantel to my satisfaction but had not settled on the means to connect it to a smart dvd player. I did not want the player visible nor the cables that connect it to the television. I was just about to purchase another plugin device, but since I am already a VERY satisfied customer of Amazon Prime, Amazon Fire TV became the best solution!  Now I have all the Prime videos and music, my Netflix (which loads super fast through the Fire) and many more possibilities at my fingertips. The Fire unit is tucked neatly behind the bottom of the tv, completely out of sight, but yet works flawlessly and just as advertised with the handy remote control!  Yes, it costs more than other simpler devices, but just as I have experienced with all that Amazon has to offer, it is money well spent.", "verified": true, "helpfulness": "1/2", "author": "Michael A. Cooper"}, {"rating": 1.0, "review": "Hardware - This is a great deviceSoftware - Easy to useThose are the pros. Here are the cons.Why buy into the amazon ecosystem? Why pay 100 for this when you can buy a roku for 60? Amazon has raised the price of prime. BUT the big kicker is that you can view prime instant video with android. You can watch it on your computer, your roku, your ios device, but not on android (unless you have a kindle fire). Prime shipping was enough to keep prime, but with the fee hike and lack of android support, methinks not. BTW, I'll be keeping my Netflix subscription because it works on ALL PLATFORMS.", "verified": false, "helpfulness": "12/53", "author": "Harley"}, {"rating": 5.0, "review": "I own the Apple TV but wanted this unit so I could play my Amazon Prime videos instead of going through my iPad to watch them. This Fire TV works great and is much faster than the Apple unit. I have both hooked up to my TV and they make a great combo. I thoroughly enjoy being able to search by just speaking; it's so much faster than searching one letter at a time on the Apple TV. I've only had it a week, but so far so good.... no complaints at all.", "verified": true, "helpfulness": "3/3", "author": "Lynn Schroeder"}, {"rating": 4.0, "review": "The item arrived quickly. The packaging is quite nice visually and easy to open.The device itself is very easy to set up. It has to perform software updates initially which do not take much time at all.There is a very interesting introduction video and the interface is quite simple and easy to use.The device itself is a small neat box and the remote as well. The remote feels good in the hand and the batteries for it are included.The buttons on the remote work well and the layout is simple and easy to use, also you can point the remote anywhere and it still works.You don't have to point the remote directly at the device.The resolution is very clean and the device seems to be able to read what resolution your TV is capable of. The selection of programs is very quick but there are not many apps beside Netflix ,Pandora and Hulu Plus. I hope they add more soon.The voice function works well but the only results are for Amazon content, so it does not display Netflix or other app results.I am an Amazon Prime member and have been for years but I cannot access the Amazon Prime content because I live in the Caribbean and it tells me that I am in an incompatible Geographic location. I was disappointed with that as this is a Prime member  benefit that I have never been able to enjoy.I hope they add more content to it soon and possibly a web browser.", "verified": true, "helpfulness": "3/3", "author": "WajangFuel"}, {"rating": 5.0, "review": "I am a huge fan of Amazon Prime Instant Video streaming but I normally just watch all shows and movies on my phone or tablet. This purchase, on the day it came out, was definitely an impulse buy...which I never do! I do not regret this purchase what so ever. Not only is the streaming incredibly fast, I enjoy the feature YouTube has that allows you to connect the Fire TV to your phone so it's easier to browse. I haven't dove into it thoroughly to check all the amenities out but what I have use thus far, I love.", "verified": true, "helpfulness": "3/3", "author": "Kristine Sears"}, {"rating": 5.0, "review": "So far, so good. I have to believe that they will get more apps and TV shows/Movies over time so this is turning out to be a great purchase.", "verified": true, "helpfulness": "1/1", "author": "Jeff Wilton"}]