[{"rating": 5.0, "review": "Like most people, I have a smart TV, but I decided to get this anyway and couldn't be happier with it.  For the money, the tech specs are off the chart, and more importantly the speed/response of the system is unparalleled.  It is SO much faster than navigating my smart TV menus.  I really can't stress that enough.  And the voice search works great, we end up using it often.  It's so easy to use that my wife uses it constantly now rather than navigate the slow \"smart TV\" system.  If you have a Plex server, the Plex app is a must.  Really great product.", "verified": true, "helpfulness": "0/0", "author": "KM"}, {"rating": 5.0, "review": "Love it, don't need a smart tv.  picture really clear and lots of apps.", "verified": true, "helpfulness": "0/1", "author": "Mahiligpa"}, {"rating": 3.0, "review": "Works OK. Search takes me to Amazon $$$ content, when it is available for free in Netflix and elsewhere.  None of my favorite games are available on it yet.", "verified": true, "helpfulness": "0/1", "author": "Todd"}, {"rating": 5.0, "review": "The best feature is the voice search.  It works flawlessly for me.  I wish my iPhone SIRI and my Ford Sync voice commands worked this well.  I hope that Amazon will upgrade the software so the voice search can be used on Neflix.  It also loads almost instantaneously with Amazon video and Netflix loads very quickly.", "verified": true, "helpfulness": "0/0", "author": "Lew"}, {"rating": 4.0, "review": "it was a gift to my daughter she likes it very much!", "verified": true, "helpfulness": "0/0", "author": "Peter C. Petriccione"}, {"rating": 1.0, "review": "Could not get it to work with wired connection.  I have DHCP and Tivo and others work without a problem.  Even tried putting in IP addresses, etc.  Would not work.  Sending back as defective - reason for 1 star.", "verified": true, "helpfulness": "1/4", "author": "A. Heimlich"}, {"rating": 5.0, "review": "It worked as described.  Great picture clarity and had a ton of options. I loved the oldies music on I heart radio.", "verified": true, "helpfulness": "0/0", "author": "maryd."}, {"rating": 4.0, "review": "The device took about 2 minutes to set up. Connecting to my WIFI was a piece of cake. It tool longer to get it out of the box.I streamed Prime movies, a couple of TV series episodes, and a Netflix movie.I have a 'smart' TV with many of the same apps. This discrete box eliminates the navigation of the Smart Hub menus and directories. I only need to switch the source.I reserved a star because voice search only works with Amazon media.I also purchased it on sale.", "verified": true, "helpfulness": "1/1", "author": "Celeste"}, {"rating": 5.0, "review": "Excellent video quality, unbeatable price and much better than competing products. New apps added regularly.", "verified": true, "helpfulness": "0/0", "author": "Joe Ibrahim"}, {"rating": 5.0, "review": "I hope this review doesn't get lost in the thousands of reviews available for the Fire TV box.  I'm am very impressed with it, but not for the usual reasons.What impresses me is that you can plug in a Cat 5 Ethernet cable and connect it to a network with a static IP address.  So many products like this require a DHCP WiFi connection, which is fine for most people, but the fact that they made the Fire TV box compatible on a static network means a great deal of extra thought was put in to the device.I'm amazed that hundreds of developers have made (or modified) apps to work with Fire TV, allowing you to do more than just watch shows with it.  I can listen to just about every radio station in my area with one of those apps.  I can monitor IP cameras, have a virtual aquarium and of course listen to my music.  The power of apps makes my Fire TV much more than just a streaming player.If you want an easier time typing text on your Fire TV, the Lenovo N5902 keyboard will work without having to do anything special other than plugging the dongle into the USB port.  It will also let you move a circular pointer around on the screen and let you click on things like a mouse would.  You can find it on Amazon here: Lenovo N5902 Enhanced Multimedia Remote with Backlit Keyboard (57Y6678)", "verified": true, "helpfulness": "1/1", "author": "Rex Rivers \"Wrecks\""}]