[{"rating": 5.0, "review": "Everything what I expected and I got even more", "verified": true, "helpfulness": "0/0", "author": "Dennis Diaz"}, {"rating": 4.0, "review": "The chromecast works fairly well and is improving with every upgrade. My only complaint is that it will periodically lose connection or stutter.", "verified": false, "helpfulness": "0/0", "author": "Joshua Dunn"}, {"rating": 5.0, "review": "lovely, recommended", "verified": true, "helpfulness": "0/0", "author": "Raed"}, {"rating": 5.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Pablo Guillen"}, {"rating": 5.0, "review": "very nice white android systemwork good", "verified": true, "helpfulness": "0/0", "author": "Lior"}, {"rating": 5.0, "review": "GF loves it.", "verified": false, "helpfulness": "0/0", "author": "sam"}, {"rating": 5.0, "review": "We have used one of these streaming devices for almost a year. Aside from the need to occasionally reboot by unplugging the unit, we have had no problems streaming Netflix, YouTube, photos, home videos and more. If only our cable company would get with the app we would be wireless and thrilled with the dongle. We just bought a second Chromecast to use in a bedroom where we can't run cable. Worth every penny and it's somewhere around 25-40% cheaper than the competition!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works out great!", "verified": true, "helpfulness": "0/0", "author": "johnathan"}, {"rating": 3.0, "review": "I expected this to do more. It works great and is very easy to set up. Just make sure your network is speedy to watch things from the browser of your phone or pc to prevent lag.", "verified": true, "helpfulness": "0/0", "author": "Scott S. \"S.S.\""}, {"rating": 1.0, "review": "It took forever to figure out how to use it and then the quality was so bad we could not stand to watch our  favorite shows cast to our Sony HDTV because the reception was so bad.  Both sound and picture were jerky and color was off.  It was worse than a silent movie from the 1900's.  I do not know if ours was defective or if they just do not work well.  I would not recommend this.  Great idea but poor execution.", "verified": true, "helpfulness": "0/0", "author": "Betsy"}]