[{"rating": 5.0, "review": "As a Netflix and Hulu Plus subscriber, the Chromecast has replaced my Xbox 360 as the primary media player that I use to access these services.The setup took less than five minutes and full exploration of the Chromecast capability took approximately 15 minutes. There are some services like Youtube, Netflix, and Hulu that have native Chromecast capability, which allows a person to cast in high definition any content from these services. Chromecast's killer capability is that the streaming can occur wirelessly from either a phone, tablet, or laptop.In fact, the Chromecast has provided true purpose to any tablet as solely a media-streaming device in that as the tablet is streaming, a user can still access their smartphone or laptop. Further, if there is already a device streaming to a Chromecast, any person on the wireless network that the Chromecast is using can interrupt the current media streaming and begin casting from another device; for example, if a tablet is casting Netflix, a smartphone-user can interrupt and immediately cast from Youtube. Personally, I love the ability to cast from my Google Chrome tab, which displays anything in my browser on the screen; I can finally surf the web on my laptop and view it on my large flat screen.This device is highly recommended as a cheap gift that both a novice and a savvy technology user can thoroughly enjoy.", "verified": true, "helpfulness": "0/0", "author": "rr"}, {"rating": 5.0, "review": "I use this mostly for Pandora and Netflix, and have only begun to explore the other many features.  Easy to use and set up.  Sure can't beat the price.  My 5 year old Sharp Aquos is now as full featured as newer TVs.  Does get quite warm so I unplug it when not in use to conserve energy.", "verified": true, "helpfulness": "0/0", "author": "BJ Galaday"}, {"rating": 5.0, "review": "I love this thing!  It makes streaming so much easier.  I regularly use it for Netflix and have not had any problems at all.  Also it works great on my WiFi and starts streaming in HD in less than 10 seconds.  I would certainly consider buying one for my bedroom also!  What a deal!", "verified": true, "helpfulness": "0/0", "author": "KWoltz"}, {"rating": 1.0, "review": "trying to watch an EPL game through NBCsports.com. picture looked good on my computer(even in full screen), once i put it up to my tv using the chrome cast it became unwatchable. great idea, and i guess it does do what the box says it can, it just does a terrible job of it.", "verified": false, "helpfulness": "2/3", "author": "sully883 \"sully883\""}, {"rating": 4.0, "review": "Youtube and Netflix are the only two apps you will use this for \"Most Users\".  It basically makes your phone a remote for an internet streaming device.  so...  It has potential and its cheap.I personally have had multiple connection issues where my phone says the device is not connected.  Many people will say that its a \"WiFi issue\" no the device... well my apple tv and Roku both work fine on the same network.***Update 9/10/2014***Much better.  COnnects easily to my phone.  Screen sharing is great.  there is a delay so you cant play games on your TV, but everything else works well.  Still limited as far as apps.My only real complaint was the power cord broke WAY too easily.  I noticed it had bent from the weight of the cable being plugged in.  The other day it broke...", "verified": true, "helpfulness": "0/0", "author": "Jester"}, {"rating": 4.0, "review": "For the price of the device, it offers excellent value and utility. I can stream from any device. Glad that I bought this one, handy!", "verified": true, "helpfulness": "0/0", "author": "Laks"}, {"rating": 5.0, "review": "Whats not to love, it is quick, easy and effective at doing what it does. The SDK has been released and look forward to seeing what developers are going to do with it.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 5.0, "review": "Bought one and love it so much I got one for the bedroom TV.  Now I see my NETFLIX in the living room and the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Dorothy lanza-plume"}, {"rating": 2.0, "review": "I didn't really know much about what the Chromecast was when I got it and expected more of an \"android on a stick\" or \"chromeos on a stick\" when I got it. Unfortunately it's not much more than a way for you to show stuff from your mobile device and then tie up your mobile device showing it. The screen casting I did didn't really fit properly and while I can see how it might be convenient sometimes, or if you don't have a HTPC, it just wasn't what I want in an HDMI stick.", "verified": true, "helpfulness": "0/0", "author": "ExplodingEvo"}, {"rating": 4.0, "review": "This is a great device to get media on your TV without to much fuss. It was so easy to setup.I like the fact it does all the heavy lifting and puts minimal strain on my mobile device, the queue feature (youtube) is a nice touch.Occasionally it would drop the signal but it's only happened a handful of times, I'm sure google is working on this. New apps are being added frequently, I would recommend this to anyone that has a smartphone or laptop. Great value for money!", "verified": true, "helpfulness": "0/0", "author": "Stanley Callender"}]