[{"rating": 1.0, "review": "Chromecast was very disappointing. The picture was jumping and the audio was not in sync with the video. Don't waste your time and money buying this product.", "verified": true, "helpfulness": "0/0", "author": "Carl J McIntyre"}, {"rating": 4.0, "review": "I received this as a gift.  Basically you are supposed to be able to broadcast what you see on your computer to your television screen.  It has limitations, as the only thing I can get it to do from my Apple iPad is broadcast YouTube video.  An Apple representative emailed me saying this product is not currently supporting the iPad.", "verified": false, "helpfulness": "0/0", "author": "Scott K."}, {"rating": 5.0, "review": "Use this to stream video from my computer and IPod to my home theater (110\" screen & projector)  Quick and easy setup and even came with 3 free months of netflix.  Great little device!!", "verified": true, "helpfulness": "0/0", "author": "ChrisKN"}, {"rating": 5.0, "review": "I bought this so I could watch Netflix on my television.  I looked at some other choices but I am really glad that I chose Chromecast.  It was a really easy setup.  I downloaded the software.  The software detected the device.  Then I entered my wireless password and that was it!Now, I can't vouch for streaming from sites other than Netflix so I don't know how it will work with any video other than Netflix.BUT....as far as Netflix goes, it is PERFECT.  When you setup the software, it steers you to using Google chrome.  You should do this because it allows you to use the Netflix straight from the browser.  You don't actually see the playback on your monitor but it loads on your television instead.And the picture is PERFECT! And it streams PERFECTLY!And to top it off, my television is about 4-5 years old...720p Pioneer with 4 HDMI ports but not much else in the way of bells and whistles.", "verified": true, "helpfulness": "1/1", "author": "Finance Investigator"}, {"rating": 3.0, "review": "most necessarily chromcast should be useful for casting screen on TV. I heard that they are working on it ? it can be rated five star only after that.", "verified": true, "helpfulness": "0/0", "author": "Pravin Paithankar"}, {"rating": 2.0, "review": "We ordered the goodle Chromcast with great anticipation that it would enable us to access programs on our TV. We were very disappointed that it did not work. Problem was that our TV was not HDMI capable. There was nothing in the information about Google Chromcast that informed us about this potential problem. Consequently we had to send the unit back and consider some other type of possibility.", "verified": true, "helpfulness": "0/1", "author": "Mary Haugan"}, {"rating": 5.0, "review": "Surpasses my greatest expectations!  Works good and is not obtrusive.  It is a great addition to my theater room. Thanks", "verified": true, "helpfulness": "0/0", "author": "Herbert Gardner"}, {"rating": 5.0, "review": "I loved my Google Chromecast HDMI Streaming Media Player...I was looking for one to attach to my laptop to stream to my tv but this one attaches to tv n doesnt' stream exactly as i wished...I have movies on laptop i'd like to stream like my old media did that came with windows 7.... will watching movies from laptop n streaming to tv from laptop, i'd like to be able to use laptop while movies r streaming to tv..this one can only stream using attachment on tv n can't use laptop for games while its streaming...need an attachment that attaches to laptop to stream to tv while movies r playing to tv but i can use my laptop for games, etc please let me know...thanks!!!", "verified": true, "helpfulness": "1/2", "author": "Lois A. Jackson"}, {"rating": 5.0, "review": "Simple set up, does what it's supposed to do. Looking forward to more apps that work with it, but for the money it is hard to beat. Will probably but another for the office.", "verified": true, "helpfulness": "0/0", "author": "Rob B."}, {"rating": 5.0, "review": "It is a very good product because it transform any TV into a smart TV with the basic characteristics .", "verified": true, "helpfulness": "0/0", "author": "Fernando Obispo"}]