[{"rating": 2.0, "review": "All I wanted to be able to do was broadcast presentations from my iPhone phone to a ceiling mounted projector. While you can do that with the Chromecast, don't think it is easy. Think Rube Goldberg. You are eventually going to be successful, but only after dealing with woefully inadequate, inaccurate, or over-simplified directions which are all over the web. Also, you don't see it in the picture, but it comes with a power adapter that must be plugged into an outlet, then into the Chromecast gadget. Did I mention the projector location...on the ceiling?", "verified": true, "helpfulness": "0/0", "author": "BoomerDJ"}, {"rating": 5.0, "review": "I'm extremely pleased that I can now watch movies and internet shows.i recommend to everyone.", "verified": true, "helpfulness": "1/1", "author": "EGUIMO PADIAL SABARAENSE"}, {"rating": 5.0, "review": "We Love It! So very easy to set up!  We may even give up cable!", "verified": true, "helpfulness": "1/1", "author": "Rhonda Luckey"}, {"rating": 5.0, "review": "2nd for the house, great product", "verified": true, "helpfulness": "0/0", "author": "Roberto Cornejo"}, {"rating": 5.0, "review": "This is a wonderful product.  I wish I would have purchased it sooner.  Once hooked up even my 7 year old can connect his tablet to watch Netflix.  Don't waste your money on SMART TVs when you can get a \"dumb\" TV for much cheaper and Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Brody Viator \"bav9074\""}, {"rating": 4.0, "review": "Wish it had spotify. Overall I loved and will be using it ALOT and hope you do too!", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 1.0, "review": "Google does it again. More spyware for your home,  a somewhat useless atempt at again trying to take over your tv. I am sure ine day google will just plant cameras in your house and an probe up your private parts and take constant samples of your waste.Seems fitting as thats what google provides here, save yiir money and buy a roku", "verified": false, "helpfulness": "0/3", "author": "whooble"}, {"rating": 5.0, "review": "works very well, great price for the device", "verified": true, "helpfulness": "0/0", "author": "Edwinn Cordero"}, {"rating": 4.0, "review": "Itss been good on my expectation what I am looking through this product...", "verified": true, "helpfulness": "0/0", "author": "Amit kumar"}, {"rating": 4.0, "review": "Does not work great with any of our tablets. Love the feature that allows the tv to shadow the desktop, however there is usually a delay. I have three of these things!", "verified": true, "helpfulness": "0/0", "author": "Delesa Crump"}]