[{"rating": 1.0, "review": "I can't get my tablet or laptop to interface with this unit, because it is incompatible with Windows 8.1. No one seems to know how to get an APP to integrate so I can use this \"goofy thing\".I'm VERY disappointed", "verified": true, "helpfulness": "0/0", "author": "kawidve"}, {"rating": 3.0, "review": "Works great with Netflix, but I really wanted it for Amazon videos.  Doesn't work with that.  You would think that it would.  Maybe I'm missing something.  I would give it 5 stars if it did.", "verified": true, "helpfulness": "1/1", "author": "Nyronni"}, {"rating": 3.0, "review": "Some programs appear to not support the use of Chromecast.  Not available for playing television programs that are streaming on phone or iPad", "verified": true, "helpfulness": "0/0", "author": "Jim Weber"}, {"rating": 5.0, "review": "As more apps add support, this will become my most valuable streaming device. I have owned a Roku since the first model and have  given them as gifts. I also have an Apple TV and my surround sound streams the usual services. The Chromecast is becoming my go to because it's so easy to use from a tablet or phone. The apps also support closed captioning, which isn't always the case on other devices. I've bought a second Chromecast for the other TV now. I can easily move from one room to the other and continue watching a movie.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey"}, {"rating": 5.0, "review": "Nothing else to say, amazon!!! What really gets me going is that I don't always have that much to say but amazon insists I come up with more words than I have to express my delight or displeasure with a product. Come on, amazon. Stop this nonsense. Let me write what I want, little or a lot and get on with my life.", "verified": true, "helpfulness": "0/0", "author": "BRANDY MARKS"}, {"rating": 5.0, "review": "Awesome device! Very happy with it! I am able to put my hbo go shows on my TV quickly and effortlessly.", "verified": true, "helpfulness": "0/0", "author": "Oscar205"}, {"rating": 4.0, "review": "The google Chromecast is pretty cool. Easily streams most of the media that you would want from your laptop or mobile devices straight to your TV. Nothing groundbreaking about it, but for the price and it's portability it's definitely worth having.", "verified": true, "helpfulness": "0/0", "author": "Paul A. Phelan"}, {"rating": 5.0, "review": "Very awesome! I love it!!! Definitely would recommend this to everyone! I love being able to kick back in bed and watch all my shows!", "verified": true, "helpfulness": "0/0", "author": "Nikki Montanaro"}, {"rating": 5.0, "review": "I bought the chromecast mainly because it was so cheap, and i wanted to be able to use my ipad/iphone/laptop with my HDTVs. I tell you this thing works so flawlessly. The setup is a breeze and in no time you will be casting netflix and hulu and many other supported apps. It still does not compare to apple tv or roku, but for the money it's simply a steal. Apple tv is 89-99$ i believe and roku is somewhere between 55-78$ so there's quite a difference in price. One thing you should Know is that it does not \"mirror\" your computer so to be able to play the files in your computer you will need to download one of the supported apps like real player cloud, although it requires to upload the file into the app and it only allows up to 2 gb of free space, and it  takes some time uploading, here is where apple tv  and roku have the clear advantage. But if you can live without that, i tell you it works great!  And i hear that many apps are coming so it will only get better. I've cast netflix and chrome but Hulu and HBO go  and many other apps are supported.", "verified": true, "helpfulness": "0/0", "author": "Eduardo V."}, {"rating": 3.0, "review": "I've had my Chromecast for a couple weeks now. The problem that I have with it may be completely due to my internet speed but it seems to have a lot of trouble streaming from Hulu or network television sites. I'm not sure though because it does great with Netflix. My wireless router is right next to the tv so I'm not sure I could get it any closer to the device. However, I do like being able to use my tv as a home speaker system by streaming Pandora. I'm just a little disappointed in the streaming of the average online video.", "verified": true, "helpfulness": "0/0", "author": "KMN"}]