[{"rating": 3.0, "review": "Ok fast but not enough apps. Disappointed that HBOGo isn't on there but it is available on my kindle fire hd. Hard to figure out how to connect my apple and Amazon products to stream to fire tv on my LCD. Apple makes it simple.", "verified": true, "helpfulness": "0/0", "author": "William Sherry III"}, {"rating": 5.0, "review": "Excellent picture quality, no lag time. Amazing how well the wi-fi works. Perhaps the price will come down over time.Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Grant Fouquette"}, {"rating": 4.0, "review": "I bought this for the sole purpose of installing XBMC on it.  That worked nearly flawlessly, and it has replaced my second generation AppleTV as the media center for our entertainment system.The only \"complaints\" I have are as follows:1.  Though it was touted as being supported, the FTV does NOT support VC-1 encoded Blu-Rays.  This is disappointing, as a number of my older BR discs (Goonies!) stutter on this.  I hope this can be addressed.2.  When you side-load apps, they are buried in the Settings menu.  Not a huge issue, and I know that others are working on this, but it would be nice to be able to access such apps from the Apps menu.Note:  I have the Plex app and it works pretty well.  The problem with Plex is that it will not play full BR rips, which, along with DVD rips, are the mainstay of my collection.", "verified": true, "helpfulness": "0/0", "author": "Eric Mosterd"}, {"rating": 1.0, "review": "Was very slow and was always having to stop and buffer when using netflix or Hulu plus. Not interested in purchasing.", "verified": true, "helpfulness": "3/4", "author": "Katie Choate"}, {"rating": 5.0, "review": "Can't believe how quick and easy this was to set up. We don't have the fastest or most stable wifi, so I wasn't sure what to expect as far as image quality and stability (ie. buffering and delays, etc), but it was as smooth as watching a DVD/Blu-Ray or satellite.  There was no delay or buffering that I could note and the 1080i video quality was evident. The voice on the remote worked well, the interface is intuitive and fast.  Very glad I've added this to our entertainment collection.", "verified": true, "helpfulness": "1/1", "author": "Evan E. Fusco MD \"efusco\""}, {"rating": 4.0, "review": "Ended up moving a game system out of one of the rooms and decided to buy this to replace it. I mainly chose this one as I was using the google Chrome in another room. But once Amazon did the deal with HBO to me it was worth the extra money. As this will now have everything that I stream available Netflix, Prime, HBO GO (due later this year) on it and will not need to use my phone, pad etc to use it.Just wish I was able to do a voice search and it would pull stuff from Netflix etc. So far its just for Amazon prime unless I am totally missing something....which is possible. I would recommend this though to anyone that is looking for a streaming device. I have not tried any game apps so I can not review that portion of it.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 1.0, "review": "A poor attempt to be an apple tv I returned it. It was clunky to use and the voice command feature that is so heavily advertised was not that great", "verified": true, "helpfulness": "2/5", "author": "Kevin E Fromm"}, {"rating": 5.0, "review": "IT WORKS VERY WELL.I WOULD LIKE TO KNOW MORE ABOUT IT. I ORDER THE MANUAL BUT HAVE NOT GOTTEN IT.", "verified": true, "helpfulness": "0/0", "author": "LIM KING"}, {"rating": 5.0, "review": "This unit works as advertised.  You can play games and the controller works very well with the unit.  It streams quickly, making full use of my wifi.  It streams faster than the other units and the picture quality is great.  The only downside is that I haven't found Crunchyroll yet and that is one of my families favorite streaming apps.", "verified": true, "helpfulness": "0/0", "author": "William Tucker"}, {"rating": 3.0, "review": "Pros:Very sleek - small box, small remote.  Loved the simple, sleek design on bothEasy to use right out of the boxConnects to Netflix and Amazon Prime accountsVoice search is decent.  Not perfect, but about as good as I'd expect any voice search to beCons:The search function is not comprehensive AT ALL.  I wish that, with all the different apps you can have connected, the search would aggregate results across all the different services you have connected.  I'd like to be able to search for a title on the main screen and have Fire show me if it's available through my Netflix streaming account or through Hulu or whatever else.  But it only shows you results from Amazon Video.  I can't even go into the Netflix app and use the voice search there to bring up Netflix-only titles...If I want to search Netflix, I still have to type it in the old-fashioned way.  It doesn't work any differently than it does on my Wii.  Furthermore - as other reviewers have complained about - Fire TV does not have a feature to filter through its Amazon-only search results and show you just what's available for free through Prime membership.  I really don't see any benefit at all to using this product if it's only going to search for & show me titles that are available to buy on Amazon.  That's useless.For anyone who wants to access all their different streaming sites in the same space - buy an extra VGA cable and hook your computer up to your TV.  It'll save you about $90 and you'll have way, way more functionality than this box.  The Fire TV free trial was fun but there's no way I would ever pay money for this.", "verified": true, "helpfulness": "0/0", "author": "K. Gorga"}]