[{"rating": 3.0, "review": "Need high performance PC/notebook in order to cast your graphic intensive internet content via Chrome to TV. I have i3 notebook and trying to cast Amazon Instant Video via Chorme browser; however, experiencing video lagging and sound not match with video footage.Other than casting internet content via Chorme, its basically a Roku Stick with less feature.If your primary function is to watch movie on demand through Neflix, Amazon Video....; and without the needed casting Chrome internet, you can find many better alternative than Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Duty Free"}, {"rating": 1.0, "review": "returned, my son said not good not worth it", "verified": true, "helpfulness": "1/2", "author": "jean M maruejouls-harris"}, {"rating": 1.0, "review": "Couldn't get this thing to work after 4 days. Had to return.", "verified": true, "helpfulness": "1/1", "author": "Jamie Davison"}, {"rating": 4.0, "review": "My only beef with this thing is that it has a long powering up time frame when they are connected to projectors.", "verified": true, "helpfulness": "0/0", "author": "Kyle Null"}, {"rating": 5.0, "review": "unit came to my house quickly and it works just as described", "verified": true, "helpfulness": "0/0", "author": "Robert De Harrold"}, {"rating": 1.0, "review": "I have had 2 Roku (Roku 1 & 3).  My young daughters can easily use them.  I purchased the Google Chrome from Best Buy on sale.  It does not compare to Roku.  Roku has a remote.  I was unaware that I needed to use my smartphone with an App to use the Chromecast.  How can my children use this?  Simply they can't.  I certainly don't want to have to make sure my cell phone is charged just to be able to watch tv either.  I returned it within 2 days of purchase.", "verified": false, "helpfulness": "1/1", "author": "L Winters \"looneywin31\""}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/0", "author": "Fernando Silva"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "canon lov"}, {"rating": 3.0, "review": "It works great, just wish it had a remote with it", "verified": true, "helpfulness": "0/0", "author": "Pat"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/1", "author": "Esteban Vega Gonzalez"}]