[{"rating": 4.0, "review": "I wish it would work with Amazon Prime.  Otherwise, I love the way it works with Netflix, but there is more variety on Amazon Prime.", "verified": true, "helpfulness": "1/2", "author": "Lynne Farrar"}, {"rating": 4.0, "review": "well it,s little tricky to setup somethings lose there connections but once you get good connection it works very well But there are a lot of things you can not stream, so it is far from perfect but if you read the online information there is only few apps and not all WiFi is easily to setup some of the things it does is hard to figure out , but overall not too bad  I think it could be better", "verified": true, "helpfulness": "0/0", "author": "Larry W Davis"}, {"rating": 1.0, "review": "Could not get sound to work, also some options were not available.  Spent way too much time on the web trying to figure it out.  Not User Friendly", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer \"kkmbrown\""}, {"rating": 3.0, "review": "Google is putting the brakes on third party mobile app development. Also one cannot cast from the mobile chrome app.Phone support is lackluster but otherwise would have been 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "great.1 hour from opening package 2 tablets, and laptop are up and running,set up 1 and the rest almost do themselves on there own!!!.", "verified": true, "helpfulness": "0/0", "author": "ptmike"}, {"rating": 5.0, "review": "My husband got this as way to stream movies from his PC in his mancave to our TV's in the family room and our bedroom.  It provides beautiful High Def pictures and movies.  As to the technical difficulty in getting this set up for all of uses (internet streaming, DVD-sourced movies, going to multiple sources, etc), he's still working it to make it do everything he wants.  I've asked if there's good documentation that he can use, but am not getting much response.  He's a typical guy who'd rather figure it out for himself rather than ask the instruction guide for directions.  So I cannot give a fair response about implementation.  Am basing the 5 stars on what I see on the screen and it's performing flawlessly so far.", "verified": true, "helpfulness": "0/0", "author": "horyupmom \"horyupmom\""}, {"rating": 3.0, "review": "It's very temperamental. Advanced tech users should be able to get it to work, but it's still annoying, people who aren't so keen on technology will have many issues using it.Additionally, you cannot connect to it via a device physically connected to the router, you must connect via WIFI.", "verified": true, "helpfulness": "0/0", "author": "Michael Broetje \"Miv\""}, {"rating": 4.0, "review": "Fantastic but not possible to setup without a wireless device. Cant install from a desktop without wifi, had to use my phone", "verified": true, "helpfulness": "0/0", "author": "F. Elia"}, {"rating": 4.0, "review": "I like it. i mostly use it for streaming netflix off my phone in my bedroom. The only thing i didn't like about it is that i have to plug in a power supply. i was under the impression it would go off of the tv's power. Still a good product, just a bit misleading.", "verified": true, "helpfulness": "0/0", "author": "Jose Rocha"}, {"rating": 5.0, "review": "this clever gadget has had many faults found with it but it works very well for me when i want to stream youtube videos to my telly. this device is very easily worth it's purchase price and i promise you it's very easy to set up since it actually does most of the work.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]