[{"rating": 5.0, "review": "Good product and works well!", "verified": true, "helpfulness": "0/0", "author": "Andrii K"}, {"rating": 4.0, "review": "hepfull product", "verified": true, "helpfulness": "0/0", "author": "marlon"}, {"rating": 5.0, "review": "This nifty little device has been great so far. It was very easy to set up. Once it is set up, devices on the same wifi network using apps compatible with Chromecast require no additional setup. We regularly use it with YouTube and Netflix. The quality of picture and sound is not impacted by broadcasting through the Chromecast device. We are able to continue using our iPhones or iPad for other things while it is broadcasting to the Chromecast without negatively impacting performance of either.I did order a third-party mini-USB cord that is much shorter than the one that it comes with. We originally used the cord it came with and plugged it into the USB on the TV, but then were left with quite a bit of cord to wrap up behind the TV and it just looked messy.Update: Updating to 5 stars. We've been using the Chromecast for a few months now and love it. We use our Chromecast daily. More and more apps are adding Chromecast compatability, so we check the app store regularly to see what's available. Some of our favorites: YouTube, Netflix, Pandora, HBO Go, Photowall, Photo Cast.", "verified": true, "helpfulness": "0/0", "author": "eford"}, {"rating": 5.0, "review": "Great. Watch any youtube video on your tv (also netflix, etc).  Great.  love it. Use it often.", "verified": true, "helpfulness": "0/0", "author": "Johnny Galt \"Who is Guy Fawkes?\""}, {"rating": 4.0, "review": "It works for Netflix and is a good value for the price.", "verified": true, "helpfulness": "0/0", "author": "Moira Bennett"}, {"rating": 5.0, "review": "I use it to watch Netflix and listen to Pandora great device instead of using my phone or tablet to view a movie. I dont have cable so its great instead of me using my gaming system as i did in the past.", "verified": true, "helpfulness": "0/0", "author": "K. Tenay"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "Jeferson"}, {"rating": 2.0, "review": "Not to impressed with this. Great idea, but what a pain. When trying to stream anything it always stops and I have to reconnect it. Not once but 6 times in a 20 minute show. I have the highest speed from my cable company so I know its not that. I even tried it at another friends house but the same. I don't even try using it anymore as its just to frustrating to use. Who wants to keep reconnecting it when watching a movie or a show. It's only getting 2 stars, but that goes to the seller. I'd give them 5 but would hate to give the wrong message. I'll just stick with my bluray players.", "verified": true, "helpfulness": "1/1", "author": "patfburns"}, {"rating": 4.0, "review": "While there are some issues (such as overheating), it works pretty well for what I got it for. Which is to watch my shows on the TV while casting from the computer with VideoStream (Android/PC app).  Not bad, and even better if you can find it on sale.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 1.0, "review": "I am HORRENDISLOUSLY disappointed in this product!! I want to return it but I've never returned anything in my life on Amazon and I just don't know how to do it. This was a major pain to set up and to do what I want to do with it can sometimes, if not most of the time, be impossible to do. After getting fed up with it, I bought the $50 Roku stick and it works fantastic. Granted, the Roku wasn't all that easy to set up either, but once it was set up, IT WORKS!! And it works far more smoothly that this piece of junk so calls \"works\". Don't buy this piece of junk!! Buy the Roku instead and you don't have to buy the most expensive Roku. The least expensive unit is plenty. Yeah, I'm probably going to eat this Google junk unless they contact me and offer to take it back, which I doubt. In the meantime, if I can keep someone else from being disappointed by this crappy product, I hope I can do so.  DON'T BUY THIS!!! BUY A ROKU INSTEAD!!!", "verified": true, "helpfulness": "1/3", "author": "RON"}]