[{"rating": 5.0, "review": "I am basing this review after only a couple of days of use, and for the most part in comparison to my only other streaming device, a vizio blu ray player.  First of all, it does exactly what it is suppose to.  Second of all, while I do sometimes like using a remote, it is fantastic that I can control this device from my phone and computer.  The app on my vizio was outdated and the processing was sluggish, this device responds quickly, and still has a great picture even though it is over wifi.Not sure how I go along without my chromecast for so long, but I absolutely love it.  Still not keen on many apps available for this device yet, but streaming through netflix, pandora, and youtube is flawless.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 3.0, "review": "I thought it would be more versatile.I was misled on which way I could use this I thought I could download content or other TVs other than my own.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 3.0, "review": "I like the idea of it and I've had it for a while now but I find myself still using my Xbox over it to play netflix, I just feel the user interface is so much nicer on the Xbox. But if you are a tech person this is still pretty cool to have around if you head out of town.", "verified": true, "helpfulness": "0/0", "author": "Paras J Shah"}, {"rating": 5.0, "review": "very good item love it fast shipping thank you .", "verified": true, "helpfulness": "0/0", "author": "lopez"}, {"rating": 5.0, "review": "Fabulous and powerful tool. which has helped me to view my favorite TV's programs from the comfort of my smart phone", "verified": false, "helpfulness": "0/0", "author": "Italo Cedeno"}, {"rating": 5.0, "review": "great device. easy to setup and has been working as expected and without issue. great price. I recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Bill Inskeep"}, {"rating": 4.0, "review": "It's worth money. Sometimes you just need to reset it in order to start working properly. I hope there will be more updated so we can broadcast everything.", "verified": true, "helpfulness": "0/0", "author": "milos Vranic"}, {"rating": 4.0, "review": "When we got this item we were pleased with it except we could not use it until we upgraded our cell phones. Which was an unexpected expense we were not aware of.  If the advertisement has stated a little more clearer that your phone had to be at a certain level we might have put off buying until a later date. Other than that it is a neat item to allow us to use our Nexflix from our computer to our tv.", "verified": true, "helpfulness": "0/0", "author": "little grannie"}, {"rating": 5.0, "review": "It took us about 5 minutes to download the app and about a 5 minute learning curve, and we are by means tekkies.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Douglas L. Partlo \"Papou\""}, {"rating": 4.0, "review": "I had my doubts about this but so far so good.  I live in an old house w/cement walls and have always had issues w/the wifi signal getting to my smart tv.  I can finally watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kay Mena"}]