[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing I've bought all year! I purchased this on special for $22.99 and free shipping here on Amazon and it really is the best use of $23 anywhere for streaming of Netflix, HBO Go, Youtube, etc. I use it in my upstairs bedroom and my wifi connection is downstairs and there's no issue with the connection. Works perfectly with my Android phone. Incredibly easy setup. I had a Roku box which I was really happy with, but it broke after a few years, so I saw this on sale and thought I'd give it a go. Best bang for your buck in my opinion for streaming Netflix, etc.", "verified": true, "helpfulness": "1/1", "author": "indiefilm \"filmguy\""}, {"rating": 5.0, "review": "Excellent media player! Minimalist in design and gets all the major internet movie providers. This is the best!", "verified": false, "helpfulness": "0/0", "author": "Diana Walden"}, {"rating": 1.0, "review": "Worst thing I ever bought", "verified": false, "helpfulness": "0/5", "author": "NAJI"}, {"rating": 4.0, "review": "I bought this when it first came out. Google was including 3 free months of Netflix with the purchase, great deal!I gave it 4 stars because of compatibility issues. Also note that I do not own a smartphone, so I stream it from my PC.Pros:Streams Netflix, YouTube, Crackle, HBO Go very well. (You have to download the Crackle app to your PC to get it to work)Cons:Doesn't stream Amazon Prime Instant Video or HuluPlus.Here is a list of Chromecast apps it supports:http://en.wikipedia.org/wiki/List_of_apps_with_Google_Cast_supportNote: You can stream your browser tabs from your computer, but if you do that, you will get unbearable lag.If you have a smartphone, whether an Android or iPhone, I would definitely recommend it.If you're just using it with the PC, then take a look at the compatibility chart first.Also note, Google continually updates it, so hopefully HuluPlus will have an app to stream from the PC sometime soon.", "verified": true, "helpfulness": "0/0", "author": "Shaun"}, {"rating": 1.0, "review": "you play only youtube, thats it.Garbage", "verified": true, "helpfulness": "0/7", "author": "Daniel"}, {"rating": 1.0, "review": "Make EXTRA sure you know which wireless router brand AND model you have, then cross-reference that with the ChromeCast compatibility table on the website to understand the distance the TV needs to be from the router for optimal performance. We wasted $35 on this because we do not plan to upgrade out standard Verizon router. Be warned.", "verified": false, "helpfulness": "1/1", "author": "Stephen B Surber III"}, {"rating": 1.0, "review": "not a lot of support for all apps like amazon prime so it kinda sucks", "verified": true, "helpfulness": "0/3", "author": "Homer J. Fong"}, {"rating": 5.0, "review": "Whoa! This thing works great with a Synology NAS. The DS Video app turns the whole shebang into a remote controlled movie server, even outside the house. The metadata indexing is about 90% accurate.My only remaining qualm is getting softcoded subtitles in .mp4 files to play.It seems to be able to play softcoded subtitles in .mkv files, and it plays external .srt files with the accompanying .mp4 file great.Ridiculously worth it for the price, I imagine it will only improve with the release of more apps.There's no nice way to cast Amazon Instant yet, which is lame. It may have something to do with Amazon trying to push their own hardware (Fire TV).", "verified": false, "helpfulness": "0/0", "author": "Eric Matthew Shinkle"}, {"rating": 5.0, "review": "For the money, it is hard to beat for convenience.  Although I have LG Smart TVs, it is a pain to have to grab the remote, change inputs and scroll through the sluggish TV interface.  The Chromecasts are much faster, and it is so nice to be able to open Hulu or HBO Go and cast it straight to the TV automatically without messing with inputs.  Google Play Music is also great with it.  I also have an app for my TV to change the inputs back to cable once I'm done using the Chromecast.  Now, if they would add more apps...", "verified": true, "helpfulness": "0/0", "author": "Michael L Brazeal"}]