[{"rating": 5.0, "review": "It takes a little time to understand how it works, but once you do, it is a great thing to have!", "verified": true, "helpfulness": "0/0", "author": "Николай"}, {"rating": 5.0, "review": "Love these; I have one on each TV", "verified": true, "helpfulness": "0/0", "author": "Brian Paul"}, {"rating": 5.0, "review": "Awesome thanks!", "verified": true, "helpfulness": "0/0", "author": "Ronin \"Candace M. Walls\""}, {"rating": 3.0, "review": "The browser screen sharing or \"casting\" is so lagged.  They need to make it possible to use this as a device to enable interface between laptop and TV screeen for general computer use, it shouldnt be that hard to do, I mean come on its google.  The fire stick is way better with netflix and amazon and is way faster.", "verified": true, "helpfulness": "0/0", "author": "Jordan P."}, {"rating": 5.0, "review": "At first I thought it wasn't working, so after reading how to address the issue, I gave up and just left it alone.  The next day it was working and has worked wonderfully ever since.  Very happy I purchased it!", "verified": true, "helpfulness": "0/0", "author": "Jonnie \"soulseeking\""}, {"rating": 5.0, "review": "Great! Got as gift", "verified": true, "helpfulness": "0/0", "author": "Carolina Losada"}, {"rating": 5.0, "review": "Easy to set up and the best way to stream videos or music to your tv from any of your device. The quality is HD based on your video selection and no lagging was ever found.", "verified": true, "helpfulness": "0/0", "author": "JI Hye Choi"}, {"rating": 5.0, "review": "The best device to stream HBO, Youtube, and Netflix! I have been using it for a long time now and I have to say I am very content. It changed my HDTV into a smartTV that can stream content very easily and watch movies with my family and friends. Never had an issue with it and being from Google, there is tons of support everywhere.Great little, but powerful device!", "verified": true, "helpfulness": "0/0", "author": "A. Ouni \"Med Student\""}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Steven T."}, {"rating": 4.0, "review": "Happy with it most of the time.", "verified": true, "helpfulness": "0/0", "author": "Wayne Burcham"}]