[{"rating": 5.0, "review": "Chromecast is the best $35 you'll ever spend on ANY electronic gadget. Ever. Google Play Music, Google Movies & TV, YouTube and Netflix all stream flawlessly to your TV from your phone or laptop. This device delivers absolutely everything Google promises and performs well above my expectations for such an inexpensive device. Every TV should have this amazing device plugged into it. Setup is a breeze and you will not be disappointed. Chromecast is a highly recommended addition to any home theater system.", "verified": true, "helpfulness": "0/0", "author": "Larry H"}, {"rating": 5.0, "review": "I absolutely love this device! before purchasing this I use to use my PS3 for streaming purposes. Unfortunately, my 6 sear old console got the yellow light of death; rendering my streaming capabilities to nothing. So instead of spending the $90 to fix my PS3, i bough this instead to use until the PS4 released.Shipping was quick, received it within three day, included easy to understand instructions and was not hard to set up. Simply plug it in to a (HDMI) plug in on your tv and connect the (USB) cord into your TV if you have one ,which you should if you have a fairly new TV.Works great with Netflix and YouTube from my Smart Phone and Lap TopWIFI is required but honestly, who doesn't have that these days lolHope this helped!", "verified": true, "helpfulness": "0/0", "author": "Lance Fisher"}, {"rating": 5.0, "review": "The chromecast was super easy to set up and use. Connected easily to my home wi-fi network, and I can quickly move it from one room to another just by un/plugging it in! I've cancelled my $100+ a month cable subscription finally because i can get what I need through this or local antenna. Being able to stream from my phone, laptop, or tablet is super convenient and easy, great way to play music through my tv & audio system via Pandora! Thinking about buying a 2nd one just because...You NEED to have a good high quality FAST internet connection for this to be successful in your house. That's probably a big reason why some people have issues. .  That and running xp. Who still uses xp??", "verified": true, "helpfulness": "0/0", "author": "CareaBearaSara"}, {"rating": 5.0, "review": "Wonderful product. Absolutely love it ! I use this with my Samsung 40\" LCD TV and it works like a charm.I was easily able to set it up using Chromecast's iphone app (I'm sure the Android counterpart would have been equally successful). Once the connection was setup, all my other devices (both wireless AND wired) were able to detect chromecast through the google-cast extension for chrome.Some useful info -1) Router settings may need to be adjusted in order for chromecast to work. These might be useful links to address router issues: [...] and [...]2) While setting up my Macbook to cast chrome-tabs, I had to adjust Firewall settings to allow it to interact with the Chromecast. I basically followed some steps outlined here: [...] . I had to ensure I wasn't on a VPN network as well.And once set up, I was basically able to connect/cast from all my devices. Quality of the cast depends, as has been mentioned in several places, on the network basically...a faster wifi network will ensure a good quality cast.", "verified": false, "helpfulness": "0/0", "author": "Sudarshan"}, {"rating": 1.0, "review": "I mainly purchased it to use while travelling and watching shows on the hotel TV via my Note 3 android phone.  However I cannot get it to setup via my phone.  Even if I could, the only thing I can watch for free is youtube.  3rd party developers have written apps that allow you to use the chromecast for many other things, such as AllCast, but google releases a mandatory update to chromecast which blocks those applications.  Google clearly wants you to only use it for media services you have to pay for.  They are not trying to help you out.", "verified": true, "helpfulness": "28/35", "author": "Eric Jaakkola"}, {"rating": 5.0, "review": "Great little device - hook it up to your HDMI TV and away you go... stream from your nexus 7 easily.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "This thing is magic.  It took maybe 3 min. to set up and it works great on all our tablets, and notebooks - 5 devices.  Turns you wide screen TV into a computer monitor.  We have an older MacBook that we connect to a wireless keyboard and my nearly blind mother in law can do email and word processing on the big TV with no problem.  It just works great.", "verified": true, "helpfulness": "0/0", "author": "M. Caldwell \"SMandracia\""}, {"rating": 5.0, "review": "This product is easy to set up and does exactly what it is supposed to do. I now have one on every TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Howie D."}, {"rating": 4.0, "review": "We use the Chromecast to broadcast to two other tvs. We don't have to pay for more cable boxes. From IPad cast the ESPN games to non-cable tv and shows from Netflicks. Can do other things on the IPad while it does that.  I think there are more video apps for it now, too.  For the price, it works great.  But I cannot use it to control the shows once it gets going on Netflicks.", "verified": true, "helpfulness": "1/5", "author": "Blue"}, {"rating": 5.0, "review": "With my Google Chromecast and my portable projector from Brookstone, I'm a walking movie projector! I no longer have a TV. Why should you let a TV restrain you and hold you back from living? If I want to watch something in the bathroom, that is my prerogative!My favorite thing about the Chromecast is when a group of my friends are around - we take turns putting up youtube videos we need to watch. We take out our android phones and send them to Google Chromecast. It's awesome!I use Plex Media Player to project my movies that are saved on my computer, and I use my phone to project movies from Netflix.The only problem is that sometimes, videos get a little choppy. I wonder if that's a bandwidth issue though.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]