[{"rating": 5.0, "review": "great item", "verified": true, "helpfulness": "0/1", "author": "jake"}, {"rating": 5.0, "review": "great product !", "verified": true, "helpfulness": "0/2", "author": "allen brown"}, {"rating": 3.0, "review": "It's a good system if you want to just want to watch movies but when it comes to gaming the graphics are good and it is very fluid.  The only problem that I have with the system is on the 8gb that you have, 2gb is dedicated to the memory so that only leaves you with 6gb for storage.  Now look at today's games that are coming in (Modern combat 4, 1.9gb and asphalt 8 which is 1.2gb...etc) it takes up all the space so you have to delete everything on there just to put another app on there.  Don't get me wrong, if you are just using it for movies and tv it blows any other box (Apple, Roku, Chromecast...etc) out of the water but if you like gaming like I do it needs more storage (32gb-128gb) or an micro sd card slot to store games or movies.  Better yet have the system be able to freely be rooted so we can put a 1tb storage on there.", "verified": true, "helpfulness": "0/0", "author": "t matthew folkerts"}, {"rating": 1.0, "review": "I ordered one amd it did not work at all, then, amazon gave me a replacement, again, it did not work, I have to say; do not waste your money on this piece of garbage, it does not work at all.", "verified": true, "helpfulness": "3/10", "author": "antonio cruz zavaleta"}, {"rating": 3.0, "review": "Well made device but had a limited list of apps to choose from and the voice searching seemed to prefer Amazon's paid vod even though my hulu account was linked and had the same content.  For now I'll stick with my Roku.", "verified": true, "helpfulness": "1/1", "author": "Justin Warfield"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/1", "author": "christos efthimiadis"}, {"rating": 5.0, "review": "Get to watch so many prime movies and tv shows for free with prime!! better than netfixs because you get so much more!!", "verified": true, "helpfulness": "0/1", "author": "Scott Lmabert \"Scott Lambert\""}, {"rating": 1.0, "review": "I can not get it to sign in as a guest device on my wi-fi system but I plan to make some change to the system so I decided to keep the Fire TV anyway.", "verified": true, "helpfulness": "2/3", "author": "Mendez Avery"}, {"rating": 2.0, "review": "I have tried, on three separate occasions to use an Amazon Fire TV. Two out of the three units that I bought gave me the same negative results. On Amazon Prime and Netflix, I received messages that said either \"Unknown Error\", or just \"Error - Try Again\". This was over and over. I could not connect with either of them. The third one, which was really the first one that I bought, was, and still is fine. So, for my other two TVs I am back to using a Roku, which have never failed me.My suggestion to those that are considering buying this unit is to read all of the 1, 2, and 3 star reviews of this product before you purchase one of these.", "verified": true, "helpfulness": "0/1", "author": "Pamela"}, {"rating": 3.0, "review": "Things noticed switching from Logitech revue Google TV:-video occasionally stutters/glitches in Netflix-no USB thumb drive/HDD support-no real YouTube app, can't watch Google play purchased items. A handful were able to play through a weird YouTube 3rd party app that's basically a web version of YouTube for TV, but not the ones that counted.-Netflix is treated like a 3rd party app, and you can't pin apps where you want it. So you go dig through your apps, and then after picking it on a second screen hit launch app. Seems like a dumb complaint, but coming from a Logitech revue with Google TV, it is less convenient.-remote is tiny, and easy to lose. And having a keyboard with touchpad as well implemented as the Revue's, with universal search, I do miss being able to quickly get to exactly what you want.All the other features are true. Its much faster, voice search works well only for select content providers, hardware is small and solid, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Patrick Morris"}]