[{"rating": 3.0, "review": "My fiancee and I have owned an Apple TV for a few years now and we originally bought it so we could use apps like Netflix and Pandora on an older TV, as well as mirror from our iPads.  Well it turned out that the Apple TV did neither of those things great, and while the mirroring feature was fun, it also had its flaws.Fast forward a couple years to when the Google Chromecast was announced.  We thought \"finally, something that will do what we hoped our Apple TV would do\".  At this time we also had a new TV and blu-ray player that had their own apps features, as well as a Wii U console which also has its own apps.  So at this point the Chromcast is pretty much redundant except for its ability to mirror other devices.  However, the way it accomplishes this is very clunky in my opinion.  You have to download a Chromecast app to your device which basically adds plugins to a select few other apps which allow you to mirror. I've had the product for a few months and have only used it once.  As with any other Google product, it has nice design and the software has good aesthetics.  The pricepoint is great and might be the number one redeeming quality about the product.  I would only recommend this product to someone who has a lot of older home entertainment devices that are not yet equipped with app technology.", "verified": true, "helpfulness": "0/0", "author": "Drewford"}, {"rating": 3.0, "review": "The chromecast is great but the HDMI port I plugged it into broke. Not sure if that's my commputer or the chromecast,", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 3.0, "review": "Disappointed, i though it will screen mirror. If I don't have wifi is a useless gadget. Need more development i think", "verified": true, "helpfulness": "0/1", "author": "javier ruperto"}, {"rating": 2.0, "review": "I have been sitting here since yesterday trying to get this stupid device to work right.  Took me forever to set it up, finally after all the updates got it to work, but then it keeps crashing!  I am tired of wasting my time on this device.  I have never been impressed by google products.  They make useless/impractical things.  I thought I would be able to use this for desktop mirroring.  That doesn't work right. I don't understand the point.  I would consider this a \"poor mans\" media streamer.  I mean if this is all you can afford then I guess go for it.  I don't consider it wife or child friendly and nobody wants to sit on their couch load up a video on their phone than \"cast\" it to their tv.  I can save 1/2 the time just using my roku.  Roku is wife friendly, and it works!!!  If you can spend a little bit more money just get a roku.  This device to me is dead in the water.", "verified": true, "helpfulness": "0/0", "author": "moman"}, {"rating": 5.0, "review": "I'm suprised so many people had a hard time installing this. It's so easy plug it in go online, open an account put in the code done. Gave one to my 8 yr old granddaughter shen had it running in like 5 min. I hane a nook and the app works fine. Son has I phone and I pad no problems.", "verified": false, "helpfulness": "0/0", "author": "Trex"}, {"rating": 1.0, "review": "Well, it worked once, but I lost Internet Explorer because it downloaded this virus /malware thing called MalWare.Generic.834 , a \"converter\" of some sort that was almost impossible to uninstall. The second time I tried to get it working my antivirus caught it. Enough was enough ! Its on its way back to Amazon tomorrow .....Mike", "verified": false, "helpfulness": "0/3", "author": "Michael Grisdale"}, {"rating": 1.0, "review": "i live in  Malta i have good sony tv the cromecast works But every thing is in slow motion my internet speed 17mbts can any one help.the play back on my lap top is ok.", "verified": false, "helpfulness": "0/0", "author": "Mr. Brian C. Austin \"B Austin\""}, {"rating": 5.0, "review": "i love this device. when my friend first showed me hers i loved it. we watched videos from her phone and it looked like a movie. HOWEVER, i live in a dorm, so i wasnt aware that it doesnt operate on public wifi , so i can not use it. if anyone knows how i can get around this that would be great because i dont want to return it, but i do want to be able to use it.", "verified": true, "helpfulness": "0/0", "author": "Kym"}, {"rating": 5.0, "review": "Google strikes again.  Great product, easy to set up, adds a new touch of variety to viewing options.  Just dumped my Roku...", "verified": true, "helpfulness": "0/0", "author": "Gary Wood"}, {"rating": 3.0, "review": "It worked well and I was able to setup easily. I bought it under the impression that anything which is displayed on Chrome browser on any device can be casted to TV. This is true only for Chrome browser running on a laptop/desktop which will requires a cast extension to be enabled. Cast extension is not available or supported for Chrome browser running on Apple devices. I did not try with Android handheld devices but some user forums did suggested that cast extension does work for Android devices. In short, if you have apple handheld devices and you are thinking you can use it as a replacement for Apple TV then you will be disappointed. Only thing which i was able to cast from iPhone was YouTube which anyways I can do using Roku. So I had no use for this new device and had to return. Currently I am waiting to receive refund from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Shekhar Razdan"}]