[{"rating": 4.0, "review": "Chromecast was easy to install and it works great with Netflix.  But when do we get support for Amazon Video?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I used this little stuff for about two weeks and it is really amazing.  I recommend this little electronics machine. It works perfectly as advertised. But every one should be aware that you need to purchasea source of streaming for the program to watch. In fact you can still stream from you tube but it had no that much HD films.  There fore you should subscribe other sources like Netflix as I did for 7.99 a.month.  Another important thing you should verify before you purchase this item is your Internet speed.", "verified": true, "helpfulness": "0/0", "author": "Tefera A. Tessema"}, {"rating": 5.0, "review": "This product is easy to us , I love it !!!!  The hard part is to get what you want to stream though it .", "verified": true, "helpfulness": "0/0", "author": "james connochie"}, {"rating": 5.0, "review": "Gave four of these out for Christmas, they love em also!  I had bought one, put it to use and immediately bought the Christmas presents.", "verified": true, "helpfulness": "0/0", "author": "Brian F Aikens"}, {"rating": 1.0, "review": "Nothing is good about this device. Google tag was enough for me to try it but i am only disappointed. Nothing really worked, the streaming break so often that my wife got irritated and decided to watch rather on her 21\" desktop than 55\" TV. I was frustrated. It don't have much apps and mostly you can stream your browser. $30 looks too much for this useless device. I thought of asking my friends who have used to rule out the chances of defective piece but atleast 3 people i asked, they also had same experience and choose to return the device, i eventually returned the piece.", "verified": true, "helpfulness": "1/2", "author": "Rakesh Sinha"}, {"rating": 1.0, "review": "Like many other reviews here I thought I could mirror my tablet/smartphone screen with this item not just stream a few apps that basically any wifi device can do nowadays.  I also didn't know it needed to be plugged in although that isn't that big a deal to me.  As of right now this thing is useless for me I'm hoping they add screen mirroring in the future and not just to android 4.4 and newer devices", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great product for my family. It was very easy to setup and use. I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Optimus Prime"}, {"rating": 5.0, "review": "In a few words I love it, will  defenetly buy it again  since I gave it away as a gift", "verified": true, "helpfulness": "0/1", "author": "carmen d pocasangre"}, {"rating": 3.0, "review": "It does what it says it does but it doesn't work well all the time! Hope they can fix a lot of issues with future update without releasing new hardware every year!", "verified": true, "helpfulness": "0/0", "author": "Bk"}, {"rating": 5.0, "review": "Really good device.  And the 3 months of Netflix means it costs $5.  I would recommend this to anyone who wants to watch streaming TV.", "verified": true, "helpfulness": "0/0", "author": "Neil Gussman \"SGT Guss\""}]