[{"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "ms1223"}, {"rating": 5.0, "review": "In my experience of the product he really good and deserves 5 ​​stars", "verified": true, "helpfulness": "0/0", "author": "Mohammed Atiah"}, {"rating": 5.0, "review": "I have 2 now. Great device, more app software being developed every day. I have had all my friends over and they are all impressed.", "verified": true, "helpfulness": "0/0", "author": "Thomas Richardson"}, {"rating": 3.0, "review": "Not as good as apple tv. not able to show pictures and videos  directly on your TV", "verified": true, "helpfulness": "0/1", "author": "Dave \"Wind rider\""}, {"rating": 3.0, "review": "Works but very limited applications.", "verified": true, "helpfulness": "0/0", "author": "Tim w harms"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Adel Alshammari"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Miguel Go"}, {"rating": 5.0, "review": "This is a great product.  I bought it as soon as it was released and use it regularly for streaming netflix and youtube with no problems.  I don't like using it for sharing my desktop to the t.v. and wouldn't recommend it for such use.", "verified": true, "helpfulness": "0/0", "author": "Daniel Wilson"}, {"rating": 5.0, "review": "I love my chromecast. It has a little issue connecting every now and then and sometimes I have to unplug it and plug it back in, but I love using it to cast tabs from my chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Icky doo"}, {"rating": 4.0, "review": "Chromecast is easy to setup, easy to use, and a great device.  Chromecast is surprisingly small; not much bigger than your average USB flash drive.  The list of apps that are compatible with the Chromecast seems to be ever growing and you can now stream from Google Chrome on your laptop with the click of a button.  It's amazing how inexpensive this device is!! The only negative in my opinion thus far is that streaming from Chrome on an Android device requires a work around and is not compatible with Chrome on an Apple device.", "verified": true, "helpfulness": "0/0", "author": "MK \"makdaddy\""}]