[{"rating": 3.0, "review": "Movies arent so modern but they are free. I live in the country where wifi at times can be temperamental.", "verified": true, "helpfulness": "0/1", "author": "CFord \"CFord\""}, {"rating": 4.0, "review": "The best part - it remembers what you watched and suggests other programs with similar themes so you don't have to do big search all the time.  I also enjoy the voice activated search.", "verified": true, "helpfulness": "0/0", "author": "Arthur C."}, {"rating": 2.0, "review": "I wanted to love it.  I truly did.  It has issues with its internal memory and just stops working.  This happens ALL the time.  I am always having to look up ways to try and resolving the freezing and error codes.  You could have done so much better Amazon!!!!", "verified": true, "helpfulness": "0/3", "author": "Kymberli B."}, {"rating": 5.0, "review": "its awesome!", "verified": true, "helpfulness": "0/1", "author": "Kathleen H. Conner"}, {"rating": 5.0, "review": "Wonderful, so easy to install and use. Sorry we didn't buy it months ago.", "verified": true, "helpfulness": "0/0", "author": "Barbara Maskell"}, {"rating": 1.0, "review": "Why not just get a blu Ray player that does the same and more????", "verified": false, "helpfulness": "1/10", "author": "Laura Slater"}, {"rating": 5.0, "review": "This arrived quickly and I gave it as a gift to my son and daughter-in-law.  They seem to be using it very frequently, so I gather that they are enjoying seeing lots of movies with it, so hooray!", "verified": true, "helpfulness": "2/2", "author": "Booklover"}, {"rating": 5.0, "review": "One of the best things I have gotten for a long time.  Easy to use and all the apps with it almost makes my satellite subscription useless.", "verified": true, "helpfulness": "1/1", "author": "Lynn F Gaehle"}, {"rating": 3.0, "review": "The fire tv would be great if all i wanted to do was stream movies. But if you bought it with gaming in mind beware, IT SUCKS.I bought the game controller along with the fire tv and was initially impressed. The graphics far surpassed my expectations, good selection of free games (event the games that cost money are inexpensive) it seemed like a really great alternative to spending the big bucks on a game console and having to buy ridiculously overpriced games. So what sucks about it you ask??? Having so little memory is a real pain. That is where amazon dropped the ball. You only have room for 2 or 3 games at a time. So if you want to buy a new game you have to delete something and lose your progress, just to free up some space.COME ON AMAZON I'm waiting for this one flaw to be fixed and then i will sing it's praises as the coolest, most affordable, fun game systemaround", "verified": true, "helpfulness": "2/2", "author": "Rose"}, {"rating": 5.0, "review": "Amazing device. I bought one, showed to my family what it can do with KODI installed and have now installed in over 20 devices that both our friends and family have purchased. Much easier to use that G box matricom with Kodi or Apple TV. I'd recommend this product to everyone", "verified": true, "helpfulness": "2/2", "author": "Esteban"}]