[{"rating": 4.0, "review": "Really awesome system!  Well be 5 stars after HBO Go is integrated!", "verified": true, "helpfulness": "0/0", "author": "Seth Strege"}, {"rating": 5.0, "review": "We tried the Google chrome stick first but didn't like that you had to use your phone as a remote so we got the Amazon fire TV set up and we love it. It was nice because the device arrived with all of my Amazon prime info. Took about 10 minutes before we were relaxing and watching. Don't gorget to order yourself an HDMI cable as this doesn't include one!", "verified": true, "helpfulness": "1/1", "author": "Jillian"}, {"rating": 2.0, "review": "It's not what I expected. I have a slow internet connection that averages around 1.2 mbps download speed. Watching and reading the ads for Fire TV, I thought the internal memory would buffer an entire episode or movie so I could watch it without interruption. Apparently, it only does this with Amazon content. When I try to watch Netflix, it only streams, so I still have multiple interruptions. Marketing should be more clear regarding the operation of the features so you can make a more informed decision before purchasing this product! I gave it two stars because the picture and audio are very good ( when it is working ).", "verified": true, "helpfulness": "1/4", "author": "Chris Colligan"}, {"rating": 4.0, "review": "The Internet wifi was the only hassle as it didn't have enough speed to run it but agter that was sorted out with the provider it's a great device and you get you're eyes worth.", "verified": true, "helpfulness": "0/0", "author": "Sassy"}, {"rating": 3.0, "review": "There is still a lot of freezing and buffering. Especially with Netflix and Hulu. I have a Roku 3 side by side that is faster and more reliable.", "verified": true, "helpfulness": "1/3", "author": "Steve Sweeney"}, {"rating": 5.0, "review": "Excelent love the speech recg.", "verified": true, "helpfulness": "0/0", "author": "Gilberto A. Baraona"}, {"rating": 3.0, "review": "Fire tv is nice.  Selection of Movies on Prime is slim.  Like, I missed most of \"Red State\" that was on regular cable tv (Chiller).  I went to search on prime to watch it, They are still wanting an additional $3.99 to watch the movie.  How can it be on basic cable and still get charged extra to see it on prime.  That is just an example.  There is more Movies I have seen on regular cable and went to try to watch on Prime and it say's additional charges.  Come on, This was a movie in 2011, why is there still additional cost for a movie that is over 3 years old ?.  Went to watch \"The Secret Circle\" the 1st and only season.  It shows it but say's it's \"Unavailable\".", "verified": true, "helpfulness": "0/1", "author": "Stephen D. Georges \"coachdrivr\""}, {"rating": 5.0, "review": "Love this, solved problem of nothing to watch I spare room. Set up really easy and my 10 yr old operates it great. Might just get this and do away w expensive cable service", "verified": true, "helpfulness": "0/0", "author": "amanda"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Rodney Bridges"}, {"rating": 4.0, "review": "It's a good device, haven't been able to get the sound to come from the fiber optic yet though.It's very disappointing that the USB port doesn't work. Had to root the device and manually add the USB with an app.It's a pretty basic feature to play media from USB on a \"media player\" and when I called customer support they tried toclaim that it couldn't do it because of \"software reasons\". That is a lie, cause it worked fine manually till my box receivedan update over night which took away my full access and pretty much breaks it if I try to get the access back.It's a good thing I can still sideload applications that allow me to stream the media I own from my NAS, or else I would havejust returned it for a google Nexus Player, which is pretty much the same device, lacking the SPDIF port and not locked down.", "verified": true, "helpfulness": "2/2", "author": "Michael J. Salmons \"Michael Salmons\""}]