[{"rating": 5.0, "review": "Refurbished but flawless in appearance and function.  The have two now and they get daily use.  We paired it with the Logitech Ultimate and Ultimate Hub so one remote and all of our phones and tablets can control FireTV.  It's a powerful and convenient combination.", "verified": true, "helpfulness": "0/0", "author": "Doc S. Hodges \"Doc\""}, {"rating": 4.0, "review": "Had it for a week now and so far I've  been happy with it.  Seems to have good video speeds and processes commands quickly.  I bought it replace a PS3 and for the purpose of streaming video and music it has been better than the PS3.  So far no video freezes or slow start-ups.  Will update if that changes.  My only complaint is the menu is a little confusing and does not show any of my Netflix programs in the recently viewed category.  BTW, I love how I could mount the box on the wall behind my TV using a 3M mounting strip.", "verified": true, "helpfulness": "0/0", "author": "J. Hallen"}, {"rating": 5.0, "review": "I'm seeing great resolution, my TV never looked better.  Excellent selection of movies and TV shows on Prime, including some that Netflix does not cover, and Plex is a Godsend!  I'm glad I've engaged Amazon Fire TV- it's way better than Cable!", "verified": true, "helpfulness": "0/0", "author": "T. J. Perez"}, {"rating": 5.0, "review": "I am loving my Amazon fire TV", "verified": true, "helpfulness": "0/0", "author": "tabatha ealy"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Nate Rowland"}, {"rating": 3.0, "review": "Would like better if remote wasn't so flimsy and there were more options through prime...paying for a service that costs additional for most shows and movies", "verified": true, "helpfulness": "0/1", "author": "Toni"}, {"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "judith a. rosenberg"}, {"rating": 5.0, "review": "Went on sale right after I purchased it.  I sent Amazon an email & they refund the difference.  Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "justina breci"}, {"rating": 5.0, "review": "Love it, we use it all the time.", "verified": true, "helpfulness": "0/0", "author": "mb529"}, {"rating": 3.0, "review": "Excellent like it.", "verified": true, "helpfulness": "0/0", "author": "CHALO R"}]