[{"rating": 4.0, "review": "FIre TV is not bad, considering the length of time it's been out. However Roku does have more options.", "verified": true, "helpfulness": "0/0", "author": "Melissa Kihnemann"}, {"rating": 5.0, "review": "works so easy to find any app you need", "verified": true, "helpfulness": "0/0", "author": "Julie McKinstry"}, {"rating": 5.0, "review": "So far so good!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Pamela Parsons"}, {"rating": 5.0, "review": "You cant beat Amazon Fire TV for ease of use, drive space, and overall quality.", "verified": true, "helpfulness": "0/0", "author": "Kingfish"}, {"rating": 5.0, "review": "I am so impressed by Amazon having such a great products.  I own Amazon Fire Stick which works great but I wanted more who doesn't right and Amazon Fire TV is able to give me everything that I want so many possibilities to watch TV, I am saving so much more now that I don't have cable.  I purchased also the game controller, my kid loves to play.  I didn't want to spend more on a separate game system so decided to pay a little more and got a fully equipped game controller.  Love the voice control very easy to find no more moving around letters to search, just so simple and so convenient.  Love, love using my Kindle Fire to watch and be able to continue watching on the big screen.Love, love my Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Karen garcia"}, {"rating": 5.0, "review": "Great, just what I wanted!", "verified": true, "helpfulness": "0/0", "author": "Coral J. Waggoner"}, {"rating": 5.0, "review": "Love it ,plan on turning more sat channels off.", "verified": true, "helpfulness": "0/0", "author": "Terry Alan Fite"}, {"rating": 5.0, "review": "Love this.  So awesome.  It's really a hassle to pipe video from my computer, to the TV...there's no remote, so I have to get up to play/stop video...I have to adjust the browser, screen savers interrupt playback, etc...  Now that I have this Fire TV unit, everything is so much easier.  Accessibility is a cinch now.  As a Prime member, I can now watch all the Prime content easily, and without messing with my computer.  Even watching Netflix has become much easier.  I have a Samsung TV, that allows me to watch Netflix directly, with just an internet connection, but accessing it is much easier with the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Thomas A. Anderson \"pantone354\""}, {"rating": 2.0, "review": "Costs are too high for cable items", "verified": true, "helpfulness": "0/1", "author": "Mr Kerry Wiles"}]