[{"rating": 5.0, "review": "Works so well, it's beyond amazing! I was actually surprised at the high quality of the video, it's such a tiny thing. It will be even better when more apps support it, but I was delighted when I found out that even my first-generation Kindle Fire can send Netflix videos to it! Also pleased that it's compatible with my 4th gen iPod Touch. It's definitely a ground-breaking gadget!", "verified": true, "helpfulness": "0/1", "author": "Bob C."}, {"rating": 2.0, "review": "Chromecast in short, is a poor man's media player and not a very good one. If you can spend $50, just buy a Roku. If $35 is your limit, Chromecast may suit you. ( of course if you have Internet TV, you don't need either).Google does search and has largely 2nd rate products in every other space.Chromecast  does only one thing - stream Netflix and YouTube playing on your mobile device to your tv.If you have a Roku or boxee or WD tv live, you don't need it. If your tv is Internet enabled - you don't need it. If you have Apple TV, you will hate Chromecast.If you have a small PC connected to your TV with XBMC installed, you will find Chromecast silly.And that's the point - This is a silly little product with nothing of value.I don't have Apple TV so can't say how setup is on it.I have a small net book connected to my TV. I can play all my music, movies photos on TV. I installed XBMC and now I can stream movies, music from my ipad to my TV.Chromecast in short, is poor man's media player and not a very good one. Don't buy if you can spend $50 for a real media player.", "verified": true, "helpfulness": "2/3", "author": "AA"}, {"rating": 5.0, "review": "This thing is slick, plug and play, smooth operation and easy to connect devices. Software and flexibility of use is a bit limited at the moment but I am sure the apps will be flowing before to long.", "verified": true, "helpfulness": "0/0", "author": "bryan"}, {"rating": 5.0, "review": "First of all i would like to point out that the Amazon Global Delivery works great for Germany. The Part was send out 15. September and i have revived it 6 days later (21. September) with non Express Delivery.The Setup of the Tool works good, please note that you need a Wireless Connection for the first Setup, after that you can use your PC Ethernet Connection to cast Stuff to the Chromecast. I use it with Google Chrome Addon and Iphone and i like it. Cant wait for more Apps.", "verified": true, "helpfulness": "0/0", "author": "Stefan Sohns \"Stefan\""}, {"rating": 3.0, "review": "Good product, great price.  Works well with netflix although chrome mirroring is a bit laggey.  Looking forward it more compatibility with more apps.", "verified": true, "helpfulness": "1/1", "author": "Sean M"}, {"rating": 5.0, "review": "I can't wait for more I'm in love.....this is one of the most amazing product...I order two of them right after it was announced and oh my goodness this is awesome", "verified": true, "helpfulness": "0/0", "author": "Donovan A Williams"}, {"rating": 5.0, "review": "Delivery time was very delayed product because there was no stockthe product works perfectlyVery easy installation, up and running in 5 minutes. Not much content, Netflix's and you tube. Maybe Apple TV on the cheap. Waited a looooong time for product.", "verified": true, "helpfulness": "0/0", "author": "Mauricio Ramirez Mesa"}, {"rating": 2.0, "review": "The setup was ingeniously designed, but I kept running into hiccups all along the way. I have 50mps and have great wireless speeds everywhere in my home, but this thing doesn't seem to be working right. Only one mobile phone works well with it in our family. The laptops work OK, but it produces a lot of lag and buffering videos rendering it useless in most cases.The only bonus is that it wasn't expensive so I feel I only wasted $35.", "verified": true, "helpfulness": "3/4", "author": "Nasha \"Pamic on the streets of london\""}, {"rating": 3.0, "review": "Casting from computer works (via Chrome Browser) fine.However, you can't cast from Chrome Browser from a mobile device or tablet - that's a real drawback and makes this just a 3 star product.You can only cast from mobile devices and tablets if the app has casting abilities written into its code. Currently, the only apps I have found to do casting is Netflix and Youtube. Definitely not enough.Set up is EASY!Cost is great.Love the product.", "verified": true, "helpfulness": "1/1", "author": "ML \"ML\""}, {"rating": 3.0, "review": "Very easy installation, up and running in 5 minutes. Not much content, Netflix's and you tube. Maybe Apple TV on the cheap. Waited a looooong time for product.", "verified": true, "helpfulness": "1/2", "author": "ron"}]