[{"rating": 5.0, "review": "Very intuitive and fun to use!  The selection of content is way up, too!", "verified": true, "helpfulness": "0/0", "author": "J. Girardot"}, {"rating": 4.0, "review": "I would like more children free shows like nikelodeon", "verified": true, "helpfulness": "0/0", "author": "linda watson"}, {"rating": 5.0, "review": "I am so glad that I bought Fire TV!  I decided that my family needed less television in their lives so I cancelled our television service and now we just watch shows that we stream from Amazon Prime.  I went from $100 a month tv bill to $100/year (the cost of Amazon Prime membership)!  SO happy and my kids don't notice much of a difference because they now can just watch their favorite movies when its their \"tv time\".  Highly recommend.So easy to use, even my dad can work it, and he isn't exposed to much technology (he chooses not to have a mobile phone or computer) but he is able to operate the system.  Very easy to set up too!", "verified": true, "helpfulness": "1/1", "author": "Jax"}, {"rating": 4.0, "review": "I like it.  Instant-on and lots of movies.", "verified": true, "helpfulness": "0/0", "author": "Zippy Bird"}, {"rating": 5.0, "review": "I don't have cable, all I have is internet, and now Fire TV.  Best purchase for my money Ive made in years.  This thing is awesome, as long as you have Prime.  Probably be good to get Netflix as well, but Im still enjoying my Prime stuff.", "verified": true, "helpfulness": "0/0", "author": "BIG R"}, {"rating": 2.0, "review": "Thought all years and episodes of 'all' offerings on Prime would have been included!!They arenot and that is a lousy way for a company like Amazon to operate. You have lost a long term customer. Be honest, open, and truthful in everything do...Shame on you.", "verified": true, "helpfulness": "1/4", "author": "DHD"}, {"rating": 5.0, "review": "So easy to use and easy to set up. Exactly what I expected.  It has been fun to practice finding stuff with the voice request.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have had this for a few months now and I LOVE it. It is so much easier to use than some of the other devices that I have experienced. It seems to have the best selection of apps for my liking including Netflix, Hulu Plus and of course Amazon! The voice search feature is very accurate and simplifies the whole process. I would like to see the voice search work on all apps and not just Amazon. Hopefully, that'll happen in future upgrades. Other than that...perfect!", "verified": true, "helpfulness": "0/0", "author": "Louis Glossip"}, {"rating": 5.0, "review": "I really enjoy the way that the apps are arranged.  If you use a smartphone, you can operate the Amazon Fire TV.  I have a Roku and find that this is much more user friendly. The setup was super easy.  I am looking forward to more apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of the best products I have ever purchased.  The fire is as easy to install as advertised and the best feature is the voice command.  My husband is severely visually impaired and this remote makes him independent for entertainment when I am away from home briefly.  We both recommend this item highly.", "verified": true, "helpfulness": "0/0", "author": "M. Matherny"}]