[{"rating": 4.0, "review": "$35 is all you need... unbelievably easy and Google is still improving it. It's still in beta technically but it's complete enough to enjoy to the fullest.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I use this product a lot. I got it for so cheap and I most definitely got what I paid for.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 5.0, "review": "Occasionally it seems a little buggy. For $35 dollars though, it functions GREAT!! Netflix, tab casting, pandora, I cannot think of anything else I could ask from it. Though my wife is bound and determined to make it show a slideshow. I am sure there is a way to do it, and she will figure it out.", "verified": true, "helpfulness": "0/0", "author": "Nicholas John"}, {"rating": 4.0, "review": "The Chromecast is very easy to setup (i have an android phone) and easy to use.  Since i purchased the first, I have purchased a second.  The only reason I did not give this 5 stars is due to the lack of wide spread app support.  While some apps have been added since i first purchased, it simply needs more options and easier integration with other media sources.", "verified": true, "helpfulness": "0/0", "author": "onomonapea"}, {"rating": 2.0, "review": "I was so excited to get this. It was unavailable for so long after the first time I read about it. Seemed like a great device at a great price.I placed my order, received it quickly (thank you!), connected it and no go. For some reason this device would not work with my modem.I returned it, no trouble and got my refund right away. The service was great, exactly what was promised but the technology wasn't there. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Angela Nations"}, {"rating": 5.0, "review": "Received it for Christmas.  Works great.  I've heard people say they couldn't use their Kindle.  However, I used my Kindle to set everything up and have had no problems.  Would highly recommend the Chromecast!", "verified": false, "helpfulness": "0/0", "author": "Linda"}, {"rating": 4.0, "review": "I like this because I can play it from my computer, tablet and/or iPhone. Faster connection then my hi-end blu-ray player. Wish more apps were out there for it. Plex, Netflix and YouTube work great. I would recommend it and I purchased three more recently for Christmas gifts for my hi-tech son's. They love it!!!", "verified": true, "helpfulness": "0/0", "author": "Mystarmaker"}, {"rating": 3.0, "review": "Got this when it was on sale a few weeks back as part of our \"testing of the waters\" on what it would be like to \"cut the cable\" and get off of FIOS.  It seems to work well when streaming You Tube videos but is completely unreliable when streaming off of TV sites directly such as PBS.  I get a lot of connection drops when streaming the TV sites.  I've yet to subscribe to Netflix or Hulu Plus, so am hoping that using either of those services work better.", "verified": true, "helpfulness": "0/0", "author": "Yllabian Space Guppy"}, {"rating": 5.0, "review": "Super easy setup.Works well enough for Youtube and Netflix.Only issues I've had may be specific to Netflix mobile app.Look forward to seeing more apps and trying Hulu+ app.", "verified": true, "helpfulness": "0/0", "author": "Matthew Blanchette"}, {"rating": 5.0, "review": "This HDMI port lets you stream anything from your computer.from Iphone or Tablet it lets you stream netflix, Youtube, pandora and other aplications.AWESOME!!I'll recomend to have a stable and fast internet connection!!", "verified": true, "helpfulness": "0/0", "author": "Sibling"}]