[{"rating": 5.0, "review": "Love our chrome cast. We have one for every room", "verified": true, "helpfulness": "0/0", "author": "e Owens"}, {"rating": 5.0, "review": "It's the best thing ever and i would love to buy another one", "verified": true, "helpfulness": "0/0", "author": "Kevon Simms"}, {"rating": 5.0, "review": "Shipped super fast. Didn't think we would use it as much as we are! Barely ever watch cable tv anymore! Very pleased with this purchase ended up getting both my sisters one for Christmas as well!", "verified": true, "helpfulness": "0/0", "author": "alexandra dispirito"}, {"rating": 4.0, "review": "Works great for the most part. I love being able to cast almost anything from my phone. It's nice not having to keep a separate remote around and being able to control any TV in our house. The reason I deducted a star is because it frequently drops the stream at times. I've seen this happen most often with ESPN where as the Roku 3 never drops it despite being farther from the wireless access point.", "verified": true, "helpfulness": "0/0", "author": "James V. Mudd"}, {"rating": 5.0, "review": "Great product, works well", "verified": true, "helpfulness": "0/0", "author": "kobi"}, {"rating": 4.0, "review": "Can be useful for the simple things such as Hulu, Netflix, and Youtube but a bit annoying requiring a secondary device for everything. Slingplayer absolutely sucks streaming on this. It's very clearly the Sling media software though.For the price you really can't beat throwing these on a couple TV's in the house, but it lacks in certains areas where other TV devices excel.Would love to get one of these with a more powerful wireless device capable of higher speeds.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "I use it in my room since I don't want tonpay for another cable box.  Easy t plug into other tv's.", "verified": true, "helpfulness": "0/0", "author": "Joseph C Marmol"}, {"rating": 5.0, "review": "Great price and works with my streaming services. For those that don't support it native, i just cast from the laptop browser. I have noticed that certain apps become more/less stable after releases so you might see some variation in your experiences due to application development.", "verified": true, "helpfulness": "0/0", "author": "Jack Wright"}, {"rating": 5.0, "review": "It helps me view things from the internet on to my TV.", "verified": true, "helpfulness": "0/0", "author": "Arzi Rachman"}, {"rating": 5.0, "review": "Excellent devices for any tv set, specialtly for older version led and lcd. The respond from the hand held to the chrome is excellent speed.", "verified": true, "helpfulness": "0/0", "author": "ramon"}]