[{"rating": 1.0, "review": "For the first 15 days this product was going to get a 5 star rating. I was getting HD reception on my TV - way better than my Roku box.  After the first 15 days the volume stopped for all videos and resetting Chromecast didn't fix the problem.  Google's help page is terrible and there is no help on how to fix it.  If you are curious buy it but expect it to stop working. Google once again proving, they are unable to create a working hardware.", "verified": true, "helpfulness": "1/2", "author": "Amitava Bhattacharyya"}, {"rating": 1.0, "review": "It would be nice if this worked with more than 6 apps - if you want to watch Amazon Prime don't plan on using Google Chromecast.  If I can't find any info on a software update that expands the use I'm going to return it.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "it just would not work every time from our toshiba laptop.Apple products and my Friend's adroid phone it works fine.", "verified": true, "helpfulness": "0/0", "author": "Stephen Vayo"}, {"rating": 5.0, "review": "It seems to work very well even with my slow connection look out RoKu new kid on the block great deal 35.00 set up was easy remember you Chromecast has to have the same setting as your wifi.", "verified": true, "helpfulness": "1/1", "author": "Alvin Lee"}, {"rating": 3.0, "review": "4 STARS IF USED WITH NETFLIX, ETC ONLY.  I.e. ONLINE STREAMED MEDIA.  0 STARS IF YOU WANTED TO BE ABLE TO STREAM YOUR STORED MOVIE MP4 FILES FROM A HDD CONNECTED TO YOUR WIRELESS MODEM. THAT WOULD BE COOL AND, BELIEVE ME, IT IS COMING.  THE ONE WHO FIRST MAKES THIS ITEM WILL MAKE A FORTUNE. IT IS NOT ILLEGAL TO HAVE DVDs & BLURAYS IN MP4 FILE FORMAT. THOSE STORED ON A HDD AND STREAMED WIRELESSLY FROM YOUR WIRELESS MODEM DIRECTLY TO THIS DEVICE PLUGGED INTO YOUR TV'S EXTRA HDMI PORT.....PRICELESS. IT IS MY BELIEF THAT GOOGLE IS A BRILLIANTLY RUN COMPANY & THAT THIS IDEA IS IN THIS CHROMECAST PRODUCT'S  FUTURE. THE FIRST TO DO THIS WILL RULE.", "verified": true, "helpfulness": "0/1", "author": "LEADFOOT"}, {"rating": 3.0, "review": "The chromecast couldn't be easier to set up and start casting from just about any device capable of running it.  The $35 price tag also can't be beat.Unfortunately, I choose to stream the majority of my media from Amazon Prime, and would also appreciate the ability to just stream an image of my desktop to the TV.  The chromecast isn't currently capable of doing either of those things. My chromecast ended up being something more of a novelty to me and I just haven't found a consistent use for it in my house.  Even if the capability existed to cast from the Amazon Ap, I'd still be tying up one of my devices to cast to the TV.  A basic Roku box is similarly priced and doesn't need one of my $500+ mobile devices to make it work.Lastly, the Chromecast sticks out pretty far from the HDMI port and the flimsy Micro-USB power cord sticks out even farther... You've got to be careful not to slide your TV around anywhere the back of the chromecast might hit against.  I've accidentally squished the chromecast against a wall with a wall mounted monitor and again against the  TV stand at my parent's house. Now the Micro-USB power cord is bent and is difficult to get situated in the socket on the Chromecast.  I'm afraid if I do it once or twice more it will break off entirely.  Not ideal if you plan on using the Chromecast as a \"portable\" solution that you can carry with you to plug into a variety of displays.Bottom line:  A very cool bit of tech at a nice price, but ultimately useless at my house.", "verified": true, "helpfulness": "1/1", "author": "Jamie Ziegler"}, {"rating": 1.0, "review": "Update. 3 months later, this device still doesn't work on my downstairs TV. Google of course has not addressed such issues, so if it works, great, if it doesn't, you're on your own. Skip this and check out EZcast; it works much better and isn't locked down like this device.This device is still in the premature stages. It doesn't work with all HDMI ports on all TVs. On mine it works with one tv's HDMI ports, but not the other TV. It's a problem, and there is no support from Google on this. The casting is pretty basic at this point, you can't even cast the movies you made using your phone/tablet camera. Basically you are locked into casting only \"bought\" media, or your web browser. Would definitely not recommend wasting your money on this at this point until it can be used to its full potential.", "verified": true, "helpfulness": "0/0", "author": "Teredactle"}, {"rating": 3.0, "review": "The video quality is great! The sound quality is great! The only problem is it is still very limited on the amount of apps that can use it. When it becomes more like mirror cast that will be great! I have seen a lot of people rate this very high because the price is so good…I do not think a low price justifies a higher rating.  It is definitely worth it though if you even if you watch a couple youtube videos a month with it. I love being able to take my Nexus 10 and watch youtube on my TV. It is a great way to watch VICE!They really need to get more apps on board!", "verified": true, "helpfulness": "1/1", "author": "Howard"}, {"rating": 5.0, "review": "This is amazing! I have used it for 2 weeks and as long as you have decent internet connection, you're in good shape!", "verified": true, "helpfulness": "0/0", "author": "Sudha Regmi"}, {"rating": 5.0, "review": "Excellent clarity; auto detects resolution; no delays and good signal strength.I can Q videos from my andoid phone, tablet or even windows PC. Using it everyday extensively.Giving four starts since onlu youtube and netflix are supported now. However, they works best. I love  the product.", "verified": true, "helpfulness": "1/1", "author": "Zachary"}]