[{"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Jesus R."}, {"rating": 4.0, "review": "This little gadget is fantasticexcept for the power cord.I have to have a 8 foot extension cord to be able to power it. The tv is on a regular 5 foot dresser and the power cord of the adapter is not long enough to reach the standard power outlet on the wall.", "verified": true, "helpfulness": "0/0", "author": "E. Terrosa"}, {"rating": 1.0, "review": "I bought one in hopes that I would be able to watch more streaming video through the Chromeplay but found that having an HMDI cable out on my iPhone works better than the chromecast.", "verified": true, "helpfulness": "0/0", "author": "W. Gamble"}, {"rating": 5.0, "review": "I LOVE this thing!!! I bought it as Christmas gifts and everyone loved them...I cant wait til I have one on all the TVs in my house. They are super easy to use and any smart phone can stream media on your tv...I no longer use my BluRay player for streaming cause this is faster and way easier to navigate...", "verified": true, "helpfulness": "0/0", "author": "Kimmy"}, {"rating": 5.0, "review": "Nothing beats the convenience of being able to stream to your tv from your phone laptop or kindle.buy it you won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "M. BIANCHI"}, {"rating": 5.0, "review": "I actually ordered a Chromecast for all of my family and friend as gift . easy access to YouTube... i recommend that", "verified": true, "helpfulness": "0/0", "author": "Mahnaz"}, {"rating": 1.0, "review": "Once I did the set up with my TV, I could never get theTV to connect with my computer.Total waste of money.  I even ordered a second one.  Can get neither to work.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This product is so easy to use.  Simple Setup and easy ability to stream video from HBO Go and Netflix.  This is the second one we bought to replace our use to the Wii to steam netflix.", "verified": true, "helpfulness": "0/0", "author": "Boss"}, {"rating": 4.0, "review": "so far so very good, I hope doesn't break down right after I pay it or have the warranty expired.  The flaw is that reproduce only youtube videos, and not really everything commanded by Google/android cell phone.  But I'm enjoying it", "verified": true, "helpfulness": "0/0", "author": "Carlos H. Oliveira \"CHUsa\""}, {"rating": 5.0, "review": "Awesome..good product...we love it and recommend it. Great to stream from iPhone to TV. Best product for great price. One should have this at home.", "verified": true, "helpfulness": "0/0", "author": "SD"}]