[{"rating": 3.0, "review": "I really want to love this device, but the main reason I purchased it was for the mirroring functionality.  Maybe I am missing something, but mirroring my Fire HDX to this device has been a completely disappointing experience. It will often refuse to connect, with both the HDX and Fire TV screens informing me that it will happen at any moment.  Usually after several minutes the HDX will give up and return to the Display settings screen.  The Fire TV, however, still informs me that a connection is pending.  When I am able to make the connection, the display on the Fire TV is actually quite nice.  Until, that is, I try to play any sort of video on the HDX.  Youtube, Plex, directly from the Silk browser, you name it, I have yet to see any goodness from video mirrored to the Kindle Fire TV.  Picture is pretty clear, but the audio tracks are so out of sync with that picture that it is laughable at best and completely unwatchable. Turn off mirroring, and these all are perfectly in sync on the HDX.  The same apps on the Fire TV stream perfectly in sync as well, but try to send video from one to the other and the badness begins. My wife also owns an HDX, and thinking maybe it was mine I tried hers with the same results.  Spotty connections, and poor video streaming when there is a good connection. Surfing, showing pictures, and the like are fine mirrored to the screen, but the main reason I wanted the Fire TV was for mirroring video.  I have tried the Fire TV in all areas in the house thinking it may be caused by interference, but no such luck.  Even using the ethernet connection on the Fire TV results in a similar experience.Maybe I received a semi-defective unit, and YMMV. Other than the disappointing mirroring capability, the Fire TV is quite nice. Streaming works great, the UI is really fast and responsive, and although gimmicky, the voice search is a cool feature.  Really wish I could give this thing more stars!", "verified": true, "helpfulness": "0/0", "author": "Smfar"}, {"rating": 5.0, "review": "I bought this because I couldn't get my password through the local DSL dealer, to work with my Wii, we stream Netflix, so I purchased the Amazon Fire TV. It doesn't take up much space, and the remote is easy.  I haven't used the games or controller, but I am happy with the fire TV.", "verified": true, "helpfulness": "2/2", "author": "Christine Sullens \"CLS\""}, {"rating": 5.0, "review": "As a Prime member I of course love this!", "verified": true, "helpfulness": "0/1", "author": "Kevin"}, {"rating": 3.0, "review": "I am mostly a Apple consumer, but I have a Prime account and wanted easier access to those that material, so I purchased the Fire TV for the upstairs to go with the Apple TV I have in the family room.  The Fire is quick. . . . no delays and the voice command works very good but the organization is sort of confusing.  I don't know why there isn't a Prime button for easy access. ..  overall a good product.", "verified": true, "helpfulness": "0/0", "author": "Felix Gumby \"Quirrell\""}, {"rating": 4.0, "review": "I couldn't be happier with the quality of signal processed and delivered by the Amazon Fire!Mine is connected wirelessly to the router and the image quality outperforms a hard wired XBOX 360 streaming NetFlix, etc.The Google Chromecast is cool and I still use it in certain situations but the stream is far more fragile and always dropping compared to the Fire TV.The remote is a tiny bit small for my hands to be 100% comfortable but I'm really nitpicking to look for a flaw.Anxious for MLB.tv to finish completion of their app so I can finally become a complete couch potato!", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "A must-have product as a Prime Member to enjoy Prime Video on a TV. Still great although a little pricy.", "verified": true, "helpfulness": "0/0", "author": "OptGrow"}, {"rating": 1.0, "review": "I wanted Fire TV to work, especially because of the voice activated remote.  But this unit had electronic issues which I could not solve.  In addition, if you are used to Netflix and can determine in advance the content that is at no cost, then Amazon Fire TV will drive you crazy.  I could find no way to separate in advance content that is instant view and what is pay-for-view.", "verified": true, "helpfulness": "2/6", "author": "Robert Barnhart"}, {"rating": 4.0, "review": "good time", "verified": true, "helpfulness": "0/0", "author": "Esther Concha"}, {"rating": 4.0, "review": "Some of the interface stuff is quirky - can't search for just prime - searched for a show got results for some episodes on Hulu and some on Prime - but once I start watching on Hulu I'm just in Hulu - I can't see the episode list any more so I have no idea if I am missing episodes or not.Other than that - easy to set up - easy to use - great picture - speedy (I have used Apple TVs and Roku Boxes in the past - I find it about equal to the Roku and both are better than the Apple TV)", "verified": true, "helpfulness": "0/0", "author": "Robert E. Giroux"}, {"rating": 5.0, "review": "I have GoogleTV, Chromcast, Roku, and now Amazon Fire TV and can say it is the best at what it does.  I paired my MogaPRO right out of the box and can play a lot of games.  Side loaded apps that work great on the Fire TV.  With the processor and RAM this thing is incredibly fast.  The voice search is never wrong even when looking for foreign titles.  I can not find a single thing to complain about this player.I like the texture of the remote as well.  I have an issue with devices with slick finishes (*cough: Samsung) but this has a nice rubberized style finish that doesn't keep slipping and falling to the floor.  The player is sturdy and small with little heat even after extended play times.  It hasn't froze once since I got it even with side loading apps.This device does everything it is intended to do great.  It does things it isn't intended to do just as well.  It plays video and games with lightning reaction times.  It works great with my Moga Pro which makes it into a game console along with a media player.  With a few apps this can play any local media, web streamed media, and with side loaded Plex Pass you have the unofficial app store so any media is at your disposal.Great buy, great product, and great job Amazon.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}]