[{"rating": 5.0, "review": "Very easy to install, especially if you have a 12-year-old grandson.", "verified": true, "helpfulness": "0/0", "author": "Pamela J. Leonard"}, {"rating": 5.0, "review": "So far it's been great!", "verified": true, "helpfulness": "0/0", "author": "The Collector"}, {"rating": 4.0, "review": "Speedier than my Roku device.  Smoother when navigating also.  The only items I've seen is lack of applications when compared to Roku (I am sure that the library will grow over time) and lack of searching multiple catalogs (apps) for your desired program or movie.  Amazon content is highlighted which would be acceptable since it is their device, but it is much harder to find content on other services without opening said service and searching individually.  This is were I believe Roku truly has an advantage.  When searching for content, Roku will display the results from multiple providers.  This is even though that Roku now seems to highlight M-Go as their primary service - results will still also show OTHER providers.", "verified": true, "helpfulness": "0/0", "author": "Michael Huggins"}, {"rating": 4.0, "review": "I like the fact that I have so many movie options, and that the voice feature is so responsive.  I don't like the fact that the voice feature especially is so AMAZON focused.  I know that its an AMAZON product, but it makes it seem dysfunctional when you are on Netflix and say the name of a movie and it may or may not open in Amazon.  It just makes it look broken or defective.  We love you Amazon but seriously?  The box promotes different avenues you have to just deal with it and at least make it work correctly or else have your own box simply dedicated to you and you only.", "verified": true, "helpfulness": "0/0", "author": "Janice Lynn Duffin"}, {"rating": 5.0, "review": "Well, how great is that!!??  We love it.  We speak to a little black box and we find the movie we want.  Our daughters both have this device and love it as well.", "verified": true, "helpfulness": "0/0", "author": "Judith Gledhill"}, {"rating": 5.0, "review": "Works great!  Easy installation, just follow the prompts.  A little disappointed in quantity of free Prime movies available,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very happy with device.  Opened up full use of tv.  I also found it user friendly.  Victor G Zilinskas", "verified": true, "helpfulness": "0/0", "author": "Victor G. Zilinskas"}, {"rating": 5.0, "review": "This has been neat to find movies that I never got to see in a theater.  It is simple to use and being OLD that is great for me.", "verified": true, "helpfulness": "0/0", "author": "bill osborne"}, {"rating": 5.0, "review": "The best device I have used and the best service for streaming - bar none! Now if the internet service providers could provide a steady signal I would be all set. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Rebecca L Doremus \"The Dream Watcher\""}, {"rating": 5.0, "review": "LOVE my Amazon TVWorth every penny!!!", "verified": true, "helpfulness": "0/0", "author": "Maureen Coffey"}]