[{"rating": 5.0, "review": "I love streaming movies from my Plex media server through my tablet to my 60\" TV. I have enjoyed the heck out of the device, the price was great and I keep finding more uses for ChromeCast. I'm sure it will just keep getting better", "verified": true, "helpfulness": "0/0", "author": "Robert M McKenzie"}, {"rating": 3.0, "review": "This is a easy setup, nifty device that is seeking a purpose in life. It also would be better with battery power.", "verified": true, "helpfulness": "0/0", "author": "Eric Mann"}, {"rating": 5.0, "review": "I was happily surprised how easy this was to set up, but even more awestruck with it's capabilities.  Steaming from all my devices was pretty cool!", "verified": true, "helpfulness": "0/0", "author": "KatnSA"}, {"rating": 5.0, "review": "Purchased one out of curiosity. Took 20-30 minutes for tablet to acquire the signal.Installed it on a bedroom tv that had only cable, with no wi-fi access.Better picture on HD tv than my cable provider.Best bargain purchase I have ever made.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "We now have one of these in each of our HDTVs, and with the API now opened up to any app/developer to use, I'm really looking forward to seeing this good product become even better!", "verified": true, "helpfulness": "0/0", "author": "hamblindave"}, {"rating": 5.0, "review": "I initially bought the Apple TV but returned it when I heard about Google Chromecast.  Easy to set up and easy to use.", "verified": true, "helpfulness": "1/1", "author": "Jason Beene"}, {"rating": 5.0, "review": "This product works excellent as expected.. I could see HD videos perfect and can operate from all of my devices", "verified": true, "helpfulness": "1/1", "author": "GK"}, {"rating": 1.0, "review": "advertised on kindle you would think it would work on the  kindle not compatible, then set up on my aser tablet got Netflix, can't seem to stream other media,maybe because I cant get flash players on this device?", "verified": true, "helpfulness": "0/1", "author": "Ronald Shepard"}, {"rating": 5.0, "review": "I bought one not knowing you had to have the internet (which I don't have) to stream my home videos from my phone to the TV.  So I have not been able to use it and am disappointed for that reason.  However, I bought it because a friend had one and I loved what he could do with it.", "verified": true, "helpfulness": "1/1", "author": "D.hen"}, {"rating": 1.0, "review": "first it works, but I have to spend tons of time to reconnect it with cell phone or laptop everytime when I use it. I am IT personal, I hate it reset it every time. For me, this is not very friendly product.", "verified": true, "helpfulness": "0/1", "author": "Tao Shu"}]