[{"rating": 4.0, "review": "Sometimes I get disconnected from the computer I am streaming from (it might be because I am using the streaming option from Google Chrome and its in Beta).  Otherwise, it works great.  Definitely a better option if you do not want to be held down by just apps.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 5.0, "review": "What can i say, chromecast is awesome! Easy to setup and very good quality streaming to my T.V.", "verified": true, "helpfulness": "0/0", "author": "J911"}, {"rating": 4.0, "review": "The best HDMI streaming stick player. Much better than Roku outside US or Canada. Missing a remote control to not depend on you phone or tablet all the time.", "verified": true, "helpfulness": "0/0", "author": "Robert \"Roberto Santana\""}, {"rating": 5.0, "review": "Easy setup. Love it.", "verified": true, "helpfulness": "0/0", "author": "Rylene Bello"}, {"rating": 5.0, "review": "I really like Chromecast. I bought it to replace my roku, which I had nothing but problems with... I love being able to use my phone and ipad to start Netflix movies or, which is my favorite thing, is to use it to stream pandora though my surround sound during parties. I can be on the other side of the apartment and change the music or adjust the volume right from my phone. I've never had any issues other than when my internet decides to suck, but that is not the Chromecast's fault. You should know this runs though your WiFi, so if your WiFi goes out so does your Chromecast. So far, this has been my favorite streaming device.", "verified": true, "helpfulness": "0/0", "author": "STPJimmy"}, {"rating": 2.0, "review": "Good idea, but behind the times.  It doesn't have nearly the options a roku does, and its form factor can block other HDMI ports.", "verified": true, "helpfulness": "0/1", "author": "Matt"}, {"rating": 5.0, "review": "great to watch hbo go or netflix and your tube on ur TV", "verified": true, "helpfulness": "0/0", "author": "Johnny"}, {"rating": 3.0, "review": "It is OK, not great. I was surprised, disappointed and frustrated. What I can do with an Android pad is limited. That is crazy. YouTube works and that is about it -- really. I had read 'oh-ahm' reviews here and on Google Play for the Android APP and wasn't sure why people were giving it such low ratings. Now I know. Poor quality, non-HD picture. But for $30, it is OK. Installation from a Pad was a piece of cake. Yes, Amazon Prime Videos cannot be 'cast' from an Android Pad. If you don't really need it, keep the money and buy a few drinks. That would be better.", "verified": true, "helpfulness": "0/1", "author": "NH Author \"Papal Historian\""}, {"rating": 1.0, "review": "Chromecast, is a total waste of 40.00 dollars. A total piece of s***! Google should take it out of circulation, and refund all the money back to the buyers.", "verified": false, "helpfulness": "0/1", "author": "Marcellines"}, {"rating": 4.0, "review": "Good streaming, easy setup. Sometimes acts weird - do not know my wireless router or this one.", "verified": true, "helpfulness": "0/0", "author": "G. Holagunda \"GH\""}]