[{"rating": 4.0, "review": "Chromecast uses the Wifi to get the trigger from the user to stream contents from the web. It connects seamlessly to the HDMI input out-of-the-box. Setup in Android and Windows is pretty easy (in fact going to the link and rest was pretty automatic). It needs to be connected to the same network though during set up. It gives a \"handle\" to any youtube/video that is present in the web to be played via the HDMI to the screen. Needless to say, a good internet connection and a good router is essential for this to work seamlessly.A few points to notice (both good and bad):- It takes 10-15 seconds for the video to load from the Android/Windows screen (Nexus 5/Windows 7/Comcast generic router) to the screen. The wait seems to be a bit long.- I have both Roku and Chromecast, I concluded that Chromecast is both faster than Roku and the video quality is crispier.- A bad internet connection makes the Roku video blurry but motion is unaffected (i.e. compromises on pixels but not frames/sec). Chromecast makes the video choppy but preserves the crispiness of the picture (i.e. compromises on frames/sec).- Roku uses the monitor actively and shows what I am typing on the TV screen, where with Chromecast uses the monitor passively, and all typing and searching is on the OS rather than on the TV.- Chromecast (and also some versions of Roku) suffers from no independent audio output channels, which can be extremely handicapping if one wants to use a separate audio system is used for sound. In my case the TV speakers are too tinny. So I had to channelize the audio to a standalone 5.1. I had to buy a separate sound-video splitter which takes the HDMI signal and separates the audio and the video. I tried two different (expensive) splitters, and best quality HDMI cables, but I was not able to completely reproduce the picture quality of the Chromecast when it is directly streaming to the TV. So, I am a bit handicapped, as listening to music using a 5.1, yet getting the best picture quality at the same time is not an option with Chromecast. Hope this will change in future versions.- Some reviews/manufacturers comments on comparisons on WiFi bandwidths used by these devices will be helpful in future.Overall, it is a great device to have, if one can live with the drawbacks mentioned above.", "verified": true, "helpfulness": "0/0", "author": "Arnab Banerjee \"abjee\""}, {"rating": 5.0, "review": "This is my third one that I purchased!", "verified": true, "helpfulness": "0/0", "author": "Walkerdc"}, {"rating": 5.0, "review": "Better than my apple tv", "verified": true, "helpfulness": "0/0", "author": "W. alfaro \"walfaro2000\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "breesoamazin"}, {"rating": 4.0, "review": "This is just okay. It's extremely annoying to have to plug it into the wall to work. My tv is mounted on the wall and now I have this long cord hanging down the wall just for a tiny little usb. Also this does not have Showtime. It does have HBO. It definitely set up easily and works easily. It was a breeze to set up and I loved being able to watch Hulu and HBO on my tv. I'm not sure how much this really offers though as you can't watch anything except the apps available such as Netflix, hulu and HBO. You can't watch any Amazon on Demand shows or much of anything else. I feel like I wasted my money on this. I should have just gotten the Amazon one. It has pretty much everything except Showtime. At least I can use this one to watch HBO.", "verified": true, "helpfulness": "0/0", "author": "Carisa Desposito"}, {"rating": 3.0, "review": "OK, lik a lot of people have said, it works great.  NOW...the dark side.  Chromecast does this beautiful trick of downloading nice images as screen savers every 5-10 seconds.  They even have a way to use your own images from your google account.  PROBLEM IS- This burns about 9GB a month.  For some that's not a big deal, for others its a VERY big deal.  Problem is that there is NO way to turn it all off, unless you unplug it after every use.  I like the machine, but i have to constantly unplug it to keep it from downloading those images every 5 seconds and thats a bit annoying for a problem that could be EASILY solved. .", "verified": false, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "It change my life I absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Silena Rogers"}, {"rating": 5.0, "review": "One of the best things google has made yet.", "verified": true, "helpfulness": "0/0", "author": "Tyler Whitmore"}, {"rating": 4.0, "review": "this works well for streaming from computer to HDM1 on the TV. We are enjoying many new shows from NETFLIX. Can be a little confusing hooking up at first.", "verified": true, "helpfulness": "0/0", "author": "Judy Marsh"}, {"rating": 5.0, "review": "Super easy to setup and it keeps getting more features thru upgrades from Google. A+", "verified": true, "helpfulness": "0/0", "author": "Eduardo Matos Sanchez"}]