[{"rating": 2.0, "review": "Limited usefulness. Channel selection is small, internet streaming does not sync well and only being able to cast from chrome also sucks. Wish I could return for a Roku or Fire stick!", "verified": true, "helpfulness": "0/0", "author": "Diamond Chavannes"}, {"rating": 5.0, "review": "Bought as a gift, giftee loved it.", "verified": true, "helpfulness": "0/0", "author": "Blake Boren"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "JOHNNY JONES"}, {"rating": 5.0, "review": "I love this thing.  Wish I had of purchased it a long time ago.As stated before the only problem I can see is that there is no way to turn it of and it could be a data hog if you are limited.I plugged mine into a usb port on the back of the tv that powers off when the tv is shut down.  If you have to plug it into the wall it will be on all the time.", "verified": true, "helpfulness": "0/0", "author": "Richard D."}, {"rating": 4.0, "review": "Works great and as claimed, but I wish it supported hulu/prime.", "verified": true, "helpfulness": "0/0", "author": "Jacob Heimberger"}, {"rating": 5.0, "review": "I am still working on realizing the full potential of the chromecast. Turns any TV with HDMI into a smart TV which is great. Still waiting on expanded casting from chrome from ipad as they have it on android, but for the cost this is amazing!", "verified": true, "helpfulness": "0/0", "author": "N. Moy \"nmcorp33\""}, {"rating": 4.0, "review": "I recently purchased my Google Chromecast from Amazon and so far it is easy to assemble and navigate. It came in a small box with three items, a USB cord, a power cord and the actual Chromecast stick. The device connects to your TV in the HDMI port; you can power it through a wall outlet or a USB port. The setup is just as easy and it only took me five minutes to get it all connected to Wi-Fi and a wireless device. You have to download the Chromecast app on your wireless device and boom you’re almost done. The Chromecast even works with my wife’s iPad which is a plus because my wife has all Apple products and I have androids. I suggest getting this item instead of an Apple TV because it’s a lot cheaper in comparison thirty five dollars compared to as high as three hundred dollars. If you watch a lot of YouTube videos or movies on Netflix this is the perfect way to get it to stream to your TV. You need the Chrome Browser on your computer to cast non Cast video sources like Yahoo Videos or any website other than Netflix and YouTube because it has the button to Cast directly. With the Chromecast extension for your computer you can cast almost anything to your TV. With this extension installed, a button appears in the top right corner of your browser which gives you the ability to stream content on your browser to your TV. You can also play your Google Music and show off photos through your device to the TV, I myself don’t use those features but it seems like a nice feature to have. After a few months of the Chromecast I have essentially discontinued my cable network and plan on shutting it off for good and just keep the internet. The only downside for me is that there is no button remote, you have to use your phone, tablet or PC to navigate through. But once your stream to your TV your device is free to do other things and that’s pretty cool.", "verified": false, "helpfulness": "0/0", "author": "marcus"}, {"rating": 5.0, "review": "I can now watch YouTube on my TV...awesome! Thanks", "verified": true, "helpfulness": "0/0", "author": "Kai Mc Iver"}, {"rating": 1.0, "review": "Why do I need to have wi-fi to make this thing work", "verified": true, "helpfulness": "0/1", "author": "chad carpenter"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "H P"}]