[{"rating": 2.0, "review": "Not really impressed! I mainly bought chrome cast to stream Netflix to my tv but it will not work! I called Netflix they blame chrome cast and did trouble shooting it didn't work therefore it was chrome casts fault! I called google they blamed Netflix they know it's happening but are working on \"fixing\" the problem! End results I get to deal with a product that doesn't work for what I need it to do! It does work with other sites such as Hulu plus, YouTube, the CW etc!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"I love shoes\""}, {"rating": 3.0, "review": "Technology is cool if you do not own a wifi TV. So far I've been having trouble with connecting and streaming video to play on Chromecast, though it will play with no issue on device.Not satisfied as I had expected to be. I will attempt a few more times either way not too expensive of a loss.", "verified": true, "helpfulness": "0/0", "author": "VRico22"}, {"rating": 1.0, "review": "I don't know about you. But that five cent savings is very tempting. I'm not sure I can contain myself.", "verified": false, "helpfulness": "0/3", "author": "Tina Harjo"}, {"rating": 4.0, "review": "Wish it was not so one sided, you have to get this app then get that app to make it work.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Kordecki"}, {"rating": 5.0, "review": "Really like this TV gadget.  Took a little finagling to get it up and running but it just worked fine.", "verified": true, "helpfulness": "0/0", "author": "Karen L. Bruynell \"Karen Bruynell\""}, {"rating": 4.0, "review": "I love the chromecast. Simple. Inexpensive. Yet high quality.I use my android tablet as the \"remote\". If you have videos on your computer, I recommend Chromecast and the Plex app. In no time I was streaming my media library to the Chromecast.  The Plex app costs a few dollars.  I think it is worth it.", "verified": true, "helpfulness": "0/0", "author": "Ari Zelanko"}, {"rating": 3.0, "review": "There is a bug in the ChromeCast code that causes massive interference with local WiFi networks under certain circumstances.I have three ChromeCast and had problems with one of the others previously, but had thought that recent updates had taken care of the problem, having not seen the issue recently.This one, however, being installed in a different location exhibits the exact same problem that I had earlier.If you do a brief web search, you will find additional information (but no answers) about the problem.", "verified": true, "helpfulness": "0/1", "author": "Alan Clegg"}, {"rating": 5.0, "review": "I bought this so that I no longer needed a long hdmi cable to stream internet content from my laptop to my HDTV.  I am extremely pleased with the unit. I also have an original Roku and a Roku 3 - this won't replace a Roku unit - it isn't meant to , but it will provide you with an easy way to watch internet content on your HDTV.  I found the device to be easy to set up and easy to use. All you need is an HDMI port.  This is an excellent value and a lot of bang for the buck.", "verified": true, "helpfulness": "0/0", "author": "John G. Pollard \"jpollardbookseller\""}, {"rating": 5.0, "review": "YOU WILL LOVE THIS!Easy to use, excellent quality, not to much skills needed to use it, perfect streaming... i just loved it!", "verified": true, "helpfulness": "0/0", "author": "Carlos M."}, {"rating": 5.0, "review": "Google is the other name of innovation. Their products are reliable and loved. I have bought 2 so far. Works well for both my Vizio 80\" and Samsung 65\" TVs. I have used it with Apple MacBook Pro, Samsung and Toshiba Laptops. Works well with Samsung galaxy note 3 cell phone (you have to use chrome-cast app). Very simple to operate (view the youtube videos).", "verified": true, "helpfulness": "0/0", "author": "Syed Zaidi"}]