[{"rating": 5.0, "review": "I enjoy using my phone for Netflix and now we don't have to use the Wii or the bluray player. Thank you Google.", "verified": true, "helpfulness": "0/0", "author": "Kristian Linstad \"Krisannlin\""}, {"rating": 1.0, "review": "I have two areas that I have tryed to use with no luck. It is not a easy hook up on windows 8.There are winners and loosers.Sad to say i am not using this looser.Wish I could get credit on this?", "verified": true, "helpfulness": "0/0", "author": "Ray Cote"}, {"rating": 3.0, "review": "Provides flexibility across platforms, to stream to TV. Would have rated higher if it had more app support and easier way to install.", "verified": true, "helpfulness": "0/0", "author": "Nick C \"Nick C\""}, {"rating": 5.0, "review": "Excellent product, easy to install, to use. I use it with all of my mobile devices, now I got rid of mi HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Armando Guerra"}, {"rating": 5.0, "review": "I had despaired of getting YouTube and other web content on my television. I own a Blu Ray DVD player with wifi but it limits me to a few apps and is itself somewhat buggy.Enter the Chromecast dongle. More apps! And the apps I was accustomed to on my DVD player work much better with Chromecast. My only wish is that there were more apps that worked with the device. Like ... oh, I dunno ... Amazon Instant Video? I understand that I can get around this by casting from my PC's Chrome browser but that's inconvenient for me.Anyway, great value for the money and I look forward to seeing other app developers jump on board the casting bandwagon.", "verified": true, "helpfulness": "0/0", "author": "Sharon Duke"}, {"rating": 5.0, "review": "I only use Pandora and Netflix on this thing, but with the SDK released recently, the repertoire of useable apps is going to expand. It works flawlessly, it was easy to setup, and it never has to buffer anything on my network. It. Just. Works.Perhaps the best part is that there is no remote control to lose. Everything becomes a remote control for the device, which is _fantastic_", "verified": true, "helpfulness": "0/0", "author": "Konraden \"~Konraden\""}, {"rating": 3.0, "review": "Because i expected to be able to broadcast more than just netflix and youtube with my i phone. I would like to do more than only a couple of things", "verified": true, "helpfulness": "0/0", "author": "Edcrupe"}, {"rating": 2.0, "review": "Nothing great. The streaming is limited and added little to smart TV. You are limited to YouTube, Netflix etc and these are already on my smart TV. The fact that I can stream my browser (chrome only) on my TV seems cool, but I personally did not understand what all the hype was about. Perhaps, more functionality will be added over time with other releases.", "verified": true, "helpfulness": "0/0", "author": "limelight \"reachranj\""}, {"rating": 1.0, "review": "This device does NOT allow users to stream/play Amazon Prime Media...which was the sole reason I bought this.I would not recommend buying this yet until all the bugs are worked out. The Chomecast repeatedly disconnects and reconnects to my wireless network for no apparent reason - I'm an engineer and very familiar with software and hardware, but this is a nightmare.The most annoying part of this is that it will not stream any media that uses the MS Silverlight interface, which Amazon Prime uses! Additionally, no local media can be viewed. Very frustrating.DO NOT BUY.", "verified": true, "helpfulness": "0/0", "author": "Oregon_AmazonCustomer"}, {"rating": 1.0, "review": "Who needs a thing that will only play youtube on your TV?? I was expecting it to air my person content, pictures and videos at least. Not to say, I also thought it would play any content from the Internet browser.... But NO!!! It probably says it somewhere in the description that it doesnt, but I just didnt expect someone to make something that would not have this basic function...", "verified": true, "helpfulness": "0/0", "author": "Iryna Rudenko"}]