[{"rating": 4.0, "review": "The instructions are easy to follow, but it did take a few reboots for it to finish all the updates on the device.  Now that it's working, I love watching YouTube & Netflix, and I downloaded a couple other free apps.  It only works with a small number of apps today, but I'm sure that will expand in time.", "verified": true, "helpfulness": "0/0", "author": "J. Stephens"}, {"rating": 5.0, "review": "A great little unit. I got it for a relative and he loves it.", "verified": false, "helpfulness": "0/0", "author": "Selwyn S. Elledge"}, {"rating": 5.0, "review": "Love it! Easy connection, easy hook up.", "verified": true, "helpfulness": "0/0", "author": "animalover1"}, {"rating": 5.0, "review": "Almost brainless to install and use. Everyone should have one!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works awesome", "verified": true, "helpfulness": "0/0", "author": "Daddy"}, {"rating": 2.0, "review": "I had this about two months ago and couldn't have praised it any higher. Unfortunately I left it in a hotel on vacation so I finally bought a second one and it has not worked once since purchasing the second. It will not cast from any of my devices including ipad, iphone, and laptop. The lack of support from google is the most infuriating part about it. I would no longer recommend this product at all. COMPLETE JUNK!", "verified": true, "helpfulness": "0/0", "author": "Anjanette"}, {"rating": 5.0, "review": "This was recommended by a friend.  For the minimal cost - it is a great streaming device.  Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "K. Hall \"k hall\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Jaipaul Rekhi"}, {"rating": 3.0, "review": "Limited as to what video it will receive", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "I get the idea behind this, and have really tried to use it, but every time I try, I discover another platform it doesn't work with. Had this for several months, and have yet to use it once.  Not for the lack of trying.The quality is great as you would expect from google, and the idea behind it is great, but they need to expand to platforms.", "verified": true, "helpfulness": "0/0", "author": "Inga"}]