[{"rating": 5.0, "review": "I absolutely love this device.  I've had a Logitech Revue for a couple years and didn't think it could get better than that.  The Revue started acting up and so my brother bought this for me as a Birthday gift and I, almost, couldn't be happier.  The one con I have with this device as I do with other similar products is there is no HDMI pass-through (which was suppose to be the HDMI standard but that's off topic).  On the bright side, my Sony TV is able to detect when the device powers up and switches video modes for me, I just have to switch back manually.  A minor inconvenience.I guess the only other issue I have is the size of the power plug.  It is bulky and basically forced me to unplug two devices on my powerstrip.  Again, a minor inconvenience.  The amount of entertainment I'm getting out of this device far exceeds any minor flaws I've found.  I believe it is all solid state as well.  I could be mistaken.  It extremely quiet, no fans, doesn't put off any heat I can detect and it goes to sleep when not in use.I've used it for Netflix, Amazon Prime, and Vudu.  Works perfectly with them all!  I highly recommend this device!", "verified": true, "helpfulness": "0/0", "author": "Kasey S."}, {"rating": 1.0, "review": "Poor product which did not interact easily with anything other than amazon, so we returned the product.", "verified": true, "helpfulness": "1/3", "author": "Ann B"}, {"rating": 5.0, "review": "Way better for Amazon prime content than the Roku, and the voice search is amazing. The speed and dependability of the software is very high. I have recommended it to everyone that I have spoken with. Hard to say if the ASAP feature is the source of the increased speed or if its due to the more advanced hardware. Either way I love my Amazon fire TV and can't wait to get a Amazon fire tablet.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Setting up the system was easy and the quality of sound and picture are quite good. However it lacks a web browser or I did not find a way to watch web courses such as MOOCs, or many other videos available in the web.", "verified": true, "helpfulness": "0/0", "author": "chapu"}, {"rating": 2.0, "review": "Good features but nothing really made it a must have.  I have plenty of items that together would do the same or better job.  Only truly remarkable feature was the voice search but it needs to be expanded to all apps", "verified": true, "helpfulness": "0/1", "author": "Ntoro18"}, {"rating": 5.0, "review": "Well made device with fast interface", "verified": true, "helpfulness": "0/0", "author": "John B"}, {"rating": 4.0, "review": "Excellent Movies, But would pay $10 more a month for ESPN. Our current Cable Pkg. is not listed!", "verified": true, "helpfulness": "0/0", "author": "Tim355"}, {"rating": 5.0, "review": "Exactly what I expected it to be", "verified": true, "helpfulness": "0/0", "author": "LMT"}, {"rating": 5.0, "review": "A little connectivity problem, but could be my internet. It has only stopped a couple of times since I got it last week, but the majority of the time it works well. Still have a lot of exploring to do with it though...UPDATE - Works great, and don't have the connectivity problem like I did. So glad I invested in this, and you will be too!", "verified": true, "helpfulness": "0/0", "author": "osmend - Ronn H."}, {"rating": 5.0, "review": "love this product", "verified": true, "helpfulness": "0/0", "author": "James Kerins"}]