[{"rating": 5.0, "review": "I wanted a good way to watch Netflix on my home TV. I already had a prime membership so that was an added bonus. My biggest problem I have is my wifi connection is not the best. I choose the fire due to the fact I can hook it straight to my router. Videos load fast and the quality is awesome. I have a huge selection of TV and movies yo watch with my memberships. The box is small so it doesn't take up much space. The remote is simple so you don't have to read a huge manual just to turn it on. The voice search works great. This is the best way to watch TV.", "verified": true, "helpfulness": "0/0", "author": "Code Seven"}, {"rating": 4.0, "review": "I am still getting used to the Fire TV, but so far I love it. I am still wary of \"cutting the cord\", but the more features of Fire TV that I discover, the more I am tempted to rely on it solely for my \"TV\". Some of the apps are wonderful and offer such a variety of viewing. The news apps are great as are the documentary apps. I would recommend it highly. I may be somewhat biased since I have been an Amazon customer for many years and love my Prime account very much. The Fire TV is a great buy.", "verified": true, "helpfulness": "0/0", "author": "Botamom \"Botamom\""}, {"rating": 5.0, "review": "It took me less than 15 mins. to unplug my ROKU and install my FIRE TV.", "verified": true, "helpfulness": "0/0", "author": "Alvie L. Mitchell"}, {"rating": 5.0, "review": "Another device maybe but when one device does do it all and even understands your voice then yes it is on fire.", "verified": true, "helpfulness": "0/0", "author": "Guadalupe F."}, {"rating": 5.0, "review": "EASY TO USE AND FUN TO WACH", "verified": true, "helpfulness": "0/0", "author": "aron venegas"}, {"rating": 5.0, "review": "Love it actually-fast connec great resolution lots of choices.", "verified": true, "helpfulness": "0/0", "author": "Gene Bobker"}, {"rating": 5.0, "review": "I'm still learning all of the amazing features of it, but am loving the movies, music, and games so far", "verified": true, "helpfulness": "0/0", "author": "Linda Poole"}, {"rating": 5.0, "review": "Amazon Fire TV is a fantastic value. A whole bunch of what I want to watch, when I want to watch it. Programs are very easy to find with the \"voice search\" feature and they load quickly. Best thing I have bought in years.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "How cool can you get. I used it almost everyday. The voice command is realy a great item to sort through your viewing search. Best thing i purchased in a long time", "verified": true, "helpfulness": "0/0", "author": "Gregory E"}, {"rating": 2.0, "review": "Pros:1. The signal strength is much better than my Roku was. Consequently, it doesn't need to reload as often.2. I like the voice command functionCons:1. More complicated to use than my Roku2. Very limited selection of channels to choose from. The most glaring omission is HBOGO, which was promised by the end of last month and not delivered.3. The voice command only works with Amazon Prime.4. It would be nice for the free Amazon Prime offerings to be separated from the paid ones.", "verified": true, "helpfulness": "1/2", "author": "Paul Graden"}]