[{"rating": 4.0, "review": "It's fantastic on YouTube but just okay on other sites.  The videos stop and you have to wait, etc.It is really nice tho to watch YouTube videos on my big TV.  Been binging on sewing instructions and entrepreneurship videos.  And music videos.Not great on all sites.  But very much worth $35 if you have the cash.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 5.0, "review": "This was literally set-up and ready to use in 5 minutes, does everything I expected, has a super simple user interface and is a heck of a lot cheaper than Apple TV.  What's not to love?", "verified": true, "helpfulness": "0/0", "author": "Erik T. Hord \"erikhord\""}, {"rating": 5.0, "review": "People who complain it doesn't work don't know how to use the thing! Works just fine. Love the \"tab\" mode on my PC.", "verified": true, "helpfulness": "0/0", "author": "Darrell"}, {"rating": 5.0, "review": "I love wireless tehnology. This works perfectly. You can watch Netflix, Youtube while running on treadmill. It makes your phone works like a Tivo Remote.", "verified": true, "helpfulness": "1/1", "author": "tougher"}, {"rating": 4.0, "review": "Good but I'd like to use it more often than YouTube, Music or Google movies.  It's compatible with my desktop which is nice but I would like to play video through chrome and chromecast from other websites; this would make it better for work and presentations.Update: Works with Chrome's desktop/laptop extension but no support for mobile devices.  Nice but stutters a bit.", "verified": true, "helpfulness": "0/0", "author": "Pobilly21"}, {"rating": 1.0, "review": "It's a snazzy device and supposedly set up so that non-techies (like me) can easily install....yep, you can easily plug it into your TV but connecting it to your router is a different issue (and not mentioned anywhere in the descriptions)-- very few routers that are more than a couple of years old are set up to work with it so we non-techies either have to sit for hours trying to change the set-up or buy a new router...not what was advertised and a big disappointment...and about 2 hours of trying, I can't get it hooked up to my router so it's useless", "verified": true, "helpfulness": "1/2", "author": "docholden \"docholden\""}, {"rating": 3.0, "review": "Neither computer I have would work to set it up.  I ended up having to use a cell phone.  Now that its installed our older computer doesn't stream well so only the gaming computer works but it is nice for movies off the computer.  All youtube is streamed from the device and not the pc so you can use older pc's for youtube or any other site that does direct streaming.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 1.0, "review": "The Chromecast worked very well for a little more than a week when there was a crash.  After  many days with Google support, they are unable to get it to work properly streaming recent TV episodes from a Chrome tab.  Some of the error messages included Shockwave crash, wrong version of Flashplayer and finally a warning that casting performance on Windows i5 systems would not work properly until they release Chrome Version 33 at the end of February.  It is a great idea, but unfortunately, too many bugs right now.", "verified": true, "helpfulness": "0/0", "author": "AZGuy"}, {"rating": 5.0, "review": "I bought my parents one as an early Christmas gift. All I can say is Google got this thing right. Both of my parents learned how to use it within minutes. Its great for streaming video from YouTube, Google Play Movies, and Netflix. The support for Play Music is great too! As more apps become compatible with it, we'll see how it holds up. But for now, it works very well, it's simple to use, and it displays very good looking content.", "verified": true, "helpfulness": "0/0", "author": "SuperTuna117"}, {"rating": 5.0, "review": "Works well when you can figure out how to use it and what content it can display on your TV.", "verified": true, "helpfulness": "0/0", "author": "Sam L Oney"}]