[{"rating": 5.0, "review": "Several other reviewers have gone deeply into the technical aspects of this thing so I won't spend any time there; just wanted to touch on how I use it and why I love it.I don't spend much time in front of the television but I wanted a simple way to send media to it from my computer without extra cables (due to a psychotic cat extra cables are bad in my house) and without having an extra computer dedicated to the television. By media I mean Netflix, YouTube, and movie files that I have stored locally. My blu-ray player can handle the first two if I want to fuss with that pain-in-the-tail remote and don't mind poor quality video from YouTube, but I hate searching/browsing using the remote and I'd rather see high-quality video if I can.I've used the heck out of this thing since I got it (I was one of the lucky ones who snagged it from Amazon on the first day). I have several saved playlists on YouTube and with this I can pull one up on my desktop, shuffle it, and send it over to the television where it plays full-screen and high-quality (1080p, I believe). Great for working around the house, especially since I'm currently remodeling my living room. I've opened local movie files in the chrome browser and sent them to the television as well. When this remodel is done I'll be moving my desk (and computer) out to the living room and really looking forward to being able to just send any videos over to the television so I can turn and watch them on a big screen. Critically, without a cable draped from the back of my computer over to the television. I'm looking forward to being able to send audio playlists over to the television as well (okay, it has better speakers than my computer). That app doesn't exist yet but it will soon.It's not a replacement for a Roku or similar but what it does it does very well. It does exactly what I needed and I honestly couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Chromecast is awesome.  The product is simple and with the USB cable it can easily powered without taking up a wall outlet.  I was a little disappointed that the device wasn't powered by HDMI however I have a USB port on my TV right next to the HDMI ports so problem solved!  Those who purchase the product must keep in mind a couple of things:1) It requires an HDMI port to deliver content.  If you don't have an HDMI port in the path to your TV or receiver then you can't use this device.2) It's inexpensive and has a specific and focused purpose.  If you expect Chromecast to do everything including make coffee, you should return the device and go back to the previous technology you had before you bought Chromecast.  Chromecast's only purpose is to stream data to your television or stereo receiver automagically.  The point to this device is to get your content to your TV your way and not rely on devices like Roku or a build your own, premium channel / support everything, DVR.3) It requires software support.  Currently only the Google Chrome browser, Netflix App and Youtube App supports streaming to the device.  We need other App developers to support this product, including Hulu.  It is important to remember that anything that can be viewed in a Chrome browser can be viewed in Chromecast.4) There's no remote support, as designed.5) If you have a receiver that doesn't have HDMI ports you must either rely on the TV audio, get an HDMI Audio extractor or get a new receiver.6) The setup is simple and intuitive.  Google has made the software on Chromecast incredibly easy and technology newbie free.  Chromecast even updates itself automatically.Chromecast basically turns your HDMI ready TV into a Smart TV.  The potential is incredible.  In these times where we are told where we must watch, listen to and enjoy our media, Chromecast gives us freedoms that we never had before.", "verified": true, "helpfulness": "2/3", "author": "Karl"}, {"rating": 5.0, "review": "This is what we have been waiting for! We cut the cable on Time Warner a few years ago, bought a roku, and never looked back. I have a few network shows I have been watching on my computer from time to time that were not available on the Roku. This changes everything! I can now stream anything on the internet directly to my HD tv! I'm completely in love!It works best with the youtube & netflix apps on my iphone as the shows streaming from the chrome browser on my computer tend to be a little less high quality (movies4k, ABC, CBS, USA Network, etc) but I am sure this will improve over time, and in the mean time, it's definitely tolerable.", "verified": true, "helpfulness": "0/0", "author": "Morgananny"}, {"rating": 5.0, "review": "So, the Google Chromecast just came out last week, and I got mine a couple of days ago, and let me just say, it's awesomely epic. It's a $35 device the size of a thumb drive, that you plug into your HDMI port of your TV to let you stream video and audio to your entertainment system. Here's some of the awesome things about it. 1-When you buy it for $35, it gives you 3 free months of Netflix Instant, even if you're already a customer, therefore $24 you were already going to spend you pay at one time, therefore the end price is only ($35-$24=) $11 for the device. 2-On your iPhone (or other smart phones) when playing a YouTube/Netflix video, a new button appears that says stream to MyTV, when pressed, that happens. It just starts playing the video on your TV and you can adjust volume and press pause, fast-fwd, etc, from your phone. 3-Anyone on your same WiFi network can do this. So if guests are over and want to show you a funny video, they can just stream it to your TV instead of everyone huddling over their small cracked iPhone screen. 4-Anything you have on Google Chrome on your computer, you can stream to the TV. So say, you have a website that you always go to watch old episodes of Friends, but it's not really a legit site that would work with Google. Or if it's a specific TV network's site that uses its own video streaming service... If it plays in the browser, you can play it on your TV, and full-screen it, no problem! It works perfectly. 5-Small videos, large videos, resolution is HD so there's no problems there. 6-This works as good as Apple TV in my mind, but instead of the feature of sharing your iPhone screen, you can share your Google Chrome tabs, which I think is better, for the most part. 7-It's always on, so I don't have to do anything except turn on my TV and switch to that input (no waiting for it to boot up and going to the specific program you want to stream from) and then the video plays. So end result, it's great. I'm very happy with my purchase.", "verified": false, "helpfulness": "0/0", "author": "M. Parq \"markthegreengo\""}, {"rating": 5.0, "review": "Bought this the first day it came out. I was not disappointed. It streams netflix beautifully, even better than my phone. I can control it from anywhere in the house. Youtube and Google Play Movies work great too, with a slight delay. TabCasting works also, even though its in beta, it works pretty good. HD playback works great, looks better than FIOS does. Mine came with 3 months of Netflix free, which was a steal. For only $35 I would highly recommend it, and Google will do updates each month, so more features may be added later.", "verified": true, "helpfulness": "0/0", "author": "Jamaall Smith"}, {"rating": 4.0, "review": "This Chromecast device works as advertised. The video streaming and the tab mirroring both work well. Only a few issues I should mention. My Sony Bravia HDTV cannot be turned on from off using this device (I believe I saw this feature on a YouTube video). The tabbed mirror browsing was smooth only after I changed the settings to stream at 480p. Lastly, Play Music only works to stream music to the tv if the songs were downloaded from the Play Music store, side loaded songs will not play.", "verified": true, "helpfulness": "0/0", "author": "Vincent"}, {"rating": 5.0, "review": "Chromecast has been covered already in detail so instead of writing a long review, here is a very short one.1. setup computer needs to have wireless (your desktop probably won't work), use phone, pad, or laptop2. great picture quality with Netflix using iPad (pause button is a bit slow)3. my attempt at tab casting Amazon Prime content was so-so, going full screen on Chrome tab did not result in full screen on television  > I hope Amazon will include native Chromecast ability into Kindle Fire and iPad app (similar to Netflix)4. did not work on my setup with Monoprice 1x4 HDMI switch, I researched/purchased another model which I hope will work  > never got the setup screen to show on television  > 1x4 switch works with PS3, computer, and X-box so not sure of problemOverall opinion: great produce even in current semi-supported state and it can only get better; very happy with purchase!KevinPS. I ordered two on first day and received Netflix coupon - a great deal.", "verified": true, "helpfulness": "1/1", "author": "KreeH"}, {"rating": 5.0, "review": "Works Great. Takes no time for installing and very clear instructions as to how to sync it with your devices. Easy to operate from your smartphone. No hick-ups while operating from your smartphone. Important is to have decent internet or ISP bandwidth to have the best quality.", "verified": false, "helpfulness": "0/0", "author": "Manpreet Goraya \"mani\""}, {"rating": 1.0, "review": "This device has great potential but at the moment the functionality is not there and even Netflix works badly in comparison to other devices.", "verified": false, "helpfulness": "6/28", "author": "Mr Band"}, {"rating": 1.0, "review": "I ordered this piece of crap when I first heard about it, I waited about 3 weeks, it had to be back ordered, I tried to install it according to directions on the box, nothing worked, I called tech support and stayed on the phone for 5 hours, we tried everything to get it to find my wifi, nothing worked, I finally got off the phone and decided to send it back and get my money back, google then called and wanted me to rate this product, I gave them a zero in everything. In my opinion, google put this item out for sale and they don't even know how to tell you how to hook it up. Don't buy this item unless you want a headach from the getgo.", "verified": true, "helpfulness": "5/31", "author": "Gary D."}]