[{"rating": 5.0, "review": "Google hit it out of the park with the Chromecast, all my Netflix and Youtube videos are on my big screen with one touch, what else is there to say?", "verified": true, "helpfulness": "0/1", "author": "Reinaldo Rojas"}, {"rating": 1.0, "review": "I have run into problems getting Chromecast to work for me.  I tried to download the procedure described in one the four installation instructions.  It will tell me that my WiFi is not connecting.  I have a brand new WiFi and it connects to all the other gadgets I have.  There are just not enough instructions included with this product and no help at all on the internet either.  So, at this time, the Chromecast HMI Streaming Media Player is not working for me.", "verified": true, "helpfulness": "2/4", "author": "L. Ross \"butterfly maiden\""}, {"rating": 4.0, "review": "I would have given it five stars but Chrome on Android doesn't support it. Big flaw considering it is made by Chrome. Needs more applications to support it.Other than that, very easy to set up. I have an old N router but see little buffering delays. Photobucket via Chrome on my laptop crawled. I'll blame that on their server since all the other apps did great.", "verified": true, "helpfulness": "0/1", "author": "detector"}, {"rating": 4.0, "review": "I figured it was rather inexpensive and has so much potential down the road.  Setting it up and getting it going was relatively easy and it does get you content.  I'm just waiting for more interactive features between my phone and the device.  It's pretty limited as it is between your phone and the Chromecast, which I knew when I bought it.  But it has some great potential for the future and that will be exciting to participate in.", "verified": true, "helpfulness": "0/0", "author": "Anev"}, {"rating": 5.0, "review": "You dont need my review as everything that needs to be said is already out there. Buy this you WILL NOT be sorry.", "verified": true, "helpfulness": "3/3", "author": "Priddin"}, {"rating": 4.0, "review": "Initially, before the ten apps added, tab casting was a good feature.  After apps, and adding PLEX, a GREAT piece of hardware.I can stream local content to CC using my PLex app in glorious 1080p, without cabling.  I have one in the bedroom and one in the living room.  I can cast to either or both......even separate shows to each.  Well worth the price.  And if the supported apps grow, It should be even better.", "verified": true, "helpfulness": "0/0", "author": "Bluecloud"}, {"rating": 5.0, "review": "When i got it, I had some issues setting it up, but mostly it was my phones fault. Once I got it setup though it worked like a charm.As more tools are added it makes it better then some of the other streaming devices out there.It can do almost all the same things as a roku but cheaper.This is a great buy and I may by a few more for the other TV;'s in my house.", "verified": true, "helpfulness": "1/1", "author": "garlon zimmerman"}, {"rating": 5.0, "review": "The Chromecast was really easy to setup. It just needed to be plugged into the TV, powered up, and then you follow the few instructions on the TV channel it is on.Overall it is really great! I like being able to incredibly easily share youtube videos or chrome tabs on the TV. Another plus, I usually have my phone handy so if my wife is taking a nap on my side, I don't need to get up if the remote isn't handy. I wasn't getting much use out of my XBOX these days other than for Netflix, and this certainly does that.I have had a couple issues though. There is the occasional unable to connect error, and Netflix will seem to lock up if multiple users are trying to use it quickly. Still, I've heard Google has some big plans for this device so I'm sure these issues will be sorted out.Totally recommended.", "verified": true, "helpfulness": "0/0", "author": "Amazonian"}, {"rating": 3.0, "review": "Netflix and YouTube work great, but I have those apps on my SMART TV already.  I was looking for a way to browse for network TV shows on my tablet or phone and play them on the TV.  This device will NOT do that.  It also will only show browser screens and video from a desktop or laptop, NOT a phone or tablet.  If more apps such as NBC, ABC, FOX, PBS, or CBS support chromecast then it would do what I want it to do.  I'm a little disappointed in the device.", "verified": true, "helpfulness": "1/2", "author": "Jesse Griffin"}, {"rating": 1.0, "review": "THIS IS NOT WIRELESSIt's needs a power supply, whether it's plugged into the wall or your some USB connection like to your laptop.IF YOU WERE LOOKING FOR ZERO CORDS LIKE I WAS, YOU'LL BE SEVERELY DISAPPOINTED!", "verified": true, "helpfulness": "1/7", "author": "Paul"}]