[{"rating": 2.0, "review": "Not a bad system, no slingbox and the Nyko game pads do not work..", "verified": true, "helpfulness": "0/3", "author": "Total S."}, {"rating": 5.0, "review": "Love it.  It's nice to watch feature length movies in the comfort of your home commerical free with no need to return the dvd back to the rental store.", "verified": true, "helpfulness": "0/0", "author": "V. E. Jones"}, {"rating": 4.0, "review": "This little thing has become our default source for watching TV. While they do try to get you to rent/buy things in the way the search works, it's not hard to work around it. The Netflix app is good, and the Plex app is fantastic. I'd give it five stars if I could filter out any Amazon content that's not included in my Prime subscription.", "verified": true, "helpfulness": "0/0", "author": "T. Nuckolls"}, {"rating": 5.0, "review": "This has replaced our basic cable package.  HBO, ESPN, etc. have apps that let us watch for free what we were formerly paying to see.  There are opportunities to purchase apps in device, but you can also get a lot of mileage out of this device without paying for additional services.", "verified": true, "helpfulness": "1/1", "author": "Heidi Kauffman"}, {"rating": 1.0, "review": "It was great while it worked but quit after a few months and Amazon's tech support and customer service has been surprisingly difficult to deal with.  All the diagnostics require the unit to power up and display video, mine does not display video and that seems to baffle customer service.  Hopefully they will work it out soon since we are going on 2 months now.", "verified": true, "helpfulness": "1/3", "author": "L. L. Marshall \"manic\""}, {"rating": 4.0, "review": "Just gt the set up last week and frankly have not had the time to explore the uses.  Will update my review later.", "verified": true, "helpfulness": "0/1", "author": "CAR GUY"}, {"rating": 5.0, "review": "Love it! Used to like AppleTV, but Fire TV is better:1. HBO archive2. AirPlay compatible3. Full YouTube client", "verified": true, "helpfulness": "0/0", "author": "James T Kentfield \"ace\""}, {"rating": 3.0, "review": "I do like the Amazon Fire. Very neat and easy to setup. I does allow me to view a wide range of programs. But I bought it so that I could use the Time Warner Cable app. I don't think it's available. I am thinking about returning it, for that reason. I would recommend it, I would gift it. But I guess its not for me.", "verified": false, "helpfulness": "0/1", "author": "John"}, {"rating": 5.0, "review": "I got it as a Christmas gift.and I love it.", "verified": true, "helpfulness": "0/0", "author": "Tina M.  Hotchkiss"}, {"rating": 5.0, "review": "enjoy all the choices that there are. Mostly free entertainment  looking. on limited budget  so this is nice for me.", "verified": true, "helpfulness": "0/0", "author": "cheap bargain girl"}]