[{"rating": 5.0, "review": "Works great!!!! Love the device I now have 3!!!", "verified": true, "helpfulness": "0/0", "author": "Jeep92"}, {"rating": 5.0, "review": "Bought it for my wife. The kids tried it out and each bought one for themselves the next day", "verified": false, "helpfulness": "0/0", "author": "chickie"}, {"rating": 4.0, "review": "The Google Chromecast adapter is a nice way to stream videos and music on your TV or Laptop. I purchased this to use with theTV in my bedroom. Chromecast is unique because it's USB adapter is small and compact and cannot be seen from the front of the TV and barely the side. The setup up is simple, I have an iPhone 6 and I had to download the Chromecast app first. I had to sync the TV and my phone so that I could use my phone as the remote after the setup. Once the Chromecast is setup then it's very easy to use. I downloaded all of my favorite TV apps on my phone an I was able to start watching YouTube and Netflix immediately. There are plenty of TV apps that are available like Hulu, MLB TV, Pandora, HBO GO, WATCH ESPN to name a few. I was disappointed when I realized that Amazon Instant Videos were not available to watch with this device. So all and all this is a neat device that is small and compact that can be controlled through your phone or tablet. The price isn't bad either $29.99; what's there to lose. It comes highly recommended from a satisfied customer.", "verified": false, "helpfulness": "0/0", "author": "D. Young"}, {"rating": 4.0, "review": "This is a great little tool. A discrete, power efficient way to stream media to your TV. I would have rated it higher if it was supported by Amazon, but for what it is capable of it does a great job. I love being able to stream from my phone while I'm cooking in the kitchen, and then immediately switching to my TV to finish my movie while my food cooks. It's also great when I'm talking about something to my friends. No longer do I need to gather a dozen people around my tiny phone screen. Now I can simply send it to my TV and we can all enjoy it. If it supported Amazon I would have given it five stars.", "verified": true, "helpfulness": "1/1", "author": "Michael Howard"}, {"rating": 5.0, "review": "got  this for $23 on Blackfriday 2014 works perfect", "verified": true, "helpfulness": "0/0", "author": "Varendra"}, {"rating": 5.0, "review": "Awesome little device that turned the flat screen TV in my bedroom into a smart TV (purchased before smart TV'S came out).", "verified": true, "helpfulness": "0/0", "author": "Marianna Alvarez"}, {"rating": 1.0, "review": "Very disappointed with the versatility of the Chromecast. This device has less compatible programs than my gaming console, frequently lags, updates in the middle of activities, often doesn't connect properly with the necessary sites, has very limited range for network connectivity... truly a waste of my resources.", "verified": true, "helpfulness": "1/1", "author": "Countryboy1771"}, {"rating": 2.0, "review": "Not what I expected...you need apps to watch anything or buy upgrades", "verified": true, "helpfulness": "0/0", "author": "t.ni"}, {"rating": 5.0, "review": "I wish I'd bought this a year ago when I first heard of it. Used it twice so far and it works GREAT! I don't expect that to change either.I never wanted to give up my laptop to watch a movie on it as I like to mess around and work on the computer while I watch movies on TV. With this, I've been able to \"Cast\" the movie to the TV and yet not tie my laptop up doing that.I have Amazon Prime, which includes their Prime Movies. If you want to watch those with this set up you need to install the Google Chrome Browser. I'm working on a MacBook Pro with this. The Chrome Browser works great for sending the movies to the TV.If I want to pause or back up a little in the movie to see it again, I just \"Command-Tab\" over to that app on the computer & make it happen.For me, this has been terrific! In all honesty, I would pay double or triple what it cost me if I had to now that I know that it works and works so well.I haven't tried any other movie venues yet. Just Amazon Prime, so I can't say if it is just as good with say, Hulu, or another.On another note, and this has turned out to not be a big deal because I'm happy with what I have . . . . Originally, I thought I'd use my iPhone 5 to cast the movies to the TV so it didn't have any effect on my laptop at all. Well, I was able to download all of the apps to the iPhone fine. I used my iPhone to actually Set-Up the Chromecast unit. Real user friendly. Probably could have done it fine from my laptop to but I was using the iPhone.I discovered that for some software reason, I can't cast Amazon Prime movies from Google Chrome on my iPhone. This has turned out to be no big deal for me. Doing it from my laptop has not had any performance effects while I do other things. I do know that this is because of software availability and not anything I'm doing.I haven't written many reviews. The \"Just\" of this one is to say that \"I'm VERY HAPPY\" with this product. Less than $30. Hooked up and set-up easy and works great. For what it's giving me, I'd be willing to pay a lot more if needed.There are, of course, so many reasons why you might have problems. Not necessarily your fault. Perhaps your TV is not new enough to have an USB port in the back. I only have one in the house that does. You might struggle with downloading software and installing it. In my opinion, the set-up and use is quite intuitive, but, I use computers all the time so it's no big deal. If you don't speak \"Computer,\" you might need a relative or friend that does. You should consider this before you buy.If Amazon notifies me of any questions from anyone, I will respond. I usually only check my mail in the evening of the Easter Time Zone so that could be your delay factor before you hear back with an answer if I can give it. I'm not an expert yet. LOLBest Regards,Russ", "verified": true, "helpfulness": "0/0", "author": "Russ Smith"}, {"rating": 5.0, "review": "Am loving this so far.  I have only had a couple days to play with it, but love the ease of use & simplicity so far.", "verified": true, "helpfulness": "0/0", "author": "CarrotCake"}]