[{"rating": 5.0, "review": "Amazon Fire TV works as advertised.  An awesome product giving us TV in the basement where our satellite dish does not reach.  Prime video allows us to watch all our favorite shows and to catch up on other show for free as prime members.  Pretty good deal to add to that two day shipping.  Pretty cool device.", "verified": true, "helpfulness": "1/1", "author": "David M. Torres"}, {"rating": 5.0, "review": "Very happy with this device. Replaced our Roku2 with it and have been very satisfied with how fast it is compared to the Roku. We are Prime junkies so this really makes sense for us. I am also pleased with the ability to side load apps like XBMC and Firefox web browser. It really it an amazing device for the price.", "verified": true, "helpfulness": "2/2", "author": "R. Walker \"NEO\""}, {"rating": 5.0, "review": "I use this for almost everything. Pandora , Netflix and of course Amazon Prime. My old and young kids download and play the games. Get the extra game controller for that.Absolutely love the screen saver mode photos it comes with. Wish I could set it to turn on at 1 minute or less instead of waiting for 5 mins while it plays Pandora music.", "verified": true, "helpfulness": "1/1", "author": "Bob Evans"}, {"rating": 5.0, "review": "Love Amazon TV.  In fact, going to sell our Apple TV.  No longer have to use iphone or iPad to watch Amazon prime", "verified": true, "helpfulness": "1/1", "author": "sandi jones"}, {"rating": 1.0, "review": "We had Chromecast, but thought this would expand the offerings.  Perhaps it does, but to get to it, you have to read the extremely too small print on the screen.  WTF???  Even changing screen aspect ratio to maximize, we have to stand 4 feet from it to read (or as my husband does, use binoculars!).", "verified": true, "helpfulness": "0/4", "author": "russ coe"}, {"rating": 1.0, "review": "You have to buy each new episode, average price $1.99-$2.99 per episode and that is only if you are a Prime member! It's an overpriced Netflix albeit with current shows and episodes available for sale.", "verified": true, "helpfulness": "3/11", "author": "Lynn Munger"}, {"rating": 3.0, "review": "Disappointed that they don't have more more apps for TV viewing.", "verified": true, "helpfulness": "0/2", "author": "Gary. M \"John Q. Public\""}, {"rating": 3.0, "review": "If this had the Vudu channel I'd buy it immediately. Why no Vudu Amazon?", "verified": false, "helpfulness": "1/5", "author": "vbashaw"}, {"rating": 3.0, "review": "In my never ending efforts to make my home theatre more \"Wife\" friendly I have spent the last year or so looking for a device that will at a bare minimum run Netflix and XBMC while at the same time require very little electricity to run. The previous \"Wife\" friendly device the Boxee worked great until out personal library passed 800~900 films at which point the Boxee would slow to a crawl when navigating its version of XBMC. The folding of Boxee's hardware division pretty much sealed its fate into a media player that would only be fed a sliver of our available movies in the home gym.Enter the Amazon Fire. Low power? Check! Netflix? Check! Tons of Apps? Check! XBMC? Check! Well... If you can sideload that is. XBMC runs decent enough. The initial load of the movie posters is delayed about 5 seconds and the scrolling through movies isn't nearly as smooth as the dedicated HTPC it replaced, nor does it handle playing a movie in the background while you browse, but honestly it is more than passable as a dedicated XBMC player. So far so good...Then comes part of the deal killer...If an app you are using is not \"Amazon Approved\" it is forever destine to be stuck buried in the bottom menu, then over a few more slots in applications, then manage applications, scroll down to the bottom and then finally \"Launch XBMC\"The second and larger part of the deal killer is that should you engage the parental controls to keep the kids from running up the credit card bill on some $kid show (the Fire is attached to your Amazon account after all) everyone without the parental code is locked out of the manage applications tab and by default that means XBMC. (I have been informed there is a work-around and will see if I can figure it out soon)If there was an option to display non-approved apps to the main screen my only complaint would be about the overly cluttered initial navigation page.", "verified": true, "helpfulness": "3/4", "author": "The Average Joe"}, {"rating": 5.0, "review": "I should have waited for 10 days before ordering my Fire TV because they are $15 Off today. But when I think about it I would say I have definitely had $15 worth of enjoyment from it over the last week.  I ordered this to replace a Sony bluray player in our bedroom that we used for streaming Amazon Prime and Netflix. It quit streaming after 3 months, so it has been returned to Costco. Since we never had used it for a DVD, we decided to try the Fire TV.  I must say that I am impressed. It hooked up so easily and gave us that cute introduction video. The picture quality is great! Videos load quickly, something that the Sony player did not.  I hope this continues to give good service for a long time.", "verified": true, "helpfulness": "1/1", "author": "audrey"}]