[{"rating": 4.0, "review": "To be honest there is not a whole lot to do with it, I bought it with hopes of using it regularly but find that I don't really use it very often.", "verified": true, "helpfulness": "0/0", "author": "John Kim"}, {"rating": 5.0, "review": "I was curious about this ever since it first hit the market. We got rid of all those ridiculously priced cable channels and went with the basic network stuff and high speed internet. Then, signed up with Hulu Plus, Netflix and Amazon Prime. We've been using our Xbox's to run those apps which requires lots of wires, and, of course, two Xbox's at a cost of $250 apiece plus an Xbox Live account. A $35 'dongle', needless to say, was intriguing.It arrived today. Installation was a snap (plug it into the HDMI port and the power to our power strip, done!). Then surfed to the installation/setup page at google.com/chromecast/setup which walked us through the connection between the 'dongle' and our network. Hint: Be sure to have your network info handy when doing the setup! (username/password, etc.).We had one snag.. the UPnP was not turned on in our router. That is the Universal Plug 'n Play that is required in order for the setup to 'detect' your device. Luckily I have just enough knowledge in how to log into the router. So I did so, turned on the UPnP service, restarted the router (to initialize that feature) and re-ran the setup. Bingo! Found it no problem, finished the setup and wound up at the quick tutorial video that shows how easy this really is to operate.I installed in on:My desktop PC (must have Chrome browser, which I use as my default anyway)My Android phone (playstore app is required, but simple to get from the playstore)My Android tablet (Nexus 7)My wife's Android phone (Samsung Galaxy S3)My wife's laptopFor the phones, you need to download the Chromecast app AND, of course, the apps for Hulu Plus, Netflix and YouTube (which should be on your Android phone anyway)For the PC's and laptops, you only need to install the Chrome Extension for Chromecast (takes about 1 minute).Now, in the upper right hand toolbar area of your Chrome browser, there's an icon you click and it asks where you wish to broadcast that tab's content to... the screen/tab you are viewing on OR switch to Chromecast. Immediately upon switching to Chromecast your TV will display that page on your screen. Awesome! Now we watch online shows like Survivor on the TV instead of the small laptop screen!For Hulu and Netflix, if on your PC/Laptop just surf to those sites in Chrome, hit the icon and it will broadcast whatever you're watching on to the TV.From your smartphone and tablet, open the apps for any of these (or, use the Chrome browser) and you will notice that same icon at the top of each app's home screen. Tap it to select where you want to view what you're watching. Voila! It sends it right to the TV.This was simple, convenient, ridiculously unintrusive as opposed to having to require the Xbox or Roku or any other device to do the same thing.But! Don't expect 1000's of apps supported... yet! But, if you can't watch it on Hulu Plus, Netflix, YouTube or somewhere on the WWW via your Chrome browser, then I don't know what to say. Except, then, this isn't for you.Everything we've watched has been sharp and clear. No hesitations in delivery and the device you're broadcasting from becomes the remote control for what you're watching.I can easily see having multiple Chromecasts. Especially at this price! We're not even remotely disappointed and, in fact, the product exceeded our expectations. Buy it!", "verified": true, "helpfulness": "1/1", "author": "HTMLCSSGuru"}, {"rating": 5.0, "review": "I love Chromecast. If you have netflix, this is the easiest way to broadcast it to your t.v. Just download it to your computer or phone, than cast it. The \"set-up\" only requires plugging it into a powersource and into a HDMI slot in the t.v. Easy and great to use.", "verified": true, "helpfulness": "0/0", "author": "Jerry Bergman"}, {"rating": 5.0, "review": "As with most google products, this product provides easy setup and amazing functionality. I use mine daily to stream netflix & youtube from my phone, as well as pretty much anything on my laptop. Great alternative for those who don't want to spend $100 on Apple TV but still would like a simple streaming solution. I've had no problems so far and plan to use it for a long time!", "verified": true, "helpfulness": "0/0", "author": "Christopher Atwater"}, {"rating": 5.0, "review": "I have had for about a week and am very pleased at how easy it was to set up and how well casting from a tab is working. I have a Roku for amazon prime, but when I saw this I thought for the price it was worth trying so that I could watch website videos on my TV. For example my husband and I like to watch live worship services from several churches, and it is hard for both of us to watch the smaller computer screen. The Chromecast works without a problem so far and I am very pleased with it!!!", "verified": true, "helpfulness": "0/0", "author": "occasional critic \"Dr K\""}, {"rating": 4.0, "review": "I was extremely excited when I ordered my ChromeCast, and think that it is a brilliant idea at a great price point. As mentioned in previous reviews, the installation was super easy, and took no more than 10-12 minutes.The only issue I have is that there is definitely some lag at times between the computer screen and the chromecast, and at times it would simply disconnect from the computer and I would have to reset it. It may be the internet connection, though I have the fastest TWC offers at the moment.Overall, I still think it's a really convenient and cool product, but at times it has been slow with the connection.", "verified": true, "helpfulness": "0/0", "author": "Sahil Rahman"}, {"rating": 1.0, "review": "I was pretty excited about the reviews I read before purchasing my Chromecast, so I was frankly shocked that the support for it is so limited.  I was exceptionally discouraged that none of my portable devices have apps available: a Samsung Infuse cell phone, a Kindle Fire tablet, and even a 3 month old Android tablet that installs the app but shows a disclaimer saying \"This might not work on your hardware\" and sure enough it hangs while trying to stream Netflix.The only device that successfully worked with the Chromecast was a notebook computer.  I was able to display Youtube and Netflix using the computer.  The notebook is kept in a nook off the kitchen, plugged into all sorts of devices such as printers, speakers, etc.  Moving it to the living room to stream videos is not going to happen.Unfortunately, the streaming with CHromecast using the computer highlighted the second biggest problem with the Chromecast.  Video quality is noticeably worse than the XBOX which is 8 year old technology.So far, I have to rate the Chromecast as a failure until I can see the apps available and the performance improve.  I will be returning mine.", "verified": true, "helpfulness": "0/0", "author": "W. Gervasi"}, {"rating": 5.0, "review": "Awesome device and very easy to set up on any TV in the house.  We used it the other night for a party playing dance music from Youtube and it worked like a charm.  Highly recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Eddie Arman"}, {"rating": 4.0, "review": "I have used this only once or twice but its useful in a way that you can stream videos directly from your cellphone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Mayank Vig"}, {"rating": 4.0, "review": "Somewhat limited in what it can stream, but for the price it is fantastic. I use it to stream Netflix to my TV in my bedroom, and it's perfect for that. I also have an Apple TV in my living room, but I did not need all the features for my bedroom. The Chromecast does everything I need, and costs 1/3 of the price of the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "B. Clay"}]