[{"rating": 5.0, "review": "One big draw back is the buffering can be annoying. I notice better buffering when watching purchased instant videos. Buffering is worse when multiple people using the internet at home.  Love the access to movies and being able to watch home videos and pictures from the cloud on my TV. Also love that my songs through iTunes still upload to the cloud through the amazon upload feature on the computer and I can blare my music through my old receiver (no Wi-Fi feature).", "verified": true, "helpfulness": "0/0", "author": "Amazongrl"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Tina Louise \"Colorado native\""}, {"rating": 5.0, "review": "Truly an excellent system. The voice search 'REALLY' unlocks all that is available to you. Search by actor name, partial titles, themes, etc. Quick and easy to use, but requires some minor experimentation simply because there is so much content. Exercise, network training, Operating system training, historical content and on and on. This with and HDMI antenna and the Channel Master DVR recorder after purchase is no cost entertainment. After years, many years with satellite and increasing costs and commercial duration we were done with it. Commercials are none existent. We replaced Sling TV with the HDMI antenna for recording purposes of some mainstream media.You do need a good internet connection, we personally have 30 down and 5 up not totally for entertainment, but supporting remote work. One can likely have a good experience with 15 down. Also we have amazon prime and this is second part of the key to available content. Very affordable entertainment when you have the chance to watch it.", "verified": true, "helpfulness": "0/0", "author": "David Weber"}, {"rating": 5.0, "review": "This box is amazing and saved me so much space.Purchased this at my local BX (No taxes on it and bought at 95 vs 99 dollars). Prior to this I was using an old laptop to stream ALL content and having kids that know how to youtube and all I didn't want them to stumble onto the wrong uploads and they ALWAYS fought over kids content like games on various other sites.After connecting this thing up to a new Reciever to get the full experience our family began to start watching content last night from Amazon and Hulu and man this this is amazing.The only thing I haven't figured out yet is why the USB port is there since I do have some movies uploaded to a hard drive that the kids do enjoy... I've looked around and found a few ways to do this but don't want to mess with the unit so I'm willing to deal with this and just buy a media player.Overall design is perfect for me... I don't buy something to look pretty. I get it to function as advertised and do what I want to so in that respect Amazon has done a wonderful job. I also kinda understand the price point on the gaming controller which I don't intend to purchase anyways (Kids fighting).  They're just trying to give us an option to have a (hopefully) well built add-on that they've obviously gone through some trouble to design and get into an increasingly difficult market to open up into.... so great job amazon and hopefully you can keep doing things like this", "verified": true, "helpfulness": "0/0", "author": "meathead1986"}, {"rating": 3.0, "review": "Having owned this for a while I feel pretty good about writing a decent review.tl/dr: stop being lazy, reading is good for the brain.Pros:This is a very nice little box.  A lot feels packed into its small form factor which looks nice on my shelf.The remote is small enough for my wife and kids to use easily.  Voice search is great! With my accent it picks up my voice nearly 100% of the time.The hardware power is excellent for a box in its price point. It plays all the games designed for it with no stuttering.Interface is simple enough we could teach or parents who are elderly how to use it in just a few minutes with the help of the training videos.  Compared to my roku the interface is much smoother and easier to follow with apps and videos located in more convenient spots.Cons:Voice search only works on amazon content.  I am not sure if they are releasing the api to 3rd party to allow voice search to work for them as well but I hope they are.Hardware bugs out after a while requiring me to manually unplug it. Hopefully this will be fixed with future updates or they allow for a hard reset button in system. This is a large problem for me because of where my power is located.The remote, while very nice, could use some more features. An audio jack or a 10-key numpad for searching would be good for people who dont like talking to their machines and for searching in 3rd party apps.Total: Worth the buy if you have a bunch of amazon content and don't mind the con's i have listed above.  Me personally I do not regret buying this but I really hope some of its shortfalls are looks into and resolved.", "verified": true, "helpfulness": "2/2", "author": "J. Jones"}, {"rating": 5.0, "review": "FAST DELIVERY. EASY SET UP. EASY TO USE. NICE AND COMPACT. THANKS AMAZON FOR AN AMAZING PRODUCT.", "verified": true, "helpfulness": "0/1", "author": "Jane Arth \"JANE A\""}, {"rating": 3.0, "review": "SaMe mOvies over and over. Tv shows, where is Have and Have not.", "verified": true, "helpfulness": "0/2", "author": "CARMEN"}, {"rating": 5.0, "review": "This was given to me as a gift. After using it and discovering the multiple categories I could watch, I really like it! I love watching what I want to watch when I want to watch it. It's by far one of the best gifts I have been given.", "verified": true, "helpfulness": "0/0", "author": "yogini"}, {"rating": 5.0, "review": "Easy to use. Well made. Fast setup. Can't ask for anything better, even the voice comand WORKS.", "verified": true, "helpfulness": "0/0", "author": "Ida Hamel"}, {"rating": 5.0, "review": "great all round streaming box  movies and games all in on package", "verified": true, "helpfulness": "0/0", "author": "Ryan sherman"}]