[{"rating": 5.0, "review": "Works great, everyone should get one. Could not be more pleased. So much better to watch pen making and Netflix movies on a large screen. Worth more than the price.", "verified": true, "helpfulness": "0/0", "author": "Charles Patrick Patti"}, {"rating": 2.0, "review": "I bought Chromecast directly from Google with the impression that I would be able to play video directly from my phone and tablet.  My hope was to play training videos in our conference room without a laptop. I guess I didn't understand what chromecast is.  As best as I can tell it is a glorified youtube and netflix streamer.  Sure, I could upload all our videos to youtube, but we have to keep our property private.  I understand I could stream through the chrome browser but that still requires me to bring a laptop to the training meetings.  Anyway, I figured this most basic of functionality would be included and sent mine back because it isn't.I'm not sure why everyone is so excited about Chromecast.  Doesn't just about any TV made these days include netflix streaming built in?", "verified": false, "helpfulness": "1/3", "author": "Dandog"}, {"rating": 5.0, "review": "The Chromecast came out of the box, plugged directly into the HDMI port on my TV, USB power in and within 5 minutes I was up and running!  Chromecast automatically downloaded software updates when I logged into my wireless which took most of that 5 minutes.  Another two minutes and I had it installed on my Samsung Galaxy S2 phone.  Amazing clarity and sound which blew me away!  Amazingly simple to set up and use - even a novice could do it effortlessly.  By far one of the best investments I have made - Before I had to connect a desktop computer to my TV then log into that computer via the internet by way of LogMeIn.  Now I can sit in my chair with my laptop and watch amazing high def directly to my TV!  Will recommend this one to everyone!", "verified": true, "helpfulness": "0/0", "author": "Mark Burnett"}, {"rating": 5.0, "review": "I was distraught. I couldn't eat. I couldn't sleep. I started to lose my hair.... the fact that I couldn't watch Miley Cyrus's Wrecking ball Vevo music video on the full span of my television screen was causing my life to fall to pieces. Then, like a kiss from an angel, Google started shipping the Google Chromecast, and for only $35. The device was really easy to set up, and the packaging was ascetically pleasing. After a quick install on my computer, I was up and running watching Vevo videos on my TV. Soon after my appetite returned and I had a head of hear that would make Uncle Jessie jealous. If you are looking for a simple way to get Youtube and Netflix on your TV then this is the product for you.", "verified": true, "helpfulness": "0/0", "author": "Craig R Shapiro"}, {"rating": 5.0, "review": "Wow. What an unexpectedly good picture!  Easy and quick to install from iPhone and Windows 8 PC. I love this thing.", "verified": true, "helpfulness": "0/0", "author": "TERESA \"Renaissance woman\""}, {"rating": 4.0, "review": "Well I had to wait for several weeks for delivery do to back order and another couple of weeks to actually try it due to moving. Well I booted it up today and installed the app on all of my devices; including my windows laptop with vista. I must say the installation process was very simple and easy; connected to my home WiFi on first shot.I'm in the very early stages of trying this device out, but so far so good. There was some lag and audio sync issues on my first stream attempt, but picture was clear. The Chromecast seems to have some serious potential and the introduction of more apps can make this thing AWESOME.Will follow up after trying out the apps and playing with it for awhile. However, for the price and the ability to stream right from your device to the tv ; I'd say its a must have device to add to your audfio/video enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Charles K. Stroud"}, {"rating": 1.0, "review": "I had to give it one star for now.  I could not get this to work at all.  However, after asking some tech savvy people, the problem may be that my Linksys router is not new enough?  I'm not sure that this is the problem, but when or if I get it to work I will update and re-rate this device.I was so excited for this product.  How cool to be able to stream your own youtube and other media on your tv, right?  I'm hoping for a happy ending, with a functioning Chromecast media player... One day.  Sorry Google.", "verified": true, "helpfulness": "1/2", "author": "Lisa W."}, {"rating": 3.0, "review": "thought it would work on all android devices , got it,it does  work on kindle fire ,you could list what it does not work on and the problems you may have,had a kindle it started working after I bought a galaxy tab 2 ,and netflix will not work on galaxy tab 2 ,it has alot of problems one day it will be a great thing to own now its a pain", "verified": true, "helpfulness": "1/5", "author": "filmtexas"}, {"rating": 5.0, "review": "this rules. I cant believe its only $35. I hear many more apps are coming.  It turns the TV in for you", "verified": false, "helpfulness": "0/0", "author": "tropix17"}, {"rating": 4.0, "review": "This is a great device for being able to transmit videos from your device (iPhone, iPad, Google phone) to a TV.  Fairly easy to set up and operate.  I think this was a great idea by Google!  Will probably buy another one for the other TV.", "verified": true, "helpfulness": "0/0", "author": "Lon-Bones"}]