[{"rating": 5.0, "review": "Works like a gem.", "verified": true, "helpfulness": "0/0", "author": "Clayton"}, {"rating": 3.0, "review": "exactly as shown, unfortunately for me...my big screen tv was too old and didn't have the right fittings to plug it in.", "verified": true, "helpfulness": "0/0", "author": "KG"}, {"rating": 2.0, "review": "It stopped working after 6 months. I tried a new USB to power it and the light doesn't come back on. I have had it hooked up to my TV since day one and I never moved it once. It was neat while it lasted, though I wish it had more app compatibility.", "verified": true, "helpfulness": "0/0", "author": "Al Cohole"}, {"rating": 5.0, "review": "Not initially compatible with unblockus dns but after the first set up it works great. Streams with very good definition.", "verified": true, "helpfulness": "0/0", "author": "Valmiki"}, {"rating": 5.0, "review": "Not only did it meet my expectations, it exceeded them. Initially I had just wanted to watch TV in bed without having to pay for another cable box. The one time payment of $35 was a low low price to pay for that. Especially when Comcast was asking an additional $35 per month just to have an additional box.What I didn't know is how it would affect other areas in my life. With the Chrome Cast my wife can watch TV in the bedroom while I play video games in the living room. This has drastically reduced arguments over whether I need to watch another episode of House Hunters or Property Brothers, and whether I really need to \"level up\" one more time before \"So you Think You Can Dance\" comes on.I can safely say that this little device has saved what was otherwise a doomed marriage.Thanks Google. And Amazon. And America.", "verified": true, "helpfulness": "0/0", "author": "Todd A Garcia"}, {"rating": 4.0, "review": "Good product! deliver and service was really good", "verified": false, "helpfulness": "0/0", "author": "sachenka angel"}, {"rating": 3.0, "review": "Did not work out for me", "verified": true, "helpfulness": "0/0", "author": "Robert G. Miller \"Robert\""}, {"rating": 2.0, "review": "I have several devices that do the same thing. A little tricky setting up.  Only as good as the apps on your phone.", "verified": true, "helpfulness": "0/0", "author": "Gary Vicente"}, {"rating": 3.0, "review": "I don't get the results I expected when it comes to just showing things from my laptop, however it does work well for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Gary Jahnke"}, {"rating": 2.0, "review": "I purchased this primarily as an experiment (the price was low enough).  I like the form factor - though it is slightly misleading.  Most of you will end up needing to plug in the additional AC adapter.  Usability is decent, though setup took longer than I would like on the device.  In the end, I'm not really sold on the concept of the purely thin client (that is, a pure streaming device vs. something like an Apple TV or Roku that offers services).  The toll of running your battery down when streaming, plus degraded quality on pass-through streaming just made me switch back to my other set-top boxes again and again.Still, a neat device, but one that just isn't ready to cross over to the mainstream market when superior alternatives are available at affordable (given their value) price points.", "verified": true, "helpfulness": "1/1", "author": "FDS"}]