[{"rating": 5.0, "review": "Truly a plug and play device!  I warch movies and YouTube videos often.  I really like how when I select the cast icon my screen my t.v. input automatically changes to my Chromecast input and begins streaming.  I also bought one for my father-in-law who has everything.  He absolutely loves it too!", "verified": true, "helpfulness": "0/0", "author": "J Lewis"}, {"rating": 2.0, "review": "Seemed like a great idea until i got it and tried - a few problems:First it requires a plugin and USB cable to power it - they don't show that in any picture.Second they advertise it can cast your chrome browser - but that only works from a laptop or PC  - not from your phone or tablet.  Major disappointment - so basically i can watch netflix with it - I was hoping to push browser video to it..Finally the light is on all the time even when i power off the tv (this thing is always on it seems even if the tv if off and it gets hot). The light is annoying in a dark room. I'll have to cover it.", "verified": false, "helpfulness": "0/1", "author": "Dave"}, {"rating": 5.0, "review": "Its an outstanding gadget. I have two right now, planing to have in every room. It will turn any HD TV in to a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Shahzad Hameed"}, {"rating": 5.0, "review": "3 Easy steps setup , with great video quality (depends on internet broadband) :Full HD. Very cheap & easy to use.", "verified": true, "helpfulness": "0/0", "author": "Luis Alberto Lengua Vega \"Luis XVI, MD\""}, {"rating": 5.0, "review": "This has brought the Smart TV capabilities to our \"dumb\" bedroom TV. Out of the box it supported Netflix, Google Play and Youtube. It now supports HBOGO, Pandora and Hulu Plus. Google has a great product and I hope developers continue to add more app support!", "verified": true, "helpfulness": "0/0", "author": "PM"}, {"rating": 5.0, "review": "I love this product so much I ended up getting three of them and I am contemplating getting another one to link with my cellphone hotspot for traveling (unlimited data plan).", "verified": true, "helpfulness": "0/0", "author": "Shane Dockter"}, {"rating": 1.0, "review": "I spent two days trying to get this thing to work. 90 percent of the time the apps didn't even pick up its signal. I checked my wifi signal, I unplugged everything. My final conclusion is that this thing is a giant piece of crap.", "verified": true, "helpfulness": "0/0", "author": "Cee Twangy"}, {"rating": 5.0, "review": "I am very pleased with the Chromecast, and have purchased a second for another room.  After reviewing the developers group on the device, I am looking forward to the future enhancements that are planned for the platform.", "verified": true, "helpfulness": "0/0", "author": "Lane Smith"}, {"rating": 3.0, "review": "I own 3 of these critters.  Purchased all of them via Google's Play store as they were not available for delivery from amazon at the time I ordered them.They do basically what they say they do.o Play Netflix (very well for me)o Play YouTube (good to poor due to network congestion via ISP, or throttling.. Peering issues)o Casting from the Chrome browser works pretty good.  Use this quite bit.However, there seems to be a big hold up by Google on additional developmento There are a number of new apps just waiting for Google to allow them to be released but Google so far is not moving. huh?o No ability to share or cast from a mobile device yet (tablet, Phone) which is what I was really waiting for due to the above.o No new apps released by Google since it released the Device.So while the device does what it says it will, development seems to be a complete stand still, NOT because the developers don't have new stuff to provide, but because Google seems to be sitting on this for some reason.IF Google starts allowing development to be released, this will get a much better mark, but for now it is pretty much stuck using Netflix, YouTube, and a few of the other Google service's Music etc..  Note that I can pretty much do this with my DVR, a lot of TV's have this ability in them already.Rather disappointing in what could be a great platform from what I've seen from developers.", "verified": false, "helpfulness": "0/0", "author": "zipturtleaz \"zip!\""}, {"rating": 1.0, "review": "I loved this device when it arrived. I plugged it in and played tunes from Google Play to my TV, This is the reason I purchased it.I recommended it to others, clever cheap device.  Life was good BUT then the Netgear wireless router died.Comcast provided me with a replaement Technicolor (how's that for a name?) modem/router/phone combo which worked with some but not all of my wireless devices. I spent my free time fiddling with DMZ and UPN settings to get a few more device online with mixed success. The Chomecast player was not going to work.I decided to go it alone with my own equipment. I purchased a Motorola Surfboard SB6141 modem (Comcast approved) and a TP-LINK TL-4300 dual band wireless router. The Roku 3 is working on 5Ghz, the wireless printer is online, Netlix is streaming from the TV, Amazon Prime works..... everything works except this.......If you want to get it I suggest you Google Chromecast and {insert your router model here} for compatibility.", "verified": true, "helpfulness": "1/2", "author": "John M. Poltrack"}]