[{"rating": 5.0, "review": "I absolutely love this little device. It travels well and can be controlled by your phone or laptop. My only problem with it is it doesn't instantly stream Amazon Instant Video, which gets rather annoying. Other than that it works great and gets the job done.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 1.0, "review": "Could not get it to work. Gave it away.", "verified": true, "helpfulness": "0/0", "author": "markl miskimins"}, {"rating": 5.0, "review": "Very useful and great product", "verified": true, "helpfulness": "0/0", "author": "HARSHA CHAITANYA"}, {"rating": 5.0, "review": "Much appreciated by my son-in-law!  This was a Christmas gift and he loved it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Was given to a friend who has not gotten his WIFI up and running", "verified": true, "helpfulness": "0/0", "author": "TexasBoy"}, {"rating": 5.0, "review": "Daughter loves it", "verified": true, "helpfulness": "0/0", "author": "Sheri Miles"}, {"rating": 5.0, "review": "Everything Ok. 100%", "verified": true, "helpfulness": "0/0", "author": "Pablo Caiafa"}, {"rating": 1.0, "review": "Waste of my money. I purchased the Chromecast several months ago for use in my mountain cabin (which has no internet) thinking I could use it to send a signal wirelessly from my computer or phone to watch movies I have stored on them. Not so. You must have wifi internet service in order to use the product. Instead of returning it, I waited until I returned to my \"city\" home with internet and tried using it again. And it still doesn't work. It says it is connected to my wifi but will not connect to the internet. I give. As far as I'm concerned this thing can be flushed down the toilet.", "verified": false, "helpfulness": "0/3", "author": "Brenda Piper Stephens \"BeaDaNurse\""}, {"rating": 5.0, "review": "Performs as advertised. Easy to use. Great product.", "verified": true, "helpfulness": "0/0", "author": "Paul Hoagland"}, {"rating": 5.0, "review": "If you like to buy movies from YouTube or watch YouTube videos, this device can be used to watch them on your TV.", "verified": true, "helpfulness": "0/0", "author": "Lisha Fernanades \"Lis\""}]