[{"rating": 2.0, "review": "keeps loosing signal to the modem- have to reset or plug in again and reboot- would not recommend as a good product", "verified": true, "helpfulness": "0/0", "author": "James L. Crocker \"Jim  C\""}, {"rating": 4.0, "review": "I wish it had mote apps to use with it. But other than that it's perfect! Such a great device .", "verified": true, "helpfulness": "0/0", "author": "zachary"}, {"rating": 5.0, "review": "A must for Youtube junkies! I can't wait for more apps, the sky is the limit. Excellent product, that does what it says.", "verified": true, "helpfulness": "0/0", "author": "Michael S. Scribner"}, {"rating": 5.0, "review": "This has been a great way to use our Netflix streaming and we've been pleasantly surprised by the ease of using it for random YouTube watching as well. Easy setup: plugged it into the side of the TV, paired it with our WIFI network, used apps on our phones to start watching. We like pausing playback frequently and we were originally annoyed by the slight delay, but we've gotten used to it. When our phones go to sleep, the connection has to be re-established and we sometimes have to hit the pause button several times before it registers. All in all, love the simplicity and like the fact that we don't have to fire up our much louder and less energy efficient PS3 to watch Netflix anymore!", "verified": true, "helpfulness": "0/0", "author": "C. Sussman"}, {"rating": 5.0, "review": "it's very good product. it came on the sharp time. best product I've ever seen. it's small and with great designe.", "verified": true, "helpfulness": "0/0", "author": "Tornike"}, {"rating": 1.0, "review": "I bought the Chromecast device with the only purpose to use the mirroring feature with my iPad Air. And, for the moment, there's no such possibility. You're limited to a few apps as are Google Music, YouTube, NetFlix, etc. There's a Chrome browser extension but, unfortunately, it only works with desk & laptop devices. In addition to that i tested Chromecast with my Samsung TV using the Google Music app and switching from the TV speakers to my external speakers through an optical wire (as i do normally with my SAT receiver) and to my great surprise it didn't work neither.", "verified": true, "helpfulness": "0/0", "author": "Eric Milet \"Eric Milet\""}, {"rating": 5.0, "review": "I am so happy with this purchase! Just being able to watch Netflix and Amazon Prime videos alone makes it worth the purchase price. I am just starting to learn how to use it but it has already paid for itself in \"cutting the cable cord.\"", "verified": true, "helpfulness": "1/1", "author": "D. Webb"}, {"rating": 5.0, "review": "My perception of this when I bought it was that I would be able to stream anything on my PC to my smart TV using this device. Not so. Only supports Netflix and YouTube both of which are built in to the TV. This is a good concept but it should enable any content on your PC for streaming. The capabilities are overstated.", "verified": true, "helpfulness": "1/1", "author": "Vladimir Vilenski"}, {"rating": 3.0, "review": "There is nothing that would beat that for what it is offering with this price. But I would expect much more from a company like Google that has the brightest minds in the word at its disposal! I barely can use it due to unacceptable delays of the streaming video. Not smooth at all. I have a 26 mbps Internet speed and was broadcasting from less than 7 ft. All my devises (WiFi router,  Laptop and the TV) are in a very close proximity to each-other in  the same area. I barely can use the product. It is good for slideshow though.Sometimes it works well for YouTube. But the movies that I can watch smoothly on my LT can not be delivered to TV smoothly.", "verified": true, "helpfulness": "0/0", "author": "Ariya Momeny"}, {"rating": 5.0, "review": "I will never be able to sleep again because the choice of movies, tv, etc through this device is amazing!!  How cool to sit on the couch with phone as your remote. Also using at work to chrome cast our web-based software onto 2nd screen.  Can't WAIT until this supports VLC player. Just a pointer- you CANNOT cast web pages from and android or IOS tablets or phones. So far all I've found that will cast browser is Dell Venue 8 pro 7\" table (about $275) and The new Surface (about $800). All laptops and desktops will cast just fine.", "verified": true, "helpfulness": "0/0", "author": "Rachelle Crews"}]