[{"rating": 5.0, "review": "I don't have TV.  I live in the sticks, with a 1.5mbps DSL.  This is useful as heck, and I play NetFlix, Amazon Prime Videos from my laptop, Google Play videos from the phone.... Just superb.  Bought two, one for the bedroom, and one for the TV room.  Much more practical than a MHL cable.Cheers!", "verified": true, "helpfulness": "0/0", "author": "SomeGUY"}, {"rating": 4.0, "review": "This is a good, but very restrictive devices.This device allows you to stream to your TV from your Chrome Browser, your Android Tablet or phone, and from a few apps on your iPhone.This is Google's equivalent of Airplay for Android. It is not easily used on iOS.This is not a cheep replacement for a Roku or an Apple TV, it has far less functionality than these devices, and it does not have a good UI.You cannot do anything from the device it's self, you only can access the media already on your device.", "verified": false, "helpfulness": "0/0", "author": "aks2411"}, {"rating": 4.0, "review": "At first it wasnt what i was expecting but after a while of using it i fell in love with it.Pros:What i like most about it is the youtube feature. Watching youtube videos on my 50\" hdtv is way better than on my phone. You can use the TV queue to line up all the videos you want to watch so you can just sit back and watch you videos back to back without having to pick each video one by one after watching each. best of all you can put your device to sleep or exit youtube and surf the web without stopping your videos or your queue.Cons:Chromecast is not a full on miracast  device. so it wont mirror whatever is on your device onto the screen. it also means you cant display your phone's or computer's photos or videos either. Also if youre using your phone, google chrome is not supported or at least i couldnt figure out how to use the chrome mobile browser on chromecast. but im sure in the future mobile chrome will be able to work with chromecast.another thing is the number of apps that support chromecast. its very limited. and some apps dont work properly. for example the songza app will play a song for 10 seconds then start skipping each song uncontrollably however when i take the app out of chromecast it works perfectly. but like i said, its only time until more apps will support chromecast and work without flaws.I gave chromecast 4 stars because of the youtube feature and because i know that overtime chromecast will get bigger and better. also for $35 it is not a bad deal compared to other similar miracast ltems. however if you're looking for a miracast device then chromecast is not it. in fact i bought another miracast device to supplement my crave for a full smartphone mirroring experience. and the lack of a mobile chrome capability has me kinda disappointed. but still chromcast is good to have for the price. not to mention having netflix compatible with chromecast is not bad either.", "verified": false, "helpfulness": "1/1", "author": "alex velasquez"}, {"rating": 2.0, "review": "Not happy with the Chromecast because after 20 minutes the computer shuts down and I have to go and get the show going again. I would have thought that the software included would have stopped this from happening !!!", "verified": true, "helpfulness": "0/1", "author": "Robert Reeves"}, {"rating": 4.0, "review": "I got a chromecast for my birthday a couple of weeks ago. I LOVE to stream Netflix to it because it works so well. Tonight I was watching a show on Netflix thru my smartphone to chromecast. I had to go pick up a friend a half mile away, and forgot to pause the show because other people were watching it. When I got back, the show was STILL streaming. No lost connection whatsoever.Also, the picture is good quality and the streaming is flawless.The only things that I can think of for improving is to work on computer to chromecast connection. It really doesn't work well to stream a DVD or whatever from laptop to chromecast. Also, it really requires pretty good WiFi connection to work well.", "verified": false, "helpfulness": "0/0", "author": "S. Hiatt"}, {"rating": 3.0, "review": "The instructions are poor. For example, it isn't really clear that the plug in charger is for HDMI ports that have no charge. I tried it on two older TVs. Neither can pick up the Chromecast on the input screens. The newer TV has 3 HDMI ports but they do not power up the Chromecast but I finally figured out the configuration and got it to work.So my first suggestion would be a bit more examples for the people who can't just plug it in.So far I can only Chromecast Netflix and YouTube. Is that it? Or can I download more apps? If so which? The Google folks need to be a bit more user friendly to make this succesful.", "verified": false, "helpfulness": "0/1", "author": "Robert B. Nowell Jr. \"casual observer\""}, {"rating": 5.0, "review": "it works great n was really easy n quick installation. does what it says it would do! :-) thank you!", "verified": true, "helpfulness": "0/0", "author": "chanakya"}, {"rating": 4.0, "review": "I love this thing! Now I can just cast from my iPad and watch things on my tv that doesn't have hookups. I've been waiting a year, so I'm thrilled.It stalls out on me sometimes, like now. It just stops communicating with the iPad or Netflix. Usually it only takes a minute to fix, but sometimes it takes longer. Right now I'm pretty sure the problem is my Netflix app, because it is stuck.I was initially disappointed when I opened the box because it had a regular plug, but once I realized that I had both an HDMI and USB port on my tv, I was ok. The iPad can be anywhere in the room, and once I updated the Netflix app updated to iOS7 almost all of the pesky problems went away. As each new chromecast comes out I am sure they will get better. But for a new product, I'm thrilled! And at $35 you really can't argue.", "verified": false, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 5.0, "review": "Chromecast... It really whips the llama's a$$ (and costs a FRACTION of @ppl3TV and most other streaming players!) As long as the folks at G keep adding and updating apps, I'll be happy.", "verified": true, "helpfulness": "0/0", "author": "James Wiora"}, {"rating": 5.0, "review": "I ordered my first one though Google. But My 2nd one was ordered right here. With free 2 day shipping why would I not. I love this little guy. Makes my non Smart TV a little bit smarter. Love to be able to stream pretty much anything to the TV wirelessly. You can actually run local videos through your browser and Volla!", "verified": true, "helpfulness": "0/0", "author": "OneTw0 \"M Mehrizi\""}]