[{"rating": 5.0, "review": "RoomLove This Gadget. User Friendly Shopping Was Good. Glad I Tried This Product. I'll Be Buying Another One For My Other Tom", "verified": true, "helpfulness": "0/0", "author": "Meka"}, {"rating": 1.0, "review": "We loved our Roku so much that we decided to get Chromecast because it streams slightly different stuff. Whereas the Roku was simple to install with outstanding results, we can't get the Chromecast to do anything.  And we bought and have read the book.  We are working from a Windows 7 laptop.  Clearly the dongle is able to connect with our wifi router because it was able to discover its password and put up a nice screen with pretty photographs that change every so often.  We were able to reboot it, but couldn't figure out how to get anything but nice pictures.  Maybe someone can help me with this problem, but until I can get it to work it will be a thumbs down from me.", "verified": true, "helpfulness": "0/2", "author": "Betty Louann"}, {"rating": 5.0, "review": "Easy to install and setup. As i would expect from google. Works well for Pandora, youtube. Does tend to get hot when running continuously.", "verified": true, "helpfulness": "0/0", "author": "gerbil"}, {"rating": 5.0, "review": "I got tired of paying $100+ per month for cable/satellite TV when my husband and I watch very little, and when we did watch it wasn't at the times the shows in which we were interested were airing.  I ditched the cable, got Hulu+ and Chromecast, and immediately realized that we aren't missing anything by not having cable.  It also broadcasts music.  This is my second one for my home gym.", "verified": true, "helpfulness": "0/0", "author": "catsoverhusband"}, {"rating": 1.0, "review": "The first week I had it, it barely worked. Now it doesn't work at all. Waste of money. .... ....", "verified": true, "helpfulness": "0/4", "author": "Charles M. Alling"}, {"rating": 5.0, "review": "I can stream netflix, youtube and pandora to my TV. Its very easy to set up and qorks wirelessly so no hassle or mess.", "verified": true, "helpfulness": "0/0", "author": "A. Baloch"}, {"rating": 5.0, "review": "Initial setup was easy. Throwing any video on iPhones and iPads onto my TV is beyond simple. Even new devices have no setup as long as they are on my home WiFi. And you can shut off your device after the movie starts, even YouTube videos! Well worth the 35 dollars.", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 5.0, "review": "No issues with netfilx and HBOGO, both play flawless HD on my TV.  Not great for broadcasting directly from the Chrome Browser, but still works.  In a few months there will be several more chromecast optimized apps making this even more valuable.  And considering the price, this is why it gets 5 stars from me.", "verified": true, "helpfulness": "0/0", "author": "Matt ford"}, {"rating": 3.0, "review": "It allows you to stream multiple outlets of media services which is decently cool. It can't do much more though but for the price tag its a decent buy. Basicalyl a cheap way to turn your regular flatscreen into a smart tv with the bare minimum capabilities.", "verified": true, "helpfulness": "0/0", "author": "James Harold Hill Oswald \"James H.H. Oswald\""}, {"rating": 5.0, "review": "So easy to use and now we watch all our netflix shows on the tv. My 5-year old can pick her own movies and put them on by herself. Great device. Must buy!!!!", "verified": true, "helpfulness": "0/0", "author": "Christopher P Brown"}]