[{"rating": 4.0, "review": "I like it - needs more apps (like CBS) and some more popular shows and it will be one of the best.", "verified": true, "helpfulness": "1/1", "author": "Kate Jacobsen-murray \"KM\""}, {"rating": 5.0, "review": "Best invention since sliced bread. Only problem is that when I speak to it, the dog comes running in to see what's happening that needs his interference. \"Where's that cat and what's she doing now?\"", "verified": true, "helpfulness": "0/0", "author": "Charley"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/1", "author": "dorsmarty"}, {"rating": 4.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Vickie"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Rob Prasloski"}, {"rating": 5.0, "review": "Absolutely LOVE this device! We were formerly using a WII to stream Netflix and would get frustrated with the searching and choosing of programs. Amazon fire has taken away all that angst!  So simple to set up. ( remember to buy the HDMI cable because it isn't included, around $12). Since getting this we are now subscribed to Hulu Plus and are using our Amazon Prime Instant video on almost a daily basis. I also use the Amazon Fire to watch YouTube videos.The remote control is super easy to use. The voice search feature is so handy and makes searching a breeze.This device makes it so easy to ditch your expensive cable or satellite TV. Netflix and Hulu Plus are under $20 a month combined. So for an initial outlay of $99 (or the $84 we got it for) we're saving about $140 a month by not needing cable or satellite TV anymore.You really can't go wrong with this device.", "verified": true, "helpfulness": "2/2", "author": "beets rock! \"Beets will save the world!\""}, {"rating": 5.0, "review": "I live in Costa Rica.  Will it work here or do I need to change the IP address in my laptop or something?", "verified": false, "helpfulness": "1/3", "author": "JRH"}, {"rating": 5.0, "review": "I love my PRIME benefits.  It's like netflix and apple tv mixed together without the apple tv price.  I've watched several tv series for free and if I want to buy anything it's a lot cheaper than my apple tv.  The remote is one of the best parts.  I don't need line of site for it to work and the voice command option works well.  Love it, love it, love it.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 4.0, "review": "I would have given it 5 stars if I had access to a web browser and the google play market it runs Android 4.2.1but with the Amazon Framework and I already own Apps on the Google market. Also I would like it if they unlock the bluetooth so you can use Bluetooth head phones as an alternative so as to not disturb other people in the house. I used ADB to try to sideload settings manager to access the bluetooth pairing wizard but it remains unrecoverable.", "verified": true, "helpfulness": "2/2", "author": "Jeff Mezzanotte"}, {"rating": 1.0, "review": "I had such high hopes for the Fire TV, but unfortunately it just didn't work for us. Unlike our Roku, it constantly buffers and it couldn't manage to open Netflix at all. I am not sure why it has such loading issues since our Roku is more than three years old.We also didn't like that the device automatically purchases HD content, you have to click a few more times to get SD content, which when you have a slow connection, is really not helpful. Apple TV provides a way to download only SD content in your preferences.We are sending this back.", "verified": true, "helpfulness": "2/9", "author": "Patricia"}]