[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Mohammad M Hosaain"}, {"rating": 5.0, "review": "Works just as described. I can even stream any video playing from my PC or mobile web browser with no lag whatsoever.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install with the chromecast appConnection with the wireless network is okayCasting from my mobile and pc works perfectly fine", "verified": true, "helpfulness": "0/0", "author": "rodrigo ruiz"}, {"rating": 5.0, "review": "We have only used with Pandora and Netflix and have had no problems with connectivity nor with latency.", "verified": true, "helpfulness": "0/0", "author": "Denise M."}, {"rating": 4.0, "review": "works at home but don't purchase if you plan on using it for a work environment", "verified": true, "helpfulness": "0/0", "author": "Martin Anthony \"Technical italian\""}, {"rating": 5.0, "review": "I love this 😆", "verified": true, "helpfulness": "0/0", "author": "Alicia"}, {"rating": 5.0, "review": "I no longer have to plug my phone into the AUX to play my music on the home theater system... Nuff' said.BUT, in addition I can adjust the volume of the sound, TV shows, play a movie and still be on my phone, screencast, and it's simple to use. No more Cable...$35/ea is ridiculous and no monthly Fees? Come on. I may buy one just to carry it around with me!", "verified": true, "helpfulness": "0/0", "author": "Taylor Jennings \"27 yr old immersed in personal development. Startup junkie, life hacker, visionary, real estate investor, and follower of my man Jesus!\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Spencer vixama"}, {"rating": 5.0, "review": "I love this thing, it's incredibly handy. We often watch our nieces and have little in the way of children's movies at home, but when they get cranky we just fire this up and stream children's shows from youtube. The wife uses it for workouts and it's also great for sporting events on watchespn.com", "verified": true, "helpfulness": "0/0", "author": "Rhino"}, {"rating": 5.0, "review": "Works great, easy interface.  Nice addition to Netflix.", "verified": true, "helpfulness": "0/0", "author": "Paddy"}]