[{"rating": 2.0, "review": "It needs to include more channels to compete with Roku period.", "verified": false, "helpfulness": "0/4", "author": "Smittyman"}, {"rating": 5.0, "review": "Just got my Fire TV yesterday and I love it!!  I have Chromecast but it just no longer wants to work.  It is forever losing signal and would just make me mad!  I have Netflix, HBO and Prime.  Now the only thing I need to figure out is how to get my Netflix and HBO accounts working on my Fire TV!  The picture is so clear and the sound great and I love that I don't have to go thru my iPad or iPhone just to watch a movie!!", "verified": true, "helpfulness": "0/0", "author": "Keira Amato"}, {"rating": 5.0, "review": "Do I have to have wifi in my home in order for this to work on my vizio?", "verified": false, "helpfulness": "0/2", "author": "Mercedes B"}, {"rating": 3.0, "review": "Not very many current movies or TV shows that are free with \"Prime\"", "verified": true, "helpfulness": "0/1", "author": "Brandt Dehn"}, {"rating": 1.0, "review": "NO!! Your ad makes it sound as if the content/features  of the \"Fire\" are included. It's not, most of the features have to be paid for.I already have, Netflix and I can \"stream\" with my internet service, Xfinity.", "verified": true, "helpfulness": "3/7", "author": "JACQUELINE SPEARS"}, {"rating": 5.0, "review": "I've finally been able to convince my wife that there may be a future for this \"Internet TV\" fad.  Her commitment to me after using this for a few days is that we might actually cut the cord and save over $100 in cable bills every month!  Too bad it took me so long to realize that the Chromecast was just too complicated for her (using apps to control the TV is not anywhere near as convenient as having a dedicated remote control)", "verified": true, "helpfulness": "0/1", "author": "Matt Ranlett \"Husband, father of 2, and a software developer moving slowly and unsteadily into management. I love reading, especially fiction & history\""}, {"rating": 5.0, "review": "Really enjoy Fire TV.  Hope there are more apps soon.  Looking forward to the search working with Netflix.  Seems to require a reboot about every 5 to 7 days.", "verified": true, "helpfulness": "1/1", "author": "Richard I"}, {"rating": 5.0, "review": "I  love it!  I love the voice operated search!  I love  the selection!  I love the way you can get to other movies that are similar or have the same stars.  Fantastic!!!!", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 5.0, "review": "Fire TV exceeded my expectations. It was very easy to set up and navigate. Photos were a breeze to download. Accessing music playlists makes this worth the price of admission.  Yes, the voice command works, but navigation is so fast and easy. I'm so pleased with Fire TV, I just ordered Fire Stick, too.", "verified": true, "helpfulness": "0/0", "author": "c jansen"}, {"rating": 5.0, "review": "Excellent media centre box.I have switched over from Netflix to Amazon Prime. Well not a good choice as on Netflix all seasons are free but on Amazon Prime one ot two seasons are free and u have buy the rest of u want to watch.I then installed XBMC/Kodi on the fire tv. It was side loaded from my computer, for instructions goto http://xbmc.org and follow instructions. After the software was installed I set up the fusion hub on XBMC (for instructions watch xbmc how yo videos for fusion on you tube).The world then just opened up. Now I have every season and show and every movie on my finger tips. U watch on xbmc what I want to watch and when I want to watch and without any ads :)", "verified": true, "helpfulness": "0/0", "author": "SpaceWalker"}]