[{"rating": 4.0, "review": "I thought from some of the other reviews this would solve my netflix streaming problem, but it just crammed up my hole. It was too big, I just kept pushing thinking it was just a really snug fit but, it never got all the way in. My wife was helping me and she just kept asking me \"Is it in?\" over and over. Found out I was putting it in the wrong hole, haha whops.Great product though.", "verified": false, "helpfulness": "3/5", "author": "Eh_kees"}, {"rating": 5.0, "review": "This is an excellent purchase for my household.  We are now streaming videos and other information routinely.  We had some problems in the beginning but that turned out to be issues with my modem and not problems with Chromecast.  I was able to work with the Chromecast technical help to resolve the issue fairly quickly.  I would recommend this product to anyone who has a TV with HDMI and USB input but does not have a built-in wireless system. This is so much smaller and less costly than an Xbox or even a Roku or others like that.  This product was the answer to the product I was looking for over two years.  Thanks Google.  Good job.Ed Vernon, New Mexico", "verified": true, "helpfulness": "0/0", "author": "George E. Vernon"}, {"rating": 5.0, "review": "Nice and easy to use - I like simple and easy with no aggravation other devices are costly and often complex", "verified": true, "helpfulness": "0/0", "author": "Christopher M. Roberts"}, {"rating": 5.0, "review": "The product works as advertised. At this price point it a good value for money.If more streaming service are offered in the future, this product can become a replacement for cable television.", "verified": true, "helpfulness": "0/0", "author": "Gerry"}, {"rating": 2.0, "review": "Did not let me see the content on my galaxy s3 you could do netflix but I could already do that on my tv. I was looking for something that would let me see kids pictures and movies from my cell on tv.. and that did not do it. so I returned it.", "verified": true, "helpfulness": "0/0", "author": "Emir Avdic"}, {"rating": 1.0, "review": "couldn't get it to work under any circumstances whatsoever I could not make this device work properly and there's no way you can screw up the installation", "verified": true, "helpfulness": "3/5", "author": "Paul D. Thomas"}, {"rating": 4.0, "review": "I'm watching new movies again on Netflix crystal clear. I was not using YouTube until now I think of it I pull it up and watch it on my large screen TV I look forward to having some spare time so I can see what I can find to watch next.", "verified": true, "helpfulness": "0/0", "author": "Andre"}, {"rating": 4.0, "review": "I've been watching so much YouTube in HD I haven't even had time to check out Netflix!! Can't wait until they acquire more stations and networks. But overall great buy for a great price!", "verified": true, "helpfulness": "0/0", "author": "Kym Clarke"}, {"rating": 2.0, "review": "To cut to the chase, when it works, it works great.  However, despite being fairly adept at home networking, I couldn't get it to work with my Windows 7 laptops, but ironically, works fine with my iOS devices.  On those devices, it works with a limited set of apps.  Overall, it is far less useful than my Apple TV for flinging content from all my PCs and devices.  It was, however, very cheap with the Netflix promotion, so can't complain too much.", "verified": true, "helpfulness": "1/1", "author": "DeKay \"Gadget Buff\""}, {"rating": 2.0, "review": "I was going to order this on Amazon but then found it was available at a local retailer, so I went and bought it there since I wanted to see what it was about rather quickly. Set up was easy, plugged into TV's HDMI port, synced with wireless network, and was able to cast youtube content directly from Samsung tablet and Android phone using Chromecast App (available in Google Play store). Then downloaded the Chromecast extension to Toshiba laptop (Windows 7), with Chrome browser (the only way you can cast content from a laptop), proceeded to cast content from within the browser using the extension.  RESULTS: NOT SO HOT.Granted, the extension is in a beta process, when it does work it is okay, you can go full screen, decent pic, but when it lags, forget it. Options to \"tweak\", setting the pic to \"TV standard\" rather then HD standard, help a little, but there is a LOT of buffering and lag between audio and video. If the developers can step it up and improve upon the extension component of this product the potential is awesome. So if you are looking for a consistent and stable way to actually surf the net on your TV via computer--this is not it, yet.  If you are looking to be able to stream some video content via Hulu, Youtube, etc. via an App--then for the price, this will probably be okay vs. spending money on another type of pricier streaming device.", "verified": false, "helpfulness": "1/1", "author": "jmalik"}]