[{"rating": 3.0, "review": "If you have the latest equipment, it might be easy to set up. I had to hire a tech to set up mine and he did not have an easy time.", "verified": true, "helpfulness": "0/1", "author": "Bonnie"}, {"rating": 5.0, "review": "I ordered this to stream netflix while I work out.  So far it has worked great and has served its purpose.", "verified": true, "helpfulness": "0/0", "author": "Rory Hardy"}, {"rating": 5.0, "review": "We cancelled our cable and are just going with Netflix, Hulu plus, etc.  So far I think it only works with Netflix, but hoping it will work very soon with other apps.  So much better than having to hook up a HDMI cable to our laptop and connect it with our TV that way.  Very convenient.", "verified": true, "helpfulness": "0/0", "author": "Kristi Jean"}, {"rating": 4.0, "review": "I have not had it long but so far it is really cool. It did take a little bit to get it synced up but that was not bad and it needs more apps like amazon or crakle.", "verified": true, "helpfulness": "0/0", "author": "Scar77bg \"Brad Groeneveld\""}, {"rating": 5.0, "review": "Was as expected.  Met my expectations.  Was fairly easy to set up. I cannot think of anything else to say but I must put something down to meet the ridiculous requirement.", "verified": true, "helpfulness": "0/0", "author": "Robert G. Davis \"R. Davis\""}, {"rating": 3.0, "review": "This product might be okay if I didn't have a blue -ray player that already streams Netflix, Hulu and you tube. I was disappointed that I would have to purchase movies and tv shows from Google movies. I was kind of hoping that it would stream tv shows from my computer to my tv so I could get rid of cable. That is not the case, so for me it was a waste of money. It might be great for someone who doesn't have a wifi ready blue-ray player.", "verified": true, "helpfulness": "0/0", "author": "KZ"}, {"rating": 2.0, "review": "I know that most folks bash Apple products, but Apple TV blows this thing away. Just the fact that this has to be used with a computer or other hand held device is a deal breaker for me. I would much rather spend the extra $63 dollars for an Apple TV with a remote, which is much easier to setup and more intuitive than Google Chromcast. Plus you can use Apple TV with Hulu plus, without having your laptop turned on. Spend the extra money for an Apple TV, you will be much happier!", "verified": true, "helpfulness": "0/1", "author": "Dr. Richard C. Pfenninger"}, {"rating": 3.0, "review": "I wanted a way to show pictures and movies I took while on vacation.  As well, I wanted to show movies I stored on my tablet.  I was disappointed to discover how limited this product is.  If you are on a wifi with access to netflixs, amazon or such service it works.  If you have your own stuff or find yourself without internet access, oh well, watch some other time.  OK for home use but not for presentations or remote use.", "verified": true, "helpfulness": "0/0", "author": "David P. Mays"}, {"rating": 3.0, "review": "AFTER ONE MONTH, IT DIDN'T WORK WITH USB ENERGY SUPPLY. SO I HAD TO CONECT IT DIRECTLY TO THE ADAPTER. AFTER SOME DAYS IT BEGAN WITH SOME KIND OF INTERFERENCE (BAD VIDEO SIGNAL AND NO AUDIO AT ALL) SO I DISCONECTED FROM THE TV. NEXT DAY IT WORKS FINE, BUT A FEW DAYS AGO THE PROBLEMS GET BACK.", "verified": true, "helpfulness": "0/1", "author": "Jose Miguel Matamoros"}, {"rating": 4.0, "review": "I like the idea of the Chromecast, but it is so limited to just Netflix on my iPad. I can't find a way to pause it if i quit the Netflix app on accident and sometimes, the words and picture do not match up. It has great potential, but still needs a lot of fixes. I know a lot of apps aren't allowing this to be used because it would defeat their purpose, but I think it will do well in the long run. I wish you could use googleplay from your iPad and not just droid devices.", "verified": true, "helpfulness": "0/0", "author": "Caroline Ruffin"}]