[{"rating": 5.0, "review": "My daughter loves it!", "verified": true, "helpfulness": "0/0", "author": "peggyswfl"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "gary morrison"}, {"rating": 3.0, "review": "This works fairly well, but not as smoothly as I expected. There are a lot of apps, but most are of little interest.The youtube app works really well. The desktop chrome extension allowing casting is good, but I'm very disappointed that the same isn't available at this time for an Android device. I would have expected Android chrome to allow casting the same way that Youtube does since both are Google. If that was the case I would give the device 4.5 stars.", "verified": true, "helpfulness": "0/0", "author": "Scott Irving"}, {"rating": 5.0, "review": "Its good just having a hard time getting it on my PC to work with showbox", "verified": true, "helpfulness": "0/0", "author": "Evelyn Torres"}, {"rating": 3.0, "review": "It works great as long as you have strong WiFi signal behind your TV.", "verified": true, "helpfulness": "0/0", "author": "Arash Sadighim"}, {"rating": 5.0, "review": "Best 25 bucks I've spent in a long time !!!", "verified": true, "helpfulness": "0/0", "author": "rich"}, {"rating": 5.0, "review": "It's very nice, I wish it support more apps!", "verified": true, "helpfulness": "0/0", "author": "Juan Manuel Solano Fino"}, {"rating": 3.0, "review": "Love the functionality, but the number of sites supported is limited. Wish you could use it with any website and not just the supported ones.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Buy this, it is the best thing ever!", "verified": true, "helpfulness": "0/0", "author": "Cameron Eunice"}, {"rating": 5.0, "review": "I bought this and subscribed to Netflix instead of subscribing to a 13.00 and up pay channel and it is great.  I can watch what I want, when I want on my TV, instead of what the channel has on for the month.  I would recommend this or the amazon fire to anybody.  Great product.", "verified": true, "helpfulness": "0/0", "author": "mjoewoo"}]