[{"rating": 5.0, "review": "Convenient way to watch Netflix and more. I'm not that big on techy stuff, but I wanted to watch Netflix without having to log into Xbox Live or whatever. This worked great for that, but as I type this I now have Pandora streaming from my phone to my TV because it makes for a convenient wireless speaker system. I've also cast Youtube videos and movies using the Chromecast. All I thought I'd use was Netflix, but when it's so easy to make more use of it, you do.", "verified": true, "helpfulness": "0/0", "author": "John S"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "LEANDRO LUIZ"}, {"rating": 4.0, "review": "great gift", "verified": true, "helpfulness": "0/0", "author": "W. Wenze \"sports junky\""}, {"rating": 5.0, "review": "Everyone needs to have at least 1 Chromecast.  If you dont know why, you just need to purchase and experience for yourself.  It is an integral part of how I view media with my family.  I have a late model Samsung Plasma TV and if I stream something to it, it will turn the TV on for me and changes the input automatically.  This is invaluable when trying to queue something up for the kids (no fumbling with discs/remote).", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Clara S."}, {"rating": 5.0, "review": "very cool toy.  Easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "James R Storey"}, {"rating": 5.0, "review": "This device is wonderful. Everyone should have one, if you use Google apps or the expanding repertoire of supported apps. Really nothing deal breaking to dislike about this. Setup was quick and pain free. Attach to HDMI port on TV, or monitor. Plug in the power adapter. Set up on home WiFi. Download the app on computer/devices. Good to go. Essentially turns any non smart TV into a (limited) smart TV.For people who might be more technically inclined I found you can download Android only apps such as Avio or Local Cast which can stream movies/music/media from a NAS drive to Chromecast. Researched this too much. Plex works, but you have to set up an account and use Plex servers to re-compress / render which is a deal breaker for me. I recommend Local Cast because it's free, with Ads, and works without any hassles with a WD MyCloud hard drive.The one dislike came about when my internet cable connection was acting up, and I found out I couldn't even stream from my NAS locally to my own TV. Chromecast has to be connected to the world internet at all times to operate. That was a disappointment.", "verified": true, "helpfulness": "0/0", "author": "HiroNakamura"}, {"rating": 5.0, "review": "Everyone should have a chrome cast. its amazing i use it everyday. its that simple.", "verified": true, "helpfulness": "0/0", "author": "Mikeycello32"}, {"rating": 3.0, "review": "Chromecast glitches sometimes.  If you play with the settings you can get it to work. Although I'm not 100 percent satisfied with it I still give it 3 stars.", "verified": true, "helpfulness": "0/0", "author": "David F. Shaw"}, {"rating": 5.0, "review": "I love my chromecast!Prior to getting the chromecast, I already had 3 streaming devices (computer, xbox, wii) hooked up to my TV and my network set up for media sharing through those, plus I don't use Chrome as my primary browser, so I doubted I was going to use the chromecast very much. Simply put, I was wrong. The ease of streaming things through chromecast has changed how I use my TV to stream content.For video, instead of starting up my media center on the TV, browsing through to my network share(s), and finding content, I can simply open it up on the desktop hosting the content and be streaming it to the TV within seconds, in higher quality and with fewer buffering issues than I've experienced with VLC. I use the VideoStream app for chrome, which includes a remote app. I don't subscribe to cable, so I've also used it to stream live events, such as the State of the Union, via Youtube and this was absolutely seamless.The biggest use case in my house is actually to play music - I already stored my music collection on Google Play, and it takes a few seconds upon getting home to click 'cast' in the music app and have my music playing through my media center while I cook.As a passive device, the Chromecast displays art, weather, and photography on the TV when I'm not using it, all of which is tasteful, making a nice addition to the room and helping me feel like my TV is useful for things other than sitting down and watching things/gaming.One other thing to mention is how much this device has improved since I first purchased it. Updates to the Chromecast firmware/OS have made it much more stable (I haven't had a single issue, disconnect, or restart for months). Furthermore, developers are starting to release some great apps that extend the use cases beyond streaming video content. Take for instance CardCast - it allows up to 10 players to play Cards Against Humanity (with custom decks) on a chromecast if they download the (free) app. The app is well-designed, easy to use, and most importantly functional, and really demonstrates the potential of Chromecast perfectly. I hosted a party last weekend with over 70 attendees and had Cardcast running on our TV, it was a huge hit!A final bonus - the google Play credit(s) you get when buying a chromecast make up for most, if not all of the original purchase price, making it essentially free, especially if you have one or more android devices and plan to use that credit anyway for apps etc. Make sure you go to 'check offers' once you set up your chromecast to redeem these.All in all, a great device, and definitely worth the price!", "verified": true, "helpfulness": "0/0", "author": "Tim Johnstone \"Avid Prime member\""}]