[{"rating": 5.0, "review": "I loved it.  was easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "betty miller"}, {"rating": 3.0, "review": "I don't see anywhere to ask a question.  Does anybody know if 2 of these units can be used in adjacent rooms or would each remote control both units?", "verified": true, "helpfulness": "0/1", "author": "thomas"}, {"rating": 5.0, "review": "For Amazon Instant Video no other device I have used comes close.I have more issues with Hulu than I would like, but I think that might be partially the 10MB DSL that I am stuck with by living in the country, but I don't have problems streaming Amazon videos at all through the same connection.", "verified": true, "helpfulness": "0/0", "author": "Jeffs320"}, {"rating": 3.0, "review": "I think this could be a wonderful product if it would work as described. There is a lot of glitches yet to be ironed out as I suppose you would have that in a new product like this. Installation is a snap even if you have no tech knowledge.To be honest with you I could access all of the files and sites ( that was available ) before I bought this unit, but it was convenient to me to  be able to access them from one device ( even for the price ) So I suspect that Amazon will be working on this until they get it right.", "verified": true, "helpfulness": "0/5", "author": "yahoodie"}, {"rating": 5.0, "review": "I love the voice feature (which works far better than any other voice command system I've tried) and thus far seems far more stable, fast, and flexible than ChromeCast, because I could never get it to cast Amazon Prime vids from my desktop properly.  I'd rather be able to stream Netflix, Youtube, and Amazon Prime vids from the same device than cast my desktop to my tv anyway.  With ChromeCast, I missed having the ability to control it without opening an app on my phone/tablet, since I'm always multitasking while watching tv on it anyway and would have to interrupt what I was doing to change what I was watching, so although having to have a separate remote for it might be a drag for some, I enjoyed having a physical controller.  If streaming is to ever threaten Cable TV as a primary entertainment source, I believe Amazon Fire TV is by far a bigger contender in the race than ChromeCast, and is well worth the extra money.", "verified": true, "helpfulness": "2/2", "author": "Tawanda"}, {"rating": 1.0, "review": "Solid construction, heavy and sturdy.However this is not a toy, if you want to leave it for your kids to use it, they can get to any type of content since there are no parental controls whatsoever. All you can do is prevent unauthorized purchases by creating a 5 digit pin. As you browse through the options you have to watch, you'll get all kinds of posters of movies and tv series not appropriate for young kids.I got this amazon fire TV through the 30 day \"free\" trial and as I tried to return it, I realized I have to pay for returning it, which sucks.Amazon services are increasing price and dumping quality and customer satisfaction. Now I'm considering not renewing my prime subscription.", "verified": true, "helpfulness": "5/12", "author": "prequena"}, {"rating": 5.0, "review": "We love it. We have a Kindle Fire HD, and we use it for video more than anything. Have had no trouble with it. We decided to buy the Fire TV, it's awesome. The voice command feature works every time. It was easy to set up. and easy to use the remote. We don't have, or need cable or dish. I gave it five stars.", "verified": true, "helpfulness": "1/1", "author": "Denny Romero"}, {"rating": 5.0, "review": "Still love it. Better picture and easier to use than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Evelyn Ellis \"ekellis\""}, {"rating": 3.0, "review": "No VUDU so all my Ultraviolate titles are inaccessible.Everything else is nice, but without access to my digital movie library what is the point", "verified": false, "helpfulness": "1/2", "author": "Bryan Moorman"}, {"rating": 5.0, "review": "Fire TV is great, I highly recommend it.  Easy to set up and use if you have some tec experience.  My husband doesn't so he has a hard time with it.  He is 81 years old.  No experience at all.", "verified": true, "helpfulness": "0/0", "author": "janet"}]