[{"rating": 5.0, "review": "I never expected the have this much quality in streaming videos. Very cheap option for converting your HD TV to a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Prasanga"}, {"rating": 5.0, "review": "My new Samsung monitors have this built in but for $35 I was able to add this capability to some of my other TVs that did not have this casting capability.  It was well worth it.", "verified": true, "helpfulness": "0/0", "author": "G3 Systems, Inc."}, {"rating": 3.0, "review": "this product is okay. sometimes it does not work well. It takes a while to load up or pick up from my lab top.", "verified": true, "helpfulness": "0/0", "author": "dickson"}, {"rating": 5.0, "review": "This is such a no brainer purchase.  I bought one for each of my two TVs and it has provided a super easy way to get Netflix and listen to my Google Music collection.  Recently there have been some new apps coming available (such as streaming from my Synology NAS), but I have not spent enough time exploring those to have a good opinion about this functionality.", "verified": true, "helpfulness": "0/0", "author": "D. Anderson"}, {"rating": 5.0, "review": "pretty cool device for such a lil money. Hubby loves it. great gift for someone who likes little gadgets or a technology junkie", "verified": true, "helpfulness": "0/0", "author": "Mstattooed"}, {"rating": 4.0, "review": "Sooooo close.  The device works great, and I love the simplicity.  The color temperature of a movie when it plays on the TV is slightly off (lost 1 star).  There is a VERY limited selection of apps available to choose from currently (lost 2nd star) that are capable of casting.  I'm a huge fan of Google, but this just isn't their best work... yet.  The good news is that software updates should be able to fix both issues if Google decides to go that route.  I do recommend it, but could be better.07.05.14 Edit - the color temperature issue was corrected at some point (with my having to do anything which was nice).  Earned 1 star back.", "verified": true, "helpfulness": "0/0", "author": "K. Whitmire \"Jeep knurd\""}, {"rating": 3.0, "review": "I have purchased two of these devices. It is a well thought out design. It's major advantage compared to all other Streaming Media devices is that it is the only one I have found that is powered by an available USB Port. I am disabled and is the only player I could install on my ceiling mounted Westinghouse TV (model number unavailable).One Chromecast was installed on my living room Toshiba set and it worked very well but I later purchased an Apple TV player and I prefer it over the Chromecast. The one installed on the Westinghouse TV had trouble sinking with the network with the wi-fi transmitter in the same room. Eventually this Chromecast unit quit working and was stuck in a boot up routine. I returned this unit to Amazon with no problems in shipping it back.I had the perfectly working one installed on my Toshiba Set removed and installed on the Westinghouse set and it too had trouble maintaining a connection with the wi-fi signal. Based upon these experiments I have concluded that your satisfaction with the Chromecast may be based upon the TV set you install it on. If yours does not work, DON'T WORRY. I requested a return from Amazon and had UPS  pick the package up at my front door. The package was picked up and I received my refund from Amazon that included all charges the very next day.", "verified": true, "helpfulness": "0/0", "author": "R. Baker"}, {"rating": 5.0, "review": "The device connected easily to my home network and performs exactly as described. Also an excellent way to stream music through your home entertainment system.", "verified": true, "helpfulness": "0/0", "author": "Travis watkins"}, {"rating": 5.0, "review": "It was what I expected, wanted and it arrived on time. watched a few movies with it works best with a fast wy-fi and internet connection. Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "GABRIEL MARTINEZ"}, {"rating": 3.0, "review": "Great idea - but it doesn't always work well.  It might be us but we'll be watching something and all of a sudden it will stop broadcasting it on the large screen.....kinda bummed.", "verified": true, "helpfulness": "0/0", "author": "David Lehman"}]