[{"rating": 5.0, "review": "I received the Fire TV for Christmas. I love it. It does everything they say it will. You get movies,music and games, great for the kids or grandchildren. Very easy to set up. Only thing negative about it would be the need for a HMDI cable which I did not know would be needed. But even that was easy to get.", "verified": true, "helpfulness": "0/0", "author": "Patricia Ambrose"}, {"rating": 5.0, "review": "The first unit delivered failed the day after we fired it up so we had to return it, there was no charge and replacement arrived a few days later, typical excellent service from Amazon. The new Amazon TV box is working wonderfully, we were replacing an old oversized Lemark Box with a gigantic keyboard remote, the main reason we bought it was to obtain access to Amazon Prime. Movies and shows are quick to pop up and the menu is easy to navigate, I can highly recommend Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Had issues right away with it holding onto the Internet. It would lose Internet signal every 10 minutes. And we do have good internet speed. We tried everything possible but nothing worked. Ordered a replacement and it did the same exact thing. We have 2 Amazon fire sticks in our house that work perfectly fine. So I'm not sure what the problem is with it.", "verified": true, "helpfulness": "0/0", "author": "Renee Ringeisen"}, {"rating": 5.0, "review": "Easy to use...", "verified": true, "helpfulness": "0/0", "author": "Tia"}, {"rating": 5.0, "review": "Great buy. Does exactly what i want", "verified": true, "helpfulness": "0/0", "author": "jarod"}, {"rating": 5.0, "review": "This is great, just plug it in and you are all set.  So easy.", "verified": true, "helpfulness": "0/1", "author": "Diane E. Marr"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/1", "author": "Sami H. Alharbi"}, {"rating": 5.0, "review": "Like it. good box", "verified": true, "helpfulness": "0/1", "author": "Mike J Rosacker"}, {"rating": 4.0, "review": "Well packaged. Smaller than I expected.  Sets up well but takes a bit of time to do so.  Performs well.  No different than brand new.  Doesn't have an OFF button.  Instead you scroll to \"system\" icon and put it to sleep.  That's not as convenient as turning it off. But, not a big deal.  It took me a while to figure that out. Initially I thought it was expected to be on 24/7.  No problem connecting to my wifi.  Voice search capability works well.  In operation, the access to prime video versus what has to be purchased for view still not always clear up front.  Device wise, the fire tv is okay.  Access to Amazon music works well.  I'd recommend refurbished for those without a smart tv.  For those with a smart tv and access to Amazon App. A fire tv box is a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Gw; Amazon Customer"}, {"rating": 3.0, "review": "There are too many movies that I wanted to see that have additional charges. There are however, lots of free movies and shows to choose from. The device itself works well.", "verified": true, "helpfulness": "0/0", "author": "Leonard DiRoma"}]