[{"rating": 5.0, "review": "Highly recommended, great alternative for a smart TV or HBO GO!!!", "verified": true, "helpfulness": "0/0", "author": "Arnold B"}, {"rating": 3.0, "review": "Lacks the ability to do more than just stream YouTube.... if you have an Xbox or Playstation theres no need for it as you can link your tablets without it to your consoles.", "verified": false, "helpfulness": "0/2", "author": "Brett"}, {"rating": 5.0, "review": "This will chance your life and for only $35 who doesn't want game changer tech in their house.", "verified": true, "helpfulness": "0/0", "author": "T. Kuhn"}, {"rating": 5.0, "review": "this is the best of google", "verified": true, "helpfulness": "0/0", "author": "khaled"}, {"rating": 5.0, "review": "Works as you would expect nothing more nothing less.", "verified": true, "helpfulness": "0/0", "author": "joshua cairo"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "abdulrahman alotiby"}, {"rating": 5.0, "review": "A+ product, 1/2 GB rom, 2 GB ram, great product for value, will be looking for next latest release. Works as advertised and still seems some apps are still in beta testing. Also arrived day early with standard delivery.", "verified": true, "helpfulness": "0/0", "author": "Scott T."}, {"rating": 1.0, "review": "Great idea terribly executed. Hook up a breeae eve with the shotty instructions. Netflix won't play no matter what I tried to do. Customer service couldnt figure out the problem!!!! They're giving me full refund and agree the device is full of bugs and to stay away for them", "verified": false, "helpfulness": "0/3", "author": "Tyler R. Brundage"}, {"rating": 4.0, "review": "It works great for YouTube and videos from other compatible websites, but for any video that's being streamed from a different website that's not specifically supported by Google (Power Nation TV for example) it's not very good at all. You can set it to send the whole image in the 'tab' to your TV, but the quality of the video won't be very good. The resolution is OK, but it's really jerky and doesn't play smoothly at all. If you watch a lot of YouTube, Netflix, Hulu or any of the other sites that are specifically mentioned in the literature it's definitely worth the $35, but don't expect to be able to stream any video to your TV with good quality results.", "verified": true, "helpfulness": "0/0", "author": "J. Armour"}, {"rating": 4.0, "review": "Most people feel that this is the greatest innovation since the computer itself. I just don't see it. It's only fair when streaming video and if you don't have a really good router (that's not placed too far from the Chromecast device) and high speed internet, you may be disappointed when streaming video. If you just want it for looking at web pages, it's great.", "verified": true, "helpfulness": "0/0", "author": "Larry B."}]