[{"rating": 4.0, "review": "Easy set up, just some playback issues occasionally, probably the internet connection.It's a low cost way to turn your TV into a smart TV, be a lot better when there is more available content.", "verified": true, "helpfulness": "0/0", "author": "Imerys Minerals Ltd C M Bean"}, {"rating": 4.0, "review": "This is fun and awesome, but I was hoping it would do more then what it does. It works great with netflix and youtube but if I try and stream a video from a website onto my tv, it will not work well. Its very jumpy and slow. I have decent internet speed, I dont know if its the chromecast or the tv, or if the chromecast just cant stream video from anywhere but certain sites. I would love it, if i could use this to watch ABC.com and CW.com for shows they have on their site.", "verified": true, "helpfulness": "0/0", "author": "Rachael"}, {"rating": 5.0, "review": "Super easy to install. Great product for the price. Hoping that Google adds more content besides Youtube, netflix, and hulu.", "verified": true, "helpfulness": "0/0", "author": "Wally \"Wally W\""}, {"rating": 4.0, "review": "I little difficult to set up, but with aid of a friend it is, and I can take to beach and use it there too to watch programs and movies from my phone or Ipad.", "verified": true, "helpfulness": "0/0", "author": "David Watson"}, {"rating": 3.0, "review": "This is a great product that has a lot of hype and let me first say that I am writing this review as a true techie/geek - so my experience level is high with these types of products. I already use other streaming media solutions (android based) in my home so user experience is not what I'm writing this review about. I think this device will be great for the average user - ONCE THEY GET SOME APPS FOR IT! I couldn't believe how limited I was from my phone and computer with what I could share. Was it easy to do? Yes...and the setup was very simple....but this is not enough for what I was looking for. This product is going on the shelf and I'm using another android stick instead until they can come out with more options. I'm disappointed, but have faith that a google product will catch up - I'm just not willing to wait.", "verified": true, "helpfulness": "0/0", "author": "litelnole \"litelnole\""}, {"rating": 4.0, "review": "This is fabulous!  I can enjoy HD stuff from Youtube that just doesn't look good (or is laggy) on my laptop/phone.  I don't have Hulu/Netflix but for the money, it's perfect.  Google Play - that's great too!I would give this item five stars, if I could 'throw' more products from my phone or laptop onto my TV.  Google is sure to widen the offerings when this starts taking off.", "verified": true, "helpfulness": "0/0", "author": "John M. Baker Jr. \"johnny\""}, {"rating": 4.0, "review": "The device works well the only inconvenient is the app on the tablet sometimes it doesn't work or didn't appear.", "verified": true, "helpfulness": "0/0", "author": "Javier Chacon"}, {"rating": 4.0, "review": "pretty good！ but it is limited in china.No Youtube or sth like it can be used，just put computer screen on the tv which has HDMI INPUT.", "verified": true, "helpfulness": "0/0", "author": "lianghaoyu"}, {"rating": 5.0, "review": "Well worth the money for seeing Net Flix, Hulu, and videos on google.  So far the inclusive apps seem limited, but with google in charge I'm sure that will change.", "verified": true, "helpfulness": "1/1", "author": "mcharming"}, {"rating": 2.0, "review": "You Can only use YouTube on the chrome cast when using from my iPhone.. Apple TV is MUCH MUCH Better!", "verified": true, "helpfulness": "0/2", "author": "Mike F"}]