[{"rating": 5.0, "review": "This Chromecast is a game changer for me. Now I can get rid of cable and use Netflix and YouTube and more services coming soon.", "verified": false, "helpfulness": "0/0", "author": "Mel J"}, {"rating": 4.0, "review": "I have not been able to get it working.It's much more difficult to set up than led to believe.I need to adjust my router and have no idea how to do that.", "verified": true, "helpfulness": "0/0", "author": "DARWIN D. BEARLEY"}, {"rating": 5.0, "review": "Great for our living room that has a projector in it.  Everyone can stream videos to it straight from their phone or computer, it's great.", "verified": true, "helpfulness": "0/0", "author": "computmaxer"}, {"rating": 5.0, "review": "This works amazingly well. It is great to watch Netflix on and it was really nice when my friend wanted to  share a YouTube video while at my house, and she could also just connect from her phone with ease.", "verified": true, "helpfulness": "0/0", "author": "Laura Pelton"}, {"rating": 4.0, "review": "When the best feature about a piece of technology is the price, its not too helpful a review. So let me explain. I didn't need this, having a cable connecting my iPad to both my TV's for watching Netflix and NHL games, along with anything else on the iPad. But for the cost of a parking ticket, it was too cool to pass-up. I have gotten used to using it for Netflix and YouTube and it definitely performs as advertised. But unless they integrate other media sources into Chromecast...and quickly (NHL starts October 2nd), my rating will drop to it's OK and just be more careful where you park.", "verified": true, "helpfulness": "0/0", "author": "Allan P. Harris \"http://allallan.blogspot.com\""}, {"rating": 5.0, "review": "This the best product in 2013. Small but very effective. On price point you can not beat....compared to similar products in the market today.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as advertised. I was lucky enough to get it first day with the netflix code so the thing cost as much as dinner.  It does everything it says. Some people want to cry that it doesn't do things they hacked together and reversed engineered.  Well a company has the right to change their own product in the background and has no obligations to accommodate what you think you know. They offer an SDK to people who want to properly develop for it.", "verified": true, "helpfulness": "0/0", "author": "jimmy"}, {"rating": 5.0, "review": "Love it. Works well. Perfect for Netflix. I purchased one for my bedroom and will probably pick up another as more apps support it.", "verified": true, "helpfulness": "0/0", "author": "Kylep23"}, {"rating": 5.0, "review": "The Chromecast does what it does quite well. With more apps coming everyday, this streaming dongle is a must have at a great price. Well worth the $35 price!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Mueller"}, {"rating": 5.0, "review": "Great product. Easy to install and use.No extra wires needed. I have recommended this product to all my friends.", "verified": true, "helpfulness": "0/0", "author": "DARON L. DAVIS"}]