[{"rating": 5.0, "review": "Casting from netflix and Google play is excellent with standard internet. casting/ steraming from the internet (ie abc and nbc web sites) can be a little glitchy", "verified": true, "helpfulness": "0/0", "author": "BRIAN"}, {"rating": 4.0, "review": "Having previously only used the Wii to access Netflix and after a somewhat clunky first couple of attempts to get my phone to talk to the dongle, I am pleased with the set up. I don't have blazing fast DSL but it seems to stream the HD just fine. Way better interface than the Wii and HD!", "verified": true, "helpfulness": "0/0", "author": "James Marker \"1goodeye\""}, {"rating": 5.0, "review": "Love it and are going to buy another one. Works great with netflix and turns your phone into a movie remote.", "verified": true, "helpfulness": "0/0", "author": "Robin E. Ricci"}, {"rating": 3.0, "review": "but i wish we could stream our own media from our devices to the tv. besides that its good product.", "verified": true, "helpfulness": "1/1", "author": "sel ry"}, {"rating": 4.0, "review": "Basically this device will turn your existing TV into a smart TV for under $40.00. The apps that are supported work well although I have experienced some lag from time to time. Using a smart phone as a controller is handy as well. If you are planning to buy a smart TV I highly recommend you consider the Chromecast and save yourself some money.", "verified": true, "helpfulness": "0/0", "author": "R. Harland"}, {"rating": 2.0, "review": "Good idea but pretty worthless until Google accepts apps that devs already wrote but YOU are not allowing. Apple TV is much better right now. Would think Google would open the gates as they are open source friendly.I have used my Chromecast 0 times. Been plugged into my TV sense a week after the release. Bad Google.I'm a cable cutter and I'm using my Simple.TV, Apple TV and a Odroid U2 running Android 4.2.2", "verified": false, "helpfulness": "1/2", "author": "Kevin Krankall"}, {"rating": 4.0, "review": "It is wonderful device.  It is made to work with all kind of routers.  But some routers vBulletin settings not let it to work.  For example I have century Link's Zyxel c1000 router at home.  I given call to Century Link's technical department to help me for access point settings so that my router can communicate with this little device. Because this Chromecast device was working fine at my friends home. I tested with two different model routers of century link. It was working fine. But it was not working at my home. Century kink couldn't help me. They send me new router of same model.  But that has same problem. I returned that shipment.  I know this device is good. I am still working with settings of my router. I got this device one month ago but unable to run successfully at my home.", "verified": true, "helpfulness": "0/0", "author": "hitender mohan"}, {"rating": 1.0, "review": "It doesn't work!  When I sent a request to Google for assistance, I received no reply.  The problem may have something to do with my WiFi system being dual band.  Google's information on associated website does say Chromecast won't work with dual band wireless.  However, my system does provide a visitor's access to the Internet via a single band; but Chromecast won't work with this access, either.", "verified": true, "helpfulness": "0/0", "author": "T. Brown"}, {"rating": 5.0, "review": "Resolution is really great, it's a reliable product that hasn't cut out for me yet. No complaints, it matches its description and is cheap to boot. Hopefully they will add new apps for it soon.", "verified": true, "helpfulness": "0/0", "author": "Rynoseruss"}, {"rating": 5.0, "review": "This is the greatest device since ice cream. Just plug it in, set it up and start watching streaming video.Works great and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Bob"}]