[{"rating": 4.0, "review": "While there is a bit of an issue with lag; overall, it's really a great product. Quick and simple to use and setup. The images are surprisingly clear as well.Am I happy? Yes. Would I recommend it? Yes.", "verified": true, "helpfulness": "0/0", "author": "Carlos R \"Russo\""}, {"rating": 5.0, "review": "Nice and easy to use.  Great for my tablet, iphone and my laptop.  My kids love it too.  Just great", "verified": true, "helpfulness": "0/0", "author": "Kaibil"}, {"rating": 5.0, "review": "Well the wait was worth it. They originally said it would be in october till i received it, but it came mid to late august so YAY. I would say a netflix account is a must with this guy, I haven't tried the chrome addin for this beast yet but i'm excited to. Can't wait to see what other applications adopt it, way to go google keep it up!", "verified": true, "helpfulness": "0/0", "author": "blumpkin03"}, {"rating": 5.0, "review": "Ordered this the day it was released and have been using it for awhile now. Does everything that it claims to and i am hoping for more functionality in the future,", "verified": true, "helpfulness": "0/0", "author": "Shane"}, {"rating": 2.0, "review": "Roku does far more than Chromecast, so I bought it solely for the beta function of the Chromecast tab on the Chrome browser which would allow you to put whatever you were watching on your laptop, etc. on your television screen.  It's very much a work in progress unfortunately.  The video on the computer was fine, but when going through Chromecast was jerky and would start and stop; voice and video were out of sync.  This seems to be a common complaint.  This could be a killer device, but not at the moment.  At $35 with Amazon Prime shipping it was worth a try out.  At this point, if you don't have it, don't bother.", "verified": true, "helpfulness": "1/2", "author": "James A. Gorton \"crescentan\""}, {"rating": 5.0, "review": "The products was simple to setup and use. It has been working since day one with no issues, I just wish I had bought more than one to use my other TV's.For 35 dollars, you cannot go wrong here...Plus I was one of the lucky ones that also got the 3 month Netflix streaming service for free in this deal.", "verified": true, "helpfulness": "0/0", "author": "Vinod Khanna"}, {"rating": 3.0, "review": "At $35, you get just about 1/3 the usefulness of its competitors. The exception is tabcasting; a good idea, but it's not there yet: video and audio don't sync up if you cast a page like Hulu, and for just regular browsing, you don't get to see the pointer.However, casting Netflix from my phone was flawless and hi-res.I feel it will get better with time and updates. It's not there yet, but it's a promising start (for $35).", "verified": true, "helpfulness": "0/0", "author": "Jeff Woods"}, {"rating": 2.0, "review": "I tried to use my iPhone to set this up to no avail -- an error states an iPhone app is coming.Looking forward to that day, but DOA for now.", "verified": true, "helpfulness": "1/3", "author": "John S. Gillespie"}, {"rating": 5.0, "review": "would get another one when it is back in stock. this product sells out quick! Amazon keeps me updated & i received faster than expected date! thankyou!", "verified": true, "helpfulness": "0/0", "author": "Gloria Wong \"Gloriaaaa\""}, {"rating": 5.0, "review": "I didn't realize this product was capable of also setting the TV to the right HDMI port, along with turning it on.  The result?  You can set something up to play on Chromecast, and the TV turns on along with setting itself to the right input.Pretty neat!", "verified": true, "helpfulness": "0/0", "author": "Marcus Maczynski"}]