[{"rating": 5.0, "review": "Cancelled the Dish Network and took the dish off the side of my house.  Amazon Fire TV is all we need and we're very pleased with it.  It works great with just a little bit of buffering hang-time once in awhile on certain apps.  Never any buffering issues watching movies. It really is nice to have selecting what you watch be a conscious decision, instead of just sitting there watching whatever comes on just because it comes on and you can't find anything else you'd rather watch.", "verified": true, "helpfulness": "0/0", "author": "T.F. Hutton"}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "M. Meadows"}, {"rating": 4.0, "review": "I like it but I like more free movies,still learning how to use everything,overall I like it. Love the voice search.", "verified": true, "helpfulness": "0/0", "author": "bonnie c."}, {"rating": 4.0, "review": "So far, so good", "verified": true, "helpfulness": "0/0", "author": "Wanda R. Josephs"}, {"rating": 5.0, "review": "Great product for Amazon movies and Netflix.  Great product.  The voice activation works great.", "verified": true, "helpfulness": "0/0", "author": "Linda Williams"}, {"rating": 5.0, "review": "Amazon Fire exceeded my expectations. While it's easy to set up, the Amazon folks don't understand that not everyone is a tech geek. There is a deficiency in teaching the new user the \"Fire language\". You shouldn't have to be a psychic to learn how to use this and so I recommend that they pick some old timers and observe their learning how to use this - it should be more plug and play but certain questions arise that aren't addressed by Amazon.", "verified": true, "helpfulness": "0/0", "author": "G. Horn"}, {"rating": 5.0, "review": "I'm sorry if I sound ignorant, thinking about cutting our cable and just wondering, do I need to buy two of these devices if I want to watch shows on two different TV's or is there another way to do this? Thank you.", "verified": false, "helpfulness": "0/0", "author": "AmDream"}, {"rating": 3.0, "review": "I subscribe to Sling TV and purchased the Fire TV thinking that by doing so I can watch live English Premier League football through ESPN. I am a Manchester United fan and wish to follow every game they play but was disappointed when no English Football are shown through Sling TV ESPN.", "verified": true, "helpfulness": "1/2", "author": "chen hou sung"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "handheld"}, {"rating": 5.0, "review": "We are really pleased with the Amazon Fire TV and so are the youngsters who frequent our home. It's great being able to select some of their favorites to watch anytime they wish. This is an awesome device and one we are really happy we purchased! Easy set up and easy operation!", "verified": true, "helpfulness": "0/0", "author": "Susie L"}]