[{"rating": 5.0, "review": "It does all that it promisses. Very easy and intuitive to set it up.", "verified": true, "helpfulness": "0/0", "author": "Marco"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "KonstLaw"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Yves J."}, {"rating": 5.0, "review": "Worth every cent, seamlessly streams online videos and music. With a few getarounds, allows streaming files from the hard disc.", "verified": true, "helpfulness": "0/0", "author": "abhinav sood \"avidoc1\""}, {"rating": 5.0, "review": "Now this is quite the must have and it works so darn great. Chrome cast allows you a lot more options and allows you to work by using your television. This is one product they advertise that delivers a lot more than what they tell you. This is a really great product", "verified": true, "helpfulness": "0/0", "author": "Donald Vincent Campbell"}, {"rating": 5.0, "review": "What can I say?  It works great just as advertised.", "verified": true, "helpfulness": "0/0", "author": "George Greavu"}, {"rating": 5.0, "review": "A great way to throw content on your TV.  I especially love the shared Youtube TV playlist.  Can't wait to see where Chromecast goes in the future.", "verified": true, "helpfulness": "1/1", "author": "M. Hess"}, {"rating": 5.0, "review": "Absolutely the best media streaming device currently available", "verified": true, "helpfulness": "0/0", "author": "mah817"}, {"rating": 5.0, "review": "I had some initial issues setting it up with my particular router (Asus RT-N65R) but after tinkering for a bit I was able to get it working. Works great from my galaxy s5 and my nexus 7 tablet. Great at parties!", "verified": true, "helpfulness": "0/0", "author": "P. Trimble"}, {"rating": 2.0, "review": "Big delay between what shows on the computer monitor and what shows up on the TV.  Audio not even close to synched.  Stops and pauses while it is \"searching\" for .....who knows what?  Not internet connection, because while it's doing that I can do other stuff online.", "verified": true, "helpfulness": "0/0", "author": "Robert P. Miller"}]