[{"rating": 2.0, "review": "This product is nice, it has the speed, and it has the look, but it falls short still on the apps that it provides. It doesn't have a (in my mind) youtube app or a internet browser. I mean it shouldn't be hard to create one or join forces with fire fox or any other generic web browser. The main thing that fell short for me was the number one selling point that convinced me to buy the amazon fire. The voice controlled search, if u have any kind of accent our deep voice, this damn thing doesn't even give a suggestion on what you said, its such a useless feature it baffling. I'm just gonna send this back because it not worth it, if you already have a smart tv then this is a waste of money", "verified": true, "helpfulness": "1/4", "author": "Jarel GOrdon"}, {"rating": 5.0, "review": "love the fire just wish it had more apps but and great product all around.  would recommend to all my friends", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Halfacre \"jhalf69\""}, {"rating": 5.0, "review": "I don't watch a lot of TV since I'm not fond of watching commercials, but I do like to watch movies and educational programming.  Having reviewed my options, i.e.; cable, internet, or standard commercial TV, I feel I've found the perfect solution to watching my favorite movies and series through Amazon Fire TV.  The unit is a quick solution to accessing enormous amounts of programming via the internet.  It is small and unobtrusive, has one connection and was easily and effortlessly installed on my TV.  Since purchasing this item, I have used it repeatedly to access the very programs I'm most interested in.  I have found it to be quicker than any other connection and particularly includes connecting to Netflix and Amazon Prime programming.  I have experienced no repeated \"buffering\" of programming as I previously did through connecting through my TV or DVD player.  It makes watching movies and other programming a pleasure again.  Amazon Fire TV is simple to use and I'm very satisfied with its performance overall.  Couple this unit with the amount of programming that's available through Amazon Prime and I never have to watch commercial TV with the exception of maybe accessing my local news.", "verified": true, "helpfulness": "1/1", "author": "T. Stewart"}, {"rating": 3.0, "review": "My only criticism of this device is I wish you could filter out all the pay per view stuff. It gets in the way of the TV you did actually pay for.", "verified": true, "helpfulness": "1/1", "author": "Donald G Wilson"}, {"rating": 4.0, "review": "Fire TV is a small package. Very easy to set-up and operate.  So hardware and interfaces work well. The only disappointment is to still have to pay for recent movies and programming, even as I Prime member. Not ready to pull cable programming just yet.", "verified": true, "helpfulness": "0/0", "author": "P. Cooke"}, {"rating": 5.0, "review": "I love Amazon Fire TV.  It was  so easy to set up with my Prime membership.  I love it that we can watch what we want at the time we want to watch it!", "verified": true, "helpfulness": "0/0", "author": "Doris Murdoch"}, {"rating": 3.0, "review": "Yes, it is very fast compared the Roku 3.  Beyond that it doesn't beat out the Roku 3.  Needs MLB.tv and Spotify. Another obvious addition would be Amazon Prime Music.  Not only should it be added, it should have been added when they announced the service last week.  The home page is very cluttered and not at all intuitive.  There needs to be a better way to have the \"My Apps\" a bit easier to see.  Amazon clutters the homepage with all of it's content which makes what you want to see right away a bit more difficult.  Yes, the first row is recent stuff, which, in my opinion kind of confuses the situation because my brain ends up sifting through the list only to find the app I was looking for isn't there because I haven't used it in a few days.  And yes, the voice search is cool, however, it only works with Amazon movies and tv shows.  This is a gripe with the Roku 3 too.  I won't blame Amazon too much for that one.I like it, but not enough yet.", "verified": true, "helpfulness": "1/1", "author": "giulio \"giuliosavo@gmail.com\""}, {"rating": 5.0, "review": "I love that I can search by voice and that there are so many movies I can watch with my Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Donna M. Adams"}, {"rating": 2.0, "review": "I don't know why my television didn't recognize it when I connected it. I have an apple tv which works ok, but doesn't have the features as the Amazon Fire. I am very disappointed I couldn't get it to work and had to return it to mason.", "verified": true, "helpfulness": "1/2", "author": "Lee W."}, {"rating": 4.0, "review": "The apps need updating but other than that it's an awesome product! I also wish the voice search could apply to Netflix and Hulu plus!", "verified": true, "helpfulness": "0/0", "author": "Drury Carr"}]