[{"rating": 5.0, "review": "I love the Amazon Fire TV! It is different from other providers. I love that I can access different music, I can watch shows on my lap top if I am not at home. The selection of different television shows and movies is wonderful. I am really glad that I have bought the Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Brittney Scalise"}, {"rating": 5.0, "review": "I love my, \"Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "WALKING EPISTLES"}, {"rating": 5.0, "review": "The Fire has been great so far. It has many options of stuff to watch and most of the time has a great picture (I think our internet speed gets slow occasionally). So far, my only complaint was it took my wife and I awhile to figure how to turn the thing off, but eventually we did. My wife now has even more choices of HG shows to watch (yea!). We shortly added Netflix and now can watch just about anything. The choices on Youtube are seemingly endless. I like the ease of use of the remote, and that it's not complicated.", "verified": true, "helpfulness": "0/0", "author": "Larry Collins"}, {"rating": 5.0, "review": "Best ever!!", "verified": true, "helpfulness": "0/0", "author": "V S K KAMAL LANKA"}, {"rating": 5.0, "review": "Love it! It is simple and intuitive! Much better grip for remote than AppeTV!", "verified": true, "helpfulness": "0/0", "author": "R. Shin"}, {"rating": 4.0, "review": "I enjoy watching all my Amazon Prime and movies that I  am already familiar with. Have not figured out how to get regular TV on my TV. Someone said my TV was not a really smart TV. So, this is my big kindle firE HDX. If you are not savvy with electronic items, get help to be sure your needs are met.", "verified": true, "helpfulness": "0/0", "author": "Snowflake \"Mayetta M. Cahill\""}, {"rating": 4.0, "review": "As expected pretty much got it just to use sling app", "verified": true, "helpfulness": "0/1", "author": "Timothy Hall"}, {"rating": 4.0, "review": "It needs a lot of modification, (side loading apps and KODI) to even make this usable. The native twitch app doesnt even support 1080p when it should easily and paying for plex again... wow thats stupid.If you are willing to put in the time to get it working properly its a good device. if not its a not worth it.", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 4.0, "review": "Pros:-Received 50% discount for subscription with SlingTV-Great content availability (I currently use Netflix, SlingTV, HBO Go, Mirroring360, Flixster, Pandora)-Easy to understand and convenient interface-Easy to install-Voice search ability is very accurate-Very fast controls due to the fastest available processor meaning there isn't lag in the control like other optionsCons:-Amazon content is forced to the top, but Amazon prime does not have as good of content as other apps such as Netflix, Hulu, or HBO Go, but this is common among many streaming options (i.e. AppleTV)-In contrast to other options such as Roku, Voice search only works for Amazon prime content (may be remedied in the future)-Automatically goes to sleep meaning I can't leave the TV on for my dog when I am at work (This setting can be avoided by installing an app that will cause Amazon Fire TV to think it is continuously active, but the downside is that it will then never sleep and there is no power button)-Purchased this over other options in part for Optical Out for surround sound, but content only supports 2.1 audio. This isn't an issue with the hardware, but an issue with the content being viewed (i.e. Netflix, SlingTV). This will only be fixed if and when the content is upgraded to support 5.1.Overall:The Amazon Fire TV does everything that is necessary very quickly and effectively, but there are some kinks to work out before this really can lead the pack (full voice searching capabilities, control over Amazon sleep funciton)", "verified": true, "helpfulness": "0/1", "author": "SampleEd"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Matthew G. McCabe"}]