[{"rating": 5.0, "review": "This is one of the best version 1.0 products I have ever seen.  Very easy to connect provided you know what an HDMI port is and where it is located on you TV.  You will also need to know your WIFI password.I would be remiss if I didn't talk about my findings though.  But by no means will this stop me from putting them on every TV I have at my house, work, and at every sporting event we host.A con:When casting from a tab at very high resolution the tv display seems to get worse.  It is small and grainy...very strange.  Tried several different exceptionally hi-res configurations and never could get it to correct.  This may have been a local network limitation as well.  I wouldn't worry about this actually as very few will use it as I tested it.Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Google never ceases to amaze me. And this little doo-dad is no let down. We use it with Netflix and Youtube for most of our viewing pleasures. I can't wait until they add more features.", "verified": true, "helpfulness": "0/0", "author": "b.suspicious"}, {"rating": 5.0, "review": "This device packs a great punch and provides great quality streaming to your TV even though it has some shortcomings (though they will just get better over time)The biggest thing with this device is that you need to realize all the potentials that Google Chrome on your computer is capable of.A great example is dragging a music or movie into your browser. Just by dragging, you are able to easily stream a movie directly from your computer to your TV because Chrome is HTML5.One \"hardship\" however is that there is still a lack of fully supported features for the device such as Hulu, etc. However, you can still watch them on your TV, you just have to watch to make sure there isn't a small lag in the sound/picture. If their is, you need to reset your browser.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Sullivan"}, {"rating": 4.0, "review": "Awesome for the price!  Well wealth the purchase, I haven't had any issues since I originally purchase this device! Get it!", "verified": true, "helpfulness": "0/0", "author": "Brandon Jones"}, {"rating": 4.0, "review": "I own an LG 60PA6500 60-Inch 1080p 600Hz Plasma HDTV which I am satisfied with.  It has no 3D capability, but the 2D images and colors rock completely.  Anyway, I hooked it to my Google Chromecast HDMI Streaming Media Player with little effort as my flat screen has easy access USB and HDMI ports adjacent to one another on the perimeter (you don't need USB capability; you can skip the USB port and plug Chromecast into an electrical outlet if you wish).  So often I go to Hulu and learn my favorite shows, including news and entertainment, are not licensed for the big screen.  No more!  I stream beautiful images from my computer to my 60 inch screen effortlessly.  It is a great workaround strategy that allows me to view art and entertainment films I would not otherwise be able to enjoy without peering into my 11\" computer screen or my iPhone (yes, I can stream from my iPhone, YouTube included :).  Only two reservations: 1. I must agree to allow Chromecast to collect information about my computer searches; however, if this is not an issue for you, Chromecast may just be your next gadget. 2. Occasionally lip movements lag behind spoken words.  I find stopping the show, getting out of Chrome then opening Chrome to the show again resets this.  I am not sure yet how it will sound with my surround system as I have not yet hooked the two up.  Otherwise, completely pleased.  Bravo!", "verified": true, "helpfulness": "0/0", "author": "KiddieDoc"}, {"rating": 5.0, "review": "This is the neatest gadgets out there, I think everyone should have one. It works well with all my computers", "verified": true, "helpfulness": "1/1", "author": "M. Stone \"stonemea\""}, {"rating": 3.0, "review": "It works well with the other devices but the programs are very limited. So it isn't something that will replace roku or apple tv. If you only have netflix then this is the product for you.", "verified": true, "helpfulness": "1/1", "author": "Clorina A. Perez"}, {"rating": 1.0, "review": "I order this item. Amazon deliver it  after a month and it was defective item . I spent so  much time on this it set up with my TV but i could no do it. Finally when i called Google , they said product is defective. So i am returning this item.", "verified": true, "helpfulness": "3/8", "author": "Biswadarshi Parida"}, {"rating": 4.0, "review": "It took me a while to get Chromecast to work, but I eventually discovered my router WPA encryption had to be set to TKIP/AES or it would not work.  Once I figured that out, it was smooth sailing.  I was also able to get the Kindle Fire to work with Chromecast with a little finagling.  It is a great deal for $35, makes web browsing on TV easy and works great with Netflix and Youtube.", "verified": false, "helpfulness": "1/2", "author": "James R. Cook"}, {"rating": 4.0, "review": "It just took me a couple of minutes to install and get my Chromecast setup. For $35.00 you can't go wrong if you are a Netflix subscriber and want to watch YouTube on a big screen, the interface through my iPad is amazingly fast and so good I am going a buy another for my living room even though I have a smart tv and a blu-ray that provide those features. I am looking forward to what added applications that will come available in the future.", "verified": true, "helpfulness": "0/1", "author": "Gregg Bracke \"Gregg M Bracke\""}]