[{"rating": 3.0, "review": "I can't access movies or TV shows through Amazon Prime. I keep getting an error message that it's not working and to check back later", "verified": true, "helpfulness": "1/2", "author": "Fred McKay"}, {"rating": 5.0, "review": "I have an Apple TV and  got an Amazon Fire for my birthday this last May. Amazon Fire is so much easier to use than Apple product. Once you put in your information amazon fire remembers - apple consistently ask same questions over and over again.  I really like voice commands. I am gone for two months - just wish I could connect to my Amazon while gone.", "verified": true, "helpfulness": "0/0", "author": "Galloway"}, {"rating": 5.0, "review": "I love it. Compact, easy to connect, and so much entertainment at the command of my voice!", "verified": true, "helpfulness": "0/0", "author": "LikeButtuh"}, {"rating": 5.0, "review": "I was very pleasantly surprised with my Fire tv...It is much more than I expected...Thanks Amazon...", "verified": true, "helpfulness": "0/0", "author": "Sandra Wilson"}, {"rating": 4.0, "review": "The only gripe I have is that some shows I like are free on Hulu but in order to watch on amazon is you have to purchase them in high Def to watch. Other then that, I love my fire tv.", "verified": true, "helpfulness": "1/2", "author": "Edward Weesner"}, {"rating": 5.0, "review": "It delivered on what it said it would do. Easy installation", "verified": true, "helpfulness": "0/0", "author": "Michael S."}, {"rating": 5.0, "review": "works great. Set up was fairly simple even for a technically-challenged user.", "verified": true, "helpfulness": "0/0", "author": "Crittermom"}, {"rating": 4.0, "review": "Still needs mlb app", "verified": true, "helpfulness": "0/0", "author": "Cecilia Cheek \"coalminer\""}, {"rating": 4.0, "review": "After weeks of evaluating and using Amazon Fire TV, I have decided I can live without cable in the process save money.  I won't have to watch the \"hate channels\" like FOX NEWs, MSNBC, etc.  There are plenty of other news programs without the hate.  Also lots of free movies, documentaries and TV shows that I can see on demand.  I have downloaded other apps like NETFLIX, Crackle, Showtime, etc.  Some require a low subscription price and others are free.  Love it!  I am doing this out of principal since I am tired of the high cable price ripoff of the consumer.", "verified": true, "helpfulness": "2/3", "author": "Bob N Del"}, {"rating": 5.0, "review": "i love the fire TV it is the best XBMC platform i have ever owned. i cut the cable cord a few months ago and havn't even thought about cable since i got my fire TV.", "verified": true, "helpfulness": "0/0", "author": "Danny l York"}]