[{"rating": 5.0, "review": "Amazing product! It has changed the way that I view and play all of my media. The list of compatible apps continues to grow. It is portable and you can't beat the price. Buying multiple for separate rooms is something think about depending on the size of your house. Can't rave enough about this product. Buy one NOW!", "verified": true, "helpfulness": "0/0", "author": "Amanda Charron"}, {"rating": 5.0, "review": "This is great streaming device. When the kids want to watch Netflix we take it out our main tv and pop it in theirs. It is so convenient.", "verified": true, "helpfulness": "0/0", "author": "Language"}, {"rating": 5.0, "review": "Works like a charm! NetFlix on our non-smart tv. Downloaded the iPad app and was off and running. Happy camper.", "verified": true, "helpfulness": "0/0", "author": "Richard Norris"}, {"rating": 5.0, "review": "Google Chromecast is very easy to configure and use.Just, install, configure the wifi connection and stream content from You tube, Netflix, PLEX, Revision3, Filmon and much much others, from your cell phone or tablet.Just browse the content you want to watch from your portable devices, specially the Android ones... select the Chromecast icon and thats it, watch the content on your big TV screen...Do not confuse it with AirPlay, seems similar but it is better, it sends the URL of the video from your tablet to your Chromecast, and it negociate again with the content provider the quality of the video at its maximun (depending on your internet connection) but it is not a streaming from your tablet/cell phone to the TV, assuring the best quality availiable for the same content.The amount of video apps avaliable with Chromecast support grows every day.", "verified": true, "helpfulness": "0/0", "author": "Miguel A. Rabi"}, {"rating": 2.0, "review": "I was expecting an item that worked similar or the same as the Roku I have. Unfortunately, the item requires you to use a computer/laptop/tablet or a phone to play the media and store the apps. This is merely a way to view it on a TV. Returning and ordering another Roku.", "verified": true, "helpfulness": "0/0", "author": "Doctor J"}, {"rating": 5.0, "review": "I just used it on Vacation for Netflix as well as entertaining the kids with Video's from YouTube. It is easy to install as well as reinstall when traveling. Great product.", "verified": true, "helpfulness": "0/0", "author": "Joel A. Campbell \"JACampbell\""}, {"rating": 5.0, "review": "Came very quickly and as described. Streamed perfect from laptop and have not complaints. Good price and good value for this item.", "verified": true, "helpfulness": "0/0", "author": "monet03"}, {"rating": 5.0, "review": "Worth every penny! Easy to set up and use right out of the package. Google hit a homerun! Planning on buying more.", "verified": true, "helpfulness": "0/0", "author": "Peter Billups"}, {"rating": 5.0, "review": "Wife asked, \"What do you want it for?\" She uses it more than I do now. Great device. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Burgos"}, {"rating": 5.0, "review": "very nice, good product. All the especification rigth. i really like the product and the function in general. all the star", "verified": true, "helpfulness": "0/0", "author": "Terepaima"}]