[{"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Bill Parfenchuk"}, {"rating": 5.0, "review": "I was used to the clunky, slow operation of my smart TV and Google Tv. Cautiously I went for the Fire TV and was very impressed at its smooth speed and easy set up. I did not think I would be a fan of the voice control, but I love it! It is quick and precise. Easy to recommend this devise.", "verified": true, "helpfulness": "2/2", "author": "Chuck"}, {"rating": 5.0, "review": "You don't need cable if you have the Fire TV!", "verified": true, "helpfulness": "1/1", "author": "Anne F. Dhein"}, {"rating": 5.0, "review": "FireTV is pretty awesome!", "verified": true, "helpfulness": "0/0", "author": "Rahiem"}, {"rating": 4.0, "review": "Very happy to have Amazon Fire Tv in our home. Bought this for my dad as a birthday gift and he really enjoys it. Main drawback is that he loves to watch youtube videos. The man will spend hours watching stuff off of youtube and I'm sure he would love to be able to have the voice search incorporated into the youtube app. I understand that there may be some restrictions in place but I must ask anyway if this is something that might be coming to the Fire Tv in the future? It would be an excellent addition to an already excellent product. Many thanks, Amazon!", "verified": true, "helpfulness": "1/1", "author": "Frank Escobedo"}, {"rating": 4.0, "review": "We have no cable, over the air or other TV.  This is our only option and our internet is only pretty high speed most the time, but nothing like super/true high speed.It works well and seems to not have to buffer too often.Have it hooked up to Kindle and so  can run things off that as well", "verified": true, "helpfulness": "0/0", "author": "Montana Hens"}, {"rating": 5.0, "review": "mainly just use it for prime but it does work well", "verified": true, "helpfulness": "0/0", "author": "Bluehelix"}, {"rating": 5.0, "review": "Kids love it - save me time in trying to find ways to entertain them constantly - We LOVE it!", "verified": true, "helpfulness": "0/0", "author": "TashaMonie"}, {"rating": 2.0, "review": "It's packed nicely in a petite box and feels really high end.  But I've spent hours and hours trying to get audio out of the optical out port and no luck.  And lots of random error messages and restarts along the way.  I am going to assume that something is defective with the unit that was shipped to me because it is neither playing video nor outputting sound correctly.  I can see the menus and I've updated the software and installed some apps, but nothing seems to work.  This would be a very slick unit if it worked AND if it supported more media formats.  Look closely at the media types supported and you'll see a lot of types that you might want to play back that are not listed.  My WDTV worked better, but then it died so I was hoping this could be the replacement.  Maybe not.", "verified": true, "helpfulness": "0/0", "author": "E. Hoffmann"}, {"rating": 5.0, "review": "Am enjoying the movies.", "verified": true, "helpfulness": "0/0", "author": "bjllama"}]