[{"rating": 3.0, "review": "It is better than the fire stick but, It glitches alot, Its still better than paying alot for cable. I would give it 5 stars if I could watch something smooth thru. I have the best cable internet possible literally for home and I still buffer.", "verified": true, "helpfulness": "0/1", "author": "Kimberly Legg"}, {"rating": 1.0, "review": "I'm not impressed. I bought the Fire TV because the selection on my cable TV was so utterly terrible. What I am finding withe the Fire TV is that ut has the same drivel, only on demand instead of scheduled. But my tastes are different from most people, I guess. I like opera, classical concerts, and well-made programs like Downton Abbey. But there's only so many times you can watch the few good programs available on Fire TV.  So for me, it's back to watching DVDs.", "verified": true, "helpfulness": "0/3", "author": "Engineering Geek"}, {"rating": 5.0, "review": "Great love it!", "verified": true, "helpfulness": "0/1", "author": "betharoony"}, {"rating": 5.0, "review": "its very nice it took me a little time to set it up but it was well worth the time. thanks mike", "verified": true, "helpfulness": "0/1", "author": "M. Reich"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Sdoran03"}, {"rating": 5.0, "review": "We had Netflix before Amazon and it was good, but Amazon Fire TV is great.  Glad we changed.", "verified": true, "helpfulness": "0/1", "author": "Margaret Kingsbury"}, {"rating": 5.0, "review": "I've watched movies, listened to music, uploaded photos and ran a slide show with music. Because my WiFi was far away I needed a booster but worked fine after that. Love it. Saved me $1,000 on having to buy a smart TV.", "verified": true, "helpfulness": "0/1", "author": "JAMES D KOENIGSBERG"}, {"rating": 1.0, "review": "Great", "verified": true, "helpfulness": "0/3", "author": "Sheldon Horowitz"}, {"rating": 1.0, "review": "i loved it at first but after six month it wouldn't power up despite trying different outlets, power cords and hitting the reset button. No warranty.... I'm just out of luck.", "verified": true, "helpfulness": "1/2", "author": "PeaceChild \"PeaceChild\""}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/1", "author": "L. Speights"}]