[{"rating": 5.0, "review": "Now I don't have to have an hdmi cable running to my tv from my laptop so less clutter for me which I like very much", "verified": true, "helpfulness": "0/0", "author": "lan sivertson"}, {"rating": 2.0, "review": "Plain and simple. Just doesn't work well with a lot of video streaming I play on my laptop. I gave mine to a friend to use with his smart phone.", "verified": true, "helpfulness": "0/0", "author": "Terry Eaton"}, {"rating": 4.0, "review": "I have an older TV with an HDMI port but none of the new 'apps' that are included on newer TVs (like my Panasonic 60\" plasma from last year). With Chromecast I have all those apps available now for the older TV AND can 'cast' my screen from my MacBook Pro to my TV. Because it's so portable I can move the Chromecast from my older bedroom TV to the new livingroom TV in about 1 minute (walking time) . My ONLY wish (which is why 4 instead of 5 stars) is that it had a browser platform for iOS. Yes, I can cast from my MacBook Pro but I can not cast from my iPhone or iPad. The Chrome browser for iOS is not REALLY a Chrome browser. This needs to be fixed. If that happens, Chromecast is UNSTOPPABLE to take over the consumer electronic market!!", "verified": false, "helpfulness": "0/0", "author": "J. E. McDonald \"Way2Funny\""}, {"rating": 5.0, "review": "Easy to install and easy to use.  You upgrade the apps on your phone or tablet to include the \"chromecast\" icon.  From there, you just press that button and you are casting to your tv!My tv has internet apps installed on it, but I find that Chromecast is easier to use that the preinstalled apps.One little thing I like a lot: when you leave your tv sitting on the Chromecast homescreen, your tv is displaying wallpapers while it waits for you to cast a video.  It will cycle through the wallpapers slowly, and they are all beautiful!  Plus, it displays the date and time.  There isn't a boring old home screen that you have to look at.", "verified": true, "helpfulness": "0/0", "author": "Noelle \"deal finder\""}, {"rating": 4.0, "review": "I think if I didn't already own a Roku, this device would get the coveted 5th star.  There's a couple reasons why it doesn't.  The first is the way you send content from your device to the player.  It's not as easy as it could be.  The second reason is that an android device is required to control it.  I would be nice to have alternative methods.", "verified": true, "helpfulness": "0/0", "author": "Ivan"}, {"rating": 5.0, "review": "Plugged it into the flat screen, your smart tv needs a usb port open to plug this in, then installed the ap on chrome browser. Found it in extensions. I have a fast connection so no delay.If yours is slow you might have a lag in play. I just push the google cast button on my tool bar and set the tv to the video channel  that matches the port I put the Chromecast in and it plays. I was able to minus the screen and watch the video while surfing on the computer still. I have a fast connection.", "verified": true, "helpfulness": "0/0", "author": "aaac service"}, {"rating": 3.0, "review": "I love Google Chromecast, this is my second purchase. While, this time the package of this product is very dirty. my first impression is that the product is used or has been returned by some else, while my purchase is new product. Any way, the product works, so I will keep it.As a loyal customer of Amazon, I suggest you don't send a product like that to your customer, you will lose the trust from us.", "verified": true, "helpfulness": "0/0", "author": "yoowoo"}, {"rating": 2.0, "review": "We decided to try this as a substitute for Apple TV, MAC users beware... will only work with Google Chromecast approved apps, will NOT work with Amazon Prime Instant Video, and the playback of Netflix to our TV was horrid. Will not play with Microsoft Silverlight extension (which is what most users of HD streaming video use on MAC) There was about a 5 second delay at all times from sound to video and often the reception cut in and out. And before anyone mentions wifi concerns... We had our computer, router, and TV all in the same room. Wifi reception was at 100%. Probably better for Android PC users. I'm going to spend the little extra and go for Apple TV.", "verified": true, "helpfulness": "0/0", "author": "RL"}, {"rating": 5.0, "review": "Love it, works very well. I now can watch movies from my phone on my TV. Everyone should have one", "verified": true, "helpfulness": "0/0", "author": "James Williams"}, {"rating": 1.0, "review": "Our Samsung flat screen TV is too old for this device to work. Check out the  sources you have before ordering.", "verified": true, "helpfulness": "0/0", "author": "Spice 42"}]