[{"rating": 5.0, "review": "Now i can just sit on my living room and watch whatever i want, and every day there are more apps available :) well done google!!", "verified": true, "helpfulness": "0/0", "author": "Nicolas"}, {"rating": 4.0, "review": "If you have a laptop and want to stream video or other content to your TV and have no other method of getting it there, then this little plug in and the software from google will assist you in doing it, without a lot of technical setup or knowhow.  The only criteria is that your laptop (or whatever you are using, I use iPads and iPods as well) is connected to your in-home wifi and your TV has a USB port.This means that you can stream all of those things that your DVD/Blueray player can't without having to purchase something that costs a fortune.  This is a very economical method to stream.", "verified": true, "helpfulness": "0/0", "author": "David G Swickard"}, {"rating": 2.0, "review": "Loved the picture quality, but unless you have HBO, HULU, or NETFLIX (which I can get with my Xbox or PS3) there really isn't any use for it.  Maybe in a few years they will make other sites available to watch movies on.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Budde"}, {"rating": 5.0, "review": "A challenge to set up but I'm an oldtimer.  Working now, it is an inexpensive and amazing connection to Netflix and other streaming sources.  I'm positive  V Stoltzfus", "verified": true, "helpfulness": "0/0", "author": "Victor Stoltzfus"}, {"rating": 5.0, "review": "I really like this Chromecast HDMI streaming media player.  I haven't learned all the capabilities yet but it has been good so far.  It comes with the appropriate cables, but it was not clear that the necessary cables came with it, so I purchased micro usb cables to go with it.  Had this been made clear I would have saved the price of the cables and would have been more pleased.", "verified": true, "helpfulness": "0/0", "author": "J. Hayes"}, {"rating": 5.0, "review": "I love this device. Just what I needed for my TV. It does require external power, which I didn't realize until after buying the product, but it hasn't been much of an issue.", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 4.0, "review": "I had it very quick, it's nice and easy to setup, I just hope it would work with Facebook someday.", "verified": true, "helpfulness": "0/0", "author": "A. Marquez"}, {"rating": 4.0, "review": "there is are issues with this..0- HTLM5 : live shows can not be played.1- screen saver is not always active.2- there is no TV list for most pages and apps. only youtube.4- apps are limited or designed s***ty like pandora is not saving your screen.other than that great product for the price....", "verified": false, "helpfulness": "0/0", "author": "Amir"}, {"rating": 5.0, "review": "I bought this for my son for Christmas and he yelled like a girl. He was so thrilled to get this gift. I can't write about it because I didn't use it he did, but if his reaction was anything valid to the product it is a wonderful gift.", "verified": true, "helpfulness": "0/1", "author": "Digna"}, {"rating": 3.0, "review": "I was hoping for more than just being able to play Netflix movies and Pandora though it is nice for just that functionality.  I'm sure they will develop more applications over time.", "verified": true, "helpfulness": "0/0", "author": "Matthew A Kreuzkamp"}]