[{"rating": 5.0, "review": "I am fairly tech savvy but I hate learning curves. This one had one issue, claims you can do from your computer. If you don't use a laptop or mobile device, good luck with that. But after going online to find out why it kept saying no wifi, found instructions from others to use laptop.. easy as heck and fantastic. I fell like I am now with the modern age!", "verified": true, "helpfulness": "0/0", "author": "DebraDownSth"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Daniel Lai"}, {"rating": 5.0, "review": "I bought this after a family member told me about it and I'm happy with it. You can watch Netflix, hulu, and many other apps. If you ask \"Isn't it like a smart tv?\" the answer is yes but it's better since you can use it on any tv that has an hdmi, and it isn't like screen mirroring so you can be on other apps while you are using chromecast.", "verified": true, "helpfulness": "1/1", "author": "userdude10"}, {"rating": 1.0, "review": "I don't find the product very useful", "verified": true, "helpfulness": "0/4", "author": "Omri D."}, {"rating": 5.0, "review": "What a cool device. I wish it streamed Amazon Prime, but Amazon has its own device now, so I can see how they aren't making it available. I can stream Amazon from my computer to the TV using the Chromecast app, but it's pretty clunky.", "verified": true, "helpfulness": "0/0", "author": "Mezzorama"}, {"rating": 5.0, "review": "We got this as a B-day gift at first, and we loved it so much, that we ended up buying a second one for our other TV! Use it every day, and it rocks!!!", "verified": true, "helpfulness": "0/0", "author": "Alejandra Rodriguez"}, {"rating": 5.0, "review": "Pretty awesome to addition to the family", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "RICARDO E MILLER B"}, {"rating": 5.0, "review": "Work like a charm with great discount.", "verified": true, "helpfulness": "0/0", "author": "Thi Lieu"}, {"rating": 1.0, "review": "its junk and it works poorly, screws up my internet, the audio follows the video when it DOES work, I went back to a hdmi cable, save your money", "verified": true, "helpfulness": "0/3", "author": "fred flintstone \"Bountyhunter\""}]