[{"rating": 4.0, "review": "I found it is a good device for people who want to cast programs to their big screen TV.  If you have a duel graphics card on your PC, you would not need this device, as you can already use the TV as an extra monitor.  For your cell phone it works great.  I also found that it will cast when I set my TV for my X-box.  It will alow me to cast other sites(than Netflixs or You Tube), my videos and music from my cell phone.  I do not have an I pad.  I do not know how it works.  The one thing I cannot figuar out is how to cast from my PC.  I can see it growing in usefulness.", "verified": true, "helpfulness": "0/1", "author": "T. Becker"}, {"rating": 5.0, "review": "This is not something I needed, just had to have, here are a few justifications -- and how the device has performedWhen streaming content in any room, or even on the road, when I find that I have enough time to relax and view media I attach Chromecast to any HDMI port, and I am viewing on full-screen.  This has allowed for the removal of two devices which were simply cluttering space, and unused until time permitted.  On the road, while visiting family I have used the device to share media and it performed flawlessly, it has been connected to it's home network, public wiFi and my mobile hot-spot, all with excellent results.  While not in use the device takes less room to store than a remote presenter, less space in my gear bag than a granola bar, and yet allows me to view and share content.  The Chromecast is easy to set-up, extremely easy to operate, and does exactly what it is designed to do...", "verified": true, "helpfulness": "1/1", "author": "Tom Coles"}, {"rating": 4.0, "review": "Simple to install and use but only streams video from predetermined apps.  Should be able stream any video from my phone, tablet or laptop.After some online digging found a way to stream screens from Google Chrome browser after adding a Chromecast extension to the browser.  Note streaming static screens to my BSTV was okay but streaming videos from Chrome was not - - jerky/halty video stream from Chrome still does no fix the problem.  I should be able to stream ANYTHING from my laptop to Chromecast.", "verified": true, "helpfulness": "1/2", "author": "Jim U'Ren"}, {"rating": 5.0, "review": "This is one of the best Tech devices I've bought in a while. Works beautifully.What didn't work? * On my TV (which is a bit dated), the chromecast cannot automatically turn the TV on. But it could be my TV's fault. Anyways, It doesn't really matter that much.What would make it better? * Ethernet input for wired Internet connection * 5G wifi capability.", "verified": true, "helpfulness": "1/1", "author": "Hadi \"Hadi\""}, {"rating": 3.0, "review": "Beyond saying it works I find very little desire to use it much.The functions are quite limited and the response seems sluggish.Considering the modest cost it's a very amazing device. Perhaps the hype exceeded the results.", "verified": true, "helpfulness": "1/2", "author": "Howard Cornish"}, {"rating": 1.0, "review": "My dad got this for me as a gift.  I set it up and it worked great, the first day.  The next day, it would tell me it was connected to a blank wireless but couldn't access the internet.  I checked with my wireless router and saw that it was on the proper network (but it thought the network name was null), and had an IP.  But it wouldn't work.  And the Chromecast app couldn't connect to it either.  It was essentially dead and useless.  Total POS.Oh, and if you have a Mac, you don't need it.  Just get an HDMI cable and connect your laptop straight to your TV (you can even go into Audio settings and send audio to the TV as well)", "verified": false, "helpfulness": "1/3", "author": "Digant C Kasundra"}, {"rating": 1.0, "review": "I already have YouTube and Netflix on my Vizio TV. What purpose does this Chromecast serve? Hurry up with updates.", "verified": true, "helpfulness": "4/7", "author": "S Kleine"}, {"rating": 2.0, "review": "I guess I  was expecting something more like Apple TV but even with that aside, the resolution is very poor and reading on line content can be difficult.  Was reviewing for teachers and it will just not work well enough for them.........", "verified": true, "helpfulness": "1/3", "author": "David Childers"}, {"rating": 3.0, "review": "It works great with youtube, netflix and basic web browsing, but not Amazon. Nor is it compatible with the Kindle Fire HD.", "verified": true, "helpfulness": "1/063", "author": "norseman \"svalbard\""}, {"rating": 5.0, "review": "I'll begin with some reference; I haven't purchased cable tv in over 10 years, so watching Youtube, Netflix, ect are quite normal for me.Allow me to cut right to the chase- it works flawlessly.  This device allows you to broad\"cast\" your media to a television.  The easiest way to do this is from your laptop or device using netflix- just click on an icon (square with \"wifi\" looking curves in the corner).  It will ask you which device and it will list the name.  Using the Chrome browser, download the extension from the web app store, then click on the icon to broadcast the page.  Set up was a breeze, just follow directions.  I set it up using a Macbook air; I downloaded the chromecast setup .dmg file, opened it, followed the instructions.  Within 30 seconds of opening the program the chromecast was ready.On Apple devices: everything comes up automatically, click on the chromecast icon to broadcast.  This will not tie up the device, you can watch on the tv while doing anything else on your iPhone or iPad.On Android devices: As with Apple devices, everything is automatic, just click the icon.  Today on my old Nexus 7, I broadcasted Youtube videos for my kids while I checked my email.Laptop and desktop computers (Mac, Linux, that other one): Using the Chrome browser, just click the icon to broadcast to the device.  The cool thing is that you can broadcast one tab and leave the others out.  So you can type an email on your laptop while another page/program is being broadcasted.Windows: I don't have any Windows devices or computers, but I read that it is NOT supported on Windows Phones.  I would expect a Windows laptop or desktop to work just fine with this as long as you are using the Chrome browser.Pros:The picture is wonderful- full 1080p.  The sound is crisp and clear.Such an easy device to add to your life if you are accustomed to watching tv online.  Netflix works without any trouble at all.It's small and very portable.Con:The device must be \"plugged in.\"  A provided micro USB cable plugs into the rear of the chromecast and must be plugged into a USB port.  The simplest method is to plug it into a USB port on the tv.  It comes with a USB adapter for an outlet and a long USB to micro USB cable.This will not run on networks that have AP/Client isolation.  That means that this won't work in some (more complex) network environments.  A standard network is what this is made for; wifi networks that require a web authentication (i.e. you put your username and password in a browser) will not work.  See the google page on the chromecast for more information.I tried using the Chromecast to broadcast my email page, there was lag while I was typing.  I would type and a second later it would appear on the screen.Also, the device gets warm.Overall: Fantastic device, I think I'll buy at least one more.", "verified": true, "helpfulness": "0/1", "author": "LinuxMan03 \"Jib\""}]