[{"rating": 5.0, "review": "Google never ceases to surprise me. This is one company that slowly keeps doing what it does best - make people's lives so much better with its amazing products. When other companies out there are coming up with boxes (Roku, TiVo etc.) and what not that they want you to connect to your TV (which is probably already bearing the weight of a ton of other boxes), Google understood exactly what a consumer needs - and that is less confusion. The device promises casting content that is displayed either on your web browser or Chromecast-participating apps (the list will keep growing) to a TV with ZERO hassle. Let me repeat that again - ZERO HASSLE.", "verified": true, "helpfulness": "2/3", "author": "Ven"}, {"rating": 5.0, "review": "Brought the Google Chromecast to provide us the option to watch streaming movies/shows without having to install a DVR. Still learning all the capabilities and options available to us.", "verified": true, "helpfulness": "2/3", "author": "JimmyMac777"}, {"rating": 5.0, "review": "Best $35 dollars I ever spent. Keeps getting better as more people develop for it! It turns your phone, tablet, or computer into a smart TV remote.", "verified": true, "helpfulness": "2/3", "author": "Chris"}, {"rating": 4.0, "review": "I like the product, but Google needs to step up with having more software capabilities associated with it.  The web casting is choppy but I don't know if it is the device or my WiFi system.", "verified": true, "helpfulness": "1/1", "author": "R. Duffy"}, {"rating": 4.0, "review": "It's very effective and cheap.  Great for cast Youtube and Netflix in our TV. It would be better if I could use it to cast my photos and video in my computer.  Maybe for next version", "verified": true, "helpfulness": "2/3", "author": "Antonio Cabrera"}, {"rating": 4.0, "review": "It works effortlessly!  The only draw back is with the limited usage,  only YouTube, Netflix and hulu. It would be fantastic if all things pulled up on Chrome could be cast to Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It would drop WiFi occasionally. The WiFi signal was not great where it was located, but it was far from weak. Relocated to a room with a full signal strength and it worked fine.", "verified": true, "helpfulness": "1/1", "author": "Todd Clark"}, {"rating": 5.0, "review": "It already is an indispensable tool if you have Netflix/Hulu but it continues to become more useful and will add more functionality at a impulse buy price.", "verified": true, "helpfulness": "1/1", "author": "Aja"}, {"rating": 5.0, "review": "Bought 2 of these so I could test this device for a client.It was simple to set up once I plugged it into USB & HDMI ports on the LCD TV and the TV on screen instructions were easy to follow via my Galaxy III phone, using my netflix account I was to watch any program.Great product for the price, this means I can now disconnect my PC from the TV that did the same function.", "verified": true, "helpfulness": "2/3", "author": "Donald E. Blowes"}, {"rating": 4.0, "review": "The only reason I didn't choose 5 stars is that it isn't usable with amazon instant movies!  If it did it would be perfect.", "verified": true, "helpfulness": "2/3", "author": "Bargain Hunter"}]