[{"rating": 5.0, "review": "Like the subject says, at a small cost I can stream my favorite shows and movies at Netflix.  Watching my family's videos via youtube on the big screen is great.", "verified": true, "helpfulness": "0/0", "author": "DANILO GUIAO"}, {"rating": 4.0, "review": "The price is great and it works as advertised for Netflix and YouTube.  No issues there.Putting other webpages on your tv is sometimes hit or miss but should only get better as more companies get the software and work with Google.", "verified": true, "helpfulness": "0/0", "author": "MWood"}, {"rating": 1.0, "review": "I  have  been  watching  NetFlix  for  years  on  my  DVD  to  flat  panel  set  up  and  movies  on  Amazon  Prime  on  the  iMacI  thought  the  Chromecast  might  be  an  option  when  traveling  but  have  NOT  been  able  to  get  it  to  work  on  my  Samsung  flat  panel .  It  comes  up  with  a  code  and  tries  to process  it  but  always  comes  back  with  an  \"ooops  error  message\" .Been  too  busy  to  deal  with  it  so  I'm  back  to  streaming  on  the  LG  player .", "verified": true, "helpfulness": "2/4", "author": "knobe"}, {"rating": 5.0, "review": "So easy and quick to setup and get running. Very easy to use. It's streamed everything from netflix without an issue and in HD.", "verified": true, "helpfulness": "0/0", "author": "Harvey  Floyd Jr"}, {"rating": 1.0, "review": "I guess I didn't do enough research before I purchased. I thought this would be bl to replace my apple  tv. I also thought this would be the best device if going to a friends house to plug in and show pictures from my device.", "verified": true, "helpfulness": "2/5", "author": "tom wisnowski"}, {"rating": 5.0, "review": "So cool to be able to view youtube on the tv with such ease. Hopefully more content becomes available to stream via the Chromecast, but for now at $35, its worth it just for youtbue (and netflix and google play).", "verified": true, "helpfulness": "0/0", "author": "Canon Fazenbaker"}, {"rating": 1.0, "review": "This product promised to work with my TV and computer, but it would not connect.  I tried many times to contact Google, but no one could help me over the phone.  I was transferred around a million times, and finally they told me to contact my ISP.  They hadn't even heard of a Chromecast.  Bad service and a product that just doesn't work.  Stick with Roku.", "verified": true, "helpfulness": "15/21", "author": "Robert M. Kennedy \"hoosier nut\""}, {"rating": 4.0, "review": "Just wish there were move apps on board.  Love to see amazon prime instant video app!!!!  Other than that the thing has works perfect.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Became my most used multimedia gadget! Simple, intuitive and great value for money! We stopped watching telly and moved to YouTube and Netflix entirely.", "verified": false, "helpfulness": "0/0", "author": "Holger"}, {"rating": 5.0, "review": "Use with my iPad…Stream YouTube…Superb….Short coming…Need more content partners…My AppleTV…an order of magnitudeof choicesnot yet available with Chromecast…", "verified": true, "helpfulness": "0/0", "author": "Manuel T. Ortega \"Manuel\""}]