[{"rating": 5.0, "review": "By far the best multimedia device you can get for your TV if you own an android device.", "verified": true, "helpfulness": "0/0", "author": "Esther Lee"}, {"rating": 1.0, "review": "Junk - Keeps disconnecting, chromecast app is poorly done, chrome crashes when I cast the desktop, the video off my NAS has to go to my laptop and then to the TV using too much bandwith. Just buy a tv with the features built in", "verified": true, "helpfulness": "0/1", "author": "Andrew L."}, {"rating": 4.0, "review": "I would've given this product 3 stars if not for the price. If I am streaming from my laptop, I can't really use any additional web apps on my computer without interfering with the chromecast stream. Every three or four uses, the chromecast needs to be reset for some reason or another. Streaming Netflix from my iPad is a pain, because a lot of times the play controls won't appear on the app while it is casting (though they are supposed to). I still use it a lot though, and I'd say maybe 2 out of every 3 attempts are issue-free, now that I know the limitations.", "verified": true, "helpfulness": "0/0", "author": "Morgan"}, {"rating": 5.0, "review": "Love my chromecast! took about 5 minutes to get set up and connected to my devices! Streams Netflix, Hulu, Watch ESPN and Plex in High quality HD. I've had 2 instances where the sound came out of my laptop and not my tv while streaming but after restarting the app, the problem was resolved. The device can be powered by connecting it to your tv's USB port if it has one which keeps the cord management and outlet management to a minimum.", "verified": true, "helpfulness": "0/0", "author": "Mike D"}, {"rating": 3.0, "review": "I bought it when on sale just to check it out. I know exactly what it's supposed to do so expectation was realistic. After using it for a few days I no longer touched it. I guess the main issue I have is that I still consider it a novelty more than anything that's truly practical (for me at least). The fact that it requires a second device in order to function is my main beef. Personally I would always just go for an Android TV stick with HDMI, much more capable and with installation of some apps you can pretty much do what Chromecast can do. Of course TV sticks are a little bit more expensive, but you can catch them for $40 on sale.", "verified": true, "helpfulness": "0/1", "author": "webmania"}, {"rating": 5.0, "review": "Works exactly as I expected. I don't need something super fancy. Just something to watch Netflix, YouTube,  Google Play videos, and stream Pandora. I love it and use it every day!", "verified": true, "helpfulness": "1/1", "author": "Sara Ferguson"}, {"rating": 5.0, "review": "Best thing i've bought since my Motorola v3", "verified": true, "helpfulness": "0/0", "author": "Augusto de Souza Carneiro"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Willis D Speck"}, {"rating": 5.0, "review": "It has been almost a year since I bought this, I bought it with this in mind \"It's a google product, it's probably something Google wants to try to see if it would work\", so it's $35, I'll pay $35 to beta test this toy.  At first, I did a few youtube and hulu plus with it and there is really nothing else I could use it for.  Hulu Plus was easier with my roku than chromecast.  Then couple months later, there were plex support, so suddenly I can watch all my home video collection with this thing.  Then later, there is popcorn times support, so this chromecast is just becoming more and more useful to me.I can see how this can be completely useless, but to me, this $35 is one of the best $35 I spent.", "verified": true, "helpfulness": "1/1", "author": "Ed Tse"}, {"rating": 5.0, "review": "Incredibly useful, though not quite as amazing as I had originally thought. You need to set them up at first to get them on your home wireless network. This, which while easy, means it's not quite as convenient as being able to pack it up with you and move locations (friend or family's home) and stream right out of your pocket. It is simple enough that if you need to do that, however, it could be done with just a few minutes setup. The app paired on my phone works like a charm, and the only time I've ever experienced lag was when casting my screen directly without the app having the capability built in. Netflix, Hulu, and Youtube all have native casting support, which works great. The ease of use combined with the price means I'll be buying another at some point to keep around as either a spare gift, or a useful tool that's in reach.", "verified": true, "helpfulness": "0/0", "author": "Thomas A. Martin II"}]