[{"rating": 5.0, "review": "Extremely easy to setup and worked as expected with no hesitation in receiving the wireless signal.  The benefit of Fire TV versus Fire Stick is the Fire TV remote has voice commands.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 3.0, "review": "NOTE: The FireTV is a pretty cool device for the money, however, if you have an older HD set (like my Fujitsu plasma in the bedroom) this might not work well for you. The box only outputs 1080P or 720P and the old Fujitsu doesn't play well with either of those resolutions. If you have a newer TV you're golden, just be aware that this box does not  output 480i/p or 1080i  Perhaps a firmware update might come along to fix this?", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 5.0, "review": "This is a great addition to anyone who likes watching TV and/or playing games, and/or listening to music. Amazon's selection and support is noteworthy and the unit works perfectly. The ease of finding just the right program or movie is further enhanced by the voice feature, where you just say the name of the movie or program and it pops up on the screen. Nothing could be easier. I am thrilled with this newest innovation from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Robert's Review"}, {"rating": 5.0, "review": "We love the Amazon Fire TV!  It is very easy to use and to search for things.", "verified": true, "helpfulness": "0/0", "author": "Michelle Leed"}, {"rating": 4.0, "review": "It's really pretty neat, handles the voice commands very well. I really haven't got to know it real well, yet, but s0 far, so good!I gave it only 4 stars cause it bothered me It went on sale for 30 bucks less just days after i purchased it!", "verified": true, "helpfulness": "0/0", "author": "Matthew Irion"}, {"rating": 5.0, "review": "The fire tv works great. It is fast with no lag. I highly recommend this. I am using kodi on this device and it works great.", "verified": true, "helpfulness": "0/0", "author": "Armando Sandoval \"Damus\""}, {"rating": 2.0, "review": "I like it but its slow on buffering. Thought I would use it more but find my self going back to my computer", "verified": true, "helpfulness": "0/2", "author": "Enrique Ayala \"/XP/BIG!/XP/\""}, {"rating": 1.0, "review": "Stopped working after 3 uses", "verified": false, "helpfulness": "1/4", "author": "Christian Amechi"}, {"rating": 1.0, "review": "I purchased this, and a day later it is on sale for $21 less than what I paid for it. I'm sure I'll love it- but having been an Amazon Prime member from the beginning- they should have given prime members first access to the sale. A little pissed.", "verified": true, "helpfulness": "2/7", "author": "daniel podobed III"}, {"rating": 5.0, "review": "It is great. I was able to install it in five minutes and start watching right away. I love the easy access to all the features. Definitely will tell family and friends to buy it.", "verified": true, "helpfulness": "1/1", "author": "Lauri Forbes"}]