[{"rating": 5.0, "review": "This is one of the easiest apps I have installed.  Also I use it daily. Makes changing rooms easy and saves me all the dollars I was spending on HBO SHOW TIME STARR'S MOVIES", "verified": true, "helpfulness": "0/0", "author": "ANDREW E TURNAUER JR"}, {"rating": 5.0, "review": "The Chromecast is the easiest piece of AV equipment I have ever used.  Perfect for presenting and streaming media! Get one today you won't regret it.", "verified": true, "helpfulness": "0/1", "author": "Dennis L."}, {"rating": 3.0, "review": "Good device and idea but there are still only a few applications that support it. If you are a hard core netflix user and dont have set top box, its a great deal.I was hoping to use it while traveling as most hotel TV's have HDMI.. Unfortunately, that wont work as the device cant connect to hotel wifi and it needs to connect to the Internet to function. Silly design decision.", "verified": true, "helpfulness": "0/0", "author": "ATL MCW"}, {"rating": 4.0, "review": "Error messages on the configuration were a little lacking. A code and short message & googling it didn't help.Look for more services being hookup'd.", "verified": true, "helpfulness": "0/0", "author": "Frank Fisk"}, {"rating": 4.0, "review": "I really have enjoyed my Google Chromecase.  I can wait until I am able to stream more movies selections from other providers.", "verified": true, "helpfulness": "0/0", "author": "VPrStMn"}, {"rating": 3.0, "review": "It worked with my phone wifi, but not my home wireless router, so i havent really used it yet. Hoping to get a new wireless router at home so it actually works. Idea is cool.", "verified": true, "helpfulness": "0/0", "author": "Mike Gee"}, {"rating": 3.0, "review": "This needs more apps.  I don't use it that much.  Glad it was cheap.  It was easy to setup.  Can't wait for new apps.  Let's go.", "verified": true, "helpfulness": "0/0", "author": "Steven C. Smith"}, {"rating": 4.0, "review": "Not able to make work yet. No problem with unit.  I need betted instructions.Is there more information on line?", "verified": true, "helpfulness": "0/0", "author": "Michael Yager"}, {"rating": 5.0, "review": "It works well with the phone specially for streaming youtube content to your TV in HD. Netflix also works well. Depending how fast is your connection and how new is the phone it will behave faster or slower. I  have the Motorola Razr Max and so far, so good.For the price is a great deal.", "verified": true, "helpfulness": "0/0", "author": "Pacos"}, {"rating": 4.0, "review": "Needs more app compatibility to really take off but it works wonderfully for $35 device. Really waiting for ability to playback local media and from phone and to sign in to networks requiring username and password.", "verified": true, "helpfulness": "0/0", "author": "Sean"}]