[{"rating": 5.0, "review": "Really easy to install and works flawlessly with my laptop, android phone and iPad. Totally worth the money spent especially with 3 months of Google Play Music All Access for free.", "verified": true, "helpfulness": "0/0", "author": "TheRaj"}, {"rating": 5.0, "review": "It can be a little technical to setup but once set up, it runs really smooth and ready to use.", "verified": true, "helpfulness": "0/0", "author": "Logic Rox"}, {"rating": 4.0, "review": "Can be tricky to set up if your wireless router is not compatible automatically.", "verified": true, "helpfulness": "0/0", "author": "Jeremy G."}, {"rating": 1.0, "review": "Do not waste your time if you have an Iphone", "verified": true, "helpfulness": "0/0", "author": "Amaz User"}, {"rating": 5.0, "review": "I can't say enough good about the Chromecast. I have enjoyed every minute of its use and it has made a huge difference in the way I use my TV.", "verified": true, "helpfulness": "0/0", "author": "Jason732"}, {"rating": 5.0, "review": "Easy, cheap, quick, fast", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 4.0, "review": "Great to be able to stream anything from laptop to TV. Shame that a lot of websites require the laptop to remain on, however. First one lost it's connection a lot, but second one works like a charm", "verified": true, "helpfulness": "0/0", "author": "jaybob"}, {"rating": 5.0, "review": "Love my chromecast! I use it for you  tube a lot. I pull up workouts from my phone and am able to see them on my tv!  It's so nice to have and a good price! Also very simple to use!", "verified": true, "helpfulness": "0/0", "author": "Brook Jones"}, {"rating": 1.0, "review": "Will not work with my laptop.", "verified": true, "helpfulness": "0/0", "author": "shaun"}, {"rating": 5.0, "review": "Got a second one after my toddler broke the first. Works fine and is easy to use. Very convenient. If only i could stream prime on it but i know thats not chromescats fault. Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"F. Fong\""}]