[{"rating": 1.0, "review": "Biggest piece of crap ever!  Save your time and money and get a different device.  Maybe Amazon or roku.  Not even worth 1 star.", "verified": false, "helpfulness": "0/1", "author": "Cory Howard"}, {"rating": 5.0, "review": "SO EASY!  Way cheaper than buying AppleTV to watch Netflix.  Love this!", "verified": true, "helpfulness": "0/0", "author": "Jeannie Robbins"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Giorgos"}, {"rating": 5.0, "review": "Love to watch netflix on tv", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 1.0, "review": "I returned the first one and the 2nd one did the same thing. It works GREAT for one day, then it won't hold the connection. I also got new wifi twice believe or not with different companies and routers (was having issues), once during first product and once with  2nd product, and again it worked great on first day (enough for you to think, oh it was the wifi problem) and then realize on Days 2+, oh no, it is the device. Concept is great of course, delivery is not.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This thing is worthless when it comes to casting video - jumpy, drags, freezes, in a word worthless.. I have a fast router and 25mbps fast internet. Save your money.", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Melissa Y. Edwards"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "E C MOM"}, {"rating": 4.0, "review": "Very happy with this.  Very stable and great price.", "verified": true, "helpfulness": "0/0", "author": "DOUGLAS RYAN CHENEY"}, {"rating": 5.0, "review": "At first, I thought I would never use this as I have a PS3 that serves as my media center for all my streaming services: Netflix, Hulu, etc. However once I started using it, it's hard to go back to the PS3. I initially bought one of these right after they released and it has only gotten better. My wife and I now use it to cast Netflix, Hulu, WatchESPN, HBOGo, Google Play Movies and Music, YouTube, Twitch, PocketCasts (for Podcasts), Chrome browser windows, Ultraviolet movies via Flixter/Vudu, etc. It's so easy to use. Perhaps the coolest use is that when visiting friends and family that own Chromecasts, I can simply use my phone that I always carry with me to stream anything from my cloud services that support Chromecast without having to carry physical media around! Additionally, more and more apps keep adding support. The biggest name video provider not supporting Chromecast is currently Amazon, and it's unlikely they will release Chromecast support for their apps since they came out with the Fire TV and Fire TV stick (although in a surprise move they recently released an Amazon Video app for Android Phones, so it COULD happen one day). So if you're invested in Prime Movies, this probably isn't the choice for you. For just about anything else, however, it's golden.", "verified": true, "helpfulness": "0/0", "author": "Chris"}]