[{"rating": 5.0, "review": "I have HBO, and I find it very hard to watch HBO GO on the computer. Now I just hit the broadcast button on my Chrome browser and watch it on my TV. I can also run it from my Kindle, iPhone, and all of my tablets.Worth the money spent.", "verified": true, "helpfulness": "0/0", "author": "Danny Boy"}, {"rating": 5.0, "review": "Perfect setup and interface. It's extremely easy to use, and an incerdible value for the price. Highly recommend you buy one!", "verified": true, "helpfulness": "0/0", "author": "Stephen Fischer"}, {"rating": 5.0, "review": "This is just one of those gadgets you need to have.  The picture and 5.1 sound are excellent with it plugged into a home theater HDMI port.  The set up was easy, and to control it with a phone is just hard to appreciate without actually seeing it work.  Then we moved it to a second TV, and used it through that TV's speakers.  Flawless with no additional setup required..  I paid $35 for it, and it was worth it.  I've seen it advertised now for $29.99.  If you have a TV with an open HDMI port, spend the money. The cool factor alone is worth it. Oh, and it broadcasts Netflix really well as a bonus...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "While the Google Chromecast is gradually improving the number of services, it seemed that the Chromecast development is heavily driven at streaming paid content or tagged with advertisements (i.e. YouTube) but I'm okay with that.What I'm not okay with is the fact that this device could do a lot more such as streaming of my personal content from my phone and tablet to my TV.What I'd really like to see:Content mirroring within more Google apps at least.i.e.: QuickOffice (Mirroring presentations?), Google Drive, Google Maps, Plus etc.Final thoughts: This device is largely tied to video streaming services. If you love things like Hulu, you'd like to have this device. However, if you're looking for a device for screencasting/content mirroring, we're probably still years away though I really hope Google adds these to the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Encrypted11"}, {"rating": 5.0, "review": "Easy set up even for a senior like me. Bought a second one. Toured Russia and France. Watched lots of history. Great gadget . Worth every penny. Don't forget the great photos on the screen between shows. Better then our Roku.", "verified": true, "helpfulness": "0/0", "author": "Sebastion inlet"}, {"rating": 4.0, "review": "in order to stop paying the cable co, i wanted to use this. still waiting for google to approve more content providers, but works great", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A. Duley"}, {"rating": 5.0, "review": "This rating is based on the reaction of the gift recipient, and not on the functionality of the unit.  He really liked the gift and it even arrived on time Christmas Eve.  So I am happy.", "verified": true, "helpfulness": "0/0", "author": "William V White"}, {"rating": 4.0, "review": "For the first roll out of this product, it's not bad indeed.  Works pretty well as advertised and the convenience of operating it from your tablet without needing a remote (such as with the ROKU which in itself is also a good unit) is very convenient.The downsides (why it didn't yet get five stars) are that it hiccups occasionally which is somewhat expected over wireless and there are not yet a broad spectrum of services to use on it.  I am not a big fan of Netflix as their available selections leave a lot to be desired for the most part and will be far happier with it once other applications are available.", "verified": true, "helpfulness": "0/0", "author": "10 Ring \"live2fly1\""}, {"rating": 4.0, "review": "I bought this primarily to test it out and play around with it. My SmartTV already has YouTube, Netflix, Hulu, etc. so I don't necessarily need this stick for it, but at $30 I could not resist to give it a try.", "verified": true, "helpfulness": "0/0", "author": "TechGeek \"TXcrude\""}, {"rating": 5.0, "review": "I live in Dominican Republic, which is why I limited by region, but I have youtube, netflix, tv viki redbull and everything works great, buy Avia application to play local content ... what I see is that people buy the product and do not know what does. works as advertised and I do not see any problem ... I'm happy with my purchase. hopefully more apps and google some native application for playing local content.", "verified": true, "helpfulness": "0/0", "author": "eltuti"}]