[{"rating": 5.0, "review": "Easy to use, quick setup, small enough to acrry on trips, works on all my tv's and computers good choice", "verified": true, "helpfulness": "0/0", "author": "Felipe Leyva"}, {"rating": 1.0, "review": "Does`not work with IOS devices. The app on the apple store to make it work doesn't exist. Waste my time and my money.", "verified": true, "helpfulness": "2/4", "author": "CARLOS BARATZ"}, {"rating": 4.0, "review": "Great idea. Beautiful item.Not play my local hard drive multimedia from PC. Maybe late???thanksIstván from Hungary..", "verified": true, "helpfulness": "0/0", "author": "Kanicska István"}, {"rating": 5.0, "review": "I ordered this for my dad because he likes showing everyone videos and pictures he finds around the web. The great thing about this is that now we don't have to walk over to his laptop or have him take it to the diner table.It works great and anything to everything shows from the laptop to the tv. He only had it for a day and already knows how to use it like a pro.It's very easy to set up with very little time.I can stream flash videos from Newgrounds with little to no lag.I will be buying another one soon for my self and as a gift to a friends & family for their birthdays.", "verified": true, "helpfulness": "0/0", "author": "Vega"}, {"rating": 4.0, "review": "What a great product:  Easy setup, does exactly what it says.The only negative of this is it does not work on splash page protected wifi networks (like those in hotel rooms). This is because those networks require you to open a browser and enter credentials or accept the Terms and since Chromecast doesn't have a true browsers it won't work on these networks.", "verified": true, "helpfulness": "0/0", "author": "Eric Meysenburg"}, {"rating": 3.0, "review": "it works but not great. I have a EA3500 Linksys router which I believe is just find because it works with my other devices in the house, ie, tablet, smart TV, Xbox. It buffers a lot and that is frustrating. I took everything off the network thinking it needed more bandwidth...NOT! maybe there is something I'm missing, but not sure. If anyone can help me, it would be great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It does all that it promises very well without any issues. Love the fact you can get Netflix, etc.. up and running very quickly. And only for $35. Great little product", "verified": true, "helpfulness": "0/0", "author": "Victor Herrero"}, {"rating": 4.0, "review": "The chromecast works (most of the time) as intended but as of the writing of this review it does not have much support.  While using a tablet to put Netflix on the TV with chromecast it does allow you to do other things on the tablet with Netflix still broadcasting to the TV in the background, so that's nice.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 2.0, "review": "Netflix videos constantly freeze, especially when casting from iPad. Before anyone tries to blame the wifi or internet connection. I run speedtest from iPad and other devices with results of atleast 15 Mbps up and 10 Mbps down. Hopefully Google will work out the bugs in their software and get this device working correctly.", "verified": true, "helpfulness": "0/0", "author": "Bug Hunter"}, {"rating": 5.0, "review": "This is the best unit, not just for the money, but period. I have had rokus, logitech revue, WD Live, etc. and this is my go-to because the interface is your phone, tablet, and laptop-all of which you understand and like (otherwise you wouldn't have them!). No more nonintuitive menus, clunky remotes, or unresponsive buttons.Pros:-interface is your chosen device rather than having another darn remote-small, compact size means I can finally put TVs in my kitchen and bathroom where there is no room for a roku or similar. I can have just the TV hanging on the wall without a bunch of junk-fast, responsive, and easy to set upCons:-Netflix does not auto-play, but I assume they will fix it-Still requires USB power since HDMI does not supply power.-You're in google prison, but you probably are anyway.-Limited cell phone support. Pretty much only netflix, google movies, etc.", "verified": true, "helpfulness": "1/1", "author": "jeffrey"}]