[{"rating": 5.0, "review": "It was great. But I bought it as a gift not knowing the person already had something similar. I would have kept it for myself if I didn't already have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Tiffani E ."}, {"rating": 3.0, "review": "The Fire works great.  The problem is that you cannot get anything out of it without signing up for Prime.  I was unaware that \"getting access\" did not mean anything more than I could find movies/TV shows/etc. in which I needed to pay for to watch.  It is great with Prime, and I am still glad that I bought it.  I do think that Prime is worth it, but I would have appreciated knowing this going into my purchase. On another note:  I had Netflix prior to my purchase of the Fire, and I think I am going to keep it.  It is easier for my daughter to just continue using it when on the Fire.", "verified": false, "helpfulness": "0/0", "author": "William Cecchini"}, {"rating": 5.0, "review": "Absolutely amazing!!", "verified": true, "helpfulness": "0/0", "author": "luke gottsabend"}, {"rating": 5.0, "review": "This is my second purchase of the Amazon Fire TV.  I have cut all the wires to my cable and have not looked back or had any regrets.  I purchased the  Amazon Prime yearly deal for $99 which includes free movie rentals, games, music, ebooks and free 2 day shipping.  I also subscribe to Hula and Netflix which cost approx. $20 a month for both.  The Amazon Prime averages approx. $9.20 a month.  So I pay about $40 a month for more movies and tv shows that I could ever watch, plus the ebooks and music as a bonus.  Yes, this is a no brainer for people who are on a budget and whose only entertainment is internet and cable.  I should also add that if you sign up for Amazon Prime, you should check for new apps and games every couple of weeks.  I have added sever free movie apps and games that we absolutely love.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"SNAPPYSCRAPPER\""}, {"rating": 2.0, "review": "Not impressed with the movies and TV shows available on prime.", "verified": true, "helpfulness": "0/1", "author": "Christian"}, {"rating": 2.0, "review": "I had a roku for about a year. So far I'm finding that FireTV has a lot better features.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "Great Product. Easy setup and simple operating  remote.", "verified": true, "helpfulness": "0/0", "author": "Tim Shields"}, {"rating": 5.0, "review": "Works much better then other media players like roku. The voice remote is very cool.", "verified": true, "helpfulness": "0/0", "author": "jim allard"}, {"rating": 4.0, "review": "Do far I'm really liking my fire tv!", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 5.0, "review": "Amazon fire TV. Simply fun!!", "verified": true, "helpfulness": "0/0", "author": "Samuel Miller"}]