[{"rating": 3.0, "review": "I like the concept and I really want to support Google Chrome. I like the interface and the ease of use.However, there is still not enough content available through Chrome Cast.For a few dollars more, I have come to prefer the Roku Stream Stick. Lot's of content available and is compatible with all my mobile devices.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 3.0, "review": "Not as good as advertise", "verified": true, "helpfulness": "0/0", "author": "Emilia G. Almeida"}, {"rating": 5.0, "review": "this is one of the best things google has ever come up with, $35 to turn any TV into a smart TV? i use this all the time, for just about everything i watch, and i watch plenty of things from hard drive too, that part is a little more complicated than getting netflix and youtube running on this thing, but if you're the type who streams video from their hard drive to other devices, chances are you won't find it any harder to do with the chromecast. i bought bubbleUPNP from google play for like $1 or something, and that pretty much does all the work for your hard drive streaming, but there should be alternatives that don't cost anything. and don't forget that the app base for this is growing, hbogo supports it, espn just started supporting it not too long ago, and any video you can watch in your google chrome web browser can be casted to your tv, although in some cases there are some frame rate issues.also some people who already own an xbox 360, or xbox one, or ps3 might not find this worth it, as most of the main chromecast apps are already on these platforms. however, i own an xbox 360, and i even use this on the same tv, i just find the chromecast easier to use, and i like being able to give the xbox a break and still watch things on the tv.", "verified": true, "helpfulness": "0/0", "author": "Justin Stebbins"}, {"rating": 5.0, "review": "I love the chromecast. It is quick and easy to set up and get working right away. I love the tv waking feature, very convenient. Combined with my plex media server, it is a powerful and effective streaming tool for my entire digital library, enabling any movie, tv show, song, etc. to be cast to my tv at the press of a button on any of my devices, be they phones, tablets, or the pc itself.Chromecast has also helped me to finally convince my family to 'cut the cord' from evil comcast. There is no fear of missing or being unable to view certain live events such as local news and/or sports and events, etc., that are not really readily available with paid streaming services such as hulu, netflix etc., as it is so simple to cast any webpage from the chrome browser of my pc right to the tv.The price is great! I will be purchasing one for each of the tv's in my house, and so i can have one to travel with as well, so that as long as i have an internet connection and a tv with an hdmi port, and my plex library online, my entire digital library is fully portable and streamable anywhere. Awesome.I hope that google can get casting from the mobile chrome browser working soon, because then it will be even more convenient", "verified": true, "helpfulness": "1/1", "author": "Parker"}, {"rating": 3.0, "review": "It doesn't streams what's on my ipads chrome", "verified": true, "helpfulness": "0/0", "author": "Jose Abreu"}, {"rating": 5.0, "review": "Works every time. Quick & easy application.Mary Jane", "verified": true, "helpfulness": "0/0", "author": "Mary Jane Andrews"}, {"rating": 5.0, "review": "Works so much better than the built-in wireless connection of my Samsung SmartTV. You get away from the kludgey user interface that the built-in TV applications use. For the cost of this device, you will never regret the purchase", "verified": false, "helpfulness": "0/0", "author": "Robert Yunk \"Elmoalso\""}, {"rating": 1.0, "review": "It seems that ordering the Chromecast via Amazon is a mistake, since mine is not functioning even after multiple calls to the Google Chromecast Support line at 855-836-3987. The  device won't light up even after plugging it into a confirmed power source. At first they promised that they'd send me a new one but after a week of communicating and waiting for a response they claim that they can't identify the serial number of my purchase. The product is out of the box. Return to Google? Return to Amazon? Another consumer nightmare.", "verified": true, "helpfulness": "0/1", "author": "William H. Thoms Jr."}, {"rating": 5.0, "review": "Works like a gem.", "verified": true, "helpfulness": "0/0", "author": "Clayton"}, {"rating": 3.0, "review": "exactly as shown, unfortunately for me...my big screen tv was too old and didn't have the right fittings to plug it in.", "verified": true, "helpfulness": "0/0", "author": "KG"}]