[{"rating": 5.0, "review": "been using it for months now.. Can't live without it", "verified": true, "helpfulness": "0/0", "author": "pawan raina"}, {"rating": 2.0, "review": "most chromecast compatible apps have built-in cast already. i mainly bought this to use with popcorn time, which became incompatible days later.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it is the best! worth buying if you stream often!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing don't understand why I didn't purchase a long time ago. Even having a smart tv, this is much more convenient to use.", "verified": true, "helpfulness": "0/0", "author": "Adam Cassella"}, {"rating": 1.0, "review": "Didnt work", "verified": true, "helpfulness": "0/0", "author": "Hermes"}, {"rating": 5.0, "review": "I love my Chromecast! It's change my viewing life! :)  Only complaint is that I can't stream Amazon Instant Video with it.", "verified": true, "helpfulness": "0/0", "author": "sparks8907"}, {"rating": 5.0, "review": "Works perfectly. Wish it didn't have to plug in, but very happy with the service.", "verified": true, "helpfulness": "0/0", "author": "Naomi Sarah"}, {"rating": 1.0, "review": "Garbage... doesn't let you mirror your screen; apparently they are updating whatever so it will be able to, one day... it's like an Apple product, only works with other of their own stuff so you spend more money with them. Some protocol bullsh*t, cloud bs...bs...bs...bs. Interface very user unfriendly", "verified": true, "helpfulness": "0/1", "author": "Mihai Popescu"}, {"rating": 4.0, "review": "Good HDMI stick for the cheapest one available it is a great choice for youtube, HBO or netflix enthusiasts with smart phones or tablets.", "verified": true, "helpfulness": "0/0", "author": "Steve McIntosh"}, {"rating": 4.0, "review": "If there is an app that is made to communicate with the Chromecast, it should work just fine.  Netflix, Chrome browser, and YouTube work great.  I wish it would allow for PC mirroring better.  PC mirroring is iffy at best.", "verified": true, "helpfulness": "0/0", "author": "Eric Ericson"}]