[{"rating": 5.0, "review": "Love it best thing so far bought on here, works like it supposed to and there is no problem with it when it got here.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This thing is a of very limited value, and I'm not sure that it's quite ready for prime time.  Yes, it works- more or less, and no- I don't see much utility from it.  This analogy may not mean much to non-nerds, but this to me is a bit like an Arduino or Raspberry Pi- you can get it to do some stuff if you are really determined, but it's not likely to be worth it.  No.  That's not fair to Arduino or Raspberry Pi- I've done far more interesting things with those.  The Chromecast is a bust.  The video quality is underwhelming, and the UI and connectivity are equally yawn-worthy.", "verified": true, "helpfulness": "0/1", "author": "Stucco"}, {"rating": 2.0, "review": "MY GOAL: Carry my content with me when I travel and watch it on the hotel TV A) Using minimal hardware and B) From the bedTRY #1: Miracast Dongle Receiving Content from Nexus 7 (FAIL)TRY #2: Google ChromeCast (Now that they've un-screwed the API) Receiving Content from Nexus 7 via AllCastAnyone who counters my low review with \"It does what it says it does\" is spot on; no argument here.That said: it doesn't do much.  The number of devices in my media cluster that can stream Netflix and everything else is huge.  The niche for this device is TV's dumb enough that they can't receive media but new enough they have got a spare HDMI port.  This really is just a transparent effort to shift commodity media purchase from {anyone else} to Google Play.  Mission accomplished.  And a really sweet price!What you can't do with the thing is talk to it without being on a consistent network.  Hotel and other remote networks are notoriously spotty and troublesome to work with.  And the dude who built AllCast -- who appears to otherwise be a freakin' genius and totally pulling for my goal -- has really gone out of his way to make the trial experience so unpleasant that buying the full version is just out of the question.  I could stream a second or two of video before it stopped to open a browser window.So anyway - it does not meet my needs.  Though my experience showed it to be a functional approach to streaming personal media under controlled conditions where MiraCast simply was not ever.MISSION: FAIL.", "verified": false, "helpfulness": "0/0", "author": "I_Will"}, {"rating": 1.0, "review": "Only supported web sites (such as YouTube, Google Play, or others they list) can \"cast\" directly to the device, allowing you to use your phone or laptop for other things while still watching the video in full-screen mode.  These types of sites seem to work well with this device.However, if your laptop does not have an HDMI connector and your TV does, and you want to watch something on your TV (via Chrome on your laptop), it is a different situation.  Your computer has to receive the stream and then forward it to the Chromecast device... and this process is more sensitive to WiFi signal levels in your home, which turned out to be a problem for me.  Even after installing the short HDMI extender, which improves WiFi reception a bit, our Wifi signal seems too weak to support \"casting\" from laptop screen to TV without having brief freezes in the video and skips in the audio, or audio slightly out of sync with the video.So, this device is just as good as a Roku if you are watching one of their supported channels or web sites, but demands more of your computer and Wifi network if you seek to \"cast\" a stream from Chrome on your laptop to the TV.  Both laptop and Chromecast seem to need to be in \"good\" WiFi reception zones, which is tough (and not very convenient) for us to do in our house.", "verified": true, "helpfulness": "0/0", "author": "GF"}, {"rating": 5.0, "review": "This device is awesome! We use it all the time and have never had any issues with it. I highly reccommend.", "verified": false, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "The Chromecast was purchased to take the place of an Xbox and the $50/year Live subscription.  It was very easy to set up and download and install didn't take very long at all.  It has all our favorite apps and we're looking forward to seeing what else will be released.", "verified": true, "helpfulness": "0/1", "author": "C35611"}, {"rating": 5.0, "review": "This product was a little more difficult to set up and advertised, but once set up it is a great product. Wonderful purchase.", "verified": true, "helpfulness": "0/0", "author": "SecretAgentSmurf \"Jennifer\""}, {"rating": 5.0, "review": "Speedy delivery, this product is by far amazing. I love it and will recommend it to everyone I know. I am just thrilled", "verified": true, "helpfulness": "0/0", "author": "amanda"}, {"rating": 3.0, "review": "The video is shifty and out of sink with the sound. The speed of the video normal but regularly about every 5 seconds it jumps forward and sometime it pauses. It does not happen if I use regular cable which makes me to believe it has to do with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I had trouble getting this dongle to work on my Sony TV. It would never connect from it. On the Samsung TV it worked OK and installed without trouble.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"amberry10\""}]