[{"rating": 5.0, "review": "Very easy to setup and Netflix works great. I love being able to quickly select a tv show to watch on my iPad and hitting play rather than having to traverse menus with a remote like you do with Apple TV or any other device.", "verified": true, "helpfulness": "0/0", "author": "Nikhil"}, {"rating": 4.0, "review": "I was kind of leery about this product but after using it for couple of days, it is very impressive.  I have smart TV and blueray players with Google TV but Chromecast makes those things obsolete.  The interface of Youtube and Netflex is so effortless.  The Chromecast uses your WIFI to stream Youtube and Netflix.  I have no lag issues.  Watching Netflix and Youtube have never been so easy and fun.  Stopping and changing content with your IPad or smartphones.This is a must-buy product for all households.", "verified": false, "helpfulness": "0/0", "author": "James"}, {"rating": 3.0, "review": "Just received the chromecast... just a warning... its not ready for iOS users.  Having a challenge getting it up and running and if you use Verizon Fiber, just be warned you need some serious tech smarts.  Still checking different websites trying to figure out what functions I need to disable within my router to make it work via Windows OS.  Also check your TV... need a USB port that is not your SERVICE (NOT) port.  Otherwise you have to use the power adapter and plug it into an outlet... so just be warned/aware that there is a little more than just plugging in the dongle... very hopeful that the iOS App will be out soon and make this a mute issue concerning install... but the power USB note is something that some might find a challenge if you have multiple devices near your TV.", "verified": true, "helpfulness": "0/0", "author": "SH"}, {"rating": 4.0, "review": "It's a great piece of hardware that basically solve a lot of routing problems from your phone/computer/tablet to tv! I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Chhay Kong"}, {"rating": 5.0, "review": "Loving this device!  Basically, if you are looking for an easy way to get Netflix to your TV set (without having to go through an Xbox (pay wall $/month), ps4, or a kludgy blue-ray player), this is it.This solves a big problem in our house, as we got tired of paying extra $ each month for Xbox live just so we could get to the Netflix app on the device.  Plus the Xbox has an incredibly kludgy interface, patches galore (my time is theirs to waste), and the Netflix app at our house takes two or three tries before it will actually work.We also tried Netflix through a Sony blue ray player, but man is it slow (and has another really kludgy interface.It's only $35, and connects via the HDMI port.  It needs power, so if your TV has a USB port, you can hook it in there, otherwise you'll need to run it to wall power (all connectors included).You also need a wireless router in the house.  The router must have internet access.  You'll also need a computer with a wireless connection to that router to set up the chromecast (which is very simple).  Once it is set up, you can then stream Netflix (YouTube, and chrome) to your TV.  You control the chromecast through remote devices like iOS (iPhone, iPad), android, or pc (via chrome).  Basically, you load up Netflix, and then select something to watch, and where to watch it.  Once you select the chromecast, it will send the movie to your TV.  All standard controls (stop, pause, rewind, etc.) are on the remote device.  The remote device isn't actually streaming the movie, so it can be used for other things.There are a few possible issues that might affect you:1) The unit is completely self-contained, so if you want to output the audio to a stereo system, you're going to have to see if you can do that through your TV.  I haven't tried this yet (my TV only has L/R audio out), and the HDMI standard may not even let you run analog audio out.  If you try this, let me know.2) There is no HDMI pass-through, so if you are already using the HDMI port for something else (cable input, whatever), then you'll have to have another free HDMI port on the TV, or get an HDMI muxer of some kind.3) If you do get an HDMI muxer that has auto-switch capability it probably won't auto-switch.  Auto-switching muxers try to automatically change the input source to the first available \"ON\" unit in a series.  This is supposed to prevent you having to manually switch between inputs.  However, this only works if devices truly shut off their HDMI output to the TV.  I don't think the chromecast ever turns off, so it will always appear to be on.  If your other HDMI device(s) do fully turn off, you should be ok.  For us, we have chromecast + Dish, and both devices are always sending a signal to the TV, so the auto-switch muxer we have has to have its input manually changed.4) You need a fair bit of room for this thing to fit on the HDMI port.  It sticks out about 2 1/2\" from the port.  The power port is on the back of the unit, and requires at least another 1-2\" inches of clearance.  So if you've got your TV mounted flush up against a wall and your TV HDMI port is on the back, you might have clearance issues.  If the HDMI port is on the side of the TV, you might see the chromecast unit+cables sticking out.5) Not sure if the Netflix stream is high definition or not - haven't really checked into that.", "verified": true, "helpfulness": "0/0", "author": "johnM"}, {"rating": 4.0, "review": "I like it, glad i got one when i did, apparently they are  hard to get, but by the time you get one hopefully they will be fully functional, with all the apps you like. Im waiting for twitch to get on board then ill be all set", "verified": true, "helpfulness": "0/0", "author": "snapshotdod"}, {"rating": 1.0, "review": "Its a great idea and I was really excited about this.  However, it appears that it doesn't work with all makes and model TVs.  Do a search of chromecast and your TV make and model before you buy.  For me and many others it shows up as an excessive amount of purple on the screen.  So I guess it is usable if I want to show some text but that's about it.  With any luck, slim chance but I will try, I can get a refund.", "verified": false, "helpfulness": "2/3", "author": "Marz"}, {"rating": 1.0, "review": "Just got the chromecast after ordering it almost 3 weeks ago. The setup and connection is really smooth and impressive. There ends the positives.I started playing a movie on the chrome browser on my OSx 10.9 (developer preview). 40 minutes into the movie, and I have had at least 5 instances where the screen simply froze on my TV. The movie was however playing as usual on my laptop.Every time I minimize my chrome browser, the video simply mutes and I can hear nothing. I have to then maximize chrome to get the volume back. Minimize the browser again and sound does not work once again.To be fair to google, I am running it on a 10.9 developer preview edition. There maybe some OS related issue with chrome that google is yet to address. However, given that this is google, my expectations were really high and it has been a let down.", "verified": false, "helpfulness": "14/19", "author": "vijaygos"}, {"rating": 3.0, "review": "It's inexpensive and there's a lot of potential, but the fact is that I have about a million other devices that do exactly what the Chromecast does. For people who are full on Android, I think it makes a lot of sense. If you've iOS or Mac and already have an Apple TV, it doesn't add anything new.", "verified": true, "helpfulness": "0/1", "author": "Kyle Hess"}, {"rating": 4.0, "review": "There is always room for improvement but this is a great product. Having access to more viewing options will only enhance its value.", "verified": true, "helpfulness": "0/0", "author": "thinkSNOW"}]