[{"rating": 1.0, "review": "Installed fine. But not recognized by my wifi.  That's all I have to say but evidently must add more words.", "verified": true, "helpfulness": "0/2", "author": "Wanda Boss"}, {"rating": 5.0, "review": "Easy to install and works very well. Love being able to watch youtube on my tv this works great love it", "verified": true, "helpfulness": "0/0", "author": "patrick j hawk"}, {"rating": 5.0, "review": "I honestly didn't know if I would like it because I've not ever used anything luke it. However, after getting it installed on my tv (super easy) and getting the software installed on my laptop (super easy) and configuring it (super easy) I was streaming video to my tv like I had been doing it for years. It really is THAT easy to use. And the beast part about it is that its portable between all my tvs (or I COULD buy one for each tv).", "verified": true, "helpfulness": "0/0", "author": "kaschimer"}, {"rating": 5.0, "review": "Easy to set up, no issues at all. Excellent value for money and cable to be shut off shortly (just as soon as this series of GoT finishes on HBO)", "verified": true, "helpfulness": "0/0", "author": "Tom Sheffield"}, {"rating": 5.0, "review": "Got it on sale for $30 and it is one of the best multimedia values out there.  Works seamlessly with all my devices.", "verified": true, "helpfulness": "0/0", "author": "Jon LeBlanc"}, {"rating": 5.0, "review": "Ordered this to try it out, and liked it so well we bought a second one!  It is a little tricky to install, you have to watch the screen, and wait until the updates are done before you can finalize the installation.  Now I can send my laptop, my tablets and my phone to either of my TV's and watch videos and look at web pages.  Great tool for these old eyes!", "verified": true, "helpfulness": "0/0", "author": "AK Travler"}, {"rating": 5.0, "review": "Installed easily.  Once I found I had to change my computer setting for shut down when computer idle i could watch my movies all the way through.  Problem had nothing to do with Chromecast but a computer setting.  Thoroughly enjoying watching movies on demand.", "verified": true, "helpfulness": "0/0", "author": "Dianne Lieber"}, {"rating": 3.0, "review": "Works well but is not really a stand alone device like Apple TV, you must have an IOS or Android device to operate it and stream from. Limited compatible apps are available for it at the present time. Overall it does what it is supposed to do fairly well.", "verified": true, "helpfulness": "0/0", "author": "Mark Wilke"}, {"rating": 5.0, "review": "Awesome product. I'm so satisfy with how it works. Easy to install, ready in few minutes.Bang for the buck.I recommend .", "verified": true, "helpfulness": "0/0", "author": "Toshe"}, {"rating": 5.0, "review": "what more can I say makes watching anything on your computer easy no need to run a cord across the room and I can be on the computer while my husband is watching HBO go!", "verified": true, "helpfulness": "0/0", "author": "Kathy"}]