[{"rating": 2.0, "review": "It just hangs if it is streaming a video from Chrome...the name is anything but APT..CHROMECAST..it should be YOUTUBECAST or something...i am not happy with it...:(", "verified": true, "helpfulness": "0/0", "author": "Vikram Chikoti \"Duns Gupta\""}, {"rating": 5.0, "review": "Chromecast is the best casting device for the current generation and especially with 3 months its a steal. More apps expected to make it perfect.", "verified": true, "helpfulness": "0/0", "author": "Somashekar"}, {"rating": 4.0, "review": "Like it better than my Roku for Netflix. Expect other apps like HBO GO to be added soon. Like its simplicity.", "verified": true, "helpfulness": "0/0", "author": "Robert Norris"}, {"rating": 5.0, "review": "We have watched the first season of House of Cards from Netflix using Chromecast. No problems encountered either with Netflix or YouTube. I have also displayed static web pages and they are rendered perfectly well. If I cast Hulu videos via Chrome browser, the video can be jaggy.", "verified": true, "helpfulness": "0/0", "author": "Vimal Goel"}, {"rating": 5.0, "review": "First, it's incredibly easy to install.I'm not exaggerating when I say it took me longer to get it out of the box than it took to get it up and running on my TV.Secondly, it was just as easy to get it to connect to my tablet and my Smartphone.It was so good, that I immediately went back to the internet to buy a decent speaker system for my TV so I could enjoy the music through out my home.It won't take long for a BUNCH of android applications to feature this item in their options and I am looking forward to any new applications designed specifically for it.Best 40 bucks I've spent this year (Aside from gourmet cat food)", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "I am very satisfied with my purchase of the Google Chromecast. It honestly couldn't have been easier to setup. It immediately found my home network and connected with my phone/tablet/PC with ease. While there are only few apps that currently support Chromecast I have already heard rumors of several major content providers working on developing their apps to support Chromecast. I have never had any issues with the device, and love how easy it is to share content when I have people over for a party. I only held back from giving it 5 stars at the moment simply because of how few apps currently support Chromecast, but I'm positive that will change in the future. For $35 this is a definite buy.", "verified": true, "helpfulness": "0/0", "author": "Christopher R. Preall"}, {"rating": 5.0, "review": "Works out of the box, as advertised, right priced - just need to watch location relative to wifi router, and be patient until it ships.", "verified": true, "helpfulness": "0/0", "author": "Garret T Yoshimi"}, {"rating": 4.0, "review": "The Comcast is really neat but it needs more app support. hopefully the developer community catches up soon. Netflix and you tube are ok, Buford be better if it supported local media.", "verified": false, "helpfulness": "0/1", "author": "ReviewerDude"}, {"rating": 4.0, "review": "small, neat, easy to setup and use, and pretty powerful in streaming from available apps.  however for it to be more useful it needs to have more apps available for streaming.  i'm sure more apps are coming, just have to be patient.  very good and low price product.", "verified": true, "helpfulness": "0/0", "author": "Allen"}, {"rating": 5.0, "review": "An amazing device.  \"casting\"  Netflix or YouTube from an Android phone or tablet is seamless and in high definition quality.  It is also possible to cast video streaming on your computers Chrome browser to the device en full resolution.  this seems to require a fairly modern computer and a good wifi connection. I am using and i5 Mac mini and a $35 Asus wireless N router. the trick is that when streaming video opens in a popup window you copy the URL and paste it back into a regular chrome tab. Then you simply cast that tab and voila its on your TV screen.There were some minor issues with the Actiontec verizon fios router that are documented on internet forums. I eventually got it set up but decided to purchase a new router since the wireless and was much faster and provide better coverage.", "verified": true, "helpfulness": "0/0", "author": "JB"}]