[{"rating": 1.0, "review": "Difficult to install and no where to find in detail how to proceed with the installation. I wasted my money on a book that did not take me anywhere.  Do not bother with this.....", "verified": true, "helpfulness": "0/0", "author": "Manuel Rivera"}, {"rating": 5.0, "review": "As expected, plays YouTube on my screen and other apps like HBOGo", "verified": true, "helpfulness": "0/0", "author": "thilanka_g"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Amazing, it does what its meant to do", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 4.0, "review": "Nice device.  Smooth setup, With the chrome, you can cast almost everything.  Recommended..", "verified": true, "helpfulness": "0/0", "author": "J.L."}, {"rating": 4.0, "review": "Easy to use and works great, but it would be 5 star if you could use Amazon. Be careful when disconnecting blindly, bends easily.", "verified": true, "helpfulness": "0/0", "author": "Lisa Sharkey"}, {"rating": 5.0, "review": "should have bought these a long time ago!  Great to sync phone and laptop for tech nincompoops like myself!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"sailingalong\""}, {"rating": 5.0, "review": "I use these daily 2 at home one for on the road. You simply plug it in go through 3 steps and then use your fevice to stream right to your tv.Its wireless hdmi with full control. Stream movies,youtube, or whatever you want.", "verified": true, "helpfulness": "0/0", "author": "FilthyFletch \"aka Dat Basterd\""}, {"rating": 5.0, "review": "Amazing invention. We use this daily to help defeat cable. This was a replacement due to severe abuse of our other one. Will always have one in each TV.", "verified": true, "helpfulness": "0/0", "author": "D4O"}, {"rating": 5.0, "review": "Can stream just about anything from my computer to the tv in 480 p.rarely freezes and all you have to do to fix is click the video to buffer again. Still In beta though", "verified": true, "helpfulness": "0/0", "author": "kevin"}]