[{"rating": 4.0, "review": "Good for watching TV.", "verified": true, "helpfulness": "0/0", "author": "amenj \"amenj\""}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "BD"}, {"rating": 1.0, "review": "Bought this for my daughter to use while away at college.  It broke the first time she used it.  Unfortunately we were past the 30-day Amazon return period.  The Chromecast is supposed to come with a 12-month warranty from Google.  After trying repeatedly for two months to get Google to honor the warranty, I finally gave up.  We will buy the Amazon Fire TV Stick instead.  Based on the reviews, it sounds like a much better product.  I really don't understand why Google could not honor the warranty and just send a replacement.", "verified": true, "helpfulness": "0/0", "author": "K. Dickerson"}, {"rating": 5.0, "review": "I love google", "verified": true, "helpfulness": "0/0", "author": "Sia"}, {"rating": 3.0, "review": "Would give chromecast 5 stars except the volume control is a little buggy. Volume control doesn't respond very smoothly whenever it does work and gets when it doesn't work it can take several moments before it jumps several degress louder or softer; the latter doesn't happen as often but does occur. Maybe I got a crappy device?", "verified": true, "helpfulness": "0/0", "author": "Emmanuel Tetteh"}, {"rating": 5.0, "review": "Love it.!! Don't have cable TV and now I can watch anything I have on my ipad!!!!Also need to add that I am 62, female and not tech savy at all and I installed it myself!!!!", "verified": true, "helpfulness": "1/1", "author": "vicky"}, {"rating": 5.0, "review": "It's great. A bit complicated setting it up, but it works great.", "verified": true, "helpfulness": "0/0", "author": "Kathy... \"katie\""}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Caroline"}, {"rating": 5.0, "review": "Amazing product. So small and can do so much. I use it for streaming YouTube and Netflix, but it is very limited to the apps you can use to stream on it. Other than that it is amazing really recommend it.", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 4.0, "review": "T he HDMI isfun", "verified": true, "helpfulness": "0/0", "author": "Frank Epps, Jr."}]