[{"rating": 5.0, "review": "I bought two of the Amazon Fire TV boxes, one for myself and the other for my mom. This was so easy to hook up and operate even for my mom and she just loves it and watches movies all the time.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Mumby"}, {"rating": 1.0, "review": "Hulu and Netflix regularly have connection issues (only on this device, not on the PS3, PS4, Xbox 360, or mobile devices in my home).HBO Go does not function for Charter or Comcast subscribers, despite working on every single other device in my home.There is no Vudu app, only the wildly inferior Flixster (which only lets me access a tiny fraction of my Ultraviolet library).The device has no way to turn itself off after a period of inactivity.I bought this device to use solely for Netflix, Hulu, HBO Go, and Ultraviolet movies/shows, and it can only perform half of those functions, and not very reliably.  I will not be buying an Amazon Fire product again.", "verified": true, "helpfulness": "0/0", "author": "K. J. Fleming"}, {"rating": 5.0, "review": "Love it! Bought the chromecast and returned it. Didnt like the idea of having to cast media through my phone or tablet. The Amazon fire comes with a control box and a seperate remote that gives you the option to speak commands to and works flaulessly.", "verified": true, "helpfulness": "0/0", "author": "HEATH A DUFFEY"}, {"rating": 5.0, "review": "So far, so good.", "verified": true, "helpfulness": "0/1", "author": "Bud Liteyear \"liteyear\""}, {"rating": 4.0, "review": "it's great .", "verified": true, "helpfulness": "0/1", "author": "Jerry Biggs"}, {"rating": 4.0, "review": "The box and remote are small and plain but that doesn't hinder its functionality.  It works great.  It was nice to have a manual to review once it is powered on the first time.  The only problem that I have with it, is that it doesn't have an off button.  It goes to sleep after 30 minutes or you can put it to sleep but finding the right screen to do that on takes a lot of button pushing.  I haven't figured out how to switch from viewing the Fire to viewing regular TV either.", "verified": true, "helpfulness": "0/0", "author": "redmini"}, {"rating": 5.0, "review": "Great product....easy set up....love Amazon prime....only con no hdmi cable included.", "verified": true, "helpfulness": "0/0", "author": "Joseph A. Wiseman"}, {"rating": 1.0, "review": "We have been very disappointed by the Amazon Fire.  When attempting to setup the devise we were unable to connect Netflix to our account and after contacting amazon tech support we were told that \"they were aware of the problem some people were having connecting netflix and were working on correcting the issue.  If this has been an ongoing problem with the device then they should not include netflix in their advertising when selling the product.  I would not recommend the amazon fire to anyone.  We have not been  satisfied in any of the attempted uses.", "verified": true, "helpfulness": "1/3", "author": "Rebecca Schowe"}, {"rating": 5.0, "review": "Amazon Fire TV was a Christmas gift, and turned out to be an enhancement of my Kindle Fire use.  Once I figured out how to use it,( I'm 73 and not a techno savant), I've enjoyed watching many of the videos on my watchlist.", "verified": true, "helpfulness": "0/0", "author": "Joan Dewey"}, {"rating": 5.0, "review": "A lot easier to use than the PS3 we were using.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]