[{"rating": 4.0, "review": "Love this thing. So clear and instant. The only bummer is not being able to get older TV series without having to pay for it.", "verified": true, "helpfulness": "0/0", "author": "Nathan Glaeser"}, {"rating": 5.0, "review": "Not sure if it is better than rocky, but it is still cool.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Great product.  Easy to install and easy to use.  Enjoying our selections through Amazon Fire Tv.", "verified": true, "helpfulness": "0/0", "author": "G B Wilson"}, {"rating": 3.0, "review": "Not nearly as many movies as i thought they would have. They basically don't have anything that was a blockbuster. It works great. But for $99/year, whatever. I then got Netflix, but its nearly the same, only some blockbusters.", "verified": true, "helpfulness": "0/2", "author": "Romney \"Romney\""}, {"rating": 5.0, "review": "Totally awesome. Fast and user friendly media device beats all others.Entertainment compliments and provides content not available on Netflix although they have that app too.So cool how it consolidates all your digital media you have purchased from Amazon.This along with Amazon Prime is such a good value and pleasure to use.", "verified": true, "helpfulness": "0/0", "author": "Kent S"}, {"rating": 1.0, "review": "I think it would be a good device but it is very disappointing to me because movies freeze over and over again.  It takes me twice as long to watch any show than it should.  Thirty seconds of watching and then thirty seconds of waiting.  I'm not sure why but it doesn't work the way I had expected.  I would rate zero stars for this product but I don't know how to do that.", "verified": true, "helpfulness": "1/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have 2 roku 3's and now the fire tv and everyone likes it the best and the available games are great.", "verified": true, "helpfulness": "2/2", "author": "H. A. Ray Carter"}, {"rating": 2.0, "review": "There are too many movies and tv shows that need to be paid for even with Prime. It appeared House of Cards would be included but only the first episode was free.  It is difficult at times to navigate but that may improve once we get a new TV.", "verified": true, "helpfulness": "0/1", "author": "Robin E Franklin"}, {"rating": 5.0, "review": "I was sent an email coupon for a discount on any and all amazon fire tv products or games, ect but I deleted the email by accident can you please email me another coupon I would like to use it towards the amazon game controller.", "verified": true, "helpfulness": "0/1", "author": "dalia"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Jenna"}]