[{"rating": 5.0, "review": "This is amazing. I can stream movies and apps through my TV using my phone, tablet, and laptop. This works wonders compared to always HDMII hooking up my laptop", "verified": true, "helpfulness": "0/0", "author": "Zach Brannan"}, {"rating": 4.0, "review": "Product is well made and packaged.Streams video very well and has a smooth setup, only negative on using from an android device is its quite limited. Still to try it with a pc or ipad", "verified": true, "helpfulness": "0/0", "author": "Mark McLeod"}, {"rating": 2.0, "review": "The device overheats and video streaming often drops or skips. Chrome is a great browser, but this little device is not ready for prime time. However, I do like using it for slideshows on big screen TVs.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "Great product, dropped to 30 while I was waiting for delivery and still worth it. Same as roku for less.", "verified": true, "helpfulness": "0/0", "author": "Karl Zimmermann"}, {"rating": 5.0, "review": "awesome!!! great for kids to watch you tube and netflix,when you have multable children wanting to watch or play on lap top and desk top, you can use your smart phone as well.also while you are watching a youtube video you can brouse youtube for the next video you want watch as the entire file is been sent to the device, allowing you to brouse and watch, which you can not do with just you tube. i have a 47\" led tv and the kids all love watching videos. can't beat the price and simple to set up as well.", "verified": true, "helpfulness": "0/0", "author": "RONNIE SMITH"}, {"rating": 1.0, "review": "Worked great for LITERALLY 15 minutes...now netflix won't play.  Google the error and see how many people have it...and nobody knows how to fix it.  Netflix doesn't have a fix, chromecast support doesn't have a fix.  Youtube streams just fine, it's only isolated to Netflix (which is the only thing I actually want this pos to work with).I've tried everything.Factory resetRouter ResetApp uninstallOS updatesAll the BS online gimicks...closing all apps except Netflix, clearing cache, etc...nothing works.Getting and fixing errors is one thing, but not having a FIX for the thousands of people with the same problem is BS.", "verified": true, "helpfulness": "1/1", "author": "Rick"}, {"rating": 1.0, "review": "Bad news for 1st Generation iPad owners. I did a \"google\" search about this prior to buying. It appeared that there was support for original ipad owners. Bought this as a gift for a family member and had it shipped to them. Now the Chromecast is a useless device as it will not work with their 1st gen ipad. Thanks Google & Apple. Birthday gift fail.", "verified": true, "helpfulness": "1/1", "author": "Paul Brown"}, {"rating": 1.0, "review": "I bought this to throw media from my desktop computer to my TV; but it appears that unless the computer you are on is using the same wifi router - not just on the same network or even a repeater away - it doesn't see the Chromecast device.  That's the only conclusion I could come to.  Tech support was mildly helpful but didn't seem to understand how I had it set up, I finally just gave up and sent it back.My brother has this and loves it, but he is also in the Android ecosystem and I am in the iOS ecosystem, so that is probably why it didn't work for me.", "verified": true, "helpfulness": "0/1", "author": "Jon"}, {"rating": 4.0, "review": "This is a great application. It picks up anything you want to send to it and while you are not watching a program, there are beautiful graphics that simpply play on the screen simulating art on your TV.I was disappointed that it came with no user guide and the chromecast book that comes up in a google search is useless.I am absolutely certain this device has more to offer...it is only a matter of finding it.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Mercier"}, {"rating": 4.0, "review": "I love it but it needs more apps and a way to be able to stream my own videos. Also mine never came with a charger. Luckily my cell phone charger is compatible.", "verified": true, "helpfulness": "0/0", "author": "pnut8377"}]