[{"rating": 1.0, "review": "Chromecast doesnt work with chrome browser on iphone.Google clearly states that it works with Chrome browser.I guess they were trying to convey that it works with windows pc or mac chrome browser.I bought it thinking that I would be able to play through chrome browser on my iphone.APPLE is way better at what it promises and delivers with no gimmicksBTW GOOGLE-LEARN FROM APPLE", "verified": false, "helpfulness": "2/7", "author": "claxman"}, {"rating": 2.0, "review": "I thought this would allow me to play on my TV any pics or video I had on my iPad and iPhone. It only does Netflix and YouTube which I already have using my BluRay player.", "verified": true, "helpfulness": "1/2", "author": "Jose Resendiz"}, {"rating": 4.0, "review": "Neat application to stream video and websites to your TV. However, in 2 different hotels I tried it and it didn't work.  Mainly due to settings on their wifi.  I believe that Google is expanding its use because currently it doesn't allow streaming on certain apps. Especially competitors like Amazon!", "verified": true, "helpfulness": "0/0", "author": "Darren H Germundson"}, {"rating": 5.0, "review": "I couldn't install the unit with my Acer C7 Chromebook - seems that the Chrome OS couldn't \"talk\" to the Chromecast and my WiFi at the same time - but once I installed the unit with my Dell Laptop, it works just fine with my Chromebook.  The literature would lead you to believe that the Chromecast only works with a couple apps (NetFlix, etc., etc.) but that's only for HD.  Actually, if it shows on your Laptop/Chromebook screen, you can \"cast\" it to your TV.  This one little unit replaces an entire complex of wires/boxes/etc. to convert VGA to HDMI so I can watch the Phillies via MLBTV to the big screen (and MUCH cheaper than Boxee, etc.)", "verified": true, "helpfulness": "0/0", "author": "reilly2u \"reilly2u\""}, {"rating": 4.0, "review": "I love this device. It has changed how I watch YouTube videos, movies and music.Currently this has a limited number of apps that work with it. I started using a few of these more such as YouTube and Google Music. Also the Cast the Tab feature is good but a work in progress. A little lag at when doing things but it's still in beta.I did have a few issue every now and then of it not connecting to my wifi.If i had more TVs I would get more of these and I am excited for more apps to come to this.", "verified": true, "helpfulness": "0/1", "author": "Charles Jay Meyer"}, {"rating": 5.0, "review": "I love this device. It costs $35. It is ridiculously easy to setup. No, really...it costs $35. You can stream anything from your Chrome browser to your TV. I'm not lying...it costs $35. It can also stream video from several apps on your phone/tablet. Seriously, it costs $35. It has yet to fail or crash on me. Yup, still costs $35. Why wouldn't you buy this?", "verified": true, "helpfulness": "0/0", "author": "M. Pouliot \"Pikers\""}, {"rating": 5.0, "review": "The amount of potential this device has could make it as common of a household item as a TV. Imagine going to someone's house and putting content on their TV without having to do anything more than ask for their WiFi password.This device has completely supplanted my PS3 as a Netflix device and Google Play Music has largely supplanted Pandora for the room in which my TV lives. Because most of the stuff that I need to show on my TV is browser-based, Google Cast for Chrome obviates the need for me to find my silly Lightning->HDMI adapter and plug in.Now, if only iTerm2 added DIAL support somehow...*DIAL ([...] is the protocol that drives the Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Colin Dean \"Colin Dean\""}, {"rating": 2.0, "review": "I've been waiting for the Chromecast for over a month now in the hope that finally someone has developed a product where I can watch any video off my phone, Ipad, or laptop.  Based on the description from Google you would think this is the product.  It's not.Product is very limited.  For iPhone and iPad you can only watch Netflix, YouTube, or GooglePlay.  For the laptop, you must use the Google Chrome browser, and product will only play video off the main screen.  If your video plays in a pop up screen like ESPN 3, it won't cast the video.If you don't have a Roku box and only want to watch Netflix, this is the product for you.  You can cast the Netflix show to the TV and continue to access other apps on your iPad or iPhone.  Other than that particular circumstance, there are better options.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Prior to the Chromecast my wife and I had been playing the game where to watch something on the TV we had to grab a laptop, a charger, an HDMI cable and precariously position all on the edge of the TV stand (which unsurprisingly wasn't designed for a TV and a laptop side by side).Chromecast completely fixes the problem... now when we want to watch Netflix we just sit on the couch, turn on the TV and open up Netflix on my phone and cast it to the TV! It doesn't drain my phone battery like it would if we we're watching on my phone.Setup was relatively easy and straightforward (didn't take more than 15-20mins). One note, if you have a duel band router the Chromecast and all of the devices you want to control it on need to be on the same band.I've been *very* happy with the purchase.", "verified": true, "helpfulness": "0/1", "author": "Joe"}, {"rating": 5.0, "review": "I've wanted a device like the Chromecast for a while. I have a Roku, Apple TV, and of course several consoles but none of these compare to the simplicity of the Chromecast. The best part about this device is the integration with your phone or tablet, and depending on how you have it hooked up, it can even automatically turn on your TV or Stereo so you can start up music right from your phone in any room.I was pretty surprised at just how good the Netflix video quality was, especially compared to my PlayStation 3. So that was a definite bonus. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Nick Puleo"}]