[{"rating": 4.0, "review": "We are still learning how to deal with it and will probably add a star later.  Our Techie highly recommended it.", "verified": true, "helpfulness": "1/3", "author": "Melanie Williams"}, {"rating": 5.0, "review": "We LOVE our new Amazon Fire paired up with our Amazon Prime membership!  We watch tv with this more than cable.  Most of our cable will be discontinued now.", "verified": true, "helpfulness": "0/0", "author": "msmaryy"}, {"rating": 4.0, "review": "The Amazon Fire TV is a must-have if you are a Prime customer. You can fly through the menus and selection of apps and buffering/loading is minimal. Voice search works great. In fact, it's so great that you wish you could use it for more than just Amazon content. The selection of games is OK, but obviously it will grow as time passes. There is a lot of potential on the gaming end. The few games I have played work well and look awesome on my 60-inch plasma. The wi-fi remote is simple but is intuitive and works well. This product is already very impressive and future updates, including expanding voice search capability, will nudge the Amazon Fire TV toward a 5-star streamer.", "verified": true, "helpfulness": "0/0", "author": "The Gambler"}, {"rating": 3.0, "review": "The quality is good but not a alternative replacement to cable or satellite TV. If you only watch one program it might be for you but if you watch more then one this thing could get out of hand in monthly costs as you have to buy everything except for the movies on prime.", "verified": true, "helpfulness": "1/1", "author": "carrzski"}, {"rating": 2.0, "review": "NON STOP BUFFERINGTHE UNIT IS WELL MADE AND WELL PACKAGED AS WELL AS PORTABLE.PROBLEM IS WHEN YOU TRY TO DOWNLOAD A MOVIE, IT STOPS TO RE BUFFER EVERY 2 TO 5 MIN.ITS WORSE THAN WATCHING THE NEWS ON CNN WITH ITS NEVER ENDING STREAM OF COMMERCIALS", "verified": true, "helpfulness": "0/2", "author": "Keith Stolte"}, {"rating": 5.0, "review": "I am sooo excited! You guys are doing a phenomenal job! I joined Prime a few years ago and the benefits are amazing! This is a whole new level of technology that I thoroughly enjoy! You go Amazon!", "verified": true, "helpfulness": "1/1", "author": "JBinTN \"J. B. Mitchell\""}, {"rating": 5.0, "review": "I have been able to watch movies that I missed when they first came out. TV series so I can have my own marathon days...", "verified": true, "helpfulness": "1/1", "author": "Elaine BRISARD"}, {"rating": 3.0, "review": "First off, I should tell everyone I have multiple streaming devices: I have a Roku 3, an Apple TV and now a Fire TV. I enjoy trying out gadgets, what can I say?What you get with this unit that is unique and cool: voice search is amazing and the box is very fast with little or no lag as you navigate the menus...the games are pretty good when compared to other streaming devices. You can't just buy an Kindle Fire game and expect to work on the Fire TV, the game has to be optimized for the Fire (I suppose you might be able to \"fling\" the game from your Kindle Fire to your Fire TV, but I haven't tried that). If you already have a Kindle Fire HDX, you can also fling or project what's on your tablet to your Fire TV (think Apple's AirPlay).BUT there are a lot of negatives when compared to a Roku 3 or even Apple TV.The search is not universal - as in if you enter a show, you'll not see it show up across all apps that offer it, just Amazon and a few others (not all). The Roku does this brilliantly -- no voice search though.The unit uses bluetooth (I think) to communicate; this means a Logitech Harmony remote is useless with this unit. Perhaps they want you to use the included remote.There is no mobile (iOS) remote app like a Roku.The apps are very limited - no sports apps (MLB/MLS/WWE although it's coming) and of course no HBO GO (although it's coming too).It's not a bad first effort and the voice search is fantastic if it worked across all apps.However, there are better fully features streaming devices out there, like Roku3, that even allow you to use your Amazon Prime membership. In order to be really at the same level as the other streamers, they need to have more app support and universal remote support.", "verified": true, "helpfulness": "3/4", "author": "IcedCorn"}, {"rating": 1.0, "review": "I hooked up no problem. I have everything wired except for controller. I can only load portions of programs intermittently and stutteringly, so that this is basically useless to me. I have a Century Link DSL but I'm in their slowest part of 'town'...I NEVER saw any minimum connection speeds mentioned and HOPED that this would at least allow programs to load in their entirety,The don't, or I haven't found out how. All I can get are annoying bits and longer waits for 'buffering'.", "verified": true, "helpfulness": "4/9", "author": "newbroom"}, {"rating": 5.0, "review": "cant beat it for the price  you can sideload plenty of existing android apps.  I personally like to enjoy old school console games on my fire tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]