[{"rating": 5.0, "review": "We spent the first night of owning this little gadget by geeking out- watching 3 seasons of \"The Guild\" streaming from YouTube.It really is just plug and play, no issues at all setting it up. I love that we'll be able to watch home movies on this just by playing from the I Pad. There are also TONS of gorgeous photos that will run on your screen as a rotating screensaver- if you have a flat screen that's wall-mounted, it's like having your own changing painting on the wall.A great little accessory for the tech lover in your house!", "verified": true, "helpfulness": "0/0", "author": "Belinda Cordes"}, {"rating": 2.0, "review": "Bought it in 2nd week of October 2014. Worked for 45 days.Since then, it is buffering every 2 Minutes. Cannot watch a video which is more than 2 minutes using Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Nicholson Kurian"}, {"rating": 5.0, "review": "Read all the reviews on Amazon and chatted it up at work. Very Easy set up and quality is good....some buffering at the beginning but that disappeared when I upgrade my cable modem and wireless router. Alternative to Apple TV or Roku and a less expensive alternative. It does tend to run warm to the touch.", "verified": true, "helpfulness": "0/0", "author": "James Cook"}, {"rating": 5.0, "review": "Buy it.... best streaming device for the money and works flawlessly with android devices (of course)if you like android, buy thisif you like youtube buy thisif you like netflix buy thisjust... Buy this", "verified": true, "helpfulness": "0/0", "author": "LF"}, {"rating": 5.0, "review": "easy to set up and I am not tech savy.  works great!!!!!  you can cut the cord!!!!  buy it now!!!!!!", "verified": true, "helpfulness": "0/0", "author": "leon hankins"}, {"rating": 2.0, "review": "Had an old Roku device, which was OK, but much out of date on resolution etc., and had only a component connection, not HDMI.Was really attracted to the concept of using a smartphone or tablet as a remote control, and the price, but now I know why is was priced so low.I tried using an iPhone, android, and iPad as the controller, and all were the same;  often froze up, took forever to pause, start, etc.  Was sort of like \"push pause, now count to ten and cross your fingers.  Almost impossible to rewind or fast-forward with any degree of controlStreaming was even worse.  Would take minutes to load a movie, and then would pause to re-buffer several times during a one hour show.  The pauses could be a minute or minutes (not real good for plot continuity).  Would mysteriously hold \"26%\" loading, then suddenly jump to 100%, only to stall again.  I checked signal strength and bandwidth from my router (at top of the line NetGear), and both were good.My best guess is than the unit was not created with enough on-board memory for effective streaming.I'm going back to Roku!\"", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I figured, \"for 35 bucks how could I go wrong?\".I'd been using a 10 ft HDMI cable to connect my laptop to my TV set. While it worked okay, I was always afraid of tripping over the cable so I figured I'd give the Google Chromecast a try. I also liked the idea that I'd be able to stream from my Android phone.At first I just used it to stream Netflix, but more apps were added, including HBOGo. I was able to catch up on several series streaming them from my phone.I give it an A+ for convenience and picture quality.", "verified": true, "helpfulness": "0/0", "author": "Leland Williamson"}, {"rating": 4.0, "review": "The chrome cast is great for Netflix and YouTube streaming. I love using my cell phone as a remote for the TV. However, because I am using my TV as a primarily Gaming TV, the Chrome cast may be made obsolete by a PS4. But for the price and the convenience of using any android device as a remote, it is worth the purchase.If you are considering a media player for a family/living room, and not a personal gaming TV as in my case, I would recommend a more fully featured product such as a Roku.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "Great value for the price. Works as expected. It's slightly inconvenient that it needs a power connection, but a free USB port on the TV is enough.", "verified": true, "helpfulness": "0/0", "author": "Joaquin Robles"}, {"rating": 4.0, "review": "The price was right and I got the extra $6 google play credit. So I jumped at it. Even got another one for a family member. Works great for You Tube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jamerz"}]