[{"rating": 5.0, "review": "Works perfect for me. I wish Google would add more apps to this so we can use them. Curently you can only use chrome and Youtube and NetFlix", "verified": true, "helpfulness": "1/1", "author": "N. Mulla \"nmulla\""}, {"rating": 5.0, "review": "Another amazing tool from Google to connect my computer and my phone via Chromecast and bluetooth. Now the world is truly at my fingertips and under my control! Thanks Google. What a value!", "verified": true, "helpfulness": "1/1", "author": "Robert Fischer \"Alone At the Alter\""}, {"rating": 1.0, "review": "I did not realize until I read the instructions that this does not work with Windows XP which is the system in my computer. The only way to make it work, is to buy a new computer.", "verified": true, "helpfulness": "1/2", "author": "Ray beynon"}, {"rating": 3.0, "review": "Works fine. But, does not stream Amazon prime. Already get netflix with my dvd player. Disapointed and giving it away.", "verified": true, "helpfulness": "0/0", "author": "ski mom"}, {"rating": 5.0, "review": "New found fun with media. Moving CATV closer out the door. Quick and easy to set up. Portable to take traveling and watch what you want when you want.", "verified": true, "helpfulness": "0/0", "author": "C.P."}, {"rating": 5.0, "review": "This is the best invention since the iPhone! Small, unbelievably affordable and very easy to install. I have used my Netflix program much more now that I have this device. I love things that make my life easier and this has. Thank you Google.", "verified": true, "helpfulness": "1/1", "author": "A Fan"}, {"rating": 1.0, "review": "Only works on small tvs, like a 19 inch too bad they don't tell you that in the description Too bad for me now I am out the money", "verified": true, "helpfulness": "1/5", "author": "Amy Joy Schneidermann"}, {"rating": 2.0, "review": "Very few APP can be used with this gadget. Please liberate the code in orden to be used for developers", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "This works exactly as advertised and I love it. I use it on my Mac to watch live sports and have realized that I can have the game up on the Chromecast and still use my laptop at the same time. Occasionally the Chromecast will lag and then drop the connection, but it only takes a minute to reload.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fabulous! I love it! I almost purchased an HDMI cord to use with my Nook for like $45 when I stumbled across the Chromecast, quite by accident. No wires, you can stream from the tablet, phone OR laptop, you do NOT have to watch on the device whatever you are casting to the TV (you could play a game while casting Netflix or Youtube), AND it was $10 cheaper!! Apparently, a lot of improvements and developments are underway as well, so I can only expect things to get even better-BONUS!!Highly recommend!!", "verified": true, "helpfulness": "1/1", "author": "jewels4167"}]