[{"rating": 5.0, "review": "My TVs (Sony Bravias) all have Internet apps and are connected to my home network, but I got a few links from Jibjab in my e-mail and I could not get them on the TV, so I decided to buy this thing.Installation took 5 minutes, as soon as it was connected it showed up on my TV and computer, I typed in my home wireless password and the connection was done.  The Google page could have been a bit better (too much focus on selling the thing, you have to dig a bit deeper to see the Support page, and to notice there is an extension to Chrome to be installed if you've been using Chrome;  I noticed that all new Chrome downloads now include it).  Now, I can click and cast whatever is on my browser to my TV.Downsides: the Chrome extension does not work on Android, the Chromecast App only does some videos (like YouTube) but not browser pages nor non-Youtube videos, at least on my Xperia Tablet S", "verified": true, "helpfulness": "0/1", "author": "Minh D. Nguyen \"Minh\""}, {"rating": 5.0, "review": "I really like chromecast. It is very easy to stream video from my computer to my T.V. and google is adding new apps that work natively with it. Kinda fun at the holidays to share YouTube videos right to the T.V from everyone's smart phone (android and google). I love being able to play music on the T.V. right from my phone too. Husband got me an Apple T.V. for Christmas but I took it back because chromecast works as well for much less money.", "verified": true, "helpfulness": "0/1", "author": "Brooke"}, {"rating": 5.0, "review": "I could not be more impressed with my chromecast. It was super easy to setup; done in 2 minutes. Some of the streaming is a little blurry at times, but i suspect that is from my internet connection. I love that i can control my tv from ipod and computer. It is the best 35 bucks i spent.", "verified": true, "helpfulness": "0/0", "author": "N. Pauley"}, {"rating": 1.0, "review": "I had hoped that this little device would work as flawlessly as my ROKU,  but it doesn't.  I can view YouTube videos on my computer, and they are completely enjoyable, but this is not the case when attempting to \"cast\" the video display to one's TV.  When \"casting\" (the term used in the Chromecast instructions) to the TV, the audio and video are no longer synchronized, like a poorly dubbed Italian movie of the 1960's or 1970's.  Thankfully, the device didn't cost much, and is barely worth the trouble to send back to Amazon for refund. Maybe GOOGLE has the capability to upgrade the device - but then - maybe not.  I should have done further research, and read the blogs complaining about the out of sync audio and video. My mistake.  If there is something special on YouTube, etc., that I want to watch, I'll simply leave an HDMI pigtail plugged into the back of my flat-screen Panasonic Viera; then take my laptop to the living room and plug the pigtail into the laptop output.  I am using Windows 7, but a close friend has an Apple IMAC 2.7 GHZ with Quad Core Intel I5 processor and his results are exactly the same. I believe this product is flawed.  I would have given it zero stars, but that is not an option within Amazon. My recommendation is: don't purchase right now; instead, wait for competition to drive improvement in this flawed technology. Give it another 6-12 months. In the meantime, I reiterate, stay away from this product.", "verified": true, "helpfulness": "6/6", "author": "Donald R. Davis"}, {"rating": 4.0, "review": "We got this to be able to go wireless from the computer.  It seems to take up a lot of wifi slowing down the connection to the computer/phones.  Just going to go with the wire for now.  =(", "verified": true, "helpfulness": "0/0", "author": "JnKBos"}, {"rating": 4.0, "review": "It works great. Almost makes my plain vizio flat screen look like a smart TV. Netlix, pictures, you tube and hulu play great. Hulu tends to buffer a lot however this might be due to my home internet. I have already recommended it to friends.", "verified": true, "helpfulness": "0/0", "author": "Misael Zambrana"}, {"rating": 1.0, "review": "For iOS devices only two app can be used: Netflix and YouTube, but Netfix doesn't work.Also, the customer service is very bad. They keep saying that the only solution to the problem is to wait for a software update and they lie saying that the next update will be in a few days.Very disappointed!", "verified": true, "helpfulness": "1/1", "author": "Alexander Gonzalez"}, {"rating": 5.0, "review": "Got Chromecast for Christmas.  I loved the idea of using my tablet or phone instead of a stupid Roku or Apple TV remote which feels like I'm using a 2003 Ipod to control the TV.  I have been a longtime Roku user, with the LT, XD and XS. Even at the highest end, the Roku is glitchy at times.  I, however, do love the content it offers and the idea of streaming what I want when I want it.  I have also used the Apple TV and both are horrible replacements for content surfing while adequate devices for streaming.  Let me repeat, god awful content surfing.  For those unfamiliar, finding a show on your current cable remote is quick, intuitive (up or down for channels, its simple math), and familiar (decades of the same categorization and channels).  You can forget about quickly scrolling through programs or finding content easily on Roku or Apple TV.  Most of this is due to how to access the content and search through it.The first thing I noticed about the Chromecast was that it was so easy to setup!!!The second, it is quicker to stream than my Roku XD on the same TV using the same Wifi.  Imagine, almost zero lag and download time to watch a show!  No buffering!Third, it is extremely quick to find content on my Nexus tablet or smartphone!  Cast it to your TV, it uploads in a few seconds, and then keep searching for content or play candy crush, it doesn't matter, because the Chromecast does it all after its cast freeing up your smartphone or tablet.  It works flawlessly.  Imagine, being able to scroll through page after page of apps, Swype or use voice recognition and Google to find a show, and launch it.  You are using the full power of your smartphone or tablet.  This is not just some stupid remote app on your phone or tablet.  This is simply finding something on your phone or tablet like you normally would, as if you were going to watch it or listen to it on that device (yes, very quick), and hitting the little cast icon that will fling it to the chromecast.  Unlike Airplay, it is instant and fluid.  Let me repeat, the beauty here is that you aren't looking up or doing anything differently than you would normally on your phone or tablet.  So, if you are a power smartphone or tablet user (iOS or Android), you will be a power caster with the chromecast.  Sounds tempting?  This doesn't require learning a special roku app or comcast or Fios app to make it work, use your regularly supported Netflix, Hulu, Youtube, Pandora, etc. Apps that you always use, and hit the \"cast\" icon.It is also fun having a group of people together and if someone wants to change the song, they simply cast from their own phone from Pandora. They don't have to setup Chromecast on their device or anything.  Don't ask me how it works, its just magic.  If you have a party of 30 smartphones, you could technically have 30 remotes.Trust me, what Chromecast did that was special here isn't the price.  What they did that is special is removing the streaming functionality out of the device, unlike Apple Airplay.  The Chromecast handles all of the grunt work allowing for your second screen phone or tablet to be a supersmooth touchscreen remote that only searches and controls the device at blazing speeds. None of your RAM is being used to support Chromecast.  100% of your smartphone or tablet's memory is free to do what it always wants to do... Candy Crush while watching tv! j/k  (sort of)It has now effectively replaced my Roku on that TV.Let's not get started about Apple TV, it is a gimmick device with none of the polish of other Apple products sold to iSheep who blindly buy anything with an Apple logo on it.  Also, iTunes is also a joke where your content isn't YOUR content unless you hack into it and rip the movies and songs yourself using things like doubletwist. If that's you, then you should only read this \"Chromecast does not have an Apple logo\" and ascertain that it is garbage because of that.My biggest issue with Chromecast is the lack of Amazon Prime support unless casting from a laptop. However, for the price (even though I didn't buy mine) this device can't be beat.  I will even go as far as saying that even at the same price, I would prefer the Chromecast to my HD Roku device.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Basically, you will buy this if you love watching YouTube on the big screen. Not what comes to mind when you order. Want to use this Google product with a nexus tablet? Forget it. Want to stream amazon bids? Forget that too. Want to cast your browser or photo for presentations ? Nope.  I will say this- the glowing blue plug will entertain the average chromecast customer for hours.Thanks Goongle.", "verified": true, "helpfulness": "0/3", "author": "D"}, {"rating": 5.0, "review": "Eliminates the need for external boxes or integrated 'smart apps' in your TV and/or Blu Ray player. I've used this to stream Netflix from my android phone and iPad countless times and it is great. Will also stream Chrome browser windows well.Its easily worth $35 for Netflix streaming alone.", "verified": true, "helpfulness": "0/0", "author": "mdb"}]