[{"rating": 3.0, "review": "I think chromecast is a great alternative for someone who has netflix but does not have a roku, smart tv, blu ray or gaming system. The most important feature to me was the advertised ability to stream local files from your desktop to your tv in the other room. I also am an avid firefox user and was disappointed that only google chrome is supported,The cast this tab feature in chromecast does allow you to stream some movies and other media stored on your desktop. By pressing CTRL + O it allows you to open x264 and mp4 files. It does not have support for xvid/divx or .avi and sometimes it streams but without sound. It also will not give you near the video quality as casting from netflix or youtube.When casting a tab or videos in my case which I was most excited about anything it is only watchable in 420p which is the lowest setting. Anything higher will lag and have motion blur in fast moving scenes,Another thing to point out is most of the apps except youtube and netflix require you to have a smartphone to use the apps. Also the setup is fairly easy if using a mobile phone. If using a desktop the only way to get it to work is by either having a wireless pci card installed or by using a laptop with built in wireless.Overall I was fairly impressed with the video quality in netflix and youtube but fairly disappointed in the lack of support for adiitional apps as well as the lower quality streaming when casting local media from your computer. I think it is a decent device for the money and someone without any other way to get youtube and netflix from there smartphone to tv.Hopefully in the future google will release the api to allow 3rd party developers to design chromecast support into there apps.If more apps become supported the value will go up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I travel often and get tired of looking at either a laptop, tablet or phone screen,  This allows me to turn any hotel TV into the monitor to look at what I want without squinting.  Haven't found a State or Country yet that I haven't been able to use this in", "verified": true, "helpfulness": "0/0", "author": "kkursar"}, {"rating": 1.0, "review": "I purchased Chromecast with the goal of playing my Dish Network's DVR (via Slingbox) to a TV my wife have that is not connected to Dish. Well, of course that didn't work. And, while the product's description gives Google an out by noting that it transmits \"select\" content through the Chrome browser, this $35 electronic toy essentially does what every Blu-Ray player does EXCEPT it lacks the choice of dozens of apps and the ability to play DVDs. This thing has been marketed as an alternative to paying for cable/satellite. Yet, to use the HBO app (1 of the 6 apps that this product supports), you not only have to have a basic channel package, you have to have HBO. Also, I don't see the financial sense of spending $35 and only having access to 6 apps, rather than a few bucks more to get a wireless Blu-Ray player that has many more app choices and the ability to watch movies on DVD. I know there will be many Google fans that will find what I wrote as heresy, but I found this product to be worthless beyond my initial (failed) goal for it and returned to Amazon.", "verified": true, "helpfulness": "0/1", "author": "D. Heintz"}, {"rating": 1.0, "review": "Only has You Tube and Amazon no Net Flix so very limited, Quite honestly not worht it to enable remote from iphone etc, Regardless still needs a remote of some kind different than that used for reg TV. Worthless to me", "verified": true, "helpfulness": "0/3", "author": "Tom Matich"}, {"rating": 2.0, "review": "Router must support UPnP. For a list of compatible routers, google \"chromecast compatible routers\" and it should be the first hit (on the Google support site).Frame rate is okay for supported apps like Netflix, but if you're streaming flash video from another website (like Amazon in flash mode, at time of writing) playback is unbearably jerky.  Until they get better app support, the Chromecast is really only good for Netflix and YouTube. The other supported services I've never heard of and don't look interesting.I recommend getting a Roku 3 instead, even though it doesn't support YouTube. The Roku 3 has Netflix, Amazon, and many others with *very* smooth video. I hear the Roku 2XS is also very good.", "verified": true, "helpfulness": "0/0", "author": "Radovan"}, {"rating": 4.0, "review": "Easy to install and use. Cheaper than a roku and almost as good. We have an older DVD player in our bedroom that doesn't have streaming capability. I did not want to buy a new Blu Ray because we rarely use the the DVD we have in the bedroom. The picture streamed doesn't seem as sharp as the cable but very acceptable. If I wasn't so picky I would would have given the device a 5. The size is a nice plus.", "verified": true, "helpfulness": "0/0", "author": "James C. Husbands"}, {"rating": 5.0, "review": "This is a great way to share Netflix with the TV. I recommend this product. I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Christopher Davis"}, {"rating": 3.0, "review": "Casts only netflix or utube. No instructions on how to choose other options.  Picture is great. Instructions are minimal.  Hope they update as the cost is great.", "verified": true, "helpfulness": "0/0", "author": "Kay Stringer"}, {"rating": 5.0, "review": "Have a video on your phone that you want everyone to see? How about watching YouTube videos together? Chrome lets you put it all up on the TV screen within seconds. Easy to set up, easy to use. Great product.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 3.0, "review": "Have to use some workarounds to get it to play Amazon instant video at all, and even then it is horrendously choppy.  YouTube 'casts' well, even the NY Times videos worked well through the chrome extension, but not working with Amazon instant video made what would otherwise have been a 4 rating drop to a 3. Also don't like that it will not automatically start the next episode when you are using Chromecast with Netflix  (whereas when watching Netflix on a computer, it starts the next episode automatically with a 15 second delay).", "verified": true, "helpfulness": "0/0", "author": "Aboyd"}]