[{"rating": 5.0, "review": "The headline sums it up. We watch more shows on this device than on cable. I've had mine since they were first released and it's still the fastest way I've found to access You-Tube, HULU Plus, Amazon Prime, etc. The relatively snappy interface makes even the latest \"Smart TV\" seem painfully slow by comparison. The picture and sound are noticeably better then any similar device I've tried. Some apps had a few rough edges in the beginning but most have continued to improve since the Fire's release. A recent software upgrade now lets you put it into sleep mode (nice). The voice search function works great but is limited to Amazon and a few other apps.On the downside, I've noticed more commercials sneaking into many of these apps lately - a disturbing trend but not the fault of the box so we'll not kill the messenger.", "verified": true, "helpfulness": "0/0", "author": "R. Stoer"}, {"rating": 5.0, "review": "The Amazon Fire TV is a great way to watch movies and TV shows. The installation was very easy and it works very satisfactory with my \"slower\" DSL internet connection. I completely recommend this component.", "verified": true, "helpfulness": "0/0", "author": "Zack D. Ellison"}, {"rating": 4.0, "review": "I love almost everything about it, except for the UI.If it would use the same format as the Roku it would be a perfect 5 star.", "verified": true, "helpfulness": "0/1", "author": "Realmhunter"}, {"rating": 5.0, "review": "I love this!! Should have done it a long time ago!!!", "verified": true, "helpfulness": "0/0", "author": "Michelle P."}, {"rating": 5.0, "review": "Absolutely love this! Blows the Roku out of the water. Lightning fast. Very impressed!", "verified": true, "helpfulness": "0/0", "author": "Michael Clute"}, {"rating": 5.0, "review": "This is my second box.  It works great on my wireless network.  It does not interfere with the first box at all.", "verified": true, "helpfulness": "0/0", "author": "Timothy Kedzior"}, {"rating": 5.0, "review": "just what I wanted", "verified": true, "helpfulness": "0/0", "author": "mike riley"}, {"rating": 5.0, "review": "This an amazing little box.  Setup was easy as pie.  I had this puppy for about a week and it works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Curby"}, {"rating": 3.0, "review": "The reason I gave it Three Stars is Netflix streams very slow and has to stop playing to often. If it wasn't for that problem I would have given it Five Stars.", "verified": true, "helpfulness": "0/1", "author": "Raythill \"raythill\""}, {"rating": 5.0, "review": "My first set top box. Great interface. Small footprint. Don't know what else to add, really.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]