[{"rating": 1.0, "review": "not that good!!!  I will not recommend product to any one, it does not fulfill the function. do not buy it", "verified": true, "helpfulness": "2/4", "author": "FV"}, {"rating": 5.0, "review": "Because it's awesome. It's Easy to set up and works well. I have 2 in my home.well worth the 35 bucks", "verified": true, "helpfulness": "0/0", "author": "Sarah Maria Sampson"}, {"rating": 4.0, "review": "The Good:Streaming through the Chromecast apps like Netflix and Youtube works very well!The So-So:Casting webpages from Chrome was mediocre. Videos would be laggy on the very lowest quality settings, but they were watchable. This might be due to having an older laptop and not the fault of Chromecast.The Bad:When I first began using Chromecast with Netflix, the internet became unusably slow on all my other devices. For example, some pages timed out before loading. After extensive searching, I discovered there is a list of compatible routers. My router was listed as compatible but with only one version of firmware that was older than the current firmware installed on my router. I decided to upgrade the firmware on my router anyway and hoped for the best. The upgrade did the trick and now all my devices work while Chromecast is active.Overall, I found it frustrating that router compatibility is such an important aspect for Chromecast, yet is so poorly addressed. However, once I was able to remedy the situation, I am quite pleased with the product.", "verified": false, "helpfulness": "0/0", "author": "Margaret Moser"}, {"rating": 5.0, "review": "Streaming has never been so enjoyable.  I am a Netflix subscriber and this makes the viewing experience more enjoyable.  East to set up.  Easy to use.  Works well with Netflix or streaming other TV shows I have missed right off of the network sites.", "verified": true, "helpfulness": "0/0", "author": "Violet Rae Webster"}, {"rating": 1.0, "review": "I wanted something to allow me to watch my Chromebook screen on my projector.  I do something like this with my Mac and Apple TV.ChromeCast is just slow and has compression artifacts.This device is sold for about $35 and is not worth the price.  Every company has a dog of a product now and then.  Google really missed the mark with this one.", "verified": true, "helpfulness": "1/2", "author": "R. Perrin"}, {"rating": 5.0, "review": "This little device does what it is supposed to do, and it does so without crashing, or being difficult to set up and use. The Google Chromecast HDMI Streaming Media Player is an excellent value at its introductory price point, and while it doesn't offer some of the functionality of an Apple TV or an Android HDMI dongle/box, it is a solid performer.", "verified": true, "helpfulness": "0/0", "author": "JAG"}, {"rating": 5.0, "review": "In the past I have tried AppleTV, Roku, and other devices to stream from my computer or tablet to the TV and non met expectations. The chromecast definitely has made cutting the cord a lot easier. The quality of the streaming is great and you can still use your tablet/phone/pc to do other things while you stream. I ended up purchasing 3 more of these as gifts.", "verified": true, "helpfulness": "0/0", "author": "Josh \"Josh\""}, {"rating": 4.0, "review": "C'mon this is amazing! We can turn our tv into a smarttv with HBO Go, Hulu Plus, Netflix and some other random ones for $35!! I will give this product 5 stars when Spotify and amazon-prime apps work.  Right now they work through the chrome browser but its not the same.", "verified": true, "helpfulness": "0/0", "author": "deathntaxes"}, {"rating": 1.0, "review": "I just spent a frustrating hour and a half trying to set up my Chromecast.1.  I tried to use my iPad.  It's an iPad 1 and won't accept the App.2.  I tried to use my laptop.  First I had to download and install Chrome.  Then it wouldn't work because its running Windows XP.3.  I finally tried my iPhone (not my preferred internet device).  I installed the app then followed the instructions and found the Chromecast code number'ed network.  Named the net and then finally decided I was supposed to return to my own WiFi network.  Then it wanted my WiFi password.  While I went and found it, the connection timed out.  I tried to restart it, but kept looping back to the first screen.I've given up, I will return the Chromecast to Amazon for a refund!!!!", "verified": true, "helpfulness": "1/3", "author": "John Robertson"}, {"rating": 5.0, "review": "We already have APPLE TV, although CHROMECAST doesn't offer everything that APPLE TV does, its a nice alternative to have in addition for another TV in the home.  LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Mary O"}]