[{"rating": 4.0, "review": "I've had Fire for 3 months now and I love it. I've got almost 300 movies and tv shows in my Watchlist, and over 70 in my Video Library.... BUT I'm saving 5 stars for when the interface is drastically improved. AMAZON, if you want us to use you to replace cable and/or our shelves of dvds, you have GOT to give us some designability. We should be able to catalog both our Watchlist and our Video Library with custom folders. Shuffling through 300 items on my Watchlist (some Prime, some not- some tv, some movies) ONE AT A TIME is simply stupid on your interfacer's part. I love Fire, don't get me wrong. I went with Amazon because I trust you're going to dominate the market and lead the way to the free agent cable of the future. But clean up the interface already. You're better than this.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Stahl"}, {"rating": 4.0, "review": "The only reason it does not get 5 stars is because Net Flix is a bit glitchy, on rare ocassion.  But never the less it is.  On ocassion I have to clear the cache or sign out completely of netflix completely and then log back in for Net Flix to work properly.  But everything else about the Fire TV is fantastic!", "verified": true, "helpfulness": "0/0", "author": "T-Bone 5-2"}, {"rating": 2.0, "review": "After some use it loses the youtube channel. It does not let it fill the screen like it did at the start. It is very frustrating.", "verified": true, "helpfulness": "0/1", "author": "Tammy J"}, {"rating": 5.0, "review": "Awesome,great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Having trouble with the sling TV app.  Locks up but will play on tablet.  Other than that one issue I like the fire TV and ease of use.", "verified": true, "helpfulness": "0/0", "author": "jeff jacob"}, {"rating": 3.0, "review": "Love the fire tv experience. Don't like not having an actual power off button.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I thought I was getting something a bit different.  There seem to be a lot more fees and Amazon Prime in almost a must.  I like to leave the TV on while I am not at home so the pets have music to listen.  Unfortunately it shut off automatically after two hours.  Just did not meet the expectations that I had in mind.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey W."}, {"rating": 5.0, "review": "Goodbye DVDs and music CDs.  Hello to a whole world of movies and TV shows and music at our fingertips, plus slideshows of our own photos, and apps that allow us to do even more.  Amazon Fire TV has changed the way we view media.  We heavily use ours and find it makes an incredible gift as well.", "verified": true, "helpfulness": "0/0", "author": "Mary Beth Guard"}, {"rating": 5.0, "review": "Love it. Very fast, easy to use. Voice works great. I have Tokugawa as well but this is way faster and easier.", "verified": true, "helpfulness": "0/0", "author": "jd"}, {"rating": 2.0, "review": "Not there yet.  It can't replace nor offer the user anything improved over a Roku, except for the voice feature.  The voice feature however is more of a nice to have, doesn't make the unit better than a Roku. I have 3 Roku's in my house and figured I would supplement with this.  I love Amazon and really wanted to like this.  But too many things turned me off.  I felt like I had to struggle to get what I wanted. The user interface just can't compete with Roku's.  One thing I noticed was the absence of TWC TV,  That was a huge deal breaker for me.  I also noticed the YouTube app was the outdated old version that was a pain to use. Oh well.  Maybe in the future....", "verified": true, "helpfulness": "0/1", "author": "Roger Montoya"}]