[{"rating": 5.0, "review": "Very fast and easy to use. I like the voice search and can't wait till it searches across all installed apps.", "verified": true, "helpfulness": "0/0", "author": "Ryan & Larisa"}, {"rating": 5.0, "review": "Works better than I expected.", "verified": true, "helpfulness": "0/0", "author": "ROBERT PEACH"}, {"rating": 4.0, "review": "Great little product but it still has a ways to go. First they pimp put amazon stuff way to much for my taste... yes I know it's an Amazon product but if you want your device to become more than a niche player you need to make it fairly agnostic in the way it does things. It's definitely faster than the Roku by a large margin, but the Roku is much easier to navigate channels and has a ton more of them.This product has a lot of potential, especially since you can side load android apps if you take a few minutes to browse the interwebs for instructions. And if they can get companies onboard like Roku did this thing could be really great. If nothing else it might force Roku to up their game with a better device, their current ones are slow and have craptastic wireless.", "verified": true, "helpfulness": "1/1", "author": "Notyourfather \"HereorThere\""}, {"rating": 5.0, "review": "Great so easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "terrible reliability. Batteries in remote burn out quickly. Unit unstable, needs constant reboot.", "verified": true, "helpfulness": "1/1", "author": "Compo"}, {"rating": 3.0, "review": "I have 4 ROKUs and decided to try the AFTV because of the voice search feature. It works very well but to be honest, I am used to going to my Fox News Channel Application on a daily basis. It is not currently available with this device. ROKU has it. I don't know whether it is missing because of some Amazon political bias, but I figure that if they have CBS and other such garbage available they should have FNC. As a shareholder of Amazon I would really like to know why it is not available.Apart from the voice search, I do not think that the AFTV is nearly as good and easy to use as ROKU.", "verified": true, "helpfulness": "3/4", "author": "George Parker"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Daryl A. Johnson"}, {"rating": 4.0, "review": "Set up was easy.  However I had a problem settin up my Netflix to this machine as I could not find the app to down load.  It seems as smooth as Apple TV, and less as expensive.  Very good buy for me.", "verified": true, "helpfulness": "2/2", "author": "Louis"}, {"rating": 1.0, "review": "Be adviced that the device is very closed and can't be rooted. For some reason Amazon decided to close their version of Android which went out of style with other manufacturers ages ago. Don't buy, you will be stuck.", "verified": true, "helpfulness": "2/9", "author": "Amadeus"}, {"rating": 4.0, "review": "This little box is grey.  I recomend it to any one who needs peace of mind.  Just give it  a try.", "verified": true, "helpfulness": "0/1", "author": "Theodosia Appleton"}]