[{"rating": 1.0, "review": "I've not even unpacked my new Fire TV, user manual and extended warranty when Amazon e-mails their new promotion saving of about 20% of my original purchase price 4 days ago. Now I have wasted time trying to contact somebody who cares. Where is the e-mail to give me the new promotional pricing and in closing how about a sales rep I can actually speak with. U have all my #'s.", "verified": true, "helpfulness": "2/13", "author": "Patrick Tatum"}, {"rating": 2.0, "review": "TW stars, but I am going to keep it and use it.This thing freezes very all the time, it's like it doesn't like a block of data and has literally spun for 24 hours until I have eased it forward or backwards to try to get it going again. YouTube is especially egregious.  It hangs up in the middle of an operation, select a video,screen goes dark, you wait and wait until you get frustrated and try resetting by unplugging. It is a dreadful placeholder product that points at the functionality that I really want.Navigation is weird, it almost seem random in some apps and in Netflix it is the opposite of what my computer shows, right to left.They should get rid of the voice search gimmick and increase the data buffer.  I will click on a movie and walk away for 15 minutes if it will play back better than a satelite tv in a heavy rainstorm.I'd rather have a gimcrack instruction than a goofy feature. in a product.I actually bought an Apple TV from a recommended Vendor called Big Daily Deals (Moses Lefkowitz) It never arrived and they basically brushed me off when I attempted to find my stuff or the vendor who disapeared one day after I ordered. All to often success falls to arrogance, don't ruin it Amazon.", "verified": true, "helpfulness": "2/10", "author": "Vashti Bunni"}, {"rating": 4.0, "review": "Finally purchased after months of comparing and indecision. So far we're happy with the device. (Although I'm very unhappy that the price dropped a few days after ordering! That's one of my pet peeves with Amazon.) Anyway, we love how smoothly it streams Netflix and Amazon Prime - no pauses, delays or reloading so far. My kids love the games and my son is already asking for the game controller. Netflix is more confusing to navigate than it was on our old device and you can only use the voice search for Amazon Prime content, which is annoying. There are no controls on the device itself and the remote is small, so hopefully we won't lose it in the couch any time soon! I do wish there was a Firefox app available and that the Starz play app worked with it so I could watch Outlander. Overall, we're happy with our purchase!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rschuurman\""}, {"rating": 3.0, "review": "After having this for 4 months now, I must say that I'm a little disappointed. It worked great at first however it seems to act up more and more the longer I have it. (ie shows not loading or picture freezing etc.) I had my internet connection tested and it was good, so its not that. To top it off my remote stopped working and there is only a 90 day warranty on it. Looks like I will have to buy a new one.", "verified": true, "helpfulness": "3/4", "author": "Thea Edmunds"}, {"rating": 5.0, "review": "Wow! This is wonderful. The shows I want at the time I want them. It is saving me $70 a month on bills for cable service. Thank you.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Amazon has created a dandy streaming box in the Fire TV. Roku now has serious competition. As a long-time user of Roku boxes, I didn't think streaming could be better than the Roku 3. Wrong. Fire TV features surpass Roku 3 in every way that counts: easy set-up, power, clarity of picture, connection to a network (and it picked up every network in my neighborhood), and the voice-recognition search. Everyone from the tech-y nerd to the technophobe should like the interface. And did I mention, the terrific voice search? Easy as touching a button on the remote and speaking into the microphone. So, Fire TV does what it should in an easy and fun way, and at a great price. What's not to love?", "verified": true, "helpfulness": "0/0", "author": "Spot the Dal"}, {"rating": 5.0, "review": "This is a must.  Hook it up to your home theater and enjoy Amazon Instant Video and Prime Music.  Also I am amazed that we can view all our family photos on the big screen in the livingroom from Amazon's cloud storage.", "verified": true, "helpfulness": "0/0", "author": "Steven M. Goff"}, {"rating": 5.0, "review": "After I posted the review below, I played around with the remote and although I don't know exactly what fixed it, it is fixed. And the Fire TV is excellent. The voice search is fantastic and the speed of the streaming is amazing. So well done, Amazon, you made a great product.First review: Well, I don't hate it, because I don't know if it works. This is because I bought it for a trip to the UK over summer and never got to use it, as everywhere had adequate TV. Got back to the US and tried to connect and the remote is dead. Changed batteries, did all the screen prompts said, but it wouldn't come alive. Then tried to return for a replacement and it is out of time! So will have to go through a phone call and see if Amazon will change the remote or the whole thing. Hope so, because it sounds a good way of accessing content. just can't tell because of a faulty little remote.", "verified": true, "helpfulness": "0/0", "author": "Mark Norman \"Eamon Dyen\""}, {"rating": 4.0, "review": "I really like my Fire TV. The apps that I use the most are Netflix and Plex. Specially Plex, is supperb. But I really would like that more streaming services would add their apps, like Crunchyroll, for which I'm a subscriber. If Amazon keeps on getting this services, and helps them integrate into the voice search, this would be a perfect device.", "verified": true, "helpfulness": "0/0", "author": "Otto Voss Maisterra \"Otto Voss\""}, {"rating": 1.0, "review": "At the moment, it won't connect to my internet at all because I have to enter personal credentials (live in an apartment where the realtor provides internet) and I have no direct access to my router.", "verified": true, "helpfulness": "4/20", "author": "Amazon Customer"}]