[{"rating": 5.0, "review": "Had an Apple TV for years, and it worked well.  The first Fire TV delivered wouldn't allow me to sign in even after a couple of dozen efforts.  The on screen keyboard kept malfunctioning and couldn't be corrected even after a couple of hours with an Amazon Fire TV adviser.  Received a new one the next day which worked as it should and returned the original.I bought the Fire TV because of the greater built in memory and the remote's voice command feature, which really works well.  A creature of habit, it's taking me some time to adjust to its differences from the Apple TV, including the remote control (nice but small so don't lose it).Overall, it's a nice piece of equipment, and I'm glad to have it.", "verified": true, "helpfulness": "0/0", "author": "ancientmariner \"a.m.\""}, {"rating": 5.0, "review": "The Fire Tv is easy and great.", "verified": true, "helpfulness": "0/0", "author": "Suz zen"}, {"rating": 3.0, "review": "The voice-command is uncanny.  It accepts my input and responds immediately, even to such complicated ones as:  \"24, Season Seven, Episode Six.\"Now for the downside ... As a person who is a bit hard of hearing, I depend a great deal on closed caption and trying to get this seleced on \"Fire\" iscomplicated and confusing.  Compared to Roku, Amazon Fire doesn't show as many genres and it can become quite a mess when trying to find something new.  Perhaps after I \"live with Fire\" a while I'll get used to it.  But in the meantime--those danged closed captions!!!", "verified": true, "helpfulness": "1/1", "author": "John A. Truett"}, {"rating": 5.0, "review": "Best investment ever made. Every household should have one.", "verified": true, "helpfulness": "0/0", "author": "DAN MUNOZ"}, {"rating": 5.0, "review": "Coming from a home full of Apple products and many Apple TVs, I gave this a try. Wow - very, very nice. Super fast, app store apps, and on top of everything else -- the finishing touch of having it set up for my account directly out of the box?? Nice. I'll be getting more of these.", "verified": true, "helpfulness": "1/1", "author": "Jim in Carmel, CA"}, {"rating": 5.0, "review": "Really fast, small, high quality in video and sound and affordable", "verified": false, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Meets all our expectations.", "verified": true, "helpfulness": "0/0", "author": "Barbara Traver"}, {"rating": 5.0, "review": "Alternative to Cable - Watch what you want when you want to!So many TV programs & Movies to choose from.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 4.0, "review": "Great for streaming but the voice feature needs a little work.", "verified": true, "helpfulness": "0/0", "author": "steve musick"}, {"rating": 5.0, "review": "Pros: FAST. Lots of content. Fast. Did I mention that it's fast? Cons: It's the most soulless android device I've used. Zero customization allowed and the interface just isn't very interesting. But that's not why I bought it. I bought it bc of the content available and was pleasantly surprised at how quick and snappy the little box is.", "verified": true, "helpfulness": "0/0", "author": "Chris"}]