[{"rating": 4.0, "review": "Works as well as my Apple TV and a lot cheaper. Works well with my PC's", "verified": true, "helpfulness": "0/0", "author": "David W"}, {"rating": 4.0, "review": "It casts live stream from computer, using a Chrome browser.  It works good, but drops the connection fairly often.  I then have to go open up Chromecast and re-cast the signal.  It's pretty good, considering the fairly low price for it.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey M. Gabby"}, {"rating": 5.0, "review": "Bought 4 of these and love them", "verified": true, "helpfulness": "0/0", "author": "J. Edward Dalton Sr. \"Eddie\""}, {"rating": 1.0, "review": "Barely usable. In my experience, this thing has been a nightmare. Was trying to cast YouTube vids, but it always cuts out. It seems to me they rushed this thing to market. I'm gonna toss this thing out a window, that's how bad it is.", "verified": false, "helpfulness": "1/1", "author": "Matthew Walsh"}, {"rating": 5.0, "review": "Works very well and is as good as it was claimed to be, very satisfied!  Dealer had product here on time and in great condition.", "verified": false, "helpfulness": "0/0", "author": "Knocky !"}, {"rating": 5.0, "review": "The package arrived on schedule I cast my 1st cast within the first 30 min. It went into update shortly after. This thing is great! It gives me what I want to watch! Thanks again.", "verified": false, "helpfulness": "0/0", "author": "rinda e"}, {"rating": 5.0, "review": "I love my chromecast.  Since I travel a lot, it's way more convenient than an AppleTV or a Roku due to it's small size.  It's about the size of a large thumb drive.I watch a lot of YouTube videos on it.The app and connection on iPhone is a bit quirky, but you get used to it.  It won't directly connect to a network that requires you to go to a web page and agree to terms to activate your connection.  So I bridge through my laptop.  This way, I also don't have to reconfigure it for a new wifi hot spot every time I change locations.Obviously it requires a certain amount of bandwidth to function properly.  But all things said, you won't beat the value.Grab one of these and you wont be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Jeff C"}, {"rating": 5.0, "review": "I really enjoy using the Chromecast.  It has its quirks, and limitations.. however at its low cost I can't complain too much.  I would like to see more software for Chromecast like Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Zoinks! \"MANUTD FAN CLUB OF ATLANTA, GA\""}, {"rating": 4.0, "review": "Works pretty well... there is some lag when playing videos, but works well overall. I really wish they would support Spotify and Amazon Instant Video", "verified": true, "helpfulness": "1/1", "author": "Roken"}, {"rating": 5.0, "review": "Value for money", "verified": true, "helpfulness": "0/0", "author": "SD78"}]