[{"rating": 4.0, "review": "I bought this in Dec. of 2013 and was so impressed by it I added one more to another TV.  It connects really easily to your WiFi and the setup is pretty smooth.  As long as you have a medium to great connection to your WiFi the video will have a great resolution!  I mainly use\\used it for Netflix, YouTube and HBO GO.  All work really well!!  Another cool feature, if you TV supports it, is if you start Chromecast from your phone, tablet or PC it can automatically change your TV to the correct input.  In other cases, it can actually turn your TV on then switch to the correct input.  I do wish you could just put your own pictures straight from your phone to your TV.  The streaming feature from your laptop can be pretty annoying to horrible with the lag.  At this time I am not really fond of it and have avoided using it after a few hours playing around with it.Pros: - Easy Setup - Easy Manageability - Super Affordable - Netflix, YouTube and HBO GO on the goCons: - Needs more streaming apps - 1st party support to show your own videos and pictures from your phone or tablet - Laptop streaming is really badConclusion: - $35 for a streaming device that has a great potential to get better you really can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Corey"}, {"rating": 4.0, "review": "It has allowed me to watch Netflix and YouTube on the TV, but that's all.  Pausing and moving around the movies is a little slow.", "verified": true, "helpfulness": "0/0", "author": "Dane Swenson"}, {"rating": 5.0, "review": "I just love it a I had Apple TV and I like this much better!Very easy!Check it out!You will love it!", "verified": true, "helpfulness": "0/0", "author": "Carolwkelly \"foxie\""}, {"rating": 1.0, "review": "With all the wait (and wait) for this device, I was very disappointed with the product. It doesn't work and the response time from customer service was long and not satisfactory. I'd change my mind if I could get the thing replaced but I've heard NOTHING.I was a GOOGLE fan (I love my Chromebook) but now...my last major IT purchase was from the land of Mr Gates.", "verified": true, "helpfulness": "0/3", "author": "Mark F. Schauwecker"}, {"rating": 5.0, "review": "I am kind of an experimenter regarding HTPC setups. I have a dedicated linux storage+media server, a Raspberry Pi with Raspbmc, and now Google Chromecast. I would say that Google Chromecast is imprescindible. It still lacks some app support, Vimeo being one of those, but I think that is only a matter of time. Good combo with Plex also, but wait until the Chromecast feature is open and not the steal that it is now with they Plex Pass stuff.", "verified": true, "helpfulness": "1/2", "author": "Guille"}, {"rating": 4.0, "review": "It works great I just had to download another video player which is no big deal. Very fun...now I can watch a video on the big screen instead of the Galaxy S4 screen!", "verified": true, "helpfulness": "0/0", "author": "T Cumberworth"}, {"rating": 4.0, "review": "chromecast wouldn't work with asus tablet.  Got error message 16003 which I saw that many others got also.  Works well on kindle fire.", "verified": true, "helpfulness": "1/1", "author": "Lyla C. Slayton"}, {"rating": 5.0, "review": "Nicely priced for an amazing piece of technology!  It hooks up easy and we now watch many things from laptop to HDTV.", "verified": true, "helpfulness": "1/1", "author": "TreuxLamour"}, {"rating": 5.0, "review": "This worked great for my parets who watch a lot fo youtube videos they don't have to sit in front of a computer anymore", "verified": true, "helpfulness": "0/1", "author": "Francisco Castello"}, {"rating": 5.0, "review": "I thought that the setup was easy and it streams perfectly. Overall, I am very happy with this Chromecast purchase .", "verified": true, "helpfulness": "0/0", "author": "Stephen Kalies"}]