[{"rating": 5.0, "review": "I received a new Kindle Fire TV from my wife and we've really been enjoying it.  It’s attractive, seems well built and is fast.  I’m assuming that with all of the processing power and memory this thing has in it Amazon must be selling it under cost. I guess their loss is my gain.  It’s a great value for the price.I really like the easy access to all of the free Prime streaming content.  I’ve watched a bunch of the new Amazon studios pilots and they’ve picked up a few shows I really like including Bosch and renewed Alpha House.  I liked Betas but I guess I was in the minority.  I also appreciate all of the free content Amazon has been adding.  Tons of stuff here if you poke around and if you like to watch things on your big screen like I do rather than the ipad, kindle or CPU then the fire is the way to go.One of the best features about the Fire that I hadn’t initially realized is that since I own a Kindle Fire HDX I’m able to ‘fling’ shows that I am watching on an HDX app to my TV screen.  This is an awesome feature and I’ve been using it to watch HBO Go on my TV.  Once you figure it out the first time the feature is really easy to use and seems to work on anything you have running on the HDX.http://www.amazon.com/gp/help/customer/display.html?nodeId=201453020I have a TIVO, a Chromecast and a Roku (not that I need all of these devices but I like trying the newest devices out).  When it comes to search the Amazon Fire TV the voice search is really a game changer.  With all of my other devices I can tell you I’ve done a remote control text search fewer times than I have fingers on one hand.  It’s just too annoying.  For me this is what my new Apple IPhone did for my driving and texting.  Hit a button and say what you want.  Amazon has given that to me flawlessly.  The searches are fast, the voice recognition is spot on and finally have the patience to actually search.  Tivo – nope.  Roku – nope. Chomecast – nope.  Might as well pack them up.  Of course this is gen one.  I was so eager to use voice search I was trying it with the apps and no luck.  Customer service tells me it’s coming for many other sources (it works for Vevo now which I love due to my music video obsession) but in the case of Netflix CS said they wouldn’t agree to share their data with Amazon for search.  Really Netflix, really?  I guess if amazon gets much more content I won’t need you Netflix!I haven’t spent much time with the games but I’ve played a few and they look pretty solid for this type of device.  I hope they continue to expand the set of games and offering overall.  At that point I might have to spring for the controller.All in all this is a nice opening offer from Amazon and what’s better than a slick device coupled with free Prime content (free since I’d be Prime anyway for the 2-day shipping).", "verified": false, "helpfulness": "6/6", "author": "Stanton M."}, {"rating": 3.0, "review": "I chose three stars because the Fire TV can be very good but it still needs to mature a little more. I like the features and applications available. The GUI is easy to use and pretty intuitive.There are just a couple things I have found so far that seem to be bugs which when fixed will deserve a star or two. One issue I have found is with the Dolby surround. Sometimes my audio will stop working and the Fire TV requires a reboot. This has happened a couple times but overall it seems to work correctly, maybe a problem with an app. The second issue I have noticed is also audio related. There seems to be some kind of high pitch sound when watching videos. It happens during louder scenes on movies etc. I do not notice this on my Roku or Xbox attached to the same sound system.Overall I like it but will probably stick with my Roku 3 until Amazon has had time to fix the bugs.", "verified": true, "helpfulness": "4/7", "author": "Drew"}, {"rating": 4.0, "review": "Great Quality from such a small device. I would give this 5 stars if it had the ability to change the volume of the stream being played from the remote control.I have Amazon Prime and it is not always apparent that the streams are available for free especially when you see pricing per episode and per season. If it is free to Amazon Prime subscribers then who needs pricing?I still have not tried to attach a hard drive to see if it handles stored media as well as it streams and I would like to know if the Optical sound cable would allow me to hear the 5.1 audio. the device comes with no documentation and the website does not go into detail on how the Optical sound cable option is used.I guess Amazon figures that if you have to ask then you do not need the feature! I suppose I should just get into my Gary Busey happy place and be happy I can use the voice search feature!! :)", "verified": true, "helpfulness": "3/3", "author": "F. T. Burke \"Voipmeister\""}, {"rating": 5.0, "review": "Great product delivered on time and super easy to set up. The voice function works well and the size of the box and remote are great.", "verified": true, "helpfulness": "2/2", "author": "William B Delaney"}, {"rating": 5.0, "review": "Rare I write reviews, however this on is good, Excellent vid and audio and fast. Crushes apple tv and roku.I'm the local IT guy in this rather small town. I like my techie stuff, this one is not going back, will be passed down when the next gen comes out.Only complaint, it took forever to find the remote, and the initial software download.", "verified": true, "helpfulness": "2/3", "author": "Jim"}, {"rating": 4.0, "review": "So far this product is good. I love the sleek design. This product does not come with HDMI connecter; You would have to buy that separate.The fact that they made a voice search gave this product a 4 star.", "verified": true, "helpfulness": "3/4", "author": "Love 2 Shop"}, {"rating": 5.0, "review": "Was looking at the roku or similar devices then the fire tv came out.  Since we have prime figured I'd give it a try.  So happy we waited.  Smooth operation lots of features.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This was a gift and it is the gift that keeps on giving. Only downfall is that there is no HBOGO!", "verified": true, "helpfulness": "1/1", "author": "Kassendra Paulk"}, {"rating": 4.0, "review": "Amazon TV is worth the price especially if you are a Prime Member. Nice selection, only needs to add more free programming for children.", "verified": true, "helpfulness": "2/2", "author": "Rick"}, {"rating": 5.0, "review": "My first try at this device and was pleasantly surprised with the results and would recommend the Fire tv to anyone", "verified": true, "helpfulness": "1/1", "author": "Hugh D. Allan"}]