[{"rating": 5.0, "review": "Grrat product. Excellent service.", "verified": true, "helpfulness": "0/0", "author": "Raudelhinojosa"}, {"rating": 3.0, "review": "In theory I love the ChromeCast and it does work. But there is a lag period and when you move it around to new locations (thus having to sync with different wifi spots) it takes a little time. Every once in awhile I need to reset it too.", "verified": true, "helpfulness": "0/0", "author": "Ephrata Mom"}, {"rating": 5.0, "review": "Awesome device!!! Yo can stream from almost ANY device to you TV!!!", "verified": true, "helpfulness": "0/0", "author": "Roy"}, {"rating": 5.0, "review": "best little device ever!! simple to use, easy to install, no messy connections or complicated setups... I love it", "verified": true, "helpfulness": "0/0", "author": "??"}, {"rating": 4.0, "review": "The micro cable is really flimsy. Easy to replace so it's not a deal breaker. The chromecast itself is awesome.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "luiz"}, {"rating": 1.0, "review": "I would give it a zero if I could. This thing has the worst picture. No matter whwhat device i stream from, the picture freezes or isnt smooth. If i hadn't thrown the box away, I would return it. I have high speed Internet and a great connection. Don't waste your money.", "verified": true, "helpfulness": "0/1", "author": "Kaitlyn J. Mannon"}, {"rating": 3.0, "review": "A little trouble with WIFI setup. Had to change channels on my router. I miss support for casting Chrome browser or screen on more Android devices (only 4.4 supported?; Galaxy S4 - OK, Tab S 10.5 - not OK). Otherwise an excellent product.", "verified": true, "helpfulness": "0/0", "author": "Lars Sørensen"}, {"rating": 5.0, "review": "funcionan muy bien, muy buena compra, gracias por el envio", "verified": true, "helpfulness": "0/0", "author": "Enrique Majul"}, {"rating": 4.0, "review": "It's cheeper then a roku. Good for youtube, Netflix and Hulu streaming from phone. Sometimes freezes up and requires a power reset", "verified": true, "helpfulness": "1/1", "author": "Matt N"}]