[{"rating": 5.0, "review": "Easy to use and install for the most technological incapable person.  It makes your TV \"smart\" without having to spend extra cash and purchase a Hi-Def Smart TV.  Hoping it adds more apps like CBS, ABC, etc.", "verified": true, "helpfulness": "0/0", "author": "VegiDelite"}, {"rating": 2.0, "review": "Cannot use it for displaying iPad Safari or browser related content well on any HD TV. Works only on Chrome & only on YouTube. Only grace is its $35 vs $99 for AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Anuj"}, {"rating": 5.0, "review": "Easy set-up in minutes by a non tech person. Very low cost for the value. Works great with my phone.", "verified": true, "helpfulness": "0/0", "author": "Robert R Peterson Jr"}, {"rating": 5.0, "review": "Great product. great price. Must have for android users. Now its worth it to rent movies on my phone cuz I can watch them on the big screen now..not to mention Netflix , Hulu plus, and a few others.. HBO GO.. You Tube...ECT.. and More to come they say.. for 35 bucks you can't beat it.", "verified": false, "helpfulness": "0/0", "author": "Patrick Mcglynn"}, {"rating": 1.0, "review": "It goes as far to start  to except a down load from google, but then does nothing more. The down load mode lasted for hours & confirmed nothing on retrieving any information to work on my WiFi , & I TRIED MANY DIFFERENT TIMES TO DOWNLOAD & NOTHING. LOOKS LIKE A COPY CAT ITEM OR A USED 2ND HAND ITEM THAT DOES NOT WORK AT ALL, I HAVE BOUGHT A FEW  ELECTRONIC ITEMS FROM AMAZON IN THE PAST & THEY ALL SEEM INFERIOR OR POORLY MADE PRODUCTS , NO MORE BUYING ELECTRONIC STUFF FROM AMAZON FOR ME!", "verified": true, "helpfulness": "0/2", "author": "SCOTTY"}, {"rating": 5.0, "review": "Had it for three days and could not get the thing to sync and Netflix to actually run on it.  Then magic happened on the last day when I had come to my wits end and was ready to return it. Everything synced beautifully.  My tablet recognized the Chromecast and I was actually able to view the movie on my television.  Yahoo!  I have not had any problems since then and I have watched a ton of movies and fave TV series.  This thing ROCKS!  It was the best $35 I have ever spent.  I love it and I recommend it to anyone who likes watching movies on their big screen TV.  I sure do.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"babsella\""}, {"rating": 5.0, "review": "I got tired of using an HDMI cable to stream my Netflix and HBO Go accounts.  This thing worked perfectly.  It is very user friendly and does everything automatically.  Just follow the instructions the first time.  It takes about  minutes setup and you are done.  Keep in mind that you can only stream a handful of things with this gadget.  YouTube, HBO Go, Netflix and Pandora.  So if you are buying this thinking you can stream anything on it then you will be disappointed.  Also if you already have PlayStation, Wii, Xbox, roku or any other device that streams then you don't need this guy.This is really useful when you have several TVs in the house and you don't a streamer hooked up to each one.  This thing is inexpensive and put in on any TV in the house.  Then just use you Ipad or smart phone to stream a show or movie on whichever TV you want.", "verified": true, "helpfulness": "0/0", "author": "CMB"}, {"rating": 1.0, "review": "Think the roku is better.. I was hoping that this chrome cast would allow me to just broadcast anything from my iPad or tablets, but it's only specific channels or apps.. My roku is more useful...", "verified": true, "helpfulness": "2/3", "author": "joyce li"}, {"rating": 4.0, "review": "I have the Chromecast, Roku 3, WD live, 360, and PS3.  Needless to say they each have there positives and flaws. The chromecast is nice because of it portability. However, the app selection are limited.  I was mainly using it it for HBOgo untii Prime add the shows.  Comcast does not allow Roku access to HBOgo, but they do on the Chromecast. I have  not  tried all the other apps, so cannot comment on them.  Hbogo has frozen on my phone Note 3 while it is streaming to the Chromecas.  The movie/show will play just fine except if I stop it. Then I have to go through my phone apps again. The nice thing is it will pick up where it left off.  As to the picture, it is great.  For the price, it is definitely worth it.  I would recommend that when you use it, you keep  your phone/tablet on the charger.If I had to  recommend a product for just streaming netflix, amazon, etc... I would recommend the Chromecast over the Roku 3 based on price alone.  However, I do use my Roku 3 more, because I had  it first and because of  the remote.  If I did not get my Roku 3 for next to nothing, I would  be using the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Johnnnn"}, {"rating": 5.0, "review": "It's about a week under 6 months since I got the Chromecast and I love this thing. I had just gotten a new 60\" TV and a PS4 but that left plenty of room for this little miracle in my tech arsenal. My PS4 does wonders on that new TV, but I still had a bedroom TV that had no cable and no internet streaming services. Call it a first world problem but in my case I just had to solve it. For the price, this device is a steal. When I ordered, it was still a little lacking in terms of the number of apps that supported it. Netflix was of course my main priority and it was present (I believe) from day one. Since then a great deal of apps have been updated with Chromecast support and that library grows larger day by day. Pandora, Netflix, Hulu, and even HBO GO. Newly added apps are Deezer and PBS Kids.You plug the main piece into the HDMI input on your TV and attach the included USB cable to it. If your TV has a USB port, you can sometimes use that to power the Chromecast, but it's got a long enough cord that you can easily use the adapter to plug it into an outlet just like a phone charger. You then tune to that input on your TV and you've got yourself practically the whole internet.It connects to your WIFI network, and you essentially use your desktop or laptop computer, Android (like my phone or tablet), or iOS (like my girlfriend's iPhone) device as the remote. Once you \"cast\" the content to the Chromecast though, it can be hands-off. If you turn the WIFI off on the phone that started the cast (or leave your house entirely), for example, the stream continues. The Chromecast has its own internet connection. The beauty of this is that multiple people can control the device from separate remotes.  It's even easy to move the Chromecast to a different TV - I traveled with it to friends' places with it and used it there. It's a simple case of hooking it up to a new WIFI network.The Chromecast WILL play local content as well, not just internet streaming services. There are various ways of doing this I won't get into, with Google Chrome itself as well as third-party apps on Android that make it very easy.If you're looking for something to \"mirror\" your mobile or desktop device's screen, in general you'll want to look elsewhere (like the Miracast). There are emerging plugins and uses of the Chromecast that allow for this capability but it isn't a stock feature.EDIT: The Chromecast just became *that* much better, because now you CAN mirror your Android screen to the Chromecast - and it's built in.", "verified": false, "helpfulness": "0/0", "author": "Bo Lingen"}]