[{"rating": 5.0, "review": "great product, i've made smart my stupid LCD :)", "verified": false, "helpfulness": "0/0", "author": "Maximiliano o."}, {"rating": 4.0, "review": "Great item", "verified": false, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "been using this for months now and I still love it, there are other devices some by amazon that do more for about the same price but what this device does it does well.", "verified": true, "helpfulness": "0/0", "author": "Richard M. Paniagua \"Rick P\""}, {"rating": 5.0, "review": "All was good", "verified": true, "helpfulness": "0/0", "author": "David Csordas"}, {"rating": 4.0, "review": "This is a really sweet piece of technology. I bought a small $75 TV at Best Buy for my bail bonds office and I use this device to stream/push Netflix/Flixster/Vudu movies into the waiting room in case someone brings little ones. Only downfall is it won't stream Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Shawna"}, {"rating": 5.0, "review": "Solves the purpose", "verified": true, "helpfulness": "0/0", "author": "Sandeep"}, {"rating": 1.0, "review": "I keep going to start up my chromecast and none of my devices can see the chromecast. I reset it and will set it up using my iPhone, android tablet or pc. I have no problem connecting to the chromecast to set it up. The chromecast has no problem connecting to my wifi. But as soon as set up is complete all three of my devices can not find the chromecast to cast. I have looked up several help/support pages, one being Google's own support page and can not find a definite answer to what is going on and I can not find a suitable solution. This is not the easy to use amazing device that it is advertised to be.", "verified": true, "helpfulness": "0/0", "author": "Carson"}, {"rating": 5.0, "review": "I can't imagine life without my Chromecast now that I have one. My family of 7 has 6 smartphones, 3 laptops, and 2 tablets between all of us and this one incredible product let's us easily utilize them all. It is SO EASY to use, my parents who are terrible with tech were able to learn instantly. This makes watching videos and sharing pictures on the TV super fast, easy, and simple. And the best part is that it is only $35, that is literally a price you can't beat. One of the best purchases I have ever made, don't hesitate, buy it now.", "verified": true, "helpfulness": "0/0", "author": "Moose"}, {"rating": 5.0, "review": "streaming has been true pleasure since I got my Chromecast", "verified": true, "helpfulness": "0/0", "author": "betty simmons"}, {"rating": 4.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Bennett"}]