[{"rating": 5.0, "review": "Rollin on dubs", "verified": true, "helpfulness": "0/2", "author": "Nicholas Spaniola"}, {"rating": 2.0, "review": "I bought this because I had the 30-day free Prime membership.I have the same complaint as many... there are only a handful of free shows to watch using Prime.  Prime boasts of 40,000 free titles but they are no where to be found.  I bought this for the savings but it turned out to be another scheme to get customers to spend their hard earned cash buying useless apps and unnecessary entertainment.Save your money and go for a walk.", "verified": true, "helpfulness": "1/4", "author": "Lilia"}, {"rating": 5.0, "review": "Its great not to have a bill anymore 100.00 for the box and 100.00 for access yearly. This was a good buy", "verified": true, "helpfulness": "1/2", "author": "Rico"}, {"rating": 5.0, "review": "lllllllloooooovvvvveeeee!", "verified": true, "helpfulness": "0/1", "author": "dawn"}, {"rating": 3.0, "review": "One main reason was to get showtime anytime. Guess what, cant get if direct TV customer. but the chromecast gets both HBO to Go and Showtime anytime. if all I want is to add amazon instant Video on TV, I should just go with the stick for $35. If I had different provider and got Showtime or HBO to Go I would give it 4-5 stars.", "verified": true, "helpfulness": "1/2", "author": "BDW"}, {"rating": 2.0, "review": "I may upgrade this review. First. I LOVE the ROKU. But Fire appears to have less channels. I dont see the NHL available. Private channels dont seem to be there. And the system looks more set up to be in Prime all the time than an easy portal to Prime, Hulu, Netflix and others. I hope FIRE expands on some of these shortcomings. ROKU is great.... this has a lot of potential too. Dont go the Apple route Amazon. Stay open source and make things easy.", "verified": false, "helpfulness": "0/3", "author": "Bubbabanjo \"Bubbabanjo\""}, {"rating": 4.0, "review": "First off, I am writing this review without any first hand experience with Apple TV, Roku or Chromecast. We recently ditched cable TV in favor of streaming Netflix, HuluPlus and Amazon via our smart TVs and gaming boxes. Amazon's Fire TV was purchased on a whim and we are not disappointed. The interface is very quick and snappy if a little unwieldy for non-Amazon services. The power and memory in this little box makes the menu navigation quick and responsive. We couldn't be happier with the technical end of Amazon's Fire TV.I was a little leery to see no HBO Go or Vudu support, but I had read prior to purchase that HBO Go was coming soon and that Flixter was offered which gives us access to our Ultraviolet movie selection. With those two services handled or on their way, my qualms have dried up.I am, at best, a casual gamer. I own a PS3 with a handful of games and rarely play. Hence, the gaming side of Amazon Fire TV doesn't interest me in the least. If I want to play a game, I'll do so on the Playstation or on my Android phone.The remote is simple and easy to use with intuitive button placement for ease of navigation. The dedicated voice search button works really, really well - - - albeit only for Amazon's offerings. I have read rumors that third party support is in the works, but for now, manual searches within each apps interface is the only option for the likes of Netflix and HuluPlus.The apps are decent. Both the Netflix app and the Hulu Plus app are the same as found on the PS3 and are, hands down, much better than those found on our Sony Blu-ray player.Is it worth $99? Meh. I don't know. Don't get me wrong, it's a fantastic box with a tremendous amount of power under the hood. I just don't think we're getting the best use out of its power since we're not big gamers and don't own a Kindle Fire tablet.", "verified": true, "helpfulness": "0/0", "author": "Clay Korns"}, {"rating": 5.0, "review": "Although, I'm still in the learning process and exploring different \"apps\"....THIS IS WHAT I WAS WAITING FOR!!...This is the future of TV....and the beginning of \"the-final-nail-in-the-coffin\" for Satellite and Cable.  For years now, I've been telling \"reps\" that the networks just aren't what they use to be...and I was getting \"fed-up\" with high prices and \"low-ball\" entertainment.  Folks!...if you're getting tired of the \"junk\" that is on today's TV screens....then you owe it to yourself to get Amazon's Fire TV.  It's only going to get better and this is just the beginning.  Amazon does offer a 30 day free trial...GO FOR IT!!!....it's the convenience of watching not only yesterday's movies...but..today's films (which there are some!!)..without \"dragging\" DVDs out of the closet to look at.  Your entertaining value does not stop with movies alone, but programs of personal interest (i.e., cooking, gaming, documentaries, and your Amazon music library) right at your fingertips!!  I chose the fire box w/remote (the voice command is outstanding).  As our household is still under contract until early 2015....THERE WILL BE SOME CHANGES COMING SOON !!", "verified": true, "helpfulness": "1/1", "author": "DumontBWTV"}, {"rating": 1.0, "review": "Could not use on my tv because my tv only has one hemi port which I have to use for the direct tv box  I will have to get a brand that has the 3 prong (red,yellow,white) connector.", "verified": true, "helpfulness": "2/7", "author": "Ruth Ann Cranford"}, {"rating": 5.0, "review": "Quite easy to use and was amazed to just say  \"John Wayne movies\" and they all popped up some that I had never seen.  I will use this a lot and unlike some of the the things that I buy online I love it.", "verified": true, "helpfulness": "0/0", "author": "Frank W."}]