[{"rating": 5.0, "review": "Need more things tho but it good", "verified": true, "helpfulness": "0/0", "author": "Justin Martinez"}, {"rating": 5.0, "review": "Love, love, love this!!  Very simple to install - plug and play.  Getting Pandora on my TV is great.  Also, it cycles through my pictures on my phone and puts it on the TV as wallpaper.  And, of course, I don't need to mention steaming Netflix and Hulu movies straight to the TV.  Best buy ever!", "verified": true, "helpfulness": "1/1", "author": "Suzanne Sheath"}, {"rating": 5.0, "review": "Works well but you have to download google chrome to use it.", "verified": true, "helpfulness": "0/0", "author": "David Kozakewich"}, {"rating": 5.0, "review": "The Chromecast is really a great device in an era where streaming is becoming the preferred method of media consumption.Chromecast is a small, inexpensive device that allows you to mirror whatever you see in your Chrome tab, and it does so very well.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "good to have one at home", "verified": true, "helpfulness": "0/0", "author": "Tacha Unenanond"}, {"rating": 3.0, "review": "good product it just didn't work for me because the Wifi was public even though I had to use a password  to get into the Wifi well I ended up selling to my brother and it work find for him.", "verified": true, "helpfulness": "0/0", "author": "Rascal"}, {"rating": 4.0, "review": "Cool product. Very useful. I just wish it worked with a browser. Like Chrome!", "verified": true, "helpfulness": "0/0", "author": "BJB"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Mrsboss"}, {"rating": 5.0, "review": "Shipping was fast got it 3 days before the scheduled date. Easy set up. Now I can watch showbox and all my downloaded videos straight to my tv.", "verified": true, "helpfulness": "0/0", "author": "Braulio"}, {"rating": 3.0, "review": "cons: Poor quality at project to tv.pro: Enjoy musical videos in a big screen and many apps supports.", "verified": true, "helpfulness": "1/1", "author": "Gonzalez Manuel E"}]