[{"rating": 5.0, "review": "This thing gave my old TV new life after I got rid of my Xbox. I plugged this thing into the HDMI port on my TV but it wouldn't power up so I had to use the USB cord to get it to come on. I think that's more of a thing with my TV than the Chromecast itself, because most newer HDTVs can power through HDMI (I plugged it into my mom's 60in and it came on just fine, no USB cable needed). Setting it up took less than 2 minutes, and once I got it started, it worked like a charm.  Every video I played streamed in 1080p whenever possible, and when they couldn't, the device would usually just drop the bitrate for awhile until the connection got better. I think this is a good because I'd rather watch a video in lower quality than wait for it to buffer.All in all, I simply can't live without this thing now. Probably the most satisfying $35 I've ever spent on a simple dongle. I definitely recommend it.", "verified": true, "helpfulness": "1/1", "author": "Xavier"}, {"rating": 5.0, "review": "For the holidays, I treated myself to a Chromecast device, I really did not need it, my Sony Blu-ray and TV were both smart devices, but for the $29.95 that I paid for it, I wanted to give it a try. After plugging it into the side of my TV, which had both an USB and HDMI connections, the TV automatically switched to the setup screen, which told me to use a laptop to setup the device. Owning a Nexus 7, I downloaded the Chromecast app and it found the Chromecast device and displayed apps that were modified to be used with it. Most of the video apps were already build into my existing hardware, but one app that I already had on my Nexus 7 caught my eye. It was the Avia Media player. I have all my music on a Windows Home Server and it is shared across the network. Avia is one of the best free network media players available and the latest version is great, Now that I am connected with Chromecast, I paid $2.99 to unlock the app. What I am now able do is use the Nexus 7 to select a song or playlist from my Home Server and the artist is display on my TV, with the sound is being played through my Home Theater. By using my Nexus 7 and Chromecast I have the Ultimate Remote Control and can control what I want to listen to from anywhere in the house.", "verified": true, "helpfulness": "4/4", "author": "Alan in Houston"}, {"rating": 4.0, "review": "this thing is AWESOME! havent been able to quit playing with it since i set it up. so much fun. i can just take over the tv and put on cat videos in the middle of the football game when my brother is being a jerk. thats always hilarious. always.", "verified": true, "helpfulness": "0/1", "author": "schlusky"}, {"rating": 5.0, "review": "Excellent product, just hope more apps support it.Pros:too manyCons:Delay when cast chrome tab or desktop.Bottom line:Worth $35 absolutely!", "verified": true, "helpfulness": "0/0", "author": "Kevin Z."}, {"rating": 3.0, "review": "I bought one of these for each of the three TVs in my house when they came out.  They do work as advertised, in that you can project a Chrome tab, youtube, netflix, etc. up onto your flatscreen.  However, the software still has some bugs to work out - It is a great idea and hopefully they correct the issues, but currently these don't get used much.  I have had this get confused numerous times - keeping a tab or youtube window up well after I've disconnected from the Chromecast, or not casting when I click Cast.", "verified": true, "helpfulness": "0/0", "author": "Peter Simon"}, {"rating": 5.0, "review": "The only problem I had installing this was activating it from my PC, so I used my Android tablet and had no issues at all.This is wonderful!  I bought another while on the road and used it every place I landed.  On one day, my sick niece was treated to non-stop movies which I streamed from my Android tablet using Chromecast.See something cute on Facebook?  Cast it to your TVSee something wonderful in YouTube?  Cast it to your TVYou just cannot go wrong with this device at this low-tech price.", "verified": true, "helpfulness": "1/1", "author": "K. H. \"Geek Mom\""}, {"rating": 3.0, "review": "Good idea but needs more apps , also it should be able to do cast from ipads and tablets , today everybody is using one of those and if you cant cast from them i dont see the point of this little gadget.", "verified": true, "helpfulness": "0/1", "author": "Mariano M."}, {"rating": 5.0, "review": "Amazing device to cast your videos to TV. The best part is that the device becomes invisible when connected to TV (I connected to back of my TV). I don't know if its a bug but if you cast your youtube videos, you can skip all the ads. i.e you don't have any interruptions.", "verified": true, "helpfulness": "2/3", "author": "Vachaspathy Kuntamukkala"}, {"rating": 3.0, "review": "Although I already have Apple TV, I wanted to try out Chromecast.  The setup was simple enough (I did it from my iPad).For the iPad app, there is only links to Netflix and YouTube.  They both worked well.  Though I had closed the Netflix app on the iPad, it kept playing on the TV via Chromecast.  I tried to stop it by reopening Netflix but it wouldn't connect me to Chromecast.  I had to open YouTube, connect, and then stop playing via Chromecast.  I wish there was a control directly in the iPad app.On my iMac, I played HBOGO via Chrome browser.  It did play on the TV via Chromecast, but with a bit of a lag.I going to try to use it in France to see if it will work there too.  I'll update the review at that time.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Weisbart"}, {"rating": 4.0, "review": "I hoped ChromeCast would have more services available initially.Netflix plays better with ChromeCast than on either of my WiFi enabled Blu-Ray players.The ability to watch Netflix streaming video is worth the expense.", "verified": true, "helpfulness": "1/1", "author": "Audra Lyon"}]