[{"rating": 3.0, "review": "Unfortunately, I own a PC and took me with the assistance of someone who knows a little about computers a few hours/days to get the thing going. If you were expecting HD being transmitted from your computer to your TV via Chromecast, you will be disappointed. We tried several Youtube sources and there was no HD at all. Hopefully it works better with a Mac, but for PC's, you would be better served by something else on the market. I have not tried any pics yet so I would probably guess they may be a lot better.", "verified": true, "helpfulness": "0/0", "author": "Warrior808"}, {"rating": 5.0, "review": "This worked better than I could have ever hoped for. Sure it needs USB to power it, but most TV's (Including mine) has USB and HDMI, and when plugged into both you would never know it was there. I plan on buying one for my living room TV, and my parent's TV as well. Definitely worth the $35, if not for the USB wall plug you get with the purchase (That you don't even need!)", "verified": true, "helpfulness": "0/0", "author": "Vvgamepro"}, {"rating": 2.0, "review": "the device doesn't link to hardly anything, its just hardware, you can't synch it with more than the apps that it currently supports, which aren't many. those that it supports, my TV already synchs to directly without this hardware. hopefully this product will come out with more apps to synch to, otherwise its just a nice fishbowl item.", "verified": true, "helpfulness": "1/1", "author": "LeMerovingian"}, {"rating": 4.0, "review": "good stuff would buy again because it is good stuff, mind you not great stuff, but only good stuff o.k.", "verified": true, "helpfulness": "0/2", "author": "louis W. Ringger"}, {"rating": 5.0, "review": "I have a \"smart TV\", that came with wireless built in. However, streaming Netflix was problematic, as it was always very slow, sometimes stopped, often never connected. In the same room, in the same location, I placed the Google Chromecast HDMI unit, and immediately started enjoying Netlix with VERY fast response times, and never having to pause or wait for the movie. I also use it occasionally to stream movies from my PC, via Google Chrome. This could probably be better, as the quality is hit and miss, and it would be better if the Chromecast came with an application that streamed disk based mp4, avi, wmv files without having to use the browser.I am probably going to buy 2 more of these for my other TVs.", "verified": true, "helpfulness": "0/0", "author": "Robert Daniels"}, {"rating": 5.0, "review": "I saved five bucks with Amazon Prime. The device itself would be cool if I actually used it.  The kids use it like it has always been available.", "verified": true, "helpfulness": "0/0", "author": "James Heinz"}, {"rating": 1.0, "review": "It would lose connection less than 3 seconds after it began to cast,after updating my firmware, resetting both the device and router multiple times, lowering the quality and even trying it from multiple devices the issue still persisted. I called customer service and after an hour they said they could not help me.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "Easy to set up and great for YouTube, Dayframe and HBOGO.  Haven't used any other apps since these are my main use.", "verified": true, "helpfulness": "0/0", "author": "David Ortiz"}, {"rating": 5.0, "review": "This is absolutely a wonderful gadget... I have watched YOU TUBE and many netflix shows on my TV and it is really awesome.", "verified": true, "helpfulness": "0/0", "author": "Dan Howe"}, {"rating": 1.0, "review": "I specifically bought this to cast music to my television from pc.  This function works intermittently and the extension often crashes.  With so few other supported apps, and the specific function i was looking for barely working, i cannot recommend.  Buy a Roku, it does more, and it does it better.", "verified": false, "helpfulness": "0/0", "author": "-tp"}]