[{"rating": 5.0, "review": "Great little product. Bought it mainly for the kids to enjoy Netflix. We have gotten to. Of use out of it so far. We've owned it for about 2 months. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Rosales"}, {"rating": 1.0, "review": "This was absolutely useless to me and a total waste of $35.  it is so specific as to when and how you use it, there are no situations where I CAN use it :<", "verified": true, "helpfulness": "0/3", "author": "tme"}, {"rating": 4.0, "review": "The product works as advertised however there is an apparent lack of content.  Google has not forged enough relationships to make this competitive with Amazon, Roku and other similar devices.", "verified": true, "helpfulness": "0/0", "author": "Michael Cook"}, {"rating": 5.0, "review": "So far, so good, as for a streaming device.  A little pricey, but comparable with other merchants' prices.  Because shipping was free (because of cost of item), it was worth the convenience of ordering on line.  Overall, a good product.", "verified": false, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "Very useful device. Let watch classes, movies, videos from ipad or iphone to the big screen.We have one Chromecadte on every TV. We use it a lot", "verified": true, "helpfulness": "0/0", "author": "atalabc"}, {"rating": 1.0, "review": "I purchased a Chromecast on the features and word-of-mouth. It's impossible to play video without a 2 second lag and constant re-buffering. I have 50mbps internet service and replaced my old router with a new one that could reach full speed of the wireless. This made no difference. Now I can't return it and nobody else will buy the piece of trash.Do not buy. You will return or regret it.", "verified": true, "helpfulness": "0/0", "author": "Cartmann"}, {"rating": 3.0, "review": "I have a roku but figured I might get this to stream stuff from chrome. I've had it for a little while and haven't had to much use for it. Not very apple friendly and only supports 720p with some mixed results even with fast internet. All in all I'd say get a roku instead.", "verified": true, "helpfulness": "0/0", "author": "Brian Satch \"earthy vibes\""}, {"rating": 1.0, "review": "I got this as a gift in December 2013.  At least it was easy enough to set up and it does connect to my wifi network, but I have been unable to use it successfully after several attempts since then.  I mainly wanted to use it to cast video from my WIndows 7 laptop to my TV, so I downloaded the Chromecast extension for Chrome.  I don't have a tablet yet and I have no Android devices.  Frankly, that shouldn't matter.I don't know if it is the Chromecast device or the extension (which seems to be in a state of permanent Beta), but there is such a terrible lag, that any videos are not watchable.  Thinking it could be a wifi setting, I made a few tweaks as suggested by sensible-sounding people on a few tech forums, but nothing has worked.  For a while, video was even showing up with a pink wash over everything (this was because of the Chrome extension).  The pink is gone, but the lag is still there.  I even moved my router and modem to within 18 to 24 inches from the device and nothing changed.  This thing is a dud.People kept suggested it was my network.  Blame the user, right?  I seriously doubted that was the problem and I finally got a Roku.  Roku works like a dream.  That confirmed for me that it is the Chromecast device and its attendant non-functional Beta software that have been the problem.  Take my advice, spend more and get something better.", "verified": false, "helpfulness": "0/1", "author": "Kelley Wine"}, {"rating": 4.0, "review": "Works ok for a $29 device", "verified": true, "helpfulness": "0/0", "author": "MARK E CHRISP"}, {"rating": 2.0, "review": "I give this 2 stars not because of Amazon or the seller but more for the actual Chromcast service.Amazon was great. Prime shipping, received the device in a couple days, Its new, it worked on first plug in.As for Chromecast, I think they have a ways to go. Its a wonderful idea as long as you have an android device. I have a Nook HD+ tablet so i primarily used that to setup and run. The most outstanding issue i have is once i watch a movie say on Netflix, push the Chromecast button on my tablet, it shows up a few seconds later, then half way in the movie i need to pause. Some how the connection from the tablet to the Chromecast breaks. I no longer have any \"remote-type\" controls. I cant pause, FF, RW or stop. I have to click the chromecast button again on the tablet to reconnect, then the movie starts over from the beginning. I'm sure google will fix this in time but its very annoying and I've already stopped using it. I've switch back to Roku which has same ability for apps that match (Netflix, Hulu, Amazon Prime, Plex, etc..)In my opinion, its a \"fun to have\" device but if your not very tech savy or familiar with android OS, its probably not for you.", "verified": true, "helpfulness": "1/1", "author": "Tom T"}]