[{"rating": 4.0, "review": "I really like my Amazon Fire TV! But I'm having trouble signing up for Hulu Plus. I'm doing everything it says but when I get to the screen that will connect to my Amazon account to complete the transaction, I get an error message. Has anyone had any trouble with this?", "verified": true, "helpfulness": "0/0", "author": "Lisa Packnett"}, {"rating": 1.0, "review": "THIS DEVICE SUCKS YOUR INTERNET DATA.  MANY PEOPLE THAT HAVE BOUGHT THIS DEVICE HAVE COMMENTED ON HOW THE FIRE TV SUCKS YOUR INTERNET DATA.  I CHECKED MY DAILY USAGE AFTER I CONNECTED THE FIRE TV, AND IT WENT FROM 10 GIGS TO BETWEEN 50 AND 60 GIGS A DAY.  I WENT OVER MY MONTHLY USAGE AND I WAS CHARGED EXTRA FOR THE USAGE.  A LOT OF PEOPLE SAY THE REASON THE INTERNET USAGE GOES UP IS BECAUSE OF THE SCREEN SAVER BEING ON MOSAIC, BUT I DON'T BUY THAT.  I THINK THAT IS AN EXCUSE THAT AMAZON IS USING.  I THINK IT IS THE FEATURE THAT PREDICTS WHAT YOU WANT TO WATCH, AND IT AUTOMATICALLY STARTS DOWNLOADING THE SHOWS FOR YOU.  I CAN'T SEE HOW I CAN KEEP THIS DEVICE IF IT USES SO MUCH DATA.  I AM VERY DISAPPOINTED IN AMAZON FOR RELEASING A DEVICE LIKE THIS WITH SUCH A MAJOR PROBLEM THAT THEY HAVE NOT REMEDIED AS OF THIS DATE.  OTHER PROBLEMS WITH THIS DEVICE IS THAT THE VOICE SEARCH ONLY WORKS WITH AMAZON, NOT YOUTUBE OR ANY OTHER SITE.  YOU ALSO CAN'T SET PARENTAL CONTROLS ON THE MOVIES YOU HAVE PURCHASED FROM AMAZON WITHOUT IT REQUIRING A PIN TO WATCH ALL YOUR MOVIES EVEN THE PG ONES.", "verified": true, "helpfulness": "5/8", "author": "dk"}, {"rating": 5.0, "review": "This is a great little product.  Even without jailbreaking, you can sideload XBMC on it, as well as a wide variety of other apps.  I'm using it with XBMC as a front-end for a MythTV server, giving me a centralized DVR.  The features Amazon provides (such as Prime Video) are easy to browse and watch.", "verified": true, "helpfulness": "0/0", "author": "Paul S. Taylor"}, {"rating": 5.0, "review": "Love it, love it, love it!  This IS a GREAT item if you're in the market.  Sync's with my Kindle/Amazon Fire HDX7 that I also purchased as a bundle! Amazon Fire is like a ROKU streamer (which I have two for two other TV's in the house) but this is better than the ROKU!", "verified": true, "helpfulness": "0/0", "author": "GrreatFun4Me \"Mother of 3 and wife of 25 years to the most wonderful, sensual man!  Enjoy reading when I can fit it in my day. Peace & stay well! ~Denise\""}, {"rating": 5.0, "review": "We have been using a bluray player to stream Netflix and Prime. It is SO SO SO slow compared to the fire box.The box is tiny... only a bit bigger than a deck of playing cards.I am not a  tech person. It took me less than 15 minutes to start streaming. One wall plug  (included) and one hdmi  (not included). The box signed me in to prime immediately. There was an update and a short intro video. I downloaded several apps right away (Netflix, PBS, CBS). My kids are excited about the games, so we will probably buy the controller eventually. I haven't tried voice control, but the remote works great from any where in the room. Everything we've watched has streamed without any interruptions. I have high hopes!", "verified": true, "helpfulness": "0/0", "author": "hppymm"}, {"rating": 5.0, "review": "Great item, fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Troy L"}, {"rating": 5.0, "review": "The first unit I was shipped worked for 1 day. It would not work the next day but as we all know, Amazon customer service is outstanding and they assured me it was unheard of while quickly sending me a replacement unit. Lucky for me it wasn't an issue with the power chord because they only shipped me the Fire TV unit alone, no new remote, power supply, etc. I've now had the replacement for a week and I love it. The voice command works flawlessly out of the box, even for my wife who doesn't typically have as much luck as I do with voice command software (like Google search and Google Now commands) It would be nice to be able to say \"Live TV\" or \"HGTV\" and have the option to jump into the SlingTV app and straight to the correct channel. I don;t know if that's something that may be a future enhancement but for now it takes a few clicks to jump into an app, then jump to the content you want inside that app. I have noticed, maybe due to the dual band wifi, that the picture on the SlingTV app is better than on any other device I've used to far so that's a plus. All in all this is a very clean form factor, a fast processor, good response, voice reaction, and the menu layouts are easy enough. I would recommend this to friends and family (and already have by way of showing it off)PROS - Easy setup - Voice search just works - Solid device feel and build - Remote is ergonomic and easy to use - Intuitive menu layout and navigation is simpleCONS - Really no cons other than having the first box die on me so quickly. That isn't a CON so much as an unfortunate missWANTS - would be nice to be able to type with voice for those few times when you do have to log into a new account - would be nice to be able to use voice search to jump to content inside an app (like saying \"Property Brothers\" and getting the option to go to SlingTV and choose from HGTV's on demand content rather than only being shown seasons for sale on Amazon) although I'm not sure how much of a software hurdle this would be, if even possible", "verified": true, "helpfulness": "1/1", "author": "W. Jeanes \"WBJ\""}, {"rating": 5.0, "review": "Best TV decision I made! My husband, an avowed non-series watcher, has binge-watched \"Bosch,\" one of the Amazon Original series. The technology that eliminates the buffering on our end is genius, and the apps, selection of Prime, and reasonable rental prices make Amazon Fire TV a smart add-on value to our Prime membership.", "verified": true, "helpfulness": "0/0", "author": "Cathy Cuff-Coffman \"\"Young\" 52-yr. old mom of 3 new grownups. Love politics, sports, jazz, classic rock, cooking, and classic friends. Not always in that order.\""}, {"rating": 3.0, "review": "Overall it's a quality experience.  Fast, responsive interface.  Voice recognition is very accurate, better than my phone.However, voice search is basically a lie at this point.  It's only \"Amazon Prime Voice Search\".  Even the third party apps it supposedly supports produce terribly incomplete results.  I'd be shocked if even 10% of the supported 3rd party apps' content is actually searched when using voice.  Played with this quite a bit by using voice search for content (exact names) that exist in supported apps are are returned #1 when using the in-app search.  Rarely got a result.  It still doesn't work with Netflix at all even though support was announced nearly a year ago.In addition, the entire interface is an Amazon Prime advertisement.  Access to other apps is deliberately obfuscated.  There is no way to customize a \"Home\" screen or list.  There is only a \"most recent\" category that Netflix, Hulu, etc might be in, however every single item you view in Prime shows up as its own object in this list, so other apps quickly get pushed down if you use Prime at all.  ALL of the various categories listed on the home screen are simply different categories of Amazon, no content from other providers exists there at all.I could forgive that if they at least gave me some ability to customize a home screen or \"favorites\" category so I could keep the links to my other apps front and center somewhere.  The absence of such an option makes it clear that the interface has been crippled by design.  I'm already your customer and give you tons of money, intentionally making my experience worse doesn't sit well with me.", "verified": true, "helpfulness": "2/3", "author": "jfunk"}, {"rating": 5.0, "review": "Very awesome, simple setup. Just like having your kindle on TV. Very pleased with purchase. Will probably buy another...", "verified": true, "helpfulness": "1/1", "author": "Bezy3"}]