[{"rating": 5.0, "review": "I am absolutely loving this thing! Have been a Prime subscriber for quite a while so I get to reap more of the benefits. I'm not sure how convenient it would be if you don't have Prime.", "verified": true, "helpfulness": "0/0", "author": "The Stare \"Here's looking at you, kid...\""}, {"rating": 5.0, "review": "I owned an Apple TV before this. I almost didn't get this, but I got the promo with Sling TV, and purchased it for like 40 bucks.At this point, I would have bought it for the full 100. I like it more than I ever did the Apple TV.  It just does more, that and I really like the voice search feature.  You simply hold down the mic button on the remote and say what you want to find, and it finds it fast. The remote is also small, bug bigger than the to small Apple TV remote.I have had fewer problems with wireless networking related to this as I have had with my Apple TV. Also I do do most of my digital rentals through Amazon due to the larger range of devices I can view them on. Apple TV doesn't offer Amazon, and I don't feel i should have to trick it by screen mirroring my ipad.Overall I really like the Amazon Fire TV.  I'm thinking about getting one of the game controllers and picking up a couple games.", "verified": true, "helpfulness": "0/0", "author": "Ronaldregean"}, {"rating": 5.0, "review": "The only thing you'll ever need for your TV. Cancel cable, who needs a smart TV, this has everything you didn't know you always wanted. I am hooked!", "verified": true, "helpfulness": "0/0", "author": "Michele"}, {"rating": 1.0, "review": "Hulu plus freezes, Netflix has errors changing colors, no universal search like Roku. Switching back to Roku 3.", "verified": true, "helpfulness": "0/2", "author": "lotreaglesfan"}, {"rating": 5.0, "review": "I buy the Amazon Fire TV to replace a first generation Roku. Great upgrade !", "verified": true, "helpfulness": "0/0", "author": "Mike O'Connor"}, {"rating": 5.0, "review": "The longer I have it, the more I love it. Once a few of the initial \"bugs\" and features were worked through, it is truly my go to streaming device. I'll be replacing my other name brand streaming devices with additional Fire units. I love the interaction with my Prime account and that is also getting better and better with every update. Love it!!", "verified": true, "helpfulness": "1/1", "author": "Joel W Fletcher"}, {"rating": 5.0, "review": "Amazon rocks!", "verified": true, "helpfulness": "0/0", "author": "Michael P. Hoye \"Music Junkie\""}, {"rating": 5.0, "review": "A gift for my grandson and he love it. Should have kept it for myself. I really like the voice command.", "verified": true, "helpfulness": "0/0", "author": "LadyG \"Glenda J Warren\""}, {"rating": 5.0, "review": "Pretty neat little unit", "verified": true, "helpfulness": "0/0", "author": "robert m ledbetter"}, {"rating": 5.0, "review": "Great Product. Fast Processor. Integral Part of the Prime Experience.", "verified": true, "helpfulness": "0/0", "author": "CHRYSALIS"}]