[{"rating": 2.0, "review": "I think it's a waste of money buying this product if you already owned a roku or other streaming device. If you want to stream with this device, you have to download googlechrome and its useable applications with your PC. If you have a slow wi-fi then you have a streaming device that's slow. The only plus here is of course you may take the device with you at any hotels and places where there is HDMI connections.", "verified": true, "helpfulness": "0/1", "author": "MrPatriot2000"}, {"rating": 5.0, "review": "I like very much my chrome cast, is very useful, very easy to use, have the programs i use, reomended", "verified": true, "helpfulness": "0/0", "author": "alejandro"}, {"rating": 5.0, "review": "So great and easy to use. You literally just plug it in and it works--can't recommend it enough. Best way to make your TV a Smart TV", "verified": true, "helpfulness": "0/0", "author": "Clara de Soto"}, {"rating": 1.0, "review": "I did not  know that it did not work on the Vista operating system and there should be a disclaimer to this efect on the product!!!This is the first time I have had a problem with an Amazon product and was quite disappointed.", "verified": true, "helpfulness": "0/3", "author": "David L. Herndon"}, {"rating": 4.0, "review": "I bought this product to stream Netflix.  I am able to do so but there is a difference between stream netflix from ChromCast vs. my xbox.  With my xbox if I watch a show with multiple epsiodes, it will play the next episode automatically.  With the ChromeCast, it will only play one episode and then I have to go back into the app and then reselect an episode.", "verified": true, "helpfulness": "0/0", "author": "Earl Hanselman"}, {"rating": 5.0, "review": "My hubs was so happy when he found this in his stocking!!! This is a Totally awesome product!!!! Super great!!!!", "verified": true, "helpfulness": "0/0", "author": "Deanna Evans"}, {"rating": 3.0, "review": "My husband told me Santa HAD to bring this for Christmas, but it turns out he bought his own Santa present and ended up with 2 in his stocking. Arg. Anyway, this got taken back to another store for in-store credit since Amazon would have charged us a fee for changing our mind and returning it. Roku does the same thing, but many more options, so we kept that and got rid of hubby's original pick. Even so, it does what it says it does. My hubby gave one to his sister for Christmas, though, and while it worked fine at first they did start having some technical difficulties with it. So... 3 stars. (Sorry I can't give more specifics on the issues...)", "verified": true, "helpfulness": "0/0", "author": "F. Feickert \"Mezzofortissimo\""}, {"rating": 5.0, "review": "This is a very handy gadget and I use it extensively for personal and business.It is very handy to switch between my tablet or smart phone to TV to view videos, show pictures etc with the click of a button.", "verified": true, "helpfulness": "0/0", "author": "Raj Tedla"}, {"rating": 2.0, "review": "It was a complete disappointment -- I thought I would be able to stream movies or my own video files from a notebook or a smartphone, or at least broadcast snapshots made by a smartphone.In reality: - Chromecast is too slow, so Full-HD movies or videos produce significant lags - Chromecast audio codec support is poor, so chances are you movie won't have sound - Slideshow of photos via Chromecast takes too long to load next image, so it is pain to wait - There are too few applications in Google Play that support Chromecast, and those that do in most cases are paid (or required in-app purchase to support Chromecast) - The Chrome browser plugin is not stable (at least on MacBook Air), it crashes periodically and requires restartThe only use case for Chromecast today is watching Youtube video, which it does pretty good (not counting a few minor issues).", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 4.0, "review": "Have used on one PC and two different HD TVs. Works but not as intuitive as the advertising would have one believe.", "verified": true, "helpfulness": "0/0", "author": "james wilson \"jhw\""}]