[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Laurie L."}, {"rating": 5.0, "review": "This product is mind blowing. All you need is included in the box. Power out let, usb, usb extender and soket. It dose exactly what it shold do from video's i uave seen on YouTube.", "verified": true, "helpfulness": "0/0", "author": "Hassan Mohammed"}, {"rating": 4.0, "review": "Very nice to use. Only problem is that I cant watch another video from my iPhone when it's connected via YouTube app", "verified": true, "helpfulness": "0/0", "author": "JAYARAM K YANAMUNDRA"}, {"rating": 2.0, "review": "Returned; did not work on my TV", "verified": true, "helpfulness": "0/0", "author": "yolanda hunter"}, {"rating": 5.0, "review": "Love Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works excellently with Netflix, YouTube, Hulu and other video programs.  I mainly stream from my iPad to my flat screen TV.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Fibro Woman"}, {"rating": 5.0, "review": "Very cheap for the functionality provided.  Syncs with almost anything.  I like the screen saver images it displays when not in use.", "verified": true, "helpfulness": "0/0", "author": "Anon"}, {"rating": 4.0, "review": "It does what it is supposed to do although I realized after HBO Go became available on my PS4, it is something I dont really have much use for anymore.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "The concept of this stick is great. However, in practice it fails to meet our needs. We use it to stream movies from our laptop to our TV, and it was working fine for the first day, but now it constantly freezes. When we reached behind the tv to remove the stick, it was burning hot. Not sure if we just got a dud, but it's been a disappointing experience so far.", "verified": true, "helpfulness": "1/1", "author": "a nova"}, {"rating": 5.0, "review": "Very easy to install and to use, and the content is huge. I used it mainly to watch YouTube and cast from some video apps every night. This is one of the best gadgets I've ever bought for myself.", "verified": true, "helpfulness": "0/0", "author": "Hoang Trong Tai"}]