[{"rating": 4.0, "review": "Amazon please get with Microsoft and add the windows media center extender to this device! If Ceton did it I know you can. Do you know how many xbox360's are floating around just being used for that? \"I have 4\" I would instantly buy 4 of these if you could make it an extender to windows media center? The hardware is more than adequate. Someone please bring us live TV so we can downsize our equipment and wasted energy!", "verified": false, "helpfulness": "1/1", "author": "Jason P. Baxter \"Tech Guru\""}, {"rating": 5.0, "review": "In the beginning, I thought this box was crap. After one week of playing and getting to know the Fire TV, I have to say this box rocks! It's fast, lightning speed. The 2 gig comes in handy, it downloads while you watch and I have not seen any lagging or waiting for videos to load. Reliable, have not crashed so far. Outperform compared to Ruko and Apple 3 boxes. Apple 3 is fancy looking and very controlling. Fire TV lot lot faster than Apple 3. Ruko is not worth it. You should check it out and do yourself a service. Use the best in the market.", "verified": true, "helpfulness": "0/0", "author": "City Gold Hunter \"City Gold Hunter\""}, {"rating": 4.0, "review": "I also have a PS3 and chromecast for streaming.  As I have an Amazon Prime account with a kindle fire, I felt it made sense to get this fire tv.  It works well and I also played a few games.  One of the games promoted lets you use the kindle fire hdx as a remote.  Pretty cool stuff.Cannot wait for my back ordered remote control.  I'm a casual gamer and rarely play.  However, this device makes it easy to just pick up a game any time without a lot of effort and time that goes into ps3.  Better than playing it on a tablet.", "verified": true, "helpfulness": "0/0", "author": "dnelson"}, {"rating": 5.0, "review": "800-531-5000I’ve read some reviews, bashing the Fire TV, but this is a very new product with more to come.  When Roku firs came out, they didn’t have all the channels they do now.  It took time to build up.  Out of the gate, the Fire TV has plenty of channels.I won’t repeat all the things folks have said and write a 10 page thesis.  To be completely transparent, my previous device is a Roku 2 XD.  I am very excited about the possibilities this device has for future development.Speed - This baby is fast!  It leaves my Roku in the dust with menu navigation, no hesitation at all.  Although Netflix doesn’t have the pre-watch buffering of the Amazon streaming app, my videos are loading twice as fast as with the Roku.Interface - While some have complained about the blandness of the interface, I welcome it.  It is a no-frills interface that I can navigate quickly through and get to what I bought the thing for, the content.Apps - The apps have a much better interface than the Roku apps.  They are much more user-friendly.Remote - While I love the remote functions and feel of the matte surface, it is awkward in my big hands.  It could be a bit longer.Voice Search - Awesome idea!  Some fuss because it is limited to only a couple apps.  Give it time.  The people developing these apps are not Amazon, but Amazon has opened this capability to them.Input - This is obviously a major need.  On-screen keyboards suck.  I’m sure in time we’ll have access to a bluetooth keyboard or, better yet, an Android app like for the Roku.Picture - The picture is better than my Roku, which often would have pixilation on darker parts of the picture.", "verified": true, "helpfulness": "4/4", "author": "A. Gordon \"Computer Geek\""}, {"rating": 5.0, "review": "Great technology for the price, easy set up. Nice to have both Netflix plus Amazon streaming, along with some free games.", "verified": true, "helpfulness": "0/0", "author": "Craig R."}, {"rating": 5.0, "review": "...and have not even scratched the service of what it can do. We primarily got it so we could get Netflix - and I honestly had no idea all the other 'things' it could do. I won't lie, my son hooked it up for me, but it did seem super easy. I do wish the small, slim remote was neon green or shocking pink because it is really easy to lose track of,even when it's RIGHT THERE in front of you on the coffee table, let alone when it has slipped between couch cushions. I apologize to anyone looking for technical details, but I am clearly not the person for that sort of thing. We are still playing around with it, but would not hesitate to recommend it, particularly to the technically challenged.", "verified": false, "helpfulness": "0/0", "author": "Jane Manning"}, {"rating": 5.0, "review": "Could have called it Kindle TV, maybe add DLNA, personal media player and or reader app.  Still LOVE this device", "verified": true, "helpfulness": "0/0", "author": "Darryl L. Barkley \"Teck Monster\""}, {"rating": 5.0, "review": "Great so far..Love the Netflix feature. Easy installation to flat screen. Mailed quickly and packaged to withstand any amount of handling.", "verified": true, "helpfulness": "0/0", "author": "judy cote"}, {"rating": 3.0, "review": "add headphone jack and you will really beat ROKU.  add headphone jack and you will really beat ROKU. PLEASE ADD HEADPHONE JACK.", "verified": false, "helpfulness": "0/2", "author": "ikepono"}, {"rating": 4.0, "review": "Bought this particularly thinking it already had the app (WWE Network) ready to purchase, but it does NOT and it defeated my purpose. Amazon Fire Appstore  is limited on app's at this time....I could only get the WWE Network app from the Appstore for Android to play on Kindle Fire, but WWE Network app will not play through  HDMI cable (it's a network issue) so I can only watch WWE Network on Kindle Fire 8.9\" only or through my laptop....the point is CHECK OUT the Amazon Fire Appstore 1st, if your looking for particular app's to download for the new Amazon Fire (for streaming).....overall I like this gadget for what it is offering and recommend for Amazon Prime, Netflix, Hula Plus, Games, Photos, Videos and much more!", "verified": true, "helpfulness": "0/1", "author": "Kimberly"}]