[{"rating": 4.0, "review": "Once I figured out how to get it to work with our TV I like the way movies come across. My only negative feeling is that the Amazon movies do not work on it so I am unable to get the most out of my Amazon Prime membership.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great!!As soon as i opened the package it only took maybe 5 mins to plug into my TV and start broadcasting.The only thing I dislike about it is that there are very few apps to use with this but for $35 you cant complain.And plus I mainly bought the chromecast to stream from my laptop to my TV.One bit of advice, you gotta have good wifi to broadcast or else you'll get choppy feedback and also change some settings around to accommodate how your wifi is.All in all, I am very pleased with my purchase and would definitely buy more for the other TV's in my house.", "verified": true, "helpfulness": "1/2", "author": "matt"}, {"rating": 4.0, "review": "Been using this now for a month. I like it and I was able to find some tricks by googling so I can watch Prime.  I guess you need to ask yourself why you want this.  I'm already starting not to use it that much... Do you own a lot of apple stuff? Than don't get this. Are you buying a new gaming console? Like Xbox 1, you probably don't need this then. This is great if all you want is to cast youtube or Netflix. Its early in the game and more apps are needed to really see the potential.", "verified": true, "helpfulness": "2/5", "author": "AlmostEverything84"}, {"rating": 5.0, "review": "This has changed the way we watch t.v.  We cast off the kindle onto the large t.v. for my 5 year old.  Now he can watch his shows easily on the big screen while mom and dad control what he watches.  We have 2 of these.  I can't brag on it enough.  My husband even bought one for work at elementary school and casts his surfing for the students to easily follow.  Amazing product.  Easy to set up and use.  Now if Amazon Prime would support it, it would be perfect.", "verified": true, "helpfulness": "1/2", "author": "G. Rogde \"G.R.\""}, {"rating": 2.0, "review": "Works well for youtube and Netflix but currently that's about it. I hoped I could stream whatever I was looking at on my computer onto the TV but it doesn't work that way. It only works with web pages that it is set up for. If you want to watch a show on your favorite TV channel website it wont work. Since I have other means of streaming youtube and Netflix (my Xbox) it was a waste of money.", "verified": true, "helpfulness": "1/1", "author": "rebecca"}, {"rating": 4.0, "review": "A little clunky to set up and operate, but once you figure it out, a treat to see movies on the big asreen.", "verified": true, "helpfulness": "0/0", "author": "Al Johnson"}, {"rating": 5.0, "review": "I can't say anything that you won't find all over the Internet about this.  It works great for the money!  The only current drawback is that Chrome for Android doesn't support tab casting yet.  I hope they hurry up and fix that!", "verified": true, "helpfulness": "0/0", "author": "Machodoc"}, {"rating": 4.0, "review": "the chromecast needs to be reset every now and then in order to star working again. it is still a work in progress", "verified": true, "helpfulness": "0/0", "author": "Alejandro"}, {"rating": 4.0, "review": "Could not be more stoked about this. Shipped fast. For the price and totability it is a deal. It was so easy to setup.My reason for dropping it down a star is that the services to work with it are not all there yet from your tablets like Amazon Prime and other video sources. Funny since I own the Google tablet ;) Also, you have to mostly have pay for subscriptions.", "verified": true, "helpfulness": "0/0", "author": "IG"}, {"rating": 4.0, "review": "The Google Chromecast is certainly an interesting device. It seems like Google TV in a smaller form factor. Installation is super easy, I plugged it in to an HDMI slot (AND A USB SLOT, it needs both), and it was able to find my wireless network pretty quickly. I used my phone (Verizon Droid DNA) to complete the setup process, though as I understand it you can use a laptop or tablet to complete it as well, you just need the Chromecast app.Now as for what the product is supposed to do... it works great. Unfortunately there's just not much it CAN stream right now. YouTube, Netflix, Hulu, Google services, and recently HBO Go have native streaming support. That's not to say you can't stream other things, they just need to be passed through to a desktop (or laptop) Chrome browser, but this last solution is spotty to say the least.The official apps with streaming support work wonderfully. At a recent party we had we just let people connect to our WiFi as guests and they were able to play YouTube videos and music directly from their phones, it was really cool and easy to use. Netflix streams in HD without a problem, and being able to control everything from your phone makes things convenient. My wife and I love it so much we ended up picking up two, one for downstairs and one for our bedroom.I would love to recommend this product to everyone, but at this point if you already have a device that does your streaming, the Chromecast isn't going to replace it. Once more apps come available, it will become a no-brainer, but for now you won't necessarily be missing anything if you wait a month or so. Google is hosting a developer conference for the Chromecast on December 7th 2013, so do some research early next year to see what's going to be available.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]