[{"rating": 5.0, "review": "Very good for chromecast", "verified": true, "helpfulness": "0/0", "author": "Mohamad alobaidi"}, {"rating": 4.0, "review": "Very useful", "verified": true, "helpfulness": "0/0", "author": "Sergio"}, {"rating": 5.0, "review": "Absolutely the greatest value in streaming devices on the planet. Can't be topped. So easy to use, has so many applications.", "verified": true, "helpfulness": "0/0", "author": "Andrew Tuozzolo"}, {"rating": 5.0, "review": "Works as advertised! Great job!", "verified": true, "helpfulness": "0/0", "author": "Marinan Brewer \"Pen Maker\""}, {"rating": 5.0, "review": "Awesome product. Works with so many key apps on Android, iPhone and iPads.  super easy to install.  Even easier to utilize because you control everything from your device so you don't have to use a slow remote like with Apple TV and some of the other streaming devices.  We use it for Netflix, Google Play movies, streaming music and a ton of other streaming apps.  The list just keeps growing with what you can use it for.  Super cool feature is your friends can stream from their phones if they drop by because all the compatible apps have the Chromecast button built right in.  At $35 it's a steal. You can also stream direct from Chrome browsers and still keep working in other tabs at the same time.", "verified": true, "helpfulness": "0/0", "author": "A. Ulery"}, {"rating": 5.0, "review": "Love it. I have two and with the freebies google has offered, they are practically free. Freebies aside, I bought one shortly after it was offered and it is my main source of mind numbing entertainment. My cord has been cut for a long time and devices like this make keeping current and watching what I want so much easier than it was 15 years ago.Another awesome benefit we use it for is when hosting parties we can have the boob tube show pictures from our G+(Now google photos) account cycle through our family photos we have backed up.One thing Google needs to add to this is the ability to use either the google music streaming service or allow another service to play in the background while the photos are cycling. That way you can just throw on music, have pictures cycling and its one seamless process that's combined. Many people own basic systems, having only the ability to choose streaming photos or music... Given a choice the music streaming service is put on with useless images that no one looks at or cares about, why not have the ability to show off family photos no one cares about ;)What would be super sick is blending this with your auto-awesome video creator and basically perform the same auto-awesome process \"live-ish\"; cycling through music, pictures and videos that are all on your servers. Think about it. P.S... I wouldn't mind a bounty if its put into play and successful ;-p", "verified": true, "helpfulness": "0/0", "author": "Eric Chaffey"}, {"rating": 2.0, "review": "I bought a chromecast and it does what it is intended to do, but was not very user friendly by anymeans. To use the device your laptop had to be on, or you had to use your cell phone. Well when you are watching Netflix on your tv the last thing you want is having your laptop right beside you with the screen bright. If you use your phone to activate the chromecast it does not have auto play for Netflix. I struggled using with this awkward device until I just broke down and bought a Roku. Worth the money! It is so much better. My advice just buy a Roku. It has all the same functions as a chromecast but the user interface is just so much better!!!", "verified": false, "helpfulness": "0/0", "author": "Rachel LeDat"}, {"rating": 5.0, "review": "Excellent device!! recommended!!", "verified": true, "helpfulness": "0/0", "author": "Gus"}, {"rating": 4.0, "review": "Nice for streaming lots of things to the TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Maryland Shooter\""}, {"rating": 5.0, "review": "Fantastic gadget", "verified": true, "helpfulness": "0/0", "author": "Achille Minerva"}]