[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Burak Furkan EMIL"}, {"rating": 5.0, "review": "Works great for YouTube and Netflix from my iphone and does not take time to load YouTube like many Smart TV's do. Appears to stream right from the cable modem for no delay.", "verified": true, "helpfulness": "0/0", "author": "D. Brown"}, {"rating": 4.0, "review": "Needs considerable bandwidth on top to what you movie or stream is using.", "verified": true, "helpfulness": "0/0", "author": "Rachel Garcia"}, {"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/0", "author": "jose Wetsztein"}, {"rating": 5.0, "review": "Love it.  Simple and effective", "verified": true, "helpfulness": "0/0", "author": "M. Bennett"}, {"rating": 5.0, "review": "LOVE IT!! I can stream YouTube, and Netflix while relaxing in my room and not in the living room. Sometimes i have had to unplug it to just reset from time to time, but it does not bother me.", "verified": true, "helpfulness": "0/0", "author": "Joshua Viles"}, {"rating": 4.0, "review": "I've been using the Chromecast for a few months now and I can't decide if I like it or not.  ;-)The Chromecast essentially streams media and apps from other devices.  There are no apps on the device this self.  I find that it works really well with my Macbook Pro, and okay with my iPad and iPhone.With my laptop, I launch Chrome and stream in whatever I want to show on my TV.  It doesn't really mirror the computer, but just the tab I'm currently on.  Along with that, it is more just for display and not for interacting--I can see my emails, but I can't interact with it unless I'm on that tab on my laptop.  It's not the same as plugging my laptop into my TV with a display cable.The iPad and iPhone work okay, but not as seamlessly as my laptop.  The HBO GO app works great!  Netflix . . .  not so much.  The wifi connection is not as robust as on the laptop.  It works most of the time, but will occasionally not connect or freeze.The Chromecast is hard to compare to other devices like a Roku or Amazon Fire TV because they are significantly different devices.  The Chromecast is an inexpensive streaming device, while those other devices are fully-functional media devices.  I typically only use the Chromecast when I don't have my computer plugged in or I can't find my remote for my Roku player.  It works well in a pinch, but it didn't replace any of the products like I hoped it would.", "verified": true, "helpfulness": "0/0", "author": "Matthew M. Finnesgard"}, {"rating": 4.0, "review": "Working really good!", "verified": true, "helpfulness": "0/0", "author": "Jonathan U."}, {"rating": 5.0, "review": "In love with my Chromecast (:Thanks for delivering on time", "verified": true, "helpfulness": "0/0", "author": "Sioty"}, {"rating": 2.0, "review": "I do follow all the instrustions on the video but I can't get it to work.I am not going to give up I go back to it every once and awhile but you can't justplug it in and get it streaming from your device.", "verified": true, "helpfulness": "0/0", "author": "joseph monico"}]