[{"rating": 5.0, "review": "You plug it into the HDMI port and (after the inevitable period of tapping on iPads and iPhones) it works. beautiful picture, incredible convenience, unreal price. In fact, the price is low enough that you don't mind the fact that you're going to have to replace it in a year or two when something completely different comes along.Binge on Game of Thrones, Luther, and Orphan Black for a couple of weeks and it will have definitely paid itself off.", "verified": true, "helpfulness": "0/0", "author": "Edward I. \"Terry\""}, {"rating": 5.0, "review": "good value for streaming video.Well designed.easy to use.The color and form factor is wonderful.Like it.I bought 3 of these.", "verified": false, "helpfulness": "0/0", "author": "Shan Liang"}, {"rating": 5.0, "review": "Never had to reboot the device or reconnect to Wi-Fi, at least for now.  The Roku 3 I had required a reboot every 15 minutes and was sent back (they only let you exchange because it was bought on Amazon, NO return even within their 90 day warranty).  Chromecast is perfect if you only need to send your Netflix or Youbube to that huge TV.", "verified": true, "helpfulness": "0/0", "author": "Mimian H"}, {"rating": 2.0, "review": "Poor user experience.  While playing movies from my android tablet the movie buffered frequently.  Also my tablet lost wifi connectivity while Chromecast is in use.  Wifi problems do not persist when Chromecast not in use.", "verified": false, "helpfulness": "1/1", "author": "carbo23 \"carbo@telesoftvc.com\""}, {"rating": 4.0, "review": "I look forward to new channels being available on this device. Works as expected, and easy to set up. Thanks", "verified": true, "helpfulness": "0/0", "author": "GeorgeF."}, {"rating": 5.0, "review": "Now, I cannot speak for everyone,  but I can only speak for my own experience....Months ago, I was having problems with my AT&T; internet service.  Everything worked fine and fast....Desktop and laptops computers in my house....No complains there....The PROBLEM came when I tried to download Netflix from my Blue-ray Player.  At first for several months....everything went fine....then suddenly,  Netflix movies would take forever to download and when finally the picture came on, it was a very low grade picture not the HD quality I was used to.  I am still very upset that AT&T; is doing this to Netflix....But that left me in the middle of their corporate wars....Finally, I purchased a Google Chromecast and after installing it on my HD TV, no more problems with slow downloading of Netflix movies or poor quality pictures......Now everything is fast and clear once again....Granted, I have to turn on my android tablet and guide the whole thing from my tablet, but it is worth every penny I have invested in the Chromecast device....I highly recommend this device,  if you like me are having problems with your AT&T;/Netflix situation......", "verified": false, "helpfulness": "0/0", "author": "mars \"Americanshores\""}, {"rating": 4.0, "review": "Very satisfied with my purchase.  Easy set up. My only complaint is that you used your phone or tablet for the remote.", "verified": true, "helpfulness": "0/0", "author": "mellissa"}, {"rating": 3.0, "review": "it is getting better with every upgrade - would be nice to have more dedicated app and local streaming without having to pay for a plexpass", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "I have had fun with the Chromecase and my iPhone and iPad, but I am surprised at the video performance. I have to take my videos down to standard def to push them to the Chromecast. The router is <25 feet away, and is the latest Airport Extreme. The video still stutters, especially from Plex.  There are not a lot of apps that use the Chromecast from the ios devices as of yet. I would love to see more software to screen uses.", "verified": true, "helpfulness": "0/0", "author": "Maurice \"Maurice Naragon\""}, {"rating": 4.0, "review": "I like so much this product. I recomend this product to all the rokus customers. Open your horizon with google cromecast.", "verified": true, "helpfulness": "0/0", "author": "Jorge L. Martinez"}]