[{"rating": 5.0, "review": "I Just Love it . It's easy and simple and easy to install and does exactly what was announced without any wires nor Weary", "verified": true, "helpfulness": "0/0", "author": "Faisal"}, {"rating": 2.0, "review": "I am casting approximately 5 feet from my computer to my TV and not only is there a delay in the play but it actually freezes constantly and will eventually go blank.  I T R I E D to contact customer service, but it is easier to get through to Apple than these folks - and that is NOT a compliment to apple!!!By email, they advised reinstalling everything, which I did and still get the same things happening.I DO NOT recommend this.", "verified": true, "helpfulness": "0/0", "author": "S. Snyder"}, {"rating": 5.0, "review": "The Chromecast was very simple to setup and is concealed nicely behind my TV. Netflix and YouTube streaming from my phone is quick and clear. If available, it will stream HD from Netflix. Streaming from my computer can be fuzzy at times, but it is still doable.", "verified": true, "helpfulness": "0/0", "author": "Michel Scafidi"}, {"rating": 5.0, "review": "Like all other reviews. It so fast and easy. efficient too watching Netflix and youtube onto the tv. It is really a steal if you've been using it.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 4.0, "review": "The Chromecast works great, but I use iTunes frequently, and I am not able to stream from there. Hopefully they will be compatible in the future.", "verified": true, "helpfulness": "0/0", "author": "Hannah Obradoivch"}, {"rating": 5.0, "review": "My sister is more of the techie. I bought this for her, she was very excited, because she wanted one but didn't want to pay for it. I got it for a  really good price, about $27. She was able quickly connect it to her tv and I guess download a bunch of new apps. She was very pleased with the way it worked. It was shipped quickly to me. She has only had it for a week or so, but good so far.", "verified": true, "helpfulness": "0/0", "author": "Moomba2442"}, {"rating": 5.0, "review": "This is much better than what i was doing. Feeding through my old DVD to my router by hard wire still gave ridiculously slow speeds and drop outs. This device is smooth as silk. Also very easy to install", "verified": true, "helpfulness": "0/0", "author": "Jim Stricklin"}, {"rating": 1.0, "review": "I keep getting the error - fix your \"Access Isolation\"  in your wireless router. I fixed this setting in my router and also other setting they mentioned in their manual but It is still not getting configured from my laptop. :-(Called the Chrome support many times but of no use...", "verified": true, "helpfulness": "1/2", "author": "Devesh Joshi"}, {"rating": 5.0, "review": "I uninstalled Microsoft Silverlight on my PC and stream amazon videos using adobe flash insead. Works like a champ. So long cable.", "verified": true, "helpfulness": "0/0", "author": "Matthew Benson"}, {"rating": 4.0, "review": "I only wish I were able to stream music from my PC. It would also be nice if there were more apps available.", "verified": true, "helpfulness": "0/0", "author": "Mike"}]