[{"rating": 3.0, "review": "Price is great.Playing supported apps is great.Want to see something from the web that isn't associated with an app?  You can mirror what is on your screen.....well, only if you use chrome browser.  Oh, and not if you are trying to do it with an iPad or iPhone. Oh, and if you do it from your desktop and your chrome browser; the sound will be out of sync. ( they really need to fix that)However, we have used it everyday to watch netflix and YouTube. Love sonza.Still waiting for someone to make a device that will mirror anything on my iPad and ancient iPhone.Overall it's my bad for not doing more research on its limitations.", "verified": true, "helpfulness": "1/1", "author": "T. Leonard"}, {"rating": 5.0, "review": "Got two of these, one for my college senior and one for high school senior.  They both said it was the best present for Christmas, and they got really cool stuff other than this!", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 4.0, "review": "I love that I can move this around to any TV any time...  once setup is done it's easy to use from your smartphone or tablet.  The only reason I didn't give 5 stars is because it is limited on the amount of apps that will broadcast to it.  Although I'm sure Google will expand this in the future.", "verified": true, "helpfulness": "0/0", "author": "Nathan Krichel"}, {"rating": 2.0, "review": "First of all they require a regular wifi connection just to set up to your device, no exceptions. Second of all, it does not support static IPs at all.I've worked in IT and had issues setting this up on other's wifis, can't set it up on my own network, so it is basically useless for me. For most average setups maybe its ok.Like the idea, dislike the product.", "verified": true, "helpfulness": "0/0", "author": "Centity"}, {"rating": 1.0, "review": "I bought several of these under the impression that it would display photos and videos from my device. I was disappointed to find out that all it does is receive a URL you give it (Youtube, Netflix) from your device, and it proceeds to stream from that source, and furthermore, those sources are restricted by design.For it to be useful as a streaming media device, it needs to stream from my mobile device, not just from specific Internet locations.Also if you have a router or firewall protecting your local LAN and it's set up correctly (meaning it keeps bad guys out), expect there to be problems. The Chromecast uses Google's domain name servers rather than picking up yours from when it gets its IP address from your wireless system. Your firewall may block its access to the unexpected DNS traffic.Come on engineers: produce a useful version. You've got the WiFi bandwith. Make the local App on the device stream local videos or display its screen (for photos) through the Chromecast!", "verified": true, "helpfulness": "22/25", "author": "String Theory"}, {"rating": 1.0, "review": "My girlfriend and I were able to make it to what appeared to be last step in making this work (the \"ready to cast\" prompt appeared on the ipad mini we were using), but that's as far as we got, even after at least an hour of constant effort. Still don't see anything we weren't doing right. Very frustrating. We sent the Chromecast player back to amazon and got the Roku, which is more expensive but a much better product, according to other people we talked to who have used both. Waiting for that to arrive.", "verified": true, "helpfulness": "1/1", "author": "Val Ellicott \"dccyclist\""}, {"rating": 5.0, "review": "My fiancée liked watching her Korean dramas on hulu, but it was always on her iPad. With this, she was able to stream it quickly to her 50 in TV, then back to her iPad when she had to leave the room, and then quickly back again to the TV. She loves it. And for the price of $35, with no shipping cost, totally worth it.", "verified": true, "helpfulness": "0/0", "author": "Devindra S Dabiesingh"}, {"rating": 5.0, "review": "Very good, for sure in a few months the companies will start to place in to the TV from factory.", "verified": true, "helpfulness": "0/0", "author": "Luis Miguel Rodriguez"}, {"rating": 3.0, "review": "It works well most of the time. Occasionally it takes a long time to load  the movie, or worse, the movie pauses while watching. The biggest weakness is the limited applications availability, only YouTube and Netflix are working well with chromecast. We have Amazon Prime and cannot use it unless we have our laptop on.", "verified": true, "helpfulness": "0/0", "author": "Eli Lavie \"eli\""}, {"rating": 2.0, "review": "Limited to youtube and Netflix video.  Can't stream personal photos/video or video from other content suppliers. Hopefully updates will be made to allow other video sources.", "verified": true, "helpfulness": "0/0", "author": "John Damico"}]