[{"rating": 5.0, "review": "Good.", "verified": true, "helpfulness": "0/1", "author": "Daniel Nunes de Ávila"}, {"rating": 5.0, "review": "At $35 with no other fees ever, there's no reason not to get one. And we've found that Netflix actually runs more smoothly using this device and our wireless wi-fi than it does when using the Netflix-ready device attached directly to our tv by an ethernet cable.", "verified": true, "helpfulness": "0/0", "author": "AGoldin"}, {"rating": 4.0, "review": "Does the job instanly! :) It is getting a bit (too?) hot during the use. Easy to install, easy to use. Sometimes after screen sharing freezes. Cannot switch to youtube mode. Plug out - plug in... And it goes flawlessly again.", "verified": false, "helpfulness": "1/2", "author": "Dr. Z."}, {"rating": 5.0, "review": "It's simple and it works great! I have 5 in my home and 1 at Grandma's house. My kids use the heck out of them. Great for displaying all my video feeds like Netflix, Dogcatcher, YouTube, Flixter and Vudu. If only Google would get into DVR's and include Chromecast with it. If only my son would stop playing Minecraft videos ALL THE TIME! He's six......if he can use it, so can you.", "verified": false, "helpfulness": "0/0", "author": "Cheesycook"}, {"rating": 5.0, "review": "One of the best products I ever purchased!", "verified": true, "helpfulness": "0/0", "author": "Nir galon"}, {"rating": 5.0, "review": "Google rocks ! Supremely amazing device :) . can't get better . I have Samsung smart TV USB stick but it is no match to chromecast . Love to google !", "verified": true, "helpfulness": "0/0", "author": "Manish Narula"}, {"rating": 5.0, "review": "bien", "verified": true, "helpfulness": "0/0", "author": "samuel quezada"}, {"rating": 4.0, "review": "I rarely use it. I bought it so I didn't have to use an hdmi to pipe netflix and youtube to the tv but end just doing that anyway. I use two computers, if you have one computer and want to do something else while your watching its good deal. I think I'll use it more when I travel. It's cheap anyway if your thinking about getting it you should probably just buy it", "verified": true, "helpfulness": "0/1", "author": "Jesse L."}, {"rating": 5.0, "review": "Bought this for my daughter, she raves about it. Works very well and is easy to use. She transmits Netflix, HuluPlus, etc. from her phone / laptop / Chromebook  to HDTV seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The product is not worth investing money as it cannot stream directly from your laptop. I have FioS Verizon connection of 45 Mbps line and even then the streaming is not possible.I will not suggest this product because it worked fine for me for only couple of days and now I am having issues with the streaming.And, many times the network is not able to recognize the stick.", "verified": true, "helpfulness": "0/3", "author": "Puneet Arora"}]