[{"rating": 5.0, "review": "Love it, love it, love it! We were skeptical, since we had tried a few other options, like PlayOn, which didn't work very well, and thought it might be something like that. But on advice from a friend, I ordered one, and we're so glad I did! We don't have regular TV, don't even get local channels, and no real desire to. We watch everything on Hulu, Netflix and DVDs, but miss a few shows that we can't get anymore. If you can play it in a browser on your laptop, you can play on your TV!The other night, Xbox Live went down while I was watching Netflix, so I just switched over to Chromecast, and carried on. Simple! Next we're going to try some of the Top Gear and Ghosthunters episodes. So much more comfortable, especially when we're sick, to watch from the comfort of our living room instead of sitting up in office chairs.", "verified": true, "helpfulness": "1/1", "author": "Kathy Kemp \"horse-round.com\""}, {"rating": 1.0, "review": "Didnt work with my internet service (AT&T;)", "verified": true, "helpfulness": "1/4", "author": "matt"}, {"rating": 5.0, "review": "Works great. Now watching videos on my big tv is so easy,", "verified": true, "helpfulness": "0/1", "author": "Prachur Jaiswal"}, {"rating": 5.0, "review": "Works perfect in my bedroom. Best price/benefit than Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Pedro Führer"}, {"rating": 5.0, "review": "The best tech right now to share it and view it in your TV.", "verified": true, "helpfulness": "0/1", "author": "Oliver Zaragoza"}, {"rating": 3.0, "review": "Still trying to figure out how to use", "verified": true, "helpfulness": "0/3", "author": "George L. Stroker"}, {"rating": 4.0, "review": "Works great for us. We sold our apple tv because we like this so much better. We watch shows from Hulu on our phones on our TV. Sometimes it doesnt connect well, but usually works fine.", "verified": true, "helpfulness": "1/1", "author": "Josh M."}, {"rating": 1.0, "review": "I haven't figured a use for it", "verified": true, "helpfulness": "0/5", "author": "William H. Tockerman"}, {"rating": 4.0, "review": "Works great streams great.  I was even able to drag and drop my avi files into the url bar and watch them on my tv no problem. Love it!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Caudillo"}, {"rating": 5.0, "review": "Does what it is supposed to do.", "verified": true, "helpfulness": "0/0", "author": "Kitopal"}]