[{"rating": 2.0, "review": "I find the Chromecast disappointing. I've tried it on Youtube and Acorn tv  It streams for a minute or so then I get the home page saying there is no connection.  When I stream Netflix, without Chromecast (Netflix is programmed into my tv and uses my wifi) I don't have this problem.  I'm just find Chromecast frustrating.", "verified": true, "helpfulness": "0/1", "author": "Richard Steelman \"biker\""}, {"rating": 5.0, "review": "Cool little device that is super easy to use. Once I plugged this in to my TV and into the wall, I was able to operate it in minutes and was watching Netflix on my TV. It's a great deal for $35. And I love that I operate it through an app on my iPhone.", "verified": true, "helpfulness": "1/2", "author": "Lindsay Allen"}, {"rating": 4.0, "review": "So easy to use and it connects quickly and without issues.  The power supply cord is a bit short, but we found ways around that.  I am looking forward to seeing what else Google permits to be \"chromecasted\".", "verified": true, "helpfulness": "0/0", "author": "GT"}, {"rating": 3.0, "review": "At the time of writing, it's still pretty limited in what it can stream.  I was expecting it to be able to show whatever I had in my browser, but right now it's no better than the cheapest roku.", "verified": true, "helpfulness": "0/0", "author": "P. Elliott"}, {"rating": 5.0, "review": "We love our chromecast. We use it to watch Netflix and YouTube. One of the issues we have sometimes is we will be loading a movie or tv show on Netflix and the screen will freeze on the logo. Normally, to fix the issue we start a YouTube video and it unlocks itself.We have also used it to watch web content by downloading Chrome on our computer and casting it up. It worked really well however, it doesn't work the same as it does when you cast up NetFlix. The show still plays on the computer and if you close the computer and it goes to sleep you can disrupt the feed. To use it with Chrome you cast up a particular tab. I like the way it functions better with NetFlix and YouTube because I can close the apps, turn off my phone or shut down my ipad without disrupting the feed.Other than that it works like a charm and is much better then my old sony blue ray which has issues with varying singles and will drop the whole program on us. I can't wait till there are more apps.", "verified": true, "helpfulness": "0/1", "author": "Sasha Smith"}, {"rating": 3.0, "review": "Slighltly more to hook-up and connection than expected - based on what I read.  The casting has not been as seamless as suggested in the marketing. Tried to stream a movie once and ultimately stopped becasue the audio was lagging behind the video. It has been OK for use with YouTube and casting a Tab, but other than that not very impressed!! Great price though, but some times you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Douglas Roe"}, {"rating": 5.0, "review": "It worked great right out of the box. It was incredibly easy to set up. I love the results :)", "verified": true, "helpfulness": "0/1", "author": "B. Cisneros"}, {"rating": 4.0, "review": "Works great.  I have had few technical issues with the signal.There are limited uses, especially on tablets. Needs more apps.", "verified": true, "helpfulness": "0/0", "author": "Ben M Toleman"}, {"rating": 4.0, "review": "Picture looks great and works great with my ipad and iphone, close competition with apple tv.  Made old tv to a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "I bought mine, and it was decent at first - a nice cheap way of casting some stuff on my TV. Then, it started to \"go weird\". It became unresponsive once, and took some effort to get it reset. Worked for a bit after that, but happened, again, and had to reset it again, only this time it forgot its settings, and I had to re-initialize it.Now it just seems dead... permanent red light. I'm a little tired of wrestling with this thing.", "verified": true, "helpfulness": "0/0", "author": "Jasper J. Turcote"}]