[{"rating": 4.0, "review": "I like this, but I wish it were usable over more formats. Very disappointed that I cannot chrome cast from my tablet using prime", "verified": true, "helpfulness": "0/0", "author": "Mike Peters"}, {"rating": 5.0, "review": "Love this very good to watch Netflix and YouTube on televisions that don't have internet. Just wish they can update it to get more apps on it.", "verified": true, "helpfulness": "0/0", "author": "phillip"}, {"rating": 5.0, "review": "I installed this relatively easy, and once I figured our how to use it, it works beautifully.  It works best off my Samsung Galaxy S-3 smart phone.  No luck w/ my Kindle Fire HD.", "verified": true, "helpfulness": "0/0", "author": "Rpres"}, {"rating": 5.0, "review": "Very easy to work. Easy to switch from PC to TV. I love to use it for pictures or home video.I recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "Mar \"Ladybug\""}, {"rating": 5.0, "review": "Absolutely love it, my daughter can now stream their favorite youtube channels on the big TV instead of watching it on a tiny pad screen", "verified": false, "helpfulness": "0/0", "author": "TheOnlyJanette"}, {"rating": 5.0, "review": "Easy to use and very convenient for streaming. What's easier than using your own smart phone or tablet as a controller! If there was anything to complain about would be the cable length from the chromecast to the USB port to charge, but thats really nitpicking.", "verified": true, "helpfulness": "0/0", "author": "Pete C."}, {"rating": 5.0, "review": "Okay - I got rid of my HT-PC thinking that I could replace it with a linux running on Intel's new NUC. It's a fancy unit at a cost around $220.When I did that, I thought a linux box would serve these needs:1) Play media files on my Synology NAS2) Netflix3) Amazon Instant Videos4) HBO GOThose are all the things you can do on a Mac, Windows PC, an Android phone or tablet, iPhone, iPad, or even Amazon Kindle HD at $130. But to work with a TV in the living room? Below were my trade study options.Option 1: Roku familyRoku provides an excellent experience for 2) and 3). But 4) is impossible for Comcast users and 1) is a bit flaky. I have a Roku 3 serving on another room but I do have different needs with emphasis on 1). So drop Roku.Option 2: Amazon Fire TVThis new player on the streamer market gets attention with voice command that works - that works so perfectly to promote Amazon Video sales (or prime membership). This would work fantastically for 3) by its nature. It will work of course on par with Roku on 2). But it would fail on 1) and 4), though with Kindle Fire HD, there's some workarounds.Option 3: Apple TVWhen I buy media contents, I buy from Amazon. Sorry Apple. I am a continuous customer of macbooks and iphones. Hang in there buddy, and produce something better for streaming solutions.Option 4: Chromebox by ASUSI almost bought this one since it would be a perfect replacement of PC and a much better one than a linux box since there will be no discrimination from Netflix and Amazon Instant Video. Except... you won't be able to access anything other than web. Especially your contents on NAS. Move on.Option 5: NUC hackintoshYou can build one today (apr '14) under $300 with 120GB mSata SSD, 2GB memory, Gigabit ethernet through thunderbolt which is sufficient for this purpose. I sold my HT PC to get rid of hassle not to make more. Moving on.Option 6: Mac MiniSeriously, used mac for $400 without SSD? A new one at $600 plus tax but still no SSD?Option 7: Back to PCVarious options from Lenovo, ASUS, and Acer. Very tempting at around $300 including Windows 7. Solve all the issuesOption 8: A linux net topLinux is discriminated because it's so easy for genius hackers to hack a thing on DRM. Amazon and Netflix both hates Linux. Though XBMC is making it very attractive for the needs 1)And.. finallyOption 9: ChromecastI got enough devices in the house that can be used as DRM authenticator, search interface, and the remote controller for the playback. Kindle Fire HD, iphone.Chromecast is a good solution for 2) and 4). 3) seems to be impossible. 1) is limited when you do it through DLNA on NAS which means you need to be picky on the formats.-----So I tried Option 8 and 9 at the cost of $200 + $30 (the former was a NUC plus SSD, the latter was the price for a chromecast). As a result of disappointing performance, the NUC is returned. Yes I tried hard with pipelight and all good things. I don't like it when software can't use the full potential of the hardware.Now the Chromecast experience was smooth.1) Synology NAS can do DLNA for limited formats but it does well when it does. Can anything fling it to Chromecast? Yes. I have donated my bloody couple of dollars on Avia player to run on my kindle fire HD, and it's paying off now. Avia player simply shows the connect button for Chromecast which makes things very intuitive. Even when my iphone was playing the Pandora, it can steal the connection from it and Avia takes over.2) Netflix on iphone works as advertised.3) Amazon decidedly do not support Chromecast. This will have to be handled separately.4) HBO GO. Brilliantly works on iphone.These all works without adding more hassle or a remote controller laying around. Also those mobile devices do not seem to drain battery for this. Playing Pandora from iphone was very seamless as a bonus. Now since Spotify is lagging on this, should I switch to Google Music?It was a surprise to me that Google figured all this out. The four components of streaming box: Discovery of contents, DRM, controller, and streaming decoder. Chromecast takes the decoder part only and communicates with apps to integrate DRM and controller actions. Apps do a better job with their keyboards than any remote controller for discovery of contents.I am consuming more contents from Amazon video market so Fire TV seems to be inevitable.Overall I like what Chromecast does - but still sometimes I wish there was a dedicated remote to show the remaining time on the screen, control the volume, and pause/play quickly. An optional remote at $10. Can't you Google?", "verified": true, "helpfulness": "1/1", "author": "TABULA RASA"}, {"rating": 3.0, "review": "The quality is poor if you use chrome browser to cast. Only good if you are using for Netflix, HBO go or YouTube.This is only good because of its price. I got it for $30.", "verified": true, "helpfulness": "0/0", "author": "Mamatha Reddy"}, {"rating": 5.0, "review": "Just got this last night. I have a PS4, so most video streaming apps that I use are already supported by the console (Netflix, Amazon VIdeo, MLB, etc.). I wanted a nice, inexpensive way to watch media from my laptop and devices on the big screen, especially Google Play videos. This does exactly that...prefectly. The set up was a breeze, which you use your PC to do. I already use Chrome, so I just had to download the Chromecast plugin for it. To play my personal media from my laptop, I use the free version of Plex. I watched a few episodes of Seinfeld from my laptop using Plex and it worked without a hitch. The video was smooth and not choppy at all. Then I used my smartphone to play a view episodes of Regular Show via Google TV & Videos from the cloud. Once again, the video was absolutely solid at total 1080p resolution. YouTube works great, too. All you do is click on the icon to \"shoot\" the video to your TV and Chromecast does the rest. For a media device \"dongle\", there is no other way to go.", "verified": true, "helpfulness": "0/0", "author": "Mike C."}, {"rating": 5.0, "review": "Best money I ever spent. Take that giant cable conglomerate... um, except that you also control my internet access. Doh", "verified": true, "helpfulness": "0/0", "author": "Greg McNulty"}]