[{"rating": 5.0, "review": "Love love love this!! My family and I watch movies all the time! I bought two for my house, and I'm buying one for my mom, and my daughter...", "verified": true, "helpfulness": "1/1", "author": "Alisa Smith"}, {"rating": 5.0, "review": "Good price :), now i have an smart tv", "verified": true, "helpfulness": "0/0", "author": "Francisco"}, {"rating": 5.0, "review": "This is the most amazing product in streaming media player industry. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Recep Erdogan"}, {"rating": 5.0, "review": "Have not used this yet but excited about it", "verified": true, "helpfulness": "0/1", "author": "Jamie H"}, {"rating": 3.0, "review": "No remote is a deal breaker. If I cast something from my computer then I have to go to my computer to pause it.", "verified": true, "helpfulness": "0/2", "author": "Christopher L."}, {"rating": 3.0, "review": "Keeps losing connection so I bought a Roku.", "verified": true, "helpfulness": "0/0", "author": "Cherri Trahan"}, {"rating": 5.0, "review": "Great Product! Low Price.  Easy install", "verified": true, "helpfulness": "1/1", "author": "Steven Polakoff"}, {"rating": 4.0, "review": "This is the 2nd one I purchased. It works very nicely, and not very expensive.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Since buying our chromecast, we rarely watch normal TV anymore.  We can easily stream Netflix or Hulu Plus to our TV and watch our favorite shows.  I also like the ability to cast your tab from your computer.  This makes it very easy to show someone else whatever you need to show them.  My only problem with this is not with chromecast itself, but with the apps it works with.  Some apps, especially Netflix can be somewhat difficult to use with a chromecast.  Getting the video to play initially works just fine.  However, if you need to pause, rewind, etc. the app typically takes too long to open back up and oftentimes no longer shows the casting icon, making it difficult to control easily and quickly.  As I said this is more of an issue with the third party apps, but it can also be caused by the fact that chromecast does not have a dedicated remote.  When you need to quickly and easily control something, a dedicated remote can be very useful.", "verified": true, "helpfulness": "0/0", "author": "Chris Floegel"}, {"rating": 5.0, "review": "Best caster !!!", "verified": true, "helpfulness": "0/0", "author": "Federico Michel Zwiebel \"Fred M.\""}]