[{"rating": 5.0, "review": "very easy to use and it is quite handy for watching youtube, Netflicks, and browser pages on your Chrome browser", "verified": true, "helpfulness": "0/0", "author": "David Tapper"}, {"rating": 5.0, "review": "Chromecast is great! This little device is very easy to install and is working amazingly well. It has been saving me from a lot of trouble. I no longer have to plug my computer to the TV in order to watch Netflix or HBO Go. Would for sure recommend the purchase of this product.", "verified": true, "helpfulness": "0/0", "author": "Dani Silva"}, {"rating": 3.0, "review": "What an amazing Netflix Player (if you have an Android phone).An Apple TV provides a more-convenient Netflix experience. But if your Android Phone is always connected to your Wi-Fi network, then it's pretty nice being able to control Netflix from a well-designed UI on your phone.The ChromeCast needs to be fairly close to the Wi-Fi router in order to connect. If the back of the TV is away from the router, then even 20 ft. away is too far to connect, as the TV blocks the signal.Just to be clear, Chromecast streams only from the local Wi-Fi connection. It would be nice if it could share the phone data connection. Mine is over 10x the speed of my Wi-Fi Internet connection, so jumping around in Netflix on the phone is very fast. But Chromecast streams over the Internet using the local Wi-Fi connection - not the phone data plan (this is a plus for people without unlimited data plans).", "verified": true, "helpfulness": "0/1", "author": "Brent Foust"}, {"rating": 5.0, "review": "Easy to set up.  Works great.  Price is right.  It was a nice solution for us with a smaller kitchen TV, where we didn't want a larger device cluttering the small space.", "verified": true, "helpfulness": "0/0", "author": "Joseph D. Loveland"}, {"rating": 5.0, "review": "I just wanted a short cable form my chromecast plugin as the port for the chromecast was directly above the USB port on my TV", "verified": true, "helpfulness": "0/0", "author": "Mark A. Smith \"jedi accountant\""}, {"rating": 5.0, "review": "I hope the content providers start to support chromecasting better. you cant chromecast from all devices... computers dont cast hulu...some tablets have a tough time with netflix... others have a difficult time with hulu... i blame it on the aps/ devices, not the cromecast... cant beat the price!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This product is great if you are looking to turn your regular TV screen in to a sort of an Smart TV, BTW works in Mexico with out any issues", "verified": true, "helpfulness": "0/0", "author": "David A."}, {"rating": 5.0, "review": "I thought this device was junk until I found an app called Avia that unlocks and plays videos from anywhere. Steam anything with great quality. Love this thing now. Works great and now no complaints. Most people don't even know about this.", "verified": false, "helpfulness": "0/0", "author": "gdog"}, {"rating": 1.0, "review": "not many Apps that support it, you tube constantly crashes, Besides Pandora all the other apps are just not worth it", "verified": true, "helpfulness": "1/2", "author": "Ernie boy"}, {"rating": 3.0, "review": "which is kinda neat.  I'm not a tech guru so I don't know how many other plug in dealios you can just plug in and quickly set up (I doubt many), and have your computer's web browser on a big screen tv in your living room.  but I couldn't get the rest of my desktop to show, and for things like netflix, the quality degraded considerably between what I saw on my laptop monitor versus what showed on the tv.  which is of course to be expected when transmitting so much data on a stream, and my vid card may not be the greatest either, and then there's your home network doing double or triple duty for one objective (i.e. expectations should be adjusted).  but unfortunately, other streaming devices will give you better quality to your tv.  but they won't emulate your browser (PS3 browser I am going to single you out as utterly horrible here).  this plug in is truly a \"get what you pay for\" kind of thing, but praise to google for trying to take steps in the right direction.  someday soon this framework could be a lot more powerful and useful.", "verified": true, "helpfulness": "0/0", "author": "corpopolis"}]