[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "sami bagais"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Iva Crawford"}, {"rating": 5.0, "review": "Works great!! Best investment I've made so far.", "verified": true, "helpfulness": "0/0", "author": "Philip Cardenas"}, {"rating": 5.0, "review": "ENJOYABLE", "verified": true, "helpfulness": "0/0", "author": "Eileen Rogers"}, {"rating": 5.0, "review": "I find it easy to use. Thought the price was also good value highly recommend", "verified": true, "helpfulness": "0/0", "author": "Chef Sharpy"}, {"rating": 5.0, "review": "Chromecast has changed my life. Gone are the days of hooking a computer to a screen, or buying media. I can now pull stuff digitally, use PLEX, and BOOM! Heaven.My only concern is for 4k content - when that becomes more mainstream how are we to get that in our households? Certainly not through these current models... (something to think about).", "verified": true, "helpfulness": "0/0", "author": "Degan"}, {"rating": 5.0, "review": "easy to setup and use. i love how you can stream something yet use a totally different part of your phone/ipad/mac", "verified": true, "helpfulness": "0/0", "author": "Carsten de Wolff"}, {"rating": 5.0, "review": "100%", "verified": true, "helpfulness": "0/0", "author": "A.B"}, {"rating": 1.0, "review": "Easy to setup and easy to use, but only worked for a month before it suddenly quit working a becoming a doorstop. Called customer support and got through on the third try.  Passed around between a few people, asking me to troubleshoot, etc...  until I was told they need to converse with their \"engineers\" about the issue, (what issue? it's DEAD!) and someone will get back to me.  Obviously it's still under warranty but they don't want to replace it.  That was 2 weeks ago and still no phone call or email.  Just another big company that doesn't give a crap about it's customers.I also have a Roku and that works awesome.  Do yourself a favor and get a Roku", "verified": false, "helpfulness": "0/0", "author": "shopper"}, {"rating": 4.0, "review": "It comes with a learning curve and is a little slow starting up but works well after. I would like support to make it easier to find apps to help you stream from devices to chromecast,", "verified": true, "helpfulness": "0/0", "author": "Daniel de Leon"}]