[{"rating": 4.0, "review": "The twitch app only streams in 480p which sucks", "verified": true, "helpfulness": "0/0", "author": "francis"}, {"rating": 5.0, "review": "I have had the fire tv for about a month now and I love it.  It was really easy to set up, sign into my accounts and add apps.  Basically you connect a few cords and sign into your accounts and that is it.  The voice search is amazing so no more typing to find shows or movies. It is so easy to use that my 6 year nephew and 3 year old niece can use it by themselves.  All of the Prime shows are easy to get under Prime Video however there sorted by what Amazon recommends.  I would like to see it sorted by genre of tv show or movie so you can see everything in that category.  But it overall it is better than the Apple Tv and Roku which I also have both of those.", "verified": true, "helpfulness": "0/0", "author": "Heather Rae"}, {"rating": 4.0, "review": "Remote has tiny buttons and is difficult for my older hubby to use.  No way to limit movie search to rent-able offerings.  We spend a lot of time finding something we are both interested in only to find it is only offered for sale not rental.", "verified": true, "helpfulness": "0/0", "author": "C. Smith"}, {"rating": 5.0, "review": "Met and exceeded my expectations.  Still learning about it.", "verified": true, "helpfulness": "0/0", "author": "Brad Wilkenson"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "DC-Army Retired"}, {"rating": 5.0, "review": "Best thing that ever happened to having cable and love that you only pay once a year.", "verified": true, "helpfulness": "0/0", "author": "sally geathers"}, {"rating": 5.0, "review": "We are quite pleased with this purchase. It is easy to use and the functions make it quite convenient to watch movies without having to \"run out to pick up a movie\" and then remember to drop it back off the next day.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good, now I can cancel my cable", "verified": true, "helpfulness": "0/0", "author": "Just finish"}, {"rating": 2.0, "review": "It was a gift. I have not used it because the free choices are very limited.", "verified": true, "helpfulness": "0/2", "author": "May Lang"}, {"rating": 5.0, "review": "Easy setup", "verified": true, "helpfulness": "0/0", "author": "David A."}]