[{"rating": 3.0, "review": "Works OK with Nexflix and Youtube but won't stream other things like on-demand TV shows, etc.  Only works with Google Chrome and makes windows 8 switch to desktop.", "verified": true, "helpfulness": "0/0", "author": "Cay"}, {"rating": 3.0, "review": "I gave it away.", "verified": true, "helpfulness": "0/0", "author": "Hazel Runser \"computer shopper\""}, {"rating": 4.0, "review": "Fantastic for the money but a little under powered for what I wanted. I did also miss having a dedicated remote. I went with a roku 3 using primarily the plex channel / app but paid $90 for the roku.", "verified": true, "helpfulness": "0/0", "author": "cbr"}, {"rating": 5.0, "review": "This item has allowed us to wirelessly play or show anything from one of our devices on our flat screens.  It is a cool device and works very well.  I would recommend this item to anyone.", "verified": true, "helpfulness": "0/0", "author": "G. Zavadil"}, {"rating": 4.0, "review": "This works perfectly from our phones, Android & iPhones as well as our laptops.  I just wish it work from my Kindle Fire.  After trying to watch Amazon movies through my Kindle with no luck, we found we could stream through our Blue ray player.  Even so, this is a fun, convenient gadget to have.", "verified": true, "helpfulness": "0/0", "author": "G. Webb"}, {"rating": 1.0, "review": "If it worked as stated ... Not , blew out my network drivers and took me off the interwebs . Tried to get it to work three different times , with no luck . New computer Win/8 , tried Win/8.1 too , new smart TV . My PC was sooo messed up that I did reload of the OS . I will say that Amazon customer service is outstanding . That is all , carry on . ;)", "verified": true, "helpfulness": "0/1", "author": "ScottyG"}, {"rating": 1.0, "review": "In the first 2 minutes of trying to use it, I lost the connection at least 4 times, the computer I am trying to link is just a few feet away.  Its really not going well at all.  I like the idea but the whole \"streaming\" function is very clunky and I feel like this day in age, we should not have to deal with choppy crappy video.  I have the best internet download speed available and I have an apple tv which works great.  I'll return this later today, its worthless.", "verified": false, "helpfulness": "0/0", "author": "R. L. Smith \"R Smith\""}, {"rating": 5.0, "review": "Bought one.Then another.Then two more.At this price, no reason not to have them on every TV in your house.", "verified": true, "helpfulness": "0/0", "author": "P. Harrington \"rekrap\""}, {"rating": 5.0, "review": "Watch Netflix on your TV for $35!!  I have a WII for one TV but this works just as well for a fraction of the price.", "verified": true, "helpfulness": "0/0", "author": "*60patti"}, {"rating": 5.0, "review": "I use the chrome cast to stream video from my unraid server to my TV using Plex Media Server software. Very slick. No problems. Unbelievable performance. Setup my buddy with Plex media server software on Windows 8 machine and chrome cast on TV. He uses an android tablet and casts movies using Plex software on the tablet. Again amazing quality and value for money. Would highly recommend.", "verified": false, "helpfulness": "1/1", "author": "Jude Sanson"}]