[{"rating": 5.0, "review": "Got this to broadcast HBO Go and NetFlix using my Wifi router and it works great every time.  Have recently started using it for Youtube as well, works perfectly.  I have tried casting from the Google browser and it does not work for me, even for Netflix. The tv is about 20 ft from my router so the distance is probably too far.  Sending straight from compatible websites lets us relax and watch great programming on our big screen tv instead of crouching around a computer monitor. It will be great when Google works out the bugs so webpages can be easily cast from the browser, as the advertising promised when I purchased.", "verified": true, "helpfulness": "1/1", "author": "tdlclifford \"tmc\""}, {"rating": 2.0, "review": "The good stuff first.  Set-up was easy.  Twenty minutes after opening the box we were able to cast Netflix and Hulu Plus content to our Vizio HDTV.The bad?  Chromecast's wireless signal created interference when watching OTA TV stations.  Simple solution was to unplug the Chromecast when not in use.  Upon next start-up Chromecast device would not reconnect to internet.  To make matters worse, something in the Chromecast App was also preventing our Ipad from connecting to our wifi network.  Google support emailed as follows: \"please reset your router, restart your iPad. turn off wifi & turn back on. uninstall chrome. Now reset the Chromecast again & try again\" ... all because we powered the device down.  This is totally unacceptable for a consumer electronics device.  I am a longtime Amazon customer and this is the first item I've ever had to return.", "verified": true, "helpfulness": "0/0", "author": "thom hamilton"}, {"rating": 4.0, "review": "Once I figured out what I was doing, I really enjoyed my Google Chrome device. I am not able to figure out how to get youtube to work, but Netflix works great. The device could come with a bit more documentation, to my mind.", "verified": true, "helpfulness": "0/0", "author": "Herb Pagel"}, {"rating": 2.0, "review": "After hours of customer service questions and troubleshooting I still couldn't get it to work. I have it to a friend with different internet company and it works ok for him", "verified": true, "helpfulness": "0/0", "author": "Philip Lotterhos"}, {"rating": 5.0, "review": "This product is great for anyone who watches alot of Netflix, You Tube HBO on the go etc.  Sometimes there is a big of confusion connecting but for the price this is a great product and performs well 98% of the time.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "Sometimes it is hard to get this to connect, especially in an environment with multiple wireless routers. It will only get better though.", "verified": true, "helpfulness": "0/0", "author": "Dean"}, {"rating": 3.0, "review": "Cons: The list of chromecast enabled apps is pretty short. The quality is OK if you want to put a browser window contents on a TV. If you want to stream Netflix or some other streaming service Roku or AppleTV are better (or just get a smart TV) are much crisper.Pros: compact, relatively easy setup.", "verified": true, "helpfulness": "0/0", "author": "uiguy"}, {"rating": 5.0, "review": "Really pleased with the Chromecast -- installation was easy and straightforward and I've been impressed with the streaming quality on a 50\" screen. At $30 I'd buy this just for Netflix alone: content loads and runs smoothly (some buffering here and there but not unwatchable). Chrome tab casting is an added bonus -- nice way to quickly share content with people gathered around the TV.", "verified": true, "helpfulness": "0/0", "author": "David C"}, {"rating": 4.0, "review": "I love this thing. So far I've only used it to stream youtube videos to my TV and for that alone it is worth it. Setup is very easy and it works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Mike R."}, {"rating": 5.0, "review": "Google has done it again - Chromecast is awesome, smart, fast, and really easy to use. For the price, you can't beat it. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Stephanie218"}]