[{"rating": 5.0, "review": "Great for movies, but need more moviesNeed more apps the use this Media PlayerA lot of my friend are going to buy one.", "verified": true, "helpfulness": "0/0", "author": "Eugenio C. Garza"}, {"rating": 5.0, "review": "truly great.  we use it daily.  very good result.  and I recommend it to every one.  Theater at home!  not one or two, hundred times.", "verified": true, "helpfulness": "0/0", "author": "TAM \"Tamara\""}, {"rating": 1.0, "review": "The chromecast device keeps disconnecting my wifi, failed to install multiple times and has yet to load a single youtube video successfully to my TV. I've tried updating the firmware and it still continues to crash my chrome browser. It now makes for a great butt plug.", "verified": true, "helpfulness": "1/1", "author": "H. Y. Lee"}, {"rating": 5.0, "review": "I purchased as gift for y brother and his wife. In order to save money they were getting rid of cable, but since they don't have home theatre pc they figured they would have to watch everything through XBOX. getting them this has allowed them to watch their shows in room if kids want to play games or watch childrens shows in TV room. They loved the control from phone and were simply amazed it worked because they had cabled their laptop to tv in past but hated the quality. They are not tech savvy but were able to set up while I was there without my aid.I would recommend to anyone, because of functionality and ease of use and set-up. I own a roku and I believe this is better and easier to use; but I do acknowledge roku has more experience at this point. This one is so easy to use I plan to get one for my mother to replace her roku which drives her nuts using Netflix and other services like Prime and Hulu. Great product Google! Great delivery time Amazon!", "verified": true, "helpfulness": "0/0", "author": "Fabeldoop \"Muzzy wuzzy\""}, {"rating": 3.0, "review": "I think I would love it if I could get it to work with my router. Google says check with the manufacturer of my router. Netgear says check with Google. Ugh!!!!", "verified": true, "helpfulness": "0/0", "author": "Nancy Turner"}, {"rating": 5.0, "review": "I am satisfy with this purchase however I'm a little disappointed I can't just mirror my iphone to it. Was aware of this before purchase but had hopes of a workaround.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 2.0, "review": "I do not have the Wi-Fi (my router is not compatible.  So needed to upgrade my phone - which I thought would take care of it but it will not allow me to undo my previous attempt at installing. I am no techie obviously but I thought I could use the WiFi from my Internet provider or from the mobile and I am stymied.  Watched it on YouTube and it looked easy?I also have not had the time or patience to keep at it.", "verified": true, "helpfulness": "0/0", "author": "joyce"}, {"rating": 5.0, "review": "This needs to be in every home that uses wifi and has a TV with a USB connect port. Pleasantly inexpensive and now that I know what it does I would've paid more, Stocking Stuffers for EVERYONE next year ;)I Recommend it to anyone. You don't have to be tech savvy to plug it in, load the app in your device, connect and GO!!", "verified": true, "helpfulness": "0/0", "author": "Kari Brooks \"Say something about yourself!\""}, {"rating": 5.0, "review": "one of the best invention in the modern era. google u really did it this time the chromecast will put a scare in smart tv sales best product of the year so far chromecast by google", "verified": true, "helpfulness": "0/0", "author": "Lewis harrison"}, {"rating": 5.0, "review": "Easy to set up. Works great. Get one for every TV in your house. I highly recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Patrick Malone"}]