[{"rating": 4.0, "review": "I received this as a gift and was not initially excited by it. I already use a Roku 3 and figured the Chromecast would be redundant. Upon familiarizing myself with it, I found some of its features to be stellar. It is amazing how compact and capable this device is. Perfect for get togethers, any friend can put up videos to the TV. It gets as much use as my Roku.", "verified": false, "helpfulness": "1/1", "author": "Kevin"}, {"rating": 5.0, "review": "It does what it advertises. I cannot wait till they add plex support so I can stream movies to TV !", "verified": true, "helpfulness": "0/0", "author": "Clay"}, {"rating": 5.0, "review": "Its excelent article , but problem with share Tap(video) with chrome ,  also  only used with chrome canary.Good job google", "verified": true, "helpfulness": "0/0", "author": "Mauricio Acevedo Rueda"}, {"rating": 5.0, "review": "I utilize Google Music and the all access pass they offer.  I have been waiting for Sonos to have native capability with Google Music's streaming plan, but to date it has not been provided.  Instead of paying $199 to $499 for Sonos speakers I decided to get this $35 solution and hook it up to my soundbar in the living room.  Luckily I have a great house at only 1,100 square feet so I don't need speakers in every room to hear music.It works flawlessly with both the music streaming and youtube streaming.  I have not yet tried Netflix as I have a computer that is hooked up to my TV for entertainment and still access Netflix that way instead of through my tablet or phone.Pros- Set-up there is only the device to setup and an extension for a laptop to download.  Very few steps.  I have one caveat mentioned below in the \"Cons\".- Automatically works on the smartphone and tablet apps with no additional set-up required.- Video and audio quality is very good.- The device is hidden from view unlike other streaming services that require a larger box presence.- $35 is very affordable relative to other options.- Works seemlessly with the apps and services that are available to it.Cons- Set-up on the first day was a little frustrating.  Chromecast finished downloading the updates, but never told me I had to unplug the device and plug it back in for it to reset nor did any of the online troubleshooting guides.- Lacks extensive app support from various services such as Amazon Prime, Apple's media, Spotify, etc.  I recognize this is due in part because of Google competing with those companies in various ways and that it will require those same companies to allow native support.Overall this is a great little gadget.  It is a great fit if you are invested in Google's ecosystem of products.", "verified": true, "helpfulness": "0/0", "author": "M. Fisher"}, {"rating": 5.0, "review": "This is very cool. All that is needed is to expand streaming capabilities to media players of other websites or any on-screen video playing on computers or phone/tablet devices.", "verified": true, "helpfulness": "1/1", "author": "emeka"}, {"rating": 5.0, "review": "If you don't know by now, THIS WILL NOT MIRROR WHATEVER YOU HAVE ON YOUR SCREEN. That being said, the device acts like a wifi antenna turning any HD TV into a smart TV. I love the implementation with my android phone using it as a remote. I've tried using the Chromocast with tabs using a Chromebook and laptop. Sadly, video playback was choppy and unsatisfying. However, the supported apps (Youtube, Netflix) worked really well. I'm more apps will continuously be added.Overall, I liked the device but will return it. Most of the Apps simply won't work outside of America, where I reside.", "verified": true, "helpfulness": "1/1", "author": "Otto Andersson"}, {"rating": 3.0, "review": "Pretty limited in it's use. Needs more apps to make it worthy, although the technology is fantastic. It's really cool to watch YouTube videos on our big screen.", "verified": true, "helpfulness": "0/0", "author": "MJS Web Solutions"}, {"rating": 5.0, "review": "Quick delivery and great product.  I am a completely satisfied customer!  Would highly recommend. ..I am anti apple so apple tv is not an option for me.", "verified": false, "helpfulness": "0/0", "author": "Kara"}, {"rating": 4.0, "review": "There are some glitches.  Sometimes it doesn't quite talk to Google play all that well.  Have had no problems using with Netflix.  Would love if I could use it for tv shows streaming off the show's website, or for on Amazon, but so far so good!", "verified": true, "helpfulness": "0/0", "author": "Leah Kelly"}, {"rating": 4.0, "review": "My Boss gave me one as a Christmas gift.  After it lay on the table for a month, I finally decided to test it out.  I plugged it up through my Samsung Galaxy tablet this past weekend.  I was really impressed with the HD screen quality while streaming from Netflix, eight episodes of my favorite TV show \"Scandal\".  I watched 4 episodes one day, and 4 the next day, and not once was I disappointed with the steaming.  So far, I've viewed shows only thru Hulu and Netflix.  I have not yet tried viewing thru You Tube, but I'm sure it's great.  I give this only 4 out of 5 stars because I feel that a unit such as Chromecast should be able to view any video from any website, and not just specific websites.  But this is not the fault of the unit itself,  but it is the fault of specific companies trying to monopolize the market so that you can only view video material thru their websites.  But the Chromecast device itself is superb.  I have no complaints.", "verified": false, "helpfulness": "0/0", "author": "Diamond M. Dominguez \"diamon2x\""}]