[{"rating": 4.0, "review": "Relatively inexpensive and works great!  Previously I was using an HDMI cable hooked up to my computer; this works much better and saves on battery power.  Casting works in a pretty wide radius, I was able to cast from my phone in my room to the television in the living room.Downsides I've found thus far:- Slight lag/multiple tries for pausing using iPhone as a remote- No Amazon Instant Video- Limited success in streaming videos from a chrome browser (not YouTube)Overall I'm very satisfied and would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 4.0, "review": "i have heard people say that it freezes and skips, but i have the fastest internet speed they sell, and it never skips or freezes except once in a while with HBO GO, but i blame HBO's app for that.", "verified": true, "helpfulness": "0/0", "author": "aaron b"}, {"rating": 5.0, "review": "I've tried multiple ways to stream content from my DroboFS to my TV: Xbox Media Center, Verizon FIOS's media streamer, Fuppes (directly from the Drobo). None of them can stream as consistently or as easily AND without lag as the Chromecast using the Plex.tv app. I finally cancelled my Cable TV subscription. Sure it doesn't stream Amazon yet, but my Xbox does, so I'm good with that.I haven't taken it on the road yet, but I was just at a conference and someone told me how they use it in hotels all the time. Next time I have a week-long business trip, I'll try that myself.I've had a Sonos playbar for a few months and the audio sounds great from the Blu-Ray rips I'm streaming from the Drobo upstairs to the Chromecast. I added a pair of Play:1's as rear surrounds and now the audio's even better.The only \"con\" is that it can't connect to 5Ghz wi-fi. However, I've not had any issue with that yet, so no reason to ding it a star.", "verified": true, "helpfulness": "0/0", "author": "Adrian J. Moreno"}, {"rating": 5.0, "review": "So EASY to use!!! Even my kids know how to use it!  I LOVE streaming our favorite shows and movies!!! Totally worth the buy!", "verified": true, "helpfulness": "0/0", "author": "Maria P.Blevins"}, {"rating": 1.0, "review": "Excited about the product but dissapointed with it's quality.The chromecast keep rebooting.\\Follow the instruction to setup, connected to my network and then it will reboots everytime.Google searched about the problem, and tons of similar problem.Product is not mature yet.Wasted money. Still kept the product, just to support Google.", "verified": true, "helpfulness": "1/1", "author": "Chiang tan"}, {"rating": 2.0, "review": "The idea behind the technology is great. BUT if it actually worked all the time it would be nice. Always trouble connecting to Wi-Fi, trouble connecting to Netflix app. And I wish there were other apps this device was compatible with! Like Amazon!", "verified": true, "helpfulness": "0/0", "author": "Monica"}, {"rating": 5.0, "review": "I didn't know what to expect when I ordered this product. It was easy to install and works like a charm...I much prefer the Chromecast over my Roku product. I would recommend to all my friends.", "verified": true, "helpfulness": "0/0", "author": "D. Mcclendon"}, {"rating": 1.0, "review": "This product does not work with my Apple Airport Time Capsule WIFI connection.  The Capsule is in one room.  The Chromecast is in another.", "verified": true, "helpfulness": "0/0", "author": "Jim V"}, {"rating": 1.0, "review": "I have a great wifi setup wireless - n - great speeds and good locationchromecast way too slow on poorest video settings  to be unwatchable using my tablet or my laptop.", "verified": true, "helpfulness": "1/1", "author": "pc"}, {"rating": 5.0, "review": "So practical and easy to use device, It practically turns your standard tv on a smart tv, we love it for se music videos or movies.", "verified": true, "helpfulness": "0/0", "author": "carlos ochoa koppel"}]