[{"rating": 2.0, "review": "Its a great device, but expectations didnt match. I was led to believe that chromecast works with Chrome on Nexus 7 tab also. Apparently, all it works is - Chrome/YouTube on Laptops and YouTube only from Android.Got this item in a super nice package, thanks to Amazon and Google. Pity, I had to return it.To be fair, when I run YouTube from Tab or Chrome from Laptop, it works flawlessly.Will buy it if Chrome from tab is supported. Till then, adieu.", "verified": true, "helpfulness": "1/1", "author": "Kashyap Mhaisekar"}, {"rating": 5.0, "review": "Google has created a masterpiece in \"ChromeCast\".  It should have been dubbed \"platinumCast\", cause this little jewel is priceless at only 35.00.  It's already a major force in my house as if it was always a part of our entertainment arsenal.  Unbelievably user friendly, and the price, Google has definitely created a following, and still made a tidy profit.", "verified": true, "helpfulness": "1/1", "author": "Laurencio \"Srserpicol\""}, {"rating": 1.0, "review": "I could not use it with amazon streaming so I returned it and bought Apple TV . It works with netflix as welk", "verified": true, "helpfulness": "0/1", "author": "Marcelle Sloves"}, {"rating": 3.0, "review": "I didn't really understand exactly what the chromecast did and was a bit disappointed that all it did was mirror the apps from your smart device. I was hoping it had it's own menu/screen with the apps built in", "verified": true, "helpfulness": "0/0", "author": "Timothy A. Cala"}, {"rating": 1.0, "review": "This devise may not be comparable with your router.  I could never get it to work with my  netgear router.  Called google and they told me that many newer netgear routers are not comparable.  So check your specks before buying.", "verified": true, "helpfulness": "1/1", "author": "JP"}, {"rating": 3.0, "review": "It works, but the streaming of movie content from my computer to nearby TV is slow (despite fast network and fast Apple computer).", "verified": true, "helpfulness": "0/1", "author": "Michael Levin"}, {"rating": 4.0, "review": "not as good or as many apps as roku but a lot cheaper. works good video quality good.easy to install", "verified": true, "helpfulness": "0/0", "author": "greg"}, {"rating": 5.0, "review": "I am in love with the Chromecast. I hate having cords showing, and I hate connecting 3-4 things to my TV and having different controls for each. While I already had an Xbox connected to my TV and could watch all of the same things through that interface, I didn't like to turn on the Xbox and wait for it to boot up and navigate the menus all so I could watch Breaking Bad on netflix. The device is insanely simple to connect and works well with my Moto X.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 4.0, "review": "Very useful device, easy to set up. Makes getting data to the large screen a breeze. Recommend those who play videos on computer invest!", "verified": true, "helpfulness": "0/0", "author": "Trevor Phillip Wallace Witt"}, {"rating": 5.0, "review": "This thing, I knew I wanted a TV, this chromecast stick drive and some other things like router, modem, high speed internet, computer, streaming accounts, etc. Anyway, I digress, this thing is off the hook! Stream anything and everything onto my HDTV, including YouTube videos of bunnies!", "verified": true, "helpfulness": "0/0", "author": "Marisol Esquivel"}]