[{"rating": 5.0, "review": "For now,  this is the greatest product on earth.  So  many uses!  I take it with me when I travel and use it on hotel  TV's to  watch whatever I want.  Love it!  Great market disrupter.", "verified": true, "helpfulness": "0/0", "author": "W. Cogdill \"cogs\""}, {"rating": 5.0, "review": "Anyone who hasn't been living under a rock for the past few years probably owns a smartphone by now. And anyone who owns a home or rents, and owns a smartphone, probably has WIFI by now, too. The Chromecast plugs into an HDTV via HDMI and works in conjunction with your smartphone and a WIFI network.So, instead of spending hundreds of dollars more on an HDTV that has some built-in Smart TV capabilities like Netflix Streaming or DLNA support, just forego those and get yourself a cheaper DUMB TV and a Google CHROMECAST instead. And if you already have a dumb TV with an HDMI input, a smartphone and WIFI, then the Chromecast is the cheapest streaming device out there. Heck, you could turn a large PC monitor that has HDMI into a smart TV, if you were so inclined.It was a bit of a pain to setup, but after an hour and a few  router reconfigurations later, I had everything running smoothly.It works beautifully. No interface lag whatsoever. HBO GO and Netflix look outstanding. Highly Recommended!------If there is only one complaint that I have, it's this:GOOGLE, PLEASE ALLOW PEOPLE TO CONFIGURE THE NETWORK SETTINGS. I WOULD LIKE TO BE ABLE TO SET A STATIC IP ADDRESS FOR MY CHROMECAST.", "verified": true, "helpfulness": "0/0", "author": "drp103"}, {"rating": 1.0, "review": "The idea is great! It took over 4 hours to set up properly because of the wifi router I had. I went online and downloaded the directions on how to reconfigure my router. Ps once I did that within minutes my computer crashed because they insisted I download google chrome as my OS. Took computer to shop. Tried to get everything set up again and this time it worked. I watched one movie and tried for a second one and the screen said I had No recognized chromecasts! I WAS JUST USING IT???????? Hours of messing with it and it was finally back up. Next day I watched another movie. Tried for another.....no chromecast recognized! After hours of messing with this dumb thing (which was broken more than it worked) I finally got smart and returned it! I bought the apple tv and within seconds was watching movies. Have not had one issue with the apple tv! Do yourself a favor and buy something else! More headache than it's worth!", "verified": false, "helpfulness": "0/0", "author": "honest opinion"}, {"rating": 5.0, "review": "A great solution for getting tablet/phone photos to my HDTV.  Would like to see more available content available like Utube and Red Bull TV.", "verified": true, "helpfulness": "0/0", "author": "Paul F. Imirie"}, {"rating": 5.0, "review": "Very satisfied. Item arrived on time, easy to follow instructions, everything I needed was provided. I would definitely recommended it to a friend.", "verified": true, "helpfulness": "0/0", "author": "Kristina"}, {"rating": 2.0, "review": "The chromecast HDMI media player has not worked very well for us. It seems to try to take over as an uninvited Router booster and confuses the reception on our Roku player. It has such limited uses at the point, that I have disconnected it and put it away and just gone back to my Roku and long HDMI cable with my laptop. Sorry, I don't recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Herman W. Duncan \"Wayne D\""}, {"rating": 5.0, "review": "Love it.  I watch what I want when I want.  I save$$$$ by not having cable.  I recommend this product.", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "Great versatile streaming product.  It works with Android, Windows, Mac and iOS - perfect!  Major difference between Chromecast and Apple TV is that Apple TV has apps on it (such as Netflix) - but it's not worth spending the extra $65 in my opinion.  Especially if I can stream the same products from my cell phone or laptop.  If you install the Chromecast plugin on your phone, you can cast to anybody else's Chromecast if you are on their wireless network.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "For the others that might have a senior moment like me:  This is NOT anything like a Roku.  It does NOT stream Netflix, Hulu, or ANYTHING off the Internet, rather it just connects to your OTHER device and lets you broadcast it over your T.V..  In other words, you must have another device running the ChromeCast app on the same network that CAN run Hulu, Netflix, You tube, or whatever.There are plenty of reviews explaining this, but it takes too many lines to get to that part.  I'll admit that when this device FIRST came out I somehow got it in my mind it was a much more compact version of a Roku.  Thought I could plug it into a T.V., connect it to the Internet, and start streaming from my Netflix/Hulu/Amazon account, but NO - that ain't the case.  Still, I had a 6 month senior moment where I stayed convinced of that.  At Best Buy I accidentally talked to one of the teens and he even solidified my ignorance by saying \"YES, look here at the badges printed on the box.  YOU JUST PLUG IT IN AND GO JUST LIKE ROKU!\"Admitting I'm the idiot here, just wanted to warn any others.  If you want a stand-alone device to stream Netflix, Amazon, Hulu - this is NOT it.  Also, I did test it last night on TWO T.V.s, a windows laptop, and an iPad and noticed the video quality is NOT good compared to my Roku, and I'd get audio freezes on occasion.Alright...I'm ready for the Google fan boy abuse.  Bring it.", "verified": false, "helpfulness": "0/1", "author": "MEddy \"Book Stacker\""}, {"rating": 5.0, "review": "So far, I have only used \"You Tube\" and \"Google Play\" to broadcast to my TV, but the price is excellent and if you don't have a Roku device or Blu-Ray player for Netflix, Pandora, (etc.) video streaming; the Chromecast will work for the same function.", "verified": true, "helpfulness": "0/0", "author": "Cyberwiz \"Cyberwiz\""}]