[{"rating": 4.0, "review": "I bought mine directly from Google. What a great idea. I originally wanted it for Redbox's streaming service, now I use it for most of the popular streaming services as well as YouTube. Start a video on my Android phone or tablet, watch on the big screen.The only two downsides I've found are:1) things get weird if you turn off the tablet during the video, and2) not all programming is available. I've found a number of YouTube videos that will play on the tablet but won't transfer to the TV. Also, not all streaming services are compatible. I'm sure they'll be added given time.It would also be great to play a DVD or Blu Ray on my laptop and watch it on the TV via Chromecast, especially when traveling.", "verified": false, "helpfulness": "0/0", "author": "J. Shevell \"jdshevel\""}, {"rating": 1.0, "review": "This streamer would have been perfect except that it is NOT compatible with Windows Vista.  This is not stated clearly in the advertised area or description.  It is in the fine print, but that is not a practicle area to display such information.  Some of us out here are not very technically savvy, so it would have been REALLY nice to know that it wouldn't work with my computer before I went to the bother of buying it, and then having to return it.", "verified": true, "helpfulness": "0/1", "author": "auntbunnyrabbit"}, {"rating": 1.0, "review": "We bought this because apple tv is glitchy and doesn't work about 25% of the time. This appears to be worse -I set everything up... loaded google chrome on my computer, and it won't load. The trouble-shooting \"help\" doesn't really make any sense either.I give up... Will be returning.", "verified": false, "helpfulness": "0/1", "author": "Side sleeper Girl"}, {"rating": 2.0, "review": "the media I chose to view was an online movie, it played very choppy and inconsistent, in spite of being the only app on my modem.I am very disappointed", "verified": true, "helpfulness": "0/0", "author": "Elaine Mann"}, {"rating": 4.0, "review": "Well, actually I had a bit of a problem getting it to work. I wound up having to contact Google support and was pleasantly surprised when they had an answer - reboot my router. I'm able to watch youtube videos etc just as advertised. But I wish Google would let me stream videos from my PC without all the vendor lock it. For that reason I rated it 4 stars not 5.", "verified": true, "helpfulness": "0/1", "author": "J. Carlin"}, {"rating": 3.0, "review": "Just started using this. I uploaded the latest software on my phone and it only showed Netflix and Youtube. I downloaded the HBO GO app and that works nicely as well. Allegedly 17 apps work on this, but I haven't found the list on line. You need to download the apps on your phone and use the phone to get the programs/movies on screen. No remote.", "verified": true, "helpfulness": "0/0", "author": "Richard Tollner"}, {"rating": 4.0, "review": "Great price. Adds to your TV. I'm finding it doesn't broadcast EVERYTHING from the Chrome Browser like I thought it would. Recommend!", "verified": true, "helpfulness": "0/0", "author": "tarmar"}, {"rating": 1.0, "review": "could not use product MAYBE BECAUSE IT CAME MINUS A PART,  I WAS UNABLE TO TALK TO A HUMAN.  THE DIRECTIONS WERE CONFUSING AND  IGAVE UP.  YOU STILL GOT MY $35.00.  TOO BAD FOR ME I GUESS.", "verified": true, "helpfulness": "0/1", "author": "Dale A McManus"}, {"rating": 4.0, "review": "Bought this for a Christmas gift for my mom since she loves Netflix but is using Wii and doesn't like the quality of the video from it.  I tested it out on my 52\" HDTV and it works nicely.My only complaint is that you need a computer, smartphone or tablet to use the device.  That's not an issue for me but my mom doesn't have one in her tv room and I don't think she'll like having to go to the other room to turn it on.  We'll see :)Some reviews send you can NOT watch videos from the computer on this device.  I was able to, so I'm not sure what they were talking about.  I did notice a slight lag between the computer to the tv..  The sound was fine on the tv though.", "verified": true, "helpfulness": "0/0", "author": "Belasko7"}, {"rating": 2.0, "review": "Nowhere on the advertising does it say that not compatible with a Kindle fire. Money wasted, thank goodness it was not expensive", "verified": true, "helpfulness": "0/0", "author": "karen s park"}]