[{"rating": 5.0, "review": "Amazon' Fire TV is incredible.  I have been a Prime member for 1-2 yrs and mostly buy regular books and Kindle books.  I am not big on watching TV despite having a monster sized big screen.  Prior to buying Fire TV, I just watched favorite movies or TV shows via Prime on my iMac.I bought Fire TV and now seriously enjoy the Prime selections of shows and music.  The Fire TV interface is intuitive and easily matches what I have available via the iMac or even my new Fire Kindle 7.Between Fire TV and Kindle Fire... I have not had such a wonderful electronics expereince and delight since I started using an Apple IIe the first time decades ago:)", "verified": true, "helpfulness": "0/0", "author": "Dave Walker"}, {"rating": 3.0, "review": "The device itself is easy to hook up and use.  But I wanted to still be able to watch my local stations for news, etc.  I haven't figured out if that is possible to do w/o disconnecting it every time which will be really inconvenient.", "verified": true, "helpfulness": "0/0", "author": "Karen Wheeler"}, {"rating": 5.0, "review": "Worth every penny! Waiting for HBO Internet subscriptions in 2015 and then this box will be money (already is).", "verified": true, "helpfulness": "0/0", "author": "Magic"}, {"rating": 5.0, "review": "2 words_ love it", "verified": true, "helpfulness": "0/0", "author": "José Luis Gonzalez"}, {"rating": 5.0, "review": "Easy to install and use. The variety available is very good.", "verified": true, "helpfulness": "0/0", "author": "john Sexton"}, {"rating": 5.0, "review": "Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "mark best"}, {"rating": 5.0, "review": "I've been using Apple TV since it was first released. Amazon Fire TV is much faster.  I now have the best of both worlds. Amazon Prime and Netflix all on one unit. Awesome.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 4.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Jaisri Polina"}, {"rating": 4.0, "review": "Wish it had access to more free movies/TV shows since the item's price is pretty high. ..", "verified": true, "helpfulness": "0/0", "author": "GILBERTO ROQUE"}, {"rating": 4.0, "review": "Easy to set up and operate.Love the voice command.", "verified": true, "helpfulness": "0/0", "author": "Louis Weinkle"}]