[{"rating": 5.0, "review": "Love Amazon fire TV!!", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "Quick delivery and oh so useful!", "verified": true, "helpfulness": "0/0", "author": "Juliet E. Tamayo"}, {"rating": 4.0, "review": "I've always been a huge Roku fanboy, recommending one to everyone I know. However, Roku has decided not to update their hardware in quite some time and I was getting dissatisfied with the slow speed of some apps (especially Hulu Plus). I've owned 4 Roku units previously (2xRoku 1, 1xRoku 2, 1xRoku 3) and 1xApple TV, but decided it might be time to try a different competitor, so I bought an Amazon Fire TV. I don't care about gaming or music (only streaming video), so here are my opinions:THE GOOD- Lightening fast processor. Navigating is smooth and responsive. I feel like the remote is more intuitive than Roku’s as well.- The voice recognition is pretty cool and seems quite accurate in understanding my speech.- Unlike Apple TV and Google Chromecast/Player, it plays Amazon Instant Video purchases (which I assume would be extra benefit to those who are Prime members, which I am not since it is overpriced)- Discount currently available via sling.com (which I didn’t know about until after I purchased it from Amazon)THE BAD- It didn't work with Netflix out of the box (no audio on a majority of the videos). I was almost ready to write this unit up as a $100 loss until I found a setting in the menu. Apparently, Dolby Digital Plus is enabled by default, which also apparently my Vizio 3D TV is not compatible with. Turning it off solved the problem, but it took me forever to find as there is ZERO information about this issue online. Why is this enabled by default?! (Settings > Display & Sounds > Audio)- It doesn't play media from the Google Play store, which wouldn't be an issue if:- The user interface for purchased Amazon Instant videos is as terrible as it is on Roku (which means that it is likely not a hardware problem but a terrible software problem). Like Roku, all of my purchased movies and TV episodes are displayed in a long, scrollable line of titles that are not sortable/categorized in any sort of useful manner (simply ordering them alphabetically, and splitting them by TV vs. movie would be a HUGE improvement).- The voice search is rather stupid since it only works for Amazon-purchase media and not titles on Netflix and Hulu. For example, if you voice search for “Archer,” it takes you to the Amazon Instant title, which I haven’t purchased since it is available for free on Netflix! At least give me my options! (ie, “Archer - Netflix” or “Archer - Amazon Instant.” Bonus points for showing the season availability in the search results!- Unlike Roku, the entire interface is one huge Amazon marketing ploy (which is especially irritating since this thing isn’t cheap). Give me APPS and my purchased Amazon Instant CONTENT, NOTHING MORE.SUMMARYAs much as I like my Amazon Fire TV for its speed and concept-quality voice recognition, Roku still wins in my book. Roku plays both Amazon Instant and Google Play and has a better menu interface (especially nice for those who get frustrated easily with technology, like your parents).If Amazon would improve the *terrible* navigation system of its Amazon “Video Library” app and also support Google Play media, I would say that this would be the near-perfect device and recommend it above all others. Until then, unfortunately, I must say that Roku is still your best bet. This is within their power to fix, but they will not of course, because they know that most people who buy the product probably do not know the difference. Ignorance == $$$.NOTESIn the decision to choose a streaming media device, it is more important to choose which *provider* (ie, Amazon, Google, Apple) that you want to be locked into for life when it comes to your purchased media. If you like Amazon Instant, get a Roku or Amazon Fire. If you like Google Play, get a Roku or Google Chromecast/Player. If you like iTunes... you should switch media providers. As much as I am a huge Apple fanboy, Apple TV will never be purchased by me again because it doesn’t support Amazon Instant (which all of my purchased media is on) or Plex, making it useless to me.", "verified": true, "helpfulness": "1/1", "author": "Daniel M. Hendricks"}, {"rating": 3.0, "review": "Commercials are painfully loud, about twice the volume of streaming video.", "verified": true, "helpfulness": "0/1", "author": "William A. Gerrells"}, {"rating": 5.0, "review": "My daughter loves this on her tv! The cable bill was a little excessive so we decided to downgrade a few things and her tv was one. She had no problem learning the set up and how everything works. We already had Netflix, so adding the additional apps were no problem and less expensive then cable. I had no idea about some of the features and she taught me very quickly, she's only 7. So yes I would definitely recommend the Amazon Fire TV.  It was recommended to me and it was a very good recommendation.", "verified": true, "helpfulness": "0/0", "author": "TSRE"}, {"rating": 4.0, "review": "I'm so divided. On one hand I really want to give the FireTV 5 stars. I really do love it after using it for almost a year now. On the other hand, it just needs a few more key features before I'll grant it 5 stars.Specifically, I've been spoiled by using a Roku 3 when visiting family. The Roku 3 is also awesome and introduced a couple features I really really miss when using my FireTV at home. Basically, the FireTV and Roku 3 each have a few things the other doesn't. I almost 5-star-love both the FireTV and Roku 3. But, since there's no clear winner and since each one \"spoils\" me with features the other doesn't have, it's a stalemate. So, four stars for both.I'll start with the features the Roku 3 has that I wish the FireTV had as well. In no particular order:1. Search includes content from all apps/channels.2. VUDU app.3. Audio jack in the remote.Next, I'll cover the FireTV's strengths compared to the Roku 3 which are:1. Voice search (built into the remote).2. Better overall hardware specs and super-snappy UI performance.3. Pre-downloading content the FireTV predicts you'll watch.4. Built-in access to Amazon Prime music and your Amazon Music library.When you search on the Roku 3, it is able to include results from all (at least all the major) apps like Hulu, Netflix and Amazon Prime. This feature is so so cool and if you go with the FireTV you'll miss it. Note that the FireTV includes results from its built-in search from Amazon Prime and Hulu only. If you want to search for stuff on Netflix on the FireTV, you have to launch the app and manually key in your search. It feels like such a pain to do now that you're spoiled using the super-easy built-in voice search.Next, the FireTV has no VUDU app. I have no statistics on how popular the VUDU app/service is, but it seems quite ubiquitous for video rentals. VUDU is WalMart's video streaming/rental service. I don't use it as often as Netflix, Hulu or Amazon Prime, but sometimes VUDU has content available the other services don't. Since it doesn't require a membership like the other three (you only pay when you rent) it's nice to have around. Since my FireTV doesn't have it, I have to load my Samsung Blu-ray player's VUDU app. A total first world problem, I know, but I really hate loading that slow, horrible, clunky interface. I realize that Amazon and WalMart are more directly in competition (the whole retail side of things and all) than Amazon is with, say, Netflix. Regardless, they need to make a FireTV VUDU app happen. This feature alone will likely be the one to make me jump ship to the Roku 3 (especially since you can now do voice search on the Roku 3 via your smartphone app; it's clunkier than FireTV's voice search but Roku is closing that gap...).The last major Roku 3 advantage? It has a regular 3.5mm headphone audio jack built into the remote. When you plug your headphones in, the audio goes only to your headphones. This is great when someone in a crowded space wants to watch something without creating sound pollution or for late night movie watching with the sound cranked up. I know there are 3rd-party options for doing headphone audio with your TV, but this is just so convenient! The FireTV really needs this or some version of it (an Android or iPhone remote app letting you hijack the audio?).Okay, so what does the FireTV have on the Roku 3 and other streaming media players to boot?First off, the FireTV's voice search is probably the coolest differentiating feature it has. There a mic built into the remote and a single voice search button. You press and hold, saying the name of any movie, TV show, actor, director, etc. It then searches across Amazon's content and now Hulu's as well. In the age of smart phones, I'm almost surprised at how cool I still think this feature is. It's so fast, snappy and accurate!The FireTV also has a more powerful CPU and more memory under the hood than it's competitors. Both devices have very snappy user interfaces, and this matters. It was the slow, high-latency clunky interface of my Samsung Blu-ray player that made me even want to get a dedicated video streaming device in the first place. A faster CPU and more memory should ensure the FireTV leads in this area. However, I must admit that when it comes to just the UI, both the FireTV and Roku 3 seem equally snappy.So, if the FireTV and Roku 3 both have a snappy UI, why care about the FireTV's extra horsepower? More memory on your device means the video streaming apps have more buffer space to store downloaded chunks of the video you're watching. Having more chunks downloaded ahead of time means you're Internet connection can experience more problems before it'll interfere with your (very important) TV watching. Better to have more CPU and memory available so you'll generally have a smoother experience. Plus, the extra memory helps with the next cool FireTV feature: pre-downloading stuff the FireTV figures you're going to watch later.It's actually really nice when binge watching your way through a show to click \"play\" on the next episode and have it start playing instantly. Add in the ability to then quickly skip past any preview and credits and pre-downloading starts to look really slick. Anytime you have to rewind or fast-forward beyond what your device already has downloaded, it takes a while to then load and start playing your show again, especially with slower internet. However, with lots of memory and FireTV's propensity to pre-download stuff like the whole next episode of any shows you're watching, you get spoiled quickly with such snappy TV watching. I'm not sure if other video apps like Netflix and Hulu can hook into this functionality on the FireTV, but if they can't I hope Amazon will make it possible for future versions of those apps to do so.Last on my list: the FireTV gives you immediate access to stream your Amazon Prime music. This might not matter if you're a purely iTunes person, but I have some music (thanks to Amazon's AutoRip) that I've purchased that I was able to start listening to minutes after I plugged my FireTV in. Also, if you have an Amazon Prime account you can stream any of the freely available prime music too. This is nice. It'd be nicer if you could also view and listen to iTunes libraries shared on the local network too, but I'm not holding out for that.Finally, I do have to put in a plug for the customer support provided to FireTV customers. I've had to use it twice to resolve some issues. I was very impressed both times. In the FireTV there was an option to request a phone call. Seconds later my phone rang and I was talking to a human. I hate phone menus and being on hold to talk to a person. I didn't have to do either. I was so impressed and happy with the customer support that any annoyance I had at having to call support in the first place quickly evaporated.So there you have it. I love the FireTV but they need to make it have a super-set of the Roku 3's current features before I'll grant the coveted 5-star rating.", "verified": true, "helpfulness": "1/1", "author": "Kendall Gifford"}, {"rating": 5.0, "review": "Its great !! I can see sot of old episodes of TV shows that I have missed", "verified": true, "helpfulness": "0/0", "author": "Sharon9o"}, {"rating": 4.0, "review": "Just a little sad that voice commands only work with Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jerilyn Preece"}, {"rating": 4.0, "review": "I own a few different streaming media devices (Amazon Fire TV Stick, Amazon Fire TV, and Roku 3). I use all 3 on different TVs, but I have to say that I prefer the Roku 3 over the Amazon Fire TV.The Amazon Fire TV performs much slower (with a hard wired connection) than the Roku 3 player. The apps load slower and I find that it buffers more often. My Internet speeds are great 15Mbps, so I know it is not that.I also am not a huge fan of the UI. When on the home screen, everything is Prime Instant Video. I understand that it is Amazon's video service, but I still don't like it.It does have all of the apps that you would ever want and the remote has voice search which is a nice feature. However, it doesn't integrate with the apps which is important to know. For instance, if you search for a movie that you know is available on HBO GO, you will not be able to access it via the voice search. It gives you the option to rent or buy in HD or SD, so it is basically useless unless what you are searching for is available on Prime Instant Video.The iOS app for the Fire TV is nice and works well, so no complaints there. You can also use the voice search feature through the app.Overall, if I had to choose one, I would go with the Roku 3. Sorry Fire TV!", "verified": true, "helpfulness": "0/0", "author": "KaitlynB"}, {"rating": 5.0, "review": "Excellent device and easy to use.  Thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Gary Kornbluh"}]