[{"rating": 5.0, "review": "excellent works seamless no issues", "verified": true, "helpfulness": "0/0", "author": "joseph bobb"}, {"rating": 5.0, "review": "Everything OK", "verified": true, "helpfulness": "0/0", "author": "Sebastian Levis"}, {"rating": 5.0, "review": "Very nice device for the price. It is something easy to entertain those who are not so computer savvy.", "verified": true, "helpfulness": "0/0", "author": "inkblot"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "Karly Michalowski"}, {"rating": 5.0, "review": "Love watching netflix and steaming other things through my tv with the chromecast, one thing that you need is an extra usb port, or outlet nearby to power the chromecast though.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Otterby"}, {"rating": 4.0, "review": "Very convenient, but for some reason it keeps losing the connection with remote. I have to remove battery and put back in for it to work. Would give 5 stars if it wasn't for that.", "verified": false, "helpfulness": "0/0", "author": "Stormy"}, {"rating": 4.0, "review": "Love the functionality, but it's a little buggy at times.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 2.0, "review": "Having used this for a year and a half I can't recomend it.  When it works it works great (for Netflix and Youtube, not really anything else) however, it stops working very frequently.  It seems to be software/firmware problems.  I can't even count how many times I 've paused my life and had to play reboot everything games trying to get the chromecast to work. The chromecast is on our network, showing it's rotating screensaver pictures so I know it's working, my laptop/phone is on the network, but the two just don't see each other.  Or the times where I've started playing something then need to pause or want to change programs and they've completely lost sync.  I assumed this was a temporary isssue, but, a year and a half later it's still awful.", "verified": true, "helpfulness": "0/0", "author": "T. Robertson"}, {"rating": 4.0, "review": "I order the chrome cast because one of my family members had one. It was very convenient to use and easy to install. However, the sounds wasn't working on there last night so I need to find out why.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love...love...love this product.  So easy to hook up and set up.  Delivered on time.  I downloaded TV Cast app on iPhone 6 you can watch any thing on the web.  App was free I upgraded to use all extra features well worth the $7.", "verified": true, "helpfulness": "0/0", "author": "Marcella Harris"}]