[{"rating": 5.0, "review": "Best device ever from Google.", "verified": true, "helpfulness": "0/0", "author": "J. Argueta"}, {"rating": 5.0, "review": "Set it up within a minute. Samsung Note 2 immediately recognize the device, then set it up automatically. Video quality totally depends on the video source. Google should have also post a photo of the power source. Not all HDMI ports are close to a USB ports. Otherwise you will need to plug in an AC/DC adapter to power the device.", "verified": true, "helpfulness": "1/2", "author": "UCLA_Bruins"}, {"rating": 3.0, "review": "It's not really a Google TV﻿ replacement. It buffers kind of slow, wish it had a LAN dongle, not just wifi. It also needs the Amazon Instant Video﻿ app. It's good for the bedroom TV. We'll keep the Vizio﻿ Co-Star hooked up to the living room TV.Still waiting on my NetFlix code. It was purchased before the cut off time on July 24 2013 @ 2:00pm.Update:07/AUG/2013 - I have used it twice since it arrived on 26/JULY/2013, I set it up in the bedroom.Vizio Co-Star in the living room is use primarily.", "verified": true, "helpfulness": "3/11", "author": "+Fred Evans"}, {"rating": 5.0, "review": "It can broadcast anything Chrome supports. So .mkv .mp4 and plenty more. The setup was very fast. I'm a little bummed out since IOS support is coming soon but if it works at least half as good as it does on my Nexus 7 I will be satisfied. I see too many people worked up and over reacting because of the end of the Netflix offer, you had plenty of time to take advantage.", "verified": false, "helpfulness": "1/4", "author": "Bobby"}, {"rating": 1.0, "review": "The Netflix promotion was deceptive advertising by Google and its merchants. I purchased the Chromecast yesterday thinking I would get $24 in savings from my Netflix subscription. Amazon/Google/Netflix need to manage their promotion better; this is inexcusable quality control by companies that are supposed to be at the top of their game.", "verified": false, "helpfulness": "39/194", "author": "LeBron Fanatic"}, {"rating": 5.0, "review": "So much power in such a small package. There are hundreds of great reviews of its other features, so I will focus on just one, using the Chromecast for presentations. While you cannot currently broadcast from PowerPoint or Keynote (although these features could be developed in the future), the Chromecast can easily be used to display your Google Drive Presentation, or a Prezi, or any other web based presentation. iPad users love to hook up their AppleTV to a projector and walk around with an iPad, and this should enable Android users to do the same thing. If you use PowerPoint, simply upload your presentation to Google Drive to broadcast. You could also use SlideShare or any other web based presentation service.1) You need a wifi network connected to the Internet.The Chromecast pulls most content directly from the Internet, so you will need to be able to connect the Chromecast to the Internet. You will also need for your laptop to be on the same network as the Chromecast.2) Point your Chrome browser to your presentation.Open your Chrome browser to the presentation, and anything you can see in the browser tab will be broadcast.3) Click the Google Cast extension to broadcast that tab.You can even put your laptop in full screen mode and the display at the Chromecast still shows the full slide.Questions-----------** Can I use a presentation remote?Sure. Most presentation remotes work fine with Google Drive. I use a Logitech Professional Presenter R800 with Green Laser Pointer.** Can I view speaker notes or do other things with my laptop during the presentation without disrupting the display?Yes. Only the tab with the presentation will be broadcast, so anything else you do will not disrupt the presentation. Just don't close Chrome.** Does the presentation need to be public, or can I present a private \"unpublished\" presentation?I don't know the answer, but I will try it today and get back to you.** Can I drive a presentation with my tablet?I have not figured out how yet, but surely this will be a feature soon.** Can I mark up the slides, highlight or zoom in?If the web based service allows you to draw or highlight on the slides, then yes! You can zoom in using Chrome's zoom feature.", "verified": true, "helpfulness": "7/11", "author": "Bryan M. Griffith \"A business litigation attorney.\""}, {"rating": 4.0, "review": "I currently own Apple TV, Visio Google TV, Samsung Dongle, and now also Chromecast. Chromecast was by far the easiest to setup, and the overall achitechture (using phone/tablet as remote, and dongle streams on its own) is finally the right step. I am really happy with the way it works... with one BIG exception:There is currently no way (at least none that I found after research of the somewhat limited support info that is available to soon after launch) to display the pictures I took on my phone via TV. My hope/expectation was, that I could stream my photos from Google+ account. I take a lot of pics of the family... Samsung S4... and happy upload them all to Google+ from the nearest wifi or when at home. With FIOS its done in the blink of an eye. While Chromecast appars to allow \"sharing of a Chrome broswer tab\", that apprars to only work from laoptops. URG! Big bummer. Of course i do not want to start any laptop when I am home, just to show my kids the photos i took of them on my phone.Certainly I hope that the next Chrome app update for phones/tablets will allow the sharing via Chromecast as well.Overall a very good buy, and you can certainly enjoy YouTube and Google Play movies more conveniently that with other devices.... I think.", "verified": true, "helpfulness": "3/4", "author": "Alex"}, {"rating": 1.0, "review": "I ordered my Chromecast yesterday (July 25) from Amazon.  At the time, there was no indication on Amazon's product page that the Netflix offer was unavailable.  Today, I read that the Netflix offer is unavailable for those who purchased their Chromecast AFTER 5:31 PM PST on July 24.  This isn't Amazon's fault - Google decided (annoyingly) to suddenly snatch away the offer because they ran out of promo codes.So, I just cancelled my order.  I'm not waiting with bated breath for this thing to be back in stock, either.EDIT: My husband went to Best Buy because they called to tell him they had a few in stock.  He went in, purchased the Chromecast, AND got the Netflix promotion.  This was around 6 PM CST today (July 26).", "verified": false, "helpfulness": "20/122", "author": "K-Rock"}, {"rating": 5.0, "review": "I should say I really impressed. it shows my browser, youtube, netflix, etc. on my TV really easy. The setup was just 30 second. It easily replaced my big expensive apple TV (yea, compare to this, apple TV is big expensive). I thought it is only act like a remote that control youtube or netflix as a streaming box, but it also act like airplay for chrome and I can see my browser content on TV. Don't miss it.", "verified": true, "helpfulness": "5/10", "author": "Mike West"}, {"rating": 5.0, "review": "So, I was able to go to BestBuy yesterday around 6PM EST and pick up a new Chromecast. They had not even been put on the shleves yet but were still sitting on a box on the floor. I arrived home at around 630PM EST and plugged the device right into my TV. Some newer TV's will be able to power the Chromecast through HDMI but mine was unable. So I had to plug in the USB and power it off of my powerstrip.In the box it tells you to go to a website to download the chromecast app. At my house I have a Photon 4G, S2, Desktop and Nook HD. I was able to install the app on all 4 devices within a few minutes. You do have to setup the chromecast on your network with password but that took a few seconds. Once the install was complete all 4 devices updated to recognize the Chromecast. I jumped right onto Netflix and played some \"Jake and the neverland pirates\" for my 2 year old son. The video took around 5 seconds to load and was playing back at 1080P quality with no lag or refreshing. I then turned to my phone to see that, the show had automatically been recognized by my phone and I could control it. To test out if you needed any device on one a movie was playing I turned off all 4 devices and the video continued to play. I turned my phone back on and chromecast loaded and was able to recognize a show was still playing and let me go right back into control. We then tried Youtube and it worked perfectly as well. There was no lag at my house whatsoever.I'm working off of a 30MBs down speed from brighthouse. Now at first glance this is great for my family as we don't watch TV much and when we do its movies and or kids shows. I was able to use the chrome browser and stream that also it was maybe .5 seconds behind but was still very useful.", "verified": false, "helpfulness": "3/4", "author": "Grumpalot23"}]