[{"rating": 1.0, "review": "sucks. everything costs money to watch. worse than hulu, netflix and your local cable on demand selections!", "verified": true, "helpfulness": "3/11", "author": "david boyd"}, {"rating": 3.0, "review": "It's good but I like more Roku", "verified": true, "helpfulness": "0/2", "author": "rene ortuño"}, {"rating": 5.0, "review": "this opened my eyes to what Amazon is starting to accomplish. I don't know about the competition, but this little box changed the way we use our TV. really like the interface. easy to use. lots of programming. combined with amazon prime it's a powerhouse of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Charles Oberbeck"}, {"rating": 3.0, "review": "This replaced a first gen Roku I bought years ago. I also have a Google Chrome on another tv. The fire TV is quick to load and the video looks great. I gave it 3 stars simply because of some things I read about Amazon and the NSA, Google it before you buy this to be sure you are alright with it. I knew nothing about it until after I purchased it. I have no idea how much of it is true, but given the recent track record Im guessing its fairly accurate.Its a shame because the unit works pretty much flawlessly.UPDATE: After using this for over a week let me revise some of my comments. The unit is going back to Amazon for the following reasons.1. Cant voice search Netflix, Hulu or anything other than Amazon Movies period.2. You cant just search through amazon prime only movies, they are lumped in with pay to watch titles.3. Gaming is the same way and isnt so impressive.4. The more research Ive done about Amazon working with NSA its just not that great of a device to take the chance its true that the device helps them listen in on you. Wow that sounds super crazy reading it back, what has this world come to!!", "verified": true, "helpfulness": "0/2", "author": "Brisketgod"}, {"rating": 3.0, "review": "A couple months into the life of the Amazon Fire TV and my impressions of it boil down to this: it's okay.The two features that differentiate it from other streaming boxes are the voice search and Amazon Prime integration, which is a shame since the voice search is nearly useless (since it's service limited) and the Amazon Prime integration is incomplete (the new Amazon Music service through Prime launched on every device *except* the Fire TV).I had really hoped that the rate of development for the Fire TV would be strong, backed as it is by Amazon, but new and updated apps are slow to come.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this device primarily so that I could watch Amazon Prime content on my TV.  My initial hope was that I could cancel my netflix streaming (and maybe even my basic cable)and replace it with the content from Amazon prime.  I've been feeling like I've watched everything good on netflix lately.  Since I already have a Prime account, this would mean I could eliminate a monthly charge.  I've had this up and running for a couple of days with both my netflix and prime accounts going and so far I am please.  I will probably eventually get rid of my netflix account, but it would be harder to cancel my cable subscription.  I kind of suspected this.All in all, this is a slick, simple little device.  The first thing I noticed was its small size…about the size of two CD cases.  Setup requires 2 wires and an internet connection.  It was quick and painless with my average technological skills.  I was watching streaming video in about 20 minutes, and most of that time was running the wires in my cabinet.Other than the Amazon Prime content, I've only been using this for netflix and pandora, so I cannot comment on the full array of features.  I will say that I have started using the fire tv instead of my blu ray player to operate these apps because they run faster on fire TV.The remote takes a little getting used to, but I am starting to get the hang of it and learning to appreciate it.  It's more that its a completely different type of device than it is hard to use.At the end of the day, I am quit happy with this product for the amazon prime content I am able to enjoy.  That alone makes it worth the money.  It does run other apps well, but I haven't fully utilized its potential.One thing people should realize is that you'd probably need another $50 in monthly subscription to utilize all of the services this device can operate, but that is just part of the game with these devices.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Awesome awesome awesome.", "verified": true, "helpfulness": "1/3", "author": "Peggy"}, {"rating": 5.0, "review": "OMG do I love this device. One my favorite features of course is the mic that I can find what I'm looking for without having to enter the search letter by letter. I was also impressed by having some of my music already loaded off me. I'm somewhat technologically challenged but I find this device so easy to use.", "verified": true, "helpfulness": "0/0", "author": "DELILAH \"AVID READER\""}, {"rating": 2.0, "review": "Sure, the hardware specs are great. But where this box falls flat on it's face is the software. There is no segregation between free content and pay-for content. If you plan on buying this machine, you better plan on making lots of transactions for content. A single HD episode of most TV shows is $4, which I find ludicrous. You have to keep pouring money into this thing otherwise it stops being entertaining. I found the streaming video quality to be mediocre, but the audio quality was overly compressed and really atrocious. I was trying to watch the HBO series The Pacific, and the garbled audio completely crushed the production value. The dynamic range was flat. In my experience, it seems like EVERYTHING on their network costs money. After dropping $140 for the system and controller, I felt like I was entitled to SOMETHING for free at least.. a sampling maybe. The introductory video said it would help me set up an Amazon Prime trial afterwards, but it never went to that screen. This box is a gimmick.What really got me is that there is no OFF button on the Amazon TV. No sleep button either. It just stays on all the time, sucking power and hogging bandwidth \"predicting\" what shows you will watch and downloading them pre-emptively. I noticed my computer's download speed was down to a crawl. There's no way to determine how much the Amazon TV is downloading at a given moment. So, if you want to turn it off, you have to pull the AC cord out of the back which is not convenient and means you have to keep the ugly little black box in an accessible spot where someone might see it.Overall, I'm not saying this is a bad box. But after tinkering with it for a short while,  I realized it doesn't do anything my computer or video game console doesn't do better and cheaper. The content that's available is far too expensive. This box basically gives you access to a very limited selection pay-per-view network and some 'apps' that you could probably just load on your computer, Smart TV or Blu-ray player anyway. There's not enough content that you'll want to cut your cable cord. The name Amazon TV is kind of a misnomer. You have to muddle through menus and click things.. and go back constantly because you run into pay-per-view roadblocks. Versus real *TV*, where all you have to do is press the power button and there's a show playing, and you press channel up and down- Fire TV is nowhere near this simple. They should just call it Amazon tiny-credit-card-operated-computer. We are certainly in a transitionary period where computers are fighting for the HDMI ports on my TV. But the Amazon Fire TV is just another nebulous box that's not particularly impressive. This box doesn't matter. Save your money and wait for the digital dust to settle.", "verified": true, "helpfulness": "1/4", "author": "Shawn \"Shawn\""}, {"rating": 5.0, "review": "How utterly Fantastic & Fun!", "verified": true, "helpfulness": "0/1", "author": "The Troll"}]