[{"rating": 4.0, "review": "I wanted a device that I could use to stream my home videos, photos from my NAS wirelessly. This inexpensive device fits the bill perfectly and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "Only down side is limited ecosystem right now and no Amazon Prime app. NetGear has a similar product coming that has SD storage slot. But for $35 it is a homerun.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "We've encountered zero problems with this product, and would recommend it to others. If there is a downside, it's that there need to be more sites that support this. Once that starts happening, the sky is the limit with this sort of content controller. We gave up cable tv about 10 years ago, and this is a great way to use Youtube and Netflix to control the content our child watches.", "verified": true, "helpfulness": "0/0", "author": "Emma Lee"}, {"rating": 5.0, "review": "Bought two for my and my daughters TV and thus far like them very much.  Could use more content availability but I know it will get there.", "verified": true, "helpfulness": "0/0", "author": "Greg Forquer"}, {"rating": 3.0, "review": "Google Chromecast does not play anyother apps , only youtube , cannot evenplay videos thru Google Chrome browserit is called mediaplayer but cannot play audio or show photos or pictures ...", "verified": true, "helpfulness": "0/1", "author": "said iravanipour"}, {"rating": 4.0, "review": "Set up was simple, works as expected for the apps it supports.Minor gripes would be to enable even some minor controls (play/pause/volume) over the TV remote using HDMI-CEC", "verified": true, "helpfulness": "0/0", "author": "RedOranges"}, {"rating": 4.0, "review": "At times it is slow when we play directly from Chrome - a definite lag is noticed. Other than that, plays great from apps such has netflix.  @ 39 bucks, it is a steal.  I am planning to buy a few more for my use. Not sure if this will work in a hotel room, if I carry one with me. Will need to try this. I'll update once I try it out.Beware Google, there are products coming up that can play just about anything from your laptop on to your display device (not just TV, but also projectors etc.), not just select apps, so hurry up and make this universally \"playable\"...!!!", "verified": true, "helpfulness": "0/0", "author": "Gopal Ramasamy"}, {"rating": 4.0, "review": "The reason I gave it four stars is for two reasons the software does not function on all platforms. I.e being able to stream browsing on android devices also being able to use the chromecast to stream with a Microsoft Rt device (surface tablet) other than those two setback that it has caused me with the o.s that I have it still is a great product for the price. It was easy to set up and once one device has installed the software connected to the WiFi and chromecast all devices connected to that WiFi have access to the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Robert Valenti"}, {"rating": 2.0, "review": "This is a very limited device, which works well with Netflix, Youtube and other less significant providers (Google Play, HBOGo [works on very limited range of android devices], Pandora) and does NOT work with Crackle or Amazon Prime.It boasts the ability to \"tab cast\" which is an option for displaying presentations, but is not useful for video due to audio sync issues and limited resolution (below VHS quality).  In most cases, tab casting is unable to reproduce audio on streaming video.Chromecast relies on third party solutions (AllCast, for example) for displaying locally stored photo/video/audio.At this time, it is a good buy for heavyduty Netflix viewers.", "verified": false, "helpfulness": "0/1", "author": "tony gil"}, {"rating": 5.0, "review": "Items works great and is a easy setup, so good that I went and bought another one for my bedroom!!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]