[{"rating": 5.0, "review": "Really happy with the ability to stream video from my computer to my TV effortlessly, this feature alone makes the product worth having.", "verified": false, "helpfulness": "0/0", "author": "Catherin O."}, {"rating": 4.0, "review": "Keep checking for offers on ur chrome cast page! Got a free movie rental and $6 google play credit.", "verified": true, "helpfulness": "0/0", "author": "Malboria \"Malboria\""}, {"rating": 5.0, "review": "I have used it for a few months and it works perfect. You have to check the updates.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing going. Loving it!", "verified": true, "helpfulness": "0/0", "author": "larry fowler"}, {"rating": 5.0, "review": "Exceptional product.  Delivers all its promises.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "I have been using this for a few weeks now and experience too many breaks in the casting. Sometimes the video won't even load.", "verified": true, "helpfulness": "0/0", "author": "GovindaR"}, {"rating": 1.0, "review": "Incompatible with my Verizon router. Suggestion was to try a couple things and if that did not work, contact Verizon.  They did not work and Verizon was no help at all.  They suggested going back to Goggle.  Wonderful Catch 22!! - and a total waste of money and about six hours of my time.", "verified": true, "helpfulness": "0/1", "author": "Warner Bonderman"}, {"rating": 3.0, "review": "I liked this at first but after awhile it gets to be a pain to always have a device on hand to stream from.  Also, I purchased two and found that I couldn't stream to my living room for my kids and stream a movie to my room at the same time.  I searched online and sadly there is no solution for this problem, only to have a 2nd device to stream to 2nd Chromecast.  I opted for the fire stick for my next purchase, only $10 more and it does so much more including operate completely independent from other devices.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 1.0, "review": "What a piece of junk.  It can't cast anything just makes screen white.", "verified": false, "helpfulness": "1/1", "author": "Brooke Zanaya"}, {"rating": 2.0, "review": "Wasn't thrilled with the way it worked.", "verified": true, "helpfulness": "0/0", "author": "Thomas S."}]