[{"rating": 2.0, "review": "Half the games don't work without the game controller, which is sold separately and takes months to get.  It is difficult to leave my son to watch videos (through amazon as all video playback requires parental controls pin, every time that he wants to change the video (this means I have to make him leave the room in order to enter it).. It would be nicer if you could set up a list of acceptable videos so that they can choose... Some apps listed as \"rated for everyone\" like the shark game has some inappropriate content like eating humans.  The vocal search does not work with Netflix. If you use it, it takes you to Amazon.  Games bought for the Kindle Fire HDX may not work on the Amazon Fire TV and so the educational apps that we have for his kindle can not be set up to play through the Fire TV, which is frustrating..", "verified": true, "helpfulness": "1/3", "author": "Drevik \"aka Drevik\""}, {"rating": 4.0, "review": "Works great, short time on buffering.  Should have more layers on purchases to avoid accidental purchases.", "verified": true, "helpfulness": "1/1", "author": "M. Carlson"}, {"rating": 1.0, "review": "Have used it twice and now it is not powering up, have tried it in other outlets still nothing.", "verified": true, "helpfulness": "2/3", "author": "jeff"}, {"rating": 2.0, "review": "Fire TV is VERY limited or more like it does not meet my needs.  I'd like to be able to have access to more of the android and iOS apps such as ABC TV or at least Infinity to go.  It was a gift, not impressed it's just as limited as the Fire Stick.", "verified": true, "helpfulness": "1/2", "author": "QuietStorm"}, {"rating": 5.0, "review": "Best media player on the market !!!!", "verified": true, "helpfulness": "1/1", "author": "Luis Venegas"}, {"rating": 5.0, "review": "So far so good! Switched over from using Xbox to access my Amazon & Netflix accounts & like the remote features and ease.", "verified": true, "helpfulness": "1/1", "author": "Ann \"In Vino\""}, {"rating": 4.0, "review": "I'm enjoying the movies, t.v., and the Prime shows.  The biggest problem I've incurred is finding the ability to turn the system off.", "verified": true, "helpfulness": "1/1", "author": "Ronald Coleman"}, {"rating": 5.0, "review": "Simple setup, ease of use, excellent value, and a great way to centralize home entertainment.", "verified": true, "helpfulness": "1/1", "author": "Eugene C"}, {"rating": 5.0, "review": "Easy to set up and easy to use.  Was able to turn my TV into a smart TV.  I like the voice command feature.  Just tell it what I want to watch and it just pops up.  Love it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best gift! Loving the videos!", "verified": false, "helpfulness": "0/0", "author": "meloneyearly"}]