[{"rating": 5.0, "review": "This little device is a fantastic compromise for those with older model tvs that do not have Smart TV capability.How it works is you plug Chromecast into a HDMI connection (you must have one HDMI slot free on your TV), and then it sources your wifi signal and gets your older model TV online. It requires you to use a tablet to use it properly .. so basically you turn on your TV, flip to Chromecast through your TV's source list, then open up the Chromecast app on your tablet and what you see on your tablet, you see on your TV now. That includes apps like NetFlix, Youtube, etc.The easiest way to understand how to use Chromecast is to consider your tablet like your television's remote control. You use the tablet to set what you want to see on the big screen of your TV.At the moment, in Canada, apps are limited. But the product is being heavily invested by Google, so expect more and more apps and choices to pop up as the system matures. With some fancy footwork, you can also set up your DNS to get U.S.-side apps, but you'll have to (pun intended) google to get more info on that.For those tired of paying high cable fee rates, this is a wonderful alternative to modernize any TV in your house into an Internet capable smart TV.", "verified": false, "helpfulness": "0/0", "author": "Ny-er"}, {"rating": 2.0, "review": "I purchased this almost exclusively to watch Netflix and that's not possible with this device currently. I tried several times to get it to cast from my iPhone 5S, an iPhone 5C and my laptop it would not work. I called customer support several times and was given the run around. I would love to try the Chromecast again but returned it since it would not work for the one thing I wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "hippycowgirl"}, {"rating": 5.0, "review": "It's everything you want it to be!", "verified": true, "helpfulness": "0/0", "author": "Scott Kelley"}, {"rating": 2.0, "review": "I cant cast any movie or show from iTunes. This is really disappointing specially when we know that iTunes have the biggest collection.", "verified": true, "helpfulness": "0/0", "author": "NASSER AL SHEKAILI"}, {"rating": 3.0, "review": "It was very easy to setup according to the instructions. I can only display the screen of youtube on my tv but not many other applications. Unlike apple tv. Very cost effective comparing to other products.", "verified": true, "helpfulness": "0/0", "author": "Magdy F. Mahmoud \"Mego\""}, {"rating": 2.0, "review": "It's useless", "verified": false, "helpfulness": "0/1", "author": "Hu Yuelang"}, {"rating": 5.0, "review": "Though there is a limited number of apps that can be used, I love streaming Netflix on the big screen like a smart tv but for a ton less than the cost of a new tv.  I would have honestly paid more & still be happy.  Also, I can't explain how easy this was to set up. Your tv even provides the power thru USB ports so there's less than a foot of wire needed for most.  Mine only needed inches & I did the entire setup on my iPhone in literally about 2 minutes.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "I wish this was hd capable. That is the only negative about this little device. Once this arrived i canceled my cable. Been loving this ever since.", "verified": true, "helpfulness": "2/2", "author": "Sarah"}, {"rating": 5.0, "review": "In short? Buy this device.In long? Buy this device immediately. It has changed the way that I use my phone and television. I use it literally daily, and I cannot imagine a life without it at this point. No words can explain how useful this thing is. For the price, the value is literally limitless.I'm not exaggerating when I say that this is the best thing I've ever purchased.", "verified": true, "helpfulness": "0/0", "author": "A. Garland"}, {"rating": 5.0, "review": "It's basically a wireless HDMI port, so totally worth it.  With so many shows/events online for free, chromecast allows the elimination of cable and enjoyment for all.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]