[{"rating": 5.0, "review": "Received my Fire TV and was very impressed with the quality. Easy set up. Works flawlessly. Being a Prime member a plus, amazing amount of movies and TV shows. Don't know how I ever got along without it.", "verified": true, "helpfulness": "0/0", "author": "marvin santiago"}, {"rating": 5.0, "review": "Neat little box but, powerful, it does everything I want it to. I'm mostly into movies and some games. The talk into remote is awesome it finds anything I want. It's fast and looks great on the big screen. Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Freesky"}, {"rating": 3.0, "review": "I have to reset it almost daily for sound or video issues. WTF?Update. Audio and video issue have cleared up. Unit wouldn't go to sleep, another reset seems to have fixed that. A reset button would be nice. I enjoy the content and the way the Fire TV works. Just fix the glitches before it gets into customer hands.", "verified": true, "helpfulness": "0/2", "author": "John Strauss"}, {"rating": 1.0, "review": "After speaking with an Amazon rep about the Amazon Fire, I realize I wasted my money.  I have been an avid watcher of the Roku for 3-4 years; but, decided to \"upgrade\" to the Amazon Fire because advertisement stated it had more channels (apps) than the Roku. Well, it does not have more channels (apps) if you use the device to watch television programs and not play games.  Now, don't misunderstand my frustration, I'm a Prime customer and like the available programs; but there are some programs not available via Amazon.  I must watch those programs via other channels (apps).  Several of the channels I watch on my Roku are not available via the Fire.  If I was a gamer the Fire would be perfect because it has \"allegedly over 400 games.  But, I'm not a gamer.  I'm not happy with the limitations of the Fire. After my phone call with the Amazon rep, I have decided I'm returning the Fire and upgrading to another Roku.", "verified": true, "helpfulness": "1/4", "author": "Karla L. Chryar \"Inspired by Music\""}, {"rating": 5.0, "review": "Great Purchase", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "I love it and want to buy it, using it in China.P.R.C.I am not sure if it has its function in China.", "verified": false, "helpfulness": "0/0", "author": "Huang Xuhui"}, {"rating": 2.0, "review": "I was very disappointed the voice commands only work for Amazon streaming and not for the other features such as HBO Go, Netflix, etc.  I was also very disappointed the only instructions that come with it are for set up.  If you want to know how to use it, you need to figure it out yourself or buy the instructions separately.  You would think for $100 you should be able to expect instructions for using it to be included.  I regret purchasing this and would not recommend it to anyone.", "verified": true, "helpfulness": "0/3", "author": "Zanniegsp"}, {"rating": 5.0, "review": "As one who doesn't have cable, only internet, this is the best thing ever. It's so much faster and more reliable than the streaming on the Blu-Ray player. There are a few issues, though. Sometimes Netflix will lock up and say a program is unavailable. Usually, rebooting will fix this. We had a problem with the video freezing on Hulu and I went through every possible solution to get things going again. The permanent solution was to use the Ethernet cable. The WiFi is great, but it will hang up sometimes. I have not seen apps for streaming directly from the networks, and there is some content on Hulu that you can only access from a computer. All that said, my only real complaint is that I still have the old Blu-Ray streaming on the other TV.", "verified": true, "helpfulness": "0/0", "author": "8CylPiano"}, {"rating": 5.0, "review": "Fantastic. Easy to install and use. The pic is perfect always. Great choices of TV shows, etc. Totally worth it.", "verified": true, "helpfulness": "0/0", "author": "Sam I am not \"Sam\""}, {"rating": 3.0, "review": "I received a an Amazon Fire TV for Christmas. I love the concept of the video streaming and games. But I didn't understand why the system is on when not in use. I understand when there are updates the system remains on, but the data usage runs high when the Fire never turns off. Maybe an update will be created soon. Right now I have decided to unplug the Fire TV when not in use.", "verified": true, "helpfulness": "0/0", "author": "K. Moore"}]