[{"rating": 5.0, "review": "Works like a charm via a WiFi connection. The picture is pure HD, Impressive for a light weight compact unit and for what it does. One thing I was hoping for was to see if it would stream a Carrier SP network onto the TV screen via the Chrome-cast but I guess that would violate their service profile and interest. Too Bad...", "verified": true, "helpfulness": "0/0", "author": "Delpinon"}, {"rating": 3.0, "review": "Its neat but could live without. Still learning how to use the options and stuff. Like being able to put laptop screen on TV.", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 5.0, "review": "Simple easy to use connects well with netflix ... my two TVs are connected to this and i said goodbye to my cable vendor !!", "verified": true, "helpfulness": "0/0", "author": "dragnot"}, {"rating": 5.0, "review": "This product is the better option for your no-smart tv and I love the price, very good product. Excellent. Bye", "verified": true, "helpfulness": "0/0", "author": "Rodolfo Rodriguez L."}, {"rating": 5.0, "review": "Excellent product YouTube plays without any issue. But streaming from chrome browser is little sluggish , good sound , compact and cheap price", "verified": true, "helpfulness": "0/0", "author": "Bijali B."}, {"rating": 4.0, "review": "Good little device with very useful features but it may interfere with over-the-air TV signals. Caused choppy OTA audio and video when plugged directly into the TV. Used a USB cable extender to move it further away from the set and all is well.", "verified": true, "helpfulness": "0/0", "author": "Super Saver"}, {"rating": 2.0, "review": "I bought this to cast Netflix and when it first arrived everything was writing great. Google pushed out a new version of the software and Netflix hasn't been working for a few weeks. Not sure start kind of priority thus has at Google but seems fairly low pub on food chain. If this hadn't happened it would have likely gotten 5 stars.", "verified": true, "helpfulness": "0/1", "author": "James Jaeschke"}, {"rating": 5.0, "review": "All their apps are very good, movies (netflix, crackle), tv series and I can navigate with google chrome on my LED tv.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Jimenez Marin"}, {"rating": 4.0, "review": "Happy with this.  Good deal for $30.  I did have to get quite close to it (less than 3 feet away) for the original configuration of the product to work properly, but it has been pretty solid.Casting to this thing does drain the battery on my Samsung Galaxy Note 3 and my Nexus 7 faster, but for $30 it can't be beat", "verified": true, "helpfulness": "0/0", "author": "Irvin Wells"}, {"rating": 5.0, "review": "I love itIs very simple to useThe best part is that you can watch YouTube Netflix on your tv while you text or call your friend and fam.Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "luz perez"}]