[{"rating": 3.0, "review": "So limited. Good for the price but the lack of remote and slowness of the connection makes it a hassle", "verified": true, "helpfulness": "0/0", "author": "Franccesca De Struct"}, {"rating": 1.0, "review": "It did not work but I figured it would be more trouble to send it back rather than throw it away, so I threw it away.", "verified": true, "helpfulness": "0/0", "author": "Vicki Turner"}, {"rating": 4.0, "review": "Is not exactly what I was expecting.  I should have done more research.  I still have it connected but also bought Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Jonluk"}, {"rating": 5.0, "review": "so awesome", "verified": true, "helpfulness": "0/0", "author": "A. Chasse"}, {"rating": 5.0, "review": "Works as advertised, you do need an internet connection to set up.", "verified": true, "helpfulness": "0/0", "author": "thejamiv \"JAM4\""}, {"rating": 5.0, "review": "Frickin' love this thing. Used to have to manually plug my laptop into the TV to watch anything on it and now I just hit the stream button on any of my smart devices. Couple that with the fact that you can stream things while still doing other stuff in the background and you have a real winner in this device. My wife and I got all our siblings one of these for Christmas. Considering getting one for each TV in the house...", "verified": true, "helpfulness": "0/0", "author": "M&M"}, {"rating": 5.0, "review": "This thing is the best! easy stream, easy setup. Portable and great picture.", "verified": true, "helpfulness": "0/0", "author": "Rugers Dad"}, {"rating": 5.0, "review": "good product quick delivery", "verified": true, "helpfulness": "0/0", "author": "Ed Endo"}, {"rating": 5.0, "review": "We love our Chromecast so much we got one for the man cave and the living room! It has drastically helped cut our cable bill because we can watch Netflix/Hulu/HBO GO on this and not have to have the 20minute discussion of what we want to watch and can watch them in separate rooms!", "verified": true, "helpfulness": "0/0", "author": "Stephanie S"}, {"rating": 3.0, "review": "IM sure its fine if you have the right expectations going in.  I tried to research its streaming capabilities before purchase but somehow missed (or couldnt find) the fact that you can only stream from Android devices (we have Apple devices).  Its not completely intuitive setting up either, but Ive only had a few minutes to play with it so far.", "verified": true, "helpfulness": "0/0", "author": "LightningSVT \"LightningSVT\""}]