[{"rating": 5.0, "review": "Best thing I ever bought", "verified": true, "helpfulness": "0/0", "author": "Lissette Padilla \"LizzieRawwr\""}, {"rating": 5.0, "review": "Awesome, works like a charm and turns your regular TV into a smart TV.  I find it works better than my smart TV in the other room.", "verified": true, "helpfulness": "0/0", "author": "B."}, {"rating": 5.0, "review": "Really brings your android devices to life....giving your room more of an interactivity wirelessly to your Tv...The last update it got the screen mirroring update although in BETA performs really well with other compatible devices running Android 4.4.2 kit kat...No lag or frame drops just  slight input lag which is forgivable due to how smooth everything else is...Great buy and there are tons more features to come i bet.", "verified": true, "helpfulness": "0/0", "author": "Nigel McFarlane"}, {"rating": 5.0, "review": "I was looking for alternatives to getting cable style TV.  This works great if you have old smartphone to spare if you don't want the children messing with your phone.  If you want a remote then you should look at other streaming devices that come with one.  I did disconnect cable and subscribed to a streaming service that was compatible with chromecast.", "verified": true, "helpfulness": "0/0", "author": "SchlagerJ"}, {"rating": 2.0, "review": "Works great but there were no instructions included and it took my tech savvy son to install and get working for us", "verified": true, "helpfulness": "0/0", "author": "Gail"}, {"rating": 5.0, "review": "Makes streaming from my phone and laptop a breeze.  Only took five minutes to setup, and now I'm left wondering why I waited this long to order one.", "verified": true, "helpfulness": "0/0", "author": "goettenthere"}, {"rating": 1.0, "review": "This is a small, inexpensive device for streaming internet video to an HDTV when the TV does not have built-in streaming apps.  The device does an excellent job of streaming in HD, but you should know that it requires a controller to select the content you want to view and Amazon's Kindle Fire will no longer work as the controller.  You can use a computer as the controller, but I got sick and tired of having to run upstairs to my desktop computer every time I wanted to start a Netflix movie or watch a youtube video on the Chromecast.  I purchased a Kindle Fire after I read reviews that said the Kindle Fire could be used as a controller for the Chromecast device in place of a computer.  It was a perfect solution, because I could hold the Kindle in my hand like a TV remote control  The Kindle worked fine with Chromecast for a few months and then that ended abruptly without any explanation from Google or Amazon.  I've tried for months to find some way to get Chromecast to work on my Kindle Fire again with no success. The Kindle works perfectly for everything else, such as surfing the web.  Amazon customer support has always been excellent, but they were not able to help me solve this problem or give me any explanation about what happened to make it stop working. The Internet is full of people complaining about this same problem and yet nothing has been done about it.  I've bought third party apps that would seem to solve this problem (some sold by Amazon) but none of them work, so don't waste your money. People have written detailed explanations of ways to get Chromecast back on the Kindle, but you need a computer science degree to understand the complicated process and who knows if it works.  I'm ready to throw my Kindle Fire into the trash, because without Chromecast it's useless to me.  My only reason for buying a Kindle Fire was to function as a remote control for my Chromecast device and save all that running up and down the stairs.  I'm not making any accusations, but around the time my Kindle stopped working with Chromecast, Amazon came out with a competing product.  It could be a coincidence, but it makes me suspicious.  I'm very disgusted with Amazon and with Google.  If Amazon did not provide outstanding customer support on everything else I've purchased from them, then I'd never do business with Amazon again.", "verified": false, "helpfulness": "1/1", "author": "Rotwang"}, {"rating": 5.0, "review": "Love this thing! You get access to a lot of movies, tv shows, etc. I used to rely on my satellite for everything, but since getting this a few months ago, I can find everything I watch on Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "0nurneez"}, {"rating": 5.0, "review": "It is a chromecast. You know what it does. It does that perfectly; synchs with every device I've tried, no lag, perfectly designed.It makes a fantastic (and cheap) gift for anyone!", "verified": true, "helpfulness": "0/0", "author": "M. Turnquist"}, {"rating": 5.0, "review": "Is a fantastic device and is really awesome full hd and watch my movies from netflix and YouTube great totally worthy.", "verified": true, "helpfulness": "0/0", "author": "Jose Avendano"}]