[{"rating": 5.0, "review": "There seem to be a lot of questions about the setup, so I'll go through what I did.1. Plug the Chromecast into an HDMI input on your TV/Monitor/whatever.2. Depending on the HDMI port used, you may or may not need to also plug in the USB cable (provided with the Chromecast) to the Chromecast to provide power.  In my case, I connected it to a USB port on the TV.  There is also a power supply included in case you don't happen to have a USB port nearby.3. Turn on the TV, if it isn't already on, and select the HDMI port with the Chromecast as the input.4. Chromecast logo should appear for a few seconds as it boots up, then it should be ready to connect to your network.5. Follow the onscreen instructions which are very simple, you can use any computer, tablet, phone, as long as it connects to the same wifi network you plan to use your Chromecast on.  In case it isn't already obvious, you need a wifi network for the Chromecast to work.  That said, your TV DOES NOT need to be \"smart\" in any way, all your TV needs is an HDMI input.6. While setting up your Chromecast to connect to your network, there will be options for security (WPA, WPA2, etc etc), it will also display the MAC address of the Chromecast if you happen to have your wifi set to filter connections by MAC address.7. Once the Chromecast is connected to your network, it is ready to receive commands from any device connected to the network it is on.8. From a mobile device (tablet/phone), load up netflix or youtube.  There should be a button on the top of the screen that looks like a TV (a rectangle) with a few waves coming out of the corner.  Press on this button, and choose your Chromecast as the display.9. Pick something to watch, hit play, and watch on your TV.10. Remember the video stream isn't coming from your control device, it is going directly to the Chromecast from the internet.  Your device is simply the remote control.11. On computer, you can show the contents of tabs in a Chrome web browser, but this is performed by actually encoding a video stream on the fly and streaming it to the Chromecast.  The quality what you see on your TV will depend heavily on the specs of the computer you are streaming from.  Don't expect this to be pretty unless you have a great computer.12. EnjoySo far, I've been incredibly satisfied with the Youtube and Netflix performance of the Chromecast.  As this device is still brand new, there aren't many services that fully support it yet, but seeing how popular it is (sold out on Google Play, Amazon, and Bestbuy) I have very little doubt that in the coming days and weeks that most services will add Chromecast support.  For me, it works perfectly, streaming 1080p video with no hiccups, audio problems, or anything... then again, why would there be, all it does is stream video from the web, which is mostly dependent on your internet connection.  It takes a couple seconds to load up the apps to play videos, but once the app is loaded, switching between videos happens as fast as your internet connection allows the stream to buffer.I love it.", "verified": true, "helpfulness": "3/3", "author": "Jason"}, {"rating": 5.0, "review": "It's simple, cheap, and awesome. What's not to love? Once this thing gets hbo go support, pandora, and some other third party app support it will be a home run. Love it!", "verified": false, "helpfulness": "0/1", "author": "kceb83"}, {"rating": 5.0, "review": "The Chromecast is a big product in a small package. The YouTube and Netflix apps work great. Actually the ease of how it works with my phone, tablet, and laptop pushed me to purchase a subscription to Netflix.", "verified": true, "helpfulness": "0/0", "author": "UMBlue"}, {"rating": 1.0, "review": "Look up the Minimum System Requirements before you buy, you need a 2nd gen i5 or greater processor. Which means in apple world that's a macbook from this year or last year. Windows world its a $1000 & up machine. Im kinda unhappy that the streaming quality of the chrome tab is really bad. Laggy stuttering ect... I wish amazon would show this on the product page b/c i would have never bought if i realized i couldn't use the dang thing.YouTube app & Netflix app on an iPhone works perfect though, but my apple TV already does that too. I was looking for this as a way to play videos from a web browser like its advertised", "verified": false, "helpfulness": "17/103", "author": "Markey_V"}, {"rating": 5.0, "review": "I have had this for.. two days?  And it's already fundamentally changed the way I watch my TV.  And with a little tinkering, using info I found online, I am able to stream media from a local server, and remotely access my computers desktop.  Unbelievable the capabilities packed into this tiny little $35 package.", "verified": false, "helpfulness": "1/1", "author": "BigBiker"}, {"rating": 4.0, "review": "Well, I'll not delve into too many technical details, I'm sure there are more extensive reviews about it.How I'm I primarily using it? As a second-screen from my PC for playing video files.Here's my take-home - this is simply a way to view the visual content of your browser - and for some media websites like Youtube, it will allow you to play the audio and video in full screen mode - and with the full resolution that you would expect from your PC.Shortcomings?1. It DOES NOT have a way to play your local video files (maybe they'll figure out a way to do that down the road) **Update - there are workarounds for this that I'm testing out****2. It requires a power-cord attached to it. They should have made this an option, and allowed users to use batteries. The main problem here is that if you want to attach it to your TV which is neatly hanging on a wall, you better have a spare power source behind the TV itself, otherwise, you will have some ugly wire hanging from the TV to a power-source below3. Your TV remote will NOT be able to pause/play/rewind/forward Youtube videos - you need to control these functions from your PC. I'm sure this will not bother folks who are casting from a mobile device like a phone or tablet, since it's not cumbersome to have that in your hands - but I'm old-school, I like my TV-Remote!!! They should have included Remote Control Protocol or at least provided a small companion remote with at least the four media-control keys (pause/play/rewind/forward)Other than that, I would say it's worth the 35 bucks - as long as we have the promise of added functionality down the road.", "verified": true, "helpfulness": "1/6", "author": "Kagz"}, {"rating": 5.0, "review": "Chromecast's website says it's the \"easiest way to watch online video and music on your TV\" and I have to agree that once you're set up (which takes only a couple minutes at most), it's extremely easy to send things from my computer or phone to my TV. I have mine plugged into my audio receiver, and I've played around with 'casting' Spotify, Soundcloud, Showtime, Hulu and more to my TV from my Macbook and they all work really well (particularly the music sites). It's much easier to just cast something than deal with plugging in my Macbook via a HDMI cord...and I get the added benefit of being able to multitask while things are playing on my TV.Chromecast really has two features: i) pressing the 'cast' button from a mobile app or website--YouTube and Netflix for now, and Google Play Movies and Music for those that use it--and then ii) casting a full tab from Chrome on a laptop. You'll get better performance from the first feature, but being able to cast a tab from Chrome makes it so you can send virtually anything from the web to your TV. As Google announced at their event, they're already working with new content partners to integrate the cast button into more apps.The killer scenario to show how easy it is to start watching something on your TV is when I got a text message from a friend with a YouTube video to watch. I literally just opened the link from my text message, it opened up YouTube on my phone, and I pressed the cast button to send it to my TV. It took less than <30 seconds (Chromecast also automatically changed the input on my AVR for me). This is MUCH faster than if I used the YouTube app on my Smart TV, where I'd have to use a QWERTY keyboard/d-pad on my remote to start the YouTube app and search for the video.Well worth the $35.", "verified": false, "helpfulness": "4/5", "author": "Asquare"}, {"rating": 1.0, "review": "This product fails at every turn. I thought \"For $35 and 3 months free Netflix what do I have to lose?\". Well $35 on a total piece of junk that I can't even give away and a flat out scam with the Netflix promo. I call it a scam since at the time I bought it Google advertised the \"3 months free Netflix\" offer. Then after they sell out google released this statement \"Due to overwhelming demand for Chromecast devices since launch, the 3-month Netflix promotion is no longer available\". Really?!?!? Keep in mind this was a day after it went on sale. I bought it prior to the \"cut off date\" but like all google products customer service is non-existent and I was never sent a code. Now on to the device. Bottom line it pretty easy to set-up but so is any non-google streaming device. Sometimes it works well sometimes it's a nightmare with horrible picture quality. I have a very fast internet connection and never had an issue running 2 apple TV's, ipads, cell phones, and a roku box all at the same time n the past. When I tested this it was the only thing running. Like similar devices it's always \"on\" but this thing gets insanely hot even when not in use. I have used my Apple TV and Roku 3 non stop all day and neither ever got remotely as hot as the Chromecast not in use. I have already disconnected this $35 piece of junk from my TV since that heat 24/7 against (or close to with the HDMI adapter) the TV can't be a good thing. Overall it is yet another google/android device that was far from ready to be released with limits that leave you bored after using it once and with the added Netflix scam I will never make the mistake of purchasing another Google/Android product in the future. Ironically I canceled my Netflix account a while back and have kinda missed it so I was going to keep it after the three months but I am so disgusted with the scam promo Netflix can go right on the list of products/services that I will never buy or use again next to google/android.", "verified": true, "helpfulness": "15/101", "author": "Harry J"}, {"rating": 5.0, "review": "FIrst of all I have to say this Chromecast is just awesome. It really rocks! I came home Weds night and had the news on and heard a news story about the release of the device. I had a busy day Thursday. But early evening I read online that the Netflix promo had ended.I've never had Netflix and always wanted to try it since my friends are always talking about Arrested Delvelopment and Netflix content. I went to Amazon, Google Play and then Best Buy. I saw on Best Buy you could still purchase online if a store had it in stock and the free 3 months of Netflix was also still on the page. I checked the store near my house and it said it was unavailalbe. I looked at other stores and they were really far away. So the rest of the night I didnt think or feel bad that I couldn't buy a chromecast. After midnight I took a shower and went back to Best Buy's web site and brought up the list of stores that come up with my zip code. I saw a store in a part of town where I had to go on Sat to a birthday party at night. I got out my credit card and the purchase went through. One Friday I was hopeful that I would still be able to pick up the Chormecast since I got an email that my order was ready to pick up! FInally Sat came and I left 2 hours early for the birthday party and took my tablet with me. When I went to the pick up counter they had my Chromecast in a sealed box and the woman said they had been out of them since Weds. I told here how I bought mine after midnight Fri morning when I guess they added inventory to that Best Buy. I have the Samsung Galaxy tab2 7\" that I purchased last Sept 2012. I went to the Samsung Store inside Best Buy and was given some help on how to conserve my battery.Everyone at Best Buy was wonderful.Now I came home from the birthday party at midnight and plugged in the Chromecast into the HDMI port and power supply to my usb port next to my HDMI port on my Samsung TV I bought last year at Best Buy. I then went to the web site the TV screen told me to go to on my tablet and it downloaded Chromecast.i also had my notebook ready since I knew from reading reviews that I was going to need to enter my passcode for my reuter. And that was easy.  I went to my youtube app and the video didnt play. After 10 mins I decide to go back to look at what info was in the Chromecast app.It listed Netflix, Youtube and Google Play. I clicked on youtube and it asked if I wanted to open it or install. I clicked on install and magic happen. All I needed was the lastest version of Youtube and I was able to stream perfectly 1080 HD video to my TV!After watching a few videos on my TV I decicde to see how you can go to any web site while streaming. I went to my email and found 2 emails from Best Buy. One confirming my order was picked up and a 2nd with info on my free code for 3 months of Netflix. I went to the Netflix app and installed the lastest version. Then I created a user name and passcode and  needed no credit card to start up Netflix. WIthin a few minutes I looked at all the content and then decicded to stream the pilot of Arrested Development. It was my 1st time seeing the show and I'm hooked on the show and to my Chromecast.I got really lucky not just getting the Chromecast from Best Buy but still getting for free 3 months of Netflix! I'm over the moon since my Samsung Tablet 2 7\" had no way to stream and now I can watch endless youtube and Netflix at least for the next 3 months. I hope this doesnt cut into my time working out at the gym and all my other sports I play. Lol.Try Best Buys web site before they take down the Netflix promo. Hope this review helps someone. Get back to me with questions or comments if you'd like. Thanks for reading!", "verified": false, "helpfulness": "2/6", "author": "Sun Seeker"}, {"rating": 4.0, "review": "Netflix and Youtube work great on this though I already have other ways of getting them on my TV like many people.  The most useful feature for us so far is Chome tab cast of Hulu and Pandora One, both work perfectly and am especially happy as the best quality 192K Pandora One audio feed is only available on a computer/laptop, all my other sources (like Squeezebox, web radios, etc.) are 128K.  I needed to use the supplied USB power adapter when I plugged this into my Sony AV receiver but it turned out this was well worth it because when I cast a Chrome tab the receiver powers up and switches to the correct HDMI port automatically and this works fine with the TV off when I'm only interested in audio.  Also FWIW I bought mine at my local Best Buy Friday 7/26 and to my surprise still got the 3 months of Netflix service despite the earlier announcement that Amazon and Google had stopped doing this.", "verified": false, "helpfulness": "2/3", "author": "bluto"}]