[{"rating": 5.0, "review": "A real winner, love using this app and really enjoy the distance i can move from the tv and the show continues to play", "verified": true, "helpfulness": "0/0", "author": "Sean Mehegan"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Seungchang Yang"}, {"rating": 1.0, "review": "Worst thing ever! Don't waste your money! I am sending this back and waiting a month and a half for the Amazon fire stick. Chromecast 1-would not work with Amazon prime. Finally got that issue resolved and the thing quit working and would not pick up my WiFi. After HOURS wasted and frustration to the point of wanting to throw the thing I will be returning it! Pos!", "verified": true, "helpfulness": "0/2", "author": "Della L. Hughes"}, {"rating": 1.0, "review": "Bought it for streaming UFC fight pass via an Iphone 5 and a Nexus 7 tablet. Horrible buffering and worst video controls. Bought one for me and one for my father in law as a christmas present. He'll probably hang himself trying to use this or he'll drive me crazy calling me for help. It's not very user friendly and I can assure you it's not worth the trouble.", "verified": false, "helpfulness": "3/4", "author": "RoAdKiLL"}, {"rating": 5.0, "review": "Works great without a hitch! Wouldn't hesitate even a second to order. For those who need some persuasion - how does watching your tv with your phone/tablet as a remote sound? Just open the show/movie in a chromecast compatible app and you're off and running! Couldn't be easier to use.", "verified": true, "helpfulness": "1/1", "author": "Natalie"}, {"rating": 4.0, "review": "Not as easy to set up as the Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Michael Johnson"}, {"rating": 4.0, "review": "The only reason why I don't love it is that Amazon does not support it so can't use Amazon movies. Still good for Netflix and YouTube videos", "verified": true, "helpfulness": "0/0", "author": "Linda Encomienda"}, {"rating": 3.0, "review": "Setup was fairly simply, connect to the TV HDMI, plug in the USB (either plug into the TV USB or use the included power adapter to plug into a wall outlet).  Next use a phone or table to connect to the device (download the chromecast app) and set it up.  You then can cast certain things to your Chromecast.This worked slightly better for me than the Roku stick I previously purchased and returned.  It has a HDMI/WiFi extender cable included which helped with the upstairs TV but only marginally.  I found that with a newer wireless router this Chromecast (and perhaps the Roku stick) work much better and do no cause a complete shut down or lag of my wireless connection when using other devices.  I have this setup on the upstairs TV in a room that is furthest from my router.  Initially the signal was not strong enough so there would be buffering and even more so if I tried using other devices while it was \"casting\".  The new router has a stronger signal and I am not experiencing any issues now.Everything is controlled via phone/tablet and apps so it's not like a Roku where you have a remote and navigate about making selections.  I've so fared used to steam youtube, flixster and google play movies along with some videos from various sites.  Some sites will block the ability to \"cast\" as I found out.  Also the \"mirror\" is in beta - mirror just means you can cast what is on your phone or tablet to the TV screen.  The \"Cast\" seems to work fine for other apps and you can even queue Youtube videos.  While \"casting\" you can still use your device, I did notice that google movies will show you the movie playing on the \"lock screen\" of the device if locks after inactivity.  You can pause/play without unlocking the device when it's in this mode.They have a number of offers available that you can check once the device is setup.  It took a while before my $20 Play Store credit appeared, but it did eventually appear.  I also have received two free movies - Gravity and X-Men and I think there is a LOTR available now.I'm still new to streaming but having this is nice and I can steam movie and music using it plus it is portable so can move it easily.", "verified": true, "helpfulness": "1/1", "author": "TheLion"}, {"rating": 5.0, "review": "Glad to have it.", "verified": true, "helpfulness": "0/0", "author": "Shenandoah"}, {"rating": 4.0, "review": "I like this, since it's portable and you can cast from Google Chrome to any HDMI port on a TV. That's the best part. YouTube works like a charm.But, for an iOS user, it has limited app support. I can't figure out how to stream Watch ESPN from any of my devices or  my Mac even though Google's website says it supports this.On the negative side, on some days, the streaming is poor. It stops casting or videos buffer too long.", "verified": true, "helpfulness": "0/0", "author": "Jake"}]