[{"rating": 4.0, "review": "Chromecast streams media from you mobile device to your TV nothing more and nothing less. Thats all it needs to do. The setup is rediculouly easy. If you are able navigate a smartphone you shouldn't have any issues. The only problem I had was the security settings on my router where blocking the chromecast. I consulted my routers manual and resolved the problem. After that was resolved the chromcast worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Nolan Foster"}, {"rating": 2.0, "review": "Was easy to set up, but the quality on the tv from the computer was awful and lagging. Not what I expected.", "verified": true, "helpfulness": "0/0", "author": "Barbara Press \"Babs\""}, {"rating": 5.0, "review": "My daughter bought a Chromecast a few months ago. I liked hers enough that I bought one. It is easy to setup and works well.", "verified": true, "helpfulness": "0/0", "author": "Randy K Black"}, {"rating": 2.0, "review": "Months and months of waiting and they still have less than 20 apps.... REALLY! And most the apps they do have stink.", "verified": true, "helpfulness": "0/0", "author": "FrolickingCamel"}, {"rating": 5.0, "review": "i love that i can take this product with me and wherever i get wifi i can stream netflix or youtube to the tv.  it is relatively easy to use.  i would definitely consider getting another one so all my tv's have ability to stream from my tablet or phone", "verified": true, "helpfulness": "0/0", "author": "blueboyblonde"}, {"rating": 1.0, "review": "It would not connect to my router.  Tech support told me to call the router manufacturer.  Router teck support told me to call Charter (my internet provider).  Charter told me to call chromecast.  I summary \"it don't work.\"I even searched the internet for someone that had a clue why it would not connect.  I intend to sell it to someone on ebay.", "verified": true, "helpfulness": "0/0", "author": "Henry Mansker"}, {"rating": 4.0, "review": "It works well as expected. But I have high expectations on chromecast. The reason I removed one star is because of the performance of casting a browser. The casting is youtube and other apps works from browser with good speed. But when I cast the browser, it is lagging. I have a i5 processor, so I think laptop has good speed. My router also is very fast, which can get 300Mpbs. So I am guessing it is the chrome cast that is not able to handle. It is possible that my laptop is not able to take it. Anyways, it is slow with this feature. Still a worthy buy.", "verified": true, "helpfulness": "0/0", "author": "Vishnu"}, {"rating": 1.0, "review": "It is not clear in the description that you can only stream certain applications to your TV.  I was under the impression that you could stream whatever was on your smartphone screen to the TV - not so!!!", "verified": true, "helpfulness": "0/1", "author": "Toller65"}, {"rating": 5.0, "review": "Easy. Simple. Cutting Edge.  This device has changed my world.  Set-up literally to , 5 minutes, and anyone can do it, you do not need to be \"tech savvy\" to set-up.  I would highly recommend a Net Flix account with this, as I got tired of You Tube in a hurry.  Well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Sparky"}, {"rating": 5.0, "review": "I have Roku 2 and i love it. I bought this just to add streaming in some areas of my house and also to compare to Roku. Even though it's lacking of channels but still ok because i normally watching Netflix and YouTube and it got on it. Shipping is fast because the seller is Amazon and it's the cheapest offer in Amazon online shops.Recommendable for watching streaming videos.", "verified": true, "helpfulness": "0/0", "author": "ARL"}]