[{"rating": 5.0, "review": "I absolutely freakin love this product!!!!  I've been registering sites and watching shows and documentaries so.e 5:30. And it's three now.", "verified": true, "helpfulness": "0/0", "author": "Suzanne F."}, {"rating": 5.0, "review": "It is a great device and who needs cable", "verified": true, "helpfulness": "0/0", "author": "charles brown"}, {"rating": 1.0, "review": "Just received it... Couldn't find any free movie and couldn't download a Netflix even I am a subscriber. It writes me: \"Unavailable Pricing Unavail...\" Hope Amazon will repair it soon...", "verified": true, "helpfulness": "3/5", "author": "Igor"}, {"rating": 5.0, "review": "This has been one of the best buys that I have ever made.  The Fire TV is wonderful and I am able to watch a variety of programs and movies.", "verified": true, "helpfulness": "0/0", "author": "MEB"}, {"rating": 1.0, "review": "I get it! Does it work as described? Just an example...Netflix app just gives couple of screenshots.... nothing else :-(", "verified": true, "helpfulness": "1/6", "author": "Kasiviswanathan"}, {"rating": 3.0, "review": "The FireTV is easy to set up and works great with Prime Streaming. Hulu Plus is extremely buggy on the FireTV.  It will crash and shows the ads in SD rather than HDTV.  My old LG TV from 2012 does a better job with Hulu.  Since the hardware is good, I am hopefully that future revisions of the software will improve things.  Miracast does not work with Windows 8 yet.", "verified": true, "helpfulness": "0/0", "author": "GXAlan"}, {"rating": 3.0, "review": "Cannot have netflix installed on it, keep saying that it will download it soon but nothing happens. Would have get 4 or 5 stars if this issue was not present.--UPDATE--The issue is now fixed with no more explanation, still 3 stars as i think not having access to Google Store is a pity", "verified": true, "helpfulness": "2/2", "author": "loopingz"}, {"rating": 3.0, "review": "I ordered Amazon Fire TV on their Black Friday special, and it was a very good price.However, when I attached it to my 1080i HD TV through the television's DVI connector using the same HDMI to DVI cable I use for my DVD player, it would not work.Apparently it only works through an HDMI input, and my HD TV doesn't have an HDMI input.So in order to use my Amazon Fire TV, I will have to purchase a new television.  Bummer.It may be a while before that happens, but when I get a television with an HDMI input, I'll update this review based on what Amazon Fire TV actually does, not just on connection type.In the meantime, make sure of your television inputs before you order.", "verified": true, "helpfulness": "2/2", "author": "PJ1"}, {"rating": 5.0, "review": "I sure was glad I tried this. It functions smooth and has the best menu of any gizmo you will find.When your a member of prime so much is free. For years I just passed this by. It could have saved me allot of money while trying other services out. What more could you ask for. Just get it!", "verified": true, "helpfulness": "0/0", "author": "Chekawa \"Chekawa\""}, {"rating": 2.0, "review": "Sadly, it leads you to believe you are getting all these services and movies, when actually anything new or actually a good tv show or movie costs you more money. Yes there are lots of free movies and shows but most are things that you don't care to watch. Very few are higher quality movies or shows. EVERYTHING YOU WANT IS JUST LOTS MORE MONEY.", "verified": true, "helpfulness": "0/2", "author": "robert ehrlich sr."}]