[{"rating": 3.0, "review": "It does what it claims...kind of. There are just not enough apps that you can cast, seriously I want to watch my own videos on the screen but you can't because the apps are not a plenty.", "verified": true, "helpfulness": "0/0", "author": "vicente guerrero"}, {"rating": 5.0, "review": "I bought this for a friend for Christmas, and when I got to his house, I quickly pointed out to my wife that there was an identically sized package under his tree that had my name on it. It was a lot of fun for us to open our packages from each other that had the same item in them!This device does the single best job of bringing a level of \"smart\" to my TV that I have ever had the pleasure of using. In fact, this device is the first time I have been able to get my wife to use media that isn't TV native. She never liked using the Xbox, the Wii, the Media Center, or any of the other techniques that I liked to play around with. The Chromecast is basically used more by her than it is by me now.Plug and play easy, with a simple guided set up process has it running in about 5 minutes, Once you are set up, the limits of \"TV\" just start disappearing. There are a number of apps that can utilize Chromecast already, and the number is growing, which means my old \"dumb\" TV is only growing more powerful.", "verified": true, "helpfulness": "0/0", "author": "Worf"}, {"rating": 4.0, "review": "The product arrived in the timeline indicated.Setting was a little work, hence the 4 stars, not exactly drag and drop.It works like a champ though.  Streaming youtube to my TV needs some QA on the video quality, speed is fine.Interesting product, need more apps that can utilize this idea!!", "verified": true, "helpfulness": "0/0", "author": "Bob C."}, {"rating": 5.0, "review": "I actually ordered a Chromecast the day it was announced from Google. However the next day, I was told that they were available for purchase at bestbuy. I was anxious to try it out so I went and bought another one and gave it a try.Setup was easy and within 5 minutes, I was watching a youtube video on my 65\" TV. The quality was VERY good. I tried a 1080p video first \"Big Buck Bunny\" and it looked, played and sounded wonderful. Next, was playing music from my Google Play music app. Same result, the music sounded great.I moved on to my Macbook Pro, and again, the videos was clear, without lag, no audio sync problems at all. Same for my Windows PC.Those considering buying the Chromecast should consider what the Chromecast actually is and does, instead of what they wish it could do. So here are some facts:1. The Chromecast is not a streaming device of local digital content. In other words, it does NOT play digital music and videos that is stored locally on your network drives or computers. However there is a work-around for this:Use PLEX Media Server. If you don't already have it, here's the link:[...]Once you download it and point it to your files,it will act as a proxy and allow your music and videos to be played on your HDTV using the Chromecast through the Chrome browser. Simply launch the PLEX Media Manager in Google Chrome browser. Pick a file to play, Hit the Google Cast button and you'll get seamless playback of your own files. [Edit: Please see comments to see an alternative method].2. The Chromecast is not a DLNA or Miracast device or Apple's airplay. This is a lot like my number 1 fact, but I wanted to make this clear. If you want device mirroring (display whatever is on the device's screen), the Chromecast, is NOT for you. The video and music does NOT stream from the controller device (Your computer, tablet, smartphone). Chromecast works by fetching the content from a website or cloud service itself, NOT from the device you're using. Here's what's cool about that:A. You could start playing a video using your smartphone,tablet,computer as a \"remote\" and still be able to browse the web, play a game, check your social apps, write a book report, put the device to sleep,turn the device completely off (I tried this myself), or leave the house, and the video WILL still play without issues.B. Your battery life is saved! Because your phone, tablet or computer (not plugged in)is not actually streaming to the Chromecast, your battery consumption is minimal. You could Play dozens of movies over several days and still have most of your battery life remaining (Of course this would depend on what else you do with the phone, tablet or computer and how long your device can stay in standby).C. Every device connected to the Chromecast on the same network can take control of playback, adding to the queue (what's going to play next). Pause, fast forward, rewind, etc. So if your roommate, friend, parent, sibling, spouse, girlfriend/boyfriend has to leave with their device, you don't have to worry.D. You can play content from thousands upon thousands of sources using your computer. Using Google Chrome, nearly every webpage, that has content can be viewed using Chromecast. Of Course, this depends what protocols the site is using. If the site has trouble playing on your computer, then it probably won't work well on the Chromecast, either.3. Chromecast IS cross platform (works with multiple devices). As I said, I tried it with several devices with different operating systems. At the time of this review, it works on Windows PC's, Macbooks, and android devices. The app for iOS devices is coming soon. Everyone knows the Apple App store has stringent policies and at times, it can be a long process. Look at the Onlive game streaming app. We won't get into how Apple has been trying to eradicate google applications from it's ecosystem anyway. I'm sure the app is waiting for approval. Just be patient. [Edit: Please see comments for a reply to it working on iOS devices].There are several youtube videos that can show you how to set it up or how well it works. I made a video myself:[...]Watching my video isn't required, but it does help to verify what I'm saying.4. The device you use with the Chromecast, must be on the same WIFI network. The important word here is WIFI. If you are trying to use it, with a ethernet (wired) connected device, even though it's on the same network, it will NOT work! Yes, that sucks, but not being able to use sink water in your gas tank, kind of sucks to. If that's a deal breaker for you, then you shouldn't purchase it. It's how they chose to implement it's use. It is, what it is. [Edit: Please see comment section].5. The Netflix 3 months free limited time offer is over! I received 3 months free with both my purchases. I live in the eastern time zone. Even though I bought my second Chromecast on July 25th at 6:46pm. I realize that when the offer was no longer available, it should have been posted immediately so that consumers could factor that into their decision to buy the Chromecast. Instead of calling it a limited time offer, they should have said \"while supplies last.\" Never the less, the features and functionality of this device has nothing to do with the inadequacy of a bonus offer. To help people make a decision about a future purchase and if it will work for THEM in the home configuration they have, is paramount in my book.6. The Chromecast REQUIRES power through USB connection or from your wall outlet. The required peripherals ARE provided to you in the retail box. Some people are saying if you have an HDMI 1.4 compatible port on the back of your TV, the device can be powered by the HDMI port alone, without the USB cord connected. I CANNOT speak to that, as my HDMI ports did NOT power the Chromecast. I had to use the provided USB wire and connect it to a USB port available on the back of my TV.Overall, I'm extremely pleased with the purchase. I've read some of the other reviews, particularly the 1 and 2 star reviews, because it's an indicator of what can possibly go wrong with the device. I would suggest that people make their decision based on people that have actually bought the device and have experience connecting, setting it up and ACTUALLY using the device. Most of the bad reviews are from people that have not used it, didn't understand the features of the device, or, to be honest, has a problem with the competition between Apple and Google and wants to dismiss this product because of their affinity for Apple products. Look at the features and functions of this device and consider them for yourself.I hope this review helps someone who may be considering this device.EDIT: Recently more apps were added with chromecast support, including the PLEX app! Other editions are: HBO Go, Hulu Plus, Pandora, Vevo, Redbull.tv, Songza, Post TV, Viki, Real Player Cloud.", "verified": false, "helpfulness": "3/3", "author": "Lisa Johnson \"Lisa J.\""}, {"rating": 4.0, "review": "Pros:SmallEasy Set UpQuick to access via iPad and iphoneGreat priceCons:Sometimes it just doesn't work. It's probably my wireless. When I first set it up we played youtube videos for a while and then it just wouldn't load them. though lately it's been okI only have two HDMI ports in my tv and 3 things that want to go in it (blueray player and xbox) so I have to shuffle things around sometimes. But that's not the fault of this guy.basically, youtube + netflix + hbgo. we don't use it too too often because we usually want to play with our phones/ipads while watching stuff so we still use netflix on the xbox. but you can have a great youtube session with friends!I certainly like it, just not sure how useful it's turning out to be.Got one for my parents and they love it! They instant stream netflx a lot. It's easy to teach someone who doesn't know much about tech stuff to use this.", "verified": true, "helpfulness": "0/0", "author": "emmaline"}, {"rating": 5.0, "review": "finally got this to work and really like it.I have actiontec fios main router and linksys e4200 as wireless N access point.  The Chromecast setup would not work when the e4200 was in bridge mode.But when using only the actiontec the chromecast setup worked just fine.2 things for install1. you have to setup using a laptop connected to the wireless router that the ChromeCast will connect to.  The laptop connects to chromecast device and sends the setup info to the chromecast and then the chromecast connects to the wireless router.  I was trying to setup from a regular desktop and it would not work, must be setup from a laptop with wireless connection.2. for some reason when I had the e4200 wireless N router in bridge mode, the chromecast would not connect to it.  I had to have laptop connect to actiontec wireless n router ( i have both setup as wireless N on different channelts) and chromecast worked.  Not sure why but gave up.Google support was friendly and responsive and spoke english but they didn't seem to understand #1 requirement for setup.Once working very cool, can cast netflix from desktop computer to hi def tv.  Can also cast from iphone to hi def tv.", "verified": true, "helpfulness": "0/0", "author": "Todd \"Todd\""}, {"rating": 4.0, "review": "I like the Google Chromecast, it is great to be able to pull up a movie on your smart phone and view it on your tv.  However, sometimes if you have not used in in a day or two it loses its connection and you have to then download the chromecast app onto your phone, in order to view it on your tv again, though it has only happened once.  Also, it would be nice if you could use it for multiple HDTV's in your home.-- LD", "verified": true, "helpfulness": "0/0", "author": "Latasha Dawson"}, {"rating": 5.0, "review": "I was hesitant to buy this because a lot of the expert reviewers gave it low scores, preferring the Roku, and Apple tv because they offered more solutions, at a relatively comparable price. If you can consider almost twice as much comparable, then there is definitely merit to those claims. But I wanted a product that could fill the gap of my other 2 streaming players: a Sony BD player, and  Sony Media Player. Both of the devices do fine with Amazon Prime Video, Hulu, Vudu, Pandora, etc, but started having really bad issues with Netflix and YouTube. Well, the chromecast does both flawlessly.And, navigating netflix is so much easier with an android device than it is with a tv remote. It`s almost as if Netflix was intended to be used with the chromecast, as I haven't had a single problem with buffering, crashes or errors.Another great benefit is that it is so small and compact, so now I don`t have as much clutter on my TV stand:-) Everything is tucked away behind the TV and out of sight. If Google manages to add more services to it, I will probably buy another one for my 2nd TV set. GREAT product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "When I plugged in the Chromecast a message appeared that it did not work with Kindle products.  No good to me!", "verified": true, "helpfulness": "0/0", "author": "CCSLP"}, {"rating": 4.0, "review": "I love the functionality of this product, but there are some connection issues that pop up that cause me to have to reset it sometimes multiple times and run through the setup again.", "verified": true, "helpfulness": "0/0", "author": "I. Miller \"Zen MuadDib\""}]