[{"rating": 3.0, "review": "It's great for Netflix and Hulu but as of yet it's a bit limited for my taste and the hardware at my house. I realize that it will of course get more apps down the road, but for me a big one that it really NEEDS to have is Amazon for streaming prime videos and content from my Amazon library. Casting from a google chrome tab on the computer is possible but it's buggy and not very satisfying. I still haven't gotten it to stream an Amazon prime video in full screen and it always seems to have problems with sound. Plus, having my laptop in front of me while watching a movie is a distraction and kind of unwieldy. I'm always afraid my expensive-essential-for-work-laptop is going to get coffee spilled on it sitting on the coffee table.When comparing my parents' Chromecast to the AppleTV I have at home, the Apple TV gets way more bang for the buck, even at nearly 3 times the price, provided that you have other Apple devices. An iphone or ipad significantly extend the  Apple TV beyond what the Chromecast can do because of Airplay. Apple TV doesn't natively support Amazon Prime videos either but streaming from the device itself via Airplay not only makes that a non-issue but allows you to stream *anything* even games, from any apple device. You can stream Steam games, like Bioshock Infinite from a Macbook over airplay and play it on the TV with a PS3 controller, completely wireless, for instance, while Chromecast is limited to what can be displayed in the Chome browser. Having an Apple device already is the caveat there. Without another Apple device, Apple TV will get you roughly the same capability as Chromecast, plus or minus a few apps.It really comes down to what you already have. If you've got a macbook and an iphone, the choice is clear. If you've got an android phone and a windows computer, then Chromecast is a much better deal than any other box. Eventually Chromecast will probably work natively with Amazon. I doubt that will be true for Apple TV..", "verified": false, "helpfulness": "0/0", "author": "0ktopi \"MumblyJoe\""}, {"rating": 1.0, "review": "Google touts this as an alternative to other streaming devices, and boasts that you can stream video from your browser. It can stream Netflix and Hulu, sure, but when it comes to streaming video from your browser, it's pretty much just those and YouTube. If you are watching video on any other site and try to go full screen, it will not work.I bought this as a gift for my mother, and feel like a fool for it. Spend the extra $50 or whatever and get a Roku.", "verified": true, "helpfulness": "2/2", "author": "kaliber"}, {"rating": 5.0, "review": "It's a great product, my maximum to travel a lot and carry it with me all the time, very good seller recommend, Thank you Google your doing great things to feel comfortable", "verified": true, "helpfulness": "0/0", "author": "Walter Puell"}, {"rating": 5.0, "review": "Very good one, ontime received good product for price.Quality is excellent.I will recommend this to all friends and collegues and every body", "verified": true, "helpfulness": "0/0", "author": "haris"}, {"rating": 5.0, "review": "Lots of the higher end TV's come with \"smart\" features like the ability to play netflix and connect to your home network. These features, while nice, are not one of the things i really consider when making a TV purchase. I'm more interested in picture quality, color contrast, and just overall look and feel. Still, I've often wished that my TV had netflix and google play built into it just for the convenience. I had considered a few of the various boxes that can be plugged into a TV to accomplish this, but in the end they were overpriced and I just went with using a laptop and an HDMI cable. For 35 dollars however, I was willing to spend the cash for the ability to not have to fiddle with chords and get up to go to the laptop to change the show or channel. If i want I can control from my laptop, but it's all wire free. but usually I just control this device from my phone, which I always have, and charged on the night stand right next to me.Long story short; Works well, costs little, great purchase.", "verified": true, "helpfulness": "0/0", "author": "USAF Veteran \"Inquirer\""}, {"rating": 5.0, "review": "This device is brilliant! We ordered one originally. As soon as it was delivered I set it up (my husband was at work) in less than 10 minutes. Super easy. Then we started streaming. Right after I saw it was simple enough my six year old could use, I ordered another one. LOVE it! Now if only Amazon could stop with the grudge and just be col with Google... geeze.", "verified": true, "helpfulness": "0/0", "author": "Hersom"}, {"rating": 2.0, "review": "Not sure why the chromecast would not connect with my WiFi, just kept displaying a cannot connect to chromecast make sure the chromecast is near or close ,when i am 1 foot away from it, i tried to different TVs  i am using a Samsung galaxy note 3 and after a long wait I get the no connection message. so for me its useless so I wouldn't recommend it , waste of money.", "verified": true, "helpfulness": "0/0", "author": "R. Braggs"}, {"rating": 5.0, "review": "Connected very fast to my android tablet for setup. Had one USB to plug into the tv for power, hdmi in for input to chromecast plugin. Works great, you can shut off your phone or tablet after you hit play and can watch it on the big screen in bed or living room easily", "verified": true, "helpfulness": "0/0", "author": "kje1"}, {"rating": 5.0, "review": "Ignore the naysayers. Many of the complaints found in the 1-star reviews for the Chromecast make absolutely no sense.People complain about video freezing while being too naive to understand that it's their internet speed, not the Chromecast causing it.  Others stay that its functionality is too limited or that it has false advertising. This is simply not true, the Chromecast does everything it is advertised to do, and the faster your internet, the better it works.  If anything, this products packaging actually UNDERADVERTISES it since new apps are being added that support its functionality. For streaming HD video, you would want an internet connection of at least 6Mbps or better. Many people have 15Mbps, which is plenty fast enough.Netflix recommends 5-7Mbps for HD video, and 12Mbps or better for streaming 3D on their website.Some people complain about it not having Amazon InstantVideo support. WELL DUH! Amazon is one of Google's main competitors in the tablet space, they would rather have people streaming Amazon InstantVideo on a Kindle Fire rather than a Google device.  It's not Google's fault for the lack of Amazon InstantVideo support, it's Amazon's. Just ask yourself why Amazon hasn't even bothered to make an InstantVideo app for android. It's because then nobody would have reason to buy their precious Kindle Fires and everyone would be buying better, more functional tablets like the Nexus 7 instead.If you want to watch Amazon Instant Video, then simply install the Google Cast extension for Chrome, and type chrome://plugins and make sure the Microsoft Silverlight plugin is disabled, and then you can use Flash to watch Amazon InstantVideo instead, and simply cast the tab via the Google Cast extension for Chrome. It's not an ideal solution though, but it's also not really much of a con either considering the price of the Chromecast.Other people complain about not being able to stream the content from their galleries. There apps that let you do this, such as Plex. People need to update their reviews to reflect this rather than knocking a product because of their inability to learn how to use it.I have personally bought 5 of these and have been using them for months. I bought one for my 74-year old grandmother for Xmas and she already understands how to use it. It works amazingly well, and new apps are adding Chromecast support all the time. There is no on or off switch on the device, simply unplug it from it's USB power source (whether it be a USB port on your HDTV, or the AC adapter included) if you wish to turn it off while in use.You can download the Chromecast app to reboot it, check the MAC and IP addresses, rename it (such as Living Room, Master Bedroom etc).  If your TV's HDMI inputs are too close together, the wider rounded end of the chromecast may be too bulky to fit between your other HDMI inputs, but fortunately, Google includes an HDMI extender cable in the packaging to eliminate this problem.The best part is, it updates itself automatically, much like the Chrome browser. If you wish to update it to the latest version, simply reboot it via the Chromecast app, or turn your TV off and on again, or unplug the Chromecast's USB power source and plug it back in.Lastly, the Chromecast serves as a beautiful slideshow of photography from Google engineers such as the amazing photographer Romain Guy,who used to be a part of Android but now works on Google's robotics team, as well as several other photographers.  New images appear to be added every week, so you'll never get bored of the same images over and over and over again.It works with all the biggest and most important apps for streaming content such as:Google Play MusicGoogle Play Movies & TVYouTubeNetflixHulu PlusPandoraHBO GOVevoRed Bull.TVSongzaPlexPostTVVikiRealPlayer CloudSupport for more apps will be added in the coming months, so have patience, as this product has only been out for about 5 months now.  If you want an inexpensive way to watch Netflix, YouTube, Google Play Music and TV, or listen to music from your Google Play Music collection, and don't own a smart TV or smart bluray player, this is the perfect device for you.  Really what the Google Chromecast does, is that it allows for any HDTV to be converted into a Smart App-enabled TV.  It's absolutely perfect for parties or family gatherings where everyone wants to be able to share their own content through the TV.There's many reasons why this is currently the #1 electronic gadget on Amazon, most of which I have listed above in my review.", "verified": false, "helpfulness": "1/1", "author": "Tyler Chappell"}, {"rating": 5.0, "review": "Thanks Google! about time an affordable and convenient device like this came out, gave out about five of them as Xmas presents.Max B", "verified": true, "helpfulness": "0/0", "author": "mbuitrago"}]