[{"rating": 1.0, "review": "Connected it a half dozen times and had a tech from Amazon on the line for 45 minutes and all we got was a black screen. Sent it back", "verified": false, "helpfulness": "1/3", "author": "James R. Vile \"James Vile\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Robert Tella"}, {"rating": 5.0, "review": "I absolutely love it and will be buying another for two other rooms.  I love best that its more than easy to hook it up. You literally plug two cords in and youre good to go. (A previous review states there were problems connecting to netflix however i was able to do so under the Setting option). It is so small lightweight and worth every penny!", "verified": true, "helpfulness": "0/0", "author": "nicole"}, {"rating": 1.0, "review": "Found out too late that a lot of the video features were free for the first couple of seasons and then once you were hooked, you had to pay $$$ to continue watching.", "verified": true, "helpfulness": "2/3", "author": "Cardy"}, {"rating": 5.0, "review": "Super easy to use! Love the voice search feature!", "verified": true, "helpfulness": "0/0", "author": "Diana B. Tran \"<3 dt\""}, {"rating": 5.0, "review": "Beyond awsome", "verified": true, "helpfulness": "0/0", "author": "Jet"}, {"rating": 4.0, "review": "Perfect for what I needed. Easy to set up and use. I just wish there were more movies/shows on prime. It seems that every time I find something to watch I have to pay for it. 😕", "verified": true, "helpfulness": "0/0", "author": "kristine castilleja"}, {"rating": 4.0, "review": "Easy to open packaging and easy to set up.. It's Great!", "verified": true, "helpfulness": "0/1", "author": "Jackie Wells"}, {"rating": 5.0, "review": "this was a gift from our daughter. we are really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Frances Tuttle"}, {"rating": 5.0, "review": "Easy setup and excellent performance.  I have only one HDMI input on the television so I used a ViewHD 1x3 or 3x1 Bi-Directional AB Switch model VHD-3X1AB to connect the 2 devices to the single HDMI input.  The setup works great.", "verified": true, "helpfulness": "1/1", "author": "Scott99"}]