[{"rating": 1.0, "review": "There is considerable latency between, what is displayed on the primary screen ( computer or iPad) and slave screen (TV)", "verified": true, "helpfulness": "0/0", "author": "Tafani"}, {"rating": 4.0, "review": "Simple to install, allow us to watch netflix in our TV without connecting our laptopMost new tv has it built in but for All the test it is a great enhancement", "verified": true, "helpfulness": "0/0", "author": "Rafi M."}, {"rating": 2.0, "review": "Much too difficult to browse internet, and really much too cumbersome to use Watch ESPN, which was the main reason I got it. Needs a lot of work.", "verified": true, "helpfulness": "0/0", "author": "ocalaheart"}, {"rating": 4.0, "review": "Quite convenient. Plugging this thing into my TV/Projector leaves a much smaller footprint and energy bill than an old laptop as a media center. Netflix and Plex apps are necessary.Sometimes, though, I cannot connect to it and I do not understand why. It is quite inconsistent in this regard -- like I can stream one episode, and then I cannot play the next one, etc. Restarting does not fix, it is really random. Also, the ecosystem is not AMAZING yet, but it is getting there. I got mine upon release and the ecosystem was really bad back then, so I really can't complain about the current one.Plex is necessary because if you drag certain video files into Chrome, it will play the video but not the sound. I could not play a lot of custom videos prior to the release of the Plex app, which was frustrating.The UI addition to your apps are also not amazing. You cannot just play next on the Netflix app, for example, you have to exit and go all the way to episode selector to select the next one. If you just hit play from the main screen after your current episode ends, it will just replay it.....I'll try to keep this guide updated based on software updates I receive.", "verified": true, "helpfulness": "0/0", "author": "Omniscient"}, {"rating": 5.0, "review": "Just wish more apps would join the casting family.... But other then that, really enjoying it..energy saving if you think about it...", "verified": true, "helpfulness": "0/0", "author": "LinoPerez"}, {"rating": 5.0, "review": "Husbands loves the Google Chromecast HDMI Streaming Media Player! So versatile! He uses it to watch Netflix on the tv set!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Barnes \"ceebee\""}, {"rating": 2.0, "review": "Have both the roku 3 and chromecast.  Gotta say roku is light years ahead of chromecast.  I can't pause shows when I stream shows via chromecast + hulu.  Not even if I open the hulu app on iPad, Nexus, or PC to try and pause it there.  Good luck timing your bathroom breaks.  The device is too dumb to be useful.", "verified": true, "helpfulness": "0/1", "author": "Edih"}, {"rating": 5.0, "review": "Much better streaming than vizio apps. I did find that it does not suppott 3d streaming.  Would love amazon support.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 2.0, "review": "Was very excited, but because of the way college dorm networks are set up, it won't function in any capacity in a college dorm network.  Looked for workarounds, found nothing.", "verified": false, "helpfulness": "0/0", "author": "Dylanger"}, {"rating": 2.0, "review": "This item did send the picture to my TV but there was no sound on either of my Macbook Pro's.  Sent the items back, Amazon was very helpful in arranging the return.", "verified": true, "helpfulness": "0/0", "author": "D. Hardy"}]