[{"rating": 5.0, "review": "My husband is over the moon because now he can catch up on all those episodes of Game of Thrones that he missed on HBO Go", "verified": true, "helpfulness": "0/0", "author": "LINDA MERICA"}, {"rating": 5.0, "review": "It's sleek, sexy, and well-crafted, from the packaging to the product. The box it comes in is very cleanly designed. Open it up and it has accommodated every convenience you can think of. Performance and setup wise, the Chromecast is super simple and streamline. It also streams a majority of streaming web services without additional installations. My primary beef is how easy it overheats, but that's to be expected if you use it continuously for hours.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 3.0, "review": "The wireless connection on this could be better. I have used this to chromecast my chrome browser to my tv so I can watch videos through Google Chrome on my laptop. It skips a lot so I have gone back to just connecting my laptop to my tv via HDMI.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 5.0, "review": "This is a great device and it gets better with Google opening up the API to regular developers to build more apps for it.  Using Youtube and streaming NAS mounted from my android device is my main use.", "verified": true, "helpfulness": "0/0", "author": "r k"}, {"rating": 5.0, "review": "bye bye HDMI cable and hello wirless , even if ur tv is not smart tv no worries with this little majic device it will be just hookup this one in ur tv which does not have either explorer or wifi and that little device will take care of the rest ., cast from ur phone ,laptop .tablet .best technology", "verified": true, "helpfulness": "0/0", "author": "ahmed shirza"}, {"rating": 5.0, "review": "Brought it with the netflix deal and it was a game changer. The connectivity is flawless for the app enabled devices. However when chrome is mirrored, there is some amount of buffering. A fantastic device to enjoy viewing programs on the big screen. One great deal is when chrome cast is selected, it switches on the TV through the AV receiver its connected to. This helps the user not to select the HDMI channel everytime  the TV is switched on.", "verified": true, "helpfulness": "0/0", "author": "Arien"}, {"rating": 4.0, "review": "4 stars because app selection is still limited to only a few. But everyone should buy one and speed up the pressure on cable companies to reconsider business model.", "verified": true, "helpfulness": "0/0", "author": "Kiumane Kiumane"}, {"rating": 1.0, "review": "Transformer failed to power up after 3 months. Google web and phone offers no help or warranty. Cheap price for a cheap product. Google's stated non support may reflect the large number of failures.", "verified": true, "helpfulness": "0/0", "author": "Wallace"}, {"rating": 5.0, "review": "I love my Chromecast, I have bought at least three of them now.  words cannot express how happy I am with them.  I can take them anywhere as long as there is wifi and I can watch my GoT, Walking Dead, etc on the big screen.", "verified": true, "helpfulness": "0/0", "author": "jesse"}, {"rating": 5.0, "review": "Works as well as Apple TV, just not as quickly when using cell phone application.  Would recommend to all anyway.", "verified": true, "helpfulness": "0/0", "author": "Robert"}]