[{"rating": 2.0, "review": "Only worked the first time I used it. Was perfect. Everytime since, refuses to connect, is slow, blurred images and pauses every three minutes to load. Don't recommend. Not worth the money. Help center is a joke.", "verified": true, "helpfulness": "0/0", "author": "Sara Dober"}, {"rating": 5.0, "review": "Yes", "verified": false, "helpfulness": "0/0", "author": "DefJoe"}, {"rating": 4.0, "review": "It works the majority of the time when casting from my Moto X 1st gen. Sometimes the apps timeout and stop working and I'm taken to the Chromecast back drop screen but hey, it's only $35.00. No Google account is needed to use this device which is good because occasionally my friends stream content from their iPhones. I must say though that one major problem that I have always had with the Chromecast is that every time I try to cast my Samsung Galaxy Tab Pro 8.4 's screen through the Chromecast app my device freezes and automatically reboots. There's not much else that needs to be said about this small TV dongle that hasn't already been said. You plug it into your HD television HDMI port, connect to your home's Wi-Fi network, and TADA! Your stale, old \"dumb\" TV suddenly becomes this magical device that lets you stream YouTube, Google Play content, and other marvelous web goodies with ease, a solid purchase in my opinion. :-)", "verified": true, "helpfulness": "0/0", "author": "Jovany Arredondo"}, {"rating": 5.0, "review": "Great streaming device!", "verified": true, "helpfulness": "0/0", "author": "C. Larson \"Trust in Jesus Alone\""}, {"rating": 5.0, "review": "great deal", "verified": true, "helpfulness": "0/0", "author": "Jarod"}, {"rating": 5.0, "review": "Chrome cast is the way to go..small does not take up room and you can basically cast just about any show...Instead of paying the satellite or cable companies a monthly DVR fee, you can just cast the show from your phone anytime you want...We pay for basic satellite service for our hdtv and  then cast the shows from our phones to tv if we happen to miss it when broadcast.. Save a lot of $$$", "verified": true, "helpfulness": "0/0", "author": "bagladykatie"}, {"rating": 5.0, "review": "Does exactly as it says and my husband loved it. Has turned into a gift that the whole family uses. Have used using Ipad, mini ipad and iphone. Looking forward to giving these out as gifts.", "verified": true, "helpfulness": "0/0", "author": "Kathy Noriega"}, {"rating": 4.0, "review": "good I like it", "verified": true, "helpfulness": "0/1", "author": "yang"}, {"rating": 3.0, "review": "It's ok.  The controls are buggy using the Netflix app.  I use it for a spare TV in the basement, for my living room I much prefer the Roku - the thing this does best for me is stream Google Play music, my very extensive library is hosted on there and this is very good for that.", "verified": true, "helpfulness": "0/0", "author": "C. Waycott"}, {"rating": 5.0, "review": "Gave to my son in law for Christmas because it's exactly what he asked for so he didn't have to get out of bed to change the channel.  He is very happy.", "verified": true, "helpfulness": "0/0", "author": "Tammylee H. Pacheco"}]