[{"rating": 5.0, "review": "nice it works well with the premium version of all cast i can stream from  my gallery videos and pictures and watch my personal movies as well as those online", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "It casts. Chrome stuff.  And many apps.  Works great. My kids think it's really funny when they hijack it with their iphones/ipads though.  Needs a \"kid blocker\" built in.  :)", "verified": true, "helpfulness": "0/0", "author": "TrailRunnerGuy"}, {"rating": 5.0, "review": "Great product.  Installation is very straight forward and works flawlessly (as described).  I had used other types of WiDi Devices but this one is much easier to use. Highly recommend the product.", "verified": true, "helpfulness": "0/0", "author": "MrIceMan"}, {"rating": 5.0, "review": "I bought this tonight and it's truly changed my life. Who needs cable when you can stream anything you want to your TV through your internet connection?Not to mention unlimited porn to your big screen. :) :) :)I may need to quit my job, gym membership, and dump my girlfriend to make room for the new love my of my life. CHROMECAST!", "verified": false, "helpfulness": "4/4", "author": "zman1975"}, {"rating": 4.0, "review": "Great product but doesn't work on college campuses.  Make sure to check whether it works before ordering it for your dorm!  Chromecast doesn't work on networks the same way Roku does.", "verified": true, "helpfulness": "0/0", "author": "Victoria Mount"}, {"rating": 4.0, "review": "A bit geeky to setup and learn to use, but very useful and fun. Can't beat it for the price.If you try to stream HD video from a Chrome web browser running on a PC, it will take a quad core CPU and fast video card to do it.", "verified": true, "helpfulness": "0/0", "author": "hwm"}, {"rating": 5.0, "review": "I love my item. very fast delivery. Thanks ++++", "verified": true, "helpfulness": "0/0", "author": "MEHUL SHAH"}, {"rating": 5.0, "review": "Works great and simple to Use.", "verified": true, "helpfulness": "0/0", "author": "rajareddy"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Kenneth Moore"}, {"rating": 5.0, "review": "It was as well as i wanted ,good working and it is much more useful for me", "verified": true, "helpfulness": "0/0", "author": "saleksalek"}]