[{"rating": 3.0, "review": "Definitely makes a good initial impression.  It is a \"cool\" product, is cheap and is easy to setup.  However, software is unnecessarily restrictive for using Netflix in Canada (many discussion online about this ... be warned comrade Canadians!), and there is still no support of PLEX.", "verified": true, "helpfulness": "0/0", "author": "Technocynic"}, {"rating": 3.0, "review": "Although the Chromecast does everything it is supposed to do, personally I think a set top box with a dedicated remote is a better solution than using an Android phone, tablet or iPod to control the device.  Picture quality is excellent, network set-up was not terribly complicated, and the form factor is certainly attractive.  Be aware, however, that if your television does not have a USB port available to power the Chromecast you will have to use an AC adapter to do so.  Early press on the Chromecast indicated it was powered by the HDMI port, but this is not true; it requires an additional connection for a power source.", "verified": true, "helpfulness": "0/0", "author": "G. Gariepy"}, {"rating": 4.0, "review": "The Chromecast did meet my expectations! I didn't give this product 5 stars because it has some trouble keeping it's IP-Adress and i have to restart my router.", "verified": true, "helpfulness": "0/0", "author": "Meijerf73"}, {"rating": 4.0, "review": "I am an admitted Google addict, and I bought this in large part because it's a Google product.  But it is actually pretty cool.  Set-up took about five mins., including plugging in the unit (Be aware, it does have a power cable that is not typically shown in the promo shots - it can be powered from a USB outlet on your TV if you have one; and it comes with a power plug adapter if you don't).  The integration with the Android Netflix app is pretty good - I have some quibbles with the structure of the app, but the quality of the streamed picture is quite good.  I was a little less pleased with the quality of the streaming from a Chrome web page - the device worked, but the picture was a bit grainy and choppy.  I'm willing to be that will be fixed in future software updates.  For the moment, I'm primarily using this device to stream Netflix from my Nexus 7 to a TV that doesn't have any other boxes hooked up that provide Netflix. For $35, it was worth it to me to have a super-portable TV dongle I can use with pretty much any flat screen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"veilance\""}, {"rating": 5.0, "review": "Look out cable television, Google is on your heels. This device is great and works flawlessly. I love watching YouTube on the big screen. I don't have Hulu or download Google movies but I  have Netflix which I can activate from my smartphone. Not bad for a $35.00 one time charge.", "verified": true, "helpfulness": "0/0", "author": "hogbyte"}, {"rating": 5.0, "review": "Small & beautiful and big on features.  If you power it independently then it can turn on your TV automatically, including swapping to the right input source (thanks to being compatible with AnyNet+ aka HDMI CEC).  Even the setup was easy.  Compatible with YouTube, Netflix & HuluPlus.  I've now bought multiple Chromecast devices, for every TV I own.  This works just as well with Apple iOS devices (iPad & iPhone) as it does with Android devices.", "verified": true, "helpfulness": "0/0", "author": "Stuart Troy \"Stuart Troy\""}, {"rating": 1.0, "review": "Not great. Won't go to sleep and we use a projector that only automatically turns off with no input. This thing would keep it on 24/7. You get what you pay for.", "verified": true, "helpfulness": "1/2", "author": "Ben Bloomberg"}, {"rating": 5.0, "review": "The device instalation itself is great, literally just plug the power cable and the dongle on your tv and youre set, download the app on your phone or tablet and play videos from youtube or Netflix right away, no complications, you can also stream a chrome Tab right from your laptop to the TV seamlessly, and for the price range, you just can't go wrong with it!", "verified": true, "helpfulness": "0/0", "author": "Andres"}, {"rating": 4.0, "review": "It was updating for like an hour at 0%. I unplugged the USB to power cord for 20 seconds, and it zipped through the update -_-. This is a lot nicer than using my Xbox 360 to watch Netflix though. On the 360, episodes just autoplay, with my Android, I can read descriptions, etc. Also, 1080p > 720p, and no stupid xbox live fee.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I picked one up at a local bestbuy and I love this thing! I'm able to play hulu and netflix on it. Today Google announced HBO Go so I'm excited to try that out. I recommend chromecast to everyone!", "verified": false, "helpfulness": "0/0", "author": "Sherrita Scott"}]