[{"rating": 1.0, "review": "We are returning our chromecast.  We've had it for a month .  We were able to watch 1 and 1/2 movies on it and maybe a TV show.  We spent at least as much time -no, much more time- trying to reset it -turning everything off, including the router one time -hold down the reset bottom for 20 seconds, unplug then re-plug the chromecast into the TV's HDMI port (that's the real reason there's an extender, so that it's physically possibly to reset and unplug the device many, many times.)  Then the chromecast would work with Netflix until we paused it for too long or walked away and did something else for a few hours or tried it again the next day.  Then the \"cast\" button would either disappear or give an error message.  Then we would have to repeat the whole process the next time to get it working for Netflix, which is the whole reason that we got it.  It works intermittently with youtube without being reset every time, although some youtube videos look a little funky on a big screen.I worked with google's volunteer based help chat page.  The told us to turn off the router as well when we reset everything, which my husband figured out on his own.  Otherwise, they weren't much help.  I think the issue might be between my Android tablet and the chromecast, but they don't do \"devices.\"  (Yes, we checked our updates on the tablet.  We also discovered it's in Beta mode for Android.)  The chat page did tell me how to find the customer service number -yes find- for google.  I admit I didn't call because 1) I was very certain they were going to tell me to reset everything again which would only temporarily fix the problem and 2) I was 100% sure I was going to yell at a poor customer service person no matter how hard I tried to stay calm.Not only is it not worth with the money, but I think google actually owes us money for false advertising and our time and frustration.  I'm absolutely shocked at the number of good reviews on Amazon.  Maybe people like idea of the technology and the pretty \"screensaver\" the chromecast puts up when it's almost working.  (I worry that we're going to have a Pavlovian response to images of beautiful sunsets and grassy cliffs by shores now.  \"A sunset picture of the ocean! Google chormecast, google chromecast,\" -ripping hair out\" -\"Agghhhh!!!\"", "verified": true, "helpfulness": "1/2", "author": "CH"}, {"rating": 5.0, "review": "I love chrome cast. it not only saves me from spending a ton of money on cable but it allows me to watch netflix on my tv. The price is also unbeatable!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 4.0, "review": "would be better if there were more compliant applications", "verified": true, "helpfulness": "0/0", "author": "Limberth"}, {"rating": 3.0, "review": "Just a 3 star for me.  The problem with this device is that when casting from a tab in the chrome browser, the playback on your TV will usually skip (especially the audio portion).  If you cast from the sites that are designed for chromecast (like youtube), then it will not skip and plays smoothly.I stream from a variety of sites outside of Netflix, youtube, and was disappointed that there were too many annoying skips/audio distortions when casting from the browser tabs.But for $35 its not a bad deal. If you have a phone, a TV, and do not own a laptop, its very useful.  If you already own a laptop, its probably easier to stick with hooking a VGA from your laptop to TV and doing it that way (no skips that way).", "verified": true, "helpfulness": "0/0", "author": "dominic"}, {"rating": 5.0, "review": "Works as advertised.  Streams my Netflix, YouTube, Play Music. Hope other apps jump on board like NFL Now and others.", "verified": true, "helpfulness": "0/0", "author": "Brian Sheridan"}, {"rating": 5.0, "review": "Love this product.  So easy to set up and install.  I have 2 in my house and use it to watch movies and cruise around youtube.", "verified": true, "helpfulness": "0/0", "author": "Scott Salvatore"}, {"rating": 3.0, "review": "It's okay. I was really excited when I got it, and for the price it's not really a loss, but the novelty wore off pretty quickly. I just bought a Raspberry Pi B+ CanaKit, and it can do infinitely more than the Chromecast (especially with the new Epiphany browser, you can just stream the desktop version of YouTube). Google's Chromecast still does not feel like a complete product; I don't like seeing YouTube playlists full of \"This video is not available on your device\" or \"Not available for your TV\". I feel like I have to fight Google just to get the content I want (particularly locally hosted content), and it constantly has problems with WiFi. Save your money, set up XBMC on a Raspberry Pi, keep your privacy and control, and feel really smart about yourself (it's really easy).", "verified": false, "helpfulness": "0/0", "author": "Lawrence"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Greg B"}, {"rating": 4.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Shoemaker"}, {"rating": 1.0, "review": "can;t get audio, only video.", "verified": true, "helpfulness": "0/0", "author": "Rodolfo J Veinbergs"}]