[{"rating": 4.0, "review": "Very nice, except that in few occasions I hear the youtube audio but the youtube red label screen is shown with no video", "verified": true, "helpfulness": "0/0", "author": "Khalid Safwat"}, {"rating": 3.0, "review": "It's OK you need to have a cell phone or laptop to use it and many movies don't work on a cell phone.", "verified": true, "helpfulness": "0/0", "author": "jemalin"}, {"rating": 5.0, "review": "Just Perfect", "verified": true, "helpfulness": "0/0", "author": "hossein jabbari"}, {"rating": 4.0, "review": "Great product for streaming content off your PC or iPhone. Lacks Air Play so it gets 4 stars from me.", "verified": true, "helpfulness": "0/0", "author": "Smart Buyer \"honest shopper\""}, {"rating": 5.0, "review": "Such a great product.  Very easy to set up.  Was able to get a connection from my Chrome browser from iMac desktop.  Had to use the extender piece that came within the chrome cast package and switch HDMI ports but was able to get everything up and running within 6-7 minutes.  haven't tried it from phone or from tablet as of yet.", "verified": true, "helpfulness": "0/0", "author": "Eric M"}, {"rating": 5.0, "review": "it  work  good", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 2.0, "review": "Worked for a day then stopped working and could not connect to my wifi. So annoying even tried to reset to factory setting but it still did not work. Sending this back right away. Waste of money.", "verified": true, "helpfulness": "0/0", "author": "MLW906"}, {"rating": 3.0, "review": "Google.com", "verified": false, "helpfulness": "0/1", "author": "David"}, {"rating": 1.0, "review": "It never worked. Wasted 3 hrs trying to set it up with my iPad and messing with routers and updates and ended up just packaging it up to return it. Wasted my money and time. Disappointed husband since it was part of his Christmas gift.", "verified": true, "helpfulness": "0/1", "author": "mjay"}, {"rating": 4.0, "review": "Chromecast was a good investment. It's portable. I can take it with me anywhere that has WiFi. I can mirror everything on my phone to the TV. It's nice to watch YouTube on the big screen. It's also nice that I can watch HBO, Starz, Showtime, etc anywhere because U-Verse has Chromecast support and I'm an AT&T; subscriber. Right now I'm streaming Netflix so my nephew can watch shows while I play on my phone. It doesn't interfere. Only reason I didn't give 5 stars is because it can be glitchy at times and that there are many services that aren't supported by Chromecast. But, many are still being added to the list. This is surprising due to Google's release of Android TV. I'm glad they haven't forgotten about Chromecast. Also, I've had a Roku for years. Both have pros and cons. My Roku is the first model, so it wouldn't be fair to do a full comparison. One would need at least a Roku LT being as it is the latest model closest to the Chromecast's price point. And I got $20 credit on the GooglePlay store for buying. All in all, it's a great device at a very reasonable price. I wish I would have a long time ago.", "verified": false, "helpfulness": "0/0", "author": "J.Smitty"}]