[{"rating": 5.0, "review": "Way better than expected.", "verified": true, "helpfulness": "0/0", "author": "Lorna R. Zapata"}, {"rating": 5.0, "review": "My family and I love it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "natasha harrell"}, {"rating": 5.0, "review": "I cannot begin to tell you how much I love Fire TV!  im watching my favorite shows when I want and I cannot believe I waited so long to get this!", "verified": true, "helpfulness": "0/0", "author": "Dana \"Dana Masucci\""}, {"rating": 5.0, "review": "Great Product! My whole family loves it!", "verified": true, "helpfulness": "0/0", "author": "Kevin Davis"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Arlene Quellet"}, {"rating": 5.0, "review": "I've retired half a dozen devices in the house thanks to this little box. Tivos, bluray players, AppleTVs and even the game consoles are gathering dust because of Kindle Fire TV. It even comes with us on vacations.A fantastic product.", "verified": true, "helpfulness": "0/0", "author": "Charles Miller"}, {"rating": 5.0, "review": "We recently \"Cut the cord\" and Amazon Fire TV was our first consideration for internet based entertainment. It has all we the services we subscribe to and houses all our Prime pics, vids, and music as well. Super simple to hook up, operate, and navigate. This serves as a interface for TVs not equipped with smart tv technology. This product works amazingly. Since we were so pleased with the Fire TV, we have ordered Fire Sticks for the subsequent TVs in the other rooms. I would definitely recommend this to anyone. Another home run from Amazon.", "verified": true, "helpfulness": "0/0", "author": "JRP"}, {"rating": 5.0, "review": "Literally a world of wonder in view with a few side-loaded little addons.", "verified": true, "helpfulness": "0/0", "author": "Groundhog Steve"}, {"rating": 5.0, "review": "I think it's a nice tool to have. Works very fast and very reliable", "verified": true, "helpfulness": "0/0", "author": "M. Batista \"AlmaMusical\""}, {"rating": 5.0, "review": "Working wonderful! Might get another one for the house.", "verified": true, "helpfulness": "0/0", "author": "z3r0cx"}]