[{"rating": 5.0, "review": "Great product...easy to use", "verified": true, "helpfulness": "0/0", "author": "FLN8IVE"}, {"rating": 1.0, "review": "I wanted it to work, but it didn't. I had it wirelessly hooked up to my Motorola modem, LG 55\" LED TV and either my Moto G2 phone, Lenovo Yoga 2 10 tablet or my Dell laptop. Results were the same when connected to any of those devices - would not stay connected. Sometimes video would work fine but there was no audio. Most of the time it just froze up. My modem, television and casting device were always within a few feet of each other. I figure that the device itself is probably fine - it just doesn't like my hardware. So, I returned it.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Works just as described,good price...", "verified": true, "helpfulness": "0/0", "author": "Merlins Mirth"}, {"rating": 4.0, "review": "It does what they say in the AD. But I think it might be better if Google will increase the applications to use the Chromecast", "verified": true, "helpfulness": "0/0", "author": "Carlos J. \"carlos jimenez fagioli\""}, {"rating": 4.0, "review": "It's been a pretty decent device. Easy to set up and easy to use. Only complaint is that it's app dependent and quite a few apps don't support it yet.", "verified": true, "helpfulness": "0/0", "author": "PK"}, {"rating": 5.0, "review": "Love this device!", "verified": true, "helpfulness": "0/0", "author": "Oleda"}, {"rating": 5.0, "review": "I now have one on each TV, makes regular tv smart, at a third of the cost, i even added one to one of my smart TVs making it even smarter.", "verified": true, "helpfulness": "0/0", "author": "edzn"}, {"rating": 5.0, "review": "Works amazingly well.. if you're looking for a solution to get streaming into any room, this is the way to go. Essentially converts any TV into a Smart TV. I extensively researched other products like Roku and Apple TV and for the price, you absolutely cannot go wrong buying a Chromecast.I love it, you will too.", "verified": true, "helpfulness": "0/0", "author": "Zack Stacy"}, {"rating": 5.0, "review": "Great! Very useful with chrome plugin.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Chromecast is amazing. I had a Roku Streaming Stick which is better as a living room setup, but the tv I use is near my computer, which is where the Chromecast Excels. Mirroring things from my PC to my TV is so easy. An Unlike an HDMI cable, mirroring does not create issues when I am playing  a game", "verified": true, "helpfulness": "0/0", "author": "Predictor92"}]