[{"rating": 5.0, "review": "Is everything i was expecting =DOnly one thing i didnt like, dont get power from the HDMI plug, everything else its ok", "verified": true, "helpfulness": "0/0", "author": "Po"}, {"rating": 4.0, "review": "This is great tool to quickly show family any videos from youtube (mobile and iPad).  I have not tried to cast from laptop using Chrome browser.  I don't use any other apps but anything requiring VPN will not work.  For example, I could not use Netflex while traveling oversees with VPN. The product is worth the money and liked the fact it powers using USB connected to the television.  When television is off so is the chromecast.  This product is simple to use and setup but just be patient with Google making apps available for use on on Chromecast.", "verified": true, "helpfulness": "0/0", "author": "lily"}, {"rating": 1.0, "review": "Since getting the Chromecast, and finding out it DOES NOT connect up to Chrome on an iPad, we have never used it. Google's advertising is disingenuous at best, as they give the impression that one can connect from Chrome in any way. You can connect from a laptop or desk top computer, even a Mac, but it has to be within 10 feet of the Chromecast to work. Until Google sort this out, this gadget is but a useless appendage on the back of my TV.", "verified": true, "helpfulness": "0/1", "author": "MR JONATHAN C FULLJAMES"}, {"rating": 4.0, "review": "For the price, this device does an excellence job. It's buggy sometimes but there are improvements coming its way, so I will hang in there.", "verified": true, "helpfulness": "0/0", "author": "Han Hong"}, {"rating": 5.0, "review": "One of the best things I have ever bought. Use it all the time for watching aanything on my harddrive. The desktop mirroring can be laggy but usually it only takes a few seconds to fix that", "verified": true, "helpfulness": "0/0", "author": "jack woolf"}, {"rating": 5.0, "review": "This gadget links your PC, tablet or smart phone to your TV. It allows you to control videos which stream from the web to the TV.Understand, first, that this is not a standalone device. It does not come with its own remote. It requires:1) A modern TV with an HDMI port2) Home WI-FI3) A smart device on which to run Google Chrome.To initialize the device, one must use Google Chrome to access a website displayed on the TV screen. The PC (etc.) must be linked to the same WI-FI as the Chromecast device. Then the \"Chromecast\" software must be downloaded.Once running, there is an icon displayed in Google Chrome. By clicking on this icon, anything displayed in Google Chrome is transferred to the TV. It is possible to view Netflix, Youtube, etc., with the advantage that you control it with the PC (etc.). But you can view anything that you can bring up from the web. For example, if there is a great video available on basket weaving, you can display it on your large screen TV.I have used it now with a Windows 7 PC and with my NOOK HD Reader. It makes searching for programs so much easier!", "verified": true, "helpfulness": "0/0", "author": "Curt"}, {"rating": 5.0, "review": "I have this device is freaking awwwwsome, it will sync with your Android Table or Android phone (as long as you have the Chomecast app instaleld). This thing will allow you stream NetFlicks Videos, Hulu Videos, and Amazon Prime, GoHBO and YouTube videos from your tablet. It was a seamless easy install and setup process, im already paying for all three services why not take advantage of what it can offer in terms of streaming. Yes its true the Chomecast does not have a lot of app that with work together but the device is just now starting to grow. Google has done a great job with what this device is suppose to do and I forsee more will be coming for this device such extra feature and more apps it can working. Well Worth BUYING.", "verified": true, "helpfulness": "0/0", "author": "John Mac."}, {"rating": 5.0, "review": "I have a non smart TV in view of my treadmill where I spend a lot of time. I purchased the Chromecast to allow me to view Netflix and YouTube while I am on the treadmill instead of watching whatever happens to be on during that time.I found the setup to be a little tricky, but I figured it out and was done within a half an hour. The picture and sound quality delivered are great and I have not seen any lag or choppiness in the delivery.", "verified": true, "helpfulness": "0/0", "author": "loonyjoe57"}, {"rating": 5.0, "review": "I give it 4 stars for coolness, price and convenience.  I love cheap tech toys like this which simply adds convenience.  Sure before I was able to stream Netflix before via HDMI from Xbox or Laptop but it required a little setup time.  I primarily use with my Netflix account, with occasional YouTube viewing and ultimately it delivers very nicely!  Initial setup was pretty straight forward using my Galaxy S4 and TV in front room with Netflix streaming within 5-10minutes.  However I deduct 1 star due to hassle setting up on 2nd TV located in bedroom.  Long story made short it took over 1 hour to figure out how to setup on 2nd TV.  I tried diff cables, factory reset, wall plug, TV USB, etc...  but nothing seemed to work on 2nd TV.  Just sat on \"Setup issues\" screen.  Ultimately rebooting PHONE fixed problem and instructions never mentioned rebooting phone if switching TV's.  I wrongly assumed if setting everything up in front room it would be simply plug&play; on 2nd and target TV in bedroom.  It goes thru entire setup process again when setting up on another TV:(  Once setup in bedroom everything works as advertised, including TV USB for power. No issues at all with picture and sound quality for Netflix!  Youtube seems to be only slightly degraded quality but only if really picky. I won't knock off  star for requiring a Wireless network connection, but I was shocked when I couldn't connect to Chromecast from desktop which only uses a hard-wired network connection.  For semi techies I saw that Chromecast initially creates its own Wifi network and allows devices to connect to it.  I had incorrectly assumed Chromecast would simply connect to my Wifi which would allow me to connect using any device on network, including desktop.  Maybe latter updates will expand functionality but if only wanting to Stream Netflix and YouTube (there are other apps available) this is a wonderful device and a great price!Update -  I'm going to update with 5 stars.  Using Cntrl/O with Laptop allows me to stream videos, movies and pictures to Chromecast.  Wasn't aware of this option during 1st week of use.  This has added so much more!", "verified": true, "helpfulness": "0/0", "author": "KingMDM"}, {"rating": 4.0, "review": "I bought this mainly to watch youtube when I am eating lunch at home and when I have people over and we are just hanging out. I do also like to stream things from my computer and this does not work for that, WAY too much buffering and the video can't keep up with the audio. I know it's not the router because I can stream from my computer to my phone through ES File Explorer and it plays fine. These are small video files too. 20 min episode and it's only 80Mb so there should be no problem. STILL WAITING FOR AMAZON INSTANT VIDEO SUPPORT", "verified": true, "helpfulness": "0/0", "author": "C Fox"}]