[{"rating": 5.0, "review": "3-14-14.  I was skeptical ordering this but for $35 bucks, I went ahead and took a chance.  I plugged it in and after it updated and synced with my Galaxy S4 (about 5 mins) I was watching Netflix videos on my TV.  So far I really like this product.  If it breaks or gives me problems, I will update this review.", "verified": true, "helpfulness": "0/0", "author": "Clinton Porter"}, {"rating": 5.0, "review": "This is handy dandy, works with Netflix, Hulu plus, you tube and more, Amazon Prime is not compatible as yet, but you can cast from a tab, which is way less quality but will do.", "verified": true, "helpfulness": "0/0", "author": "Lynette Catt"}, {"rating": 5.0, "review": "Google has done it again. I have always been a big fan of their products, and this one doesn't disappoint. The Chromecast is super simple to use, and I'm excited to see what the future has in store for this product. Unfortunately for m now, it's still fairly new, so a lot of app developers haven't incorporated ways to use it yet, but I'm sure it will only get better with time. I use it for Netflix and Plex mostly, and occasionally Pandora. I haven't had any glitches or issues with it yet. I recommend it to anyone. You won't find another streaming device this good for this cheap.", "verified": true, "helpfulness": "0/0", "author": "Austin Michael Smith"}, {"rating": 2.0, "review": "This device is inexpensive, and the idea is good, but it has difficulty connecting, and really serves no purpose.  All of my devices are connected on my home network, and I can easily view, play, etc. from any PC, computer, tablet, tv in my home.  Each of these devices already allow me great flexibility on my home network, so I can't figure out why I bought this.", "verified": true, "helpfulness": "0/2", "author": "Kurt"}, {"rating": 5.0, "review": "Useful and affordable. Perfect to transfer youtube from i pad, i phone or a lap top to the tv screen.", "verified": true, "helpfulness": "0/0", "author": "Mariyan I. Hristov \"M.Christoff\""}, {"rating": 5.0, "review": "Very pleased with product.  I am enjoying having it.  I would recommend this to others that are looking for one as well.  Great price ~", "verified": true, "helpfulness": "0/0", "author": "TJ"}, {"rating": 5.0, "review": "Works awesome with my tablet. I haven't had any difficulties. Well worth the money. I have recommended it to friends.", "verified": true, "helpfulness": "0/0", "author": "sophie0214"}, {"rating": 5.0, "review": "We bought this for the TV in the rec room, and it is fantastic.  It just plugs in, and was no trouble finding the wireless router and made a connection.  The kids figured out how to control it with their phones and tablets and love using it to watch Netflix and Youtube.", "verified": true, "helpfulness": "0/0", "author": "RAS"}, {"rating": 5.0, "review": "Literally took me 8 minutes to install and update and I was streaming utube and Netflix from my phone.  Only have one issue and it's not with Chromecast but my media player on my Samsung Galaxy S4 is WatchOn and they have yet to add the Chromecast to their streaming media device list..  A little better market integration would help.  Also, although the Chromecast usage is free most of the cool stuff you may want to stream is subscription or PPV.", "verified": true, "helpfulness": "0/0", "author": "MarkH"}, {"rating": 5.0, "review": "It is so awesome (and easy) to watch HD quality videos from my computer to my tv.  I was considering Apple TV, or Roku.  I'm glad I chose this little gadget.  Really happy.", "verified": true, "helpfulness": "0/0", "author": "Vader \"Sith Lord\""}]