[{"rating": 3.0, "review": "I just got mine last week. The setup for iPhone and iPad was flawless but my Windows notebook suffered and it still doesn't quite work. I started with Internet Explorer open to their setup page as instructed and then somehow the process got the Chrome Browser involved and that's when I probably messed it up. It may be half installed in IE and half in Chrome. The downside is that it only has YouTube and Netflix at the moment. I suppose that can increase over time and I'll up the rating as more apps arrive but only having these two is pretty useless since every TV or DVD Player or Roku-AppleTV-like device on the market will do more. I was also under the impression that this device would allow me to mirror my device screen on my TV but it doesn't (yet). It also requires that a device (smartphone, tablet, Laptop) be present to act like a smart remote control. I suppose that eliminating a standard remote control for basic lean-back operation was a sacrifice to achieve this low price point.", "verified": true, "helpfulness": "0/0", "author": "Scott Chou \"Scott\""}, {"rating": 5.0, "review": "I bought this after my Xbox 360 broke on me and its been one of the best purchases I've made. I really like how small and compact it is!!! The only thing that needs improving is the rewind and pause response. Other than that its an excellent product.", "verified": true, "helpfulness": "0/0", "author": "Mannie"}, {"rating": 2.0, "review": "So here's the deal. I have a first generation Google TV (Sony made BD player running Android), so I have been used to the google tv \"ecosystem\" for a while. I was hoping that the Chromecast would bring improvements in the way that my computer could interact with the google tv, but alas, I was VERY disappointed.Rather than embracing the idea of open source access as with Android devices, Google has locked the Chromecast down tighter than a young man's ass in federal prison. You cannot stream anything other than what Google has allowed. Amazon prime streaming is NOT included in the short list of options.If the developers wake up and realize that they have made a mistake with locking down access, and open the device up, I would give this a better review. Until then, it's 2 stars.", "verified": false, "helpfulness": "1/1", "author": "PCole"}, {"rating": 4.0, "review": "When I first got this, Google did not have an IOS set-up app in the App Store. I tried setting it using the on-screen instructions and via the Web without any success. I was about to return it, when luckily the app became available. Once I had that, it took a couple of minutes and I was ready to watch Netflix on my TV.I didn't get the free Netflix trial with my order, however, and I ordered it as soon as it was available. My brother ordered his a week after I did and got the free three-months deal.", "verified": true, "helpfulness": "0/0", "author": "M. Alexander"}, {"rating": 1.0, "review": "I would have given it zero stars if i could. It won't connect using a Comcast Modem, Google support is useless. I'd send it back if I could.", "verified": true, "helpfulness": "0/2", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I was hoping I would be able to stream my amazon prime without having to get a cable! Oh well.", "verified": true, "helpfulness": "1/2", "author": "MaryAnn Everly \"Chris\""}, {"rating": 2.0, "review": "The situation I ran into with my purchase of Chromecast is that it is not supported by the samsung chromebook I purchased at the same time. I will be returning the chromecast if I don't find a solution  for  my problem.", "verified": true, "helpfulness": "0/1", "author": "Big Irish"}, {"rating": 2.0, "review": "This is a great concept, at a great price, and when it works, it works very well. Unfortunately, it's capabilities were recently reduced by software changes from Google, and it's not clear if or when it will be able to live up to its potential.I already have media servers on my network, and can play most content on at least one TV, but it's sometimes awkward. I was hoping this would be a simple solution to allow me to play web content and locally stored content easily on any of my TV's--even the \"non-smart\" TV's. So far it's not living up to that.The good:- high quality video (when it works)- low price- flexibility, except where limited by firmware and lack of app supportThe bad:- refuses to play locally stored video content (e.g., my own camera-shot videos, recordings from DVR. Apparently, it was capable of this until late August 2013, when Google reportedly deliberately disabled it via a software upgrade- since flash isn't supported on newer Android devices, \"casting\" most web videos from Android requires a specific app. Only a few apps are now available--YouTube, Netflix among them. Amazon Instant Video doesn't work.- flash videos can be \"cast\" from PC's, but it loads the CPU heavily--requires a fast PC, and even then, my laptop runs hot and noisy while doing it- Google music refuses to cast music stored locally on an Android device, even though it will play it on Android. (??)Long story short, I think at this point most people would be better served by a more \"full featured\" media device, such as a media PC. And those who already have that won't get much more from Chromecast. The price is attractive, and the future could be very promising, but for now I think most people would be better served by a different solution. Maybe apps are in the works to restore the missing / broken functionality, but for now, it does less than half of what I bought it to do.", "verified": true, "helpfulness": "0/1", "author": "wildman"}, {"rating": 1.0, "review": "Good idea but poor execution.  Wouldn't recommend at this time.  I really hope that Google improves this product as I like the idea.", "verified": true, "helpfulness": "1/4", "author": "Brandon Ross Friesen"}, {"rating": 3.0, "review": "Not enough streaming options. I understand that will develop as time progresses with the addition of more and more apps. IMO it will never have as many content options as a Roku due to the Google factor.", "verified": true, "helpfulness": "0/1", "author": "R. Cain"}]