[{"rating": 3.0, "review": "Using your iPhone or table as a remote isn't as easy-peasy as they'd like you to believe. It resembles a thumb-drive but takes a power cable AND the thing runs HOT all the time. Makes me worried to leave it plugged in. Doesn't work with Amazon Prime and only clunky computer-to-chromecast streaming. I would have recommended Ruko but after I upgraded to the Ruko 3 and had to shell out an additional $50 on HDMI and adapter cords, my next try is Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Stephen E Miller"}, {"rating": 5.0, "review": "have 3 in my house", "verified": true, "helpfulness": "1/1", "author": "HPD \"teo\""}, {"rating": 3.0, "review": "Use this to wirelessly Cast to my tv.  it buffers and theres a delay once resuming from laptop to tv.  If you live overseas and try to use Netflix,  you need a VPN.", "verified": true, "helpfulness": "0/0", "author": "Troy OD \"Troy A. Orio-Dettling\""}, {"rating": 5.0, "review": "Perfect, delivery super fast. Item works perfectly.", "verified": true, "helpfulness": "1/1", "author": "Giammario"}, {"rating": 5.0, "review": "Best little gadget to come along in awhile.  Great price too.", "verified": true, "helpfulness": "1/1", "author": "Jeri"}, {"rating": 5.0, "review": "great little device very easy to use hope they keep coming out with more apps to use with it!", "verified": true, "helpfulness": "1/1", "author": "Brandon"}, {"rating": 5.0, "review": "This is an easy way to turn a regular TV into a smart TV.", "verified": true, "helpfulness": "1/1", "author": "A. Brown \"Rumbaldi\""}, {"rating": 1.0, "review": "Would not waste my money on it again. Very limited group of apps are supported. Does not really display my iPad, iPod, iPhone on my TV like I wanted - even though the misleading ads imply that it can - it does NOT! Just one more way to sell extras. I vote no, and it was a pain to setup - not just simple plug-n-play... My TV is smarter and does more than this device.PS - Beware, there are now two versions, one with USB power cord & one with regular AC power cord.", "verified": false, "helpfulness": "1/3", "author": "C. Jack Run \"FeelingBetterNow\""}, {"rating": 5.0, "review": "The company I work for sent these out to all of their employees as a gift and I absolutely love it! I have an apple tv that I purchased over a year ago, I still use it but I love the Chromecast better. It's so easy to use to stream Netflix, Hulu etc. The Chromecast doesn't require a remote, instead you download the app onto your phone or tablet and that becomes the remote for the device! Awesome product, blows apple tv and other similar products out of the water.", "verified": true, "helpfulness": "0/0", "author": "Carlie"}, {"rating": 4.0, "review": "Perfect for the price. This product is on par with any product in it's category. This works easily on any basic home network and will satisfy anyone looking for a way to mirror their devices onto a television. The connection will be only as good as your network connection is normally and for most that means it will almost always work. I recommend!", "verified": true, "helpfulness": "0/0", "author": "Alfred Ward \"Everlastin\""}]