[{"rating": 5.0, "review": "I had been planning to purchase an Apple TV as soon as their next generation was introduced (rumoured to be coming out later this year), but when this Fire TV was announced this week, I decided to go ahead and give this a try.I'm a frequent user of Amazon's Prime Video service, and have been enjoying viewing TV shows and movies on my iPad, and now I have the ability to do that easily on my HDTV as well. My familiarity with Amazon Prime, and my satisfaction with that service, was a major influence in deciding to purchase this Fire TV box. I'm also impressed by the speed - the quad-core processor is a major point in Amazon's promotions of this product - even though I know that responsiveness for me is also greatly influenced by the quality and speed of my internet connection, probably more than the device itself.The device is very easy to set up - simply connect and plug in, and that's about it. Already loaded with my Prime account identification, as was my Kindle when I purchased it. Amazon makes it about as easy as it could be.I like the bluetooth remote - no worries of having the remove within line-of-sight to the Fire TV box or TV. The voice search is nice but for me it will probably be more of a curiosity than something I use frequently. We'll see, though.Not having HBO Go is a minor disadvantage, because with so many other services available I think I can get by. I would expect that eventually this will change, but if it does not then I'm not losing any sleep over it. As you can tell from the comparison chart provided on the product page, none of the choices presently available offer *everything*. The fact that the Apple TV does not offer access to Amazon Instant Video is a much bigger disadvantage to me than HBO - I am a big user of Apple products but I also am a frequent user of Amazon, and it is a frustration that those two ecosystems are not yet completely friendly with each other.A very nice feature is that since it is registered to my Amazon account, it syncs with my iPad, so anything I have on my watchlist or have partially viewed on one device, can be resumed on the other without difficulty.The box is really tiny - tear-down reports already posted on the internet show that it consists of a single circuit board with heat sink. Size is similar to an Apple TV box, slightly thinner, perhaps less stylish since it is a simple square box rather than nicely rounded as is the Apple design.I'm not a big game user so the availability of games and the quality of games is not something I plan to explore. I've noticed that other reviews point out that the storage available for games is limited, so installing games to the Amazon TV may be disappointing to some. Those more interested in game use on this product should check this out more fully before purchasing.You do need to purchase an HDMI cable; the box itself does not include one. That is typical for devices these days and it would not be fair to down-rate the Fire TV for that reason. After all, you might require a shorter or longer cable, or in some cases individuals might not have HDMI capability yet and might use the optical connection to connect to their TV. I purchased the Amazon cable (6.5 ft) that is offered as an option when you order this box - it costs only $5.99 - and four other lengths are offered for those who need a shorter or longer version --> AmazonBasics High-Speed HDMI Cable.it requires an internet connection of course, which can either be Wi-Fi or wired using the Ethernet connection. I used the Wi-Fi connection and it was trouble free to join my home network.The top-rated review for this box calls it a \"game changer\". I don't think that is quite true - I think that this is simply the latest in a series of streaming video boxes, following the Apple TV, Roku and others, and for me I think that it is the best for now. I expect that in just another year or two, there will be better solutions from Apple and others, and probably an updated Amazon Fire TV box as well. That's just the way it goes for electronic products these days.Very satisfied and enjoying using it so far.", "verified": true, "helpfulness": "3/3", "author": "Phil in Mågnoliá \"Phil-i-am\""}, {"rating": 3.0, "review": "If I see HBOGo come on the list for apps I will purchase this device. Looks like a nifty device.", "verified": false, "helpfulness": "1/21", "author": "Paige Cramer"}, {"rating": 5.0, "review": "Get it if you love streaming Amazon, Netflix, or anything else. Also, it's exciting to see the development side for it. Looking forward to making a game for it.", "verified": false, "helpfulness": "2/4", "author": "B Rhodes"}, {"rating": 5.0, "review": "Update 2: I have grown to love the Fire TV over any streaming product that I have.  I have a smart TV, Blue Ray player and a ROKU player.  Of them all, streaming is much faster, and INSTANTLY on the Fire TV if you stream anything from AMAZON.  It's like changing channels on a cable box when you select a different video to watch.  It's that FAST!I hope Amazon does increase the \"apps\" so that I can once and for all, retire (give away)my ROKU box.  I do have several paid apps on my ROKU that the Fire TV doesn't offer.Update:  I have added one star as the \"Amazon Prime\" part of this player is better than any app ROKU or any of my Blue ray players. My biggest complaint with Amazon prime using another streaming method was the way their content was stored; or not stored. When searching for a particular show, you would see all sorts of garbage thrown in and you may see the same show over and over again, as each season was shown as a separate show. I've also notice that today, the number of apps has grown... Still keeping my ROKU as I actually pay for some streams that have yet to make it to the Fire TV.What gets it three is it's speed, look, and gaming.What cost it two stars, and almost three is that fact that it doesn't have the \"Amazon Cloud\" player.  Why???  I'm sure this is a huge oversight with amazon.Also, where are the channels?  I hope they do as ROKU and allow you to add channels that are not listed in the apps list.Don't throw out your ROKU box yet, as most, if not all of your favorites are NOT here.Video does load almost instantly, where it \"loads\" using the ROKU box.  Video quality is, IMHO, hands down better than ROKU.", "verified": true, "helpfulness": "3/7", "author": "Tim  Isenhour \"Timbo\""}, {"rating": 2.0, "review": "Yep.It won't stream stuff from your pc.  Nope.It's not a streamer.  It's not a streamer.  It's not a streamer.Not only THAT, but Amazon's usually exemplary customer support ISN'T in this case.  What a joke.  Canned responses that don't even come CLOSE the subject.VERY disappointing Amazon,  you weren't ready and you wanted my money anyway.You may have it back.", "verified": true, "helpfulness": "4/21", "author": "James B Deatsch"}, {"rating": 5.0, "review": "It took longer to open the box and take components out than it did to set up.  The voice recognition works very well for most things, and quite well for the rest (\"Medici TV\" not recognized, even though they stream this super wonderful service).Love it!", "verified": true, "helpfulness": "3/3", "author": "Margery Pignatelli"}, {"rating": 5.0, "review": "So once I saw the $99 price I immediately compared it to the $99 Apple TV and $99 Roku, and when it comes down to usage, I find that the Amazon Fire is a good device.  It's fast and the UI (user interface/home screen) is easy to navigate.  The thing that took the longest is the initial loading time but once that was done it was good to go.  Also, having it connected to amazon gave the video player a distinct advantage to know what videos i look for and what stuff to show me.  Also, with the 2GB internal processor, it moves faster than my Apple and Roku so I noticed it faster and the main apps I wanted to use were Amazon Video, Netflix, Hulu and WatchESPN.NOW FOR THE KILLER FEATURE, this thing has games and they don't suck.  My kids love minecraft so this was a good device to get for them, but I found myself playing a few of the games on this as well (I purchased the joystick) and this device was able to handle running a game and still move quickly.  So, this device is especially great for my kids.", "verified": true, "helpfulness": "3/4", "author": "J. Caston \"The iChurch Method\""}, {"rating": 2.0, "review": "Just read through the stats and I'm disappointed.A brand new box that doesn't support the AC wireless Wi-Fi.And, it doesn't have any audio out for headphones or for hearing aids which is a huge oversight ... not everyone who would buy this is 20 years old.Also it doesn't do the new UHD 4K video. Which may or may not be ok if your new UHD TV does a good job of upconverting but would be better if it put out UHD compatible video from the get - go.I'll wait for the next version or something else. Looks like a nice unit otherwise.", "verified": false, "helpfulness": "3/30", "author": "Arizona Willie"}, {"rating": 5.0, "review": "i have tried some of the other competitor products and this is by far the best. everything is quick and smooth, beautiful OS.", "verified": false, "helpfulness": "1/6", "author": "Robert Saladee"}, {"rating": 5.0, "review": "I have had one full day with my FireTV...I can say that it is hands down, the best streamer that I've had personal experience with.  I've owned Roku's since the first generation.  I have a Roku 1 (OG), Roku 1 (current gen), and a Roku 3 (current gen).I just purchased an 55\" LED Samsung TV and the apps and function of them was quite clunky/slow.  So I was going to get a Roku 3 to put with the tv...but this came out and I said why not, I'll give is try.  I'm glad I did.  Yes, the device is geared towards Amazon content and getting it is VERY easy.  BUT, it can also access Netflix, Hulu Plus, and my Plex Media.  What I like so much about this device is that it accesses these apps MUCH faster than any Roku I've ever owned.  Clicking through Netflix, Hulu Plus, and Plex is seamless...no stutter like with the Rokus.  And starting the videos are very fast!  Not instant like with Amazon videos, but much faster than my Rokus.I've had experience with AppleTV and I get a chance to use it about once a week at a friend's house.  The interface is slick, but the FireTV performs better (picture and sound) on Netflix and Hulu Plus (I haven't used Plex on AppleTV).  Could be the network, but he supposedly has faster tier service from Comcast (which we both have).I'm glad I took the chance and bought the FireTV.", "verified": true, "helpfulness": "16/18", "author": "EvansDJ82"}]