[{"rating": 5.0, "review": "Anyone over 70 or younger will truly believe this black box delivers!  Amazing in its simplicity to hook up wirelessly.Easy to use, and still exploring - love the voice thing. So much more than I could have ever believed! Buy one todayand see what I mean. Threw Comcast all out the window. Affordable device: a new way of viewing on demand. Love it!~nancy, colorado", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"nancy vorkink machin\""}, {"rating": 5.0, "review": "Awesome system. It's affordable, offers many viewing options, and just rocks. I can't wait to see what apps come out over the next few months. At only $99, you can't lose buying this unit.", "verified": true, "helpfulness": "0/0", "author": "A. Brantley"}, {"rating": 2.0, "review": "This should never have been released without voice search support for NetFlix and HuluPlus.Also, the reverse side of the remove should have included a small qwerty keyboard.Also needs shortcut on home screen to go to installed applications.", "verified": true, "helpfulness": "1/2", "author": "Kevin Chodrow"}, {"rating": 4.0, "review": "Well its been over a month now and I can say that I really like this device. The Apple TV is used strictly for streaming my Itunes library and the occasional IPad stream. The Fire is fast and the HD is outstanding. I could care less for the voice recognition but when we have used it it is working as intended.With the update of Amazon music library I would really like to see more options. At this point I have to scroll through my library in a inefficient way to get to what I want. I am still waiting for the Prime update to sift through what is Prime free and what is not. There is room for advancement no doubt which is why I gave it four out of five stars. With more enhanced improvements I see no reason to use anything else. We don't subscribe to cable and could care less for pay per view. We stream Hulu Plus and Netflix, our music, and free Prime programming. Its a win/win and did I mention this device is blazing fast? it literally kills our Apple TV.Fix the things people have been asking for like above and you'll get five stars from me Amazon.", "verified": true, "helpfulness": "0/0", "author": "E. Oskanian \"sonicbrewz\""}, {"rating": 2.0, "review": "not thrilled with it. the voice option is super touchy and more often than not, we end up using the slower search where you have to type letter by letter.  It also doesnt offer Vudu which the Roku does.  We've gone back to the Roku which was less expensive to begin with and gives us many more 'channels' than Amazon Fire. Our Amazon Fire now sits in the unused electronics box and its not even completely paid for yet.", "verified": true, "helpfulness": "1/1", "author": "Sue M."}, {"rating": 5.0, "review": "Works as advertised.It was easy to hook up and get started.I have watched several movies and old tv shows on Amazon prime most have been very good quality.I have also watched several on youtube.I am very pleased with the Amazon fire tv.There are some good videos on youtube about the Amazon fire tv.If you buy one remember to order a hdmi cable to hook it up to your HD tv.This unit only works on a HD TV.", "verified": true, "helpfulness": "0/0", "author": "L James"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "claudeomiro freitas"}, {"rating": 5.0, "review": "it's a must in our house", "verified": true, "helpfulness": "0/0", "author": "Dan Carr"}, {"rating": 4.0, "review": "Like very much. Waiting for improvements.", "verified": true, "helpfulness": "0/0", "author": "Jerry Buck"}, {"rating": 5.0, "review": "The Amazon Fire TV is as advertised. It is a simple to use streaming media player with simple setup and easy to use remote. I would recommend using a Ethernet cable to connect it to your router/modem instead of going wirelessly however, as this allows unlimited speed for streaming instead of having it capped at 1.5 MB/s, which is not enough for some of the services like Hulu Plus. You will find a stutter effect if you do not, or a low quality picture.Other than that small hiccup, the Fire TV does as it says, works well, and the emerging lineup of apps available will only grow with time. Give it a chance if you are looking for an alternative to the Apple TV. I did, and I am pleased with the results.", "verified": true, "helpfulness": "0/0", "author": "DrLitebur \"drlitebur\""}]