[{"rating": 3.0, "review": "not as good as i thought it woud be, some times hard to navigate thru the screen on and off kind of hard to do", "verified": true, "helpfulness": "0/0", "author": "read on"}, {"rating": 5.0, "review": "This is so easy to use, works so well that I just bought amazon stock. This combined with prime could turn amazon from a growth play to a big money maker...buy this you will love it....amazon prime on your tv. Well worth the price. So much available at no charge yet also makes add on shows an easy buy....love this, love amazon...", "verified": true, "helpfulness": "0/0", "author": "PattiE \"PattiE\""}, {"rating": 5.0, "review": "Prior to purchasing, I read all of the reviews, even the ones on other sites comparing it to the Roku and Chromecast. I have neither so I can't really speak the comparison. I do have a 2014 Sony Bravia Smart TV and a Samsung blueray player, both with wireless online features that perform the same tasks (My Samsung does not do Amazon Prime though). Comparatively speaking, there is no comparison. The Amazon Fire is light years faster, and better laid out and organized. I do not have HBO GO, so much of the uncertainty whether Amazon will pick that up or not isn't a game breaker for me. Though, I would like to be current with Game of Thrones. Either way, it ticks all the boxes for me personally.I also purchased the game controller. I am not a gamer, and I have yet to try it out, but since I do not own a game console (why would I buy Amazon Fire if I did?), I thought it would be a inexpensive investment to have at least some type of games when my girlfriend's kid comes over. There are lights on the front, so I believe it handles up to 4 controllers. Based on the specs, it appears that the tiny little box may be capable of handling more than a Sony PS2, so I believe it has the capacity of getting some pretty fun games.Either way, to sum it up. It's a fantastic little piece of tech. Easy to use, very very small learning curve, and gets the job done expediently!", "verified": true, "helpfulness": "0/0", "author": "Joshua Kebschull"}, {"rating": 5.0, "review": "I  have also owned an Apple TV for over a year. It seems to me that the Amazon Fire TV is much faster at loading data. actually, I don't have to wait at all. It gives me more options than the Apple like Amazon Prime, etc. I use both of them. One on a TV in basement and one on a TV in family room.", "verified": true, "helpfulness": "0/0", "author": "Bonnie J. Finn"}, {"rating": 5.0, "review": "Would highly recommend this love the voice option. Works the same as roku. But better. You should consider getting this item.", "verified": true, "helpfulness": "0/0", "author": "serena"}, {"rating": 5.0, "review": "I have had many devices over the years to stream content, but this one is by far the best. The only thing I would have Amazon consider is having the voice search span all the apps, other than that I'm extremely happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Jody W Hershbine"}, {"rating": 5.0, "review": "When we purchased Amazon Fire TV device we were replacing an older model Roku.  I have nothing negative to say about the Roku but we are exceptionally pleased with the Fire TV device.  The start-up was easy and seamless with our existing Amazon account.  Adding additional Apps, such as Netflix and Pandora was no problem.  The picture quality has improved dramatically on our television.  The remote is easy to use and the voice command feature works.  This was a pleasant surprise because voice command features on previous devices, such as our PC have not been pleasant experiences.  The Fire TV has exceeded my expectations and I would recommend the product to anyone.  The one thing I would suggest is buying the game controller if you plan to utilize the game apps, as many of the games need the controller to work.  I realize this is an extra expense and I had not planned on buying the controller but after watching my grandson having a blast playing a few games I decided the purchase was worth it to fully utilize the Amazon Fire TV experience.  We should be receiving our game controller today.  I do not write reviews often but I felt this device deserved a positive recommendation.  I am in no way a tech savvy person, so I thoroughly appreciated the easy \"plug it in\" AND it works experience.  We have had it for over a week and have not found any difficulties or glitches.  Over all a great purchase.", "verified": true, "helpfulness": "0/0", "author": "R. Brook"}, {"rating": 5.0, "review": "We have had our Amazon Fire TV for several weeks now andjust love the simplicity of downloading our favorite TV showsand movies.  Installs quickly so you can start watching almostimmediately!", "verified": true, "helpfulness": "0/0", "author": "50Grey"}, {"rating": 3.0, "review": "Super fast but lacks a good interactive format and access to the extensive sites offered by Roku.  I am hoping upgrades will follow and make the interface easier to use.", "verified": true, "helpfulness": "0/0", "author": "kumasan \"kumasan\""}, {"rating": 3.0, "review": "Can't search across content providers, which limits the value of the technology. Overall interface is glitzy, but low density -- not sure it's the best trade off. Like the overall speed of the device.", "verified": true, "helpfulness": "0/0", "author": "J. E. Hopkins"}]