[{"rating": 5.0, "review": "it dont get any better than this, cast your stuff, enjoy not having to pay for tv, get one of these and watch virtually  anything on an hdmi enabled tv.i am going to buy 3 more,", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 2.0, "review": "This worked really well the first time I used it.  After I turned it off and restarted it, it struggled to keep connection with my home wireless.  I using a standard modem and wireless router that was provided by my cable company.  When the device was connected to my wireless, it ate up bandwidth.  Not overly satisfied.", "verified": true, "helpfulness": "0/0", "author": "gigantacus"}, {"rating": 5.0, "review": "It still provides a limited number of apps, but, it's amazing for the price... and fantastic for the apps it DOES use. My favorite is using it with the PLEX Media server to stream ALL of the videos from my computer to my phone/tablet... and then cast it to ANY HDMI tv!! Awesome! It also quickly casts YouTube and NetFlix. I'll be thrilled when Amazon Video gets in on it!!", "verified": true, "helpfulness": "0/0", "author": "HaileSelassie"}, {"rating": 5.0, "review": "Not being tech savvy.  This is SO easy to hook up. Very clear walk through guide. Just have to join free online and bam! put it in your USB port.  RECOMMENDED!", "verified": true, "helpfulness": "0/0", "author": "Toni M. Gengenbach"}, {"rating": 1.0, "review": "Bought this when AMAZON.com dropped price from $35 to $32 one day for a brief time. I currently own and use several ROKU units and 1 APPLE TV (current generations of each media player). I was intrigued and wanted to see what all the hype was about. When it arrived I installed the unit on a new 40 inch TV.The unit booted up immediately and the screen said to log onto GOOGLE.com/CHROMECAST/SETUP. The display showed the number for my Chromecast unit.This cannot be done. First you must download and install the Google CHROME browser for either your MS-DOS or OS X operating system. OK minor hurtle but deceptive. Then you must link that to both your WiFi network and your device that you will use as your streaming source. Not necessarily easy to do either. It is certainly not plug and play if you not currently using Chrome.Bottom line: For a few bucks more, get a ROKU or APPLE TV ... easier to install ... more viewing choices ..and you are not saddled with a browser you may not want. (Better yet: read a book and/or write a real letter on paper and mail it!)Google is beginning to remind me of Bill Gates/MS in the 1980's when they clearly wanted to take over the entire PC environment. I installed and used successfully every MS-DOS alternative to avoid MS. Each of them was more stable and user-friendly than Gates & CO.Remember we are always better off with free choice and not a monopoly.", "verified": true, "helpfulness": "1/1", "author": "TX Vaquero Riding the Gas Range"}, {"rating": 5.0, "review": "Needed something quick and easy for a bedroom TV to watch House of Cards. This was super easy to set up, super portable, and everyone who has been over promptly orders one while they're still here!", "verified": true, "helpfulness": "0/0", "author": "J. Winter"}, {"rating": 4.0, "review": "If someone complains about this device and their local pictures, they didn't read the specifications of the device.The setup process was really fast, I only had one problem with Netflix after the update, I did a reset by pressing the button on the Chromecast for 10 seconds, I had to do the set up again and ready to cast.I hope there will be more apps for this little thing since I'm using it more than my apple TV (my apple TV starts buffering all the time on Netflix at 2:40).", "verified": true, "helpfulness": "0/0", "author": "Jonathan Bucaro"}, {"rating": 5.0, "review": "i like how easy it is to use all around just a great buy I WOULD RECOMEND THIS ITEM, OH YEAH!!", "verified": true, "helpfulness": "0/0", "author": "juan rodriguez"}, {"rating": 3.0, "review": "...just buy the apple TV. It is worth the $$ for all the functionality and ease of use.Chromecast's functionality is very limited, even for $30.", "verified": true, "helpfulness": "0/0", "author": "DS"}, {"rating": 4.0, "review": "Easy to install. But am disappointed in the apps available for it.  However, apps will continue to be added in the future.  Chech here for available apps before you buy: [...].", "verified": true, "helpfulness": "0/0", "author": "dky"}]