[{"rating": 4.0, "review": "I've been using this device with my iPhone 4S (iOS 7) for a month.  Once you install the chromecast app it's as easy to use as native AirPlay on the Apple ecosystem.  However, only a few apps are supported and the videos will take longer to appear on your TV.  This is a delay you will notice only when your video streaming starts.I decided to use Chromecast as the streaming solution for a secondary TV.  At $35 is certainly a bargain.  Hope the Google guys soon add additional apps and make some performance improvements.", "verified": true, "helpfulness": "0/0", "author": "FSTB"}, {"rating": 4.0, "review": "Pros:Great device, easy to setup, easier still to use, delivers great image, great bang for the buck, potential to use many of these devices across the house without breaking the bank and last but not least: brand new Plex support!Cons:Few supported sources at the moment, although with the quick adoption rate of this device, the low price tag and the capacity of the device, it is fair to assume that the situation will change quickly over the next year or two.", "verified": true, "helpfulness": "0/0", "author": "Sébastien Quirion"}, {"rating": 5.0, "review": "This makes looking at any program enjoyable on a larger screen. works like it says can take from one tv to another", "verified": true, "helpfulness": "0/0", "author": "Barbara D."}, {"rating": 1.0, "review": "Other than the flimsy connector, I resented the need to switch browsers......I don't like being manipulated by Google, so I sent it back.", "verified": true, "helpfulness": "1/4", "author": "Thunderturkey"}, {"rating": 5.0, "review": "I live in Ecuador, southamerica, and once i purchase the chromecast i read a review where it said it only worked in US, anyway i decided to give it a try. Once my GC arrived, i connected it to my tv (Panasonic Viera 32\") and synched it with my Samsung Galaxy S3 mini, it installed the latest update for chromecast, recognized inmediately my internet signal, and boom i was watching you tube videos from my cellphone. I couldnt be more happy with this device, its small, portable and runs smooth every app. For 35 dollars i think it is a good investment!", "verified": true, "helpfulness": "0/0", "author": "cristhian terranova"}, {"rating": 5.0, "review": "I love this device.  I can stream videos from my laptop or my phone without a cable now.  Much more convenient.  Strongly recommend this to anyone who streams a lot of video.  The picture quality is great and it is very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Sandra Belanger"}, {"rating": 2.0, "review": "I bought this to hoping to watch AMAZON PRIME instant video- it will NOT.Another drawback- if you use your phone as a mobile hotspot to connect the device then your wireless is automatically turned off on your phone which means you cant use the apps that support the chromecast unless there is another device connected to your hotspot to control the chormecast- pointless...", "verified": true, "helpfulness": "0/0", "author": "Cooker"}, {"rating": 5.0, "review": "Easy to set up. Took about 3 minutes and I was streaming Netflix. Looking forward to getting my Ultra Violet movies with vudu or Target Ticket. So great that all I need is my iphone which I always have. So easy to use.", "verified": true, "helpfulness": "0/0", "author": "LA Jay"}, {"rating": 4.0, "review": "Products works great...just a bit overpriced. Found more at Best Buys for a lower price. Looking forward to dropping my overpriced satellite.", "verified": true, "helpfulness": "0/0", "author": "Stefan Haladej"}, {"rating": 5.0, "review": "Product does exactly what it is supposed to do and does it in great fashion!! Great present for loved ones. Love it!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Borikua Guerrero \"Borikua Guerrero\""}]