[{"rating": 4.0, "review": "Everything on this device is awesome, i have 0 complaints, for what it's advertise. My only one recommendation and that it should let you stream any content, not only their own supported apps.", "verified": true, "helpfulness": "0/0", "author": "o2jr"}, {"rating": 1.0, "review": "This was not easy to set up and when you call tech support they were not very helpful. I still haven't been able to set it up.", "verified": true, "helpfulness": "0/1", "author": "Cindia Quintana"}, {"rating": 3.0, "review": "I was very curious about the Chromecast and I think that as a technology, it's very promising. The only problem is that the ecosystem is not yet fully supported. As many have pointed out, Amazon's Prime Instant videos are currently not directly supported. Granted, there are ways to work around, it's not at the easy usability level that's needed for mainstream use.In addition, it would be helpful if there's an easier way to send stored videos to Chromecast using a phone as the controller. For example, use a phone to browse videos and photos stored on a home computer, send the content to Chromecast from the phone and then go about your business on the phone.There are apps out there (some fairly good, such as RealPlayer Cloud, that can send videos that's local to the phone to Chromecast), some easy things like displaying photos on the phone via Chromecast should be built in. You will need to purchase an app similar to Avia in order to do that.Overall, for the price, it's great. It's very likely that Google is not making much money on the sales of the hardware, since the cost to build it is probably close to the $35 retail price. They of course benefit by others using Youtube and Android and other activities on Chromecast, so the few bucks per unit is probably not that big a deal for them.Once there's a more wider support for this, and this becomes mainstream, I think this will be a much better product. But if you are not a techie, move along, there's nothing to see here.", "verified": true, "helpfulness": "0/0", "author": "SkyGlass"}, {"rating": 4.0, "review": "Ok, this is awesome, and as soon as you are not limited to what you can use your device to send to your HD TV, it will  be the best thing since sliced bread!  We love it, but you will need to plug the device in via USB or wall plug, which they don't really show you on the commercials for this, but not a huge deal.", "verified": true, "helpfulness": "0/0", "author": "Chris A. Garcia \"Papapherf\""}, {"rating": 5.0, "review": "Great product for the price. I am not concerned at all for the limited apps available since I am casting only through my laptop. As per local videos on my computer, as long as they are mp4 all I do is drag and drop to google chrome and cast it and there, I can watch it on the TV. If you don't want to spend your money to upgrade to a smart TV, this is the product for you.", "verified": true, "helpfulness": "0/0", "author": "Jose Zamora"}, {"rating": 1.0, "review": "I gave it a single star because I got this thinking it would work with my phone.turns out u gotta have wifi too.", "verified": true, "helpfulness": "0/3", "author": "rocky arvizu"}, {"rating": 5.0, "review": "Great Item!!! Thank you very much!! It was perfect for my television, great quality!! I really appreciate it. Thank you!!!", "verified": true, "helpfulness": "0/0", "author": "Dong Hyun Chun"}, {"rating": 5.0, "review": "This works so well, we have lots of sitting rooms in our house so this works like a charm:)", "verified": true, "helpfulness": "0/0", "author": "Timothy Torres"}, {"rating": 5.0, "review": "Google Chromecast is an inexpensive electronic gadget that every house with a computer should have.  We tried various Apple connect devices to stream from an apple computer thru our TV.  This works seamlessly from an iphone, Apply computer, galaxy phone, virtually any device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Im sure that if this product would have worked correctly it would have been a very cool and interesting thing to have in my home but it not matter what internet source i used my computer or phone could not connect to it. Im not sure if it was this specific device or if all of the chrome casts are like this but i would not recommend getting this.", "verified": true, "helpfulness": "0/0", "author": "Jake Ball"}]