[{"rating": 4.0, "review": "One of the amazing things i every buy it!  Just simply plug to your HDMI port and ready!I SYNC my chromecaste with my iPhone and Notebook and works perfects, just the fact in notebook is a little more slow, but anyway.The reason for i bought to is the posibility to watch my videos stored on my notebook and i use PLEX Stream. works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Chromecasts. It makes my 4 year old TVs smarter! I can stream my digital collection of movies over the network, YouTube, Netflix, all from my laptop, phone tablet, desktop. It's incredible the uses I've found for this. It also takes the download and encoding load off my laptop and phone so the batteries aren't hardly touched with streaming. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Katano"}, {"rating": 5.0, "review": "Great product. Works exactly as advertised. Nice packaging, VERY easy instructions, no hiccups and everything works very nicely. Very well worth the money!", "verified": false, "helpfulness": "0/0", "author": "B Lee Kruegs"}, {"rating": 1.0, "review": "This is a worthless product!  Installation is a problem (it took me several hours to get it to work, since on initial startup it immediately launched an update program that hung up and required multiple restarts), the \"chromecasting\" either wouldn't start at all, would hang, or would work intermittently, THEN hang up and require restarting [always from the beginning of the program], and of course it won't work with certain types of hardware and software (on the latter score, Windows XP isn't supported).  The idea is pretty good (use your large TV screen to view internet-streamed content), but with the development of integrated systems, probably won't be useful for very long), but the implementation is very buggy.  I wouldn't recommend it unless you have particular interest or ability in modifying and debugging to make it work.", "verified": true, "helpfulness": "0/0", "author": "R. Moore"}, {"rating": 4.0, "review": "Just got this one today and the first thing I noticed,  the instructions manual book was missing from the box. :( not the end of the world,  but still,  just can't see why it wouldn't be included just like with any other cromecast package you buy directly from Google.Works fine so far, was easy to install. Get 4 ☆s for incomplete packaging.", "verified": true, "helpfulness": "0/0", "author": "Olga"}, {"rating": 1.0, "review": "Same as google tv why do they have 2 products", "verified": true, "helpfulness": "0/2", "author": "VARUN"}, {"rating": 5.0, "review": "Are you kidding me???  This is the best money I've spent in a long long time!  There are some times where I think the marketing people should be wildly overpaid because they hyped a product so much that was so great - in this case, the product was so great that hasn't been given the hype it deserves!Netflix and youtube from any phone instantly - without any issue.  I don't want to hear any whining from anyone who isn't tech savvy or who isn't motivated enough to learn how it works.  Yes you have to have a netflix account and be all set on youtube.It is easy to set up - 5 minutes or less!!  Get chromecast app for your phone and then the netflix and youtube apps.  I'm sure I will add more apps to it later.  Also, I think that you will enjoy youtube and netflix more than you ever did!!Life is good!We highly recommend Google Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 4.0, "review": "Installation was a little unclear on whether it was installed or not.  First cast was without audio (Not a repeating problem). Still no \"cast\" button on Chrome android browser (and cannot find the \"enable\" button within Android).  Shutting the phone down does not stop Pandora from carrying on all night.", "verified": true, "helpfulness": "0/0", "author": "J W F"}, {"rating": 1.0, "review": "This was my second one. I spent hours configuring things in my home network and couldn't get a reliable picture. I'm an IT Pro so I know my way around this stuff. I'll wait until this stuff gets more reliable before I buy another one.", "verified": true, "helpfulness": "0/2", "author": "jmmap"}, {"rating": 5.0, "review": "Pairing this device with a Chromebook were literally the best purchases I made this year.I don't know how I used media before this.Stupid easy to setup and use and it will dramatically improve the way you interface media/web with your Television.", "verified": true, "helpfulness": "0/0", "author": "Corbs"}]