[{"rating": 5.0, "review": "it serves so many purposes", "verified": true, "helpfulness": "0/0", "author": "Crystal Laurie"}, {"rating": 3.0, "review": "I barely use this...I probably would rather have a Roku so that you've got a remote.  It's a bit of a pain to have to use your phone or computer.  It does work good and is easy to install and use but it just doesn't seem like that great of a product.", "verified": true, "helpfulness": "0/0", "author": "William Hendrick"}, {"rating": 5.0, "review": "I've bought several Chromecasts (one for myself, my parents, and a friend) and have been very pleased with it so far. If you are looking for an inexpensive way to stream to your television, this is the way to go. If you can operate a smartphone then you shouldn't have any problem using the Chromecast.The set-up is easy to follow and goes smoothly. It did give me an error message at the end of the set-up procedure saying that it couldn't connect but when I tried to stream something, it worked fine.The range on the device is good. I can get about 25 feet away or so and still be able to start streaming. It's also nice that once the streaming has begun, it doesn't matter what you do with the smartphone or iPad (or whatever you used to start it). For instance, if I begin streaming a show from netflix, I could leave the house with my smartphone and it wouldn't stop the show from streaming.Additionally, if you use one of Google's chromebooks, you can download the chromecast extension and stream pretty much anything you can find on the internet. It's great for presentations and slideshows.Overall, I have been very pleased with it and for the price, it is unbeatable.", "verified": true, "helpfulness": "0/0", "author": "Philip Stanley"}, {"rating": 4.0, "review": "I love it!  It's the next best thing if you don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Carmen Rosa"}, {"rating": 4.0, "review": "Excellent  Brand New.", "verified": true, "helpfulness": "0/0", "author": "Lavonne Dixon \"Lavonne Dixon\""}, {"rating": 5.0, "review": "We love it. So convenient to watch things from the iPad.", "verified": true, "helpfulness": "0/0", "author": "Melanie Gregory"}, {"rating": 3.0, "review": "It wasn't what I expected there are limited programming the picture  was clear and sound was suppurb", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I've been using the Chromecast for the good part of this year and have found it quite useful, so much so that we've considered canceling our cable. The setup for us has been straightforward (I just followed the instructions) and we can use the device on any floor or room in our house without issue.The biggest revelation that I found about the Chromecast was that it is most ably controlled by an iPad. Computers work for us, iPhones rarely do, but iPads have been very reliable.My take on the different supported services:YouTube - works well. Very easy to cast any video from the YouTube app or from my desktopNetflix - By far the most reliable movie streaming service. The integration is smooth and the options are vast.Google Play - This streaming service has caused us the most headache. Connectivity is sometimes shotty, which sucks because you pay per movie (rental or buying) through the Google store (and Google of course makes the Chromecast).PlayOn - This has been an outstanding investment. It streams shows from different TV websites (Daily Show, Colbert, @midnight, 24, etc) as well as integrates with Netflix, HBOGo, Hulu Plus. It also allows you to stream your own media files from your desktop computer, which has been a great service. Even though it's a little glitchier than Netflix, PlayOn has made our Chromecast experience significantly betterHBOGo - Works pretty wellHulu Plus - Works okay but will sometimes drop programs midstream and does not enable forwarding to resume viewing from that spot.Aereo - Be glad the supreme court ended this, because their streaming service (at least in Cinci) was very poor.At first I thought that the Chromecast was an extraneous piece of hardware, but now that I understand all of the different streaming options I can't imagine not having one. I'd buy this again.", "verified": false, "helpfulness": "0/0", "author": "Pete O'Brien"}, {"rating": 5.0, "review": "This devise is great, and it helps turn my television to a smart TV.. for the price you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "jayjay"}, {"rating": 5.0, "review": "Works great and makes streaming movies/tv shows and photos a breeze. I also have an Apple TV and find that Chromecast is not only cheaper, but the interface and streaming to it works much much better. I would highly recommend and you cant beat the price for what you are getting, I am excited to see what other apps down the road will adapt to being Chromecast capable.", "verified": true, "helpfulness": "0/0", "author": "Dan Howarth"}]