[{"rating": 1.0, "review": "Did not work.", "verified": true, "helpfulness": "0/3", "author": "zmane \"zmane\""}, {"rating": 4.0, "review": "Installation was easy.  I'm able to play movies from or thru my Kindle.  Has many functions but I haven't tried all of them yet", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 1.0, "review": "I bought this item with great expectations. I'm using AT&T; internet with 2WIRE router. This device is not connecting to my network. I tried almost all the solutions given in the net, but still could not connect. I asked 2WIRE company and they gave some solution, but still could not connect. I called AT&T;, result the same, Could not get google support yet. So my suggestion, dont buy this item with 2WIRE router.", "verified": true, "helpfulness": "0/1", "author": "VIVEK GOPALAKRISHNAN"}, {"rating": 5.0, "review": "I'm 5 Chromecasts deep and absolutely love these. As someone who cut the cord 6 years ago these have changed my experience with TV. I've used Roku's, Boxee Boxes and WD Live TV devices in the past on my TVs. However, the introduction of a Plex compatible App for Android with Chromecast makes all the other boxes unnecessary. Furthermore, I've wall mounted TVs in places I couldn't with the other devices and have zero problems using my Chromecast on these TVs.This is a game changing device and a must own. One of the TVs I was wall mounting came with a Roku Streaming Stick and when it asked me for my credit card I took the stick and tossed it in favor of a Chromecast. It's really a great device.", "verified": true, "helpfulness": "0/0", "author": "handichapped"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "OMAR"}, {"rating": 5.0, "review": "Awesome product at a great price everyone should own this!  So easy to use and set up", "verified": true, "helpfulness": "0/0", "author": "Cliff Diamond"}, {"rating": 5.0, "review": "Damn you google! Why you make such good stuff.", "verified": true, "helpfulness": "0/0", "author": "The King of No-Pants"}, {"rating": 5.0, "review": "Did away with all my adapters to watch videos on my TV from my PC, it works like a charm you can watch any video from chrome by casting the tab. Just make sure your video is mp4 so chorme will play it on the browser.", "verified": true, "helpfulness": "0/0", "author": "Edwin S."}, {"rating": 3.0, "review": "Good but needs more apps", "verified": true, "helpfulness": "0/0", "author": "Diggy 38"}, {"rating": 5.0, "review": "Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Edson Valentin"}]