[{"rating": 4.0, "review": "had some troubles with the streaming from netflix. chrome browser streams well and youtube streams well. chrome browser streams well and youtube streams well.", "verified": true, "helpfulness": "0/0", "author": "MSUMaverick"}, {"rating": 5.0, "review": "Easy to set up and use, works best with Netflix. You can use your computer or smartphone to adjust volume, pause and restart a movie.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is the easiest method to watch shows from Netfix on a big screen.  Never have problems with streaming anymore. It was easy to install too. Great!", "verified": true, "helpfulness": "0/0", "author": "Beth Whittington"}, {"rating": 5.0, "review": "Worth every penny this chromecast is an amazing little device and I just hope that later on its able to do more", "verified": true, "helpfulness": "0/0", "author": "jose cazares"}, {"rating": 5.0, "review": "It was easy to install.  Works great on Netflix.  I haven't tried it on other applications yet but I expect the same performance", "verified": true, "helpfulness": "0/0", "author": "Emily S."}, {"rating": 5.0, "review": "Worked great!  Could even stream things in a way that I didn't think possible.  I did have one problem where my older mac couldn't use the interface, but a quick upgrade to the latest IOS, and I was off to the races.  For the price point, nothing really comes close to this in terms of ease of use and reliability.  Still lacking some features like playing videos of media you own from other devices in your house, but for all things online, this is the device you have been looking for.", "verified": true, "helpfulness": "0/0", "author": "Christopher Willis"}, {"rating": 5.0, "review": "I use this in Hotels when I travel and it's great.  I can get full HD/Big screen movies and TV where ever I am.Setup was a bit tricky the first time but mostly had to do with the need to connect the source device (tablet) with the Chromecast on the same wifi network.  Once both devices are there, no problems.For the cost, size and function this device can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We bought this so the kids could watch shows on the big screen TV.  We watch a lot of educational shows like Magic Schoolbus from Netflix and shows from PBSkids.org.  The Chromecast works flawlessly with Netflix and Youtube.  My only wish is that it would work automatically with Hulu.  You hear that Hulu?  Oh well, it works with the Chrome browser which means you can watch anything.Our TV has HDMI inputs and a USB port, so I've been using the USB port to power the Chromecast.  The only downside to that setup is you have to wait a few seconds for the Chromecast to boot up and connect to your wireless when you turn your TV on.  If you're impatient it comes with a DC wall adapter so you can leave it powered on all the time, even when your TV is off.", "verified": true, "helpfulness": "0/0", "author": "Jacob Chancery"}, {"rating": 3.0, "review": "I bought this product since my Roku didn't offer YouTube channel. The experience wasn't bad . The setup was easy and the wifi speed was fast. But it should be along with phones or laptops as the product name implies. I expect a lot of improvements.", "verified": true, "helpfulness": "0/0", "author": "an eye opener"}, {"rating": 5.0, "review": "This is a great product. It works very well , very easy to set up . For the price , it definitely worth it", "verified": true, "helpfulness": "0/0", "author": "Yoldie Louisaire"}]