[{"rating": 4.0, "review": "Works well and does a lot for only $35. This device is easy to set up and functions well, you get a lot of very cool functionality and features for a reasonable price.", "verified": true, "helpfulness": "0/0", "author": "siegelspal"}, {"rating": 5.0, "review": "So I bought this thinking \"It's $35 what's the big deal, I won't buy lunch a couple days this week if it's junk.\"  Well, it isn't junk.  In fact I've had NetFlix, Hulu and Amazon Prime subscriptions for a while and really didn't watch that much since it's only usable when I'm at the computer.  Since getting this I have cancelled my Cable subscription and just watch movies and shows off the internet.  Don't be concerned by people saying the only way to get your money's worth is by using \"hacks\" or 3rd party software with it.  Most of those are scams.  Use it as is without modification and it's great!", "verified": true, "helpfulness": "2/3", "author": "Sean in Denver..."}, {"rating": 3.0, "review": "OK this is an UPDATE to my earlier review. I upped the stars to 3 stars, because at least some of the issue is on our end.  I contacted our cable provider, to say I was having issues, and they must have upped the flow on our street, because now I can watch on this pretty reliably during the week, during the day. I still can't get it reliably at night or on weekends, when everyone else in the neighborhood is home and online, which is why I can't give it more stars.I can see that it is our cable flow that is partly at issue, but since I can watch Netflix without a hitch, anytime, that puts some of the fault at the device, as well.I don't pretend to know the nuances of why Roku works like a charm, but this doesn't, with the same signal strength, but I can't give it more stars than 3 as it stands. I do love being able to watch my shows at my convenience, on my big screen TV, but I have the luxury of being able to watch during the day, when others are at work. If you're getting this for night time viewing, know you may not be pleased with the result. My husband won't even consider it.---------------------------------------------------------------------Original review:I soooo wanted this to work. I LOVE the idea of it, and the ease of it, but unfortunately, it just doesn't work very well.Pros:The unit came with everything I needed to hook it up, including the UPC plug and adapter to plug into a wall outlet, as well as an HDMI extender so if you can't fit it directly, this will give you some wiggle room. I was surprised, but I needed it because my TV curves just below the outlet, and wouldn't let the unit plug straight in. Good thinking on their part, and handy for me.Easy interface, and it walked me right through setup very easily.Easy to cast shows to the TV from the computer. Just get the show going on the computer, click the link, and it shows up on the TV a few seconds later. There is a slight delay, but that's to be expected.Cons:I was easily able to cast shows onto the TV, unfortunately they'd  frequently stutter, and only play for a brief time (1 - 20 minutes) before they stalled completely, and lost the connection.  This despite the show playing perfectly on the computer I cast it off from.I didn't have any issue with the few seconds of lag time between the computer and the TV, but it can be annoying when the voices don't quite match up, which I found more often than not.Overall, great idea, and execution, but it sadly just doesn't work. I have Netflix and Roku for doing basically the same thing, but they work like a charm, so I don't believe it's an issue on our end.  We have a strong enough signal, and sufficient bandwidth, so this should work.", "verified": true, "helpfulness": "1/1", "author": "KM \"KM\""}, {"rating": 2.0, "review": "Works great with you tube and netflix. The problem I have is with the Hulu plus app it takes for ever to load and then buffers the whole time. I have a roku also and don't have a problem loading or playing anything on the roku. Spend the extra money and get something that streams better.", "verified": true, "helpfulness": "0/0", "author": "margaret boltja"}, {"rating": 4.0, "review": "Comparing with Apple TV which I have 2 in my house, I found this Chromecast does have its potential.  I will have more to say latter.", "verified": true, "helpfulness": "0/0", "author": "J. Horng \"QQ\""}, {"rating": 1.0, "review": "Trash, please skip this device and buy an Android PC Stick instead. The Chromecast is a very limited Device that only works as a Media streamer. Android PC sticks are PCs running Android.", "verified": true, "helpfulness": "0/1", "author": "Free Tv"}, {"rating": 5.0, "review": "great product!  works well with my old 55\" toshiba lcd tv, which i almost threw out because it wasn't smart-enough!  lol.  requires the power adapter for use, but is not a big deal.  i control the device with my android phone, my roommate switches shows with his iphone app, lots of fun, compatible with both devices.  no buffer issues at ALL with youtube or netflix.  webpage streaming works, ok, with laptop, but better with chrome app for android phone.  streaming webpages with video content a bit slow buffering on laptop.  slow buffer issues playing my content from pc and streaming to chromecast, an A/C router might solve my problem...  all we need now is vudu app control -google!  or make every app chromecast-able?  worth every penny for people with less-than-smart tv's, a must have! (interesting note, chromecast seems to be always running, even when tv is off, maybe downloading updates, idk?  but draws probably the same power as plugging in a cellphone, so not a big deal.)  more than totally satisfied for the last two months!!!", "verified": true, "helpfulness": "0/0", "author": "A. Brooks"}, {"rating": 5.0, "review": "Just opened it and watching a movie and it is perfect I love the Google chromecast and also it is sold at a perfect price", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 2.0, "review": "Near complete fail, whether close or far from my wifi connection. I was so excited for this product, I purchased (pre-ordered) TWO of them. So disappointed... the streaming stalled, stuttered, and generally didn't work at all. I promptly returned both of them. Looking at purchasing a \"smart\" TV instead... seems to me the technology/price point to justify this is good.", "verified": true, "helpfulness": "0/0", "author": "An Amazon Customer"}, {"rating": 4.0, "review": "Absolutely love this product. Only reason I gave it 4/5 stars is because I was unable to set it up at my mom's house when I was at home for the holidays, that was disappointing.", "verified": true, "helpfulness": "0/0", "author": "Natalie Sutter"}]