[{"rating": 4.0, "review": "I'm using it with an Airport Express and everything just worked automatically.  Youtube, Netflix, Amazon, etc. Tried it with an iPhone, iPad, MacBook Pro.", "verified": true, "helpfulness": "0/0", "author": "Jharrod LaFon"}, {"rating": 5.0, "review": "Bought it last week, took me about 10 minutes to hook it up (it connected immediately to my iPad, iPhone, and my Windows & iOS laptops)This is a real game-changer in many respects.  For starters, it can turn almost any TV (those with HDMI ports) into \"smart TVs\" that can now be networked at home or office.  You can watch YouTube video, Netflix, and other content right from your smartphone.  It's not perfect (yet) - Google still has to get the iPad/iPhone/iPod integration 100% complete - but that shouldn't be long in coming.The kicker for me is the Chrome browser plug-in.  With that installed, it basically allows you to share & view any browser-based content as well.  Looking forward to more features as the product matures.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Meola"}, {"rating": 5.0, "review": "I started using YouTube for more than just dog and cat videos. There is a ton of good content on there now--including high quality video podcasts and great comedy shows.  So i've been using their subscription/channels features. Anyway, chromecast lets me watch all of this on my living room tv with brain-dead ease. I already have many ways to get netflix on my TV--but I still prefer using chromecast. It's just so much easier to browse on my phone, find what I want, and cast to my TV.Yeah, tab mirroring still needs some work--but it's not bad on my network.  There is a small lag, but my audio syncs pretty well. I'm glad to know its in beta... hopefully improvements come soon.  For $35, this is definitely a 5 star product.", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 5.0, "review": "The Chromecast does everything I felt was lacking in a Roku player or a smart blu ray player.  It is really easy to use and install the software; it takes less than ten minutes.  When was the last time you installed an electronic device in less than 10 min and had it streaming content to your tv?  The Chromecast gets its power from a USB port on your tv.  The two tvs we have bought in the past 5 years have both had one, so this was super convenient for us.  If you don't have a USB port on your tv, you can plug it into an outlet.  I'm not sure why some people are annoyed by this, it has to have power folks.  Great product at a great price.  If this were an apple branded product I'm sure it would cost at least 3x as much.", "verified": true, "helpfulness": "0/0", "author": "TW"}, {"rating": 4.0, "review": "I bought this the day it came out and I love it, it works very well the reason why I gave it a 4 stars is because I can't find the Netflix code anywhere,can anyone help with this?", "verified": true, "helpfulness": "0/1", "author": "Fernando"}, {"rating": 4.0, "review": "Overall it works great and was easy to set up.  I like broadcasting Chrome from my PC to my TV.  My only gripe is that the output is a little delayed.", "verified": false, "helpfulness": "0/0", "author": "A. Goldie"}, {"rating": 3.0, "review": "At $35.00 this thing is hard to beat.  Does it work? Yes, but maybe not the way most people would like.  This will not replace your Roku or Apple TV but is still a great product.It being in beta and with so little support for apps (right now) I can't give it anymore than 3 stars.  But in no way should that dissuade you from trying it out.  At this price point go for it, you will not be disappointed.I am very happy with this product and can't wait to see what develops.[...][...]", "verified": false, "helpfulness": "1/4", "author": "M. Hamilton"}, {"rating": 5.0, "review": "So I've been using my Chromecast for about a day now and I've already gotten plenty of use out of it. The setup was simple, you go to a website and link it and name it and you're pretty much set. After that you can move it to any tv in the house and use it without a hassle. I've used both my Nexus 4 and my ipad to cast to it and it all worked pretty well. With my ipad I cast a few shows from Netflix and a few episodes of the new talk show \"the Real\" from YouTube. It worked beautifully.one small annoyance was that once I was streaming to the chromecast in YouTube once I clicked a video it didn't play immediately I had to hit the play button to initiate it. This was only a small annoyance however.I then moved the chromecast to my bedroom and with my Nexus 4 I rented a movie from the Google Play store and cast that. The integration is seamless and the hd quality was great. There were a few times when the movie had to rebuffed but it only caused maybe a 3 sec delay and only happened twice. That however was probably more due to my network speeds. I haven't tried chrome tab casting yet but once I do I'll update with my impressions.The chromecast comes in a neat little box with the device, a USB cable, USB ac adapter, and an hdmi adapter for those whose TVs do not have enough space to stick a dongle. The chromecast needs to be powered via USB in order to function so you must have an available USB port on your tv or you must use the provided ac adapter to plug into a wall socket.All in all, great device for the price. I'm going to order two more for the other rooms in my house. This will be especially useful for my 3 yr old sons room who often ask to see his favorite shows on Netflix. In the past I've had to get up and play Netflix through the Xbox or ps3 in the living room for him and then return every time he wanted to see a new show. With chromecast I can play Netflix directly in his room and control it from anywhere in the house. That, my friends, is awesome sauce. Great job Google!", "verified": true, "helpfulness": "1/1", "author": "Amber"}, {"rating": 5.0, "review": "This product works as advertised... I'm able to stream Netflix without a problem - the video and audio are just as clear as when streaming through my bluray.  I haven't had any of the jerkiness or audio problems that other users have reported.  Also streamed Google Play Music without an issue.The main thing for me is - I have a large plasma 1080i TV, and I've tried Roku and Apple TV with no success - they don't display other than 1080p or 720p.  This worked right out of the box.  Set up was easy (used a tablet and then connected with my phone too (Nexus 7/Nexus 4)).  I see reports and rumors of more support - Redbox, HBO Go, Vimeo, etc.  If Amazon Prime video covers it I'll be golden.", "verified": true, "helpfulness": "0/0", "author": "David Pike"}, {"rating": 5.0, "review": "I'm fairly astonished as to how well this works for $35.  Every promise Google made about Chromecast has so far been kept.  Setup was easy, literally 3 steps.  It's actually kind of amusing to see these three steps laid out in a tiny instruction sheet.  Once it's up and running, using a smartphone to beam Netflix or Youtube onto the thing is also fairly simple, though the Chromecast app is useless.  Video and sound quality for these apps are dependent on the overall quality of your network, but I had no complaints here.The big deal is how well Chromecast works streaming an open tab from Chrome.  I tested it out using HBO GO running in Chrome.  Does it work perfectly?  No, it does drop frames and it is noticeable at first.  Still, it's very watchable and the quality is honestly better than I would have expected.  App selection is presently limited, but that was clear going in and Google has made it clear they will add more in the future.Pro: Low price, easy setup, solid overall qualityCon: Limited app selection, room for improvement in tab streaming*UPDATE* 7/31It pains me to say that my Chromecast has stopped functioning properly.  After I switched it between a couple TV's it no longer gives any audio or video signal to the TV other than a brief picture of the startup screen.  I'm somewhat baffled as to why this is the case, I fired off an email to Google support but haven't heard back as of yet.  I'm not optimistic they can really do anything about this.  I've knocked off a couple stars as a result of this event.  I will update again pending the results of this nonsense.*UPDATE* 9/22I ended up returning my Chromecast for a replacement, since they were sold out after the initial release I only just recently got a new one.  The new one works perfectly so I'm changing the score to 4 stars.  Once more services and features are added I'll likely add that final star.*FINAL UPDATE* 12/17I've been nothing but pleased with the Chromecast since September and now that new services are being added I can't justify giving it anything less than 5 stars.  I ended up buying another one for my year-and-a-half-old Sony smart TV just because the Chromecast interface is so much better (no competition there, Sony's UI is laggy and inefficient).  2014 should be a big year for the Chromecast, personally I can't wait for Aereo support!", "verified": true, "helpfulness": "4/5", "author": "Jack"}]