[{"rating": 5.0, "review": "Watch a lot of Netflix and this works a 100 times better than the built-in app on my Bravia TV. Plan on buying another one!", "verified": true, "helpfulness": "0/0", "author": "Sajjad R. Ibrahim"}, {"rating": 4.0, "review": "Looking forward to not having to hook up my PS3 to watching Netflix.  It will be so much better and faster.", "verified": true, "helpfulness": "0/0", "author": "Kelly Jergenson"}, {"rating": 5.0, "review": "It was easy to install and offers me the option of watching YouTube videos on my big screen. I can control it with my cellphone, just as advertised.  I now look forward to more companies streaming their material through chromecast.", "verified": true, "helpfulness": "0/1", "author": "Michael Bausch"}, {"rating": 5.0, "review": "Love this! Wish I had better then a 1.5Mb speed so it wouldn't buffer so much! Stuck with Century Link and they don't upgrade in rural areas.", "verified": true, "helpfulness": "0/1", "author": "robyn o'brien"}, {"rating": 4.0, "review": "I Wish there were more things that could be cast. Netflix and Youtube are good but I want stream podcasts.", "verified": true, "helpfulness": "2/2", "author": "Rebecca Harman"}, {"rating": 5.0, "review": "I have all sorts of things that do what this does.  Sometimes I have a laptop that I plug into my TV via an HDMI cable.  I show photos and videos via Intel WiDi and wireless DLNA depending on the laptop.  I use Netflix and Vudu on my Smart TV.  Occasionally I Youtube through my Playstation 3.  I've even been known to hook up my old Samsung Infuse 4G and play games on it via Bluetooth and a PS3 controller.And yet, I still got this, because it makes it so gosh darn easy to painlessly cast Hulu Plus, Netflix, Youtube, or other media content via Plex Server.  Click on the Chrome Extension, and there it is!  What could be easier?What this really does for you is turn all your laptops, phones, and tablets into user friendly wireless remote controls, all for the cost of a night out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "NEED MORE COMPATIBLE APPS!! Works wonderfully with Netflix, though I don't have Hulu plus, but with your Chrome browser it can stream anything from your laptop screen, however you will sacrifice resolution and may experience signal lag. If you are into Netflix, it works great with my iPad, iphone & Macbook Pro. Would like it to work with HBO GO & Comcast & Time Warner on demand apps. Can't beat the price though.", "verified": true, "helpfulness": "26/32", "author": "Macman"}, {"rating": 3.0, "review": "At this time the only two programs that it supports is You Tube and Netflix. Hulu has just come on board. I thought I could stream the internet from my IPad but couldn't. The Google Chrome browser does not support Chromecast. It is easy to set up. I guess we have to wait for more apps to support Chromecast.", "verified": true, "helpfulness": "19/23", "author": "Albert Weissberg"}, {"rating": 2.0, "review": "I used to run my netflix through my wii which loaded pretty quick. I got this since I read and others told me the HD would be so much better. First is takes sooooo long to load. The unit gets very hot and I would not leave it plugged into my TV when not using. Bottom line I went back to streaming through my old Wii so much better", "verified": true, "helpfulness": "1/1", "author": "doris posner"}, {"rating": 5.0, "review": "If you are into technology, and like to keep up with the newest digital trends, then you will certainly enjoy this product. It has some bad days as the service is still in testing (beta). For 35 bucks, you can't go wrong.", "verified": true, "helpfulness": "0/1", "author": "josh"}]