[{"rating": 4.0, "review": "It's a pretty neat device. Easy to set up. Cool to look at. But right now, it's not much better than Google Chrome. I can use Nextflix and Pandora. A bunch of other apps that just look like aggregate sites (Crackle, etc). The Amazon Prime streaming feature is awesome. And I think the games will be pretty cool once there are more to choose from. At this point I own a Kindle, a Chrome, and the Fire TV. I know it will get better as the user base expands. I wish I would have waited a bit longer to purchase, but other than that, not bad.", "verified": true, "helpfulness": "0/1", "author": "AJ"}, {"rating": 4.0, "review": "I'm a long-time Roku user.  I've got 2 Roku boxes, Chromecast and an Amazon FTV.  I've tried a bunch of others as well.In terms of power and features, Amazon has packed it all in.  But, this is not entirely a good thing.  The FTV is overly complicated and requires a a lot of moving around and clicking to accomplish simple things, especially on the Plex app which Amazon has prominently featured.\\Compared to Chromecast, there is no comparison.  They aren't designed to do the same thing, so I wouldn't even bother trying to comapare them.Compared to AppleTV, Amazon is the clear winner, but that's not saying very much as AppleTV has been the big loser in the set-top game.The Roku3 is still the dominant box, in my opinion.  It does what it does better than anything on the market today.  Why?  Because they kept it simple.  I have yet to find a feature (that I use) on the FTV that isn't simpler, faster or more accessible on the Roku, and there are still too many things (like Simple.TV) that just aren't available for FTV.That being said, this is Amazon's first-stab at it.- The over-complicated UI can be fixed (Roku had to do it a couple of times to get it right too).- The voice-recognition is great... if you like Amazon Prime videos or Hulu.  Get that to work with Plex and you may have something useful!- Get Simple.TV (or another decent network DVR) working with this box.  Plex only goes so far.I'm sticking with it, for now, on the assumption that it will continue to evolve and improve.", "verified": true, "helpfulness": "0/1", "author": "C. Schaffer"}, {"rating": 5.0, "review": "Easy to install and operate. Great to have all the entertainment at my finger tips. I strongly recommend this product.", "verified": true, "helpfulness": "0/1", "author": "Lynn"}, {"rating": 5.0, "review": "Coming from a AppleTV 2 (the black 720p version).  And this thing flies.  Netflix streams load up quite a bit faster, and just general usage is much better.  I have a bunch of local files on a NAS device that I use Plex to stream with, and so far it has worked great.  About to order another one for the other TV upstairs.", "verified": true, "helpfulness": "1/2", "author": "Deanb"}, {"rating": 5.0, "review": "Happy I purchased it!!! Would highly recommend it to all ...good for single people, couples, families & children !! thanks", "verified": true, "helpfulness": "0/1", "author": "Wendi Dorish"}, {"rating": 3.0, "review": "I find it lacking in tv style apps such as CBS and Fox and other network apps I y se my tablet for", "verified": true, "helpfulness": "1/3", "author": "Jeff Vernon"}, {"rating": 2.0, "review": "Not excited about this at all...prime membership gets you very little to see in movies and shows...all other apps just are there so you can either join for monthly fee or pay for movies...", "verified": false, "helpfulness": "2/7", "author": "Mark king"}, {"rating": 5.0, "review": "I absolutely LOVE my new Amazon Fire TV!  Best purchase ever!  The voice search feature is wonderful!  I would highly recommend this to anyone looking for an alternative to cable, satellite, or regular TV.", "verified": true, "helpfulness": "0/1", "author": "Janet M Neville"}, {"rating": 5.0, "review": "I love how easy it was to setup and get going. Also love the fact that you can install apps especially games. Very good experience.", "verified": true, "helpfulness": "0/1", "author": "John D. Baker"}, {"rating": 3.0, "review": "The box, and voice recognition are great-- no complaints with the actual item.  We feel let down by the lack of decent free Amazon Prime options.  It is also difficult to find these free Amazon Prime programs, however, you can search for them on the Amazon's website and save stuff to your watchlist.", "verified": true, "helpfulness": "0/1", "author": "CBL \"Bassist64\""}]