[{"rating": 5.0, "review": "I had a BluRay player that was a few years old but also would allow streaming Amazon, Netflix, and a few others.  The most recent firmware update obviously required more power than the computer chip in the unit could deliver and it was so sluggish it was almost not usable.  I thought about replacing it with a newer BluRay player but then I realized I had other choices since playing discs in this old unit worked just fine.  Since the TV and BluRay were the same manufacturer the remotes were integrated and I got to keep that feature.I looked at the various options (Amazon, Roku, and others).  I also own Apple TV but of course it won't do Amazon.  After looking at the features and reviews I decided on Amazon Fire TV.The user interface is very quick.  I am sure if you have a very bad Internet speed then this would not be as crisp but you probably would not do much streaming either.  It has lots of options to add software and games.  I have not tried much of that yet but navigating the menus is very easy.Setup on my WiFi was easy and it was up and running in only a couple minutes.But the voice search sets Amazon Fire apart from others.  Other brands appear to be gaining and are adding this feature.  It is great to search and not having to type using something like a TV remote and no typewriter keyboard won't be missed.  With Amazon Fire the voice search works very good.  It mostly works with Amazon but I think it is being expanded to other streaming services.I have streamed a few things with zero glitches but it is clear that there is sufficient power in the box to do lots of things.Overall this device is great for streaming and I thought it probably would be the most open and flexible for updates and new software in the future.Recommended.", "verified": true, "helpfulness": "1/1", "author": "Mark Strickland \"Techie Guy\""}, {"rating": 2.0, "review": "I dont like that I cant keep it plugged in or it will keep turning my TV back on after I shut it off, so I have to unplug the fire TV.", "verified": true, "helpfulness": "1/4", "author": "Pam Lachance"}, {"rating": 4.0, "review": "runs great after a little trouble hooking it up to wi-fi", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Stewart"}, {"rating": 5.0, "review": "Love it.  Access to YouTube, Netflix, Hulu, etc. in one easy spot.  Maintains excellent and strong wifi connection.  Fun to use for games too! The voice search works good.  We actually carry the little box, power cord and remote up and down stairs with us, until our Fire Stick comes.  We don't do much news or sports watching, so I am ditching cable after this month!", "verified": true, "helpfulness": "0/0", "author": "A. Horsey"}, {"rating": 5.0, "review": "Great movies, and easy to use", "verified": true, "helpfulness": "0/0", "author": "RALPH"}, {"rating": 5.0, "review": "No words can express the freedom it is to drop a $140 DISH bill to $28 a month with just a Prime, Hulu+ and Netflix subscription. With these 3 you need nothing else! What a budget saver! and it's so small! It literally fit in the palm of my hand! I can't say enough great things about this! Note, on the first day of installation your Hulu+ and Netflix will have trouble buffering. Everything in your watch lists will buffer over night, so after the first night you will not have any more trouble at all. And Prime has no trouble from the start and no commercials either! You also have the option to rent new movies and buy movies and store to the amazon cloud along with music purchases as well. A great yet small and rewarding investment. I'm tickled pink with it!", "verified": true, "helpfulness": "1/1", "author": "nichole shapley"}, {"rating": 5.0, "review": "I think this is the greatest product for what it does ever!  I've used several different devices from 3 different manufacturers and believe me this is the best I've found for myself.  Installation was a snap and it was very well supported.  Prior to this I used an, ------ dong and my computer to do the same job.  I like the Amazon Fire TV much better.  Besides that it even understands Texans!  Great product guys.  Thank you!", "verified": true, "helpfulness": "0/0", "author": "Mike in Texas"}, {"rating": 5.0, "review": "Good but is the form factor need to be so big compared to the Firestick.", "verified": true, "helpfulness": "0/2", "author": "kim ferguson"}, {"rating": 5.0, "review": "it seemed easy enough to hook up and my husband and daughter seem to love it. It was a gift for my husband so he can play games in order Netflix we haven't ordered Netflix yet however we have ordered movies and played games seems to be fine.", "verified": true, "helpfulness": "0/0", "author": "Ria Brillant"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "paris"}]