[{"rating": 5.0, "review": "If my Xfinity wireless internet wasn't so fickle, this option is great, especially because you can use your phone. I use a wired connection if my internet isn't steady.", "verified": true, "helpfulness": "0/0", "author": "Shelly"}, {"rating": 2.0, "review": "I was hoping to stream from my laptop or tablet to the TV that would allow me to have whatever I was streaming to the device be seen on the TV. Unfortunately, Chromecast  forces you to use apps to do so, and then it's only for the same old standbys... Netflix, Hulu Plus...Technically it works fine, however it come up very short on substance. While Chrome tabs is supposed to allow us to see the screen of the tab, I have yet to make it work.Save yourself the $$$ if you have a Roku or a DVD player that connects to the services.", "verified": true, "helpfulness": "0/0", "author": "J. C. Luce \"copprtop99\""}, {"rating": 5.0, "review": "If you are a Netflix/Pandora/HuluPlus user, this product is phenominal. It just works....Period. I ended up buying two, one for my kitchen TV, the other for my family room TV. Controlling it from my phone is fantastic. Can't wait for more apps to provide support.", "verified": true, "helpfulness": "0/0", "author": "HattyMN"}, {"rating": 4.0, "review": "It was pretty cheap product from google and it was working at the end but the installation was painful  and complicated.  For some TV model you need to make changes to the setting in your modem.  At the beginning I envisioned that this product would be easily installed such the one in apple TV, but I was wrong.  For some reasons this device also messed my TV operation once a while, it would shut and turned on my TV numerous time at one time.  Other than that it worked as advertised.", "verified": true, "helpfulness": "0/0", "author": "Edot"}, {"rating": 5.0, "review": "I need to purchase a few more for around the house but the chromecast works great! Now that there are more options coming out, the SDK released I cant wait to see what folks are going to do with it. I mainly use plex on my home media server to stream my shows and movies right to my tv. I ended up selling my Apply TV and Roku and just use my Chromecast now!", "verified": true, "helpfulness": "0/0", "author": "Chad R."}, {"rating": 4.0, "review": "It was harder to install than I thought...had to move my wireless modem closer to the tv as the signal wasn't strong enough. It's not a perfect picture, but it works and is a great , easy, inexpensive alternative", "verified": true, "helpfulness": "0/0", "author": "Queenbee"}, {"rating": 5.0, "review": "Nice to be able to cast my videos and stuff from my PC to the TV.  I would recommend it to everyone", "verified": true, "helpfulness": "0/0", "author": "D. Mallory \"Don\""}, {"rating": 5.0, "review": "Love my Google Chromecast. I love being able to watch Netflix, YouTube, Google movies. It is easy and fun.. in love it!!!!!", "verified": true, "helpfulness": "0/0", "author": "smwhite63"}, {"rating": 3.0, "review": "It's a great size, portable, and serves my needs.  All I would need are more compatable apps to go along with it.", "verified": true, "helpfulness": "0/0", "author": "Doug Barrier"}, {"rating": 5.0, "review": "a really good purchased, it was a gift for my boyfriend and he's enjoying it. now we're seeing everything on tv", "verified": true, "helpfulness": "0/0", "author": "MARIA CRISTINA EC107Q48130N BRITO LOPEZ"}]