[{"rating": 3.0, "review": "This has to be the softest, best feeling remote I've ever held. It's coated in a soft-touch rubber coating but is still extremely light in the hand. I do wish, that for $99, Amazon included an HDMI cable.Functionality is decent, but only really worth it if you dont have a Smart TV or media player already. Hard to compare this to a Chromecast...as the chromecast doesnt require a power cable and is extremely portable, while the Fire TV certainly is not.", "verified": true, "helpfulness": "3/8", "author": "Devin Farmer"}, {"rating": 5.0, "review": "We ditched cable two years ago and live on Netflix and Amazon Prime. The Fire TV is for our second TV. It setup fast, though I was disappointed that it spent five minutes updating initially. The intro was fast, professional and showed the basic features.We currently use a Sony Blu Ray Player for our primary TV. The Fire TV is much faster to key through screens and items. The antenna for the wifi is superior, connecting our upstairs TV to the downstairs wireless router. The Fire TV starts streaming content instantly, no boot up time.We are very happy to add this streaming device to our home.", "verified": true, "helpfulness": "10/10", "author": "Iowa Engineer"}, {"rating": 4.0, "review": "If they just put a little infrared sensor in there somewhere, I would give this 5 stars. It is by far the best plex client I have used on a HDTV, other than the desktop apps.", "verified": true, "helpfulness": "12/12", "author": "Neal Clark"}, {"rating": 1.0, "review": "very buggy... & slow... every game needs downloading and then more downloading and then sometimes fail to load.... poor Amazon experience...", "verified": true, "helpfulness": "7/45", "author": "Gadget Tester \"Gadget Tester\""}, {"rating": 5.0, "review": "The most awesome feature in my opinion is the fact that my prime account came pre-loaded.  I didn't have to sign in.... It already knows who I am!", "verified": true, "helpfulness": "7/9", "author": "Jennifer Anderson"}, {"rating": 4.0, "review": "I got my new Amazon Fire TV today. It's not bad, very similar to the Roku and other streaming devices that allow you to access Nextflix, Amazon, and Hulu (along with all of the other things that nobody uses). I guess the biggest positive is that it allows us to access our Amazon Prime Instant Videos on it.Biggest wishes:1) Kid Mode that controls what's even shown on the screen when enabled. There are parental controls, but that just stops purchases.2) With parental controls enabled to stop app and video purchasing, it makes you put in your pin even for kids shows that are free on prime for us. It makes sense to me that you should be able to set a rating and anything that is free and below that is fair game, no pin needed. Any purchases or higher ratings...pin needed.3) Voice search needs to work on all apps4) The killer app that is needed would be for this to bring together all content that is available. What I mean by this is that I want to search for a movie and have this find it in any of the apps that I have available to me. I don't really care if it's on Netflix, Amazon, Hulu, etc...I just want to watch it.5) HBO2GO is neededThat's all that I have in my quick 1/2 hour setup. I'll update if anything changes.", "verified": true, "helpfulness": "3/3", "author": "RS"}, {"rating": 5.0, "review": "I own an apple TV, vizio TV streaming, and a roku, but decided to try this out as well for some of the new features it offers....better wifi, optical audio out, games, and that neat voice search idea.Overall this thing is great.  As good or better than the other streaming devices out there and add the games (with real controller) and the voice search I think it is definitely a winner.Sleek User Interface and well thought out in general.  If you don't own any streaming device and your not tied down to itunes content this is the one I would start with.In terms of replacing one you already have, I would if you have older versions of them maybe, but at its core fire tv is still just a streaming device like the rest.The one negative is the apps available right now.  No HBO GO and Showtime doesn't allow my TV provider yet.  I suspect it won't be long though that fire tv is offering everything the others do as well.Quite happy with the purchase overall, and may buy another one to replace my roku cause I can't find its controller!", "verified": true, "helpfulness": "5/6", "author": "Adam Jensen"}, {"rating": 3.0, "review": "I really love the voice search, but I hate that it only works for Amazon content.  In fact, even though Netflix is plastered all over the marketing material, it's just a stand alone app that doesn't even come pre-installed.  Press voice search while in netflix, search for \"House of Cards\" and you get Season 1, from Amazon, which costs money, versus Seasons 1 and 2 on Netflix for free.  I guess in retrospect I'd expect this, but it's pretty disappointing that voice search works only for Amazon content.Netflix works just as you'd expect.  Pandora works well.The Amazon content is good, but for some reason HD video skips and stutters, frequently.  With a quad core processor, I'd expect a bit better.  Perhaps future updates will clean this up.I am a Prime subscriber, so I decided to try out the \"Prime\" content and was very surprised to find that everything had a purchase price.  I thought prime was free?  Well I guess you can just stream the content for free, which is not at all clear from the interface, and \"purchase\" the content, which makes no sense on a streaming device.  You are basically being offered the option to purchase the content twice.  Confusing and misleading.There are some good games, but again I found the performance disappointing.  The minions game skipped and stuttered frequently.  I downloaded the Sonic game, only to find, after I'd paid, that I needed a controller, which I don't have.  No refunds apparently either.Not that I enjoy browsing the web on my TV, but I thought that with voice search, it might be convenient to pull up a few web pages.  Unfortunately there is no web browser.I forgot to mention that the parental controls are not terribly useful.  There are two options \"Pin Protect Amazon videao\" which basically just forces you to enter a pin number, via the slow on screen keyboard, every time any video content is played, *no matter what the content\".  There is no \"kid mode\", no content filtering, no content that doesn't need a pin - nope, just an annoying pin requirement every time video plays.  I cannot imagine how anyone would think this was a useful feature.  The second option is \"Pin Protect purchases\", which works, and is less annoying, but it also pin protects free downloads, and again is insensitive to the nature of the content.  I would like my kids to be able to download free apps which are kid friendly.  I would also not like to have to enter a pin for free apps.", "verified": true, "helpfulness": "12/13", "author": "JOSHUA N VANDERBERG"}, {"rating": 5.0, "review": "I received my unit today. Easy to install, easy to use. Add HBO to Go and you couldn't beat it. I also have the Apple TV which I like, but compared to this it will see a loss in market share. Making it cheaper would be the only thing I would have liked. The remote is large enough to be useful, and small enough to not be a nuisance. I like this device better than the Smart TV.Good Job Amazon.", "verified": true, "helpfulness": "12/13", "author": "Leinad"}, {"rating": 5.0, "review": "Do you have to have cable or once i buy the box is everything free on it someone help me out", "verified": false, "helpfulness": "1/5", "author": "jjazz"}]