[{"rating": 4.0, "review": "I tried 2 other casting dongles. The first one didn't work at all. The second one loaded but would buffer way to much for my taste. The Chromecast I messed with for 3 days and was ready to send it back. Up until today I was trying to set it up on a Asus tablet with Android. No luck, over and over trying every combination. I started again this afternoon trying again thinking I missed something. Nope. Nothing.  Then I shut down the tablet and moved to my windows laptop. Started everything up again and cast was like  a different animal. It WAS as easy as they said. I loaded Chrome browser, Chromecast app and Google Cast. I was up and running in 5 minutes. Tried Youtube and RedBull. worked great. I went back to the tablet and low and behold Chromecast is working on the tablet. Perfectly. I found out I couldn't install GoogleCast on an android.  As of today. Hope the app gets released soon.  I love this thing. I gave it 4 stars because the help never mentioned trying start up on a different os if it wasn't easy. Doh!", "verified": true, "helpfulness": "0/0", "author": "IamSmith"}, {"rating": 5.0, "review": "Fantastic product! I use it daily. Could not for anything better to bring so many other devices together. Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "Darryl"}, {"rating": 5.0, "review": "I love being able to use my phone or tablet to browse for shows to watch, but then send them to my tv for actual viewing. Works with Netflix, Hulu, Youtube, Google Play TV and Movies, HBO GO and many more services. But does NOT work with HBO GO if your provider is DirecTV. Greedy DirecTV wants you to have to pay a monthly fee to rent their box for each room in your house.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great price that makes a dumb tv smart. Will not work with amazon instant video unless you cast your laptop desktop and it doesn't use the full screen. Other than that very nice hardware for cheap - I am sure google is amassing all my viewing habits to make it worth their while. Hopefully I won't get a knock at my door from the NSA.", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 3.0, "review": "i really like the chrome cast, but they have not much apps to use with, form the computer you can share with the cast with chrome, even your pics and videos use \"file:///c:/\" to find your files in your pc, but from the phone, no, is not possible, have some people who they create some apps, they show some videos in youtube but google don't give the authorisation to share the apps... for some additional dollars you can buy a better cast.", "verified": true, "helpfulness": "0/0", "author": "eduardo"}, {"rating": 1.0, "review": "Device loses connection too easily, when by a miracle it gets connected, you have to deal with the terrible broadcast speed. Even with a current router that is placed less than 10 feet from the TV connected with chrome cast.Even if it worked as I found out, it only supports a limited number of apps.Useless! Worst $35 bucks even spent!", "verified": false, "helpfulness": "0/1", "author": "Gustavo"}, {"rating": 1.0, "review": "Using a Windows 7 64-bit I7, exceeding required specifications, I am still unable to stream anything using Chromecast.  There are a couple of reasons provided for this issue where one can cast a tab, but audio/video does not play on the TV.The failure is caused by:1) A known issue with AMD switchable graphics chips that causing video freeze (supposedly fixed in Chrome version 32 (which I have - so it is not fixed) or2) The use of native plug-ins, such as Silverlight or Quicktime, which are not supported.If one is using Chrome (required for Chromecast) - why are these two common video plug-ins not supported?  Is there a user-selectable plug-in that is supported?  Google simply states, these aren't supported...period.  Tough.Thanks for buying our product.  Sorry you can't use it as it was described.  Maybe someday you'll be able to.  In the interim, thanks for letting us use your money.To be fair, it should be mentioned that a very limited number of apps like Netflix or YouTube that are Chromecast enabled, do play on the TV via Chromecast.  Where the issue exists is when trying to 'Cast the Tab' using the Chrome extension.  I have been unable to to watch a video from a website using the Chrome browser.", "verified": true, "helpfulness": "1/2", "author": "DerekDean"}, {"rating": 4.0, "review": "Works exactly as I expected. Apps from your android device that are support stream great. The chrome browser streaming is not stellar, but usually works OK.I have two of these, setup on one was easy, the other didn't want to talk on the network. Doing a reset (pressing the button for 30 seconds or so) allowed me to get it talking.", "verified": true, "helpfulness": "0/0", "author": "bwilli2"}, {"rating": 3.0, "review": "I have very fast DSL but still have issues with buffering. Product is ok for the price. I believe that over time it will get better, just not there yet.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 3.0, "review": "I got the chromecast hoping we could watch hulu on it from a browser.  I didn't know that the chromecast merely mirrored my display, I was hoping that it would try to pull the page directly from the web based on what page I sent it.  I tried to watch hulu on it but it was very choppy and since it was constantly pulling from my laptop even when I was on a different tab instead of pulling directly from the site, it wouldn't stay full screen.Also there isn't yet support for the amazon prime app from my iphone, just netflix and youtube.I got it primarily for hulu so I can move my pc hooked up to the tv to another room.", "verified": false, "helpfulness": "0/0", "author": "S. Hellwege \"Shawn WOW\""}]