[{"rating": 5.0, "review": "As untechy a grandma as I am, even I could set this up.  Unfortunatly I have not had much time to view movies I  have wanted to watch. I know when I retire in a few weeks I will have more time HA!!", "verified": true, "helpfulness": "0/0", "author": "Cindy B"}, {"rating": 3.0, "review": "I wanted to use my ipad/samsung touchpad to stream video to my tv. ONLY works with limited apps like youtube big deal. I need it to work with Chrome...but Chrome only works on desktop.Return", "verified": true, "helpfulness": "0/0", "author": "Michael J. Endrizzi \"dreezman\""}, {"rating": 2.0, "review": "I have not tried any other items like this but kinda disappointed in the picture quality. Shaky video and major time lapse in the sound. Connected it to 3 different TV's with same results but I guess for the price I should have expected this", "verified": true, "helpfulness": "1/2", "author": "john coker"}, {"rating": 5.0, "review": "I love the concept of this device so low profile but very powerful, it just needs more developers and apps on board especially for ios.", "verified": true, "helpfulness": "0/0", "author": "Shaun A. Maxson"}, {"rating": 3.0, "review": "Chrome is awesome! The only thing that bummed me out was having to restart the device every other time I wanted to use it. I use it on the same tv every time but sometimes my phone or computer won't find the device.. Forcing me to restart the whole thing and reconnect. Kinda frustrating but it might just be my internet. Not sure", "verified": true, "helpfulness": "0/0", "author": "Stephanie Vidales"}, {"rating": 5.0, "review": "No seriously, love. Works perfectly, I couldn't be happier with the product... Now if only amazon instant had a Chromecast streaming option...", "verified": true, "helpfulness": "0/0", "author": "K. Hogan"}, {"rating": 5.0, "review": "Chromecast is super easy to use and I can use my phone as a remote control. I like how I can use any video viewing app and project it onto the TV. It is also easy to connect it to a network .", "verified": true, "helpfulness": "0/0", "author": "Lisa Finlayson"}, {"rating": 5.0, "review": "I really like the versatility of the Chromecast. I like most of the apps that you can use with it. I really like how you can watch something on your tablet, cast it to the Chromecast and keep watching it and then if you need to leave you can pull it back to your tablet.I got this mostly for utlizing my Plex installation that I have and it has been working great. The biggest annoyance I have with the way the Chromecast works is that when I am watching a show and the kids start running in the room and want to ask me a question I have to fumble for my phone, open up the app and then pause whatever I am watching. I don't have the ability to just pick up the remote and press pause, which would be much faster. This is where a roku actually has a benefit over the Chromecast. With that said I can't stand the UI of the Roku so it is a tradeoff I am willing to make.", "verified": true, "helpfulness": "0/0", "author": "Brandon Meyer"}, {"rating": 5.0, "review": "Google pretty much owns my soul at this point, but I can help buying their amazing products. Setup was super easy with my Nexus 7 Tablet.", "verified": true, "helpfulness": "0/0", "author": "Allen J Pobirs"}, {"rating": 4.0, "review": "Took only a few minutes to install and use and we can watch youtube and Netflix no problems. Nice addition to our TV which does not have native apps. Only wish it could stream more sites like our Dish network, Hulu etc.*edit* they have expanded the list of sites supported see here  [...]", "verified": true, "helpfulness": "0/0", "author": "Son Tran \"ST\""}]