[{"rating": 5.0, "review": "I have owned a Roku 2, Apple TV, and Google chomecast.  I have also owned one smart blue ray, and two smart HDTVs.The 3 star review average of the Fire TV is befuddling.  It's faster than any external streaming unit or any smart tv/blue ray that i have owned.  Noticeably faster. The voice search does work. It is not glitchy. Is it perfect?  No, but neither is Siri or Google Now.  Neither is any piece of hardware or software.If you like games, you will find the inventory to be larger than Roku's.  And Chromecast nor Apple TV has games, at least on the AppTV which admittedly was purchased over a year ago as a gift to my gf.From a content standpoint, the Fire TV only misses out on HBO GO.  I do have HBO, and think ill get by with HBO on demand just fine.  Or I can stream it thru my laptop.I read all of the 1 star reviews, as I am maniacal about reading reviews before I buy something or go to a restaurant. I did not read one 1 star review that actually made sense. Deaf people or people w/ deaf family members are complaining that  It has no CC.  That's odd, too, because when I click my menu button on my remote, up comes the CC on/off option.  And then there are all of the dufuses that just trash it because its missing one little feature that is important to them.  Would you trash an Iphone for not having Android?  If your answer is yes than you are an id(iot). A big one.Not one 1 star review actually reviewed the product.  Not one.  This is a five star product.  The level douchebaggery on this ratings board is substantial.**Update** - My gf played around w/ Fire TV for about five minutes and went on her laptop and ordered one.  She has AppleTV and said the two dont compare.  Her reasons - processing speed, gaming, and voice activation. We wanted to rent the movie \"Outsiders\" and pulled it up in under 3 seconds... thats from when we picked up the controller to when the movie appears on the screen to order.", "verified": true, "helpfulness": "84/100", "author": "Tom Ace \"knower of most\""}, {"rating": 5.0, "review": "When Amazon Fire Tv is going to be sold outside of United States, or buying the box and connecting we can access to the Fire Tv?", "verified": false, "helpfulness": "3/29", "author": "Miguel Genao"}, {"rating": 5.0, "review": "UPDATE:  I added some new info below about X-Ray, Screen mirroring, Music, and more at the bottom under \"Update 3\".------I have been on this streaming device song and dance for a while now, with the Roku, the Apple TV, and the Chromecast. I've had each of them at some point, and I know their weaknesses. This device has done a great thing by waiting to be last. All the problems are fixed. Almost.Installation was very simple and easy. Plug in to TV with HDMI, plug in to power, power on. It hopped on my wireless with no issues, downloaded its own update, installed, and rebooted. It was linked with my account already and was ready to go.The unit starts up with a demo video animation that actually is useful. It helps you learn how to use the remote, which is one of the great advances with this over the competitors. I used voice search several times, and the Mic is in the remote-- seems like a no brainer right? No screaming across the room at the TV. It worked perfectly for every search I did. I even threw it some nonsense searches like \"Apple TV\". No problem.This addresses one of my biggest complaints about how Apple TV and Roku work-- The remotes are very simple so searching through a lot of content either requires the time consuming typing, or you have to consume your smart phone to type it out on a keyboard (while your mom continues to text you and disrupt), or you are clicking front front front, back back back back back back continually until you realize what you want isn't there.  Voice search fixes that.The display and menus are easy to understand and use.  The remote has a few more buttons than the competitors and I think this makes a huge difference. The menu system works very fast-- I can't say this about my current generation 2013 Apple TV. ( I'm sure a new one will come out this year too as it always does). Amazon has really started to come into their own with having their own unique design language-- the appearance of devices, chargers, and interfaces. I will say right off the bat I already like the interface on this better than the Kindle Fire HDX interface. This interface looks like it was designed by Sony-- thin modern text, simple square designs, but refined enough that it does't have that \"Linux\" sort of blocky interface that Roku had for so long.I opted to get the gaming controller, so it came with a free game.  For a $99 device, I was VERY impressed with the visuals of the game and the responsiveness of the controller.  I am not a huge gamer, I do have a PS3, but again I was impressed.-The app offerings were surprisingly full. It does apps! Apple TV doesn't do downloadable apps yet!-The video streaming was seamless.  Never a jitter or a problem.-The outputs are versatile, HDMI, optical audio if you need it, and network can be wifi or ethernet. All bases covered there.The design of the box is very square, very attractive, and quite different than every other offering.  I'll be honest, I like where they went with this design, a lot.I do have a Kindle Fire HDX, and I haven't had a chance to use it while watching an Amazon Prime video, but I will update my review when I have.I did try Netflix, and Amazon Prime Video, and both worked seamlessly.There is a lot to like about this box, and I will update more when I have more experience. If you have any particular questions, don't hesitate to ask and I'll try to respond to you as soon as possible. I have no hesitations to recommend this for anyone interested in video streaming, everyone wanting to stream Amazon video, and anyone not fully embedded with Apple or Google (unless this is your second device), and for any \"first timers\". Don't be scared-- this is a great device to start with.TIP: Look at the grid that Amazon offers comparing this product to the other top competitors. It it the simplest, easiest way to understand which devices do what and support what.  It will answer your questions faster than a lot of paragraphs.Cheers!If you want to check out my review of the game controller that I bought along with the Fire TV, you can see that review here:http://www.amazon.com/review/R1SWDSY79GDS62/ref=cm_cr_dp_title?ie=UTF8&ASIN;=B00DU0ZI8Q&channel;=detail-glance&nodeID;=3213029011&store;=daisy-store(you might have to copy & paste)UPDATE: I added some photos! And I have to be honest-- I was surprised by the 3 star rating. I read through a lot of reviews and there seems to be a lot of hate from other aisles-- people who don't own the device, haven't used it, and simply prefer another product. I think a review should be from someone who has the device, and reviews it on its own merits-- not a hate review.  I figure in some days this will slow down and the real reviews will bubble up.UPDATE 2: I've discovered one negative thing: I have one of the original Plasma 50\" TV's from several years ago. It's 1080i. It just so happens this device does 1080P and 720P. So it's pushing all video to me at 720P. Not ideal! My bedroom TV is a 720P 32\" Sony, so it looks like I'll be moving it there! A small thing that will affect a small number of people... but still unfortunate.UPDATE 3: I had some time today to try out the Fire TV with my Kindle Fire HDX. In some ways its a little magical, in some ways it was a fail.When it comes to choosing a video on the Kindle Fire HDX, then flicking them up to the Fire TV, it was seamless.  The Kindle Fire HDX automatically converted over to X-Ray mode. This was pretty fun and interesting.  When you can use the Kindle Fire as the \"controller\" it can make exploring for video content more fun then throwing it up on the big screen.One feature I find terribly missed, or I am missing is the Amazon Music app, or some way to stream my music from the Kindle Fire HDX to Fire TV.  It seems simply absent. There are music apps available like Pandora, etc. but no way to stream the music I have in my Amazon Cloud Player, or actually loaded on to my Kindle Fire HDX. Strangely missing. If anyone knows more about this, please let me know in the comments.Another odd/missing thing: \"First Episode Free\" feature doesn't work to stream from the Kindle Fire HDX to the Fire TV, and the first episode ISN'T free on Fire TV when locating the same show and episode on Fire TV. I find this pretty annoying. I was ready to commit to a first episode but couldn't do so free on Fire TV.For Screen Mirroring, that was a total fail, and it may be the Kindle Fire HDX's fault. I try to mirror, it tries to pair, fails, then the Fire TV isn't seen as an option anymore for a bit.  I had the same issue when I was trying to mirror to a different type of box supported by Kindle Fire HDX.... I'll have to try this one again later.In the vain of equal opportunity, I also tried the Amazon Video app from my iPhone. It allows Airplay to Apple TV.  In the way that Youtube and Chrome for iOS allow to share video to a Chromecast, I was hoping that the Amazon Video app would allow me to direct the video to the Fire TV.  Not so.  Hopefully all of these issues will get resolved over the coming updates.", "verified": true, "helpfulness": "1/1", "author": "RST_"}, {"rating": 5.0, "review": "I had a WD TV Live Hub. It was slowing down. This device was like upgrading from a i386 to an i7!", "verified": true, "helpfulness": "5/8", "author": "Jonathan Lee Drouillard"}, {"rating": 3.0, "review": "Just received mine. Easy set up, my 11 year old did. Quality and speed is perfect. Pandora, Netflix, Amazon Prime, the same old...But what bothers me is that i wont be able to us their Showtime app as it does not support my Cable provider Comcast....", "verified": true, "helpfulness": "7/27", "author": "Leila"}, {"rating": 4.0, "review": "I love the FireTV.  Very easy setup and is very fast.  Way faster than Roku 2 or 3, and has zero lag.  I rated it 4 stars because they don't have HBO GO --> BOO, Amazon!  I'm almost certain that will be coming soon.  Also 4-Stars for no USB support, YET.  It has a USB, but is not used as of yet.  Would be nice to have the USB be able to be used for storage AND for watching movies that one downloads, and can stream directly to TV through the FireTV, like Roku does currently.Would be even nicer id they had a Media Server software which would run on your computer and be able to stream anything from your computer...I can't wait to see what Amazon will develop for this hardware.  Definitely a game changer in the Media Streaming world.", "verified": true, "helpfulness": "20/25", "author": "NxlKing2304"}, {"rating": 4.0, "review": "If you buying a new toy because you want it to look pretty...Please. No one device has everything so why people bash toys because they dont have specific specs boggles my mind. I bought this unit for 1 reason and it does NOT disappoint. This thing is FAST and it blows my Apple TV ( latest generation) out of the water. It is also faster than my Chromecast. So when it comes to streaming movies the Fire will be my first choice. I could give a hoot about games but if you want your Apple TV to feel like a prehistoric relic buy one and you won't be disappointed. Although I am puzzled that I can't watch Showtime because Xfinity is not one of the providers....That was disappointing", "verified": true, "helpfulness": "16/19", "author": "J. Whitehurst \"Renovatio\""}, {"rating": 1.0, "review": "I am looking for HBOGo and don't see it.  I'll re-consider when they have it. Not worth my money at this time.", "verified": false, "helpfulness": "16/242", "author": "Stephen Skutel"}, {"rating": 5.0, "review": "I've only been using it now for about 25 minutes.  Couldn't be easier to set up.  I didn't even have to log into my Amazon Prime account. It knew me already.  I unplugged my Roku 2 XS and plugged in the FireTV.  It begins streaming a movie faster than the Roku.  The video streaming from Netflix appears to be better quality than when it is streaming through the Roku.  Tomorrow I'll get a optical cable so I can run the sound through my theater sound system.Also wanted to add that the voice search function is very cool.  You press the microphone button on the remote and speak your search requirements and FireTV will find suggestions for you.Now for one disappointment:  I don't think the Amazon Cloud Player is available.  Browsing around on the device doesn't find it and voice search only returned \"Movies by Flixster\" when it searched.  That is one plus that my Roku has over FireTV.", "verified": true, "helpfulness": "24/30", "author": "Cale"}, {"rating": 2.0, "review": "Already own Apple TV and Roku. No HBOGo for one and Showtime Anywhere (which is also on Roku) is useless since they only support certain subscription carriers. So no Xfinity! Lame. So I don't see the point of investing in yet another set top box. I specifically bought the Roku because TiVo premiere doesn't support Prime streaming and at the time Apple apps were blocked from Airplay but that has changed. I will be annoyed if competitors are edged out of prime streaming. I will consider canceling my Prime membership.", "verified": false, "helpfulness": "6/69", "author": "S. Walsh"}]