[{"rating": 2.0, "review": "I only gave it two stars, because sometimes it works spectacularly, though rarely.It's terribly glichy and not the simplest to use. After a while, my phone/tablet/computer will forget it's controlling my chromecast altogether and it's a process to get everything sorted out. Can't pause, fast foward, etc. An actual remote probably would have solved this problem. Worst of all, after only 4 months of infrequent use, I've had to order (beg for) a replacement because it stopped loading any apps whatsoever. Haven't tested the new one enough to know if it's as glitchy.", "verified": true, "helpfulness": "0/0", "author": "Meghann J."}, {"rating": 5.0, "review": "Have been using it for several months with my Android phone and Plasma TV. Simply love it.", "verified": true, "helpfulness": "0/0", "author": "Ramesh Garg \"Lightbay\""}, {"rating": 3.0, "review": "Use daily. Great technology", "verified": true, "helpfulness": "0/0", "author": "alicia healey"}, {"rating": 5.0, "review": "Wonderful product", "verified": true, "helpfulness": "0/0", "author": "Rajiv Kumar Singh"}, {"rating": 3.0, "review": "Just lost the little icons on most of the apps. Must use Chrome browser and extension....very dissapointed that lost this feature.", "verified": true, "helpfulness": "0/0", "author": "William S. Wright \"TreeHugger\""}, {"rating": 5.0, "review": "very happy,  works great", "verified": true, "helpfulness": "0/0", "author": "Lee H. Turner"}, {"rating": 3.0, "review": "It stopped working months ago and I have not been able to get it to work on any tv since. Even tvs it used to work on.  It will say chrome cast on the bottom of the screen and then go to black. The chromecast screen saver or pin never appears. Disappointing.", "verified": true, "helpfulness": "0/0", "author": "Anel Tankovic"}, {"rating": 5.0, "review": "EXCELENT INVENT THE GOOGLE", "verified": true, "helpfulness": "0/0", "author": "juan fernandez"}, {"rating": 5.0, "review": "Much cheaper than AirPlay. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Saint Little Fish"}, {"rating": 1.0, "review": "I have had chrome cast for a little over a year. It worked  so well I'm the beginning but over the past couple of months It has just been a pain. Refuse to stay connected to my tablet or smartphone. I switched to amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "Aleta Nicole Joseph"}]