[{"rating": 5.0, "review": "This is a fabulous piece of technology for a great price. Jump on this deal now, because it is only going to improve. If Google can get a better deal going with Apple the sky is the limit. Even as it stands now the streaming from iPad or iPhone to TV via Netflix or YouTube is pretty great. We have also used this product with my husband' s laptop and it worked great.", "verified": true, "helpfulness": "0/0", "author": "Justus Hunter"}, {"rating": 5.0, "review": "This is a great product. Did not expect much from it but its been a surprise so far. Hope more apps will come for chromcast. Youtube works really well.", "verified": true, "helpfulness": "0/0", "author": "hijigu"}, {"rating": 4.0, "review": "I like it, I don't love it. It currently only has Netflix and Hulu for watching videos. If Amazon Video gets on board, I'll be set.", "verified": true, "helpfulness": "0/0", "author": "Ryan Beauchamp"}, {"rating": 5.0, "review": "Great device and a good price.  Easily set up and couldn't be easier to set up,  I have three off these now.", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 3.0, "review": "I was hoping to use it as I traveled to connect my iPad to the hotel television sets, however I was not able to connect because I could not enter the the passwords nor was I able to use my cell phone as the hotspot for both the iPad and Chromecast at the same time. If  it can be done, instructions to do so would be greatly appreciated.", "verified": true, "helpfulness": "0/0", "author": "Big Poppa"}, {"rating": 5.0, "review": "Works great... Basically turns my TV,s into smart tv's. Bought 3 for the house and use it regularly!  Need to catch up on episodes that you missed. I can stream from my desktop to the tv and watch all past episodes.", "verified": true, "helpfulness": "0/0", "author": "JT Gould \"Where the men are handsome, the woman strong, and the kids are above average!\""}, {"rating": 4.0, "review": "Google Chromecast rocks - when it works.It'll start out broadcasting to my TV and then when I want to see another movie or episode of a show, it will not show anywhere but on my computer screen.Nonetheless, you can't beat the price and it's got no monthly fees!", "verified": true, "helpfulness": "0/0", "author": "SavoyDancer \"@whatsnext\""}, {"rating": 1.0, "review": "This only works for netflix and youtube. It doesn't even work for google play as advertised. If you want a way to convert your tv into a smart tv buy something else.", "verified": true, "helpfulness": "0/0", "author": "keepitreal"}, {"rating": 4.0, "review": "I love this product and for the price it's perfect. Allows you access to your YouTube account among other things and brings it to your tv. If your tv is not capable of viewing YouTube already, then this is a great little device for the price. Only downside I find is that A) the unit runs very hot, and B) you cannot turn it off other than by unplugging it. I did check into the heat issue, and it seems to be normal and so far I have had no issues leaving mine plugged in all the time. I think it's safe, but wow does it seem hot for such a little device. If you don't have a smart tv with these features, then this is a very cheap option to bring these features to your tv.", "verified": true, "helpfulness": "0/1", "author": "LD Sanders \"LS\""}, {"rating": 5.0, "review": "This was exactly what I was looking for. I wanted a way to wirelessly stream netflix / other websites and this works great. It even allows you to stream one tab (netflix) while using another tab to continue browsing the internet. At $35, this is a must have!", "verified": true, "helpfulness": "0/0", "author": "Karim Lakhani"}]