[{"rating": 2.0, "review": "When it works it works well. Initial setup was easy. But way too often my device does not recognize the Chromecast on the network. It's been more frustration than it's worth.In retrospect, I should have paid up for a Roku instead.  It's annoying to have to control the pause through the iPad. Whenever I want to pause, I need to powerup the ipad, swipe the screen, sometimes enter a password, wait for the application to load.  So, unless you're willing to have your device on the whole time, it might take 10-15 seconds just to hit a pause button.", "verified": true, "helpfulness": "0/0", "author": "V Ember \"V\""}, {"rating": 5.0, "review": "We received the Chromecast, and I \"installed\" it. I put quotes around \"installed\" because I basically just plugged it in and then named it. It did everything else automatically. I can play Youtube, Netflix, my Photo Gallery, Movies off my phone, Pandora, etc just by pressing the little broadcast icon that pops up. When I'm not using it, and leave the HDMI channel on, it has a slideshow of beautiful photography. Also, if I choose to broadcast when the TV is off, it will turn the TV on and play whatever I'm broadcasting. Great product, I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Dingo"}, {"rating": 5.0, "review": "ITS A VERY NICE PRODUCT... IT CAME AS I SPECTED… I RECOMMENDED… QUALITY 95%... WE ARE USING IT WITH NO TROUBLE AT ALL 100% OK…", "verified": true, "helpfulness": "0/0", "author": "ñañon"}, {"rating": 5.0, "review": "Playback on large tv for Hulu plus, cast from iPhone, is perfect.  (Contrasted  with playback  from laptop, which is still choppy, but that's an issue with the computer, not chrome cast.)", "verified": true, "helpfulness": "0/0", "author": "jeanne louise"}, {"rating": 5.0, "review": "This is our second chromcast we like it so much. My 7 year old can cast from his nexus 7 with ease and so can I! Use it all the time with Netflix. In fact we bought a new TV and didn't get a \"smart TV\" as we knew we could get a chromcast for it and pay way less! Want more apps! Hopefully more folks will add to there apps soon.", "verified": true, "helpfulness": "0/0", "author": "S. jaouen \"Beave\""}, {"rating": 4.0, "review": "It wouldn't work until I use the short HDMI cable and then it worked great. Used on youtube and Netflix. I guess HULU+ isn't ready yet.For the price it a great little gadget. I use it from my PC and Android.", "verified": true, "helpfulness": "0/0", "author": "Terry L. Hasenfuss"}, {"rating": 4.0, "review": "Simple easy to setup.  Tons better than Intel WIDI.  Audio/Video sync can could be better. Overall very pleased. Recommended ok", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 3.0, "review": "Pretty much all I ever use it for is streaming netflix to my non-internet-connected-tv it lags severly if you try to use it for anything else like stream a tab from Chrome or something like that. It's great if you're ok with that, for example you're trying to show a group of people presentations or a website. Great for netflix which is why I got it.", "verified": true, "helpfulness": "0/0", "author": "Armando Gomez \"awesome deals explorer\""}, {"rating": 4.0, "review": "It made our tv relevant again! The set up and directions could have been better, but it was easy enough to figure out.", "verified": true, "helpfulness": "0/0", "author": "WindyCity"}, {"rating": 5.0, "review": "For me Chromecast is having an invisible HDMI cable magically connected from my TV to all my computers.And the photographs Chromecast displays while idle are breathtaking.Thank You Google.", "verified": true, "helpfulness": "0/0", "author": "Don B"}]