[{"rating": 3.0, "review": "Mine came with a defective remote control. I'm getting a hard time whenever i need to go left. How can this happen in a brand new remote. That been said, the box itself it's great, and as many others had mentioned before we are specting a few updates with the voice commands (not everything must be amazon or buying stuff related), and we are hopping some other languages will be added as Spanish, French or Italian to the voice command. This box is a lot way better than the others (i own Apple TV2 and Roky)", "verified": true, "helpfulness": "1/1", "author": "Fernando Vargas \"FVG\""}, {"rating": 5.0, "review": "5 stars", "verified": true, "helpfulness": "0/0", "author": "Linda Youngblood"}, {"rating": 2.0, "review": "My brand new, out of the box Amazon Fire TV came with NO: Netflix, HULU, VUDU, Pandora and no possibility to add them!Only Amazon Prime.On App store only 6 apps available!Called Amazon Support and 1st technician assumed item was defective. Free replacement box arrived in days. Same problem!!!Called Amazon Support and 2nd technician found the problem. Default country on Amazon Prime was set to Europe, when my only address is in the US!?!?!. After changing the Amazon Prime default country to US, the box start working normally.My review, excluding this country-setting problem:First thoughts of the short experience with Amazon:I also have a Roku3, and I have to admit Ruko is much more simple and intuitive. The always presence of Prime on the FireTV is something that if you don't want Prime is reason enough to choose Roku. Ruko comes with MGo movies, but you are able to disable that.The channels available in the Amazon \"Cloud\" is very, very limited compared to Roku, and a lot of apps are paid.The remote is beautiful and more effective than the Roku one.FireTV has Dolby Digital Plus decoder (the more common sound in Netflix), a great advantage to Roku.Returned and ordered another Roku3 for my home.", "verified": true, "helpfulness": "2/6", "author": "Ben2"}, {"rating": 5.0, "review": "the quality of ALL amazon basics products are superior to the \"name brand\"", "verified": true, "helpfulness": "0/1", "author": "BJL"}, {"rating": 5.0, "review": "It has everything you need to replace a set top box.  Its fast and convenient.  I almost went with a Roku 3, but I chose Amazon Fire TV after a recommendation by a Best Buy employee.  I have not regretted it for a second.  Also, the voice search works surprisingly well.  I only wish the game controller wasn't back ordered until June.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "We have had this now for 3 months and I can't even begin to count how many hours it has logged. The voice search is really nice and it even understands a southern accent! I would buy this again or for a gift.", "verified": true, "helpfulness": "1/1", "author": "Lauren Robertson"}, {"rating": 5.0, "review": "This streaming player is outstanding. The remote is RF so you can hide the box behind your TV. The interface is fast. The voice search works better than I expected. Just hold the mic button on the remote and say \"Bradley Cooper\" and you instantly see 49 selections. I can't see how it could be easier to find and watch a movie. Prime members have lots of movies and TV episodes available for free. You can set a pin for purchases so you don't accidentally buy something or if you don't want others to buy movies. Apps and games are available. You can even side load android apps not available for purchase through Fire TV (at your own risk of course). We must thank Amazon for that. Kodi will play almost any video.Why did I remove 1 star? There are a few things I could ask for that would require new hardware but I will only ask for one thing that could be fixed right now. AMAZON, PLEASE ENABLE THE USB PORT SO I CAN VIEW/PLAY MY OWN VIDEOS, PICTURES AND MUSIC FROM A USB STICK. With usb storage, this device could be the only device connected to my TV.Update 04/03/2015. The new amazon update now allows usb storage! The usb port even works with a powered usb2 hub. I have the Roswell RHB-330 hub with a usb 120gb SSD (fat32 format) and the Logitech K400 wireless keyboard and a M510 mouse all working together. The only drawback is that the usb storage must be formatted with fat32. For drives up to 2tb, you can use a program called guiformat (google it). Windows will only format fat32 drives up to 32gb.The future Fire TV 2 needs to have more processing power, 4k tv video, HEVC X.265 hardware support, USB3, and a gigabit network port. I'll take 3.", "verified": true, "helpfulness": "4/4", "author": "Grantman"}, {"rating": 4.0, "review": "Great product but I'm an Amazon service fan anyway.  This does not disappoint when compared to the five ROKUs I have although I do like the behavior of some of the ROKU apps better. Wish the icons could be smaller and I able to \"set\" the order of the programs instead of \"last used\".", "verified": true, "helpfulness": "0/0", "author": "MnM"}, {"rating": 5.0, "review": "Easy setup performance is great picture quality is awesome like new", "verified": true, "helpfulness": "0/0", "author": "Alexander Luther"}, {"rating": 5.0, "review": "Best media device ever!", "verified": true, "helpfulness": "0/0", "author": "Shell"}]