[{"rating": 5.0, "review": "If everything was as amazing and as cheap as a Chromecast the world would be super cool and affordable. Cool side note is that you can go into the settings every now and then and hit the button \"Check for offers\" and get some sweet deals, I got $6 per device to spend in the Google Play store NICE!", "verified": true, "helpfulness": "1/1", "author": "Dill"}, {"rating": 5.0, "review": "Extremely simple setup. Works great.", "verified": true, "helpfulness": "0/0", "author": "Roger Egli"}, {"rating": 4.0, "review": "very nice", "verified": true, "helpfulness": "0/0", "author": "Muhammad Mabrouk"}, {"rating": 5.0, "review": "Invaluable if you like watching TV on the internet.", "verified": true, "helpfulness": "0/0", "author": "Eric & Kristi"}, {"rating": 4.0, "review": "really a great product for viewing online content, delivers exactly what the manufacturers promised. Longing to see the updates to the device in the feature.", "verified": true, "helpfulness": "0/0", "author": "Glenroy Waldron"}, {"rating": 5.0, "review": "GREAT product! I do not think at this point any feedback is required for review on this product any longer. But it is great I have been using it without and issues. Great price as well!", "verified": true, "helpfulness": "0/0", "author": "Lynda"}, {"rating": 5.0, "review": "Exactly what I wanted! And came exactly when It said", "verified": true, "helpfulness": "0/0", "author": "Ashley Swartz"}, {"rating": 5.0, "review": "IT is AWESOME. I love the SCREENCAST feature. Mirror's my phones screen on the TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer IAEN"}, {"rating": 3.0, "review": "I use my Chromecast regularly and it streams great.  I had some issues when it first come out, but those issues have been fixed.  I purchased a Fire Stick recently and find that I like it better since it comes with a remote and does not need a separate device to stream with.  Having HBO Go was the main PRO for Chromecast, but now that Fire Stick is getting it soon I would have to recommend the Fire Stick.  But if you are in the market for a Chromecast it does work great.", "verified": true, "helpfulness": "0/0", "author": "Joshua Gall"}, {"rating": 5.0, "review": "This is my second one, which means I love it. Delivery right on the dot.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]