[{"rating": 2.0, "review": "I thought it would have everything I paid for with my direct tv but I can't find Starz westerns", "verified": false, "helpfulness": "0/1", "author": "Paula Gregory"}, {"rating": 5.0, "review": "Works very well for us in every way.  Good picture, good buffering, great remote, great prime content for everyone.  Very happy with this.To make it perfect it would natively hit hard drives for content.  Also a better app from the folks at MLB. :-)", "verified": true, "helpfulness": "2/2", "author": "Sean \"Sean\""}, {"rating": 5.0, "review": "This is so much better than apple TV.  We are watching movies that we don't have to pay for and not having to use Direct TV to pay for movies.", "verified": true, "helpfulness": "0/1", "author": "Margaret Rawson"}, {"rating": 5.0, "review": "I've owned several streaming devices and the Fire is by far the fastest, and most adaptable. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Daniel Gillen"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Norm Kristensen"}, {"rating": 4.0, "review": "I finally got my fire stick set up and working however it's just a different version of Netflix. I do like it and the 30 day trail of Amazon prime not so sure about this feature. You have to rent or buy and everything else you can watch on Netflix or I have another source to watch from. So I probably will not keep that service. So I changed my rating to a 4 not yet a 5. No difference than having another streaming service or a smart TV.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to setup and use.Kodi works too, if you side-load it.", "verified": true, "helpfulness": "0/0", "author": "Xiaojun Ma"}, {"rating": 4.0, "review": "Met expectations and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Sandra Coolik"}, {"rating": 4.0, "review": "Easy to use, but I was dissapointed in the relatively small number of recent selection of movies available under Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Helen Sonenshine"}, {"rating": 5.0, "review": "We purchased this unit to carry with us when we travel. This allows us to enjoy our viewing at the limited venue at hotels. It is easy to install & makes our travel more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "Don W. Duff"}]