[{"rating": 5.0, "review": "I guess it's a great thing, my grandkids love it, and someday I will get a chance to use it, when they get back to school.", "verified": true, "helpfulness": "1/1", "author": "SeelNet"}, {"rating": 4.0, "review": "Although I like my Fire TV, I was disappointed that a lot of shows were not on Amazon. I was told I would have to go to Hulu+. I was very disappointed. Also, HBO Go is not available.", "verified": true, "helpfulness": "1/1", "author": "bear7625"}, {"rating": 5.0, "review": "Arrived on time, all parts and components were included and it worked as described.  It will take some time to determine how much we will use it.", "verified": true, "helpfulness": "1/1", "author": "John Lay"}, {"rating": 5.0, "review": "I do love Amazon Fire- I don't have cable and this is a great purchase for me.", "verified": true, "helpfulness": "1/2", "author": "Jwelch"}, {"rating": 5.0, "review": "Fantastic Product~~!!! I love it.", "verified": true, "helpfulness": "1/1", "author": "Giwon Lee"}, {"rating": 4.0, "review": "Easy to set up. One problem but I corrected it by using online troubleshooting when I lost access to Netflix. Other than this problem I am satisfied.", "verified": true, "helpfulness": "1/1", "author": "Peggy Olive"}, {"rating": 2.0, "review": "Love the concept - easy to use - beautiful display BUT - after using it for 3 weeks - 21 days , I got a notice from my cable provider - I am currently at 287GB of data usage and well over my cap. I live alone - work 5 days a week and watch limited tv. I had never come close to my cap before the Fire TV. They claim an issue with the screensaver is causing the issue - perhaps. All I know is since using the Fire for 3 weeks - I have gone from minimum data usage to almost 40Gb over my limit. My Fire TV is currently unplugged and going back to the Roku. Hopefully, they can fix this issue - I had planned on buying several more - so glad I did not. Also, my son went over his limit 2 days ago - once again, he had never come close to his cap either. The issue is most definitely the Fire TV. Both of us got the units within a week of each other. Neither had ever had a problem and if you search Amazon Fire TV data usage - you will see many threads and others with these issues. My advice - hold off purchasing and see if they can correct this. If they do - it's a great purchase. If they cannot - it's a data hog and prepare to have your data capped or limited. They say that the mosaic screensaver is the culprit - I never changed the defaults and my unit displays only the slideshow screensaver.Good luck to you!", "verified": true, "helpfulness": "1/1", "author": "Richard"}, {"rating": 3.0, "review": "Where is Showtime as promised???", "verified": true, "helpfulness": "0/1", "author": "Kathleen"}, {"rating": 5.0, "review": "I'm very please with this is really good and super fast.", "verified": true, "helpfulness": "0/0", "author": "isabel Reyes"}, {"rating": 5.0, "review": "Great device. Easy to install and work. Opens a whole new world of movies and TV shows.", "verified": true, "helpfulness": "2/2", "author": "LEOPOLDO DANIEL LEON"}]