[{"rating": 1.0, "review": "Pain in the neck to set up. Kind of slow a glitchy playing video from Chrome. Might as well just use the HDMI output from the laptop directly to the TV.", "verified": false, "helpfulness": "4/6", "author": "M. Steinhorn"}, {"rating": 5.0, "review": "Love this device! The reception is perfect on my TV with no pauses or commercials!! Fabulous! Would certainly recommend to everyone with wireless.", "verified": true, "helpfulness": "0/0", "author": "Karen K. McInteer"}, {"rating": 2.0, "review": "It works very well on the apps it supports.  Just not enough apps are currently supported.  No idea why they are not more open to allowing more.  Mine now sits unused, while I use the roku.  That has just about everything I want - except YouTube.  Can't find one to do it all.", "verified": true, "helpfulness": "1/2", "author": "Breck H Caine"}, {"rating": 4.0, "review": "The Google Chromecast is a good gadget: it's quite cheap and does a good job. It streams Youtube and I use it mainly for my children to watch cartoons. However I still have to understand how I use the other applications. I don't live in the US and wife doesn't understand any English, so it's no real use to her.", "verified": true, "helpfulness": "1/1", "author": "Ithamar F."}, {"rating": 5.0, "review": "LOVE it.  There are not words to express how much I love this item.1. It works very nicely with my Sony TV.  When I'm upstairs and my kiddo asks for a show, I open up Hulu on my phone, select the show, and click the Chromecast icon.  BOOM, it's playing on my TV.  I don't have to touch a thing on the TV.2. Youtube playback is AWESOME how it works.  I can queue up several videos in a row and they play back to back to back!3. All listed apps work seamlessly.4. Works beautifully with my iPhone and my wife's Android phone, as well as my Nexus 7 tablet and laptops!The ONLY negative I have is that there are not enough apps yet.  It'd be nice to play Xfinity, ESPN to go, etc., with this device from my phone.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "Setup the device in under three minutes and streaming my content through Netflix and Hulu Plus in another two minutes. A total of five minutes to stream House of Cards to my tv in the master bedroom.Before starting the Chromecast setup, I made sure I had the Chromecast application installed on my iPad and Netflix and Hulu Plus where up to date.Highly recommend the device...", "verified": true, "helpfulness": "0/0", "author": "John Stephens \"porschedude\""}, {"rating": 5.0, "review": "i'm quite pleased with it.  and with the new apps which know about it now, it's getting even better.  i have no qualms about recommending it.", "verified": true, "helpfulness": "0/0", "author": "jmb"}, {"rating": 3.0, "review": "I have an xbox 360, so the main reason to have this, netflix, is negated.  The xbox is app for netflix is superior in every way.  The interface to use netflix and other supported video apps (like youtube) are somewhat awkward to use.  If you want to sit on the couch and chain watch a show, it takes too much computer intervention to feel more comfortable to use than just watching with the laptop in your lap.The browser streaming works decently. It will lag once in a while where the internet does not, then it will skip video to catch up.  Not really an issue in most cases, but if you're watching anything subtitled you are likely to miss a line or two.It's hard to complain considering the price though, especially since i got the netflix deal.  It works remarkably well considering the price.  I especially appreciate that it is wireless.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works really well with Netflix app on phones, YouTube app also. But that's pretty much it. One other streaming video service app I don't have, but no other apps. Did not work well at all trying to stream video from laptop via Chrome browser extension. :( Only recognized a few video file formats and would have frequent \"network latency\" issues while doing it, even tho on same wifi network as the phones. Pretty good deal for the price tho & updates itself so hopefully better in the future.", "verified": true, "helpfulness": "0/0", "author": "KYLE TINSLEY"}, {"rating": 3.0, "review": "The device worked and it worked well, so I can't say anything negative about the functionality.  Here's where it fell short of my expectations,1.  It can only stream Youtube and Netflix, that is, once you have started the show your tablet or phone you can have it broadcast on your TV and you can then turn off the phone or tablet if you like but the streaming will continue on your TV.  But you can't do this with anything else (Hulu, Vudu, Amazon Prime etc.).2.  You can stream Amazon Prime, Hulu, Vudu etc. from your laptop using the Chrome browser but you have to keep it running on your laptop.  If you close the browser that's the end of the streaming on the TV also.  And I didn't care for it as I thought it said, anything from your computer can be watched on TV.  Technically they are correct but that's very Microsoft like and not something I'd expect from Google.  I guess once you get the taste of money, principle goes out the window.3.  I have only two HDMI ports on my TV and one is being used by my Blu-ray player, the second by the set-top box (STB) and so I had to switch one of the device in and out and that was not convenient.4.  I couldn't connect the Chromecast directly to the HDMI port at the back of the TV as that prevented me from connecting to the other device.  Google does provide with an extension chord that enabled me to connect the other device (Blu-ray or STB) to the TV.5.  The Chromecast device by itself looks pretty cool but that's not the way it connects.  You have to be able to power it and for that you have to connect the Chromecast to the USB port at the back of the TV which my TV doesn't and for that I had to connect that to an adapter, which was connected to the power supply.  This extension is also provided by Google but it was never mentioned as such, again, they are technically correct as they do show in the demo video that you need to connect it to the USB port but as I said before, getting too technical for my liking.6.  I'd have still made this work if the HDMI splitter, which I ordered through Amazon had worked.  The idea of switching HDMI cables in and out was not a great option for me.7.  Finally, the Blu-ray device already streams Youtube and Netflix so what am I gaining by having another device that does the same as the Blu-ray.  It is true my Blu-ray does not allow me to stream anything from my computer to the TV but if I connect my computer to the TV that's also taken care of.In summary, if you have a Blu-ray or another device that streams Youtube and Netflix then Chromecast is not that great a buy.  But if you do not and would like to have the ability to do so then Chromecast is a great buy, it is priced right, for $35 you can't beat it.  It is possible Google will add other features to this device and then it will be a worthwhile purchase but for all the limitations that faced with this device it was not meant for me and I returned it to Amazon.", "verified": true, "helpfulness": "1/1", "author": "fatherof2"}]