[{"rating": 5.0, "review": "This is a great product.  It works perfectly once you get your system to recognize it.  It had to be installed twice to work properly and be recognized in my network.  Once installed and mated to the system it provides excellent service.  Finally a product which works directly with a browser so that you can use your television like a monitor.  This product is so much easier to use than other web products I have used.  There is no additional purchases necessary or subscriptions to make the player work.  Thanks for a great product.  d", "verified": true, "helpfulness": "0/0", "author": "Dennis Farris"}, {"rating": 4.0, "review": "so we thought we would be able to use this to just cast a webpage to view support tickets. however with it on the companies network we are unable to get it to connect to the internet.  our IT says that the wireless its on is unfiltered but it won't stay connected and have been unable to cast to it since purchasing. I'm going to try it at home and see it it';ll work for personal use.", "verified": true, "helpfulness": "0/0", "author": "mastan8"}, {"rating": 5.0, "review": "Simply because I canceled my $65/month cable and only pay $9 a month now for Netflix.... I do wish they had more content but hey better to save money", "verified": true, "helpfulness": "0/0", "author": "Eric Zuniga"}, {"rating": 5.0, "review": "Yeah so this device lets me be even lazier than I normally am. I can have YouTube parties and basically hijack my friends Chromecast accounts wheneever I drive by their house. Kinda fun. This device does exactly what it says it will do and I haven't seen any issues concerning lag or slow response.", "verified": true, "helpfulness": "0/0", "author": "5igma"}, {"rating": 5.0, "review": "I love it.Money worth ! I would recommend them to my friends . In fact they already have it . HD Streaming", "verified": true, "helpfulness": "0/0", "author": "Avi Dalvi"}, {"rating": 5.0, "review": "Yeah this is quiet cheap and sounds great! For some that don't have a smart TV this is the could be the best friend of that TV. Also it has a lot to grow, lot of apps are coming to the ChromeCast.", "verified": true, "helpfulness": "0/0", "author": "Jose R. B. Flores \"ZeFlores\""}, {"rating": 5.0, "review": "This is by far the best thing I've found for streaming online services to your TV. Plus, I can show my computer's screen on my TV and enjoy the larger screen!", "verified": true, "helpfulness": "0/0", "author": "Nash Brown"}, {"rating": 5.0, "review": "This item didn't have much of a manual--but what electronic gear does nowadays?  It took a little trial and error to figure it out, but once I did, it was easy as pie.  I simply plugged it into one of the HDMI sockets in the back of my TV, and downloaded the app from the Google play store, and I was set to go.  I use it mainly to stream Netflix.  I am very satisfied with the product.", "verified": true, "helpfulness": "1/1", "author": "Nadine M. Mitchell"}, {"rating": 5.0, "review": "It does everything Apple TV does... But way cheaper... I think I'm in love. No complaints from me. Google it.", "verified": true, "helpfulness": "1/1", "author": "Iburgener"}, {"rating": 3.0, "review": "Great idea, we just need more apps that cast. Oh and it needs power so you need any extra USB or outlet close by to power the device.  Never see that in the demos", "verified": true, "helpfulness": "0/1", "author": "mra99"}]