[{"rating": 5.0, "review": "One.  Of the best things i have netflix looks beautiful and fast. The same like apple.", "verified": true, "helpfulness": "0/0", "author": "GUADALUPE GUTIERREZ"}, {"rating": 5.0, "review": "Chromecast really takes the top prize when it comes to ease of setup and use when it comes to media consumption devices. Anyone could have it up and running within minutes of opening and the list of apps that support it and the tab casting feature make it increasingly more flexible by the day. For the price no one should pass it by and should at least give it a try and they will see that it will find a use in their life.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It is exactly what you think it is...", "verified": true, "helpfulness": "0/0", "author": "Jair"}, {"rating": 5.0, "review": "Terrifically", "verified": true, "helpfulness": "0/0", "author": "Andy Liu"}, {"rating": 4.0, "review": "It works great after I had to upgrade to a new WIFI.", "verified": false, "helpfulness": "0/0", "author": "Sharon Berman"}, {"rating": 5.0, "review": "Love it. This was a great idea and I'm shocked I didn't see someone selling this kind of product before 2014.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was expecting a device similar to the Roku streaming device I already have.  I was very disappointed to find that the google chromecast requires another device to drive/stream your media and doesn't actually do it itself like a roku.  Therefore, it's just a nicely packaged, better marketed dongle which I also already had.  If I wanted to boot up my pc, or tie up my phone streaming movies, I didn't need the chromecast device.  I wish I'd just bought another roku to bring streaming content to another tv.  I'm disappointed with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Lesley J Pool"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "maria"}, {"rating": 5.0, "review": "Easy to use. No hassle with wires. Great for compatible apps. Needs a built-in feature from google to play media files on personal devices because third party server solutions are not up to the mark.", "verified": true, "helpfulness": "0/0", "author": "khizar"}, {"rating": 5.0, "review": "Amazing little device", "verified": true, "helpfulness": "0/0", "author": "Sean Hunter"}]