[{"rating": 5.0, "review": "Love it!  It has allowed me to watch so many things commercial free and it is very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Mary Kingston"}, {"rating": 5.0, "review": "it is awesome , I love it !!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Wil"}, {"rating": 5.0, "review": "Arrived quickly, works as advertised, speed of operation is good (better than other devices we have).", "verified": true, "helpfulness": "0/0", "author": "Patricia VanWiltenburg"}, {"rating": 5.0, "review": "Simply Amazing!", "verified": true, "helpfulness": "0/0", "author": "James L. Abercrombie"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Jollin Shah"}, {"rating": 5.0, "review": "beautiful, thanks", "verified": true, "helpfulness": "0/0", "author": "Marcelo B."}, {"rating": 5.0, "review": "I have to say this device is awesome.  I own 2 smart TVs, a ps4, original roku player, and a Roku stick.  As far as speed this and the PS4 are by far the fastest and most intuitive for running apps.  2nd is the Roku player but far behind the speed and stability of the Fire.  I can't give an honest comparison with newer model Rokus since I have never used.As for features, I love the voice command button.  Works super fast finding shows I own, Amazon Prime shows, in the Amazon store, and shows on HBOgo.  Couple clicks and my show is playing.  Does not link with Netflix and probably never will do to being a competitor, but I can say Netflix click a button, and I am there.  Same for Hulu and other apps.Remote is small, sleek, and functional.  Don't find myself hitting wrong buttons because of bad layouts like on other controllers.  The actually box is very thin and sleek as well.Highly recommend, especially if Sling TV rebate still active", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Fire is mostly as expected. I wish the software UI portion were more customizable (like to only view Prime movies or pay movies, and then by new addition, genre or release year). I am a little disappointed that movies that have ready gone free on Netflix streaming are not always free on Prime, like they tend to be with iBooks/Nook/and Amazon Kindle editions. I would like to replace Netflix with Prime, but it isn't really feasible until there is more unity in what is available.Love being able to access original series. They are quality entertainment. I suppose that is one reason these little boxes cost so much.", "verified": true, "helpfulness": "0/0", "author": "Tiedye Terra"}, {"rating": 5.0, "review": "Better than expected.", "verified": true, "helpfulness": "0/0", "author": "Shelby Jackson Fox"}, {"rating": 4.0, "review": "It is great. For some reason, it is not able to connect to my NetFlix account ... but aside from that, it is a great way to watch the programs you want, when you want !", "verified": true, "helpfulness": "0/0", "author": "consumer \"a reviewer\""}]