[{"rating": 5.0, "review": "Simple and good! Easy to install. Perfekt to watch Youtube, you use your cellphone to navigate! Just hope that more apps will be supported.", "verified": true, "helpfulness": "0/0", "author": "Mikael"}, {"rating": 3.0, "review": "This is pretty cool. You have to jump through a few hoops to get it to cast, which isn't too bad.  Wish it supported more casting options from your iphone.  No hbo go, no sunday ticket. Basically, you can use netflix and youtube.  Apple TV is definitely more versatile.", "verified": true, "helpfulness": "0/0", "author": "ZP"}, {"rating": 5.0, "review": "Easy to setup and use.  Great price.  Easy way to convert a TV to a smart TV.  So far have setup 2 computers and 2 android phones to cast to the TV with no problems.", "verified": true, "helpfulness": "0/0", "author": "l17h"}, {"rating": 4.0, "review": "Chromecast is easy to use and works as advertised. It is, however, limited to casting \"directly\" from YouTube, Netflix, Hulu and Google Play Movies/Music. Casting directly means that, once you select a movie/program/video, the selecting device (e.g. tablet/smartphone/computer) can be turned off. This streams directly to the Chromecast module, as fast as the network connection allows. You can also stream from a chrome browser tab, but when you do this, the browser tab actually runs the video, and the Chromecast module taps into that stream. You cannot stop the the Chrome browser, and speed is limited by ability of the computer (i.e. needs a fast computer to stream well). And, you can't stream from Chrome running on a tablet or phone, only from a computer. This is inconvenient. If Google fixes this by either allowing casting from tablet/phone Chrome browsers, OR adding more apps that stream directly to the module, Chromecast will deserve a 5 star rating!", "verified": true, "helpfulness": "0/0", "author": "jrcurtis"}, {"rating": 3.0, "review": "Not really impressed with limited feeds available and unable to use it on a 5Ghz network. I will keep it and hopfully google will have a update to it.", "verified": true, "helpfulness": "0/0", "author": "mfdockery"}, {"rating": 4.0, "review": "I was a little nervous because I wasn't sure something so inexpensive was going to work very well.  I have been so happy with this purchase that I am ordering one for my sister and mother for Christmas!!! Glad I took a chance on it.", "verified": true, "helpfulness": "0/0", "author": "tbaker"}, {"rating": 3.0, "review": "Simple to setup, fast, intuitive, but only few apps released until now. When google allow more apps it will be perfect", "verified": true, "helpfulness": "0/0", "author": "Felipe"}, {"rating": 3.0, "review": "Google's Chromecast is an innovative and easy way to stream your computer to your TV. You can watch Netflix (if you have a subscription), YouTube and any Chrome browser page. Honestly that's about it. Google claims it's working to expand this, but development has been slow, and any 3rd party attempts (some of which have been quite successful) have been quickly stopped. So much for open source ..With the right marketing and APK, this device would open up a host of possibilities. It's small enough to travel, and easy to set up. You could pack it with you for business meetings, or simply share your computer with friends. It needs better integration though. What it lacks are items such as Plex (which Google says they are working on) and basic video streaming. Hopefully they will come out with this soon. Users don't like spending cash to wait around on development.I tested the device on my home LAN and it worked without any problems. It connected to my secured router and I was watching YouTube videos within minutes. It remembers the network settings even after power-down, which is a nice touch. I also tested the device at work, with an Android hotspot. Streaming and the hotspot combined were too much for everything (the lag times were long), so I would say to use this as a last resort.Pros:Easy set upSmall footprintLow costCons:Only stores one network profileNeeds a fast network to stream videoNeeds an open HDMI port on your TVOnly works with select/limited providers/optionsNo provisions to explore/expand the device", "verified": true, "helpfulness": "1/1", "author": "Boomtastic \"I'm the dude!\""}, {"rating": 5.0, "review": "It's been a very popular aspect of our semi-weekly board game night. Sometimes between turns someone will play a video from Youtube just for fun, and it makes for a pretty good addition for the night. Otherwise, my wife and I like to use it to watch content from Netflix as well. It works very well as advertised, so long as you understand that going outside of what's advertised isn't guaranteed to work as well as you might like.The device itself does not have any sort of permanent memory for apps, instead it loads them on demand, usually taking about 3 to 5 seconds to load the Netflix or Youtube apps. It can cause some hiccups and glitches if you try to load a video while it's downloading the app, but otherwise works very smoothly if you allow it those few seconds at first. The device itself streams content directly from those sites, so you can queue up content from low end devices without any playback problems.The desktop casting does leave much to be desired, and I haven't been able to get the audio to work; though, it's not an advertised feature and is clearly marked as experimental. The Tab-Casting on the other hand works great, given you have a good enough computer to handle streaming content smoothly (we have a computer that we built for about $1,000 last year, works great on that. Our other computer would probably be worth about $350 today, and it stutters with video and audio gets out of sync). The Tab-Casting feature allows you to play anything you can open in your browser on your television, at least, we haven't run into anything that causes problems thus far. If you have the proper plugins, this will allow you to play video content from your computer and stream it to your television, or any number of creative ideas you might have.The Youtube app works well from all of the devices our friends have: Android phones, iPad, Laptops/Desktops (Linux and Windows). We haven't tried it from anything else, but I imagine they work just as well. You can queue videos from several devices and the Chromecast will play them in the order they were requested in. This means that you and your friends can add videos to a playlist as someone else's video is playing. One thing to keep in mind, once Youtube on your device syncs up with the Chromecast, it will display controls for the current video on your device, sometimes causing people to accidentally queue the current video up again or restart it from the beginning. It's mostly corrected if you give it a few seconds to get situated and make sure you're actually doing what you think you're doing.The Netflix app is similar to the Youtube app, though it does not have a queue. It does have a few more issues, though I believe those are mostly related to the fact that the Netflix app for phones is a resource hog, it works great once you can actually send the video request to the Chromecast device. So it's not really an issue with the Chromecast itself, but with the Netflix app on your phone. There is only a slight latency (less than 1 second unless you're having network issues) with the controls for a playing video, though it can be irritating to try to get the controls to come back up if you close out of the netflix app, once again, an issue with the Netflix app on your phone.I don't buy music or videos from the Google Play store, so I haven't tested that out. I imagine it works well.As far as I know, anyone can make an app for the device to play content. However, I would warn people from making a purchase based on future promises from other content providers. Until they actually have an app, you should consider it to be nothing more than a possibility. The Tab-Casting can make up for an app not being available, but having a Chromecast app is superior.Overall, I've been very happy with the device. It works very well as advertised, and the price is appropriate for what it is.", "verified": true, "helpfulness": "0/0", "author": "MJS"}, {"rating": 3.0, "review": "I guess it streams Netflix and Youtube well enough. But kind of annoying having to use your phone every time. Just because it's possible, doesn't mean it's ideal. What else can it do? Can I stream my own media? Don't think so yet. Price is good though.", "verified": true, "helpfulness": "0/0", "author": "Joe Nobody \"smith\""}]