[{"rating": 5.0, "review": "Great item!! Highly recommended!!", "verified": true, "helpfulness": "0/1", "author": "Pedro Figueroa"}, {"rating": 5.0, "review": "This is one of my most enjoyable entertainment devices.  What I like most is the ability to use my smart phone to control my viewing selection.  I like the price, the ease of setup, and the network security.  This is my 2nd one!", "verified": true, "helpfulness": "0/0", "author": "Rodney L. Jones \"wayne shorter fan\""}, {"rating": 1.0, "review": "We thought it would be a good alternative after our Roku bit the dust.  Unfortunately, it's frustrating to try to watch a movie when it crashes constantly.  We are going out to buy a new Roku and will be tossing Google Chromecast into the garbage where it belongs.", "verified": false, "helpfulness": "1/2", "author": "Stacy"}, {"rating": 5.0, "review": "fast shipping and exactly as advertised", "verified": true, "helpfulness": "1/3", "author": "Andrew Bean"}, {"rating": 5.0, "review": "Simply Excellent", "verified": true, "helpfulness": "1/3", "author": "Eric Pereira"}, {"rating": 1.0, "review": "picked this up earlier today and all it has been is a headache it won't stay connected to my phone or connect to my laptop at all. It worked for about the first 5 minutes after setup then the signal from the chromecast became unstable. My wifi is excellent full signal on my laptop and phone but apparently chromecast cannot pick this up. I will be returning this tomorrow.", "verified": false, "helpfulness": "0/0", "author": "Justin MacDonald"}, {"rating": 2.0, "review": "When the Cromecast broadcasts everything (not just from an app) it will be perfect.", "verified": true, "helpfulness": "0/1", "author": "MS2706"}, {"rating": 2.0, "review": "I couldn't get it to work on two networks I tried.  Sold it to a friend for what I paid for it.  It should be noted I have bad electronics karma.", "verified": true, "helpfulness": "0/2", "author": "Brett Slaski"}, {"rating": 5.0, "review": "Works wonderfully; clear instructions which allowed a 78 year old to hook it up herself!", "verified": true, "helpfulness": "1/1", "author": "G.M.SLEMP"}, {"rating": 5.0, "review": "It's worth the cost", "verified": true, "helpfulness": "0/1", "author": "Roger"}]