[{"rating": 4.0, "review": "I bought this in anticipation that I could stream from my Chrome browser on my laptop. I'm not real techie so maybe my processor just isn't up to speed? (AMD Phenom II N-660 Dual Core Processor) All I know is that streaming from my laptop is NOT what's going on... so that's sad. The video has no audio and is very choppy. From what I could read, it's because my system sucks. (Remember, non-techie only spoken here.)I will say that I do love the streaming capabilities of the Netflix, Hulu Plus, and YouTube apps from my Nexus 7 and my android powered smartphone. It makes watching shows and videos a snap! I have a Panasonic blu-ray player that hates Hulu and takes several minutes just to load the initial start up screen for Netflix. Streaming from either of these apps to my Chromecast is super easy. Open the app, change the casting device to my chromecast at the top of each app, and pick a movie. Viola! It starts up right away! This does not happen on my blu-ray device.Youtube is also easy and fast on the Chromecast. The app lets you browse through videos and then set up shows in a TV queue to play only on the Chromecast. I wish it would save the TV queue but that's okay. Not a deal breaker for me as it is 100x faster than loading my Youtube through the blu-ray player.Set up for the Chromecast was very easy. I think you need to be sure to read the directions carefully and only do one step at a time. I had no problems at all. I do sometimes have issues where it does not recognize my device I am streaming from and I have to close the app and restart it. That is possibly more of an application issue rather than the Chromecast itself.Overall, for $35, I am happy with it, especially now that Hulu Plus works on it. I will love it even more if it could eventually integrate either Amazon Instant or VUDU. I haven't done a Google Play set up yet. I already have wishlists on VUDU and Amazon and am not keen to start a third list just yet for this. I would be over the moon happy if I can ever get my Chrome browser to stream shows from my browser onto my TV smoothly as that was the main reason I really wanted it.", "verified": true, "helpfulness": "1/1", "author": "Renee"}, {"rating": 5.0, "review": "It works right out of the box. And it's cheap! Great way to watch Netflix on an older t.v!It repleaced a Wii for that purpose and the image quality is WAY better...", "verified": true, "helpfulness": "1/1", "author": "Fernando Buenfil Santana"}, {"rating": 3.0, "review": "I purchased one at the very first moment announced. It was better than the secound one that i bought. I would give this product 5 stars if they improve the sound and the pic clear. However, it is amaizing idea to connect TV to the interent.", "verified": true, "helpfulness": "0/0", "author": "Victor \"ViC\""}, {"rating": 2.0, "review": "Unfortunately not pay attention to that detail. Well, could not download the application on my android chromecast, after trying for several ways I could set it up. I put less points not because of price, but I definitely keep my Raspberry Pi as HTPC (OpenELEC)", "verified": true, "helpfulness": "0/0", "author": "Carlos A Zaidman D"}, {"rating": 5.0, "review": "Longer and more detailed reviews abound, and this will be in the old reviews (page two) in a flash.  I just wanted to tell people that I bought this for one thing, and one thing only: watching my Youtube subscription channels on my 70 inch HDTV.  It works like charm, controlled by my iPad.I downloaded the Chromecast app on the iPad2 from App Store, free.I stuck the Chromecast dongle in the HDMI port on the TV, and the power USB cable from the dongle into a USB port on the TV.  I followed the onscreen instructions, and ten minutes max later, I'm watching Youtube on TV.  It's fantastic large, especially HD youtube content.  I watch many youtube videos that are 30+ minutes long--what a way to watch!  The volume is controlled on the TV remote control, but I select videos on the iPad, just like the Youtube app you have on there now.Phenomenal!", "verified": true, "helpfulness": "1/1", "author": "WayneChicago \"ck1\""}, {"rating": 5.0, "review": "Exceeded my expectations.  Easy to set up.Works excellently in the iPad's back ground.Did not impact the iPad's speed or functionality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "At first I got it to play a prank on my mother but I still live it. I get to watch stuff that was on my laptop to my TV. It came in early so I'm happy about it.", "verified": true, "helpfulness": "0/0", "author": "Jose G. Trejo"}, {"rating": 2.0, "review": "I was hopeing for more Streaming options it works great for YouTube Hulu and Netflix  but tuff to get content from my lap top or wireless devices", "verified": true, "helpfulness": "0/0", "author": "Denny"}, {"rating": 1.0, "review": "Why would someone buy this to attach to their tv and be limited to what you are able to stream to it? Why not just pay $30 for VGA and audio to HDMI converter and connect an actual computer to your HD TV? That's what I did. I use my 47\" HD LCD TV as my monitor for my computer. I have a wireless mouse and keyboard also, so it makes it easier. Or if your computer already comes with an HDMI output, connect it instead. This is a gimmick, like a lot of the new products coming out, that people will lose interest in and will fade out within a year.", "verified": false, "helpfulness": "0/2", "author": "scott grice"}, {"rating": 1.0, "review": "You cannot cast any browser tabs from a tablet and only get audio from tabs cast from a PC. This means the TV I stream at my PC can be watched on the TV.  Chromecast is next to useless.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}]