[{"rating": 5.0, "review": "This is a great Google product and definitely worth the $35.  We are able to surf the net and watch lots of programs.  This product provides selected apps (netflex, googleplay, and youtube).  If you have a pc or mac you can get any program on the web.  Apple products (ipad and iPhone) still don't have the google chromecast app therefore you can't use it with these products.  I think it will be a long time until those apps are available of ipad or iPhone. Absolutely a great product that makes your TV smart but you must have HDMI port on your TV.", "verified": true, "helpfulness": "0/0", "author": "SU"}, {"rating": 4.0, "review": "I'm excited about this product because it gets Google in the game for living room home entertainment.  I currently have Apple TV in the living room and a couple IPads and IPhones in the house. I finally received my Chromecast last week. The price is great and setup was easy. However, in terms of additional capabilities to my current setup, it does not offer much other allowing me to \"AirPlay\" Netflix from a device to the TV which is not a very big win when Apple TV already offers access to Netflix and much more.  But, if you don't yet have Apple TV (probably because you did not like the price), this is a no brainier cheap pickup for most all the same major capabilities.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "It was very easy to use and setup.  Please note, that to initially configure the chromecast, you cannot use a hard-wired computer to communicate with the Chromecast.  You need to use a computer that has a wifi connection, or a tablet/phone that has a wifi connection on the same wifi network as the chromecast.Once the chromecast is configured, you can easily use the hardwired desktop to cast to the chromecast.  I recommend this item, especially if you were lucky enough to get in on the netflix deal making the chromecast only $11 :)", "verified": true, "helpfulness": "0/0", "author": "L. Vazquez"}, {"rating": 5.0, "review": "Excellent product at a price that can't be beat. I love it! I have an Xbox but I love chomecasting.", "verified": true, "helpfulness": "0/0", "author": "jb"}, {"rating": 3.0, "review": "The good thing is that it is cheap.  Very cheap.  After the Netflix promo, it's only 11 bucks.  However, more than a month later, still can really only use it for Netflix and YouTube.  That's so typical google.  It is almost like that have forgotten this product.  Kinda useless at this point since there are so many other ways to do what it already does, and better.  Still hopeful, however.", "verified": true, "helpfulness": "0/0", "author": "Falstaff"}, {"rating": 1.0, "review": "I from Israel a this google chrome is blocked in my country. I can not use it And that's unfortunate", "verified": true, "helpfulness": "2/7", "author": "Shlomi"}, {"rating": 3.0, "review": "Well functioning, but not enough software support as of now. Will probably be if great use when more apps come. Video via Chrome tabs only good enough in a pinch - everything works better on an (more expensive) Apple TV.", "verified": true, "helpfulness": "0/0", "author": "PKBjorkeng"}, {"rating": 1.0, "review": "When I ordered the item, it was listed with a 3 months of free Netflix service as promotion. Although later Amazon changed the promotion deadline to 7/24/13 5:30pm PST, I remained eligible as ordered before that - at 5:15pm PST, 7/24/13. However, I never got the promotion code, which I was supposed to get within a week of the order.", "verified": true, "helpfulness": "6/10", "author": "MNWA"}, {"rating": 4.0, "review": "So far so good.  I have never setup anything so easily.  Did pretty much everything on its own.  Once I gave it access, it found the network on its own and connected to it using the password as well.  Has been mostly using the iPad to cast, as my MBP sort of freezes up because of Flash player on Chrome (sigh!!).  Streaming Netflix, Youtube goes very very smoothly.  The control with iPad is a bit cloogey, and it takes a bit of time to respond, a dedicated remote wouldn't have been bad.  But for the price and the free 3 month Netflix subscription, it is very well worth the $$s.", "verified": true, "helpfulness": "0/0", "author": "M. Pooleery \"book bug\""}, {"rating": 5.0, "review": "Set-up was a breeze once I got the wireless on my computer properly configured. That would be my only hint on this product. Make sure you are already connected wirelessly through the device you are setting the Chromecast up on. Otherwise, enjoying my new toy.", "verified": true, "helpfulness": "0/0", "author": "Nianya Cambridge \"Magical Mischief Maker\""}]