[{"rating": 3.0, "review": "The same 90% lame and stale B-grade movies, TV, etc. - perhaps a slight edge over Netflix. The games are awful. At least Amazon could have paid Mojang to port Minecraft to it and included cloud support. This thing has a long way to go.Quite disappointing after all the hype. A DVD \"save' after buying an on-the-shelf movie, for 1/3 of the shelf price so it could actually be YOURS, would be a huge plus.", "verified": true, "helpfulness": "2/5", "author": "rj \"rj\""}, {"rating": 5.0, "review": "Fantastic....Never, do I have any trouble with reception, like I did on my Roku and RCA streamer.  This machine is so far superior to other streamers, if in doubt of purchasing, don't hesitate. I have DSL internet service and like I said, I always had trouble receiving the signal...but not anymore.  Thank you Fire!#!#!#", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 5.0, "review": "Great little box; makes connecting to streaming videos much, much easier. Small, compact and easy to use and understand. Great Buy!!", "verified": true, "helpfulness": "1/1", "author": "Frank Thornton \"Frank\""}, {"rating": 5.0, "review": "Fire TV is the best of all the internet TV boxes.  I own an Apple TV and a Roku 3 and this out performs all of them.Pros:-Super fast.-Has most of the apps I would want, Netflix, Hulu, and more.-Speech recognition is amazingly accurate-Controller does not require line of sight.  (I'm looking at you Apple!)Cons: (Not really cons but things that would only make the Fire TV better.)-Needs more Apps.  Not Amazon's fault developers need to write them.  I NEED MY CRUNCHYROLL!!-Would love for voice recognition to work with at least Netflix and Hulu.  Right now it only searches Amazon features.-Need a better way to block any pay for service from even showing up.", "verified": true, "helpfulness": "2/2", "author": "Thomas F. \"Denegra\""}, {"rating": 4.0, "review": "First of all, I am a \"techie\", and so I basically just got this device for its hardware capabilities for this price range. I also wanted to make use of my Prime account since I am paying for it anyways. My plan was to give this device to my parents, but I find myself liking this box as compared to other devices I have. I have tried the Roku, Ouya, Gbox Midnight and the MX2, and all of them have been for about 100 bucks. The Fire TV is a huge upgrade in speed, which is nice. Not once has it stuttered when I switch titles or windows or anything (not talking about video playback, which depends on your Internet speed). I rooted it and put XBMC on it. I do wish Amazon would let you side load apps on it. Finding alternative methods to side load is stupid and a waste of my time. The official app store for this device does not have much of anything good on it, and allowing apps from the Google Play Store would be great. I know much of those apps will not work correctly on here, but at least give us the opportunity to try it for ourselves and make that choice. I also wish Amazon let me customize my menus and options on the screen. Currently to get to my sideloaded apps I would have to go to settings, then applications, then find the app. Why can't you just allow me to put my app on the home screen area or something similar. It is a hassle.Also, since I plan on giving this to my parents to enjoy, I wish there was just a section with only Prime videos. That would make it way easier on my parents who may have a hard time figuring out which videos are available to view with Prime and which ones they will need to pay for. Its not hard to do Amazon. Just do it already. The current interface is too messy and not intuitive. Also, I don't remember being able to view all of the listings under a genre, which is odd. My dad loves westerns, and so it would be handy if he could go to a \"western\" genre listing where he could view all that Prime had to offer. By using the method Amazon currently has, you kinda have to already know the name of the movie you want to watch and then search for it specifically. Very annoying. Please rethink the way you present your content to users. Some people do want more complicated and specific options to view the content.Also I found that the wireless on this device seems to occasionally lose signal out of nowhere. I don't know if that is just my device or a problem across all of them. I am not far from the wireless router, and I noticed the problem extends to when I connect directly with Ethernet.Overall the device is definitely worth the money. I have trust that Amazon will someday fix the way content is presented to customers for Prime videos, and I am still a little mad that they will not create an Amazon Prime Video app for Android (other than its own devices). If I am gonna pay for Prime, I would they they would want me to use it as much as possible, which I cannot do if they don't offer it on the most widely used mobile OS. Poor decision. Just for the specs alone, the device is worth it, but the software leaves a lot to be desired. Cannot give five stars until they fix those problems.", "verified": true, "helpfulness": "2/2", "author": "Manuel Navarrete Jr."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Theresa G."}, {"rating": 5.0, "review": "soooo happy with my amazon fire tv! my blue ray had Netflix and Hulu already but i couldn't watch my amazon prime tv. Love climbing into bed at turning on an episode of before I fall asleep.", "verified": true, "helpfulness": "0/0", "author": "chelsea whitmarsh"}, {"rating": 3.0, "review": "Good 1.0 device.  The Fire 4k TV (Fire TV 2.0) is great though (5 stars, really good industrial design, cell phone remote, USB 3 storage, 8GB RAM).  Who would have thought Amazon would dominate the console market in 2015, by leveraging Nvidia's K2 processor, adding USB storage, and they've added 4k capability that Xbox one and PS4 can't match.  By partnering with Steam and GOG and lowering the \"console\" tax Microsoft and Sony have been charging for years, they've created another platform that's faster, cheaper, and more accessible, and more \"open\" with higher profits for game companies.  I'm really excited by Amazon's upcoming game titles as well (a new co-op sim earth...it's genius).", "verified": false, "helpfulness": "2/5", "author": "Pimpernel Sandybanks \"Jeff\""}, {"rating": 5.0, "review": "Great User Interface (UI) well built, and nice all around. Its nice to be able to watch Amazon Prime streaming video/music on my television. I do want to buy more for the other TVs. But does that mean I can only use one at a time? That's the only thing stopping me right now.", "verified": true, "helpfulness": "0/0", "author": "M. Pascual"}, {"rating": 5.0, "review": "Prime tv rocks", "verified": true, "helpfulness": "0/0", "author": "Pennysworld"}]