[{"rating": 5.0, "review": "I love this thing! I use it all the time now for watching movies and netflix shows. It is awesome", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 5.0, "review": "I simply cannot say enough about this technology! Wireless! I can watch pretty much anything I can bring up on my computer! Easy to install, I am no tech savvy individual..this is as easy as plugging in a flash drive! A TV that is flash drive capable is required.", "verified": true, "helpfulness": "0/0", "author": "Woodi \"Sylvia\""}, {"rating": 3.0, "review": "I am surethat this chromesast adapter space is a good one. Double spacedhowever it does not work with our proxy server any suggestions?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My husband and I are fans of Netflix and until we got the Chromecast we were watching on the laptop........now we watch movies and shows on our 42 inch tv......what a difference!!  Such a great item for a great price!!  Would recommend to anyone who would like to stream movies to their tv.", "verified": true, "helpfulness": "0/0", "author": "Amy in Hamilton \"Happy Shopper\""}, {"rating": 5.0, "review": "now with the code being available to develops and more and more apps coming out that support Chromecast this is quickly replacing my cable TV.... And for $30 come on.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I use this device on my guest room's TV.  Being I never wired this room for cable-TV, the Google Chromecast is perfect when we have guests stay over, as they're able to access Netflix and other streaming-based apps.  My one complaint is browser-based content streaming is not available.  Other than that, the device works especially well with NetFilx and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Scott R. Parrott"}, {"rating": 5.0, "review": "OK forget those who engage in pouring this device down.  Does exactly what it is suppressed to do. There are some amazing apps out there that takes this device from oh yes to....... Yes set up is easy as pie. Runs off many devices.  So to be fair here I took it in vacation and did not work in the hotel we were in but that was only because their internet was snail slow.  Just buy this you will not be bummed", "verified": true, "helpfulness": "0/0", "author": "Paul J. Louviere \"Gumshoe\""}, {"rating": 3.0, "review": "It makes my wireless ping go through the roof. That is totally unacceptable when my brother and I play games on the same internet connection. It's great though if you have a laptop and want to watch a movie in a browser window, or need an easy way to show a youtube video.", "verified": true, "helpfulness": "0/0", "author": "Tony D."}, {"rating": 5.0, "review": "I purchased this for travel and general use.  There is not a day that goes by where we don't throw something up from our computers in the office to the TV using Chromecast.  Great little device for the money!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "I love using Chromecast! It's the cheapest and easiest way to connect a 'dumb' tv to all the streaming services (with the notable exception of Amazon Instant Video).When I first started using Chromecast, it was limited to a handful of apps. Now, though, it's an open API and developers can and do bake casting into their media apps. Netflix, HBO Prime, Plex and YouTube cover most of my media needs, and now they're all available on any TV thanks to Chromecast.", "verified": false, "helpfulness": "0/0", "author": "SMN"}]