[{"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "1/2", "author": "andyQ"}, {"rating": 5.0, "review": "I must admit, I was more impressed with the packaging than the layout of the home screen.It snappy and works flawlessly but the menu just looks like a cluttered mess. It is easy, for me at least, to get lost in what section I'm looking in. I hope Amazon has some updates for this layout coming in the future.Aside from the layout, I would recommend this to anyone.", "verified": true, "helpfulness": "2/3", "author": "ToyBeans13"}, {"rating": 2.0, "review": "It seemed great in the beginning but you'll soon find out that everything you want to watch is not on Prime and cost to watch each episode.  You'll get a couple seasons of what you want free with Prime but the third and on will cost approx $35.00 ( which is free on TV if you want to watch when it airs ) I'm finding this with everything I like to watch.  I don't use this much anymore and am looking into other options.  One good thing I can say about it is that there is no buffering on my network and the picture and sound is very good.  I wanted to watch the movie \"The Graduate\" with my wife last weekend, guess what, it cost $5.00  (a 1967 movie I just saw was free on cable earlier that day).  I've been thinking about cutting the cord but this is not the option.  The only movies that fall under the \"Prime\" free umbrella are B-movies or old movies.  If you don't mind paying for each episode you want to watch, then it's OK.  I understand they have to pay for the content, but $3.00 per episode in HD and $2.00 for SD on a six season series is too much.  I wouldn't buy the Fire Box for this cost but Prime Video service is available as an app if you have an XBOX and want to dig for an occasional movie. Other than that, it's useless to me.  I'm going to look hard at the Roku 3.", "verified": true, "helpfulness": "3/7", "author": "Jim Davis \"A very picky consumer\""}, {"rating": 1.0, "review": "I never write reviews but please do yourself a favor and go with another streaming device. Even though the concept of the Amazon Fire TV is great is does NOT keep up. My problems started a few months before the warranty was going to run out. The device was just not responding anymore. I called customer service and even though they were very helpful they could not resolve the issues. They thought it was the remote control but just a little while later it became clear that it was the device itself. Of course by that time the warranty had run out and they would not accept the fact that the problems started within the warranty. I've heard from other people who've had trouble with Amazon devices, including the phones but I was hoping they were just bad mouthing it. I love Amazon and all it's services but now since my Fire TV is not working anymore and they won't replace it without me paying for it I will also have to cancel my prime membership, since I won't be able to watch any of the movies or TV anymore. It's a shame really and I'm super upset they would not replace the device. I've had my apple TV in the other room for years and have never had any problems with it. Too bad!!", "verified": true, "helpfulness": "4/9", "author": "Vee"}, {"rating": 5.0, "review": "Love the Fire TV. I had a roku 2 before this and its way better than the roku. The roku had to buffer a lot but the fire tv never has to buffer and its worth the extra money just for that alone. About to buy a second one for the bedroom.", "verified": true, "helpfulness": "3/4", "author": "James Springs"}, {"rating": 5.0, "review": "Way better than chromecast, Apple tv, and Roku.Faster, more power and gaming.", "verified": true, "helpfulness": "2/3", "author": "Mr Doobie"}, {"rating": 5.0, "review": "Just a followup review on this product. We have been using it (rather heavily) for over a year. It is still working as good as new. We purchased the game controller that is used with it, and it has provided many hours of fun for the grandkids. We have gotten to use this so much with Amazon Prime that we cancelled our other service. Thanks for the quality product.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wow, I was shocked at how easy the Amazon Fire TV is to use. It is sleek, easy to grip, and superb in design. Great Job Amazon!! Also, I had the Roku 2 previously for several years and it would stop so many times in any part of a show and say searching......, etc. Became extremely frustrated; therefore, I finally took the time to review the Amazon Fire and I'm so glad I did. We love it!!! Thank you Amazon", "verified": true, "helpfulness": "0/1", "author": "GinaT"}, {"rating": 5.0, "review": "Phenomenal product. I have all the Apple TV versions since the first and this Fire TV puts the Apple TV to shame. Apple should be embarrassed for their product. This product is fast, you can hide it because the remote does not require a line of sight, you can talk to it, searching is intuitive, and the whole interface is simply excellent. I love it!!!", "verified": true, "helpfulness": "0/1", "author": "Charles E. Marriott III \"humanwisdom\""}, {"rating": 3.0, "review": "A little expensive compared to Apple TV which I have not used.The voice command is only good for Amazon Prime or getting videos to buy from Amazon.Not what I was hoping for.", "verified": true, "helpfulness": "3/6", "author": "Clayton Buie"}]