[{"rating": 1.0, "review": "My chromecast is not even loading anymore. At first I thought it was my WIFI connection but if my WIFI connection was spotty I would assume the chromecast would pick up the connection sometimes but it is not loading at all anymore. I've only had this product since March so I'm pretty disappointed with my purchase.", "verified": true, "helpfulness": "0/0", "author": "roci02"}, {"rating": 5.0, "review": "I put one of this in every one of my TV's in the house. It's very nice. I watch HBO Go on it all the time. Good job Google!", "verified": true, "helpfulness": "0/0", "author": "Ming Paul Wang \"student007\""}, {"rating": 5.0, "review": "Great Product! Just Contect to HDMI on TV, download the app onto your phone, laptop, or other devices, then Set Up or Pair, then start using. I Use it mainly with my cell phone which acts like a remote, for Netflix, Youtube, etc... I suggest you look for other compatible apps that will help you cast to the Chromecast because Chrome does not have an extension on most cell phones. So by using other extentions casting apps  (Vega, Web Video Caster,etc..) it opens up the posiblities of really allowing you to use whatever you are watching on your phone to the tv. This way you can really cast everything, every website, etc...", "verified": true, "helpfulness": "0/0", "author": "Ethel"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "BAJI THOMAS"}, {"rating": 4.0, "review": "Arrived on time & as ordered.  easy hookup to tv - works fine most of time but do have times of trouble with reloading.  not sure of cause at this time.  using for netflix loading thru phone & think my phone provider may be reason since we get a lot of no connection messages.", "verified": true, "helpfulness": "0/0", "author": "F. Sowecke \"FMS\""}, {"rating": 5.0, "review": "Life changing. Thank you google.", "verified": true, "helpfulness": "0/0", "author": "PhotoRyan"}, {"rating": 3.0, "review": "Doesn't work well - skip this and get Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Ashlee Heartt"}, {"rating": 5.0, "review": "I love this! Wonderful to be able to stream netflix on my tv!", "verified": true, "helpfulness": "0/0", "author": "Rachel Keller"}, {"rating": 5.0, "review": "Bought this as a gift for a mac fanboy who always thought about buying the Apple Tv instead of this. Set-up was super easy, same as pairing with different devices, iPad included. Now this is all he ever uses.Another great product from Google.", "verified": true, "helpfulness": "0/0", "author": "MChaves"}, {"rating": 5.0, "review": "Great concept excellent product.  You'll wonder how you ever lived without it!", "verified": true, "helpfulness": "0/0", "author": "USMCEE"}]