[{"rating": 5.0, "review": "I pretty much knew what it would be before I got it. It's really nice to use during parties and such. My family was over and we had a blast using it and showing each other videos. I don't have netflix or Hulu plus so I'm pretty limited to what I can do. I'm hoping for more great compatible apps but for now there's only a few to choose from. I think it's definitely worth the price if you don't have a player or tv that can already do this.", "verified": false, "helpfulness": "0/0", "author": "Kade Jackson"}, {"rating": 5.0, "review": "I was contemplating an accessory for two of my TVs where I wanted to play Netflix and other movies.  I chose to try this little compact Chromecast device and it's wonderful!  I could not believe how easy it was to set up and get running.  My TV had a powered USB port as well, so I didn't need the external power supply.  I can control the device easily from my cell phone or tablet.  I like the way I can transfer my favorite youtube videos to play on the big screen as well.  Great invention!", "verified": true, "helpfulness": "0/0", "author": "bk-Idaho"}, {"rating": 5.0, "review": "Have a Google SmartTV, and was about to buy another one at $2000. Not now! Big screen TV for $600, Chromecast for $35 ($29.50 at BestBuy), cancel Cable service and save another $150/month, and STILL watch all the shows we love! Between Netflix and Hulu, we've got almost everything. Wish Chromecast would add Google Play, but I'm sure that will come in time. In fact, I imagine the day will come where I can go straight to my CW App and stream from there. Can't wait!!! Will buy another one for the other room and will promote every chance I get!", "verified": true, "helpfulness": "0/0", "author": "shelly"}, {"rating": 5.0, "review": "Great technology that can hook up your device to the tv. Really fast shipping and good price. Great gift for continence and handy that it doesn't need any cords.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 1.0, "review": "My techie son gave me this for Christmas. I am a retired IT specialist and all around tech geek so I love stuff like this. I was impressed with the capabilities of the little stick. The setup was straight forward and I could run it with all my wireless host devices. After that fun was over I was thrown into a fit of disbelief that such a technical wonder is limited to be able to do almost NOTHING... just Netflix, Youtube and a bunch of worthless media \"access services\" in which I have NO interest. The only Chromecast App I would be interested in beyond Youtube would be Amazon media streaming but such an App does not exist and there is no way to stream my own content. I am going to have son dump this thing and I will get a second SONY Bluray with WiFi and streaming. I wonder how many of these things Amazon will be getting back and then reselling from their Warehouse.", "verified": false, "helpfulness": "1/4", "author": "J. C. Danko"}, {"rating": 5.0, "review": "Great for Netflix, YouTube, and Pandora. Easy to set up and use with all my devices (android) and my girlfriends (iPhone). Gave me the \"smart tv\" functions I was after.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 1.0, "review": "Periodically I have to unplug the power and reboot this (and once I had to re-setup its network connection). When it works it is great, especially with YouTube. For Netflix, if you have a computer or laptop that you can plug into your TV, with a wireless, go with that, because Chromecast doesn't go to next the episode. In other words, for TV series binges, you have to advance to each episode.Revised 1/2/2014OK, finally given up on this, it's a piece of crap. It doesn't seamlessly set-up; I have to re-set it up about weekly, it has a hard time finding our wireless network (router is right next to it and all other laptops are connected) and tries to connect to our neighbor's. Usually after 15 minutes of frustration we unplug it and just use a laptop. $35, you get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "J. Wilson"}, {"rating": 1.0, "review": "Chromecast sounds like a neat little device, but I wouldn't know because it won't work, either with my laptop or my phone.  Apparently, it doesn't like my router, but I'm not going to spend any more time mucking about with it than the hour I've wasted.  Everyone else seems to be able to make plug and play devices, but that's seems too great a challenge for Google.", "verified": false, "helpfulness": "0/2", "author": "B. Tantlinger"}, {"rating": 5.0, "review": "I know there are tons of apps that allow you to stream on your TV, but I only wanted to watch movies/TV shows on the TV without having cable or excess wires. I'm sad that this product came out now instead of years ago because I would not have purchased many things (e.g. PS3, cable, xbox) which were all used for streaming media instead of gaming. I like that this product streams in a clear, HD picture. Be warned it is reliant upon your internet speed and will buffer from time to time (just like your phone) if you do not have reliable internet.I hope that this allows Amazon streaming in the future!", "verified": true, "helpfulness": "0/0", "author": "Renee L. Wells \"temple owl\""}, {"rating": 5.0, "review": "Bought this just to play around with it. I basically have stopped watching TV. I watch everything from my Mac to the TV now. There are new app that are apple to use chromecast every week. I think I'll keep it for a while!!!", "verified": true, "helpfulness": "0/0", "author": "Brian"}]