[{"rating": 5.0, "review": "Super easy to use just plug it in your tvs USB port and start casting your favorite shows to your TV", "verified": true, "helpfulness": "1/1", "author": "JustJamie215"}, {"rating": 5.0, "review": "Its a must buy!", "verified": false, "helpfulness": "0/0", "author": "G. Orlando"}, {"rating": 1.0, "review": "I bought this with one thing in mind. I have an external HD with hundreds of DVD's in folders with folder names of VIDEO_TS and full of files with extensions of .BUP, .IFO, .VOB, etc. and I had that HD plugged into my new Wi-Fi router that has a USB port on it so the drive is shareable to any device on my network. I actually exchanged emails with the Streamcast developers before buying this device to see if it would handle this, they assured me it would but may have buffering issues. You see, Streamcast is a plug-in for Google Chrome. The Streamcast plug-in talks to my external HD and can see and play the movies on there and send those to the TV but it's a pretty convoluted thing and it's kinda like it used to be when watching YouTube videos and the video starting and stopping while the buffer catches up. So, my laptop running Chrome and Streamcast would retrieve the video files over Wi-Fi, then it would have to transcode the files and send them over Wi-Fi to the Chromecast that was plugged into my TV. While this worked I had terrible buffering issues. And while I have a pretty fast laptop (I5 processor, 4GB RAM, SSD) and a very fast Wi-Fi network this wasn't a workable solution for me. I ended up returning it to Amazon. I had to eat the return shipping because the device wasn't technically defective. Good thing it's light and cheap to ship!I solved my problem by buying one of these instead:http://www.amazon.com/Live-Media-Player-Wi-fi-1080p/dp/B005KOZNBW/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1406753539It works beautifully! Sorry Amazon, I bought it from someone else a bit cheaper because it was on sale ($70 after rebates). But the HD plugs directly into a USB port on the WD device and then out the HDMI cable to the TV. Flawless, subtitles even work! But I digress, that's not this device. :o)", "verified": true, "helpfulness": "1/3", "author": "Dennis"}, {"rating": 5.0, "review": "For the price, this is amazing.", "verified": true, "helpfulness": "0/0", "author": "Kazem Edmond"}, {"rating": 1.0, "review": "only works with netflex", "verified": true, "helpfulness": "0/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Anyone with an Android or iOS device looking for smart TV functionality need look no further.  I wouldn't even bother purchasing a smart TV, knowing the Chromecast gives you so much functionality -- Netflix, Hulu, etc.  $35 on this beats the heck out of a Roku or any other similar device.  I just wish the Chromecast could do Dolby surround.", "verified": true, "helpfulness": "0/0", "author": "Adam Heinrich \"liteon1\""}, {"rating": 5.0, "review": "Excellent streaming device for android. Does what it's supposed to very well. Some glitches with IOS though.", "verified": true, "helpfulness": "0/1", "author": "M. Singh"}, {"rating": 5.0, "review": "I use this primarily as a Plex streaming device. Plex is a server that allows you to stream movies that you own, to certain devices. So being able to have all my movies on my computer and not having to deal with swapping disc every time is a huge benefit. This plays back anything that i throw at it with ease. There's no lag or anything when i chromecast my media to this bad boy.Also, chromecast is now able to beam your smartphone screen to the chromecast. Lots of apps have charged for this feature but now google is allowing it for free (in beta now for certain devices)Highly recommend this device, even though it has some short comings like amazon prime videos, but for the price you can't complain.", "verified": false, "helpfulness": "0/0", "author": "Romans"}, {"rating": 1.0, "review": "It worked for first 4-5 days. It was really convenient to cast from your phone to the TV and don't have hook it up. When it get hot (usually about 2 hours or so) the device will not be recognized by TV anymore. I thought it might be the TV, so tried it on another TV and the same thing happened.It compatible with a lot of apps such as abc, ESPN, etc. But when you download the apps, some of them you can find the cast button some you couldn't.It is a cheap product but what's the point if it doesn't work properly.", "verified": true, "helpfulness": "0/2", "author": "nga vu"}, {"rating": 3.0, "review": "If you are only streaming one COMPATIBLE device to a TV set located within 2-3 feet, then MAYBE with will be ok...I found that the video freezes/skips and many applications were not compatible.", "verified": true, "helpfulness": "0/1", "author": "Tech-Guru"}]