[{"rating": 5.0, "review": "When the Chromecast first came out, I looked again into the whole streaming devices, and ended buying a Roku. Before Christmas, Google released a number of additional apps for the Chromecast and I bought one on top the the Roku I already have.Long story short, I end up using the Chromecast much more than the Roku. Both do basically do the same thing but the Chromecast is much easier to use.", "verified": true, "helpfulness": "0/0", "author": "coffelover"}, {"rating": 3.0, "review": "Interface with Windows XP is suspect, but it's a neat device for operating systems that support it.  More support for applications is necessary, such as StreamTorrent", "verified": true, "helpfulness": "0/0", "author": "James Neumerski"}, {"rating": 2.0, "review": "Can not run with chrome on iPad and Safari.  I buy connect with tv it easy.  Need more application and extend.", "verified": true, "helpfulness": "0/0", "author": "John C."}, {"rating": 5.0, "review": "This thing is the truth. For $30 I can watch soooo much in such a convenient matter. We use it all the time in my place for Netflix and HBO Go and Youtube. Great for parties to play music videos and for watching moves. Finally I can rid myself of the pain in the ass cords and dongles. My laptop sits right next to me or I can use it to browse other sites simultaneously while watching movies.", "verified": true, "helpfulness": "0/0", "author": "Damien H"}, {"rating": 3.0, "review": "Good to be able to watch you tube videos on the television, but other than that it doesn't do a good job with Netflix or handle Amazon Prime.  And one must have a Chrome browser computer, Android phone or tablet hooked up to Wi-Fi to make it work.", "verified": true, "helpfulness": "0/2", "author": "Love Orcas"}, {"rating": 5.0, "review": "Love this.  Easy to connect. Comes with all you need.  And a good price. I had to buy a second oneà", "verified": true, "helpfulness": "0/0", "author": "Turtlehart \"Turtle\""}, {"rating": 5.0, "review": "I ordered my first Chromecast as soon as I heard about it, and I have since purchased 6 more (1 for another TV and 5 gifts). Not only is it fun and useful enough to recommend to friends, it's also inexpensive enough to give as a simple gift. I can't really speak to its ease of use since I'm somewhat techie. That said, I have had no problems using it from my Android tablet and phone as well as my Macbook Air and PC running Windows 7. Some people have pointed out that an Apple TV or next-gen game console offer the same functionality, but you're unlikely to buy such a device for every TV in the house. The Chromecast is inexpensive and simple enough that you can put one on all your televisions not hooked up to media servers and still access everything everywhere!", "verified": true, "helpfulness": "0/0", "author": "JCo"}, {"rating": 5.0, "review": "Have to have a router to use it and is a great product. I bought 2 of these. One as a gift and and one for me. It is getting  better and better the more compatible apps come out for it. It is unfortunate it is not a full browser but only 35.00 and well worth the cost.", "verified": true, "helpfulness": "0/0", "author": "mark hernandez"}, {"rating": 5.0, "review": "Pros:Easy SetupInexpensiveSmall form factorCons:Very few apps (only ones supporting certain streaming services)Difficult troubleshootingConsiderations:Do the research as to whether this fits your needs, it doesn't display your screen, it streams limited apps, and it can only be used with home wifi.Feel free to ask me questions!", "verified": true, "helpfulness": "0/0", "author": "Trinathon \"-The Wizard\""}, {"rating": 2.0, "review": "Box says \"Send video or anything on the web to your TV from your smartphone, tablet or laptop\"  Unfortunately \"anything\" doesn't include video from websites like CBS.com  full episodes of TV shows, or any other streaming video you can find by searching the internet.  At least I have not been able to figure out how to do it.  All the on-line research says it only supports YouTube and then some other video applications that you end up having to pay for.  Therefore, I feel it is a bait & switch and is not as advertised. I can't send MOST of what I want to watch from the web to my TV using this device.  :-(", "verified": false, "helpfulness": "0/1", "author": "Duane D. Clark"}]