[{"rating": 5.0, "review": "Love this connection for my computer to TV.  You must use Google, which is OK.", "verified": true, "helpfulness": "0/0", "author": "crbrio"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Monica Elisa"}, {"rating": 4.0, "review": "Works as advertised!", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "I love this product for using with Netflix.  I wish that I could use it for Directv's GenieGo too, though.  It's very simple to use.", "verified": true, "helpfulness": "0/0", "author": "Courtney Hawk"}, {"rating": 5.0, "review": "Yes, i like much.", "verified": true, "helpfulness": "0/0", "author": "alberto morking neto"}, {"rating": 5.0, "review": "This is great!!! So easy to set-up even for me a non technical person. Expands my TV selections without the high cost of cable.", "verified": true, "helpfulness": "0/0", "author": "kathy1"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Oscar"}, {"rating": 3.0, "review": "I am glad that this was invented. Screen resolution is amazing. But did not give 5 stars because of one flaw; IF YOU DON'T HAVE WIFI THE PRODUCT IS USELESS!!! I bought this with the hope to eliminate my Choice internet access and only use my phone internet for casting to TV wireless, but if you don't have internet with router THIS JUST DOES NOT WORK! I HOPE SOMEONE INVENTS A DEVICE SO YOU CAN TRANSMIT your phone image to the TV wireless.", "verified": true, "helpfulness": "0/0", "author": "Israel Urban"}, {"rating": 2.0, "review": "I use the chromecast with Netflix.It works well but it is not what I expect. I thought the Tablet or the phone would work like a remote control but instead of that they play the apps and send them to the TV. That last things dont work well.", "verified": true, "helpfulness": "0/0", "author": "Diego Duran"}, {"rating": 1.0, "review": "It doesn't working when my Amazon prime movie is on full frame.", "verified": true, "helpfulness": "0/0", "author": "Wook Kim"}]