[{"rating": 5.0, "review": "This is probably the best technology invention since the smart phone in my opinion!We currently have 3 of them in our house.We use them for Netflix, HBO Go, and more importantly Disney Jr and Disney apps.It's so simple to use even my 3 yr old know how to open  the apps and launch his shows.I also see Google is implementing features where you can control certain things with your remote which will be awesome.I'd never buy a Roku over this. The convenience of using your phone over a remote is great. Plus no box taking up more space. The feature will only increase as well as more and more apps utilize Chromecast.", "verified": true, "helpfulness": "0/0", "author": "S. Helderman"}, {"rating": 5.0, "review": "This worked exactly as advertised. I ended up buying one for my son-in-law and he loves it also.", "verified": true, "helpfulness": "0/0", "author": "K. Michael Krumbholz"}, {"rating": 5.0, "review": "Way better than typing with chinsy remotes", "verified": false, "helpfulness": "0/0", "author": "Jboykin325"}, {"rating": 4.0, "review": "I love my chromecast. I wasn't really sure what it was at first other than casting you phone into your tv, but pretty much you can cat any video in the internet via chromecast.  Love it! I watch all my shows and movies that you'd find at redbox.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my Chromecast! And they are adding new apps all the time so it keeps getting better!", "verified": true, "helpfulness": "0/0", "author": "Robyn Skrebes"}, {"rating": 5.0, "review": "Bought this for a relative for Christmas and decided that I had to have one.  BEWARE! it may cause you to buy another Laptop computer.  The unit works just fine with my phone and tablet but my laptop would not cast to the tv with the Vista platform I was still using.  I soon figured out that I could cast anything on the internet to the TV screen.  I had to upgrade my lap top computer.  Most everything I try to cast through the google chrome browser will cast with the exception that some videos through Amazon and sites like Encore play will not cast through google chrome. They require the Silverlight plugin that is only used by IE.  I have not yet figured out how to overcome this hurdle but I may be able to do it through Firefox. That's my next adventure.", "verified": true, "helpfulness": "0/0", "author": "Alyce Ann Clark"}, {"rating": 1.0, "review": "Got this a month (February 22nd)ago for my mothers birthday it's now been in the back of the tv since then and less then 40 days later it's broken? No light comes on and I tried a different USB cable and tv, so I know it's the device.  What the hell. Waste of money don't buy!", "verified": true, "helpfulness": "0/0", "author": "William abdenour"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "jesus maldonado"}, {"rating": 1.0, "review": "not useful at all", "verified": true, "helpfulness": "0/0", "author": "Ahmad"}, {"rating": 1.0, "review": "You can buy it enjoy it for a couple months. It will stop working eventually.", "verified": false, "helpfulness": "0/0", "author": "Rousseau Gregory"}]