[{"rating": 5.0, "review": "This product is fantastic, it's small and sheap. The only problem is that I couldn't put google website on screen.", "verified": true, "helpfulness": "0/0", "author": "Milena K."}, {"rating": 3.0, "review": "I have not been able to use this product because it is not compatible with my Windows RT tablet. I am hoping to use it when I power up my laptop again.", "verified": true, "helpfulness": "0/1", "author": "Ehsents \"E Platess!!\""}, {"rating": 5.0, "review": "Taking laziness to a whole new level - i can just watch my you tube videos etc on the big screen but the touch of an app - I LOVE IT !!!!!!!!!!!! Best buy ever after my Nexus 5.", "verified": true, "helpfulness": "0/0", "author": "Nastassia"}, {"rating": 5.0, "review": "I bought this to use Plex on my TV and it works perfectly! Love it! Had no problems syncing berween my Samsung S3,  my roommates IPhone and IPad. I could switch between devices so easily", "verified": true, "helpfulness": "0/0", "author": "Bronson"}, {"rating": 5.0, "review": "This dongle works great!I don't have a Smart TV, this turns my LED TV into a YouTube player.The 1080p HD display is great.Overall, this dongle is highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Ben.SW"}, {"rating": 3.0, "review": "I notice that this keeps fluctuating between $35 and $29.99. As other reviewers have mentioned, there's no remote to it, and the apps to control it are not on the device itself, rather you need another piece of equipment. If I were you, I'd wait a few days until the price drops to $29.99 to purchase this. I love that you can chromecast from your mac, that DOES work well, however, it's not exactly as nice of a mirroring capability as an apple tv is, if that's what you're going for, but for a third of the price, you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "richard mojica"}, {"rating": 5.0, "review": "Took me a bit to figure out how to use it with the setup I have, but once I did.... Awesome! My husband and I can now watch netflix on our regular television without having to squint at my 7\" galaxy tablet screen.  Be forewarned, hardly any \"set up\" instructions come in the box, but they do have a website to help you out if need be..  Definetly worth the cost!! Also, for those who do not know, it DOES have to be plugged into a power supply for during use.. (My setup: using a samsung galaxy tab 7 - with built in Internet from Verizon, an my iPhone 4s: with this combo I am able to use the device... The tablet is the \"go between\" from my phone to the tv..)", "verified": true, "helpfulness": "0/0", "author": "anna m bivin"}, {"rating": 1.0, "review": "If I could give zero stars, I would.  These devices and associated software do not work, or work only intermittently.  I should have done my homework and research before ordering.  It might work for random users if the stars align properly, but there are just too many problems.  And I'm the IT guy that's supposed know how to get  this stuff to work.  But I'm not going to replace my whole infrastructure just to get a $35 dongle to spit out bad video.Google should be ashamed for putting a faulty device on the market.", "verified": true, "helpfulness": "0/1", "author": "newuser"}, {"rating": 4.0, "review": "does a pretty nice job streaming netflix from my phone.  just needs a couple more applications before i am really impressed!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 1.0, "review": "So...I wanted to like this, and did...while it worked! I received it as an Christmas gift and it has literally fallen apart just from sitting in my television.Too bad the quality is so poor, the price was great and perfect for what we used it for.", "verified": false, "helpfulness": "0/0", "author": "M Beck \"M Beck\""}]