[{"rating": 5.0, "review": "Really nice", "verified": true, "helpfulness": "0/0", "author": "Kristina Biggs"}, {"rating": 5.0, "review": "Very easy to connect and set up.  I can't tell any difference between watching a movie on the Amazon Fire TV or on my Blu-ray player.  It is nice that I can also listen to my music that is stored in the Amazon Cloud.  I am extremely pleased with the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Rodney J Carter"}, {"rating": 4.0, "review": "It just works!  Easy Setup, configuration and operation.  Only missing a browser . . .", "verified": true, "helpfulness": "0/0", "author": "John H. Bolton \"John Bolton\""}, {"rating": 3.0, "review": "Still learning how to navigate through this, also thought that the Amazon Prime came with this free for a year, but it doesnt ...", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "Awesome product.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 1.0, "review": "It is awesome great way to spend these rainy cold days easy access to tv shows and movies", "verified": true, "helpfulness": "2/5", "author": "georgia stafford"}, {"rating": 5.0, "review": "Love it. Now I can watch my prime movies without subscribing to a premium channel.", "verified": true, "helpfulness": "0/0", "author": "Lisa G."}, {"rating": 4.0, "review": "My only complaint is the buffering.  I can run my laptop or tablet with wireless connection and never get buffering but the Fire TV I get the occasional buffering.", "verified": true, "helpfulness": "1/1", "author": "Bryan"}, {"rating": 5.0, "review": "Netflix, Hulu+, and Prime Instant Video all in one easy to use device! What's not to like? I have an Xbox One that could do many of  or all of these things, but the Fire TV interface is just so much easier to use, and the device is silent as a bonus.The only complaint I have is that I feel that the voice control could use some work before it could supplant button mashing on the remote. Since the remote works well it isn't a big deal. Regarding the remote though. I keep accidentally hitting the home button when I mean to hit play when fast forwarding or rewinding. It's a minor issue though, and not enough to take a star from a 5-star device.I chose this over the Nexus Player because I feel that Amazon's video services are superior to Google Play. For Google Play to catch up the need a subscription service with content that's both desirable, and not on the other services. HBO programming, and Prime Instant Video in general adds a ton of value.  Google has only what you buy a la carte.", "verified": true, "helpfulness": "0/0", "author": "Jasper994"}, {"rating": 4.0, "review": "Great little box that can handle streaming 1080p videos through XBMC add-on, sadly not enough space on the product to handle the movie collection for XBMC display. If you are looking for something that streams or turns your standard tv into a smart tv, this is a solid buy and is better than the other products out there. The voice feature is nice and works well. There is no power button and can get warm (should have added a tiny vent). It is also a fingerprint magnet and shows any touch to it. Still would recommend this to anyone looking for a streaming player.", "verified": true, "helpfulness": "0/0", "author": "durty"}]