[{"rating": 1.0, "review": "Confusing Channel Setup and not that many Channels like Rocu I sent it back.", "verified": true, "helpfulness": "2/10", "author": "Uwe"}, {"rating": 4.0, "review": "This device is well worth it,  Best bang for your buck.  Happy with this little device, has made my living room that much interesting.  Very fast, easy to use for the whole family and responsive with a small click of a button.  Wish there was an off button when not in use... otherwise very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Felix G. Ramirez"}, {"rating": 2.0, "review": "I thought that the selection of movie and shows was somewhat limited and certainly less then what I have expected.  They claim to have a large number of movies and TV shows, but it seems like everyone that I want to see it not on the free list.  It would be great to have a way to filter only free shows and movies.", "verified": true, "helpfulness": "3/4", "author": "Mike Plaizier"}, {"rating": 3.0, "review": "I have owned the Apple TV (Version 1) and wanted an update that could do more, and play more content.I admit, I dont have a lot to compare against for modern boxes (well other than my xbox360).  I and not interested in the gaming aspect, just wanted a TV box, and I have not tried voice search, but guessing its not going to work for local content.I will update this review as i use it more, but here is my quick overview:First impressions:  Its just a custom android tablet on the big screen with a dedicated \"only\" movie selection as the default screenLikes:  o) Small, easy to use controls, and super clean design  o) Setup was supper simple - two cables and turn it on. that easy  o) Access to amazon content is easy to use, and excellent video feed.  o) Works awesome for Prime content (gets 3 stars for this alone)Dislikes:  o) No way to skip the freaking long setup movie (lucky its only one time)  o) No Showtime - yea it's listed as supported, not if you have DirectTV.  o) No HBOgo  o) No easy way to access local content. Purchased the Plex app, and honestly its not very goodOverall, there is no clear differentiation from this and my XBOX360, so i cant say i would buy this again if offered the choice.", "verified": true, "helpfulness": "2/4", "author": "Diivious"}, {"rating": 5.0, "review": "I returned my Roku 3 for the Amazon Fire TV solely because of the difference in the remotes. The Roku was slick in my hand, hard to grasp and laden with single function small buttons; not intuitive. The Amazon version has a more tactile feel and the big multifunction button at the top is so logical that I didn't even have to play with it for a while. I just started watching movies.", "verified": true, "helpfulness": "1/1", "author": "Cedar"}, {"rating": 5.0, "review": "The best video streaming device I've owned. Extremely fast the the voice search is a great feature. Ive owned the Roku 3 and the Apple TV; the fire beats them both.", "verified": true, "helpfulness": "1/1", "author": "David Pamintuan"}, {"rating": 3.0, "review": "BEWARE... If you are buying this thinking that, with your Prime membership, you\"ll be able to watch all your favorite TV series,  well, that may not work out so well.  We were able to watch a few episodes of shows like \"Foyle's War\" and \"\"Poirot\"  free on Prime. then suddenly they were no longer available for free and, if you want to continue watching, there's a charge.  Sort of feels like they let you watch just enough to whet your appetite and then see how much they can get for each episode.Paraphrasing customer service response...  sorry, these shows just change periodically, maybe there's something else you can watch", "verified": true, "helpfulness": "4/8", "author": "R.E.C. \"nocsra\""}, {"rating": 5.0, "review": "Easy to hook up, and get any of the streaming service through.  I use it for Amazon Prime and Netflix mostly, haven't really tried any of the games on it.  I like the voice activated search as well, it was one of the feature I thought I'd never use, but the other day I was looking for something on Netflix and found myself annoyed that I had to enter the name instead of being able to just say it.", "verified": true, "helpfulness": "0/0", "author": "Zman17"}, {"rating": 5.0, "review": "Great device with great features.", "verified": true, "helpfulness": "0/0", "author": "J. R. Bender \"comfort\""}, {"rating": 4.0, "review": "Extremely brief review.Device pairs extremely well with HDTVs that accept HDMI. I use optical audio from this device and haven't experienced problems. The TV I am covering has a Blu Ray player without apps. Wanted to watch Amazon Prime, Hulu Plus and Netflix. Fast startup and reliable voice communication with remote. Small footprint. Some content not viewable with device without access to all services. Would buy again. Requires Amazon Prime to get most from device.Added bonus, has very pleasant screensaver when device not in use.", "verified": true, "helpfulness": "0/0", "author": "Robert Trimble"}]