[{"rating": 4.0, "review": "Overall, the Fire TV is a great device. The good certainly outweighs the bad.Good:-Easy to stream media content through, hulu,netflix, amazon prime are my top 3.-Useful for music apps such as Pandora-The games add value, if there are more like Sev Zero the system may actually be worth having for games alone (it would be nice if the controller were bundled with, in a say 140$, though)-It's dependable, I haven't had a single issue using mineBad:-No expandable memory. Even with a 16gb jump drive plugged in, the system doesnt recognize it. All you get are the 8(more like 5) GB you're given. Which means games will periodically have to be deleted as a result.-no off switch. You just have to leave it on until it powers down or unplug it.If not for these 2 negatives, it would have been a 5 for me", "verified": true, "helpfulness": "1/2", "author": "kyle kurtz"}, {"rating": 5.0, "review": "Love it can't complain easy to use very portable and just all around awesome product beats any thing else out there apple tv ruko chromecast all of them", "verified": false, "helpfulness": "1/1", "author": "Jimmy Crane"}, {"rating": 5.0, "review": "This device is very easy to use, covers all of the streaming sources that I use, and the voice command feature is unique and very convenient. All works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 3.0, "review": "The main reason I gave this 3 stars is because of the tiny remote.  It is so easily lost between sofa cushions or in bed that I glued a sparkly ribbon on it to be able to find it.  I expected more channels and apps. Another reason for the three stars is that it only has 1 HDMI output so if you have an older TV with only 1 HDMI input you can't hook up DVD player without manually switching the cable.  I am looking into a HDMI switch box, if that works the problem would be solved, but it is an added expense. Otherwise it is a super simple set up.  Plug it in, and attach the HDMI cable and that's it!", "verified": true, "helpfulness": "1/4", "author": "Carol Gevins \"boofreak\""}, {"rating": 3.0, "review": "I bought my device as an alternative to my roku3.Both are good but the roku apps and interface is still better.", "verified": true, "helpfulness": "1/1", "author": "Paul Craton"}, {"rating": 1.0, "review": "I bought it and i went overseas and i found out it works only in the USA.  oooops please indicate that it is only of the USA", "verified": true, "helpfulness": "3/12", "author": "Ahmed Almohanna"}, {"rating": 2.0, "review": "The device on paper is fantastic and if physically in the US , there is a lot of potential , but I'm working now in Iraq and this thing is almost useless, Cannot load any of the apps or games not even a simple browser . An android stick will be better, at least you have access to the android store which you do not have with this device. Only apps managed to load is Vevo .. but I can do the same with a lot cheaper devices", "verified": true, "helpfulness": "2/7", "author": "S. Hamoudi"}, {"rating": 4.0, "review": "I chose to give the Fire TV 4 out of 5 stars because it's a great little device.  The unit was very simple to setup (preloaded with all of my info), with a nice small footprint on my entertainment center, and it works flawlessly (especially the sound search, which I initially doubted).  I have both the Amazon Fire and Roku 3 and after a week's extensive use of the Fire TV, I've never experienced any loading delays or buffering issues during a program.  I'm not a gamer, but I've purchased a few and they work fine.  I do have 3 major issues with the Amazon Fire TV which seems to be echoed in many other reviews I've read so far.  1. No access to my Amazon Cloud Music.  2. Sound search is limited to Amazon content only, and  3. I'd like to see a greater selection of video apps (esp. Vudu where I already have some movies stored).  I would certainly recommend the Fire TV to a friend if they had everything attached to Amazon.  I would not if they had movies stored in other accounts to where there is no access, in that case I would recommend the Roku.  More apps and cloud music access would definitely rate 5 stars for me.", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "WE ARE INCREDIBLY PLEASED AND HAPPY WITH THIS AMAZON FIRE BOX!!! IT'S INCREDIBLE! AND SEXY!!! SLEEK AND BEAUTIFUL!!! VERY NICE!!! THANKYOU SOOOO VERY MUCH, AMAZON!!!! THIS IS A SURE WINNER ALLLLL AROUND!!!", "verified": true, "helpfulness": "1/1", "author": "Ginger"}, {"rating": 4.0, "review": "The Fire TV is almost perfect, except that it doesn't work with older, non 1080p TVs, and does not play well with sound bars hooked up via HDMI. Besides those two issues, the Fire TV works great. Hopefully the sound bar issue gets fixed because I do want to hook the device up via HDMI instead of having to hook up the Fire TV into my TV, and then have to separately hook up the Fire TV via optical cable.", "verified": true, "helpfulness": "0/0", "author": "aznmavboi"}]