[{"rating": 3.0, "review": "The chromcast itself is great but I now see why this is cheaper than the 30 dollar one in store. This DOES NOT!! come with an HDMI power cable you have to plug it into the wall or buy it seperate. Little frustrating it doesn't say that anywhere.", "verified": true, "helpfulness": "0/0", "author": "Ryan McGrath"}, {"rating": 5.0, "review": "Happy that I bought this.... very useful.", "verified": true, "helpfulness": "0/0", "author": "omnath dinesh"}, {"rating": 4.0, "review": "Mine works great. Great video; smooth with iphone.One drawback though: I can only get stereo sound instead of Dolby Digital.I went through a lot of reviews and could not find anything about this feature.", "verified": true, "helpfulness": "1/1", "author": "Amusepark"}, {"rating": 5.0, "review": "it is a good product and it  arrived on time.Es un buen producto, llego en el tiempo estimado.", "verified": true, "helpfulness": "1/1", "author": "Marco Gutierrez"}, {"rating": 4.0, "review": "Works well but dependent on portable device app developers to deliver apps that will talk to it.  For instance, HBOGO supports it. MAXGO does not.  Same company.  Go figure...  Good news is that if you are doing anything on the Web and using the Google Chrome browser, the sky's the limit.  If it displays on your PC, it can be displayed on your TV.  Lots of other apps are adopting it as time goes on.", "verified": true, "helpfulness": "0/0", "author": "LAWC"}, {"rating": 4.0, "review": "I really like the idea of Chromecast.As other users have said, instead of just mirroring your screen, it uses the Chromecast to access content from the internet and play it on your TV. You can disconnect your device and the content will keep playing.Because Chromecast does not have any sort of interface and cannot be controlled with a remote, your phone / tablet / computer works as a controller. You use your device to queue up content or launch an application, than chomecast plays it and you are free to do whatever with your phone.I find it especially useful for Pandora. I will launch the Pandora app on my iPhone and play it from my TV. The sound is much better than, however Pandora still runs off your phone if you do this.I can't wait for more functionality to be added to this device. It seems like Google could continue to improve this and make it into an amazing product. Right now I don't use it that much because I have Amazon Prime (which it does NOT support). Hopefully in the future support for this will be added.Overall great product even if slightly limited on functionality.", "verified": true, "helpfulness": "0/0", "author": "Kanyon Edvall"}, {"rating": 5.0, "review": "Soso difficult to use with everything", "verified": true, "helpfulness": "0/1", "author": "Texashots"}, {"rating": 5.0, "review": "Simple concept. Excellent execution. I would recommend it to anyone. I have bought 4 of these until today.Those pointing out that some.services are not available, it up to those services to include support for Chromecast support.", "verified": true, "helpfulness": "0/0", "author": "Nitesh"}, {"rating": 5.0, "review": "GREAT, REALLY EASY, LOTS OF MOVIES.", "verified": true, "helpfulness": "0/0", "author": "J. FORRESTER"}, {"rating": 4.0, "review": "Works pretty well. I've used for Netflix and HBO GO, and just once messing around to duplicate my phone screen. Such a great value. I bought several for people as Christmas gifts too.I'm using the USB port on my TV for power as opposed to plugging into the wall with the included adapter.I don't really have an significant issues, except on occasion, the volume of streaming content floats around. I haven't researched this yet, so maybe a simple fix.", "verified": true, "helpfulness": "0/0", "author": "MaryBeth Carroll"}]