[{"rating": 5.0, "review": "Love it.  Simple operation, no problems with it.  Easy to install and run.  We like to run pandora through the Fire TV.  It is pretty agile navigating around with the search function.", "verified": true, "helpfulness": "0/1", "author": "craig richards"}, {"rating": 5.0, "review": "Another great product from Amazon.  Just as advertised with the voice recognition that works even for young kids.  Links nicely with the kindle through the cloud.", "verified": true, "helpfulness": "0/1", "author": "Brandon S."}, {"rating": 5.0, "review": "Love the device, combined with my prime account, this is AWESOME!! Now all I need is an app that streams the news (Huffington Post Live comes close but not exactly).", "verified": true, "helpfulness": "0/1", "author": "Robyn C."}, {"rating": 5.0, "review": "I use this for my office area and my daughter enjoys the Spanish Learning programs.", "verified": true, "helpfulness": "0/1", "author": "Gordan D. SAMIDE"}, {"rating": 2.0, "review": "The best feature, search only searches Amazon content, not for any other apps. Also, the Amazone content is only displayed for buy, does not have free watch list.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer \"e-Man\""}, {"rating": 5.0, "review": "used as a company picnic prize. huge hit!", "verified": true, "helpfulness": "0/1", "author": "Ashley Doyle"}, {"rating": 5.0, "review": "Great device and easy to use. A hit!!!!", "verified": true, "helpfulness": "0/1", "author": "sammytastic \"Louiepilly\""}, {"rating": 3.0, "review": "Not bad but it doesn't bring anything new to the table. I already have 5 devices that do everything this unit does. Would like more time with the device but not for the 99.00 asking price.", "verified": true, "helpfulness": "1/1", "author": "Frank G. Palazzolo"}, {"rating": 3.0, "review": "The menus are great with quick response time but the audio quality is very poor. The music and sound effects are too loud while the voices are too low and difficult to understand.", "verified": true, "helpfulness": "1/1", "author": "Anthony L. Medley"}, {"rating": 5.0, "review": "It has allowed me to cut the cord. Some apps better than others.", "verified": true, "helpfulness": "0/1", "author": "paul johnson"}]