[{"rating": 5.0, "review": "While I haven't tried the competitors I had no hesitation about ordering the Fire TV.  Why? Because I have had a Kindle since the second model came out, my wife and I do most of our ordering through Amazon - no hesitation about ordering Fire.  When I hooked it up I was impressed but more importantly my wife loves it.KEEP going Amazon with the great products and innovations. :{D", "verified": true, "helpfulness": "2/2", "author": "Bill L-Indianapolis"}, {"rating": 5.0, "review": "Set up was simple.  No more buffering.  Works well.  Have used with Amazon Prime and Netflix.  No problems.  Very happy with this.", "verified": true, "helpfulness": "2/2", "author": "Kimberly N. Phillips \"kims121\""}, {"rating": 1.0, "review": "I hate it. Couldn't get a picture on the TV. Sent it back. I'll keep cable. Buyer beware. False advertising!", "verified": true, "helpfulness": "6/25", "author": "lori"}, {"rating": 1.0, "review": "I have Amazon prime and have been an Amazon fan for years.  I anxiously awaited the arrival of this box.  I plugged it all in, got started and came to a screen that said I needed to update the software.  That was puzzling to me because this has just been released and already a software update?  Why not have that done when shipping out the first boxes produced?  I attempted to download the software.... and attempted.... and attempted... this went on for over 8 hours with countless attempts.  (Probably more than 100).  Sometimes it wouldn't begin the download at all.  Sometimes I would get part way through the download and it would stop and say it couldn't be downloaded.  I called customer service.  I was told that their experiences with this showed that if you connect it to an Ethernet cable it would probably work.  (She said it needed a good connection). I tried that multiple times and that failed.  The other suggestion was to leave the screen alone after the download failed and it would probably start again and finish.  I left the thing on overnight.  Tried again the next day several times and I have finally given up.  I so wanted this to work.  I wanted to watch my purchased prime movies and shows on my tv.  I was so excited for this box for that reason.  Now I'm back to square one watching them on my laptop.  I am beyond frustrated and now I have to pay for return shipping.  I have no idea if I would have enjoyed it because I could never get past the initial download screen.  Save your money.", "verified": true, "helpfulness": "16/22", "author": "Lori Staton"}, {"rating": 4.0, "review": "I always had problems with buffering with my Roku.  So far, there have been no problems with buffering.  The setup was easy.  The voice recognition remote is nice.", "verified": true, "helpfulness": "1/1", "author": "Scott E Bradley"}, {"rating": 3.0, "review": "Good, but it needs time, features and additional compatibility.  What is on it works well. Content is a bit limited, with some of the most desirable parts \"coming soon\" (MLB.tv, mobile app, etc). Successful media playback through Plex can be hit or miss...still trying to figure that one out; audio sometimes plays, sometimes doesn't.The addition of games is great, and has a lot of potential. Need more premium and Fire-TV-optimized content to really feel like a decent game console replacement. It will never be an Xbox or PS, but for the casual gamer it has great promise.The interface is speedy and never really hangs up.Voice search works well, but is useless until it can search across ALL services, not just Amazon content.", "verified": true, "helpfulness": "0/0", "author": "John D. Murphey \"John\""}, {"rating": 3.0, "review": "Voice search is fun and accurate. We have used it everyday since we purchased it so it is cool. When we search for things it all costs money. Gone in 60 seconds a 14 year old movie is 2.99 SD 3.99 HD. Kind of a slap in the face when we pay for prime membership, pay for Hulu, pay for cable TV. So primarily we are looking for free not pay. Search for shows that we watch for free on cable TV and they want 2.99 an episode. We were not expecting so much pay per view.", "verified": true, "helpfulness": "1/2", "author": "Mitch Davis"}, {"rating": 5.0, "review": "Great price, only took 2 minutes to set up & so easy to use! I Love the voice search! Love my Fire Tv!", "verified": true, "helpfulness": "1/1", "author": "Mary E."}, {"rating": 5.0, "review": "So easy to install and use that this device is simply amazing. I wish I had known about this before I invested in a smart TV. I could have saved several hundred dollars.", "verified": true, "helpfulness": "1/1", "author": "William Peyton, Jr."}, {"rating": 5.0, "review": "Set up took less than three minutes. A whole lot of movie and TV choices. Gave the apple to the kids.Love it!!!!!!", "verified": true, "helpfulness": "1/1", "author": "R. C. G. \"r g 3\""}]