[{"rating": 4.0, "review": "I got mine the day after it was unveiled. Out of the box it required an update. It's the fastest UI of any other box that I have. Currently there aren't as many apps as I would like to see, but I imagine they'll be coming soon.I am not able to get my Kindle Fire HDX to Mirror the display yet. It won't connect for some reason.Including more apps coming soon, apparently the Amazon Music app will be available soon as well. Games are very cool. I don't have the separate controller, but have had fun with the games you can play with the remote.These aren't mediocre games you would find on the Roku 3, but high quality mobile games. Of course the games aren't full on Xbox or PS4 style, but beautifully scaled mobile games you'd play on your smartphone or tablet.If you get your entertainment from the Amazon ecosystem, this is an excellent device.", "verified": true, "helpfulness": "17/18", "author": "mysticgeek"}, {"rating": 1.0, "review": "Idea, come on man stop stealing ideas we need to re-innovate ideas because this is cs***. Don't waste 99 dollars", "verified": false, "helpfulness": "10/219", "author": "Armando"}, {"rating": 3.0, "review": "This is great.  If it had a Blue-Ray player it would be AWESOME!  Add Blue-Ray it then gets 4 or 5 stars. It also could use some user friendliness or usability upgrades. Miracast would be a much needed add on.", "verified": false, "helpfulness": "1/51", "author": "Cymernet"}, {"rating": 1.0, "review": "A lot of writing. I have had a smart tv for years. All I did was connect by desktop computer to my tv. And I can do everything.. and all it cost  was 20 bucks for a wireless keyboard", "verified": false, "helpfulness": "1/1", "author": "Cassandra Badie"}, {"rating": 1.0, "review": "Come on Amazon, stop following sales trends and create a new technology.  I'll stick to the Apple TV I got years ago.", "verified": false, "helpfulness": "12/239", "author": "sea_stuart"}, {"rating": 5.0, "review": "Use this with Sling and Amazon Instant Video, my living room entertainment is completed. Cut huge cost on cable TV.", "verified": true, "helpfulness": "11/13", "author": "H. Hoang"}, {"rating": 2.0, "review": "It is a little annoying that there is not a HDMI cable in the box to immediately connect the box????", "verified": true, "helpfulness": "13/67", "author": "C. Corman"}, {"rating": 4.0, "review": "Does Amazon fire tv works in latin america? I live in Costa Rica and I would like to know if I can stream all the chanels.", "verified": false, "helpfulness": "2/30", "author": "fernando"}, {"rating": 5.0, "review": "Was looking at building a HTPC to run Plex on my main tv and this just saved me hundreds! Plex runs great and is very snappy, could not ask for more. Thanks Amazon.", "verified": true, "helpfulness": "9/12", "author": "Derek W"}, {"rating": 1.0, "review": "Purchased the same day it was released with the gamepad. I love the slim look but that is where it ends really - its a little heavy compared to some of my other units as if they added a weight inside the unit to note \"it doesn't feel cheap\". The unit never overheats or anything nor even gets hot at all when gaming for some time. Coming from several android set top boxes, a closed ecosystem isn't really a match when its controlled slowly. I know many are ranting about no HBO Go and Vudu but we all know how this works, with time they will be supported. My Matricom Gbox MX2 has a mouse pointing remote and makes ease supporting the playstore versions on the google market like many of my other android HDMI sticks and stb devices. The wait, knowing whats on the market now that is truly open.....puts me in a different place when giving a recommendation for the Amazon unit. If you have never owned an STB in your life, only care of OTA license content in slow forms of release (no hbo, no xfinity, no fox sports, no news channel apps for streaming) then this may be fore you. But making their remote\\ecosystem tie to their appstore amazon partnered apps to accommodate for their remote\\gamepad controllers moving around the apps is a little misleading, and a dagger to the seasoned purchasers knowing this for the android market set top boxes. Amazon has some work to do and I am not impressed with this decision at all to begin with.Gaming: I have to give them another gimmick grade here.....the gamepad works on a few of my android devices with bluetooth, why not release it as a universal remote and supply an SDK for the entire android market....a thought. Overall I was only wanted to see how it was with the gaming and it handles it just as well as other similar devices.Search\\Amazon Prime and the others considering ASAP: ASAP is restricted to amazon only as expected but overall great idea for their FireTV that will go un-noticed and no respect, Good idea and only will get better, sadly limited to Prime. Love the search, fairly accurate (FireTV>Kinect One) and a lot more expressive than others, it has a major future for this platform and will play as a major moniker for not only Amazon but future STB's to come as well.Apps: Upset, reasons above with the remote\\gamepad app ecosystem. That alone limited the good nature about the sideloaded apps and the fast rate of the appstore from Amazon. The software overall just seems rushed - and last of all which relates just the worst experience ever =AMAZON WHERE IS THE OFF BUTTON!!! I can let you know why this has not happened, there are no remote options yet to power the unit on. We are sure to see an update once again....so in result its a great beta product but to the early bloomers to the STB market this is merely a toy on the side.....I for one am done with testing and found a great product already with a fully open android box. I will update my review as Amazon keeps delivering us some more quality non-beta fashioned product. All in all....back in the box for the moment.", "verified": true, "helpfulness": "26/43", "author": "Aaron Johnson"}]