[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "nathan"}, {"rating": 5.0, "review": "This is going to change the way we see television. Yes, it's that innovative.First of all, this device singlehandedly killed the remote. There is no remote. Everything you do, you do it on your device, be it smartphone, tablet, computer, whatever. Multiple devices can be registered to control the Chromecast. If that isn't innovation (innovation that works and is accessible in a production device, not some untouchable conceptual product!), I don't know what is. Let me say it again: the age of the dumb thing we know as remote has come to its end!Second, all your content is a selection of what you see on your device. For example, if you want to watch Netflix, you open the actual Netflix app on your phone, and then choose to view on the Chromecast's screen (TV) instead of your phone's screen. Media can be seen on it, and much more. You don't actually need to look for it on the device itself (think media players) after you found it on your device. There is no transition. It's all a continuity solution, it's seamless. It's an extension of all your devices at the same time.And the future is bright. Theoretically, this device opens a bright new future to a time when you won't need to interact with the horrible software in your cable's STB, or dumb TV, or anything. They will release an app for your phone (a much smarter platform) and you will be able to manipulate the guide on your device instead of in the STB's remote. Again, the remote is gone and everything is done via network. Of course, this is theoretically possible, and cable companies certainly don't want to give up control in benefit of the user. But still, I'm just telling you how mind boggling this device is. It's the Pandora's box of the XXI century.You may think this is all an hyperbole. It's not. I can't remember the last time I was so impressed with a product. Maybe it's because I can see the capabilities that could be unlocked with we pushed this little guy to its limits. It's like living the tomorrow, today.And the best of all? It's cheap, it's a steal.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "worth the 35.00", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Love love love it- no need for cable with this little guy. Great gift!", "verified": true, "helpfulness": "0/0", "author": "D. Peters \"Dance With Me\""}, {"rating": 2.0, "review": "Nothing against Amazon, your service was great, but this is a strange invention. It only likes to work with Google related products, and it total screwed up my home/business network. I had multiple service calls by my phone/ internet service company to figure out why my wireless service had become \"troublesome\". We finally figured out that the Google Chromecast was interfering with all the wireless signals in my house. Now it lives in a drawer, a $75 paper weight.", "verified": true, "helpfulness": "0/1", "author": "Peter Kamm"}, {"rating": 5.0, "review": "does what you expect", "verified": true, "helpfulness": "0/0", "author": "palmerdave"}, {"rating": 1.0, "review": "I didn't work.", "verified": true, "helpfulness": "0/1", "author": "jose"}, {"rating": 5.0, "review": "Great Product. Super convenient! As someone who has both Apple T.V. and Chromecast, the Chromecast, for it's price, is almost too good to pass up.", "verified": true, "helpfulness": "0/0", "author": "Nathan Reinsdorf"}, {"rating": 5.0, "review": "I've bought one for me and two as gifts for others. Reasonable price, Netflix and youtube are perfect. If you're an Android user you'll have even more app options to use with it! HDMI, what more can you want?", "verified": true, "helpfulness": "0/0", "author": "Booticus \"Mario Roberti\""}, {"rating": 5.0, "review": "This has been the best purchase to date. I picked it up for $25 in November and am glad I did. I use it frequently and have been discovering more apps that work with it. This has helped me take a step towards cutting cable.", "verified": true, "helpfulness": "0/0", "author": "Brown Dragon"}]