[{"rating": 4.0, "review": "Clear", "verified": true, "helpfulness": "0/1", "author": "Charlie F"}, {"rating": 5.0, "review": "Because I have a Prime membership, it is great to stream tons of FREE movies and TV shows right on my TV. 5 stars!", "verified": true, "helpfulness": "1/1", "author": "KalmarWingfeather"}, {"rating": 5.0, "review": "Great stuff", "verified": true, "helpfulness": "0/0", "author": "Ryan Marrero"}, {"rating": 4.0, "review": "It is so much faster then my neotv box and I couldn't be more pleased with all the apps available and easy to use setup", "verified": true, "helpfulness": "0/0", "author": "jamie robinson"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "David R"}, {"rating": 5.0, "review": "Very nice. Been an atv2 guy for a long time but not any more.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Wieland"}, {"rating": 3.0, "review": "Disappointed with the device, mainly due to Comcast in Nashville does not allow HBOgo to work on the device. I bought it specifically for that reason. Guess I'll take it back.", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 2.0, "review": "I have not been impressed with Amazon Fire TV. I am currently being sent my third on as my first two  had the same problems. They freeze up and have to be reset. When the Fire TV freezes there is static that runs across the screen. Amazon has informed me that since I am past the 60 day return policy my only option is to get it replaced. THEY WILL NOT REFUND MY MONEY. I am pretty bummed about this, Amazon has always had a great return policy but in this case they have really let me down. The Fire TVs worked for a few months but then degrated fast. In the end they needed to be reset every hour :( I am adding a few screen shots to show what the problem looked like. I know I can't be the only one experiencing this problem. I wonder how many of these reviews were written just days or even hours into use. I wish I could go back in time and buy an Apple TV", "verified": true, "helpfulness": "8/9", "author": "Karl Hevey"}, {"rating": 2.0, "review": "Very disappointed in Amazon Fire.  It is constantly loading and cuts out in the middle of a show/program.  We cannot use Sling, Hulu or Nexflix because they never complete a download.  I wouldn't recommend this to anyone!  We live out in the country and were looking for an option instead of satellite....this is not it!EXTREMELY DISAPPOINTED AMAZON!!!!!!", "verified": true, "helpfulness": "0/1", "author": "hilltop2192"}, {"rating": 5.0, "review": "As someone who has used both the Roku (2 & 3) as well as a Wii and other gaming consoles, I don't think I'll ever go back to anything other than the FireTV. I debated between getting this and the FireStick, but I'm glad I spent the extra money and went with this. It is SO FAST.  Barely any loading screen time and there are so many great apps. I love the connectivity with Spotify from my mobile device and the other options with my Kindle. You can do so so so much with this thing and I don't think I've even scratched the surface yet. We also did the promo with the Sling service and we've only had issues with that once - while trying to watch one of the final four basketball games on TBS. Now, I'm not sure if that had more to do with the demand on Sling for that channel or on the internet usage in our apartment complex. We have had problems in the past during high volume times with our internet speed, so it's hard to say which is the culprit in this scenario. But otherwise, we've had absolutely no issues with Sling. The folks who complain about Sling don't seem to understand what they are signing up for, I think.", "verified": true, "helpfulness": "1/1", "author": "Erica"}]