[{"rating": 5.0, "review": "Seriously, replace your hdmi cable with this. There is very little it can't do that standard cables can", "verified": true, "helpfulness": "0/0", "author": "Cedar Wiseman"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Roscoe77"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Pamela Caraballo"}, {"rating": 4.0, "review": "I received my ChromeCast earlier this week and with great excitement unwrapped it right away. Setup was very easy, simply plus it into the HDMI port and in my case I used a USB port for power. When I tried to configure it from my PC it failed the first time, but I told it to try again without changing anything and it worked no problem at all. Trying out the supported apps worked great, but the reason I bought it was to stream Amazon Prime movies to a TV that doesn't have an Internet or WiFi connection. Unfortunately this is where the bad news starts. While I can Cast from a Chrome browser in general, Amazon Prime uses Silverlight which appears is not supported yet. When I cast the tab I see everything on the tab except the video itself. Hopefully Amazon will support casting directly, both to simply allow me to watch Amazon Movies on the ChromeCast but also because direct support will perform better than streaming through the PC.Edit\u001b\u001b\u001bGreat advice from a reply to my original post... Read more", "verified": false, "helpfulness": "0/0", "author": "Brooke Penders"}, {"rating": 1.0, "review": "Don't do it. Buy a ROKU. Doesn't work well from phone or laptop.", "verified": true, "helpfulness": "0/1", "author": "gretel"}, {"rating": 5.0, "review": "Works great without issues, easy to use and cheap. This is my third chromecast. Great product. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "SRK24"}, {"rating": 5.0, "review": "Super fast shipping...works Great on all my apps!", "verified": true, "helpfulness": "0/0", "author": "donna reeves"}, {"rating": 1.0, "review": "Oh My God! Have you read their terms \"When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content.\"", "verified": false, "helpfulness": "0/0", "author": "Tinker'r"}, {"rating": 1.0, "review": "Oh My God! Have you read their terms \"When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content.\"", "verified": false, "helpfulness": "0/0", "author": "Tinker'r"}, {"rating": 1.0, "review": "Oh My God !  Have you seen their terms of service. \"When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content. \"", "verified": true, "helpfulness": "0/2", "author": "Tinker'r"}]