[{"rating": 5.0, "review": "This is the best thing ever! I can stream from my laptop (and I can still surf the net), phone and tablet. So easy to set-up. And I can move it from room to room. You can easily stream YouTube, Pandora, Netflix, Hulu and whatever networks that stream live on the internet. We got rid of our cable service because of the cost. But with the Chromecast, we don't miss any of the programs we like to watch. My personal opinion is that the Chromecast at $35.00 is the best deal out there. if your looking for a streaminig device, this is it.", "verified": true, "helpfulness": "0/0", "author": "Lori V."}, {"rating": 2.0, "review": "It's not the best product.  It doesn't always connect even with the WIFI working properly.  It takes a while a lot of the time to find the device and connect  to it, and sometimes it drops the signal as well.", "verified": true, "helpfulness": "0/0", "author": "Yamil Rojas"}, {"rating": 2.0, "review": "not easy to set up  Sitting in my draw for my set in the bedroom.  I like Amazon TV better", "verified": true, "helpfulness": "0/0", "author": "Charmeg89"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "lamtl354"}, {"rating": 5.0, "review": "Chromecast continues to surprise me. Love streaming Netflix from my iPad to the TV and especially love the ability to use other apps while the iPad is streaming. Best tech for the money you can spend", "verified": true, "helpfulness": "0/0", "author": "GrayHayes"}, {"rating": 5.0, "review": "Google Chromecast is awesome.  works Great if you have an Android.  Netflix, Plex and Youtube really make it shine.  No Amazon support yet.  Maybe someday.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great product, just as pictured and jst as described, easy to set up, picture quality is great, i used a converter to attach to an older TV that does not have a USB or an HDMI port", "verified": false, "helpfulness": "0/0", "author": "Endevour32"}, {"rating": 5.0, "review": "Doesn't work with all software, but works fine otherwise.", "verified": true, "helpfulness": "0/0", "author": "WayneP \"WayneP\""}, {"rating": 1.0, "review": "Basically does not work....every time you go to use you have to trouble shoot to get working...waste of money!!!!", "verified": true, "helpfulness": "0/0", "author": "Big Money \"ken\""}, {"rating": 5.0, "review": "Excellent, but would like to see more apps that could use it.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]