[{"rating": 4.0, "review": "Made watching Youtube and Netflix experience awesome. Device work like charm, no Ads on youtube video.Cons:- Device has potential to do a lot more it is doing currently. Waiting for Google to act...", "verified": true, "helpfulness": "0/0", "author": "Ram"}, {"rating": 5.0, "review": "I bought one of these for my HD LCD in my bedroom.  What a great purchase.  Using this and my Android phone I'm able to push Netflix, Pandora, Google Music and a variety of other apps to my TV.  Its an easy install, if you can get to your HDMI plug on your TV all you have to do is plug the Chromecast in and then plug the supplied power plug into the wall to power the Chromecast.  Its that easy.  The setup took 5 minutes using the Android Chromecast app on Google Play. The only thing that suprised me was the device is a bit bigger than I expected, but it comes with an extension in case it needs to hang freely behind your TV or device instead of plugged in directly.", "verified": true, "helpfulness": "0/0", "author": "Adam G"}, {"rating": 5.0, "review": "I am really impressed with Chromecast.pros:+ Easy set up+ Streaming from Android phone and Windows laptop both work well+ Initiating Chromecast automatically turns on my AV receiver and TV and selects the correct input+ Netflix, Youtube and Chrome tabs from PCcons:- Set up said it required a router setting change that was already changed?- When switching source or device, it sometimes loses communication with the device", "verified": true, "helpfulness": "0/0", "author": "Sony Fan"}, {"rating": 5.0, "review": "This little device works better than I expected- Netflix comes in great, so does anything on Chrome.  Amazon price is the best also", "verified": true, "helpfulness": "0/0", "author": "Serious Buyer"}, {"rating": 2.0, "review": "So I plugged it in hoping that it would be some amazing \"use your tablet and view your pics and videos on your tv\" kind of thing. The app you have to find /sucks/ and nothing else really works. Netflix keeps crashing and I wish I had saved 30 dollars. It's a pass for me. I've spent a week now before writing this review to make sure it wasn't me. If you have any modern gaming consoles,  you can do everything this can do and more on it.", "verified": true, "helpfulness": "0/1", "author": "Richard D. Cameron III \"Kiratomi\""}, {"rating": 5.0, "review": "Easy to use, and it works!  I love it..I am older and so have challenges with most new gadgets..This was wonderful, and I was watching movies from Netflix on my computer in not time.My neighbor has one also, and is totally satisfied.", "verified": true, "helpfulness": "0/1", "author": "Karen Jay"}, {"rating": 5.0, "review": "This item is wonderful to have.  Great way of catching up on Netflix and Hulu and not having to sit in front of the computer,", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Rideout"}, {"rating": 5.0, "review": "This is my second Chromecast.  I have netflix and decided to utilize my internet connection.  I don't have  a cable box on the third floor and Chromecast works great!  Netflixs, Youtube, Xfinity to go, hulu comes through crystal clear.  I can also add channels through my tablet and watch on them tv.  I love this.  If I need to use the computer the grandchildren can still enjoy their favorite shows.  Most tablets work great but I have a Samsung Tab taht works a remote.  Loving this Chromecast!", "verified": true, "helpfulness": "1/1", "author": "adharris"}, {"rating": 5.0, "review": "Very easy to play music/movie on television, from iPad.Songs can be added to the chromecast list very easily and no buffer time or lags.Now I love my iPad 1000 times more.", "verified": true, "helpfulness": "0/0", "author": "vasanth"}, {"rating": 4.0, "review": "So far I love the chromecast. Very easy to install. Wish that in the future it would mirror what I do in the iPhone or iPad. But so far so good. Great for watching netflix and YouTube. Still trying to figure out if I can use it with a anything else.", "verified": true, "helpfulness": "0/0", "author": "Krissy"}]