[{"rating": 1.0, "review": "In plain English \"it sucks\"  The only reason I bought the device was to stream pictures from my \"android\" Google Phone - should be no compatibility issues there - NOT!  It worked once \"sort-a\".  I am able to connect to my wifi at home but try to get anything to stream & all you get is error messages & that if you can catch the error messages between the incessant advertisements.  My recommendation if find another solution.The next thing I tried was to cast pictures from my PC to the TV - Chrome cast was made for that - right?  N O T !  Both devices are in the same room.  They connect but no go on the casting.  From what I gather there are other ways to get this done.It would be useful if you got at least a meaningful error messages - Like Your TV is too old or the video format is in compatible - N O T !", "verified": false, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Excellent product works for me I'm able to stream movies on any website with tv cast app  😜😉👍", "verified": true, "helpfulness": "0/0", "author": "n.acota"}, {"rating": 5.0, "review": "I love this thing! So simple to use, responds faster than my Roku 2, relatively inexpensive, and it's hidden from view. Best of all, I love how I can mirror anything on Chrome from my laptop onto my HDTV using Chromecast. Even though I have an Galaxy S3 and iPad 2 which DO NOT support mirroring (I think S4's and S5's DO support mirroring), there ARE free apps available that allow you to cast any embedded video from a website onto your TV thru Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Mar"}, {"rating": 5.0, "review": "Love the streaming! Can't wait for more apps to be added!", "verified": true, "helpfulness": "0/0", "author": "Roxie"}, {"rating": 5.0, "review": "This has changed out lives!  And we're old farts.", "verified": true, "helpfulness": "0/0", "author": "Bsp418"}, {"rating": 5.0, "review": "I read reviews for the Chromecast, which indicated it had a lot of limitations. I'd hoped I could stream any internet content with it, since my TV is not a \"smart\" TV, and my Roku unit is limited to the channel lineup offered by Roku. My sister indicated she was able to stream pretty much anything. When the Chromecast went on a brief sale for $28.99 with free Prime shipping, I bought it, figuring I could always return it if it didn't prove any more useful than the Roku. Anything that you can \"stream\" on the Chrome browser (whether on your computer, phone, or tablet) can be \"cast\" to your TV by the Chromecast. In some Android apps, like YouTube and Netflix, there is a \"cast\" option right in the app. I've found the Chromecast to be very useful for streaming Netflix: My Roku streams Netflix, but the user interface for Roku's Netflix channel isn't very good, and the list of movies you can browse through is very limited. The Netflix app on my phone is much more comprehensive for browsing through movies and offering suggestions for movies to watch, and then when I find one I want to watch I can just \"cast\" it (instead of having to hop onto my Roku menu and use their awful on-screen keyboard to try to search for the movie I found on my phone).", "verified": true, "helpfulness": "1/1", "author": "MM"}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "Amit."}, {"rating": 5.0, "review": "good buy", "verified": true, "helpfulness": "0/0", "author": "Maureen H \"mo\""}, {"rating": 3.0, "review": "it was kind of an impulse buy and since it has pretty much the same apps as my X-Box 360 and Sony Blu-ray player, I barely use it.", "verified": true, "helpfulness": "0/1", "author": "DJ Hines \"D-Rock\""}, {"rating": 5.0, "review": "This little thing is amazing!Nearly every application i use has a direct feed or plugin for it.Plex \\ Netflix \\ Twitch \\ Youtube and hell, even google chrome browers itself allow you to stream to it instantly.So even watching the daily show from cc.com works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Rocco Muscaritolo"}]