[{"rating": 3.0, "review": "The chromecast constantly buffers the router is really close by. Also if you turn on your microwave it will interrupt the signal causing it to buffer even more.", "verified": true, "helpfulness": "3/3", "author": "Jose"}, {"rating": 4.0, "review": "Great product. Simple to install and it is good option to see youtube videos and Netflix movie in your  tv. Now we need more apps that cast their content.", "verified": true, "helpfulness": "0/0", "author": "Pablo Mazzilli"}, {"rating": 3.0, "review": "It's a average product... Maybe in the future with  some updates the product works better, right now there are other better options out there", "verified": true, "helpfulness": "0/0", "author": "Mario Rodriguez"}, {"rating": 5.0, "review": "This device was easy to install and use with my Laptop. Especially when I use Netflix to watch movies.Thanks", "verified": true, "helpfulness": "0/0", "author": "Terry Brogdon"}, {"rating": 5.0, "review": "I bought this for my girlfriend thinking she might use it once in a while. she has had it one 24/7 for the pass week.", "verified": true, "helpfulness": "0/0", "author": "huh"}, {"rating": 5.0, "review": "I have purchased this as a gift for two people, and they both loved it.  Projects whatever is on your phone, tablet, or computer directly onto the tv.  It's awesome.  Plus, you can make a lot of jokes about the word \"dongle.\"", "verified": true, "helpfulness": "1/1", "author": "T. Cook \"Fossil Fan\""}, {"rating": 2.0, "review": "I had hoped it would show my iPad screen on a tv, but it only has a few apps that work with it.  I prefer my Roku device.  It has to be linked to your wifi so it's not very portable.", "verified": true, "helpfulness": "1/1", "author": "Stephen D. Hyers"}, {"rating": 4.0, "review": "The Chomecast almost does everything it's advertised to do.  I received mine 2 days ago and finally have it working.  Not mentioned in the description is the fact that the initial hook up to your HDTV must go through a wifi device (router).  Once the initial hook up has been made, it can then work directly from your computer, then through the router.  If, as in my case, you are planning to use a Kindle on the receive end of the wifi and then transmit through it to the chromecast plug in, good luck.  Kindle advertises it is an android device.  Chromecast states it works through android tablets.  There is a problem with these statements.  Chromecast requires apps that come from the google app center.  The Kindle defaults to the Amazon app center.  As constructed, the Kindle has no way to access google apps and google has built the Chromecast to require said apps.  With a lot of digging, there are locations that provide access to google.  With a little work, the Kindle can be made to accept these apps.  If you're not technical or have very little computer experience (or get frustrated easily), I wouldn't buy the Chromecast, look at the Roku.  The same holds true for many Apple products.  If you're intend on saving a few dollars or you have an acceptable android device, this unit does a fine job.", "verified": true, "helpfulness": "1/1", "author": "steve1942"}, {"rating": 1.0, "review": "Very dissapointed in this product. The only things you can watch are netflix and you tube? The quality for both are horrible.", "verified": true, "helpfulness": "8/10", "author": "Carry"}, {"rating": 5.0, "review": "I have been using the chromecast for a couple months now and I am very pleased. The quality of streaming Netflix and Hbo go is phenomenal. It is quite easy to setup but for anyone concerned about setup there is a great instructional video on Cnet.  You can also mirror your laptop's screen on your tv which is an easy and great feature to have. If you're in the market for a device that enhances your tv then you cannot beat the chromecast for the price.", "verified": true, "helpfulness": "0/0", "author": "Mr. V"}]