[{"rating": 4.0, "review": "Fun Toy.  Make Hulu easy to use.  The Hulu Interface on my Sony Blue ray player is horrible but easy to use on my phone.  This make watching Hulu easy as I use the phone to watch Hulu on my TV!  Wish it would display pictures better.", "verified": true, "helpfulness": "0/0", "author": "Mark Kraus"}, {"rating": 5.0, "review": "Bought 3 and still love them.", "verified": true, "helpfulness": "0/0", "author": "Henry H C Goh"}, {"rating": 1.0, "review": "It works with netflix, and that's about the extent of it. If you want to stream anything other than netflix, you better have a connection that is 75Mbps or more, as that is the speed I have in my house and it still has the hardest time streaming. The interface with netflix on iOS is attrocious and crashes the app constantly and required several attempts to get it functioning properly. Also, the chromecast does not support audio theough anything other than tv speakers, so if you want to run the chromecast into your tv and connect surround sound or a sound bar, forget about it.As far as the little streaming this device can do smoothly, it does it well, so I'll give it 2 stars. Had I of known of all of these short comings before hand I wouldn't have paid more than $10 for this device.", "verified": true, "helpfulness": "0/0", "author": "trc"}, {"rating": 4.0, "review": "Great product!!! I can listen to music on my tv, same with movies from either apps or browser, pictures, vídeos stores in my Mac or iPhone, etc. Not for everyone if you're looking for and a plug-n-play though.", "verified": true, "helpfulness": "0/0", "author": "Patricia Solano Castro"}, {"rating": 4.0, "review": "This would be 100% perfect if it supported Amazon streaming. I use a spare computer to stream Amazon like I did everything before getting ChromeCast, but if it did support it I could liberate the computer. Using my iPhone as a remote is very cool: the GUI for Netflix and Hulu is well designed and very easy to navigate. Also when I start casting it turns on the flat screen and switches to the assigned input source automatically.", "verified": true, "helpfulness": "0/0", "author": "Markus Unterberg"}, {"rating": 5.0, "review": "I am in love with this product!! Soooo easy to set up. Basically just plugged it in and a few minutes later, I was watching netflix. Would definitely recommend this gizmo.", "verified": true, "helpfulness": "0/0", "author": "Sonja Montalvo"}, {"rating": 3.0, "review": "sometimes it hard to get software to transfer media through the device,,,  the device works great ...  I am giving it only a 3 because you have to purchase software ...  to be able to lets say .. play a dvd on your PC and stream it to your TV...  Definitely nothing to buy for your grandmother .. that's for sure", "verified": true, "helpfulness": "0/0", "author": "Paul Coleman \"smiley33zz\""}, {"rating": 5.0, "review": "There have been a ton of reviews on this.  By now you know what it does.  All I can say is that it works well.  Good job Google.  For $35 you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "stan"}, {"rating": 5.0, "review": "Amazing tool to buy it ... works with iPad and Note 2 ... ^_^", "verified": false, "helpfulness": "0/0", "author": "Abdul-Rahman Boota"}, {"rating": 4.0, "review": "Good....  კარგია", "verified": true, "helpfulness": "0/0", "author": "Gia"}]