[{"rating": 4.0, "review": "It has everything that is promised however, it would have been ideal if it could stream from chrome browser installed on iPad. I still have to rely on my laptop to stream anything from my browser.", "verified": true, "helpfulness": "0/0", "author": "Ankur Agarwal"}, {"rating": 5.0, "review": "Great product for the money and it can also mirror your computer screen (beta).The only think missing is streaming local (phone or computer) media like photos, music, and videos.", "verified": true, "helpfulness": "0/0", "author": "coolbhatt"}, {"rating": 5.0, "review": "Hard to beat this device for the price.  No issues, works great with all of our devices in our household.", "verified": true, "helpfulness": "0/0", "author": "Troy Chapman"}, {"rating": 2.0, "review": "APP to install en my device (Iphone)  is not avalaible in Chilean App Store.In Google play (android) neitherKind Regards", "verified": true, "helpfulness": "0/0", "author": "Carlocristian"}, {"rating": 4.0, "review": "If you don't want to turn on your pc to see netflix or youtube, this is clearly what you're looking for", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "It works as described and is easy to install. All my android devices work really well with it and they seem to be adding more computer functions. My laptop slows down significantly when I am streaming HD video but my desktop runs it smoothly.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 1.0, "review": "After fighting with AT&T; over settings in the DSL 'modem' - basically it just does not work with Apple's AirPort Extreme!  Very disappinted!", "verified": true, "helpfulness": "0/0", "author": "Eric Stevens"}, {"rating": 3.0, "review": "Chromecast is excellent however the unfortunate thing is that it is not supported. Looks like Google should have contracted with more primary providers. I am hoping that as the product matures, there we be more sources to stream. Hulu, Netflicks, You Tube and Chrome are the only sources available.The concept is great, the video res. is excellent", "verified": true, "helpfulness": "0/0", "author": "Richard Harvey"}, {"rating": 5.0, "review": "It's fabulous! You will not be dissppointed. Good price and good product. Google rocks as usual. Check it out. You'll be glad you did!", "verified": true, "helpfulness": "0/0", "author": "no name"}, {"rating": 5.0, "review": "This awesome production. I love it.. Only problem is limited to YouTube access. Installation is very easy. Performance is excellent.", "verified": true, "helpfulness": "0/0", "author": "Mohamed Abdul Khader"}]