[{"rating": 4.0, "review": "I thought that with this amazon fire tv we get netflix and hulu plus free. Is that correct?", "verified": true, "helpfulness": "0/3", "author": "Sheila Dehne"}, {"rating": 3.0, "review": "IT's okay I guess. I wanted to use it with my laptop and I couldn't. The HDMI jack on my laptop is an outie not an innie. Oh well, I guess I need a monitor... What a waist of cash", "verified": true, "helpfulness": "1/8", "author": "Neil Thomas"}, {"rating": 4.0, "review": "Over all, I like the device. It takes a while for the voice command to understand the speech. There are, however, a disappointment with the remote control . There is no ON/Off switch. With no ability to control the power, the batteries deplete faster. I had the problem with my Roku remote. If Amazon makes the change, I will put a Fire TV on each of my TVs.With this I will address problems with Prime. If I start to watch a TV series in Prime and it goes to the next season, there is no indication whether I am still in Prime or your charging me for the next season. I also noted that you are charging for TV series that I can get free with other providers. I would prefer to get my content from one provider and not have to switch to another. Since I have cut the cord, it would be nice to have access to the HBO, Showtime channels . If the price was right, I would agree to a monthly fee.", "verified": true, "helpfulness": "1/1", "author": "Jim B \"Jim B.\""}, {"rating": 5.0, "review": "Fantastic love it will buy another", "verified": true, "helpfulness": "0/0", "author": "debbi \"loving Amazon\""}, {"rating": 5.0, "review": "it was a gift", "verified": true, "helpfulness": "0/0", "author": "Priscilla Byrd"}, {"rating": 5.0, "review": "The voice search, the button to jump forward 10 seconds, better than apple tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "it won't play sending it back", "verified": true, "helpfulness": "1/15", "author": "james palmer"}, {"rating": 5.0, "review": "Worked perfectly when plugged in.  Already knew who I was and synced all my media flawlessly.  Also like the kindle tablet/Fire TV dual mode capability.  It just happened which is nice to see.", "verified": true, "helpfulness": "0/0", "author": "Timothy Labatte"}, {"rating": 5.0, "review": "BEST PRODUCT I HAVE SPENT MONEY FOR! I have no complaints, its fast, smooth, and I never have any interrupted freezes or issues when viewing anything on here.", "verified": true, "helpfulness": "0/0", "author": "Works from L.A."}, {"rating": 5.0, "review": "I couldn't be happier with the purchase of my FireTV system. I have movies, games, and apps for days. When I had cable I always complained that I was paying for channels that I didn't even watch. Now, I watch what I want to watch when I want to watch it. Add the games and apps that are available out of the box or post download and you've got yourself one extremely capable entertainment unit.", "verified": true, "helpfulness": "1/1", "author": "Joey Jones"}]