[{"rating": 4.0, "review": "I'm waiting for the ability to stream local media to my tv through this device.  Then it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "Robert Schwering"}, {"rating": 5.0, "review": "Perfect product. Does exactly what I needed it to do. I would recommend it to anyone looking to be able to watch Netflix, Hulu, or any other streaming company on their TV without having to run a wire to your TV from your internet router.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I had got this product with lot's of hope, but at the end I didn't get any benefits of buyin this product. Chromecast only helps in streaming the videos on Youtube no other sites. I have a Samsung LED Smart TV. The TV already had app for playing videos from youtube or pairing it with other devices in same network. So if you have a TV which doesn't have a app to view /stream videos then you can go for this.Hope ChromeCast would add other websites in its product for us to stream the videos.", "verified": true, "helpfulness": "0/1", "author": "Shaji John"}, {"rating": 5.0, "review": "A very cool product for watching shows and movies. Got my Breaking Bad fix with this baby. Just sit back and transmit from your laptop!", "verified": true, "helpfulness": "0/0", "author": "Steve \"StevenL\""}, {"rating": 5.0, "review": "Great product at a great price. You will find yourself hard pressed to find a streaming device that can do as much as this device at this price point. It will do Pandora, HBO GO, Hulu Plus, Netflix, Youtube, Google Play Movies, Google Play Music, and last but not least cast a chrome browser to the TV.The product is very simple to setup and takes maybe 10 minutes. Use the chromecast app on your mobile device to setup works great. For Netflix I find that it has the best way to search movies if you use the phone app for Netflix select movie you want the play to chromecast device. Much better than clunky blue-ray interfaces! Same with youtube, it is so easy to search on mobile device then just select cast to device! I imagine as time goes we will get much more app support.I use mine plugged into my AV Receiver powered by receiver usb port and it works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "SHane Seaux"}, {"rating": 5.0, "review": "It does as advertised. You can cast anything you want using your Google Chrome browser. My family loves it. It works great with Netflix and YouTube on your phone or laptop. Great deal.", "verified": true, "helpfulness": "1/1", "author": "Reco Williams"}, {"rating": 1.0, "review": "Very few apps on Android phones will cast into this device.  When I did cast from laptop, the streaming was not steady but was broken.  Further, there appeared to me no way to stop the screeen on the computer to also play.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 5.0, "review": "great product, hard to believe that a device so small and independent can product great wireless quality to my TV.", "verified": true, "helpfulness": "1/1", "author": "Gregory"}, {"rating": 3.0, "review": "Unfortunately not too many services support this technology yet. I hope many more in the future or this was pretty much a waste of money and natural resources.", "verified": true, "helpfulness": "0/1", "author": "Markus Ruottu"}, {"rating": 5.0, "review": "One of the best media related purchases I've ever made and at a $35 price point, it's hard to beat. I'm considering getting more of them to give out for Christmas.It's really easy to set up and use. It currently supports Netflix, Hulu, Google Video, and recently HBOgo. I only wish it supported Amazon Prime.If you're like me and don't own an xbox or some other method of getting Netflix and HBOgo on your tv then get one.", "verified": true, "helpfulness": "1/1", "author": "Daniel Ortiz"}]