[{"rating": 4.0, "review": "I got this as a gift. It does what I mainly bought it to do, i.e. stream video from my OS X desktop to my old and not smart TV. Also allows me to stream netflix and a variety of other streaming services I rarely if ever use. Somehow I feel like I would have been happier with the Amazon Fire TV Stick (did I get all the words in there?) as it seems to be nominally more powerful and functional and only a few dollars more. But I can't look a gift horse in the mouth, and I honestly don't quite know what I'm missing out on.", "verified": false, "helpfulness": "0/0", "author": "Chris in DC"}, {"rating": 4.0, "review": "Works fine", "verified": true, "helpfulness": "0/0", "author": "gumarelo888"}, {"rating": 5.0, "review": "work nice very happy", "verified": true, "helpfulness": "0/0", "author": "nando"}, {"rating": 5.0, "review": "I have purchased about three of these chrome sticks, they are easy to break if you install this wrong.  It comes with an adapter for a reason,. use it.  I have gifted the product as well.  I have three TV's, but one is a smart TV, with built in casting capabilities.  But the other aren't, so this is a great option to view picture, videos, movies and share or even use your TV to cast from your computer.  I just love the options and how this device has made it so much easier to enjoy our TV equipment in the home.", "verified": true, "helpfulness": "0/0", "author": "RitaL"}, {"rating": 4.0, "review": "It works very well, but remember, whats it does is casting, nothing else.", "verified": true, "helpfulness": "0/0", "author": "Jean"}, {"rating": 4.0, "review": "set up takes about 15 minutesworks good", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 3.0, "review": "It really hard use the mirror cast.", "verified": true, "helpfulness": "0/0", "author": "Daniel Hernandez"}, {"rating": 5.0, "review": "Does exactly what you want it to do.  If you are watching just about anything on your tablet/phone you can simply send it to your TV with the click of a button.", "verified": true, "helpfulness": "0/0", "author": "Michael Telford"}, {"rating": 5.0, "review": "Great device - I use this thing every day.  The most common use is sharing pictures with my family on the big screen TV.  Also, whenever I find a YouTube video I want to share with my kids, it's nice to be able to cast it from my phone to the TV in a hurry.", "verified": true, "helpfulness": "0/0", "author": "Chris Hanaway"}, {"rating": 4.0, "review": "Works great, I use it all the time for movies and music. Only con is that sometimes the app and program don't sync on my phone and it takes another disconnect and reconnect before I can actually pause a show.", "verified": true, "helpfulness": "0/0", "author": "Mara Ward"}]