[{"rating": 5.0, "review": "Really great with a tiny remote. and small footprint. ability to install custom apps.", "verified": true, "helpfulness": "0/0", "author": "Johnston Moses"}, {"rating": 1.0, "review": "Wouldn't recognize my wireless.  Tried it twice and gave up.", "verified": true, "helpfulness": "1/7", "author": "Barbara L. Schulz \"FrndinRI\""}, {"rating": 5.0, "review": "This box is well worth it! Anyone wondering if you can play stuff off USB jump drive will be disappointed however using a Nas or playing anything off the network works by installing xbmc. All and all this thing is fast well built and the remote works perfectly better then ouya and apple tv.", "verified": true, "helpfulness": "0/0", "author": "John L Seablom"}, {"rating": 4.0, "review": "Great product mostly, but contrary to claims, the voice activated menu doesn't work for me.", "verified": true, "helpfulness": "0/0", "author": "Ann Abfalter"}, {"rating": 5.0, "review": "Love it !", "verified": true, "helpfulness": "0/0", "author": "George S."}, {"rating": 5.0, "review": "The Amazon Fire TV was simple to hook up, easy to use and I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Don Lockwood"}, {"rating": 4.0, "review": "Wish they added more new movies more often.  Otherwise, a pretty good selection of shows and some movies.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It has no Christian channels like the: three angle broadcasting network.  I can't sync my apps and tv program apps from my Kindle to the Amazon Fire TV. It's was not what I expected.", "verified": true, "helpfulness": "2/14", "author": "Kramara Brown"}, {"rating": 5.0, "review": "I was extremely impressed with the instant streaming, no caching necessary.  All over wifi mind you.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We enjoy watching Amazon prime on our big screen TV, rather than on a small computer monitor.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Maceri \"mongoose41\""}]