[{"rating": 5.0, "review": "If you have go places and want to watch Netflix or other services via non-smart TVs, this is a great solution.  Pays for itself with the free Netflix!  I recommend it!  Love controlling from my phone, too.", "verified": true, "helpfulness": "0/0", "author": "LW \"Laura W\""}, {"rating": 5.0, "review": "I love this. Stream your computer screen easily to your HDTV with an incredibly easy WiFi setup. Watch Netflix from your phone app on your TV. Stream YouTube videos easily from your Chrome browser to your TV. And all for $35.", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 3.0, "review": "It actually works pretty well.  HOWEVER, you can ONLY broadcast netflix and youtube from with IOS.  The APP itself works great EXCEPT when it comes to pausing and restarting it.  It can take multiple tries to get it to stop.  I was led to believe it would work with anything broadcast from Google Chrome.  However, Google Chrome does not support IOS.", "verified": true, "helpfulness": "0/0", "author": "Gordon Moore"}, {"rating": 1.0, "review": "I believe Google tried their best to make it work on the WIFI AP they are aware of.Unfortunately ChromeCast still doesn't work with all three WIFI AP I have at home.The support is rather not useful.Sorry to give 1/5 star until this issue is addressed.And I will stick to my Roku, which comes in working and full of contents.I can watch Youtube on Roku with Playto so I guess there is not really a need to keep Chromcast.", "verified": true, "helpfulness": "0/0", "author": "I-hsiang Lin \"I-Hsiang Lin\""}, {"rating": 5.0, "review": "Found it very easy to setup. Only downsides are the lack of apps and the extremely bright LED on the device.", "verified": true, "helpfulness": "0/0", "author": "Anthony Heugh"}, {"rating": 4.0, "review": "The device is excellent and works very well to play Youtube and Netflix content from my smartphone to the TV set. The only problem is the lack of more applications for playing content saved on my phone or other devices.", "verified": true, "helpfulness": "1/1", "author": "joaquin julve parra"}, {"rating": 4.0, "review": "Very, very limited in use...but for what little it does manage to do, it's solid and dependable. Needs to offer much more audio / visual functionality to get a 5 star review.", "verified": true, "helpfulness": "0/0", "author": "R. Fountain"}, {"rating": 5.0, "review": "Works great..a must buy. Turns your TV into a smart TV with needing a game player like Netflix streamer, etc. Had a few issues with Hyper-V and Chromecast working on the same laptop because of the virtual bridge. Otherwise it's great.", "verified": true, "helpfulness": "0/0", "author": "Matt Strauser"}, {"rating": 5.0, "review": "I'm loving the Chromecast!  I wasn't sure I was going to like it when I first purchased it.  I couldn't get it to work at all,  a few days later Google came out with a software update and it's mostly be smooth sailing since.  I now own two and want to give them out as gifts for Christmas.I use with Youtube, Netflix, Play Music, and Hulu.  Would like to see more apps but these are the core apps that I would use anyhow.Can't beat the price and it keeps getting better.", "verified": true, "helpfulness": "0/0", "author": "Andrew Love \"Andrew\""}, {"rating": 2.0, "review": "Too complicated for this senior. Too many steps to install and use. Does not compare to the Roku which sets up automatically and has a remote. i will be replacing this with another Roku.", "verified": true, "helpfulness": "0/3", "author": "sandra m rush"}]