[{"rating": 5.0, "review": "It is Great product..it is very usefull product it met my needs..i will recomend it to all my friends.thanks amazon...thanks google.", "verified": true, "helpfulness": "0/0", "author": "Walid Elmihi"}, {"rating": 3.0, "review": "Does the job but not really quite stable. I strongly recommend with that price but do not set the bar too high. Also, no 5ghz so you may end up changing the settings of your network.", "verified": true, "helpfulness": "0/0", "author": "clark can"}, {"rating": 5.0, "review": "My daughter uses a Google Chromecast to stream Netflix in her dorm room.  Since her room isn't wireless, she needed a router to make the Google Chromecast work.  For $19.99, this little powerhouse works great and is easy to connect: TP-LINK TL-WR702N Wireless N150 Travel Router, Nano Size.", "verified": true, "helpfulness": "0/1", "author": "Sharon"}, {"rating": 3.0, "review": "I like how easy it is to use. I would like the ability to stream a video off my phone or tablet, but you get what you pay for. It seemed to work great for a few weeks, but now the stream is starting to get choppy at times. I would think a software upgrade might help if they weren't automatically installed already.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Phillips"}, {"rating": 3.0, "review": "i have bought 3 of these and set 5 of them up, they are a big pain to set up. they are not just \"plug and play\" when it does work though its a great product", "verified": true, "helpfulness": "0/0", "author": "dogneely"}, {"rating": 4.0, "review": "It does what it supposed to do. I basically use it to stream Netflix. The screen quality is awesome and there is very little lag. It DOES NOT however stream what is on your laptop/tablet/phone. It can be done but it really is a hassle. It would be great if Google would finally support that type of streaming.", "verified": true, "helpfulness": "1/1", "author": "Jin"}, {"rating": 4.0, "review": "Fantastic product. I really love Chromecast. The reason why it did not get 5 stars however is because its not that much different from a normal hdmi cable really other than the obvious fact that its wireless. I wanted to see more unique apps for it which Im sure will come with time. Regardless, i HIGHLY recommend this product as a superior alternative to an hdmi cable and is simply really fun to use!", "verified": true, "helpfulness": "0/0", "author": "Dillon"}, {"rating": 4.0, "review": "Other than a couple hiccups every now and then, this is a decent device for streaming media to your TV.  There are some occasions (not many) to where the audio and video become out of sync.  Overall this is a good product, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Nicholas"}, {"rating": 5.0, "review": "It was easy to setup, and plays netflix and youtube videos just fine. I am really hopeful now that they opened it up to developers for more apps. A twitch app would be great!", "verified": true, "helpfulness": "1/1", "author": "JRW"}, {"rating": 3.0, "review": "it works as advertised, but you need to have the apps on your phone or tablet loaded before it will work.", "verified": true, "helpfulness": "0/0", "author": "jimbobmcclan"}]