[{"rating": 5.0, "review": "This is such an awesome product. I love it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "Miguel Estella"}, {"rating": 4.0, "review": "We love it except for one thing, the screen casting from my android tablet is quite unreliable.", "verified": true, "helpfulness": "0/0", "author": "bbp"}, {"rating": 5.0, "review": "Gets better all the time, with improved performance and more app support. Works fast and easy. No reason to pay more for unnecessary features. There is even local file support.", "verified": true, "helpfulness": "0/0", "author": "Vlad Z."}, {"rating": 5.0, "review": "Simple to set up, easy to use, almost revolutionary in bringing the internet to your TV (if it's not already there).", "verified": true, "helpfulness": "0/0", "author": "Daniel Stenson"}, {"rating": 5.0, "review": "Quality product, timely service as always!", "verified": true, "helpfulness": "0/0", "author": "Daniel C."}, {"rating": 4.0, "review": "It works. I wish there were more web sites that were compatable", "verified": true, "helpfulness": "0/0", "author": "Marshall Magid"}, {"rating": 4.0, "review": "Still learning how to use it but it works great.  Able to watch netflix.  got it at a great price during the holiday.  I fumbld through the setup a bit as i did not find good setup guidance with the package.  had to \"google it\"", "verified": true, "helpfulness": "0/0", "author": "jfleon"}, {"rating": 5.0, "review": "This works great with my tv and laptop. I've been dying to ditch cable and use only internet for shows/movies/news. This helps me.", "verified": true, "helpfulness": "0/0", "author": "kat"}, {"rating": 5.0, "review": "This thing is so cool and such a great price. I was planning on building a media server to connect to our TV, now I can just stream everything wirelessly from my main desktop(or any device including my phone for that matter) and it plays perfectly. Small buffer time but that is to be expected with wifi streaming of video. Super easy to configure, and after setting up the Windows version of this device last week, I can say this is a much better product.", "verified": true, "helpfulness": "0/0", "author": "Aaron Thomas"}]