[{"rating": 5.0, "review": "Received the Fire TV this afternoon. It was REALLY easy to set up. A nice and surprising bonus was being able to see slide shows of the pics saved to the Amazon Cloud. I didn't have to do a thing, other than click on \"photos\". To tell the truth, I don't even remember having saved my pics to the Cloud. The one and only downside is having to upgrade the software. It took a long time, but not Amazon's fault. Our download speed is only about 1.5 Mbps; fortunately it's adequate for streaming. By the way, the voice recognition feature works well!", "verified": true, "helpfulness": "1/2", "author": "Huckle Berry \"H. Berry\""}, {"rating": 5.0, "review": "I was given the Amazon Fire for my 74th birthday.  I found it easy to use immediately.  There are several TV programs available that I am enjoying.  I am enjoying just looking for programs I can get free with my prime membership.  My grandchildren also enjoy looking for programs.  The voice search is such a great/fun way to search.  So far after a week I can find very little I would change except more free prime offerings but for now there are enough for me for a long time.", "verified": true, "helpfulness": "3/4", "author": "Kenneth B. Mowrey"}, {"rating": 5.0, "review": "I was in the process of purchasing the Roku 3 when I heard rumors that Amazon is set to release a streaming box of their own so I waited a few day and on the release date, I purchased the  Amazon Fire TV.  Setup was easy, instructions were simple, instant connection to movies and I LOVE IT!!!! I'm a Prime Member so no more watching videos on my tablet/laptop, I can now watch movies on my TV with my family.  The voice command is a timesaver and the picture is unbelievably clear. Games are not for me, I'm just happy with videos.  Wish there was HBOGO but I have patience, item is new.  I highly recommended the Amazon Fire TV.Message to the haters, do what I do, research the item, if it does not have the features you need, then its not for you, move on.  Why rate an item 1 star because it does not have that ONE item you want.  Apple TV does not have Amazon Prime. but I did not give it 1 star, I moved on and purchased the Amazon Fire.  Kudos to Amazon, I'm a HUGE fan, I'm a Kindle owner and a Prime member and & shop on Amazon at least 3X a week.", "verified": true, "helpfulness": "8/9", "author": "SMM \"Leogirl817\""}, {"rating": 4.0, "review": "I am enjoying the Amazon Fire TV.  I am a little disappointed in some of the movies that are not free (i.e. Seven Pounds) when the movie is a few years old.  However, I am enjoying the free movies.  I downgraded my cable package.  Hopefully, I'll be able to completely get rid of the cable.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Tonia\""}, {"rating": 4.0, "review": "I purchased a Fire TV when it was first released, and I must say I am impressed.It is extremely fast, no buffering has taken place, and I now have an awesome (cheap) gaming console (I wouldn't pay for a 499 console and then 59 for games). Also, since it runs android, the majority of the games are free (I purchased two game controllers, and have had a blast playing the simple yet fun titles they have thus far). It has replaced my Apple TV as my set top box, and I don't see myself going back (at least for now). I would have given it 5 STARS if it had the capability to view my MP4's that I did not purchase through amazon (digital downloads, iTunes movies, movies I owned and ripped), but Amazon support stated that since it has a USB port, that it \"could be\" used in the future.", "verified": true, "helpfulness": "1/2", "author": "Mr. Matt"}, {"rating": 5.0, "review": "Better than Apple TV, better than Apple TV gen 1 tooWondering if you can have more than one in the house on same acct though", "verified": true, "helpfulness": "1/2", "author": "Darren Cheng"}, {"rating": 5.0, "review": "I got this for my wife because I have a Smart TV already.  Was very impressed how easy it was to connect to the TV.  The one thing is to make sure you have enough HDMI inputs.  Connected to my wireless network easily.  The thing that amazed my was selecting a title to watch it instantly came on.  You wont be sorry you bought this.", "verified": true, "helpfulness": "0/0", "author": "Harry Heersema"}, {"rating": 5.0, "review": "Simple and elegant - setup seamlessspeech worked wellnavigation simpleKindle integration nicewould like speech search for internet", "verified": true, "helpfulness": "1/2", "author": "Jeffrey S. Gray"}, {"rating": 5.0, "review": "I got tired of paying for DirecTV and all the channels I had to pay for just to get the channels I wanted. I had tried Dish TV too and it was the same, paying way too much for a hand full of channels I'd watch. I can't get cable or DSL here on the mountain so I use Huse.net for my internet and FireTV works well with it. The remote is awesome with the voice search feature. I just hooked it up using Ethernet cable and a Ethernet hub for my PC and FireTV. HDMI and I was up and watching Netflix and HULU in no time on my big flat screen TV. I am very happy with FireTV after about three weeks of use.", "verified": true, "helpfulness": "1/2", "author": "Philip Colprit"}, {"rating": 5.0, "review": "First of all, I absolutely LOVE Amazon.com.  They are easy, reasonable, fast, and superior.  Secondly, I am just amazed at the quality of the Amazon Fire TV box.  It is so consumer-friendly!  It starts with movies and TV shows that are similar to what you have ordered in the past.  And then, if you want something in particular, you can search with just an actor's name, or the name of a show, or even the name of a character in a show.  I am so impressed.  I love, love, love it!", "verified": true, "helpfulness": "0/0", "author": "T. Henderson"}]