[{"rating": 5.0, "review": "My 2nd amazon fire TV!.  You cannot beat this product!.  We have one in the living room and one in the bedroom!  Its great!.  I love the fact that you can Hard wire this vs using Wireless.  Wireless is not strong in our house, so we wired it and its wonderful!.  No issue with Netflix or Amazon Prime TV!.  Highly recommended!.Update to provide more info as we use thisSome app we installedNFL NOW (waiting for NFL Plus NOW to be able to watch all live games for 1.99 per month)Plex (for media server)Netflix (for all movie and streaming content) its is awsomeAmazone Prime (must have **more content to move movies and shows***)Youtube.com (pretty straight forward)AllCast (stream videos from your android device to Fire TV)Yupptv - an Online Desi / Hindi tv channel listing that works well with amazon fire.andFor all the Tinkers, the best thing everSideload applciations on amazon fire *google it and you will see what you can do**Again, Love this device but with every great thing there is always room for improvement...What I would improve If I could-  Allow configuration for people to load Android based application and launch and view and use-  Allow web browswer support...if one cannot be used, then Amazon should create its own browswer program that surfs everything and plays everything that is surfed on the web. Like Flash, HTML ++ or anything new that ever comes out- Idea here is to make Amazon Fire the only device to ever be used on the planet!...If it has all the option...see no reason why Amazon Fire HD (2.0) or something cannot have that:)", "verified": true, "helpfulness": "1/1", "author": "Lord Snow \"Lord Snow!\""}, {"rating": 5.0, "review": "The only thing I wish it also had was a general internet browse but in reality it does everything I need it to.We use Netflix, Amazon Prime, and Hulu Plus the most.It costs money to use the apps but well worth it. Much cheaper than cable or satelite", "verified": true, "helpfulness": "1/1", "author": "L. Hyde"}, {"rating": 5.0, "review": "Super. Spectacular. Slick. Sublime.", "verified": true, "helpfulness": "0/0", "author": "Eric Campbell"}, {"rating": 1.0, "review": "After my son spent three hours on the phone with the tech and finding out that the product did not work as it indicated on the box, we returned it for an Apple TV product.", "verified": true, "helpfulness": "1/7", "author": "Colorado girl"}, {"rating": 5.0, "review": "With the support of Amazon Prime and Kindle apps of all kinds this is the best addition to TV I have ever had. Movies and shows for the adults and all kinds of movies, games and activities for our grand kids. It is seldom that we watch a movie from our big selection of cable channels. The remote is great and the voice recognition the best. For an enjoyable experience I would recommend the small but powerful Fire TV box to anyone.", "verified": true, "helpfulness": "0/0", "author": "Robert Anzovino"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "easy to install works great with my WIFI", "verified": true, "helpfulness": "0/0", "author": "Lonnie D. Mollet"}, {"rating": 3.0, "review": "Many things I don't yet understand. Thought there was more free movies and tv shows.", "verified": true, "helpfulness": "0/1", "author": "ryan haft"}, {"rating": 5.0, "review": "Great product I have one on all three TVs great with the prime account", "verified": true, "helpfulness": "0/0", "author": "Carl Thomas"}, {"rating": 5.0, "review": "Trying to break away from Direct TV.", "verified": true, "helpfulness": "0/0", "author": "BNicTexas \"Mnichols\""}]