[{"rating": 2.0, "review": "I think that most people reviewing this item haven't owned it for very long and assume that the frequent behavioral glitches will go away.  They won't.  This thing is very unreliable.Sometimes I can sit down, queue up a movie or video with Chromecast, and watch it through, without a problem.  It's sad that I feel lucky when I have that experience.  Just as often, it fails to connect up to begin with.  I have great Internet service and wireless system (get reliable 35 Gb download over wireless).  All of my other devices connect up just fine, including an ancient Wii.  It often fixes things to physically reboot the Chromecast by disconnecting and reconnecting power.  About once every couple weeks it just will not connect up (even after rebooting, restoring factory resets and setting it up again from scratch) to the same network that is uses the other 95% of the time and I have to give up on using Chromecast that day (and my other devices, including my Chromecast controlling device connect up just fine).The Netflix movie selection apps and movie play controllers are horrible.  They should have taken the trouble to make user interfaces or HUDs that display on the TV, because cell phones and small tablets are too small (the touch screens) for the interfaces provided.  Responsiveness is terrible.  You can never stop or pause where you want to because it takes about 5 to 30 seconds for the system to react... unless there has been a total disconnect and the movie continues playing along no matter what you do.  The slider on the progress meter has resolution that would be laughed at in any computer application.  For a 1:40 movie, the resolution of the slider is about 6 minute increments.  If you slide it to a smaller increment than that it will just ignore your gesture.If you have a big-screen controller (supported table or whatever) and don't ever rewind, this could be a good product for you, if only it worked reliably.  I would much rather use my feature-challenged and kindergarten-style-UI Wii than this, because I can count on it that the Wii will play my movie through and respond to my commands.", "verified": true, "helpfulness": "0/0", "author": "Blaine A. Simpson"}, {"rating": 4.0, "review": "I wish this did a little more than what it does, I am still discovering what its possibilities are, but, I wanted it to be able to cast tv shows to my TV from my desktop via wifi, I cut the cable for TV a long time ago and I use only internet for my ROKU (which does most of what the Chromcast does other than using the cast from the phone or Desktop) I have found a website that I can get any TV show the day after it has aired. I think there is a way to cast that to my TV.. If that works, this will get 5 stars", "verified": true, "helpfulness": "0/0", "author": "M. Swilley"}, {"rating": 4.0, "review": "So far I love my Chromecast!  It was easy to setup and very easy to work.  I'm not a very tech savvy person, but even I didn't have an issue connecting this to my TV and then to my tablet to cast my apps.The only thing that could improve it, is if it could work from a mobile chrome browser as well.  Since not all apps are compatible with Chromecast yet and you cannot cast from a mobile browser it does require use of a computer sometimes (if you wanted to watch tv from abc.com or cbs.com or something).But overall it's a really good investment for only $35...it makes your dumb TV into an almost Smart TV.", "verified": true, "helpfulness": "0/0", "author": "BN 2014"}, {"rating": 4.0, "review": "This product is great for streaming Netflix and Youtube. It's easy to set up for the first time and simple to switch between rooms with no hassle. I was hoping for this to have more features, especially with Android products, as of now the streaming is extremely limited but great for Netflix users.", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 1.0, "review": "I could configure it, but it never connected to the internet despite every computer and cell phone in the house working.  Spent days working on it and it never worked.", "verified": true, "helpfulness": "0/0", "author": "shutterbug"}, {"rating": 3.0, "review": "Depending on your needs, Chromecast is a nice little gadget.  As a Roku owner, I may be making an unfair comparison, but the lag when casting a chrome tab, some glitchy firmware (although updates are improving the experience), and the \"static-y\" background noise the device makes in the background when powering via the usb (versus the AC adapter) are annoyances.  We use as a supplement to the Roku, so I can live with these issues, but if you're looking to buy one device as your \"do all\" to help you cut the cord, Chromecast is not that device.  Chromecast is best used as part of a multi-device solution to abandon cable.  Roku + Chromecast + HDTV Antenna (like a Mohu Leaf) will give you everything you need to finally make a clean break.", "verified": true, "helpfulness": "0/0", "author": "Nicholas S."}, {"rating": 2.0, "review": "Honestly, I wanted to love the chromecast but it just isn't versatile enough. I stream netflix from my phone, and thats about it. I cant cast a tab from chrome on my phone, and when I cast a tab from my laptop, the zooming and formatting arent right. Chromecast needs to support more apps and operate more smoothly like airplay.", "verified": true, "helpfulness": "1/1", "author": "Brian C."}, {"rating": 5.0, "review": "I really wanted to buy this product and amazon was the right place to do that. I love it and it is so easy", "verified": true, "helpfulness": "0/0", "author": "Agnesa"}, {"rating": 5.0, "review": "I bought this as well as the Unlock the power of Chromcast book for my daughter and she has told all her friends about it.  Great product for very little money.", "verified": true, "helpfulness": "0/0", "author": "Gregory C. Durphy \"greg70d\""}, {"rating": 5.0, "review": "This product does not require a lot of details to know  is excellent. this is my second one as the first i gave it to my brother, and we are both very please with.", "verified": true, "helpfulness": "0/0", "author": "Adalberto Vargas Abreu"}]