[{"rating": 1.0, "review": "Well isn't this some crap?  Chromecast page says works with Chrome on Windows ... PERIOD ... just like Obama said!After I get it and start the setup procedure I am told it is only for Win 7 & later ... I have Vista ...Nothing I can see on product page about no Win Vista!Now what ... Hold it until I upgrade?  Send it back?  Scream about it online?Waiting to cool off first!", "verified": true, "helpfulness": "3/6", "author": "James Glidewell \"Jim Glidewell\""}, {"rating": 1.0, "review": "I really was expecting a lot more from it after so much advertising. I can only transfer to TV videos from Chrome and Google products. I don't think that worth it. Be aware!", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this because I'm lazy.Easy to set up and use. Works with mobile devices. Works with pc and mac. Can even finagle it to work with Amazon Prime -- although it's not yet supported and timing kinks need to work out.Overall, I'm very satisfied.", "verified": true, "helpfulness": "0/1", "author": "Doodle"}, {"rating": 4.0, "review": "Need more APPS, but great for Netflix and Music! I would recommend for anyone who doesn't want to spend more money on a ROKU as long as they expand their app development.", "verified": true, "helpfulness": "0/0", "author": "Arkosch"}, {"rating": 5.0, "review": "Just got this in the mail today... All I can say is that I am in love!!! A great cheaper alternative to viewing netflix and other things without paying $100's of dollar on a console! We'll worth the $30!!!! Hope you enjoy!!!", "verified": false, "helpfulness": "0/1", "author": "brian"}, {"rating": 5.0, "review": "Worked perfectly right out of the box. Took only a couple of minutes to set up and minutes later I was watching YouTube videos on the big screen. I've used it with Netflix and Pandora also with no problems.", "verified": true, "helpfulness": "0/1", "author": "Gary"}, {"rating": 5.0, "review": "It works just as stated, and I'm confident that google will someday expand the apps it's compatible with. If you're looking to add smart features to a dumb TV, this is a really good option. Chrome tab mirroring is also somewhat useful. Ultimately the end user has to find a way to make this dongle useful, because it's kinda a novelty right now.", "verified": true, "helpfulness": "1/2", "author": "Michael T."}, {"rating": 5.0, "review": "Simple. Cheap. Easy. Especially if you only use netflix and youtube. Works well with my IPad and IPhone. Great for TVs in bedrooms that you don't want to upgrade to SMART TVs or Apple TV.", "verified": true, "helpfulness": "1/2", "author": "USFARM"}, {"rating": 5.0, "review": "For its price it is the best extra media experience you can buy. It is very quick and easy to get setup and running. This is also a big hit at parties. Get all your guests on your next work, show them the app, and just watch all the random and fun music/videos get played!", "verified": true, "helpfulness": "1/2", "author": "Remington"}, {"rating": 3.0, "review": "It's OK but Roku seems to be faster at streaming. Still, it works fine and the price is good. Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Wintersun"}]