[{"rating": 5.0, "review": "installed in minutes.  Makes viewing netflix, youtube and podcasts really easy.  I can even send from my phone.  So easy even my wife is using it.", "verified": true, "helpfulness": "0/0", "author": "duane st. martin"}, {"rating": 4.0, "review": "This is a great item but I do have issues with it staying connected to our network. It works as elected once connected.", "verified": true, "helpfulness": "0/0", "author": "Scott Para"}, {"rating": 5.0, "review": "Received as Christmas present.  Instructions said wouldn't work with XP.  Son updated firmware on my wireless router, and the Chromecast works perfectly with XP.  Great pic and sound.", "verified": true, "helpfulness": "0/1", "author": "WalterGA"}, {"rating": 5.0, "review": "chrome has outdone its self, this little gadget makes wonders, I love how I can control what I watch. cable! what cable?", "verified": true, "helpfulness": "0/0", "author": "lopez samuel"}, {"rating": 5.0, "review": "This is a nifty little device. It was fairly easy to hook up and use. There's an app for the phone and also a plugin for the chrome browser. This second part allows you to send anything you are watching/looking at in your browser on to the tv.It can sometimes hang a bit (as expected) if your wifi signal isn't the strongest.", "verified": false, "helpfulness": "0/0", "author": "BFrank"}, {"rating": 4.0, "review": "I like my purchase of the chromecast. It was easy to set up and easy to use. I just wish I was not so limited it what can be seen through this player. Wish it supported more streaming", "verified": true, "helpfulness": "0/0", "author": "Marci Robinson \"music lover\""}, {"rating": 4.0, "review": "Was surprised by how good the resolution on my tv came in with this device. Small investment for streaming videos effectively off the internet.", "verified": true, "helpfulness": "0/0", "author": "Frank Cselovszky"}, {"rating": 5.0, "review": "I like to use Chromecast to cast web videos from websites that do not have Chromecast supporting apps. This is not possible for now. Instead, I would have to use my laptop and stream directly from there which slows down my laptop processing power.", "verified": true, "helpfulness": "0/0", "author": "Ahmad Nasser \"Hungry for the Truth\""}, {"rating": 5.0, "review": "It's really great product . I like it .It new expierence for me and I will get aunder one as a gift to my friends.", "verified": true, "helpfulness": "0/0", "author": "Maitham"}, {"rating": 4.0, "review": "google chromecast is great. Really easy to set up. Download video apps to your phone and stream to your tv!", "verified": true, "helpfulness": "0/0", "author": "Kieke Gomez"}]