[{"rating": 5.0, "review": "Easy to install and use; watching shows that we can't get on satellite TV; very satisfied with item and performance", "verified": true, "helpfulness": "0/1", "author": "Todd Smith"}, {"rating": 5.0, "review": "It works.  Very simple to set up and use.  Works as expected.  Can use any place that has wifi and that you don't have to login to the network through a browser window. ie not hotels. Have an hdmi for that purpose", "verified": true, "helpfulness": "0/0", "author": "PuterGuy"}, {"rating": 4.0, "review": "Good price, performs well and I appreciate the mobility of it.  Works well for me especially on my otherwise unused Tv.", "verified": true, "helpfulness": "0/0", "author": "Kelv"}, {"rating": 4.0, "review": "The simplicity of this device and its price is amazing.  However, the performance seems to be less than stellar.  Unless you choose 480p (instead of 720p) it will occasionally disconnect or it will be jerky.  And I have a high quality 5Ghz 802.11n WiFi access point - and both the Chromecast and my laptop are only 3 meters away from each other.It would be great if other applications could connect to the chromecast... like VLC.  I also don't like how it adjusts the Chrome window - if I have the window maximized, connecting to chromecast will adjust the window a tiny bit.", "verified": true, "helpfulness": "0/1", "author": "JB"}, {"rating": 5.0, "review": "Very easy to set up. I find I am using more than my Sony Google TV box. It is very handy to control from my Samsung S4 phone. Netflix and You Tube work great.", "verified": true, "helpfulness": "0/0", "author": "Henrik B. Rasmussen \"Rik\""}, {"rating": 5.0, "review": "Small, portable way to get access to Netflix, etc on your tv via your iphone or ipad. Great price- $35!", "verified": true, "helpfulness": "0/0", "author": "Janet Palladino"}, {"rating": 4.0, "review": "Pros+ As long you have faster connection over 6mb is nearly no lag+ Fully mirror PC+ Great youtube apps for phone (can search and pause)+ Small and compact+ Amazing price for what you getting+ Have a lot of potentialCons- Require a power adapter- No MIrror support for Android- No Chrome Browser support for Android- Can't play own music or video from the phone.- Lack of appsOverall I think is 3 1/2 stars but for the price is hard to beat so is worth of 4 stars, wish the android wasn't so limited. it got so much potential.", "verified": true, "helpfulness": "1/1", "author": "Richard"}, {"rating": 2.0, "review": "Not so usefulWorks good only with youtube.Need to works with all the media players and formats.Wish it was batter", "verified": true, "helpfulness": "0/1", "author": "tomer blumshtain"}, {"rating": 5.0, "review": "I like the size and that you can cast from your tablet,phone or computer.i will be buying another very soon.", "verified": true, "helpfulness": "0/1", "author": "Maurice Greer"}, {"rating": 5.0, "review": "Chromecast is the best $35 you'll ever spend on ANY electronic gadget. Ever. Google Play Music, Google Movies & TV, YouTube and Netflix all stream flawlessly to your TV from your phone or laptop. This device delivers absolutely everything Google promises and performs well above my expectations for such an inexpensive device. Every TV should have this amazing device plugged into it. Setup is a breeze and you will not be disappointed. Chromecast is a highly recommended addition to any home theater system.", "verified": true, "helpfulness": "0/0", "author": "Larry H"}]