[{"rating": 5.0, "review": "Amazon has really hit a home run with this device.  The hardware design is beautiful, the interface is attractive and easy to navigate, voice search allows you to quickly access content and it loads movies extremely quickly and plays back in full HD through the entire viewing.My experience the other night really drove home how compelling this device is:  I had a hankering for a certain Nicholas Cage movie (title obscured to protect the innocent), so I \"FIREd\" up the box.  I grabbed the remote and used the voice search to find the title, which came up instantly and was available for free via Amazon Prime Instant Video.  I clicked play and the video started within 2-3 seconds, in beautiful HD.  I was so happy with how fast, easy and satisfying this streaming video experience was I nearly couldn't believe it.  From when i clicked on the TV to when i started watching wasn't more than 10 seconds.  Unbelievable.Amazon's video library (surprisingly full of great content, check out their new original series) works extremely well on the device, as does Hulu. Netflix is also there along with Showtime Go (which I occasionally use).  These are all the essentials for me as I still have pay TV, but I know they've announced they're adding HBO Go and MLB.tv is coming soon too, so there is plenty of content to feast on.I would highly recommend this to anyone looking for a streaming box, and it is a no-brainer for Amazon Prime customers, given the video catalog that is available to Prime subs as part of the subscription.  Definitely at least give this thing a try.  I suspect if you try it you'll be sold on the voice search and speedy video loading by themselves, but it has loads more.  A great addition to any home entertainment setup!", "verified": true, "helpfulness": "3/3", "author": "Jesse P."}, {"rating": 5.0, "review": "So easy to settle up and use. Work s great for netflix and Amazon prime. We use it every day.", "verified": true, "helpfulness": "0/0", "author": "Nancy Szura"}, {"rating": 3.0, "review": "The only dissapointing thing is that I cannot download Apps to my Amazon Fire TV such as Drama Fever.  MBC is okay and so is Hulu Plus except that you have to pay a monthly membership which I do not want to do since I pay for Drama Fever.", "verified": true, "helpfulness": "1/2", "author": "Sandra Dyel"}, {"rating": 5.0, "review": "Got the Fire TV today. I bought this because my Sony Blu Ray player is slow in loading videos. This device (Fire TV) is lightning fast in loading videos. The picture quality is excellent and the set up was a breeze. The only thing I have noticed is that if you are watching a video that you've watched before and not finished there is no option to start the video over; only to resume. Not a big deal. If you are big into Amazon video (like I am) then this decision is a no brainer.", "verified": true, "helpfulness": "1/1", "author": "C Todd Robertson"}, {"rating": 5.0, "review": "I love movies.  I like movies in IMAX or giant screen theaters better.I have subscribed to Amazon Prime once before.  It was so clunky, I let it lapse.  I decided to give Fire TV a go.This is a game changer.Amazon is still light on the Amazon Prime content, but the ease in selecting streaming video via Amazon Fire TV exceeds the mediocre Amazon Prime content.I don't need broadcast television, just an Internet feed.I hate commercials and I'm in the documentary film biz.  You do not see commercials or can fast forward past the public service announcements.Search ease, good.  It's a first swipe at a search, you have to hone in if a series pops up in the search.Highly recommended after three weeks.My only complaint is that the device does not turn off in a half hour as promised.  I bought a Belkin power strip that turns off peripherals after power off on the TV.  This was easier than wading through the Amazon corporate support options.", "verified": true, "helpfulness": "2/2", "author": "Michael SB"}, {"rating": 4.0, "review": "I was disappointed that there were not as many primetime movies and TV shows available. There should be more movies and TV shows available for prime members. The voice control was an excellent feature. Selections came up fast.", "verified": true, "helpfulness": "0/1", "author": "DAVE JACQUES"}, {"rating": 4.0, "review": "I love the amazon fire TV! Great for the dorm room, my only complaint is I wish I could connect a DVD player to it or it had one built in, but other than that it's awesome!", "verified": true, "helpfulness": "1/2", "author": "Christine"}, {"rating": 5.0, "review": "It was so easy to hook up even I could do it!  Has lots of things to watch.  I was hoping to be able to watch current news but have not figured out how to do that yet.  I'm sure I will use this a lot.", "verified": true, "helpfulness": "0/0", "author": "Sheila D. Despain"}, {"rating": 3.0, "review": "I have had this box for almost one week. The only thing that works is Pandora and IHeartRadio and the screen saver with Cloud. I can watch movie trailers but when I go to watch anything I either get a blue screen or black screen with everything but the picture. I have tried wireless and direct connect. I have reset moden/cable. I have plugged and unplugged and even received a second Fire TV with no luck. I have high speed internet at 30 Mpbb and a Vizio HDMI/HDTV - tech support has been working with me and says everything looks ok from their end and they assure me my computer has nothing to do with this box. I am at my wits end here and hope they can figure out what is happening. Tried a new HDMI (cheaper one) and I got a brief glimpse of a movie until it when blue again. This is insane!!!!", "verified": true, "helpfulness": "3/7", "author": "M. Wabich \"Freespirit715\""}, {"rating": 5.0, "review": "Let's get to the point. Here's my profile and then you can decide whether or not the review I'm about to give means anything to you:- Prime customer for years- Zero knowledge about hacking or jail braking- No other streaming services- No other streaming boxes- No game stations- TiVo and Comcast user- Rare Internet streamer- No tablet but I do have a laptop- 60\" 3D plasma TVI have tons of TV and movies that I (like to) watch but I get frustrated with accessing my Prime Video account either through the TV app or the cable box because each is sloooooowwwww to respond (tough the stream itself is great).Suffice to say I simply love this thing. Could not have been easier to set up and to queue shows and movies.  Biggest selling points to me are:- Prime account already set up on box- Interface is similar to Apple TV (easy)- FAST! Not only in the interface but also in the connection and streaming- Amazing image and sound quality- The voice search is nice and seems to work great but I've not really used it to great length yet.All the other streaming options on the market were either too slow, too limited, or too unpolished.And that's all I have to say about that.  I don't care about games and when I care enough to watch something over the Internet on my TV, I'll use Plex someday (which I got for 99 cents). Until then my needs are met.", "verified": true, "helpfulness": "5/5", "author": "Ultraaman"}]