[{"rating": 1.0, "review": "Took forever for me to set up, between getting the Chromecast to connect to wifi network, to getting it to work with the TV, to getting the iPad app to recognize the stupid thing. Worked all of once with the TV- we watched an episode of Star Trek on Netflix- then when I went to connect it with my iPad again, the iPad app wouldn't recognize.I had to go in and muck around with the wifi router settings to get it to work that first time. Not interested in scouring the internet for solutions every time I want to watch Jean Luc Picard of the USS Enterprise.Don't buy this, unless you like stress.Gonna check out either the Roku or the Apple TV instead.Boo Chromecast, boo.", "verified": true, "helpfulness": "1/3", "author": "Julie K"}, {"rating": 3.0, "review": "It worked well in the first few weeks.  No lagging, picture was in perfect HD.  After less than 2 months, my Android app couldn't see it.  I had to restart the router...worked some more days and disappeared from the Chrome cast app again.  Not reliable so it's back on the shelf now.", "verified": true, "helpfulness": "0/0", "author": "H. Ho"}, {"rating": 1.0, "review": "After following the instructions, and trying to get my laptop set up to work with it, I finally gave up in disgust after an hour.  I'm donating mine to Goodwill - maybe someone with Google products will want it (I am not an Android devotee nor an Apple fanatic).", "verified": false, "helpfulness": "1/2", "author": "CO Finn \"engineer\""}, {"rating": 4.0, "review": "Had problem getting audio working. Had to reset Sharp Aquos TV audio setting to factory to get it working. Still it a cool idea :)", "verified": true, "helpfulness": "0/0", "author": "Vamsi V"}, {"rating": 5.0, "review": "great device for watching videos, movies, series, radio, tv, you can also see your browser on your tv, google did your tv is smart with this device", "verified": true, "helpfulness": "0/0", "author": "Jose Azocar \"jalejo\""}, {"rating": 4.0, "review": "You can now combine a small, light inexpensive piece of hardware with Google Chrome, and your smartphone, laptop or many other portable computing pieces to find video streaming online, and play it in high definition on your television on your home wifi network. It eliminates the pain of using cables, but allows you to use a browser to find and log into services you may already subscribe to or are publicly available online.Your wifi bandwidth is the limiting factor. Streaming can be choppy, but no so on our network with Chromecast.Setup is extremely easy. I got several TVs in our home set up within 10 minutes. Its a matter of plugging in the hdmi device, powering it up, finding the proper source on your TV then following the directions.My only issue is that its inconvenient on TVs that don't have enough hdmi inputs. You may find yourself manually multiplexing what you plug into your TV hdmi ports if you've already filled them. I have one TV with only one port so I have to multiplex the Chromecast with the cable input.Don't hesitate, this could open up your video viewing world broadly, and change your mind about how you pay for video services!", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 3.0, "review": "Cool idea but it seems that you need subscriptions for pay services to really make use of it. When mine is streaming, it has a mind of its own, and likes to show YouTube stuff of its own choosing even after powering down the tablet supposedly controlling it. Maybe I haven't figured it out yet, but I cannot stream from my tablet no matter what I try. Great for watching YouTube! Think I'm gonna invest in the book available on Amazon....", "verified": true, "helpfulness": "0/0", "author": "Lee S."}, {"rating": 5.0, "review": "FOR GOD'S SAKE GET ON IT AMAZON! YOU CAN CHROMECAST EVERYTHING I PAY FOR PRIME AND I WANT TO WATCH AVENGERS ON MY TV NOT MY KINDLE.GET IT TOGETHER", "verified": false, "helpfulness": "2/4", "author": "Annie"}, {"rating": 4.0, "review": "i like it alot, the only thin i wish was if it would read my music off my ipod, it also seems to crash once in a while on youtube", "verified": true, "helpfulness": "1/2", "author": "Josh"}, {"rating": 1.0, "review": "Unit was complicated to program. instructions were not easy to locate and it seems to be written for people that were familiar with the unit. not. Even after I got it install unit still does not work properly . Not recommended.", "verified": true, "helpfulness": "2/3", "author": "jose gomez"}]