[{"rating": 5.0, "review": "Great for turning an older TV into smart TV to stream Youtube, Netflix or Chrome browser to your TV. Easy setup, low cost.Only con: needs more apps.", "verified": true, "helpfulness": "0/0", "author": "Nic Simac"}, {"rating": 1.0, "review": "Great concept WEAK support...only supports Utube, Netflix, HuluNo real support for iOS other than setting upHope they will support more Apps soon and better support Chrome browser in iOS", "verified": true, "helpfulness": "0/1", "author": "MEM"}, {"rating": 5.0, "review": "It works Excellent for a great price, good for GoogleThat's all that i need for using netflix and Youtube", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 4.0, "review": "Chromecast was fairly simple to set up and use. The battery power drain on my ios device is extremely minimal when using. Also, I found it to work great from the Chrome browser on my MacBook Pro. The price is ridiculously competitive (why I decided against Apple TV). 4/5 only because the list of compatible apps is so minimal right now, can't wait to see more development on this device!", "verified": true, "helpfulness": "0/0", "author": "jf26"}, {"rating": 2.0, "review": "I have this connected through my Onkyo NR616, which is connected to my non-HDMI TV via an HDMI > DVI cable.  My cable box and Roku display just fine via this method.  The Chromecast does not.  I get the sound through my receiver, but no video.  As I have a Roku already, I bought this because of the low price and the novelty (and I thought the auto input switching would may for a better way to fire up Pandora from my phone).  So while it does work for that particular use case, with no video, it's really just a novelty at this point.  It's a slick package and a great idea and I hope there will be more content available when I replace my TV with one that can accept HDMI.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "Expected it to work on all HDMI capable tvs but surprisingly a 3 year old Vizio wasnt having it. I tried both Vizio support and Google support. Neither group found a solution. Still give it 4 stars since it works like a charm on the other tvs. like others waiting patiently for true dlna support so i can stream from local computer.", "verified": true, "helpfulness": "1/1", "author": "jg amazon & tech addict"}, {"rating": 3.0, "review": "It's a useful product. It's been more than a month I've been using it. But initially, the set up was very hectic as the chromecast was not detected by my new Samsung LED TV. I had to reset it a lot and finally it got set up. So I haven't touched it or taken out ever since.", "verified": true, "helpfulness": "0/0", "author": "SSth"}, {"rating": 5.0, "review": "By far, one of the best gadgets I have. Mi kids love it. We have one for every TV set at home.", "verified": true, "helpfulness": "0/0", "author": "Alberto Rodas"}, {"rating": 4.0, "review": "I find it works better/more responsive than the built in miracast feature on some tvs.  Will be even better when it supports more apps.  For the price you can't really complain plus it's portable, should be able to use in hotel rooms.", "verified": true, "helpfulness": "0/0", "author": "Avid Fan"}, {"rating": 4.0, "review": "It does exactly as advertised at a fraction of the cost.  Since I'm an avid Netflix subscriber, this works great.  However, Google has still not released many apps in support of the player.  I'm sure it's coming, it just hasn't yet.", "verified": true, "helpfulness": "0/0", "author": "Dave Jenkins"}]