[{"rating": 5.0, "review": "Love it, easy to use. Have owned for quite a while now and have never had any problems. Usually use it to stream you tube or Netflix on our Tv.", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 4.0, "review": "Great item, fast delivery", "verified": true, "helpfulness": "0/0", "author": "Ronnie Rodriguez"}, {"rating": 5.0, "review": "Loving how cool it feels to stream from you phone and then wacthing peoples reactions. It really an awesome piece of tech!", "verified": true, "helpfulness": "0/0", "author": "Zeke Thompson"}, {"rating": 5.0, "review": "This thing is great. Im using it right now. My son likes youtube videos and we dont have an ipad so he is always bogarting my smart phkne. This lets me qeue up a few youtube videos that he can watch on tv while i can use mg phone. Its also great for netflix. And its so cheap! I would not hesitate to get one.", "verified": true, "helpfulness": "0/0", "author": "Markie Twain \"Markie\""}, {"rating": 1.0, "review": "I REALLY needed & wanted to like this. I expected to like it! I think they should have listed the modems that DON'T work with it.  I ended up having to send it back.. DAYUMM!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media PlayerWorks great for meI use this mainly to watch youtube videos (such as crash courses, TED, or Avatar TV series show) on my HDTV.  Works great on my ASUS Google Nexus 7 Tablet.  It can be plugged in HDMI slot.  It is powered by USB.", "verified": false, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Just waiting for google to broadcast stream live TV/HD stations so I can downsize my cable bill", "verified": true, "helpfulness": "0/0", "author": "jmoriart731"}, {"rating": 1.0, "review": "Can I give 0 star rating for this thing? This is the worst thing ever bought, it connected for about a week, then disconnected by it self. I been trying to re-connect it for about a month now with no luck. In the Chrome forum for this device you will find hundreds of people with the same problem. Very disappointed with this buy!!!", "verified": true, "helpfulness": "1/2", "author": "Angel L Ledesma"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "LARRY WHITE"}, {"rating": 5.0, "review": "I got this for Christmas, and I've got to say, best gift ever. Although it may not seem like a big deal, copying movies onto a usb drive takes forever, and with this, all I have to do is stream it directly from my computer to the Chromecast. Don't waste your money on Apple TV or Amazon Fire, get Chromecast. It's cheaper than it's competitors and has a lot more convenient features.", "verified": false, "helpfulness": "1/1", "author": "Brandon \"Brandon Stump\""}]