[{"rating": 5.0, "review": "Using it with Plex is an absolut blast. Optical out also works in that case. Love it!", "verified": true, "helpfulness": "0/0", "author": "The B."}, {"rating": 5.0, "review": "Wow. ..sooooo much better than cable tv", "verified": true, "helpfulness": "0/0", "author": "Elias Soto"}, {"rating": 5.0, "review": "Love the additional apps, music, movies and videos I have access to.  Brought my SmartTV  to a better TV experience.  Fire TV definitely rocks.", "verified": true, "helpfulness": "0/0", "author": "lgcarp"}, {"rating": 5.0, "review": "Works perfectly! Combines all the online streaming features I need in one place, NetFlix, HuluPlus, Youtube, Twitch and by installin the Plex app you can even use it to stream media from my Laptop! Remote feels awesome, it is quick and responsive. Considering buying the Gamepad as well and having a go at some of the games. Only thing I wish it could do was search Apps like Netflix when you use the voice command on the remote control (which is awesome btw). Unfortunately that feature only seems to search the Amazon library.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 4.0, "review": "Got this with Christmas money while it was on sale. First, I have no satellite or anything....my internet is my main source of entertainment. I also live in a rural area and I'm forced to use satellite internet (I have Excede). I love all the content that's available! Very easy to use and set up, fast streaming and quick loads for basically anything. I use this for music, movies, tv, you name it! Con though....It has no \"off\" switch. Was clearly designed for an urban area with access to cable or fiber for an ISP. If I leave it on, it will eat up my data limit of 15 gigs in three days just with updates, so I have to unplug it when I'm done. All in all a fun product!", "verified": true, "helpfulness": "0/0", "author": "Tomlyn E. S."}, {"rating": 5.0, "review": "Fire Tv works flawlessly like the remote a lot and was very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "marc ferretti"}, {"rating": 4.0, "review": "it makes me happy to be able to wacth movies from my bed room, i love the amazon fire.", "verified": true, "helpfulness": "0/0", "author": "Isabel"}, {"rating": 5.0, "review": "2 things I wish it had ...1 is a browser and 2 voice command for youtube ...like it has for amazon.BTW the voice command works flawlessly..", "verified": true, "helpfulness": "0/0", "author": "Bruce Belmer"}, {"rating": 5.0, "review": "I love this product.  It is the best streaming device I have ever owned.  It's quick, stable, and does not freeze up to the point a restart is required. I can quickly watch amazon, hulu, and Netflix which enabled for me to cancel my cable. .  I am also a prime member.  I can play prime music on this.  I also uploaded 6k pictures to the amazon cloud and display them as my tv screen saver.  Amazon is one of my favorite companies right now.  Prime for $100 per year is a great deal.  I used the free shipping, free music, free cloud storage, and free videos from this benefit.", "verified": true, "helpfulness": "0/0", "author": "Kevin Simmons"}, {"rating": 4.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Christopher Wilson"}]