[{"rating": 5.0, "review": "Chromecast are best thing for a wireless media system. We currently run a home theater plus 4 other TV's in my house. We have one media server in the home theater but we are able to watch the same media on any TV in the house thanks the Chromecast.We purchased our first Chromecast a while ago when it was first coming out and only Netflix had a built in plugin to cast it to your device, since then they have added so many new plugins (including WatchESPN app).  These plugins easily work from your IPad or IPhone device. With so many plugins and apps, we are able to use our IPad as our main remote, pick a show on one the apps, then easily cast it to any of our Chromecast.We currently have a Chromecast for every TV in our house (5 in total) and are able to send our media from our media PC, IPad, IPhone to any TV in the house just by selecting which Chromecast we would like to use.We use this mainly with our Plex Media Server, Hulu+, Netflix, Watch ESPN App, NFL Redzone.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "A bit hard to use, but does the job", "verified": true, "helpfulness": "0/0", "author": "S. Phillips \"Stan the Moose (Amazon lover)\""}, {"rating": 5.0, "review": "I now have 3 of these, 1 for each TV monitor.", "verified": true, "helpfulness": "0/0", "author": "dickmeyers"}, {"rating": 3.0, "review": "Its really hard to cast, and is way better a cable HDMI is more simple.", "verified": true, "helpfulness": "1/1", "author": "gabriela herrera"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Miguel G."}, {"rating": 5.0, "review": "I prefer this to the Apple TV, as there is no remote or multiple screens that one must navigate inside of the apps.  Will be looking to sell my ATV and replacing it with this sometime in the future.", "verified": true, "helpfulness": "0/0", "author": "Kathie Ann Pfaffle"}, {"rating": 5.0, "review": "Love my Chromecast. This was actually my second one that I purchased. Some of the window phones allow you to stream through their 4g service which is much faster than my laptops wireless. When sharing content among friends on a larger screen, it's a must have. I still use my PS3 to stream Netflix and such, but this is a nice addition to any home theater.", "verified": true, "helpfulness": "0/0", "author": "Annabelle Randall"}, {"rating": 5.0, "review": "wish amazon and google to work something out to stream the prime tv shows to my tv without having to buy another stick!", "verified": true, "helpfulness": "0/0", "author": "Toper"}, {"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/1", "author": "Hanna"}, {"rating": 4.0, "review": "Chromecast is great just like everyone else will tell you. I will say that it always has a harder time loading a video than any device casting the video to chromecast.", "verified": true, "helpfulness": "0/0", "author": "Christian"}]