[{"rating": 3.0, "review": "Netflix works ok.Youtube has bugs were it freezes very often.Needs more Apps.It's a bummer I can't use it with my VPN. It uses google's DNS severs.", "verified": true, "helpfulness": "1/2", "author": "Alfredo Chapela"}, {"rating": 5.0, "review": "This product chromecast is very useful because you can movie in you tv through streaming media player, very good item.", "verified": true, "helpfulness": "1/2", "author": "josehp"}, {"rating": 5.0, "review": "Like it a lot, great for family google hangouts, mindless entertainment and etc.  might be a problem if you don't have enough hdmi inputs", "verified": true, "helpfulness": "1/2", "author": "Will C"}, {"rating": 5.0, "review": "No fuss, no hassle.  It took me about 20 minutes to figure out how to get this going with my laptop - you have to install the Google-cast to the Chrome web browser and then you are off and away.This is not as iPad friendly as I was hoping, but I imagine that will change here with an app update soon.All in all. for $30.00, this is the cheapest way to stream to your tv!", "verified": true, "helpfulness": "1/2", "author": "jedi008 \"jedi_008\""}, {"rating": 4.0, "review": "The Chromecast is slick, and for the price you can't go wrong.  One thing I have noticed is that it doesn't do well handling connection interruptions or periodic reduction in speed/bandwidth on the wireless network.  My router can sometimes be finicky and instead of buffering or pausing a video, the Chromecast usually stops entirely and crashes the app that's controlling playback.  I understand this is entirely my issue with the router (hence the still 4 star rating) but the error handling and/or buffering process could be improved, in my opinion.", "verified": true, "helpfulness": "1/1", "author": "tylerscochran"}, {"rating": 5.0, "review": "Bought this for my son-in-law, as an early Christmas gift.  Hooked right up to his tv with no problems.He loves it.Thank you", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "What else to say? This has rendered my Xbox 360 completely obsolete. Until I'm ready to purchase the newer Xbox (I never get them in the early phase anyway) I can remove my xbox live account and save the money. This is easily controlled by an iOS or Android device and streams with perfect video quality. I'm thoroughly impressed. I bought it, set it up and it updated immediately to the newest software and works great. The video quality is clearly higher than streaming from my xbox also.", "verified": false, "helpfulness": "2/4", "author": "Dragon archer"}, {"rating": 3.0, "review": "But stopped casting several times in the middle of a drama episode. Please fix this soon. I really would like to have an app that I can cast my local videos.", "verified": true, "helpfulness": "0/1", "author": "Ellen Kuk"}, {"rating": 4.0, "review": "Pretty handy little item. I do wish it had some more that it could stream though. I will say that it is well worth the 35$ asking price.", "verified": true, "helpfulness": "0/1", "author": "Melissa"}, {"rating": 5.0, "review": "Very handy product! Easy set up. Cast several apps from your phone (YouTube, HBO to go) and almost anything from your Chrome browser to your tv.", "verified": true, "helpfulness": "0/1", "author": "Jan M."}]