[{"rating": 5.0, "review": "Great little device!", "verified": true, "helpfulness": "0/0", "author": "Michael E. Shaw"}, {"rating": 5.0, "review": "Works great...no more DISH", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 3.0, "review": "I would have given this 4 stars if it had a power switch.  I am using this on an older TV with a HDMI switcher.  As long as the power is on the unit the HDMI input is switched the Fire TV.For the price it is a good unit.  It has no issues streaming the videos. It has a good clean user interface. The voice search is interesting but it only works for Amazon streamed content.  So if you are looking for a movie on Netflix it is of no value.", "verified": true, "helpfulness": "0/1", "author": "J. Soper"}, {"rating": 5.0, "review": "Outstanding device for the money. Highly recommend it to cable cutters. More features and power than the existing competition.", "verified": true, "helpfulness": "1/1", "author": "Robert J. Berg"}, {"rating": 5.0, "review": "Great valiue and outstanding performance.  I installed XBMC (because Fire TV is a open platform).  XBMC works perfectly and performs much better than the G-Box.  I attribute this to the processor speed and memory in Fire TV Box.  Simply speaking I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Jerry Hodgen \"Elvis G Hodgen\""}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  After I figured out how to connect it to my TV, which wasn't difficult, we began enjoying it right away.  My granddaughter really likes all the games she can play.  We bought the bundle package so she could have the game controller too.  We already had Prime, so we are watching many TV programs as well as movies.  I would certainly recommend this to anyone who does not want the expense of a smart TV.", "verified": true, "helpfulness": "1/1", "author": "Mary"}, {"rating": 4.0, "review": "Amazon Fire TV set-up was easy and the instructions were to the point. It is everything as advertised. So far, the voice recognition works well, but I haven't used it much.  My timing was bad as a week after I received my Fire TV, Amazon released the Fire Stick. I don't know if I would have chosen it over the set-box, but the option would have been nice. My biggest complaint is that Prime Music I've downloaded to Amazon Cloud is not available on Fire TV. I have a nice sound system throughout my home and that would really enhance the whole Amazon Fire TV experience. I hope that Amazon will rectify this oversight in the near future, without having to purchase any new hardware. Not having my complete Cloud Music Library is a definite drawback. I've been an Amazon Prime member for a few years ( also talked two of my sons into subscribing and they love it too ). Having Prime Music on my Kindle, but not on my Fire TV makes no sense.", "verified": true, "helpfulness": "2/2", "author": "William R Buchler"}, {"rating": 5.0, "review": "Excellent product. In addition to Prime TV, the Netflix app is far superior to the one built into my DVD player. Love the voice search.", "verified": true, "helpfulness": "1/1", "author": "Geoff"}, {"rating": 4.0, "review": "I haven't been able to access Netflix (I do have a streaming account).", "verified": true, "helpfulness": "0/0", "author": "Barb Blum"}, {"rating": 5.0, "review": "Awesome and powerful device. I sold my appletv 2 right away to buy another fire tv. Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Quy A Phan"}]