[{"rating": 5.0, "review": "This does everything I want a media PC to do and it's just a USB dongle. Amazing. It works great with HBO go, Netflix, and Hulu, plus you can cast a chrome tab from your mac or PC so if there's something I want to watch that's not streamable, I can open it in Chrome and watch it that way. I did have some audio issues when streaming video files from my mac, but I found out that it was an adobe plugin causing the problem.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 5.0, "review": "I absolutely love my Chromecast.  Youtube will never be the same on my computer.  That said, it is probably the most unnecessary gadget you could have, but it's so amazing!", "verified": true, "helpfulness": "0/0", "author": "Daniel Mortimer"}, {"rating": 5.0, "review": "I am really happy with this product , very useful when you dont have the smart TV. This small little device will make your normal TV asmart TV .", "verified": true, "helpfulness": "0/0", "author": "VenkataHarish"}, {"rating": 5.0, "review": "Works great!  Just waiting for more apps to work with it!  Already recommended it to 3 people who bought it!", "verified": true, "helpfulness": "0/0", "author": "Geoff"}, {"rating": 3.0, "review": "I was under the impression from the ads, that you could cast anything from your phone or tablet. Not so.Only supported apps and a kindle won't cast with it at all. But for only $35 it does have it's place.", "verified": true, "helpfulness": "1/1", "author": "kevin slama"}, {"rating": 5.0, "review": "Really an amazing device. Flawless HD replay on Netflix and HBO Go. The ability to choose your show from a smart phone is very useful.This is the first device that I have owned in a long time that made me think say \"Wow!\".", "verified": false, "helpfulness": "0/0", "author": "Alec Fields"}, {"rating": 4.0, "review": "It really makes it easy to watch Netflix or other streaming content easy.  Just find it on your phone, pad, or computer and hit the \"cast\" button and it's playing on the TV for you.  The only thing I don't like is that it doesn't have an off button, which seems to be ok but it's a little strange.  If you google \"leave my chromecast on or not?\" you will get a ton of results, it seems like the masses don't even know what to do about that question yet.  There is a small button on the side but I don't know what that's for, I guess I should RTFM eh?  Oh, back to the power debate.  I just leave it plugged in and have the usb power cable plugged into my TV, that way when my TV is on my Chromecast is powered on, and visa versa.I liked it so much that I bought one for upstairs and downstairs.Missing a star because the only time I have problems is when I want to watch youtube clips from my Google Nexus 7! You sure would think that Google would make these two play nicer, but the Nexus has a problem with Flash and I'm guessing that's where the problem lies.P.S.  This IS NOT a device that will stream a movie from your pad to the TV, it will stream something that is formatted for streaming, like any of the big video sites, youtube, etc.  Don't try to cast little Billy's birthday video from your phone unless it's already been uploaded to youtube.", "verified": true, "helpfulness": "0/0", "author": "david lehman"}, {"rating": 3.0, "review": "Works about 75% of the time.  Very frustrating device.  My phone app locks up also.  Samsung S4.  Don't recommend it.", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 5.0, "review": "If you watch Netflix, and YouTube this is the device for you. I was able to replace the PS3 for a device that uses close to no power (the PS3 was a couple hundred Watts), and which boots up in a fraction of the time that it takes for the PS3 to boot up and load either Netflix or YouTube.", "verified": true, "helpfulness": "0/0", "author": "GT"}, {"rating": 5.0, "review": "Very cool product from Google. I'm using this device extensively to cast videos from Netflix and YouTube. You can also cast your Google chrome tab including any videos that may be playing in the tab. I use this feature to cast videos from hulu (not hulu plus) to my TV without having to pay the subscription. Of course this wont help if the shows you watch are only available on Hulu Plus and not just plain Hulu.You still need to power this device with an attached microUSB power supply. Its not like self powered like a USB stick.", "verified": true, "helpfulness": "1/1", "author": "Senthil Ramamurthy"}]