[{"rating": 5.0, "review": "set up is so easy, takes maybe 5 minutes, voice search actually works, box is compact and can be moved easily. Just getting around to using all that the device has to offer, but so far couldn't be happier with my purchase.", "verified": true, "helpfulness": "0/0", "author": "angela h. randall"}, {"rating": 5.0, "review": "Recognised my Wi-Fi instantly and up a running in no time. Love the voice activation. So easy to find what I am looking for. I recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "BobCummingsTV \"Bob Cummings\""}, {"rating": 4.0, "review": "I have quite a few streaming devices:  two Apple TV boxes, one with 720P and one with 1080P; a Roku Box, last generation, with 1080P; and now the Amazon Fire TV, obviously with 1080P.  Hey, is anyone going to have 4K support anytime soon?  Well, stay tuned I suppose.Anyways, it surely is a bummer that you need so many different devices such as these, but since I'm mildly cheap, I don't want to get nickled-and-dimed every month by Netflix.  So, when I dumped their service about a year ago, I already had Amazon Prime which I use for so-called \"free\" movies, which aren't truly free and you already know why.  For first-run movies, I often rent from Apple.  At least until this point, I thought that the video from them was the cleanest and smoothest.  But the new Fire surely gives Apple a run for their money.This box is really good.  Find it on your doorstep, open it up, plug it in, and voila!  It already knows who you are and configures it for you and your Amazon account.  You don't even have to log in.  Now, that is a very nice little feature, something that even Apple doesn't do, or at least didn't do with their machines, in the past.Of course, there's always good and bad with everything, and I would imagine that there may be a potential minor security issue with this feature.  Let's say that the UPS driver doesn't deliver your new Amazon Fire, but rather pops it in his trunk and takes it home.  He then plugs it in -- after stealing other people's stuff the rest of the day -- and the device thinks that it's you, logging implicitly into your account, and bingo!  He gets free movies for awhile while you're still waiting for that delivery, looking at your watch every few minutes.  I'm sure that this is possible, unless of course the fine developers at Amazon were smart enough to track your usual IP addresses and flag a box plugged into another network.  (My guess:  probably not, since most people have dynamic IPs through their ISPs, and those IP addresses can and may change at any time.)The UI on this device is really nice, probably nicer than the modified iOS UI on the Apple TV.  But I have found one issue with this machine, an issue that, if it does exist -- I've seen it multiple times so I believe that it is -- it should be able to be fixed with an upcoming firmware update.Most of the devices on my network are plugged in through Ethernet -- I have gigabit throughout the house, with a port in almost every room -- and the Fire is no exception.  And most of the devices use DHCP, since configuration is easiest that way.  Sure, I have a few devices that have static IPs, but they would be the exception.  Anyways, I believe that, with DHCP, the standards say something like:  \"If the DHCP server reboots, and the clients do not, the DHCP server should try to reissue a temporary IP license to as many devices as possible with the same previous IP addresses.\"  I believe this is correct based upon behavior that I've seen with most clients.However, if you reboot your DHCP server -- which I do fairly often, along with the rest of my networking equipment -- this device does not get the same IP address.  As a matter of fact, it loses network connection entirely, and you must reboot it to get back on the Internet!  And peeking through the menus, for the life of me, I cannot fine a \"reboot\" menuitem anywhere.  What does this mean?  Well, if I reboot my network equipment, I also need to unplug this device from the wall and plug it back in.  Ugh.Like I said, I've seen this happen at least two or three times so it must be a bug.  For this reason, I'm kicking my score down to four.  But it might be a five if this issue is fixed in an update as the video looks really good on this box, much better than my Roku.  And probably at least as good as my Apple TV.", "verified": true, "helpfulness": "1/1", "author": "California Dreaming"}, {"rating": 5.0, "review": "This is better then any cable network i have in the past subscribed to. Its quality is top of the line.and you can switch of watching tv shows, movies, documentaries ect.... & play games. Its so simple& awesome. I really love the coins too, you can buy your games with your coins. Amazon prime isonly one hundred a year . And there s so much to watch free & with amazon prime everything you orderthrough amazon is free shipping. The quality the amazon fire & amazon fire game controller is of great quality.  I love the boxes they came in, you wont want to throw those away. I highly recommended this!", "verified": true, "helpfulness": "0/0", "author": "val"}, {"rating": 5.0, "review": "This is one of the best devices we've ever bought. It easily allows us to watch what we want, when we want. The voice control is amazing and it's very easy to find lots of free Prime content. We love our Amazon FireTV", "verified": true, "helpfulness": "0/0", "author": "Barbara Watkins \"Greatful reader\""}, {"rating": 5.0, "review": "This is a great little item for $100.  Worked out of the box super easy to set up.  1. plug in Ethernet cord from router or modem. 2. plug in HDMI cable from unit to TV, DVD etc.  3. power up and have TV/media device set to correct HDMI input.  Pow it works and knows you...  However, does not seem to be any Amazon Customer service for this device except a FAQ, as far as I've found so far.  Hope that changes.Voice recognition is top notch, always understands what I speak.  Be sure to hold down the mic button for a second or two after you finish speaking or you may get cut off per my experience.  The voice recognition  only works for search -- wish it would work for other commands but it does not.  I love being able to press the mic button and say \"Clark Gable\" and pull up everything about Clark Gable available from Amazon's cloud, such as movies, TV, whatever it seems.  Would like web media too such as some browser and it does not seem to pull up You Tube and such in searches.  But there is a free amazing YouTube app.  Really amazing Netflix and Hulu, Pandora, Redux, Espn, Smithsonian, and other apps for so many services except Comcast/Exfinity On Demand service (which is too bad for me:).  Searches seem to pull up $$charge media more than media from services I pay and while using the Amazon Apps like Netflix and Hulu.  Although it pulls up PAY programs and Amazon Prime all of the time and Hulu much of the time, it seems to ignore Netflix and other content.  Amazon needs to fix that issue imo.Controls are very easy.  Circular select surrounded by left right up down  arrow buttons, a go back button, a go to main menu button then fast forward, fast rewind, play/pause buttons and that's all.  Menu is super easy to navigate and there is an amazing selection of entertainment and games many for free.  Titles are displayed as visible icons with information below them, you flip through them like on a Mac.  By the way,  I was easily able to plug a USB hub into the device's one USB port and then plug in USB plugs for my Logitech wireless keyboard and mouse.  They work well with all app search functions and controls!  No set up was needed because it was true plug and play instantly.Its best to be an Amazon Prime customer when you use this device.  I prefer the Amazon Prime service now when using this device.  The amount and variety and content I can watch is absolutely amazing compared to before the Amazon Fire TV.  Love the games, but many require the optional game console.I have recommended this device to friends and family.  It makes a positive difference on the entertainment value I enjoy.", "verified": true, "helpfulness": "1/1", "author": "MarkB"}, {"rating": 5.0, "review": "I really only use it for streaming Netflix but I'm enjoying the other features. The voice search works great. I was torn between the Fire and a Roku and I am really thrilled with my choice.", "verified": true, "helpfulness": "0/0", "author": "ao1088"}, {"rating": 4.0, "review": "I originally gave it 2 stars, but after the update I added 2 more. Finally can add USB 3 storage, can connect with Bluetooth head set. It has a software restart. Much better it is now my primary box over the Roku 3", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own two Apple TVs and I have to say that I like the interface of the Amazon Fire TV better. It was easy to setup and the remote has more options than the Apple TV remote. This also has games and apps and even an app for Plex, which is a media server you can use to store all of your *.mpg, *.mp4, and *.avi movies. If that makes no sense to you, just ignore it but know that it means you can do more with the Amazon Fire TV than just watch Amazon Prime, Hulu, or Netflix on it. I highly recommend this product, even over Google Chromecast.", "verified": true, "helpfulness": "1/1", "author": "RM"}, {"rating": 5.0, "review": "I really like the Amazon Fire TV. Love the voice-activated remote, how easy it is to find apps, the selection of apps, ease of installation, and compactness of the product. I will say that with the voice command, if you just start up Amazon Fire TV it will automatically take you to a show or movie on Amazon Prime. You need to be in an app (like Netflix or Hulu) to find a show. I really love that there's a screen savor when you pause a show too. Just found that out yesterday! There are so many other features I've yet to discover but as far as the basics, so far so good! Definitely get yours!!", "verified": true, "helpfulness": "0/0", "author": "Catherine Plautz"}]