[{"rating": 5.0, "review": "This little thing is awesome. It is crazy easy to install. Definitely one of my best purchases when it comes to technology. I love that they keep adding apps to it. It is only going to get better. Do yourself a favor and get one.", "verified": true, "helpfulness": "0/1", "author": "Juan Pablo Botteri"}, {"rating": 3.0, "review": "We just need it to work with more applications. I originally expected it to mirror the display of the phone. It did not turn out to be the case. It however works well with the few applications it supports, such as YouTube.", "verified": true, "helpfulness": "0/0", "author": "Jingbai Wang"}, {"rating": 1.0, "review": "I purchased Chromecast to be able to stream the Olympics to my TV.  My Mac is 20ft away from my tv. Chromecast can't stream longer then 2 minutes without loosing its signal and shut down.  I've tried it on multiple tv's and computers.  I've even returned it for a second unit and I get the same problems. If you check out the Chrome browser it still says Chromecast is in BETA form.  Why in the hell would they put this out if it's still in BETA.  If I would have known that I wouldn't have bought it.", "verified": true, "helpfulness": "2/3", "author": "venom93corba"}, {"rating": 4.0, "review": "If I could give this 3.5 stars I would. Don't get me wrong, it's a great product but they rushed it to market without a lot of 3rd Party Application Support. The range is decent (when used with the supplied USB power adapter) and I was able to stream movies from my Galaxy S4 and Google Chrome on my Windows 7 Ultimate system. It even works with my iMac.For the price, it's fun to tinker and I'll upgrade the rating when there are more apps. If you are looking for a replacement for your Cable Box, get a Roku 3. If you are looking for a simple way to stream media from your computer or phone, this will do the trick.To be fair, it does a great job with HBO Go and Netflix, but it doesn't do Amazon Prime, which is a huge disappointment.", "verified": true, "helpfulness": "0/0", "author": "techdude49"}, {"rating": 5.0, "review": "Was easy to set up and i connect it both to my iphone and ipod. i can watch movies and you tube on both on my 60 inch flat screen. Good sound and clear pic, no streaming issues with my internet.", "verified": true, "helpfulness": "0/0", "author": "ciriel m"}, {"rating": 5.0, "review": "I love my google chromecast.  You can stream just about anything from your computer tab and more apps are allowing you to cast what you are watching.  For the price you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Scott Safford"}, {"rating": 5.0, "review": "Works great for TVs that I don't care to or have room to setup any sort of entertainment center. I personally use Plex and Netflix on it, Plex being the primary and I couldn't get by without it. But just as a super easy Netflix streamer you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Dustin"}, {"rating": 5.0, "review": "Fits HDMI port on TV - setup is simple, and takes a few minutes. Able to view Netflix and Youtube cast from iPhone, iPad with no issues. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Randy Marti"}, {"rating": 3.0, "review": "We have not used as much as expected. Some websites have a lag in picture/audio including Amazon so we have used less than expected.", "verified": true, "helpfulness": "0/0", "author": "CVT"}, {"rating": 5.0, "review": "works so easily. sound and video go through to your tv.  bought one for myself and went back to get another for my bro.  def a good buy if you want to stream anything on your tv from computer or phone", "verified": true, "helpfulness": "0/0", "author": "Katie"}]