[{"rating": 2.0, "review": "kind of a pain to set up... and the description on amazon as well as the google website for the product is vague.  this is a device that is a transmitter only.  it does not get on the internet itself i.e., you cannot get to the web through this alone... only if you are \"casting\" from a computer... so basically you have to be running a computer while you run this... and this cannot control the computer.  basically a glorified \"projector\" to get stuff from a computer to display on a TV.  disappointed.  does far less than anticipated, and i actively looked for info on it.", "verified": true, "helpfulness": "0/1", "author": "JTS"}, {"rating": 4.0, "review": "Chromecast only have 3 options to watch streaming videos, Netflix, Youtube and Google Movies. I gave it a 4 star so if they have more options.. I would give 5 star.", "verified": true, "helpfulness": "0/0", "author": "William E. Rose \"edtide25\""}, {"rating": 2.0, "review": "Set it up, worked for 3 days then it died :(Took hours to get through to Google support who suggested restarting my router (useless and of course didn't solve the problem), then after attempting to reset the unit (which isn't documented anywhere - power it on with electric connection but take off tv then press button for 25 seconds, should stop blinking then turn red light).  After unit could not be reset (never got to red light) agent agreed unit was defective!Unit was displaying chromecast screen on tv but without \"ready to cast\" - I think the units wifi stopped working b/c it kept trying to connect (blinking white light) but never did (many other units were connecting fine the the wifi which was working).  WHY DON'T THEY DOCUMENT THE WAY TO FACTORY RESET THE UNIT?  It would have saved me hours if I could have done this earlier and found out the unit was defective!", "verified": true, "helpfulness": "0/0", "author": "warmsea \"an overeducated person\""}, {"rating": 1.0, "review": "The chromecast is great on paper - until it stops working within the first month you own it. Good luck getting anywhere with Google on support resolution. The warranty center is clearly unmanned, and there's nothing to do except contact your credit card company and reverse the charges on your card.  Don't purchase until Google gets its act together on the support side.", "verified": false, "helpfulness": "7/8", "author": "Christopher A. Smith"}, {"rating": 5.0, "review": "I like the Chromecast I use it daily. The best feature is cloud streaming, that means I dont have to have my device on to be streaming, as the content is being downloaded on demand to the device itself as the video plays. I also like the backgrounds the Chromecast displays meanwhile nothing is being casted to the device itself. The idea behind it is great, but the app support now is not the best as right now (October 5, 2013) only Netflix and Youtube are supported. All in all the Chromecast is a definite buy for anyone interested in the device!", "verified": true, "helpfulness": "0/0", "author": "JaimeH"}, {"rating": 5.0, "review": "Its a great product to use..easy to setup and compact!!Overall its a great investment and would highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "VK"}, {"rating": 5.0, "review": "Great product.  No problem hooking up and throws what you are watching on your cell phone or tablet right to your TV", "verified": true, "helpfulness": "0/0", "author": "Robert L. Henry"}, {"rating": 1.0, "review": "Will not work with hot spot service on cell phone. Worthless...didn't advertise the fact that it wouldn't work with hot spot service...", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing!  Held out buying one cuz we have an old CRT TV from 1990! No HDMI of course.  So when I found that there are devices out there that can convert the hdmi signal to analog for playback on our old tv, I had to try the converter and chromecast out (together).  Note: we bought the \"Sabrent HDMI to Composite/S-Video Converter 3RCA DA-HDRC\"  from Amazon to use for the conversion.  Works like a charm!  I did the initial set up of the chromecast using my nexus 7 tablet, (note, you can't cast (stream) webpages/videos using a tablet yet..google is working on that.  I use our desktop computer for that), but you can use the tablet for all the other chromecast features.  Anyway.... I've casted youtube videos so far, hulu plus shows so far, haven't tried the Netflix movies yet.....but have streamed (casted) lot's of misc. website videos like those on yahoo for example.  And even casted our local news channel, KTVU channel 2 news, right from their website to our analog TV using the Chrome browser which is the only browser that will work with the Chromecast.  Quality isn't bad..seriously!  Neither is the sound!  Though there is a slight delay with the words people speak (the soundtrack) is off a TAD, not much though.  Guess that depends on the speed of your internet.  Ours is pretty fast.  So.... guess we (and others) do not NEED to buy a new TV with hdmi ports in them.  We personally, love our old tv and have no desire to chuck it out just yet.  I'm glad to be able to use new technology on old technology!  We're happy.  Thanks for reading!  Enjoy your Chromecast if you get one!  They are neat!!!  :-)", "verified": true, "helpfulness": "4/4", "author": "Sanron87"}, {"rating": 2.0, "review": "NEEDS a home Wifi concretion in order to work I expected it to go from Phone to Chromecast to TV screen its a good product other wise but for the application most people want to use IE spare TV at a cabin or work ect its useless i have no need to show My phone screen on a TV at home its should be shown on the advertising that it needs a home WiFI setup to work very disappointed", "verified": true, "helpfulness": "0/0", "author": "joshua n wedell"}]