[{"rating": 5.0, "review": "Great product very reliable", "verified": true, "helpfulness": "0/0", "author": "tomd"}, {"rating": 5.0, "review": "Outstanding. device.Thank you", "verified": true, "helpfulness": "0/0", "author": "bastof"}, {"rating": 5.0, "review": "Fast response, very good picture.  However, I can't find a way to keep Amazon music playing through the optical out to the stereo and turn the TV off?  When you turn the TV off it shuts down the device and I haven't run across any setting to keep the audio alive when video is off.  Other than not being able to play Prime Music when the TV is off, works as advertised.  Doesn't shine my shoes tho'.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "Has worked perfectly for streaming TV and movies and playing games.", "verified": true, "helpfulness": "0/0", "author": "jeanie"}, {"rating": 5.0, "review": "GREAT Product..!", "verified": true, "helpfulness": "0/0", "author": "giuseppe farella"}, {"rating": 4.0, "review": "I'm a cord cutter, and bought this to handle video streaming to my TV after heavily researching the Apple TV, Roku, and the possibility of getting a streaming Blu-Ray player.  The main consideration for my purchase was that it supported Prime Video (Apple TV does not) and has optical audio.The Good:-Low profile, small, and innocuous-Easy to setup (it's already linked to your account if you buy from Amazon.com).-Super fast start times for Prime Video streaming. I mean almost instant with practically no buffering.  I understand this has to do with the internal hard drive which buffers the TV and movies Amazon suspects you'll watch.  If you are a heavy user of Prime Streaming, this is the device to have.-Comes with optical audio output, which I needed for my particular setup as my receiver does not support embedded HDMI audio (this is not common -- if you have a more modern home theater, this will likely not be an issue for you).-Remote control is excellent. Well designed, small, simple, and Bluetooth.  I'll listen to music while in the other room and am able to change the track without issue.  The voice recognition is nifty, but seems to only work with Amazon content, and not in other apps like Netflix.-Tiled-style menu is easy and pleasant to navigate.The Not So Good:-App selection and quality is limited.  The most common ones are there, but the Fire TV lags behind other devices like the Apple TV.-Some apps have occasionally disappeared from my Fire TV requiring re-installation, or my preferences/login disappears and have to be re-entered.  This has happened with Netflix and Pandora.-The built in music app for Prime Music is clunky in terms of selecting/finding music, making playlists, etc. It seems like it was rushed out. It requires constant manual attention.  It also takes an unusually long time to update the library after adding music. Yes, free music, but at the cost of being aggravated. I usually pass over it in favor of other more common music apps with better UI.-The unit does not seem to time-out or go to sleep on its own. I have to trigger it manually.", "verified": true, "helpfulness": "0/0", "author": "uh okay"}, {"rating": 5.0, "review": "Excellent streaming device. Very fast navigating menus. Simple to use and a terrific remote that also includes voice commands. I also purchased the Roku 3 to compare since all of the websites recommended it but in my opinion the Fire TV makes the Roku feel very \"last gen\". The fire does lean toward Prime in their user interface but it doesn't bother me. Netflix and tons of other apps are there as well. I highly recommend", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Great product small and compact. Also me for streaming.", "verified": true, "helpfulness": "0/0", "author": "James Adam Gray"}, {"rating": 1.0, "review": "Junk", "verified": true, "helpfulness": "0/4", "author": "justanhonestguy."}, {"rating": 3.0, "review": "To much clutter on home screen.", "verified": true, "helpfulness": "0/1", "author": "Justin Davis"}]