[{"rating": 5.0, "review": "Price will conquer satellite with a little more work.11 more words required, I don't think I need say more.Save money", "verified": true, "helpfulness": "1/2", "author": "Glenn D. Proudlove"}, {"rating": 2.0, "review": "The user interface and content selection are pretty good, but the device locks up at least once a day and must be restarted. This gets very annoying when you are in the middle of a movie or TV show.", "verified": true, "helpfulness": "1/2", "author": "JLQuaker"}, {"rating": 5.0, "review": "I ordered this because there does not seem to be anything worth watching on TV.  What a surprise when I opened the box and found this tiny little box about the size of two decks of cards.  It was hooked up and operating in less than 2 minutes.  The choices of movies and TV programs are exceptional.", "verified": true, "helpfulness": "0/0", "author": "linda lau"}, {"rating": 5.0, "review": "All in all the Fire TV is a great product. It offers all of what I was looking for, plus I got a great deal on it so I could not pass it up. The only thing I really use the Fire TV for is to run my Plex Media Server. I have used other  the apps, and I did not run into any problems (knock on wood) thus far. I would recommend this product to anyone else. Of course your still going to hear reviews comparing this to the other similar products, but trust me this is just as good if not better than the others. The only thing I don't like, which is not a deal breaker for me is the voice command does not work on different apps. Hopefully this will get address in the near future.", "verified": true, "helpfulness": "0/0", "author": "M. Wilson"}, {"rating": 5.0, "review": "I feel we literally have 200 channels on cable with nothing on.  I go to ondemand on my cable channels and I see nothing I want or want to pay $5.99+ plus on cable.I got Amazon TV and I have more options and the movie costs are cheaper than what cable charges me.It was easy to set up and with a prime membership is a good option for a Friday night at home.  It does not replace cable but it does give you more choices in viewing", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 4.0, "review": "Still trying it out. Movies are not easy to find. Menu is complicated and not real user friendly. picture and sound quality is fabulous", "verified": true, "helpfulness": "0/0", "author": "J.P. Crandall Jr."}, {"rating": 5.0, "review": "I bought this as a gift for my mom's birthday and she loved it. She uses it to watch netflix and amazon prime videos. She really enjoys it and said it's one of the best gifts she has received. I'll probably buy one for myself soon.", "verified": true, "helpfulness": "0/0", "author": "BrooklynEsq"}, {"rating": 5.0, "review": "Interface is user friendly, along with the voice search function places this a step ahead it's competitors. Installation in mere minutes! If you are considering Apple TV or Roku, both I have tried, the Amazon Fire TV tweaks both out due to voice search!!! Simply sublime. :)", "verified": true, "helpfulness": "0/0", "author": "Sean H. Conyette"}, {"rating": 5.0, "review": "I ordered the above as I was going in for Surgery.I new I could only use one hand for three month's and was not looking forward the summer reruns.I also bought Prime membership.Now I can Watch T.V. or Movies for free.The Amazon Fire TV has made my recovery more bearable.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 1.0, "review": "Plex was a launch title . And I bought it just for that. The app is an old version and only 2.0 stereo.  Very misleading . And over 2 months no fix. Voice search doesn't work with other apps. And the fire tv crashes alot and requires reboots. I got a roku 3 instead . No issues so far .", "verified": true, "helpfulness": "3/7", "author": "BigBosch"}]