[{"rating": 4.0, "review": "I bought this item at Best Buy but felt the need to review it here. This is a very good streaming device, especially if you are a prime member. Have not experienced any lag or freezing up issues whatsoever. I would recommend this to anyone who is a Prime member or thinking about becoming one, as you would be able to use Amazon Instant Video as well as Netflix and other streaming applications.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 3.0, "review": "I am a subscriber to both Netflix and Hulu Plus and we used our WII to access them for a couple of years now.  I got very tired of the slow downloads, pauses and freezes that happened frequently.  I wasn't sure if it was our modem or the WII unit that was causing the problem.  We upgraded the modem a few months ago but still had the same issues.  We were told by our cable company who provided the new upgraded modem,  that because we had an old WII, it didn't have the capability of taking advantage of the faster speeds. Uhg!So, because of that, I purchased the Amazon Fire TV.  The slow downloads are gone but I still am experiencing the picture freezing.  On the bright side, the voices continue on.:o)  Sometimes the picture catches up and sometimes it doesn't.  Not sure if it's the modem or the Fire.  Very frustrating!  If I new for sure, I would be able to give a better/worse rating.One thing I can say for sure though, I love the voice option!  Where I think  the Fire could use some improvement is on the size of the writing, maybe there is an option to increase the size somewhere?  Anyway, very tiny and hard to read.  Also, I find that the menus are not easy to navigate and are a little confusing.  If you know what you want, that voice option gets the job done but if you want to browse, it's a little more difficult.I have had this device since Christmas so I'm still getting to know how everything works.  Maybe these issues can be resolved as soon as I learn everything.  For now, I will stick with my 3 stars.", "verified": true, "helpfulness": "1/1", "author": "Dluman"}, {"rating": 1.0, "review": "As much as amazon charges to watch anything or to use any application the Fire box should have been free. I signed up for amazon prime just so I could try using the Fire and I still find most things cost around $3.99 per show episode or movie. I cannot get Netflix app to work either.", "verified": true, "helpfulness": "2/5", "author": "terrence hart"}, {"rating": 5.0, "review": "Have only used a few times. So far it is great and enjoy it very much.", "verified": true, "helpfulness": "0/0", "author": "J. Garland"}, {"rating": 1.0, "review": "Bought this because it's advertised as a gaming device, not just a streaming device. But, with only 8GB (actually 5 useable) of on board memory and no way to plug an external HDD into the useless (seriously there is no use for the) USB port there was no point in buying it. My Apple TV has a friendlier UI and I can control it from my iOS device and there is NO chance I'll be charged for ANY content since Apple doesn't have to have a credit card on file.", "verified": true, "helpfulness": "1/4", "author": "Carrie"}, {"rating": 5.0, "review": "Very sleek, fast, and a lot better than the Roku. The remote is multi-purpose, and the voice search works like a charm. When you first turn it on, it gives you a short little into video, and is already connected to your amazon account! Really cool.", "verified": true, "helpfulness": "0/0", "author": "TaylorG"}, {"rating": 5.0, "review": "This is great, easy to use! now for the however - Hey amazon consider adding purchasing things though amazon (of course ) and a bluetooth keyboard. The first  would make your power complete(amazon interface). The second would make the first better.  :)", "verified": true, "helpfulness": "0/0", "author": "randolph w crane"}, {"rating": 1.0, "review": "Many flaws with this, the display mirroring DOES NOT work with our NEXUS 7 tablet with the LATEST Android O/S. I wish I had bought an Apple TV or ROKU instead of this!", "verified": true, "helpfulness": "0/1", "author": "Vrithamani"}, {"rating": 4.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Mary Hurley \"mhurley\""}, {"rating": 1.0, "review": "I was disappointed to learn that most offers of things to watch cost money.  As a senior citizen retired and fixed income, I don't want to spend $$$ every time I( want to watch something.  Most of what's offered is old or just plain lousy.  I should have never signed up for this item.", "verified": true, "helpfulness": "2/5", "author": "leonard self"}]