[{"rating": 5.0, "review": "Setting it up couldn't have been easier.", "verified": true, "helpfulness": "0/0", "author": "Katie N."}, {"rating": 3.0, "review": "It works, but the controls are not as intuitive as they might be.  It was a gift from my son who is much happier with it.", "verified": true, "helpfulness": "0/1", "author": "Andrew Wright"}, {"rating": 4.0, "review": "I own two of these.  One is in my living room, and the other is in my bedroom.  It is very easy to pick and choose which TV to watch your program on.  I really like that my smartphone has replaced my remote control.  I am no longer looking in seat cushions to change the channel. I docked 1 star because of the software.  It can act buggy sometimes.  Minor things like adjusting volume on my smartphone cannot be done because the  TV volume adjusts instead.  1 gripe is directed at you Amazon.  I have an amazon prime membership but cannot cast your video player to my Chromecast.  It's really pathetic that you intentionally avoid allowing this so you can sell your fire stick.  Instead of that, I may stop subscribing to prime because of your very obvious deceptive tactics.  You're going to shoot yourself in the foot.  Stop trying to be greedy.  Sorry for the rant.", "verified": true, "helpfulness": "1/1", "author": "Nate \"dip dip donk\""}, {"rating": 5.0, "review": "The perfect solution for your TV!!", "verified": true, "helpfulness": "0/0", "author": "Lucas Di Marco"}, {"rating": 5.0, "review": "Have 3 in my house, one on each TV.  Perfect for taking my program with me when changing rooms since it's no trouble to switch the output to a new TV from my phone, iPad, etc.  A good add-on for this is one of the small 4-in. USB cables so you don't need to plug it into the wall, but check your TV first, older TV models may not have a USB port on them (only one of my three did).", "verified": true, "helpfulness": "0/0", "author": "StriderWA"}, {"rating": 5.0, "review": "Excellent opcion", "verified": true, "helpfulness": "0/0", "author": "Jaime Tigreros"}, {"rating": 5.0, "review": "Great price as expected.", "verified": true, "helpfulness": "0/0", "author": "M. Sproles \"M. Sproles\""}, {"rating": 2.0, "review": "This may be the most useless electronic device I have ever purchased. It doesn't do much, and what it does do is very mediocre.", "verified": true, "helpfulness": "0/0", "author": "The_Bishop"}, {"rating": 3.0, "review": "Tried to use this in an upstairs bedroom and it always loses connection.  I'm sure it probably has to do with the distance from the router, but it's not so far that I would expect the types of interruptions I experienced.", "verified": true, "helpfulness": "0/1", "author": "DAMIANO DEPINTO JR"}, {"rating": 5.0, "review": "it works nice I love it", "verified": true, "helpfulness": "0/0", "author": "oscarin"}]